{
    "0": "@Raptors @Invisalign manifesting a raptors win tonight",
    "1": "@Raptors @Invisalign Holy W",
    "2": "@Raptors @Invisalign Start Armoni brooks",
    "3": "@rIVerseLive you performed both national anthems at tonight’s @raptors game BEAUTIFULLY! https://t.co/SKnrnlA50i",
    "4": "At the @Raptors game for my girls birthday! #WeTheNorth https://t.co/0ee2jGB0Jr",
    "5": "Tonight’s @invisalign Starting Lineup https://t.co/a1TVgPrA42",
    "6": "Watching @Raptors #WeTheNorth",
    "7": "So excited to be at the @raptors game with @mzs1347 !!! #WeTheNorth https://t.co/3BwRL5rnHf",
    "8": "I don’t often finish cooking a meal so close to tip-off, but when I do, I enjoy  my pasta and cheese toast listening to @KateBeirness and @LeoRautins with excellent reporting from @Kayla_Grey \n\nLet’s go @Raptors \n\n@TangerineHoops \n#TangerineFanAngle \n#WeTheNorth https://t.co/iFQhTip6aE",
    "9": "@Cofe6370 @dyc1958 @ms_chi_town_eb @Imdatchick1985 @Naahledge @divateach37 @James_hyke14 @BIGJAMES_2 @12Chains @Raptors Yesterday was nice today snow and rain ⛈ lol now time for @raptors",
    "10": "The @Raptors will look to climb up the Eastern Conference as they welcome the @Timberwolves to town tonight.\n\n@Eric__Smith &amp; @Paul__Jones will have the call coming up next, catch #Raptors Reaction with @william_lou after the game! #WeTheNorth \n\nTune in 📻 https://t.co/kGILl2Qj0k https://t.co/qrtdtXQkmv",
    "11": "@UncleDrewGB @Raptors go get ja now😤😤",
    "12": "@NH_Gooner @AmicoHoops All 3 played this season against Raptors in Toronto when the rules were the same. It's a non-issue",
    "13": "@EdmanUp @kadenprivv @Raptors playing the wolves so easy W https://t.co/Zn8TdM1CmD",
    "14": "@Raptors A Big Heartfelt Thank You for Your Support from a long time fan 🏳️‍🌈",
    "15": "@Raptors L team",
    "16": "After their OT win vs. the Celtics Monday, The Raptors welcome the Timberwolves to Toronto.\n\nMinnesota has lost 3 of their last 4, sitting in 7th overall within the Western Conference.\n\nTip-Off 7:30pm ET\n3 Stars From Yesterday\n👇\nhttps://t.co/V0CCLj6Pgu https://t.co/GJfsaQiLIe",
    "17": "The Minnesota Timberwolves (43-33) will take on the Toronto Raptors (43-32) at 7:30 p.m. \n\n#Raptors have won three straight games and are 8-2 in their last 10 games while the #Timberwolves have lost three of their last four outings. #NBA #WeTheNorth https://t.co/WOWysGhrXS",
    "18": "NBA FREE PICK 🚨\nTimberwolves vs Raptors 🏀\n\nPreview and Prediction 📋 \n\n▶️https://t.co/yFdlMgTYqo\n\n#NBA  #GamblingTwitter #freepicks #freepick #NBAPicks \n#RaisedByWolves  #Minnesota \n#WeTheNorth    #Toronto \n#freebet #playandwin \n#nbabets #nba75 \n#NBATwitter  #basketball https://t.co/v0PcJwREhE",
    "19": "@LeoRautins @KayNurse11 @Raptors @TSN_Sports @KateBeirness 🔥🔥holding it down",
    "20": "All the way from Vancouver and Ottawa and Guelph and right here in Toronto! Raptors fans unite!\n@drawthenorth @its_a_dilini @TSquared200 @DimitrinaStanc4 \n#WeTheNorth \n#TangerineFanAngle https://t.co/lLtJlObfYf",
    "21": "Leon's is giving YOU a chance to bring home a piece of Toronto Raptors franchise history! Enter to win a one-of-a-kind coffee table, made from a piece of the 25th Anniversary “95 Rewind Court”! Don’t miss your chance to enter! https://t.co/8cQCWdW1qU",
    "22": "@Raptors let’s go raptors! #WeTheNorth https://t.co/TLCqBcEtzn",
    "23": "@Raptors @hudsonsbay They should be wearing the rainbow suits for tonight",
    "24": "@TangerineHoops @Raptors Watching the championship game with my entire family. It was the first time my parents watched a basketball game from start to finish! #TorontoRaptors #WeTheNorth https://t.co/rHwlGfOc5F",
    "25": "Timberwolves vs Raptors in Toronto\n\n@Dloading and @KarlTowns first game together for the Timberwolves was in this building",
    "26": "@Raptors LOVE THIS",
    "27": "@Raptors @hudsonsbay Let's go let's go.... yall .. aye play armoni.. put fvv on bench.",
    "28": "@Raptors @hudsonsbay Win pls😅😅😅👍",
    "29": "@Raptors @hudsonsbay win and lets scottie get more touches",
    "30": "@Raptors Nice.",
    "31": "@LeoRautins @KayNurse11 @Raptors @TSN_Sports @KateBeirness Have a great broadcast Kate and Leo 😊",
    "32": "@DarleneW24 Awesome! Go @Raptors !!!",
    "33": "@__Smithfor6 @veraccity @Raptors @ShopRSApparel @MLSEFoundation That's because he's your mom's gynecologist. She drops the same joke every time she has an appointment \"you think my p*ssy's big? You should meet my son.\" Funny lady.",
    "34": "@TangerineHoops @Raptors beating the warriors to win the championship #7DaysofGiveaways",
    "35": "@Raptors @hudsonsbay Let's goooo",
    "36": "@LeoRautins @KayNurse11 @Raptors @TSN_Sports @KateBeirness Looking Good you two! Let’s Go! #WeTheNorth",
    "37": "@Raptors @hudsonsbay Stop posting that TTC bus driver banton and cut him immediately",
    "38": "@culturejam @DailyNorthside How can #SpicyP not be on the all-star card?\n@NBA \n@Raptors",
    "39": "@LeoRautins @KayNurse11 @Raptors @TSN_Sports @KateBeirness 😃😃 cool suit Leo",
    "40": "@Raptors @hudsonsbay Why can’t we see Gary fits no more ?",
    "41": "@Raptors @hudsonsbay Play armoni",
    "42": "@casekeefer @Salas42_ @keithps22 @whale_capper @FarleyBets @JoeDellera\n@meJVT @beatingthebook\n3/29 POD: BULLS -3 ✅️\n\n3/30 POD: RAPTORS -2.5\n\nPOD RECORD: 29-13-2\n\nI got Toronto at -2.5. Read my writeup. My plays should come with a musical accompaniment.\n#WIN #NBA #NBAPicks",
    "43": "#Minnesota vs #Toronto matchup both with Similar W/L records but very different style of play, #Twolves top 5 in pace #Raptors bottom 5. There is also a huge gap in overall defensive rating between these 2 teams. Raptors will control the flow and tempo at home\n\nI bet Toronto -2.5",
    "44": "@nikkiola99 @ScottieBurner @Raptors Maybe you should educate him instead of being arrogant and insult him",
    "45": "hoopin’ from home https://t.co/L1Qirprb4C",
    "46": "@Raptors Degeneracy Patch Notes\n2 new letters added to the\nLGBTQ+",
    "47": "@NBAonTNT do you guys think the @Raptors can win a championship or are we always gonna be a superstar away ???",
    "48": "@Raptors Love you 🤍🫶🏽",
    "49": "Godfather locks\n\nNba\n3 huge 5k unit picks\n\n*** huge 5k unit picks ***\n\n#1 - cleveland cavaliers +1.5\n\n#2 - toronto raptors -2.5\n\n#3 - miami heat +5",
    "50": "I really hope Tatum, Al and Brown are all vaccinated cause if we face the Raptors in the first round without them  for games in Toronto, it’s basically over #BleedGreen",
    "51": "@Raptors_fanboy @Raptors @ShopRSApparel @MLSEFoundation Same",
    "52": "Visiting @itsnauta in Toronto, so of course we had to check out The Raptors #Raptors #WeTheNorth https://t.co/xpQWf8b0XW",
    "53": "@GtaOnli98675101 @Raptors explain?",
    "54": "@Raptors Thanks for all you do! 🌈🌈🌈",
    "55": "Uniforms for Minnesota Timberwolves vs Toronto Raptors at 4:30 PM. \n\n#RaisedByWolves #WeTheNorth https://t.co/bGkm5XhURU",
    "56": "@Raptors Hope to have Amy as the permanent color analyst next year - I thought she was excellent when filling in when others had Covid",
    "57": "So very proud of this organisation for their endless support. They’re helping make such a difference. #WeTheNorth  #WeTheFans #Toronto @Raptors #UkraineWar  #StandUpForUkraine https://t.co/ksCYEQLXrw",
    "58": "@Raptors Love y'all but this is an L for sure",
    "59": "@MaxeyBetta @Raptors Oooo! Here you are again. Every post immediately after posting. We appreciate your support for the team and the LGBTQ community! ❤️🧡💛💚💙💜",
    "60": "@theRealMattBull @rangersyotes @TimBontemps @wojespn We played the Raptors in Toronto last November.Everyone played.Canada’s rules were in place then?",
    "61": "@Raptors @ShopRSApparel @MLSEFoundation I love this!!!!!! ❤️❤️❤️",
    "62": "Pause when did the @Raptors get these fine ass players 👀",
    "63": "Toronto sports on a wave this summer\n\nRaptors about to make the playoffs, Blue Jays WS favourites, CanMNT going to the world cup, TFC got Insigne coming in July, Leafs still ass.",
    "64": "@__Smithfor6 @veraccity @Raptors @ShopRSApparel @MLSEFoundation I'd say they probably hate you too, but nobody knows you exist.",
    "65": "@Man0101Tech @Raptors Weird, right? Cause only heteros play sports.",
    "66": "The @Raptors close out their homestand with a date with the @Timberwolves at Scotiabank Arena.\n\n@Eric__Smith &amp; @Paul__Jones have the #Raptors pre-game show next! #WeTheNorth \n\nTune in 📻 https://t.co/kGILl2Qj0k https://t.co/RBpP9aaPqw",
    "67": "@ThatPrinceJT @arcaiyne_ @Raptors @teefergus They're already crying.",
    "68": "@swipakenta @Raptors 💯! The double standards and fetishizing of people and treating people like tokens is not ok. Sorry to hear I had a hard time! U do you 👊 they can eat it if they don’t like it!",
    "69": "@lukeoneil47 @MrButterChicken @JLew1050 Look forward to Tatum and Brown not being able to travel to Toronto and the Raptors still getting swept.",
    "70": "@JamesPipear @Raptors You're selling those tickets because you need the cash, peasant. Stop making excuses.",
    "71": "@Barnsexual @Raptors Scottie 100% has had a dude’s junk in his mouth before. Still trying to keep it on the DL.",
    "72": "@ScottieBurner @Raptors why not be educated instead of being arrogant!",
    "73": "@Raptors looks like they understood the assignment at this point eh @jv19thole @CSSomner right on! #wethenorth @AdamIsaias1 @DimitrinaStanc4 Lakers, Hornets, Cavs loses offset by big wins VS Suns, Nuggets and Sixers #5 #bebe https://t.co/nTC4lKgqi8",
    "74": "@Raptors Im so proud! love is love!!!!",
    "75": "@Raptors let’s go!! #wethenorth https://t.co/2QaqrBH50P",
    "76": "@JamesPipear @Raptors Don’t fight it. We all know that you know what penis tastes like.",
    "77": "@OilCityDynasty @YUNGPROPHET905 @Harun46290196 @Raptors They're not. I'm with his mom right now...she told me.",
    "78": "@Raptors @ShopRSApparel @MLSEFoundation @Raptors_fanboy cop one of these 🔥",
    "79": "@ScottieBurner @Raptors they add another letter every 2 years💀",
    "80": "@Raptors Woronto Waptors",
    "81": "@Raptors @ShopRSApparel @MLSEFoundation Okay this goes hard",
    "82": "New tumblr post: \"#NBA2K22 San Antonio Spurs vs Toronto Raptors MyLeague PS4 GAMES...\" https://t.co/hxfWlDLKgy ifttt, youtube",
    "83": "@Raptors show more.....more love and awareness!!!!🏳️‍🌈",
    "84": "@Barnsexual @o2nine_ @Raptors This is the position for you because the humanity is evolving whether you like it or not. https://t.co/yYTWvfowKP",
    "85": "@DflowHoops new video on the @Raptors taught me that @chrisboucher passed @npowell2404 for 3rd on the Raps all time for points off the bench.\n\nHe's still behind @TerrenceRoss and @pdpatt both legends.\n\nSome pretty impressive company!!\n\nhttps://t.co/i4DrlcaOHs",
    "86": "@CarusoHeadband @theScore @Raptors Who cares, we won it 2 years ago.  You obviously take this more personal than I do lol.  Keep the hate coming, I'm just like 🤷‍♂️😅",
    "87": "@AmicoHoops Dumb and selfish take.  Why would the @Raptors agree to play on the road during the whole playoffs?  They already endured playing 2 seasons in Tampa.  Get that garbage idea out of here!",
    "88": "@AmicoHoops Nice walk back dum dum … ‘senior NBA writer’ 🤣🤣 ever heard of research?? O yah - don’t have to do that in the US … ‘alternative facts’\n#crackabook #wethenorth @Raptors",
    "89": "@MaxeyBetta @Raptors our team didn't even exist the last time your team won a ring 💀",
    "90": "@Raptors Yall got rid of kyle lowry his dumper was the only reason you had gay fans",
    "91": "@Raptors And what this have to do wit b ball",
    "92": "@EricStokesSzn6 @Raptors You replied so clearly you do.",
    "93": "Check out The @bballilluminati podcast with @DarthAmin @tomhaberstroh and the research They did into the inexperience refs the @Raptors consistently gets https://t.co/qopAU8daRu",
    "94": "@Raptors I hope the raptors players twerk to show their support 🙏",
    "95": "@Raptors We definitely losing tonight",
    "96": "@realAndy_A_R @theScore @Raptors how many have you won since",
    "97": "@ZacharyBeral @AlexMSolana @Alf954 They’ve had a consistent contending team spanning 4 different decades. Everyone outside of Toronto knows the Raptors are nowhere near Miami in terms of organizational success.",
    "98": "Our efforts don’t stop tonight at the game, the Raptors will continue to reach out and support the 2SLGBTQ+ community through meaningful partnerships that continue to break down prejudice and promote compassion. ❤️💙💜💛💚🧡 https://t.co/djVNfdl605",
    "99": "@CarusoHeadband @theScore @Raptors Cool, whatever you need to tell yourself 😎😅🤣 https://t.co/ow5KBac80W",
    "100": "Toronto Raptors twitter, who do we hate more??",
    "101": "🏀  📺  Go Raps Go! \nWatch the Raptors take on Minnesota tonight at 7:30 at Joe's!\n#raptors #goraps #toronto\n#joedogs #eatatjoes #burlon #dtburlon #beer #draughtbeer https://t.co/AeQAN5Wj6Z",
    "102": "@MaxeyBetta @Raptors @ShopRSApparel @MLSEFoundation Oooo! You’re right on time. Like you have been all day! Is having notifications on for a team you hate your way of coping? Is this the process you’ve been trusting? Die mad.",
    "103": "Congratulations to icecreamcowboy (@ic_crm_cowboy) who moved up 1 spot to take #10 on the Toronto Raptors team leaderboard.\n\nhttps://t.co/uFactIaoLb",
    "104": "NBA FREE PICK 🚨\nTimberwolves vs Raptors 🏀\n\nPreview and Prediction 📋 \n\n▶️https://t.co/yFdlMgTYqo\n\n#NBA  #GamblingTwitter #freepicks #freepick #NBAPicks \n#RaisedByWolves  #Minnesota \n#WeTheNorth    #Toronto \n#freebet #bettingtwitter \n#nbabets #nba75 \n#NBATwitter  #basketball https://t.co/aWBeBmYDiA",
    "105": "@canna_duh_luisa @Raptors I'm glad for u :)) I suffered a lot of hate and discrimination for coming out pan so when ever i see teams do this I always retweet but I always wonder do they really care ab our well being, or is it just performative",
    "106": "@Raptors @ShopRSApparel @MLSEFoundation This is beautiful! Love it! (Too bad I live in Brazil so it'll cost me an organ)",
    "107": "@Raptors @ShopRSApparel @MLSEFoundation Love this!!",
    "108": "Raptors Pride themed merchandise will be sold at @ShopRSApparel and a portion of the proceeds will be donated to create equitable access to sport for 2SLGBTQ+ youth as part of our commitment to Change the Game with @MLSEFoundation \n\n➡️ https://t.co/BVtBfIzwru https://t.co/vjbaP2Yily",
    "109": "@WorldWideWob You’ve NEVER, at any point this year, had Scottie Barnes as ROY???  Y’all wonder why @Raptors fans are mad all the time. https://t.co/UWf8oqWNku",
    "110": "RT: Raptors: Introducing our Pride Night artist, @teefergus who created tonight’s featured logo you will see around the arena and on our channels to help us celebrate the night! https://t.co/o11DCjmDgZ @raptors @olgproline @NBACanada",
    "111": "Parlay : $10 for $16.70\n Scottie Barnes of the Toronto Raptors will have over 3.5 assists\n\nAnthony Edwards of the Minnesota Timberwolves will have over 3.5 total rebounds",
    "112": "@Barnsexual @Raptors I have no interest in debating women’s reproductive rights with someone who has never experienced a vagina. Ty for the offer tho!",
    "113": "I love Raptors Twitter. I love how we evolved from a fringe fan presence to a complete force to be reckoned with. \n\nDon’t be caught disparaging the Toronto Raptors name, or you’ll be ratio’d into submission",
    "114": "@swipakenta @Raptors For real tho! Hate the lip service from some companies and orgs. Like if you love lgbtq community and u think Black Lives Matter, then show up when shit hits the fan for these folks  👏 (I’ve had no trouble with discrim as a bisexual femme woman , privilege as anythin)",
    "115": "@GorniakBWLJ @Raptors Woke ideaology can Never be satisfied\nBotomless pit be warned",
    "116": "@AmicoHoops Who tf is the is bucktee trying to talk? Toronto is ineligible for the playoffs?? The Raptors were in the US for a whole season and you have the nerve to say the raps have to play the playoffs there? The rules are simple. Be vaccinated and you can enter the country",
    "117": "On #TheOpenRun, Ep. 69 - Disrespectful x Churlish feat. The Honourable @MarciIen, We Talk Our Shared History At @CTVToronto, Playoff @Raptors x The Tipping Point That Led Her From Media To Politics\n\nhttps://t.co/v3geVT8Gya \n\n Oh Indeed\n#NBA #WNBA #NCAA #FC21CA #GetBusy #DoWork https://t.co/o2XjdTFmbM",
    "118": "@MastercardCA @Raptors #priceless my wife",
    "119": "@Raptors @MLSEFoundation Ratio",
    "120": "@canna_duh_luisa @Raptors Thiss^^^",
    "121": "your clear cut ROOKIE OF THE YEAR is SCOTTIE BARNES.\n\nOnly reason you dont see that is because you dont watch RAPTORS basketball.\n\n@ScottBarnes561 \n@Raptors",
    "122": "@Raptors @MLSEFoundation LOVE THIS SHIRT GOOD JOB!!!!!",
    "123": "@Raptors Hell yea, just make sure you are fr lgbtq friendly (don’t just front on this)",
    "124": "@MaxeyBetta @Raptors @MLSEFoundation You guys still trusting the process over there? 👀 Also, why you got notifications on for a team you hate so much? Is that how you cope?",
    "125": "@TangerineHoops @Raptors #7DaysofGiveaways My favourite Raptor memory is watching them win the N.B.A. championship and celebrating!!!",
    "126": "@MaxeyBetta @Raptors @MLSEFoundation Man’s still salty about Kawhi’s shot",
    "127": "@Raptors Now do Straight Night. If you have a problem with that then perhaps you’re a sexist.",
    "128": "The Boston Celtics and Philadelphia 76ers refuse to comment on the vaccination rate of their players.\n\nAny unvaccinated players will not be able to participate in the playoffs against the Raptors in Toronto. https://t.co/twRwJV8a2L",
    "129": "@TangerineHoops @Raptors Watching the Raptors win the championship 🏆🏀",
    "130": "@TangerineHoops @Raptors My favourite memory was watching Kawaii make his buzzer beater in the stadium that lead them to the next round &amp; to being the winners of the championship. That moment gives me chills &amp; the excitement was amazing. We jumped out of our seats and it was incredible. #7daysofgiveaways",
    "131": "@Raptors Love this!!!",
    "132": "🏀 T-WOLVES VS RAPS! \n\nThe @Raptors will try and make it 4 wins in a row when they host the @Timberwolves tonight!\n\nWill the 🦖’s beat the 🐺’s? \n\n#MakeAPlay ➡️ https://t.co/qUPBOzx6EM #WeTheNorth #RaisedByWolves https://t.co/PX2gHvalky",
    "133": "Armoni Brooks got a some of the remaining MLE from the Toronto Raptors in his two-year deal:\n\n21-22: $250,000\n22-23: $1,752,638\n\n22-23 is guaranteed for $50K, rising to $250K on August 1, then fully guaranteed opening night.\n\n@spotrac",
    "134": "@JamesPipear @Raptors aaaawwwwww better sell all ur tickets then and just never go anywhere ever again :((((( https://t.co/z9lkiVMBSR",
    "135": "Technically, Wolves won a road game vs. Raptors last season, but it was in Tampa. \n\nMIN has not beaten Raptors in Toronto since 2004 -- 16 consecutive losses.",
    "136": "Hey @Raptors, can somebody get a Msg to Rasheed Wallace. We need some help with these refs! #thefixisin #WeTheNorth #crookedrefs #nba #toronto #canada",
    "137": "Random Cavs player day 49:\n\nJoey Graham\nDrafted 16th by the Toronto Raptors in 2005\nPlayed 6 seasons, 1 season with the Cavs from 2010-2011\nCareer Avg: 5.9 PTS 2.8 TRB 0.5 AST in 377 games played \nFun fact: his twin brother Stephen also played in the NBA https://t.co/2hNFDSdTis",
    "138": "@Barnsexual @Raptors @teefergus deactivate",
    "139": "@TSpencerNairn @Raptors Well said Tara!",
    "140": "@YUNGPROPHET905 @Harun46290196 @Raptors I get it tho.  A big, bad gay man must’ve beat the shit out of in the past. And this triggered you.  It’s okay. You’ll get through this.",
    "141": "@Raptors This is why we're better than the closeted leafs fans who have a sus hate for gay people.",
    "142": "@TheJurassicPack @nbatopshot @Raptors I'm 74.4% of the way towards my end goal.",
    "143": "@Raptors aaaww! love that!",
    "144": "🏀 GAME ANALYSIS 🏀\n\n🏟 Minnesota Timberwolves vs Toronto Raptors 🏟\n\n▶️ BET THE NBA ▶️ https://t.co/odroCYfQFJ\n\n#NBA #GamblingTwitter \n\nhttps://t.co/oUYVc7eylV",
    "145": "@Barnsexual @Raptors @teefergus Lmao you think you're so cool with your edgy takes",
    "146": "@YUNGPROPHET905 @Harun46290196 @Raptors Your parents must be very proud",
    "147": "Top Play(s) of the Day\n\nSan Jose Sharks ML (-160)🥅🏒\n\nToronto Raptors (-135)🏀 https://t.co/OpK6hjVkuT",
    "148": "A non hockey response. Kawhi Leonard single handily brought the Raptors a title. So no Matthews isn’t having the best season a Toronto athlete has had. It means nothing without a ring. https://t.co/ksY53xj4qt",
    "149": "Let's Go @Raptors \nCheering from the city of rainbows 🌈 Prince Rupert BC\n@Matt__Devlin  @FredVanVleet  @pskills43 https://t.co/T5EPRCN0vm",
    "150": "@JamesPipear @Raptors I'm sorry what two adults do behind closed doors upsets you do much. I thought your God says love thy neighbour",
    "151": "@t88west @nbatopshot @Raptors You don't say 😂 https://t.co/dGdgYZY6Fb",
    "152": "@Raptors @FredVanVleet @pskills43 wonder how many players would've made all-nba but not selected to all star team in the same year. guessing it's a pretty exclusive club. #Pascal #rap",
    "153": "@Raptors Love it 🌈💜",
    "154": "So many tweets about the Celtics in the last day by @NBA, I'm starting to understand why they had they're refs try to sway the score when they played the @Raptors. #thefixisin #WeTheNorth",
    "155": "@Raptors WHY, HELLO NOOR!",
    "156": "@Raptors @teefergus Today's BLM news update:\nhttps://t.co/EflahRMBMR",
    "157": "@Barnsexual @Raptors nobody gives a fuck what your magic god book says either",
    "158": "@TermineRadio being from Toronto,and now living on the west coast,  diehard fans get you.  Casual @Raptors fans have an inferiority complex and are used to being on the defense.",
    "159": "@Barnsexual @Raptors thats a fucking joke, welcome to 21st century buddy. do some research before you state 1940's science at me",
    "160": "@dark_769_ @theCyberZon @Expushin @jebronsburner @NBA @celtics Cause JT JB and Al too rest on the back to back against Toronto and people started speculating for no reason. We know Tatum for sure is vax’d and that post shows Al and JB are too. God would love the raptors first round tbh",
    "161": "@Raptors @teefergus well said!!!!!",
    "162": "For the @Raptors vs @Timberwolves game tonight, which young player do you think ends up as the better player in 10 years? #NBATwitterLive",
    "163": "@Barnsexual @Raptors @teefergus ur so weird",
    "164": "@HardensBetta @Raptors L accoutn of urs sadly",
    "165": "@NotMajd23_ @AdamWasheere @Raptors fr what does have to do with your dad",
    "166": "🚨 NBA\n---------\n🇺🇸🏀 Golden State Warriors - Phoenix Suns\n✅ Gana Phoenix Suns (1,55)\n---------\n🇺🇸🏀 Toronto Raptors - Minnesota Timberwolves\n✅ Gana Toronto Raptors (1,65)\n---------\n🇺🇸🏀 Boston Celtics - Miami Heat\n✅ Gana Boston Celtics (1,50)\n---------\nCuota 3,84\nSTAKE 3/10",
    "167": "@JamesPipear @Raptors hope those tix go stale on you + cry more",
    "168": "NBA Consensus (So Far):\n\nMemphis Grizzlies 70%\nWashington Wizards 68%\nOklahoma City Thunder 68%\nPhoenix Suns 68%\nDallas Mavericks 66%\nBoston Celtics 66%\nPortland Trail Blazers 63%\nToronto Raptors 61%\nSacramento Kings 58%\nDenver Nuggets 53%\nCharlotte Hornets 50%",
    "169": "@sheanorling “Toronto ineligible for playoffs” actually,,, i agree with him lmao. Mostly just based off of how mad raptors fans would be.",
    "170": "@nbatopshot @Raptors I like the Lowry 40k, and even ended up collecting more than one!",
    "171": "@Harun46290196 @Raptors Aw, muffin. You gonna be okay?",
    "172": "The last real NBA championship was won by the Toronto Raptors…\n\nlets talk about it https://t.co/mx4HDgF3CZ",
    "173": "@MaxeyBetta @Raptors @teefergus win an actual ring first",
    "174": "Introducing our Pride Night artist, @teefergus who created tonight’s featured logo you will see around the arena and on our channels to help us celebrate the night! https://t.co/F1jpAGIdqT",
    "175": "@Raptors Common Raptors W",
    "176": "@sack_jimborg @Raptors These people are my favourite types of people. Always so hilariously inconsistent.",
    "177": "@LivChars @Raptors These types are alway “pro-life” but then want to tell people how to live.",
    "178": "When does voting close for the @ScottBarnes561's NBA Rookie of the Year Award?  Mobley is about to miss a week. @Raptors have a tough, but not impossible, schedule ahead. Now's the time to convince these reluctant bozos, young king 👑 #ScottieROY",
    "179": "@Raptors Waptors",
    "180": "@AmicoHoops This is like saying, why were the Raptors punished the past two seasons by playing away from Toronto?  Why didn't every American team find a home in Canada to play the past two seasons.  \n\nThat is a ridiculous suggestion, just like your so-called \"Easy Fix\"",
    "181": "@MaxeyBetta @Raptors Is this the dagger ? https://t.co/r012V6J0aU",
    "182": "WEDNE$DAY 💥🆓FREEBIES🆓💥\n\n🏒Winnipeg+NY Rangers MLP +185\n🏀Washington Wizards -3🚨\n⛹️‍♂️Satoransky(WSH) O5.5 ASS\n🏀Toronto Raptors -2.5\n🏒Vegas/Seattle O6\n\nPLZ RT🔃 | LIKE💙\n\nGL if tailing!🍀\n\n#JeetsSheets #SportsBetting #FreePicks #Handicapper #Parlay #NHL #NBA #BasketballBets https://t.co/uKoMQ1sFDo",
    "183": "@Raptors I will be selling my tickets for today and will be going to the jays home opener next week instead due to this despicable act by MLSE",
    "184": "@NBA @AschNBA Fuck me, the disrespect on @ScottBarnes561  y'all do anything to not recognise @Raptors greatness. Dude has been killing it all year, but nah gotta bump the #1 up the rankings just because",
    "185": "Toronto Raptors Starting Lineup 3/30\n PG: Fred VanVleet\n SG: Gary Trent Jr.\n SF: OG Anunoby\n PF: Scottie Barnes\n C: Pascal Siakam\nhttps://t.co/o75oZ8vnE8",
    "186": "@craigg_barry @wtk19 @BillSimmons @SIChrisMannix I believe both brown and horford aren’t vaccinated, which means they won’t be able to play in Toronto. Raptors can win that easy",
    "187": "@Raptors This is amazing!",
    "188": "Tonight's starting lineup for the Toronto Raptors: VanVleet, Trent Jr., Anunoby, Barnes, Siakam\nhttps://t.co/bVWH4AMCA2",
    "189": "OUR #NBA75 NBA PLAYER SPECIAL PICK TORONTO RAPTORS VS MINNESOTA TIMBERWOLVES IS LIVE⚡⚡⚡\n\nBET9JA COUPON CODE- 6FQ8HQ6\n\nGAMBLE RESPONSIBLY🔞🔞 https://t.co/TvnZQX4Yhj",
    "190": "@AmicoHoops Easier fix: If you don't want to get vaccinated you don't get to cross a border. In either direction.\n\nSo, Raptors have home games in Toronto. Get vaccinated if you want to cross a border for your job.  Just like everyone else.",
    "191": "@TangerineHoops @Raptors #7DaysofGiveaways the parade for SURE!!!!!!",
    "192": "Easy fix: Toronto ineligible for playoffs so cancel playoffs and name the Raptors as NBA champions. Don’t punish Canada's team because of unvaccinated players. https://t.co/yH1DlsWH81",
    "193": "@TangerineHoops @Raptors #7DaysofGiveaways championship parade",
    "194": "@Raptors @TangerineHoops LETS GO GET THEM BOYS!!!!!!🇨🇦🏆",
    "195": "@TheJurassicPack @DaFamelessGamer @marcwinegust @Raptors @nbatopshot Great things happen when passionate fans band together!",
    "196": "@Raptors This awesome Thank You Raptors!!!!!!",
    "197": "@NotMajd23_ @Raptors Make the play-in then talk",
    "198": "@Raptors sorry but ratio",
    "199": "@Barnsexual @Raptors Not the “Pro-Life” Twitter bio too💀💀",
    "200": "@Barnsexual @Raptors lmao so now all the sudden you people care about science",
    "201": "@EmbiidBetter21 @tylershafir @Raptors Go deal with your anti vaxxers first 😂😂😂😂",
    "202": "@EmbiidBetter21 @tylershafir @Raptors But raptors just better",
    "203": "@MustyHandles @NotMajd23_ @Raptors Everything",
    "204": "@Raptors massive W",
    "205": "@MaxeyBetta @Raptors Still hurts? https://t.co/0c1kCzt6y6",
    "206": "@MaxeyBetta @Raptors That doesn't even make sense. Lol.",
    "207": "@Barnsexual @Raptors this will be a disgusting ratio i’m afraid https://t.co/ry1ifumIbm",
    "208": "@Raptors @CelticsGotNext hope u guys sweep us now",
    "209": "@tylershafir @Raptors Sixers did this months ago",
    "210": "@Raptors Ws on Ws on Ws!!!",
    "211": "@Raptors Awesome, well done",
    "212": "@Raptors Best team in sports!",
    "213": "@Raptors It’s so pretty!!",
    "214": "As you enter the arena tonight, you’ll see we are celebrating our Pride Night, which for the Raptors goes way beyond what happens on the court. It’s about creating a lasting feeling that you’re always welcome in the home of the Raptors. ❤️💙💜💛💚🧡 https://t.co/sjgd5j3NDE",
    "215": "NBA FREE PICK 🚨\nTimberwolves vs Raptors 🏀\n\nPreview and Prediction 📋 \n\n▶️https://t.co/yFdlMgTYqo\n\n#NBA  #GamblingTwitter #freepicks #freepick #NBAPicks \n#RaisedByWolves  #Minnesota \n#WeTheNorth    #Toronto \n#freebet #sportsbets \n#nbabets #nba75 \n#NBATwitter  #basketball https://t.co/HyK5ANCHGP",
    "216": "@TangerineHoops @Raptors Kawhis game 7 winner over Philly what a moment #7DaysofGiveaways",
    "217": "@TangerineHoops @Raptors The #Raptors championship parade was the most unforgettable celebration #Toronto and #Canada could ever ask for! 🏀🏀🏀 #7DaysofGiveaways https://t.co/yxeF7oHHIu",
    "218": "@ClappedGTJ @Raptors Backhanded compliment sadly",
    "219": "Alex McKechnie was a massive part of our success @ the @GoldCup 2000. He’s the best and he brought the big man himself @SHAQ to visit in L.A. Alex was part of 5 @NBA titles with the @Lakers 1 with the @Raptors #CANMNT did this for him &amp; Al sent me the pic and couldn’t be prouder https://t.co/W2C03TpRYq",
    "220": "Toronto Raptors lowkey have one of the best chances to win the east. Their opponents could be at a disadvantage when games r in Canada (Vax rule) and we’ve seen how strong/productive the team chemistry is up there.",
    "221": "(Cont’d)\n\nToronto Raptors\n\nWhen FVV was injured they ran Siakam and Scottie Barnes at the 1 (they did great tbf) that’s all needed to be said for why they would need a back up PG also Malachi Flynn don’t move me\n\n(I couldn’t find a raptors photoshop sadly so here’s Russ confused) https://t.co/E5XJRQ4QXX",
    "222": "@jackson5payne The @Raptors would like to invite you to join them. https://t.co/fFFBKNASid",
    "223": "Toronto Raptors - Minnesota Timberwolves\n\nBet slip link: https://t.co/eE9JxTBWw8\n\n#TorontoRaptors #MinnesotaTimberwolves #ripple #xrp #gaming https://t.co/KKEuMyn8fe",
    "224": "Last time I was at a @Raptors game , I came with my gf and we watched them advance to the @NBA Finals in Jurassic Park! Can't wait to be in the @ScotiabankArena tonight with @dangles009 and @ElyUlat #LetsGoRaptors @LeoRautins @Matt__Devlin @KayNurse11 @KateBeirness @AmyAudibert",
    "225": "@Raptors Amy is the best in her field,a professional who knows and does her job commenting very well,easy on the ears to listen to.",
    "226": "@Raptors @FredVanVleet @pskills43 pls trade siakam",
    "227": "Most of the team has already played in Toronto this year so the only guys who could be unvaxxed who get regular playing time are DeAndre and Millsap, in which case the Sixers should petition the NBA to play a full series of road games if they get the Raptors in the playoffs.",
    "228": "Should be pretty telling who isn’t available in a potential Toronto Raptors series between who wasn’t available for the Celtics on both their trips to Toronto and who isn’t going to be available when Philly shows up in the North next week.",
    "229": "@kostancaaa__ @Raptors @JustinTrudeau @NBA doc rivers also asked me to be his bookie",
    "230": "Toronto Raptors guard Fred VanVleet has been named a finalist for the 2021-22 Twyman Stokes teammate of the year award https://t.co/TdaeDoIJ8Q",
    "231": "@TimBontemps @wojespn Everyone fears playing the @Raptors!",
    "232": "@TangerineHoops @Raptors My favorite Raptors Memory was watching the game during the playoffs in Jurassic Park with all the die hard fans ! #7DaysofGiveaways",
    "233": "Everyone traveled to Toronto last Celts/Raptors game lol stop the nonsense 🤣 https://t.co/kINTi9hNbS",
    "234": "@BridgetMWillard @spurs @FiestaSA I am an @Raptors  fan NO No NO!",
    "235": "doc rivers hasn’t been vaxxed @Raptors @JustinTrudeau @NBA https://t.co/261asmnhZA",
    "236": "Hopefully all #Sixers players are vaccinated because it could cause them to potentially miss a playoff game if they face the Raptors.\n\nThe injury report heading into next Thursday’s game in Toronto could give us a clue of anyone’s potential availability in this situation. https://t.co/RZ2umj82wy https://t.co/gO1q4ewl8Y",
    "237": "The @Raptors wrap up their homestand as they host the @Timberwolves tonight at Scotiabank Arena.\n\n@Eric__Smith &amp; @Paul__Jones will have the call and pre-game starting at 7pm, you can catch #Raptors Reaction with @william_lou right after the game! \n\n#WeTheNorth https://t.co/05czseaBqW",
    "238": "@realAndy_A_R @theScore @Raptors kawhi gifted y’all that charity ring, he wasn’t homegrown talent that y’all developed but okay 👍🏽",
    "239": "Ending up 5th or 6th is just to take away the stress of losing one game and being out of the playoffs.  @Raptors playing Philly or Milwaukee is going to be tough.  There are no easy teams in the top 4 of the Eastern conference.  But that's why we play the games.  I'll go for 5th!",
    "240": "@TangerineHoops @Raptors Celebrating with all Toronto Raptors Fans at the Victory Parade! #7DaysofGiveaways",
    "241": "You need to ask why Pascal Siakam is not eligible at guard when he plays point forward for the @raptors https://t.co/oCxXAJZQHO",
    "242": "@TangerineHoops @Raptors The Victory Parade! #7DaysofGiveaways",
    "243": "@ShopRSApparel @Raptors @MLSEFoundation Love this🤩👌🏾👏🏾👏🏾👏🏾",
    "244": "Day 1 of Basketball Try-outs... Physically active for almost 2 hours! (These kids will be tired and dreaming hoop 🏀 dreams tonight!)\n@LC2_TDSB @Raptors https://t.co/3I5n1NYPWc",
    "245": "Future Toronto Raptor https://t.co/S7mRyWAQeQ",
    "246": "@MastercardCA @Raptors I’ll be watching with @jkom92 we’ve supported since the beginning! #Priceless https://t.co/rdAaVqGGll",
    "247": "@TangerineHoops @Raptors That Kawhi Leonard shot on the 76ers for the buzzer beater in game 7. We rode that momentum all the way to the championship. #7DaysofGiveaways",
    "248": "NBA FREE PICK 🚨\nTimberwolves vs Raptors 🏀\n\nPreview and Prediction 📋 \n\n▶️https://t.co/yFdlMhbzhW\n\n#NBA  #GamblingTwitter #freepicks #freepick #NBAPicks \n#RaisedByWolves  #Minnesota \n#WeTheNorth    #Toronto \n#freebet #picks \n#nbabets #nba75 \n#NBATwitter  #basketball https://t.co/LPLlvgAIjE",
    "249": "#WeTheNorth Nation we Ready @TheTellieTube @Raptors Game Day vs the @Timberwolves and my Bud @KarlTowns https://t.co/pLKwdO3dku",
    "250": "@ctsbulls @mopete24 @Raptors It was an honour 🙏🏿",
    "251": "Shop the @Raptors #Pride Collection now: https://t.co/kw73zbTESl\n\nA portion of tonight’s proceeds will be donated to create equitable access to sport for 2SLGBTQ+ youth as part of our commitment to #ChangeTheGame. For more information, visit https://t.co/PiTLUVPc3W. https://t.co/Z4mhI0qbRn",
    "252": "Notre bet #basketball #NBA75 #NBA pour cette nuit 🇺🇸🏀\n\n🔹 Toronto Raptors - Minnesota Timberwolves\n\n📌 Toronto Raptors [OT]\n\n📊 @ 1.71\n\n#TeamParieur #FreePicks #ParionsSport #GamblingTwitter #sportsbettingpicks https://t.co/RCeAKpVGLz",
    "253": "@MichCWilliamson @Raptors Congrats on being one of our potential winners, @MichCWilliamson! Please send us a DM with your email address so we can send you the next steps to claim your prize. 🎉 ^EA",
    "254": "@TangerineHoops @Raptors @Rqptors winning the championship #7DaysofGiveaways",
    "255": "Nice to see more and more US media folks are leaning towards @ScottBarnes561 as their ROTY.  @Raptors https://t.co/OXUtZRBa7D",
    "256": "RT: Raptors: Great prizes from @ricohcanada are up for grabs in Game Time.\n\nPlay while you countdown to tip-off for the chance to WIN!\n\n📲: https://t.co/rfsG1LZMNt https://t.co/7giYVU8pXo @raptors @olgproline @NBACanada",
    "257": "@NBA Hate for @raptors is real … @nba probably only put these blips in for contractual reasons.  Ppl wonder why Raps fans are angry all the time smh https://t.co/s9cJSyHyt1",
    "258": "@NBAonTNT @NBA Hate for @raptors is real … @nba probably only put these blips in for contractual reasons.  Ppl wonder why Raps fans are angry all the time. https://t.co/j7d7qcA8AN",
    "259": "How did Chris Boucher become the Raptors' most valuable bench piece? 🤔\n\n@vivekmjacob joined @william_lou to discuss Boucher's performance for Toronto this season.\n\n🎧: The Raptors Show: https://t.co/fttl01Cxoq https://t.co/M3GwfZiDPr",
    "260": "@ClappedGTJ @Raptors Get a job u 🤡",
    "261": "@Raptors Noor is a natural!!",
    "262": "@Raptors W video, we need more women in sports",
    "263": "GUESS who is receiving his 2019 @Raptors CHAMPIONSHIP ring?!?!\n\n@DGreen_14 is! Join Green, along with @HarrisonSanford (and maybe some others👀) for a live recording of @GreenRoomInside at @TheRecRoomCa! \n\nLink to purchase tix: https://t.co/ot1Kw2jf8H",
    "264": "@DalanoDimesV2 @Raptors @ricohcanada I won a jersey last season and this season",
    "265": "@NiceSheehan @KateBDoll Things look great the media likes Scottie and then Cade and Mobley become media darlings and everyone ignores Scottie. The raptors are a top 6 seed and when the media talks about standings in the east they talk about the bulls, Cavs, hawks and nets but ignore Toronto.",
    "266": "@dark_769_ @Raptors @FredVanVleet @pskills43 Hall of fame ball knower",
    "267": "@DalanoDimesV2 @Raptors @ricohcanada they be wasting my time on this shit",
    "268": "@Raptors @ricohcanada don’t even bother, the app is garbage and everyone cheats",
    "269": "How The Toronto Raptors Were Screwed Over By NBA Officials https://t.co/l7Uc8fRONU via @YouTube #NBA",
    "270": "Great prizes from @ricohcanada are up for grabs in Game Time.\n\nPlay while you countdown to tip-off for the chance to WIN!\n\n📲: https://t.co/QwAD1fF392 https://t.co/uB1qqXNnNk",
    "271": "@DaveFromDade @wheetabix1 @SRochesterNBA @Imman_Adan @Raptors Nobody asked @srochesternba to spout lies https://t.co/w4A0e9uT4r",
    "272": "@Raptors @FredVanVleet @pskills43 Love the new profile",
    "273": "🏀🏀 @Raptors Vibes today https://t.co/SKT6zbeVnz",
    "274": "@RapsMeditations Most generational ring of all time with all odds against the @Raptors &amp; defeating a stacked superteam",
    "275": "@TangerineHoops @Raptors #7DaysofGiveaways i was on my sofa!",
    "276": "@Raptors @TangerineHoops We got this!!",
    "277": "Upon arrival back to our happy place in Florida, out for some mahi tacos, blackened grouper and a few cold ones, but of course the highlight of the week will be heading to the Raptors game in Orlando Friday night!! Let’s Go @Raptors #WeTheNorth",
    "278": "@Raptors why is it that you guys are quick to post and support anything for BLM or LGBQ yet there 2 Billion Muslims including @NBA players and you@guys don’t even show any solidarity with them for the Holy Month Of Ramadan that starts April 2nd ? #nba #muslim #raptors #biased",
    "279": "The Toronto Raptors have 2nd fewest Turnovers in the NBA but on the other hand are 3rd in the NBA in creating Turnovers. \n\n#WeTheNorth https://t.co/nnzyOtOgAY",
    "280": "@TangerineHoops @Raptors How can I only choose one? Other than the winning championship - wheb OG hit the 3 pointer buzzer beater in September 2020! His reaction after was priceless 🤣 #7DaysofGiveaways 🏀❤️ https://t.co/8YjlHsSP54",
    "281": "@TangerineHoops @Raptors Attending my first Raptors game when I was a teen #7DaysofGiveaways",
    "282": "@nbatopshot @Raptors This was an awesome moment from the playoffs https://t.co/aNE8UpmAe7",
    "283": "🔮 NBA ELO Win Probabilities for March 30\n@celtics 85.9% vs @MiamiHEAT\n@Raptors 59.5% vs @Timberwolves\n@PelicansNBA 74.6% at @trailblazers\n@Suns 75.9% at @warriors\n https://t.co/B8aKlY37h3",
    "284": "@Imman_Adan Why are so many Raptors fans so hurt about Kyle Lowry leaving Toronto? Do you think y'all had chance at a title with Lowry on the roster this year?",
    "285": "Canada needs a team! Bring on @Raptors @WNBA https://t.co/JqxekuCwm0",
    "286": "@TangerineHoops @Raptors Must we pick just one??? Fave #Raptors moment was being at the tailgate to witness the win. Second best to being inside! #7DaysOfGiveaways",
    "287": "@Raptors @FredVanVleet @pskills43 Pskills nobody in the game can Guard this man anymore",
    "288": "March 30, 2007: Down by 3 with 3.8 seconds left, the #Raptors' inbounds was intercepted by a Wizards player who threw it up, hoping the clock would expire, before Morris Peterson snagged it &amp; forced OT at the buzzer where Toronto would beat DC 123-118 https://t.co/NSg6GlKdCi",
    "289": "@TangerineHoops @Raptors At the tailgate!!!! #Raptors #7DaysOfGiveaways",
    "290": "@TangerineHoops @Raptors #7DaysofGiveaways definitely the championship win!",
    "291": "@MaxeyBetta @Raptors @FredVanVleet @pskills43 Emfreethrowmerchant",
    "292": "@Raiderf00587831 @marcwinegust @Raptors @NBA @nbatopshot @DaFamelessGamer @TopShotKingdom Stronger together 😂🤝 https://t.co/tIpkscg64L",
    "293": "@TangerineHoops @Raptors Watching the championship parade #7DaysofGiveaways",
    "294": "@TangerineHoops @Raptors The Kawhi shot!\n#7DaysofGiveaways",
    "295": "Time to dust off our @raptors jerseys and head off to tonight’s game! #excited though a bit nervous about the no mask mandate though we’ll be masking up #WeTheNorth https://t.co/W5Qxu7ntLv",
    "296": "@SwipaCam Toronto raptors announcers deserve to be in the convo for top in the league",
    "297": "@Leprechaun_7 @brandnewglock1 This proves nothing. Experts expectations were lottery team for the raptors and contenders for the celtics. Now we sit 3.5 games back from boston. We tanked 1 season which we didnt play in toronto to nab a rookie with this type of potential and already back in playoff form.",
    "298": "@marcwinegust @Raptors @TheJurassicPack @NBA @nbatopshot @DaFamelessGamer I think @TopShotKingdom has the best fan base but I am biased!! 1,2,3,4 I declare a fan base war!!\nJust kidding!!",
    "299": "@TangerineHoops @Raptors In the living room watching and cheering with my family #7DaysofGiveaways",
    "300": "@TangerineHoops @Raptors When they won the championship!!! #7DaysofGiveaways",
    "301": "Helloo @Matt__Devlin can you greet my son Justin Valdez tonight for his 27rh birthday 🎂 🎂🎉he’s gonna be in the @Raptors game tonight against Timberwolves 👏👏👏Shout out for him tonight 📣📣📣You and Jack Armstrong are our favourites @Raptors Sports Commentators thank you GB🙏",
    "302": "@marcwinegust @TheJurassicPack @Raptors @NBA @nbatopshot @DaFamelessGamer They seem like nice dinosaurs over there 🙏",
    "303": "@TangerineHoops @Raptors It is pretty hard to hard top the winning of the Championship! That was EPIC! #7DaysofGiveaways 🙌",
    "304": "RT: Raptors: .@FredVanVleet knows @pskills43 has BEEN at an All-NBA level 👏 #ALLNBA https://t.co/aPEDxVT2lN @raptors @olgproline @NBACanada",
    "305": "@TangerineHoops @Raptors When @FredVanVleet scored a 54 point franchise record 🏀👍#7DaysofGiveaways",
    "306": "@heyhalima They can’t make up their mind, but they WILL discredit the Toronto Raptors 🤦🏽‍♂️",
    "307": "@Raptors @FredVanVleet @pskills43 Do the job on KAT tonight, and you'll be fine!!",
    "308": "@TangerineHoops @Raptors Winning the Championship!!!! #7DaysofGiveaways",
    "309": "I almost never win things, but @Raptors and @TheJurassicPack Have the best fanbase in the @NBA @nbatopshot. Thank you @DaFamelessGamer !!? https://t.co/VQ9Lxowmcn",
    "310": "@TangerineHoops @Raptors 100% The Shot #7DaysofGiveaways",
    "311": "@mandemhot1 Toronto is one of those teams that I rarely bet against…. If I had to guess this game will go back and forth and I give the slight edge to the Raptors. I love both these teams not even gonna try and predict this since there isn’t a lot of value going either way",
    "312": "@TangerineHoops @Raptors Meeting Lowry at his charity event. #7DaysofGiveaways",
    "313": "@IBleedReality_ @RaptorsGen @yeayeahyeahya @BundIeUp @Raptors Make it paper",
    "314": "@MastercardCA @Raptors #Priceless my grandson",
    "315": "@TangerineHoops @Raptors #7DaysofGiveaways  my fav Raptors memory was the night of “The Shot” by Kawhi. We let our 3 kids stay up to watch the playoff games at home on tv, and we erupted in loud cheers and dancing, waking up my youngest (5) at the time. Never forget this family fun night",
    "316": "@TangerineHoops @Raptors my grandson #7DaysofGiveaways",
    "317": "@enra6ed @Raptors @FredVanVleet @pskills43 Not Tatum stop being biased",
    "318": "@TheJurassicPack @DaFamelessGamer @marcwinegust @Raptors @nbatopshot Awesome to see!! Love the generosity in JP!",
    "319": "@TangerineHoops @Raptors The championship parade! Such a cool moment #7DaysofGiveaways https://t.co/HtCoXPccO3",
    "320": "@Raptors @hudsonsbay Why is the pfp like that 🤮",
    "321": "@TangerineHoops @Raptors Oh, their big win, of course! And the parade.  #7DaysofGiveaways",
    "322": "@Raptors @FredVanVleet @pskills43 Better than tatum and butler",
    "323": ".@FredVanVleet knows @pskills43 has BEEN at an All-NBA level 👏 #ALLNBA https://t.co/fhPbzaFmNn",
    "324": "@realAndy_A_R @theScore @Raptors We don’t care bout soccer like those Jays and Leafs. 92-93 Jays you’re correct",
    "325": "@TangerineHoops @Raptors Best raptors moment I've had!!! #7DaysofGiveaways https://t.co/3QWob8RI5A",
    "326": "@iPlunks @theScore @Raptors Correction, Blue Jays Champions in 92 &amp; 93.  \nAlso Toronto FC Champions in 2017.  If you're gonna troll me, get it right.",
    "327": "I know the Raptors Nation diehards are always wanting more Toronto Raptors content.\n\nThanks to @TheHoopsDigest for helping fill 8 mins of my life.\n\n#WeTheNorth \n\nhttps://t.co/4TOgT0q035",
    "328": "@TangerineHoops @Raptors Kawhi' s shot #7DaysofGiveaways",
    "329": "HWRK (03.30.22): G4/5 Math (pdfs in Google Classroom); Current Events + Canadian Reader (Friday); Response Journals (Seth, Sienna, Sofia, Subeer, Sumaya, and Tyler). @Raptors play tonight. Have a great night! https://t.co/RaAljELha3",
    "330": "@realAndy_A_R @theScore @Raptors Toronto has a history of holding on to the past\n\n92 World Series\nStanley Cup 1873\nAnd now the 2019 Raptors 😂😂😂",
    "331": "@MDubThaRuler @AdamTaylorNBA @Raptors Nothing I want more, Raptors and Heat fans are......",
    "332": "@TangerineHoops @Raptors When they introduced the team logo. #7DaysofGiveaways",
    "333": "@TangerineHoops @Raptors My husband @kenadams118 is the biggest @Raptors fan!! Look at the tattoo he got done after they won the championship! Now that's dedication!! 🏆 #7DaysofGiveaways https://t.co/nPjGvrYs6i",
    "334": "@CanadiensEh Poor Raptors actually won a championship before them. Leafs the only team in Toronto everyone hates lmao. Raptors and Blue Jays are awesome",
    "335": "@TangerineHoops @Raptors The parade! 🏆 #7DaysofGiveaways https://t.co/mbGMYmTUGQ",
    "336": "Sadly the discrimination will never end. The Toronto Raptors are truly The Wretched of the Earth 😞✊🏻 https://t.co/x0baew9h4p",
    "337": "@Raptors @TangerineHoops @OAnunoby you already know what to do with that little Pat Beverley https://t.co/OUFg8mpPfT",
    "338": "@TangerineHoops @Raptors game 7 Kawhi’s winning shot vs 76ers #7daysofgiveaways",
    "339": "@TheJurassicPack @DaFamelessGamer @marcwinegust @Raptors @nbatopshot Alot of 👑s in the community!",
    "340": "@Raptors game day. Let’s hope the refs wear their contacts tonight",
    "341": "@CarusoHeadband @theScore @Raptors Cool https://t.co/FpXKeSRjns",
    "342": "In back to back game nights we have had another ticket giveaway in our Discord! Huge shoutout to @DaFamelessGamer who gave away his spare ticket to fellow JP member @marcwinegust. 🙌\nTruly the future of fandom for @Raptors fans.\n@nbatopshot #NBATopShotThis",
    "343": "@realAndy_A_R @theScore @Raptors you do know they have a better record than the raps… right?",
    "344": "We’re just gonna pretend that both the Raptors and Blue Jays haven’t won championships more recently than the Leafs and that both those franchises have had spectacular performance from Toronto Athletes? Not to mention the “should win it unanimously” stupidity in that tweet 🙄 https://t.co/UPwFo2z7hn",
    "345": "Coming up 3-7 w/ @MitchyGallo &amp; @Imstilljon : The Good, The Bad &amp; The Ugly @HelloooJack @Raptors @GMillerTSN @NHL_AaronWard @ClearSportInfo Gabriel Gervais @cfmontreal @NoelPButler @CanadaSoccerEN #TSN690 https://t.co/ZIpdAFp4xY",
    "346": "@TangerineHoops @Raptors At home with my husband @kenadams118 and we were sitting in the exact same spot we always sit in while watching all @Raptors games lol we are beyond #superstitious we made sure to continue so that they won the championship! #7DaysofGiveaways",
    "347": "@Cyrpto_Somali @Rafikigems @Chiba_inu1 @cryptocom @binance @OfficialTravlad @1goonrich @Drake @torontolife @CTVToronto @CityNewsTO @CBCToronto @Raptors @TorontoFC I have stopped following it. Is it doing good?",
    "348": "@TangerineHoops @Raptors I remember Mother's day May 12, 2019! Like it was yesterday 😲 Kawhi Leonard with that buzzer-beater that last-second basket was iconic and everything for the @Raptors and I will always remember that feeling! #7DaysofGiveaways https://t.co/Nv7dBuvoa1",
    "349": "Scottie Barnes Rookie of the Year. Pascal Siakam 3d team ALL NBA!\nLock it in! #NBA @Raptors",
    "350": "@Bell @Raptors identify black racism on indians in your new tech support training calls and control them.",
    "351": "@TangerineHoops @Raptors The Raptors celebration after winning it all.  Downtown was litty.   #7DaysofGiveaways #fingerscrossed",
    "352": "@torontogojaysg0 @Raptors @TangerineHoops hahaha",
    "353": "Boston Celtics vs Toronto Raptors - Full Game Highlights | March 28, 202... https://t.co/UprEFUrFGe via @YouTube",
    "354": "NBA:🏀\nCleveland Cavaliers Over/Alta 215 -110 \nIndiana Pacers +9.5 -110\nWashington Wizards -3 -110 \nWashington Wizards Over/Alta 218.5 -110\nToronto Raptors -2.5 -110 \n\n#apuestas #online",
    "355": "@MaxeyBetta @Raptors @hudsonsbay Job\n+ ratio\n+ Kawhi corner 3\n= Make a Finals first",
    "356": "Minnesota Timberwolves at Toronto Raptors odds, picks and predictions https://t.co/PUNdYgDG73",
    "357": "@Raptors @hudsonsbay Ain't that the same chica from the commercials there at the end?",
    "358": "⚡ NEW in 🏀\n\n💼 Graphic Designer\n🏢 Toronto Raptors | @Raptors\n🇨🇦 Toronto, ON\n📃 Full Time\n🎚 Intermediate\n🏷 #Basketball, #NBA, #GraphicDesign\n\nhttps://t.co/tUTbuGLrVx",
    "359": "@TangerineHoops @Raptors Got to go on the @CoorsLight Northern Invasion bus trip to Detroit in 2020 a little over a month before everything got shut down #7DaysofGiveaways",
    "360": "Wednesdays are for Toronto Raptors and All Elite Wrestling.",
    "361": "Back TORONTO RAPTORS to BEAT Minnesota Timberwolves tonight in the @NBA (Game Starts at 00.40 BST) #NBA #Basketball",
    "362": "🏀NBA🏀\nBoston Celtics vs Miami Heat\n\nThe Miami Heat ended their losing streak with a 123-100 victory over the Sacramento Kings.📈\n\nMeanwhile, the Boston Celtics are coming off a 112-115 OT loss against the Toronto Raptors on the road, with their first loss in six games.🔥 https://t.co/U6TylRCCb2",
    "363": "@NiceSheehan @Cam_Oflage But an overall story, that championship just leaves the neutral fan pretty cold. No one outside Toronto is thinking to themselves “man that raptors team was awesome”",
    "364": "🇺🇸 NBA  \n\nDallas Mavericks ML \nMiami Heat +7.5\nCharlotte Hornets ML\nToronto Raptors ML\nSacramento Kings ML\n\n#NBATwitter #NBA75 #GamblingTwitter https://t.co/KD6gcal46a",
    "365": "Toronto Raptors\n-2.5-111\nRisk $5.00  Win $4.50\n\nOver 234-111\nMemphis Grizzlies vs San Antonio Spurs\nRisk $5.00  Win $4.50",
    "366": "NBA Game Analysis: The Toronto Raptors have a forecast 54% chance to win against The Minnesota Timberwolves with a spread of -2.5/2.5 and an over/under of 227. The Toronto Raptors are 1 - 0 against The Minnesota Timberwolves in the 2021-22 Season.\n#bettingsports\n#sportbetting",
    "367": "BACK TO BACK WINS AGAINST BOSTON! So sweet to say... 😍\n\nAlso on Toronto Today - @SaraPoraria breaks down the Raptors standings, and the CanMNT have one last chance to top their group before #Qatar2022 🔥\n\n#WeTheNorth #LeafsForever #CANMNT #Sportsbetting https://t.co/ODG94fZXFR",
    "368": "@TangerineHoops @Raptors My favourite memory is... watching over the crowds when they won the championship...#Toronto #7DaysOfGiveaways https://t.co/7QhBlEV53B",
    "369": "@TangerineHoops @Raptors My favourite #Raptors memory??? Got to be this one: when Kawhi Leonard lit up Scotiabank Arena in Toronto with a dramatic buzzer-beater to send the Raptors to the Eastern Conference finals! #7DaysofGiveaways https://t.co/cfJuIX6Ehw",
    "370": "Minnesota Timberwolves at Toronto Raptors - 3/30/22 NBA Picks and Prediction https://t.co/gzslnYcqiZ\n\n#NBA #NBAPick #FreePick #FreePicks #SportsBetting #ExpertPick #NBATwitter #ExpertBettingAdvice #sportsbettingadvice #handicappers #SportsGambling #Picks #Timberwolves #WeTheNorth https://t.co/y9cbPD3WfY",
    "371": "Toronto Raptors Game Night at SIA🏀\n\n77% of the betting action at Sports Interaction like the #Raptors (-3) over the #Timberwolves.\n\nHere is our preview &amp; prediction:\nhttps://t.co/QB16ZPJMDP",
    "372": "#NBA \n\nMin/Tor\n\nTimberwolves are 5-2 ATS in the last 7 meetings in Toronto\nTimberwolves are 11-4 ATS in their last 15 games\nTimberwolves are 1-7 ATS in their last 8 games as a road underdog\nRaptors are 8-3 ATS in their last 11 games\nRaptors are 2-6 ATS in their last 8 home games",
    "373": "@brendanc82 The one thing that worries me is a Raptors-Celtics AND A #Leafs-Bruins series together.\n\nNo.\n\nI couldn't handle it. The pressure for at least one Toronto team to win their respective series😭",
    "374": "Toronto Raptors https://t.co/snEH5AqPxi",
    "375": "Minnesota Timberwolves at Toronto Raptors odds, picks and predictions \nhttps://t.co/OuzpSmAsCz",
    "376": "Timberwolves vs. Raptors picks and odds: Anthony Edwards comes up short in Toronto https://t.co/NPjvUpqAua",
    "377": "@TangerineHoops @Raptors My favourite raptors memory is definitely the Championship Parade. #7DaysofGiveaways https://t.co/iSrZtNuCfS",
    "378": "@TangerineHoops @Raptors Omg THE Parade! That day was just so much fun! Although it was lots of waiting around lol! But overall such a good day to see you favorite team with wonderful fans #7DaysofGiveaways",
    "379": "@TangerineHoops @Raptors @kawhileonard shot!! never forget that! #7DaysofGiveaways",
    "380": "@josee_28 @Raptors @pskills43 @FredVanVleet Leave now and use my ticket",
    "381": "@TangerineHoops @Raptors The raptors winning the championship 🏀🏀🏀🏀",
    "382": "@TangerineHoops @Raptors My real favorite memories are the Kawhi buzzer beater, and winning the championship, but it seemed like everybody was going all out with their answers, so I tried to be unique 😄\n\nThanks for the lovely contest @TangerineHoops 🙂🙏",
    "383": "@TangerineHoops @Raptors They used to sell 50/50 tickets in person at games, and volunteers who would get a t-shirt, pizza, and watch the gamesfrom a private box\n\nHaving the chance to see a game live was how I learned how fun watching Raptors games is, so that's my favorite memory 🙂\n\n#7DaysofGiveaways",
    "384": "@bellybybelly @Raptors @pskills43 @FredVanVleet And you didn’t invite me???",
    "385": "Minnesota Timberwolves vs Toronto Raptors NBA Pick and Prediction NBA Be... https://t.co/VH9mvJaD6h via @YouTube",
    "386": "@TangerineHoops @Raptors Game 7 vs Sixes, what a game #7DaysofGiveaways",
    "387": "Play of the day: Toronto Raptors -2.5 🤙🏽",
    "388": "@TangerineHoops @Raptors The Kawhi buzzer beater in 2019! #7DaysofGiveaways",
    "389": "@SRochesterNBA @Imman_Adan At least get your facts straight. @Raptors had no interest in having Dragic play more than a few games this year, because he's old and terrible. The GM who traded VC for Zo and scrubs has died- much like Heat fan base after LeBron left. Bubble Jimmy was cool though.",
    "390": "@TangerineHoops @Raptors #7DaysofGiveaways favourite memory is when they won the championship",
    "391": "Check out this listing I just found on #Poshmark: New Era 2019 NBA Playoffs Toronto Raptors SnapBack. https://t.co/NaUPOJjXOh #shopmycloset @poshmarkapp",
    "392": "@TangerineHoops @Raptors #7DaysofGiveaways when Toronto Raptos won an NBA Champion in 2019 and he’s was so much happy @the church. https://t.co/6PU0eSXeDR",
    "393": "Timberwolves vs. Raptors picks and odds: Anthony Edwards comes up short in Toronto https://t.co/w1QpQD5fKd",
    "394": "It’s Game day once again against the Toronto Raptors, time to step up and beat this team and then look on to Denver. ANT and DLO need to put it upon themselves to do better. Your question for tonight’s game is:\n\nHow many points will the big 3 combine for? #RaisedByWolves",
    "395": "@TangerineHoops @Raptors when the raps win the chip #7daysofgiveaways",
    "396": "@TangerineHoops @Raptors watching the game, especially their game winning shot in 2019! #7DaysofGiveaways",
    "397": "@TangerineHoops @Raptors When kids loves the Raptors team and stayed late for the game and win the tangerinefanangle 😍 #7DaysofGiveaways @TangerineHoops https://t.co/L4bJcRtqIv",
    "398": "@Imman_Adan The heat have reached the finals more times than the raptors have had 50 win seasons in the last 20 years 😂😂. \nI guess 50 win seasons is Toronto's participation trophy. No wonder all their franchise greats always peace tf out.",
    "399": "@Canadia17629681 @RichImbrogno @Raptors I’ll take the over",
    "400": "NBA FREE PICK 🚨\nTimberwolves vs Raptors 🏀\n\nPreview and Prediction 📋 \n\n▶️https://t.co/yFdlMgTYqo\n\n#NBA  #GamblingTwitter #freepicks #freepick #NBAPicks \n#RaisedByWolves  #Minnesota \n#WeTheNorth    #Toronto \n#freebet #bettingtwitter \n#nbabets #nba75 \n#NBATwitter  #basketball https://t.co/YRgq1PS7BZ",
    "401": "@TangerineHoops @Raptors Attending my first Raptors game with my family 🔥#7DaysofGiveaways",
    "402": "@malika_andrews We love our @pskills43 and you saw why!  Great interview.  @Raptors #WeTheNorth",
    "403": "Minnesota faces Toronto tonight. We need the Raptors to WIN. Once that happens, the Warriors MUST WIN to clinch a spot in the 2022 NBA Playoffs",
    "404": "@pskills43 We do love you 'up here'  @pskills43 @Raptors #WeTheNorth ❤️❤️❤️❤️",
    "405": "GAME DAY for the #Timberwolves!!\n🆚 Toronto Raptors \n⏰ 6:30PM CST\n📍 Scotiabank Arena \n#RaisedByWolves https://t.co/4UMbzdvZdB",
    "406": "@TangerineHoops @Raptors Leonard buzzer beater game 7 against Philly to win series. #7DaysofGiveaways",
    "407": "Love both Canada and US MLs tonight in soccer. Also love the Suns spread at banged up Golden State. Minnesota ML at Toronto off the back to back they also match really well against the raptors. Feelin confident about these picks but I’ve been ass lately so do what you like",
    "408": "@TangerineHoops @Raptors Being in Jurassic Park when they won in 2019!! The energy was UNMATCHED 🤩🥳 #7DaysofGiveaways",
    "409": "The Raptor's Laundry Tax Break | TurboTax #Toronto #Raptors #NBA Video: https://t.co/MqRFZWrW5M",
    "410": "@TangerineHoops @Raptors My favourite Raptors memory is in game 7 in 2019 in the game vs Philly and \"The Shot\" by Kawhi happened. #7DaysofGiveaways",
    "411": "@TangerineHoops @Raptors Has to be the championship parade🔥🏆 #7DaysofGiveaways",
    "412": "Nah I disagree. There would be a rivalry for sure between the Raptors and a new Montreal team but I don’t see it being toxic until a playoff series or a decade or so have passed. MTL team would get love from Toronto but I don’t see Raptors fans jumping ship tbh https://t.co/KnPVJkc98E",
    "413": "@Raptors Everyone is female that says they are female.",
    "414": "@TangerineHoops @Raptors It's a mix between winning the championships and the first game this season after not being able to see them play live for what seemed like forever #7DaysofGiveaways",
    "415": "@Toebald1 @RayzrRamon @BillSimmons zero titles since 2008. one title in the last 35 years. irrelevant. on the same level as the fucking toronto raptors.",
    "416": "@TangerineHoops @Raptors Ruffin tosses the ball up in the air just for Mo Pete to grab it and hit a buzzer-beating 3 to tie the game 👏 #7DaysofGiveaways",
    "417": "@TangerineHoops @Raptors Game 4 of the 2019 finals, my sister surprised me with a trip Toronto to watch the game at Jurassic Park. It was so amazing to share that moment with so many other fans #7DaysofGiveaways",
    "418": "First @Raptors game since 2020 tonight… couldn’t be more jacked up @pskills43 @FredVanVleet #WeTheNorth",
    "419": "@TangerineHoops @Raptors Watching and waiting… what felt like an eternity to see if @kawhileonard basket would make it!  It was a feeling/moment I will never forget.  Seeing Kawhi bent down on the court is forever embedded in my brain.  The anticipation was unreal. #7DaysofGiveaways",
    "420": "Here is my favourite guys… Because of my love for the Toronto Raptors 🏀 and the skin to go with it looks so clean 🔥 @JPunksNFT @JPunkCommunity #FlexYourRex #TribeCalledRex https://t.co/VShxr7Ci5D https://t.co/qeY2Rtq7iY",
    "421": "The @Raptors organization is looking to continue the conversation - equity for women and girls should not be limited to the month of March.  \n\nI can't wait to hear how we can continue to remove barriers.\n\n#BreakTheBias #WeTheNorth \n\nhttps://t.co/JJCJzbKw3Q",
    "422": "@TangerineHoops @Raptors The championship win! #7DaysofGiveaways",
    "423": "@TangerineHoops @Raptors Leonard game 7 against Philly #7DaysofGiveaways",
    "424": "@TangerineHoops @Raptors The Kawhi buzzer beater in 2019! ❤️🏀🏆 #7DaysofGiveaways",
    "425": "Analyzing Wednesday’s Minnesota Timberwolves at Toronto Raptors and lines, with NBA expert picks, predictions and best bets.  https://t.co/XLWJZmjEtL",
    "426": "@TangerineHoops @Raptors Winning the championship for Canada. #7DaysofGiveaways",
    "427": "@dbarrett24 I'll give it up if Toronto gives us the Raptors. That would make sense to me!",
    "428": "@TangerineHoops @Raptors Winning the championship for Canada. #7DaysofGiveaways",
    "429": "Toronto Maple Leafs were last Stanley Cup champions in 1967, when there were still just 6 NHL teams.\n\nToronto Blue Jays (est. 1977) have won 2 World Series &amp; Toronto Raptors (est. 1995) have won an NBA title since.\n\nWhat happens sooner: Toronto wins a Stanley Cup or a Super Bowl? https://t.co/FX7FTREwZn",
    "430": "@TangerineHoops @Raptors #7DaysofGiveaways Has to be the Raptors Championship Parade - what a great moment for the City of Toronto and Raptors Fans!! @Raptors",
    "431": "@TangerineHoops @Raptors Kawhi's game 7 buzzer beater! #7DaysofGiveaways",
    "432": "Minnesota Timberwolves at Toronto Raptors odds, picks and predictions https://t.co/WjMwyjzBlU",
    "433": "NBA Betting Trend: We have Toronto Raptors at -286, which is a 141 point difference from the current line.\n#sports\n#sportbetting",
    "434": "fans should be getting free tickets to a game for making us leave… and still playing after. @Raptors https://t.co/yYKidieYl3",
    "435": "@WooMadeKell @J_May111 @BamericaSZN @BBN_Forever @Ibra_Goat Since the Toronto Raptors became an expansion team in 1995,\nCeltics : 2008 Champions\nRaptors : 2019 Champions\n\nPlease stop talking, you’re a twitter casual who doesn’t know ball.",
    "436": "@TangerineHoops @Raptors The Ring ceremony #7DaysofGiveaways",
    "437": "@TangerineHoops @Raptors Kawhi's crazy game winner shot Game 7 vs 76ers. It was wild. #7DaysofGiveaways",
    "438": "@TangerineHoops @Raptors Watching Kawhi’s shot drop to beat the Sixers in 2019 #7DaysofGiveaways",
    "439": "@TangerineHoops @Raptors When the raptors won the championship #7daysofgiveaways",
    "440": "@TangerineHoops @Raptors #7DaysofGiveaways The buzzer beater in 2019",
    "441": "@TangerineHoops @Raptors Clinching a playoff spot and winning the championship 🏆 #7DaysofGiveaways",
    "442": "@HAYDENSANEHOLTZ @RasenRendanX @Raptors How many rings does Kawhi have with the clippers? If he Carried raptors why can’t he carry the clippers lol",
    "443": "@TangerineHoops @Raptors My fave is (oh and it’s the anniversary)… “AND A HAIL MARY THREE BY MO PETE” @TangerineHoops @Raptors #7DaysofGiveaways",
    "444": "If you’re a toronto raptors fan please pm me!",
    "445": "@dallasmavs vs. @cavs \n@nuggets vs. @Pacers \n@OrlandoMagic vs. @WashWizards \n@MiamiHEAT vs. @celtics \n@hornets vs. @nyknicks \n@Timberwolves vs. @Raptors",
    "446": "@2pacOutsider @Zak4701 @Raptors Boston has such a toxic fan base",
    "447": "@TangerineHoops @Raptors I've been watching the team for years, and honestly my fave memory is literally every dunk made by the GOAT #VinceCarter during the 2000 - 2001 season. Absolutely set the Raps on fire!! #7DaysofGiveaways",
    "448": "@TangerineHoops @Raptors #7DaysofGiveaways when they clinched playoff spot it was amazing and then winning the finals was the topping on the cake @theresakean",
    "449": "@TangerineHoops @Raptors Watching the games with my son @sportyman_dixon together at home but would love to go to a game in person #7DaysofGiveaways",
    "450": "@Raptors @TangerineHoops Need Siakam to drop 40 so Celshits fans can stop crying",
    "451": "@ctsbulls @Raptors https://t.co/BDk6nD9yNv\n\nJust cuz we needed to hear you call it! 🔥 with some Mo Pete 🌰's baby 🌰's @mopete24",
    "452": "@catriona0721 @Raptors I simply asked a question and u are roasting me for it how wise of you",
    "453": "@TangerineHoops @Raptors #7DaysofGiveaways It would have to be viewing the Championship Parade from Coronation Park. Viewing from that area was the best decision ever! Memories to last a lifetime!",
    "454": "@TangerineHoops @Raptors I was in downtown i can remember it as yesturday waiting 7 am at the park till what ever time the game was",
    "455": "@TangerineHoops @Raptors My favourite Raptors moment was going to Raptors game with Shaun from the Durham Dragons Special Hockey team I coach. It was both our first Raps game ever. #7DaysofGiveaways",
    "456": "@TangerineHoops @Raptors The championship parade 🏆❤️ #7DaysOfGiveaways",
    "457": "@TangerineHoops @Raptors Parade Day!!! My boys and I will never forget it!!! #7DaysofGiveaways https://t.co/H608Wy8rb6",
    "458": "Today my students worked as @Raptors statisticians and found the average points the Raptors scored during the 3 game winning streak vs. the Cavs, Pacers, and Celtics.   @NormanIngramPS https://t.co/pPYMcD9Rov",
    "459": "@TangerineHoops @Raptors When the raps got The 4th overall pick! Was with a bunch of friends who we soo stoked to get a top end pick!\n#7DaysofGiveaways",
    "460": "@LasVegasLocally Looks like Toronto Raptors relocating to Las Vegas",
    "461": "Oh hey! It's a @Raptors game day!",
    "462": "@TangerineHoops @Raptors My most recent favorite memory is watching Kawhi's shot against Philly drop. Earliest favorite memory is probably watching a preseason game in Billings Montana vs. KG and the Timberwolves. #7DaysofGiveaways",
    "463": "@TangerineHoops @Raptors My favourite @Raptors memory has to be seeing the champions at the championship parade #7DaysofGiveaways",
    "464": "@TangerineHoops @Raptors #7DaysofGiveaways the championship parade 🥇 🏀❤️",
    "465": "@TangerineHoops @Raptors The GROAT at the parade. #7DaysofGiveaways https://t.co/KtPuuttmEt",
    "466": "Last time the Raptors played the Timberwolves in Toronto, Rondae Hollis-Jefferson started at center. Man, I miss Rondae.",
    "467": "#latestnews GAME #76: Minnesota Timberwolves (43-33) @ TORONTO RAPTORS (43-32) - 7:30pm (EDT) on TSN 1/4 - https://t.co/mXLnQBAxcu (POST_EXCERPT}",
    "468": "#latestnews /r/TorontoRaptors and /r/Place - we meet again - https://t.co/bxYTupbDbX (POST_EXCERPT}",
    "469": "@TangerineHoops @Raptors The championship parade, THE shot and getting to sit courtside. #7DaysofGiveaways",
    "470": "@TangerineHoops @Raptors My very first and only raptors game in person is the best memory! I sat up so high and the energy in the building was amazing. It was over 10 years ago and I’ll never forget it! I loved the sense of community!  #7DaysofGiveaways",
    "471": "@Raptors Scottie and cade are better than mobley",
    "472": "@TangerineHoops @Raptors Celebrating at the Championship parade downtown with all of Canada!! @TangerineHoops #7DaysofGiveaways",
    "473": "@TangerineHoops @Raptors Other than winning the championship to pinpoint one moment it will forever be “The Shot”  #7DaysofGiveaways https://t.co/tuKGnjzlzK",
    "474": "@jeffisrael25 Something about Toronto Twitter between the raptors/C’s game on Monday and last night actually has Boston Twitter looking reasonable, lol",
    "475": "@TangerineHoops @Raptors when they won the championship obviously!! go raptors!! #7DaysofGiveaways",
    "476": "New post (Minnesota Timberwolves vs Toronto Raptors NBA Pick – March 30) has been published on The Sports Geek - https://t.co/aKc4usksgz https://t.co/GQF9TPqImF",
    "477": "@TangerineHoops @Raptors Them winning the championship! #7DaysOfGiveaways 🏀🏀",
    "478": "@TangerineHoops @Raptors Standing in Jurassic Park for G1 of the Finals for like over 11 hours w/ @drummerboii98_ #7DaysofGiveaways",
    "479": "@scream_ant2x @CelticsRiley You are basing this on one game where two raptors fouled out.  Toronto is long and can defend.  This month they already beat Phoenix, Philly and Denver fairly convincingly. This is a dangerous team with playoff experience.  All I am saying I would rather avoid them",
    "480": "@TangerineHoops @Raptors Kawhi's shot! #7DaysofGiveaways",
    "481": "@niho_17 @Raptors I cannot make this any easier for you to understand. 🤷🏽‍♀️",
    "482": "@TangerineHoops @Raptors Carter dunk competition 😏🤷‍♂️👀 #7DaysofGiveaways @MarilynJoy31",
    "483": "@TangerineHoops @Raptors When Fred Vanvleet dropped Markelle Fultz😮‍💨 #7DaysofGiveaways",
    "484": "@TangerineHoops @Raptors Taking my son to the championship parade #7DaysofGiveaways",
    "485": "@Raptors I’m past the age of having dreams like this, but I do wonder what it would have been like to see Amys, Kaylas, and Kias on sports broadcasts when I was younger. Love them and what they represent. ♥️",
    "486": "@TangerineHoops @Raptors #7DaysofGiveaways my favorite moment was @DeMar_DeRozan dunking over the entire pistons D for and one 🔥🔥🔥🔥🔥",
    "487": "@catriona0721 @Raptors The fuck are u talking abt",
    "488": "@TangerineHoops @Raptors My favourite Raptors was being at Game 6 of the Bucks-Raptors series in 2019.  When it became clear we were going to the NBA Finals I couldn't stop jumping up and down cheering as loud as possible! #7DaysofGiveaways",
    "489": "Host and producer, @SavHamilton11 is a force on and off the court. Read more about a day in the life of the ‘@Raptors Today’ and ‘SWISH: Inside the @WNBA' host, and how she supports equity, diversity and inclusion on the job. https://t.co/XzynDXtNF3",
    "490": "@niho_17 @Raptors Unreal that youR PFP is questioning someone else’s PFP.",
    "491": "@TangerineHoops @Raptors #7DaysofGiveaways  when they beat the Knicks and advanced to the second round for the first time in franchise history!!",
    "492": "@TangerineHoops @Raptors Favorite memory was definitely being on the fan angle! #7DaysofGiveaways",
    "493": "@AdamTaylorNBA Ideally we get the @Raptors so we can shut their annoying fan base up",
    "494": "@TangerineHoops @Raptors Being at the game for Kawhi's \"shot\" and capturing it on video! #7DaysofGiveaways",
    "495": "@TangerineHoops @Raptors My favourite Raptors memory was attending the championship parade!! #7DaysofGiveaways",
    "496": "@TangerineHoops @Raptors Walking up Yonge Street the night we won the championship with @garychak and @RyanWilkies #7DaysofGiveaways",
    "497": "@TangerineHoops @Raptors #7DaysofGiveaways @TangerineHoops my favourite memory is when the raptors win the nba championship for the first time it just made history in all the raptors fans",
    "498": "@Rays_Szn @seb3guerrier @lucas43591127 @BamsEra13 @Tjonesonthenba Toronto and Miami in bio. Can’t help but laugh. You switch to Miami after Kawhi left the raptors?",
    "499": "@ctsbulls @Raptors That was awesome totally \"Onions baby Onions\"",
    "500": "Basketball fans! New episode of Talking Raptors is up at Raptors Republic! The guys prepare for Lowry's return, look back on pre-season predictions and continue the Toronto Burger Power Rankings\nhttps://t.co/rEm9Vd4XgS https://t.co/9lDDOP8BO4",
    "501": "It’s Day 3 of #7DaysofGiveaways 🙌 \n \nWe’re giving away a pair of tickets to the @Raptors game on April 3rd. Here’s what you need to do to enter:\n \n- Respond down below with your favourite Raptors memory and use the hashtag #7DaysofGiveaways\n- Follow us on Twitter https://t.co/6eRFBZUnxe",
    "502": "The Toronto Raptors host the surging Minnesota Timberwolves tonight at Scotiabank Arena!\n\nWhat's your best bet for this huge cross-conference tilt?!\n\nhttps://t.co/JYLzlt0X8B  \n\n#WeTheNorth #RaisedByWolves #NBA75 https://t.co/pshWkALGnZ",
    "503": "Dear @Raptors ,\n\nI will be attending the game today. I was wondering if it was possible for me and my friends to warm up with the team. This will be my first raptors game ever. I want it to be special. It’s also our birthday soon. \n\nThank you,\nGreenlightguapo",
    "504": "@Raptors hey guys I’m coming to the game tonight vs the timberwolves can my best friend and i come early and see the players warm up pretty please🥺🥺🥺🥺",
    "505": "The last time the Timberwolves beat the Raptors in Toronto (Tampa doesn’t count)… was in 2004. \n\nSam Cassell had a 30-point double-double. Sprewell and KG had 24 and 28. Donyell Marshall’s 22 points couldn’t hold them off.",
    "506": "Check out this listing I just added to my #Poshmark closet: Toronto Raptor’s Nike T-shirt. https://t.co/nriFhjYG1Y #shopmycloset @poshmarkapp",
    "507": "🐺 WOLVES BACK TONIGHT 🐺\n\n🆚 Toronto Raptors (@RaptorsLead)\n⏰ 6:30pm CST\n📍 @ScotiabankArena \n📺 @BallySportsNOR \n\nTime to start the streak 🐺\n\n#RaisedByWolves https://t.co/Jvt3A2FbJb",
    "508": "Do the American sports media #ESPN consider Toronto Raptors as part of NBA? No mention, no highlights.... seriously!!",
    "509": "@UnibetFrance possible de sortir les cuts de OG Anunoby svp ( toronto raptors )",
    "510": "Hoping the @Raptors lay a smack down on a good Minnesota team tonight! https://t.co/vbYTOO0oaN",
    "511": "@_itsmarkymark @RichImbrogno Is Patrick Bev good for a flagrant foul tonight against the @Raptors or just a technical foul?",
    "512": "@nbatopshot @Raptors My hero",
    "513": "@Raptors More Amy, more Kayla, more Meghan, more Kia, more Kate!!!  more new voices!",
    "514": "@Raptors @TangerineHoops FredVanVleet don't be a decoy again and get bullied 😬 be healthy for the playoffs #WeTheNorth",
    "515": "@Raptors @TangerineHoops Lets Get the W #WeTheNorth",
    "516": "Mitchell &amp; Ness Toronto Raptors 1998 Vince Carter Stripes Purple Swingman Jersey https://t.co/CpIP8I3jUc eBay https://t.co/EImxWuQ1Mk",
    "517": "@TermineRadio He didn't go there because he couldn't win in Toronto.  He went there because the Raptors wouldn't have offered him a contract close to what other teams would have paid.",
    "518": "@Raptors @TangerineHoops Taking my son to his first @raptors game for his 15th birthday tonight! Sooooo excited!",
    "519": "@Raptors Game Day!",
    "520": "LET’S DO THIS @Raptors 💥 #GAMENIGHT\n@Timberwolves @NBACanada @NBA @gtrentjr @GTJGIRLS https://t.co/57UgknOoXb",
    "521": "@ctsbulls @Raptors Now will the Wizards foul, And it's a deflection by Ruffin, the play continues...petersoooooonnnn, GOT IT, GOT IT, GOT IT, I DONT BELIEVE WHAT I JUST SAW, ONIONS BABY ONIONS, a Hail Mary 3 by Mo Pete!!",
    "522": "@CMcElhinney @nbatopshot @Raptors @alxocity Love my S1 FVV moment that I also got in a trade with the King @alxocity 👑 https://t.co/F1RFNcw7C6",
    "523": "@EvelDick @technogaijin @RexChapman @Raptors mascot put in timeout for this https://t.co/ORgJpKL7AL",
    "524": "The Timberwolves head south tonight to take on the Raptors in Toronto",
    "525": "@nbatopshot @Raptors Without any hesitation it’s FFVs TSD! Was lucky enough to obtain mine in a trade with the goat himself @alxocity https://t.co/NAsSNdJehx",
    "526": "@MikeyVanVelsJr @TheDomValenti @WorldofIsaac @Raptors 2 is an awesome player. Unquestionably the right pick at 1, and the Pistons are gonna be dangerous for a decade.. he’s just not gonna be ROTY because he didn’t have as good a season as one or two other guys.",
    "527": "Going to the @Raptors game tonight with @LeahBandler  because @KatyVenneri_x ROCKS. Thanks sis (and thanks for being born Zo)",
    "528": "The @Timberwolves are 11-4 ATS in their last 15 games 👀\n\nCheck out the latest odds as they take on the @Raptors today 🔗 https://t.co/Fbd3mWGB4U https://t.co/eNl7TmAHai",
    "529": "@savomauro @nbatopshot @Raptors Nice little anniversary surprise! https://t.co/bt6DotOCez",
    "530": "@IBleedReality_ @RaptorsGen @yeayeahyeahya @BundIeUp @Raptors Grasping at straws are we?",
    "531": "@Raptors you telling him or m I https://t.co/mRanUQC6hO",
    "532": "Emotionally not ready for Kyle's Return to Toronto on Sunday.\n\nThese games all are meaning so much down the stretch, instead all of us are going to be emotional messes for that game.\n\nWe not ready😭\n\n#Raptors #WeTheNorth",
    "533": "Bro get this disgusting LGBT propaganda off your profile picture @Raptors",
    "534": "@nbatopshot @Raptors Gotta be the Fred S1 handles in the retro jersey… left his opponent with no ankles to walk on. Nasty 👌",
    "535": "@nbatopshot @Raptors Lol, I would love to see the look on @CMcElhinney 's face when he sees this tweet",
    "536": "@TangerineHoops @Raptors At home watching the game with friends on my tv #7DaysofGiveaways",
    "537": "NBA Free Prediction: Minnesota Timberwolves vs Toronto Raptors 3/30/22 https://t.co/4mNUblUbOI via @YouTube",
    "538": "@niho_17 @Raptors Acknowledgment and support of diversity✌️",
    "539": "On March 11th, the Raptors were -190 to make the playoffs.\n\nThis morning, Toronto is -4000 to make the playoffs.\n\n#WeTheNorth @TSN_Edge",
    "540": "Congrats on one year 🎉 \n\nFav @Raptors Moment? 👀#NBATopShotThis https://t.co/K2IHAUALQR",
    "541": "Former @Raptors @Klow7 still making 🇨🇦 proud, check out the “No Hidden Charges” XL HUG Director's Cut @bitbuy Commercial  | 😂 LOL, I’m loving the ads from @bitbuy since the super bowl. Great attention for #crypto #CEX &amp; @WonderFi $WNDR #DeFi👇🔥👇🔥👇\nhttps://t.co/FPSjzpuaE8",
    "542": "@Raptors I think the woman analysts bring a great insight into the game. I think Amy and Kia and the rest of the female crew are a breath of fresh air. Great job TSN and Sportsnet crew for taking the lead.",
    "543": "What @Celtics learned about bench players in loss to @Raptors Photos by @john_sok https://t.co/HwqOZ2lacs via @UnionLeader",
    "544": "Toronto Raptors vs Minnesota Timberwolves tonight!\n\nThe Minnesota Timberwolves cooled off a bit as they’ve lost 3 of their last 4 games. Meanwhile, the Toronto Raptors have been in red-hot form as they’ve won 9 of their last 11 games\n\nWill the Timberwolves bounce back? https://t.co/TnaRfwaohq",
    "545": "@Raptors What is this pfp",
    "546": "There is a Toronto Raptors game and in this game we are going to win https://t.co/pKoA5GdHgw",
    "547": "@MrOffside_J9 @Raptors @TangerineHoops We got scottie for a bad year that time lol",
    "548": "@Raptors @TangerineHoops Let’s go wolves hunting. Devour them!",
    "549": "@DET2335 @TheDomValenti @WorldofIsaac @Raptors he should be taxed for being on a better team? … it’s Canada. He’s taxed enough.  I don’t know about ‘afterthoughts’. He’s getting the ball. … but it does seem like my dude is always open.",
    "550": "@Raptors This is amazing @AmyAudibert one thing I would add is that your screen time just seems so natural on the screen that I think a lot of people can relate to you just like Noor 👏🏼",
    "551": "🏀🔥 RAPTORS GIVEAWAY 🏀🔥  You and your friends can catch an upcoming Toronto Raptors game in the decked-out VIP Leon’s Furniture Ultimate Living Room Suite!  \n\nGet your entry in by April 3! \n\nEnter here -&gt; https://t.co/suyak8Cslo\nOpen to Ontario residents only. https://t.co/wPSedREqvD",
    "552": "@Fortnit62648365 @Raptors @TangerineHoops Who Cares lol",
    "553": "@MelihUgurOktar @JonasJerebko @TrDetroit @DeMar_DeRozan @JrFarmar @Raptors @Tr_Raptors95 @LakeShowTurkiye @Jarrettjack03 Jonas Jerebko is teaming up with Putin's Russia\n\nIt's the end for Jonas Jerebko in the west.\n\nSwedish sponsor DUMPS him - rightfully so.\n\nHe's just finished off himself!\n\nGood luck in the new North Korea!",
    "554": "@Raptors @TangerineHoops Let's Gooo Raptors, Get This Win! #WeTheNorth",
    "555": "@Raptors @TangerineHoops Need a Gary masterclass he hasn't done shit since the 5 30 point games+ Win",
    "556": "RT: Raptors: https://t.co/AFf2wYMel1 @raptors @olgproline @NBACanada",
    "557": "RT: Raptors: So She Didn’t Have To - E03\n\nSeeing women like Amy on broadcasts across Canada encourage the next generation, like Noor, to pursue their dreams in this industry.\n\n#BreakTheBias https://t.co/j0WL6iLcnn @raptors @olgproline @NBACanada",
    "558": "@Raptors haven't received presale code for playoff tickets?? Sale started 10am",
    "559": "No one wants to say it so I'll say it:\n\nThe Toronto Raptors have the most unfair and uncompetitive advantage of any potential playoff opponent in NBA History.",
    "560": "FOR RENT - 📍Lower Simcoe St, Toronto \n\nhttps://t.co/v682FqOxWv\n\n#downtowntoronto #toronto #torontorealestate #TorontoMapleLeafs #torontorealtor #torontozoo #Toronto #TorontoRaptors",
    "561": "So She Didn’t Have To - E03\n\nSeeing women like Amy on broadcasts across Canada encourage the next generation, like Noor, to pursue their dreams in this industry.\n\n#BreakTheBias https://t.co/ms50eXfLZO",
    "562": "@RealCodyMallory We almost want Raptors to keep winning and the other 3 to lose right?  Nightmare scenario is Toronto in 7 hole.",
    "563": "#Toronto #Raptors: Just keep swimming, just keep swimming .. ... \n \nhttps://t.co/yaw8ZK67fu\n \n#Basketball #NationalBasketballAssociation #NBA #NBAEasternConference #NBAEasternConferenceAtlanticDivision #Ontario #TorontoRaptors https://t.co/5Id1axA25F",
    "564": "Your Daily NBA Tip is Here!\nD'Angelo Russell - Under 15.5 against the Toronto Raptors #nbabets #nbabetting https://t.co/rlUPK8248g",
    "565": "@TangerineHoops @Raptors What a night! I was travelling a lot during the entire run but made it home for tip and celebrated with the family. Great night! #7DaysofGiveaways",
    "566": "@Raptors @TangerineHoops Most underrated team in the NBA. Let’s get this win boys 💪🏾",
    "567": "4)...at full strength, and they're rolling, having won 3 straight and 9 of 11. There's no greater motivation than avoiding a play-in spot. Toronto currently sits just a game ahead of the 7th seed Cavs. This game does not set up well at all for the Wolves. Give me the Raptors -3.",
    "568": "Why are the @Lakers so bad? \nWhy are the @Raptors so good?",
    "569": "Kyle left Toronto because they were going younger not because they couldn’t win, It worked out for both Kyle and the Raptors https://t.co/4la2WxGDIY",
    "570": "@Raptors @TangerineHoops We need a W, Let's go Raps! 🔥💪🦖",
    "571": "@Raptors @TangerineHoops Can't wait , I will be there !",
    "572": ".⁦@JaredWeissNBA⁩ and I talk about the Cs missing TimeLord, that crazy game in Toronto, unhinged Raptors fans provoking ⁦@KeithSmithNBA⁩  https://t.co/foOScI4gPP",
    "573": "Toronto Raptors x LG Canada #LifesGoodMoment | Visions of Science\nhttps://t.co/NejlFo6589",
    "574": "RHTTC55   e-Magazine    電子雜誌: Toronto Raptors vs Boston Celtics Full Game Highli... https://t.co/bY48EL6nRf",
    "575": "New episode up at Raptors Republic! We discuss Kyle’s return, review our preseason predictions and continue the Toronto Burger Power Rankings \nhttps://t.co/1A4lXJapWg",
    "576": "@Raptors @CanadaSoccerEN Congratulations from Argentina",
    "577": "@Raptors @TangerineHoops Let’s get this WIN",
    "578": "@JaysGotNext @RoseTheGod @willflet0730 @Raptors Fax but like I say every year since 2019 \"this year is the year\"",
    "579": "ITS GAMEDAY\n\nTHE WOLVES LOOK TO GET THEIR FIRST WIN IN TORONTO SINCE 2004 AS THEY TAKE ON THE RAPTORS IN TORONTO AT 6:30 PM CENTRAL https://t.co/8G5Qw2MpuC",
    "580": "@TangerineHoops @Raptors I was home watching the game with my family #7DaysofGiveaways",
    "581": "@SociedadCivil22 @Raptors @TangerineHoops @celtics the refs hoeing us caused it. rmbr we had no pascal or scottie",
    "582": "@vridozXBL @Raptors @TangerineHoops We were shit last season 🤣 I’ll watch if we make the playoffs this time",
    "583": "@Raptors @TangerineHoops lets get it tonight against the wolves",
    "584": "@BundIeUp @Raptors @TangerineHoops shit same where u sit?",
    "585": "@BundIeUp @Raptors @TangerineHoops he'd be lucky to drop 15 at this point",
    "586": "@Appledollns @Raptors @TangerineHoops @Matt__Devlin Demar went to the spurs and dropped a triple double on us. The year we had kawhi, i remember that 😭 personally I loved him, remember his clutch 3 in the playoffs. Lowry was my favourite tho🥲",
    "587": "@TangerineHoops @Raptors Watching it on the big screen at the TIFF Lightbox! #7DaysofGiveaways  🙌",
    "588": "Have you entered to win a #TorontoRaptors coffee table, made from a piece of the '95 Rewind court? 👀 Contest is on now!! 🔥 Get your entries in here - &gt; https://t.co/jzr5nhToVi\nOpen to Ontario residents only. https://t.co/soxRwhKtB5",
    "589": "Let’s get this @Raptors https://t.co/mSJ5OiWuC8",
    "590": "@Raptors @TangerineHoops Trent vs Pat Bev Round 2. LEEEETTTTSSSS GOOOOOOOO",
    "591": "Aye @Raptors y’all gotta bring the legend @ctsbulls back! That energy is unmatched #OnionsBabyOnions https://t.co/9Ba9nZzWKo",
    "592": "@itzflyyer @HoodieTyroneSZN @elitejaylen @CoachAiree92 @Raptors If we were healthy it’d be a 4-0 sweep y’all are some bums",
    "593": "@Raptors @TangerineHoops Let’s Go @Raptors Let’s Get Another W Tonight 😎🙏 It’s gonna be another Spicy 🌶 kind of night #WeTheNorth https://t.co/dO8g8Lsf4D",
    "594": "@MrOffside_J9 @Raptors @TangerineHoops @Matt__Devlin Shining Star Fred V, follow up to my tweet typo.@Raptors @Matt__Devlin",
    "595": "Let’s Go @Raptors 😎 Let’s Get Another W Tonight 🙏 #WeTheNorth https://t.co/GckTnUqWFu",
    "596": "@MrOffside_J9 @Raptors @TangerineHoops Lowery wanted to leave, DeMar Rozen did not!!  Kawhi Leonard, didn't win for the Raptors, review the games from 2019,  Fred V, was a singing star that helped with the win.  Everyone talked about Leonard, he wasn't that great.  Lowery and Fred made this happen @Matt__Devlin",
    "597": "RT: Raptors: A big one tonight, let’s get this! \n\nIt’s @TangerineHoops Raptors Game Day! https://t.co/etHevzzVp8 @raptors @olgproline @NBACanada",
    "598": "@CelticsRiley Seeing as we just almost beat Toronto without Al, Jaylen and Jayson I’d gladly take the Raptors in the first.  Would also be a prime 2nd round matchup with either Philly or Chicago who I’m sure we could beat if Rob needs more time.",
    "599": "@Raptors @TangerineHoops y'all got this! #WeTheNorth",
    "600": "Minnesota Timberwolves vs  Toronto Raptors Prediction 3/30/22 - Free NBA... https://t.co/YWg5YHGxDK via @YouTube",
    "601": "@MrOffside_J9 @Raptors @TangerineHoops We are 6th seed",
    "602": "@Raptors @TangerineHoops manifesting a Toronto raptors win today",
    "603": "@Raptors @TangerineHoops Scottie and Pascal &gt; KAT and Ant #WeTheNorth",
    "604": "@Raptors @TangerineHoops Let's go",
    "605": "@Raptors @TangerineHoops whats up with that rainbow shit🤮🤢",
    "606": "@Raptors @TangerineHoops Are we gonna make the playoffs this year? I miss Lowry and Kawhi 🥲",
    "607": "@Raptors @TangerineHoops LFG Raptors 🏀",
    "608": "@Raptors @TangerineHoops Battle of The Norths! There can only be one! https://t.co/Vp3uFEfF8a",
    "609": "A big one tonight, let’s get this! \n\nIt’s @TangerineHoops Raptors Game Day! https://t.co/CJIB59vYSY",
    "610": "@CanadaSoccerEN @Raptors Who is on the far left?",
    "611": "NBA Basketball Game Betting Picks Simulator: 7:30 PM ET - Minnesota Timberwolves vs. Toronto Raptors - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/aeihB4l3MW #nba #sportsbetting #freepicks #cappertek",
    "612": "BODY BUZZ RECS is going to the Toronto Raptors game tonight. Legends watching legends. Only in Toronto, baby",
    "613": "Toronto #Raptors vs Minnesota \n #Timberwolves | 3/30/22  | NBA Free Picks and Props | NBA Betting tips.  \n\nWatch: https://t.co/4DfQLQPq3T\n\n#NBA #NBAPick #NBAPredictions #raptorsvstimberwolves",
    "614": "@TangerineHoops @Raptors At home watching with my family! #7DaysofGiveaways",
    "615": "How crazy would a @chicagobulls @Raptors 1st round be for @DeMar_DeRozan",
    "616": "This might as well just say “Toronto raptors executive on Scottie Barnes” https://t.co/IyaUPooByn",
    "617": "@Dragonzbonez @jtreddog @Raptors Toronto when they know they are a first round exit but will still say how bright of a future they have https://t.co/yPHiOJYvey",
    "618": "@robinson4206 @Raptors @MastercardCA Thanks ! We had so much fun",
    "619": "@yyz_bliss @Raptors @MastercardCA Thanks doll! Yours is coming up soon?!?",
    "620": "@Raptors @snipabrooks_ Congratulations Armani, now make God, your family, and Toronto Raptors fans by helping the Raptors win a 2nd Championship.....",
    "621": "@TangerineHoops @Raptors Been a @Raptors fan for the so many years, and watching that moment at home with family was the greatest day of our lives. We then drove downtown and celebrated with the city. What a historical moment. #7DaysofGiveaways",
    "622": "You Don't Want To Play Pascal Siakam And The Raptors In The Playoffs https://t.co/Rzh0hpRtAy via @YouTube\n\n#nba #NBAPlayoffs #basketball #bball #raptors #toronto #torontoraptors #WeTheNorth #sports #espn #podcast #youtube #YouTuber",
    "623": "Bet Result Alert: @CoryCove wins $20 from @ZachHalverson as Hawk and Parrish successfully name over 0.5 Toronto Raptors. https://t.co/CthKEsMIEt",
    "624": "@TangerineHoops @Raptors At home watching the game! #7DaysofGiveaways",
    "625": "Only a few weeknight home @OrlandoMagic games left this season! Ride FREE with your game day ticket. Friday, April 1 @ 7:00 p.m. vs. Toronto Raptors. ⛹️\n\nThe north and southbound train leaves Church Street Station after the game. It's just a 5-minute walk to the @AmwayCenter! https://t.co/SFskxSPlmX",
    "626": "@reXzab1 @darianmurr @NBA @celtics @Raptors Anyways, good.",
    "627": "i want donovan mitchell to be a toronto raptor.",
    "628": "#DidYouKnowFlow: The #Sixers have the NBA’s easiest remaining strength of schedule. Their final remaining opponents have a combined winning percentage of .404.  The #BrooklynNets have the 3rd easiest at .455, #AtlantaHawks have the 5th (.468) and #TorontoRaptors the 6th (.470).",
    "629": "I hope we send y’all home fr @Raptors",
    "630": "March 30, 2007: At the buzzer, Toronto’s Morris Peterson (@mopete24) hits one of the most improbable 3-pointers to force OT at Washington. \n\nThe Raptors won in OT 123-118. https://t.co/UigAOSHIBD",
    "631": "@MeeMichie @dyc1958 @ms_chi_town_eb @Imdatchick1985 @Naahledge @divateach37 @James_hyke14 @BIGJAMES_2 @12Chains @Raptors Yesterday here it was 21 today 80 huh? LOL",
    "632": "@SarahPSmart @Raptors @MastercardCA I can’t wait to see a game. Your pictures look amazing.",
    "633": "With Chicago’s win last night, the Raptors are now sandwiched between the Bulls and Cavs in the standings. With a win tonight, Toronto could potentially move two games up on the Cavs and get closer to catching the Bulls! Will the Raptors come out victorious??? #WeTheNorth #NBA75",
    "634": "@TangerineHoops @Raptors #7DaysofGiveaways  we join the city of Mississaugua at Square https://t.co/69Up2GZSc0 was 6 in the six as they won the championship in game 6 - what a night",
    "635": "@tennistrader7 @Retro_Rooz_ @JaysGotNext @FrancoisTrentJr @Raptors How many Raptor games have you watched this year?",
    "636": "@Cofe6370 @dyc1958 @ms_chi_town_eb @Imdatchick1985 @Naahledge @divateach37 @James_hyke14 @BIGJAMES_2 @12Chains @Raptors Yup she crazy for sure lol",
    "637": "@Reese_eeee I have 2 favs, Raptors and Blazers, but I will always like Toronto more\nAnd I like the Bulls and Heat bc of Kyle Lowry and DeMar DeRozan, respectfully.",
    "638": "@TangerineHoops @Raptors My hubby Ken is the biggest Raptors fan! #7DaysofGiveaways",
    "639": "@MeeMichie @dyc1958 @ms_chi_town_eb @Imdatchick1985 @Naahledge @divateach37 @James_hyke14 @BIGJAMES_2 @12Chains @Raptors Good morning fam we do too crazy Mother Nature.",
    "640": "NBA Free Prediction: Minnesota Timberwolves vs Toronto Raptors 3/30/22 https://t.co/X6DOa8FL5G via @YouTube",
    "641": "@tripleosaint @Raptors 🤣😂🤣 Bout to get real cold when that Northern wind comes down on y’all 😌",
    "642": "@IBleedReality_ @RaptorsGen @yeayeahyeahya @BundIeUp @Raptors Twitter ain’t my life lmao",
    "643": "Good morning and happy Wednesday, another round of cold temperatures abd possibly icy conditions today in Toronto but the good news, it'll be 15 Celsius tomorrow. \n\nAlso happy Raptors game day!!\n\nHave a great day everybody",
    "644": "TORONTO STAR\n15 years later: The oral history of Morris Peterson’s miracle shot in Washington\n\nBy Libaan Osman\n\n#Toronto #Raptors\nhttps://t.co/hTkkWjyCc4",
    "645": "Minnesota Timberwolves vs. Toronto Raptors 3/30/22 NBA Picks, Predictions, Odds - https://t.co/WdIEwvDsea https://t.co/3ql2Zc86gb https://t.co/svuAY4hEac",
    "646": "@TangerineHoops @Raptors Watching with the family ❤ #7DaysofGiveaways",
    "647": "@Dragonzbonez @jtreddog @Raptors I went on raptors twitter to see what they were saying and all i saw was toxic raptor fans so I responded",
    "648": "@dyc1958 @Cofe6370 @ms_chi_town_eb @Imdatchick1985 @Naahledge @divateach37 @James_hyke14 @BIGJAMES_2 @12Chains @Raptors Good morning family happy Wednesday 😊 we got some crazy weather coming",
    "649": "@julius_seizure @WorldofIsaac @dallasvarcoe @Raptors Do you know that Cade is good on that side of the ball?",
    "650": "@TangerineHoops @Raptors I was at home watching the game with my family and friends. #7DaysofGiveaways",
    "651": "@IBleedReality_ @RaptorsGen @yeayeahyeahya @BundIeUp @Raptors Y’all got one Mickey win after we lost our best player in history.",
    "652": "Toronto has beaten Boston on b2b nights. First, the @Raptors edged the @Celtics on Monday. Then the @MapleLeafs socked it to the @NHLBruins last night, despite losing 3 players to injuries. Take that, #Beantown!",
    "653": "Minnesota Timberwolves vs Toronto Raptors Match Preview, Prediction, Betting Odds &amp; Spreads - March 30th, 2022 | NBA Season 2021-22 https://t.co/6NqZvhKf37 #Basketball",
    "654": "@TangerineHoops @Raptors I was watching the game from home at Edmonton with my son who is ardent fan of Raptors. \n#7DaysofGiveaways",
    "655": "The Toronto Raptors should trade Trae Young for Ja Morant #WeTheNorth https://t.co/BjBWr1PrRN",
    "656": "🏀NBA🏀 #NBA \n🏀Saison régulière🏀\n\nLos Angeles Clippers - Utah Jazz\nCleveland Cavaliers - Dallas Mavericks\nIndiana Pacers - Denver Nuggets\nWashington Wizards - Orlando Magic\nBoston Celtics - Miami Heat\nNew York Knicks- Charlotte Hornets\nToronto Raptors - Minnesota Timberwolves",
    "657": "Spicy P has shocked @Raptors fans across the world!! He doesn’t like Spicy Food 😮 \n\n#WeTheNorth https://t.co/QZQw9Pdsg2",
    "658": "@Moviestu @Raptors @BlueJays @Sportsnet @Leafs @BonsieTweets I understand that and I would always expect bias, but the Boston commentary wasn’t actually representative of what’s on the ice. You can’t skew it to that degree imo",
    "659": "Overnight #NBA75 Play\n\nToronto Raptors -2.5 (-110)\n\nRaptors 8-2 in their last 10 and have the 4th best ATS record against non-conference opponents (16-11-1). Great situational spot for the Raptors who are in great form.\n\n#GamblingTwitter #SportsBetting #NBATwitter #FreePicks https://t.co/ZUyxaZNewR",
    "660": "@TangerineHoops @Raptors I was at home watching the game with my son … yeah, it was a long night, no sleep … no work or school the next day! #7DaysOfGiveaways",
    "661": "I can’t believe I’m going to Toronto in less than 10 days to watch my first raptors game ever and my first Blue Jays game at Rogers Center and not in Seattle",
    "662": "Liked on YouTube: He didn’t need to confuse them 😂 (via @Raptors) #nba https://t.co/z9NDOOtk6E",
    "663": "toronto raptors have the worst fans in the nba and i have not met a single one that is not a complete little bitch",
    "664": "@Quintssential @NBATV @pskills43 @Raptors Bro dropped 40 on a team who had 4 of their staring 5 out 🤯🤯🤯😱😱😱",
    "665": "Minnesota Timberwolves at Toronto Raptors 3/30/22 - NBA Picks &amp; Predictions https://t.co/6GhJTRwngi https://t.co/jPmi7REYQi",
    "666": "\"an epic movie poster of Kyle Lowry in a Toronto raptors jersey about to fight Godzilla outside the cn tower\" https://t.co/T0QLyROtsS",
    "667": "@ShopRSApparel @Raptors Hello, will you guys be getting any more of these jerseys in stock for custom name and number orders?",
    "668": "@jacob13805918 @_CoachDave_ @DrGuru_ The Raptors moved back from Tampa to playing home games in Toronto. Cleveland had 2 young guys take all-star leaps. Cmon bro you acting like this shit a carry job, it’s disingenuous. Pistons got a 2-14 record and the 4th worst net rating in NBA history without Cade this year",
    "669": "New Orleans Jazz\nUtah Raptors\nToronto Huskies\n\nBalance. https://t.co/AQyN4O7Yz6",
    "670": "Early &amp; surprising prediction: Raptors will be in the #NBA 2022 Championship game @Raptors @NBA #NBAPlayoffs",
    "671": "Washington Wizards - Orlando Magic\nBoston Celtics - Miami Heat\nToronto Raptors - Minnesota Timberwolves\n\nBet slip link: https://t.co/mgaANzbkVU https://t.co/7ZBxnK7kqr",
    "672": "Cleveland Cavaliers - Dallas Mavericks\nBoston Celtics - Miami Heat\nToronto Raptors - Minnesota Timberwolves\nNew York Knicks - Charlotte Hornets\n\nBet slip link: https://t.co/9IpIxsk1UM https://t.co/vMAIGksO6C",
    "673": "@kellysgoatee @KD35v Then why was Toronto 11th seed last year with Siakam and Fred? Not to mention the loss of Lowry should've tanked them even further... 🤔 I wonder what addition the raptors made from last year that improved their seeding to 6th in the east (in a much harder year too)",
    "674": "Haven't gotten the chance to listen to the all new episode of the 'Battle Born Raptors' podcast yet? Go check it out when you have the chance! (LINK&gt; https://t.co/RocIDPLIlY) Don't wait for the playoffs get in on your Toronto Raptors now before it's to late! #Raptors #WeTheNorth",
    "675": "https://t.co/1UzVjTWADw NBA2k22, Chicago Bulls 18-4, Double-header; Toronto then Boston, 2nd season, MyCareer mode #73.  Tonight, we have a double-header on deck as we face the Toronto Raptors then Boston Celtics. Looking to make it back trophy run with a different team.",
    "676": "I don’t get why the teams at the top of the East standings don’t want the number 1 spot!? @BrooklynNets is going to finish at 6st spot. You don’t want to be the 3rd seed. The @cavs and @Raptors are losing at least 3 more games. Look at their remaining schedule Book it! @NBAonTNT",
    "677": "April 7th: @sixers v @Raptors and @memgrizz v @nuggets \nNeither one is on National TV…. Instead, @NBAonTNT is airing @lakers v @warriors",
    "678": "Leon's is giving YOU a chance to bring home a piece of Toronto Raptors franchise history! Enter to win a one-of-a-kind coffee table, made from a piece of the 25th Anniversary “95 Rewind Court”! Don’t miss your chance to enter! https://t.co/yVZfYsb6yl",
    "679": "Tonight @Timberwolves vs @Raptors #WeTheNorth",
    "680": "I think it could be great to see all 3 Toronto teams win the championships of their respective sport!   Raptors, Leafs, and Blue Jays all being champs.  That'd be great!  I got to watch the magic of the 2019 Raptors championship run, and that was so much fun!",
    "681": "The official cover of my song \"Northside Champions\" which features the diversity of @Raptors &amp; @Toronto. The different cultures and age groups all gathering together to celebrate a legendary moment of Toronto's history in 2019 #NBA #Champions \nhttps://t.co/XYgK6BUZxq via @opensea",
    "682": "also easier to do ya mom when the toronto raptors",
    "683": "@Moviestu @victoriastewxrt @Raptors @BlueJays @Sportsnet @Leafs @BonsieTweets No that's not how it should be.  Talk about your team and talk up your team, sure.  But blatantly ignoring brutal things your team does while calling for murder charges on the other team for a trip is ridiculous.  Yes I'm exaggerating but not by much when it comes to Jack Edwards",
    "684": "@BarnesFanClub However he also seems the type that would be bothered a little by the \"unfinished feeling\" of his time in Toronto.  He never got to play here again as a Raptor.  On that side of things yeah he might regret it a bit.",
    "685": "@TangerineHoops @Raptors #7DaysofGiveaways I was in my family room with my mom dad and sister! Sitting on the couch screaming and jumping up and down with my family😅",
    "686": "@OGgoat2022 @Slim_Debrisket @willymarner @NHLBruins toronto sports are annoyingly good to be fair. leafs are fun. i just think we match against lots of toronto teams such as leafs and raptors. Jays are gonna scare me for years. like alot",
    "687": "@FredVanVleet Be healthy for the playoffs... This youtube take is for you, hope @Raptors think about it too 👍🏼 #WeTheNorth \n\nhttps://t.co/xEtTCVMp0H",
    "688": "@Lvl1Reese @Siakamback Exactly. I love it. I haven't been this excited about a rookie on the Raptors ever (though I only really became a fan when I moved to Toronto in '02). His ceiling is so damn high.",
    "689": "The Rooks’ annual performance @Raptors #rapscitysocial @ScottBarnes561 @DALANOBANTON @JusChampagnie https://t.co/dKrpakrIhj",
    "690": "NBA Basketball Game Betting Picks Simulator: 3/30/2022 7:30 PM ET - Minnesota Timberwolves vs. Toronto Raptors - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/aeihB4l3MW #nba #sportsbetting #freepicks #cappertek",
    "691": "@TangerineHoops @Raptors On the streets of Toronto with everyone else",
    "692": "The Utah NBA franchise should be the Raptors, the New Orleans franchise should be the Jazz again, the Toronto NBA franchise should not be allowed to exist",
    "693": "@TangerineHoops @Raptors Was at my parents house and hosted a “Raps are winning their first championship” party and was the neighbourhood honker when it happened! #7DaysofGiveaways",
    "694": "@TangerineHoops @Raptors The whole clan was at my parent's house watching the game! As soon as everyone knew we won the championship, the whole house was explosive. Some crying, jumping and others are just rolling on the floor. It's a once-in-a-lifetime experience! Let's go Raptors!!! #7DaysofGiveaways",
    "695": "Toronto Raptors' T-Formation BLOB system is part of the NEW Best BLOB Systems PLAYBOOK - https://t.co/MWJjIDzZSO\n\n274 BLOBs from around the 🌎\n26 different teams\n42 Unique systems\n16 Unique Formations\n40+ mins of actions\n\nMore Special Situations: https://t.co/DhtYNcOb7O https://t.co/I34Y3MbKRJ",
    "696": "@ywtfpat @ashan1738 @Raptors No shit guy, thats what happens when you have been an NBA team since 1946 when there was only 11 franchises 😂",
    "697": "@TangerineHoops @Raptors at home celebrating! #7DaysofGiveaways",
    "698": "@tennistrader7 @edwards03970093 @JaysGotNext @FrancoisTrentJr @Raptors Leafs lost 3-1 up to MTL but they lost their captain and Matthews played with a busted wrist\n\nthings just need to click with some damn luck. The team needs it",
    "699": "@mowbraydave @darianmurr @NBA @celtics @Raptors Hahaha ok. Barely clinging to the 6th spot and 1 game from play in lol.  You must be so proud boy 😂 https://t.co/IYKHOdK4x3",
    "700": "@chanpatr @KwesiW1 @NBA @Raptors Oh there it is there’s always a few people that use the refs excuse.",
    "701": "@TangerineHoops @Raptors My husband is one of the biggest Raptors fan wherever we are he will find a way to watch the game #7DaysofGiveaways ❤️❤️❤️",
    "702": "@TangerineHoops @Raptors At home #7DaysofGiveaways",
    "703": "@TangerineHoops @Raptors At home #7DaysofGiveaways",
    "704": "@TangerineHoops @Raptors At home with our friends cheering for the Raptors to win enjoying the game #7DaysofGiveaways",
    "705": "@GiannisNewEra @Imahooper77 SIXERS ARE GOING TO THE CONFERENCE FINALS. THEY WILL BEAT THE TORONTO RAPTORS IN 6 GAMES AND THE MIAMI HEAT IN 5 GAMES AND WILL MEET KEVIN DURANT IN THE CONFERENCE FINALS🤝💯",
    "706": "@reXzab1 @darianmurr @NBA @celtics @Raptors No play in here. Haha. And the bruins got spanked tonight too. The Six kicking some bean town ass https://t.co/euxWGt9LWt",
    "707": "@tennistrader7 @edwards03970093 @JaysGotNext @FrancoisTrentJr @Raptors Jays pitching rotation is finally solid",
    "708": "Toronto Raptors - Minnesota Timberwolves\nNew York Knicks - Charlotte Hornets\nHouston Rockets - Sacramento Kings\nOklahoma City Thunder - Atlanta Hawks\n\nBet slip link: https://t.co/aaypiJEqHz https://t.co/zOob7JCQdL",
    "709": "@Raptors After what I saw in 2019, don't tell me nothing about impossible",
    "710": "@Raptors @TangerineHoops It is really a shame for the @Raptors to go the extra mile in OT to barely beat a stars-less @celtics.\n\nThings will get ugly come playoff time if that win defines this team.",
    "711": "@TangerineHoops @Raptors I was at home,  yelling and cheering infront of the tv #7DaysofGiveaways",
    "712": "@TangerineHoops @Raptors I stayed up late watched them win and ordered a bunch of championship gear... went to sleep for 2 hours woke up went to work... best day ever #7DaysofGiveaways",
    "713": "@TangerineHoops @Raptors #7DaysofGiveaways @Raptors I was at home with family and friends enjoying no actually going crazy shouting at the top of our lungs at every touch of the ball cheering our Raptors on. It was an amazing experience that we will never forget along with millions of other Raptor fans.",
    "714": "@dallasvarcoe @Raptors Barnes hasn't been better than Cade. Sorry.",
    "715": "@MikeMJoseph @Raptors Had to give love to my second team.. love them raptors",
    "716": "@Bychancetoronto @Raptors @celtics against boston’s G league team lmfao",
    "717": "@WorldofIsaac Guess you’re not flipping it over to the @Raptors games all that much.",
    "718": "@OwnedByToronto @Raptorsgirl2 @Raptors @pskills43 lmfao celtics didn’t have brown tatum horford or williams lmfaoooo that’s 4 out of 5 starters. idc what refs wanted, if your a good tea you should of handled them. Boston should of won that game with g league players",
    "719": "@TangerineHoops @Raptors At home cheering on the Raptors! #7DaysofGiveaways",
    "720": "@TheNBACentral @nsitto2 Guess he hasn’t caught that many @Raptors games.",
    "721": "@paulotacoss @DrGuru_ Why are you questioning lebron conference competition, did not he win all of them? Anyways here some, 2011 does seed bulls with the mvp rose, 2011 super team Boston, 2007 Detroit pistons, 2015 first seed hawks,  2016 and 2015 Toronto raptors, 2020 Houston with rusell and harden",
    "722": "@TangerineHoops @Raptors We were on a family trip in BC and went to a restaurant to watch the game. My son was so excited to watch the whole game with the time change. We cheered so loud at the win, and had other non-sports fans looking at us like we crazy!! #7DaysofGiveaways",
    "723": "@TangerineHoops @Raptors At home with family celebrating! #7DaysofGiveaways",
    "724": "@TangerineHoops @Raptors At home unfortunately. With young children can’t be out every other night to watch the games. Hoped we’d close it out at home in game 5, and went out that night but it wasn’t meant to be, so I missed the chaos/celebration but went to the parade…. #7DaysofGiveaways",
    "725": "@LitFamTing @Raptors Can’t wait for my Heatles to play y’all now that I know you a Raptors fan 👀😂",
    "726": "@TangerineHoops @Raptors watching and cheering at home with my family   #7DaysofGiveaways",
    "727": "@socmediaisdumb thats how i felt about raptors fans except i didnt hate toronto to begin with lol",
    "728": "@MastercardCA @Raptors With my dad @DonHalld #Priceless",
    "729": "@TangerineHoops @Raptors @TangerineHoops I was in my basement with a bevvie waiting to see history unfold #7DaysofGiveaways",
    "730": "@victoriastewxrt It’s their home broadcast, like the @Raptors and @BlueJays that’s how it should be.    It’s THEIR broadcast, it’s just that on @Sportsnet the @leafs broadcast tries to be neutral and ends up being a pro opponent broadcast.  I wish @BonsieTweets still did the games.",
    "731": "@BundIeUp @RaptorsGen @IBleedReality_ @Cronotic4 @Raptors U by any chance or na? https://t.co/eI6hBGjphl",
    "732": "@NBA_Math @SportsMathNet Only one player positive in both… the ROY is a Toronto Raptor",
    "733": "@_marlanderthews raptors leafs win &amp; celtics bruins lose great day to be a Toronto fan",
    "734": "@mowbraydave @darianmurr @NBA @celtics @Raptors Delusional lol. Jelly with a play in team? Come on. You’re probably the one mad for your team sucking last night right? 😂 get real boy",
    "735": "@Raptors only good in gleague + he washed 🤡",
    "736": "Last night: Toronto #Raptors defeated the Boston Celtics.\n\nTonight: Toronto Maple #Leafs defeated the Boston Bruins.\n\nSuck it, Boston.\n\n#LeafsForever #WeTheNorth",
    "737": "@BigGame81375698 @YKDurrani @Raptors @Toronto I wish for the Raptors in the playoffs. Like please. Let us play you guys. You can save this. That’s how confident I am we would beat the raptors in a 7 game series.",
    "738": "@MapleLeafs defeat the Boston Bruins today.\n\n@Raptors deafeated the Boston Celtics yesterday.\n\nThis makes me extraordinarily happy. \n\n#LeafsForever | #WeTheNorth https://t.co/FXtWiTNNH4",
    "739": "@tennistrader7 @Retro_Rooz_ @JaysGotNext @FrancoisTrentJr @Raptors And the jays going to kick ur ass too.",
    "740": "Raptors beat The Celtics last night\nLeafs beat the Bruins tonight \n\nI'm loving this mini sweep of Toronto teams over Boston teams #WeTheNorth #LeafsForever https://t.co/VxyW2q9zVG",
    "741": "This Leafs / Bruins game reminded me of last nights Raptors / Celtic game. Both Toronto teams had beat the refs too #LeafsForever #WeTheNorth",
    "742": "@max_maryott @YKDurrani @Raptors @Toronto You’re not good at this … \n\nWe already discussed this … \n\nBe careful what you wish for … \n\nHasta luego",
    "743": "both @MapleLeafs and @Raptors get big wins against a couple of Boston teams! Huge! #torontosports #LeafsForever",
    "744": "@reXzab1 @darianmurr @NBA @celtics @Raptors Haha. So mad. So jelly.",
    "745": "@TangerineHoops @Raptors #7DaysofGiveaways I was in my apartment  but went to celebrate with everyone at young and eg... it was SO cool 😎",
    "746": "Raptors beat a Celtics team missing 3 players\nToronto beat the Bruins with 2 dmen injurd in the game, a top d man out, their #1 goalie out and an injured goalie in the game.\n\nBOSTON IS JUST A SHIT CITY",
    "747": "The Raptors beat the Celtics yesterday and The Leafs beat the Bruins today. I think its safe to say Toronto OWNS Boston. #WeTheNorth #LeafsForever",
    "748": "Leon's is giving YOU a chance to bring home a piece of Toronto Raptors franchise history! Enter to win a one-of-a-kind coffee table, made from a piece of the 25th Anniversary “95 Rewind Court”! Don’t miss your chance to enter! https://t.co/TvUVuiyg1r",
    "749": "@BigGame81375698 @YKDurrani @Raptors @Toronto Yeah y’all look nice tonight congrats. Hope we see you in the playoffs but y’all will prolly already be out by the time we could play…",
    "750": "@ericjackson So many good potential match-ups for the 1st round in the East. Every team in the top 4 should be afraid of the @Raptors",
    "751": "lets ride @Raptors https://t.co/afaYaTd9tO",
    "752": "@TangerineHoops @Raptors My 7 year old son, he loves basketball and lovesssss the Raptors#7DaysofGiveaways",
    "753": "@TangerineHoops @Raptors #7DaysofGiveaways at home with my hubs! He woke up the baby shouting when they won",
    "754": "@TangerineHoops @Raptors #7DaysofGiveaways @TangerineHoops I was watching the game at my house hoping that we would win (of course) and celebrating when the final buzzer went off in game 6 It was one of the happiest days in my life seeing the raptors win there first championship",
    "755": "@TangerineHoops @Raptors We were at home watching and cheering on...amazing win #7DaysofGiveaways",
    "756": "@WiththeCrazies @Jer_Lincoln @MLBONFOX @BlueJays They completely ignore the Jays ownership.Completely refuse to acknowledge that this is a telecommunications juggernaut. You aren’t dealing with some $40 million dollar payroll team here. They also own part of the Raptors, Leaf’s, Toronto FC. This is a massive operation",
    "757": "@TermineRadio There is karma to consider when Miami cheats Toronto by sending a player over (Dragic) that refuses to play hard for his new team. Very low indeed. #curseofthe raptors",
    "758": "This kid isn’t even 21 yet. If he continues on this trajectory? Look out #NBA \n\n#NBA #NBATwitter #NBAFans #Toronto #Raptors https://t.co/EpejXcR88K",
    "759": "@TangerineHoops @Raptors Sitting on the edge of my sofa crying.  #7DaysofGiveaways",
    "760": "@AmeerJHamid They were probably reading the standings and then came across Toronto like TORONTO?! When was Toronto in the picture? Quick what do we say about the Raptors?",
    "761": "@max_maryott @YKDurrani @Raptors @Toronto Ah \n\nThe \n\nPast \n\nThe last bastion of the untrained mind …\n#leafsforever",
    "762": "@bigbadbruins73 Raptors for the nba leafs for the nhl. Must be something real wrong in Toronto.",
    "763": "@TangerineHoops @Raptors Broken down on the 401. #7DaysofGiveaways",
    "764": "@BigGame81375698 @YKDurrani @Raptors @Toronto Hahah okay… my interpretation: I’ll play Florida/Carolina over Tampa ALL DAY LONG so y’all can have this one and a top 3 spot in the division for all I care. I’m content with Game 7 2013. Sure you remember that one, almost as bad of a meltdown as the Montreal series last year.",
    "765": "🏀🔥 RAPTORS GIVEAWAY 🏀🔥  You and your friends can catch an upcoming Toronto Raptors game in the decked-out VIP Leon’s Furniture Ultimate Living Room Suite!  \n\nGet your entry in by April 3! \n\nEnter here -&gt; https://t.co/VniSlJXE96\nOpen to Ontario residents only. https://t.co/OIpRTm2fu7",
    "766": "#Toronto #Raptors: Follow along as our third Welcome #Toronto creator @kyanbeadz hit up her first ev... \n \nhttps://t.co/mQS7aOxTey\n \n#Basketball #NationalBasketballAssociation #NBA #NBAEasternConference #NBAEasternConferenceAtlanticDivision #Ontario #TorontoRaptors https://t.co/BORfusjuHY",
    "767": "@konradreed5 I was recently in Toronto and caught a raptors game. After that, I’m 100% on team new arena. However, I’m not a fan of the location by Mardi Gras world. @SeanVanderbrook has the best idea - tear down the Zion garage and the post office building. Put the arena there.",
    "768": "@TangerineHoops @Raptors Watching at home on the edge of my seat. #7DaysofGiveaways",
    "769": "@tennistrader7 @Retro_Rooz_ @JaysGotNext @FrancoisTrentJr @Raptors Celtics last night, Bruins tonight. TORONTO rules.",
    "770": "@CRTF_Zod @Raptors they starting to get the memo",
    "771": "@TangerineHoops @Raptors Was at a friends house with a bunch of fellow raptors fans #7DaysofGiveaways",
    "772": "@TangerineHoops @Raptors I was at home glued to the TV",
    "773": "@DOMVALLIE @Raptors glad to c we’re on the come up",
    "774": "Scottie Barnes: *breaths*\n\nr/torontoraptors: https://t.co/zaGRhzLxbe",
    "775": "went to my first @Raptors game yesterday, i think they thought i was drake 😭 https://t.co/J6x305xrEC",
    "776": "@max_maryott @YKDurrani @Raptors @Toronto Another zinger … interpret that \n#LeafsForever",
    "777": "@MastercardCA @Raptors @VerushkaVertigo of course! #Priceless 💜",
    "778": "@TangerineHoops @Raptors Boston Pizza with friends it was a once in a lifetime experience",
    "779": "@WeWantShazier @Kurantin4 @TwinsPIsWin W fan I actually like raptors because I have a lot of cousins in Toronto and I go there a lot",
    "780": "@TangerineHoops @Raptors I was in PEI on an east coast roadtrip having major fomo!! #7DaysofGiveaways",
    "781": "🏀🔥 RAPTORS GIVEAWAY 🏀🔥  You and your friends can catch an upcoming Toronto Raptors game in the decked-out VIP Leon’s Furniture Ultimate Living Room Suite!  \n\nGet your entry in by April 3! \n\nEnter here -&gt; https://t.co/iU9Inzy3ZG\nOpen to Ontario residents only. https://t.co/XEnI5rWGMt",
    "782": "My husband and I don’t like the Grimace in the @Raptors ad. He looks like a gumdrop. \n\nGrimace is NOT a gumdrop.",
    "783": "@TangerineHoops @Raptors Out on the streets with the rest of TO! #7DaysofGiveaways",
    "784": "NBA BOOM 💥 \n\nToronto raptors -2.5 -110 1u✅\n\nDenver Nuggets 1Q ML -130 0.5u✅\n\nDenver Nuggets 1H -2 -110 0.5u❌\n\nSan Antonio Spurs 1Q -2.5 -110 0.5u✅\n\nSan Antonio Spurs 1H -4.5 -110 0.5u✅\n\nChicago Bulls ML/Spurs 1H ML +135 0.5u❌\n\nPlays like these posted daily in our discord😎 https://t.co/LuZy3PjTdo",
    "785": "Wednesday 3/30 #NBA  #bettingpicks  #FreePicks #bettingexpert #bettingtips @Timberwolves vs. @Raptors and @hornets  vs. @nyknicks  @OffShoreGaming @DocsSports @DougUpstone https://t.co/jj8JtSg3BF https://t.co/7jMyFq8zP7 via @YouTube",
    "786": "I hope we get Toronto in the first round. After seeing everything Raptors fans are saying when they barely beat the Maine Celtics in over time I am confident the Celtics win the series in 5.",
    "787": "@TangerineHoops @Raptors I was leaving early the next morning to go camping but had to stay awake to watch the game and all the excitement that happened downtown. #7DaysofGiveaways",
    "788": "Toronto, Canada — Pascal Siakam poured in 40 points as the Toronto Raptors snapped the Boston Celtics’ six-game win streak with a 115-112 overtime victory on Monday.\n\nRead more:\nhttps://t.co/t37AUIiXby\n\n#DailyTribune",
    "789": "Toronto, Canada — Pascal Siakam poured in 40 points as the Toronto Raptors snapped the Boston Celtics’ six-game win streak with a 115-112 overtime victory on Monday.\n\nRead more:\nhttps://t.co/HaY1zxTFBs\n\n#DailyTribune",
    "790": "The @CanadaSoccerEN team hit the court during the @raptors vs @celtics battle in #toronto #WeTheNorth https://t.co/4s1KfYxq42",
    "791": "Saying the heat aren’t better than Toronto is immeasurably dishonest. Lowry no longer fit on the current team. He had to go. He’s done fine in Miami however and the heat wipe the raptors. https://t.co/nKnA1t4nou",
    "792": "@TangerineHoops @Raptors We called our neighbors to watch in our home with us! #7DaysofGiveaways",
    "793": "@TangerineHoops @Raptors Jumping up and down in my family room🏀",
    "794": "@TangerineHoops @Raptors My hubby and I watched the game at home when the Raptors won the championship.  We went out to party with everyone on the streets of Toronto afterwards! #7DaysofGiveaways",
    "795": "Chris Bosh Toronto Raptors 200 #thehobby #ad https://t.co/wk2eazlwp7",
    "796": "Props to the Raptors for somehow landing Grimace for a commercial. That’s a HUGE score! \nToo bad it only happened because the Fry Guys died from covid.\n#RIPFryGuys #Grimace @Raptors",
    "797": "@BigGame81375698 @YKDurrani @Raptors @Toronto Tweets don’t need understanding they need interpreting. Understanding is basic.",
    "798": "@TangerineHoops @Raptors In my living room cheering #7DaysofGiveaways",
    "799": "@CoreyB08 There was a change that came into effect January 15th, 2022\n\nLast time @Celtics play @Raptors was \nNovember 28th, 2021\n\nFirst Round Rematch? Next Question. \n@jaytatum0 ☘️ &gt;&gt;&gt; @pskills43 🦖 https://t.co/eixDFlClNm",
    "800": "https://t.co/ptXemEDCGH\nToronto #Raptors vs. #Minnesota #Timberwolves #NBA #Betting Tips and Best Bets\n#2021 #basketball #betting #BettingPicks #BettingTips #BrooklynNets #Karl-AnthonyT...",
    "801": "Hoping that Toronto vs Boston from last night’s @Raptors inspires the same matchup for the @MapleLeafs tonight\n\nSo far so good… \n3-1 after Period 1\n\nHope I don’t regret sending this tweet\n\n#WeTheNorth \n#LeafsForever",
    "802": "ESPN’s Stephen A. Smith sees the Miami Heat as being vulnerable to losing to either the Brooklyn Nets or Toronto Raptors in the playoffs.  https://t.co/NELjHw20Hx",
    "803": "@TangerineHoops @Raptors I was watching the game with a buddy in my living room 🏀🏀🏀 #7DaysofGiveaways",
    "804": "@TraeFor3 @Raptors_Noahh Honestly Toronto is amazing. One of my fav landmarks is referred to as “Jane and Finch”. A pure beauty",
    "805": "@rlenhard15 @digitalpoet @slomo450 @TheNBACentral Lol telling on yourself, Scottie initiates Toronto’s offense more often thank you think (again just say you don’t watch any raptors ball). And to answer your efficiency question…while yes there’s some truth to that, Scottie is doing a pretty bang up job there considering.",
    "806": "@yeayeahyeahya @antc1924 @DuganTheDm @NBA @Raptors Mo? And talking about grammar.. haha go back to school, get off twitter",
    "807": "@yeayeahyeahya @antc1924 @DuganTheDm @NBA @Raptors What you said is delusional",
    "808": "@mrdanipak @antc1924 @DuganTheDm @NBA @Raptors What did I say that would of pointed to “ delusional “ fyi I see that you got mo grammar comprehension dude",
    "809": "Leon's is giving YOU a chance to bring home a piece of Toronto Raptors franchise history! Enter to win a one-of-a-kind coffee table, made from a piece of the 25th Anniversary “95 Rewind Court”! Don’t miss your chance to enter! https://t.co/apRKa5zSwa",
    "810": "@yeayeahyeahya @antc1924 @DuganTheDm @NBA @Raptors Now I see you delusional",
    "811": "@antc1924 @DuganTheDm @NBA @Raptors Games won on the court not on paper",
    "812": "@mrdanipak @antc1924 @DuganTheDm @NBA @Raptors It wouldn’t be a test it would of been a blowout and raptors aren’t good that’s the problem that y’all can’t get through ya tiny brainz. Not even talkin shi jus bein hones",
    "813": "@antc1924 @DuganTheDm @NBA @Raptors I didnt say we were better..",
    "814": "@ZachloyLoy @GarnetMacIntyre @TermineRadio That’s why every game outside of Toronto has a lot of Raptor fans?….. right",
    "815": "@malika_andrews Wow @espn acknowledging the @Raptors exist...",
    "816": "@yeayeahyeahya @antc1924 @DuganTheDm @NBA @Raptors Im done arguing something that didn’t happen.. Your stars didn’t show up.. or they unvaxed and cannot go to TO, which will work great for you in playoffs. I am not arguing that Celtics are not good.. Raps are good too. Wanted to see healthy Celtics vs us, as a test",
    "817": "No one wants to see the @Raptors in that 1st round 👀",
    "818": "@TangerineHoops @Raptors The biggest Raptors fan I know is my brother. #7DaysofGiveaways",
    "819": "@TangerineHoops @Raptors I was watching with friends!! #7DaysofGiveaways @carol_belll",
    "820": "@TangerineHoops @Raptors At my house with the championship crew. \nWe’re Superstitious so we always watch in the basement with my dog constantly barking. #7DaysofGiveaways",
    "821": "@TangerineHoops @Raptors With friends huddling over the smallest table at  Scaddabush because we couldn’t get into our usual watering hole. We ate Osmows for dinner for good luck. A night I’ll never forget #7DaysofGiveaways https://t.co/rkqCrfuTX1",
    "822": "@Tesla42593687 @2pacOutsider @Ronancreery @jsbettah @ashan1738 @Raptors Not sure why you tagged me when I am a Raptors fan lol",
    "823": "@mrdanipak @DuganTheDm @NBA @Raptors Stop using facts man he legitimately thinks Toronto is actually better then the Celtics are are playing the best basketball in the NBA over the last 2+ months. GTFO with that didn’t want no smoke BS just hope they don’t play a full Celtics squad in the playoffs the go home in 4🤡"
}