{
    "0": "ALERT: New high roller bet posted!\nA bet has been placed for $8,000.00 on Philadelphia 76ers - Phoenix Suns to win $14,880.00.\nTo view this bet or copy it https://t.co/mEY2fsukdo https://t.co/EXMBAhvuir",
    "1": "THE PHOENIX SUNS WILL BEAT THE PHILADELPHIA 76ERS!!!!!!!!!! 💜🧡💜🧡💜🧡💜🧡💜🧡☀️☀️☀️☀️☀️☀️☀️.",
    "2": "THE PHOENIX SUNS WILL BEAT THE PHILADELPHIA 76ERS!!!!!!!!!! 💜🧡💜🧡💜🧡💜🧡💜🧡☀️☀️☀️☀️☀️☀️☀️",
    "3": "PHOENIX SUNS vs PHILADELPHIA 76ERS Today!!!! 💜🧡💜🧡☀️☀️.",
    "4": "PHOENIX SUNS vs PHILADELPHIA 76ERS Today!!!! 💜🧡💜🧡☀️☀️",
    "5": "Phoenix Suns Vs Philadelphia 76ers| Live Reactions And Play By Play https://t.co/nvsRMzrUmw via @YouTube",
    "6": "02/08/2022 POTD: 13-4 \n\nToday’s pick: NBA\n\nPhoenix Suns vs Philadelphia 76ers\n\nPick: Suns 1st quarter ML (-110) \n\nBOL to all tailing! Let’s get this bread today fellas! \n\n#NBA #bettingtwitter #bettingpicks #bettingsports #NBATwitter #bettingtipster",
    "7": "Steve Nash repeats himself, expects James Harden to remain with Nets #Philadelphia #76ers #NBA https://t.co/WNnQBTEhi9",
    "8": "ALERT: New high roller bet posted!\nA bet has been placed for $9,416.20 on Philadelphia 76ers - Phoenix Suns to win $18,738.23.\nTo view this bet or copy it https://t.co/3lK69nh77H https://t.co/7YueSRll8Z",
    "9": "Philadelphia 76ers - Phoenix Suns\n\nBet slip link: https://t.co/iyD05njM9T https://t.co/Pk9PRrRSTp",
    "10": "Philadelphia 76ers (-1) vs. Phoenix Suns! #HereTheyCome #ValleyProud #NBA #NBATwitter #NBA75",
    "11": "I just heard a rumor from a internal reliable source that the Philadelphia #76ers are acquiring star guard James Harden in a trade with the Brooklyn #Nets for Ben Simmons, Tyrese Maxey and a 2023 first rd pick. Deal expected to be completed in the coming hours.",
    "12": "Tonight's starting lineup for the Philadelphia 76ers:  Maxey, Curry, Thybulle, Harris, Embiid https://t.co/bVWH4ANapA",
    "13": "Philadelphia 76ers - Phoenix Suns\nBrooklyn Nets - Boston Celtics\nAtlanta Hawks - Indiana Pacers\n\nBet slip link: https://t.co/Oyf7pf0j8p https://t.co/vlGha9U6l4",
    "14": "Ben Simmons: #Ben Simmons Not too long after the Philadelphia 76ers dropped their Game 7 matchup against the Atlanta Hawks at home, Sixers All-Star Ben Simmons addressed the me #BenSimmons https://t.co/2PsqJ16WGe",
    "15": "I just heard a rumor from an internal reliable source that the Philadelphia #76ers are acquiring star guard James Harden in a trade with the Brooklyn #Nets for Ben Simmons, Danny Green and a 2023 first rd pick. Deal expected to be officially announced in the coming hours.🤷🏾‍♂️🤷🏾‍♂️",
    "16": "Sam Amick of The Athletic reported the Philadelphia 76ers \"strongly believe he won’t re-sign with the Nets and remain hopeful that Brooklyn sees the light before the deadline buzzer sounds.\"\n@sam_amick",
    "17": "Per ESPN's Brian Windhorst, there is \"absolutely a chance\" the Brooklyn Nets and Philadelphia 76ers strike a deal that involves the two All-Star point guards.",
    "18": "Philadelphia 76ers vs Phoenix Suns Basketball Live | 2022 NBA[Stream HD] : https://t.co/m78ZSaPDEx | 8-Feb-22 | 19:00 | NBA | Basketball | Phoenix Suns | Philadelphia 76ers | Live | 2022 Basketball NBA Phoenix Suns vs Philadelphia 76ers | Philadelphia 76ers vs Phoenix Suns Live https://t.co/bNf0ItjROA",
    "19": "@WhatsYaWager @BovadaOfficial Good Afternoon hope you are having a good day today id like to request a bet please.  #WhatsYaWager Jae Crowder of the Phoenix Suns to record a double double against Philadelphia 76ers.  Thank you.",
    "20": "Sources tell me James harden has been traded to the Philadelphia 76ers for Tobias Harris, Josh Harris, and gritty. Should be announced in the next few hours",
    "21": "Philadelphia 76ers to beat Phoenix Suns @1.83",
    "22": "CONFIRMED TRADE\nReal Madrid Baloncesto receive Joel Embiid\nPhiladelphia 76ers receive Cristiano Ronaldo's used underwear. https://t.co/2VcKeVzFSn",
    "23": "A new mock trade has the Philadelphia 76ers sending Ben Simmons to the Washington Wizards.  https://t.co/DIz3WV4Jnp",
    "24": "Philadelphia 76ers to beat Phoenix Suns @1.83",
    "25": "Breaking: The Los Angeles Lakers have trade LeBron James, and Anthony Davis to the Philadelphia 76ers for Ben Simmons, Tobias Harris, and a 2025 second-round draft pick.",
    "26": "Sixers without four players ahead of clash vs Suns; Matisse Thybulle questionable #InjuryReport #Philadelphia76ers #PhoenixSuns https://t.co/XyG3UMVsoJ",
    "27": "Official: James Harden has been traded to the Philadelphia 76ers for Ben Simmons, Seth Curry and 1 2023 first round pick. Sources tell @TheAthletic.",
    "28": "@WashWizards Wizards I would still do a sign and trade deal that would send Bradley Beal to the Philadelphia 76ers for Ben Simmons.",
    "29": "Joel Embiid can lead his Philadelphia 76ers to a rare victory over Chris Paul and his Phoenix Suns. The Suns may be winded, which favors the Sixers 🏀 \n\n#NBA #HereTheyCome #ValleyProud\n\nhttps://t.co/DEg7Sxy3O0",
    "30": "@TedLeonsis Ted, I would still do a sign and trade deal that would send Bradley Beal to the Philadelphia 76ers for Ben Simmons.",
    "31": "Sources: The Brooklyn Nets are now close to finalizing a deal to send NBA All-Star James Harden to the Philadelphia 76ers in a blockbuster trade. League sources tell @TheAthletic @Stadium",
    "32": "Today's first game is the Phoenix Suns @ Philadelphia 76ers. Free play is the over 217.5 total points -110 (1.90 odds)",
    "33": "The Boston Celtics are acquiring star point guard Ben Simmons from the Philadelphia 76ers, sources tell me. Details soon to come.",
    "34": "NBA LIVE TODAY🔴 Phoenix Suns vs Philadelphia 76ers - 8th February 2022 |... https://t.co/Z9uTHz6qeR",
    "35": "Philadelphia 76ers 🆚 Phoenix Suns\n\nLet’s diagnose this game a bit.\n\n@DeadPresPicks brings the stethoscope. 🩺 \n\nBet $112 to Win $100... 💰\n\n#NBAPicks #bettingsports | #BeatTheOdds👊 \n\nhttps://t.co/0Fa8vU2lBH",
    "36": "The Philadelphia 76ers have traded their entire team, besides Tyrese Maxey. https://t.co/9jXtSv1a8F https://t.co/lpgs5hGh8l",
    "37": "Ben Simmons's NBA career with the Philadelphia 76ers is at its lowest ebb. How on earth did it come to this? - ABC News https://t.co/XvIHQW8b1C",
    "38": "TIP: Philadelphia 76ers - Phoenix Suns, 215.5+, 1.70 by #tipster Partizan1970 (profit this month: +65.28)\n  #betting #Basketball #Philadelphia #76ers #Phoenix #Suns",
    "39": "BREAKING:  Sources tell me the Philadelphia 76ers and Brooklyn Nets have agreed to a deal that will send Nets superstar James Harden to Philadelphia for a package centered around Ben Simmons.”",
    "40": "The New York Knicks, Indiana Pacers, Philadelphia 76ers and the Utah Jazz have all reached out to the Kings with interest in De’Aaron Fox, per @Schultz_Report. https://t.co/EEvLvQLHGj",
    "41": "BREAKING NEWS: The Philadelphia 76ers are trading Ben Simmons to Brooklyn for James Harden. Sources close to the situation confirm.#NBATradeDeadline #NBATwitter",
    "42": "BREAKING: \nThe Brooklyn Nets are sending star player James Harden to the Philadelphia 76ers for Ben Simmons, Danny Green, a 2022 first round pick, and two future 2023 second round picks in a blockbuster trade per @wojespn",
    "43": "Bobby Marks explains just how the Ben Simmons-James Harden trade could work   | NBA Today #Philadelphia #76ers #NBA Video: https://t.co/nl70OqEPWD",
    "44": "I just heard a rumor from a internal reliable source that the Philadelphia #76ers are acquiring star guard James Harden in a trade with the Brooklyn #Nets for Ben Simmons, Danny Green and a 2023 first rd pick. Deal expected to be officially announced in the coming hours.",
    "45": "Doc Rivers, Sixers give respect to Suns star, Hall of Famer, Chris Paul #Philadelphia #76ers #NBA https://t.co/yV0ALZnppi",
    "46": "2/8/22\nToday’s #MoneyMoves\nPhiladelphia 76ers ML\nVegas Golden Knights ML\n\nBeen on a roll lately let’s keep it goin!!\n#GamblingTwitter",
    "47": "📌 Apuesta baloncesto – NBA 21/22 – PHILADELPHIA 76ers vs PHOENIX SUNS\n🔗 https://t.co/5OBGB6omWZ https://t.co/nyeJQ9Ih1p",
    "48": "📌 Apuesta baloncesto – NBA 21/22 – PHILADELPHIA 76ers vs PHOENIX SUNS\n🔗 https://t.co/IBWRslghLY https://t.co/xfaDJephEO",
    "49": "For the longest time, Tyrese Haliburton was considered untouchable. As it turns out, the Philadelphia 76ers had their eyes on a more established prize.\n\n[@MattyBreisch]\nhttps://t.co/MjL8gDFRyE",
    "50": "Doc Rivers and the Philadelphia 76ers give their respect to Phoenix Suns star and Hall of Famer Chris Paul.  https://t.co/aQb4D60TGg",
    "51": "SOURCES: Ben Simmons has requested a trade from the Philadelphia 76ers. More to come",
    "52": "The Philadelphia 76ers “strongly believe” James Harden won’t re-sign with the Nets this summer, source @TheAthletic #76ers https://t.co/zAR5bskdgw",
    "53": "The Philadelphia 76ers are 28-13 when Joel Embiid plays, per Basketball Reference",
    "54": "“He’ll either bolt from Brooklyn in free agency, like so many predict, leaving the Nets to wonder why they didn’t avoid that uncomfortable, costly ending to their failed partnership by playing ball in February when the Philadelphia 76ers were calling.”\n\nDid Morey write this? https://t.co/wuenLsCogm",
    "55": "ESPN’s Stephen A. Smith says it would be stupid if the Philadelphia 76ers sent Ben Simmons to the Brooklyn Nets.  https://t.co/MQ3dcY6zS4",
    "56": "I just heard a rumor from a internal reliable source that the Philadelphia #76ers are acquiring star guard James Harden in a trade with the Brooklyn #Nets for Ben Simmons, Danny Green and a 2023 first rd pick. Deal expected to be officially announced in the coming hours.",
    "57": "2022-02-08\nAtlanta Hawks(-12.5) - Indiana Pacers(+12.5): \nBet on Atlanta Hawks -12.5\n\n2022-02-08\nPhiladelphia 76ers(-1.5) - Phoenix Suns(+1.5): \nBet on Philadelphia 76ers -1.5\n\n#NBA #bettingtwitter #bettingsports",
    "58": "I just heard a rumor from a internal reliable source that the Philadelphia #76ers are acquiring star guard James Harden in a trade with the Brooklyn #Nets for Ben Simmons, Danny Green and a 2023 first rd pick. Deal expected to be officially announced in the coming hours.",
    "59": "Philadelphia 76ers General Manager Darryl Morey is closing in on a deal to acquire Superstar Guard James Hrden from the Brooklyn Nets. Deal includes Guard Ben Simmons and a flurry of picks. Sources tell @TheAthletic @BallsackSports",
    "60": "🏀 NBA\n🇺🇸 Phoenix Suns vs Philadelphia 76ers\n👉 Phoenix Suns ML @ -120\n\n#FreePick #ApuestaGratis #NBA https://t.co/M1h315GmiD",
    "61": "The Philadelphia 76ers are active in trade talks at the deadline, but will that be a big deal after all? \n\n#NBA75 | #NBA | #NBATwitter | #WhoAreThey | #HereTheyCome | #Philadelphia | #Sixers | #76ers https://t.co/qQwHxEG5l4",
    "62": "Philadelphia 76ers are trading for James Harden. This is the result of days of trade talks between Philadelphia and Brooklyn sides. The initial trade package Philadelphia offered was Ben Simmons and Jaden Springer with some unknown picks. Then Curry was added to the trade.",
    "63": "NBA Betting Trend: Philadelphia 76ers are 13 - 3 versus very good teams - outscoring their opponents by 6+ points/game while at home over the last three years\n#bettingsports\n#sportbetting",
    "64": "Phoenix Suns vs. Philadelphia 76ers picks, predictions, odds: Who wins NBA game Tuesday? https://t.co/XSfxVx6mT0 via @hawkcentral",
    "65": "Phoenix Suns visits Philadelphia 76ers Predictions and Preview for 2/8/2022 today.  Who are we taking in this game?  Find out now. #Basketball #NBA https://t.co/D81FF5CPPD",
    "66": "SOURCES: The Philadelphia #76ers front office has gone back and forth with my psychiatrist, and they’ve decided to trade me to an asylum after being diagnosed with trade deadline-induced insanity!",
    "67": "Looking for a value bet?  See if the Phoenix Suns-Philadelphia 76ers Predictions and Preview for 2/8/2022 is one in our preview.  No crazy hype just a prediction and preview. #Basketball #NBA https://t.co/D81FF5UqHb",
    "68": "Nick Wright explains why Nets should trade James Harden to Sixers now #Philadelphia #76ers #NBA https://t.co/jq03tmNRln",
    "69": "Nick Wright of First Things First explains why the Brooklyn Nets should send James Harden to the Philadelphia 76ers now.  https://t.co/6v7kDATrgA",
    "70": "Your Vancouver Canucks face off against the Arizona Coyotes 🙌 Secure your table now!\n🏀 Phoenix Suns vs Philadelphia 76ers @ 4:00 pm\n🏒Arizona Coyotes vs Vancouver Canucks @ 7:00 pm\n🏌🏻‍♀️AT&amp;T Pebble Beach Pro-Am - PGA Tour @ TBD\n#socloseyoucanfeelit #SB https://t.co/0bHBlSur6I",
    "71": "BREAKING:\n\nThe Philadelphia 76ers are trading Ben Simmons to Brooklyn for this NYC style pizza. \n\nDaryl Morey finally gets the haul he’s been waiting for. https://t.co/02ryPBizyg",
    "72": "The Philadelphia 76ers are acquiring James Harden in a trade, sources tell ESPN.",
    "73": "Today's NBA Picks: 7:10 PM ET - Phoenix Suns vs. Philadelphia 76ers - 19 PICKS AVAILABLE: https://t.co/6BW2rmXJzj #nba",
    "74": "'It's a TENSE situation!' - JJ Redick on 76ers trade deadline conversations | SportsCenter #Philadelphia #76ers #NBA Video: https://t.co/ES13ToBMkr",
    "75": "My sources are telling me that James Harden is getting traded to the Philadelphia 76ers for Ben Simmons, Seth Curry, and a 2023 unprotected first round pick",
    "76": "What the #Philadelphia76ers going to do? It's an heated topic right now!",
    "77": "My favourites to win the NBA championship if the rumoured trades go through: \nPhoenix Suns \nGolden State Warriors \nMilwaukee Bucks\nBrooklyn Nets\nLos Angeles Lakers  \nPhiladelphia 76ers",
    "78": "What an outstanding opportunity for our student media professionals!! \n\n@lwilson013,@nearn_9, @brimackay15, @Kenz_Garrettt, and @DannyRy02 were able to sit down and talk to the first ever female broadcaster for the Philadelphia 76ers, @katetscott !! 🏀 \n\n#sixers #basketball https://t.co/W32JrbDVbw",
    "79": "Sources: The Philadelphia #76ers are acquiring star guard James Harden in a trade with the Brooklyn #Nets in a package centered around Ben Simmons. Deal expected to be officially announced in the coming hours.",
    "80": "Philadelphia 76ers PLEASE!!!!!!! https://t.co/830GRRtHqH",
    "81": "Young Philadelphia 76ers big man Paul Reed had himself a big game in a win for the Delaware Blue Coats.  https://t.co/Flymt5MsFs",
    "82": "Brooklyn is finalizing a deal to send James Harden to the Philadelphia 76ers in return for Ben Simmons, Tyrese Maxey, and a 2023-24 First Round Draft Pick, sources say.",
    "83": "Sixers big man Paul Reed has big performance in a Blue Coats win #Philadelphia #76ers #NBA https://t.co/Rywx94L8jJ",
    "84": "If James Harden isn’t a Philadelphia 76ers by Thursday, Daryl Morey has some real fucking explaining to do Tyrese Haliburton is a future 20 and 10 TRUE POINT GUARD he could’ve got an put next to Embiid on a rookie contract then shedded salary in the offseason for Harden",
    "85": "Rumor from source that Philadelphia #76ers are acquiring star guard James Harden in trade with Brooklyn #Nets for Ben Simmons, Danny Green and 2023 1st round pick. Deal expected to be officially announced in the coming hours.\n\n#NBA trade deadline: Thursday, Feb. 10 at 3 p.m. ET",
    "86": "Knicks Trade \nJulius Randle, Alec Burks, Nerlens Noel \n\nFor\n\nPhiladelphia 76ers\nBen Simmons, Seth Curry\n\nWho says No?",
    "87": "Analyzing Tuesday’s Phoenix Suns at Philadelphia 76ers odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/6gzztG7Fjp",
    "88": "Phoenix Suns at Philadelphia 76ers odds, picks and predictions https://t.co/Ep0wIIHkN4",
    "89": "the webber trade he must mean\n\nTraded by the Sacramento Kings with Matt Barnes and Michael Bradley to the Philadelphia 76ers for Brian Skinner, Kenny Thomas and Corliss Williamson. https://t.co/cfciJsnvO6",
    "90": "James Harden is being traded to the Philadelphia 76ers sources tell me",
    "91": "@sadgiantsfan @williamjrose @wojespn, @ShamsCharania when they tweet a \"deal\" its most definitely real. Anyone else is just smoke but still important! Everything is a lie but also it may be a truth! But keep an eye out for the first two tweeting \"Philadelphia 76ers send....\"",
    "92": "Breaking: 6-time Allstar Damian Lillard will go to the Philadelphia 76ers for a package including Ben Simmons, a first round pick, 2 consecutive 2nd round pick swaps, and cash considerations. https://t.co/hx3ONhLJHq",
    "93": "The Charlotte Hornets and Philadelphia 76ers are in serious discussions on a trade centered on center Mason Plumlee. Joel Embiid and draft compensation are likely to be included, sources tell ESPN.",
    "94": "Source: The Brooklyn Nets and Philadelphia 76ers have agreed to a deal in principle for a trade built around James Harden and Ben Simmons. Seth Curry, Matisse Thybulle, and Jaden Springer will be joining the Nets along with Simmons in the deal.",
    "95": "@kpelton Did you see this deal 76ers are getting killed\n\nPhiladelphia 76ers Receive: James Harden \n\nBrooklyn Nets Receive: De'Aaron Fox, Buddy Hield, Marvin Bagley \n\nSacramento Kings Receive: Ben Simmons, Tobias Harris, Andre Drummond",
    "96": "🔴Basketball Live ~ Philadelphia 76ers vs Phoenix Suns - NBA | 2022 💯\n🔗 🔴Watch Live Fullᴴᴰ 👉 : https://t.co/fgYDPAdXzW ✅\n📆 :On Tuesday. February 08 /2022\n⏰ 01:00 GMT\nDONT FORGET TO RETWEET AND FOLLOW FOR MORE INFO AND UPDATE.",
    "97": "Philadelphia 76ers Receive: James Harden \n\nBrooklyn Nets Receive: De'Aaron Fox, Buddy Hield, Marvin Bagley \n\nSacramento Kings Receive: Ben Simmons, Tobias Harris, Andre Drummond  \n\nWHY DONT YOU GIVE THE NETS THE CHAMPIONSHIP ARE YOU GUYS NUTS WE ARE GETTING KILLED",
    "98": "@ib11238 @_JasonLT Bounced from the Miami Heat to the Philadelphia 76ers, to the Dallas Mavericks before the Boston Celtics.  Stay away",
    "99": "Brooklyn Nets &amp; Philadelphia 76ers are in heavy talks for a Simmons/Harden trade. As of now it's just a matter of logistics with which side pieces should be traded\n\nA 3 team trade involving the Clippers may happen as soon as this afternoon\n\nBuckle up everyone its trade season",
    "100": "BREAKING: Philadelphia #76ers and Brooklyn #Nets are finalizing a deal that would send James Harden to the #76ers in exchange for Ben Simmons, Danny Green and a 2023 First Round pick.",
    "101": "League sources tell me that in next hours Philadelphia 76ers will acquire former MVP James Harden from Brooklyn Nets in blockbuster deal involving 3x All-Star Ben Simmons",
    "102": "Speaking it into existence:\n\nThe Philadelphia 76ers are finalizing a deal to acquire James Harden from the Brooklyn Nets in exchange for Ben Simmons, Danny Green and a 2024 lottery protected first, sources tell @TheAthletic",
    "103": "Philadelphia #76ers are acquiring star guard James Harden in a trade with the Brooklyn #Nets for Furkan Korkmaz and a 2023 first rd pick. Deal expected to be officially announced in the coming hours.",
    "104": "Sources: The Philadelphia #76ers are acquiring star guard James Harden in a trade with the Brooklyn #Nets in a package centered around Ben Simmons and draft compensation. Deal expected to be officially announced in the coming hours, days, or never.",
    "105": "@malika_andrews @wojespn Russell Westbrook  is staying in Lakers uniforms and james harden  is going  to stay in Brooklyn Nets  and Ben Simmons  is going  to stay  in Philadelphia 76ers  uniform",
    "106": "I just heard a rumor from a internal reliable source that the Philadelphia #76ers are acquiring star guard James Harden in a trade with the Brooklyn #Nets for Ben Simmons, the iHop on Walnut, Morgan’s Pier, and the guy who plays the violin at 6am in Suburban Station.",
    "107": "🚨 Line Change 🚨\n\nPhoenix Suns @ Philadelphia 76ers\nTue 7:10 PM EST\n\nFrom:\nPHI 1.0 -115\n\nTo:\nPHI -1.0 -110",
    "108": "Philadelphia 76ers star Joel Embiid addresses the Ben Simmons saga as well as the James Harden trade rumors.  https://t.co/zhxZMavXtS",
    "109": "Sources: The Philadelphia #76ers are acquiring star guard James Harden in a trade with the Brooklyn #Nets in a package centered around Ben Simmons. Deal expected to be officially announced in the coming hours.",
    "110": "RT StrangeCMac: I just heard a rumor from a internal reliable source that the Philadelphia #76ers are acquiring star guard James Harden in… #BrooklynNets",
    "111": "🚨 Line Change 🚨\n\nPhoenix Suns @ Philadelphia 76ers\nTue 7:10 PM EST\n\nFrom:\nPHI -1.0 -110\n\nTo:\nPHI 1.0 -115",
    "112": "NBA Game Preview: The Philadelphia 76ers have a forecast 53% chance to win against The Phoenix Suns with a spread of -1/1 and an over/under of 222.5. The Philadelphia 76ers are 0 - 0 against The Phoenix Suns in the 2021-22 Season.\n#sportshandicapper \n#sportbetting",
    "113": "I just heard a rumor from an internal reliable source that the Philadelphia #76ers are acquiring star guard James Harden in a trade with the Brooklyn #Nets for Ben Simmons, a printer and Daryl Morey’s left nut. Deal expected to be officially announced in the coming hours.",
    "114": "Lukewarm concept of an answer: Jimmy Butler with the Philadelphia 76ers. https://t.co/QmyluGXeXh https://t.co/vUAyG2v5tz",
    "115": "A bettor at @BetMGM placed $19,000 on the Philadelphia 76ers (+2000) to win the NBA Finals 🏆\n\nThis bet would win $380,000 💰 https://t.co/jYkX5FSP0o",
    "116": "BREAKING: The Philadelphia 76ers are acquiring James Harden from the Brooklyn Nets in exchange for Ben Simmons and Daryl Morey’s left nut",
    "117": "Reliable sources have confirmed that Philadelphia #76ers are acquiring James Harden in a trade with the Brooklyn #Nets for Ben Simmons, Danny Green, and picks. Unless the trade falls through, in which there would not be a trade. Sources say it will likely go either way.",
    "118": "@GetUpESPN @stephenasmith Ben Simmons is under contract with the Philadelphia 76ers through 2024-2025 after signing a five year, $177.2 million deal in 2019.",
    "119": "What team will Ben Simmons be on after the trade deadline? #Philadelphia #76ers #NBA https://t.co/cKpPYVRo1F",
    "120": "It is widely known among NBA executives that the Brooklyn Nets and Philadelphia 76ers are engaged in trade talks encircling James Harden and Ben Simmons. They are seeking a third team to get involved.",
    "121": "Sources: The Philadelphia #76ers are acquiring star guard James Harden in a trade with the Brooklyn #Nets in a package centered around Ben Simmons. Deal expected to be officially announced in the coming hours.",
    "122": "I just heard a rumor from a internal reliable source that the Philadelphia #76ers are acquiring star guard James Harden in a trade with the Brooklyn #Nets for Ben Simmons, Danny Green and a 2023 first rd pick. Deal expected to be officially announced in the coming hours.",
    "123": "just wait until it says NBA Player for the Philadelphia 76ers. https://t.co/3FKzeowOYG",
    "124": "Consensus Line Move:\n2022-02-08 Phoenix Suns at Philadelphia 76ers from 218.50 to 217.50\nUnder what did I miss\n#NBA #bettingonline #programmer #luxury",
    "125": "Philadelphia 76ers Ben Simmons recommended read … https://t.co/XioxpfJu64",
    "126": "@LandesBrock The Philadelphia 76ers a sending former All Star Ben Simmons to Brooklyn in a block buster trade for James Harden, per @BallsackSports",
    "127": "BREAKING NEWS: \n\nThe Portland Trailblazers are trading superstar Damian Lillard and Jusuf Nurkic to the Philadelphia 76ers per Woj. \nThe 76ers are sending Ben Simmons, Andre Drummond, Seth Curry and 3 future first round picks.",
    "128": "In tonight for Philadelphia 76ers https://t.co/92wFocL6pC",
    "129": "Philadelphia 76ers prop bets: 7 props for Sixers vs. Suns #Philadelphia #76ers #NBA https://t.co/jCAYEvJKpq",
    "130": ".@wojespn @ShamsCharania Write \"The Philadelphia 76ers...\" \nMolts nervis abans del deadline",
    "131": "BREAKING: The Philadelphia 76ers are trading Ben Simmons &amp; Seth Curry to the Brooklyn Nets for Jevon Carter &amp; Bruce Brown.",
    "132": "BREAKING NEWS🚨🚨🚨: James Harden and the Brooklyn Nets had agreed on a 4 year, $220 million deal with the Philadelphia 76ers🚨🚨🚨per source",
    "133": "Nick Wright: James Harden will be a Sixer by Game 1 next year, whether Nets accept it or not I FIRST THINGS FIRST: A report was released that the Brooklyn Nets rejected the Philadelphia 76ers in January when Daryl Morey showed interest in a trade for… https://t.co/sgffjTEIqO https://t.co/vtXx9pC4mR",
    "134": "Per source, the Philadelphia 76ers may or may not make a trade for an NBA player before the deadline.",
    "135": "NBA Basketball Game Betting Picks Simulator: 7:10 PM ET - Phoenix Suns vs. Philadelphia 76ers - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/oVFcVCusf7 #nba #sportsbetting #freepicks #cappertek",
    "136": "AI-analys basket: Phoenix Suns – Philadelphia 76ers https://t.co/8LlMo2Eiab",
    "137": "The Portland Trail Blazers are trading Damian Lillard to the Philadelphia 76ers for a philly cheese steak and Michael Carter Williams’ ROTY trophy, league sources tell ESPN.",
    "138": "Sources: The Philadelphia #76ers are acquiring star guard Damian Lillard in a trade with the Portland #Trailblazers in a package centered around Ben Simmons in a subsequent move to start rebuilding. Deal expected to be officially announced in the coming hours per @sean_mccaig",
    "139": "🏀 Phoenix Suns (@Suns) #ValleyProud\n🆚 W @ Chicago Bulls #BullsNation #PHXvsCHI\n⏭️ Philadelphia 76ers #Sixers #PHXvsPHI\n✈️ N666DN | DAL8939 | B752\n🛫 MDW - 11:22 pm CT\n🛬 PHL - 1:46 am ET\n📡 Tracking: https://t.co/VEJBJe4VjF https://t.co/ufl5yd9dqS",
    "140": "REPORT: Philadelphia 76ers Made A Ben Simmons Offer For John Collins https://t.co/FtdZg78stv",
    "141": "Phoenix Suns vs. Philadelphia 76ers picks, predictions, odds: Who wins NBA game Tuesday? https://t.co/NNtrdzS9Fo",
    "142": "Phoenix Suns vs  Philadelphia 76ers Prediction 2/8/22 -  Free NBA Picks https://t.co/sriQaN1zzI via @YouTube \n\n#NBA #NBAPick #NBAPrediction #basketball",
    "143": "@BigTWil34 Good morning Philadelphia 76ers https://t.co/B9jtHuLfB6",
    "144": "All the pieces for Damian Lillard being traded to the Philadelphia 76ers are coming together. https://t.co/lyOCjDk14M https://t.co/UIwhDt4AEh",
    "145": "Philadelphia 76ers recognize Thunder Mug Cafe for Buy Black program @phillytrib @sixers \nhttps://t.co/ro7AbBy06W",
    "146": "You misspelled Philadelphia 76ers https://t.co/GVNHXJfa0s",
    "147": "¡HOY JUEGA SUNS! (43-10)\n\n🆚 Philadelphia 76ers\n⏰ 21:00hs (🇦🇷)\n🏟 Wells Fargo Center\n📺 NBA League Pass https://t.co/n90XzCIKIG",
    "148": "Phoenix Suns vs. Philadelphia 76ers picks, predictions, odds: Who wins NBA game Tuesday? #Phoenix #Suns #NBA https://t.co/glDq9Yyots",
    "149": "Phoenix Suns vs. Philadelphia 76ers picks, predictions, odds: Who wins NBA game Tuesday? https://t.co/98l9tKEkHi",
    "150": "Early Leans :\n\nBoston Celtics -5.5\nMinnesota Timberwolves -4\nOrlando Magic +3.5\nPhiladelphia 76ers ML\nLos Angeles Lakers ML",
    "151": "Consensus Line Move:\n2022-02-08 Phoenix Suns at Philadelphia 76ers from 217.50 to 218.50\nOver feeling frisky\n#NBA #bettingexpert #pythonprogramming #btc",
    "152": "The Philadelphia 76ers are likely to include Danny Green in any potential James Harden deals.  https://t.co/DbGCkHoMKE",
    "153": "🎂 Grant Riller - Philadelphia 76ers has a birthday today",
    "154": "Ben Simmons Philadelphia 76ers Fanatics Authentic Autographed Indoor/Outdoor Basketball with Mahogany Team Logo Basketball Display Case Interesting logo on the case for the Ben Simmons ball 🧐 https://t.co/cQLHfSYG98",
    "155": "76ers Trade Predictions Ahead of Thursday’s Deadline #Philadelphia #76ers #NBA https://t.co/WP7yU5yoCA",
    "156": "@FTFonFS1  Brooklyn Nets  is not going  to trade  him to the Philadelphia  for  Ben Simmons  and Philadelphia 76ers  organization  is not going  to trade  Ben Simmons  on to the next  topic 🤔  thanks",
    "157": "@Not___KC @TheAthletic @Stadium However the Philadelphia 76ers have not agreed: per Sources",
    "158": "Phoenix Suns continue their road trip to clash against the Philadelphia 76ers at the Wells Fargo Center. \nKey Player to keep a track of: \nSuns: Deandre Ayton\nPhiladelphia 76ers: Tyrese Maxey\nMake your own fantasy team now! Download the app!\n#Suns #76ers #panda11 #punkpanda https://t.co/7kESZMptWV",
    "159": "Joel Embiid on the Ben Simmons saga, James Harden trade rumors and big Philadelphia 76ers talking points | NBA News https://t.co/uptIzqalEr",
    "160": "\"Nobody's going to be in a hurry to help Daryl Morey and the Philadelphia 76ers go get James Harden. The Nets should not trade James Harden before the deadline.\" — @Chris_Broussard https://t.co/8iVicukna9",
    "161": "Philadelphia 76ers' Ben Simmons trade 'unlikely' to happen before Feb. 10 deadline – NBA News https://t.co/xpUvBSeVQc",
    "162": "Philadelphia 76ers' Ben Simmons trade 'unlikely' to happen before Feb. 10 deadline – https://t.co/cqb9hZ4QKW",
    "163": "5 Factors That Will Decide Ben Simmons' Fate with Philadelphia 76ers #Philadelphia #76ers #NBA https://t.co/eB2erXx28U",
    "164": "Philadelphia 76ers’ Ben Simmons trade ‘unlikely’ to happen before Feb. 10 deadline https://t.co/dVomk1H4pL #NBA #Philadelphia76ers",
    "165": "Sixers vs. Suns game preview: How to watch, TV channel, start time #Philadelphia #76ers #NBA https://t.co/giOy9QKzBf",
    "166": "RT BenWatsonNBA: Sources: The Philadelphia #76ers are acquiring star guard James Harden in a trade with the Brooklyn #Nets in a package ce… #BrooklynNets",
    "167": "NBA 09/02/22\n\n07:00 Philadelphia 76ers*Over-216.5\n08:00 New Orleans Pelicans*Over-226.5 \n08:00 Memphis Grizzlies*Over-228",
    "168": "The Philadelphia 76ers will start a 4-game homestand when they take on the Phoenix Suns on Tuesday.  https://t.co/Xtve5t5umU",
    "169": "5 Factors That Will Decide Ben Simmons' Fate with Philadelphia 76ers https://t.co/YpJ4NoRRXh",
    "170": "@NBA 2022: Ben Simmons’ trade standoff with Philadelphia 76ers set to linger until June https://t.co/lqo4cTzPQm via @dailytelegraph",
    "171": "A new mock trade has the Philadelphia 76ers sending Ben Simmons to the Washington Wizards.  https://t.co/voKGxQdVZu",
    "172": "I 100% agree with the Philadelphia 76ers stance in Ben Simmons. Keep him unless you can get equal or greater trade valve for him. No way I trade him for less  &amp; risk having him eliminate you later. He is not costing them anything",
    "173": "@theBrowsexual Ben Simmons has informed the Philadelphia 76ers that when he becomes an UFA after 2025 season he does not plan to resign with them",
    "174": "Joel Embiid on Ben Simmons: “We’re a better team with him on the floor” #BenSimmons #JoelEmbiid #Philadelphia76ers https://t.co/ubOQYjyZ0f",
    "175": "Phoenix Suns (43-10, first in the Western Conference) vs. Philadelphia 76ers (32-21, fifth in the Eastern Conference) https://t.co/ld8ripcQ5t",
    "176": "New Suns Fan Tweet! See fan thoughts from ChrisSmithAZ1:\n\nSuns go to 43-10  deafeat chicagobulls 127-124  next up 32-21 Philadelphia 76ers sixers in the second game of  a back-to back   #PHXvsPHI #ValleyProud\n\nhttps://t.co/MI8bobDF4L",
    "177": "@Suns go to 43-10  deafeat @chicagobulls 127-124  next up 32-21 Philadelphia 76ers @sixers in the second game of  a back-to back   #PHXvsPHI #ValleyProud",
    "178": "Philadelphia 76ers star Joel Embiid addresses the Ben Simmons saga as well as the James Harden trade rumors.  https://t.co/ng1IScmFsU",
    "179": "🏀#NBA ‼️\n1.Philadelphia 76ers Vs Phoenix Suns\n2.Atlanta Hawks Vs Indiana Pacers\n3.Brooklyn Nets Vs Boston Celtics\n4.Memphis Grizzlies Vs Los Angeles Clippers\n5. New Orleans Pelicans Vs Houston Rockets ...\n-------\n⭐️Free #livescore &amp; #livestream 👉https://t.co/z8cdc9BY9Y 😉 https://t.co/GX5POs68gY",
    "180": "NBA Basketball Game Betting Picks Simulator: 7:00 PM ET - Phoenix Suns vs. Philadelphia 76ers - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/oVFcVCusf7 #nba #sportsbetting #freepicks #cappertek",
    "181": "Phoenix Suns (43-10, first in the Western Conference) vs. Philadelphia 76ers (32-21, fifth in the Eastern Conference) https://t.co/M7Z3vWDzGO",
    "182": "@BleacherReport The Brooklyn Nets have agreed to a deal to send former MVP guard, James Harden, to the Philadelphia 76ers in exchange for Ben Simmons, Tyrese Maxey, Seth Curry and a future 1st round pick, sources tell @TheAthletic @Stadium",
    "183": "Check out Philadelphia 76ers Julius Erving Mitchell &amp; Ness Red 1982-83 NBA Swingman Jersey  https://t.co/hgPjG3rkHu via @eBay",
    "184": "Sources: The Philadelphia 76ers are acquiring guards De’Aaron Fox and Hield and a 2024 first round pick in exchange for Ben Simmons.\n\n76ers are likely sending deez nuts back to the Kings",
    "185": "Check out Philadelphia 76ers Allen Iverson Mitchell &amp; Ness Royal 1999-00 Swingman Jersey  https://t.co/nRvgYYtMME via @eBay",
    "186": "ESPN’s Stephen A. Smith says it would be stupid if the Philadelphia 76ers sent Ben Simmons to the Brooklyn Nets.  https://t.co/xUTqYWHiO6",
    "187": "Multiple sources tell me that James Harden to the Philadelphia 76ers in a package involving Ben Simmons is already a done deal. Expect an announcement as early as Tuesday.",
    "188": "Philadelphia 76ers - Phoenix Suns\nNew Orleans Pelicans - Houston Rockets\nDenver Nuggets - New York Knicks\nSacramento Kings - Minnesota Timberwolves\nLos Angeles Lakers - Milwaukee Bucks\n\nBet slip link: https://t.co/gEo2fok2Bz https://t.co/pLgkgJJKTb",
    "189": "Philadelphia 76ers vs Chicago Bulls - Full Game Highlights | February 6, 2022 | 2021-22 NBA Season\nhttps://t.co/wsTWnctUOb\nhttps://t.co/wsTWnctUOb",
    "190": "Ben Simmons looks set to remain on the sidelines until at least June, and he only has himself to blame according to Philadelphia 76ers teammate Joel Embiid, via @mattlogue7 \nDETAILS: https://t.co/it2L2nLf2P https://t.co/TV9DYMvCw5",
    "191": "Ben Simmons looks set to remain on the sidelines until at least June, and he only has himself to blame according to Philadelphia 76ers teammate Joel Embiid, via @mattlogue7 \nDETAILS: https://t.co/nTLPFHzPfL https://t.co/nA1E4ApVla",
    "192": "Fadeaway World NBA trade idea\n\nPhiladelphia 76ers Receive: James Harden \n\nBrooklyn Nets Receive: De'Aaron Fox, Buddy Hield, Marvin Bagley \n\nSacramento Kings Receive: Ben Simmons, Tobias Harris, Andre Drummond\n\nWho says no to this trade?",
    "193": "Please please please join the website it's a little ghetto but it's a process like the Philadelphia 76ers and it will be worked out. Don't cry to me too me if you get ripped off or have problems. \"Where Fun Happens\" Simmons For the 3!!!!! https://t.co/INdwGWcfkt",
    "194": "Check out Philadelphia 76ers Darryl Dawkins Mitchell &amp; Ness Blue 1976-77 Swingman Jersey  https://t.co/4Qr8uJTPFb via @eBay",
    "195": "*BREAKING NEWS*\n@JHarden13 is going to the @sixers in exchange for Ben Simmons going to @BrooklynNets 😉 #tradeDealine #nba #brooklynNets #philadelphia76ers",
    "196": "The Philadelphia 76ers have agreed to a deal to send, Ben Simmons, Seth Curry, Georges Niang, a future second round pick, and future first round pick in exchange for Brooklyn Nets star guard James Harden, sources tell ESPN.",
    "197": "NBA Basketball Game Betting Picks Simulator: 2/8/2022 7:00 PM ET - Phoenix Suns vs. Philadelphia 76ers - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/oVFcVCusf7 #nba #sportsbetting #freepicks #cappertek",
    "198": "My sources have confirmed that the Philadelphia #76ers are acquiring James Harden from the Brooklyn #Nets in a trade centered around Ben Simmons and Seth Curry. Trade to be announced in the coming days.",
    "199": "Philadelphia 76ers point guard Ben Simmons is unlikely to be traded ahead of the 2022 NBA draft despite reports linking him to the Brooklyn Nets in a deal for James Harden, according to Keith Pompey of the Philadelphia Inquirer.",
    "200": "While there is clearly some smoke around a potential Ben Simmons for James Harden trade between the Philadelphia 76ers and Brooklyn Nets, it remains a murky situation.",
    "201": "For his career, Booker averages his most PPG in Atlantic Division stadiums, and averages his most PPG specifically against the Philadelphia 76ers (tomorrow's opponent) https://t.co/WGaJjVghcA",
    "202": "Brooklyn Nets Dismissed Philadelphia 76ers’ Interest In James Harden, Sources Say https://t.co/540m8A2Eyo",
    "203": "While Seth Curry has fast become a fan favorite in the City of Brotherly Love, he isn't good enough to hold up a Philadelphia #76ers trade for James Harden.\n\n[@MattyBreisch]\nhttps://t.co/fYk4Q7jezW",
    "204": "Despite the James Harden rumors, it looking unlikely that the Philadelphia 76ers will move Ben Simmons before the deadline.  https://t.co/Ne9BhqVkwY",
    "205": "@Schultz_Report If they don’t make the move now I’m talking about the Philadelphia 76ers it will make it at the end of the year James Harden is very unhappy where he’s at right now chip",
    "206": "Check out Philadelphia 76ers Billy Cunningham #32 Mitchell &amp; Ness 1970-71 Swingman Jersey  https://t.co/lVtOzfB7S2 via @eBay",
    "207": "PHILADELPHIA 76ERS TRADE POSSIBILITIES | NBA TRADE DEADLINE NEWS https://t.co/ZvquEaV4Id via @YouTube",
    "208": "The Brooklyn Nets have agreed to a deal to send former MVP guard, James Harden, to the Philadelphia 76ers in exchange for Ben Simmons, Tyrese Maxey, Seth Curry and a future 1st round pick, sources tell @TheAthletic @Stadium",
    "209": "@BenWatsonNBA Trust me bro: The Philadelphia #76ers are acquiring star guard James Harden in a trade with the Brooklyn #Nets in a package centered around Ben Simmons. Deal expected to be officially announced in the coming hours.",
    "210": "The Brooklyn Nets have agreed to a deal to send former MVP guard, James Harden, to the Philadelphia 76ers in exchange for Ben Simmons, Tyrese Maxey, Seth Curry and a future 2nd round pick, sources tell @TheAthletic @Stadium",
    "211": "🚨🚨BREAKING NEWS🚨🚨\n\nThe Brooklyn Nets have agreed to a deal to send former MVP guard, James Harden and a future 2nd round pick to the Philadelphia 76ers in exchange for Ben Simmons, Tyrese Maxey, Seth Curry and a future 2nd round pick, sources tell @SextonisMVP",
    "212": "Philadelphia 76ers: Andre Drummond isn't here for Twitter slander – NBA News https://t.co/TdJJIVyXRW",
    "213": "Philadelphia 76ers: Andre Drummond isn't here for Twitter slander – https://t.co/PiNuga7Ptv",
    "214": "Which athlete should I draw next? @sixers @joelembiid \n\n#joelembiid #76ersnation #76ersbasketball #philadelphia76ers #sixersnation @ Philadelphia 76ers https://t.co/MkN8eayqQw",
    "215": "0-3 vs the Philadelphia 76ers 🤫 https://t.co/Phx5tdtG0h",
    "216": "While Andre Drummond's role is a bit atypical for a 28-year-old former All-Star, his efforts have been incredibly helpful for the Philadelphia #76ers both on the court and on Twitter.\n\n[@MattyBreisch]\nhttps://t.co/Ilt5TTPClB",
    "217": "Embiid 'fine' with Simmons staying, playing for Sixers #Philadelphia #76ers #NBA https://t.co/BnHmNG83C0",
    "218": "Sources: The Philadelphia #76ers are acquiring star guard James Harden in a trade with the Brooklyn #Nets in a package centered around Ben Simmons. Deal expected to be officially announced in the coming hours.",
    "219": "@ReneePwash what do you think about the Philadelphia 76ers duty go ahead and make a move for James harden and Ben Simmons on Thursday or do they wait for the end of the year your favorite fan in Phily Chip",
    "220": "League executives believe the Philadelphia 76ers will use Paul Reed and Isaiah Joe as trade bait at the deadline.  https://t.co/r7AXK8vRiA",
    "221": "James Harden is pushing for a Trade Deadline deal that will send him to the Philadelphia #76ers 👀 will it go through?\n\nMORE HERE 👉 https://t.co/HLxafB2E4E https://t.co/aLUb3OdW3w",
    "222": "My source, @stykes10 reporting the Philadelphia #76ers are acquiring star guard James Harden in a trade with the Brooklyn #Nets in a package centered around Ben Simmons. \n\nDeal expected to be officially announced in the coming hours.",
    "223": "The Brooklyn #Nets are trading James Harden to the Philadelphia #76ers in exchange for Ben Simmons, Matisse Thybulle, and a 2nd round pick, per source. Deal is expected to be announced in the next few days.",
    "224": "RT BenWatsonNBA: Sources: The Philadelphia #76ers are acquiring star guard James Harden in a trade with the Brooklyn #Nets in a package ce… #BrooklynNets",
    "225": "RT BenWatsonNBA: Sources: The Philadelphia #76ers are acquiring star guard James Harden in a trade with the Brooklyn #Nets in a package ce… #BrooklynNets",
    "226": "New mock trade has Sixers moving star guard Ben Simmons to Wizards #Philadelphia #76ers #NBA https://t.co/2y7oN2HWSC",
    "227": "A new mock trade has the Philadelphia 76ers sending Ben Simmons to the Washington Wizards.  https://t.co/wN98CNYCVx",
    "228": "James Harden | Philadelphia 76ers\n-\n-\n@sixers \n@Juke_ https://t.co/e3XrZdF84m",
    "229": "Ben Simmons has informed the Philadelphia 76ers that when he becomes an UFA after 2025 season he does not plan to resign with them",
    "230": "Joel Embiid offers honest assessment of Ben Simmons' issues with 76ers #Philadelphia #76ers #NBA https://t.co/sFZbOsZI1T",
    "231": "Danny Green has been in the NBA for 13 seasons and has never been traded at the deadline. Could the Philadelphia #76ers break that streak this week?\n\n[@MattyBreisch]\nhttps://t.co/5SViA10lW6"
}