{
    "0": "Brooklyn Nets vs Washington Wizards | NBA live stream\nGo Watch Live Here➡️ https://t.co/FTIVp2CVNc",
    "1": "“Expect Washington to approach the trade deadline aggressively with their sights set on Indiana Pacers star big man, Domantas Sabonis. Sabonis has received a ringing endorsement from Beal, and others, within the Wizards organization” 👀 https://t.co/9E8Wgsz5go",
    "2": "@MichelobULTRA Washington Wizards",
    "3": "NBA Picks…\n\nCleveland Cavaliers -3.5\nWashington Wizards -1.5\nAtlanta Hawks -1.5\n\nLet’s get this done!\n\n#GamblingTwitter",
    "4": "With the trade deadline approaching the Wizards may have to go all in to solidify Bradley Beal’s return at season’s end.\n\nMy latest on why this deadline is like no other and intel on how Washington is approaching some of the biggest names available. \n\nhttps://t.co/NB73tv5dyS",
    "5": "Washington Wizards are utilizing Capital City GO-GO to fill its roster after COVID surge | WJLA  https://t.co/LbLk9MDMJk",
    "6": "Washington Wizards vs Brooklyn Nets\nWatch Live : https://t.co/cc3p83j0C4\nVenue: Capital One Arena (Washington)\n\n#WashingtonWizards #BrooklynNets #Washington #Brooklyn #NBA #LiveStreaming https://t.co/Ysn4owAi8D",
    "7": "LETS SWEEP!\n\nAlabama -3.5 (Buy Half Point) (1U)\n\nWashington Wizards ML (1U)\n\nDrop a like if tailing! I notice who tails and if I see you like this tweet I'll send you an NHL play...LFG⚡️",
    "8": "Brooklyn Nets (+1) @ Washington Wizards #NetsWorld #DCAboveAll #NBA #NBATwitter #NBA75",
    "9": "@Sportsnet Memphis Grizzlies\nAtlanta Falcons\nTennessee Titans \nTexas Rangers\n\nLos Angeles Kings\nEdmonton Oilers\nWashington Wizards\nIndianapolis Colts\nSt. Louis Cardinals",
    "10": "Washington Wizards - Brooklyn Nets\nBrooklyn Nets +2.0 AH (1.78)\nPinnacle/2 units",
    "11": "The 3rd place @BrooklynNets are on road  in Washington, DC where they will take on the Wizards tonight at 7:00 PM. Tonight will be Brooklyn's 2⃣game without Kevin Durant &amp; Wizards are 4-1 in dare last five so tell @brandon_MFN_B and I, what you think will happen tonight in the DC",
    "12": "@MesousaGaby Mainly used for the Washington Mystics of the WNBA and the Capital City GoGo, the Wizards affiliate in the G-League, as well as High School basketball.",
    "13": "Get a preview of the Brooklyn Nets vs. Washington Wizards basketball game. https://t.co/puH3fSqpqG\nvia @ESPN App https://t.co/nALCbLiXno",
    "14": "🍷 This weekend, tap into your artistic side with a paint and play, celebrate \"Japanese Heritage Night\" with the Washington Wizards, and endure the taste of a variety of wines at the Drink the District Wine Festival. \n\n* Article by @districtfray *\n\n➡️ https://t.co/NtNNOLNfr8",
    "15": "@ChaseHughesNBCS @NBCSWashington no depth or front court for brooklyn against a full healthy wizards team. give me washington by 6",
    "16": "TNT has added the Nets-Wizards game in Washington on Feb. 10 at 7:30 to its schedule, replacing the Miami-New Orleans game previously scheduled for the early window of its doubleheader. The Finals rematch between Milwaukee and Phoenix remains in the TNT nightcap.",
    "17": "The #Nets' Thursday Feb. 10 game at Washington will now be televised by #TNT. Tipoff has been moved back a half hour to 7:30pm. #Wizards #NBA",
    "18": "@TrandoshnTrojan @money_talks65 @jirv21 @afirmandi @LakerCentral365 Russell Westbrook was perfect for the Washington Wizards, they didn’t have the full-time point guard from that 2020 Championship team, Lebron James.\nThey didn’t care that Russell Westbrook is a poor off the ball scoring weapon if the Center is double-teamed",
    "19": "Washington Wizards Starters:\n\nSpencer Dinwiddie\nBradley Beal\nKentavious Caldwell-Pope\nKyle Kuzma\nDaniel Gafford\n\n#DCAboveAll #NBA #NBATwitter #NBA75",
    "20": "Tonight's starting lineup for the Washington Wizards: Dinwiddie, Beal, Caldwell-Pope, Kuzma, Gafford https://t.co/bVWH4Av1bs",
    "21": "@MichelobULTRA Washington Wizards",
    "22": "I'm going with a fun NBA parlay with alternate spreads:\n\n🔹Minnesota -3.5 @ +140\n🔹Washington -3.5 @ +120\n\nParlay odds: +461\n\n#NBA #FreePicks #Wizards #Timberwolves https://t.co/xKmqctTC2V",
    "23": "Prono NBA 🏀💰 \n\n• Washington Wizards win @1,88 5% \n• Dallas Mavericks win @1,60 5% \n• Memphis Grizzlies win @3,10 3% \n\n♻️ &amp; 💙 si tu suis ! \n\n#TeamParieur #NBA",
    "24": "$250/1U🎰\n🏟🏀 Brooklyn Nets vs Washington Wizards\n\nWizards Team Total Under 117.5\n\n-Û🐐",
    "25": "Washington Wizards Predictions and Preview for 1/19/2022 hosts Brooklyn Nets.  Find out who we are taking in this matchup. #NBATwitter #Basketball https://t.co/Z6kUTKLZz3",
    "26": "Looking for a value bet?  See if the Brooklyn Nets-Washington Wizards Predictions and Preview for 1/19/2022 is one in our preview.  No crazy hype just a prediction and preview. #NBATwitter #Basketball https://t.co/Z6kUTKLZz3",
    "27": "Brooklyn Nets vs Washington Wizards - NBA League 2021-2022\n🔴Watch Live Fullᴴᴰ 👉: https://t.co/PsuNcS96ur\nDate : On Wednesday. January 19 /2022 Time : 7:00 PM",
    "28": "@ravenwizardd @OGLeveledUp @LegionHoops @WindhorstESPN Haha there are teams that, believe it or not, want young assets that they can mold and turn into their own. Like the Wizards getting Kuzma, Kuzma wasn't much in LA, moves to Washington and is balling out. Young guys need more of a chance",
    "29": "@MichelobULTRA Washington Wizards til I die",
    "30": "@MichelobULTRA Washington Wizards",
    "31": "Congratulations to joeswam (@joeswam), ElNidoCatSanctuary (@AndrewGawidan) and TellMeIAmJuicy who moved up to take #9, #10 and #11 on the Washington Wizards team leaderboard.\n\nhttps://t.co/yEBg4vL1Td",
    "32": "yo @SJD10304 let's make a deal!\n\nWashington Wizards Receive: C/F Anthony Davis, G Kendrick Nunn\nLos Angeles Lakers Receive: G Bradley Beal, C Thomas Bryant, 2025 Second-Round Pick, 2026 Second-Round Pick\nhttps://t.co/MxrqOTgyCM",
    "33": "@MichelobULTRA Washington Wizards 🥰",
    "34": "Back BROOKLYN NETS to BEAT Washington Wizards tonight in the @NBA (Game Starts at 00.10 GMT) #NBA #Basketball",
    "35": "@money_talks65 @TrueBlueDoyers @TheLakersReview @Lakers Russell Westbrook fits great with the Washington Wizards, but a horrible fit with the Lakers because Lebron James = full-time point guard for that 2020 Championship roster likes to jump back to PG. Westbrook a poor 3-point shooter.",
    "36": "@BullScripted What about a lesser move like Harrell from Washington as probably don’t have to give up much as Wizards probably want to move salary?",
    "37": "Analyzing Wednesday’s Brooklyn Nets at Washington Wizards odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/z5NDHwrd6P",
    "38": "Washington Wizards imo erred in not trading Beal into overzealous trade market previously.\n\nIf someone still is rabid to get him, trade him.\n\nExtensions? There is pretty crazy unwise now and a super cra cra opportunity if he opts out and gets 5 year max.",
    "39": "Pronostic Washington Wizards – Brooklyn Nets 20/01/2022 NBA - LeFigaro Paris Sportifs\n\nhttps://t.co/KG49mZ6dAv",
    "40": "Kyrie has cleared 25 points in each of his last 3 games against Washington. Will he do it again tonight?\n\nHere's our Nets vs Wizards same game parlay ⬇️",
    "41": "Washington Wizards center Montrezl Harrell has become a fan favorite in his first season with the team. But the latest report of him being on the trade block should come as no surprise https://t.co/mNubkXOuTy",
    "42": "Thinking about betting on Brooklyn Nets v Washington Wizards (NBA)?  Find out what pick Pine member @MmmmmmmmmPizza locked in for the game.\n\nhttps://t.co/bP3qWUIhnn",
    "43": "Prince Georgians of all ages can earn prizes and badges this winter by reading, attending virtual events, &amp; staying physically active with the Washington Wizards Winter Reading Challenge, presented by our Memorial Library System. Sign up &amp; learn more here: https://t.co/KzLQ75bNnd https://t.co/ywYjkindUe",
    "44": "Brooklyn Nets at Washington Wizards: NBA Betting Picks, Predictions and Tips - January 19, 2022 https://t.co/yH6vKXThTd https://t.co/RzRt9D0djs",
    "45": "@KenDizzleV2 I legitimately think the Wizards are the only NBA franchise that has not had at least one 50 win season since they made the Finals as the Washington Bullets in 1979\n\nI will bet money on it",
    "46": "NBA Basketball Game Betting Picks Simulator: 7:10 PM ET - Brooklyn Nets vs. Washington Wizards - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/VX3BDbAl1a #nba #sportsbetting #freepicks #cappertek",
    "47": "Five years ago today, Carmelo Anthony dropped a franchise-record 25 points in the second quarter against the Washington Wizards.\n\nHe finished the game with 34 points and 10 rebounds, but New York would go on to lose 113-110. https://t.co/Pvj1tWE2NE",
    "48": "Tonight’s game: So the Nets enter Washington, D.C. with the second-best road record in the league (15-5), but are riding a four-game losing skid against the Wizards at D.C. \n\nThat’s the second-longest active road losing skid against any team for the Nets, trailing the Jazz. https://t.co/1q5Nih1vGf",
    "49": "@NBAwizardry @LakerCentral365 Says the Washington Wizards team that have been trash for God knows how long. You happy with Lakers sloppy seconds.",
    "50": "🏀 GAME DAY 🏀\n\nStop #2 on the road trip: Washington DC\n\n🆚 Washington Wizards\n🏟️ Capital One Arena\n🎽 Association\n⏰ 7:00 PM\n📺 YES\n📻 WFAN https://t.co/a4jVKzSyXN",
    "51": "📰 Brooklyn Nets vs Washington Wizards Predictions and Picks Jan 19!\n👉 https://t.co/WGDQp5dZB2 @wagertalk",
    "52": "Philadelphia 76ers big man Andre Drummond addresses the officiating in a loss to the Washington Wizards.  https://t.co/fYMFU6F4uZ",
    "53": "#NBA \n\nBK/Was\n\nNets are 5-16 ATS in the L21 meetings in Washington\nNets are 2-9 ATS in their L11 games overall\nNets are 4-1 ATS in their L5 games as a dog\nWizards are 1-6 ATS in their L7 games overall\nWizards are 6-1 ATS in their L7 games vs. a team with a winning record",
    "54": "On this date in 2000 Michael Jordan, who led the Chicago Bulls to 6 NBA championships as a player, returns to the NBA, joining the Washington Wizards as part owner and President of Basketball Operations.",
    "55": "Brandon Ingram x Washington Wizards https://t.co/5glG9R51c4",
    "56": "The last time the Washington Wizards went to the NBA semi-finals was 42 years ago. In that same time, the WFT has won 3 Super Bowls and runner-up in a 4th Super Bowl. WFT fans, let that sink in next time you are sad. \n\n#DCAboveAll  #WashingtonFootball \n#NBA\n#NFL",
    "57": "Congratulations to ajlax711 (@TopShotWizard) who moved up 5 spots to take #24 on the Washington Wizards team leaderboard.\n\nhttps://t.co/yEBg4vL1Td",
    "58": "It seems McKenzie Caldwell Pope moved to Potomac. Her husband got traded to the Washington Wizards. \n\nShe’s having lunch with Gizelle and Askale is all in her comments. \n\nOne to watch maybe? 👀👀👀👀 #RHOP",
    "59": "Tonight the Brooklyn Nets (27-16) visit the Washington Wizards (23-21) at 7:00 🕖 @YESNetwork #Brooklyn #Nets #NBA #NetsWorld",
    "60": "Get through #HumpDay with #NBA action!  At 6:00 p.m. CST, the Washington #Wizards have their hands full with the dangerous Brooklyn #Nets.  Later at 9:00 p.m. CST, the Los Angeles #Clippers travel east to play the Denver #Nuggets.  #Hoops https://t.co/aOitiJzwbf",
    "61": "Brooklyn Nets @ Washington Wizards\nPick : Brooklyn Nets.\nBasketball. NBA",
    "62": "Brooklyn Nets vs. Washington Wizards Predictions 1/19/22 - Free NBA Picks https://t.co/MSrU0bIY08 via @YouTube",
    "63": "Consensus Line Move:\n2022-01-19 Brooklyn Nets at Washington Wizards from 231.50 to 233.50\nOver adjust quickly\n#NBA #espn #machinelearning #motivation",
    "64": "Preview: Washington Wizards VS Brooklyn Nets https://t.co/YcyqLTuOb7",
    "65": "#NBA75 | 20/01 01:00\n🆚 Washington Wizards vs Brooklyn Nets                          \n➡️ Irving +28.5 PP 📊 1.82 Unibet  \n💰 1 unité\n\n#TeamParieur #NBATwitter",
    "66": "BROOKLYN NETS vs\nWASHINGTON WIZARDS, 8:00PM.",
    "67": "On this day in sports history January 19, Michael Jordan became co-owner and President of Basketball Operations of the Washington Wizards in 2000.",
    "68": "The other 11 Washington Wizards fans will understand my confusion, here https://t.co/K9gMeSoHsY",
    "69": "Wizards the favorites to land Jerami Grant? 👀\n\nSeveral league personnel views Washington as a favorite to land #Pistons forward Jerami Grant, per @JakeLFischer.\n\n#NBATwitter https://t.co/2yfeycbyfq",
    "70": "On this day in 2000, Michael Jordan returns to the NBA, but not as a player.\n\nJordan joined the Washington Wizards as part-owner and President of Basketball Operations. https://t.co/KsHZhnUYj4",
    "71": "Tonight I have 2 picks I LOVE\n\nSt Josephs -8\nWashington Wizards -2\n\n#GamblingTwitter",
    "72": "Spilforslag:  Washington Wizards - Brooklyn Nets: Over 9,5 Rebounds af K.Kuzma https://t.co/Szcjc5YjWE #betxpert #betdk https://t.co/Y1I2EMw8wC",
    "73": "#History #19January #Year2000\nNBA Finals:\nMichael Jordan, who led the Chicago Bulls to 6 NBA championships as a player, returns to the NBA, joining the Washington Wizards as part owner and President of Basketball Operations\nKnow more at : https://t.co/NEIq346QuJ https://t.co/3LKh2OxO8K",
    "74": "@BritsGGrandpa @jackfrank_jjf Look at KCP and Kyle Kuzma's performance as Washington Wizards players, they should still be Lakers. That foolish Russell Westbrook trade is not Coach Vogel's fault.",
    "75": "“Dame Lillard has been sensational” - Mike Breen\n\n“Mama…there goes that man” - Mark Jackson\n\n“Do you think the Washington Wizards employ any actual wizards?” - JVG https://t.co/5HkXbll0q4",
    "76": "Congratulations to The_Wiggle who moved up 2 spots to take #25 on the Washington Wizards team leaderboard.\n\nhttps://t.co/yEBg4vL1Td",
    "77": "Wizards believed to be favorite to land Jerami Grant #JeramiGrant #WashingtonWizards https://t.co/LZ3sYOITJs",
    "78": "@jhloz Got laid about 4 hours ago, now I am back to being angry about the Lakers poor judgment in trading KCP &amp; Kyle Kuzma to the Washington Wizards. 😭😭😭\nWestbrook is not worth 91 million dollars over 2 seasons.",
    "79": "⛹️‍♂️NBA --  Washington Wizards vs Brooklyn Nets\n\n🏀Play Time: Jan 19 2022, 20:00 (GMT-4)\n\n📣Prediction: Washington Wizards +2\n\n👇Click here 2 view more\n\nhttps://t.co/NyuAXy0D47\n\n#BKNvsWAS #Wizards #Nets #NBA #NBA75 #NBAPicks #NBATwitter #ThatsGame #NBAECF #NBAWCF https://t.co/6dpXUj3u6F",
    "80": "Sports while i'm asleep \n\nWashington Wizards Vs Brooklyn Nets (NBA Matchday 45 of 82)\n\nTip-off: 1 A.m Swedish \n12 P.m British \n7 P.m Eastern \n4 P.m Western",
    "81": "@washwizardsjp @mq_nba The Washington Wizards Ace Player Mr. Rui Hachimura",
    "82": "@antwanstaley He really does...\n\nIf that year with the Washington Wizards didn't do him in, he may live forever",
    "83": "Washington Wizards - Brooklyn Nets\nPhiladelphia 76ers - Orlando Magic\n\nBet slip link: https://t.co/5axfPbgYlN https://t.co/QVVgWRC9jy",
    "84": "Which team was Russel Westbrook the best on so far in his career #NBA75 #NBATwitter #NBA #RussellWestbrook #Westbrook #OKCThunder #Rockets #WashingtonWizards #LakersNation",
    "85": "Brooklyn Nets vs. Washington Wizards NBA betting odds, lines, trends https://t.co/EELFLcSB18",
    "86": "#Washington #Wizards: No-look, behind-the-back AND with the left? Sheesh @kuz... \n \nhttps://t.co/SqZuGYnUOX\n \n#Basketball #DC #NationalBasketballAssociation #NBA #NBAEasternConference #NBAEasternConferenceSoutheastDivision #WashingtonWizards https://t.co/Sck7pFfNTh",
    "87": "I think the Grant to Washington moves happens. Id actually be surprised if it didnt. He fits all the Washington Wizards parameters outside of on court things. local✅ familiarity with the coach✅ Father was a former Bullet✅",
    "88": "@WashWizards @gaseff54 Fun fact: The 2021-2022 Washington Wizards have an average experience of 3.47 years in the NBA #DCAboveAll #NBA75 #NBA #NBAInformatics #NBATwitter",
    "89": "Preview: Wizards host Nets on Wednesday (Bullets Forever)\n\nWhen: Wednesday, Jan. 19 at 2 p.m. ETWhere: Capital One Arena, Washington, DCHow to watch: N...\n\nAdd your highlights:\nhttps://t.co/yAN5CGdgnX\n #Brooklyn_Nets",
    "90": "Brooklyn Nets @ Washington Wizards\nPick : Brooklyn Nets.\nBasketball. NBA",
    "91": "Wizards vs. Nets preview: Washington looks to beat Brooklyn for the first time this season https://t.co/tDnzoKunKg",
    "92": "A rule of thumb that has never failed me in this business: Everything posted on the Washington Wizards Fanatics Facebook page is true.",
    "93": "2020-21 Panini Mosaic Hobby PYT Break I'll do the 9 teams for $90 if anyone is interested. Breaks live on Facebook as soon as full.\nAtlanta Hawks Cleveland Cavaliers Denver Nuggets Houston Rockets \nMiami Heat San Antonio Spurs \nToronto Raptors Utah Jazz \nWashington Wizards https://t.co/WiOHdHi9RW",
    "94": "A week ago, assistant Joseph Blair was quarantined at home — trying to stay active by using his exercise bike. These days, a now-healthy Blair is focused on a different task: Coaching the Washington Wizards.   #ENMNEWSHEALTH\n\nhttps://t.co/uwbiLOTj5h https://t.co/Y6GxJh8bxZ"
}