{
    "0": "@celtics They CANT shoot!!!! That’s ridiculous!!!",
    "1": "@allandiegos @tdgarden @celtics @BleedGreen_BR @celticsbrasil @CelticsNatiion LETS FUCKING GO",
    "2": "Live not-so-commentating @nba #nba @celtics #celtics #hereforthedrinks https://t.co/1pKd60PDhE",
    "3": "Do not embarrass me @celtics",
    "4": "@celtics need to implement this type of playstyle more. Getting to the line is game changer. https://t.co/snVTtq5v3b",
    "5": "Let's go @celtics ! Time for back to back Ws https://t.co/U3hGtT3udC",
    "6": "THE BOSTON CELTICS ARE ON THE CLOCK. https://t.co/15YklZ7jmf",
    "7": "@celtics #BleenGreen lets go Celtics!",
    "8": "@celtics A rare occasion for the Celtics.",
    "9": "@T_AceofSpades_G @SHAQ @celtics One of the few players they had to change actual NBA rules for because he was just THAT dominant in the paint\n\nOnly a handful of players can say that",
    "10": "@celtics Me - PAIN",
    "11": "@statmuse @jaytatum0 @celtics @celtics_stats 2021-2022 Fantasy NBA strategy: Start anyone that has a game against the Lakers that day = Fantasy Fiesta @cdiddy907",
    "12": "waiting for @celtics 's victory tonight and go to sleep peacefully https://t.co/RqoUIg7Xpx",
    "13": "@Celt_Ike @SHAQ @celtics Most dominant player I have ever seen when he was in his prime.",
    "14": "Blue chip early @SHAQ was some scary intense shit to watch. Wish he found his way to the @celtics long before that fateful season... https://t.co/VlNTnXawQC",
    "15": "@penguinxcrossin @celtics @kcpublicschools @KCPS_Northeast @KCPS_RWL @NEHS_CTE Love to see our students out experiencing a pro game!  #VikingNation representing!!!!",
    "16": "The @Celtics starting Schroder, Smart, Tatum, Grant Williams, Horford on Saturday. #Celtics #NBA",
    "17": "@Marc_DAmico Straight 📠 Marc. IT4 is still dropping BOMBS in pro am leagues and it’s going unnoticed. \n\n@celtics are the worst 4th quarter team in the league, with top defense in the league…. What do they have to lose by signing him to a min contract?? Make it make sense",
    "18": "Ready for tip off! \n-\n#tdgardenboston #bostonceltics #bostonterriersofinstagram #nbabasketball @ Boston Celtics https://t.co/qwAjii0OAd",
    "19": "Alineación de los Thunder para hoy ⚡⚡\n\nPG: Shai 2️⃣\nSG: Dort 5️⃣\nSF: Giddey 3️⃣\nPF: Bazley 7️⃣\nC: Favors 1️⃣5️⃣\n\n⏳ 1:30 AM 🇪🇦\n🎭 Boston Celtics 🍀\n🏟️ TD Garden\n\nHoy es tu día, pequeño. https://t.co/lta5eA9Pv2",
    "20": "#NBA #NBATwitter Today's Lineups\n\n#ThunderUp\nOklahoma City Thunder Starting 5:\nJosh Giddey\nLuguentz Dort\nShai Gilgeous-Alexander\nDarius Bazley\nDerrick Favors\n\n#BleedGreen \nBoston Celtics Starting 5:\nDennis Schroder\nMarcus Smart\nJayson Tatum\nGrant Williams\nAl Horford",
    "21": "@celtics I want grant banished",
    "22": "@celtics Tatum out of that slump now, he been in a different gear past two games, looks like the ALL NBA player that he is",
    "23": "Boston Celtics Starters:\n\nDennis Schroder\nMarcus Smart\nJayson Tatum\nGrant Williams\nAl Horford\n\nPlayers out:\nJaylen Brown\nRobert Williams\n#BleedGreen #NBA #NBATwitter #NBA75",
    "24": "@celtics https://t.co/iyUfI7s0G5 more Celtics propaganda with Tatum getting better at passing &amp; playmaking",
    "25": "@celtics Give Bruno some time pls",
    "26": "@TashaDigital @jaytatum0 @celtics @BostonProShop @OldNavy @Jumpman23 @sprayground Thx appreciate the 💜👌",
    "27": "Tonight's starting lineup for the Boston Celtics: Schroder, Smart, Tatum, Grant Williams, Horford https://t.co/bVWH4AMCA2",
    "28": "@NBA_AU @joshgiddey @okcthunder @celtics Every Giddey game is \"Youngest Ever Triple-Double\" watch for me.",
    "29": "Boston Celtics - Oklahoma City Thunder, over 205 1.99 64% 5u #Sukkelat",
    "30": "@amuci31 @celtics Stop",
    "31": "Keeping with the same lineup tonight #BleedGreen https://t.co/8XLZ8tro7l",
    "32": "⚡️ @joshgiddey is back in action today as the @okcthunder take on the @celtics LIVE on NBA League Pass!\n\n⏰ 11:30am AEDT\n📲💻  https://t.co/7kdyNBOB84 https://t.co/YQtwGhh9wj",
    "33": "@ShoeyM8 @celtics Do you think they’re going to win the chip no less because they beat the lakers? It’s one game can’t get high or low over it. It’s one win",
    "34": "@AnnaHorford Nice to see you in @celtics colors again Anna. And enjoy your tweets too.",
    "35": "@NHLBruins @celtics \n😃 G🖤 🐻’s💛 and G🏀 ☘️’s 💚 https://t.co/1txTx42rBl",
    "36": "Photoshoot Fresh back in #Boston pic w/my guy Curls aka @jaytatum0  @celtics big win last night vs Lakers! Rocking my 2019 Celtics hat  @BostonProShop my vintage #RocaWear varsity jacket, @OldNavy pants &amp; @Jumpman23 Jordan 1 green mids @sprayground  🎒 what r u rocking today? https://t.co/IInMmEDEOc",
    "37": "#NBA | Great games are about to begin!\nAtlanta Hawks vs Charlotte Hornets\nBoston Celtics vs OKC Thunder\nBET NOW:\nhttps://t.co/0rTJpgSrdP https://t.co/PHtodSL3Lx",
    "38": "#NBA | Great games are about to begin!\nAtlanta Hawks vs Charlotte Hornets\nBoston Celtics vs OKC Thunder\nBET NOW:\nhttps://t.co/oyQxgJ5TRa https://t.co/tqMBpyBJsl",
    "39": "Like bro I’m not complaining but my timeline consists of 3 things\n\n1. @CousinStizz \n2. @celtics \n3. boobies",
    "40": "@JavzB @celtics ...that is why if you ask me, i might consider him traded for b. simmons. just add one or two good consistent and shooters. As for the phillies, they can have jb and embiid alternating on the injured list 🤕",
    "41": "WATCH: Boston Celtics alumnus Evan Turner interrupts Jayson Tatum’s presser after Lakers win https://t.co/E8GHsIdhvW https://t.co/Y1bOwuQXgm #nba #sportsnews #basketball https://t.co/PX9sTGwhgl",
    "42": "WATCH: A resilient Boston Celtics took L.A.’s best shot, and finished the night dominating the Lakers https://t.co/Nt4Yl5liGq https://t.co/Y1bOwuQXgm #nba #sportsnews #basketball https://t.co/5Wlao08k4F",
    "43": "Oklahoma City Thunder at Boston Celtics: Lineups, injury reports and broadcast info (11/20) https://t.co/hLjPf3v4s6 https://t.co/Y1bOwuQXgm #nba #sportsnews #basketball https://t.co/nBkFPcQzhH",
    "44": "@iMAJESTiC_ @celtics Nope! Not enough superstar from the other team so tatum would probably play lazy. He is pumped up when playing against elite because he wanted to prove he belongs there, and plays listless when there is no competition",
    "45": "@WaveLength23 @jaytatum0 @Fox_Ro10 @riceboy42069 @PackripEwing @celtics @girldadNFT @topshotfund Welcome fellow Tatum TSD debut…very bullish on this particular one as well.  Congrats! https://t.co/FDScPTpuNY",
    "46": "@JonesToBourne @celtics For real.  Just bring your bot buds to the game to cheer them on to victory!",
    "47": "@celtics Just announce which one of them if not both is getting shut down for the year so we can rip it off like a bandaid",
    "48": "#workhardplayhard \n\nWe came to learn and compete, but that doesn't mean we can't fit in some fun.  Ready for some @celtics action.\n\n#deca\n@kcpublicschools \n@KCPS_Northeast \n@KCPS_RWL \n@NEHS_CTE https://t.co/81Ti4wPEba",
    "49": "@celtics Small but defensive minded backcourt. Play tatum as PF and Brown SF with Uncle Al at center",
    "50": "@celtics Dennis has been great for us. He’s def the X factor.",
    "51": "Catch the @celtics game tonight at 7:30 in our taproom!",
    "52": "Nba cartoons again!!! #NBA #cartoons #newyorkknicks #philadelphia76ers #BostonCeltics #brooklynnets #torontoraptors https://t.co/t9XaGEMsA0",
    "53": "🏀@Lakers were defeated by their eternal rival, the @celtics, despite the return of their star @KingJames, dropping LA to 8-9 🗞️\n\n#NBA #NBANews \n\nhttps://t.co/Qkv5riHdn6",
    "54": "@celtics PLAY PRITCHARD",
    "55": "@BornInBoston96 @celtics Jaylen is dealing with a hamstring not knee....",
    "56": "@CurbumsBestPal @nickdelpizzahut @celtics if you understand them they are funny, if you don’t, then keep it pushing and go on with your day.",
    "57": "Boston Celtics and Boston Bruins both play today. Both better win because ManUtd dampened the mood already",
    "58": "@statmuse @jaytatum0 @celtics @celtics_stats Tatum dropped 30 that sounds good",
    "59": "@yeezysznapprchn @celtics Just gotta wait and see what they do",
    "60": "@yeezysznapprchn @celtics You’re right there. It isn’t out of Schroeder’s league but I feel like the ball moves a lot more when smart is on the floor and I want that with the jays on the floor. And also we need a scorer off the bench and Dennis could be just that. I think we both have valid arguments here",
    "61": "@celtics Yes yes yes. This should be the starting backcourt for the remainder &amp; please give Payton more minutes!!",
    "62": "@celtics cool",
    "63": "@celtics Every game they \"Feel like they're almost ready and sitting them is more so being careful rather then them having bad injuries\"... its OK, you can stop lying to us, both Rob and Jaylen have had the same knee issues for years... they're legitimately Hurt and need more time..",
    "64": "@celtics Schroder finishing his former teams trifecta tonight! ☘️",
    "65": "Slowly chip away @celtics",
    "66": "@celtics Take @Noah_Sayed529 Hamstring and knee",
    "67": "@celtics Dennis about to drop 50",
    "68": "@celtics schroder going to drop 40 tonightz",
    "69": "@EtikalaVishal I enjoy the play of #DwightHoward because of his thundering alley-oop against the Boston Celtics.",
    "70": "@smd5187 @liluzinutsauce @celtics Bro, every shot he takes is a missed shot. Very good deffense tho",
    "71": "@celtics Dennis won't let us down",
    "72": "@celtics pretends to be shocked",
    "73": "@yeezysznapprchn @celtics His shooting is very bad but his ball handling and defense is awesome. With the jays on the floor I would much rather have smart as the ball handler. Dennis could run the 2nd unit and be the scorer off the bench",
    "74": "@celtics Pain.",
    "75": "@celtics fantastic",
    "76": "@celtics Jaylen would be out 2 years with injury let alone do an interview https://t.co/kTI748uyK4",
    "77": "Boston Celtics Player Plays 'King James' While Wearing Shoes With Image of LeBron Bowing to Xi https://t.co/K3nkIZ4ebN",
    "78": "Added Plays\n\n🏈Oregon ML (+130)\n🏀Miami Heat ML (-135)\n🏀Boston Celtics -8.5 (-125)\n\nBOL!! \n\nLet’s stay hot!!🔥\n#GamblingTwitter #BarstoolSportsbook #BleedGreen #sportsbettor #sportsbettingpicks #SportsBettingAdvice https://t.co/hYNCw35Hb9",
    "79": "@gamemeister6 @celtics fan shld know who #JohnnyMost is, regardless of their age. The \"voice of the Celtics\" for nearly 40 yrs! The incredible history &amp; deep traditions of the Celtics are only part of the \"magic\" that make them special. #CUsRise #BleedGreen #ONE https://t.co/Ur1o0jaYC8",
    "80": "Boston Celtics Player Plays ‘King James’ While Wearing Shoes With Image of LeBron Bowing to Xi https://t.co/rDpULj6BuE",
    "81": "@chrnistian @celtics Hit me Up if you need IPTV with free League Passes",
    "82": "@celtics Here’s Rob Williams. https://t.co/t4ZyzVDAPO",
    "83": "@yeezysznapprchn @celtics Nah smart is a much better ball handler than Dennis. Would much rather have smart out there with JB and JT",
    "84": "@celtics they play D unlike that shitty boy in NY",
    "85": "@celtics Not a huge fan myself but I get what he likes.",
    "86": "@celtics Warzone of apex anyway",
    "87": "Coach Udoka says he’s liked having Marcus and Dennis on the court together: “They can do multiple things playing on and off the ball.”",
    "88": "@celtics Jaylen Brown paper bag",
    "89": "@celtics Honestly fine with resting them against Houston too and having them for Brooklyn Wednesday night 🤷🏿‍♂️",
    "90": "@RealENVY9 @wwfcjoe_ @celtics I get where you’re getting @, but at the same time he did drop 46pts fresh off of covid in the season opener. There might be slight rust but I doubt it. He’s been the most consistent Celtic",
    "91": "@celtics Rest em and hope they ready for Brooklyn",
    "92": "@celtics Hopefully Aaron Nesmith will get some minutes tonight https://t.co/MXrQ2qo2uQ",
    "93": "@celtics Rob is never 100%, maybe like 97 at the most",
    "94": "@celtics We should be okay just let them get healthy",
    "95": "@celtics Shouldn’t need them to beat OKC",
    "96": "@celtics This news is not making me feel 100% healthy",
    "97": "@celtics Will they ever be back 😔",
    "98": "#NEBHInjuryReport update: Jaylen and Rob are not feeling 100% healthy, according to Ime Udoka, so neither of them will play tonight. \n\nCoach adds: “We’re not ruling them out for next game (against Houston) and we’re hopeful that they’ll be ready.”\nhttps://t.co/f0UPKfHKtj",
    "99": "Boston Celtics: Marcus Smart, #Celtics drive downhill and run over #Lakers 130-108 - #CelticsBlog https://t.co/GtwYTUBGhG",
    "100": "Boston Celtics: Jayson Tatum propels #Celtics past #Lakers in LeBron James' return - New York Post https://t.co/AL6JzW5xy7",
    "101": "Boston Celtics: LeBron James: How did the #Lakers star look in his return from injury in Boston? | Sporting News https://t.co/KqW0TH96Vd",
    "102": "@CurbumsBestPal @nickdelpizzahut @celtics i’m weird for saying you should admit that you don’t understand a joke? alright",
    "103": "The Boston Celtics will miss a key player vs the #Thunder: https://t.co/iTd4QIirDG",
    "104": "@Guima_1999 @celtics I applaud youre brilliance",
    "105": "@themamajane @celtics @EnesKanter Oh wow, I didn't know this was so systemic 😧\nWhy is it so many sports people are raising awareness (and being punished for it) about issues that should be more widely known? \nWhy aren't international governments doing more? 😔",
    "106": "@RonMott @espn @NBA @Lakers @celtics She proves if you outstanding at what you do you can rise to the top!",
    "107": "@ivfilmtv @celtics @Lakers Nah i don’t think he miss more time unless it’s a serious injury. He is what he is now tho. They have to get chemistry tho they will",
    "108": "@_HannibalT @celtics @Lakers Nothing better than being there and hearing #BeatLA 😄 https://t.co/yLrwiCy73u",
    "109": "WATCH: Boston Celtics alumnus Evan Turner interrupts Jayson Tatum’s presser after Lakers win https://t.co/w5xD2tY9pD",
    "110": "@KingJames @Money23Green @OhioStateFB Meanwhile..in sports...\n\nTonight, Boston Celtics center Enis Kanter wore shoes depicting LeBron James bowing to Chinese dictator Xi Jinping with bags of cash behind him..\n\nAlso...Kanter was playing against LeBron while wearing them..which promotes him to legend status.. https://t.co/qhmkg6KXeY",
    "111": "@_HannibalT @celtics @Lakers Bron is going to take another two weeks hiatus trust me and decide he has an injury that needs a months more recovery the more they lose. He doesn’t want the blame for this",
    "112": "@ivfilmtv @celtics @Lakers We a see. Talk to me right after Christmas lol. Russ will be forced to take a back seat",
    "113": "@_HannibalT @celtics @Lakers And like I told you when they acquired him it won’t mix. 6 games too many. Russ can’t be an after thought.",
    "114": "November 20, 2019: Los Angeles #Clippers &amp; Boston #Celtics battled in an OT thriller that was considered a Game of the Year contender with numerous big play highlights at the end with LA walking away victorious 107-104 in the Staples Center\n https://t.co/z5hMTETE5c",
    "115": "@ivfilmtv @celtics @Lakers They haven’t played but 6 games together lol",
    "116": "@_HannibalT @celtics @Lakers Lmao bro this Lakers team can’t be fixed this season without overhaul. Westbrook has got to be moved but they won’t.",
    "117": "Boston Celtics Daily Links  11/20/21 https://t.co/Ng3rZcTE7z https://t.co/HzmlLNQfy5",
    "118": "Bought some Chinese Food time to watch the @nyknicks game then the @celtics game Lets Go #NewYorkForever #BLEEDGREEN #Celtics #Knicks",
    "119": "@ivfilmtv @celtics @Lakers 🤣🤣🤣🤣 y’all got lucky it’s good we got the next one in a blow out. Can’t believe we gave up that lead smh",
    "120": "Last night was a great W with me in attendance 🍀😉 but @_HannibalT real quite lol 😂… Live at @celtics vs @lakers… #LetsGoooooo 🍀 #CityofChampions #LALvsBOS https://t.co/U6kxyoehPY",
    "121": "@NBATV replaying 1993 playoff game @Hornets vs @celtics\nHornets had Larry Johnson\n(Grand-Mama) Alonzo Mourning-Dell Curry-Kendall Gill &amp; Mugsy Bogues. Charlotte had a good squad. Who knew Dell's 5yr old baby boy waiting at home wld become Greatest Shooter in @NBA History 😆 #NBA",
    "122": "We love our Boston Celtics and “the truth”   Welcome Back to Boston Paul Pierce ☘️ @celtics https://t.co/wJRGemfcuo",
    "123": "We, (Boston @Celtics), also beat a LeBron James led LA Lakers. Turning out to be a decent weekend. The jury is still out on Ime Udoka though and Brad Stevens.",
    "124": "@NBA @celtics Lebron Tatum Jr",
    "125": "Tonight I get to see the Boston CELTICS face Giddey and SGA I’m so hyped lmao",
    "126": "@TyeSkala @celtics I know. You guys need all the help you can get.",
    "127": "@tvabby Breaking out a cigar for a win in mid-November that gets the @celtics to .500 is “big loser energy” as the kids say.  What an embarrassment this organization has turned into.  If ownership had any balls they’d never allow Maxwell in the building again.",
    "128": "@celtics Well I would hope so they’re all way past their prime.",
    "129": "Oklahoma City Thunder at Boston Celtics   Game #17   11/20/21 https://t.co/3OOBUbgOHe https://t.co/iYfUrulJd0",
    "130": "@AnnaHorford Please let Al know that we love seeing him play hard every night, on both ends of the floor. Horford 2.0 for the @celtics has been a blessing for everyone. ☘ #Celtics",
    "131": "@ZLR43 @celtics They said 1-2 weeks on the 8th. 2 weeks would be the 22nd, the timeline has been completelt reasonable. Rob's injury wasnt \"not a big thing\" it was a \"short-term thing\" big difference, one is talking about gravity and one is talking about time.",
    "132": "@IrvingRajon @wwfcjoe_ @celtics Honestly it would be good to limit his minutes and actually play him against the Rockets. Going into the Nets after 3 weeks of not playing, may not be best. Then again I’m not the coach and it’s just an opinion.",
    "133": "@985TheSportsHub @celtics @tdgarden @1057WROR Somebody gonna be pissed u making them miss out on Christmas music.",
    "134": "Thank you @HonestLarry1 for this great picture of @celtics legend Larry Bird.  It's what Celtics pride and passion are all about, especially when we're beating the Pistons in one of the greatest 7 game Eastern Conference Finals series https://t.co/Zu71vbjo73",
    "135": "@CurbumsBestPal @nickdelpizzahut @celtics bro if you don’t understand just stay quiet",
    "136": "@JcobMcl @celtics Both better than PRashford",
    "137": "@picsofzackary @1ZackaryArthur How'd that game vs @celtics go?",
    "138": "Looking for a value bet?  See if the Oklahoma City Thunder-Boston Celtics Predictions and Preview for 11/20/2021 is one in our preview.  No crazy hype just a prediction and preview. #Basketball #NBA https://t.co/qDi8qVdUEo",
    "139": "WATCH: A resilient Boston Celtics took L.A.’s best shot, and finished the night dominating the Lakers https://t.co/WULbmhGSvk",
    "140": "@RealBillRussell @tdgarden @celtics @Lakers @NBA @ESPNNBA @espn @BostonGlobe @Eminems_365  you should get a hat like him",
    "141": "@celtics Please stay with the Celts Dennis! 🍀🍀🍀❤❤❤",
    "142": "Oklahoma City Thunder visits Boston Celtics Predictions and Preview for 11/20/2021 today.  Who are we taking in this game?  Find out now. #Basketball #NBA https://t.co/qDi8qVdUEo",
    "143": "@RealBillRussell @tdgarden @celtics @Lakers @NBA @ESPNNBA @espn @BostonGlobe Greatest champion ever!",
    "144": "@celtics You mean Bruno? https://t.co/RNVUlrQjEM",
    "145": "@JTKawesome @MBTA @tdgarden @celtics Aw thanks",
    "146": "Boston Celtics Player Enes Kanter Wears Shoes Depicting LeBron James Bowing To China's President Xi Dressed Like Winnie The Pooh https://t.co/lMtbRvkIlN",
    "147": "@WaveLength23 @jaytatum0 @Fox_Ro10 @riceboy42069 @PackripEwing @celtics @girldadNFT @topshotfund Congratulations jumped in a few week weeks ago … such a sick dude",
    "148": "@WaveLength23 @berkokid @jaytatum0 @riceboy42069 @PackripEwing @celtics @girldadNFT @topshotfund Oh he needs that mojo! His FG% has been frighteningly low and it seems like Udoka’s coaching scheme wants Tatum taking his his shots. Hes such a smooth player tho, he’ll get hot",
    "149": "Oklahoma City Thunder at Boston Celtics: Lineups, injury reports and broadcast info (11/20) https://t.co/fMuaDxbmlA",
    "150": "@celtics As of now we playing amazing without brown  so there no point in rushing him let him rest.  Schroder needs some rest too but we need him. Tatum most likely gonna play shit today.",
    "151": "@celtics Had a decent summer league. Athleticism for sure as a Timelord backup",
    "152": "@celtics No Timelord today",
    "153": "@Taghkanic @KeithSmithNBA @AdamMKaufman @jaytatum0 is clutch! He's not trying to impress anyone, smh. @celtics are running a new offense; have a new coach w/many new players &amp; don't hv a true point guard. They'd an adjustment period for everyone... Stop your b.s. takes please. #HatersSuck #HatersReallySuck",
    "154": "@celtics What happened to the 1sr round pick from Europe we have from a couple years ago? When is this player coming to the Us?",
    "155": "@celtics @JetBlue LETS GOOOO!!!!",
    "156": "@iMAJESTiC_ @celtics Hopefully if Tatum plays like last night",
    "157": "@MalcolmWillie95 @One_of_one247 @celtics Nitpicking? Cmon now you sound crazy",
    "158": "@celtics @ArbellaIns Bob and Jackie got it right (of course) through the first 14.  I would go Cowens over Pierce for top 5 because of the MVP and competitiveness.  For #15 I like Ray Allen despite only playing 5 years.",
    "159": "The Whiteboard: The Boston Celtics offense looks broken #FanSided #NBA https://t.co/lKhEDrbn2I",
    "160": "Boston Celtics News - @BrunoFernando has been called up from the @MaineCeltics. #BrunoFernando #bostonceltics #celtics #bostonathlete #boston #basketball #bostonsports #NBA75 #NBA #goceltics #bleedgreen #bostonathletemagazine https://t.co/4D70CPEYE2",
    "161": "NBA Betting Preview: Boston Celtics vs. Oklahoma City Thunder https://t.co/TBJeyWHJz3",
    "162": "@peakisahero @wurtwurtwurt @RealBillRussell @tdgarden @celtics @Lakers @NBA @ESPNNBA @espn @BostonGlobe So fakin what?",
    "163": "@tdgarden @celtics You require ze papers ja?",
    "164": "@forster666 @celtics @ArbellaIns Five players, one game at their Celtics prime: Bird, Russell, Garnett, Cousy, Pierce but you can make arguments for guys like Walton, Isaiah, Silas, Allen, Tatum.  Hard to leave Havlicek and Cowens off any team.  Honestly, Isaiah was amazing but not worthy because of his defense.",
    "165": "@LaParka52 @jaytatum0 @celtics Totally! 💯 There should be a #NBALeaguePass discount for @nbatopshot holders to follow their favorite players too.",
    "166": "@fromFenwaytoTD @celtics @ArbellaIns You just failed Bob Ryan's test for being allowed in this discussion.",
    "167": "Kudos to Boston Celtics center Enes Kanter for calling out hypocrite and willing servant of the Communist Chinese Party LeBron James.",
    "168": "Attending the @celtics game tonight?\n\n🟢 Proof of vaccination OR qualifying negative COVID-19 test is required for all guests 12 years and older. \n🟢 Masks are required for all guests 2 years and older.\n🟢 Have your mobile ticket ready. \n\nMore info: https://t.co/hWOT5KtSDr https://t.co/a6PpTelPZh",
    "169": "@dexalexander @ShaneHelm @Lakers @celtics You were pretty close, you're just rooting for the wrong team. 😆",
    "170": "@EricCity @jaytatum0 @Fox_Ro10 @riceboy42069 @PackripEwing @celtics @girldadNFT @topshotfund Thanks! 🔥 I worked up by letting go of Collector Score and selling moments that I like but aren’t longterm fire. I’d rather have a few superstars than a slightly better chance at the CS pack lottery. I’ve gotten bad queue positions in every PQ anyway 🤣",
    "171": "@celtics Said he will contribute more guys. Never said Grant hasn’t contributed",
    "172": "@WaveLength23 @jaytatum0 @Fox_Ro10 @riceboy42069 @PackripEwing @celtics @girldadNFT @topshotfund I think he’ll be a top 10 player over the next decade. Celtics’ roster isn’t ideal, but I’m big on him.",
    "173": "@datdominicano @jaytatum0 @celtics Appreciate the 🔥👊🏼",
    "174": "@bitcoinzay @celtics As of right now, Lakers deserve every dart thrown at them right now for the pathetic play they have displayed this season.",
    "175": "@celtics …and even before ;) 🏀 ☘️",
    "176": "@moneymohiuddin @celtics Lmao. Good one",
    "177": "@Fox_Ro10 @jaytatum0 @celtics Thought of you right away, bro! 😎 I knew this would get @Fox_Ro10 approval! 🏅",
    "178": "@berkokid @jaytatum0 @Fox_Ro10 @riceboy42069 @PackripEwing @celtics @girldadNFT @topshotfund Thanks! 🌟 Fortunately I relied on that current undervalue… 👀Watching the $1200 floor a month ago &amp; then the dip came (+ the Celtics hadn’t been playing well). It dropped to $800 and TS is starting a rebound. Tatum got his mojo back so I finally committed!",
    "179": "Never forget the Boston Celtics only have 1 ring since 1986. https://t.co/F16NTeiAyI",
    "180": "@sengfoo88 BOSTON CELTICS 🍀🏀",
    "181": "@celtics In other news, Francicso Franco is still dead.",
    "182": "@celtics 1-2 weeks for Jaylen they said. Not a  big issue for Robert Williams they said. #Celtics need to stop underestimating injury time lines. It makes players look soft when they don't meet them and it makes the franchise look dumb and/or caring about perception more than reality.",
    "183": "@statmuse @jaytatum0 @celtics @celtics_stats I’m most impressed with the steals and deflections.  That’s my indication that he’s aggressive. The contesting at rim on the Davis lob and the free safety steal on LeBron are rewind worthy.  The teams defense is the best indicator that they now trust each other…",
    "184": "@jason5022 @celtics Ratio",
    "185": "The Boston Celtics’ @EnesKanter has been using his fame &amp; social media accounts to publicly confront the Chinese government for its egregious human rights abuses.\n\nHe is proving that athletes can confront the world’s most powerful authoritarian government. https://t.co/ckgFpzxRtp",
    "186": "@AlaskanNinja @jaytatum0 @Fox_Ro10 @riceboy42069 @PackripEwing @celtics @girldadNFT @topshotfund Thanks @AlaskanNinja! That other S1 of his is dope though! Definitely a longterm hold 🏆",
    "187": "@WaveLength23 @jaytatum0 @Fox_Ro10 @riceboy42069 @PackripEwing @celtics @girldadNFT @topshotfund Let's gooooo!!! That's my hope too man.. so for you... I hope you get to upgrade that to a rare one day 👀",
    "188": "@ACfor3_NFT @jaytatum0 @Fox_Ro10 @riceboy42069 @PackripEwing @celtics @girldadNFT @topshotfund Thanks @ACfor3_NFT! After spending that much % on a Moment it helps to hear the good vibes! 😎 I GENUINELY hope you get a massive pack win one day (or NFT Mint) that you can flip into the Tatum TSD. Heck, maybe even the Rare or Legendary version! 🔥🏆🔥",
    "189": "@celtics there was something in the air that night \nthe stars were bright",
    "190": "@celtics Jaylen Brown a brown paper bag for sure",
    "191": "@WaveLength23 @jaytatum0 @Fox_Ro10 @riceboy42069 @PackripEwing @celtics @girldadNFT @topshotfund Dude... this is my goal too.. his and JB's debut is what i want. But i will have to settle for Rob Williams and Marcus Smarts debut for now 😂😂\n\nFire purchase!🔥🔥🔥",
    "192": "Gotta sign lil big bro 👀 @celtics @jeremiahtilmon_ https://t.co/SJ1XGkG9kw",
    "193": "@atul_gautam10 @celtics Youre high if you think Grant is not contributing",
    "194": "@generaldwilson @celtics @NBA Your pipes are great!",
    "195": "@NBA @celtics Incredible drive.",
    "196": "@ESPNPR @tdgarden @ESPNNBA @stephenasmith @RealMikeWilbon @JalenRose @Espngreeny @wojespn @Lakers @celtics @dallasmavs @Suns Disgusted by the ignorant comments on the Rittenhouse trial.  Sat down to watch the game and turned it off and am done with the NBA.",
    "197": "@celtics @BrunoFernandoMV stay strong 🙌🏾🙏🏾",
    "198": "@clinicalkai @cule_Legend just like GOLDEN STATE warriors will always have packed seats but not the Boston Celtics \n\nmind you most of them are bandwagon but hey a win is a win in he eyes of some",
    "199": "@celtics where is Vincent Poirier when you need him 😄",
    "200": "An emotional victory over their rivals has the Boston Celtics riding high into a home matchup with the Oklahoma City Thunder on Saturday night. https://t.co/lIhV3lnZ7m",
    "201": "@JGrog81 @IanWood79461087 @celtics @markwahlberg Ok spelling police cool it",
    "202": "@Inkotanyi_C @celtics Fingers crossed pee!!!",
    "203": "🏀 #NBA\n\nOklahoma City Thunder 🆚 Boston Celtics\n📆 Dom 21 nov 01:40\n\n#Raspibets #FreePicks #FreeTips #StatBets #SportsBetting #BettingTipster #ThunderUp #BleedGreen\n🆓🔎📈⬇ https://t.co/Zl4PdMxbK7",
    "204": "WOW!!!!! SO MUCH LOVE FROM THE @celtics ORGANIZATION!!!!!! I heard y'all!!!!! 😁😁❤❤ The excitement at an @NBA Game is so dope!!!! Yo Vegas.....y'all up next!!! LETZGOOOOOOOO!!!!!! #FromBostonToVegas #NationalAnthemTourContinues #SingWithMe #Unity #Honored #Blessed #GodIs https://t.co/sjTBNZXSay",
    "205": "@celtics Cool now treat every game for the rest of the season like it’s special.",
    "206": "@celtics Like clockwork",
    "207": "@LRmcfc @IanWood79461087 @celtics Who’s he? I’ve heard of @markwahlberg but not Mark Warberg",
    "208": "@celtics better than bruno mars",
    "209": "@celtics JB ever gonna play?",
    "210": "@celtics Give my brother some minutes fr not that shitty end of game minutes🇦🇴💯🔥🔥",
    "211": "@dexalexander @moynihan @Lakers @celtics But you are a believer!",
    "212": "@celtics Bruno dey disguise 😂😂",
    "213": "@IanWood79461087 @JGrog81 @celtics Alright Mark Warberg calm down",
    "214": "@NBA @celtics Who is the number 6? Tatum went past him so easily.",
    "215": "@celtics Boston teams own LA teams.",
    "216": "Analyzing Saturday’s Oklahoma City Thunder at Boston Celtics odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/1wIw5jTsf2",
    "217": "@HoopsEmpire_ @baronskii @statmuse @jaytatum0 @celtics @celtics_stats Pierce took a much less talented team to the ecf don’t act like they were shit the whole time  before kg and Ray got here",
    "218": "@LRmcfc @IanWood79461087 I’m a basketball 🏀 fan these day @celtics innit",
    "219": "@celtics The only Bruno I know is silêncio Bruno and Bruno Mars",
    "220": "@celtics Bro I feel bad for him at this point",
    "221": "@One_of_one247 @celtics Folks keep thinking it's the training staff, but this organization feels like they're good enough to be resting players and nitpicking which games their stars will play, delusional",
    "222": "What a magical night to celebrate our work towards developing a coloring book to explain the science of the #mrnavaccines! Truly grateful for the opportunity to lead this project @UMassMedRTI @UMassChan 🥰 doesn’t hurt that @celtics pulled out a HUGE win against the Lakers! 💚💚 https://t.co/hr0g9w74bo",
    "223": "@celtics CALL UP SAM HAUSER",
    "224": "@YUmurerwa @celtics Let’s wait for the playoffs wabona mwisubiyeho😂😂😂😂",
    "225": "#NBA #GAMEDAY  \n\n🏀 Oklahoma City #Thunder 🆚 Boston #Celtics \n\n🕢 7:30pm 🇺🇸 (CT)\n7:30pm 🇲🇽🇨🇴🇪🇨🇵🇪 \n8:30pm 🇵🇾🇨🇱🇻🇪🇧🇴🇩🇴🇵🇷 \n9:30pm 🇦🇷🇺🇾🇧🇷\n1:20am 🇪🇸\n\n🏟 TD Garden\n\n#ThunderUp https://t.co/tHh5ZirE2B",
    "226": "@celtics Oh, good.",
    "227": "@celtics He must be upset. Bruno even played in the Summer League, now in the g League too.  He is better than Kanter!",
    "228": "@38aaaf4ccbd84e4 @BolBol @celtics need this man",
    "229": "The Los Angeles Lakers were defeated by their eternal rival, the Boston Celtics, despite the return of their star LeBron James, dropping LA to 8-9. https://t.co/vijZokIZx0 https://t.co/AkG6KJ4K8Q",
    "230": "I am once again asking the Boston Celtics to play Bruno",
    "231": "@celtics @okcthunder @NBCSBoston @1057WROR Cut kanter. He’s a distraction to the team",
    "232": "@atul_gautam10 @celtics I thought so too 😂😂😂",
    "233": "@celtics Cut that weirdo kanter",
    "234": "@atul_gautam10 @celtics Williams have been very serviceable this year.",
    "235": "@ShaneHelm @moynihan @Lakers @celtics I’ve never been much of a prophet 🤣",
    "236": "@celtics Play Sam Hauser!!!!",
    "237": "@celtics Don't blame you after his performance today @Aaron____D",
    "238": "@celtics Thought you had called Bruno Fernandes to take him away from the nightmare that is Manchester United. Will contribute more than Grant Williams though.",
    "239": "There’s always one random player that torches the @celtics it’ll be @joshgiddey today 👍 but Cs win by 15 ✌️💚🍀🏀 https://t.co/B9UPbIWsHl",
    "240": "@celtics Thought that said Bruno fernandes for a sec 😂🙈",
    "241": "@CurbumsBestPal @nickdelpizzahut @celtics just admint that the joke flew wayyy over your head",
    "242": "@celtics I dont recall Bruno Fernando.",
    "243": "@celtics Tell Ime to give him some minutes over Kanter today. Want to see him get some meaningful minutes",
    "244": "@celtics but can the team continue to play with this effort? I am challenging you!",
    "245": "@celtics And we beat that ass. ☘️☘️☘️☘️☘️",
    "246": "The Boston Celtics are listing Jaylen Brown OUT tonight against the Thunder.  \n\nOKC also lists Mike Muscala out for rest tonight on the 2nd night of a back-to-back. Derrick Favors rested last night in Milwaukee.",
    "247": "@celtics Better than puno penandes",
    "248": "@celtics Terrible against Watford",
    "249": "@celtics From the Mancs? They were that shite? 😁🤔\n\n#OleAtTheWheel",
    "250": "@celtics Again??? Lol what we doing rn?",
    "251": "@celtics Good let him play he has to be better than Enes",
    "252": "@celtics This can’t be serious",
    "253": "@celtics Now call up Sam Hauser",
    "254": "@celtics Hopefully he gets a chance today",
    "255": "@celtics Scheduled tweet",
    "256": "@celtics Good! Better than Kanter!",
    "257": "@celtics bro y’all recall bruno every day",
    "258": "@celtics Announce Sam Hauser",
    "259": "@celtics Play him",
    "260": "@celtics Bro why is switching every week 😭",
    "261": "@celtics Just keep him in Maine",
    "262": "@celtics Kyler Murray would never",
    "263": "@celtics Surely you guys don’t have to tweet this every time",
    "264": "@celtics Bro make ur mind up",
    "265": "@celtics Scheduled tweet",
    "266": "@celtics Nice",
    "267": "We have recalled Bruno Fernando.",
    "268": "@CurbumsBestPal @celtics You’ve got to be trolling",
    "269": "@CurbumsBestPal @celtics No way you took this literal",
    "270": "#Catawiki Boston Celtics - Pallacanestro NBA - Kevin Maurice Garnett - Jersey and shorts https://t.co/I6CkVUykWN",
    "271": "@celtics Not a rivalry when the Celtics own LeBitch and the Fakers",
    "272": "@celtics he OWNS the lakers",
    "273": "@celtics Owner of the Lakers already and he’s only 19",
    "274": "@celtics Keep that same energy the rest of the way",
    "275": "Rivalry games hit different ☘️ https://t.co/DuU2jdQA53",
    "276": "@celtics tatum is our new TRUTH",
    "277": "Headed to @tdgarden to cheer on @celtics?\nTake the T.\n\nBut first, check out https://t.co/2OaNT2B9R1 for a dedicated guide with the best routes to the game during #BuildingABetterT diversions on the Green Line D Branch + Red Line.\n\n😷Remember, masks are required while on the T. https://t.co/RlpQbeVvks",
    "278": "@smd5187 @celtics Not being sarcastic at all lmao I mess with Romeo",
    "279": "@statmuse @jaytatum0 @celtics @celtics_stats Can’t forget the play-in round",
    "280": "#iBullshitYouNot \n#NBA\n\nBoston Celtics player Enes Kanter wore sneakers last night — while playing against the Lakers — with LeBron James bowing down while China’s dictator puts a crown on his head. https://t.co/r46q2lUTOK",
    "281": "Shout out to @jaytatum0 ! You stepped up and had a huge game against the arch-rival when the @celtics most needed it. It’s the kind of performance you need to submit when you want to earn a place among the pantheon of legends.\n\nStay humble. Keep grinding.\n\n#BLEEDGREEN 🏀💚☘️",
    "282": "@celtics use TPE for Turner or Sabonis 🤷‍♂️ https://t.co/prmB0KzKFA",
    "283": "The @celtics as well as the @NBA are sponsored by Nike.. seeing how much a social warrior Enes is now you’d figure he’d take the Kyrie route and defer to playing anymore. Also hard to take him seriously when he’s tweeting from an iPhone…Made in China by..? https://t.co/n1SpM8EPJe",
    "284": "@BigMacJonesStan @celtics You’re something else, Tatum is the glue for the Celtics, He is their franchise player currently as well, who in right mind will trade a young superstar that is still getting better",
    "285": "November 20, 2019: Los Angeles #Clippers &amp; Boston Celtics battled in an OT thriller that was considered a Game of the Year contender with numerous big play highlights at the end with LA walking away victorious 107-104 in Staples Center https://t.co/PlkGW7L0Cb",
    "286": "Jayson Tatum reacts to Paul Pierce attending Celtics vs. Lakers game #BostonCeltics #PaulPierce https://t.co/5JwERzkavt",
    "287": "@celtics They need a whole new training staff whole new strength and conditioning coaches new everything like come on we are constantly hurt",
    "288": "@celtics @okcthunder @NBCSBoston @1057WROR LET’S GO CELTICS #BLEEDGREEN",
    "289": "@eric78jtk @ESPNPR @tdgarden @ESPNNBA @stephenasmith @RealMikeWilbon @JalenRose @Espngreeny @wojespn @Lakers @celtics @dallasmavs @Suns Since when do libs in the public eye ever educate themselves or do their research? That would be asking a lot lmao",
    "290": "I just watched @KevinGarnett5KG’s @Showtime doc ‘Anything is Possible” for a 3rd time. \n\nIf people had a quarter of his passion …\n\nI can’t wait until the @celtics raise his No. 5 to the rafters, so his Boston legacy is immortalized!",
    "291": "The Boston Celtics play basketball today #BleedGreen https://t.co/yt6LDRT9yk",
    "292": "@smart_MS3 New-old backcourt coming soon? 🤞 #bringbackIT @celtics",
    "293": "Give her a 10 day contract @celtics https://t.co/rQp9XKQZjN",
    "294": "@wwfcjoe_ @celtics Should handle okc &amp; hou though without him",
    "295": "@wwfcjoe_ @celtics Same. Once he didn’t come back vs lakers, plan has to be to return vs nets. If he doesn’t play that game it’s definitely serious",
    "296": "@IrvingRajon @celtics i suppose, just want us to make the most of the run and get the wins",
    "297": "Wow 😮 Larry Bird @celtics I feel old. https://t.co/TRT1Qv8N2F",
    "298": "I'm hearing the only way that  @KingJames will play against the @DetroitPistons if he can come out like this !!! That game against the @celtics took alot out of him !!! https://t.co/tYgqkbTmGx",
    "299": "We are the city of champions #BostonCeltics @celtics @jaytatum0 @FCHWPO",
    "300": "@wwfcjoe_ @celtics Might as well rest him against OKC &amp; Houston. I feel he’s coming back against the nets",
    "301": "The Boston Celtics https://t.co/HPGK5qYStE",
    "302": "The Boston Celtics eked out an impressive win over the Los Angeles Lakers, 130-108, at the TD Garden on Friday (Saturday, Manila time). https://t.co/sdgnu64NNv",
    "303": "@Marc_DAmico Come on Celtics lol @celtics",
    "304": "@RealBillRussell @tdgarden @celtics @Lakers @NBA @ESPNNBA @espn @BostonGlobe Looking good last night!!  Need you at more games!!!",
    "305": "The Boston Celtics will be without Jaylen Brown and could be missing Robert Williams, too. See their injury report against the OKC Thunder:  https://t.co/YTfcIg8Bgh",
    "306": "@NBALatam @celtics @Lakers Celtics ☘️",
    "307": "@celtics @paulpierce34 @RealBillRussell Should be playing like this on a daily basis no just not on big nights. Consistency is gonna be the only way this team makes it, we have the talent, we have the drive, but we need to play each game like we did last night. #BLEEDGREEN @jaytatum0",
    "308": "Frank Vogel on Lakers need to do in offense to win #BostonCeltics #FrankVogel #LosAngelesLakers https://t.co/j4MtJPfOF7",
    "309": "@celtics When is jaylen brown never not hurt??",
    "310": "@CLNS_Nick @celtics Fair enough arguably so.",
    "311": "@celtics why are we never healthy",
    "312": "@celtics Just announce they are out for the year already.",
    "313": "@weraaaaaa_ @celtics @okcthunder @NBCSBoston @1057WROR Liking your own tweet? Lok https://t.co/HWcBekvN77",
    "314": "@NBAHistory @NBA @Lakers @celtics It definitely going to be amazing @lakers",
    "315": "@celtics We beat the Lakers with this lineup so we SHOULD BEAT THE THUNDER RIGHT?!?!?",
    "316": "@celtics @okcthunder @NBCSBoston @1057WROR Just don't forget the updates! https://t.co/2N7ipOPryr",
    "317": "thank god for the boston celtics for always having my back when man united continues to suck horseshit",
    "318": "@JaylenTatum0 @celtics On November 8 they said he'd be out 1-2 weeks. 2 weeks is up on November 22, so 2 days from now",
    "319": "@wwfcjoe_ @celtics On November 8 they said he'd be out 1-2 weeks. 2 weeks is up on November 22, so 2 days from now",
    "320": "@TheCelticsTake @celtics On November 8 they said he'd be out 1-2 weeks. 2 weeks is up on November 22, so 2 days from now",
    "321": "It’s Gino time @tdgarden #bostonceltics #BeatLA https://t.co/Ghv17WD7NC",
    "322": "🔸 NBA (11.19.2021) 🔸\n\nPerformance of the Night \nJames Harden 🏆\n50.8 EPS \n\nTeam of the Night \nBoston Celtics 🏆\n66.9 Team EPS Spread \n\n#NBA75  #nba https://t.co/3CUQim4HNK",
    "323": "Good Morning @celtics fans! We beat the #Lakers last night. Which means today is a good day. #nba #Celtics",
    "324": "@celtics Take my right hamstring, take my left ankle, and take my left knee but please don’t take @Noah_Sayed529 body parts",
    "325": "@RealBillRussell @tdgarden @celtics @Lakers @NBA @ESPNNBA @espn @BostonGlobe What an incredible trophy case, and he has even more!",
    "326": "@weraaaaaa_ @celtics @okcthunder @NBCSBoston @1057WROR Okc is winning btw",
    "327": "@ShoeyM8 @celtics It’s one win. I’m being realistic there’s a difference",
    "328": "@celtics @okcthunder @NBCSBoston @1057WROR man united doesn't exist let's go guys",
    "329": "@celtics @okcthunder @NBCSBoston @1057WROR No way imma get Marcus’ dinner on the table before tip off",
    "330": "@celtics @okcthunder @NBCSBoston @1057WROR Game 2/4 of Vacation 2021! Let’s get another win to follow up last night!",
    "331": "S/O to the City of Boston, the @NBA &amp; the @celtics for this grand honor. Terrence would've been proud. RIP @terrenceclarke_. 🙏🏿 https://t.co/CKDJ8cu9Lh",
    "332": "@celtics @okcthunder @NBCSBoston @1057WROR Did someone say two in a row? https://t.co/APIoaEULA1",
    "333": "@liluzinutsauce @celtics You're probably being sarcastic, but he is only playing the role he has been assigned. Plays defense and only takes shots when open. Thats the way of the star tiered NBA.",
    "334": "TONIGHT ☘️ Celtics vs @okcthunder \n\n⏰ 7:30PM\n📺 @NBCSBoston\n🎙 @1057WROR \nSmall Business of the Game: https://t.co/rMYQjcgn8n\n\n#BleedGreen https://t.co/239WHXB3uj",
    "335": "How dangerous can rim pressure make the Boston Celtics? ‘As dangerous as we want it to be,’ says Marcus Smart https://t.co/mZAEv3tHMd https://t.co/Y1bOwuQXgm #nba #sportsnews #basketball https://t.co/T6uV9pj9xe",
    "336": "@celtics you bums we are begging u https://t.co/zYNX73AT7r",
    "337": "@jacoposo @StoolGreenie @celtics @FCHWPO @rob_williamsIII Luckily whenever JB returns that will either have Schroeder or Horford coming off the bench. Should take a small amount of pressure off the bench w/ a playmaker",
    "338": "@JaylenTatum0 @celtics It's still early in the season. They're just being cautious with the hamstring",
    "339": "NO WAY 💀 @celtics YOU BROADCAST NUTS FOR THIS 🤣💀 https://t.co/IrZ92CdkPJ",
    "340": "Jayson Tatum put on a scoring clinic.\n\n37 PTS\n11 REB\n3 STL\n64.2 FPTS\n\nBig home win for the @celtics. https://t.co/zujr0f0Yie",
    "341": "@celtics Man… hoping I get to wear my @FCHWPO jersey at least once while I’m in town…",
    "342": "@celtics No worries we have Romeo Langford",
    "343": "@celtics I understand there is no point in rushing him back but when is Brown expected to be back?",
    "344": "@wwfcjoe_ @celtics it was always 1-2 weeks",
    "345": "@JonesToHarry @celtics It is",
    "346": "@celtics do you guys not have a masseuse or something? Is everyone over their shoe budget for the year and using old ones?",
    "347": "@celtics jaylen’s been “close” for a week now, this doesn’t make any sense",
    "348": "@celtics Praying for health",
    "349": "@celtics Just win",
    "350": "@celtics That’s JTatum when he keeps his game simple and when he is aggressive.",
    "351": "@JesseKellyDC There are some salient exceptions, however. Witness this Boston Celtics star:\n(Worn during a game with the Lakers) https://t.co/3jdSYQnd49",
    "352": "@celtics OUT AGAIN",
    "353": "@celtics Praying for no injuries SOON https://t.co/9wZM5wARxA",
    "354": "@celtics is it worse than we thought for brown? tf is going on",
    "355": "@celtics TAKE MY ANKLE AND MY KNEE",
    "356": "@celtics Schroder is a better Kemba",
    "357": "@celtics Take my hamstring and knee",
    "358": "I actually thought there would be a breaking news alert From the NBA this morning after that @Lakers @celtics Game 😤😤😤Franky V Has To Gooooooooo",
    "359": "@celtics God damn",
    "360": "@celtics fuck",
    "361": "@SociosHoops @MiamiHEAT @WashWizards @hornets @ATLHawks @okcthunder @celtics @OrlandoMagic @Bucks @memgrizz @Timberwolves @utahjazz @SacramentoKings LET'S GO HEAT!!! #HeatCulture",
    "362": "#NEBHInjuryReport vs. Oklahoma City:\n\nJaylen Brown (right hamstring strain) - OUT\nDennis Schröder (left ankle sprain) - PROBABLE\nRobert Williams (left knee tendinopathy) - DOUBTFUL",
    "363": "@Eloy98631379 @NBA @jaytatum0 @celtics From what I heard the Lakers are the best team in the league with Bron 🤷‍♂️",
    "364": "@smart_MS3 @iBurrisJr @celtics @jaytatum0 @Al_Horford You played great @smart_MS3 !!",
    "365": "James Worthy on Lakers’ loss vs. Celtics: “It was ugly” #BostonCeltics #JamesWorthy #LosAngelesLakers https://t.co/hgTRgLno4h",
    "366": "@smart_MS3 @iBurrisJr @celtics @jaytatum0 @Al_Horford Great job getting in your OSU bag!",
    "367": "CHECK OUT O.M.I.S. LIVE REPLAY! FRIDAY NIGHT NBA ON ESPN @Lakers VS. @celtics !\n\n@celticsblog @LakersNation \n#DraftKings #sportsbettingadvice #SportsPicks #sportsbets #sportsbetting #Celtics #lasvegasstrip #casinos #Lakers #NBA #NBA75 #NBATwitter #lakersvsceltics #LakersNation https://t.co/oug10uGzSe",
    "368": "@Bopyataco @Dunkthatball @celtics L cry",
    "369": "@GlobeBobRyan @Marc_DAmico @PhilBRK @PMBIII @celtics Yall doing my boy Olynyk wrong",
    "370": "Please cut enes kanter @celtics",
    "371": "@ChrisForsberg_ The @celtics need someone who can knockdown open looks.  What would be the harm in bringing @isaiahthomas back? He could help them!!!!",
    "372": "@celtics i’ll be at game on the 17th against the warriors…just be healthy for that game ok ? thanks 😂",
    "373": "@StoolGreenie @celtics Please don’t let the Celtics be the Celtics and cough up a furball this evening.",
    "374": "@6toHombreLATAM Los Angeles Lakers 12 💍\nMinneapolis Lakers 5 💍\nBoston Celtics 17 💍",
    "375": "3 takeaways from the Boston Celtics 130-108 win vs. the Los Angeles Lakers (via @YENDO28)\nhttps://t.co/PdVZjd5euW",
    "376": "@tdgarden @celtics “Where opposing fans and fans of players are not welcome.”",
    "377": "Last night, #Tatum was proposed to stand out in the Garden during the classic of classics between #Lakers and #Celtics  \n37 points and 11 rebounds for Tatum and a bulky victory of about @celtics in which Smart and Schroeder were also very important. \n  https://t.co/h0yiwFSrW6",
    "378": "@brandnewglock1 @HoopsEmpire_ @statmuse @jaytatum0 @celtics @celtics_stats Yeah he’s amazing",
    "379": "@smart_MS3 @celtics @jaytatum0 @Al_Horford Thank you bro! Love taking these vacations to watch you guys.",
    "380": "@DanKelley66 @RealBillRussell @tdgarden @celtics @Lakers @NBA @ESPNNBA @espn @BostonGlobe I agree Dan. lol",
    "381": "@FanaticsSucks @NBA @sixers @celtics I got a Sixers city edition hoodie after I order a Wizards.",
    "382": "@iBurrisJr @celtics @jaytatum0 @Al_Horford Glad you got to the game!! Thank you",
    "383": "@celtics @jaytatum0 Simple recipe for success, stop shooting threes when the team can’t make open shoot.  Play some 80s basketball 🏀",
    "384": "Atleast I still have the Boston Celtics, I'm okay... https://t.co/LwswG4qRoU",
    "385": "@whosolti Boston Celtics jon mreterit",
    "386": "Boston Celtics Coach Brad Stevens is a Genius! by Chris Filios\nhttps://t.co/iUM9zPTJNV",
    "387": "@NBA @jaytatum0 @celtics awsome",
    "388": "@KamBrothers This loss to our hated rival Boston Celtics is the reward for that bad Westbrook trade. Jayson Tatum cooked perimeter defender Russell Westbrook and speedy Dennis Schroder attacking the Lakers perimeter defense constantly.",
    "389": "A real shame at the moment the team matches. I hope it gets better. @celtics gave us a bath https://t.co/JU31C9Zq6p",
    "390": "@lawrencehansbro @RapsSzn_ @NBA @celtics @Lakers No shit prime lebron was the most dominant player to ever play the game period what I told you was that it was their first season if it was prime lebron obviously they would have trouble but he’s not and in trouble",
    "391": "@pjc580221 @celtics One win without two of our top three players, quit being negative",
    "392": "Boston Celtics: Boston #Celtics spoil LeBron James' Los Angeles #Lakers return with dominant victory ... - Sky Sports https://t.co/AL6JzW5xy7",
    "393": "@RealBillRussell @tdgarden @celtics @Lakers @NBA @ESPNNBA @espn @BostonGlobe 💚🙏 to the ☘️⛹🏾‍♂️🐐",
    "394": "@AlexKennedyNBA @basketbllnews Boston Celtics",
    "395": "@StoolGreenie @celtics They won’t or at least Tatum won’t unless he’s playing the lakers or some other team with superstars",
    "396": "@RobWayTV @paulpierce34 @celtics @Lakers @7News Great photo video",
    "397": "Boston Celtics - Oklahoma City Thunder Predictions &amp; Odds\nhttps://t.co/K1TfSfyxfC\n\n#NBA #NBATwitter #bettingtips #bettingpicks #bettingtipster #bettingsports #sportsbets #basketball #bettingtwitter",
    "398": "@Lakers @KingJames Lebron James returned and the Lakers lost to a Boston Celtics team that didn’t have Jaylen Brown. 😭😭😭\nPut THT back on the 2nd Unit, he only got 6 shot attempts (2 points total). Smothered by the Big-3.",
    "399": "@GhostFromQuincy @BODonnellinGray @celtics He has an case. Agreed",
    "400": "@sobertowel @AsahiAko @NBA @celtics Nobody beat the suns last year they didn’t make playoffs or the play in. Nicks couldn’t play Suns THATS East team and a west team. Suns went 8-0 in bubble",
    "401": "@WaveLength23 @jaytatum0 @Fox_Ro10 @riceboy42069 @PackripEwing @celtics @girldadNFT @topshotfund Congratulations",
    "402": "@celtics @renee_edithxo97 @jaytatum0 Goat",
    "403": "Boston Celtics vencen a Lakers pese a regreso de LeBron James  https://t.co/DjibOK26LA",
    "404": "@StoolGreenie @celtics Well done, considering @FCHWPO and @rob_williamsIII out. But our second unit Is really poor. We have to develop open shot ppg. Good defensive team effort.",
    "405": "@Threalmattmoney @StoolGreenie @celtics He can if we bring him off the bench",
    "406": "@cedricmaxwell81 @celtics I with you Max…",
    "407": "🏀 Boston Celtics vs Los Angeles Lakers\n\n👑 King is back\n👎 Una squadra senza anima\n\n📊 I nostri consueti Plus &amp; Minus by @stuani89 \n\n#LakeShow #BleedGreen #NBA75\nhttps://t.co/tlFmlSQmD2",
    "408": "@RealBobManning @CelticsCLNS This is the Marcus Smart I envision playing point guard for the Boston Celtics.",
    "409": "@StoolGreenie @celtics I hope Dennis can continue this production when JB comes back",
    "410": "@statmuse @jaytatum0 @celtics @celtics_stats Crazy thing is, he still has 5 years before he turns 24.",
    "411": "KEEP DOING THIS @celtics https://t.co/pNalfIDrPJ",
    "412": "@moynihan @dexalexander @Lakers @celtics Hoping for a rematch in  June fellas.",
    "413": "@GaryWil51238525 @BetUS_Official @kateconstable @celtics Too true my man — I like your new coach tho. Guys a badass, I think he can build better chemistry. Already has it seems.",
    "414": "WATCH: Jayson Tatum, Boston Celtics torch LA Lakers in LeBron’s return https://t.co/g0NXmLHCpN",
    "415": "WATCH: Jayson Tatum, Boston Celtics torch LA Lakers in LeBron’s return https://t.co/qFCmbf6TlK",
    "416": "HOJE TEM BOSTON CELTICS!!!!!!!!\n\n🆚 OKC\n⏰ 21:30\n📺 League Pass\n📌 TD Garden\n\n#BleedGreen https://t.co/jP1NEppsas",
    "417": "@Luka_Donut @statmuse @jaytatum0 @celtics @celtics_stats If u can’t beat the Celtics without brown and Timelord than u simply aren’t good",
    "418": "@RealBillRussell @tdgarden @celtics @Lakers @NBA @ESPNNBA @espn @BostonGlobe Love the hat Bill, Celtics couldn’t lose with you and Pierce in the building last night!",
    "419": "@KertyKerBear @RealBillRussell @tdgarden @celtics @Lakers @NBA @ESPNNBA @espn @BostonGlobe 👀 that is incredible!",
    "420": "@NBA @celtics @Lakers @thisvideobot get this",
    "421": "@King_Willis_ @AsahiAko @NBA @celtics They were better. The Lakers got pushed to 6 with two starters out on Miami. Bucks beat the Suns too who eliminated the Lakers in the first round last year",
    "422": "@MikeGSKelly @celtics @ESPNNBA I got the exact same result last night (=Clippers - L). You're very strong on the game takes, Mike! 👍",
    "423": "@celtics you da man, glad your not like brown/langford/williams",
    "424": "@KertyKerBear @RealBillRussell @tdgarden @celtics @Lakers @NBA @ESPNNBA @espn @BostonGlobe That is so dope",
    "425": "@celtics @MAStateLottery none of the current vaccines end anything!",
    "426": "@dexalexander @ShaneHelm @Lakers @celtics So glad the @Celtics nearly beat the @Lakers by 30... 😉",
    "427": "@got_wilk @MLOCK_15 Beal will be coming to @celtics You’ll see",
    "428": "Lakers vs Celtics RETURN OF LEBRON https://t.co/AOJZDtgYeq via @YouTube \n @Lakers vs @celtics #Reaction #lakersvsceltics @Nba #NBAReaction #NBA #Lebron #BostonStrong",
    "429": "@betor_no @celtics Any fan base should be considered blessed to have Jason Tatum 😅",
    "430": "@celtics Smart &amp; Schroeder driving to the hoop all game like they were on the highway.",
    "431": "@RealBillRussell @tdgarden @celtics @Lakers @NBA @ESPNNBA @espn @BostonGlobe Good to see one of the greatest of all time in the house!",
    "432": "@celtics Take my body parts if anyone get hurt",
    "433": "@CelticsContessa @JadenHours_ @celtics @jaytatum0 Me too 😂 he’s like “ KB” then points like that to him",
    "434": "Deb took to Twitter to complain that Boston Celtics center Enes Kanter was only attacking NBA star LeBron James for his pitiful pandering to the Chinese Communist Party.\n\nDeb then expanded his complaint to conservatives writ large.\n\nhttps://t.co/7RwVV7Toxp",
    "435": "atleast Boston Celtics play today and we just beat Lakers yesterday. something to look forward to",
    "436": "@celtics have no chill 😭 https://t.co/CnB0PFRCgq",
    "437": "WATCH: Jayson Tatum, Boston Celtics torch LA Lakers in LeBron’s return https://t.co/P4Rf4KRxSO #GameScores #NBA #BostonCeltics",
    "438": "@FrogmansWorld @JadenHours_ @celtics @jaytatum0 Lol I love this! Lol",
    "439": "@celtics Im so happy Celtics beat the lakers yay",
    "440": "@ExtremeThunderF @WeAreOKC @celtics That’s awesome! I totally didn’t know. https://t.co/VxvR20nMlu",
    "441": "@WaveLength23 @jaytatum0 @Fox_Ro10 @riceboy42069 @PackripEwing @celtics @girldadNFT @topshotfund Welcome! https://t.co/WfsQTVNVyK",
    "442": "@NBCSCeltics @thekidet @Scalabrine @jaytatum0 Do it @celtics",
    "443": "LMAOOOOOOOOOOO @celtics https://t.co/7pLfvITnVV",
    "444": "@AnothrHipArtist @WeAreOKC Yes, against @celtics",
    "445": "I don’t think I will ever get over the fact that the @celtics drafted @KellyOlynyk over @Giannis_An34 in the 2013 NBA draft. #unreal",
    "446": "@frostybias @Celtics_PRam @celtics @EnesKanter @CelticsCanada @LJkalo23 Lmfao!!!",
    "447": "@6ixIn6 @warriors @Lakers @Bucks @LAClippers @sixers @dallasmavs @BrooklynNets @nuggets @celtics @utahjazz @Suns @nyknicks @MiamiHEAT @HoustonRockets @WashWizards @cavs @hornets @spurs @memgrizz @Timberwolves @SacramentoKings @Pacers @OrlandoMagic LMFAOOOOO",
    "448": "@Celtics_PRam @ChuckLeno1 @celtics @EnesKanter @CelticsCanada One of the funniest gifs on here I'm surprised @LJkalo23 doesn't use this one more",
    "449": "@NBA @jaytatum0 @celtics Fake news. Lakers must have won, becuse this was LeBron’s comeback game.",
    "450": "@NBA @jaytatum0 @celtics Can we really call beating the Lakers a big win RN? 🤷🏽‍♂️ Isn’t it kinda expected at this point? 🤦🏽‍♂️",
    "451": "@celtics Bleedgreen!",
    "452": "🏀Episode 9 is LIVE🏈\nA massive pre-Thanksgiving show this week covering:\n- @celtics shenanigans\n- Geary's Anatomy talking injuries\n- @patriots demolishing of @clevelandbrowns \n- Week 11 @NFL picks\n- Top 5: Worst Thanksgiving Dishes\n\nLinks in bio!",
    "453": "@celtics Bleed green!",
    "454": "11/19/21 Recap:\n\n🏀 NBA:\nBoston Celtics -2 (-110) ✅\nCharlotte Hornets -1 (-110) ✅\n\n🏈NCAAF: \nNevada ML (+105) ❌\n\n🏀 NCAAB:\nIona ML (-115) ✅\nLamar +2 (-110) ✅\nPacific ML (+125) ❌\nEast Carolina -2 (-110) ✅ \nSt. Bonaventure 2H -3 (-110) ✅\nUNCG +4 (-110) ✅\n\n#GamblingTwitter",
    "455": "@BODonnellinGray @celtics i think they meant austin reeves",
    "456": "@TMainesDOTcom @celtics Sent Lebum right on his way",
    "457": "@NBA @jaytatum0 @celtics Beautiful",
    "458": "@NanHayworth @NBA I present to you Enes Kanter. Center for the Boston Celtics.  He’s not scared. https://t.co/xWaz7QiH8s",
    "459": "I appreciate y’all not embarrassing me in front all the hoes last night @celtics let’s do it again tonight https://t.co/ng9CSnLmlx",
    "460": "@WaveLength23 @Nardelli_M @jaytatum0 @Fox_Ro10 @riceboy42069 @PackripEwing @celtics @girldadNFT @topshotfund Congrats my dude! Big purchase! 👊🚀🔥 https://t.co/HqHkQ6NB9i",
    "461": "@celtics Youth.",
    "462": "@FennisDembo87 So 15 minutes with the Lakers and you're ready to make this judgment ... But I need to wait till Christmas to see where the Boston Celtics are at?\n1. You're probably 100 percent spot on about Russ.\nB. We all know what the Celtics are, no need to wait for Santa to tell us.",
    "463": "Even with LeBron James back in their lineup, the Lakers were run off the court by the Boston Celtics, writes @BA_Turner: https://t.co/v85b2sztZu",
    "464": "@kojo_bead @celtics @NBA @KingJames He’s always come @ Bron for one thing or another. It’s a weird obsession bro",
    "465": "@GlobeBobRyan @PMBIII @Marc_DAmico @celtics I mean…it says Russell cous Havlicek bird up there. I’m now logging this as your THIRD iteration and noting that the debate is very much still alive.",
    "466": "This is awesome. RT @ClayTravis: Boston Celtics player Enes Kanter wore sneakers tonight — while playing against the Lakers — with LeBron James bowing down while China’s dictator puts a crown on his head. https://t.co/hl1deBf5Yz",
    "467": "37-PT, 11 REB double-double from @jaytatum0 lifts the @celtics to the big home win. https://t.co/WssQqQSLgh\n\n— NBA (@NBA) November 20, 2021",
    "468": "@celtics @MAStateLottery HOLY W",
    "469": "Today’s @MAStateLottery #HeroAmongUs, Angela Messmer-Blust, created a coloring book to help local children understand COVID-19 and the vaccines produced to end it. Titled \"Emma RNA Saves the Day\", the books have been distributed for free to thousands of public school students. https://t.co/Ylm2oHY8Ey",
    "470": "Here is how the Los Angeles Lakers graded individually in a bad loss to the Boston Celtics.  https://t.co/WU1DrCqgr0",
    "471": "@ClayTravis Enes Kanter. The same man that plays every week in a Boston Celtics jersey that is made by Nike, in China. \n\nThe hypocrisy https://t.co/4XyvMMMYFY",
    "472": "@ChrisSaysThis @celtics I am loving the changes that they made to how fouls are called this season. The game is a lot more fun to watch again.",
    "473": "@celtics are 4-0 when Smart has 0-1 turnovers and shoots 5 or less 3’s.\n\nThey are 2-2 when @smart_MS3 has 3+ turnovers.",
    "474": "@beerad @celtics @AllStarFreaks Super happy with it! Love the details",
    "475": "@RealBillRussell @tdgarden @celtics @Lakers @NBA @ESPNNBA @espn @BostonGlobe Bill Russel, what a man 🙏💜💛❤️",
    "476": "@chuckg716 @washingtonukfan @celtics Bro!!! The 3 biggest issues are 1.  Vogel 2. Westbrook and 3. Healthy I’ll add one more 4. Chemistry",
    "477": "@HOLLYWEIRDZ420 @celtics @AllStarFreaks Ty my guy 👆🏾",
    "478": "That your first NBA game ever is a Boston Celtics - Los Angeles Lakers is one thing. That the Celtics won in your first NBA game ever is something amazing! 🍀 🏀 https://t.co/MDNLmxNwzY",
    "479": "@Budznpunks @AllStarFreaks @celtics Literally 🔪",
    "480": "@DanSileoShow @celtics @Lakers I can’t believe this isn’t being talked about more   This is awesome  Punked lebron right on the court 😂",
    "481": "@espn @Espngreeny I Turned on To watch @celtics v @Lakers&amp; instead I get a MisInformed, taking head, spewing political lies because an innocent Man was found Innocent! PS Jacob Blake is not dead! When you’re attacked by a 5X convicted Pedophile, you have a right 2defend yourself https://t.co/5el5FSm1Kq",
    "482": "@NBA @jaytatum0 @celtics Love this 🔥🔥🏀",
    "483": "@sbonseyjtsports @RyJacksBack @celtics @Lakers Yes please!!! 😂",
    "484": "@NBA @jaytatum0 @celtics He got buckets on Melo, LeBron &amp; Westbrook here 💪🏾💪🏾",
    "485": "Jogos de Hoje:\nNew York Knicks vs Houston Rockets (22h)SPORT TV4\nIndiana Pacers vs New Pelicans (00h)\nW.Wizards vs Miami Heat (00h)\nAtlanta Hawks vs Charlotte Hornets (00h30)\nBoston Celtics vs Oklahoma Thunder (00h30)\nMilwaukee Bucks vs Orlando Magic (1h)SPORT TV4",
    "486": "@NBA @jaytatum0 @celtics Fakers finished",
    "487": "@RealBillRussell @tdgarden @celtics @Lakers @NBA @ESPNNBA @espn @BostonGlobe The Kobe hat. 🙏🏿",
    "488": "@NBA @jaytatum0 @celtics not washed",
    "489": "37-PT, 11 REB double-double from @jaytatum0 lifts the @celtics to the big home win. https://t.co/SzHYQNNAmm",
    "490": "Beautiful win last night @celtics 😍 #BeatLA ☘️",
    "491": "@Inkotanyi_C @celtics Ahaaa, Lakers keeps giving me a hard time again and again😪",
    "492": "@PhilBRK @PMBIII @Marc_DAmico @celtics That wasn’t a listing. The chronological order is Cousy, Russell, Havlicek, Bird. The merit listing is Russell, Bird, Havlicek, Cousy",
    "493": "@KertyKerBear @RealBillRussell @tdgarden @celtics @Lakers @NBA @ESPNNBA @espn @BostonGlobe This is awesome!!",
    "494": "LeBron James' return is spoiled by the Boston Celtics as the Los Angeles Lakers continue to struggle mightily https://t.co/75wRLG8P7x",
    "495": "@celtics The boys are back! Go C's!!!! #celticswin",
    "496": "Reason y I’m a die hard @celtics fan, we go above n beyond for our players🤷🏾‍♂️😂👌🏾💯‼️ https://t.co/e8T0KCzClw",
    "497": "How does the song go? Oh yeah. \n\n🎶Everybody in the world Fuckin’ hates the Lakers🎶\n\n@celtics https://t.co/rxv4nTmzUe",
    "498": "@HoopsEmpire_ @statmuse @jaytatum0 @celtics @celtics_stats Paul was a gritty hooper from the start and went hard every night. He didn’t need to wait for the playoffs. Tatum has to get that dog eat dog attitude if he ever wants to be a champ. He’s been in the league for 5 years it’s time",
    "499": "@celtics Dennis schroder a hoe for that, give that man his academy award",
    "500": "Which one of y’all got rid of Javonte Green? @celtics ??   Y’all always got players wasting away on the bench. This is the NBA, these guys didn’t make it for no reason",
    "501": "@celtics beat the @Lakers ?? ✊✊✊✊☘️☘️☘️🇮🇪🇮🇪🇮🇪",
    "502": "@RealBillRussell @tdgarden @celtics @Lakers @NBA @ESPNNBA @espn @BostonGlobe Shout out to @TheSportsMuseum",
    "503": "@ChrisRFarley1 @BetUS_Official @kateconstable My @celtics are fake also. Danny Ainge had 14 #01 draft picks with Tatum &amp; Brown in house two yrs ago and still couldn't figure it out.",
    "504": "@cedricmaxwell81 @aimonas1 @celtics Thank you for your kind words. 🙏❤\nHe loved yall so much, Mr Maxwell. His passion was basketball strategy...and yall had that same passion and fire! It was such an honor to watch you play, Sir. 🙏💚🍀 #CelticsforLife",
    "505": "@celtics restructure contracts and pay to keep Dennis Schröder somehow…. He is the missing piece to this championship team!!!  #BostonCeltics",
    "506": "@2Xtremebounce I use to be looking at you on the @Celtics bench like give the second coming of Tony Allen some run .. glad you’re getting a chance to show your game",
    "507": "@Colossus_cu @NBALatam @celtics @Lakers Lakers",
    "508": "Final scores - November 20: \n\n• @celtics def. @Lakers 130-108 \n\n#NBA \n#NBA75  \n@hooptalk918 https://t.co/wfTvcD4q8Z",
    "509": "Fantastic victory by @celtics over @Lakers last night @tdgarden! #mylocalma #BleedGreen https://t.co/iRIbHUZwAo https://t.co/f4N8luPGsj",
    "510": "@celtics We still own them",
    "511": "@985TheSportsHub @celtics @tdgarden @1057WROR LFG 🍀🍀🍀💯let’s get this back to back win!!",
    "512": "The Boston Celtics hosted the Los Angeles Lakers on Friday night, and the latest chapter of the historic rivalry didn't disappoint. https://t.co/TfeevNgd7c",
    "513": "Oklahoma City Thunder vs. Boston Celtics Preview, Prediction, and Picks https://t.co/VIFcOMzLaY",
    "514": "Lakers' LeBron James Won't 'Give His Energy' to Enes Kanter After Center's Criticism #sports\n\nBoston Celtics center Enes Kanter has publicly criticized Los Angeles Lakers forward LeBron James and Nike co-founder Phil Knight in recent weeks to raise\n\nhttps://t.co/3UhI1AKp9c",
    "515": "@zackgreenwx @celtics @KingJames I lived in Chicago for the Michael Jordan years. Watching exceptional athletes is fun. 👍",
    "516": "Los Angeles Lakers star LeBron James discussed how he feels physically following the loss to the Boston Celtics.  https://t.co/sP6VEB1axc",
    "517": "@WaveLength23 @jaytatum0 @Fox_Ro10 @riceboy42069 @PackripEwing @celtics @girldadNFT @topshotfund Wow congrats! How’d you work up to it? Up trading?",
    "518": "@celtics with that light work last night 👊🏻🏀👍🏻",
    "519": "@celtics P-Dub with the triple from way downtown",
    "520": "Remember when the C's beat @KingJames and @AntDavis23 by so much we got Gino? @celtics #bleedgreen #celtics #BeatLA https://t.co/cP0r4rrxki",
    "521": "@cedricmaxwell81 @Becoming_Bryna @celtics That’s what my father loved about him, he never lost his composure! When I ended up coaching in the church league, my father was like don’t yell at the kids or the refs, be like KC!",
    "522": "@TOWIArsenal @celtics THE best* 😇",
    "523": "@NBA @celtics Sorry this team is nice not great. Will never win anything",
    "524": "November 20, 2013\n#BonJovi\n\"Livin' On A Prayer\" by Bon Jovi returns to the Hot 100 at #25 thanks to a viral video of a Boston Celtics fan dancing to the song. Billboard tweaked their methodology earlier in the year so streaming views of songs were factored into the chart tally. https://t.co/1dnDRT3Jx5",
    "525": "@Becoming_Bryna @aimonas1 @celtics …KC was my head coach from 83-85 and a tremendous man. Good friend. Quiet genius.",
    "526": "@WaveLength23 @jaytatum0 @Fox_Ro10 @riceboy42069 @PackripEwing @celtics @girldadNFT @topshotfund Congrats. Tatum one of my favorites too - his moments are generally undervalued and fall in the \"Kawhi Leonard  Memorial No TS Holders Love Me\" category.",
    "527": "@al_osei @celtics @NBA @KingJames Dude just wants some attention",
    "528": "@MannyChokuba @washingtonukfan @celtics Bro what’s going on with us?",
    "529": "@aimonas1 @frostybias @celtics @cedricmaxwell81 Thank you so much!!!!",
    "530": "@Becoming_Bryna @frostybias @celtics @cedricmaxwell81 Safe travels!",
    "531": "@RealBillRussell @Murf56 @tdgarden @celtics @Lakers @NBA @ESPNNBA @espn @BostonGlobe Bill--when I was a kid, you walked by me in the Garden wearing a beige raincoat. I went up to your waist. Never forget.",
    "532": "@King0fSorrow75 @RealBillRussell @tdgarden @celtics @Lakers @NBA @ESPNNBA @espn @BostonGlobe I want.",
    "533": "@celtics @jaytatum0 Great Laker tryout",
    "534": "@celtics took them Lakers down through there didn’t ya? 😂💯☘️",
    "535": "@washingtonukfan @celtics Good morning bro. Lol we suck 😂😂😂",
    "536": "@aimonas1 @frostybias @celtics @cedricmaxwell81 Ooh my sis picked me up from my apartment and took me to her house....she lives with my mom and other sister.\n\nWe are headed to the airport later this morning. :)\n\nAfter we get some Starbucks LOL https://t.co/h1DAi1VIs1",
    "537": "@celtics @paulpierce34 @RealBillRussell I hope he stays in the moment. Make em hate playing against you.",
    "538": "Oklahoma City Thunder vs. Boston Celtics Preview, Prediction, and Picks https://t.co/biXIm856XI",
    "539": "@NBALatam @celtics Con LeBron en cancha",
    "540": "@sobertowel @AsahiAko @NBA @celtics 😂😂😂 the bucks would’ve beat the lakers? You playing right? Who did the bucks got put out by in 2020?",
    "541": "As good as it was to watch the @celtics beat up on the @Lakers I think it say a lot more about the LA Fakers than us. #NBA",
    "542": "Last night was fun. Smacking LA never gets old. \n\nThe Lakers aren’t very good but we all saw what can happen if the @celtics attack the rim. \n\nThey need to get Jaylen and Rob back. https://t.co/wDIT3kYjke",
    "543": "@ESPNPR @tdgarden @ESPNNBA @stephenasmith @RealMikeWilbon @JalenRose @Espngreeny @wojespn @Lakers @celtics @dallasmavs @Suns @espnpr when will you release at statement about @JalenRose’s lie that was broadcast on @espn?",
    "544": "Boston Celtics player Enes Kanter wore sneakers tonight — while playing against the Lakers — with LeBron James bowing down while China’s dictator puts a crown on his head.",
    "545": "Bill Russell Wiki - Bill Russell Biography\n\nBill Russell is one of the previous expert ball player in the United States who played community for the Boston Celtics which is from the National Basketball Association (NBA) from 1956 and 1969.  #billrussell\n\nhttps://t.co/6hOgmlr1Gg https://t.co/GCqtssKhQK",
    "546": "Oklahoma City Thunder vs. Boston Celtics Preview, Prediction, and Picks | SportsNus https://t.co/iMKUAQFAX8",
    "547": "Boston Celtics: LeBron James After Losing To The Boston #Celtics 130-108: \"There's No Level Of Panic ... https://t.co/H60yugktiF",
    "548": "NBA: LeBron James' comeback spoiled as Boston Celtics beat Los Angeles Lakers https://t.co/UknHHpxeUP",
    "549": "@JaylensWr7d @NBA @celtics Thats why they haven’t won anything in 13 years right?😬",
    "550": "Last night was fun. Thank you, @celtics! Traveling from Dallas for a game is risky, but when the team plays like THAT it’s all worth it.\n\n3 more games on this vacation!\n#celtics @jaytatum0 @Al_Horford @smart_MS3",
    "551": "@PMBIII @Marc_DAmico @GlobeBobRyan @celtics What’s bumped Bird from 2 to 4 in the last week? https://t.co/MgbQntVL8z",
    "552": "@WaveLength23 @jaytatum0 @Fox_Ro10 @riceboy42069 @PackripEwing @celtics @girldadNFT @topshotfund Excellent purchase!",
    "553": "@_Mrc_09 Hao ndio Boston celtics😀",
    "554": "@King_Willis_ @AsahiAko @NBA @celtics Yes they had a cakewalk. They are the worse champions in recent history. The past champions are way better and would’ve beaten them. Nuggets overachieved. No one had them going far. Clippers choke as usual no surprise. Rockets sucked idc about no offense BS. That’s a season stat",
    "555": "@celtics Yes, we can.  Lets see what you do in Saturday.",
    "556": "@baronskii @statmuse @jaytatum0 @celtics @celtics_stats When pierce was drafted they we’re below .500 for 6/9 years until they formed the big 3.",
    "557": "NBA Day 3️⃣3️⃣ 🏀🏀🏀\nHouston Rockets vs New York Knicks\nNew Orleans Pelicans vs Indiana Pacers\nMiami Heat vs Washington Wizards\nCharlotte Hornets vs Atlanta Hawks\nOklahoma City Thunder vs Boston Celtics\nOrlando Magic vs Milwaukee Bucks\nMemories Grizzlies vs Minnesota Twolves",
    "558": "@JessicaOnAirDj @celtics Tatum is gonna bring it&amp; def wear yr Lucky CELTs shirt with yr Cheetos-hope c u!",
    "559": "@NBA @celtics LeBron &amp; the Lakers are SLOW old men..",
    "560": "@MissinKobe @celtics That shit hittin",
    "561": "@celtics Food time 😂😂😂",
    "562": "Dennis Schroeder MVP of the @celtics through 16 games",
    "563": "@Becoming_Bryna @frostybias @celtics @cedricmaxwell81 Did you make to the ATL?",
    "564": "@WaveLength23 @Nardelli_M @jaytatum0 @Fox_Ro10 @riceboy42069 @PackripEwing @celtics @girldadNFT @topshotfund Always a good feeling!",
    "565": "@RealBillRussell @tdgarden @celtics @Lakers @NBA @ESPNNBA @espn @BostonGlobe GOAT",
    "566": "@celtics @Gatorade Isn’t JT the guy that @GregHillWEEI wants the @celtics to trade to help the team? And keep that waste of a draft pick @smart_MS3  who keeps missing 3’s!!",
    "567": "@NBALatam @celtics Beat L.A. #BleedGreen ☘👊🏽",
    "568": "@sobertowel @AsahiAko @NBA @celtics So u saying lakers just had a cake walk? Let’s not forget ad was hurt for a few games in the playoffs and bron had to carry. Nuggets beat the clippers coming back from 3-1 . Clippers blew a 14 point lead in 4th. Rockets had the number one offense",
    "569": "TONIGHT: @Celtics vs #Thunder live from @TDGarden on @1057wror https://t.co/QRxMOtm6s6",
    "570": "LeBron James was back in action for the Los Angeles Lakers on Friday night against the Boston Celtics after missing eight game because of an abdominal strain. https://t.co/3StNa3kY7q",
    "571": "Hey Boston Celtics fanatics, We beat the LA Lakers!",
    "572": "Jayson Tatum, Celtics attempt to silence Thunder: An emotional victory over their rivals has the Boston Celtics riding high into a home matchup with the Oklahoma City Thunder on Saturday night. Jayson Tatum's 37 points and 11 rebounds carried the Celtics… https://t.co/0qFGd1RzlZ",
    "573": "I believe the way @dennismike93 is performing on the @celtics is proof that his bad season on the @Lakers was more due to them being a dysfunctional organization than him being washed.\n\n@CardPurchaser\n#TradingCards\n#Sportscards\n#TheHobby",
    "574": "@WaveLength23 @jaytatum0 @Fox_Ro10 @riceboy42069 @PackripEwing @celtics @girldadNFT @topshotfund Congratulations@🎉",
    "575": "@NBA @celtics Foul on Lebron",
    "576": "@PeteOfTheMoment @EnesKanter @KingJames @Nike Wait a minute! @EnesKanter wears the @celtics uniform with the Nike logo, plays in the @NBA sponsored by Nike and goes at @KingJames for being a Nike Athlete?\nThere are teams/leagues all over the world with no Nike involvement BUT let me guess - the checks are bigger in the @NBA",
    "577": "\"He has fingerprints all over every game. He does so many things for the group.\" - @celtics HC Ime Udoka on @Al_Horford. #ImeUdoka #AlHorford #bostonceltics #celtics #bostonsports #basketball #NBA #NBA75 #BleedGreen #goceltics #bostonathletemagazine",
    "578": "@celtics Tatum finally looked happy and played with positive energy last night. Need this from him every night.",
    "579": "Boston Celtics Score - Final: @celtics 130, Lakers 108. #bostonceltics #celtics #bostonathletes #boston #basketball #NBA #NBA75 #bostonsports #BleedGreen #goceltics #bostonathletemagazine https://t.co/wSKwposKXJ",
    "580": "Boston Celtics vs Los Angeles Lakers was on NBC Sports Boston. With commentary from Mike Gorman. Co-commentator is Brian Scalabrine. Reporter is Abby Chin.  For more details see https://t.co/xIrQNn0ryo #BostonCeltics #LosAngelesLakers #NBCSportsBoston",
    "581": "@PeteAndreu @celtics Funnily enough, I ran into Claus last night who also remembered that day.. lol",
    "582": "@NathielIsaac @deuce_fan_page @celtics Everybody knows the actual photo lol",
    "583": "@BenCaspit @RTEerdogand @trpresidency @EnesKanter @celtics Maneuvers... of course",
    "584": "2019-20 Panini NOIR Grant Williams Rookie Patch Auto RPA /99 Boston Celtics RC  - https://t.co/OAnubM1XQk #sportscards #ebay #nbacards https://t.co/QZJTrcTWwV",
    "585": "@BenCaspit It's nice, political manures diplomatic efforts with one of the worst mass murderers in the world \n@RTEerdogand @trpresidency \nAsk the brave citizen @EnesKanter who plays now for the Boston Celtics @celtics.",
    "586": "Boston Celtics News - @celtics take the lead 93-82 over the Lakers at the end of the 3rd Quarter. #bostonceltics #celtics #bostonathletes #boston #basketball #bostonsports #BleedGreen #goceltics #bostonathletemagazine https://t.co/LtH0kfz9yg",
    "587": "Boston Celtics https://t.co/ZEfKPrPQ7M #hiphopnews #hiphop #breakingnews #barsisback #battlerap #battleraptawk #urltv #15mofe #hiphopisreal",
    "588": "Hella Hall of Famers in the building last night! Thank you to the Boston Celtics for these amazing seats, I had a blast! So kind, I'm very grateful.  \n\n#Celtics #Lakers #lebron #tdgarden @ TD Garden https://t.co/xaVMBey4lC",
    "589": "@celtics Watched the edited 9:28 minute highlights. Good good win! Jason Tatum is amazing.",
    "590": "@celtics @paulpierce34 @RealBillRussell That’s Celtics Pride young man!",
    "591": "Wait a minute! #eneskanter wears the @celtics uniform with the Nike logo, plays in the @NBA sponsored by Nike and goes at @KingJames for being a Nike Athlete?\nThere are teams/leagues all over the world with no Nike involvement BUT let me guess - the checks are bigger in the @NBA",
    "592": "@FrogmansWorld @BCCoachStevens @celtics He already is a partner for the fenway group, would the fans have him?",
    "593": "@celtics Lebron, Davis, Howard, Anthony, Rondo, Bradley, Westbrook\nAnd they're below 500?.... PATHETIC\nLebron is nothing",
    "594": "@TheDragonFeeder @VOANews @celtics @EnesKanter @VOAChinese …and the Celtics trounced the Lakers (130 to 108).\n#WhereIsPengShuai",
    "595": "Surprising ending to the @celtics vs @Lakers game last night. 😃🏀 https://t.co/6N8sEHghJF",
    "596": "@King_Willis_ @AsahiAko @NBA @celtics Blazers never go anywhere and always lose in the playoffs. They are horrible now and they peaked when they played GS. Same goes for Rockets. Westbrook made them worse and the 2018 team was the best Rockets. Nuggets overachieved and had no expectations. Heat were hobbled underdogs",
    "597": "@celtics Guys, it’s one win",
    "598": "Watching the highlights now before all the football starts. #BostonCeltics 💪 https://t.co/cTVGaZjoZJ",
    "599": "@WaveLength23 @jaytatum0 @Fox_Ro10 @riceboy42069 @PackripEwing @celtics @girldadNFT @topshotfund Congrats! That’s my top moment too and I’m automatically invested in Tatums career as a result",
    "600": "@celtics Hell Yeah!..",
    "601": "@sobertowel @AsahiAko @NBA @celtics How was it against scrubs ur not making sense. Houston had the best offense and we had the best defense. We beat Trail Blazers who was only 8th seed bc off injuries earlier that year. They was easily top 5.. then nuggets came back 3-1 twice and Jamal scored 2 50 point games",
    "602": "@celtics C’mon, Rondo’s not a HoFer.",
    "603": "@EnesKanter passed @Lakers superstar @KingJames without exchanging a word during pregame warmups on Friday night, but the @celtics center's sneakers said more than enough.\n\nPlay Yahoo Fantasy Basketball with your friends! 🏀 https://t.co/vT9GnysRst\n\nhttps://t.co/iS7xkM9YaB",
    "604": "@Negriet @celtics Big W",
    "605": "My girl is bringing me to the @celtics game tonight",
    "606": "LOS ANGELES LAKERS 108-130\nBOSTON CELTICS, Final.\n#BleedGreen",
    "607": "#NBA Pick One Challenge RECAP for 11/19/2021 including @jaytatum0 starring in the @celtics massive win over the Lakers https://t.co/7ovzFLDxtS",
    "608": "How am I not in Boston this weekend? @celtics vs the Lakers on Friday night and @FSUFootball vs BC on Saturday.\n🤦‍♂️☘️🍢@t_w_dag",
    "609": "Boston Celtics: LeBron James Scores 23 in Return from Injury as #Lakers Lose to #Celtics 130-108 - Bleacher Report https://t.co/PQFWy3WMEG",
    "610": "@chadzumock @JalenRose @stephenasmith @Lakers @celtics @JalenRose may want to get his facts straight. Jacob Blake is alive. Oh, I remember. Michigan athletes didn’t have to go to class in the 80’s. Someone else took their exams for them.",
    "611": "Boston Celtics play basketball tonight",
    "612": "I hope Boston Celtics doesn't support Enes Kanter's opinion on Muslims in Xinjiang and people in Hongkong. Houston Rockets and Philadelphia 76ers are being prohibited in China due to their current or former GM.\nI love Boston Celtics' team culture.Please.",
    "613": "@statmuse @jaytatum0 @celtics @celtics_stats For the love of god please don’t compare one of the greatest Celtics who knew how to lead and win games, to Tatum. Hopefully Tatum finds that leadership and desire to be a champ, not just hear about his good he is from everyone else",
    "614": "LeBron James scored 23 points in his return from an eight-game injury absence but the Boston Celtics spoiled the Lakers’ welcome-back party. https://t.co/bnvSoDee8i",
    "615": "One very proud @Celtics fan today! 💚☘️🏀🌟 https://t.co/pE9KbHBkwM",
    "616": "more Hickness from Your Honor, Mayor of French Lickness\n\ncc: The Honesty of Lawrence @HonestLarry1 @celtics lejjjjiii\n\nhttps://t.co/RRotumLUQT https://t.co/fObpJMD601",
    "617": "Boston Celtics guard Marcus Smart (L) drives to the basket past defending Los Angeles Lakers forward Anthony Davis (R) in Boston, Massachusetts, USA\n📷 epa / CJ Gunther\n\n#epaphotos #visualizingtheworld #basketball #nba #celtics #lakers https://t.co/XQ8dMOisyb",
    "618": "@celtics just win another game.going into winning strike.",
    "619": "@celtics just fucos on winning.",
    "620": "Just a reminder @Lakers fans \n@celtics remain supreme. https://t.co/0mqarbQCb5",
    "621": "@celtics @paulpierce34 @RealBillRussell we need to win.",
    "622": "@celtics just win in every quarter its a win",
    "623": "11/19 recap 🔥    (3-1)\n\n✅LaMelo Ball O6.5 rebs (-119)\n✅Chicago Bulls ML (-105)\n❌Detroit Pistons +2 (-110)\n✅Boston Celtics ML (-130)\n\n#GamblingTwitter #FreePicks https://t.co/YimoFHajq4",
    "624": "@celtics @jaytatum0 winning quarters:2nd quarter 30-23,3rd quarter 33-21,and 4th quarter 37-26.its a win win win.",
    "625": "@celtics @CAFC0104 Hold this L",
    "626": "Nobody in the #BostonCeltics organization concluded that these shorts look filthy on tv? #celticslakers",
    "627": "BON JOVI TRIBUTE​\n\n(Today in 2013) Livin' On A Prayer\" by Bon Jovi returns to the Hot 100 at #25 thanks to a viral video of a Boston Celtics fan dancing to the song.​\n​\n#bonjovi #best60smusic #best70smusic #best80smusic https://t.co/TQw5KARncv",
    "628": "@tdgarden @NHLBruins @celtics home team is supposed to be on the right this burns my eyes",
    "629": "@celtics @jaytatum0 Let's not lose to the Thunders",
    "630": "Excuse me while I just put this on loop all weekend @celtics #BleedGreen #beatLA https://t.co/AKiwR7KLVI",
    "631": "Boston Celtics: #Celtics center Enes Kanter rips 'sad &amp; disgusting' LeBron James for being Nike's spokesman ... https://t.co/GtwYTUBGhG",
    "632": "BOSTON CELTICS",
    "633": "NBA: LeBron James' comeback spoiled as Boston Celtics beat Los Angeles Lakers https://t.co/lIg3nLeMxk https://t.co/IsOoeh1dGX",
    "634": "Well done @celtics 👏🏾👏🏾👏🏾. Smoked the Lakers https://t.co/yXs2J23gS7",
    "635": "even tho dis was a great dub, it’s in the past now. let’s keep it pushin @celtics",
    "636": "Devastating Win For The @Celtics 😁☘🏀 #BleedGreen #BeatLA https://t.co/BTZXRxNZgP",
    "637": "NBA: LeBron James makes LA Lakers injury return in defeat at Boston Celtics – ZellaNews https://t.co/ygjW9AxuSj",
    "638": "@Not_Rogeer @celtics Not a sport 🤡",
    "639": "@Phishmonga @Bopyataco @celtics @Dunkthatball Dude is a Lakers/Patriots fan. not worth responding to",
    "640": "@SportsCenter is all like “LeBron’s return”… \n\nYa that’s fuckin right. He ain’t gonna have a “return” against the @celtics in @tdgarden \n#BEATLA Fuck the Lakers",
    "641": "Dennis Schröder is 1-1 on his revenge tour after a strong performance against his last team the @Lakers. The #DennisSchröderHistoryWeek will be continued today when the @celtics host the @okcthunder.\n@drevoigt @KeithSmithNBA #ds17 #dennisschroder #dennisschröder https://t.co/AjifObnXg5",
    "642": "WATCH: What are some takeaways for the Boston Celtics season so far? https://t.co/ATTXcG7Ce6",
    "643": "@deadboyrare @celtics Give me number 7 all day.",
    "644": "The Boston Celtics player, @EnesKanter, posted on his Twitter account four images of sneakers that allude to the silence of @KingJames in the face of the atrocities perpetrated by the Chinese communist regime. https://t.co/qZlPB57uSN by @rondon_EA26",
    "645": "@Bopyataco @celtics @Dunkthatball What is your point? A few Eastern Conference Finals though.",
    "646": "@celtics Jesus!!! When did the Lakers, I mean Bron-Bron stack that much frigging talent?!?! Nice W, without number 7 as well. 👊☘️",
    "647": "Boston Celtics down Los Angeles Lakers to spoil LeBron James' return, Golden State Warriors beat Detroit Pistons https://t.co/Gurt6d44M4",
    "648": "@celtics @jaytatum0 The best☘️",
    "649": "@MarcosS92430577 @NBA @celtics That look says Hes going to trade himself to the Celtics for a 2nd round pick",
    "650": "Let\"s go @celtics !! https://t.co/4Njbx1m0CR",
    "651": "@celtics I'm really blew",
    "652": "One of the worst Boston Celtics side routed the galactico LA Lakers in an NBA match early this morning",
    "653": "ℹ Full Time: Boston Celtics 130-108 Los Angeles Lakers ✅",
    "654": "🔴#NBBBrasil🏀🇧🇷\n⬇️#UniaoCORINTHIANS 76 (1-7)\n⬆️#BasqueteCEARENCE 77 (2-3)🔸\n🔴Nehemias MORILLO🇩🇴\n(SG/6'5\"/185Lbs)\n🔹13/Pts\n🔹5/Reb\n🔹3/Ast\n🔹2/Stl\n🔹0/Blk\n🔹3/TO\n🔹2/7T2\n🔹3/5T3\n🔹0/1TL\n🔹32:24/min:seg\n@Ney_M21\n@Celtics\n#RDBSeleccion\n#RDenSurAmérica",
    "655": "@Dunkthatball @celtics Cool Celtics still suck",
    "656": "TÈMINE !!! \n\n Lakers 108 Celtics 130\n\nBoston Celtics (8-8) MASPINEN LOS ANGELES LAKERS (8-9) 130-108.\n\nJ. Tatum: 37 PTS | 11 REB | 2 AST | 3 Stl\nM. Smart: 22 PTS | 8 REB | 6 AST \nD. Schroder: 21 PTS | 6 REB | 6 AST \nA. Horford: 18 PTS | 4 REB | 4 AST",
    "657": "@NBA @jaytatum0 @celtics Great job!",
    "658": "Boston Celtics down Los Angeles Lakers to spoil LeBron James' return, Golden State Warriors beat Detroit Pistons https://t.co/kV7QsmB2xU",
    "659": "🔴#NBA🏀🇺🇲\n⬇️#LALakers 108 (8-9)\n⬆️#BostonCELTICS 130 (8-8)🔸\n🔴Al HORFORD🇩🇴\n(C/6'9\"/240Lbs)\n🔹18/Pts\n🔹4/Reb\n🔹4/Ast\n🔹1/Stl\n🔹1/Blk\n🔹1/TO\n🔹4/6T2\n🔹1/3T3\n🔹7/10TL\n🔹32:00/min:seg\n@Al_Horford\n@Celtics\n#RDBSeleccion\n#RDenNBA\n#DominicanosEnNBA",
    "660": "🏀NBA🏀 #NBA \n🏀Saison régulière🏀\n\nCharlotte Hornets - Indiana Pacers\nDetroit Pistons - Golden State Warriors\nBoston Celtics - Los Angeles Lakers\nBrooklyn Nets - Orlando Magic \nPelicansNew - Los Angeles Clippers\nMilwaukee Bucks- Oklahoma City Thunder",
    "661": "LeBron vs Boston Celtics https://t.co/O8MAvxjohr",
    "662": "@celtics @Dunkthatball The Celtics haven’t been to the finals in years",
    "663": "Y'all paying Russ $44 million lol https://t.co/lzhxHTWCES via @YouTube \n\nshout out to the @celtics",
    "664": "@celtics blowout the @Lakers ....what else is NEW...happens every year...\n\nAll-time series\nCeltics, 206–163 (.558)\n\nRegular season series\nCeltics, 163–132 (.553)\n\nPostseason results\nCeltics, 43–31 (.581)\n\nLongest win streak\n85 Celtics, 18 (1957–59) Lakers, 5 (1968–6",
    "665": "Oklahoma City Thunder (6-9, 10th in the Western Conference) vs. Boston Celtics (8-8, ninth in the Eastern Conference) https://t.co/JNHp3tQ80s",
    "666": "@BarryMurphyPT @celtics I know it’s not even a quarter of the season done yet (just) but they don’t look like a playoff team never mind a potential championship team. If Lebron can’t stay healthy the rest of the season they they’re cooked and Westbrick will take all the blame for GM Lebron 😂",
    "667": "@BarryMurphyPT @celtics They started brilliantly and then get blown out in the third quarter. The play little to now defence 😂 I was shocked at the half time score 😆 then in the second half they fall off a cliff…..almost like they’re a team of old players..huh 😜",
    "668": "@CSmoove_Sports Are you saying Lebron James wasn’t giving enough effort  last night against the Boston Celtics to be the leader we have always known Lebron to be ? https://t.co/uMebVRun76",
    "669": "Boston Celtics player Enes Kanter wore sneakers tonight — while playing against the Lakers — with LeBron James bowing down while China’s dictator puts a crown on his head. https://t.co/8Tf0ilZdgU https://t.co/lN4Vua5KzK",
    "670": "@statmuse @celtics @celtics_stats Said this about him....https://t.co/RG66nYpD2P",
    "671": "@nbamemesinsta We lost against the Boston Celtics last night, WITH LEBRON JAMES PLAYING.",
    "672": "The 37-PT, 11 REB double-double from @jaytatum0 lifts the @celtics to the big home win. https://t.co/SqPgfCEbru #NBA",
    "673": "@WaveLength23 @jaytatum0 @riceboy42069 @PackripEwing @celtics @girldadNFT @topshotfund 👏🏻👏🏻👏🏻 Such a great moment! Tatum became a true star in the bubble! Love it! Congrats!",
    "674": "Jayson Tatum, Celtics attempt to silence Thunder  #NBA\n #celtics #BostonCeltics #okcthunder #ThunderUp https://t.co/iz9GggQiZY",
    "675": "@celtics Morning @MannyChokuba 👀👀🤣🤣🤣",
    "676": "@celtics Celtics PRIDE, that's the tweet 🍀🍀🍀🍀🍀 https://t.co/ulB2xr9cxd",
    "677": "NBA'de gecenin sonuçları 👇\n\nPhoenix Suns 112 - 104 Dallas Mavericks\nChris Paul 18 🏀, 14 🎯\nKristaps Porzingis 23 🏀, 12 💪\n\nBoston Celtics 130-108 Los Angeles Lakers,\nJayson Tatum 37 🏀, 11 💪\nMarcus Smart 22 🏀, 8 💪\nAnthony Davis 31 🏀, 6 💪\nLeBron James 23 🏀, 6 💪 https://t.co/K8jIsrYX2T",
    "678": "Boston Celtics need the pieces to fall in place. Jayson and Jaylen Need to lean how to play and trust with their teammates",
    "679": "@NBA @celtics Good game and win 👍 👏",
    "680": "@WaveLength23 @jaytatum0 @Fox_Ro10 @riceboy42069 @PackripEwing @celtics @girldadNFT @topshotfund I have a Tatum S1 moment but it’s not as nice as yours.",
    "681": "@jaytatum0 Jayson Tatum - 37 Pts (14 in Q4), 11 Reb, 2 Ast, 3 Stl, 1 Blk Highlights｜Boston Celtics vs Los Angeles Lakers | 2021.11.19\nhttps://t.co/zUhP6yewhl\n\n#JaysonTatum #NBA​ #Boston​ #Celtics​ #Basketball #LosAngeles #Lakers",
    "682": "@NBA @celtics Suck it Lebron.",
    "683": "That Smart and Schroeder combo was beautiful last night. Also Al Horford remains my fav this season, this is what @celtics lacked last year #BleedGreen #LakeShow #NBATwitter #NBA75",
    "684": "Sat, 20th Nov: #BostonCeltics vs #LosAngelesLakers - ODD @ 1.99\nMore details on: https://t.co/oQPyGhorct\n#baskettips #basketprediction #basketballbets #nba #usabasket",
    "685": "@celtics Be consistent, or be the same joke again.",
    "686": "🎞🍿 Was ging bei @celtics vs @Lakers? \n\n#BleedGreen\n#LakeShow \n#NBA75 https://t.co/gtSz4IcGeE",
    "687": "The 37-PT, 11 REB double-double from @jaytatum0 lifts the @celtics to the big home win. https://t.co/UpC69Jk4dw",
    "688": "@MurphybeGood @celtics The Celtics aren’t which is very alarming for fakers",
    "689": "@Osaz4l Boston Celtics😔",
    "690": "@LaVineGotNext @celtics get ur ass out here",
    "691": "Boston Celtics blast La Lakers this morning",
    "692": "@statmuse @jaytatum0 @celtics @celtics_stats @teeny_6_mao_ who sucks? 😂😂",
    "693": "@dre_babyyy4 did you enjoy the @celtics and @Lakers game last night? As for me, I enjoyed every minute of it 😂😂😂 https://t.co/2SySfnHFeF",
    "694": "@celtics smokin that Laker pack https://t.co/Fbh8Gn2gbf",
    "695": "Los Angeles Lakers at Boston Celtics  Game #16   11/19/21 https://t.co/NkCXexMqhs",
    "696": "Boston Celtics Daily Links  11/19/21 https://t.co/PAbm8Sv6rZ",
    "697": "@JustinAgyemang @NBAHistory @NBA @Lakers @celtics Wilt is and always be Bill's b*tch. https://t.co/EERH11NugT",
    "698": "@SethPartnow @celtics And yeah I guess they were decent and better than this Lakers team…but I just recall them imploding",
    "699": "@AleksandreCecx1 @NBAHistory @Lakers @celtics Bird didn't have to hook up with an already made championship team to win his titles.",
    "700": "@SethPartnow This Lakers team reminds me of the one when they added Gary Payton and Karl Malone to Shaq and Kobe and they sucked. And as a @celtics fan…I love it",
    "701": "@pgmoney_ @NBA @celtics There average age is like 57 lmao",
    "702": "What the f*** @espn. Y'all could re-adjust your programing on ESPN2 on the West Coast so that the Michigan vs UNLV game wouldn't cut off with 7 minutes left because the sorry ass @Lakers vs @celtics replay was about to come on and y'all had to black it out. DO BETTER!",
    "703": "Thank you @celtics https://t.co/PjObLBdA7c",
    "704": "@evandupuis17 @RapsSzn_ @NBA @celtics @Lakers Stop the Cap … We on here acting like Lebron isn’t old and maybe has 2 seasons of basketball left… As great as Jayson Tatum is.. he’ll never be what Lebron was in his prime.. Tatum is my favorite player besides Lebron.. but it looks this way now cause Bron is past his prime",
    "705": "Los Angeles Lakers star LeBron James returns from injury on Friday night at Boston Celtics – ESPN https://t.co/1oKca4FMcj",
    "706": "@day4our_ @KingJamesStory @NBA @celtics @Lakers Another pg who can’t shoot lol y’all had the answer and got rid of him",
    "707": "@celtics shocked, i guess they arent motivated with other teams.",
    "708": "🏀 Los Angeles superstar LeBron James scored 23 points in his return from an eight-game injury absence but the Boston #Celtics spoiled the #Lakers' welcome back party with a dominant 130-108 #NBA victory\n\nhttps://t.co/eq5jZvJ0KG",
    "709": "@lawrencehansbro @RapsSzn_ @NBA @celtics @Lakers They played when it was Jason Tatums first season in the nba AND STILL WENT 7 you clown. With how Jalen brown and Jason Tatum have gotten lol I wouldn’t be close",
    "710": "@bitcoinzay @celtics Caruso Lowkey playing like a 1st team all NBA defender \n\nKuz, Harrell and KCP are key parts on the #1 seed in the east \n\nShroëder dropping buckets on yall \n\nBeing a Lakers fan must be hell rn 😂😂😂",
    "711": "Los Angeles Lakers Look Haunted by Ghosts of 2021 NBA Offseason: BOSTON -- As the Boston Celtics ' lead over the Los Angeles Lakers continued to surge, \"Beat L-A\" chants began to vibrate the… https://t.co/qqF6fmbbpo #AnthonyDavisPF #Basketball #LeBronJames #LosAngelesLakers https://t.co/VB0l748q2w",
    "712": "@celtics @JetBlue HE TOO LITTLE!!👶🏻",
    "713": "@6ixIn6 @warriors @Lakers @Bucks @LAClippers @sixers @dallasmavs @BrooklynNets @nuggets @celtics @utahjazz @Suns @nyknicks @MiamiHEAT @HoustonRockets @WashWizards @cavs @hornets @spurs @memgrizz @Timberwolves @SacramentoKings @Pacers @OrlandoMagic @WNBA take notice",
    "714": "Nothing feels good like waking up on this @celtics win against The #Lakers\n\n #Celtics ☘️🚀",
    "715": "@RonMott @espn @NBA @Lakers @celtics She has the knowledge and understated delivery that makes her perfect for  the job!",
    "716": "#BleedGreen \n#Celtics \n#NBA75 \nBoston Celtics vs Los Angeles Lakers Game  Highlights NBA 2021 Season 11/19 https://t.co/ep1otqCDjc https://t.co/JGlA0b3q8N",
    "717": "Congratulations to my beloved BOSTON CELTICS for its massive 130:108 home WIN tonight over Los Angeles Lakers! What a GREAT victory! It's onward and UPWARD from here on out! #CelticsPride #CelticsNation #BostonStrong #GreenRunsDeep #CUsRise #NBA #BasketballIsLife 🏀💚🍀🥰👍 https://t.co/pLQuuAMeGQ",
    "718": "@BarryMurphyPT @celtics What in the world?!??! The Celtics aren’t even THAT good this season 😂 https://t.co/vtQ8WH5EHO",
    "719": "Out of everything bad that has happened this season we effen lose to Boston Celtics 😞",
    "720": "@celtics Can question consistency tho, it needs to happen when it’s not the lakers. Stop being a .500 team, Let’s goooo ☘️",
    "721": "@deadboyrare @celtics Top 5 what?",
    "722": "@NBA_NewYork Retaliation for speaking against #China is nearly the equivalent of organizing pro-Erdogan mobsters to harass and antagonize his opposition. I can't believe this is happening in #Boston @celtics #celtics #bospoli",
    "723": "Jayson Tatum scored 37 points and the Boston Celtics beat Los Angeles 130-108 on Friday night to spoil LeBron James' return to the Lakers' lineup. https://t.co/gZ6S9GDSA2",
    "724": "Los Angeles Lakers vs Boston Celtics Full Game Replay 2021 Nov 19 NBA Replay HD\nhttps://t.co/01EUVGmjXK https://t.co/tilQMHnmBB",
    "725": "Los Angeles Lakers star LeBron James returns from injury on Friday night at Boston Celtics – ESPN https://t.co/n86LMvfxi1",
    "726": "@bitcoinzay @celtics I wish I could get paid that much to play Mediocre Bball. 😂",
    "727": "@TheHoopCentral @NBCSCeltics The @celtics are Still Salty on the Fact that the Last Time they were Relevant, they Lost to the @Lakers in the Finals #NBA #NBATwitter",
    "728": "@celtics I love that guy https://t.co/K4JgkhpfB8",
    "729": "Check out 2017 Panini Donruss Optic Jayson Tatum #198  PSA 10 GEM MT #BostonCeltics https://t.co/WXdjc84g4z via @eBay",
    "730": "While playing against six potential future Hall-of-Famers Friday night, Jayson Tatum was far and away the most dominant player on the court.\nhttps://t.co/7jvveaaHxb",
    "731": "@bitcoinzay @celtics This is another Level of Pettiness, Considering the Fact that the Last Time the @celtics  Made the Finals, They Lost to the @Lakers  #NBA #NBATwitter #LakeShow #LakersNation",
    "732": "@celtics Hey @ShannonSharpe how them 2 cases go? We smoking Lakers pack! #BleedGreen https://t.co/qcoXEwrtNy",
    "733": "@tedcruz \"Boston Celtics player Enes Kanter wore sneakers tonight\" 🙀",
    "734": ".@jaytatum0 (37 PTS) and @AntDavis23 (31 PTS) topscore for the @celtics and @Lakers, respectively, in their first matchup this season! Who will get the upper hand next time? 🤔\n\n#NBA75 https://t.co/cxArj7JHwx",
    "735": "@ClutchPointsApp @NBCSCeltics When was the Last Time the @celtics made the Finals??? Exactly......",
    "736": "Los Angeles Lakers vs. Boston Celtics – 11/19/2021 Free Pick &amp; NBA Betting Prediction https://t.co/HBPilnfgQI via @cappers_picks",
    "737": "Look at the caption 😂😂😂\n\nI’m a Lakers fan and this shit is hilarious. Well done @celtics https://t.co/3f6Qc0kBkK",
    "738": "@kensgotbs @NBA @celtics 😂 on NBA legends mode 😬",
    "739": "@NBA @greenbean3742 @celtics washed king",
    "740": "#NBA75 \n\nIND vs CHA 118-121\nGSW vs DET 105-102\nLAL vs BOS 108-130\nORL vs BRK 113-115\nOKC vs MIL 89-96\nLAC vs NOP 81-94\nCHI vs DEN 114-108\nDAL vs PHO 104-112\nTOR vs SAC 108-88\n\n📸 @celtics https://t.co/eCaSsWlPXp",
    "741": "Mxa😭 yesterday 💜#Lakers lost, ka final 😭 nice work @Celtics @tatium was on 🏀 at all times 👌🏼",
    "742": "@Dr_Ray15 @celtics i hope you AND marcus smart enjoy your night, since he’s your favorite player",
    "743": "@NathielIsaac @celtics Same",
    "744": "@bahhumbug73 @BadVaccineTakes I can think of two notable sudden deaths among basketball players - Hank Gathers of Loyola Marymount University and Reggie Lewis of the Boston Celtics.",
    "745": "@celtics @JetBlue @Reed_Embiid look at this first play",
    "746": "How my favorite teams faired today?\nLondon Irish ✅\nMaccabi Tel-Aviv ❌\nBoston Celtics ✅\nBoston College Hockey 🤷‍♂️ (Lost SO)\nGonzaga Men’s Basketball ✅\n\nSo a 3 for 5 day https://t.co/mrwuyfSdZB",
    "747": "@celtics Celtics must build on this game\nNext game will show up  if this win was unction I hope not",
    "748": "@celtics please play jabari parker instead of grant williams!!!!!! Please!!!!😂😂😂😂",
    "749": "Jason Tatum arranged a stellar performance and guided the Boston Celtics to a win over the Los Angeles Lakers, despite LeBron James return on the court👏\nhttps://t.co/imGQKx46wi",
    "750": "The thing that frustrates me about the Enes Kanter thing is that even though he is BARELY a contributor to the team, his shithead misinformed narrative is actually dominating the media and the discourse around the Boston Celtics and it’s really making this season less fun!",
    "751": "Los Angeles Lakers' star LeBron James returns from injury on Friday night at Boston Celtics - ESPN https://t.co/weBQpX45i5 https://t.co/Y1bOwuQXgm #news #worldnews #breakingnews https://t.co/oJ2FRADnSn",
    "752": "@celtics Smoking that Lakers pack.",
    "753": "Let’s go!! This is a tradition that can never die @celtics https://t.co/NOU0thO1sa",
    "754": "I'm no fan of Boston Celtics but this is great #banter. \n\n🤝 https://t.co/MzhI7r89lm",
    "755": "Oklahoma City Thunder vs. Boston Celtics - 11/20/2021 Free Pick &amp; NBA Betting Prediction https://t.co/Y5y4OEBu9I\n.\n#Betting #FreePicks https://t.co/rEvhwKwxk9",
    "756": "The Los Angeles Lakers continued their road trip with a game against the rival Boston Celtics on Friday night, welcoming LeBron James back to the lineup after an absence of two weeks due to an abdominal injury.\n#Lakers #lineup https://t.co/o6d1Q7rqe4",
    "757": "Let’s go @celtics!!!!! ☘️☘️☘️☘️☘️",
    "758": "Los Angeles Lakers' star LeBron James returns from injury on Friday night at Boston Celtics - ESPN https://t.co/YyVbt2Fkgd",
    "759": "@celtics Me too...💚🍀",
    "760": "Jayson Tatum had 37 points and 11 rebounds as the host Boston Celtics spoiled the much-anticipated return of LeBron James in a 130-108 win over the Los Angeles Lakers on Friday night.\n\nRead: https://t.co/dhuflLgkhJ https://t.co/mF9ohoQom3",
    "761": "@cedricmaxwell81 @celtics That's what I'm talkin' 'bout!!! 🔥🔥🔥🔥🔥🔥🔥 https://t.co/u7RPzOIL5Z",
    "762": "@celtics @paulpierce34 @RealBillRussell this should count as tampering the game",
    "763": "@bradmagsam Did you forget or not see the Boston Celtics let AD sit there and shoot jumpers? Maybe you forgotten AD is NOT that guy. Maybe you forgot AD hasn't outplayed a big smaller than him in how many games? Again AD let Smart &amp; old azz Horford outplay him!!!",
    "764": "@NBA @celtics Not surprised @Thando_Blessin1",
    "765": "@DrPhilipsLunker @EnesKanter @KingJames @HornetsPR @hornets @celtics He used to be half decent, never a great. But as time goes by most basketball players get slower. Happens with all players in most professional sports. NFL players have an average retirement age of 27 and NBA 28.",
    "766": "@celtics But I can question why the lakers are paying 44 mil for Westbrick https://t.co/rU3DMAVQEu",
    "767": "@celtics If you keep it up I can’t definitely question it",
    "768": "The @celtics were again the most entertaining basketball team I watched today. No @FCHWPO today, but MAN @jaytatum0 was on fire tonight. I learned that term from NBA JAM :). the Celtics play good basketball imo. Lakers looked like they had a rough night, besides @AntDavis23.",
    "769": "@celtics You didn't beat a better team, just so you know you both struggling😂😂💔",
    "770": "@celtics insert \"but u can question this ratio\" below",
    "771": "@RapsSzn_ @NBA @celtics @Lakers Tatum has lost every playoff series against Lebron.. the way y’all treat an aging Lebron .. let’s me know that y’all would of destroyed Jordan’s legacy if social media existed when he was in that Wizards jersey..",
    "772": "@frostybias @aimonas1 @celtics @cedricmaxwell81 Yep...head coach at those times.",
    "773": "LeBron James says he feels 'OK' after first game back following eig... (Silver Screen and...)\n\nLeBron James returned from an eight-game absence on Friday night against the Boston Celtics,...\n\nAdd your highlights:\nhttps://t.co/vQ8C72frxb\n #LA_Lakers",
    "774": "One thing you can’t do after tonight? You can’t question our resilience. https://t.co/9qAYs8x4UH",
    "775": "A 37-point return saw #JaysonTatum steal #LeBronJames' thunder on a night the four-time #NBA champion returned to the #LosAngeles lineup, as the Boston Celtics beat the Lakers 130-108.\n\nhttps://t.co/4FPY9DSvHY",
    "776": "@DannySuarez13 @celtics @jaytatum0 Enough hashtags there bud?",
    "777": "@Adam_J_Roth @celtics Nice!!!! 💚🍀💚🍀💚🍀",
    "778": "I am officially a @celtics fan....particularly an @EnesKanter fan. This man is principled and brave. Buying his merch for Christmas gifts.",
    "779": "@NBA @celtics Repeat\nhttps://t.co/zoEBOvl8hE",
    "780": "@JadenHours_ @celtics @jaytatum0 do you have the full photo with jb too?",
    "781": "@riceboy42069 @jaytatum0 @Fox_Ro10 @PackripEwing @celtics @girldadNFT @topshotfund Thanks for cheering on my degen pursuit, bro!!📣😎",
    "782": "Celtics scored a convincing win over Lakers, 130-108! \n\nJayson Tatum: 37 PTS, 11 REB, 4 3PT\nMarcus Smart: 22 PTS, 8 REB, 6 AST\nAnthony Davis: 31 PTS, 6 REB\nLeBron James: 23 PTS, 6 REB\n\n#lakers #bostonceltics #jaysontatum #lebronjames https://t.co/zg1ND9Ud88",
    "783": "@celtics Bleed Green baby 💪💪",
    "784": "#LeBronJames, who was returning from injury was unable to lift @Lakers who went down to @celtics. #NBA #NBA2021\nhttps://t.co/N0tDifcgnk",
    "785": "Sums up the Celtics season so far. ☘\n\n#bostonceltics #celtics #celticsdiary #celticsdiarymeme https://t.co/nPpc2cOUuj",
    "786": "Los Angeles Lakers (@Lakers) superstar LeBron James (@KingJames) scored 23 points in his return from an eight-game injury absence but the Boston Celtics spoiled the Lakers’ welcome back party with a dominant 130-108 NBA victory.\n\nREAD: https://t.co/wfBxAQWEbO\n\n#DailyTribune",
    "787": "Los Angeles Lakers (@Lakers) superstar LeBron James (@KingJames) scored 23 points in his return from an eight-game injury absence but the Boston Celtics spoiled the Lakers’ welcome back party with a dominant 130-108 NBA victory.\n\nREAD: https://t.co/77kF2IqJWu\n\n#DailyTribune",
    "788": "@RapsSzn_ @NBA @jaytatum0 @celtics This ratio is rolling rn",
    "789": "Boston Celtics Team Salary | Boston Celtics Player Salary and Roster Info https://t.co/eUlkrZfFAr",
    "790": "@NotOnBooze @celtics Kobe fan* Also just came out yesterday saying he dislikes the Lakers and then stomped their asses like he always does, but okay dude.",
    "791": "Y'all won't believe this but, in less than 24 hours our 17 time world champion Boston Celtics are going to be over .500! We will beat OKC!",
    "792": "@celtics Well done",
    "793": "@Darius62368461 @NBA @celtics Hi dear",
    "794": "@22LINDAMINOR @pgmoney_ @NBA @celtics Hi dear can we be friends",
    "795": "@Lakers all I asked was that you don’t lose to the fucking @celtics and you failed me and Nico… Way to go 🙄",
    "796": "If U had… One chance, one opportunity… 😂 #NBA #BostonCeltics #RussellWestbrook https://t.co/Bta3Ew6sLx",
    "797": "@celtics @jacob_eymannnn Y’all still lick glizzies",
    "798": "FINALLY! 🏆 \nI’ve been working up to this S1 Moment for a long time. 🏁\n\n@jaytatum0 is only 23 &amp; his #NBATopShot Debut is a killer ankle-breaker⚡️on the formidable PG13.\n\nCan I get a fist bump? 🤜🏼💥🤛🏼 #JaysonTatum #BostonCeltics #NBATopShotThis https://t.co/MJ6kTxj0EB",
    "799": "@celtics @jaytatum0 good win",
    "800": "@KingJames plays @FCHWPO does not and we still win @celtics 💚🍀✔️",
    "801": "@NBA @celtics https://t.co/NWBL4WiYZC\ndrop a follow thanks",
    "802": "Fuck y’all🖕 @celtics \n#Lakers https://t.co/dB63rlyZWj",
    "803": "@6ixIn6 @warriors @Lakers @Bucks @LAClippers @sixers @dallasmavs @BrooklynNets @nuggets @celtics @utahjazz @Suns @nyknicks @MiamiHEAT @HoustonRockets @WashWizards @cavs @hornets @spurs @memgrizz @Timberwolves @SacramentoKings @Pacers @OrlandoMagic Your a sick man for this but I completely understand",
    "804": "@hoepayme @celtics I mean ughhh Danny …",
    "805": "@hoepayme @celtics Same on this side daddy 😘",
    "806": "10 PTS 12 REB for Chris Boucher 🔥💪🏾\n\n@warriors @Lakers @Bucks @LAClippers @sixers @dallasmavs @BrooklynNets @nuggets @celtics @utahjazz @Suns @nyknicks @MiamiHEAT @HoustonRockets @WashWizards @cavs @hornets @spurs @memgrizz @Timberwolves @SacramentoKings @Pacers @OrlandoMagic",
    "807": "Good 20 piece thank you 🤝 @celtics https://t.co/GROCNvrYHV",
    "808": "@Luka_Donut @statmuse @jaytatum0 @celtics @celtics_stats they're doing a bad job not hiding it then",
    "809": "@hoepayme @celtics Lmao I saw your tweet after I retweeted this . Sorry papas 🥺",
    "810": "@celtics keeping it classy as always… https://t.co/aDfV05CBBf",
    "811": "@John_Kinsey @celtics @stoolpresidente He’s a man of the people. Salt of the earth.",
    "812": "The @Lakers 🟣🟡 and the @celtics 🟢⚪️ are the two most storied franchises in the @NBA 🏀, 🏆 17 x Championship each. \n Celtics-Lakers rivalry one of the greatest sports rivalry. #LakeShow   🌊 #BleedGreen   🍀#NBA75 @tdgarden https://t.co/RinOqLVIVQ",
    "813": "11/19\n\nOklahoma 1H -5.5 (-125)✅\nMarquette +5.5 (-125)✅\nWinnipeg Jets ML (-105)❌\nGolden St. Warriors ML (-130)✅\nChicago Bulls (-105)✅\nBoston Celtics -2.5 (-110)✅\n\n5-1✅\n\n+3.23 U💰\nMakes it 13-2 in last 15🔥\n#GamblingTwitter #BarstoolSportsbook #sportsbet #FanDuel #DraftKings https://t.co/h2gyR9bvOX https://t.co/bOb7q9D8jl",
    "814": "@Lakers got smoked tonight by the @celtics",
    "815": "@jaytatum0 taught ya everything you know. In all seriousness how does one walk on to the @celtics https://t.co/LmI6ucp61c",
    "816": "@jamdonohu @celtics Yes. Enjoy your night",
    "817": "@celtics We need to appreciate Tatum a lot more. The kid is special. We don’t need to trade him or Jaylen.",
    "818": "@celtics to the @Lakers #LALvsBOS https://t.co/OkvICMj0Jt",
    "819": "@celtics Wow Let’Z go",
    "820": "@RealBillRussell @tdgarden @celtics @Lakers @NBA @ESPNNBA @espn @BostonGlobe Suit up.  Celtics could use the best rim protector of all-time.",
    "821": "@RealBillRussell @tdgarden @celtics @Lakers @NBA @ESPNNBA @espn @BostonGlobe Love u Bill! 🍀💚",
    "822": "@celtics @paulpierce34 @RealBillRussell Tatum plays like he did tonight alot more, he might be a future legend himself.",
    "823": "@celtics @jaytatum0 It’s great to ALWAYS beat the Lakers!  #BleedGreen",
    "824": "Congratulations Boston @celtics on your 130-108 win over the Los Angeles Lakers 2021-2022NBASeason",
    "825": "Celtics broadcast graphic takes brutal shot at Russell Westbrook\nhttps://t.co/7Wn2KXoqLF\n\n#russellwestbrook #nba #basketball #bostonceltics #sports",
    "826": "There’s THE GUY! @Al_Horford our #1! Not the guy in yellow and purple. @celtics #LetsGo! https://t.co/gHUtiYRcLw",
    "827": "Need me a @celtics warm up jacket 😭",
    "828": "@celtics learn something new every day.✍🏾 https://t.co/XdkxFJJT3X",
    "829": "@celtics @jaytatum0 This softie felt like talking shit then hitting the block button, feel free to let him know his Lakers team is just as soft as he is https://t.co/FLfbJWx3fr",
    "830": "@DMAC_LA Haha and @celtics  refuse to make changes to their roster and trade assets to actually contend. Trade everyone beside Tatum and bring in a actual superstar to contend. Lakers have won 3 since 2008. Ainge was never about winning chips. Just about regular season and ECF appearances",
    "831": "@celtics Tatum owns Lebron",
    "832": "@NBA @celtics King's back but still got annihilated",
    "833": "@celtics great win!!! ☘️☘️☘️",
    "834": "Kings welcome your new pal the Boston Celtics on the do not bet list",
    "835": "@RealBillRussell @tdgarden @celtics @Lakers @NBA @ESPNNBA @espn @BostonGlobe Living legend",
    "836": "A game between the teams of Boston Celtics &amp; Miami Heat at the homecourt of Miami 💚❤️ https://t.co/q1d04OIwPd",
    "837": "@lgw2 @mcten @celtics We’ll see you there",
    "838": "@percy_drumz @celtics Smh idk what’s going on with y’all smh. We needed this win fr",
    "839": "@UnashAcari @celtics Massive L on your part",
    "840": "@Hhhh07276459 @nickdelpizzahut @celtics Both great",
    "841": "Los Angeles superstar LeBron James scored 23 points in his return from an eight-game injury absence but the Boston Celtics spoiled the Lakers’ welcome back party with a dominant 130-108 NBA victory. | @manilabulletin\n\nhttps://t.co/ChoZtmpAC8",
    "842": "@LakeShowYo Lakers  need  to fixed  this is looking  bad  losing  to the Boston Celtics  now the Lakers  is now 8-9 in this season  that is not good  soon  the Lakers  will  out of top ten  in the standings  that is not good  for the team and they not going  to make  the playoffs",
    "843": "@mcten Hope @celtics have same energy when they in Cancun",
    "844": "FT.\n\nBoston Celtics 130 - 108 LA Lakers\n\nThe lakers lose again.\n#TheGamePlan https://t.co/Sh6jPjwRtD",
    "845": "@jaytatum0 there go that man mama that’s a dub @celtics https://t.co/lQ7EOebrTj",
    "846": "@nina_alston Lakers  needs  a game  plan  because  this not working at all.  Lost  another  game  against  Boston Celtics",
    "847": "LeBron James said he \"won't give his energy\" to the sneakers Boston Celtics forward Enes Kanter wore for their game on Friday night.\n\nhttps://t.co/lBOrBkgOS3",
    "848": "@SmartOfMarcus @celtics Look at the ATL game and the Cavs games",
    "849": "@statmuse @jaytatum0 @celtics @celtics_stats Walking bucket #enoughsaid",
    "850": "@LAKERSRISE I can't stand Dennis do you the interview when they won look at its face is disgusting I can't stand that guy 😠😠😠 the good news is we're going to see him again on December 7 I hope  Lakers   kick Boston Celtics ass",
    "851": "@celtics @jaytatum0 That boy nice",
    "852": "@Celtics_PRam @celtics @EnesKanter @CelticsCanada @frostybias Too bad he absolutely sucks and isn't worth playing",
    "853": "@celtics @paulpierce34 @RealBillRussell The Truth 💯",
    "854": "@celtics @jaytatum0 Nice Jersey",
    "855": "@Celtics_PRam @CelticsCanada @celtics @EnesKanter @frostybias When he made that 3, lakers were like well at least he made it against the staples center lakers 😂",
    "856": "11/19/2021 @CoachTurgeon /@TerrapinHoops beat Hofstra 69-97 by (2) \n\n(1)(36) total points in rv (63)(1) \n\n(1) day after what would have been better  Len Bias 58th) birthday drafted (2) by @celtics  6/17/86 \n\nBias born 11/18/19(63)  #rup\n\n#terps https://t.co/OcCjD4OBfx",
    "857": "@Celtics_PRam @celtics @EnesKanter @frostybias Enes Kanter isn’t perfect, but when he’s on the floor we don’t get killed on the boards. That’s what he’s there for..and his incredible 3 point range.",
    "858": "@NBA @celtics And the foul on LeBron",
    "859": "✅ @UMassBasketball\n✅ @UMassWBB \n✅ @UMassHockey \n✅ @celtics \n\nPretty good night. 😤",
    "860": "@celtics @paulpierce34 @RealBillRussell Finally nice to see us win with legends in the house",
    "861": "Dennis Schroder reacts to facing his former team: “It was cool” #BostonCeltics #DennisSchroder #LosAngelesLakers https://t.co/zS3cFBSAtW",
    "862": "Jayson Tatum had 37 points and 11 rebounds as the host Boston Celtics spoiled the much-anticipated return of LeBron James in a 130-108 win over the Los Angeles Lakers on Friday night. https://t.co/9wrSVidiPi",
    "863": "@celtics Great job through the pain! Letting them feel it too, Dennis!",
    "864": "@celtics @jaytatum0 WHERE'S THE TATUM SLANDER",
    "865": "@RealBillRussell @tdgarden @celtics @Lakers @NBA @ESPNNBA @espn @BostonGlobe Bill, thank you. You brought the Celts good luck. 👍😃",
    "866": "@SmartOfMarcus @celtics You guys give him to much credit!!",
    "867": "@Nav_Yoo @statmuse @jaytatum0 @celtics @celtics_stats Bucks fans get 1 chip in 50 years and forget how to act lmao",
    "868": "How true lol. The Chinese Communist Party (CCP) has invaded the NBA. Hope it stops there once LBJ retires!\n\n@chicagobulls @Lakers @celtics #Carushow! #Chicago #MadHouseOnMadison #BullsOnParade #SeeRed #BullsNation 🐂🎯 https://t.co/NV6CL5VISh",
    "869": "@aimonas1 @celtics You asking for too much, we missing two important players. Smart isn’t gonna have the ball in his hands all the time",
    "870": "Congratulations @jasontatum0 for helping the @celtics more than hurting them tonight.",
    "871": "@RealBillRussell @tdgarden @celtics @Lakers @NBA @ESPNNBA @espn @BostonGlobe This is the man who made y'all lose,winners don't grow old",
    "872": "The Boston Celtics spoil the return of Lakers superstar LeBron James with a lopsided victory. #NBA https://t.co/WGuJJc2lbw",
    "873": "LA Lakers vs Boston Celtics (2021-11-19)\n\nNo +s tonight for anyone on LA...\n\n#NBA #NBA75 #NBATwitter #LakeShow https://t.co/qj1I19hi9r",
    "874": "@AndysSportsWRLD @jaytatum0 @celtics Celtics Fan Too ?",
    "875": "The Boston Celtics spoil the return of Lakers superstar LeBron James with a lopsided victory. #NBA https://t.co/kje0ZXeKXS",
    "876": "woke up to a win from my @celtics 😁",
    "877": "@SmartOfMarcus It’s in my best interest as a @celtics fan that Smart plays like tonight every game of the season! I want him to average 20 points on 12 shots w/6 rebounds &amp; 6 assists! I want that! That makes the team better! We haven’t gotten that though!",
    "878": "Boston Celtics: Jayson Tatum, #Celtics spoil LeBron James' #Lakers return - The Washington Post https://t.co/GtwYTUBGhG",
    "879": "@jeofcee @celtics Pritchard's Twitter handle was FastPP when he was drafted",
    "880": "@celtics @jaytatum0 Two games he's cooking! Been awhile JT!",
    "881": "Wasn't @stephenasmith very confident that the @celtics was going to lose",
    "882": "BANNED IN CHINA: @celtics games are blocked in China, thanks to @EnesKanter who clearly doesn’t give a rip. 😂 💵#Celtics blow out @KingJames and @Lakers tonight, 130-108. Gotta be the shoes. #WhereIsPengShuai #PengShuai #ChinaKicks https://t.co/Ch5xkpJjra",
    "883": "@japhillips04 @celtics @stoolpresidente Damn… @stoolpresidente all over it!",
    "884": "11/19/2021 @Lakers vs @celtics rivalry\n\n@celtics  (1)(30-108 by (22) 1 day after (30) Len Bias (58th) bday dead at (22) 6/19/86 \n\n130 + 108 .= (2)(38)  rv (83)(2) \n\nLast la vs  bos finals (11) yrs prior. La (83)-79 @kobebryant back (2) back  on 6/17/2010\n\nLen bias draft 6/17/86 https://t.co/uTgqms8FUG",
    "885": "@Advil @Patriots Yes! Thanks @celtics! 💚☘️ https://t.co/v0ZoJfoK6Z",
    "886": "@celtics Can't spell Lakers with without the L #BleedGreen",
    "887": "@celtics Tatum 🔥 I’m surprise he’s addicted to that team but fuck LBJ Tatum AD and Dame  omg!! Y’all just don’t know",
    "888": "@TylerCa66949883 @Lakers @celtics not ready to say they're washed up, but they're not cohesive and that matters",
    "889": "@celtics Max him idc",
    "890": "@celtics @jaytatum0 BIG W #BleedGreen",
    "891": "@MikeDynon I’m too modest to state that the @celtics are (2-0) in games I’ve attended. https://t.co/NVbBgYJVbO",
    "892": "@King_Willis_ @AsahiAko @NBA @celtics Against scrubs. That bum team would’ve lost a normal playoffs",
    "893": "@RealBillRussell @tdgarden @celtics @Lakers @NBA @ESPNNBA @espn @BostonGlobe great seeing you there champ!  a hero on and off the court! https://t.co/tTv0Owg2yK",
    "894": "@celtics Isiah Thomas vibes 1988 NBA Finals",
    "895": "@celtics @paulpierce34 @RealBillRussell Have to made up for the lost when Truth’s jersey retiring night.",
    "896": "@diakite_burner @porktendencia @celtics Fan account",
    "897": "@IAmJamesStewart Wow, slow down tiger! Congratulations on the @celtics prediction",
    "898": "@celtics @JetBlue That was probably the most intensity and passion I have seen Tatum show in his career...AND I LOVE IT!  We all shud love it(Celtics fans). He is gonna become a better player if he does. Maybe hopefully he's been hearing about it so much that he wants to shut me/us up",
    "899": "@celtics How good 👍",
    "900": "@ShamsCharania @TheAthletic @Stadium Godspeed to a full recovery, always keep tabs on him, he should’ve been a @celtics player",
    "901": "11/19/2021 (1) day after what would have been  (30) Len Bias (58th) birthday on 11/18/21 \n\n@celtics (1)(30) - @Lakers (10)(8)  lost by (22). Last shot by  lbj rival @EnesKanter.\n\nLen Bias died age (22). 6/26/03  @KingJames drafted (1) for the @nba (58th) season.\n\n#rip #lenbias https://t.co/XcXugdDqrs",
    "902": "Well done @celtics vs. @Lakers at home. Top scorers #jasontatum, #marcussmart and #dennisschroder with uncle sprain 🏀👍🙌✌️.\nWhat a great victory tonight! https://t.co/lqY29M92Kr",
    "903": "@Al_Horford @jaytatum0 - simple awesome tonight!!! Great win!!! @celtics https://t.co/y12x0tS4QD",
    "904": "@RealBillRussell @tdgarden @celtics @Lakers @NBA @ESPNNBA @espn @BostonGlobe We saw you Nupe!",
    "905": "@sowwowofficial6 will be happy his @celtics won 🏀",
    "906": "@pgmoney_ @NBA @celtics What title?  They may not even make it to the playoffs.",
    "907": "Jayson Tatum scored 37 points and the Boston Celtics beat Los Angeles 130-108 on Friday night in LeBron James’ return to the Lakers’ lineup. https://t.co/tYp83HISLM",
    "908": "STOP THE PRESSES! @celtics 🇺🇸🇺🇸🇺🇸 https://t.co/5k765xuKUv",
    "909": "Yessssssssuh @celtics luvvvvv https://t.co/UVP6CEM90W",
    "910": "@Broker_Brett @Lakers @celtics @adhalla21 @donaldchu @FinaeoHQ $44 milli is a lot tbh",
    "911": "@celtics Lakers are hot ass aren’t they?",
    "912": "@celtics @jaytatum0 The Celtics have a better record than the lakers",
    "913": "When you over step bounds with your customers, and have to walk it back…\n\nThe @Lakers @celtics rivalry can do strange things to a man @riskguyLAstyle !!\n\n@adhalla21 and @donaldchu, I’m happy this hasn’t effected my employment with @FinaeoHQ too, haha https://t.co/Uwpkgwk4xi",
    "914": "The Lakers have no resistance in their defense against @celtics, says @Rjeff24 via @ESPNNBA. \n\n“It got worse as the game went on. They had a good first quarter, struggled in the 2nd, struggled in the 2nd half, &amp; the 4th quarter was pretty much a wash.” \n\n#BleedGreen #LakeShow https://t.co/x6vZd2ySz7",
    "915": "The Boston Celtics beat the Los Angeles Losers 130-108. \nTatum is on fire with a double double 37pts, 11rebs, 2ast, 3stl and 1blk. Smart supported with 22pts, 8rebs, 6ast and 1stl. Schröder with a revenge game  21pts, 6rebs, 6ast. ☘#bostonceltics #celtics #celticsdiary https://t.co/7DjnHRIKN6",
    "916": "@DOgemade @NBA @celtics I had to check the box score because I assume Lebron didn't play...But he did. \nAnd they still got destroyed!😄",
    "917": "@NBA @jaytatum0 @celtics All STAR performance 🍀",
    "918": "Anthony Davis says the Lakers need to play defense ‘as a collective’ #AnthonyDavis #BostonCeltics #LosAngelesLakers https://t.co/OjOVayJjol",
    "919": "Charlotte Hornets 121 (LaMelo Ball 32 pts, 11 rebs) Indiana Pacers 118 (Jeremy Lamb 23 pts), Detroit Pistons 102 (Frank Jackson 27 pts) Golden State Warriors 105 (Jordan Poole 32 pts), Boston Celtics 130 (Jayson Tatum 37 pts, 11 rebs) Los Angeles Lakers 108 (Anthony Davis 31 pts)",
    "920": "This is awesome @lakers @celtics https://t.co/HJDAUEGkhR",
    "921": "@celtics LeBron always folds around Paul Pierce.",
    "922": "@RealBillRussell @tdgarden @celtics @Lakers @NBA @ESPNNBA @espn @BostonGlobe Was so great to see you there! The 🐐🐐🐐",
    "923": "Great win! @celtics @jaytatum0 https://t.co/vNQqVxb4Bz",
    "924": "💪🏾💚 RT @celtics: Jayson Tatum says of playing in front of @paulpierce34 and @RealBillRussell during a Celtics win over the Lakers at home, \"It's a surreal moment.\"",
    "925": "Celtics light up Lakers without Jaylen Brown and Robert Williams\nhttps://t.co/r1dVifkIc9\n\n#bostonsports #bostonceltics #losangeleslakers #nba #sports",
    "926": "@ADredemptionSZN @01001100____ @statmuse @jaytatum0 @celtics @celtics_stats Nah they're deadass not even gonna make the finals, 1st round exits again",
    "927": "@NBA @celtics Awesome job Celtics quieting the ESPbroN return noise when the smoke cleared..😆",
    "928": "@celtics @paulpierce34 @RealBillRussell He owns LeBum",
    "929": "@takeoverjulian @celtics what, i was rooting for the celtics 🧍🏽‍♀️",
    "930": "@nina_alston this don't  make  no sense  the Lakers  los another  game. To the. Boston Celtics score  on the Lakers  130to 108.  Now the  Lakers .is now 8-9 in the standing the Lakers  need  turned  this team around  fast.",
    "931": "@Celtics ran through lakers my guy😂😂😂",
    "932": "@celtics @paulpierce34 @RealBillRussell 2 Celtic legends and future Celtic legend",
    "933": "@RealBillRussell @tdgarden @celtics @Lakers @NBA @ESPNNBA @espn @BostonGlobe Now I know why we won",
    "934": "Great win @celtics ! LFG! https://t.co/a1eBVYVzsG",
    "935": "Who's in worse shape at this point in the 2021-22 NBA campaign: the Boston Celtics or the Los Angeles Lakers? If the end result Friday was any indication, Boston is undoubtedly trending in a more positive direction than its West Coast counterparts. https://t.co/AgVBvR6nhC",
    "936": "@celtics @jaytatum0 You didn’t disappoint. Thank you. ☘️",
    "937": "@celtics They left out  Jabari again. He's an instant offense from the bench.",
    "938": "Both die hard Lakers fans growing up…both leaders for the Boston Celtics. Gotta love it. https://t.co/9HJ72hmIGy",
    "939": "@NBA @DukeNBA @celtics Tatum owns bron",
    "940": "@Hhhh07276459 @nickdelpizzahut @celtics No but a Trae fan",
    "941": "@jzsark @MagicJohnson @kaj33 @celtics @NBA @Jumpman23 Finally the Celts were able to put a team away",
    "942": "Couldn’t watch ya tonight but I’m PROUD! @celtics",
    "943": "@NBA @celtics Should have been and 1.",
    "944": "@01001100____ @statmuse @jaytatum0 @celtics @celtics_stats Thought as much big mouth to the money come up. You have a nice one",
    "945": "@4Mooncakee @celtics Doesn't matter! Soft Celtics fans will always make him the scapegoat!",
    "946": "@DenduA @celtics @Lakers Nice W against the 2010 All Stars",
    "947": "Lakers  lost another  game  against  the Boston Celtics  130 to 108 with LeBron James  in this game.",
    "948": "I know we gunna be alright but damn #LakeShow  i hate boston celtics we need to always beat them.",
    "949": "@celtics @jaytatum0 bUt hE hAtEs pLaYiNg wItH sMaRt aNd bRoWn",
    "950": "@celtics @jaytatum0 WE BACK",
    "951": "Jayson Tatum had 37 points and 11 rebounds as the host Boston Celtics spoiled the much-anticipated return of LeBron James in a 130-108 win over the Los Angeles Lakers. #NBA75 \n\nhttps://t.co/AQau5am5f6",
    "952": "@celtics Great win!",
    "953": "@celtics please sign him to an extension",
    "954": "@celtics W point guard keep him on the squad",
    "955": "Dennis Schröder says with a smile of playing through his ankle sprain tonight against his former team, \"I had to be there for that one tonight, so I made it work.\"",
    "956": "@celtics @jaytatum0 Celtics legend",
    "957": "@aimonas1 @Becoming_Bryna @celtics @cedricmaxwell81 84 and 85 he did",
    "958": "@Becoming_Bryna @celtics Did pops coach @cedricmaxwell81 or had he moved on before dad started coaching?",
    "959": "@LakersNation Their is no worse loss than losing to our hated rival Boston Celtics. Too much history",
    "960": "@celtics @jaytatum0 LET’S GO JT!! ☘️☘️ https://t.co/DgyHXz9X3F",
    "961": "@celtics @jaytatum0 Thanks for my new wallpaper",
    "962": "@celtics Loved the Let’s Go Brandon chants whenever LeBron James had the ball.",
    "963": "@offy @celtics They cleaned up on the offensive glass really well, felt like a lot of second chance points tonight. Solid defense too, and refs weren’t buying what Bron was selling which helped.",
    "964": "Lakers vs Celtics 🏀\n#RivalryGame #LakeShow #Celtics #LAvsBOS @ESPNNBA @Lakers @celtics @tdgarden https://t.co/uSs5LldAXy",
    "965": "@tylerblack32 @Lakers @celtics Lakers are not talented. They’re just a bunch of washed up vets. The season is over. Just hope we make the playoffs at least. With Lebron, AD, and Russ’s bloated contracts we won’t contend until another rebuild",
    "966": "Marcus Smart on why the defense has become so dominant: \"Just turned our intensity up. We understand the team that we have and the ability that we have ... We're athletic, we're long, we're quick, we have great IQs.\"",
    "967": "@celtics PP has been ghost town this season . You wouldn’t think he had the summer that he had",
    "968": "Tatum cooking the lakers. Hopefully this @celtics continue and win bigger things in thw future. #BeatLA #CelticsvsLakers",
    "969": "@celtics Have fun getting out in the play in games",
    "970": "Love a walk-off, but ESPECIALLY love a walk-off when the @celtics #BeatLA! ☘️ Appreciate you @J_Rich1! https://t.co/A972PVag4x",
    "971": "@NBA @jaytatum0 @celtics Who’s cares, the Raptors are ROLLING right now",
    "972": "@Robert_Jones44 @celtics Smooth shit you have There.",
    "973": "@NBA @jaytatum0 @celtics lavine still better",
    "974": "@NBA @jaytatum0 @celtics Lakers are finished 😭😭😭😭😭",
    "975": "The 37-PT, 11 REB double-double from @jaytatum0 lifts the @celtics to the big home win. https://t.co/SzHYQNNAmm",
    "976": "@01001100____ @statmuse @jaytatum0 @celtics @celtics_stats Which app you want to use ?",
    "977": "@celtics probably had the best small forwards ever from any nba franchise   \n\nHavlicek\nBird \nPierce\nCedric Maxwell\nTatum\nReggie Lewis\nLen Bias \nGordon Hayward",
    "978": "Boston Celtics -2 (-110) ✅\n\nCash it 💰💰💰\n\nAnotha one. \n\n#GamblingTwitter \n#NBA https://t.co/iJjiq5KtCx",
    "979": "📽  Boston Celtics 130, Los Angeles Lakers 108 highlights: https://t.co/zuR1FWztDx https://t.co/tA7jj1PSxg",
    "980": "@celtics tatum showing up in game when it matters https://t.co/qlIl2RXzVb",
    "981": "UPDATE: \n#BeatLAagain\n☘️The Celtics regular season record vs the Lakers: \n*206–163 \n\n☘️Celtics have faced the Lakers in the NBA Finals 12 times and have won 9 of them.\n\n☘️ NBA championships:\nBoston Celtics 17\nLos Angeles Lakers 12\nMinneapolis Lakers 5 https://t.co/y7IljakVZa",
    "982": "Boston Celtics News - Halftime: Lakers 61, @celtics 60. #bostonceltics #celtics #bostonathletes #basketball #boston #NBA #NBA75 #BleedGreen #goceltics #bostonathletemagazine https://t.co/rHA6NT0BTd",
    "983": "Frank Vogel says the Lakers need to play team basketball if they want to win #BostonCeltics #FrankVogel #LosAngelesLakers https://t.co/Px4MhK59OM",
    "984": "@cedricmaxwell81 @celtics BLEED GREEN ☘️☘️☘️☘️☘️",
    "985": "BOSTON (AP) — Jayson Tatum scored 37 points and the Boston Celtics beat Los Angeles 130-108 on Friday night in LeBron James’ return to the Lakers' lineup. https://t.co/Vs0PjrcOx8",
    "986": "I can only hope that the @lakers as currently formed figure out a way to gel defensively; an embarrassing loss to the @celtics. It's early in the season but this team is too talented to be missing out on this many fundamentals.",
    "987": "@JoordyTV @celtics I spotted waldo",
    "988": "@celtics Be better if it was Worthy, but still awesome",
    "989": "JT was unstoppable tonight as our @gatorade Player of the Game 🔥 https://t.co/b9AwMVy88y\n\n— Boston Celtics (@celtics) November 20, 2021",
    "990": "@celtics 🔥🔥I see Kobe!",
    "991": "@Dream11 another day another sweep ✅😉🏀🏀🏀🏀🏀.\nWell played @celtics \nThose who want my #NBA75 and others basketball teams.\nDM. https://t.co/McIsAnf0Cy",
    "992": "@Hhhh07276459 @nickdelpizzahut @celtics It wasn’t because of Doncic averaging 36/8/10 in the Clippers series against “the best perimeter D in the NBA”—including 46 and 14 in Game 7, and scoring or assisting on 84% of the Mavs’ FGs in Game 5 with a taped-up shoulder. \n\nPlus I was replying to a tweet about the Celtics.",
    "993": "@celtics look forward to your loss to the 1-14 Rockets on Monday.",
    "994": "@BroncoRob @statmuse @AKAJQ @jaytatum0 @celtics @celtics_stats @RealBillRussell Hope so.",
    "995": "@celtics Goat 🐐",
    "996": "@ThaRealCstyleZ @celtics I disagree you can never have too many wing players look at the Chicago Bulls. Are Zach LaVine and Demar Derozan redundant?",
    "997": "@celtics Guys if we score 130 every night we could be kinda good",
    "998": "Always great when @celtics beat LA",
    "999": "We had a 39-point swing in our favor tonight, as Jayson Tatum’s monster effort led us to a blowout win over our archrival.\nhttps://t.co/AruhrBVjdY",
    "1000": "@eujp91 @celtics @Gatorade @Max_Lederman A true 👑",
    "1001": "@Jackie_Pepper Not exactly the results the @Lakers wanted in their return getting throttled in the 2nd half by their hated rival @Celtics. 💀 https://t.co/MsO5KEm7rt",
    "1002": "OMG this is amazing 🤩 couldn’t stop laughing 😂 #BleedGreen @celtics https://t.co/AWtobsFOVj",
    "1003": "@joshua_page @celtics @Gatorade @Max_Lederman did it",
    "1004": "Boston Celtics.",
    "1005": "@KanterBase @EnesKanter @celtics @Lakers Just loving Kanter! He gotta play more!",
    "1006": "@celtics Me too!",
    "1007": "@NBA @celtics Lets go, Boston!",
    "1008": "@StFranceskko @Lakers @celtics I just love how they have used it has a weapon to get everyone else involved when defences try to double or triple team him.",
    "1009": "@jamdonohu @celtics Cool",
    "1010": "@AsahiAko @NBA @celtics I’m kd was with nets that’s East cost Irving was with East cost. Nobody the lakers played in the playoffs was lopsided. Warriors wasn’t in the picture. It was blazers Houston Nuggets",
    "1011": "@Dr_Ray15 @celtics no he’s your favorite player you told me so",
    "1012": "@angelasearles94 @Lakers @celtics Such a great game ☘️💚",
    "1013": "@GodfreyMwisha @Lakers @celtics Problem Steph's Shooting Is A Cheat. Coz Takwaba..(Nichi Combo)",
    "1014": "Josh Richardson being a team high +27 for the @celtics tonight is hard to analyze",
    "1015": "@celtics Absolutely buzzing! 😁😁😁😁😁 https://t.co/zUIDg90JTz",
    "1016": "@celtics @Gatorade Who did this 😂 https://t.co/SJ0GOhA6J4",
    "1017": "Boston Celtics News - Lakers lead 38-30 over the @celtics at the end of the 1st Quarter. #bostonceltics #celtics #bostonathletes #boston #basketball #bostonsports #boston #bostonathletemagazine https://t.co/X0vET6YYSg",
    "1018": "@celtics @Gatorade Never once doubted him",
    "1019": "@celtics @Gatorade Best performance of the season for him 🔥",
    "1020": "@celtics @Gatorade Everyone ate well",
    "1021": "@celtics @Gatorade Fathered LeBattlePass",
    "1022": "JT was unstoppable tonight as our @gatorade Player of the Game 🔥 https://t.co/CUm0RQpVDM",
    "1023": "@01001100____ @statmuse @jaytatum0 @celtics @celtics_stats Lets lock it on a app 200 buy in",
    "1024": "@StFranceskko @Lakers @celtics Not even DeRozan could stand in our way😊 https://t.co/On22iaggMD",
    "1025": "@celtics @NBCSBoston Bill Russell is the Goat , 13 seasons 11 Championships !!!",
    "1026": "@celtics thanks for this, we deserved. love u.💚",
    "1027": "@King_Willis_ @NBA @celtics Think it Deeply why they become #1 seed that time almost all Superstars got injured like KD, Irving, Steph, Klay, and etc.. Now that they're back on the Leauge where's the Lakers?? Remember Lakers have better rosters now they got almost 6 players future hall of Fame🤣🤣🤦🤦🤦",
    "1028": "@Karceno Lebron James and the L.A Lakers got blowout today by the Boston Celtics 130-108. The Celtics gave the Lakers a old fashioned butt kicking and Spanking!!!",
    "1029": "@LHSCoachDow @ChrisBrathw8 @Patriots @celtics @Lakers @KingJames @Xavier_Pedro2 Thanks Dow 🤝",
    "1030": "THREAD: RESULTADOS 19/11\n\nEncerrado:\n\nBoston Celtics (8-8) 130 x 108 (8-9) Los Angeles Lakers\n\nBOS 📊\nJayson Tatum: 37PTS/11REB/2AST/3STL/1BLK\nMarcus Smart: 22PTS/8REB/6AST/1STL\n\nLAL 📊\nAnthony Davis: 31PTS/6REB/2AST/3BLK\nLeBron James: 23PTS/6REB/2AST/2STL\n\n#NBAnaESPN https://t.co/Xr8SiOsezC",
    "1031": "@BBandough @celtics Him and grant are different positions but he might defend big guys better lol",
    "1032": "Great night watching the rivalry game w pops @celtics https://t.co/TsTp5ByWGJ",
    "1033": "@Lakers Reaction on @Lakers tonight 22 point loss to @celtics: \"Oh well, as long as we make the playoffs i'm good...\" #LALvsBOS #Lakeshow",
    "1034": "@celtics Now go put together 4 straight wins or imma lose ma shit",
    "1035": "Aite I see you @celtics fam 👀 now don't get my hopes up though but shieeeeet what a dub.",
    "1036": "@NBA @celtics AD stats are so empty",
    "1037": "@Lakers continue to play hard enough to get Vogel fired. @KingJames should be player coach like @celtics Russell. #nextlevel #LakersNation",
    "1038": "Not worried. Played well tn. A lot of ticky tack foul calls went the @celtics way. LeBron, AD, &amp; Russ were effective. We’ll scrub the @DetroitPistons &amp; hopefully rattle off a couple wins in a row. https://t.co/L0L6pHGLtf",
    "1039": "@jack_witri @ChrisBrathw8 @Patriots @celtics @Lakers @KingJames @Xavier_Pedro2 Great weekend… I was jealous watching it. Glad you and your Dad made some great memories…. Enjoy them all….",
    "1040": "@dailyameliaa @celtics Yea you are",
    "1041": "@NBABrasil @celtics @Lakers cole @_luizaferreiraa 🤪🤣",
    "1042": "@celtics That's not Paul pierce🤔",
    "1043": "@NBA @celtics He bodied that nigga",
    "1044": "@JoordyTV @celtics cutie",
    "1045": "@LHSCoachDow @ChrisBrathw8 @Patriots @celtics @Lakers @KingJames @Xavier_Pedro2 It was the best time ever til after our first drive",
    "1046": "FINAL \n\nBoston Celtics derrotan a Los Angeles Lakers 130-108 \n\n@AntDavis23 31 pts, 6 reb\n@KingJames 23 pts, 6 reb, 2 stl\n@carmeloanthony 13 pts, 4 reb \n@russwest44 12 pts, 4 reb, 6 ast \n\n• Record: 8-9 #LakeShow https://t.co/shYTcNF2Ur",
    "1047": "Thoughts on Enes Kanter's shoes? ☘\n\n#bostonceltics #eneskanter #celticsdiary https://t.co/47BPBDTu3q",
    "1048": "@NBA @celtics The Russell experiment IS NOT working. I love seeing Russell ball, but him &amp; the Lakers are not working. I know it’s early, but we are losing games against BAD TEAMS who also have new pieces. This is BAD! @Lakers @LakersSBN",
    "1049": "@statmuse @jaytatum0 @celtics @celtics_stats And he's only 19!",
    "1050": "thank you @celtics for not losing this was the best night ever keep fucking up the lakers for me😮‍💨",
    "1051": "@celtics Please keep it up",
    "1052": "Jayson Tatum and the Boston Celtics spoiled LeBron James' return to the Los Angeles Lakers lineup on Friday night.\n\nhttps://t.co/bXhmWzxooN",
    "1053": "Jaylen Brown and some of the @Celtics players are going to eat at R’s restaurant again tonight. I told him to get a picture since he wasn’t there the last time they were",
    "1054": "@celtics Ask him his opinion on Kyle Rittenhouse",
    "1055": "@TrolledByPG @Luka_Donut @statmuse @jaytatum0 @celtics @celtics_stats Asking too much of him",
    "1056": "@NBA @celtics Maybe the lakers have to hit rock bottom for the turn around to happen #SOL",
    "1057": "@McocTafre @celtics @CocoGauff i think he’s good, i just think we’re too deep that he may not get developed properly.",
    "1058": "@celtics you did not disappoint. First game in the Garden was more than I of could hoped for. See you very soon! Go C’s☘️",
    "1059": "@HoopWhs @celtics It was awesome!",
    "1060": "Jayson Tatum takes it all the way to the rim for the and-one bucket in tonight's @JetBlue Play of the Game! https://t.co/nnompXsESm\n\n— Boston Celtics (@celtics) November 20, 2021",
    "1061": "@terrell_isaias @celtics Facts 💯 💯",
    "1062": "Tatum hesitates and drives to the bucket in #PhantomCam.@celtics pick up the win behind his 37-PT performance. https://t.co/rDFh9YCjzn\n\n— NBA (@NBA) November 20, 2021",
    "1063": "Too strong 💪 https://t.co/0LnetKo2Ql\n\n— Boston Celtics (@celtics) November 20, 2021",
    "1064": "@SavannahStriano Great win for the @celtics",
    "1065": "@celtics let’s get healthy🙏🏾 it’s only up",
    "1066": "@KingJames back. @celtics could care less. https://t.co/CWXP8B1Rwp",
    "1067": "@NBA @celtics Enes Kanter owns Lebron",
    "1068": "@celtics 130  @Lakers 108.  Sweeeeet!",
    "1069": "@jamdonohu @celtics Not my favorite player but he did. Doesn’t change my position at all.",
    "1070": "@LHSCoachDow @ChrisBrathw8 @Patriots @celtics @Lakers @KingJames @Xavier_Pedro2 Congratulations you beat Lebron in November in year 19.",
    "1071": "@jtyelland @celtics Smoking that laker pack",
    "1072": "@celtics no pain",
    "1073": "@NBA @celtics This Lakers team was put together with the basketball intelligence of a teenager playing NBA2K22. If anybody is shocked by this mediocre start or still thinks they're going to end the season holding up the golden Larry O'Brien then please seek help.",
    "1074": "@ChrisBrathw8 great week… 2 @Patriots wins and a @celtics win vs LeQuit and the @Lakers @KingJames \n#CityofChampions\n\n@jack_witri @Xavier_Pedro2",
    "1075": "@pgmoney_ @NBA @celtics Win another title??? Let’s start with win another game.",
    "1076": "Always a good night when the @celtics beat the @Lakers 🏀☘️",
    "1077": "@celtics Ha!! Classic move by @cedricmaxwell81 and why he will ALWAYS be one of my favorite @celtics forever!!!!!!",
    "1078": "schroder playing in a role that best fits him in Boston.\n\nCeltics fans wouldn't be big fans if he was getting paid $84m and demanding starting roles https://t.co/hNBnsl0Pc4",
    "1079": "@honestJBfan @celtics LMFAOO",
    "1080": "@celtics HES ONLY 35",
    "1081": "That’s your big bro @AnnaHorford so glad @Al_Horford back home where he belongs with us on the @celtics https://t.co/IDm4B7T1U9",
    "1082": "Go @celtics Lakers must lose! Down with @KingJames",
    "1083": "@Celtics__Pats @celtics L for westbrick https://t.co/qIFXnJJ12u",
    "1084": "@Dr_Ray15 @celtics your favorite player marcus smart had a good game",
    "1085": "@mnooooooooo8 @celtics Celtics playing well? https://t.co/qzpC6tXphR",
    "1086": "@AsahiAko @NBA @celtics Chill lakers was #1 seed and was 57-0 when leading in 4th quarter. And EVERY TEAM they face in playoff had all their stars. And won in 5",
    "1087": "@Robert_Jones44 @celtics LMAOOOOOOOOOOOOO",
    "1088": "Good win @celtics",
    "1089": "@celtics lets goooo",
    "1090": "@NBA @celtics Anthony Davis says 'we (Lakers) can play good D if we want to', Really¿?? I find that hard to believe!",
    "1091": "@celtics Now be consistent",
    "1092": "@celtics It's what happens when you not hoisting up 3's and taking it to the hoop.",
    "1093": "@Celtics__Pats @celtics Rahhh don't tell me that's not edited 😭😭😭🤣🤣",
    "1094": "@DOgemade @NBA @celtics And without Robert Williams",
    "1095": "@celtics we love to see it🖤",
    "1096": "AD on @KingJames:\n\n“He looked great... He had no practice time and came in &amp; had to adjust to what we been doing while he had been out. \n\nJames finished with 23 points, six rebounds, and two assists against @celtics.\n\n#LakeShow #BleedGreen #NBATwitter https://t.co/jUh7Q35FPz",
    "1097": "Jayson Tatum, Celtics torch Lakers in LeBron's return  #NBA\n #celtics #BostonCeltics #Lakers #LakeShow https://t.co/3iOTbr2E06",
    "1098": "Udoka says the team knows it's playing great defense, and it knows it was poised to make more shots. \"We liked the way that we were trending.\"\n\nYup, us too🙋‍♂️",
    "1099": "@celtics Say no more. You already had me at \"best crowd\" 😁",
    "1100": "Now please beat the Thunder and go above .500 tomorrow @celtics",
    "1101": "@celtics This defense is 🔥🔥",
    "1102": "@NBA @celtics Lakers lost to the Celtics without Jaylen Brown?🤣🤣🤣",
    "1103": "@celtics Great #Celtics win against the Lakers! @jaytatum0 with all around game, not only 37 points but also rebounds and assists through the whole game #BleedGreen",
    "1104": "@celtics Nice",
    "1105": "@JustCocoDupree @nickdelpizzahut @celtics gotta love these meaningless hypothetical situations that literally have nothing to do with how the Celtics played tonight 🤷‍♂️",
    "1106": "@NBA @celtics Wow the Lakers are bad.",
    "1107": "@Home_Brodie @celtics YESSIR 🔥🔥🔥🔥",
    "1108": "@celtics We love you jrich",
    "1109": "@celtics Al FOREVER 🍀🍀🍀",
    "1110": "@seancaster24 @celtics @jasontatum0 You tweeting at me like I helped him get 37😭",
    "1111": "@sir_coolmore @celtics @jaytatum0 That is either saying a lot or nothing at all. But I’ll take the green in a 7 game series",
    "1112": "@Que11670156 @celtics Someone sounds upset lol",
    "1113": "@KSite_ @celtics But I tomd them to wash themselves because we all should be washed cause they stink, too",
    "1114": "The @celtics pick up the win at home behind Jayson Tatum’s impressive outing. \n\nJayson Tatum: 37 PTS, 11 REB, 4 3PM\nMarcus Smart: 22 PTS, 8 REB, 6 AST\nDennis Schroder: 21 PTS, 6 REB, 6 AST\nAnthony Davis: 31 PTS, 6 REB, 3 BLK https://t.co/IbrD69lkQX",
    "1115": "@celtics old man al the goat",
    "1116": "@Robert_Jones44 @celtics We do not care",
    "1117": "BRO @celtics MEDIA IS GOATED FOR THIS https://t.co/RQNwKYJPZD",
    "1118": "Ime Udoka says of Al Horford, \"He has fingerprints all over every game. He does so many things for the group.\"",
    "1119": "Ever since @celtics Twitter called out the C’s on how it appeared they’d been ordered by the NBA/China to not play Kanter, Udoka has given the big guy some decent burn. Well done not backing down Ime! Nice effort @EnesKanter! And well done @CelticsCanada &amp; @frostybias!#LALvsBOS",
    "1120": "@celtics Frank vogel is versatile and defensive minded coach, maybe the best coach in the league. His defensive schemes rival greats like Popovich and Phil Jackson. His ability to manipulate the game and makes his players better is unlike any other. Frank Vogel is my Coach of the year",
    "1121": "@MissinKobe @celtics I tried lol 😂😂 https://t.co/6pk42UwKoL",
    "1122": "Josh Richardson may be new to the rivalry, but he already knows that #BeatLA felt extra special tonight https://t.co/ntPs7ITeoF",
    "1123": "@RyJacksBack @MeganWGME @celtics @Lakers Mmmhm exactly",
    "1124": "@ChrisSaysThis @celtics Nice game to be at. I only saw it from a distance at a restaurant, so I couldn’t tell if they finally figured things out offensively or were just hitting their shots while others were standing around. It looked like people were driving to the hoop.",
    "1125": "How about them Celtics. @celtics blow out the lakers behind 37 points from @jasontatum0. @joshuamattewm",
    "1126": "@celtics Great Win Team ☘🍀",
    "1127": "@russellfrost @Lakers @celtics On my Flickr -https://t.co/6NXA1rDFtI",
    "1128": "@sir_coolmore @celtics @jaytatum0 Yeah let’s see where they are in 50 games",
    "1129": "the dagger 🔨 lets go Boston Celtics ☘️ #LakersCeltics #NeverGetsOld #Rivalry #ProudFan #TESDAMAN https://t.co/SDOr98ype0",
    "1130": "Jayson Tatum and the Celtics welcome LeBron and the Lakers to Boston with a 22-point shellacking!\n\nTatum - 37 points\nSmart - 22 points\nSchröder - 21 points\n\n📷 @celtics https://t.co/X8ePtQThiC",
    "1131": "And just like that, “Queen” James loses and the Boston Celtics win!  What a day!! https://t.co/H50ulK0fBZ",
    "1132": "@NBALatam @celtics @Lakers Celtics ☘️",
    "1133": "@celtics worth ruining my sleep schedule 😍",
    "1134": "2012 All NBA 3rd Team \n\nG  Dwyane Wade, Miami Heat \n\nG  Rajon Rondo, Boston Celtics \n\nC  Tyson Chandler, New York Knicks \n\nF  Dirk Nowitski, Dallas Mavericks \n\nF  Carmelo Anthony, New York Knicks \n\nMatthew 4:4",
    "1135": "@celtics If one thing I enjoy is beating the lakers",
    "1136": "@celtics This dude got us going can’t believe a lot of y’all don’t appreciate him https://t.co/sXToWdva64",
    "1137": "Los Angeles Lakers 108 - Boston Celtics 130, Final \n#BostonCeltics #BostonCelticsFanforLife",
    "1138": "LakerLove Boston Celtics' dick https://t.co/He1l95XMQe",
    "1139": "Yeah, the @celtics won!!\n\nBut, cmon! 😟\n\nI'm never taking the under again 😤 @jaytatum0 @smart_MS3 @Al_Horford  @Grant2Will @FCHWPO @FDSportsbook https://t.co/PWlHg3mEi1",
    "1140": "@celtics Beat LA https://t.co/ojVUcumb7i",
    "1141": "@celtics Wonderful victory, guys! 💚\n\n#CelticPride ☘️",
    "1142": "@krishtafc @celtics @JetBlue That’s what I said, yeah",
    "1143": "@celtics Let’s go boys!!!!!! ☘️☘️ @ayyy_lomeli @jonathaaan7",
    "1144": "@celtics @EnesKanter with the BIG W",
    "1145": "Why wasn’t Unc @ShannonSharpe twitting about the @celtics @Lakers game tonight!?  #LALvsBOS",
    "1146": "Tatum drops 37 in the @celtics W! 🍀\n\n11 REB\n3 STL\n64.2 FPTS https://t.co/rmSWOQYELw",
    "1147": "BOSTON CELTICS BASKETBALL. ☘💚 https://t.co/09up5HJ5xh",
    "1148": "@celtics There is no rivalry",
    "1149": "@celtics  winning on #BlueBloods Friday! @DonnieWahlberg, what could be better? https://t.co/Q5s1Elx1I7",
    "1150": "@russellfrost @Lakers @celtics I was at Game 7 at Staples Center, June 17, 2010",
    "1151": "@Margot_Murasz @LastOfDyngBreed @bocxtop @celtics Me who currently lives in Kenosha agrees smh",
    "1152": "@celtics Always love it when the Celtics beat Queen James and the Lakers. \n\nAlso, thanks for giving Kanter some playing time against China’s new native son. #BeatLA #BleedGreen ￼ https://t.co/NppSvS5B2p",
    "1153": "@KSite_ @celtics Bro have you met Boston sports fans, we are some of the most ruthless people ever. If anything, those were true Boston fans",
    "1154": "Great win green🍀🤞🏼 now let’s get healthy and lock in !!! @celtics",
    "1155": "@sirmasterbrown @LastOfDyngBreed @bocxtop @celtics Nice to have some joy in my birth month, with our country going to hell in other ways. https://t.co/DVLgZljK2y",
    "1156": "@celtics @JetBlue That’s what I like to see. More layups and less three point attempts.",
    "1157": "@Luka_Donut @statmuse @jaytatum0 @celtics @celtics_stats Lmao",
    "1158": "@JoeyDelaneyy @celtics This is dumb. Ppl seem to forget that he turned down their offer for 84 mil…",
    "1159": "Good win gang @celtics 💚",
    "1160": "@sir_coolmore @celtics @jaytatum0 Oh your a fan of the Bulls again?",
    "1161": "The Boston @celtics is now on a 2-win streak! Congratulations. 🔥\n\nStream every live game of the NBA 75th anniversary season on any device. Subscribe now at https://t.co/4nYNBsfchU. #GlobeNBA #BestTimeWithGlobe. https://t.co/wHc8JFzDAU",
    "1162": "Good win @celtics https://t.co/gQYVKzDJQJ",
    "1163": "@Robert_Jones44 @celtics Shows what he can do.\nHe has been off target lately but not today.",
    "1164": "Dominant win, @Celtics! Way to #BeatLA by continuing to fight despite the bad 1st quarter! Please rest up and come back strong tomorrow! Keep attacking the paint and continue the great defense! #BeatOKCThunder tomorrow! #BleedGreen https://t.co/tCJeSAgPOJ",
    "1165": "#NBA | FT:\nBoston Celtics 130-108 LA Lakers\nFor more games, visit our site! https://t.co/yUgxWewe0p",
    "1166": "@celtics Great team win tonight",
    "1167": "The Boston Celtics edge out rival Los Angeles Lakers to spoil Lebron James' return. #NBA75\n\nVisit https://t.co/K9jJDOXjil for other updates. https://t.co/O8BvFgVG9n",
    "1168": "@celtics @JetBlue So you chose to post an and 1 play that wasn’t a foul",
    "1169": "@celtics We close a fucking game\nWTF is this",
    "1170": "@steps_26 @celtics @JetBlue @Max_Lederman you are a genius my man hahahahaha",
    "1171": "@NBA @celtics Just big body Lebrun",
    "1172": "@celtics Lets get better off the dub.",
    "1173": "@celtics Lets Go GG Boys 👊🏽",
    "1174": "@celtics Great win tonight against our rival. I must say that this win, along with the players commitment it goes for the great work of our coach Ime Udoka, who recognized our defense problem in the first quarter and made the right adjustments to improve the defense and win the game",
    "1175": "LETS GO!!!!! @celtics 🍀",
    "1176": "@celtics Team were hungry for the win and played great.\nAbout time though.\nNeed to be more consistent.\nTwo games which are very winnable at home before Nets.",
    "1177": "@celtics Yesirrrrr! 💪🏽☘☘☘☘☘",
    "1178": "@celtics You just did https://t.co/yzwf9BESlQ",
    "1179": "@celtics Tatum masterclass",
    "1180": "#NBA | FT:\nBoston Celtics 130-108 LA Lakers\nFor more games, visit our site! https://t.co/BTVM6CiMww",
    "1181": "Boston Celtics News - @celtics starting 5 for tonight's game with the L.A. Lakers. #bostonceltics #celtics #bostonathletes #basketball #boston #NBA #NBA75 #bostonsports #bostonathletemagazine https://t.co/mzZ4XnuvFT",
    "1182": "@NBCSBoston stating the FACTS! #celticslakers #Celtics @celtics https://t.co/WCGBPd2D1E",
    "1183": "@celtics Little bro @Lakers",
    "1184": "@celtics @JetBlue Play like this every night please.I beg🙏",
    "1185": "@KSite_ @celtics He was acting like it, shooting 39% will do that. He looked aggressive tonight",
    "1186": "@celtics Coaching tough",
    "1187": "Here is how the Los Angeles Lakers graded individually in a bad loss to the Boston Celtics.  https://t.co/xTnHXuSCvG",
    "1188": "How's your super team @Lakers ? @celtics beat LA yet again! #BleedGreen @EnesKanter nice kicks! https://t.co/7TzqAn5Kdc",
    "1189": "🤖 #SofiAlert \n📅 19-11-2021 \nLos Angeles Lakers - Boston Celtics \n🛋 4.1/5 Sofis https://t.co/Ri0I5UAL1O",
    "1190": "Boston Celtics cruise past LA Lakers 130-108 Jayson Tatum 37points 11rebounds 2assists.",
    "1191": "@celtics ratio https://t.co/VMzMiXKSFg",
    "1192": "@Becoming_Bryna @celtics Flat out housed them.",
    "1193": "So, Last 3 #LakeShow Watchalongs at @SarcasmCityTV \n\nvs Chicago Bulls ❌ L 121-103\nat Milwaukee Bucks ❌ L 102-109\nat Boston Celtics ❌ L 108-130\n\nThat's a New Record, Right?👀👀 https://t.co/SrVl2FkiyW",
    "1194": "@eslow_x I got the idea from laker fans earlier. They were doing a “fuck the Boston Celtics, pass it on” 😂😂😂",
    "1195": "@celtics @JetBlue Give him a blank check Wyc",
    "1196": "@celtics @JetBlue and then he killed Al’s hand",
    "1197": "@celtics The C's will always be @Lakers' dad . 😘 https://t.co/7kXTILRp0L",
    "1198": "@celtics with no chill https://t.co/LkfF5W8r9Q",
    "1199": "@celtics The greatest 💚💚 https://t.co/6stleI0kFh",
    "1200": "Jayson Tatum takes it all the way to the rim for the and-one bucket in tonight's @JetBlue Play of the Game! https://t.co/o9iivQVGxa",
    "1201": "@celtics Of course y’all shoot lights out against the lakers https://t.co/KZra9HDSdb",
    "1202": "@DJJenkins So glad they were playing the @celtics",
    "1203": "@frostybias @ghenderson43 Will always love Gerald for saving @celtics in 1984 NBA Finals!!!!",
    "1204": "@celtics You love to see it",
    "1205": "Boston Celtics player Enes Kanter wore sneakers tonight — while playing against the Lakers — with LeBron James bowing down while China’s dictator puts a crown on his head. https://t.co/E1L4ZyPWrF",
    "1206": "@ffsEwan @celtics game started 30 mins after im counting it",
    "1207": "@JSekyere @Lakers @celtics @NBA @Spalding @TISSOT @BioSteelSports @tdgarden @OnlyInBOS @ESPNNBA @Jumpman23 @NikeLA @bibigoUSA @Vistaprint @Sterling_Co_ #Final #LakeShow 108-130 #BleedGreen with @jaytatum0 as the #MVP of the game #NBAxESPN with @MikeBreenOnESPN &amp; @CassidyHubbarth #Adele30 @StateFarm https://t.co/YPEBpQY37w",
    "1208": "@dennis_p @Lakers @celtics I’m so old I was there the last time two clashed for the big title.",
    "1209": "@AstolfoR21 @celtics Most def ! 💯",
    "1210": "@celtics thank you for making my day 🙏",
    "1211": "@celtics Best I've seen them shoot all year",
    "1212": "@celtics Thank you for this one, keep it going",
    "1213": "@celtics No Celtics fan should have more than 37k followers, we have millions of daily super active users on Twitter!\n\nRETWEET,  FOLLOW US.. drop ❤ let's get more active Celtics mutuals",
    "1214": "@celtics LAKERS PACK IS HITTIN 🔥💯 https://t.co/IhFmU7D9pI",
    "1215": "@K843_T @celtics Romeo Langford clamping Lebron",
    "1216": "@Ramos_Zeek @celtics Anytime brotha we are gonna catch that game live sometime!",
    "1217": "It looked like the Lakers had the upper hand in the first half, but @celtics turned it around and blew out Los Angeles.\n\nOklahoma City tomorrow night! https://t.co/XVMIxwCtDz",
    "1218": "@celtics TaGOAT 37 point game😍😍😋😋 https://t.co/3Ua2DSfmXX",
    "1219": "@wwfcjoe_ @celtics But they won the day after?",
    "1220": "@celtics BEAT L.A.!",
    "1221": "@celtics Lakers: Patriots!\n\nCeltics: Steelers or Packers!",
    "1222": "Celtics (-2.5) blow by the Lakers in Lebron's return from injury 😳\n\nThe Lakers are now under .500 at 8-9\n\n(Via @celtics)\n\nhttps://t.co/sxJ8y3Usaz",
    "1223": "@celtics Good win",
    "1224": "@celtics good shit",
    "1225": "The best kind of night in 🏀. The @Lakers lose and the @celtics are the reason why 😁💚🏀 #beatla https://t.co/qruw2pV0Hd",
    "1226": "@ShannonSharpe  hey👨🏽‍🍳 Unc I’m going to need a 🔥special from #ClubShay after your @Lakers got served a 22 pt 🦶 from my\n @celtics ☘️ \nI’m going to need that #Tatum024 \n37🔥(W)ings,11 Redbone Rebound Ribs,&amp; 2 biscuit Assist w/ gravy!  \n\nI’ll take it to go on @undisputed",
    "1227": "@celtics AIN'T NO STOPPING US NOW https://t.co/ElCayDVswh",
    "1228": "ENCERRADO: o Boston Celtics (8-8), em casa, venceu o Los Angeles Lakers (8-9) por 130 a 108. #BleedGreen\n\nTATUM: 37PTS, 11REB &amp; 3STL.\nSmart: 22pts, 8reb &amp; 6ast.\n\nAD: 31pts, 6reb &amp; 3blk.\nLeBron: 23pts, 6reb &amp; 2ast.\n\n#NBA75 https://t.co/XgCq7bgH5O",
    "1229": "@celtics what's that nickname about? 🤣🤣",
    "1230": "@celtics No pain no pain no pain",
    "1231": "thanks for the birthday W @celtics 💚",
    "1232": "@celtics Too easy",
    "1233": "@AllenSliwa Boston Celtics were without Jaylen Brown too.",
    "1234": "@celtics Cursed Image https://t.co/BZQ2z9pE96",
    "1235": "@celtics best game yet",
    "1236": "@celtics easy",
    "1237": "@celtics Cmon  ☘️💚☘️💚☘️💚☘️💚",
    "1238": "@NBA @MatiJankowski @celtics beautiful",
    "1239": "@celtics \nTHANKS!\n\nBEAT LA!!\nBEAT LA!!\nBEAT LA!!\nBEAT LA!!\nBEAT LA!!",
    "1240": "@celtics You know what?\nIt was worth it staying up until 4 in the morning.\nGood night!",
    "1241": "@NBA @celtics people will say bron made the east his. well tatum was 18 then , giannis was 21 and now lebron's 36 and tatum and giannis are entering their primes. 💀💀💀",
    "1242": "@celtics This is the team I’ve been looking for. I’m proud of y’all. Keep it going.",
    "1243": "Kudos #LALvsBOS Score\n\nLos Angeles Lakers\n108\n\nBoston Celtics\n130\n\nFinal",
    "1244": "@celtics This is how we should play every night, good ball movement and defense!",
    "1245": "@celtics Jayson Tatum owns lemickey",
    "1246": "@celtics The LA Fakers got exposed tonight",
    "1247": "Hey @ClayTravis - trying to get caught up and was looking at @espn for some hard hitting options on @EnesKanter since they showed @Lakers vs @celtics. Didn’t see much. Did I miss an official in game statement? 🤷🏻‍♂️",
    "1248": "@celtics I LOVE YOU",
    "1249": "This was going to be the year for Boston sports schadenfreude. The @RedSox were going to stink. The Brady-less @Patriots started 2-4. And the @celtics struggled mightily out of the gate, but just steamrolled some team from LA tonight. Sorry, folks. Throw your shade elsewhere.",
    "1250": "@celtics My Hero😍 https://t.co/ZEQBuXyAoD",
    "1251": "@celtics Without brown and Williams too betttt",
    "1252": "@celtics We got the W and proved the naysayers wrong!!! Let's keep this momentum going and please come back JB!\n\nLet's go Celtics!!!",
    "1253": "@celtics We also own LeNotAsGoodAsTatum",
    "1254": "@celtics Now that was big time!!! Keep it up 😍🔥",
    "1255": "@celtics Owns The Lakers https://t.co/BgJ7OlL6aw",
    "1256": "@celtics Keep playing like this moving forwards https://t.co/zFo7AzWT0Y",
    "1257": "@celtics give Schroeder his bag idc",
    "1258": "My gf can’t name more than three players on the @celtics but you better believe she knows who Deuce is @jaytatum0",
    "1259": "@celtics LAKERS PACK WATCH https://t.co/GDBzerIznD",
    "1260": "@Lakers forward, @KingJames entered tonight's game with a career road record of 11-13 against the @celtics, #LeBron picked up his 14th career road loss against the #Celtics, in #gematria \"LA\" sums to 14. #BoKnowsGematria #LakeShow #NBA75 https://t.co/qJzr1kThC8",
    "1261": "@celtics LA is a retirement home and Tatum owns Lebron",
    "1262": "@celtics The Celtics when they have to beat LA again: https://t.co/3NZ4CVZbUj",
    "1263": "@celtics Best W this year",
    "1264": "@celtics i love u",
    "1265": "@celtics BEAT LA ☘️☘️☘️☘️☘️☘️☘️☘️",
    "1266": "@jsecher Could not have asked for a better game from @celtics tonight without Brown and Williams!!!!",
    "1267": "@celtics Celtics when playing primetime games https://t.co/Dh7kU2eDTu",
    "1268": "@celtics ☘️FUCK THE LAKERS☘️ https://t.co/f6H3WFfJBj",
    "1269": "@celtics I was told by “fans” that Tatum was washed??? 🥴🥴",
    "1270": "@celtics Lakers suck",
    "1271": "@celtics BIG W GOOD STUFF",
    "1272": "ISSO BOSTON CELTICS VADIAAAAA",
    "1273": "@celtics Tatum outplaying Lebron and AD https://t.co/yw9yvO1xxe",
    "1274": "@celtics @Jasonms316 Celtics win! #BeatLA",
    "1275": "What a great @celtics win! Even better beating Lebron and company at home 💪🏼 #BleedGreen",
    "1276": "@celtics Props to Lebron! he’s come a long way to be playing against his idol 👏  must feel special https://t.co/9AD9YkKGGG",
    "1277": "@celtics BIG WIN. MUCH NEEDED W! LAKERS SUCK. TATUM IS A BEAST! LETS GO BOYS!",
    "1278": "@celtics Not pain",
    "1279": "@celtics Play @EnesKanter . @NBA  @dbongino",
    "1280": "@anggelohenry @NBABrasil @celtics @Lakers Hahaha",
    "1281": "I love when the Boston Celtics beat the LA Lakers. Probably one of my favorite things in sports",
    "1282": "Rivalry Night W ✅ https://t.co/o6aTuMdV6q",
    "1283": "@celtics Great last quarter!! Love it still (since ‘80’s!)when Boston green beats L.A.!!! Neva eva gets old! Though King James’s arrogance does!! Ya ya he has a right to b….no, he’s a great player but very babyish, bossy, when getting beat! Tatum is a beast!",
    "1284": "Great win 🍀🍀🍀💯💯@celtics",
    "1285": "LET'S FUKING GO💯💪💪💪🍀🍀🍀 #BostonCeltics",
    "1286": "@NBA @celtics Give way LeBron for the young super stars...",
    "1287": "@celtics Yup PP hit it deep huh 🤣",
    "1288": "@AProskauer @celtics He likes the indoor plus lebron and Westbrook are left outside in the cold",
    "1289": "@celtics NICE WIN GUYS💚💚💚💚💚🔥",
    "1290": "Josh Richardson - Boston Celtics\n15 PTS\n4 RBD\n[FD(19.8) DK(20.5)]",
    "1291": "Marcus Smart - Boston Celtics\n22 PTS\n8 RBD\n6 AST\n1 STL\n1 TO\n[FD(42.6) DK(43)]",
    "1292": "Dennis Schroder - Boston Celtics\n21 PTS\n6 RBD\n6 AST\n4 TO\n[FD(33.2) DK(36)]",
    "1293": "Jayson Tatum - Boston Celtics\n37 PTS\n11 RBD\n2 AST\n1 BK\n3 STL\n1 TO\n[FD(64.2) DK(64.75)]",
    "1294": "@NBA @celtics Lakers look dysfunctional right now. Something needs to change if they want to win another title",
    "1295": "MONEY OVER MORALS @CELTICS WHOOPED DAT ASSSSS",
    "1296": "@OfficialNBARefs @Lakers @celtics @ESPNNBA Bulls are getting mauled by Denver tonight, and no fucking foul calls mannnn! Do your fucking job right, and not half assed… SMH",
    "1297": "Great win @celtics ☘️🤟🏾",
    "1298": "@NBA @celtics His fine azz is rude for beating us",
    "1299": "@Lakers 8-9 courtesy of @celtics. https://t.co/cdsuUEyKWS",
    "1300": "FINAL SCORE: Lakers 108, CELTICS 130\n\nThe Los Angeles Lakers (8-9) fell below .500 tonight as they got dismantled by the Boston Celtics (8-8) in LeBron’s return.\n\nAD: 31 pts, 6 rebs, 2 asts\nBron: 23 pts, 6 rebs, 2 asts\nMelo: 13 pts, 4 rebs https://t.co/jkXnTz9Ycy",
    "1301": "@NBA @celtics He owns DaytoDayvis",
    "1302": "@NBA @celtics Lakers are garbage",
    "1303": "@MeganWGME @RyJacksBack @celtics @Lakers The Celtics are undefeated with @MeganWGME in attendance. https://t.co/zuK5LSsYAZ",
    "1304": "@NBA @celtics You're black",
    "1305": "Boston Celtics 🍀\n130 x 108\nLos Angeles Lakers 🟡🟣\n🏟️ TD Garden\n📍 Boston , USA 🇺🇲\n🏆 NBA Regular Season https://t.co/TNddyTjUrD",
    "1306": "@NBA @celtics He clears LeFlop",
    "1307": "@NBA @celtics Lakers: Patriots!\n\nCeltics: Steelers or Packers!",
    "1308": "Thank you @celtics ☘ https://t.co/x4JmAp0Y5u",
    "1309": "@Lakers @celtics yo, they called everything on the @Lakers. It was getting hilarious actually",
    "1310": "Tatum hesitates and drives to the bucket in #PhantomCam.\n\n@celtics pick up the win behind his 37-PT performance. https://t.co/jUrarjXCEu",
    "1311": "Great game  @celtics  you put  lakers in the trash they truly deserve that\n\n#easywin",
    "1312": "@celtics down 2 starters &amp; we handled business. That’s how you play! https://t.co/fVrT4yv9T3",
    "1313": "@AstolfoR21 @celtics My sad about not making it fam we can link tomorrow",
    "1314": "@Margot_Murasz @LastOfDyngBreed @bocxtop @celtics November wins. A Boston fans favorite 😂",
    "1315": "@KingJames my gosh you stink dude! Your team is trash go @celtics!!!!!",
    "1316": "@Loui7e @celtics He’s a clutch player, great pg, with depth. Hopefully udoka plays him more sooner than later",
    "1317": "@celtics may just be at .500, but blowing out LBJ and the @Lakers feels sooooooo good! #BleedGreen",
    "1318": "See how much they were missing lebron...\n\nGet a summary of the Los Angeles Lakers vs. Boston Celtics basketball game https://t.co/zuEmXAg6R9\nvia @ESPN App https://t.co/u3WUJA7i7d",
    "1319": "@celtics Route to route after that first",
    "1320": "Good win @celtics",
    "1321": "@celtics Right when PP came in I need he was going to shoot it in from deep!",
    "1322": "A great win for the @celtics tonight in another chapter in the Boston and L.A. rivalry. I’m hella happy that the Celtics won! 🙏🏽🙌🏽☘️🍀🏀 #Celtics #CelticsNation #BleedGreen #BeatLA #CelticsvsLakers",
    "1323": "@smarshxo @celtics Great win tonight",
    "1324": "@sirmasterbrown @LastOfDyngBreed @bocxtop Just gonna consider it my birthday 🎁 from the @celtics 😎 This is delicious. #BleedGreen https://t.co/QzABwCtRZF",
    "1325": "BOSTON CELTICS. https://t.co/tLqIAb0cgl",
    "1326": "Lakers is my left egg\n@celtics ✌🏻",
    "1327": "@celtics glooking out I didn’t watch it at the crib anyways so my tv safe regardless",
    "1328": "And did he go off in style for @celtics today. 🙌 https://t.co/EDY7S5XWYD",
    "1329": "@CSmoove_Sports Vogel not to blame for this failure. 😀😀😀 You got a damn Big-3 and the Boston Celtics are missing Jaylen Brown, you should win on talent alone . Lebron screwed up and chose Russell Westbrook when all conventional wisdom said it was a horrible fit.",
    "1330": "My guys @celtics #greatwin",
    "1331": "@J0rDAn_______ @RealBillRussell @tdgarden @celtics @Lakers @NBA @ESPNNBA @espn @BostonGlobe How’s this going?",
    "1332": "Thanks @celtics! ☘️☘️☘️ #BleedGreen",
    "1333": "Four takeaways as Boston Celtics beat Los Angeles Lakers 130-108 as Jayson Tatum outduels LeBron James https://t.co/4mxCEKPyDJ",
    "1334": "No Jaylen Brown, no problem. @celtics still dominate the Lebron Lakers",
    "1335": "@ESPNPR @tdgarden @ESPNNBA @stephenasmith @RealMikeWilbon @JalenRose @Espngreeny @wojespn @Lakers @celtics @dallasmavs @Suns Hey @JalenRose Jacob Blake is not dead ! Educate yourself before going on live tv",
    "1336": "@celtics And that’s a Laker full roster, and Celtics without Williams and JB. This teams gonna be dangerous. There’s a lot of basketball left.",
    "1337": "FINAL : Boston Celtics 130-108 LA Lakers https://t.co/ei2YMwq73X",
    "1338": "Good win @celtics",
    "1339": "It’s not looking good at all for the lakers you let a struggling Boston Celtics who are just as desperate as you right now steam roll you.",
    "1340": "@BBandough @celtics a great year, and could be getting better if he got more playtime",
    "1341": "Blow out! blow out!! @celtics thank you for bringing this home easy 🍀💎",
    "1342": "@BleedGr84047144 @PeteyDoe @NBA Lets go @Celtics",
    "1343": "@celtics PRITCHARD🔥🔥🔥🔥🔥🔥",
    "1344": "I know it was only the Lakers, but a win is a win for @celtics",
    "1345": "The @celtics are 6-3 over the last 9 games. Maybe they are starting to put things together.",
    "1346": "what a big win! well done @celtics 👍🏾",
    "1347": "Great win @celtics 💚",
    "1348": "@celtics More performances like these please.",
    "1349": "What a fantastic win by the @celtics vs @Lakers at @tdgarden @celtics are legit!!! And that was without @FCHWPO and Rob Wiliams. 💚☘️💚☘️💚☘️",
    "1350": "@_nahhorne @celtics @CocoGauff But he sucks.",
    "1351": "Good win @celtics",
    "1352": "@celtics no way enes kanter and dwight howard just traded 3s in an nba game 😂😂",
    "1353": "BEAT LA ☘️ @celtics #BeatLA #BleedGreen",
    "1354": "The @celtics picked a good day to bring their A game.",
    "1355": "Only part I liked about tonight’s @Lakers vs @celtics game was @DwightHoward hitting a 3 near the end of the game! We will get em next time #LakeShow",
    "1356": "It was painful Watching @Lakers vs @celtics",
    "1357": "Boston celtics ☘🏀👏🏼",
    "1358": "whooped the lakers ass 👏🏾 #bostonceltics🍀",
    "1359": "Yey they #BeatLA!! Great great win against our rival @celtics!! ☘️☘️☘️",
    "1360": "@Loui7e @celtics He was doing great last year. Idk why  they’d limit him so bad this year",
    "1361": "@celtics \nFive hunnit. Ok. Let's gooo. \n\nGrind.",
    "1362": "BOSTON CELTICS WIN KKKKKK https://t.co/TiupYq2vFe",
    "1363": "@celtics You did not just say pp from deep",
    "1364": "@CShredwards @celtics Shouldnt it be the other way around?",
    "1365": "Thats what im talking bout! @celtics 💪🏾👌🏾",
    "1366": "Goood win!!!!! @celtics 🍀🍀🍀🍀🍀🍀🍀🍀🍀🍀🍀🍀🍀",
    "1367": "Congratulations to the Boston Celtics fans on your win tonight over the Lakers.  Get home safely.",
    "1368": "@celtics what",
    "1369": "@RealBillRussell @tdgarden @celtics @Lakers @NBA @ESPNNBA @espn @BostonGlobe Thank you Mr. Russell for the love for Kobe",
    "1370": "BOSTON CELTICS WIIIIIIIIIIIIIN",
    "1371": "@MostDope_13 @celtics Aye!! MOLLY WOP!!!!! I said what I said…. And we was missing Brown and Williams.",
    "1372": "BOSTON CELTICS WIN ☘️☘️☘️☘️☘️☘️☘️☘️☘️☘️☘️",
    "1373": "Thanks for the dub🙏🏾 @celtics",
    "1374": "ily guys @celtics",
    "1375": "BOSTON CELTICS BASKETBALL!!!",
    "1376": "@celtics needs more minutes",
    "1377": "@celtics Lakers rn: https://t.co/T6KmP455Vk",
    "1378": "@_nahhorne @celtics @CocoGauff Sick! I’ll do apoc if I get enough from the offers, heavy lifter for me in AW",
    "1379": "Bum ass Lakers, go @celtics 🍀",
    "1380": "Boston Celtics Moneyline-135 [3]💰 https://t.co/Ite4sqgSWs",
    "1381": "@celtics Is it wrong to not really care about any wins except against the Lakers, Bulls, and Pistons?",
    "1382": "Big @celtics Win!! Love beating the @Lakers and @jaytatum0 is officially back!! #BleedGreen https://t.co/dPR3KAavMr",
    "1383": "boston celtics stan account",
    "1384": "@papi_oso_ @celtics Welcome",
    "1385": "Is Nia Long at the game??????? That's all that I need to know @Lakers @celtics @NBA https://t.co/N1qXdhpAW7",
    "1386": "Nothing better than the @celtics dusting the @Lakers \n\n#Celtics",
    "1387": "Dear @celtics please remember you can play like this! 🔥🔥🍀🍀",
    "1388": "@celtics PP FROM DEEP",
    "1389": "O COLOSSAL BOSTON CELTICS",
    "1390": "I love y’all @Celtics ☘️",
    "1391": "@statmuse @jaytatum0 @celtics @celtics_stats And some of these idiots said trade him 2 days ago 🙄🍀",
    "1392": "@RatioedByLakers @statmuse @jaytatum0 @celtics @celtics_stats he rather embarrass yall",
    "1393": "O BOSTON CELTICS TRANSA",
    "1394": "@statmuse @AKAJQ @jaytatum0 @celtics @celtics_stats I still have faith that @jaytatum0 will be in the pantheon of Bird and @RealBillRussell when his career is over!!!!",
    "1395": "My @celtics smashing the lakers w/o Jaylen. https://t.co/hBzmnFl7iu",
    "1396": "Good shit @celtics .. fuck the lakers!!",
    "1397": "Thank you @celtics for beating the Lakers tonight 👍🏼",
    "1398": "Boston Celtics ??",
    "1399": "@celtics thanks for winning on my birthday and blowing out the @lakers! #BEATLA 🎉🎊🥳👏🏼👏🏼 #celticstalk @jaytatum0 @smart_MS3 @al_horford @yeahyeah22 @Grant2Will",
    "1400": "@LoudPaacck @celtics W then",
    "1401": "I can sleep with a smile tonight. Thank you @celtics ❤️🥰",
    "1402": "@celtics LeBron rejects like Schroder, Ball etc do well wherever they go. It must be him. Great players bring out the best in others",
    "1403": "@celtics Better than LeBrOn",
    "1404": "And the slightly-less-mediocre bragging rights go to..... the Boston Celtics!!",
    "1405": "@celtics Better than Westbrick",
    "1406": "The best team in history @celtics defeats the second best team @Lakers\n\n@NBA",
    "1407": "There is nothing like watching the Boston Celtics beating the Los Angles Lakers as a Boston Celtics fan",
    "1408": "1. Portland Blazers\n2. Boston Celtics\n3. Detroit Pistons\n4. Orlando Magic\n5. Nola\n6. Los Angeles Lakers\n7. Houston Rockets\n~\n~ https://t.co/ZGH7kR6YlY",
    "1409": "Always nice seeing my @celtics beating the @Lakers",
    "1410": "@celtics He back?",
    "1411": "BOSTON CELTICS. #BLEEDGREEN",
    "1412": "@celtics Goat",
    "1413": "@celtics Pp go deep",
    "1414": "PP from DEEP https://t.co/WwsQr0ygzy",
    "1415": "Let’s go @celtics  these @Lakers are horrible!  When heart meets arrogance!",
    "1416": "BIG win by the C’s tonight !!! 🍀🍀🍀🍀🍀🍀🍀🍀🍀🍀🍀🍀🍀🍀 @celtics",
    "1417": "Let's go Celtics #BostonCeltics",
    "1418": "@Lakers  😪 We lost\n@celtics \n'                       \\ 🏀 /\n'                  🏀   ----\n'              🏀\n'            🖐           \n#NBAxESPN  #NBA #NBA75 https://t.co/opFB8U7UE1",
    "1419": "@statmuse @jaytatum0 @celtics @celtics_stats No one cares poverty franchise.",
    "1420": "Boston Celtics are handling business.",
    "1421": "@CoudereauJulien @celtics What’s his stat line tonight?",
    "1422": "@GottliebShow But @celtics should have been wearing their traditional classic home white uniforms tonight!!!!",
    "1423": "@celtics tatum got me erect",
    "1424": "This Boston Celtics team has been average in the games they have played,but once they faced the Lakers they had their best game\n#LakeShow",
    "1425": "Free Gino @celtics",
    "1426": "Blowout de @celtics a @Lakers con todo y @KingJames en cancha https://t.co/bN83vRBdBZ",
    "1427": "Pritchard doesn’t play enough #celtics #bostonceltics",
    "1428": "@McocTafre @celtics @CocoGauff also your acct is nice, gonna r4 herc this week",
    "1429": "@Kc4Tw @Luka_Donut @statmuse @jaytatum0 @celtics @celtics_stats He’s not washed lil bro",
    "1430": "Great to have @Celtics #BeatLA with great defense, attacks to the paint and a lot of hustle plays! Light up that cigar, @RealBillRussell @paulpierce34 and @cedricmaxwell81! 😉 #BleedGreen #LALvsBOS",
    "1431": "2021-22 @Lakers have 6 active players tonite w/more career regular season NBA GAMES PLAYED than Bird (897) or Magic Johnson (906):\n1. L. James :1317\n2.C. Anthony:1208\n3.D. Howard:1197\n4.R. Westbrook:960\n5.D. Jordan:946\n6.R. Rondo: 930 *(Horford 894 reg season gms leads @celtics)",
    "1432": "@LoudPaacck @statmuse @jaytatum0 @celtics @celtics_stats -has a crush on Lebron",
    "1433": "@statmuse @jaytatum0 @celtics @celtics_stats Better days ahead for us championship season come on lakers 🔥🔥",
    "1434": "HUGE DUB @CELTICS",
    "1435": "@statmuse @jaytatum0 @celtics @celtics_stats ofc he wanna have a career night against us",
    "1436": "@McocTafre @celtics @CocoGauff calm down, he’ll be fine",
    "1437": "@statmuse @jaytatum0 @celtics @celtics_stats Lakers fans right now https://t.co/yG369SQrIZ",
    "1438": "@Luka_Donut @statmuse @jaytatum0 @celtics @celtics_stats Blame LeBron for being washed",
    "1439": "@Luka_Donut @statmuse @jaytatum0 @celtics @celtics_stats Of course you’re a Lakers fan bronseuxal",
    "1440": "@GottliebShow They look a lot better to me since @celtics are smoking the Lakers!!!!",
    "1441": "@statmuse @jaytatum0 @celtics @celtics_stats Love to see lakers downfall",
    "1442": "Get that Turkish fuck off the court please @celtics",
    "1443": "@statmuse @jaytatum0 @celtics @celtics_stats Owns LeFraud",
    "1444": "@statmuse @jaytatum0 @celtics @celtics_stats owns the Lakers",
    "1445": "Was tweeting this all I had to for @celtics to play good basketball?! My bad, #celtics nation. I should have done this like 10 games ago. Last 3 quarters vs Lakers has been quite enjoyable ☘️ #BleedGreen https://t.co/AvyzDQZSQ3",
    "1446": "@celtics On the pregame Max said he'd rip the cigar if this happened. Love that he followed through",
    "1447": "The Lakers losing is one thing, it's another when they lose to their most hated rival in the Boston Celtics\nThis lost hurts A LOT\nAlso Dennis Schroeder beating the Lakers is adding insult to injury",
    "1448": "@NBA @DONFREDSTLOT @celtics @Lakers King Lebron 🔥",
    "1449": "@statmuse @jaytatum0 @celtics @celtics_stats Two legends",
    "1450": "Can we PLEASE stop calling @Lakers vs @celtics a \"rivalry\"? Yes, they've played in the Finals many times, mostly before most of us were born, but they're not in the same division, or even the same conference, and only play a few times a season...@ESPNNBA @NBA🏀",
    "1451": "@statmuse @jaytatum0 @celtics @celtics_stats Lakers vs the refs. \n\nThey’re not even hiding it anymore.",
    "1452": "Hate seeing my @Lakers lose, but when it's to the @celtics it just... https://t.co/iUtRp1CYBa",
    "1453": "Channeling @treykerby when I say that the @celtics are BACK!",
    "1454": "@Home_Brodie @celtics That",
    "1455": "Boston Celtics dominating the Lakers tonight...\n#Celtics \n#BleedGreen",
    "1456": "@celtics One of the best rivalries in the NBA🏀",
    "1457": "@celtics A great team effort. \nAbout time mind you.\nThey looked hungry to win. \nLet's get back over 500 with two win games surely at home v OKC and Rockets.",
    "1458": "@nickdelpizzahut @celtics I always think of that before I go to sleep",
    "1459": "@celtics LETS GO HOMETOWN!!! #BleedGreen",
    "1460": "Lebron and the Lakers can suck it!!!  Nice game @Celtics!! #LALvsBOS",
    "1461": "@celtics Celtics owning the Lakers what’s new??🤷‍♂️",
    "1462": "@CelticsRiley I thank God cause I prayed for @celtics @jaytatum0 to comeback to us and play like the real Tatum used to play and guess what he is back 🙏🏻🤣😂🤣 #BleedGreen #Celtics",
    "1463": "Good win Boston #Celtics",
    "1464": "@celtics I thought the Lakers were supposed to be good???",
    "1465": "@celtics Woowwwwwww",
    "1466": "@celtics WHY CANT WE PLAY LIKE THIS MORE OFTEN",
    "1467": "The Boston Celtics rn: https://t.co/0wFt9369oy",
    "1468": ".@celtics GIVE US GINO",
    "1469": "Tatum making these vets look old and slow #bostonceltics",
    "1470": "@celtics BEAT LA",
    "1471": "@celtics TOO STRONG🔥🔥🔥🔥🔥",
    "1472": "Lakers fans seeing the Boston Celtics just dominate the 2nd half like https://t.co/d5fwzq21FT",
    "1473": "Good job @celtics",
    "1474": "Rivalry is alive even in the media section 😂😂😂\n\n#BEATLA https://t.co/qqhAXoUnKP",
    "1475": "@celtics Sick of this. Play Pritchard!!",
    "1476": "This is fun @celtics 🙌🏼 let’s do this more. JT lookin’ goooood",
    "1477": "And the Queen has exited the floor and taken her slippers off in disgust with the @Lakers getting blown out by the @celtics  #embarrassment #playdefenseforonce",
    "1478": "C'Mon! FACTS! \"Beat LA\" never gets old if you're a lifelong @celtics fan! #BOSpoli #MApoli",
    "1479": "20 point lead now, 120-100! @Celtics definitely #BeatLA! 😤💪🏾☘️🏀💚 #BleedGreen  #LALvsBOS",
    "1480": "Thank you @celtics #BeatLA",
    "1481": "How bout them @celtics ☘️\n#BeatLA https://t.co/uBWwHYN3vY",
    "1482": "Nobody does the “Beat LA” chant better or pisses me off more than the Boston Celtics. When other teams do it, we just shrug our shoulders.",
    "1483": "@aja_f94 @celtics AMAZING!!!!💚",
    "1484": "Does anyone wanna tell the 2021 @celtics fans that \"Beat LA\" was a chant born of losing?",
    "1485": "@terryjt1 @SteveFlorio2 @celtics Wild! Tatum has looked like Tatum as soon as Rob went down. Sucks that's the case. Need Rob off the bench playing in the Jaylen led rotations. \n\nVery observant.",
    "1486": "@celtics Letsssss gooooooo",
    "1487": "@celtics why are the starters still in ? Up by 20",
    "1488": "BOSTON CELTICS.",
    "1489": "@celtics Up by 21 with four mins left!!! Go Celts!!",
    "1490": "@OfficialNBARefs @Lakers @celtics @ESPNNBA Should be fired they helping the Celtics",
    "1491": "@ShaneG1621 @celtics Best!!",
    "1492": "@Lakers can't even rebound without fouling. 🙆‍♂️🙆‍♂️🙆‍♂️\n@Celtics lead 120-100\n#lakeshow will go below .500 after tonight's game.\nExactly where the constructors of this dysfunctional team thought we wouldn't be.",
    "1493": "Beat LA #NBA #Bostonceltics",
    "1494": "Is Rittenhouse in @KingJames  head?? Down 20 to the @celtics wow",
    "1495": "How about the Boston Celtics! They are playing against a veteran all-star team in the Lakers, without two of our key players in Rob Williams and Jaylen Brown! Very proud of how they’ve competed! #BleedGreen",
    "1496": "@CantSeeMyEyes @celtics The way lakers are playing, they deserve to be routed",
    "1497": "Big Al #bostonceltics",
    "1498": "@dbuchananxx @celtics Exactly consistency is key?",
    "1499": "Run it up @celtics",
    "1500": "BEAT LA @celtics",
    "1501": "@celtics Yo where all you #tradetatum fair-weather flogs gone???",
    "1502": "@celtics I can't believe many experts picked the Lakers to go to the Finals. I don't think they'll even win their division. At best they are a \"Play-in\" team. Could possible miss the playoffs. Players too old. If this team was 5 years younger per player then we'd have a real story.",
    "1503": "@OhMi1999 @celtics Ithink he heard you!",
    "1504": "Yessir Jayson bout time @celtics",
    "1505": "@paulpierce34 should be a commentator for @celtics that would be awesome.",
    "1506": "@celtics Tatum showing emotion?? https://t.co/aC2nquOdGV",
    "1507": "@34PAULPlERCE free season tickets NOW @celtics",
    "1508": "As @cedricmaxwell81 said \"That's nasty Oooooooooh!\" Nice three @jaytatum0 to give @Celtics their largest lead at 116-99 with 5 minutes left! Go @Celtics! #BleedGreen #LALvsBOS",
    "1509": "@celtics AHHHH LFGGGG",
    "1510": "Told y'all Tatum was gonna get out of his slump. Dude absolutely shows up for these nationally televised games vs LA. \n\nAlso couldn't be happier to be wrong about who will win. Sorry @celtics\n\n #LALvsBOS #BleedGreen #BeatLA https://t.co/kvNZ1J9mLD",
    "1511": "@celtics What a great game so far! Lets get that W",
    "1512": "NOW THIS IS CELTICS BASKETBALL!!!!! @celtics https://t.co/EzOAmXc6h4",
    "1513": "@BostonStrongBR @celtics @Lakers Jason Tatum",
    "1514": "@NBA \n\n@Lakers vs @celtics \n\nLive Play by Play\n\nhttps://t.co/odJiFSJyTT\n\n@TheSportsDish14",
    "1515": "@Noah_Sayed529 @celtics I like to think of you just as a floating head",
    "1516": "@celtics Celtics!! Beat LA!!!!",
    "1517": "@aestradaa19 Win a championship in this century please @celtics",
    "1518": "O hey there @celtics…@MacJones_10 effect",
    "1519": "@celtics looking pretty solid against LeBron and Co.",
    "1520": "@celtics look great tonight #BosvsLAL",
    "1521": "These referee’s are cheating like crazy right now for the Boston Celtics! The Celtics keep fouling the Lakers, but it never gets called, Smh, #lakersvsceltics",
    "1522": "Bury them @celtics",
    "1523": "If only the @celtics could play like this every night \nForget ISO go to the hole. \nMake that extra pass",
    "1524": "@mcten @celtics aren’t that good @lakers making teams look elite. What a sham.  Defense bad. The offensive is bad. No identify.  Something gotta give. 🤷🏽‍♂️",
    "1525": "@celtics right now https://t.co/83lH9zxHlF",
    "1526": "@celtics Tatum owns the Lakers",
    "1527": "Pela dando mis Celtics a Anthony Davis, Lebron James y Russell Westbrook #BleedGreen @celtics",
    "1528": "if y’all don’t beat nobody else @celtics beat these hoe ass niggas. 🍀",
    "1529": "That was the best offensive play I’ve seen the @celtics make all year! Great rotation and patience!! Do more of that!@bigjimmurray @IAmJamesStewart",
    "1530": "Can you please play like this every game @celtics",
    "1531": "I miss going to Boston Celtics games downtown Boston fun arena to watch a game 🏀💯",
    "1532": "Lets goooo beat there asss @celtics",
    "1533": "@brady_pompei @celtics I don’t wanna talk bout it 😂😂😂",
    "1534": "Maine Celtics News - @MaineCeltics starting 5 for tonight's game with Capital City GoGo. #maineceltics #bostonathletes #bostonceltics #celtics #basketball #boston #maine #gleague #BleedGreen #bostonathletemagazine https://t.co/OjNMHghSTG",
    "1535": "@celtics are punishing the @Lakers . Lakers play no defense. @nba",
    "1536": "@celtics russ getting bullied",
    "1537": "Jaaaaassssooooonnnn Tttaaaatttuuummmmm\n☘️☘️☘️🔥🔥🔥 @celtics @jaytatum0",
    "1538": "Good shit @celtics",
    "1539": "The Boston Celtics (17 titles) are about to defeat the Los Angeles Lakers (13 titles) despite missing two starters. Love to see it! #BleedGreen",
    "1540": "@susan2519 @celtics @Lakers I love being wrong on this one.",
    "1541": "@celtics This is the horniest I've been watching you guys all szn",
    "1542": "@shooter_spike @celtics Lakers are not good, if this was the warriors, Celtics would get destroyed.",
    "1543": "@celtics Now that’s the Tatum we know and love",
    "1544": "Let's go @celtics ... finish em!",
    "1545": "Boston Celtics players hit both free throws challenge",
    "1546": "I’m back in boys break my heart again @celtics",
    "1547": "@celtics Go green",
    "1548": "BOSTON CELTICS BASKETBALL",
    "1549": "@celtics Jayson TaGOAT https://t.co/tHjOtD0ecD",
    "1550": "@j0eyNYY @celtics @Lakers Still?",
    "1551": "That was the best possession of the @celtics season so far!",
    "1552": "Bust they ass @celtics",
    "1553": "@celtics And to think the Lakers pasted up this man",
    "1554": "Yes Boston celtics",
    "1555": "BOSTON CELTICS !!!!",
    "1556": "Russell Westbrook VS Boston Celtics || 4K - Too saucy? https://t.co/uHsz3UbB0u",
    "1557": "@celtics Pound these mfs",
    "1558": "@celtics Dennis Schroeder owning the flakers rn I love it",
    "1559": "@celtics Tatums back babyyyyy https://t.co/uVOdE1xTtz",
    "1560": "Beat LA, Beat LA, Beat LA #BeatLA let’s go @celtics",
    "1561": "@celtics I LOVE JT😍😍",
    "1562": "@celtics Tatum owns the Lakers lol",
    "1563": "@celtics Brings a tear to my eyeb",
    "1564": "Too strong 💪 https://t.co/7xRjyXx0Jh",
    "1565": "☘️☘️☘️☘️☘️☘️☘️\nI love you @celtics",
    "1566": "These refs are clearly some fans, init @celtics",
    "1567": "Almost time to see Deuce @celtics @espn https://t.co/eukj9x9ZQn",
    "1568": "@NoShirtFlipFlop @celtics I’m sure that means something and I support it.",
    "1569": "@CSmoove_Sports @be_rad93 Carmelo Anthony sucks as a post defender. Boston Celtics going at him.",
    "1570": "Keep it up @celtics",
    "1571": "Jayson Tatum is something else. @jaytatum0 @celtics",
    "1572": "THATS WTF IM TALKING ABOUT @jaytatum0 TAKE THAT SHYTT TO THE BUCKET! ☘️☘️☘️☘️ @celtics",
    "1573": "If Tatum drove to the paint like this every game we wouldn’t have a problem winning @celtics",
    "1574": "🚨 UPDATE: Jayson Tatum - Boston Celtics has a Double Double\n6:50 4th\n34 PTS\n10 RBD\n1 AST\n1 BK\n2 STL\n[FD(55.5) DK(56.5)]",
    "1575": "@TimOBrien @rolandsmartin After the verdict was read,I was looking for the judge to put his feet up and light a cigar. You know like the old Boston Celtics coach,Red Auerbach.",
    "1576": "RUN THEM OFF THE COURT @celtics!!!",
    "1577": "@celtics Please don’t choke again 🙌",
    "1578": "I know it looks really bad @Lakers fans , getting whipped by a lousy Boston Celtics team, but look at the bright side, this is the game that gets Vogel fired..cause if not this game, then what????",
    "1579": "Old man Horford with the block\n@celtics",
    "1580": "Gotta make free throws, @Celtics! #LALvsBOS",
    "1581": "The elite defense of the Boston Celtics 😄 https://t.co/6VkikdZxdV",
    "1582": "I hope that the @Lakers and the @celtics meet in the next @NBA Finals! The winner would win their 18th @NBA Championship. https://t.co/vOoCt7jDs8 https://t.co/4srOeJvOH6",
    "1583": "@StoolGreenie i have been traumatized by @celtics 4th quarters this season",
    "1584": "@CSmoove_Sports Boston Celtics have a CENTER THAT CAN MAKE 3-POINTERS. 😒😒😒\nSure wish the Lakers had Marc Gasol so he could be at the Top of Key running 5-Out Offense.",
    "1585": "@BTG77 @MagicJohnson @kaj33 @celtics @NBA @Jumpman23 @EnesKanter @KingJames King James should concentrate on playing basketball and taking guns out of black community’s so the kids don’t shoot each other, do something for your people instead of giving your opinion\nPROACTIVE dope",
    "1586": "@LakersNation @Lakers tired and getting out worked by the @celtics",
    "1587": "What does Romeo Langford offer beside nothing? Why is he still getting minutes??? @celtics",
    "1588": "@LizVicBo @SaiIorTurnee @WizKahlua @celtics ✅ good trade",
    "1589": "@celtics What’s a Mother to do?? 🤷‍♀️ https://t.co/iLNtnxZeAn",
    "1590": "@celtics I know 3 pointers are a big part of the game but when you are up 10 points in the 4rh quarter there is no need. Drive and get a 2 or get fouled.",
    "1591": "@celtics Please don't blow it.",
    "1592": "It’s only one team I despise being dragged by. That’s the Boston Celtics 🤮",
    "1593": "C’mon @Lakers. This game is against the @Celtics. It’s a #MustWin EVERYTIME #LakeShow",
    "1594": "@Noah_Sayed529 @celtics How many parts of your body are left",
    "1595": "Jayson Tatum with the sweet scoop of Honey Nut Cheerios for Carmelo Anthony! ☘💪🏾 #BostonCeltics #BeatLA @CausewayStreet https://t.co/1Hp4l6Zn4y",
    "1596": "This @celtics game is crazy good 😊",
    "1597": "@ChellHero34 @celtics counter counter ratio",
    "1598": "@RussWestGOAT__ @celtics Counter ratio https://t.co/w0TcfSqemp",
    "1599": "@fartsicled @celtics Cause he hadn’t shot it.",
    "1600": "@celtics Please hang on",
    "1601": "@celtics re sign @KyrieIrving and watch y’all win a championship",
    "1602": "@celtics @Lakers this your man?",
    "1603": "@celtics Love how Marcus Smart keeps driving to the basket today!",
    "1604": "@SaiIorTurnee @mrsrozierlll @WizKahlua @celtics trade Turn and Ime",
    "1605": "@celtics ratio",
    "1606": "@BigBankPicks @UnwrittenRul3s Now look at that piece of crap 3rd Quarter. Here’s what Coach Vogel is thinking, let them try to win the 3rd Quarter without Rondo . They screwed that up, so I will use Rondo at some point in the 4th Quarter in Boston Celtics killer mode.",
    "1607": "@celtics Smart scoring again, in so happy",
    "1608": "@celtics russmickey blows",
    "1609": "@celtics We playing so good just please dont loose the lead once again",
    "1610": "@celtics Only one quarter left 👏🏻",
    "1611": "Man we look pretty good today @celtics\n\nPlease don't lose to LA, thank u",
    "1612": "Marcus always finds a way https://t.co/MsVUmoCUgs",
    "1613": "Win or Lose @celtics #DennisSchroder and @smart_MS3 shouldn’t have to pay for food tonight . Hand feed these guys. They are playing so hard #BleedGreen #LALvsBOS",
    "1614": "@KwikWarren I’m pulling for the @celtics",
    "1615": "Celtics with a double digit lead heading into the 4th. Of all games not to blow this is it @Celtics  #LALvsBOS https://t.co/ggRcqu86L4",
    "1616": "I love what Al Horford brings to this team. He’s a hard nose team player that brings a certain level of professionalism and leadership to the locker room. #BigAl  #Veteran #BostonCeltics",
    "1617": "4th quarters have been tricky. Lets go @celtics Lakers with a lot of one on basketball. Zero chemistry",
    "1618": "Let’s go @celtics #BleedGreen https://t.co/4JaBixFGN6",
    "1619": "Los Angeles Lakers VS. Boston Celtics | USA: NBA | Match in progress\n📺 Watch Live Here =&gt; https://t.co/PBaLgIOLf1\nThis match will start at @, November 15, 2021\nAttendance: 19 156\nVenue: TD Garden (Boston)\nPlease Like and share, thank you https://t.co/z8YwtcGHIr",
    "1620": "@celtics Nice effort but for the 4th: don’t let up. LeBron can single handedly change the outcome of this game, don’t give him the chance",
    "1621": "@celtics ending the 3rd with a double digit lead we've seen what happens\n\nplease. don't. choke.",
    "1622": "@celtics I love Al Horford man☺️",
    "1623": "@4Mooncakee @celtics Romeo Goatford",
    "1624": "@celtics Just don’t blow it",
    "1625": "@celtics I love Tatum had all ball there and still called a foul😂, Lakers been getting the benefit of the call all game.",
    "1626": "@getjoesoxon @celtics Dude is +18 in 12 minutes",
    "1627": "@celtics please don’t choke",
    "1628": "@celtics More https://t.co/TcOOGlte4s",
    "1629": "@celtics Dennis Schroder tonight:\nhttps://t.co/qk3RdjLOX9",
    "1630": "@celtics Great three quarters. Tatum needs to keep on scoring",
    "1631": "@celtics Keep the lead please guys🙄",
    "1632": "@celtics Stop the count! 😂",
    "1633": "@celtics Don’t lose the lead or else",
    "1634": "@celtics Lose this game and see what happens @celtics",
    "1635": "@celtics Romeo owns LeFraud",
    "1636": "@celtics Finish this out strong",
    "1637": "@celtics Don’t pull a falcons please",
    "1638": "@celtics I'm so happy don't choke please",
    "1639": "@celtics Please don’t lose",
    "1640": "@celtics CLOSE IT OUT",
    "1641": "@celtics MORE THAN EVER https://t.co/jpUa5blJYl",
    "1642": "@celtics Please don’t blow this lead",
    "1643": "@celtics Keep it rolling!",
    "1644": "@celtics KEEP IT UP PLEASEEE",
    "1645": "@celtics Not a whole lot to say, but let’s finish this game strong please",
    "1646": "Oh daim #jasonTatum be balling good @celtics",
    "1647": "Rolling into the fourth https://t.co/LRnBB1y69u",
    "1648": "The ultimate @celtics challenge ahead, maintain the lead in the 4th quarter😂",
    "1649": "@NBA @celtics @Lakers Lakers not doing well",
    "1650": "Great 3rd quarter, @Celtics! 93-82 lead! Finish strong! 💪🏾😤☘️🏀💚 #BleedGreen #LALvsBOS",
    "1651": "It is good that the Boston Celtics can bounce back from a rough stretch vs a bad team like the Los Angeles Lakers.",
    "1652": "please do not blow this lead @celtics",
    "1653": "Had surgery on my leg today, my wife brings home #OneBite pizza. she knows I wanted to try it. Watching @celtics beat LA and heres my unbiased review:\nGood crunch, zero flop, sauce is a little bland, but overall good pizza. \n7.9 score. @stoolpresidente https://t.co/WQUlDKHKIr",
    "1654": "@Hazzamorgs_14 @celtics As usual",
    "1655": "@ElisaRichardson @celtics We all remember that day...",
    "1656": "@celtics maintain the lead",
    "1657": "@celtics Refs vs Boston",
    "1658": "Congrats to Douglas on his good news from NIH!!! @ManuelRosaGarr1 @TanyaGromova5 @Shuaish14111793 @UCLA @barneysbeanery @lakers vs @celtics https://t.co/v2PeKFd6vQ",
    "1659": "Watching the @celtics game in a room full of Laker fans might be the easiest thing to do when we’re winning, lol. Imma wait till the end to start talkin though 😂",
    "1660": "Gotta love Al Horford playing like it’s 2016 again. #Boston #Celtics #CelticsTwitter https://t.co/UbyYivrJvv",
    "1661": "@Marc_DAmico @GlobeBobRyan @celtics Bird is 2. No discussion",
    "1662": "Friday night couch, flipping through the channels, watching college hoops &amp; fball, stumbled on Celts and Lakers,, OMG, absolute garbage, please bring back @MagicJohnson #Larrybird, @kaj33 @celtics @NBA , Lebron stop talking politics and play BB stfu and play @Jumpman23 obnoxious",
    "1663": "@celtics 5.9 million",
    "1664": "@celtics This is the team I wanna see every night. Amazing hustle, elite defense, great playmaking",
    "1665": "@1958beanster @MitchMossRadio @paulyhoward @mattyoumans247 Boston Celtics",
    "1666": "@celtics What a pass",
    "1667": "Smart to Horford for another #SunLifeDunk4Diabetes! https://t.co/OdLq6xMc35\n\n— Boston Celtics (@celtics) November 20, 2021",
    "1668": "Al Horford is playing this @Celtics reunion as if he wants that number retired in the rafters. @RedsArmy_John @CelticsDynasty_",
    "1669": "Good run from the @celtics",
    "1670": "4 quarters guys. Don’t forget @celtics",
    "1671": "@KingJamesStory @NBA @celtics @Lakers Willie Cauley stein",
    "1672": "Man, @celtics pumping the @Lakers in the paint? That’s wild. #BleedGreen",
    "1673": "Remember when we beat the Lakers by 32 two years ago? Can we duplicate that tonight? @celtics",
    "1674": "11-2 is the run for Boston\n\n#Celtics #Lakers",
    "1675": "@NBA @celtics @Lakers This is embarrassing vogel getting fired In The morning",
    "1676": "Apply for the Power Forward Grant from @HelloAlice in partnership with Vistaprint, @celtics Foundation, and @NAACP. This collaboration offers $25,000 grants plus marketing and design resources for Black- and Brown-owned small businesses across New England. https://t.co/gGZJx34OcH https://t.co/lOrjdOvCGS",
    "1677": "The jaylen brown-less Boston Celtics are leading by a dozen over a Lebron-AD-Westbrook led Laker team as the 3rd quarter comes winding down. Yup. This Laker team has ISSUES.",
    "1678": "He's #efficient\n+18 plus minus\n@EnesKanter #BleedGreen \n@celtics 87 @Lakers 75 https://t.co/0RAdimrYFm",
    "1679": "@celtics @NBCSBoston Team isn’t good",
    "1680": "87-75 @Celtics lead. Cs build the lead with JT resting thanks to great defense, aggressive rebounding and 2nd chance points! Keep it up, @Celtics!!! 💪🏾😤☘️🏀💚 #BleedGreen #LALvsBOS",
    "1681": "21finz just discovered (Los Angeles Lakers vs. Boston Celtics Full Highlights 1st Quarter | NBA Season 2021-22) - https://t.co/iWzqw9Nyoe https://t.co/WPAmB714Kk",
    "1682": "enjoying this game. @celtics pls don’t throw it. Keys to the game? push the pace! Them laker boys old and slow 😅",
    "1683": "@NBA @celtics @Lakers Has Canter shown off his new kicks to LeBron?",
    "1684": "@NBA @celtics @Lakers Legoat owns him so who cares + Tatum is overrated anyways",
    "1685": "No Rob Williams, no Jaylen Brown #HoldingStrong @celtics",
    "1686": "@NBA @celtics @Lakers Tatum OWNS LeMickey",
    "1687": "@NBA @celtics @Lakers Lebron is back and healthy and the lakers are getting absolutely humiliated by the Schroeder Celtics, what’s the excuse now faker fans",
    "1688": "I stopped betting on the @celtics last season but glad I decided to put some action in on the game tonight. GREAT game – Boards.Buckets. Lets keep it going 👏☘️",
    "1689": "LeBron James and Jayson Tatum show off their fadeaways on ESPN.\n\n@celtics lead the @Lakers in the third quarter. https://t.co/9iXDdeGXOg",
    "1690": "Boston Celtics, otherwise known as the parlay killers. You bet them , they lose. You beg against them , they win",
    "1691": "Timeout 3Q 3:16 \n\n@celtics 87 x 75 @lakers\n\n#bleedgreen #NBAnaESPN",
    "1692": "The Boston Celtics are basically UT north.",
    "1693": "Classic @celtics playing up to an opponent situation. If they played like this against every team then we would be a problem",
    "1694": "Is Grant Williams our FP? @celtics",
    "1695": "Now we are watching the right team @noel_kielty 🇺🇸 🇮🇪 @celtics https://t.co/ed6e4HuYVj",
    "1696": "I really don’t like Grant Williams on the @celtics",
    "1697": "Let’s turn up on em @celtics",
    "1698": "please @celtics send kanter to president xi in exchange for cap room",
    "1699": "These @celtics jerseys are b00ty",
    "1700": "Don’t blow this… @celtics ☘️",
    "1701": "#AlwaysAFan Lakers vs Boston Celtics",
    "1702": "what the fuck am I watching lmao @celtics \n\n(in a good way)",
    "1703": "@CamMidcourt @celtics What team do you support?",
    "1704": "Boston Celtics Basketball",
    "1705": "@celtics I love what I’m seeing keep it going",
    "1706": "watching my favorite player avery bradley play the boston celtics hurts",
    "1707": "Los Angeles Lakers 75\nBoston Celtics 80 3rd quarter",
    "1708": "Let’s Trot @celtics",
    "1709": "Smart to Horford for another #SunLifeDunk4Diabetes! https://t.co/3RXlz7VN7K",
    "1710": "🏀 🧠 A great time with the knowledge of @JohnRyanSports1 for our @DraftKings @BootKreweMedia LIVE SPECIAL @Lakers @LakersNation vs. @celtics @ESPNNBA \n\nLINK IN BIO SWEATIES! 🥵\n.\n.\n.\n#DraftKings #sportsbettingpicks #sportsbets #NBA #LakersNation #celtics #lakersvsceltics https://t.co/NwcWsoqwmU",
    "1711": "Incredible sequence in Boston #celtics #lakers",
    "1712": "@CamMidcourt @celtics Lol sorry, I don’t really understand people that cheer for players over teams, it’s always seemed retarded for me. Anyways if you really watched Tatum you’d know he doesn’t get good calls. Most Celtics fans would agree, don’t care what some clueless LA “Tatum fan” thinks ✌️",
    "1713": "I washed my stinky ass and turned on the game, you're welcome @celtics",
    "1714": "@celtics @NBCSBoston Great start to the quarter😋",
    "1715": "I’m so honored that the FIRST BLACK head Coach in NBA HISTORY Coached My Hometown. The city of BOSTON. Bill Russell Broke Barriers In 1966. @celtics #BleedGreen",
    "1716": "I wish Al Horofrd never left the @celtics, what about you @AnnaHorford ?",
    "1717": "Nice 8-0 run to start the 3rd quarter, @Celtics! Keep up the strong defense and aggressive offense! 😤💪🏾 #BleedGreen #LALvsBOS",
    "1718": "@celtics @NBCSBoston It’s cause Tatum started scoring",
    "1719": "@Lakers struggling with @celtics . At this point if 3 superstars struggling versus 1. What's the point of holding on to em⁉️ ...... 💩 Ain't working @ShannonSharpe @RealSkipBayless @ESPNNBA @ESPNNBA @SHAQ",
    "1720": "Assistant coach Aaron Miles explains what changed after we fell behind by 14, and what we need to do to #BeatLA. Catch the second half live on @NBCSBoston https://t.co/7fGbmxBWk5",
    "1721": "@CamMidcourt @celtics Lmaooo literally 90% of Celtics fans who watch Boston will agree Tatum gets bad calls. You can disagree but you’re literally wrong and in the minority. Also why the fuck is an LA native a Celtics fan? That’s whack",
    "1722": "I just miss the Boston Celtics game saddiq 🥲",
    "1723": "@celtics LETS GO LETS GOOOO!!!! #BleedGreen 🔥🔥🔥🔥🔥🔥💚",
    "1724": "@AntDavis23 ballin tonight but he ain’t have no smoke for @Giannis_An34 the other day! #levels #LakersNation might take another L tonight them @celtics some dogs!",
    "1725": "So good to have @Al_Horford back in green. Guy is a true leader. Stud. @celtics @NBCSBoston",
    "1726": "Great start to the second half @celtics 🍀",
    "1727": "@TomIannello @celtics They read your tweet during halftime Tom",
    "1728": "Boston Celtics x Los Angeles Lakers apostando tudo no Boston Celtics",
    "1729": "@smart_MS3 is one of the most underrated players in the @NBA.\n@celtics",
    "1730": "Just got home in time for the 2nd half of the @celtics @lakers game. Cmon @celtics! It’s my birthday week would be nice if you get a W!",
    "1731": "@celtics giving it all for the home court!!! #HistoricMatchup",
    "1732": "Nice to see @smart_MS3 have a good shooting night to help @Celtics on offense! 😤☘️🏀💚 #BleedGreen #LALvsBOS",
    "1733": "@CamMidcourt @StephenRStone @celtics “Using one instance as an argument? Oh lord, you know how easily anything can be debunked by citing one instance?” https://t.co/UOhaO5MRZl",
    "1734": "8-0 @Celtics run at the start of Q3 with @Lakers going 0-3 from the field and we are back to the nightmare, Boston leads 68-61",
    "1735": "@celtics WTF , picture guy is scoring . Something wrong with @Lakers then..",
    "1736": "@CamMidcourt @deuce_fan_page @celtics That’s just a recent egregious example. It happens a lot tho",
    "1737": "Great start @celtics",
    "1738": "Go crazy! @celtics",
    "1739": "BEAT LA! ☘\n\n#bostonceltics #celtics #beatla #celticsdiary https://t.co/3njcngZ23H",
    "1740": "@CamMidcourt @celtics Well you aren’t a Celtics fan, so point stands 👋",
    "1741": "Come on @Lakers beat the damn @celtics",
    "1742": "Why haven't @Celtics brought up players like @LukeKornet or @BrunoFernandoMV while @rob_williamsIII is injured?! They have been solid players for @MaineCeltics! https://t.co/pAXvN0OjHW",
    "1743": "@celtics after 35 years following you from the UK, finally here at last! (Lodge20 row 10) 😁 #BeatLA https://t.co/5OGVuBZ4r9",
    "1744": "@deuce_fan_page @celtics happens in every sport , the more popular you are the more fouls you’ll get called + more privileges",
    "1745": "@celtics @CocoGauff Are they related?",
    "1746": "@BigBankPicks @UnwrittenRul3s Rondo has been historically a Boston Celtics killer while in a Laker jersey in 2 different seasons. You supposed to be a knowledgeable Laker fan.",
    "1747": "@celtics @lakers It may be 2am here in the UK, but we are up and watching live with some Bud Light's, buffalo chicken and nachos pretending we are in the @thepourhouseboston  #letsgoceltics #beatla #lakersvceltics  #boston #basketball #nba \n#LALvsBOS https://t.co/DsV0ccrhYV",
    "1748": "@RealBillRussell @tdgarden @celtics @Lakers @NBA @ESPNNBA @espn @BostonGlobe I lov u",
    "1749": ".@Celtics please grab thiss W",
    "1750": "@burendero @celtics And the rest of the game? Cmon he can play only on half court at best. Try harder and respect for it but not a starter in a normal situation.",
    "1751": "@CamMidcourt @deuce_fan_page @celtics But the other night Tatum looked at the ref and they called a T. That same game some rookie screamed in their face and the refs didn’t do shit",
    "1752": "@CamMidcourt @deuce_fan_page @celtics I mean, no one automatically gets a T just by complaining to the ref. Players complain to the ref every single whistle. There would be like 50 technical free throws per game.",
    "1753": "@luishernandezv_ @fxrssj_ @celtics No he hasn’t he sucks he lost on defense and ruins the offense momentum",
    "1754": "@deuce_fan_page @CamMidcourt @celtics He's right, Tatum has one of the worst whistles in the league",
    "1755": "Who else is weird enough to be flipping back and forth between Lakers v @Celtics and the @usacurl Olympic Trials?",
    "1756": "@Celtics__Pats @NBA @Lakers @celtics You acting like you’re playing a good team..both Celtics and lakers are lower mid tier",
    "1757": "@luishernandezv_ @fxrssj_ @celtics I can’t imagine the worst. Good defensive player, totally transparent in every offensive play.",
    "1758": "@NBA @Lakers @celtics Let's go!😧😀👍",
    "1759": "@Lakers 🆙 over @celtics 61-60 ☝🏾 at half",
    "1760": "@TheMrad_ @deuce_fan_page @celtics Tatum a nobody compared to Bron that’s why 😹",
    "1761": "@CamMidcourt @deuce_fan_page @celtics He literally can’t tho lol. Tatum gets treated like a rookie",
    "1762": "@RealBillRussell @tdgarden @celtics @Lakers @NBA @ESPNNBA @espn @BostonGlobe Still the best! Enjoy the game.",
    "1763": "@celtics please put me on the jumbotron my seats are 323 row 11 seat 16 i’m wearing a rondo jersey",
    "1764": "@deuce_fan_page @celtics GOAT privileges 🤷‍♂️",
    "1765": "@NBA @Lakers @celtics Garbage",
    "1766": "@ScottieBurner @NBA @Lakers @celtics This is just getting sad for other Twitter accounts cause you can’t miss",
    "1767": "@NBA @Lakers @celtics Lakers can’t even beat us without Brown or Rob 😭😭😭",
    "1768": "@scubaasteevee97 @celtics If you want I mean the teams been up &amp; down",
    "1769": "I want a good weekend @celtics please #BeatLA",
    "1770": "@RealBillRussell @tdgarden @celtics @Lakers @NBA @ESPNNBA @espn @BostonGlobe Welcome back Bill!!!!",
    "1771": "@Robert_Jones44 @Hazzamorgs_14 @celtics Apology accepted.",
    "1772": "@NBA @Lakers @celtics Nice job, Day To Davis",
    "1773": "@NBA @Lakers @celtics Great half of Basketball",
    "1774": "@Battlehawks4 @celtics @NBA Man I just don't get I thought he would be towards the too pts per game, I picked him 6 in season long even.",
    "1775": "@BeanJaay @celtics We shouldn’t be losing tho you idiot sloppy passes allowing them to get rebounds",
    "1776": "Davis (18 PTS) and Tatum (17 PTS) lead the way at the break.\n\n@Lakers 61\n@celtics 60\n\nSecond half coming up on ESPN. https://t.co/F19EerBrSw",
    "1777": "We are here! @tdgarden @celtics",
    "1778": "@Moe_hamade23 @Home_Brodie @celtics You have street clothes on your team pipe down",
    "1779": "@deuce_fan_page @CamMidcourt @celtics or bouncing the ball",
    "1780": "@TheMrad_ @deuce_fan_page @celtics Notice how the Refs react and actually care when LeBron calls for a foul compare to when Tatum does it... shits stupid",
    "1781": "@Christiancolaru @celtics we are without JB and Williams and only down 1. tf up",
    "1782": "@celtics Not bad",
    "1783": "@fxrssj_ @celtics Grant has been one of our better players tris season",
    "1784": "@CamMidcourt @celtics Except Tatum can’t lmao. Tatum hardly  gets calls and he’s gotten technicals for stupid shit like staring down after a dunk",
    "1785": "@Moe_hamade23 @Home_Brodie @celtics notifications are on weirdo",
    "1786": "@celtics let’s go",
    "1787": "@jadensmithsdad @celtics You mean the vice president of the NBPA?",
    "1788": "@celtics Guys quick tip: Turnovers bad, rebounds good 😉",
    "1789": "@celtics Dont play grant",
    "1790": "@jadensmithsdad @celtics No fuckin clue",
    "1791": "@sirdrewsephbeg @Hazzamorgs_14 @celtics I’m sorry I hurt your feelings Jordan Andrew",
    "1792": "@celtics I will no longer defend Grant Williams smh",
    "1793": "@celtics Waive Grant",
    "1794": "@celtics Defense DEFENSE Defense that's How They Will Win Game In Game Out !!!!",
    "1795": "We've reached halftime, and here are the scores so far:\n\n@Lakers with 61, @celtics with 60 🙌🏼\n\nDon't miss the rest of the game and watch it LIVE with your #GlobeNBA League Pass: https://t.co/4nYNBsfchU. #BestTimeWithGlobe https://t.co/zMuORzVx5V",
    "1796": "@celtics Yall complaining about grant know that the foul only happen because of tatum bad pass right?",
    "1797": "@Moe_hamade23 @Home_Brodie @celtics Stay on your own teams page virgin",
    "1798": "@celtics The intensity they had on D the last 5 min before half. Keep it up the rest of the game and we will win!!",
    "1799": "@Robert_Jones44 @celtics We know lil bro",
    "1800": "@deuce_fan_page @celtics As per normal refs riding on lebron's dick",
    "1801": "@celtics It's a good one when it's a W for us, come on, man",
    "1802": "@celtics Stop playing Grant",
    "1803": "My boi Tatum is doong it all right now. Scoring, rebound, hustle....name it. Let's gooo! @celtics",
    "1804": "@tdgarden @celtics Bet they are reasonably priced 😂",
    "1805": "ESPN coverage of @celtics is terrible. #espnsucks",
    "1806": "@celtics Can we have for once a great last offense play ?!",
    "1807": "@celtics someone humble grant",
    "1808": "@celtics This quarter was a tad better. JT is playing as he used to.\n\nTake Grant off of LeBron please.\n\nThe missed foul calls on JT is so ridiculous. It's amazing that he is keeping his composure because I would have been pissed.",
    "1809": "@celtics I absolutely love how everyone goes right for Grant right away LMAOAAOAOAOAOAO",
    "1810": "@celtics get the scrubs off this team",
    "1811": "@celtics Why is grant guarding AD and Lebron",
    "1812": "@deuce_fan_page @celtics I've seen Tatum do so much less than what Lebron did and get called for a tech lmao. Refs on his dick",
    "1813": "@celtics Bench Grant for the whole season. Cut him If possible",
    "1814": "@monrozan @celtics Bro was so good against the knicks game 1 and hasnt done shit since",
    "1815": "@celtics Call up hauser bring grant to maine",
    "1816": "@Hazzamorgs_14 @celtics I’m not",
    "1817": "@celtics Assign grant to Maine",
    "1818": "@celtics pre 2021 grant is back🔥🔥🔥",
    "1819": "@Sp_zeem @AidanGLT @celtics Atleast he would make carmelo have to defend, we will call it even.",
    "1820": "\"Schroooder's on fire, \n@Lakers defence is terrified\" call @celtics fans at the #Garden\n@jaysontatum in top form too!\nWhat a game! Celtics down 1pt at HT\n#ImGonnaBeanOptimistonCeltics\n@anndemare",
    "1821": "@celtics Here for all the Grant hate",
    "1822": "@celtics Send grant to Maine",
    "1823": "@celtics What exactly does Grant do well that he deserves a roster spot",
    "1824": "@celtics Grant to maine Celtics please",
    "1825": "@celtics Grant sucks I don’t get why brad wanna keep his azz",
    "1826": "@celtics I love shitting my pants 😛",
    "1827": "Pssst…take Grant Williams out of the game @celtics 🍀",
    "1828": "@celtics pls win",
    "1829": "@celtics dont play grant please",
    "1830": "@celtics y’all like my new Lakers jersey???🤦‍♂️😤 https://t.co/U8uXmykobh",
    "1831": "@celtics cut grant",
    "1832": "@celtics DONT PLAY GRANT ANYMORE",
    "1833": "@celtics Pls cut grant",
    "1834": "@celtics Waive Grant",
    "1835": "@celtics get grant off this team right the fuck now.",
    "1836": "@celtics SEND GRANT WILLIAMS TO AFGHANISTAN",
    "1837": "@celtics Tatum in the 2nd quarter: https://t.co/dcnDC5MD9N",
    "1838": "@celtics Bench Grant!",
    "1839": "@celtics The hustle is great. Can we just hit wide open 3s tho?",
    "1840": "@celtics Unreal how Lebron can literally throw a tempter tantrum and never get a tech…",
    "1841": "@celtics and that good one aint grant at the moment sit him rn",
    "1842": "@celtics Sloppy half but what’s new we shouldn’t be losing right now",
    "1843": "@celtics Get grant off the court",
    "1844": "@celtics bench grant now",
    "1845": "@celtics High scorinnnnngggg. Let’s win this",
    "1846": "@celtics again , wiliam what r u doing…OMG",
    "1847": "@celtics Good fight back",
    "1848": "@celtics It would be a good one if u cut grant",
    "1849": "@celtics Lets finish this",
    "1850": "Really enjoy watching these two historic franchises in @Lakers vs @celtics !!! Really entertaining!",
    "1851": "The steal. The Euro. The two-handed dunk. Jayson Tatum full package experience!\n\n#BleedGreen #NBA75 #NBATwitter\n\n(Via @celtics) https://t.co/a0xtUTHC0j",
    "1852": "@celtics Your best player is a Lakers fan",
    "1853": "We've got a good one at the Garden https://t.co/sGKlzhiDRU",
    "1854": "@celtics Trade grant already for a center already..",
    "1855": "@RealBillRussell @tdgarden @celtics @Lakers @NBA @ESPNNBA @espn @BostonGlobe GOAT",
    "1856": "@Viictor_HS @celtics cut grant goddamnit*",
    "1857": "This @Lakers @celtics game is everything I need right now.",
    "1858": "@celtics Pls ffs cut grant.",
    "1859": "It's really weird how terribly dumb the Boston Celtics are, they're really play awful basketball and Tatum rivals Westbrook in awful plays, that guy makes incredibly bad plays all the time.",
    "1860": "@celtics Add 5 for ot cause we always in it",
    "1861": "@celtics OK OK!!!💚🔥",
    "1862": "@celtics That call on Schroder😂 wtf",
    "1863": "@FatalesNFT Watching @celtics vs. @Lakers 🍀❤️",
    "1864": "@celtics Westbrick just runs through Schroder and somehow they called the foul on Dennis fml 🤦‍♂️",
    "1865": "@Robert_Jones44 @celtics You’re not watching the game",
    "1866": "@celtics Garbage city, garbage franchise",
    "1867": "@celtics GO AHEAD!!!!🔥🔥🔥🔥🔥🔥💚 #BleedGreen",
    "1868": "@celtics Cut Grant Williams please",
    "1869": "I’m at the 5:10 mark watching the @celtics game vs @Lakers So I #BleedGreen but I’m yelling at the #Lakers give @AntDavis23 the ball get out of his way. I hate watch a team go away from what’s working I’m a basketball fan man #Celtics #LakeShow #LALvsBOS",
    "1870": "@MacToHenryy @celtics trade him for air bc that's all they can get for his trash ass",
    "1871": "Let’s go @celtics Beat @Lakers",
    "1872": "@celtics Look at Lebum crying",
    "1873": "@celtics Why his Tatum a worse shooter than Andre Robertson now",
    "1874": "Bron Bron mean mugging the @celtics  on an and 1 only to miss the FT geezussszzzzzzzz 😂😂😂😂 #LeBrick https://t.co/OrGodVeITq",
    "1875": "@celtics trade grant please",
    "1876": "@celtics Cut grant",
    "1877": "@celtics Bench Grant",
    "1878": "NBA LIVE BET! \n\nBoston Celtics +1.5",
    "1879": "@3someChip @shaun_shorty2k @isaiahthomas @celtics YOU MEAN THE GUY WHO DROPPED MO BAMBA AND DIPPED??? HES NOT EVEN BETTER THAN 69 https://t.co/yXnytzM3CN",
    "1880": "LA Lakers x Boston Celtics now",
    "1881": "cut him now @celtics",
    "1882": "Let’s go @celtics 😤",
    "1883": "Tensions are heating up at TD Garden #BostonCeltics #CelticsLakers #TDGarden https://t.co/Zrk7NKOuQY",
    "1884": "Beat LA @celtics",
    "1885": "The mental lapses by the @Lakers is what's keeping the @celtics in the game.",
    "1886": "What a Qtr @celtics",
    "1887": "I love Big Al @celtics",
    "1888": "@3someSavage @shaun_shorty2k @isaiahthomas @celtics he is mid. SHECK WES BETTER https://t.co/HpKhcJQi4x",
    "1889": "Since the @NBA cheating @celtics hope yall blow out the @Lakers",
    "1890": "I can always get up for Los Angeles Lakers/Boston Celtics.",
    "1891": "Boston Celtics head coach Ime Udoka said that Brad Stevens told him to “buckle up” when it comes to the Celtics-Lakers rivalry game... that statement’s proving to be true during this battle at TD Garden💚",
    "1892": "@celtics LETS GO",
    "1893": "@MeganWGME @RyJacksBack @celtics @Lakers Now THIS is the content I need",
    "1894": "@celtics Play defense get boards and we win",
    "1895": "ALERT: New high roller bet posted!\nA bet has been placed for $10,000.00 on Boston Celtics - Los Angeles Lakers to win $20,500.00.\nTo view this bet or copy it https://t.co/MmGkZ9Nda1 https://t.co/ncKVDMdJZF",
    "1896": "@celtics Lakers owns this franchise",
    "1897": "@celtics Keep a lead challenge",
    "1898": "Is there no music playing in TD Garden. It's so quiet @celtics",
    "1899": "@celtics Horford has been god awful tonight but his backup tonight is Kanter so gotta stick with him sadly.",
    "1900": "@celtics Please tell Dennis he’s cut if he doesn’t stop trying these no-look passes to nobody.",
    "1901": "@_SantiMagic @NBA @celtics They messed up the @celtics score multiple times",
    "1902": "DEFENSE ➡️ OFFENSE https://t.co/XNJ67G39vC",
    "1903": "Timeout 2Q 2:12 \n\n@celtics 54 x 56 @lakers\n\n#BleedGreen #NBAnaESPN",
    "1904": "Can we get some analytics on chances of getting a rebound if you box out? Or if you don’t get closer to the hoop on long shots. HS coaches know that long shots lead to long rebounds. Jeesus. I have takes just need the followers @TSASpod @tsasmattyp @celtics",
    "1905": "Boston Celtics don’t shoot like garbage from 3 for just 1 game challenge",
    "1906": "Got @Lakers v. @celtics on @espn on the tube on mute, @BandofNOTHING on the turntable and @TitosVodka with @Perrier in hand. Not a bad evening by my damn self. #BachelorLife #TweetingIntoTheVoid",
    "1907": "@Lakers dominated 1st quarter. @celtics found their mojo in 2nd quarter",
    "1908": "@shaun_shorty2k @isaiahthomas sign this guy @celtics https://t.co/ITjWG7FCkN",
    "1909": "49-48 lead by @Celtics (after being down by 14 points) thanks to @jaytatum0 and #DennisSchröder taking over in the 2nd quarter! 😤☘️🏀💚 #BleedGreen",
    "1910": "@celtics pls don’t make me sad",
    "1911": "Let’s go, JT! @celtics @jaytatum0",
    "1912": "The first game I watch this season had to be @celtics vs @Lakers with LeBron coming back!! Gotta love the  #NBA75",
    "1913": "@celtics Trade scal for pierce",
    "1914": "BEAT L.A.! BEAT L.A.! BEAT L.A.!!! @celtics",
    "1915": "Boston Celtics having a good 2nd quarter",
    "1916": "#nba #cheating #Boston #lakers @NBA yall know @celtics should be up by atleast 4 points right now https://t.co/qeThHd2WzF",
    "1917": "Hey Boston Celtics - Let Russell Westbrook shoot 3s.  HE CAN'T SHOOT!!",
    "1918": "@celtics x @Lakers \nMy fav 💯 lets go Cs\n#NBATwitter",
    "1919": "@irishcelticsfan @jimmyfagg @tross7667 @BryceMcferson If you get too caught up on recruiting rankings, you'll miss all the fun. We took a small class this year also, which lowers the rankings. Have fun cheering for Notre Dame and the Boston Celtics. Checking out of this one.",
    "1920": "@decl7n @celtics What",
    "1921": "@celtics Nice Tatum only has 17 more shots to miss",
    "1922": "@celtics DUDE IS A SNIPER ALSO https://t.co/fARhD05VGe",
    "1923": "@LakersReporter We need a spark. We need showtime @Lakers. It feels lethargic and to be fair it’s pretty lethargic on the @celtics side as well.",
    "1924": "@IamDefness45 @celtics @NBA I accidentally bet on him again. 3 times this year and 3 times he has done nothing 🤣",
    "1925": "@celtics had 27 before commercial come back then they had 25 @NBA  🤔🤔 https://t.co/IfnQNySniR",
    "1926": "@geaux_tig @celtics @NBCSBoston He’s starting to now thankfully but he should’ve started the game that way celts don’t got the size against Ad to guard him straight up and you’d rather westbrook and Bradley try to beat u from three.",
    "1927": "@Celtics Go to the rack all night &amp; we'll win this game ! Penetration is the 🔑  #Celtics #CelticsNation vs #Lakers #NBATwitter #BeatLA",
    "1928": "Los Angeles Lakers’ star LeBron James returns from injury on Friday night at Boston Celtics https://t.co/dEIodRD8wb",
    "1929": "Pierce is great in the booth with Mike and Scal on the @celtics broadcast. They would be amazing as a regular game day crew.",
    "1930": "@upillaitweet @celtics He needs to cut the hair 😂",
    "1931": "@sbonseyjtsports @RyJacksBack @celtics @Lakers Here’s some Lucky action for you ☘️ https://t.co/mdN8NbDiC4",
    "1932": "@celtics It’s really nice having Paul join in the commentary, see what his ideas are ☘️",
    "1933": "defensive team Boston Celtics",
    "1934": "Timeout 2Q 6:54\n\n@celtics 45 x 46 @lakers \n\n#bleedgreen #NBAnaESPN",
    "1935": "@RealBillRussell @tdgarden @celtics @Lakers @NBA @ESPNNBA @espn @BostonGlobe the only celtic i like 👍🏼",
    "1936": "Let’s go @celtics !!",
    "1937": "Imparable. Marcus Smart cargando con los @celtics ☘️💪\n\n#BleedGreen | #NBAxESPN https://t.co/nhf7dNQeoU",
    "1938": "@celtics @NBA @Lakers  someone messing up the score pt1 https://t.co/HaymnWBNEK",
    "1939": "Boston Celtics should sell naming rights to a fiat currency",
    "1940": "What is up with Jason Tatum this season? @celtics @NBA",
    "1941": "I fuckin hate the Boston Celtics bro",
    "1942": "@KlimeckJaydon @celtics He will be back soon. Give him some time. Let's be with him until he passes this phase.",
    "1943": "@Hendyyyy7 @celtics I get we've made big changes off-season, and have been hampered by cap space. But we've needed an Elite big since KG left and never sorted it. Horford back is decent. JB being out hurts a lot, but we still rely on JB and JT way too much",
    "1944": "@swedruvy @ESPNPR @tdgarden @ESPNNBA @stephenasmith @RealMikeWilbon @JalenRose @Espngreeny @wojespn @Lakers @celtics @dallasmavs @Suns It was on the court mate",
    "1945": "@Ultimate_Closer @celtics @russwest44 In Russ we Trust",
    "1946": "All right let’s go @celtics",
    "1947": "@Whispers_Doom @BMB17 @mcwheezer @stellarct @celtics It’s not a good idea especially because Tatum isn’t that kind of talent. He’s not a once in a generation player you can run those kind of plays with. He’s a scorer. That’s all he is so find him easier ways to do what he’s best at besides forcing him into double team ISO’s",
    "1948": "@TheGobFather180 @celtics The Celtics are not good this year Gob, my Cavs beat them.",
    "1949": "This game feels like its been all @Lakers yet it's only a 3  point game. @celtics fans feeling good",
    "1950": "@Haydenf05 @celtics i've never seen that before. i know they can change 3s to 2s if a foot is on the line during a dead ball but not a missed out of bounds call",
    "1951": "Where was THIS Dennis Schroder in LA? Why he ain't in LA no mo! This cat?! #CmonMan @celtics @Lakers @NBA",
    "1952": "@BMB17 @Whispers_Doom @mcwheezer @stellarct @celtics Kobe called it when they started playing that way. He said Houston won’t have success running that kind of basketball. The Celtics seem to refuse to do anything besides play iso and it’s so damn frustrating to see.",
    "1953": "@paulhokanson @celtics Okay, Mr. Ted Williams.",
    "1954": "@dexalexander @Lakers @celtics You bet! 😂",
    "1955": "@RealBillRussell @tdgarden @celtics @Lakers @NBA @ESPNNBA @espn @BostonGlobe Suit up Bill we need u",
    "1956": "Looking for a quick snack during tonight’s @celtics game? \n\nCheck out MRKT featuring Amazon’s Just Walk Out technology on Levels 4 &amp; 7! Swipe your card. Grab your goods. And exit. No waiting. No checkout lines. It’s really that easy! 🙌 https://t.co/WjImsonYAr",
    "1957": "@RealBillRussell @tdgarden @celtics @Lakers @NBA @ESPNNBA @espn @BostonGlobe LeBron owns your franchise",
    "1958": "@brandon_lirio22 @celtics That's brutal if a call isn't called on the floor at the time it should not be overturned.",
    "1959": "First @celtics had 23 then 22 then 24 come back from commercial n back at 22 something aint right @NBA",
    "1960": "Timeout 2Q 8:59 \n\n@celtics 39 x 42 @lakers \n\nSchroder bem \n\n#bleedgreen #NBAnaESPN",
    "1961": "@Nic_WithoutaK @celtics Need Jaylen back and need to find a groove.",
    "1962": "@celtics unecessary ISOs will kill me",
    "1963": "@Arji0717 @celtics At home, seems to make no sense.",
    "1964": "@LookatTatumman @IsaacDynasty @celtics Is what I say to describe your takes",
    "1965": "@celtics We are a joke. Fucking shit",
    "1966": "Boston celtics",
    "1967": "@celtics 3 to go before another big time L",
    "1968": "BOSTON (AP) — LeBron James was back in action for the Los Angeles Lakers on Friday night against the Boston Celtics after missing eight game because of an abdominal strain. https://t.co/OeG2muJT6V",
    "1969": "Summer 1962: John \"Hondo\" Havlicek attends #Browns camp in Hiram, OH as an offensive end.\n\nHondo, the future Basketball Hall of Famer, 13x NBA All-Star, and 8x NBA champion w/ the #Boston #Celtics, was drafted by Cleveland in the 7th Round of the 1962 NFL Draft out of Ohio State. https://t.co/8Gd0ZXufEu",
    "1970": "Man trying to watch @celtics vs @Lakers is this even basketball?",
    "1971": "@celtics this shit happens cause JB ain’t here",
    "1972": "@RandyNBCLA @espn @NBA @Lakers @celtics Hale yeah! Those women know their stuff!!!",
    "1973": "Are there any @celtics fans following me?",
    "1974": "@celtics On pace to give up 160 tonight.",
    "1975": "@celtics Is that supposed to be a sick joke?\nI guess that means three more sucky quarters to go.",
    "1976": "Never noticed how Kanter tiptoe runs down the court….uhhh you’re 6’10” love, you’re not sneaking up on anyone #celtics #bostonceltics #lakersceltics",
    "1977": "@celtics LETS GO C's!!!! COME ON!!!!",
    "1978": "12 FT already LMAOOO\n\n@celtics start crying to daddy Adam. It seems to work huh",
    "1979": "@RonMott @espn @NBA @Lakers @celtics Espn should long ago have had a show about hoop with Doris and Carolyn Peck!   Both ladies know their hoop!",
    "1980": "@troublecharlie7 @chadzumock @JalenRose @stephenasmith @Lakers @celtics Don't nobody care about the color except y'all.",
    "1981": "@Freakisss @celtics lol i ain’t even see that 😂😂",
    "1982": "Not a fan of these @celtics jersey’s tonight",
    "1983": "I WISH Paul Pierce was a commentator for the @celtics, I find the game so much more enjoyable with him there",
    "1984": "@Nraftes3 @celtics It’s cuz he has 2 fouls",
    "1985": "@celtics Is it me or there's some funny stuff with the scoreboard.?",
    "1986": "@Tatum4threee @celtics We knew this shit would happen",
    "1987": "Credit the @Lakers for wearing classic unis for a matchup with the @celtics who are sadly wearing garbage @UniWatch @sportslogosnet",
    "1988": "COME ON @celtics",
    "1989": "@celtics JT's like ... hmm I'm getting early in foul trouble so I don't have to embarrass myself!",
    "1990": "@Pavel97927133 @Burner06137507 @celtics Wow Celtics players have also allowed 38 points in the first quarter lol",
    "1991": "@Nic_WithoutaK @celtics All I know is Brad wasn’t the problem clearly. Something off with this team the last couple years. Someone’s messing up the chemistry. I blame Smart. But maybe it’s Tatum. I don’t know. Jaylen is definitely not the problem.",
    "1992": "@KertyKerBear @JamesRedElk @RealBillRussell @tdgarden @celtics @Lakers @NBA @ESPNNBA @espn @BostonGlobe Your saying that now but when he eventually passes, overtime that thing will skyrocket in price maybe even millions. He has the most championships in NBA history which will never be broken. Since he played in the early days I’m assuming there aren’t much people with signed jersey",
    "1993": "Charlotte Hornets - Indiana Pacers\nBoston Celtics - Los Angeles Lakers\nMilwaukee Bucks - Oklahoma City Thunder\nDenver Nuggets - Chicago Bulls\n\nBet slip link: https://t.co/cesMCGoy4F https://t.co/2jjUVSJfUm",
    "1994": "@heydb your take 2nite during @Lakers @celtics abt @EnesKanter r out of bounds. @KingJames never reaches out to the numerous police and politicos he freq rips &amp; your what-aboutism re: other players is a red herring. LBJ 👑’d himself face of the @NBA &amp; @Nike, u know better.",
    "1995": "@celtics Jayson Tatum is legit scared to drive the damn ball on AD and marcus comes out and shows him how to do it like 4 times. He better come back out ready to play or help me god",
    "1996": "@celtics This game is going exactly as expected and that's not a compliment. \n\nEveryone not named Smart or Rochardson, please pick up the effort!",
    "1997": "@celtics 40 Pt first qtr for the Lakers,so now we can’t even play defense against these stiffs",
    "1998": "@celtics Why did they take away like 5 of our points???",
    "1999": "@celtics Need a big 3 quarters",
    "2000": "@4Mooncakee @celtics They played better than our starters dummy",
    "2001": "@celtics Stop being ass",
    "2002": "@ESPNNBA watching the @celtics game listening to your Whiney bitch commentators following the lead they are given by @NBA to make @EnesKanter look bad and prop up the Douche @KingJames!",
    "2003": "Rondo is in TD garden tonite. Appreciation. Recall the broken arm game #celtics #nba @celtics #heartofachampion #Rondo @RajonRondo @NBA @NBAonTNT @Lakers",
    "2004": "@celtics Don't let Grant see the court  another minute",
    "2005": "@frigkyrieirving @Burner06137507 @celtics He missed an easy open three...",
    "2006": "@celtics Refs being able to go back 6 minutes into a game to review a shot but can't review bullshit calls they make that costs teams games at the end. This league is so shit.",
    "2007": "@celtics I miss this Tatum https://t.co/DtQ0Do5uQk",
    "2008": "@celtics There’s a thing called defense… try it out",
    "2009": "@celtics Tatum gotta go, he’s awful and this is who he is",
    "2010": "@celtics Can you guys please Play Defense thank you",
    "2011": "@celtics need tatum to step it up now",
    "2012": "@celtics they took away al's 3 cause he was out of bounds but they never called that on the floor......",
    "2013": "@celtics I’ve seen enough of social media coaches for one day lol",
    "2014": "👍 on @YouTube: (LIVE) L.A. LAKERS VS. BOSTON CELTICS - 11/19/21 - (GAME BREAKDOWN ONLY) NO VIDEO https://t.co/AGgmMm6H7K",
    "2015": "@EnesKanter @KingJames @Nike 👎🤢🏀👎SO misguided &amp; misled, is @EnesKanter….BUT👉🌟🇨🇳💪🌈🌏🌟👏👏👏#ChinaRising !!!! @socialist_china @NoWarWithChina @chinanotenemy @catcontentonly @notXiangyu @JenwillXXYou @just_myjoan @Vorkuta_CLC @suidaila @celtics @dominictsz @JohnRoss43 @RisingRedDrago1 @SpiritofHo",
    "2016": "@YouTubeTV Keeps freezing.. tryna watch @celtics vs @Lakers ! Sort it out already",
    "2017": "@celtics please JT https://t.co/TF6Teg1EE3",
    "2018": "@celtics y they take Al 3s away?",
    "2019": "@celtics serious question: wtf is this team doing, man?",
    "2020": "@NBA @celtics missing some points",
    "2021": "@FanMahome @celtics @greenbean3742 W take",
    "2022": "@celtics Without Marcus Smart we’d be losing by 30",
    "2023": "@Burner06137507 @celtics Tatum has hardly played tonight lol",
    "2024": "@celtics Tatum need to play like Marcus playing tonight.",
    "2025": "@celtics Play defense and we’ll have a chance",
    "2026": "@celtics Why are smart and richardson our best players",
    "2027": "@celtics @greenbean3742 Play some defense",
    "2028": "@celtics Marcus smart 59 bomb loading",
    "2029": "@celtics Please play some defense I’m begging you",
    "2030": "@celtics More of this, please https://t.co/ujwlYl9TR0",
    "2031": "@celtics Operation stop AD",
    "2032": "@celtics bro….william is not a NBA player, is awful to watch, well all the celtics are awful to watch…hey but the lakers R worse",
    "2033": "@celtics So they can just take points off the scoreboard from us?",
    "2034": "One down, three to go. https://t.co/H1OY72WUls",
    "2035": "@celtics My Guy 🍀",
    "2036": "Enes Kanter plays for the Boston Celtics",
    "2037": "@celtics They took at least 5 points away from us without explanation",
    "2038": "Gotta love a high tempo @Lakers v @celtics battle. ⚔️ https://t.co/JGqQAXseJi",
    "2039": "Boston Celtics Kanter went after LeBron because he’s the biggest active name in the game when it comes to sneakers Miss  Burks needs to chill",
    "2040": "The @celtics need to tighten up on both sides. They can win this game if they just pick up the energy and focus. Time to see what they can do leading into halftime. ☘️🍀🏀 #Celtics #CelticsNation #BleedGreen #CelticsvsLakers",
    "2041": "@celtics Fillayyyyy",
    "2042": "tatum sitting for 6 min in the first, what is that logic ? he better play the entire 2nd quarter…. @celtics",
    "2043": "This could be the worst @celtics team on the defensive end I've seen in over a decade. AD running riot on us again. Perimeter D is nowhere near the shooters. Haven't got a double team right all night either.",
    "2044": "@DesignerOwnsYou @JamesRedElk @RealBillRussell @tdgarden @celtics @Lakers @NBA @ESPNNBA @espn @BostonGlobe True, but priceless at the same time.",
    "2045": "@celtics Don’t lose",
    "2046": "@celtics Smart needs to drive more in this game",
    "2047": "@celtics Where is Tatum",
    "2048": "Smart a true Celtic. Never trade him @celtics",
    "2049": "This is Marcus Smart personifying the Celtic spirit. #BeatLA @smart_MS3 @celtics",
    "2050": "@celtics Y’all better thank Marcus smart after this game lmaoo",
    "2051": "@celtics are doing great for a tough team they are facing",
    "2052": "Welcome to Monkistan @celtics",
    "2053": "@KertyKerBear @JamesRedElk @RealBillRussell @tdgarden @celtics @Lakers @NBA @ESPNNBA @espn @BostonGlobe I don’t wanna seem WIERD but that jersey is gonna be worth a lot in the future",
    "2054": "Love seeing Bill Russell in the @kobebryant hat. Go @celtics ! #celticslakers #NBA75",
    "2055": "Josh Richardson has really been coming along smoothly as a member of the Boston Celtics.",
    "2056": "New night but the same weak ass defense/offense from the #LosAngelesLakers. Tonight the (8-8) #Lakers travel to Beantown to play against the (7-8) #BostonCeltics. Now, if LA can't beat the #Celtics with #LeBronJames back on the floor? They deserve to be clowned\n#NBA \n#ESPN \n@NBA https://t.co/zSc1KMjDmB",
    "2057": "POV: You’re with @MeganWGME at the @celtics v @Lakers game. 🏀 https://t.co/bDQpWYjB0H",
    "2058": "(LIVE) L.A. LAKERS VS. BOSTON CELTICS - 11/19/21 - (GAME BREAKDOWN ONLY)... https://t.co/qgJxXFFb7O via @YouTube",
    "2059": "Game stream: Los Angeles Lakers vs. Boston Celtics https://t.co/sPA2iQCgBI",
    "2060": "The Boston Celtics has the ugliest jerseys. You will never see me in a Celtics or Tar Heels jersey",
    "2061": "@WarriorsInn4 @celtics Poole for Tatum u got a deal",
    "2062": "The Los Angeles Lakers are in the lead against the Boston Celtics 32-25 https://t.co/mCwJN7Nq5d",
    "2063": "@celtics We lost",
    "2064": "So brave of @KingJames to come back tonight against this FORMIDABLE @celtics team.  Grit and balls personified.",
    "2065": "@RealBillRussell @tdgarden @celtics @Lakers @NBA @ESPNNBA @espn @BostonGlobe The real #GOAT is in Boston tonight! And I'm not talking about Lebron.",
    "2066": "Just gotta keep plugging away 🤷🏻‍♀️ lol #PleaseNoMoreForcedShotsOrTurnovers @celtics",
    "2067": "@martnextdoor_ @celtics Lmfao Kanter is even worse",
    "2068": "@RobWayTV @paulpierce34 @celtics @Lakers @7News Paul usually pays strippers to hang out, now it's regular Joe's.",
    "2069": "Can someone tell me why Al's hoop was a no basket?  @celtics #BleedGreen",
    "2070": "@jsteezy45 @celtics Man what did I tell y’all",
    "2071": "reage boston celtics",
    "2072": "Tatum really cooked? Wiggins and Wiseman sound nice @celtics",
    "2073": "What in Heavens Name have the @celtics done to their uniform? https://t.co/WNQOriWVku",
    "2074": "@celtics just don’t play an enjoyable brand of basketball right now.",
    "2075": "I'm not lovin' this 1st quarter @Celtics",
    "2076": "Why does Grant Williams get minutes. I refuse to watch until he is deep on the bench. A 10-12th man at best @BrianTRobb #BostonCeltics",
    "2077": "1st quarter Enes Kanter minutes. You will be receiving a bill from my therapist @celtics",
    "2078": "@RonMott @espn @NBA @Lakers @celtics She was on the NCAA Honors Committee when I was the liaison. She was awesome!",
    "2079": "Pau no cu do Boston Celtics",
    "2080": "yup, I’ve seen enough, fuck you @celtics",
    "2081": "@Curryburneracct @celtics @NBCSBoston He’s ran zone on 3 separate occasions",
    "2082": "“Throws it Out of Bounds” the story of the 2021 Boston Celtics.",
    "2083": "Okay, I don’t know anyone who plays for the Boston Celtics other than about 3 players.",
    "2084": "We are @tdgarden where you can preview some pieces from the @RealBillRussell collection ahead of the Live Auction on December 10th. We will be at the @celtics and @NHLBruins games through Monday! https://t.co/u2xpG165Ij",
    "2085": "Boston Celtics playing like some damn high school athletes rn",
    "2086": "Why do the @celtics look like they forgot how to play basketball right now?? Wtf!",
    "2087": "The Boston Celtics take on the Los Angeles Lakers! Follow for my updates https://t.co/666lQUpuDk",
    "2088": "@celtics losers",
    "2089": "@celtics looking sloppy",
    "2090": "Tatum needs Brown more than Brown needs Tatum @celtics #celticsvslakers",
    "2091": "Lebron James returns as he and the Lakers take on the Boston Celtics.\n\n#NBA #NBA75 #Lakers #LakeShow #Celtics #BleedGreen #WayOfLife #LALvsBOS https://t.co/cTXSvg9f3O",
    "2092": "How many uniform variations does a team really need?? #bostonceltics #celtics #nba #basketball",
    "2093": "#SportsNews LeBron returns to court for Lakers at Celtics: LeBron James will return for the Los Angeles Lakers for Friday night's game at the Boston Celtics, the team announced. https://t.co/p4eap5WGVe https://t.co/Gihph83xwP",
    "2094": "the @celtics just suck, or have been bamboozled into thinking Ime Udoka is a good coach. #BleedGreen . Such unsavory basketball, I really haven’t enjoyed Celtics basketball for about 9 years now. Could care less about high scoring games from Tatum &amp; Brown. https://t.co/p3l8mFHhHo",
    "2095": "If you're going to mail it in @celtics plz let me know early",
    "2096": "It’s almost Gametime @celtics vs @lakers… #LetsGoooooo 🍀 #CityofChampions #LALvsBOS https://t.co/ihucJbRIL1",
    "2097": "Classic game @Lakers vs @celtics at @tdgarden Let's go Lakers! #GoLakers #Lakers #LakeShow #NBA75 #NBATwitter",
    "2098": "Los Angeles Lakers🟣🟡 x Boston Celtics 🟢☘️ #NBA75 https://t.co/92ud01Pw1e",
    "2099": "@celtics your uniforms suck balls, unfortunately",
    "2100": "@chrisfinstaaaa @celtics betting against yall tn🤗",
    "2101": "Hey Bill Russell can you come help the @celtics #LALvsBOS",
    "2102": "So is it me or is @jasontatum0 not seeing my guy @smart_MS3 like COME ON MY MAN OPEN MEN NO COVERAGE AND YOU KEEP 2k ing the dang in ball 🏀 mr dribble dribble shot miss you are F THE GAME MAN @celtics",
    "2103": "@ByJayKing Boston Celtics, bad at basketball",
    "2104": "I'm going  with Lakers against  the Boston Celtics",
    "2105": "The #Celtics vs #Lakers game is nothing like it was back in the day. @lakers rolling all over the @celtics right now.",
    "2106": "PUT ENES KANTER IN TO COMBAT LECHINA @CELTICS @IMEUDOKA1",
    "2107": "Always so painful watching @celtics games these days. When will we ever start with effort in the 1st quarter? Seems never.",
    "2108": "@celtics @NBCSBoston Brought my son to his first game here tonight we better win #GoCeltics",
    "2109": "The ability to hit shots is important in the @NBA.  @celtics can not shoot. That makes winning not easy or likely",
    "2110": "@RealBillRussell @tdgarden @celtics @Lakers @NBA @ESPNNBA @espn @BostonGlobe Teaching her about Celtic Pride early. https://t.co/yZEjfI12oJ",
    "2111": "y’all gonna look like this in front of bill russell and paul pierce??? @celtics https://t.co/pO1eBEqtuB",
    "2112": "Watching @celtics vs @Lakers, in Boston, &amp; seeing the Coinbase brand on the baskets base supports tells me one thing! Mass adoption is upon us #nba #nft #crypro",
    "2113": "The Boston Celtics need to fire Grant Williams. He's fucking awful I'm sick and tired of him. He can't guard can't shoot. Let him fucking go!!! #firegrantwilliams",
    "2114": "@celtics @NBCSBoston I wish when tatum passed the ball his teammates can make their shots would be nice",
    "2115": "@celtics @NBCSBoston Who cares we’re losing",
    "2116": "Consensus Line Move:\n2021-11-19 Los Angeles Lakers at Boston Celtics from 214.50 to 213.50\nUnder this just in\n#NBA #sports #innovation #trade",
    "2117": "@BoredomPersoni1 @celtics @NBCSBoston 1-5 right now",
    "2118": "@HoHighlights @NBATV @celtics bro, what the hell.. imagine not being able to defend that EIGHT GRADE ASS SCHOOL PLAY.. @celtics PATHETIC.. DO BETTER..",
    "2119": "@celtics burn these uniforms! White only at home!!! #NBA #Boston #Celtics",
    "2120": "@KertyKerBear @RealBillRussell @tdgarden @celtics @Lakers @NBA @ESPNNBA @espn @BostonGlobe That’s sick!",
    "2121": "I am in an abusive relationship with Manchester United and Boston Celtics",
    "2122": "@VSCO_EastCoast @celtics Just compete. All the city and fanbase ask",
    "2123": "4 days old is old enough to learn in this house it's always #BeatLA @Celtics @NBCSCeltics @tvabby @Scalabrine https://t.co/jNcvHvrE2R",
    "2124": "@celtics @NBCSBoston Too bad the Celtics continue to not show up. The game already appears to be over.",
    "2125": "@celtics @NBCSBoston Ime won’t play zone when every other high level team does it against the lakers I guess we know the Celtics class level now",
    "2126": "@celtics @NBCSBoston Tatum has fucking Tingis Pingis syndrome. Just refuses to look for an easy shot",
    "2127": "@celtics Williams gots to get traded already",
    "2128": "@celtics @NBCSBoston Holy shit we need Brown back",
    "2129": "@celtics @NBCSBoston Boring game",
    "2130": "@celtics @NBCSBoston This team is hot dog shit. Tatum afraid to drive and they can’t guard lol",
    "2131": "@celtics @NBCSBoston I didn’t know MJ was in the house tonight",
    "2132": "@celtics @NBCSBoston So sick of Tatum missing WIDE open shots",
    "2133": "@celtics @NBCSBoston Wacko",
    "2134": "@celtics look bad right now #LALvsBOS",
    "2135": "Timeout 1Q 6:59 \n\n@celtics 9 x 18 @lakers \n\n#bleedgreen #NBAnaESPN",
    "2136": "Already annoyed with the @celtics get your fucking shit together.",
    "2137": "@TebowCouch @celtics @NBCSBoston This is crazy.\n\nI just want a fully gift wrapped cheerleader under my tree from Santa. https://t.co/M05Ddo0VRe",
    "2138": "@celtics @NBCSBoston No one knows who that is, win a game.",
    "2139": "I am convinced that the Boston Celtics have no plays",
    "2140": "Horrible start. No effort in a Friday night against your arch rival. Gutless  @celtics",
    "2141": "@BostonPlzWin @celtics @NBCSBoston Facts bro they know better",
    "2142": "@celtics @NBCSBoston We have absolutely no idea what to do on offence",
    "2143": "Y’all need to make a trade @celtics",
    "2144": "@celtics @NBCSBoston Awfull game",
    "2145": "For the love of everything please get rid of grant @celtics",
    "2146": "@celtics @NBCSBoston Bill Russell is sadly not the goat",
    "2147": "@celtics @NBCSBoston Thought he was gonna say LeBron I was boutta get mad 😂",
    "2148": "Rivalry renewed. https://t.co/6EqGq0eHzf\n\n— Boston Celtics (@celtics) November 20, 2021",
    "2149": "@celtics @NBCSBoston Tatum has to have one of the biggest fall offs of a young “star” I’ve ever seen. \n\nHe genuinely looks like he forgot how to play basketball.",
    "2150": "The 🐐 is in the house for Rivalry Night! Watch as the Celtics host the Lakers, live now on @NBCSBoston https://t.co/gVFEYZYciQ",
    "2151": "I still hate seeing Avery Bradley in anything but a @celtics jersey. Man, I miss him. https://t.co/g9TILjaQgL",
    "2152": "Game stream: Los Angeles Lakers vs. Boston Celtics https://t.co/TxCmd943Xr https://t.co/Ix2CJAXeej",
    "2153": "This team can’t shoot 4 shit @celtics 😡",
    "2154": "Come join me and talk some sports while I watch @celtics vs @lakers on @espn https://t.co/9Dt2zY9x90",
    "2155": "Schroder's chance to show LA they were wrong about him.   2 turnovers so far smh @celtics #LALvsBOS",
    "2156": "@Lakers off to a good start vs @celtics",
    "2157": "Sign him @celtics please https://t.co/7MMbAeKHnf",
    "2158": "@celtics Rivalry? Stop.. This team is so sloppy right now it's embarrassing..",
    "2159": "I’m getting older and I remind myself change isn’t a bad thing but some things just make me shake my head. Celtics hosting Lakers and LA is in home yellow uniforms while C’s have those alternate green uniforms on. WTF. You are the GD Boston Celtics, where home traditional whites.",
    "2160": "Take care of the basketball @celtics",
    "2161": "@cpoliticditto @lakers &amp; @celtics on @ESPNNBA. Love @KingJames long time. Refreshments: @jamesonwhiskey &amp; #OGKush. 🙏 https://t.co/2j9o75LBdE",
    "2162": "Let’s Go Celtics!!!! #bostonceltics🍀🍀🍀🍀🍀🍀 https://t.co/7UEa8b2KiT",
    "2163": "@celtics all the way #CUsRise☘️ https://t.co/wBdp8hkfuS",
    "2164": "@celtics We have absolutely no playmaking or any idea on offence",
    "2165": "NW: @Lakers vs @celtics #LakeShow The King @KingJames is back",
    "2166": "Little sloppy here @celtics",
    "2167": "@RealBillRussell @tdgarden @celtics @Lakers @NBA @ESPNNBA @espn @BostonGlobe The only Celtic I respect",
    "2168": "@celtics @CocoGauff gurl...!",
    "2169": "@celtics Imagine being in the huddle and the coach blows smoke in your face. Wild times lol",
    "2170": "@Home_Brodie @celtics Needed Rob for this game 😒",
    "2171": "@celtics @CocoGauff @IamTylerJoy see my friend!! @CocoGauff",
    "2172": "FUCK THE BOSTON CELTICS! Keep it going! https://t.co/gqUITmEZqe",
    "2173": "@celtics it was last a rivalry a decade ago. now you just lose constantly.",
    "2174": "@JayDaThunderFan @celtics We’ve both been missing good players Brown for us and Lebron for the lakers and we still don’t have brown",
    "2175": "@celtics langford the best 😈",
    "2176": "@celtics This would have been a good night to debut the alternate court.",
    "2177": "FUCK THE BOSTON CELTICS! Keep it going! https://t.co/EdUhkiOwFO",
    "2178": "It irks me the way the Boston celtics pronounce their name",
    "2179": "@celtics So Tatum was on lebron and then over helped on Schroeders guy then just drifted off to the other side of the court and left Lebron un guarded. Please correct me if I’m wrong about how I saw this",
    "2180": "@celtics I'd say it's more of a nice tradition nowadays. Can't really call it a rivarly until they battle in the finals again",
    "2181": "@TTgreen76 @celtics And being completely overmatched talentwide.",
    "2182": "lakers on dat AZZZZ @celtics",
    "2183": "Game time- Let’s Go!!!  @AnnaHorford @celtics #Boston #basketball https://t.co/AqH2fVzvDF",
    "2184": "@JustAKidFromPR @celtics already 🤦‍♂️",
    "2185": "@celtics Please stop with the threes and drive to the basket!",
    "2186": "@celtics Tell that to the perpetually hurt Jaylen Brown and Rob Williams",
    "2187": "Celtics come out with 0 resistance on defense and 0 urgency on offense. It starts at the top. Ime and Tatum. @celtics",
    "2188": "Get grant Williams out the game @celtics 🤦🏽‍♂️",
    "2189": "@celtics We are getting rolled and smoked by this team lmao",
    "2190": "Oof, We're in for a long night @celtics \n\n#LALvsBOS",
    "2191": "Get grant Williams off the floor please @celtics",
    "2192": "@willrogers_28 @celtics how many times does brown barf up the ball a game? the dude sucks.",
    "2193": "So it’s gonna be one of those nights huh @celtics? 😒",
    "2194": "What’s with that defensive assignment you dumbfucks @celtics",
    "2195": "@mukkamadboyzzzz @celtics 5 year pro...if not now, when?",
    "2196": "Play defense maybe??????? @celtics",
    "2197": "LeBron James will return for the Los Angeles Lakers for Friday night's game at the Boston Celtics, the team announced. \n#NBA #NBATwitter https://t.co/qszv1EzdIJ",
    "2198": "I predict the @celtics will probably lose. But this will also be the game Tatum officially gets out of his slump. And if that happens I'll be good.  #LALvsBOS #BleedGreen",
    "2199": "@celtics y’all jerseys are trash.",
    "2200": "@celtics Lakers all the way.",
    "2201": "@celtics westmvp owns you",
    "2202": "@RealBillRussell @tdgarden @celtics @Lakers @NBA @ESPNNBA @espn @BostonGlobe We don’t deserve Bill",
    "2203": "@celtics Be a serious organization",
    "2204": "Boston Celtics- LA Lakers @tdgarden https://t.co/34BVB0Upw2",
    "2205": "Must win game this #BleedGreen @celtics #BeatLA",
    "2206": "@celtics pls don’t embarrass us on national television",
    "2207": "The @celtics uniforms look awful. Why mess with a good thing?",
    "2208": "@celtics Already a stupid play by Tatum",
    "2209": "@celtics Own these frauds",
    "2210": "@RealBillRussell @tdgarden @celtics @Lakers @NBA @ESPNNBA @espn @BostonGlobe We love you Bill! https://t.co/wWrDHsi5Wr",
    "2211": "@celtics Double lost will be my guess",
    "2212": "Rivalry renewed. https://t.co/8JK7pdn3I6",
    "2213": "What a surprise… f em time to show what we bout @Celtics #BleedGreen https://t.co/4W8glZN4Gb",
    "2214": "Let’s Go @celtics. #BeatLA",
    "2215": "@celtics @NBCSBoston She’s fine as hell but win the game tonight 😃",
    "2216": "Los Angeles #LAKERS’ star LeBron James returns from injury on Friday night at Boston Celtics https://t.co/vqc0mq4TLx",
    "2217": "@dexalexander @Lakers @celtics Wife made wings , pizza, and we have caramel apples",
    "2218": "@Lakers @bibigoUSA Wearing the gold unis on the road will always feel wrong especially if against the Boston Celtics.",
    "2219": "@jamdonohu @celtics Today is a good day. Nothing to cry about my guy. This is sports talk, nothing more",
    "2220": "Favorite team @celtics vs. my favorite player @russwest44 WHAT AM I GOING TO DO?! 😩🤦🏾‍♂️",
    "2221": "just got my food and my @celtics bout to play 🥶",
    "2222": "Boston Celtics x Los Angeles Lakers! #BleedGreen #BeatLA #NBAnaESPN ☘",
    "2223": "NBA isn’t playing with the @celtics and @Lakers game. They got the GOATs Mike Breen and Doris Burke on the call 😭 #NBA75",
    "2224": "Let's go, @Celtics! #BeatLA #BleedGreen #WayOfLife☘️🏀💚 https://t.co/9bs9Lu81Li",
    "2225": "@RealBillRussell @tdgarden @celtics @Lakers @NBA @ESPNNBA @espn @BostonGlobe King",
    "2226": "Boston Celtics used to be title contenders. They fell off \n\n@DennisDee21 I’m talking to you",
    "2227": "@celtics @NBCSBoston I just have no faith in this team, Robert is Fragile every year and JB's hamstring stops him from playing again, even if they get lucky tonight, they are an average team.",
    "2228": "Make Open Shots Please @celtics \n\nThank you.",
    "2229": "NBA'S Greatest Rivalry tonight.  PLEASE beat the damn @celtics, @Lakers https://t.co/2EkuIkAVc0",
    "2230": "Football: Tennessee Titans\nBasketball: Boston Celtics\nBaseball: Boston Red Sox\nHockey: Boston Bruins\nSoccer: N/A\nCollege: Michigan State https://t.co/D7tD8vCVxT",
    "2231": "Good evening to the the Boston celtics and celtics fans only.",
    "2232": "@Lakers @KingJames Oh shucks I thought I was going to be able to hear the PROFESSIONAL ANNOUNCERS\ncall this @Lakers and @celtics game!!!! This sucks! Come @SpectrumSN share and give us options!!!!!!!!! 🤦🏽‍♀️",
    "2233": "@charles_snell @celtics Oh no hahah",
    "2234": "LakeShow in town LFG @celtics ☘️",
    "2235": "📝 Gli starting five del match tra Boston Celtics e Los Angeles Lakers\n\n🏀 Russell Westbrook, Avery Bradley, Talen Horton-Tucker, LeBron James e Anthony Davis\n\n⛹️‍♂️ Dennis Schröder, Smart, Williams, Jayson Tatum e Al Horford\n\n💜💛 Let's go Lakers!\n\n#LakeShow #BleedGreen #NBA75 https://t.co/Mg8TO5WIEG",
    "2236": "@KertyKerBear @RealBillRussell @tdgarden @celtics @Lakers @NBA @ESPNNBA @espn @BostonGlobe Cheers to that!",
    "2237": "@RealBillRussell @tdgarden @celtics @Lakers @NBA @ESPNNBA @espn @BostonGlobe Sorry old man ur losing today",
    "2238": "ALERT: New high roller bet posted!\nA bet has been placed for $8,631.85 on Boston Celtics - Los Angeles Lakers to win $16,400.52.\nTo view this bet or copy it https://t.co/Uw2pl4rKAQ https://t.co/29PYwqZvgi",
    "2239": "@kingjames Enters TD Garden in the @nike Air Force 1 Low. @lakers vs @celtics tonight! 🔥🔥🔥🔥 #sayitwityakickz #sneakerbardetroit #solecollector #nike #nikebasketball #nicekicks #brongang #lebronwatch #af1low https://t.co/vSEFM3c9eV",
    "2240": "Let's go! #BostonCeltics #CelticsNation #GreenRunsDeep #LetsGoCeltics ☘☘☘ https://t.co/IwesWawP0g",
    "2241": "Oh shucks I thought I was going to be able to hear the PROFESSIONAL ANNOUNCERS\ncall this @Lakers and @celtics game!!!! This sucks! Come @SpectrumSN share and give us options!!!!!!!!! 🤦🏽‍♀️",
    "2242": "@Lakers don’t lose to the @celtics the rivalry in sports is next! #LakeShow",
    "2243": "Today's NBA Picks: 7:40 PM ET - Los Angeles Lakers vs. Boston Celtics - 19 PICKS AVAILABLE: https://t.co/nTFzStelui #nba",
    "2244": "@lakers vs @celtics is a classic, BALL IT OUT #LAKERSNATION https://t.co/KsKKWIS0pH",
    "2245": "@martnextdoor_ @celtics Pounds? Maybe. Points? Nope, not even with Rob out.",
    "2246": "@RealBillRussell @tdgarden @celtics @Lakers @NBA @ESPNNBA @espn @BostonGlobe Bill those old shoes, throapies and unis are about to puke on that laker cap",
    "2247": "For my own well being.. need a dub tonight fellas @celtics",
    "2248": "Ok @Lakers fans…. It’s the first of 2 game against the hated @celtics #LakeShow",
    "2249": "@celtics Well, no one left worth tuning in to see. I’ll skip a no-motion offense where everyone stands around and watches the man with the ball.",
    "2250": "@dexalexander @Lakers @celtics Love you too brother. We need a win just as bad 😂😂 \n\nYou should come over",
    "2251": "WE ARE LIVE ON THE @SarcasmCityTV TWITCH \n\nBOSTON CELTICS VS LA LAKERS WATCHALONG (NBA Regular Season) \n\nhttps://t.co/TAS03ATTD0 https://t.co/2LoaMEgTk0",
    "2252": "@capcapfntina @RealBillRussell @tdgarden @celtics @Lakers @NBA @ESPNNBA @espn @BostonGlobe Yeah. Too much already bill. Everytime i see a recent pic of you, always wearing that fugly laker cap.",
    "2253": "Los Angeles Lakers vs Boston Celtics \n#NBA #NBA75 #NBAnaESPN",
    "2254": "@celtics Yall chose our big men with blindfolds on",
    "2255": "I'm happy to see @KingJames and @lakers  back on the floor vs @celtics this would be a good game to watch can't wait to see what he can bring to the team while he been missing the last 8 games",
    "2256": "We will probably suck but it's the @Lakers at @celtics today. Let's go and show some pride, #LakeShow !",
    "2257": "@nba Bill Russell and Lou Alcindor aint do shit except make the @Lakers and @celtics white owners rich.",
    "2258": "Starting ✋🏾 https://t.co/MbwMIgLlPz\n\n— Boston Celtics (@celtics) November 19, 2021",
    "2259": "@celtics @NBCSBoston Can I have one of those for Christmas?",
    "2260": "@mighty_stein @RealBillRussell @tdgarden @celtics @Lakers @NBA @ESPNNBA @espn @BostonGlobe He's no longer bleeding green. What's up with the cap.",
    "2261": "Los Angeles Lakers. Boston Celtics. Gold. Green. LETSSS GOOO! #LakeShow",
    "2262": "Leggo @celtics time to bounce back &amp; #BeatLA",
    "2263": "LETS GO @celtics !!!!",
    "2264": "@NBABrasil @jaytatum0 @Lakers @celtics Future Laker",
    "2265": "For the recent follows... I'm gonna apologize ahead of time for my Boston Celtics banter. Occasional music suggestion. And rare drunk tweet. Also... if you think Kyle Rittenhouse is not guilty, you should prob just unfollow me.",
    "2266": "Pay attention everybody. This is a real rivalry. Just ask Rondo... @Lakers vs @Celtics #GoLakers💜💛",
    "2267": "Watch Live Stream of Los Angeles Lakers vs Boston Celtics\nhttps://t.co/xm6jJSGyoM",
    "2268": "Do not embarrass me @celtics",
    "2269": "Frank Vogel deciding to give his Boston Celtics the edge to start the game https://t.co/8aGaF0DHBV",
    "2270": "@SOULbeautifulme @RealBillRussell @tdgarden @celtics @Lakers @NBA @ESPNNBA @espn @BostonGlobe Too much already. Bill is a laker",
    "2271": "@DbDemetri @CelticsMike @celtics He will never be 100 percent, brown gets injured every year, multiple times a year, where you been.",
    "2272": "Game Time in Boston! @Lakers vs @Celtics it just doesn’t get any better than this! LFG!!! 💜💛 #BeatTheCeltics #BuckFoston #LakeShow"
}