{
    "0": "@HoustonRockets A 2nd W in a row would be lit",
    "1": "New from Houston Chronicle — Rockets’ Stephen Silas reflects on Charlotte years even with Hornets entirely transformed https://t.co/qn2ibvi54l",
    "2": "2nd half of this back-to-back coming soon, Canadians! \n\n📍- Houston, United States\n🆚 - @HoustonRockets\n⏰ - 8pm Toronto/7pm Winnipeg\n📺 - American reional sports channel, @HornetsOnBally\n📻 - American sports radio station, @WFNZ-AM/FM\nhttps://t.co/FXudg6K5JO",
    "3": "@OnlyyBangers @JTGatlin It’s his turn…this is like one of those “woke” leagues…keep no score, records, or stats and EVERYONE plays…here’s your juice box .@HoustonRockets",
    "4": "John Wall could return to the Houston Rockets https://t.co/iYgTgOiZxO",
    "5": "@NworaVibes @wojespn @HoustonRockets How do they stretch $91M 😳😳",
    "6": "Happy RedNation Day!!!!! Geaux @HoustonRockets!!!!!🐻🏀🚀 #RocketsGameday #Rockets #NBATwitter #NBA #NBA75",
    "7": "@_Agent37 @HoustonRockets Excited for that fam👀",
    "8": "The Houston Rockets and John Wall are discussing a potential return to the active roster for the 5-time All-Star this season \n\n@HoustonRockets #NBA75\n\nhttps://t.co/8hYYHp0P4l",
    "9": "@TinaLara29 @HoustonRockets Mathews getting his first start 👀",
    "10": "@GigahDank Well try being a  Houston Rockets fan this year. Coach Silas needs to go.",
    "11": "The @HoustonRockets starting Porter Jr., Gordon, Mathews, Tate, Wood on Saturday. #Rockets50 #NBA",
    "12": "@ChrisPrior13 @HoustonRockets @okstate @LSUfootball I need OU slander",
    "13": "NBA Betting Picks: Charlotte Hornets vs. Houston Rockets – Hornets gun for 13th ATS win https://t.co/h67EVUCIst",
    "14": "@debbiethetexan @BigHatPosse @HoustonTexans @astros @UHouston @HoustonRockets I miss Dave’s passion and energy. He was such a great Houston sports fan. ❤️",
    "15": "Charlotte Hornets vs. Houston Rockets | SportsNus https://t.co/GCjGOFHi8Y",
    "16": "Check out Houston Rockets NBA Basketball Team  16 oz Coffee Mug Cup  #NBA #HoustonRockets https://t.co/jLWhKqz6Wa via @eBay",
    "17": "Plz bros @HoustonRockets @okstate @LSUfootball",
    "18": "Just keep on keeping on! \n\n@hornets in Houston to take on the @HoustonRockets! \n\n@ashahahmadi and @realdellcurry get you ready for action right now on Hornets LIVE! Only on @HornetsOnBally! \n\n#AllFly https://t.co/H76abZYQqE",
    "19": "#houstonrockets #charlottehornets #nbaisfantastic (at @ToyotaCenter for @HoustonRockets @hornets in Houston, TX) https://t.co/UigEMD15WF",
    "20": "@JTGatlin silas doesn’t wanna lose his job 😍😍😍☝🏽☝🏽☝🏽☝🏽 that’s my franchise coach @HoustonRockets @RafaelStone12 😉🐐",
    "21": "This is a good development in Houston. Team needs his veteran-ness to help teach the young core how to navigate the NBA - Sources: Wall, Rockets discussing return to play https://t.co/pxHBZMxFgB",
    "22": "To bad he isn’t playing tonight we need him but excited to see him suit up!! @HoustonRockets https://t.co/D2V7v2Pe71",
    "23": "NBA Live Scores: Game open! Follow to get updates as HOU hosts CHA.  @HoustonRockets @hornets #NBA",
    "24": "Tonight's starting lineup for the Houston Rockets: Kevin Porter Jr., Jae’Sean Tate, Eric Gordon, Christian Wood, Garrison Mathews. https://t.co/bVWH4AMCA2",
    "25": "The @hornets take on the @HoustonRockets tonight &amp; Ive got a 5 Unit side play you can only get 1 place https://t.co/HYeaY3iOqe, the #1 site for #FreePlay winners 🤑\n\nSign up for a 1 month Premium Sub for just $50 good through #CyberMonday!\n\n#NBATwitter \n\n https://t.co/K03YRJRX7N",
    "26": "Houston Rockets Starters:\n\nKevin Porter\nEric Gordon\nGarrison Mathews\nJae'Sean Tate\nChristian Wood\n\nPlayers out:\nJalen Green\nJohn Wall\n#Rockets #NBA #NBATwitter #NBA75",
    "27": "@wojespn Rockets have been playing 5 out with two non-shooting frontcourt and a non-shooting wing then he comesback. Goodluck @HoustonRockets !",
    "28": "@HoustonRockets @socios Wish they could use 2 … and 1 as alt when they want to wear it..",
    "29": "Free JOHN WALL @HoustonRockets",
    "30": "#NBA @hornets vs @HoustonRockets \n\nTerry Rozier three-point made Ov 2.5(+107)\n\nStake 2u",
    "31": "Let's have a day!\n\nOrlando Magic 1Q +3.5\nMagic/Cavs 1Q over 50\nHouston Rockets 1Q +1.5\nUtah Jazz 1Q -4\n\n#Lightthefuse #MagicTogether #TakeNote",
    "32": "@HoustonRockets @socios Lets see, @ca_rockets was an intern when I began loving the Rockets.",
    "33": "John Wall could return to the Houston Rockets https://t.co/TPETEZvBh7 https://t.co/FQiifaXGk2",
    "34": "Future Houston Rocket Paolo Banchero at the half:\n\n- 20 PTS\n- 4 REB\n- 2 AST\n- 1 STL\n- 8/13 FG (62%)\n- 3/6 3P (50%)\n\nGet this man a #Rockets  jersey NOW!!! 🚀 https://t.co/oaYy8e4Kf6",
    "35": "@HoustonRockets @sixers just do the Ben Simmons for John wall trade",
    "36": "@MilkyHitsA @ATTSportsNetSW @HoustonRockets @CalvinMurphyHOF @Toyota @KelsWingert Pulled hammy",
    "37": "@HoustonRockets @hornets @ATTSportsNetSW @SportsTalk790 Play wall",
    "38": "@HoustonRockets @socios I feel terrible for those who pick anything other than #2",
    "39": "@HoustonRockets @MichelobULTRA All this drip just to loose",
    "40": "Had to upgrade that Usman with an even lower serial number. @nbatopshot @NBA @HoustonRockets @PackripEwing https://t.co/PQUWIL50yN",
    "41": "GAME DAY!  #Rockets \n\n🏀 : Charlotte Hornets (13-8)\n🕘 : 22:00\n📌 : Toyota Center - Houston, TX\n🖥 : League Pass e Link https://t.co/E6ve7cf2YX",
    "42": "John Wall would return to Houston Rockets, negotiate his comeback https://t.co/vTGqDYpL08 ⚽️⚽️  📲 Bet now via ⟶ https://t.co/0I4IIflkwI √ https://t.co/H6mNLKwsok",
    "43": "@didntknownowdo @HoustonRockets @socios Lol so be honest and say you associate them with losing, don’t lie and say they’re ugly… cs it ain’t !",
    "44": "Pray for me, @RafaelStone12.  Taking five girls to the @HoustonRockets game tonight.",
    "45": "Houston Russ doesn’t get talked about enough. It was objectively his most efficient season, &amp; before the pandemic he was carrying the Rockets on his back. He was a top 10 player before COVID &amp; injuries got in the way. Russ had a brilliant stretch January-March 2020. https://t.co/iIlWs9YZqM",
    "46": "The Houston Rockets Eric Gordan had 69 points 24 rebounds.",
    "47": "Breaking News: John Wall tells the Houston Rockets he's ready to play @nblindberg \nhttps://t.co/jZQStTqYQX",
    "48": "Is there a good reason we don’t trade @HoustonRockets Simmons for Wall? Waiting... @sixers",
    "49": "No heckling allowed! Go @HoustonRockets ! https://t.co/01cnMCAmRW",
    "50": "@HoustonRockets @hornets @ATTSportsNetSW @SportsTalk790 Imagine not playing harden like your doing with John Wall",
    "51": "@TilmanJFertitta @HoustonRockets @RafaelStone12 @KellyIkoNBA @cayleighgriffin @SalmanAliNBA @JohnWall @TheofficialEG10 @Chriswood_5 @ATTSportsNetSW @TheRyanHollins @CalvinMurphyHOF Good for you John!!! no person that has a Skill or Talent wants to just sit on the Sidelines. https://t.co/yqyb1STEi2",
    "52": "@ihygio Honestly John wall shouldn’t play for the Houston rockets",
    "53": "@HoustonRockets @bull50 @socios It has to be 2 because those were the title years.",
    "54": "It's the @HoustonRockets vs Charlotte Hornets TONIGHT on AT&amp;T SportsNet\n\nHere are @CalvinMurphyHOF's Keys to the Game presented by @Toyota \n\nJoin Calvin &amp; @KelsWingert as they begin our coverage at 6:30PM with #Rockets Pregame https://t.co/U3TvDCJr4f",
    "55": "I wonder if @TilmanJFertitta or the @HoustonRockets have any free tickets left for tonight’s game?!",
    "56": "The former Rockets star just listed the lavish, amenity-loaded home in the suburbs of Houston for $8 million. https://t.co/VVEHkui7CZ https://t.co/qi0TJ4dAGu",
    "57": "Sources — John Wall, Houston Rockets discussing return to play https://t.co/WbzZIZiA6E",
    "58": "#Basketball,\n\n#NBA, #NBATwitter, \n\n#BuzzCity, #AllFly, #Hornets30, #Hornets, vs. #HoustonRockets, #Rockets, #RunAsOne, #RedNation, Get your best odds - fast at https://t.co/Ohl03KWAVe https://t.co/KBsY4kBjZ6",
    "59": "#JohnWall is expected to make his season debut for the Houston #Rockets December 3rd vs the Orlando #Magic.\nHe is NOT willing to void final year of his contract like teams who want to trade for him have asked about.",
    "60": "This is YEAR 1 of their rebuild, nobody is going to Houston unless they massively overpay and… why would they? \n\nJohn Wall poses ONE problem for the Rockets, and it’s not his money, its the fact that he makes them better. You must think the Rockets don’t play him cause of money https://t.co/ZJ5VtPDBnT",
    "61": "@BigSargeSportz huge L @RafaelStone12 @HoustonRockets",
    "62": "🏀 Nov. 27, 1985: Hakeem Olajuwon scores 36 points, with 15 rebounds and 7 blocks as the Houston Rockets beat the Clippers in OT, 137-130.\n📋 Box score: https://t.co/djiLgGV3Cm https://t.co/riAzpfuVaT",
    "63": "New #Rockets from Houston Chronicle — John Wall ready to talk about playing again for Rockets https://t.co/uM66w6AQ4a",
    "64": "Houston Rockets Predictions and Preview for 11/27/2021 hosts Charlotte Hornets.  Looking for betting action?  Find out if there is any value in our preview. #Punters #NBA https://t.co/tMIwyRNgiW",
    "65": "Houston Rockets guard John Wall hopes to return to the court this season, per report https://t.co/HiRV5oxqrU",
    "66": "John Wall changes mind, wants to play for Houston Rockets now – NBA News https://t.co/e9dF2Xg0Q1",
    "67": "The Houston Rockets Ryan Anderson had a multicolor bandaid on his forehead.",
    "68": "@HoustonRockets @socios If you choose three you’re just begging for attention😭😭",
    "69": "Looking for a value bet?  See if the Charlotte Hornets-Houston Rockets Predictions and Preview for 11/27/2021 is one in our preview.  No crazy hype just a prediction and preview. #Punters #NBA https://t.co/tMIwyRNgiW",
    "70": "✨Houston Rockets guard John Wall has yet to take the floor the season. That may be about to change, as Wall has told the Rockets he wants to play.\n👉https://t.co/NXT8IKxqMq\n\n#NBA #NBATwitter #SportsNews #basketball #players https://t.co/dYpQvfULWR",
    "71": "@HoustonRockets @socios No. 2 all day, every day end of debate!",
    "72": "ALERT: New high roller bet posted!\nA bet has been placed for $30012.27 on Houston Rockets - Charlotte Hornets to win $44,418.16.\nTo view this bet or copy it https://t.co/gJWvRzyKDV https://t.co/Auta4o9Mlo",
    "73": "Houston Rockets guard John Wall hopes to play this season after previously agreeing to sit out.  https://t.co/EH3TnLy9Sy",
    "74": "They need to let him play. What do the Houston Rockets have to lose? It’s not like they are trying to win games, that’s for sure. https://t.co/rp2fyRV0wY",
    "75": "forget whatever john wall crying about, rockets need Paolo in that Houston uni",
    "76": "It’s fucking basketball lmao\nThat team is dead last or second to dead last in the conference/league\n\n@HoustonRockets are tanking and don’t wanna mess up the tank \n\nNot that hard https://t.co/U2QFDTg6F9",
    "77": "John Wall changes mind, wants to play for Houston Rockets now https://t.co/O6PyEdFZso #NBA #HoustonRockets",
    "78": "Why are the 13-8 Charlotte Hornets only -5 against the 2-16 Houston Rockets tonight? Holy fish",
    "79": "@HoustonRockets @hornets @ATTSportsNetSW @SportsTalk790 The Rockets are gonna crush the Hornets @JohnWall @JalenGreen go get them buckets",
    "80": "Houston Rockets guard John Wall has expressed his hope that he can return to the team in the near future, according to an ESPN report.\nhttps://t.co/0v9rHWrtvS",
    "81": "New from Houston Chronicle — John Wall ready to talk about playing again for Rockets https://t.co/dHjmaujuOE",
    "82": "@HoustonRockets @hornets @ATTSportsNetSW @SportsTalk790 Silas destroys Rockets future. We have very good young players, but He doesn't give young guys enough minutes. \n\nFire Silas as soon as possible... @RafaelStone12 https://t.co/jknVyTEHMC",
    "83": "Two in a row tonight for the @HoustonRockets?\n👍 or 👎 \n#NBA",
    "84": "@HoustonRockets @socios Where is the Letter R rocket logo? That’s the one I grew up knowing. But from available option definitely 2 is one I’d think of first",
    "85": "@HoustonRockets @socios This long https://t.co/gmoC4lyFoW",
    "86": "It's GAME NIGHT for the @HoustonRockets on AT&amp;T SportsNet\n\n@cayleighgriffin has a preview of the Hornets and the latest on Jalen Green in the Midday Minute presented by @memorialhermann \n\nCoverage begins at 6:30PM on #Rockets Pregame https://t.co/EpVaBdhtF8",
    "87": "He’s getting paid 91 million for this year and next. Rockets are tanking. What a terrible situation. \n\nHouston guard John Wall reportedly wants to return to the court. Wall has sat out the entire season while the Rockets look for a trade partner  https://t.co/Eq4YThwZtH",
    "88": "The Houston Rockets Gerald Green had 3 blind dates in the locker room at halftime.",
    "89": "John Wall wants to play with the Houston Rockets sometime soon\n\nhttps://t.co/YmQdYSTEcK",
    "90": "hi houston lookin for somewhere to eat/drink/pregame somewhere before the Rockets game. any suggestions?",
    "91": "@iamcardib Watch the Houston Rockets play. You eyes will thank you",
    "92": "@wojespn Should never have agreed to not play in the first place. It helps @HoustonRockets but does nothing for @JohnWall personally or trade value. He will get paid regardless so might as well play. That’s the only way to increase trade value",
    "93": "@wojespn Talk again on Sunday why the GM for the @HoustonRockets keeps making dumb moves it don’t mAke any sense he need to be in the line up now @RafaelStone12",
    "94": "@JohnWall @HoustonRockets yesss this what the fans in all of HOUSTON wants to see https://t.co/skodwV1ddl",
    "95": "The Rockets take on the Hornets tonight! Coverage begins at 6:30pm!\n\n@HoustonRockets | #Rockets https://t.co/eTrwoowE48",
    "96": "After pulling off a major upset, the Houston #Rockets would love to stay on a winning track in tonight's meeting against Charlotte #Hornets.\n\nFree #NBA75 picks here: https://t.co/shBCgVhQOa\n\n#AllFly #WeAreBMR https://t.co/oRFo6j1tGs",
    "97": "According to Adrian Wojnarowski, John Wall has told the Rockets he is interested in returning to the court for the team. \n\nWall and Houston made an earlier agreement for him to sit out as they looked for a trade:\nhttps://t.co/wnsxZN6dwp",
    "98": "@HornetsOnBally @hornets @HoustonRockets Hard to rest when I can’t even watch hornets games locally",
    "99": "@HoustonRockets @hornets @ATTSportsNetSW @SportsTalk790 We the fans wanna see @JohnWall thats why I pay my cable bill to see on @ATTSportsNetSW",
    "100": "need the @HoustonRockets to just buyout John Wall , he doesn’t fit us",
    "101": "@HoustonRockets @hornets @ATTSportsNetSW @SportsTalk790 Lite the fuse 🧨 rockets 🚀",
    "102": "Houston Rockets John Wall has expressed to the franchise that he wants to resume playing for the team in the future. #Wall #Rockets",
    "103": "@JohnWall u ballin tonight or naw? @HoustonRockets #Houston #rockets #NBA #comeonman",
    "104": "@projectbabyjae Yh you are, but being a Houston rockets/Chelsea supporter is😬😬😬",
    "105": "John Wall has been discussing playing for the Rockets again according to my sources. #HOUSTONROCKETS #JOHNWALL #Banchero #OklahomaState #NBA",
    "106": "One thing I am curious about now...John Wall wants to play and that's been made public. If Houston wants to continue to not play him, does the NBA step in and start issuing fines? Do the Rockets make him active, but keep him benched? I'm guessing he plays, but a weird situation.",
    "107": "ESPN's @wojespn revealed Saturday John Wall expresses his hopes to Houston Rockets and can resume playing in near future  https://t.co/VitDnOvlID",
    "108": "John Wall now wants to play for the Rockets, according to a report. My column on the matter Friday detailed how the previous mutual agreement for Wall to sit came about only after Houston told him he would have a limited role … which is still a hurdle:  https://t.co/wVVoNYPKr9 https://t.co/DoG9CFMwK7",
    "109": "Free John Wall! @HoustonRockets",
    "110": "@HoustonRockets @socios The logo that y’all continue to ignore like it ain’t our best logo",
    "111": "@lfcbradd @spectatorindex The Houston Rockets",
    "112": "@HoustonRockets @hornets @ATTSportsNetSW @SportsTalk790 Put Wall on the court!!! 🚀",
    "113": "@windy_winners @WindyVip @BMRReviews What do you mean “the Likes of Houston”? Rockets are my squad!!!\nHaha J/K They should’ve destroyed the Rockets",
    "114": "@HoustonRockets @hornets @ATTSportsNetSW @SportsTalk790 Will Coach Silas start with Alperen tonight? 🧐",
    "115": "@HoustonRockets @hornets @ATTSportsNetSW @SportsTalk790 DONT LET JOHN WALL'S BUM ASS RUIN THIS TEAM",
    "116": "@HoustonRockets @hornets @ATTSportsNetSW @SportsTalk790 Play wall",
    "117": "@wojespn Buy him out @HoustonRockets",
    "118": "@HoustonRockets @hornets @ATTSportsNetSW @SportsTalk790 Play John “better than westbrick” Wall",
    "119": "@HoustonRockets @hornets @ATTSportsNetSW @SportsTalk790 DONT FUCKINGGG PLAY JOHN WALL",
    "120": "@HoustonRockets @hornets @ATTSportsNetSW @SportsTalk790 Follow?",
    "121": "@ZachLowe_NBA For every game John Wall plays in Houston, he pays Texas state taxes of 0%. If he takes a buyout from the Rockets, does he pay Texas state taxes on the buyout? Then play elsewhere and save a lot of $$$ on taxes? May make sense to take a lower % of remaining deal.",
    "122": "@HoustonRockets @hornets @ATTSportsNetSW @SportsTalk790 GIVE J WALL MINUTES",
    "123": "@HoustonRockets @hornets @ATTSportsNetSW @SportsTalk790 LETS GET THIS W",
    "124": "I'm sure Houston would love to waive Wall...provided he gives back a sizable chunk of money in a buyout.\n\nHe's not going to do that, nor should he feel it necessary. Next year, when his contract becomes an expiring, it's a lot easier to move for the Rockets. https://t.co/JlpMYbWi29",
    "125": "John Wall and the Houston Rockets discussing a possible return to play.",
    "126": "ESPN story on John Wall and the Houston Rockets discussing a possible return to play: https://t.co/p7r9CboZf0",
    "127": "@HoustonRockets let @JohnWall play!!",
    "128": "@HoustonRockets plz don’t play John Wall",
    "129": "🇺🇸 John Wall has asked the Rockets to be reintegrated into active roster: talks are in progress, per @wojespn. Wall and HOU agreed he wouldn’t play while waiting for a trade \n\n🇮🇹 John Wall ha chiesto a Houston di essere reintegrato, per ESPN. Era fuori aspettando una trade",
    "130": "Houston Rockets guard John Wall has expressed his hopes to the organization that he can resume playing for the team in the near future. (Woj) https://t.co/NDiqFYnK5l",
    "131": "Houston Rockets rookie guard Jalen Green has been diagnosed with a strained hamstring and will be re-evaluated in one week. #HOUvsCHI",
    "132": "@blakjordanbreen Wants to open dialogue with Houston Rockets to return to play.",
    "133": "John Wall will, probably, play basketball this season with the Houston Rockets. \n\nThat's a great, great, great new. Wow I am happy!🏀❤\n\n #basketball #JohnWall #NBATwitter #NBA #NBATwitterLive #HoustonRockets",
    "134": "@BullsGotNext As a lakers fan, we are no better then the Houston rockets.",
    "135": "Although Houston #Rockets G John Wall and the team agreed Wall would sit out until a trade partner is found, Wall has told the team he wants to reopen that topic and potentially play for the team in the meantime per ESPN. #NBA https://t.co/fnEdr8ZKOd",
    "136": "@wojespn Buy him out @HoustonRockets",
    "137": "John Wall, Houston Rockets Notice That John Wall Has The League's Worst Contract And Less Than Negative Trade Value https://t.co/Lq9c9xadAI",
    "138": "Wall and Rockets had agreed on him sitting out until a trade could be found, but the five-time All-Star guard talked to Houston general manager Rafael Stone on Friday about restarting a dialogue on a return to the active roster, sources said. Sides plan to talk again on Sunday. https://t.co/OY9pZS7XFS",
    "139": "Houston Rockets guard John Wall has expressed his hopes to the organization that he can resume playing for the team in the near future, sources tell ESPN. Story soon.",
    "140": "houston rockets/chelsea supporter is a fine babe",
    "141": "@HoustonRockets @socios It’s absolutely 2 the best era of Rockets basketball without question https://t.co/3KOWb1yYov",
    "142": "@HoustonRockets @socios Over 40 years",
    "143": "@HoustonRockets @socios #1 will always be my favorite",
    "144": "meet #biggie -- 🐱 of @ncturnbough #blackcat #catsofinstagram (side note: go @houstonrockets tonight!) https://t.co/y7ghJECpjH",
    "145": "@HoustonRockets @socios #2 for the 2 championships … so far ! 🤟🏽🚀",
    "146": "@HoustonRockets @socios Didn't the rockets start out in San Diego?",
    "147": "https://t.co/OjRuuvKdY2\nOn October 31st, 2021 the Lalers played the Houston Rockets.. this is a fb post of mine that I researched and there's 2 @KingJames,one playing in the game, one popcorn eatin is cloning or time travel real? You be the judge.  Its odd that it's on Halloween",
    "148": "@AllLifeLong @DJSCHEME_ @HoustonRockets Ikr praying",
    "149": "@HoustonRockets @socios WHOSE MAN PICKED #1 #2 is legendary, they ran it back again with the greatest player in franchise history, and it just looks dope! https://t.co/OHw39sRLka",
    "150": "@HoustonRockets @socios I need option 5. 2 is clearly the most iconic one.. But this one is what I grew up with. https://t.co/HH937TayBP",
    "151": "• 🏀@NBA \n\n@Timberwolves vs @sixers \n@nyknicks vs @ATLHawks\n@Suns vs @BrooklynNets \n@OrlandoMagic vs @cavs \n@MiamiHEAT vs @chicagobulls \n@hornets vs @HoustonRockets \n@WashWizards vs @dallasmavs \n@PelicansNBA vs @utahjazz https://t.co/dIjL554RYn",
    "152": "@MGSportsTalk @TheofficialEG10 @HoustonRockets That was really cool of you @TheofficialEG10! You truly have the heart of a Houston Rocket.",
    "153": "The Houston Rockets Terik Black had 69 points 24 rebounds.",
    "154": "@HoustonRockets @socios Me being confused as to why my dad was blowing the horn and running around the house super happy! That was 95! 😌",
    "155": "Workday #Selfie! Let’s go @HoustonRockets! https://t.co/ngi27trkPz",
    "156": "#Rockets Chatter presented by Topo Chico\n\nKevin Porter Jr talks the role the bench played in Wednesday's win over the Bulls\n\nRockets take on the Hornets tonight.\nCoverage begins at 6:30PM on AT&amp;T SportsNet\n\n@HoustonRockets \n@topochicohard \n#TopoChicoHardSeltzer https://t.co/Xl1EXKHc1q",
    "157": "🏀 #NBA\n\nCharlotte Hornets 🆚 Houston Rockets\n📆 Dom 28 nov 02:10\n\n#Raspibets #FreePicks #FreeTips #StatBets #SportsBetting #BettingTipster #AllFly #Rockets\n🆓🔎📈⬇ https://t.co/r5cY6JHwk3",
    "158": "I need a triple double tonight @MELOD1P but I also need you to lose to the @HoustonRockets 😂",
    "159": "@MGSportsTalk @TheofficialEG10 @HoustonRockets Dudee you’ve been killing it!! keep it up!! 🔥🔥🔥",
    "160": "@HoustonRockets @socios The fact that people like the shark mouths just as much as Ketchup and Mustard disgusts me.",
    "161": "@HoustonRockets I take all of my Theis slander back. Give him all the minutes. Yes, I watched Duke-Gonzaga yesterday, why do you ask?",
    "162": "Charlotte Hornets vs Houston Rockets 11/27/2021 Picks Predictions Previews\n\nhttps://t.co/kDF39tXt4g\n\n#odds #picks #NBA #NBApicks #NBAparlay #NBAbetting #NBAprediction #expertpicks #basketballpicks #freepick #freepicks #sportsbetting #handicapper #sportspicks #Hornets #Rockets https://t.co/dcdKpH529e",
    "163": "Favorite Sports Teams Ever By Order!!!\n1)CAROLINA PANTHERS \n2)MICHIGAN WOLVERINES\n FOOTBALL \n3)HOUSTON ROCKETS \n4)MICHIGAN BASKETBALL",
    "164": "November 27, 2015: Houston #Rockets SG James Harden scored 50 points in a 116-114 win over the 76ers that gave Philadelphia its 27th consecutive loss, the longest losing streak in professional sports history which ended at 28 https://t.co/tbzLJd8yo4",
    "165": "@HoustonRockets @socios Ketchup and Mustard. Number 2 forever",
    "166": "Christian Wood REACTS to Houston Rockets getting their 2nd WIN of the se... https://t.co/BLaXgc9yw6 via @YouTube",
    "167": "@wasteph_wes @HoustonRockets @socios Ketchup and mustard",
    "168": "@HoustonRockets @socios I moved to Houston because of the Rockets (my dad worked for the Summit Corp). So, 3 it is",
    "169": "Day 61 of asking @HoustonRockets for a follow",
    "170": "@HoustonRockets @socios The fact that any of then are close to No. 2 shows the how poverty this fan base is.",
    "171": "Mason Plumlee is out again tonight against the Rockets in Houston.",
    "172": "@MGSportsTalk @TheofficialEG10 @HoustonRockets You’re getting really good at this dude. Keep it up!",
    "173": "@HoustonRockets @socios I’ve been a fan since these were at the top of the #Billboard 100. 😳😂 https://t.co/7V47waOgAT",
    "174": "@MGSportsTalk @TheofficialEG10 @HoustonRockets holy W",
    "175": "@HoustonRockets @socios The summit in ‘02🥺",
    "176": "Here is my interview with Eric Gordon @TheofficialEG10!!! Check it out on my YT channel: https://t.co/TlsNtNYcnU Thanks EG for doing this-he was so nice and gave insightful answers! Thank you @HoustonRockets for setting this up! We talked shooting, defense &amp; mentality! #Rockets https://t.co/3f8dks9kAz",
    "177": "@HoustonRockets NBA looking hard for another narrative. What happened to your golden boy?",
    "178": "@chargerss979 @HoustonRockets @socios Said no one ever",
    "179": "@HoustonRockets @socios Whoever I'd picking that ugly ass blue monstrosity is not a rockets fan. I hated that logo because they switched it right after our back to backs and we were garbage in those uniforms. Plus it only lasted 8 seasons so clewry even the organization thought it aucked as well.",
    "180": "@HoustonRockets @socios We need to go back to 2. Or 3. 🤤🤤",
    "181": "Happy birthday to Avery Bradley of the Boston Celtics #averybradley #bostonceltics #detroitpistons #losangelesclippers #memphisgrizzlies #losangeleslakers #miamiheat #houstonrockets https://t.co/SBbM0RRXwQ",
    "182": "Houston's Weekend Planning Guide Tonight! #Rockets and #Hornets @ToyotaCenter https://t.co/2qldtsru3M https://t.co/720PwrwfxO",
    "183": "Nobody fears the Lakers\n\nFunny thing is, I didn’t realize they only have won one game this year by 10+ points. And that’s the Houston Rockets (the worst team in the league) https://t.co/XlcfeRCJcA",
    "184": "@_Kiara_22 @HoustonRockets Back in the 70s I believe",
    "185": "@HoustonRockets @socios This is how I grew up! #TheSummit #HoustonRockets https://t.co/r8m0QmYUxz",
    "186": "@HoustonRockets @socios 1 &amp; 2, but its consensus. NOBODY is fw #4...toss it",
    "187": "@HoustonRockets @socios YAO bring me into rockets",
    "188": "The Houston rockets have only won 2 games.",
    "189": "@HoustonRockets @socios This one https://t.co/m751UTP3Vz",
    "190": "@HoustonRockets @marioelie1 Happy BirthDay to you MARIO!! THE JUNKYARD DOG STRIKES  AGAIN! H-TOWN LOVES YOU MANE💯",
    "191": "@HoustonRockets @socios Number 1 leading this poll has got to be some kind of troll job.",
    "192": "@KungFuDragon5 @HoustonRockets @socios Yeah bro I’m 20",
    "193": "@HoustonRockets @socios I’ve been a fan since the Dark Age, post-Olajuwon and Barkley.",
    "194": "@HoustonRockets @socios None where’s the 2004-2020 logo",
    "195": "@HoustonRockets @socios 2. And we should re-use that logo for good. The other three are ghastly.",
    "196": "@HoustonRockets @socios Since these two have been racing https://t.co/FjuOT6CmyT",
    "197": "@timberwolves were no contest for the @hornets. Let’s keep it going tonight by showing maturity against a scrappy @HoustonRockets squad. Awesome first 1/4 of the season #AllFly",
    "198": "@HoustonRockets @socios Definitely not number 4",
    "199": "@HoustonRockets @socios No. 2 will always be the one.",
    "200": "@HoustonRockets @socios Can the original get some love https://t.co/JnRa4wcEd3",
    "201": "@HoustonRockets @socios The only #houstonrockets gear I wear has that classic mustard and red logo number two ... That's the last time they were absolutely dominant on both ends of the floor.",
    "202": "@HoustonRockets @socios all of em ❤️🚀",
    "203": "NBA Games Today: 🔥🔥🔥\nMinnesota Timberwolves vs Philadelphia 76ers\nPhoenix Suns vs Brooklyn Nets\nNew York Knicks vs Atlanta Hawks\nMiami Heat vs Chicago Bulls\nCharlotte Hornets vs Houston Rockets\nOrlando Magic vs Cleveland Cavaliers",
    "204": "@HoustonRockets @socios 2 for me🤟🤟🤟",
    "205": "@HoustonRockets @socios 2 I've been a fan since I was born",
    "206": "@HoustonRockets @socios That is a no-brainer. First one.",
    "207": "@HoustonRockets @socios Yao and Tmac days",
    "208": "@HoustonRockets @socios I didn’t even know 3 ever existed",
    "209": "@HoustonRockets @socios They all look amazing to me https://t.co/aYhLRf5lIu",
    "210": "@HoustonRockets @socios Start Sengun and fire Silas. Also, give Queen a contract and cut House. Trade EG and Wood too. What a terrible organization",
    "211": "@HoustonRockets @socios 1 is the best",
    "212": "NBA basketball team the Houston Rockets has partnered with NYDIG, a leading bitcoin solutions provider, to be the team’s official bitcoin services partner. The deal will provide the team with… https://t.co/4xolAPHdkK",
    "213": "@j_stevens6 The media pick and choose to hate and love…….they always bring up the negatives with Russ never the positives(Iverson example) Rockets and Wizards was just a 1yr rental it wasn’t long term Russ had career years with both Houston front office had a Harden problems ISO ISO",
    "214": "@CamMarshallFilm @HerroLegacy @C_Friedel88 @espn @DukeMBB No, I'm hoping that makes Houston Rockets draft Banchero. They need a PF",
    "215": "Got 4 Free Tickets To The @HoustonRockets Game Tonight Against The Hornets. Really More Excited To See LaMelo Ball Then Anything.",
    "216": "🏀 Nov. 27, 1984: Hakeem Olajuwon grabs 19 rebounds to go with 27 points in the Houston Rockets' 114-97 win over the Spurs to improve to 11-4.\n📋 Box score: https://t.co/biBa1XJxC6 https://t.co/CNPfJReLWR",
    "217": "@ActionNetworkHQ @HoustonRockets get winning streak to 2 over @hornets ! #UpsetAlert",
    "218": "The Houston Rockets P.J. Tucker had a tripping call for tripping the mascot.",
    "219": "New #Rockets from Houston Chronicle — Rockets vs. Hornets: 5 things to watch https://t.co/sA1yktQIct",
    "220": "This is Houston.\n\nOn the latest episode, @WRBolen explains his “This is Houston” mentality, evaluates the Verlander signing, levels with disgruntled Rockets fans, and more!\n\nListen on Spotify: https://t.co/umCOUxVndn\n\nApple Podcasts: https://t.co/4pPQf7Tjq5 https://t.co/bAEh0MOAK2",
    "221": "@HoustonRockets BRING HIM UP AND GIVE HIM MINUTES https://t.co/RMmHKoRgmR",
    "222": "@84baseballcards @HobbyConnector @sports_sell @sportsfanmedia @CardboardEchoes @TheHobby247 @dwdsportscards @BST_Calendar @CardHobbyRTs @AiMCollectibles 2021 Golden State Warriors Lot $30 OBO\n2021 Houston Rockets Lot $13 Shipped\n2021 Indiana Pacers Lot $$15 Shipped\n2021 Los Angeles Clippers Lot $15 Shipped https://t.co/PdkwezzzJT",
    "223": "Today on the Hornets Hive Cast:\n\nA review of the @hornets win over Minnesota and season high scoring performance.\n\nPlus a preview of tonight's game in Houston against the Rockets.\n\n@Rob_Longo and @sam_perley break it down and set you up on today's HHC\n\nhttps://t.co/OqDLGfQBZi",
    "224": "Seriously. Lets Rebuild The Houston Rockets. They Need Help. https://t.co/VXu2rx1mPm via @YouTube",
    "225": "🏀 #NBA\n\nCharlotte Hornets 🆚 Houston Rockets\n📆 Dom 28 nov 02:10\n\n#Raspibets #FreePicks #FreeTips #StatBets #SportsBetting #BettingTipster #AllFly #Rockets\n🆓🔎📈⬇ https://t.co/Xts3G07mJV",
    "226": "@GQSports @JalenGreen @HoustonRockets lol H-Town's future lol sad for us!!",
    "227": "@vDodun @hornets @HoustonRockets @NBA Against a team that hasn’t played since Wednesday night",
    "228": "DasHaus made a bet!\n\nEvent: Charlotte Hornets vs Houston Rockets #NBA\nBet: Houston Rockets TO WIN +6\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "229": "DasHaus made a bet!\n\nEvent: Charlotte Hornets vs Houston Rockets #NBA\nBet: Charlotte Hornets TO WIN -6\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "230": "New from Houston Chronicle — Rockets vs. Hornets: 5 things to watch https://t.co/VZtIuyxbAc",
    "231": "Initial thoughts on the NBA slate; \n\nMavs ? \nCavs as favorites ?!?\nIs Phoenix a public dog? 👀\nLot of unrested teams queries today.\nHouston Rockets ☕️",
    "232": "Good morning #RocketsTwitter! Our organization is literally filled with talent from the @HoustonRockets to the @RGVVipers. Our future is bright so stay positive! Go #rockets #NBA75 #gleague #LightTheFuse https://t.co/KWRhhnrEyy",
    "233": "Houston: Remember Steve Francis?  Well-intentioned nostalgia pop, but if you’re going to make that play, bring back the rocket with a face, you cowards!  Also the contrasting fonts is especially gross here.  4/10 https://t.co/TUXmSvbYOu",
    "234": "@cgalloway704 @hornets @HoustonRockets @NBA Agreed. I know some teams have hired nutritionists and sleep specialists to tell the players when and what is the best time to eat and sleep",
    "235": "@vDodun @hornets @HoustonRockets @NBA I don't think they consider that honestly",
    "236": "@Allen_Reid @HoustonRockets @TilmanJFertitta Cool!",
    "237": "@cgalloway704 @hornets @HoustonRockets @NBA Where’s the financial incentive though? Wouldn’t you want them to be fully rested for a more competitive game?",
    "238": "￼Purchase 2022 Houston Rockets Basketball Tickets for Home and Away Games – All Levels of Seating Available with Promo Code CHEAP https://t.co/45WRcsaYnx",
    "239": "The @hornets finished playing last night around 9:30 pm EST. In less than 24 hours, they would’ve gotten on a plane, flown to another time zone and have played at least 1 half of basketball vs the @HoustonRockets. The @NBA doesn’t have a problem with this?",
    "240": "@rgvsports This Vipers team might give their parent team (Houston Rockets) a good game. Go Vipes!",
    "241": "#Hornets gameday 🐝\n\n🏀 vs. Houston Rockets \n📍- Toyota Center \n⏰- 8:00 PM\n\n#AllFly https://t.co/R5vMxitKNQ",
    "242": "NY Knicks x Atlanta Hawks\nNBA LEAGUE PASS\n22:00 – Miami Heat x Chicago Bulls\nNBA LEAGUE PASS\nOrlando Magic x Cleveland Cavaliers\nNBA LEAGUE PASS\nCharlotte Hornets x Houston Rockets\nNBA LEAGUE PASS\n22:30 – Washington Wizards x Dallas Mavericks\nNBA LEAGUE PASS\n\n(+)",
    "243": "The Houston Rockets James Harden had a tripping call for tripping the mascot.",
    "244": "@sportscardsfl @TonysCards @TheHobby247 @sports_sell @BST_Calendar @84baseballcards @HobbyConnector 2021 Golden State Warriors Lot $30 OBO\n2021 Houston Rockets Lot $13 Shipped\n2021 Indiana Pacers Lot $$15 Shipped\n2021 Los Angeles Clippers Lot $15 Shipped https://t.co/PtilRx5Kxb",
    "245": "Houston Rockets Especial Initial https://t.co/UBdfNkfSmX",
    "246": "The Houston Rockets Clint Capela had the Run DMC CD playing during the game.",
    "247": "The Houston Rockets Nene had 64 hotdogs in his pockets while playing.",
    "248": "/r/CharlotteHornets: Charlotte Hornets @ Houston Rockets [11/27/21 - 8:00 PM ET] #AllFly https://t.co/3mblBuU96s",
    "249": "The Houston Rockets P.J. Tucker had a terrible warmup and won't play.",
    "250": "Rockets hope to slow hot-shooting Hornets  #NBA\n #HoustonRockets #Rockets50 #hornets https://t.co/XpjsTvYXM7",
    "251": "The Houston Rockets Trevor Ariza had 64 hotdogs in his pockets while playing.",
    "252": "RT @iamRyanYung: What's good! I am LIVE NOW on Twitch! Come join the stream and talk basketball with me or just watch me game! https://t.co/0QK3J8JrW9 #NBA #Warzone #HoustonRockets #Rockets #Gaming #Twitch #Basketball #CallofDuty  #Vanguard #PS5",
    "253": "The Houston Rockets Luc Monte had a falling out with his uncle billy.",
    "254": "@abc13houston ⁉️Who can step in to help with donations, please⁉️ @DowNewsroom @HEB @ATT @Verizon @Randalls_Stores @LosAstros @astros @HoustonTexans @Beyonce @HoustonRockets @Target @Walmart @amazon @MissyElliott @rihanna @common @JLo",
    "255": "@Travonne the trade would be hilarious considering the wizards/rockets trade. but wall and gordon for russ, THT, nunn, and picks (houston will buyout russ so need incentives). who says no?",
    "256": "@Lakers Unbelievable I'm done watching the lakers I will switch over to the Houston rockets where they know how to win games",
    "257": "@baconenhanced @marioelie1 @HoustonRockets @bull50 @SInow They don't sell the championship rockets season or tapes in 94 95 they did but really I have to find a way to send it to you bro we both Houstonians and I pray 🙏 imma have to find a way to get you its an experience we never forget",
    "258": "@rockhettired That's exactly right! For some reason sports media hates Houston. They've discredited all of our championships comets rockets stros they love to hate us!",
    "259": "@heelsonhardwood @HoustonRockets @Jaygup23 is so good for t.v. and always positive and fun...........even when things are a little rocky, unknown, or out of the sorts........he adapts accordingly.",
    "260": "Oklahoma City Thunder vs. Houston Rockets | USA: NBA\n📺 Link to Watch =&gt; https://t.co/SYZJrEczzr\nThis match will start at 08:00 PM, November 29, 2021\nVenue: Toyota Center (Houston)\nPlease Like and share, thank you https://t.co/2Wu6l3cUh1",
    "261": "@HoustonRockets Silas crying…",
    "262": "Houston Rockets vs. Charlotte Hornets game preview, in which...wait streaks come in a winning flavor too? https://t.co/DgkM2Sp8In",
    "263": "A new trade suggestion has the Philadelphia 76ers moving Ben Simmons to the Houston Rockets.  https://t.co/n2rkAN1JUY",
    "264": "Paolo will be a Houston rocket next year.",
    "265": "BLAZERS UPRISE POSTGAME SHOW!\n\nThe Blazers lose to the Warriors and are now 1-9 on the road this season. The only team worse on the road is the Houston Rockets. Come chat about the game with us!\n\nhttps://t.co/aWv4GIzYBK",
    "266": "The Houston Rockets James Harden had 69 points 24 rebounds.",
    "267": "yeah @HoustonRockets. It better be Paolo Banchero by any means necessary next summer. https://t.co/nEt8AdF8d4",
    "268": "FREE @JohnWall @NBA @HoustonRockets https://t.co/SBaRhu9wxD",
    "269": "Banchero hamstring issues?\n\nHe'll fit right in @HoustonRockets",
    "270": "What's good! I am LIVE NOW on Twitch! Come join the stream and talk basketball with me or just watch me game! https://t.co/5hvwiGm0hS #NBA #Warzone #HoustonRockets #Rockets #Gaming #Twitch #Basketball #CallofDuty  #Vanguard #PS5",
    "271": "On this day in sports history November 27, Houston Rockets Shooting Guard James Harden recorded 50 Points, 9 Rebounds, and 8 Assists in a 116-114 win against the Philadelphia 76ers in 2015.",
    "272": "@Pp_doesit is the truth!! Hands down #1 pick @HoustonRockets 🚀 @RafaelStone12",
    "273": "Houston Rockets rookie Jalen Green has a strained left hamstring and will be re-evaluated in a week, coach Stephen Silas said. https://t.co/LSIuyp6GUC",
    "274": "This #DukevsGonzaga game is fantastic. I’ve been a fan of @ChetHolmgren since I first saw his junior year highlights. If the @HoustonRockets get the choice of Chet or Banchero it boils down to who fits best next to Green and Alpy. Either way… the 2023 #Rockets look 💯",
    "275": "🏀 Nov. 26, 1993: Hakeem Olajuwon has 36 points, going 10-for-10 from the line, as the Houston Rockets rise to 12-0, beating the Kings, 92-89.\n📋 Box score: https://t.co/yo6Nk9JiSR\n📼 Video: https://t.co/d2s4UICPHi https://t.co/TxjkIampfh",
    "276": "Fresh off ending a 15-game skid, the Rockets are hoping to start their first winning streak when Charlotte visits Houston on Saturday night.  https://t.co/W2mM5D47Ir",
    "277": "Future Houston Rocket https://t.co/pqw6tOm5Vs",
    "278": "Tonight’s post-game interview with @HoustonRockets Assignee Josh Christopher. #jaygup #houstonrockets #sidelinereporter https://t.co/edTI03CtxF",
    "279": "🏀 Nov. 26, 1985: John Lucas has 18 assists and is one of seven Houston Rockets scoring in double-figures in a 130-108 win over the Warriors.\n📋 Box score: https://t.co/S2cClYKgPX https://t.co/GI1fKx3ean",
    "280": "NBA ML. Date: 11-27\nCharlotte Hornets vs Houston Rockets. 0.55%\nKambi. Hornets @ -200\nFanDuel. Rockets @ +205\n#arbitrage #bettingtwitter #bettingpicks #sportsbets #freepicks #freemoney #mlb",
    "281": "Oh I want to go ahead and congratulate the Houston Rockets for winning their second game of the season at some point I’m not sure when but congratulations💀",
    "282": "The Houston Rockets P.J. Tucker had two chains.",
    "283": "Wtf bring him back up @HoustonRockets and play him https://t.co/PIb9patfbp",
    "284": "Just got the @HoustonRockets to a back to back championship. W or L?",
    "285": "@WallScored @HoustonRockets Hes gonna be impactful for the team. GOAT",
    "286": "JAYGUP WITH A 30 BOMB?!?!?!\n\n@HoustonRockets BRING EM BACK",
    "287": "@Vengeancewood @NotNope__ @MapuaTofu @HoustonRockets Not nope deserves the follow, just like much others, and I would like one too 🗿",
    "288": "Future Houston Rocket Paolo Banchero is BALLIN",
    "289": "Alright I seen enough Paolo gang @HoustonRockets https://t.co/PR9RAv7Aud",
    "290": "Future Houston Rocket Paolo Banchero at the half:\n\n- 20 PTS\n- 4 REB\n- 2 AST\n- 1 STL\n- 8/13 FG (62%)\n- 3/6 3P (50%)\n\nGet this man a #Rockets jersey NOW!!! https://t.co/ejFIft8Law",
    "291": "@GoodmanHoops Banchero will look sharp as a power/stretch 4, in an NBA Houston Rockets uniform, as a number #1 pick. Got an NBA ready physique, solid shooting form, power drive to the rim, 3 ball range",
    "292": "@criadocurry @LoyalSpot CURRY PAI DO HOUSTON ROCKETS",
    "293": "Paolo Banchero for Duke should be on Houston Rockets radar, because Houston will likely get a top 3 draft pick again for 2022",
    "294": "Paolo Banchero is definitely going to be a future Houston Rocket",
    "295": "@KingJosiah54 Future @HoustonRockets 👏",
    "296": "Future Houston Rocket Paolo Banchero is putting on a show right now.\n\nHis confidence in his 3pt shot is a really good sign. He can play a little bully ball as well.\n\nPutting on for the city 👏🏾",
    "297": "If these previous games haven’t shown you Jokic is the mvp idk what will. We’re on a 4 game losing streak without him and have been blown out in 3/4 of them. This team is like the Houston rockets without Jokic",
    "298": "Hear me out hear me out… IF Paolo Banchero goes to the Houston Rockets, the nickname for him and Jalen Green should be PB &amp; J… #Rockets https://t.co/muBhTv1abt",
    "299": "@RocketKelly1 @HoustonRockets I want him too @okcthunder",
    "300": "The @HoustonRockets are so lucky they get to draft Paolo Banchero next year",
    "301": "@Itamar_17_10 FUTURE HOUSTON ROCKET LETS GO",
    "302": "@itsjustTaj_ Houston Rockets",
    "303": "I want Paulo Banchero @HoustonRockets",
    "304": "future Houston Rockets legend https://t.co/lWHgwHgjeY",
    "305": "FUTURE HOUSTON ROCKET https://t.co/yyS9YFa5fe",
    "306": "@ht0wngary Paolo Is A Houston Rockets For Sure",
    "307": "@HoustonRockets Paolo no matter what",
    "308": "Paola is the one @HoustonRockets",
    "309": "This is true. If the Celtics were the Houston Rockets, they'd be 2-16. https://t.co/uBM5znmmwD",
    "310": "@KeithSmithNBA Sick of that being the rhetoric. Either figure it out something has to happen at the deadline. That simple. 10-10 is unacceptable. This is not the Houston Rockets.",
    "311": "keep losing @HoustonRockets",
    "312": "@tyyreturns @JalenGreen @HoustonRockets @TooColdOrg This a w",
    "313": "Banchero is gonna be the #1 pick next year @HoustonRockets",
    "314": "I hope the @HoustonRockets are watching this Duke v Gonzaga game",
    "315": "@FanDuel Houston Rockets",
    "316": "@BiasedHouston @HoustonRockets PLAY HIM",
    "317": "Houston Rockets: Bulls vs. Magic final score: Chicago bounces back with 123-88 blowout win https://t.co/q4oAYBuK5K",
    "318": "A HOUSE DIVIDED \nHouston Rockets / Iowa Wolves https://t.co/JYdcUZzc0E",
    "319": "NYDIG partners with Houston Rockets basketball franchise, plans to pay team in BTC https://t.co/8Z1I6dFACD\nhttps://t.co/yPPKkGuiUS",
    "320": "@Itamar_17_10 the @HoustonRockets should recall him because of the Green injury . he will help 🤷🏽‍♂️ @RafaelStone12",
    "321": "@0801Broly @HoustonRockets Same here bro",
    "322": "Houston Rockets rookie Jalen Green has a strained left hamstring and will be reevaluated in a week, coach Stephen Silas said. https://t.co/dhEs6dm7Tl",
    "323": "@larice_21 The Houston rockets might not beat Duke by 50.",
    "324": "@JazminMBrown7 @HoustonRockets @TheBullHouston And we love you / so glad y’all had fun",
    "325": "@NotNope__ @MapuaTofu We WILL get @HoustonRockets to follow the best account @NotNope__ someday",
    "326": "@HoustonRockets SUGA of BTS is a big basketball fan.",
    "327": "We look like the Houston Rockets right now",
    "328": "No time to rest!\n\n@hornets back on the road tomorrow night to take on the @HoustonRockets!\n\nCatch all the action right here on Bally Sports Southeast! ⤵️\n\n#AllFly https://t.co/ir0i00FZVe",
    "329": "@Vengeancewood I agree and Houston rockets is mutual with everyone lol",
    "330": "Actually the Houston Rockets and I are mutuals so I think you’re wrong https://t.co/HYAoBXzetf",
    "331": "Prove her wrong @HoustonRockets 😤 https://t.co/PGlopXnt7f",
    "332": "Hornets defeat the t-wolves 133-115\n\nOubre: 27 pts off the bench\nBall: 10 pts, 6 rebs, 13 ast\nHayward: 18 pts, 6 rebs, 6 ast, 3 blks\n\nThis was the Hornets largest margin of victory this season.\n\nThey travel to Houston to take on the Rockets tomorrow night.",
    "333": "Tell the truth......the @HoustonRockets  draft was great... the @Kevinporterjr  trade was genius...the @JHarden13  trade landed us quality youngsters..thus far the fro n t office hasn't made a misstep in mY eyes...just terrible coaching...facts",
    "334": "I HIGHLY RECOMMEND TOU FOLKS WATCH @DukeMBB VS. @ZagMBB ON @espn TONIGHT....\n\n....that is if you want to see at least one future @HoustonRockets.\n\n#Rockets",
    "335": "@ProfitablePlay @Kelly_K_9 Ha! You're funny. I don't follow basketball at all. I am in Houston so I know the rockets have lost a lot. Baseball I don't enjoy.  And you're a rangers and mavs fan? Since birth?",
    "336": "Game 18 of the 2021-2022 #BostonCeltics season. Houston Rockets @ Boston Celtics",
    "337": "New #Rockets from Houston Chronicle — Garrison Mathews goes from G League to key contributor in Rockets halting skid https://t.co/FWctjRFC8K",
    "338": "The Houston Rockets P.J. Tucker had a falling out with his uncle billy.",
    "339": "@indywright It will take a very big set of cajones.  China is not playing for second place.  They basically threw threw the Houston Rockets out of China when their GM spoke up on Hong Kong.  They will try to ruin you and everything you are associated with.",
    "340": "Bulls playing a solid 3rd quarter tonight, this needs to happen every night whether it’s Golden State, or the Houston Rockets!",
    "341": "Houston Rockets: Why Stephen Silas is not the Houston Rockets:  problem https://t.co/qiQBU78tjj",
    "342": "@kateefeldman The @HoustonRockets care about me and I'll take no other answer",
    "343": "@marioelie1 @ATTSportsNetSW @HoustonRockets Happy Birthday!  Loved watching you and Rockets play back in the day!  Junk Yard Dog",
    "344": "Still a @HoustonRockets fan, im here for the experience 🤞🏼🛩 https://t.co/hNkNWJiPVz",
    "345": "According to https://t.co/9f5L473oQk the Chicago Bulls win their game vs the Houston rocks 90% of the time based on the shots both teams took.\n\nRockets were expected to score 11 less points on three pointers but \n\nFinal was 118-113 Houston.",
    "346": "The Houston Rockets have had endured a tough start to the season. @CameronPDavis details why Stephen Silas shouldn't be the scapegoat https://t.co/G6STe44BSB"
}