{
    "0": "ALERT: New high roller bet posted!\nA bet has been placed for $6,299.21 on San Antonio Spurs - Indiana Pacers to win $11,653.54.\nTo view this bet or copy it https://t.co/Um59Yt9gYz https://t.co/wl7zYyNZ53",
    "1": "NBA: Buddy Hield will have at least 5 Assists against San Antonio Spurs -118 \n#NBA",
    "2": "San Antonio Spurs Starters:\n\nTre Jones\nJosh Richardson\nDevin Vassell\nDoug McDermott\nZach Collins\n\nPlayers out:\nDevontae Cacok\nKeldon Johnson\nRomeo Langford\nDejounte Murray\nJakob Poeltl\nJoe Wieskamp\n#PorVida #NBA #NBATwitter #NBA75",
    "3": "San Antonio Spurs to sell 1,336 NFTs for charity in honor of Gregg Popovich becoming NBA's all-time winningest coach #crypto #NFT #NFTs #NFTCollection #NFTCommunity #NBA \nhttps://t.co/q7E6Vb2YYR",
    "4": "Tonight's starting lineup for the San Antonio Spurs: Jones, Richardson, Vassell, McDermott, Collins https://t.co/bVWH4AMCA2",
    "5": "Howdy Partner 🤠\n\n#Pacers take on the Spurs in a half an hour from San Antonio!\n\nRead my preview here!\nhttps://t.co/XNbEdqiuI2",
    "6": "Uniforms for Indiana Pacers vs San Antonio Spurs at 5:00 PM.\n\n#GoldBlooded #PorVida https://t.co/vq1YOpsmMF",
    "7": "San Antonio Spurs (2014) https://t.co/4Jz4FmnnQn",
    "8": "Today's NBA Picks: 8:10 PM ET - Indiana Pacers vs. San Antonio Spurs - 24 PICKS AVAILABLE: https://t.co/qYtyi1oTKX #nba",
    "9": "NBA Betting Preview: Indiana Pacers vs. San Antonio Spurs - Saturday, March 12, 2022 https://t.co/T1hGuPvGvt",
    "10": "San Antonio Spurs",
    "11": "The San Antonio Spurs are honoring head coach Gregg Popovich’s 1,336 record-breaking career wins in a special way—with NFTs. https://t.co/W3RyKOIvtT",
    "12": "@zunderscore Heck yes.\n\nWe had a spot like this in college.\n\n100% you could roll up with $10 in your pocket and get FED.\n\nThey had tons of ancient San Antonio Spurs memorabilia on the wall, covered in dust (a great indicator of good food)",
    "13": "@jeffpearlman Would the story of the San Antonio Spurs dynasty be the most boring possible book of a high level team? Or is there a more boring dynasty?",
    "14": "Way to go, Pop! 😎😎\n\nThe NBA, San Antonio community reacts to Spurs' Popovich's coaching milestone https://t.co/9Qfw49Lm2P #porvida #nba75 #nbatwitter",
    "15": "Is the 73-year-old steward of the San Antonio Spurs the greatest coach of all time? @YahooSports 🏀\nhttps://t.co/e9wsSh4Vk7",
    "16": "New Orleans Pelicans 120-142 Charlotte Hornets \nSan Antonio Spurs 104-102 Utah Jazz\nPhoenix Suns 112-117 Toronto Raptors \nLos Ángeles Lakers 122-109 Washington Wizards",
    "17": "The LWOS Contenders or Pretender series continues with the San Antonio Spurs. Our Kevin Nivek @kevnivek_  determines which category this team falls under. #NBA #NBA75 \n\nhttps://t.co/EzWQFvHyhg",
    "18": "INDIANA PACERS vs\nSAN ANTONIO SPURS, 9:00PM.",
    "19": "@SunsAreBetter I have seen worse. San Antonio Spurs playoff series when the NBA fixed it for the Spurs to win",
    "20": "@spurs Love this video…ALL San Antonio Spurs. GSG 🔥🔥🔥",
    "21": "Tokyoite Spurs fan embarks on 17th trip to San Antonio to see his team - My San Antonio 🖤🖤🖤🖤🥺🥺🥺 https://t.co/eZCcPDczmi",
    "22": "Gregg Popovich’s biggest win was making America confront uncomfortable truths | San Antonio Spurs https://t.co/VXS2TggUIB",
    "23": "Gregg Popovich’s biggest win was making America confront uncomfortable truths | San Antonio Spurs https://t.co/oMn5adus6J",
    "24": "San Antonio Spurs Predictions and Preview for 3/12/2022 hosts Indiana Pacers.  Find out who we are taking in this matchup. #Basketball #NBA https://t.co/CkNuO3LL0y",
    "25": "San Antonio #Spurs to release special NFT collection in honor of head coach Gregg Popovich all-time wins. https://t.co/bVkX9k6RKb",
    "26": "Gregg Popovich’s biggest win was making America confront uncomfortable truths | San Antonio Spurs https://t.co/4VUkhJZPjE",
    "27": "@mcuban Pop is a class act.  I'm a Mavs fan through and through but loving in San Antonio and catching a few Spurs games makes me appreciate the genius Pop brings to the game.  Just no more wins vs the Mavs!!!",
    "28": "@MemphisX_NBA @CozyLito @Benny_Profane_ @YrAvgRocketsFan @MadManLeaks @wokelonzo @jmere09nyc @PauloAlvesNBA @happypistonfan @tankathon At #41, the Spurs select Yannick Nzosa.\n\nIf San Antonio keeps this pick (already selected Keegan, Dyson, MarJon) it will be to bring on a 'project'. The 1st three guys can all come in to contribute immediately. Nzosa, widely considered a lottery guy early on, is worth the risk. https://t.co/sC4ZSI0UXS",
    "29": "San Antonio Spurs Predictions and Preview for 3/12/2022 hosts Indiana Pacers.  Looking for betting action?  Find out if there is any value in our preview. #Basketball #NBA https://t.co/CkNuO3LL0y",
    "30": "San Antonio Spurs to release special NFT collection in honor of head coach Gregg Popovich all-time wins https://t.co/ykwOpDgmdq",
    "31": "San Antonio Spurs: Last night, the Utah Jazz were on the wrong side of history https://t.co/kmQcOIHwA8",
    "32": "GM/GA/GN San Antonio Spurs to release special NFT collection in honor of head coach Gregg Popovich all-time wins  KSAT San Antonio https://t.co/wezUKpnwSi",
    "33": "San Antonio Spurs to release special NFT collection in honor of head coach Gregg Popovich all-time wins - KSAT San Antonio https://t.co/TiKvw8bovy",
    "34": "INDIANA vs. SAN ANTONIO - Totals Prediction = 38.31% going UNDER #Pacers #Spurs  Full odds at https://t.co/nUn5OcMhOI",
    "35": "NBA Basketball Game Betting Picks Simulator: 8:10 PM ET - Indiana Pacers vs. San Antonio Spurs - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/9EVDaLqg9a #nba #sportsbetting #freepicks #cappertek",
    "36": "Gregg Popovich’s biggest win was making America confront uncomfortable truths | San Antonio Spurs https://t.co/3DVccbPvQH",
    "37": "San Antonio Spurs to release special NFT collection in honor of head coach Gregg Popovich all-time wins https://t.co/RLYud0kcUP",
    "38": "San Antonio Spurs to release special NFT collection in honor of head coach Gregg Popovich all-time wins - KSAT San Antonio https://t.co/prYw23qqIZ",
    "39": "San Antonio Spurs All-Time Starting Lineup\n\nPG/Tony Parker \nSG/George Gervin \nSF/Kawhi Leonard \nPF/Tim Duncan \nC/David Robinson \n6TH MAN/Manu Ginobli https://t.co/KuGHv86TAK",
    "40": "Gregg Popovich’s biggest win was making America confront uncomfortable truths | San Antonio Spurs https://t.co/UScFFu3T6a",
    "41": "@CoachAvery6 @spurs #CoachPop is the #GOAT𓃵 of coaches! #GoSpursGo I live in Jacksonville Fl. I've been a #SpursFan since Artis Gilmore. It solidified when my brother moved to San Antonio to Pastor and my friends cousin, Avery, began his career there!",
    "42": "San Antonio Spurs: Gregg Popovich Places Kobe Bryant Among The Greatest Players Of All Time: \"It’s Not Just His Talent Or His Physical\u0085 https://t.co/IV81707fyh",
    "43": "Record (0-0)\n\n💎3/12 Pick of the Day💎\n\nIndiana Pacers @ San Antonio Spurs UNDER 237.5 Total Points ⬇️📉\n\nReasoning\n\nSpurs are coming into today on the second day of a back to back while also missing Murray, Poeltl, and Keldon Johnson. Pacers are averaging 106.8 PPG on the road. https://t.co/PdzfnT7ISy",
    "44": "Gregg Popovich’s biggest win was making America confront uncomfortable truths | San Antonio Spurs | The Guardian https://t.co/ayy5zeDnAL",
    "45": "Way to go, Pop! 😎😎\n\nThe NBA, San Antonio community reacts to Spurs' Popovich's coaching milestone https://t.co/9Qfw4a2Xrp #porvida #nba75 #nbatwitter",
    "46": "@spurs @NBA Wow... the San Antonio Spurs organization should be extremely proud and overwhelmed to have a Coach who's been dedicated like Coach Popovich has been. Awesome flashback video, I'm impressed... nice💯👍🏀📽️",
    "47": "San Antonio Spurs next 8 games\n\nIND\nMIN\nOKC\nNOLA\nGSW\nPOR\nNOLA\nHOU\n\nPredict their record during this span",
    "48": "Congratulations #CoachPop @spurs  #GoSpursGo🏀 #PorVida  #SanAntonio #BexarCounty https://t.co/fRGRlSgt3L",
    "49": "Consensus Line Move:\n2022-03-12 Indiana Pacers at San Antonio Spurs from 237.00 to 238.50\nOver spot the sucker\n#NBA #sportspicks #coding #cash",
    "50": "Consensus Line Move:\n2022-03-12 Indiana Pacers at San Antonio Spurs from -5.50 to -2.00\n#GoldBlooded that's crazy\n#NBA #sportsbets #dataanalyst #daytrader",
    "51": "San Antonio Spurs: San Antonio Spurs:  Coach Gregg Popovich Sets NBA All-Time Wins Record https://t.co/nWuX60xlTs",
    "52": "ALERT: New high roller bet posted!\nA bet has been placed for $6,454.94 on San Antonio Spurs - Indiana Pacers to win $11,812.55.\nTo view this bet or copy it https://t.co/InaZjYfq8O https://t.co/crsgZffb2h",
    "53": "ALERT: New high roller bet posted!\nA bet has been placed for $7,229.54 on San Antonio Spurs - Indiana Pacers to win $13,808.42.\nTo view this bet or copy it https://t.co/tPSrQbFX8X https://t.co/VCls8m2zYb",
    "54": "I was so happy she became miss San Antonio. Hopefully you're a Spurs fan as well baby :) https://t.co/KbAEZgw598",
    "55": "@treythfc i’d rather watch the san antonio spurs and that says a lot",
    "56": "San Antonio fans never boo the @Spurs. \n\nEver. \n\nNever have, never will. \n\nThat’s magic you can’t put a dollar amount on. \n\ncc: @espn @ringer",
    "57": "🚨 Line Change 🚨\n\nIndiana Pacers @ San Antonio Spurs\nSat 8:10 PM EST\n\nFrom:\nSA -5.5 -110\n\nTo:\nSA -2.0 -110",
    "58": "Gregg Popovich’s biggest win was making America confront uncomfortable truths | San Antonio Spurs https://t.co/pSM5pxLLCO",
    "59": "San Antonio’s two ‘Two-Way’ players, DJ Stewart and Robert Woodard II, are both with Austin, so it looks like the Spurs will have nine bodies available for tonight’s game. https://t.co/4n7tZ57OD8",
    "60": "@hennybryant Nah not really, it is in San Antonio and the spurs were favored by 5.5 before this. I expect them to still be favored by a point or two. Will be a competitive spread",
    "61": "The San Antonio Spurs are currently the 4th seed in the Southwest division, and the 11th seed in Western conference with a record of 26 wins and 41 losses.\n\n#LEGENDoftheMiamiHEAT #NBA75",
    "62": "8:00pm ET; Sat, Mar 12\n\nIndiana Pacers\nSan Antonio Spurs\n\n📺: CW35, Bally Sports Indiana\n\n#LEGENDoftheMiamiHEAT #NBA75",
    "63": "@KarlyK99 It’s a daily NBA player guessing game, named after San Antonio Spurs player Jakob Poeltl (pronounced Purr-til). I happened to get the correct player today on my first guess.",
    "64": "@DejounteMurray Let’s fucking go!!!! All hail dejountae! Spurs fans have your back 💯!! You’re the reason why San Antonio is getting their next ring",
    "65": "Tributes poured in for Gregg Popovich after the San Antonio Spurs coach became the NBA's all-time leader in coaching wins on Friday. https://t.co/CqUQmZpKho",
    "66": "The Spurs are in a really bad spot today. Check this.\n\"Against the Jazz, the Spurs rallied from 15 points down in the fourth quarter to give Popovich the record. San Antonio had been 0-33 in games when trailed entering the final period\". The Pacers +190 look vere atractive.🤔",
    "67": "Gregg Popovich, an NBA legend: Stories you've never heard about the San Antonio Spurs, Team USA c... - via @ESPN App https://t.co/4QBOWrIyGV",
    "68": "Highlights: San Antonio Spurs 104, Utah Jazz 102 | 03.11.22\nhttps://t.co/q904J99Vx4\nhttps://t.co/q904J99Vx4",
    "69": "#San Antonio Spurs to sell 1,336 #NFTs for charity in honor of #Gregg #Popovich becoming #NBA all-time winningest coach - ESPN #NFTs #NFTCommunity #NFTArtists  https://t.co/njxnFnunv4",
    "70": "San Antonio Spurs Head Coach Greg Popovich Milestone Wins\nhttps://t.co/IVe7nt7D1u\nhttps://t.co/IVe7nt7D1u",
    "71": "The San Antonio Spurs will host the Indiana Pacers for their final meeting of the regular season. Here are 5 things to watch for. 🏀 https://t.co/54aG9zwQln",
    "72": "Gregg Popovich broke the NBA career regular-season wins record for a coach as his San Antonio Spurs beat the Utah Jazz 104-102.\n\nThe triumph was the 1,336th of Popovich's career and saw him surpass NBA legend Don Nelson for total wins.",
    "73": "San Antonio Spurs – Playoff Contenders or Pretenders? – NBA News https://t.co/p4fl0Zq5VJ",
    "74": "San Antonio still very much loves the spurs.",
    "75": "‘Pounding the rock’ led to San Antonio Spurs coach Gregg Popovich’s milestone win https://t.co/cGNaOc1d1f",
    "76": "San Antonio Spurs - Playoff Contenders or Pretenders? https://t.co/2euELESceH",
    "77": "‘Pounding the rock’ led to San Antonio Spurs coach Gregg Popovich’s milestone win https://t.co/Ps9cfdESnw",
    "78": "NBA Basketball Game Betting Picks Simulator: 8:10 PM ET - Indiana Pacers vs. San Antonio Spurs - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/9EVDaL8EKA #nba #sportsbetting #freepicks #cappertek",
    "79": "So many great leadership lessons to learn from one of the best to ever do it!\nGregg Popovich: San Antonio Spurs sets new NBA winning record with victory against Utah https://t.co/yBbpc9mrw9",
    "80": "San Antonio Spurs: Gregg Popovich Reacts To Becoming The Winningest Coach In NBA History: \"It's A Testament To A Whole Lot Of People...\u0085 https://t.co/hflPieEjcN",
    "81": "Today's NBA Consensus (So Far):\n\nChicago Bulls 76%\nDenver Nuggets 69%\nMiami Heat 67%\nUtah Jazz 63%\nSan Antonio Spurs 60%\nPortland Trail Blazers 58%\nMilwaukee Bucks 53%",
    "82": "🔊|| San Antonio Spurs || Pistol Double Drag https://t.co/cIYqwIxLBe",
    "83": "🚨Game Day🚨\nIndiana Pacers 🆚 San Antonio Spurs\n📆 Mar. 12, 2022 Today, 8:00 PM ET\n🖥 Watch Live : https://t.co/lJjOEWEQId ✅\n#IndianaPacers #SanAntonioSpurs https://t.co/wTcjN1PeQY",
    "84": "@AQ_SanAntonio @SportsCenter Duncan retired in 2016, Pop has won 0 NBA championship since then the Spurs haven’t made the playoffs since 2019",
    "85": "Two weeks of earlier tips after tonight. \n\n🆚️ San Antonio Spurs\n🕐 01:00\n\n#Pacers #GoldBlooded https://t.co/Mmsbqj6tF4",
    "86": "Best Media Moments | San Antonio Spurs Head Coach Gregg Popovich\nhttps://t.co/hHwXg4AR1K\nhttps://t.co/hHwXg4AR1K",
    "87": "Kudos to our~ “San Antonio Spurs” coach! Well~ deserved! 🏀🏀🏀 https://t.co/dkBOl7ARFr",
    "88": "1️⃣3️⃣3️⃣6️⃣\n\nSan Antonio Spurs coach Gregg Popovich breaks the NBA regular-season wins record! 👏 https://t.co/SqpwqKr9nC",
    "89": "Game Preview: San Antonio Spurs vs. Indiana Pacers https://t.co/xta8CIkIt3",
    "90": "Three thoughts on the Utah Jazz’s 104-102 loss to the San Antonio Spurs from Salt Lake Tribune Jazz beat writer Andy Larsen.\n https://t.co/EFdKu0s0uF",
    "91": "@spurs @walkertkl Congratulations pop! You've done so much for this city. Thank you for giving San Antonio a competitive professional sports team. 👏 👏 👏 👏 👏",
    "92": "@BENBALLER @NTWRKLIVE I would love to gift this to my longtime barber and friend. He’s been a day 1 die hard lakers fan since the 70’s. He been riding so hard I’ve seen him lose clients behind the lakers. We’re from San Antonio and spurs fans hated Shaq and the lakers",
    "93": "After three days between games, Pacers are back tonight in San Antonio. Spurs played last night, an emotional win as Gregg Popovich surpassed Don Nelson for the most wins in NBA history.\n\nBitadze (foot) is questionable, but he did practice. Brogdon and Stephenson are out.",
    "94": "March 12, 1994: San Antonio’s Dennis Rodman writes an apology on a towel after he’d missed the team flight to Houston and arrived 20 minutes before the Spurs were to play the Rockets.\n\nRodman, who had been ejected from his two previous games, did not play.\n\nSpurs 109, Rockets 98. https://t.co/PFCXlwhOKK",
    "95": "Congratulations to @CoachPopovich1 - have been so grateful for a great COACH of the San Antonio Spurs - also the #SanAntonioFoodBank for feeding people in need https://t.co/CdFjKaGr6e",
    "96": "@Super70sSports No mention of the sweet San Antonio Spurs Midwest champions pennant on the wall?",
    "97": "@_sn6 2021–22 San Antonio Spurs season",
    "98": "I love this man! He's like an example of Excellent Standards to me. I'm not saying he's perfect but he sure does know how to coach. \nGregg Charles Popovich is an American professional basketball coach and executive who is the president and head coach of the San Antonio Spurs NBA. https://t.co/NP7rz1wKXw",
    "99": "The San Antonio Spurs’ Gregg Popovich just became the all-time winningest head coach in the NBA with 1,336 victories - ESPN https://t.co/YNS671TUr2",
    "100": "@BleacherReport I love this man! He's like an example of Excellent Standards to me. I'm not saying he's perfect but he sure does know how to coach. \nGregg Charles Popovich is an American professional basketball coach and executive who is the president and head coach of the San Antonio Spurs NBA.",
    "101": "After a lengthy break, the Indiana Pacers hit the road to fight the San Antonio Spurs and Gregg Popovich, who is now the winningest coach in NBA history. Here are the latest odds, injury report, and predictions.\n\nhttps://t.co/7yfxNS0qlw",
    "102": "Congrats to longtime Spurs great NBA Coach Gregg Popovich on becoming the NBA's All-Time winningest Coach in Fri.'s comeback win over the Jazz in San Antonio! He's def. 1 of the best NBA Coaches of all-time! Wow! #NBA2022",
    "103": "The most consistent coach for the past 25+ years is now the winningest in ⁦@NBA⁩ . Big Congrats Coach Pop and the San Antonio @Spurs 🙌🙌🏽🙌🏿 ⁦⁩ \nGregg Popovich just became the all-time winningest head coach in the NBA with 1,336 victories - ESPN https://t.co/TxsoY15zEd",
    "104": "Game Preview: San Antonio Spurs vs. Indiana Pacers https://t.co/4Oc4buGtH7",
    "105": "GO POP &amp; SPURS GO !!!\n\nCONGRATULATIONS to POP.  KEEP MAKING \nSAN ANTONIO SO VERY PROUD!!! https://t.co/1DmmHf0XwP",
    "106": "Gregg Popovich is officially the NBA's winningest coach, passing Don Nelson on Friday night as the Spurs came back from down 15 to beat the Jazz 104-102 in San Antonio. https://t.co/CP8BOvVZwA",
    "107": "Stories you’ve never heard about the San Antonio Spurs, Team USA coach https://t.co/1CO0mAlmeK",
    "108": "Thinking about betting on Indiana Pacers v San Antonio Spurs (NBA)?  Find out what pick Pine member @MmmmmmmmmPizza locked in for the game.\n\nhttps://t.co/BuGIKzuLQl",
    "109": "Victor Wembanyama Spurs Rebuild | NBa 2k22 San Antonio Spurs\nhttps://t.co/PFDnYRAyQP",
    "110": "@albertjschulman San Antonio Spurs owners the warriors owners",
    "111": "Congratulations Coach Popovich! I love hearing from players &amp; coaches how you helped them improve their skills but most of how you helped them be better people. @spurs and our whole community is better because of you! #Coach Pop #SanAntonio https://t.co/9FXUHM3zpj",
    "112": "💣\n\nThe San Antonio @spurs enter the #NFT space in honor of Gregg Popovich becoming NBA's all-time winningest coach!👇 https://t.co/8OCDIug1dG",
    "113": "Congrats to Coach Pop of the San Antonio Spurs one of my all time favorites! Even though more times than not I wanted his team to lose because of the divisional rivalry with New Orleans I always new I was watching a winning formula and became enthralled with his style and system",
    "114": "NBA roundup: Gregg Popovich of the San Antonio Spurs sets a new win recorded\n#NBA #gregg_popovich #san_antonio\n#health2day @nba \nhttps://t.co/ZdLErzB4eE",
    "115": "@tndeportivo @todonoticias San Antonio Spurs vs Miami Heat 2013\nBarcelona vs Liverpool \nBarcelona vs psg\nClaveland Cavaliers vs Golden State Warriors 2016",
    "116": "Now San Antonio’s own 🤷🏽‍♂️ #SpursFamily #Spurs https://t.co/SmdoRMAo7n",
    "117": "#SanAntonio GO SPURS GO \n#History https://t.co/1J3shX66Kq",
    "118": "Partnership Sales Manager - San Antonio Spurs - Closing date 19 Mar 2022 https://t.co/cjGSQ1sPkm",
    "119": ".@CultosApp announces partnerships with the San Antonio @spurs:  \"1,336 COACH POP #NFT COLLECTION” https://t.co/HhleXJhgGS via @NBA  @spurs",
    "120": "Stories you’ve never heard about the San Antonio Spurs, Team USA coach - ESPN https://t.co/aEg7No99m4 https://t.co/ez4kH1fmsE",
    "121": "📷 Back at the Arena Tonight for Military Appreciation Night! Thank You to all our Military! Lets Go Spurs Family! #GOSPURSGO #GAMEDAY #SPURSHYPESQUAD #SPURSFLAG #Camo #MilitaryAppreciation (at San Antonio, Texas)... https://t.co/4eVXMP9eKI",
    "122": "Back at the Arena Tonight for Military Appreciation Night! Thank You to all our Military! Lets Go Spurs Family! #GOSPURSGO #GAMEDAY #SPURSHYPESQUAD #SPURSFLAG #Camo #MilitaryAppreciation @ San Antonio, Texas https://t.co/CCpWOS4jV8",
    "123": "Indiana Pacers vs San Antonio Spurs Prediction 3/12/22 -  Free NBA Picks https://t.co/8f35yf9dkB via @YouTube",
    "124": "Spurs:  Gregg Popovich: San Antonio #Spurs coach breaks NBA wins record with 1336th regular ... https://t.co/Qf0onNzhK9",
    "125": "Spurs: Gregg Popovich: San Antonio #Spurs coach breaks NBA wins record with 1336th regular ... https://t.co/AiM1vW1vBk",
    "126": "Final Score \n\nUtah Jazz  102\nSan Antonio Spurs  104\n\n#LEGENDoftheMiamiHEAT #NBA75",
    "127": "DasHaus made a bet!\n\nEvent: Indiana Pacers vs San Antonio Spurs #NBA\nBet: San Antonio Spurs TO WIN -5.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "128": "DasHaus made a bet!\n\nEvent: Indiana Pacers vs San Antonio Spurs #NBA\nBet: Indiana Pacers TO WIN +5.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "129": "Gregg Popovich became the winningest coach in NBA regular-season history, getting his 1,336th victory when the San Antonio Spurs rallied to beat the Utah Jazz 104-102  https://t.co/tqKqjffrF4",
    "130": "Consensus Line Move:\n2022-03-12 Indiana Pacers at San Antonio Spurs from 235.50 to 237.00\nOver getting dough\n#NBA #bet #dataanalyst #realtor",
    "131": "@TAizenberg I wanted him to get 6 before he retires but everyone knows he’s not leaving San Antonio, and the Spurs aren’t going to be contenders for a while so it might be time. 2016 and 17 were their best chances.",
    "132": "Brock Paige Productions for Saturday 3/12\nMontana State -4\nSan Antonio Spurs -5\n#CollegeBasketball  #nba #GamblingTwitter",
    "133": "Too bad the @spurs are so under appreciated by the @NBA and just about everyone outside of San Antonio. https://t.co/xhIkz1UT1r",
    "134": "March 12, 2002: Tim Duncan putback dunk.\n\nDuncan finished with 23 PTS &amp; 13 REB for San Antonio, and teammate Steve Smith added 19 PTS (3-5 3P). For Memphis, Jason Williams scored 18 PTS and Paul Gasol added 17.\n\nSpurs 98, Grizzlies 84.\n📺 NBA Action https://t.co/bnD57Ew9lP",
    "135": "The legendary San Antonio Spurs coach Gregg Popovich\nrecorded his 1,336th career victory on Friday night, setting the NBA’s all-time wins record for a head coach. \nCongratulations \n#milton510scollectorfamily \n#milton510scollectorsfamily\n#CoachPop \n#NBA https://t.co/iyAemApPxS",
    "136": "Gregg Popovich. From Being Hired As The San Antonio Spurs Head Coach In 1996 To Surpassing Don Nelson As The Winningest Head Coach In The History Of The National Basketball Association. Coach Pop Stands Alone In NBA History @Spurs #CoachPop1336WinsAndCounting #PorVida #GoSpursGo",
    "137": "@Eng_Enan_ Bucks win\nSan Antonio spurs win \nManu over 1.5 . osilike",
    "138": "Congratulations to San Antonio @spurs Head Coach Gregg Popovich, MHS Class of 1970, for becoming the all-time winningest coach in NBA history!\n\n#piratepride\n@MerrillvilleSu3 @MerrillvilleMHS @Merrillville_BB https://t.co/1tq4P1MR40",
    "139": "San Antonio Spurs to sell 1,336 NFTs for charity in honor of Gregg Popovich becoming NBA's all-time winningest coach | The Spurs are making 1,336 NFTs -- a salute to Gregg Popovich #nfts\n\nhttps://t.co/dXMNjtt85c",
    "140": "Spurs' Gregg Popovich becomes NBA's all-time winningest head coach - KSAT San Antonio\n#GreggPopovich \nhttps://t.co/Ju0joyfVSb",
    "141": "In 1996, Gregg Popovich, then the General Manager of the San Antonio Spurs fired Head Coach Bob Hill and inserted himself as head coach. \n\n22 winning seasons, 5 championships, and 1,336 wins later, I have to say what an all-time “bet on yourself” move by the greatest coach ever.",
    "142": "U got a like Princess from Gregg popovich San Antonio Spurs a close friend of mine in the future and the present, you know I'm the king of the Jews right lol... You never know who people will like, people like who they like https://t.co/dxJZ51aBbK",
    "143": "I just want to take this time to shout out Gregg Popovich. I grew up in the San Antonio area and was never a Spurs fan, but I have always had respect for Popovich and the winning culture he created over the years! Congratulations and thank you for using your voice! @spurs @NBA https://t.co/LMC0W3TV8i",
    "144": "The Toronto Raptors are the new San Antonio Spurs.",
    "145": "@NbaTahlilde San Antonio Spurs",
    "146": "San Antonio Spurs to sell 1,336 NFTs for charity in honor of Gregg Popovich becoming NBA’s all-time winningest coach https://t.co/lC74HNY4Jl",
    "147": "It was a privilege to be born in San Antonio and get to watch the Spurs dynasty in their prime led by coach Pop growing up 🙏🏼🏀 many great childhood memories watching them win titles 🏆 Thank you coach Pop #GoSpursGo #CoachPop https://t.co/jO6fjzmiuM",
    "148": "Joe Wieskamp was on the San Antonio Spurs roster last night for Pop’s record-breaking 1,336th regular season win",
    "149": "SAN ANTONIO SPURS VS INDIANA PACERS\n\n🗓 MAR 13\n⌚ 9:00 AM (PHT)\n🕋 AT&amp;T CENTER\n⛓ https://t.co/aJwlqpR8uk\n▶️ https://t.co/nqhs6kGreL\n\nFOLLOW MY PAGE FOR MORE SPURS CONTENT!! \n\n#iamproton #PorVida #GoSpursGo #pacers https://t.co/cKFGk9eZ9L",
    "150": "@MartiniO108 San Antonio Spurs",
    "151": "I got my spurs on, San Antonio",
    "152": "Gregg Popovich: San Antonio Spurs sets new NBA winning record with victory against Utah https://t.co/k9vmsKAPzC",
    "153": "O San Antonio Spurs venceu o Utah Jazz por 104 a 102.\n\nMurray - 27 PTS | 9 REB | 4 AST | 5 STL\nPoeltl - 15 PTS | 11 REB | 2 BLK\n\nMitchell - 27 PTS | 7 REB | 6 AST \nGobert - 13 PTS | 16 REB | 5 BLK\n\n#PorVida #TakeNote #NBA75 https://t.co/EXRQwxwJBa",
    "154": "\"After the legendary coach became the all-time NBA wins leader on Friday night, San Antonio Spurs players took a moment to celebrate on the court\" @SportsIllustratred \nhttps://t.co/2cxMTFvJFS",
    "155": "\"All of us share in this record,\" Popovich said Friday night after getting his record-breaking 1,336th victory when the San Antonio Spurs rallied to beat the Utah Jazz 104-102. \"It's not mine. It's ours, here in the city.\" https://t.co/dnNGAWZTzC",
    "156": "FREE #livestream here👉https://t.co/2c6Ltz5wlw 😉\n——\nMar.12, Sat.\n🏀#NBA ‼️\n1. Miami Heat Vs Minnesota Timberwolves\n2.San Antonio Spurs Vs Indiana Pacers\n3.Chicago Bulls Vs Cleveland Cavaliers\n4.Golden State Warriors Vs Milwaukee Bucks\n5.Utah Jazz Vs Sacramento Kings ... https://t.co/j8fUmfF7Ui",
    "157": "Creating a dynasty in a small market is insane. What Pop did for the Spurs &amp; San Antonio is just unmatched",
    "158": "Gregg Popovich notched his 1,336th win as an NBA head coach, placing him atop the list of winningest coaches in regular season league history. \n\nHe collected the win in last night's home game when the San Antonio Spurs beat the Utah Jazz, 104-102. https://t.co/UIL93Njegj",
    "159": "#breaking Gregg Popovich NBA roundup: Spurs&amp;#39; Gregg Popovich breaks wins record,Jazz blow 15-point fourth quarter lead in historic win for Gregg ... San Antonio coach Gregg Popovich is not one to call attention to himself, but his players made sure he basked in the limelight f",
    "160": "Gregg Popovich: San Antonio Spurs sets new NBA winning record with victory against Utah - BBC Sport https://t.co/OZJaKIP0WV",
    "161": "🏀 @spurs def. @utahjazz 104-102\n» Gregg Popovich notched the NBA's all time record in regular season coaching wins with 1,336. \n» As of Saturday (Philippine time), Pop has played 2,030 games in 26 seasons for San Antonio.\n\n#NBA \n#NBA75 \n@hooptalk918",
    "162": "199 Players: A Dedication to All Who've Suited Up For San Antonio Spurs Head Coach Gregg Popovich\nhttps://t.co/OZiFoLtnlY\nhttps://t.co/mKQ7tVrYL9",
    "163": "Spurs' Gregg Popovich becomes NBA regular-season wins leader https://t.co/pMru4Iw658 ANTONIO (AP) — Gregg Popovich became the winningest coach in NBA regular-season history Friday night, getting his 1,336th victory when the San Antonio Spurs rallied to beat the Utah Jazz 104-1...",
    "164": "Gregg Popovich is the winningest coach in NBA regular-season history, getting his 1,336th victory when the San Antonio Spurs rallied to beat the Utah Jazz 104-102 on Friday night. https://t.co/3f7cYvNkf0",
    "165": "Gregg Popovich officially became the all-time leader in regular-season wins after the San Antonio Spurs defeated the Utah Jazz, 104-102, at AT&amp;T Center.\nhttps://t.co/hZQYRzEwkb\n#Fastbreak #HoopSnoop",
    "166": "Congrats Coach Pop!!!  #SanAntonio #spurs #nba #basketball #winningestcoach https://t.co/k3Og7pNPN7",
    "167": "#NBA75 \nSpurs coach Popovich dedicates NBA record to fans and the city of San Antonio...'Basketball is a team game'\n#PorVida \nhttps://t.co/UOEjGhNkwT",
    "168": "Postgame Press Conference: Head Coach Gregg Popovich | San Antonio Spurs vs Utah\nhttps://t.co/3IirpLjS8n\nhttps://t.co/3IirpLjS8n",
    "169": "This is so special. The way Dejounte hugs him and how happy the team is for him…so sweet @spurs @DejounteMurray San Antonio Spurs Celebrate Head Coach Gregg Popovich Historic Win https://t.co/J4QuL90AZ7 via @YouTube",
    "170": "The 1336 Coach Pop NFT Collection | San Antonio Spurs https://t.co/XtNHVzs4TS",
    "171": "Gregg Popovich: San Antonio Spurs sets new NBA winning\nrecord with victory against Utah https://t.co/wgJQ6NKWYY\nhttps:/www.bbc.co.uk/sport/basketball/60718703?at_medium=RSS&amp;at_campaign=KARANGA",
    "172": "San Antonio Spurs: Spurs aim to boost playoff chances vs. skidding Pacers https://t.co/2rhYsnci01",
    "173": "https://t.co/0UByrh4YC6: Spurs aim to boost playoff chances vs. skidding Pacers: A milestone is out of the way for the San Antonio Spurs. Now they can turn their attention to making… https://t.co/mvOwTJrcg6 https://t.co/0UByrh4YC6: #News #FutureStarr #Shopping #Sports #Celebrity https://t.co/Vx7hP3rnLo",
    "174": "Indiana Pacers (22-45, 13th in the Eastern Conference) vs. San Antonio Spurs (26-41, 11th in the Western Conference) https://t.co/lirXbv6MTT",
    "175": "San Antonio Spurs coach Gregg Popovich mixes toughness and spirit to make history https://t.co/hbAMg6Ha1Y",
    "176": "Gregg Popovich: San Antonio Spurs coach breaks NBA wins record with 1,336th regular-season victory https://t.co/KhmxNlPc7r",
    "177": "The San Antonio Spurs head coach became the winningest coach in NBA history with his team’s 104-102 victory over the Utah Jazz on Friday. https://t.co/BGHqlcjygE",
    "178": "Utah Jazz (@utahjazz) 102 - San Antonio Spurs (@spurs) 104\nRecap : https://t.co/nd3tg0Xnjl\nBoxscore : https://t.co/VnxihEVx4X\nPlay-By-Play : https://t.co/F4VLMazUIX\nhttps://t.co/FcoGT6yDJp",
    "179": "San Antonio Spurs to sell 1,336 NFTs for charity in honor of Gregg Popovich becoming NBA's all-time winningest coach\nhttps://t.co/BVbhIU2NOg\nhttps://t.co/BVbhIU2NOg",
    "180": "Postgame Press Conference: Keldon Johnson | San Antonio Spurs vs Utah\nhttps://t.co/pbRxZ3gKuL\nhttps://t.co/pbRxZ3gKuL",
    "181": "Utah Jazz vs San Antonio Spurs Full Game Highlights | March 11 | 2022 NB... https://t.co/m9IFj22HGw @YouTube",
    "182": "San Antonio Spurs coach Gregg Popovich mixes toughness and spirit to make history https://t.co/xVavi3OuZd",
    "183": "Utah Jazz vs San Antonio Spurs - Full Game Highlights | March 11, 2022 |... https://t.co/LX4gjqjPaS @YouTube",
    "184": "Spurs:  Indiana takes on San Antonio, seeks to break 3-game slide | The Sacramento Bee https://t.co/Qf0onNzhK9",
    "185": "Spurs: Indiana takes on San Antonio, seeks to break 3-game slide | The Sacramento Bee https://t.co/F6XTLARq6P",
    "186": "Spurs: Indiana takes on San Antonio, seeks to break 3-game slide | The Sacramento Bee https://t.co/AiM1vW1vBk",
    "187": "Gregg Popovich: San Antonio Spurs coach breaks NBA wins record with 1,336th regular-season victory  https://t.co/IJ3F1M6fkK https://t.co/IIQjwmEstE",
    "188": "#greggpopovich number one all time in coachingnwins @nba @spurs @ AT&amp;T Center San Antonio Texas https://t.co/o6D796IhMZ",
    "189": "Gregg Popovich breaks the NBA record for most regular-season victories overseen by a coach as his San Antonio Spurs beat the Utah Jazz 104-102  https://t.co/jjjNixzrD2 #NEWS4W #WorldNEWS",
    "190": "Gregg Popovich: San Antonio Spurs coach breaks NBA wins record with 1,336th regular-season victory https://t.co/IJ3F1M6fkK",
    "191": "Gregg Popovich: San Antonio Spurs coach breaks NBA wins record with 1,336th regular-season victory | NBA News https://t.co/bqUu8NuTIk",
    "192": "Gregg Popovich: San Antonio Spurs sets new NBA winning record with victory against Utah https://t.co/z7VfTMWq1e ⟶ via https://t.co/0I4IIflkwI https://t.co/8YkhWCmXzV",
    "193": "Gregg Popovich: San Antonio Spurs sets new NBA winning record with victory against Utah https://t.co/MH59pOgn91 https://t.co/eBBfYV98Gh",
    "194": "NBA Basketball Game Betting Picks Simulator: 8:10 PM ET - Indiana Pacers vs. San Antonio Spurs - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/9EVDaLqg9a #nba #sportsbetting #freepicks #cappertek",
    "195": "Indiana Pacers (22-45, 13th in the Eastern Conference) vs. San Antonio Spurs (26-41, 11th in the Western Conference) https://t.co/xDRcJLIUeT",
    "196": "Gregg Popovich: San Antonio Spurs sets new NBA winning record with victory against Utah https://t.co/p97bH0Xzg2",
    "197": "Daily reminder thar Gregg Popovich is the greatest coach of all time and that's just a fact now.\n#PorVida #SanAntonio #Spurs #GoSpursGo #GSG #Pop #GOAT",
    "198": "Gregg Popovich is the winningest coach in NBA regular-season history, getting his 1,336th victory when the San Antonio Spurs rallied to beat the Utah Jazz 104-102 on Friday night.\n\nMarch 11, 2022 at 08:31PM | By: Raul Dominguez https://t.co/9asbBkc55a\nWinnipeg Landscaping | KS …",
    "199": "San Antonio Spurs coach Gregg Popovich becomes NBA regular-season wins leader\n https://t.co/Ds2jnMYOM1 SPOKEN LIKE A TRUE TEXAN.",
    "200": "RT @wojespn: Brett Brown gave Gregg Popovich an idea: Turn victory No. 1,336 into an NFT to raise money for the San Antonio Food Bank. So, Pop and the Spurs are making his favorite hand-written plays available: ESPN story: https://t.co/9v5SfvCi52 #actnearn #sct",
    "201": "Gregg Popovich becomes winningest coach in NBA regular-season history With a win over the Utah Jazz, San Antonio Spurs head coach Gregg Popovich surpassed Don Nelson for most regular-season wins in NBA history. via NPR https://t.co/utFjuCKkHT",
    "202": "🌋🌋🌋 Good NFT projects doing good. “San Antonio Spurs to sell 1,336 NFTs for charity in honor of Gregg Popovich becoming NBA's all-time winningest coach” https://t.co/eLTkhEyJrC",
    "203": "RT @AP_Sports: Popovich's milestone came in his 2,030th game and 26th season with the Spurs. Dejounte Murray led San Antonio with 27 points in the milestone victory.\n\nhttps://t.co/2j7KACs8UP",
    "204": "RT @AP_Sports: BREAKING: San Antonio coach Gregg Popovich breaks the NBA regular-season victory record, getting No. 1,336 in the Spurs' 104-102 win over the Utah Jazz.",
    "205": "San Antonio Spurs to sell 1,336 NFTs for charity in honor of Gregg Popovich becoming NBA's all-time winningest coach | The Spurs are making 1,336 NFTs -- a salute to Gregg Popovich #nft\n\nhttps://t.co/tdHHpB8xwV",
    "206": "Gregg Popovich, an NBA legend: Stories you've never heard about the San Antonio Spurs, Team USA coach https://t.co/0y3PGago9s",
    "207": "Congrats coach POP ! 🤝🏼  #LEGENDERY #Spurs #SanAntonio https://t.co/stqhiyvmiu",
    "208": "I’m a little late to it, but congrats on being, from a wins perspective and all other perspectives, the greatest coach in NBA history Pop! San Antonio loves you forever, and spurs fans from all over love you! Here’s to however many more you get https://t.co/4VHu7QOv6c",
    "209": "@RexChapman I love the Oilers and Spurs logo but my all-time favorite is the San Antonio Riders of the defunct WLAF. 🤔 https://t.co/Iun9tdHrEn",
    "210": "Game Preview: San Antonio Spurs vs. Indiana Pacers https://t.co/NYbA38OVsq",
    "211": "San Antonio Spurs to sell 1,336 NFTs for charity in honor of Gregg Popovich becoming NBA's all-time winningest coach - ESPN https://t.co/1OuSchAywv #nft #nfts #nftnews",
    "212": "Game Preview: San Antonio Spurs vs Indiana Pacers https://t.co/PZ7iUMm4XG",
    "213": "Gregg Popovich has coached San Antonio Spurs to five NBA titles and made history on Friday with his 1,336th regular-season victory, surpassing the legendary Don Nelson\n\n#NBA #Basketball \nhttps://t.co/67PExovUwD",
    "214": "Pop started coaching my Spurs when I was just a toddler. Everyone doubted him at first, fast forward to my mid 20s and now he’s the one who’s undoubtedly the GREATEST coach in NBA history. 3/11 will go down in history for San Antonio",
    "215": "San Antonio Spurs: Legendary coach makes NBA history https://t.co/UiVnu1AezI",
    "216": "San Antonio Spurs Celebrate Head Coach Gregg Popovich Historic Win\nhttps://t.co/eGjD2cPxBC\nhttps://t.co/eGjD2cPxBC",
    "217": "San Antonio Spurs to sell 1,336 NFTs for charity in honor of Gregg Popovich becoming NBA's all-time winningest coach - ESPN https://t.co/e4xU4i058G",
    "218": "Because we saw Phil in NY without those guys and they weren’t great. And we’ve seen Pop with &amp; without greats in San Antonio still manage to string together wins. So all I’m saying is…\n\n#nba #nba75 #NBATwitter #lakeshow #PorVida #Spurs #coachpop #GreggPopovich #BullsNation",
    "219": "@6toHombreLATAM San Antonio Spurs",
    "220": "One of the most impeccable ass whoopings I ever did see. Popovich gang real. Watch your mouf when speaking about the Spurs in San Antonio. 😂🏀 https://t.co/xHplZmSaf6",
    "221": "Man, myth, legend. San Antonio Spurs aren't the same without coach Pop https://t.co/d8B1e3WB82",
    "222": "Gregg Popovich is the greatest NBA Coach. He was the before breaking the record.\n\nWhat he did in SAN ANTONIO, creating a dynasty in SAN ANTONIO is legendary.\n\nHe’s apart of the greatest NBA Finals I have ever seen, 2005 Spurs vs. Pistons. Battle of the last 2 Champs. 7 games. 🔥 https://t.co/d0DghILUfc",
    "223": "If the Spurs get Bronny will you come to San Antonio. Asking for a friend https://t.co/Uc848KiMrv",
    "224": "San Antonio Spurs to sell 1,336 NFTs for charity in honor of Gregg Popovich becoming NBA's all-time winningest coach \nRead Full News here : https://t.co/WwTtluCWbe\n#INDvWI \n#CWC22 \n#BYJUSHallaMachaDeAnthem \n#SmritiMandhana\nhttps://t.co/J1EsPAscYr",
    "225": "@spurs Congratulations Coach Pop &amp; our San Antonio Spurs ‼️💯🎊🎉🎈👏",
    "226": "San Antonio @spurs head coach Greg Popovich became the all-time winningest coach in NBA history tonight. Could not happen to a better, more decent guy.\n\nFrom this lifelong @HoustonRockets fan, Coach Pop: \n\nYou really are the best.",
    "227": "@spurs @safoodbank Don’t y’all start with this shit now. How about you put the games on local channels so those of us who live in San Antonio can watch the Spurs without a crazy cable bill?",
    "228": "Gregg Popovich won his first game as head coach of the San Antonio Spurs in December of 1996, and became the all-time leader in wins tonight. 48% of all active NBA players right now were not yet born when Pop won his first game as head coach. #PorVida",
    "229": "I was stationed in San Antonio at Fort Sam Houston in '99 when the @spurs won their 1st title. Being a kid from Iowa that had every Bulls game available to watch on local cable in the 90's, I was obviously a fan of MJ. The very 1st weekend off base pass I had was Memorial Day '99",
    "230": "When Coach Pop Won His First Game As A Head Coach Of The San Antonio Spurs Back In December 1996 I Was Not Born And Tonight He Picked Win 1336 And He Passed Don Nelson For The NBA’s All Time Head Coaching Wins List Congrats Coach Pop\n#PorVida",
    "231": "Gregg Popovich is now the all-time winningest head coach in NBA history.\n\nA special moment in San Antonio Spurs history ⭐️\nhttps://t.co/RqvwRr10GW",
    "232": "I’m supposed to hate the Spurs but don’t. Love Pop, and DJ is in my top 3 favorite players. My favorite player left San Antonio in the offseason. So yeah no hate here, just respect.",
    "233": "And tonight, wasn't just another San Antonio Spurs Victory! A huge Congratulations to Gregg Popovich! The WINNINGEST Coach in NBA History! https://t.co/l2VXUBSZ7e",
    "234": "@NBA @spurs I say this again. The City of San Antonio is extremely fortunate to have Gregg Popovich be the head coach of our NBA team. I hope that he is enshrined in the Hall of Fame.",
    "235": "199 Players: A dedication to all who've suited up for San Antonio Spurs Head Coach Gregg Popovich\n#Spurs #coachpop\n#GoSpursGo #PorVida #NBATwitter\nhttps://t.co/IZNz02O3Co",
    "236": "San Antonio Spurs to sell 1,336 NFTs for charity in honor of Gregg Popovich becoming ... - ESPN https://t.co/uGqPNuIlyz #Cryptoart #NFT #OpenSea",
    "237": "Postgame Press Conference: Head Coach Gregg Popovich | San Antonio Spurs... https://t.co/succ73MAFi @YouTubeより",
    "238": "@CoachKarl22 Just so happy what the @spurs organization has done for the city of San Antonio. What an accomplishment.",
    "239": "Spurs win, Pelicans lose, San Antonio is now just a game back of NOLA for the 10 seed.",
    "240": "Finally, a timeline of the greatest moments in San Antonio Spurs history, including tonight.\n\nhttps://t.co/0fw419qUko",
    "241": "Gregg Popovich /  NBA Commissioner Adam Silver's statement regarding San Antonio Spurs' Gregg Popovich https://t.co/XdzfHB6lZ2 #NBA #SA",
    "242": "@spurs Congrats, Pop! Even as a #Sonics (and Warriors) fan, growing up in San Antonio, it’s always been entertaining to watch you and your teams - in person or on TV - as the Alamo City’s only pro franchise. Don’t let up now…obliterate the #NBA all-time wins record. #Spurs #Popovich https://t.co/nkKWqWciZp",
    "243": "Being born and raised in San Antonio it's amazing to see what Pop has done with the @spurs. What an amazing system he's built.",
    "244": "Gregg Popovich became the all-time winningest head coach in NBA history as the San Antonio Spurs defeated the Utah Jazz, 104-102.... \n#NBA #NBATwitter https://t.co/EDUOohuMKP",
    "245": "Gregg Popovich became the all-time winningest head coach in NBA history as the San Antonio Spurs defeated the Utah Jazz, 104-102.... \n#NBA #NBATwitter https://t.co/yGy2nTFMMu",
    "246": "The Puro San Antonio way to celebrate any Spurs victory. South Alamo, anyone? https://t.co/XtITSpfz2D",
    "247": "Coach Gregg Popovich Mixes Toughness, Spirit to Make NBA History with San Antonio Spurs https://t.co/FeiPraADsm",
    "248": "I'm like a little kid high on sugar. \nI'm a fan of basketball, I'm a fan of NBA, the San Antonio Spurs, great fan of Coach Pop and most of all, I'm into NFT. Watching him making history today and marking it with the release of NFTs is simply amazing. https://t.co/SSx64hcLJA",
    "249": "Coach Gregg Popovich Mixes Toughness, Spirit to Make NBA History with San Antonio Spurs https://t.co/otNFcIKZ8q",
    "250": "Congratulations to LunaticFridge who moved up 1 spot to take #3 on the San Antonio Spurs team leaderboard.\n\nhttps://t.co/HQxWdPfRe7",
    "251": "Dropped a couple tears after this win. I went from cheering from afar in Illinois, to living minutes from the arena in San Antonio. This was my dream and I turned it to reality. I bleed Spurs basketball so this one was so special. Coach Pop, the best to ever do it!!!!!!!!!!!!!!!",
    "252": "San Antonio, you have the NBA’s all-time winningest head coach. ✍️ @MaddySkye. @spurs @mySA \nhttps://t.co/w4JN1HcZxb",
    "253": "#goosebumps, the best #basket ball team ever : San Antonio Spurs 2014 Tribute - The Beautiful Game (ORIGINAL) https://t.co/6w9vPjMxTZ #nba",
    "254": "Gregg Popovich becomes winningest coach in NBA regular season history: With a win over the Utah Jazz, San Antonio Spurs head coach Gregg Popovich surpassed Don Nelson for most wins in NBA history. https://t.co/ZUt2Wd4XRT",
    "255": "Myself, Spurs fans around the globe and the great city of San Antonio will be forever grateful to Gregg Popovich and the great players who suited up for the silver and black, including the GOAT Tim Duncan. Thank you pop for the amazing years and wins you brought us. #GoSpursGo",
    "256": "NBA\n\nFT.\n\nMiami Heat 117 - 105 Cleveland cavaliers\n\nNew Orleans pelicans 120 - 142 Charlotte Hornets\n\nSan Antonio Spurs 104 - 102 Utah Jazz\n\nPhoenix Suns 112 - 117 Toronto Raptors\n#TheGamePlan",
    "257": "Coach Gregg Popovich Mixes Toughness, Spirit to Make NBA History with San Antonio Spurs https://t.co/8rL6kp9LWM",
    "258": "Spurs have announced the “1,336 Coach Pop NFT Collection.\"  Is a set of 1,336 exclusive non-fungible tokens that honor Popovich’s 1,336 career wins. Each of the NFTs will be available March 14th https://t.co/2qDJWuSkCC .100% of proceeds go to San Antonio Food Bank #porvida #NBA75 https://t.co/9lvi93SLAL",
    "259": "San Antonio Spurs head coach Gregg Popovich sits alone atop the NBA coaching mountain. https://t.co/fdfUTLCleM",
    "260": "Coach Gregg Popovich Mixes Toughness, Spirit to Make NBA History with San Antonio Spurs #basketball #greggpopovich #nba #SanAntonioSpurs https://t.co/bZjvgFEADX\nhttps://t.co/Ao06KrggLB",
    "261": "Coach Gregg Popovich Mixes Toughness, Spirit to Make NBA History with San Antonio Spurs https://t.co/vJPBGKAW3z",
    "262": "On Friday night, Gregg Popovich passed Don Nelson as the league’s all-time winningest coach, collecting his 1,336th victory when the San Antonio Spurs defeated the Utah Jazz 104-102. https://t.co/iwKUDPBb1b",
    "263": "Gregg Popovich is the winningest coach in NBA regular-season history, getting his 1,336th victory when the San Antonio Spurs rallied to beat the Utah Jazz 104-102. https://t.co/1Bn8BWKKkz",
    "264": "On this day in sports history March 12, Cleveland Cavaliers Point Guard Kyrie Irving scored 57 Points in a 128-125 OT win against the San Antonio Spurs in 2015.",
    "265": "San Antonio #Spurs' Gregg Popovich earns 1,336th victory, breaks all-time NBA wins record https://t.co/gxLOpCIv88 via @upi #NBA #NBA75 #NBATwitter #NBATwitterLive #PorVida",
    "266": "Gregg Popovich became the NBA’s all-time leader in regular-season coaching wins after his San Antonio Spurs rallied from 15 points down in the fourth quarter to beat the visiting Utah Jazz 104-102 on Friday. #NBA | @Reuters https://t.co/pUAZyF3bmS",
    "267": "@MichelleDBeadle @MichelleDBeadle  I'm glad you're back home, Spurs family and were able to witness this special moment with all of San Antonio.  #GSG #POPtheGOAT",
    "268": "Gregg Popovich is the winningest coach in NBA regular-season history, getting his 1,336th victory when the San Antonio Spurs rallied to beat the Utah Jazz 104-102 on Friday night. https://t.co/tnYFrDZBxr",
    "269": "@Mark215Oliveras Jazz look so bad losing to the Spurs. \nProud to be a Spurs fan especially tonight where Popovich became the NBA's all time wins by a coach and all those wins were with the same team, the San Antonio Spurs.",
    "270": "S/o to Coach Pop! Proud of this man.. Love my San Antonio Spurs man.. https://t.co/ZoAR7rdyLR",
    "271": "1️⃣3️⃣3️⃣6️⃣ wins for the San Antonio @spurs Head Basketball Coach; Coach Gregg Popovich🖤🏀🖤! Congratulations on surpassing NBA's all-time wins record, Pop! 🔥 #PorVida   #GreatestHeadBasketballCoachEver https://t.co/dtIn3R4Gcu",
    "272": "@spurs Hate NFTs but I mean all the proceeds are going to the San Antonio food bank",
    "273": "Congrats to Gregg Popovich of the San Antonio Spurs for becoming the WINNINGEST COACH in NBA History! #NBA75 https://t.co/T9l9iHz06W",
    "274": "Being a San Antonio Spurs fan throughout my lifetime has been so tremendously fun because of this great coach! Congratulations Coach Pop on this well deserved milestone!!! #TheGOAT #PorVida #GoSpursGo https://t.co/V8nByfE1Dk",
    "275": "Pop became the winningest regular season coach in nearly 400 games fewer than his predecessors 😳 San Antonio Spurs https://t.co/IuXm9B9SLu",
    "276": "San Antonio Spurs to sell 1,336 NFTs for charity in honor of Gregg Popovich becoming NBA’s all-time winningest coach https://t.co/cHqJVOgZvQ",
    "277": "San Antonio @spurs head coach Gregg Popovich entered a new realm of NBA royalty tonight by winning more games than any other head coach in @NBA history. Tonight was his 1,336 win. | By @NBASarah\nhttps://t.co/tWsIUvqdzP",
    "278": "One of the perks of being a San Antonio Spurs fan \n#porvida",
    "279": "A legend spanning generations 🏆\n\nCoach Pop is now the NBA's all-time winningest coach in the regular season!\n\nSan Antonio Spurs https://t.co/enz0rLKYPG",
    "280": "San Antonio Spurs to sell 1,336 NFTs for charity in honor of Gregg Popovich becoming NBA’s all-time winningest coach – ESPN https://t.co/ORhkR1aI5r",
    "281": "Gregg Popovich on sharing the NBA all-time coaching wins record with the Spurs and San Antonio: “All of us share in this record. It’s not mine. It’s ours.”\n\n🎥: @NBA\nhttps://t.co/KNEOTMy8PX",
    "282": "Magic asst coach Bob Hill in this highlight became the Spurs head coach the following season. A couple years later Pop fired him and replaced him as head coach in San Antonio. Weird. https://t.co/xWKrGv4g4G",
    "283": "My favorite NBA team, the San Antonio Spurs, are releasing their first official NFTs to commemorate Coach Pop becoming the winningest coach in NBA history and to raise money for the SA Food Bank! Go Web3 Go! https://t.co/65OE7zWqGM",
    "284": "San Antonio Spurs to sell 1,336 NFTs for charity in honor of Gregg Popovich becoming NBA's all-time winningest coach - ESPN https://t.co/He1vDfCagC",
    "285": "Congratulations to San Antonio Spurs head coach Gregg Popovich!\n\nHe passes Don Nelson for the most wins  in NBA history! 👏 https://t.co/gN4o3KU07F",
    "286": "Congratulations to San Antonio Spurs head coach Gregg Popovich on winning his 1,336 game in his head coaching career. Popovich, 73, moves into 1st place with the most wins as a NBA head coach in NBA history. \n#SanAntonioSpurs\n#GreggPopovich https://t.co/vufC62uVQ1",
    "287": "SAN ANTONIO (AP) — Gregg Popovich is the winningest coach in NBA regular-season history, getting his 1,336th victory when the San Antonio Spurs rallied to beat the Utah Jazz 104-102 on Friday night. https://t.co/xXK51KQPSa",
    "288": "@ksatnews San Antonio Spurs",
    "289": "RT @AP_Sports: BREAKING: San Antonio coach Gregg Popovich breaks the NBA regular-season victory record, getting No. 1,336 in the Spurs’ 104-102 win over the Utah Jazz. https://t.co/HEaOxnOqqQ",
    "290": "GM/GA/GN San Antonio Spurs to sell 1,336 NFTs for charity in honor of Gregg Popovich becoming NBA's all-time winningest coach  ESPN https://t.co/CQjcOgJGcA",
    "291": "all love San Antonio Spurs 🥺🖤🤍\n#GoSpursGo https://t.co/F1hhn9w3ej",
    "292": "#RT @ShamsCharania: San Antonio Spurs coach Gregg Popovich has surpassed Don Nelson for the most coaching wins in NBA history.",
    "293": "Gregg Popovich passes Don Nelson for most wins as NBA coach\nWith the San Antonio Spurs' 104-102 win over the Utah Jazz on Friday, to become the NBA's all-time winningest coach with 1,336 career wins.  Coach Pop is a former Air Force player and Grad!\nCongratulations Pop‼️⚡🏀🇺🇸 https://t.co/Is948lCSg7",
    "294": "Gregg Popovich, an NBA legend: Stories you've never heard about the San Antonio Spurs, Team USA c... - via @ESPN App https://t.co/qEBziQO50Q",
    "295": "https://t.co/0UByrh4YC6: Royce O'Neale with an assist vs the San Antonio Spurs: Royce O'Neale (Utah Jazz) with an assist vs the San Antonio Spurs, 03/11/2022 https://t.co/xB9NPM12fx https://t.co/0UByrh4YC6: #Celebrity #FutureStarr #News #Sports #Shopping https://t.co/6MjXu2lGwU",
    "296": "https://t.co/0UByrh4YC6: Mike Conley with an assist vs the San Antonio Spurs: Mike Conley (Utah Jazz) with an assist vs the San Antonio Spurs, 03/11/2022 https://t.co/uHLxscLqQH https://t.co/0UByrh4YC6: #News #Shopping #Celebrity #FutureStarr #Sports https://t.co/7CQAnbAax2",
    "297": "San Antonio vs. Utah, Final Score: Spurs clutch free throws cinch 104-102 win over Jazz https://t.co/rqAgAkqB8b",
    "298": "Gregg Popovich passes Don Nelson for most wins as NBA coach\nWith the San Antonio Spurs' 104-102 win over the Utah Jazz on Friday, to become the NBA's all-time winningest coach with 1,336 career wins.  Coach Pop is a former Air Force player and Grad!\nCongratulations Pop‼️⚡🏀🇺🇸 https://t.co/U7ymcGjlav",
    "299": "@Got_Tacos @spurs @spidadmitchell As a Spurs fan from San Antonio my whole life, that’s unfortunate to hear man https://t.co/K6bCtWvCh5",
    "300": "@_PuzzlePieceDad Team of the winningest coach in nba history, San Antonio Spurs\n\nTS: readysetjoe",
    "301": "\"It's not mine. It's ours.\"\n\nGregg Popovich on why he shares the all-time coaching wins record with the @spurs, and with the city of San Antonio. https://t.co/QwRrhTkjGE",
    "302": "Gregg Popovich is the winningest coach in NBA regular-season history, getting his 1,336th victory when the San Antonio Spurs rallied to beat the Utah Jazz 104-102 on Friday night: https://t.co/4lBz2LMxAs",
    "303": "For everyone outside our San Antonio Spurs circle, believe me when I tell you that this is Pop’s ‘I’m thrilled’ face for setting the new coaching wins record.\n\n#InPopWeTrust\n#GoSpursGo\n#PorVida https://t.co/3cU4NSWgOh",
    "304": "Congratulations to GOAT coach Gregg Popovich for winning his 1,336th NBA game after the San Antonio Spurs 104-102 victory over the Utah Jazz tonight. He surpassed the great Don Nelson #NBA 🐐 https://t.co/bRuWZGqaUi",
    "305": "Congratulations to Coach Greg Popovich on his new record a true living legend. 🏀 #CoachPop #Spurs #NBA75 #Legend #GOAT𓃵 #GoSpursGo #SanAntonio https://t.co/08izdjeTqs",
    "306": "Gregg Popovich became the winningest coach in NBA regular-season history, getting his 1,336th victory when the San Antonio Spurs rallied to beat the Utah Jazz 104-102 on Friday night. https://t.co/FKrmGAGVws",
    "307": "San Antonio Spurs to sell 1,336 NFTs for charity in honor of Gregg Popovich becoming NBA's all-time winningest coach | ⁦@espn⁩ @spurs  https://t.co/DzH3hhkgxU",
    "308": "Gregg Popovich is the winningest coach in NBA regular-season history, getting his 1,336th victory when the San Antonio Spurs rallied to beat the Utah Jazz 104-102 on Friday night. https://t.co/z8nMmlGXf9",
    "309": "San Antonio Spurs head coach Gregg Popovich  passes Don Nelson for the most wins (1,336) by a head coach in NBA history. \n\n#NBA | #GoSpursGo | #3ptcnvrsn",
    "310": "Congrats to San Antonio Spurs coach Gregg Popovich for passing Don Nelson for the most wins in NBA history. That’s special.",
    "311": "San Antonio has one major league team. But the @spurs have five @NBA championships, three Hall of Famers and the head coach with the most wins in #NBA history. That’s something to celebrate, San Antonio. @COSAGOV @attcenter @Alamodome #SATX",
    "312": "San Antonio Spurs head coach Gregg Popovich has surpassed Don Nelson's record for most wins for a head coach in NBA history on Friday night.\n\n       https://t.co/JrM8TpSfei",
    "313": "San Antonio Spurs head coach Gregg Popovich has surpassed Don Nelson's record for most wins for a head coach in NBA history on Friday night.\n\n       https://t.co/fumvVBBZ3e",
    "314": "Utah Jazz vs San Antonio Spurs - Full Game Highlights | March 11, 2022 | 2021-22 NBA Season\nhttps://t.co/Ytso69daWn\nhttps://t.co/Ytso69daWn",
    "315": "Gregg Popovich is the winningest coach in NBA regular-season history, getting his 1,336th victory when the San Antonio Spurs rallied to beat the Utah Jazz 104-102 on Friday night \nhttps://t.co/DgThEgKsAr",
    "316": "Pop now the coach with the most wins in NBA history. #CoachPop #Spurs #NBA75 #Legend #GoSpursGo #SanAntonio #SanAntonioSpurs https://t.co/a68DHOoB7t",
    "317": "Congratulations to one of my favorite people in all of sports for breaking the all-time wins record!\nAll-time great coach, even greater person. \n\nThe great Gregg Popovich of the San Antonio Spurs",
    "318": "RT @AP_Sports: Popovich's milestone came in his 2,030th game and 26th season with the Spurs. Dejounte Murray led San Antonio with 27 points… —Associated Press\n\n #sports",
    "319": "POP ON TOP.\n\nSan Antonio #Spurs coach Gregg Popovich has surpassed Don Nelson for the most coaching wins in #NBA history. 🙌 https://t.co/Ei1pdpDlBG",
    "320": "San Antonio Spurs win!!!",
    "321": "The San Antonio Spurs gather around Coach Pop to celebrate his achievement before he tries to walk off the floor https://t.co/lOgLNj6TFG",
    "322": "This is San Antonio Spurs head coach Gregg Popovich's win no. 1336. \n\nVisit https://t.co/K9jJDOXjil for other updates. https://t.co/4THiInXYax",
    "323": "@MikeTaddow @SBNation Except that one time when I tried my puns at a Spurs home game.\n\nThat’s when San Antonio banned Eric https://t.co/wL3LmdTlfK",
    "324": "San Antonio Spurs spurns Utah Jazz 104-102 Dejounte Murray 27points 9rebounds 4assists.",
    "325": "San Antonio Spurs rally to upset Utah Jazz 104-102 on 3/11/22, garnering Coach Greg Popovich the win to become the winningest Coach in the NBA regular season with 1,336 wins. Popovich surpassed Don Nelson who had 1,335 NBA wins. https://t.co/zkWOi4igJx",
    "326": "tonight Toronto Raptors +5 big winner and moneyline winner and san antonio spurs +6 winner let's go Toronto Raptors very big win.",
    "327": "I love #spurs basketball\n\n #SanAntonio #NBA https://t.co/qToXGO9kkx",
    "328": "@spurs Congrats Pop. Very proud of what you've done in San Antonio.  Just awesome. The GOAT.",
    "329": "San Antonio Spurs head coach Gregg Popovich picked up his 1,336th win in the NBA tonight, making him the winningest head coach in NBA history 🎉\n\nCongrats, Coach Pop 👏\n\n#PorVida #NBA75 https://t.co/4NBPauVad1",
    "330": "The rare thread that's worth reading after a loss.\n\nUtah Jazz at San Antonio Spurs: Opponent Game Thread Highlights\n\nhttps://t.co/dZovkc91OJ",
    "331": "Today San Antonio, Texas wins. Much love from the Midwest! Manmyth grind! Go Spurs Go! #PorVida",
    "332": "Lonnie Walker IV - San Antonio Spurs\n11 PTS\n2 RBD\n2 AST\n1 BK\n1 STL\n[FD(22.4) DK(21)]",
    "333": "Zach Collins - San Antonio Spurs\n15 PTS\n5 RBD\n3 AST\n1 BK\n1 TO\n[FD(27.5) DK(28.25)]",
    "334": "Josh Richardson - San Antonio Spurs\n11 PTS\n4 RBD\n3 AST\n1 BK\n1 STL\n2 TO\n[FD(24.3) DK(23.5)]",
    "335": "Congratulation to #coachpop for being 1st at all time wins. Well-earned. All in 1 team san antonio spurs",
    "336": "💪🏽Congratulations Pop! 🏀\n\n      ⬛️⬜️⬛️⬜️⬛️⬜️⬛️⬜️⬛️⬜️⬛️\n\n#Popovich \n#SanAntonio\n#Spurs https://t.co/CcCJIou2iC",
    "337": "Popovich's milestone came in his 2,030th game and 26th season with the Spurs. Dejounte Murray led San Antonio with 27 points in the milestone victory.\n\nhttps://t.co/zdq6oOkIDB",
    "338": "Congrats to East Chicago native Gregg Popovich on surpassing Don Nelson for the NBA’s all-time coaching wins record tonight in San Antonio as the Spurs beat the Jazz. Popovich now has 1,336 victories. @WGNNews https://t.co/biQeVY07xL",
    "339": "Congrats to San Antonio Spurs Head Coach Gregg Popovich for becoming the NBA's all-time winningest head coach as his Spurs beat Utah at AT&amp;T Center, 104-102... #CoachPop",
    "340": "Congratulations to San Antonio @Spurs coach Gregg Popovich on becoming the winningest coach in @NBA history! https://t.co/VH79NjN2ru",
    "341": "Congratulations, Coach Gregg Popovich of the San Antonio Spurs, on becoming the NBA coach with the most wins in history from your friends at the American Heart Association! #GoSpursGo \n\ncc: @spurs https://t.co/3Yx6yiiVXL",
    "342": "Let's go!! Gregg Popovich made a pretty smart move when he hired Gregg Popovich as the head coach of the San Antonio Spurs.  Congrats, 🐐.  You've earned this! #GoSpursGo #PorVida https://t.co/8yRGkl1dpF",
    "343": "San Antonio Spurs HC Gregg Popovich has passed Don Nelson for the most regular season wins in NBA history 👏🏻 https://t.co/GMSYqXbY9E",
    "344": "@TbirdTr3y_10 Same. He was the assistant when I was 9. I watched him and season for movie reviews on Saturday mornings on that spurs show. Came back in 94. I mean, I’ve watched him in San Antonio for 30 of my 41 years. I mean, he feels@like the crazy uncle I shake my head at smile and hug 😂",
    "345": "Thank you Pop: for inspiring a city, championing a team first culture, and making us proud to be from San Antonio and Spurs fans. The all time winningest coach in NBA history. #VaSpursVa https://t.co/SxTSJjCnLn",
    "346": "Pop and the Spurs are turning his #NBA plays into NFTs and will raise money for the San Antonio food bank. A wonderful initiative but talk about #Cryptos and #NFT taking over #sports 🔥",
    "347": "Congratulations Gregg Popovich!\n#NBA #Spurs #greggpopovich\n#GOAT𓃵 #dejounte #nbahistory #SanAntonio #GoSpursGo",
    "348": "San Antonio Spurs to sell 1,336 NFTs for charity in honor of Gregg Popovich becoming NBA's all-time winningest coach - ESPN https://t.co/prTDt0D20x",
    "349": "Spurs' Popovich sets NBA's all-time wins record https://t.co/5iqu4yTdf9 @spurs #PorVida #spurs #GoSpursGo #GOAT𓃵 #NBA75 #NBA #SanAntonio",
    "350": "A LEGEND.\n\nSan Antonio Spurs head coach Gregg Popovich is now the all-time winningest coach (regular season) in NBA history!\n\nVisit https://t.co/K9jJDOXjil for other updates. https://t.co/Yl3qI91HNT",
    "351": "San Antonio Spurs HC Gregg Popovich gets his 1336 win as a HC and becomes the all time leader!!! #GoSpursGo #PorVida 🐐",
    "352": "Brett Brown gave Gregg Popovich an idea: Turn victory No. 1,336 into an NFT to raise money for the San Antonio Food Bank. So, Pop and the Spurs are making his favorite hand-written plays available: ESPN story: https://t.co/eobRxf862g",
    "353": "This Spurs win moves San Antonio within 1 game of Pelicans and 10th seed in Western Conference.\nNOLA faces SA twice before regular season ends.\n\nNo matter what adversity New Orleans has faced this season, if Pels can’t hang onto a top-10 spot - pretty embarrassing 😳 😬 https://t.co/J7Q5W3f0LV",
    "354": "San Antonio Spurs coach Gregg Popovich has surpassed Don Nelson for the most coaching wins in NBA history.",
    "355": "New Orleans Pelicans 120 (Trey Murphy 32 pts) Charlotte Hornets 142 (Malcom Bridges 26 pts), San Antonio Spurs 104 (Jakob Poelt 15 pts, 11 rebs, Keldon Johnson 13 pts, 10 rebs) Utah Jazz 102 (Rudy Gobert 13 pts, 16 rebs)",
    "356": "Incredible comeback by San Antonio Spurs to win 104-102 against Utah Jazz, after at one point trailing 68-81. And that win make Pop officially as the coach with most wins in NBA regular season",
    "357": "The GOAT. #gospursgo #coachpop @spurs @ San Antonio, Texas https://t.co/DUIhKG4ZGm",
    "358": "History in San Antonio. 🙌\n\nWith tonight's win over the Jazz, @spurs head coach Gregg Popovich becomes the @NBA’s all-time leader in wins by a coach! 🏀 https://t.co/VPgmt8kjsk",
    "359": "Brett Brown gave Gregg Popovich an idea: Turn victory No. 1,336 into an NFT to raise money for the San Antonio Food Bank. So, Pop and the Spurs are making his favorite hand-written plays available: ESPN story: https://t.co/hWuGw7jWzs",
    "360": "NBA Commissioner Adam Silver's statement regarding San Antonio Spurs' Gregg Popovich https://t.co/4eZuVOHSlw",
    "361": "Congratulations @spurs Coach Pop for all time WINS IN @NBA  HISTORY!! 🙌🎉🏀🏀☄️🌟💥 ALL WITH @spurs #GoSpursGo #SPURS #SanAntonio #NBA #coachpop #sports #basketball #wins https://t.co/2oXqj9jKa7",
    "362": "GOAT!!! 👏🏽👏🏽👏🏽👏🏽 RT @ShamsCharania: San Antonio Spurs coach Gregg Popovich has surpassed Don Nelson for the most coaching wins in NBA history.",
    "363": "Congratulations to Pop! Most wins in NBA history is pretty amazing!! #Spurs #SanAntonio #NBAHistory #NBA #Basketball #Fiesta",
    "364": "Fuck I love being a San Antonio Spurs fan",
    "365": "@hayescarroll_ @BleacherReport Gregg Charles Popovich is an American professional basketball coach and executive who is the president and head coach of the San Antonio Spurs of the National Basketball Association. Wikipedia",
    "366": "Any basketball fans out there? Check out the 12 MARCH Military Appreciation Night game with the San Antonio @spurs! Game is at 7:00 p.m. against the @Pacers at the @attcenter. Tickets for this and other Military Branch Nights available at https://t.co/ym3lBfrlo1. https://t.co/u69CHwDoB5",
    "367": "Pop is the GOAT 🐐🏆🥇\n\nSan Antonio #Spurs Head Coach Gregg Popovich has surpassed Don Nelson for the most coaching wins in #NBA75 history\n\n#PorVida",
    "368": "1,336 wins for the @spurs and 1,336 wins for San Antonio. Congratulations on surpassing NBA's all-time wins record, Pop. 🔥 #PorVida https://t.co/JHO1WFX8fk",
    "369": "Pop absolutely GOATED tonight, no one ever won more and it’s San Antonio Spurs all day",
    "370": "BREAKING: San Antonio coach Gregg Popovich breaks the NBA regular-season victory record, getting No. 1,336 in the Spurs' 104-102 win over the Utah Jazz.",
    "371": "Game 66 ❌ (41-25) The @utahjazz fritter away yet another second-half lead in a 104-102 loss to the San Antonio Spurs\n\nUp next: right back at it tomorrow night against the Sacramento Kings (7 pm tip)\n\n#UtahJazzScholarship Count: 4️⃣3️⃣\n\n#TakeNote #UTAvsSAS #NBATwitter   #NBA75 #NBA https://t.co/mD3XudKyva",
    "372": "San Antonio Spurs head coach Gregg Popovich has now won the most games by an NBA coach with 1,336 wins. https://t.co/sW2vTMkUuR",
    "373": "With the win tonight by the San Antonio Spurs, head coach Greg Popovich surpasses Don Nelson and becomes the most winningest coach in NBA history with 1,336",
    "374": "our San Antonio Spurs",
    "375": "The news has been great on the scoreboard often lately, but Spurs pull off two-point comeback win over Jazz tonight. #Pelicans lead on San Antonio is down to 1 game",
    "376": "Congrats to San Antonio Spurs coach Gregg Popovich, who is now the NBA's ALL-TIME LEADER for regular season coaching wins. \n\n#Spurs #GreggPopovich",
    "377": "What a great comeback win for Pop to set the record. Came down to the wire, like so many memorable Spurs victories during the Pop era. \n\nAll-time NBA coaching wins! All of them for one franchise: the San Antonio Spurs!",
    "378": "With that win by the San Antonio Spurs over the Utah Jazz (104-102) Gregg Popovich has just taken over Don Nelson for most wins by a head coach in NBA history with 1,336. \nCongrats to Coach Pop, arguably the greatest coach in NBA history 🔥🔥 https://t.co/2vxeRlu5iB",
    "379": "BREAKING: Spurs head coach Gregg Popovich has broken the NBA record for coaching wins. Popovich won his 1,336 regular season game, surpassing Don Nelson, as San Antonio rallied to beat Utah. #KSATsports #GoSpursGo #PorVida https://t.co/92I0255TIt",
    "380": "San Antonio Spurs coach Gregg Popovich has surpassed Don Nelson to become the winningest coach in NBA history.\n- Popovich: 1,336-694 (.658)\n- Nelson: 1,335-1,063 (.557) https://t.co/auUe4Sx8GK",
    "381": "San Antonio Spurs coach Gregg Popovich has surpassed Don Nelson for the most coaching wins in NBA history.",
    "382": "🚨 UPDATE: Keldon Johnson - San Antonio Spurs has a Double Double\n5.1 4th\n13 PTS\n10 RBD\n1 AST\n1 STL\n[FD(29.5) DK(31)]",
    "383": "Partnership Sales Manager - San Antonio Spurs (San Antonio · TX) https://t.co/KjFQu9jRBw",
    "384": "San Antonio Spurs vs Utah Jazz was on AT&amp;T Sportsnet Rocky Mountain. With commentary from Craig Bolerjack. Co-commentator is Thurl Bailey.  For more details see https://t.co/usWR2aUKWy #SanAntonioSpurs #UtahJazz #ATTSportsnetRockyMountain",
    "385": "If spurs win i will never diss san antonio women",
    "386": "🚨 UPDATE: Jakob Poeltl - San Antonio Spurs has a Double Double\n1:56 4th\n12 PTS\n10 RBD\n1 AST\n2 BK\n[FD(28.5) DK(30)]",
    "387": "Gregg Popovich, an NBA legend: Stories you've never heard about the San Antonio Spurs, Team USA coach https://t.co/zGH0UMKp1L",
    "388": "San Antonio Spurs: Donovan Mitchell Feeds Rudy Gobert For Big Dunk Against Spurs https://t.co/kMCKdmj8GC",
    "389": "Dejounte ties this game up, the Spurs have comeback from 15 down. We are heading to a crunch time game in San Antonio for Pop's potential NBA record breaking game.",
    "390": "@NBAwizardry Same liability he was with the San Antonio Spurs, but you wanted him anyway. 😂😂😂\nDefensive liability that makes 3—3-pointers per game as a teammate of ball dominant Westbrook.",
    "391": "Name something more 90s than this San Antonio Spurs throwback court?\n\n#TakeNote #Spurs",
    "392": "The Spurs enter 1-26 when trailing by 15 points in a game.\n\nThe Jazz are the ONE team San Antonio has made a 15 point comeback against this season.",
    "393": "Three done in San Antonio. The Jazz lead the Spurs 74-64",
    "394": "An all-new San Antonio Spurs plane landed at the San Antonio International Airport. It is the first of its kind and part of the Spurs' first sponsorship with Viva Aerobus. https://t.co/FxYkWynVuQ",
    "395": "Spurs: San Antonio #Spurs vs. Utah Jazz: Live Stream, TV Channel, Start Time | 3/11/2022 - Sports Illustrated https://t.co/AiM1vW1vBk",
    "396": "Spurs:  San Antonio #Spurs vs. Utah Jazz: Live Stream, TV Channel, Start Time | 3/11/2022 - Sports Illustrated https://t.co/Qf0onNzhK9",
    "397": "Spurs: San Antonio #Spurs vs. Utah Jazz: Live Stream, TV Channel, Start Time | 3/11/2022 - Sports Illustrated https://t.co/F6XTLARq6P",
    "398": "HALFTIME: Jazz 59, Spurs 50. Murray *almost* with another deep 3 at the horn, but this one rims out. Don has 18p. Hassan 9/5. JC 8/5r. Rudy 4/8/2. Mike 6/4r/3a, but 1-9 FGs. Collins 13p and Murray 12/4r for San Antonio.",
    "399": "@Tjonesonthenba And then the spurs arena plays “gasolina” , like read the room San Antonio",
    "400": "Take all 16 cards for ONLY‼️$5 Free Shipping 👀\n\nSan Antonio Spurs Lot 🏀\n\n@CardHobbyRTs @HobbyConnector @TheHobby247 @sports_sell @CardboardEchoes https://t.co/OcESRJlmmR",
    "401": "Don't forget about Austin Spurs' Jordan Murphy from San Antonio/played at Brennan HS, @BillLand \n\nQ &amp;A Austin Spurs' Jordan Murphy: Playing at Brennan High School https://t.co/11OVids90W #porvida #nba75 @austin_spurs",
    "402": "A pair of Spurs fans sitting behind San Antonio’s bench just got engaged. Happened while the Spurs had the ball early in the second quarter. Fan not only got his girlfriend’s hand in marriage, he received a pair of red sneakers from Donovan Mitchell earlier.",
    "403": "@veganwarrior666 More spurs than San Antonio cos I don’t really follow nba let alone play ball lol",
    "404": "Tokyoite Spurs fan embarks on 17th trip to San Antonio to see his team https://t.co/dD8pT8YpMy https://t.co/fThKHzqdNA",
    "405": "David Robinson San Antonio Spurs Mitchell &amp; Ness NBA 92-93 All Star Swingman Jer https://t.co/LrXSj2R7Oh eBay https://t.co/DpVAZrRAhu",
    "406": "Air Johnson! Spurs' Keldon Johnson takes flight over San Antonio https://t.co/jNGQPJUWCk #nba75 #porvida #nbatwitter",
    "407": "THE UTAH JAZZ AND THE SAN ANTONIO SPURS ARRRRRREEEEEEEEE STARRRRRRTTTTIIIIINNNGGGGGGGGG!!!!!!!!!!! https://t.co/mAG4VBkHfA",
    "408": "Utah Jazz\n@ San Antonio Spurs\nFri 8:40 PM EST\n\n🏀 Bet of the Game 🏀\n\n🟡 Under 228.5 -110",
    "409": "Watch Live Stream of Utah Jazz vs San Antonio Spurs\nhttps://t.co/sKaFVat5SJ",
    "410": "San Antonio Spurs Starters:\n\nDejounte Murray\nDevin Vassell\nJosh Richardson\nKeldon Johnson\nJakob Poeltl\n\nPlayers out:\nKeita Bates-Diop\nDevontae Cacok\nRomeo Langford\nDoug McDermott\nJoshua Primo\n#PorVida #NBA #NBATwitter #NBA75",
    "411": "@RexChapman Spurs.  Because nothing screams San Antonio like stripes of teal, pink, and rust.",
    "412": "Tonight's starting lineup for the San Antonio Spurs: Murray, Richardson, Vassell, Johnson, Poeltl https://t.co/bVWH4AMCA2",
    "413": "San Antonio Spurs look to shore up home record on Friday night as they face the Utah Jazz #PorVida  https://t.co/nQZQS3bQCQ"
}