{
    "0": "Deni Avdija:\nThe good news is that he doesn't need to pack his stuff.\nThe bad news is that he probably should (have)...\n#Washington #Wizards is likely the team that has changed the most during this #NBATradeDeadline, yet when the dust settles, you realize it's the same s--t.\n#NBA https://t.co/jLy3W5OmeO",
    "1": "TIP OFF TIME IN WASHINGTON❗❗ Nets vs Wizards coming up RIGHT NOW on YES😎\n\nWatch on YES and Stream it LIVE with the YES app: https://t.co/aRu5PF6iD2\n\n#NETSonYES https://t.co/1juiYE4Vt8",
    "2": "The #Nets try to clinch the season series with their 4th straight victory over the #Wizards. #Brooklyn has defeated #Washington twice in 2021-22, including 119-118 on Jan. 19 in the nation's capital. #KyrieIrving scored 30 points in that win.\n#NBA \n#NBAonTNT \n@NBA \n@NBAonTNT https://t.co/5DH2qhR9cb",
    "3": "ALERT: New high roller bet posted!\nA bet has been placed for $6301.92 on Washington Wizards - Brooklyn Nets to win $11,532.52.\nTo view this bet or copy it https://t.co/wPjElA5Np4 https://t.co/UHERKIHCQ7",
    "4": "ALERT: New high roller bet posted!\nA bet has been placed for $10742.42 on Washington Wizards - Brooklyn Nets to win $21,592.25.\nTo view this bet or copy it https://t.co/ZSayhwMxZ8 https://t.co/eyEJHRM0hE",
    "5": "ALERT: New high roller bet posted!\nA bet has been placed for $14,899.10 on Washington Wizards - Brooklyn Nets to win $28,457.28.\nTo view this bet or copy it https://t.co/OgrnpVkNpW https://t.co/0dtFWjPlcl",
    "6": "Washington Wizards - Brooklyn Nets\n\nBet slip link: https://t.co/xWonavTbxX https://t.co/H2b2o0n3Mh",
    "7": "Washington Wizards - Brooklyn Nets\n\nBet slip link: https://t.co/osVKXhgo5b https://t.co/SQdwquhZis",
    "8": "Washington Wizards (-1.5) vs. Brooklyn Nets! #NetsWorld #DCAboveAll #NBA #NBATwitter #NBA75",
    "9": "⬇️ Traspaso entre MAVERICKS y WIZARDS:\n\n🇱🇻 Kristaps PORZINGIS se marcha a Washington.\n\n👉 A cambio, Dallas recibe a Spencer DINWIDDIE y Davis BERTANS.\n\n#NBA https://t.co/va9Ax4Fpjn",
    "10": "Washington Wizards Starters:\n\nRaul Neto\nCorey Kispert\nKentavious Caldwell-Pope\nKyle Kuzma\nThomas Bryant\n\nPlayers out:\nVernon Carey\nDaniel Gafford\nKristaps Porzingis\nIsh Smith\n#DCAboveAll #NBA #NBATwitter #NBA75",
    "11": "ALERT: New high roller bet posted!\nA bet has been placed for $9978.64 on Washington Wizards - Brooklyn Nets to win $20,156.85.\nTo view this bet or copy it https://t.co/apoa0JopgQ https://t.co/q0xPhEPX5G",
    "12": "Washington Wizards - Brooklyn Nets\n\nBet slip link: https://t.co/8rARySC876 https://t.co/rrEyCTMPiK",
    "13": "Tonight's starting lineup for the Washington Wizards: Neto, Caldwell-Pope, Kispert, Kuzma, Bryant https://t.co/bVWH4AMCA2",
    "14": "@MarlonG45 @abbystolz17 He’s old, he’s knees are shot, it would be like  Washington Wizards Michael Jordon.",
    "15": "Agora vou assistir Brooklyn Nets contra Washington Wizards",
    "16": "Brooklyn Nets\n@ Washington Wizards\nThu 7:30 PM EST\n\n🏀 Bet of the Game 🏀\n\n🟢 WAS -1.0 -110",
    "17": "NBA Live Thread: Brooklyn Nets at Washington Wizards, 7:30 EST https://t.co/rtOvGr7kIM https://t.co/aJrDnSXQCC",
    "18": "Washington Wizards bolstered its forward position after acquiring Kristaps Porzingis (@kporzee) from Dallas Mavericks at the close of the 2021-2022 NBA Season trade deadline on Thursday (Friday in the Philippines).\nhttps://t.co/OTiiAa4QqW",
    "19": "Why Kristaps Porzingis is a slam dunk acquisition for the Washington Wizards https://t.co/QqkJRAtmkm #NBA #WashingtonWizards",
    "20": "ML PARLAY\nWashington Wizards -105\nNew Orleans Pelicans +158\nHouston Rockets +274\nLos Angeles Clippers +222\n\n Pays 60 to 1",
    "21": "#breaking Kristaps Porzingis Sources - Dallas Mavericks trading Kristaps Porzingis to Washington ...,Reports: Mavericks trade Kristaps Porzingis to Wizards The Mavericks are trading Kristaps Porzingis and a second-round pick to the Wizards for Spencer Dinwiddie and Davis Bertans,",
    "22": "HOMECOMING OF SORTS: Tarboro native Montrezl Harrell is coming to the Charlotte Hornets in a trade from the Washington Wizards, officials said Thursday. https://t.co/wcCCwdBdZc",
    "23": "Washington Wizards making deals ahead of NBA trade deadline https://t.co/T6z8GVh6H1",
    "24": "HOMECOMING OF SORTS: Tarboro native Montrezl Harrell is coming to the Charlotte Hornets in a trade from the Washington Wizards, officials said Thursday. https://t.co/uemkAoIW7a",
    "25": "WASHINGTON (AP) — Washington Wizards guard Bradley Beal had surgery Thursday to repair a torn ligament in his left wrist, the team said. https://t.co/jizTFaNjBD",
    "26": "@JustinCosing1 @Luka77GOAT @MagicJohnson I have nothing but love for KP and hope he has a great career in Washington. I'm frustrated that he never played to his potential in Dallas but I think that's just injuries and weird coaching decisions. Maybe he can start the Wizards turn around.",
    "27": "Washington wizards had the dumbest Trades this year",
    "28": "Game Thread: Brooklyn Nets (29-25) at Washington Wizards (24-29) Feb 10 2022 7:30 PM https://t.co/JzkzWgMQzC",
    "29": "((LIVE)) NBA Basketball Washington Wizards vs Brooklyn Nets | [Stream Now] : https://t.co/gNYGpmt2Wy | 10-Feb-22 | 19:30 | NBA | Basketball | Washington Wizards | vs | Brooklyn Nets https://t.co/Klx77yXARi",
    "30": "Mired in a nine-game losing streak, the Brooklyn Nets traded James Harden in a blockbuster deal hours before tonight's game at the Washington Wizards 🏀 \n\n#NBA #DCAboveAll #NetsWorld\n\nhttps://t.co/1bWISsKvbz",
    "31": "If Porzingis can stay healthy, its a steal for the Wizards. Dinwiddie was on his way out of Wiz anyway. To get Kristaps for Dinwiddie is big win for Washington",
    "32": "@JuegaEnLinea Gana - Washington Wizards\n           - Dallas Mavericks\n           - Milwaukee Bucks\n\nUsuario: yoma68",
    "33": "#Washington #Wizards is the #NBA team that has changed the most.\nIn-spite of bringing @kporzee it doesn't feel as if they were looking to 'save' this season rather to ensure that @RealDealBeal23 sign (and he likely will).\n#KristapsPorzingis #Porzingis #BradleyBeal #Trade #Trades https://t.co/le144bWJAR",
    "34": "Sources - Dallas Mavericks trading Kristaps Porzingis to Washington Wizards for Spencer Dinwiddie, Davis Bertans. Wow 😳😳😳😳😳  https://t.co/xXCEi82qlI",
    "35": "Dallas Mavericks Deal Kristaps Porzingis To Washington Wizards Prior To NBA Trade Deadline https://t.co/6x4xeGFVyq https://t.co/B9CdMqgpHV",
    "36": "@JuegaEnLinea Phoenix Suns Gana\nWashington Wizards Gana\nDallas Mavericks Gana\nUsuario: Nelson1712\n#QuinielaExpressNBA",
    "37": "Kristaps Porzingis was traded by Dallas Mavericks to the  Washington Wizards in exchange of Spencer Dinwiddie and Davis Bertans. \n\nThe Mavs will also get a future second-round pick, sources tell ESPN's Adrian Wojnarowski. https://t.co/WNFO3UNe11",
    "38": "GBO &amp; Ant’s NBA @fanduel picks for February 10th. A Washington Wizards special! Reply with a player you’re rostering! #fanduel #dfs #draftkings #nba #nbafantasy #fantasybasketball #bookit #fanduellineups https://t.co/l2IZlHCGcV",
    "39": "@elkingpedro @Michael98503154 @fishsports @WashWizards In Dallas we have been wanting to trade KP for a pepsi and a bag of chips... He's that awful and finally a team came along and said Hi, we'll take him off ur hands...\n\nThank U Washington Wizards!!!",
    "40": "Todays Free Pick💎\n\nWashington Wizards ML💰\n\n1.6 Units Wins 1.5U📈",
    "41": "📈 WASHINGTON BOOSTER 📈\n\nWizards &amp; Capitals Both Win\n+144 ➡️ +175\n\n➡️ https://t.co/9KlvxNEjv2 https://t.co/Q9lvbSCRME",
    "42": "Sources: Mavs trading Porzingis for Dinwiddie: The Mavericks are trading Kristaps Porzingis and a second-round pick to the Wizards for Spencer Dinwiddie and Davis Bertans, sources told ESPN. Washington also is sending center Montrezl Harrell to Charlotte… https://t.co/U7bVNl3wvP https://t.co/N7Rrc3V5gA",
    "43": "Okay now THIS I can get into. Let's see the Washington Actual Wizards and Orlando Literal Magic go to war against the Central Coalition (who are centaurs)\n\nhttps://t.co/u2Rn12suPY",
    "44": "Sources - Dallas Mavericks trading Kristaps Porzingis to Washington Wizards for Spencer Dinwiddie, Davis Bertans https://t.co/FXy5Lbmk4c",
    "45": "ALERT: New high roller bet posted!\nA bet has been placed for $8410.43 on Washington Wizards - Brooklyn Nets to win $15,222.88.\nTo view this bet or copy it https://t.co/FqRonNmjei https://t.co/18tPUNnFuC",
    "46": "@andrejamal79 You know the NBA considers you average when you get traded to the Washington Wizards straight up for Spencer Dinwiddie. Kristaps Porzingis stock has fell drastically. At least my NY Knicks seen it early.\n\n#NBA #NBATradeDeadline",
    "47": "Dallas Mavericks trading Kristaps Porzingis to Washington Wizards for Spencer Dinwiddie, Davis Bertans https://t.co/scBixjPAIC",
    "48": "NBA Trade Deadline Winners have to be the Philadelphia 76ers, Los Angeles Clippers, Indiana Pacers, Cleveland Cavaliers and Washington Wizards. Sacramento Kings won and lost. I like their additions but not their subtractions. I also like the Charlotte Hornets acquisition of Trezz",
    "49": "https://t.co/zMvmXzwVX7 Kristaps Porzingis - Welcome to Washington Wizards ! #RwOT #Rwanda #Sports",
    "50": "In other Nets news: Nets broadcaster, my uncle Ian Eagle turned 53 &amp; the Washington Wizards honored him before tonight’s game here in DC.\n\nShow your love for Ian Eagle. https://t.co/8u6aBL9zmh",
    "51": "Dallas trades @kporzee to Washington Wizards, winning both ways being that those are both my teams so for sure going to be a good move. catch you walking around DC KP 👀🙌🏼",
    "52": "But Harden, LeBron James (37), Kevin Durant (33), Chris Paul (36), and Steph Curry (33) are still All-Stars. Michael Jordan retired from the Chicago Bulls after his age 34 season and sat out three years and then played at age 38-39 for the Washington Wizards. After 33 seems hard.",
    "53": "Dallas Mavericks trading Kristaps Porzingis to Washington Wizards for Spencer Dinwiddie, Davis Bertans https://t.co/4y66Kzbkeh",
    "54": "Dallas Mavericks Trade KP To Washington Wizards w/ @ColbySapp \n\n#NBA #NBATradeDeadline #Mavs #Wizards \n\nhttps://t.co/PJ5IDWlulL",
    "55": "Dallas Mavericks Trade KP To Washington Wizards w/ @ColbySapp \n\n#NBA #NBATradeDeadline #Mavs #Wizards \n\nhttps://t.co/cs0pTVfR5W",
    "56": "Dallas Mavericks Trade KP To Washington Wizards w/ @ColbySapp \n\n#NBA #NBATradeDeadline #Mavs #Wizards \n\nhttps://t.co/TIAWhRaWbw",
    "57": "@WashWizards Hey all, what's the best fan account of Washington Wizards?",
    "58": "Maybe this is the Wizards attempt at followin the blueprint of what the bulls did last season….Thing is, players wanted to play for the bulls. Does this move attract good FA to Washington???? With Porzingis injury history, ion know",
    "59": "The Dallas Mavericks have traded Kristaps Porzingis to the Washington Wizards 🤯 https://t.co/u4EjNp5aCZ",
    "60": "How did the hornets not give up PJ washington for Harrell?? and how did the wizards not give up harrell in that trade for porzingis lmaooo",
    "61": "In the biggest of a series of deadline moves for the Wizards, Washington acquired former All-Star Kristaps Porzingis from the Dallas Mavericks in exchange for Spencer Dinwiddie and Davis Bertans. https://t.co/ohAjdJH8ix",
    "62": "Washington Wizards",
    "63": "The Dallas Mavericks are trading Kristaps Porzingis to the Washington Wizards? For Spencer Dinwiddie and Davis Bertans??? What is this?",
    "64": "Washington Wizards\n2/10 Trade Infomation\n\n【OUT】\nMontrezl Harrell ⇒ CHA\nSpencer Dinwiddie ⇒ DAL\nDavis Bertans ⇒ DAL\nAaron Holiday ⇒ PHX\n\n【IN】\nKristaps Porzingis ← DAL\nIsh Smith← CHA\nVernon Carey Jr. ← CHA\n金銭 ← PHX",
    "65": "I  asked Mark Cuban for his comments on the Kristaps Porziņģis trade to the Washington Wizards. @mcuban response:\n\n“We thank KP for all he did for us. We are excited to add Spencer (Dinwiddie) and Davis (Bertans).”",
    "66": "The Charlotte Hornets are trading Ish Smith and Vernon Carey Jr to the Washington Wizards for Montrezl Harrell.",
    "67": "Goran Dragic should be a buyout target for the Washington Wizards. He will likely resign with Miami Heat, but it would be an ideal fit with the addition of Porzingis.",
    "68": "Tobias Fünke applying for a job with the Washington wizards https://t.co/yRtoD9qQU1",
    "69": "I'm trying to process the NBA trade between the DALLAS MAVERICKS &amp; WASHINGTON WIZARDS.......",
    "70": "2024-25 Wizards roster:\n\nTy Ty Washington\nBradley Beal\nLebron James\nKristaps Porzingis\nBol Bol\n\nBench: Bronny, Rui, Deni, Kispert, Jimmer Fridette, Thomas Bryant\n\nWHO’S STOPPING US???",
    "71": "My mastermind plan for the Wizards to get a championship: \n\n-Tank the rest of the season and end with a top 5 pick\n-Trade that pick back into the 10-14 range and get Ty Ty Washington \n-Get a 2024 FRP and use that to select Bronny James\n-Trade or sign Lebron",
    "72": "Dallas Mavericks trading Kristaps Porzingis to Washington Wizards for Spencer Dinwiddie, Davis Bertans https://t.co/TpBKTPoRWe",
    "73": "Dallas Mavericks Deal Kristaps Porzingis To Washington Wizards Prior To NBA Trade Deadline https://t.co/9UhCxjZ5CG",
    "74": "@kporzee How do you feel about the trade to the Washington #Wizards?",
    "75": "@ImClique_ washington wizards vid",
    "76": "@RustyBUCKETS321 Preach and I’m from Washington DC 🤦🏾‍♂️ wizards said fuck it let’s just keep getting everybody trash that the other don’t want first Kuzma now this",
    "77": "Reports: Dallas Mavericks trade Kristaps Porzingis to Washington Wizards https://t.co/EFtYCqR0yp via @Yahoo",
    "78": "If Dinwiddie actually does well here in Dallas, Wizards fans gonna be mad asf cuz he was terrible in Washington",
    "79": "I’ve got two names to upgrade the PG position this summer for the Wizards. TyTy Washington (draft) Collin Sexton (trade)",
    "80": "@skullizen one of my favorite players, Kristaps Porzingis, played for my favorite team, the Dallas Mavericks. They traded him to the Washington Wizards for two players who do not match his skill level at all. I am sad. Pain. Sadness.",
    "81": "The Mavericks have traded Kristaps Porzingis and a second round pick to the Washington Wizards for Spencer Dinwiddie and Davis Bertans",
    "82": "🔴Live ~ Brooklyn Nets vs. Washington Wizards - NBA League | 2022 💯\n🔗 🔴Watch Live Fullᴴᴰ 👉 : https://t.co/vEMDW8lWVT ✅\n📆 :On Thursday. February 10 /2022\n⏰ 7:30 PM\nDONT FORGET TO RE-TWEET AND FOLLOW FOR MORE INFO AND UPDATE.",
    "83": "The Dallas Mavericks have traded Kristaps Porzingis to the Washington Wizards for two players. @NickVanExit reacts to the deal. https://t.co/sjcZxW7Top",
    "84": "The Mavericks trade Kristaps Porzingis for Spencer Dinwiddie | NBA Today #Washington #Wizards #NBA Video: https://t.co/1Ww9uRL0RQ",
    "85": "Plantilla Washington Wizards: \nBradley Beal\nKyle Kuzma\nKristaps Porzingis\nKentavious Caldwell-Pope\nDeni Avdija\nDaniel Gafford\nRaul Neto\nCorey Kispert\nRui Hachimura\nThomas Bryant\nIsh Smith \nAnthony Gill\nVernon Carey Jr.\nIsaiah Todd\nCassius Winston\n#NBATradeDeadline #Wizards",
    "86": "@DeadPresPicks @AnalyticsCapper Wizards PA Announcer \"And Starting for your Washington Wizards at all 5 positions Kyle Kuzzzzzzzzzmaaaaa \"",
    "87": "Mavs see the Wizards in Washington on April 1st (April Fools lmao)",
    "88": "Friday's NBA schedule sees the Memphis Grizzlies head to Detroit Pistons while the Brooklyn Nets visit the Washington Wizards a...\n\nbookies_online #SportsBetting \nhttps://t.co/0D30AR3f0b",
    "89": "Dallas Mavericks Deal Kristaps Porzingis To Washington Wizards Prior To NBA Trade Deadline https://t.co/KPSQRoMfGD https://t.co/zAOTjQs3Iq",
    "90": "Dallas Mavericks Deal Kristaps Porzingis To Washington Wizards Prior To NBA Trade Deadline https://t.co/REubJ6O3Ed",
    "91": "wolves win 134-122 over the wizards! curry dropped 43 for washington but fouled out in clutch time.\n\nja morant dropped 50 and 14 outta nowhere\n\nJJJ dropped 13 &amp; 10 with 4 blocks\n\nWCJ dropped 10 &amp; 15\n\ndort also had his best game so far with the wolves with 10-4-5 on 4-5 shooting",
    "92": "Kristaps Porzingis pasa a los Washington Wizards\n\nSpencer Dinwiddie y Davis Bertans pasan a los Dallas Mavericks https://t.co/74Pmt4VbXJ",
    "93": "Washington Wizards assistant coach Mike Batiste gets 2-game suspension for confronting fan\nhttps://t.co/1hRjIKXV1Y\nhttps://t.co/1hRjIKXV1Y",
    "94": "Recap for tonight:\n\nCBB:\nPurdue -3.5\nWashington-1.5\n\nNBA:\nWizards -3\n\n#college #collegebasketball #nba #cbb #purdue #gamblingTwittter #bettingtips #betting #bettingsports",
    "95": "Dallas Mavericks Deal Kristaps Porzingis To Washington Wizards Prior To NBA Trade Deadline https://t.co/6nusJBR6JX",
    "96": "Washington #Wizards still have a clogged Center position with the addition of #Porzingis. They should have dealt Thomas Bryant for a guard.",
    "97": "The endgame of the Kristaps Porzingis trade to the Washington Wizards is a Twin Towers pairing VS the @MiamiHEAT.",
    "98": "🏀|#NBA75 \n\nBombazo 💣 \n\n-Dallas Mavericks recibe a Spencee Dinwiddie y Davis Bertans. \n\n-Washington Wizards recibe a Kristaps Porzingis y pick de 2da ronda.\n\n#NBATwitter",
    "99": "Thank you Washington wizards",
    "100": "Wizards Assistant Coach Mike Batiste Suspended 2 Games for Fan Confrontation #Washington #Wizards #NBA https://t.co/LDJUHNUIkS",
    "101": "The Dallas/Washington trade is interesting i think Dinwiddie &amp; the Laser are a good fit with Luka.\n\nMaybe Kristaps can bounce back with the Wizards?",
    "102": "The Dallas Mavericks have traded Kristaps Porzingis for the Washington Wizards for Spencer Dinwiddie in an odd move. https://t.co/2NrWhPUiUI",
    "103": "Vinnie pick of the day\n- Brooklyn Nets vs Washington Wizards\n- Pick: Brooklyn Nets ML (+105)\n#GamblingTwitter https://t.co/lOuByq5k9x",
    "104": "Washington Wizards &amp; the trade deadline: no matter how it feels on the day of the moves within two weeks its basically rearranging chairs on the Titanic.",
    "105": "Washington #Wizards assistant coach #MikeBatiste has been suspended two games without pay for entering the stands in an attempt to confront a fan, the NBA announced Thursday.  🏀 #NBATwitter #NBA https://t.co/O8IYmLqnE7",
    "106": "Update I mean washington wizards https://t.co/PauifDMEBz",
    "107": "🏀✅ Kristaps Porzingis ha sido traspaso a los Washington Wizards a cambio de Spencer Dinwiddie y Davis Bertans. https://t.co/pVvIC1Be2s",
    "108": "Reports: Dallas Mavericks trade Kristaps Porzingis to Washington Wizards – NBA News https://t.co/5JwcOmfvOl",
    "109": "Wizards shake up roster in trade for Kristaps Porzingis #Washington #Wizards #NBA https://t.co/lZCejiMMUI",
    "110": "The Dallas Mavericks have agreed to trade Kristaps Porzingis to the Washington Wizards for a package featuring Spencer Dinwiddie. https://t.co/dkBJrWHo0q",
    "111": "The Dallas Mavericks have agreed to trade Kristaps Porzingis to the Washington Wizards for a package featuring Spencer Dinwiddie. https://t.co/IIKL2pVQZy",
    "112": "2/  The #Wizards also are sending  #MontrezlHarrell to the #Hornets for  #VernonCareyJr. and #IshSmith, sources told Wojnarowski. Washington traded guard  #AaronHoliday to the #Suns as well, a source told ESPN, confirming an Athletic report.  🏀 #NBATradeDeadline #NBATwitter",
    "113": "Opening up another East team. Washington Wizards, let's get ready for the Unicorn.",
    "114": "@LiteralNBAFacts I’m thinking Dinwiddie needed to get out of Washington. He can’t be that bad. You just know he hated the wizards catering everything to Beal. Those comments about speaking up didn’t go unnoticed.",
    "115": "🚨 Line Change 🚨\n\nBrooklyn Nets @ Washington Wizards\nThu 7:30 PM EST\n\nFrom:\nWAS -2.5 -110\n\nTo:\nWAS -1.0 -110",
    "116": "🏀 Two struggling teams do battle out east as the Washington Wizards host the Brooklyn Nets.\n\n🏟️ Nets-World pick by @jrbrowne21 \n\n#NetsWorld #DCFamily #NBATwitter\nhttps://t.co/5nhHaBpmEL",
    "117": "Consensus Line Move:\n2022-02-10 Brooklyn Nets at Washington Wizards from 216.50 to 218.00\nOver in trouble\n#NBA #NBATwitter #coder #bitcoinmining",
    "118": "BioReference values the opportunity to collaborate with the #WashingtonWizards as we continue our journey to bring innovative health and performance testing solutions to athletes nationwide. https://t.co/Qhik5Ruxak https://t.co/nb8huWwOLP",
    "119": "The Mavericks have traded Kristpas Porzingis to the Washington Wizards for Spencer Dinwiddie and Davis Bertans. https://t.co/h4CqenZvLu",
    "120": "TRADE:\n\nDallas gets: Spencer Dinwiddie, Davis Bertans\n\nWashington gets: Kristaps Porzingis, 2nd round pick\n\nWho wins, #Wizards or #Mavs?",
    "121": "The Dallas Mavericks have agreed to trade Kristaps Porzingis to the Washington Wizards for a package featuring Spencer Dinwiddie. https://t.co/IvDiypgQnL",
    "122": "Report: Mavericks Trade Kristaps Porzingis To Washington Wizards – NBA News https://t.co/btqqZTU0LZ",
    "123": "@HickoryHigh Washington Wizards\n\nOut: M. Harrell, S. Dinwiddie, D. Bertans\n\n\nIn: K. Porzingis, I. Smith, V. Carey\n\nGrade: https://t.co/XyXWzZgUhR",
    "124": "Kristaps Porzingis is headed to Washington in the deal, per Stein, while Dallas will receive point guard Spencer Dinwiddie, #MAVS #Wizards",
    "125": "@wtevs Martin Amis once wrote \"The universe is a million billion light-years wide, and every inch of it would kill you if you went there. This is the position of the universe with regards to human life.\" Maybe he was actually talking about the Washington Wizards franchise though?",
    "126": "Same with Porzingis (now getting traded to the Washington Wizards), he just fits better on the East Coast.",
    "127": "Vernon Carey Jr. to the Washington Wizards #DukeInTheNBA 😈 https://t.co/E0rsznS42Y",
    "128": "The Dallas Mavericks are trading Kristaps Porzingis to the Washington Wizards  for a package centered on Spencer Dinwiddie, sources tell Adrian Wojnarowski and Tim MacMahon. https://t.co/UF0BwQgIzo",
    "129": "Mavericks shockingly trade Kristaps Porzingis to the Wizards #Washington #Wizards #NBA https://t.co/5l42Cfgpkm",
    "130": "The Dallas Mavericks have traded Kristaps Porzingis to the Washington Wizards for two players. @NickVanExit reacts to the deal. https://t.co/gnqfFpA0Vr",
    "131": "🚨OFICIAL🚨\nLos Washington Wizards traspasan a AARON HOLIDAY a Phoenix Suns.\n#NBA #NBATradeDeadline https://t.co/n1H7sUbfhZ",
    "132": "@KStark24 @mavsmarie The trade has nothing to do with anything. Bertans was one of the best perimeter shooters in the league in his first year in Washington. He signed a 5-year extension with the Wizards, showed up out of shape in 2020 and hasn’t been close to the player he was before the contract.",
    "133": "DALLAS (AP) — The Dallas Mavericks are sending Kristaps Porzingis to the Washington Wizards for Spencer Dinwiddie and Davis Bertans, a person with knowledge of the trade said Thursday. https://t.co/4yRvXP5Kj3",
    "134": "Included in the Simmons-Harden deal were Seth Curry and Andre Drummond (both to BKN) and Paul Millsap (to PHI) along with a bounty of draft picks.\n\nThe trade deadline saw a flurry of deals, including former #NBAAllStar Kristaps Porzingis being sent to the Washington Wizards.",
    "135": "Charlotte Hornets finessed Washington Wizards getting Montrezl Harrell. Wizards on full tank mode with Bradley Beal heading into free agency. https://t.co/RLqH13jRNp",
    "136": "Wizards trade Aaron Holiday to Suns #Washington #Wizards #NBA https://t.co/pkOBEU86wu",
    "137": "Take the Wizards outta Washington  😂😂😂😂😂",
    "138": "@wojespn Dallas Mavericks &amp; Mark Cuban got finessed by the lonely  Washington Wizards 😂🤣 @mcuban",
    "139": "@JuegaEnLinea Gana Washington Wizards / Gana Dallas Mavericks / Gana Phoenix suns Usuario yordare",
    "140": "@1tzTommy @espn @wojespn @espn_macmahon The Washington Wizards are the team that got fleeced. https://t.co/taiynwMyVU",
    "141": "I remember A few weeks ago you cats were losing your mind over the Washington wizards...I told ya'll them &amp; the knicks were cheek lol",
    "142": "My NBA trade deadline grades:\nA+ Brooklyn Nets\nB+ Washington Wizards, Dallas Mavericks, Boston Celtics, Bucks \nF goes to Los Angeles Lakers, New York Knicks",
    "143": "2022-2023 Washington Wizards https://t.co/l9EAAdSfU3",
    "144": "🚨 TRADE ALERT 🚨\n\nThe Hornets acquire veteran Montrezl Harrell from the Wizards. Washington get Vernon Carey and Ishmael Smith 🏀\n\n#NBA #NBATwitter #NBATradeDeadline #DCAllAbove #AllFly https://t.co/0UFsZptVVz",
    "145": "It's hard to win the NBA, and assessments of front offices tend to be driven by a few high profile and high leverage (noisy) events, but the Washington Wizards seem *very* well run to me at the moment. https://t.co/fdTqrYfK5z",
    "146": "Kristaps Porzingis ha sido traspasado a los Washington Wizards\n\nSpencer Dinwiddie y Davis Bertans se marchan a los Dallas Mavericks\n\n‼️ https://t.co/HLLBrptR4c",
    "147": "Report: Mavericks Trade Kristaps Porzingis To Washington\nWizards \nhttps://t.co/TsiteaKF5F",
    "148": "Ish...Smith the starting the point guard for the Washington Wizards???\n\nOr is Schroder going to get bought out and look to sign with the Wizards for a secure starting gig?",
    "149": "Dallas Mavericks shockingly trade Kristaps Porzingis to the Washington Wizards – NBA News https://t.co/1qQaJGAJ8L",
    "150": "CAMBIO ‼️\n\nWashington Wizards recibe : \n\n• K. Porzingis \n• Escogencia 2da ronda \n\nDallas Mavericks recibe : \n\n• Spencer Dinwiddie \n• Davis Bertans \n\n#NBAEnHDN https://t.co/lhksleWGMZ",
    "151": "#BREAKING The Dallas Mavericks are sending Kristaps Porzingis to the Washington Wizards, according to multiple reports. https://t.co/fHS1MwMGcb",
    "152": "It seems it’s time for me to be a part time Wizards fan now. Lets go WASHINGTON!!!!! https://t.co/YFLZlZlrN9",
    "153": "The Charlotte Hornets are trading center Vernon Carey and guard Ish Smith to the Washington Wizards for forward Montrezl Harrell, sources confirmed to @NickCarboniWCNC. #NBA #AllFly  https://t.co/ybXhxm3VTJ",
    "154": "@TheHoopCentral washington wizards",
    "155": "CAMBIO !!\n\nCharlotte Hornets recibe : \n\n• Montrezl Harrell \n\nWashington Wizards recibe: \n\n• Ish Smith  \n• Vernon Carey \n\n#NBAEnHDN https://t.co/AgEvKS1JqD",
    "156": "Washington Wizards are trading Spencer Dinwiddie &amp; Davis Bertans to the Mavs for Kristaps Porzingis, per @ShamsCharania https://t.co/1OIt24ZoZz",
    "157": "@wojespn What are the Washington Wizards thinking trading away Spencer Dinwiddie and Montrezl Harrell. These two trades are absolutely horrible trades for the Washington Wizards. No chance that Bradley Beal will be staying in DC now. https://t.co/neU1n1vHwd",
    "158": "Report: Mavericks Trade Kristaps Porzingis To Washington Wizards https://t.co/WAeKifvb04",
    "159": "The Dallas Mavericks reportedly have agreed to trade with the Washington Wizards, according to multiple reports.\n\nDallas receives:\n\nSpencer Dinwiddie\n\nDavis Bertans\n\nWashington receives:\n\nKristaps Porzingis\n\nFuture second-round pick\n\nhttps://t.co/ZKVt3Rulk1",
    "160": "Wizards sender Harrell til Hornets – og handler med Suns\n\nWashington Wizards har handlet med to hold i NBA, hvor de blandt andet har sendt Montrezl Harrell til Charlotte Hornets.\n\nThe post Wizards sender Harrell til Hornets – og handler med Suns appeared… https://t.co/YXuGhCDQOu",
    "161": "@TheHoopCentral Washington Wizards",
    "162": "Kristaps Porzingis, traspasado a Washington Wizards\nhttps://t.co/cnVt8EVgSs",
    "163": "Washington Wizards are trading Spencer Dinwiddie &amp; Davis Bertans to the Dallas Mavs for Kristaps Porzingis..",
    "164": "How did we get Tinder Swindlered by the damn Washington Wizards?",
    "165": "My thoughts on Dallas Mavericks trading Kristaps Porzingis and a second round pick to Washington Wizards for Spencer Dinwiddie and Davis Bertans as all of this happened on my birthday ironically enough https://t.co/EZM4aKqIUb",
    "166": "Mavs traded a 7’3” shooting guard for 2 guys the Washington wizards actively wanted off of their team. Good job",
    "167": "#NBA75  : \nPhoenix Suns - Milwaukee Bucks\nOVER 233.5@ 1.95\nWashington Wizards -1.5 @ 1.95",
    "168": "🚨Trade Alert:\nDallas Mavericks-- Kristaps Porzingis, and second-round pick\nWashington Wizards-- Davis Bertans, and Spencer Dinwiddie https://t.co/Lwa1ec8xuX",
    "169": "@TTWirePodcast the washington wizards",
    "170": "We need to get Kristaps Porzingis some new Washington @Commanders gear! Porzingis was traded to the Wizards today. \n\nPorzingis is a fan of the team.👇🏾👇🏾\n\n@wusa9 #DCAboveAll #TakeCommand \n\n https://t.co/d0NK68NJsW",
    "171": "🚨 TRADE ALERT 🚨\n\nKristaps Porzingis is headed to the Wizards and Dallas get Spencer Dinwiddie.\n\nUpdate: Mavs also get Davis Bertans as part of trade.\n\n#dallasmavericks #washingtonwizards https://t.co/7nOYF8hX6y",
    "172": "The Washington Wizards finally realized that it’s time to tank https://t.co/wFaoutaNsh",
    "173": "@ShamsCharania @kevinsheehanDC @TheAthletic @Stadium Sources: Dallas Mavericks trading Kristaps Porzingis to Washington Wizards for Spencer Dinwiddie, Davis Bertans",
    "174": "The Washington Wizards have acquired 26-year old big man Kristaps Porzingis and a second-round pick from the Dallas Mavericks for Spencer Dinwiddie and Davis Bertans. https://t.co/bOuAS3XtIa",
    "175": "@wojespn Russell Westbrook to the Washington Wizards via Trade for Kyle Kuzma,Caldwell-Pope &amp; Protected 2024 Second Round Pick ##Woj",
    "176": "@MattRoy_TV Wizards got rid of their two worst contracts for an All-Star and a draft pick. Dinwiddie hated Washington. Bertrand is getting $80 million to score 5 PPG. There is no world where they lose that trade. \n\nIn fact, it’s a massive W. Huge finesse.",
    "177": "@andypollin1 Sources: Dallas Mavericks trading Kristaps Porzingis to Washington Wizards for Spencer Dinwiddie, Davis Bertans",
    "178": "also, to keep my trade deadline takes confined to one thread, i don't know how else to explain this but mid-career porzingis has such extreme and specific Washington Wizards Energy",
    "179": "@KOT4Q The Return of the Washington Wizards https://t.co/bJd6jn5x9f",
    "180": "Let's make a deal: Dallas Mavericks trade Kristaps Porzingis to Washington Wizards for a package of players including Spencer Dinwiddie, @CallieCaplan reports. #DallasMavericks #Mavs #DallasMavs #Porzingis #NBATradeDeadline #Wizards  https://t.co/PhfKSDsZGJ",
    "181": "@UrinatingTree @ShamsCharania @TheAthletic @Stadium the Washington Wizards, the place where careers go to die",
    "182": "idk whats worse the wizards losing everyone or mavs giving their assets to washington 😭",
    "183": "Dallas Mavericks shockingly trade Kristaps Porzingis to the Washington Wizards https://t.co/iIiPTmDoiN #NBA #DallasMavericks #WashingtonWizards",
    "184": "Kristaps Porzingis pasa a los Washington Wizards\n\nSpencer Dinwiddie y Davis Bertans pasan a los Dallas Mavericks https://t.co/NeqU75KUjH",
    "185": "WINNER OF THE NBA TRADE DEADLINE IS THE WASHINGTON FUCKING WIZARDS FUCK YALL",
    "186": "Latvia - Sources: Dallas Mavericks trading Kristaps Porzingis to Washington Wizards for Spencer Dinwiddie, Davis Bertans https://t.co/oOYCKYj4Go",
    "187": "NBA - Sources: Dallas Mavericks trading Kristaps Porzingis to Washington Wizards for Spencer Dinwiddie, Davis Bertans https://t.co/Glsjml1Pbm",
    "188": "What are your thoughts on the Phoenix Suns-Washington Wizards trade?",
    "189": "🚨🚨The Dallas #Mavericks are trading Kristaps Porzingis (FORMER #Knick) to the Washington #Wizards for Spencer Dinwiddie &amp; Davis Bertans!!!🚨🚨\n\nIf a #Mavericks fan, you’ve gotta be somewhat disappointed in this trade in &amp; rightfully so.💯\n#Mavericks #KristapsPorzingis",
    "190": "@JuegaEnLinea Gana Washington Wizards / Gana Dallas Mavericks / Gana Phoenix Suns.\n#QuinielaExpressNBA\nUsuario: angelangel",
    "191": "The Dallas Mavericks are trading Kristaps Porzingis to the Washington Wizards, according to multiple reports.  https://t.co/7rNZAexiRJ",
    "192": "Consensus Line Move:\n2022-02-10 Brooklyn Nets at Washington Wizards from 218.00 to 216.50\nUnder wait for it...\n#NBA #sportsbettingadvice #statistics #success",
    "193": "Consensus Line Move:\n2022-02-10 Brooklyn Nets at Washington Wizards from -3.00 to -1.50\n#NetsWorld undervalued\n#NBA #CryptoHoops #coding #blockchain",
    "194": "Washington Wizards Assistant Coach goes after heckler. \n\nhttps://t.co/pJ2tPZDI96 https://t.co/rM4afdZMAD",
    "195": "#NBATradeDeadline #NBA75 #NBApl \n🚨 TRADE ALERT\n\nWashington Wizards:\n✅ Kristaps Porzingis\n✅ 2nd round pick \n\nDallas Mavericks:\n✅ Spencer Dinwiddie\n✅ Davis Bertans\n\nℹ️ @wojespn https://t.co/GzqlcbdF7e",
    "196": "The Washington Wizards are trading Bradley Beal to the Golden State Warriors for James Wiseman, Jordan Poole, Gary Payton II, and a 2023 1st Round pick, sources tell ESPN.",
    "197": "Montrezl Harrell se marcha de Washington Wizards\nhttps://t.co/be5qkPTYDx",
    "198": "Davis Bertans averaged 15 points, 4 boards, &amp; nearly 2 assists the year preceding his 5 yr, $80M extension with the #Wizards.\n\nThat dropped to 11/1/3 last year, and down to 5/.5/2 thus far this season.\n\nWashington paid him $32.1M for his efforts.",
    "199": "🚨 TRADE ALERT 🚨\n\nThe Washington Wizards trade Spencer Dinwiddie to the Dallas Mavericks for Kristaps Porzingis 👀\n\n#NBA #NBATwitter #NBATradeDeadline #DCAboveAll #MFFL https://t.co/2Vi8En0oau",
    "200": "@MarxGBaker How do we know they're washed? I'm not ready to conclude that based off a bad season in the wasteland that is the Washington Wizards",
    "201": "What are your thoughts on the Washington Wizards-Dallas Mavericks trade?",
    "202": "🚨 Porzingis Traded to Wizards: Dallas sends KP to Washington for package including Spencer Dinwiddie and Davis Bertans (multiple reports)\n\nhttps://t.co/PaQJu3pNhP\n\nIdk how I feel about this",
    "203": "BREAKING: The Phoenix Suns have acquired Aaron Holiday from the Washington Wizards in exchange for cash considerations. https://t.co/lqGftxCJVQ",
    "204": "Things i’m disappointed didn’t happen:\n\nMarcus Smart traded\nPJ Washington traded\nHawks active \nWizards trading more bigs \nKnicks being active \nMyles Turner traded\nJerami Grant traded \nMagic being active \nEric Gordon traded \nJohn Wall traded\nLAKERS ACTIVE",
    "205": "Reports: Dallas Mavericks trade Kristaps Porzingis to Washington Wizards #YahooSports #NBA https://t.co/OpDL6xsgXt",
    "206": "@shektheshrek I think they were bad in Washington but you still gotta let them play they can still ball tf out. They probably just hated playing for the wizards now they get to play on a playoff team. It’s gonna be different y’all talking like you got Kwame Fuckin brown these boys can ball",
    "207": "The Dallas Mavericks have traded Kristaps Porzingis and a second-round pick to the Washington Wizards for Spencer Dinwiddie and Davis Bertans.\n\nTune in to @1053thefan for reactions to the trade.\n\n📱: https://t.co/90ZZbtc0X8\n💻: https://t.co/keP8eGD0gW https://t.co/VVDolBPzN1",
    "208": "Suddenly I hate the Washington Wizards and I’m not quite sure why…",
    "209": "🚨 TRADE ALERT 🚨\n\nMontrezl Harrell is headed to Charlotte Hornets. Wizards get Ish Smith and Vernon Carey.\n\n#washingtonwizards #charlottehornets https://t.co/DP93LBYJB0",
    "210": "Kristaps Porzingis as long as he can stay healthy will be solid for the Washington Wizards #DCAboveAll great trade",
    "211": "@slick_rod Washington Wizards, bro.\nWizards.🤣🤣🤣🤣",
    "212": "Ish Smith &amp; Vernon Carey ➡ Washington Wizards\nMontrezl Harrell ➡ Charlotte Hornets\nKristaps Porzingis ➡ Washington Wizards\nSpencer Dinwiddie ➡ Dallas Mavericks",
    "213": "Kristaps Porzingis es cambiado de Dallas Mavericks a Washington Wizards #NBA ⬇️⬇️⬇️ https://t.co/1LRsj12uFJ",
    "214": "Update on this with the Wizards trading Dinwiddie:\n\nI still think I like it, but I would move this to \"Wait\" at this point. Completely unclear who Washington will be playing, and was trying to get ahead of it. Could get better or worse.\n\nWill try to revisit and post update later.",
    "215": "Dallas Mavericks have traded Latvian forward Kristaps Porzingis to Washington Wizards 😱\n\nThe deal also includes Spencer Dinwiddie and Davis Bertans.\n\nhttps://t.co/6n23eOtLGz",
    "216": "With Beal out for the season, Washington Wizards are just like F**k it. Is this money dump their attempt to keep Beal? https://t.co/SYLTqd0QHH",
    "217": "The Dallas Mavericks trade Kristaps Porzingis to the Washington Wizards for Spencer Dinwiddie",
    "218": "FUCK THE WASHINGTON WIZARDS \n\nI’m fuckin sick rn",
    "219": "#RT @ShamsCharania: The Washington Wizards are trading Spencer Dinwiddie to the Dallas Mavericks, sources tell @TheAthletic @Stadium.",
    "220": "Huh  RT @ShamsCharania: The Washington Wizards are trading Spencer Dinwiddie to the Dallas Mavericks, sources tell @TheAthletic @Stadium.",
    "221": "KP isn’t enough to keep Beal in Washington unless he’s the east coast Dame….. so the Wizards should send the lakers Kuz and KCP for Russ",
    "222": "The Dallas Mavericks engineer a major trade just before the deadline — they are moving on from Kristaps Porzingis, trading him to the Washington Wizards for Spencer Dinwiddie and Davis Bertans, according to multiple reports.\n\nThe KP era in Dallas was brief. And now it’s over.",
    "223": "Who's going to run point for the Wizards? They've currently got Ish Smith, Raul Neto, Brad Wanamaker, and Cassius Winston. Have to assume another trade is coming for Washington.",
    "224": "What. Just. Happened. The Washington Wizards just sold their entire team less than 30 minutes before the trade deadline. How much crazier is trade deadline going to get we still have 12 minutes.",
    "225": "@kporzee went from King on New York to the Washington Wizards 😂😂😂 #Knicks",
    "226": "👀 \nThe Dallas Mavericks are trading Kristaps Porzingis and a second-round pick to the Washington Wizards for Spencer Dinwiddie and Davis Bertans.",
    "227": "Wow Washington Wizards … sheesh!",
    "228": "@saritrator Washington Wizards de Michael Jordan.",
    "229": "SIMPLESMENTE WASHINGTON WIZARDS https://t.co/Ijoy0DKv15",
    "230": "🚨TROCA🚨\n\nDALLAS MAVERICKS recebem:\n▪︎Spencer Dinwiddie \n▪︎Davis Bertrans\n\nWashington Wizards recebem:\n▪︎Kristaps Porzingis\n\nVia: @wojespn",
    "231": "Don't get this trade for the Wizards. Porzingis is taller than the Washington Monument so he isn't allowed inside city limits.",
    "232": "The Phoenix Suns acquiring Aaron Holiday from the Washington Wizards",
    "233": "#BREAKING: According to multiple reports, the Dallas Mavericks are trading Kristaps Porzingis to the Washington Wizards https://t.co/ZzXKpoylby",
    "234": "BREAKING: Goodbye mavericks hello wizards… Kristaps Porziņģis traded to the Washington wizards https://t.co/A7GiaKlZhz",
    "235": "I don’t give a damn what the Washington wizards do we still got that sorry ass Bradley Beal watch he gonna show you who he really is once he get that 260 million trash he’s been showing you he’s trash",
    "236": "The Washington #Wizards are trading Spencer Dinwiddie and Davis Bertans to the Dallas #Mavericks for Kristaps Porzingis and a second-round pick.\n\n#NBA #NBA75 #MFFL #DCAboveAll #3ptcnvrsn https://t.co/ZzaxPcd0dX",
    "237": "Kristaps Porzingis to the Washington Wizards. #MFFL #NBATradeDeadline #NBA75 #nbatwitter #NBATwitterLive https://t.co/gCPJXQbA1R https://t.co/jDDISkRqm2",
    "238": "Lmaoooooo bum ass I know he’s sick RT @LegionHoops: BREAKING: The Mavericks are trading Kristaps Porzingis to the Washington Wizards, via @TheSteinLine.\n\nWOW. 🤯",
    "239": "The Washington Wizards are the most poorly ran sports franchise in the DMV.",
    "240": "The Wizards are sending Davis Bertans to Dallas as a part of the deal. \n\nMavericks are sending a second-round pick to Washington. \n\n(per @wojespn) https://t.co/BhJIqk0Wrw",
    "241": "@HapperShow Why you attack my favorite teams? Nebraska basketball, Cincinnati Bengals, and Washington Wizards. Ik I do it to myself but still.",
    "242": "@wojespn Let’s go wiz I’m liking this #washingtonwizards you taking notes #capitals",
    "243": "The Washington Wizards right now: https://t.co/EEb4oWgO5p",
    "244": "The Washington #Wizards are trading Aaron Holiday to the Phoenix #Suns. #NBA https://t.co/SCoKCVa9uS",
    "245": "Friday's NBA schedule sees the Memphis Grizzlies head to Detroit Pistons while the Brooklyn Nets visit the Washington Wizards a...\n\n#BettingSites #SportsBetting \nhttps://t.co/T5nL1NZaJl",
    "246": "I’m not looking forward to @Nickrob wearing Washington Wizards gear",
    "247": "🚨TRADE ALERT🚨\n\nWashington Wizards Receive: \nKristaps Porzingis \n\nDallas Mavericks Receive:\nSpencer Dinwiddie \n\n(Via. @ShamsCharania)\n\nGrade this trade! #nbatwitter https://t.co/QDTmaCsLRZ",
    "248": "The Dallas Mavs are sending Kristaps Porzingis to the Washington Wizards for Davis Bertans and Spencer Dinwiddie per Tim McMahon",
    "249": "And now the Mavs have sent Snoo-ZINGIS-usual over to the Wizards. \n\nWashington is building one hell of a tank",
    "250": "The Washington Wizards are super horny to be an international team.",
    "251": "🚨 Porzingis Traded to Wizards: Dallas sends KP to Washington for package including Spencer Dinwiddie and Davis Bertans (multiple reports)\n\nhttps://t.co/X7MgUkFFri",
    "252": "The Washington #Wizards are trading Montrezl Harrell to the Charlotte #Hornets for Vernon Carey and Ish Smith. #NBA https://t.co/U33b5Xv8w0",
    "253": "Will the Washington Wizards ever be good?",
    "254": "BREAKING NEWS: The Dallas Mavericks are trading Kristaps Porziņģis and a 2nd round pick to Washington Wizards for Spencer Dinwiddie and Dāvis Bertāns.",
    "255": "The Washington Wizards of Latvia! https://t.co/NNFmVwvPh0",
    "256": "🚨 Porzingis Traded to Wizards: Dallas sends KP to Washington for package including Spencer Dinwiddie and Davis Bertans (multiple reports) https://t.co/wi2zu1xqWi",
    "257": "The Dallas Mavericks are trading Kristaps Porzingis to the Washington Wizards for Spencer Dinwiddie and David Bertans @espn @NBA",
    "258": "🚨TRADE ALERT🚨\n\nCharlotte Hornets Receive: \nMontrezl Harrell \n\nWashington Wizards Receive:\nVernon Carey \nIsh Smith\n\n(Via. @wojespn)\n\nGrade this trade! #nbatwitter https://t.co/O2O8HaA63q",
    "259": "The Dallas Mavericks are trading Kristaps Porzingis to the Washington Wizards for Spencer Dinwiddie and David Bertans https://t.co/MqeGdsmiIB",
    "260": "I never liked Dinwiddie in Washington. That signing/trade didn’t make much sense. And now the Wizards only have KCP and Kuzma left over from that deal. And Todd too.",
    "261": "The Dallas Mavericks are trading Kristaps Porzingis to the Washington Wizards for a package centered on Spencer Dinwiddie, per @wojespn https://t.co/jNZheM1nf1",
    "262": "#NBA - Trade Dallas-Washington 🚨💣\n\nAi #Mavericks: Spencer Dinwiddie, Davis Bertans\nAgli #Wizards: Kristaps Porzingis, seconda scelta futura al Draft\n\n#NBATradeDeadline https://t.co/V3FpzzN3H0",
    "263": "Just picked up a pretty cool toaster at the Washington Wizards yard sale.",
    "264": "Trade between the Wizards and Mavericks\n\nWashington receives: Kristaps Porzingis, 2nd round pick \n\nDallas receives: Spencer Dinwiddie, Davis Bertrans",
    "265": "O Washington Wizards recebe: Kristaps Porzingis\n\n Dallas Mavericks:Spencer Dinwiddie e Davis Bertans https://t.co/VosKFWmTpG",
    "266": "So, Washington now has a loaded frontcourt with Kuzma, Porzingis, Hachimura, Avdija, Gafford, and Bryant.\n\nIsaiah Todd is on the outside looking in, and with Dinwiddie on his way out -- the Wizards could use another point guard...\n\nhttps://t.co/2a6C18Kzbd",
    "267": "Mavs, in arrivo Spencer Dinwiddie dai Wizards\n\nA Washington il lettone Kristaps Porzingis\nhttps://t.co/VqFXEnZAn9",
    "268": "The Dallas Mavericks and Washington Wizards have just completed the WORST trade today. Kristaps for Spencer.",
    "269": "@HeatvsHaters This is Wizards game changing trade for next year to become a contender 😂 Washington is such a fucking basket case.",
    "270": "and the #washingtonwizards finally gets their shooting guard",
    "271": "The Washington Wizards are back.",
    "272": "🚨 Los Washington Wizards están intercambiando a Spencer Dinwiddie con los Dallas Mavericks.\n\nPorzingis a Wizards.",
    "273": "Dallas has spent this entire deadline day trying to find a home for Porzingis' considerable contract, league sources say, and they have struck a deal with the Wizards to send the oft-injured big man to Washington for Spencer Dinwiddie and Davis Bertans. https://t.co/m0WUa52K4A",
    "274": "Wizards assistant confronts fan, gets 2-game ban #Washington #Wizards #NBA https://t.co/59IOpY99kr",
    "275": "🥴 RT @ShamsCharania: The Washington Wizards are trading Spencer Dinwiddie to the Dallas Mavericks, sources tell @TheAthletic @Stadium.",
    "276": "NBA 🇺🇸 - 🚨TRADE ALERT🚨\nI Dallas Mavericks spediscono Kristaps Prozingis ai Washington Wizards in cabio di Davis Bertans e Spencer Dinwiddie https://t.co/7j3ODgKbvW",
    "277": "Kristaps Porzingis is being traded to the Washington Wizards #NBATradeDeadline \n\n(via: @ShamsCharania ) https://t.co/k3ZwyCA5ur",
    "278": "The Dallas #Mavericks are trading Kristaps Porzingis to the Washington #Wizards for Spencer Dinwiddie and David Bertans. #NBA https://t.co/14g4Ya2js5",
    "279": "The Mavs have traded Kristaps Porzingis to the Washington Wizards in exchange for a package surrounding Spencer Dinwiddie",
    "280": "URGENTE \n\nTROCA NA NBA\n\nO Washington Wizards recebe: \n\nKristaps Porzingis\n\nO Dallas Mavericks recebe:\n\nSpencer Dinwiddie\nDavis Bertans\n\nc/c: @espn_macmahon https://t.co/Bh9Y2RtEOS",
    "281": "The Washington Wizards are an absolutely hilarious organization. Thank you @WashWizards.",
    "282": "@BobbyMlRE jokic is topping mvp ladders meanwhile that mfer has to play for the washington wizards hahaha",
    "283": "Kristaps Porziņģis is traded to Washington Wizards WTF is going on in Dallas #NBATradeDeadline",
    "284": "Washington Wizards big man rotation looking at each other in the locker room. https://t.co/0peMgMnIJV",
    "285": "Dallas Mavericks se hace con Spencer Dinwiddie desde Washington Wizards a cambio de Kristaps Porzingis. #Fiebruses #CanchaEntera #NBA75 https://t.co/JhoC16QGdW",
    "286": "Washington Wizards are clearly selling everybody other than Beal - and not very expensive deals so far\n\nRui and Gafford",
    "287": "🤔🤔🤔 RT @LegionHoops: BREAKING: The Mavericks are trading Kristaps Porzingis to the Washington Wizards, via @TheSteinLine.\n\nWOW. 🤯",
    "288": "O Washington Wizards...",
    "289": "🚨Takas Var🚨\n\n🔴Washington Wizards - Kristaps Porzingis\n\n🔵Dallas Mavericks - Spencer Dinwiddie\n\n🎙️ESPN https://t.co/MbyLV8liuQ",
    "290": "Hornets (A): M. Harrell\nWizards (B): V. Carey, I. Smith\n\nCharlotte gets a really good but underutilized big in Harrell while only having to give up a young asset in Carey who might benefit Washington’s future plans",
    "291": "THATS IT! AFTER BEING A FAN OF THE WIZARDS FOR 43 YEARS, I HAVE LOST IT! I AM NO LONGER A WASHINGTON WIZARDS FAN NOR WILL I BE BUYING THEIR MERCHANDISE. I AM TRANSFERING MY FAN STATUS TO THE BROOKLYN NETS AND ROOT FOR WINNERS LIKE KEVIN DURANT AND KYRIE IRVING.",
    "292": "TRADE: The Washington #Wizards are trading Spencer Dinwiddie to the Dallas Mavericks (via @ShamsCharania) #NBATradeDeadline https://t.co/GPQeOlIvLw",
    "293": "Porzingis to Washington Wizards.",
    "294": "The Washington Wizards are trading Spencer Dinwiddie to the Dallas Mavericks 🔥\n\n(via @Stadium) https://t.co/Z5ojOcqCLg",
    "295": "Mais um concorrente pro tank. Washington Wizards",
    "296": "I now hate the Washington wizards! https://t.co/1QQCeSaszg https://t.co/qPInWRsVrN",
    "297": "#Sources — The Mavericks are trading Kristaps Porzingis to the Washington Wizards in exchange for Spencer Dinwiddie. #NBA",
    "298": "INCROYABLE ! Kristaps Porzingis part aux Washington Wizards, Spencer Dinwiddie rejoint les Dallas Mavericks ! (via @ShamsCharania) https://t.co/mG9nf50k3E",
    "299": "Kristaps Porzingis a Washington Wizards. 😵‍💫🙆🏽‍♂️👀😵‍💫",
    "300": "The Washington Wizards are trading Spencer Dinwiddie to the Dallas Mavericks https://t.co/fopO92UQqp",
    "301": "The Miami Heat ended the Washington Wizards franchise. 🔥",
    "302": "Dallas Mavericks henter Spencer Dinwiddie hos Washington Wizards.\n\nMavericks sender Kristaps Porzingis til Wizards!!!! https://t.co/gp7WFP8NvU",
    "303": "Washington Wizards trade deadline 2022 https://t.co/PTajm4dIUp",
    "304": "The Washington Wizards are selling, Sources tell me https://t.co/ORyEDUK2EE",
    "305": "The Washington Wizards are trading Spencer Dinwiddie to the Dallas Mavericks",
    "306": "BREAKING: The Washington Wizards are trading Spencer Dinwiddie to the Dallas Mavericks per @ShamsCharania",
    "307": "The Charlotte Hornets are acquiring Montrezl Harrell from the Washington Wizards @espn @NBA",
    "308": "Washington Wizards 😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂",
    "309": "Washington Wizards are trading Spencer Dinwiddie to the Dallas Mavericks",
    "310": "BREAKING: The Mavericks are trading Kristaps Porzingis to the Washington Wizards, via @TheSteinLine.\n\nWOW. 🤯",
    "311": "Washington Wizards blowing it up",
    "312": "BREAKING: The Mavericks are trading Kristaps Porzingis to the Washington Wizards, per @marcstein. \n\n!!!!",
    "313": "The Washington Wizards are finalizing a trade to send G Bradley Beal to the Houston Rockets for Jalen Green, Garrison Matthews, and two future first-round picks, sources tell ESPN",
    "314": "Washington Wizards wholesale https://t.co/4zj5vdq9kc",
    "315": "Washington wizards got a two for one sale going on lol. Everything must go! https://t.co/Xi1FY5jPut",
    "316": "The Wizards are cleaning out. Dang. Nobody is safe in Washington today.",
    "317": "Washington Wizards desmontando todo o time https://t.co/Fzi90olQ1H",
    "318": "👀👀👀 RT @ShamsCharania: The Washington Wizards are trading Spencer Dinwiddie to the Dallas Mavericks, sources tell @TheAthletic @Stadium.",
    "319": "The Washington Wizards are trading Spencer Dinwiddie to the Dallas Mavericks",
    "320": "The Washington Wizards are trading Spencer Dinwiddie to the Dallas Mavericks, sources tell @TheAthletic @Stadium.",
    "321": "is officially done with the Washington Wizards 😎",
    "322": "The Washington wizards need to be moved to China poverty ass franchise ong 🤦🏽‍♂️ https://t.co/hX8kTaUush",
    "323": "The Washington Wizards having a fire sale. Let's see if the Knicks trade their young studs for the remnants of Spencer Dinwiddie.",
    "324": "#washingtonwizards y’all don’t gotta let Mike rob y’all he already rob y’all in his last days YOU DONT OWN HIM NOTHING!!!!! https://t.co/XTyAQWCSai",
    "325": "The Los Angeles Lakers are trading Russell Westbrook to the Washington Wizards for Bradley Beal and Spencer Dinwiddie (per @ESPN)",
    "326": "Montrezl Harrell a Hornets!!\n\nWashington Wizards recibe a Ish Smith y Vernon Carey. https://t.co/kmprSoEobv",
    "327": "The Wizards are trading Montrezl Harrell to the Hornets, sources tell @ShamsCharania.\n\nWashington is also sending Aaron Holiday to the Suns in a separate deal. https://t.co/BwbgsUdqLw",
    "328": "The Washington Wizards so Harden Come to Philly with Embiid and decided to Tank Lmaooooo.. 🗣Go @sixers",
    "329": "Ish right back to Washington. He’ll get more clock there, was struggling with minutes behind Melo and Scary Terry RT @LegionHoops: FULL TRADE DETAILS:\n\nHornets receive: \nMontrezl Harrell\n\nWizards receive:\nVernon Carey Jr.\nIsh Smith",
    "330": "#NBA - Trade Charlotte-Washington 🚨💣\n\nAgli #Hornets: Montrezl Harrell\n\nAgli #Wizards: Vernon Carey, Ish Smith, seconda scelta futura al Draft\n\n#NBATradeDeadline https://t.co/nqAnw0b2hV",
    "331": "Man #Jordan  just stole #MontrezlHarrell  from the #nba #Wizards  for frickin #ishsmith #hornets  just handed #washingtonwizards  the big L https://t.co/pnNH5cRopC",
    "332": "Charlotte #Hornets are acquiring Washington #Wizards center Montrezl Harrell for Vernon Carey and Ish Smith\n\n#NBA #NBA75 #NBATradeDeadline #DCAboveAll #AllFly #3ptcnvrsn https://t.co/Kg25YNs0gu",
    "333": "Charlotte y Washington tienen un acuerdo\n•  Montrezl Harrell se va a los Hornets\n•  Vernon Carey (😳) y Ish Smith a Wizards https://t.co/Cmwkg8r2Oi",
    "334": "Washington Wizards and Sacramento Kings… same same lmao",
    "335": "The Suns are acquiring Aaron Holiday from the Washington Wizards, @ShamsCharania reports. https://t.co/k3JiH5xIc1",
    "336": "Today's NBA Consensus (So Far):\n\nMiami Heat 76%\nToronto Raptors 76%\nMemphis Grizzlies 75%\nDallas Mavericks 71%\nGolden State Warriors 70%\nWashington Wizards 63%\nPhoenix Suns 62%",
    "337": "The Suns have acquired Aaron Holiday from the Washington Wizards, first reported by @ShamsCharania.",
    "338": "Charlotte Hornets: Montrezl Harrell\n\nWashington Wizards: Ish Smith, Vernon Carey",
    "339": "The Washington Wizards gain more flexibility for another potential trade in this deal. They are now $5.4M below the luxury tax but effectively $3.88M below when factoring Spencer Dinwiddie’s incentives that he is on track to earn.\n\nThey also generate a $5.22M trade exception. https://t.co/WrQpM7GkFR",
    "340": "The Washington Wizards are the definition of a poverty franchise",
    "341": "#NBATradeDeadline #NBA75\n#NBApl\n\n🚨 TRADE ALERT\n\nCharlotte Hornets:\n✅ Montrelz Harrell\n\nWashington Wizards :\n✅ Vernon Carey\n✅ Ish Smith\n\nℹ️ @wojespn https://t.co/TfHknH2tGu",
    "342": "TRADE⚠️\n\n- Charlotte Hornets rep a Montrezl Harrell.\n- Washington Wizards rep a Vernon Carey i Ish Smith. https://t.co/0ijAoI3jZL",
    "343": "Trade between the Hornets and Wizards\n\nCharlotte receives: Montrezl Harrell \n\nWashington receives: Vernon Carey, Ish Smith",
    "344": "Washington Wizards: https://t.co/dk8mh5kl6B",
    "345": "TRADE: Washington is sending Aaron Holiday to the Phoenix Suns, per @ShamsCharania.\n\nWizards starting to get busy.",
    "346": "🚨Takas Var🚨\n\n🔵Charlotte Hornets - Montrezl Harrell\n\n🔴Washington Wizards - Ish Smith, Vernon Carey\n\n🎙️ESPN https://t.co/5dc7KsAW7B",
    "347": "The Charlotte Hornets are trading for Washington center Montrezl Harrell. Sending Vernon Carey and Ish Smith to the Wizards! (Via @wojespn) #NBATradeDeadline https://t.co/jYYkoHzVjr",
    "348": "I am no longer a Washington Wizards fan https://t.co/VaeMx8vRsI",
    "349": "THE WIZARDS LMAO THEY COULDNT EVEN GET PJ WASHINGTON 😭😭😭😭",
    "350": "BREAKING NEWS:  The Washington Wizards are finalizing a deal to send C Montrezl Harrell to the Charlotte Hornets https://t.co/ygrIWxPJm9",
    "351": "Washington just wanted him gone. Would have loved to get him. Season turning into a disaster for Wizards. https://t.co/Mxd2TgbVaQ",
    "352": "Washington Wizards legend Ish Smith https://t.co/ATpJb0dtRe",
    "353": "Wow more trade news.. Charlotte is acquiring Washington center Montrezl Harrell for Vernon Carey and Ish Smith #nba #wizards #DCAboveAll #NBATradeDeadline",
    "354": "Charlotte Hornets henter Montrezl Harrell hos Washington Wizards.\n\nWizards modtager Vernon Carey og Ish Smith i handlen. https://t.co/jQ2TE3rdNl",
    "355": "HARRELL NO HORNETS! \n\nO Washington Wizards trocou o pivô para a equipe de Charlotte.\n\nWashington recebe: Ish Smith e Vernon Carey\n\nCharlotte recebe: Montrezl Harrell\n\n📷 Patrick Smith\n🗞 @wojespn \n\n#DCAboveAll #AllFly #NBA75 https://t.co/e5HMGnSMHO",
    "356": "WASHINGTON WIZARDS LEGEND ISH SMITH IS BACK https://t.co/qGhSZydtIY",
    "357": "Ish Smith de volta ao Wizards, Washington legend https://t.co/NLChnGXqqn",
    "358": "PJ Washington seguro se va a Wizards https://t.co/wk9PtH43Yr https://t.co/LsxLZtBnn5",
    "359": "Please don’t tell me PJ Washington went to the Wizards",
    "360": "I feel sorry for Wizards fans. The same feeling they have today is the same feeling they'll have soon with the Washington Commanders when they don't make any significant upgrades and in particular the QB position. Nothing like being loyal to multiple shit organizations.",
    "361": "@SnvpGod @ShamsCharania @TheAthletic @Stadium Montrezl Dashay Harrell is an American professional basketball player for the Washington Wizards of the National Basketball Association. He played college basketball for the Louisville Cardinals.",
    "362": "@JuegaEnLinea Gana Washington Wizards / Gana Dallas Mavericks / Gana Phoenix Suns.\n#QuinielaExpressNBA\nUsuario: BsDentistry",
    "363": "@JuegaEnLinea Washington Wizards, Dallas Mavericks y Phoenix Suns/ usuario : Antuanrich",
    "364": "@ChaseHughesNBCS That’s cool and all but where are the trades. If the Wizards do nothing. Washington officially has the 2 most poorly ran franchises in all of sports",
    "365": "Washington Wizards assistant coach Mike Batiste has been suspended two games without pay for entering the spectator stands in an attempt to confront a fan #NBA #Wizards",
    "366": "Washington Wizards asst coach Mike Batiste suspended 2 games for entering stands to argue with a fan https://t.co/QUVom1UIZd",
    "367": "Disband the Washington Wizards franchise.",
    "368": "@JuegaEnLinea #QuinielaExpressNBA \nWashington Wizards\nClippers LA\nPhoenix Suns\n\nUsuario: Chuchildo\n@JuegaEnLinea\n\n#10Feb #NBAAllStar #NBA75 #NBA #NBATwitter #Deportes",
    "369": "Not trade deadline related, but Washington Wizards player development manager Mike Batiste has been suspended two games without pay for entering the spectator stands in an attempt to confront a fan during Monday's loss the Heat, the NBA has announced.",
    "370": "Washington Wizards assistant coach Mike Batiste has been suspended two games without pay for entering the spectator stands in an attempt to confront a fan per NBA #porvida #nba75 #nbatwitter",
    "371": "Washington Wizards assistant coach Mike Batiste has been suspended two games without pay for entering the spectator stands in an attempt to confront a fan, the NBA announces.",
    "372": "@JuegaEnLinea Gana Washington Wizards / Gana Dallas Mavericks / Gana Phoenix suns Usuario Julcp07 ✌🏻✌🏻✌🏻",
    "373": "Washington Wizards assistant coach Mike Batiste has been suspended two games without pay for entering the spectator stands in an attempt to confront a fan, league says.",
    "374": "Glad to see, the Washington Wizards are fighting hard for that 8 seed in the Eastern Conference playoffs",
    "375": "@Its_TysWorld @Justin_JM12 @LouisWilnir I just need you to add someone in the Washington Wizards organization to your “praying on their downfall” list cause you’re too powerful",
    "376": "Wait a minute! It was stated by coaches and players that they were affected by the trade rumors and not one trade has been made as of 130pm. What a waste of last 10-15 games. Only in DC! So whats next?Another 9th pick mediocre rookie. #dcfamily #bulletforever\n#washingtonwizards",
    "377": "@_LCapitan Just the Washington wizards",
    "378": "The Washington Wizards are willing to trade the entire roster besides Bradley Beal and Kyle Kuzma. #Wizards",
    "379": "Eastern Conference showdown in Washington followed by a 2021 NBA Finals re-match.\n\nNets at Wizards &amp; Bucks at Suns, coverage begins tonight at 7:30 pm ET on @NBAonTNT. https://t.co/bCToFC77cG",
    "380": "WHAT ARE THE WASHINGTON WIZARDS FRONT OFFICE DOING #DCaboveall",
    "381": "2003 NBA Regular Season | Washington Wizards @ Chicago Bulls| Michael Jo... https://t.co/2ld0ELhNig via @YouTube",
    "382": "Washington Wizards\n#wizards #Washington #trade #deadline #wassup @WashWizards https://t.co/iaTZC7Hj6Q",
    "383": "The Washington Wizards have agreed to trade Russell Westbrook, 2024 second-round pick, 2028 second-round pick to the Los Angeles Lakers for Kyle Kuzma, Kentavious Caldwell-Pope, Montrezl Harrell and No. 22 tonight, sources tell @TheAthletic @Stadium.",
    "384": "The Washington Wizards have agreed to trade Russell Westbrook, 2024 second-round pick, 2028 second-round pick to the Los Angeles Lakers for Kyle Kuzma, Kentavious Caldwell-Pope, Montrezl Harrell and No. 22 tonight, sources tell @TheAthletic @Stadium.",
    "385": "Nets Gameday: Will Brooklyn's losing streak end in Washington? - Th... (The Brooklyn Game)\n\nThe NBA Trade Deadline will have come and gone by the time the Nets and Washington Wizards t...\n\nAdd your highlights:\nhttps://t.co/7BfGOqFzQV\n #Brooklyn_Nets",
    "386": "NBA Betting Preview: Brooklyn Nets vs. Washington Wizards - Thursday, Feb. 10, 2022 https://t.co/OGHR98k6oU",
    "387": "@DMANMoveover @Q_e_w @LakersNation Westbrook supposed to be still playing for the Washington Wizards. 😂😂😂\n44 million dollars this season and 47 million dollars next season to do what ??? Sharpshooter was a higher priority. Lebron sabotaged the Lakers with Westbrook.",
    "388": "@surecr7 Expect a four team trade then 😂, Philly sends Simon to the lakers , Westbrook to Brooklyn while Philly gets Harden and Irving gets traded to Washington wizards and the nets get  Kuzma and a 2nd round picks 😉",
    "389": "@WashWizards Wizards you need to make this trade. Sixers send Ben Simmons, Charles Bassey and Paul Reed to the Washington Wizards for Spencer Dinwiddie, Kentavious Caldwell-Pope, Deni Avdija, Corey Kispert, 2022 first-round pick and a 2024 first-round pick (top-10 protected).",
    "390": "Lakers organization sure does love the Washington Wizards players",
    "391": "Analyzing Thursday’s Brooklyn Nets at Washington Wizards odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/EOvF5AnABU",
    "392": "Brooklyn Nets at Washington Wizards odds, picks and predictions https://t.co/IOf7H37goS",
    "393": "@SInow @KingJames Maybe. King James ought to Retire from Basketball.If he had some trade value the Lakers should Trade him to the Cavs for a 1st Round Pick in my opinion at 250Million for 5 seasons 50Million I expect more.  Michael Jordan on the Washington Wizards gave more Effort never complained",
    "394": "Happy birthday to Bobby portis of the Milwaukee bucks #bobbyportis #bobbyportisjr #milwaukeebucks #chicagobulls #washingtonwizards #newyorkknicks https://t.co/8MxuZF4IOy",
    "395": "Washington wizards are trading players today or what?????",
    "396": "#NBA \n\nNets are 5-16 ATS in the last 21 meetings in Washington\nNets are 5-16-1 ATS in their last 22 games\nWizards are 3-14 ATS in their last 17 games as a favorite\nWizards are 1-10 ATS in their last 11 home games",
    "397": "Join us on April 1-3 for SEME's 2022 DC Sports-A-Palooza!\n\nExperience the tremendous sports atmosphere in DC.  \n\nSEME attendees will have the opportunity to experience a live professional sports weekend with home games for the Wizards, Washington Capitals, and DC United. https://t.co/3my3SIRdDy",
    "398": "imagina perder seus dois principais alvos pro Kings kkkkkkkkkkkkkkkkkkkkkk WASHINGTON WIZARDS!",
    "399": "the washington wizards are the most poverty organization in the league, my sources tell ESPN.",
    "400": "New post (Brooklyn Nets vs Washington Wizards NBA Pick – February 10) has been published on The Sports Geek - https://t.co/zHxwQkiYUX https://t.co/zbqr6edZkT",
    "401": "@addicted2helmet @whoisjwright May be similar to Washington Wizards initial switch to the current color scheme. \"New\" primary logo leaked, as a lazy repaint, dubbed the \"Santa Claus\" logo. After negative reactions, the team pretty much buried that logo even though it was the official primary.",
    "402": "NBA Game Preview: The Washington Wizards have a forecast 64% chance to win against The Brooklyn Nets with a spread of -2.5/2.5 and an over/under of 226. The Washington Wizards are 0 - 2 against The Brooklyn Nets in the 2021-22 Season.\n#bettingpicks\n#sportbetting",
    "403": "Game Day in the District\n\nThe Washington Wizards (24-29) take on the Brooklyn Nets (29-25) at the Capital One Arena at 7:30 PM https://t.co/uJf5IUO5tb",
    "404": "The Washington Wizards have confirmed that both Bradley Beal and Kyle Kuzma are untouchable assets",
    "405": "Consensus Line Move:\n2022-02-10 Brooklyn Nets at Washington Wizards from 217.00 to 218.00\nOver lollipops\n#NBA #parlay #coder #wealth",
    "406": "The Brooklyn Nets will take a trip to the nation’s capital  tonight to square off against the Washington Wizards.\n\n@jacobmckenna99 on where he is seeing value for this matchup:\nhttps://t.co/LauGRkP4bM",
    "407": "@epark1016 @_JasonLT You cannot be so foolish as to ignore Russell Westbrook’s salary. Washington Wizards unloaded 44 million dollars this season and 47 million dollars next season. Lakers don’t need a point guard THAT BAD.\nSharpshooter was cheaper.",
    "408": "Have the Washington Wizards looked at their roster? It’s only Bradley Beal and Kyle Kuzma https://t.co/D67rBECZ4d",
    "409": "Feb 10. \n59% hit rate sky rockets today ‼️‼️\n\nCBB🏀🏫\n\nPurdue -3.5\nWagner -7.5\nDelaware -6.5\nMorehead St +10 😉\n🔒Washington -2🔒\n\nNBA🏆\n\nBucks +3.5\nHeat -4.5\nWizards -3\n\n#FreePicks #bettingtwitter #GamblingTwitter #CBBPicks #nbapicks #freemoney #FanDuel #Bucks",
    "410": "Report: Washington Wizards willing to trade entire roster besides Bradley Beal and Kyle Kuzma https://t.co/eRAdVrdV3C",
    "411": "@gilbert Even Washington Wizards?",
    "412": "Report: Washington Wizards willing to trade entire roster besides Bradley Beal and Kyle Kuzma https://t.co/EdiEjP62Yv",
    "413": "Washington Wizards MOLTO attivi sul mercato:\n\nhttps://t.co/b5EripW7He",
    "414": "THURSDAY PICKS!!!\n\n🏴‍☠️ takes the Capitals of Washington to score 2 more goals than the Habitants of Montreal.  ⭐️ \n\n☠️Walks with the Wizards 🏀 team -3 ⭐️\n\n🌸 OVER 5.5 Carolina/Boston ⭐️⭐️\n\n🍭 shoots with HAWKEYES 🏀 -3.5 ⭐️⭐️\n\n#GamblingTwitter #freepicks #VegasBorn #bettingpicks",
    "415": "@rico79879980 @Deetalksalot W/o Beal you take 25-30 ppg off our O a night. This team has no chemistry &amp; has inconsistent effort on D &amp; I could see the #Wizards winning less than 15 games the rest of the season. Then, they’ll be in position to draft at least TyTy Washington in the 5-10 range. #DCAboveAll",
    "416": "Brooklyn Nets vs  Washington Wizards Prediction 2/10/22 -  Free NBA Picks https://t.co/RJ5GEjJva2 via @YouTube \n\n#NBA #NBAPick #NBAPrediction #basketball",
    "417": "Also : \n\nWashington Wizards ML\nPhoenix / Milwaukee Under https://t.co/f1jUeurFDl",
    "418": "Washington Wizards guard Bradley Beal will have surgery to repair a torn ligament in his left wrist today, per source. \n\nMore Wizards from me including “everything being available” ahead of the deadline, and a possible big swing:\n\nhttps://t.co/Mj4BozhQF0",
    "419": "Consensus Line Move:\n2022-02-10 Brooklyn Nets at Washington Wizards from 218.50 to 217.00\nUnder apple of my eye\n#NBA #bettingonline #python #passiveincome",
    "420": "The Phoenix Suns would challenge the Washington Wizards if they had Melo #DCAboveAll #ValleyProud",
    "421": "@casualtakeking Ben is single handly beating the Washington Wizards tonight must see TV",
    "422": "Brooklyn Nets (29-25) vs. Washington Wizards (24-29)\nFebruary 10, 2022 7:30 pm EDT\nFree Pick: Over 217.5\nOdds: 1.80",
    "423": "The Brooklyn Nets will look to snap their nine-game skid on trade deadline day against the Washington Wizards. For a preview of the game with @TWSN___. ⬇️🏀 #NetsWorld #DCAboveAll \n\nhttps://t.co/Sq5NzQ31m6",
    "424": "@BitSler @Bitsler_Indo @Bitsler_Brasil Washington Wizards - Miami Heat",
    "425": "The Washington Wizards take on the Brooklyn Nets on Thursday night 🏀\n\nCheck out who our Vegas Odds expert is placing his hard earned money on 💰\n\nPrediction in the comments 👇👇 https://t.co/73zosfB891",
    "426": "Washington Wizards - Brooklyn Nets İddaa Tahmini 11.02.22\nhttps://t.co/3qvKE6RB1r",
    "427": "🔴 LIVE➠ Brooklyn Nets vs. Washington Wizards - NBA League 2022\n🎟️🎥Sign up here➠  https://t.co/653hJg4HXy\n📅 : Thursday, February 10, 2022\n⏰ : 7:30 PM",
    "428": "@L4KERSSWEEP @ethan_palzkill @Russ_Palace @TheNBACentral Who said Russ was better than John in his career. I’m talking bout in Washington big dawg on the wizards",
    "429": "Tonight the Brooklyn Nets (29-25) visit the Washington Wizards (24-29) at 7:30 🕢 @NBAonTNT #Brooklyn #Nets #NBA #NetsWorld",
    "430": "On this day in sports history February 10, Washington Wizards Small Forward Tracy Murray scored 50 Points in a 99-87 win against the Golden State Warriors in 1998.",
    "431": "On this day in sports history February 10, Washington Wizards Point Guard Rod Strickland recorded 21 Points, 12 Rebounds, and 20 Assists in a 99-87 win against the Golden State Warriors in 1998.",
    "432": "Over the past 10 games, Lebron is averaging 29.5 points. If he stays on this pace,\n\nHe'll pass Malone in 15 games on Mar 19, 2022 against the Washington Wizards.\n\nHe'll pass Kareem in 64 games which would be around Jan 2, 2023.",
    "433": "2021-22 Regular Season: Brooklyn Nets vs. Washington Wizards\n\n📅 February 11\n⏰ 8:30 a.m. LIVE\n📺 One Sports\nhttps://t.co/P1AURycOy7",
    "434": "Tonight's NBA Thursday double-header: \n\nBrooklyn Nets @ Washington Wizards tonight at 7:30pm ET on TNT. \n\nMilwaukee Bucks @ Phoenix Suns tonight at 10pm ET on TNT. https://t.co/hypTaae8KG",
    "435": "#618 Spencer D1nw1dd1e - Washington Wizards. 2021/2022 Season. On sale now.  @opensea \n\nhttps://t.co/Ce8w7lvN5A\n\n#NFTs #nft #nftart https://t.co/CPtnLqA9Pw",
    "436": "2021-22 #NBA75 Regular Season: Brooklyn Nets vs. Washington Wizards\n\n📅 February 11\n⏰ 8:30 a.m. LIVE\n📺 One Sports\n\n#AlwaysAFan #NBAonOneSports https://t.co/PpNPy1pO7z",
    "437": "1. The Washington Wizards pull the trigger on two major blockbusters designed to persuade Beal in signing an extension. Washington ships out Rui Hachimura, Deni Avdija, Thomas Bryant, a lottery protected 1st, a 2nd round pick and another 2nd round pick swap to Detroit for...",
    "438": "Washington Wizards \nMost likely to be traded?\n\n#tradedeadline #NBATradeDeadline #NBAFantasy #fantasybasketball #fantasynba",
    "439": "The Lakers are finalizing a trade that sends superstar G Russell Westbrook to the Washington Wizards for Kyle Kuzma, Kentavious Caldwell-Pope, Montrezl Harrell, and cash considerations, per league sources.",
    "440": "ALERT: New high roller bet posted!\nA bet has been placed for $9971.14 on Washington Wizards - Brooklyn Nets to win $19,344.00.\nTo view this bet or copy it https://t.co/UOOkApHiCf https://t.co/Pc17LcjBxp",
    "441": "Washington Wizards - Brooklyn Nets\n\nBet slip link: https://t.co/xPyX74nPYb https://t.co/zWNyoq2Znc",
    "442": "NBA Basketball Game Betting Picks Simulator: 7:30 PM ET - Brooklyn Nets vs. Washington Wizards - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/2FnuFWk4MF #nba #sportsbetting #freepicks #cappertek",
    "443": "🏀Today's (Feb 10) NBA Prediction\n\nWashington Wizards vs Brooklyn Nets\n\nGolden State Warriors vs New York Knicks\n\nPhoenix Suns vs Milwaukee Bucks\n\nand other games...\n\nClick here 2 get what you want:\n\nhttps://t.co/QXDZTQSAOy\n\n #NBA #NBA75 #NBAPicks #Warriors #Nets #JamesHarden https://t.co/pmspPL3T7v",
    "444": "🏀#NBA ‼️\n1.Detroit Pistons Vs Memphis Grizzlies\n2.Washington Wizards Vs Brooklyn Nets\n3. New Orleans Pelicans Vs Miami Heat\n4.Houston Rockets Vs Toronto Raptors\n5.Dallas Mavericks Vs Los Angeles Clippers ...\n-------\nWatch FREE #livestream here👉https://t.co/z8cdc9kniq 😉 https://t.co/fkmJbXTyq9",
    "445": "🚨 Line Change 🚨\n\nBrooklyn Nets @ Washington Wizards\nThu 7:30 PM EST\n\nFrom:\nWAS -1.5 -110\n\nTo:\nWAS -2.5 -110",
    "446": "@zacikuma The Washington Wizards Ace Player Mr. Rui Hachimura Amazing 3P Shoot Skill 🇯🇵🇨🇦🇺🇸🇯🇵🇨🇦🇺🇸🇯🇵🇨🇦🇺🇸🏀🏀🏀😉😉😉 https://t.co/kxElYDbGQW",
    "447": "Who Will The Washington Wizards Draft? https://t.co/ZqYBsN4Cog",
    "448": "Struggling Nets will get Kyrie Irving back versus Wizards (New York Post)\n\nWASHINGTON - The Nets will drag the NBA's longest losing streak - nine consecutive games - i...\n\nAdd your highlights:\nhttps://t.co/dq9SFcV6oV\n #Brooklyn_Nets",
    "449": "@TheNBACentral I don’t think a single true Washington Wizards fan hates Russ",
    "450": "tommorow is gonna be the washington wizards day of trades",
    "451": "Scrap In The Cap: Washington Wizards Coach Hops In Stands To Offer Fist Biscuits To Fan https://t.co/ZGzkLLksL4 https://t.co/OLmNYRt1yb",
    "452": "@WashProbs How could the #Washingtonwizards  Lose they were UP by #30",
    "453": "Some of its well-known partners include football legend Tom Brady, the Miami Heat, the Washington Wizards, the Golden State Warriors, the Mercedes F1 team, The Capitals, and, most recently, the Super Bowl.\nhttps://t.co/AVmb7qKWn6",
    "454": "Here is the full list of teams without any participant at NBA All Star Weekend\n\nPortland Trailblazers\nWashington Wizards",
    "455": "@soni_maxx @chicagobulls @NBCSChicago @2Xtremebounce Yup! I would also watch out for a potential Harrell move from the wizards since Beal is now injured and Harrell is on an expiring contract. Send Washington one or two second round picks not first.",
    "456": "@TheHoopCentral @billoram I just find it crazy. GM Lebron made a trade to get Russ from Washington and getting rid of Kuzma. Now Lebron wants Russ out and loss Kuzma which is having a insane season with the wizards",
    "457": "@brka7777 @LakerCentral365 I am saying keep that same energy as the beginning of the season, continue to recognize Russell Westbrook as a STAR PLAYER. 😁😁😁 He was that for the Washington Wizards, doesn't fit with the Lakers 2020 Championship point guard.",
    "458": "Washington hates Russ? Every Wizards fan I’ve talked to wants Russ back lmaooo https://t.co/ApB4RyIv8O",
    "459": "GameThread: Miami Heat (34-20) @ Washington Wizards (24-28) https://t.co/CUGEh2kafk",
    "460": "Washington Wizards All-Star guard Bradley Beal plans to undergo season-ending surgery on his left wrist, sources tell ESPN.",
    "461": "@TheNBACentral Washington flipped John Wall, the worst contract in the league, into good young talent via Russ. Plus they got a post season out of him. Along with that I went to two Wizards road games last year and all the Wizards fans loved him. So how does DC hate him?"
}