{
    "0": "@PhilConstantino @Rob_Longo @SamFarberLive @hornets Love to see it. Great work brother.",
    "1": "@HornetsPR @hornets Tell Bally sports to put the hornets game on, they are showing the hawks.",
    "2": "One more run in the studio. Thanks to @Rob_Longo &amp; @SamFarberLive for letting me ride along this week! @hornets vs. Wizards, regular season finale. We're LIVE at 3:30 on the Hornets Radio Network. https://t.co/hrcD7XALtH",
    "3": "@HornetsOnBally @hornets @ashahahmadi @WesGotRange Why am I watching the Hawks feed on spectrum???",
    "4": "Charlotte Hornets star forward Gordon Hayward will be out indefinitely with discomfort in his left foot. #Hornets https://t.co/lG566k676Y",
    "5": "@BrotherEDEN @hornets @MichelobULTRA @PJWashington @cody_martin15 @MilesBridges Yes everyone noticed idk why",
    "6": "@BallySportsSO why aren’t you showing the hornets game in Charlotte.  You guys suck!!!!",
    "7": "Charlotte Hornets’ Gordon Hayward to miss play-in tournament, out indefinitely due to foot soreness https://t.co/mTQXoS9S8Q",
    "8": "And somehow people were pissed at me for saying LaMelo has more accomplishments than the Charlotte Hornets franchise 😂😂😂😂 #PovertyFranchise https://t.co/6NT5F7tESH",
    "9": "@Ryleighpope40 @6lackb1rd @ashahahmadi @hornets Happy belated birthday! 🎉",
    "10": "@hornets When lamelo did a unique pass to harrell",
    "11": "@HornetsOnBally @hornets @ashahahmadi @WesGotRange I would love to see it instead of the damn HAWKS. what is going on???",
    "12": "\"We all are excited.\"\n\n@hornets President Fred Whitfield visits with @ashahahmadi and @WesGotRange to discuss all the excitement around this young team! \n\n#AllFly https://t.co/JoW8XGYHJY",
    "13": "Now ending day 1 of #AIMW22 @spectrumcenter seeing our @WashWizards take on @hornets https://t.co/v1hSnFaY52",
    "14": "@Rob_Longo @hornets @wfnz Where can we watch the game?",
    "15": "@hornets can we delay cause the @CharlotteFC is pretty dope https://t.co/gM888GuHrP",
    "16": "@hornets @NovantHealth Cut him",
    "17": "All smiles for Game 82 here at the Hive. @hornets get set to take on Washington here in a few moments. Listen live on the flagship @wfnz and the Hornets Radio Network/App. #AllFly https://t.co/qk2A4XNOD5",
    "18": "@hornets @MELOD1P between the legs Alleyoop off the backboard! https://t.co/MQGmSLfOXo",
    "19": "@iamaaronchasejr @hornets @jam3s210 😍😍😍 wish I was gonna  be there today!",
    "20": "@camutdforever @GoldenWeasel69 @hornets @CrumblCookies Shouldn’t matter they should be able to broadcast in our specific area",
    "21": "@GoldenWeasel69 @HornetsOnBally @hornets @WashWizards @ashahahmadi @WesGotRange I know they have 20 min to figure that mess out. They got one job 🤦🏽‍♀️",
    "22": "@hornets @NovantHealth You misspelled vagina.",
    "23": "With the Memphis Grizzlies winning the 2022 Southwest division championship, the only NBA team to never win a division crown is the Charlotte Hornets",
    "24": "@HornetsOnBally @hornets @WashWizards @ashahahmadi @WesGotRange Come on guys WHY am I watching the Hawks pregame instead of the Hornets??",
    "25": "@heathergcline @HornetsOnBally @hornets @WashWizards @ashahahmadi @WesGotRange Yea that’s happening for me too. I have no idea 🤦‍♂️",
    "26": "@iamaaronchasejr @hornets @jam3s210 You in 101 ? Closer to the floor ?",
    "27": "@hornets @CrumblCookies We're about to all be running across town from the soccer game in 10 minutes hold the doors",
    "28": "@GoldenWeasel69 @hornets @CrumblCookies We play a worse opponent",
    "29": "@hornets @CrumblCookies Hoping for a rozier masterclass this game",
    "30": "Congratulations to DogY78 (@dor_almog) who moved up 259 spots to take #61 on the Charlotte Hornets team leaderboard.\n\nhttps://t.co/dYEEwV7pFm",
    "31": "@hornets @HornetsPR Hi Hugo why weren't @SirPurr and @CLTKnightsHomer invited yo this huge Hornets afternoon game? #AllFly #LetsgoKnights #KeepPounding https://t.co/FoHuPH24k0",
    "32": "@HornetsOnBally @hornets @WashWizards @ashahahmadi @WesGotRange Do we know why Bally channel says Hornets but we’re watching Atlanta Hawks pregame?",
    "33": "@hornets Tough to pick just one moment! Here for so many as a Hive Society member. Today might be my favorite moment. Sitting in a suite today as a member of the Mint List, gonna watch the @hornets win and move up the standings so we host a Play-In Tournament game.",
    "34": "@hornets @MichelobULTRA @PJWashington @cody_martin15 @MilesBridges Anyone else notice that LaMelo is never in any of these montages??!",
    "35": "Charlotte Hornets Starters:\n\nLaMelo Ball\nTerry Rozier\nMiles Bridges\nP.J. Washington\nMason Plumlee\n\nPlayers out:\nGordon Hayward\n#AllFly #NBA #NBATwitter #NBA75 #DCAboveAll #NBA #NBATwitter #NBA75",
    "36": "CHARLOTTE HORNETS VS WASHINGTON WIZARDS WATCH NOW LIVE!!! https://t.co/cdzY8IySHp via @YouTube",
    "37": "@hornets @CrumblCookies Why Bally sports showing the hawks game but not ours??!!",
    "38": "@hornets The day @isaiahthomas was signed",
    "39": "@hornets @CrumblCookies All of these players would get dominated in the 1960s",
    "40": "Today's starting lineup for the Charlotte Hornets:  Ball, Rozier, Bridges, Washington, Plumlee \nhttps://t.co/bVWH4AMCA2",
    "41": "@hornets game day.  Let’s finish the regular season with a big W!  #AllFly #buzzcity #NBA75 https://t.co/LWhYc4qthr",
    "42": "@hornets Watching Melo throw lobs to Miles.",
    "43": "Charlotte Hornets Starting Lineup 4/10\n PG: LaMelo Ball\n SG: Terry Rozier\n SF: Miles Bridges\n PF: PJ Washington\n C: Mason Plumlee\nhttps://t.co/o75oZ8vnE8",
    "44": "Last game of the regular season! \n\n@hornets back at the Hive to take on the @WashWizards! \n\n@ashahahmadi and @WesGotRange are taking you up to tipoff right now on Bally Sports Southeast! \n\n#AllFly https://t.co/c8ZG35Qk2J",
    "45": "@hornets @CrumblCookies trade for gobert in the offseason",
    "46": "First on the floor! ⤵️ \n\nhttps://t.co/ogyvkEMqyP | @CrumblCookies https://t.co/q4bZ0x8GOD",
    "47": "Bruh who else in Charlotte right now and they showing the hawks game instead of hornets?? 😐",
    "48": "@hornets @masonplumlee @MONSTATREZZ @KELLYOUBREJR @isaiahthomas Trezzz reppin the district HARD 💯✊🏼💪🏼",
    "49": "@KnightsBaseball @hornets It's great to see the best usher at sports event in Charlotte the dancing usher is back Jim. https://t.co/VKVjZLv7QD",
    "50": "@RiskyBusinessLM @hornets Let’s go !!! Love the hat and canes jersey !",
    "51": "@Ryleighpope40 @6lackb1rd @ashahahmadi @hornets Awesome!!!!",
    "52": "@hornets bring a couple of them Melo bobble heads up to 102 row z",
    "53": "time for some @hornets basketball with @Ryleighpope40 🤍 https://t.co/aOhIGvKfpM",
    "54": "@hornets we here!!!! https://t.co/z6C3N946kW",
    "55": "@hornets @NovantHealth Give him drugs so he can play more than one game we have play in tournament in 2 days",
    "56": "Ojo que si ganan los Pacers a Nets, Cavs a los Bucks, Hornets a Wizards y los Celtics a Grizzlies\n\nLa tabla quedaria:\n\n2°Boston \n3°Milwaukee \n7°Cleveland \n8°Charlotte",
    "57": "Just hanging out @6lackb1rd &amp; @ashahahmadi at the @hornets Game!!! 🤍💜 https://t.co/n5VyPtMj0g",
    "58": "@RiskyBusinessLM @hornets Aye @UnoriginalFC  wats your phrase again 🤣🤣",
    "59": "Game faces on 😈\n\n@MichelobULTRA | #ULTRADrip https://t.co/dKfuVoywVB",
    "60": "@hornets @NovantHealth Robbed us of 30 mill",
    "61": "@hornets @NovantHealth Can’t believe Gordon robbed us of that much money",
    "62": "INJURY REPORT vs WAS\n\nGordon Hayward (L Foot Soreness) is out. \n\n@NovantHealth | #AllFly https://t.co/xoVdsDWa5P",
    "63": "NBA Rumors: Proposed Lakers-Hornets Trade Sends Russell Westbrook To Charlotte For Gordon Hayward, Mason Plumlee &amp;… – Lakers News https://t.co/c6T4At5Gjl",
    "64": "Uniforms for Washington Wizards vs Charlotte Hornets at 12:30 PM. \n\n#DCAboveAll #AllFly https://t.co/KVW6ZWqdlA",
    "65": "@hornets Getting to sit behind the team! https://t.co/ItonMiMJxY",
    "66": "@FanDuel Very tricky, is Larry Johnson a knick or a hornet, is Alonzo morning a hornet or heat....if either is a hornet are they the pelican formerly known as hornets or are do all hornets fall under the Charlotte banner....cause there both &lt; than kemba, and I'd probably put zo &lt; cp3",
    "67": "@HornetsBeardGuy @hornets @NCTony @FKNTORO @EricBerman72 Bet that’s where my drunk self stumbles out anyway 🕺🏽🕺🏽🕺🏽🔥🔥🔥",
    "68": "@1EntreProNegro @hornets @NCTony @FKNTORO @EricBerman72 Yup! By the practice court!",
    "69": "@hornets Miles Bridges playing the New York Knicks!!!!! Home and Away!!!",
    "70": "@HornetsBeardGuy @hornets @NCTony @FKNTORO @EricBerman72 The season ticket entrance?",
    "71": "We're taking 10% off all regular priced items (excluding footwear) during today's game! 🏀\n\nHive Society members - you still get your special discount plus some - just show us your app at checkout! \n\n#AllFly | @hornets https://t.co/x6OcINUysa",
    "72": "It’s @TheMasters Sunday and the last @hornets Regular Season game today. Double TV setup is going, and it’s going to be a fantastic afternoon.",
    "73": "@RiskyBusinessLM LET’S GO!!",
    "74": "@hornets Hopefully that good luck works in my favor for this giveaway, too (or at least one of the fan appreciation shirts from the game today…)",
    "75": "@hornets Can you do one for international fans? 🇨🇦",
    "76": "@hornets Went to the Knicks Hornets game in the Garden where MB had his career best game. Was great bc I was with my three friends who are Knicks fans and I gotta watch them suffer through a MB masterclass. Great W",
    "77": "@hornets You’ve got that right!",
    "78": "@hornets @NovantHealth I tried to tell everyone. Gordon was out for the season when he tweeked his foot. He does not care about basketball. It is just a great means to feed his family. He came to Charlotte, because he thought he could play with no expectations of winning.",
    "79": "Ready for the last @hornets game! #AllFly https://t.co/09yiAgzM9X",
    "80": "@dapper_sports SO glad you came, AJ! You might just be good luck!",
    "81": "@paggawoot Don't sleep on us!!",
    "82": "@mattholland242 What an epic birthday!!",
    "83": "@sugamama316 Start 'em young 🥲",
    "84": "@athomp427 SO FUN",
    "85": "@CrippleSteve @MilesBridges NEVER gets old!",
    "86": "@TheeSavant Sure was 🤩",
    "87": "Reminder to all interested : If y’all still want to meet after todays @hornets game for a group photo, meet at the HIVE Society sign by the Trade street entrance! @NCTony @1EntreProNegro @FKNTORO @EricBerman72 and all others tagged in the previous post! Hope to see y’all there!",
    "88": "@hornets @NovantHealth Please trade him this off season",
    "89": "@hornets LaMelo making that all star roster. It was fate.",
    "90": "@hornets Every time @MilesBridges destroyed the rim!",
    "91": "Last game of the regular season against @hornets at 3:30 EST in Charlotte! Let’s bring one last dub home! #DCAboveAll",
    "92": "LAST GAME OF THE SEASON!!! The @WashWizards take on the @Hornets Watch @WizardsReview after the game!!! CLICK LINK TO SET REMINDER---&gt; https://t.co/FYjskcprBk #Wizards #NBA #NBATwitter #WizHornets #DMV #Hornets #AllFly #NBA75 #NBA #DC #MD #VA #DCAboveAll #DCFamily https://t.co/ON4Ovk9lA0",
    "93": "@hornets definitely bulls vs hornets always love being in the house for that matchup https://t.co/4xlkPX85RN",
    "94": "T minus 20 minutes until the final play in game for the Charlotte Hornets \n\nCharlotte Hornets vs. Washington Wizards \n\n#allfly #Playoffs #NBA75 https://t.co/6Mb1XMcxfI",
    "95": "@hornets Lamelo between the legs off the backboard",
    "96": "@malayia_batton @Rhe10k @SelfmadeSicario Also do you all remember the idiots in the local Charlotte sports media were saying two months ago the Hornets wouldn't win more than 32 games with Hayward been out of most 37 wins. I told people that the team would win 42 games I didn't guess 43 wins.",
    "97": "@RiskyBusinessLM @hornets Reppin them @Canes too I see you! Let’s goooo",
    "98": "@hornets When Kelly got hot and started to bust three’s in the fourth quarter crazy stat",
    "99": "@hornets @NovantHealth Gordon Hayward=Nic Batum",
    "100": "@BeccaMVP Welcome to Charlotte have fun at the game today and of course go Hornets #Allfly",
    "101": "@hornets Your tweet was quoted in an article by Sports Illustrated https://t.co/2AhwgkYZ9Y",
    "102": "@_Kevin_Stewart @hornets Sorry for your loss. I lost my dad 18 years ago. and i can say the void is still here, But it feels different. Instead of thinking of all the lost memories, they make me smile, because i have them. Keep your head up, and i hope you and your family are hangingin there",
    "103": "@hornets When Miles Bridges had a better windmill dunk than Obi! The arena went insane!",
    "104": "@RedWhite4life @hornets Michael just called me lol",
    "105": "@hornets melo in allstar game!",
    "106": "@Ismascarade ESPN uses “CHA” for the Charlotte Hornets, so I thought that’s what they would have used.",
    "107": "@sugamama316 @hornets I know, that's why I was trying to help make suggestions for you.  Good luck. Get those feet better so you can Jump Up and cheer although I know it ain't stopping you from Sitting Up and Cheering but it just ain't the same.😆😁",
    "108": "Olha, com as notícias recentes, acho que teremos a seguinte ordem final no Leste:\n\n1. Miami Heat\n2. Boston Celtics\n3. Milwaukee Bucks\n4. Philadelphia 76ers\n5. Toronto Raptors\n6. Chicago Bulls\n7. Brooklyn Nets \n8. Cleveland Cavaliers\n9. Atlanta Hawks\n10. Charlotte Hornets",
    "109": "@hornets After spending the last 4 years overseas, my favorite moment was being able to take my daughter to her first game and watching her fall in love with the game. Her favorite players are @MELOD1P &amp; @KELLYOUBREJR https://t.co/SOMK1jXgz1",
    "110": "@hornets @NovantHealth good,we play better withotu him,now bench rozier,trade both during off season for a good center",
    "111": "@hornets Favorite moment of the season was seeing you guys on my birthday in Philadelphia! 💙🤍",
    "112": "Let’s get a big win today, @hornets. See y’all soon. 👊🏻",
    "113": "@hornets COTY 🥰",
    "114": "GAMEDAY, Y'ALL. Roll Hornets. #allfly @hornets https://t.co/5Bgkk8i3Un",
    "115": "@hornets Favorite moment of the season was going to the game at Indiana on 1/26 and watching the Hornets 1. Torch the Pacers. 2. Oubre scoring 39 points. 3. LaMelo get the triple double that night and 4. Breaking Franchise record for most points scored in a game🔥",
    "116": "@hornets Favorite moment is seeing melo in All star game repping us then seeing us win and destroy the raptors next game!\n#allfly #hornets",
    "117": "@burrell_geo @hornets There’s soooo many, from over the past 8/9 seasons. The organization is truly the best, from Kemba giving Kobe a pair of new shoes, to Them donating an autographed ball for our Chiari Auction",
    "118": "NBA Rumors: Proposed Lakers-Hornets Trade Sends Russell Westbrook To Charlotte For Gordon Hayward, Mason Plumlee &amp; Draft Pick\nhttps://t.co/Fklwuj448z",
    "119": "3 years ago today Kemba Walker scored 43 Points on 64% shooting in his last game as a Charlotte Hornet. https://t.co/U08J18pW7s",
    "120": "@hornets Favorite moment of the season is being close to being able to play in the playins/playoffs",
    "121": "@WashWizards Game at 2:30pm vs @hornets \nMy 3 Predictions:\n-Rui Hachimura will score 18+ points and have 6+ rebounds \n-Deni Avdija will score 14+ points and have 5+ assists \n-Corey Kispert will score 12+ points and make 3+ 3-pointers \n#DCAboveAll",
    "122": "logiciel ; Brooklyn Nets\n\nAtlanta Hawks\n\nToronto Raptors\n\nCharlotte Hornets\n\nOrlando Magic\n\nDetroit Pistons\n\nOklahoma City Thunder\n\nMinnesota Timberwolves\n\nPhoenix Suns\n\nDenver Nuggets\n\nUtah Jazz\n\nCleveland Cavaliers\n\nBoston Celtics\n\nGolden State Warriors\n\nDallas Mavericks",
    "123": "@JFKVQ888 @AliceInChains @pandoramusic @hornets @Jumpman23 @HoustonRockets @AGoodDa95954430 @monsters_a_gogo @Gunnerr007 @Godstrojanhorse @BeLIEve1718 @Patriot25418086 @MAGAFOREVER24 @YatYas1776 Welcome back again 🙏💙 https://t.co/ZfwshcCBMG",
    "124": "I have a couple of tickets Row B 201 to @hornets game today. DM me, free",
    "125": "@hornets Shoutout the the people in the back 😂",
    "126": "@hornets Going to the spurs game with my fam! https://t.co/nEmUvus0mc",
    "127": "@Asga_00 @hornets Of course",
    "128": "OSKEIM SPORTS \n\nNBA EAST CONF DIVISION GAME OF MONTH\nCharlotte Hornets\n\nNBA WEST CONF DIVISION GAME OF MONTH\nDallas Mavs",
    "129": "@hornets The team should go visit Independence High School on Patriot Drive and Wilson Grove! Maybe that would be some grounding community service work and y'all could actually meet people who are from or grew up in Charlotte.",
    "130": "2 reasons the Charlotte Hornets should not trade for Russell Westbrook (via @sell_dalton)\nhttps://t.co/876wYvipzL",
    "131": "@tweetsbytyre @CharlotteFC @hornets Tbf watching the hornets some years feels like you’re committing a felony",
    "132": "@hornets Scoring 158 In Indiana!",
    "133": "OSKEIM SPORTS \n\nNBA EAST CONF DIVISION GAME OF MONTH\nCharlotte Hornets\n\nNBA WEST CONF DIVISION GAME OF MONTH\nDallas Mavs",
    "134": "/r/CharlotteHornets: [Charania] Hornets‘ Gordon Hayward will miss the Play-In Tournament due to discomfort in his left foot -- he will be placed in a cast to immobilize his foot and will be re-evaluated in two weeks. #AllFly https://t.co/AzsJeBEfpz",
    "135": "@CMPD says they found a suspicious package #Uptown - bringing heavy police presence - but say it’s safe.\n\nThis is happening as Charlotte #SHOUT! and Charlotte FC, Hornets games is bringing a lot of people into the area https://t.co/vk2r1BVii1",
    "136": "@hornets @NovantHealth It would be a shame if this was the reason we lost the playin",
    "137": "Charlotte Hornets Announce Decision On Gordon Hayward https://t.co/eEDwzlhWLq",
    "138": "@hornets Favorite moments is when Bouknight and JT Thor got significant pt",
    "139": "@hornets Poverty franchise",
    "140": "Tap in to hear from Coach JB! 🎙 #WASvsCHA https://t.co/rKOnWayC4v",
    "141": "New tumblr post: \"#NBA2K22 Milwaukee Bucks vs Charlotte Hornets MyLeague PS4 GAMES...\" https://t.co/am36EYZGEZ ifttt, youtube",
    "142": "@hornets Loved the between the legs oop to Harrell.  Another good moment was any Ball to Bridges oop. Those 2 have a true connection.",
    "143": "@hornets Game against the Knicks where Kemba had 22 at half but we came back in a thriller 🤙🏻",
    "144": "@buzz_szn @hornets @NovantHealth lmao",
    "145": "▪︎#NBA75 \nRegular season (last games)\n\n@Pacers ⚔ @BrooklynNets\n@WashWizards ⚔ @hornets\n@Bucks ⚔ @cavs\n@ATLHawks ⚔ @HoustonRockets\n@celtics ⚔ @memgrizz\n@DetroitPistons ⚔ @sixers ... https://t.co/9AVU3Jnido",
    "146": "@ChasePletcher4 Charlotte FC has to win for a hornets 7 seed",
    "147": "S/O to everybody at the Charlotte FC game at 1:30 that are coming to the Hornets game at 3:30 y’all finna be drunk drunk!! Lol see y’all there!!",
    "148": "Crazy how easy it is for me to watch a @CharlotteFC game on TV, and I have to damn near commit a felony to watch the @hornets",
    "149": "@hornets Literally Thursday night. Martins poster and Lamelos lob to Montrez",
    "150": "Don't forget to check out today's Hornets Hive Cast!\n\n@Rob_Longo and I have your game preview and a look at the possible @hornets play in scenarios.\n\nhttps://t.co/OqDLGfQBZi",
    "151": "@lucasbeammusic @hornets @NovantHealth Why? The man shoots bricks nic name westbrick",
    "152": "Just in, @hornets announce forward Gordon Hayward will be out indefinitely w/discomfort in his left foot, which will be placed in a cast. He will be re-evaluated in two weeks. So he will not be a part of the play-in roster.",
    "153": "@trezz_da_goat @KKjarvislover @hornets @NovantHealth @Lakers They want miles and pj ... and draft picks lmao for a injury ridden overhill ad. No way in hell",
    "154": "@hornets When we beat the Nets a week ago #AllFly",
    "155": "@hornets @MELOD1P @PelicansNBA Also beating the @Lakers at home with all of their fans in attendance",
    "156": "@hornets My favorite moment this year was on March 27 is when we Beat Brooklyn Nets 119 to 110 &amp; we was underdog Brooklyn was -7 what a amazing game that was",
    "157": "@SenorPompo @hornets @NovantHealth They trading miles to LA. Can't afford him I read ... that imo would be the dumbest thing in world doubt I'd watch any basketball anymore until get a owner who wants to win",
    "158": "@LaROTY2 @hornets Fair points. Bring him off the bench if need be.",
    "159": "@hornets Miles’ career high 38 pts in the win over Knicks at MSG!",
    "160": "@sugamama316 @hornets Better hurry...what about one about Chiari and Kobe or the shoes helping with your mom...tell them all of them back it with pics",
    "161": "@Joeeeeeeeeeb @hornets @NovantHealth Made of glass",
    "162": "@RBfree850 @hornets @NovantHealth He’s barely involved in the front office anymore. Don’t call him the GM to fit your narrative",
    "163": "@hornets It’s impossible for me to pick one moment.\nBut\nThe way Miles has improved and become such a great leader of the team…I have to say that his transformation has been my favorite “moment” of the year",
    "164": "#VIKING4LIFE @hornets sharing the dream with Philip, Joey and Ernie @perfect_hoodie @NorthMeckBall @Coach_Rick57 @langstonwertzjr https://t.co/H0qKksydwm",
    "165": "@hornets Watching @MELOD1P hit the go ahead floater against the @PelicansNBA and seeing his reaction was priceless! https://t.co/MYIgXZNXpi",
    "166": "@hornets Kelly Oubre hitting eight 3 pointers in the 4th quarter this season vs the Pistons. That’s for sure the best moment of the season.",
    "167": "I’m going to the Hornets game today but let’s get it today Charlotte FC!",
    "168": "Gordon Hayward Injury Update https://t.co/7LGZxUGrTo via @hornets",
    "169": "@hornets Friday’s win over the Bulls with a chance for 3 in a row today!",
    "170": "Only good thing Gordon Hayward did for the Hornets was paying off the layaway balances at a couple of Walmarts here in Charlotte in 2020 lol",
    "171": "@hornets The 1 millionth fan @spectrumcenter was pretty special too :)",
    "172": "@hornets Miles going off in double OT game vs Heat, even tho we lost",
    "173": "@burrell_geo @hornets Trying to pick one is so hard 😩😩😁 there’s so many great memories at the game ☺️",
    "174": "Great from the stress of Liverpool to the stress of Charlotte (FC and Hornets) I thought Sundays were supposed to be relaxing",
    "175": "@hornets One of my favorite moments from this season, when we beat the Magic last Thursday, my Grandson cheered the entire game when we scored! He knows when we have the ball he has to cheer loud #AllFly https://t.co/dWlrP6grrp",
    "176": "Trade this man @hornets https://t.co/m6yHqQR1mi https://t.co/EJfjsjtvmM",
    "177": "@hornets I could never pick 1 moment. This team is special. It has been on display the entire season as you have seen the way their brotherhood has grown, how they have fought back from adversity, and how they all strive for greatness for themselves and for the city of Charlotte. #AllFly",
    "178": "@hornets Definitely when we set the franchise record for pts in a game, absolutely insane game",
    "179": "There is no pathway forward with Gordon Hayward on this team. The Hornets will be stuck in the play-in conversation the next two years if he remains rostered. He has to be dealt this off-season. Number one priority.\n\nWhatever though. Charlotte has a game to win.\n\n#AllFly",
    "180": "@hornets @sugamama316 I know you're on Top of that bc all the stories you have over the years...😁📢🏀",
    "181": "@hornets Beating the Bucks at home 🙌🏻",
    "182": "@hornets Win vs Chicago. Fucking huge.",
    "183": "@hornets @NovantHealth I say retire.",
    "184": "@hornets easily this moment 😮‍💨 https://t.co/jCWQZ37Jti",
    "185": "@hornets @NovantHealth There is no way forward with Gordon Hayward on this roster. This team will be stuck in the same situation the next two years with GH taking up 30M in cap space each of the next two campaigns. He has to be traded this off-season.",
    "186": "@Starkastic8 @hornets Only do it if it dumps hayward https://t.co/aTYRNLBZcA",
    "187": "@hornets The overall improvement of @MilesBridges !  Love this group of guys!  #AllFly !!",
    "188": "@hornets @NovantHealth Please move off him in the off-season",
    "189": "Don’t do it @hornets. You already have a ball handler in Melo. https://t.co/QV5MnR4K3L",
    "190": "@hornets @KeithSmithNBA @NovantHealth Future Knick",
    "191": "I hope Mitch will recognize the fact that we're better without Gordon Hayward. We're paying him 30mln every year and he's not even helping us, we can take whoever we want with his money.\ntrade him @hornets.\n#AllFly",
    "192": "@hornets @NovantHealth I knew shouldn’t of sign him smh",
    "193": "Gordon Hayward has played his last game for the Charlotte Hornets. I wish him well in the next stop of his career.",
    "194": "@hornets Miles Bridges dunk by far the best moment, close one is the winning record. Great stuff and keeps getting better and better. Army Strong 💪🏽 #AllFly",
    "195": "@RBfree850 @hornets @NovantHealth Jordan is not the GM",
    "196": "@hornets @NovantHealth Oh really now, second year in a row. SMH",
    "197": "@hornets Also, @MONSTATREZZ first game after becoming a Hornet",
    "198": "@hornets @NovantHealth Oh no… feel better soon 🙏",
    "199": "@dirk_perc @BigBorregoBrand @hornets @NovantHealth I don't think the Lakers with the delusional ass Lakers fans Will accept another injury prone player \n\n+He Jordan brand so MJ gonna force him on the court",
    "200": "@hornets need to dump Hayward this offseason.  Doesn't even matter who they trade him for.  Literally anybody can help the team more than Hayward in street clothes. https://t.co/mLQHCSvi0h",
    "201": "Bro please move off him in the off-season seriously enough is enough  @hornets https://t.co/jmAUwrgwjj",
    "202": "@hornets @NovantHealth Trade him for Westbrook.",
    "203": "@hornets dropping 39 https://t.co/abRRy3vbBq",
    "204": "@BigBorregoBrand @hornets @NovantHealth He better be.",
    "205": "@hornets The comeback win on opening night against the Pacers. That’s the only game I was able to make it this year, and it was amazing!! #AllFly",
    "206": "@hornets The day you signed @isaiahthomas",
    "207": "@josiiahisfather @hornets @NovantHealth He tryna up the value",
    "208": "@hornets Kelly 39 off the bench against Memphis",
    "209": "@LastBeast24 @BigBorregoBrand @hornets @NovantHealth Lakers for Russ",
    "210": "@hornets Jan. 26 vs Pacers 158 points!! https://t.co/Yu1DisuCJO",
    "211": "@JordanLuke32 @BigBorregoBrand @hornets @NovantHealth Thts about it.",
    "212": "@hornets LaMelo torching the Pacers this season💯",
    "213": "@hornets @NovantHealth Get the fuck out of CLT",
    "214": "Hornets have been rolling without him.\nThey’ve outgrown him.\n\nMaking the playoffs without Hayward would almost assuredly mean he’s out of Charlotte next season. https://t.co/6PDg50OfO5",
    "215": "@HornetsPR @hornets Dang didn't even know we had a chance for the 7 seed still that would be crazy",
    "216": "@hornets Melo's thru-the-legs oop to Miles was exciting - not just for the play, but because it's the kind of stuff that is getting Charlotte noticed",
    "217": "@LastBeast24 @BigBorregoBrand @hornets @NovantHealth An assisted living center",
    "218": "Charlotte FC will beat Atlanta United. Then the Charlotte hornets will beat the wizards. Then the hawks will lose to the rockets. Then the nets will lose to the pacers. Then the Cavs will lose to the bucks. 7th seeded Hornets otw",
    "219": "Also: #Hornets have found their offensive identity without Hayward. Very interesting off-season coming for the Hayward-Charlotte front office relationship. Would be shocked if Mitch doesn’t sniff around for a new home for GH. https://t.co/BKR0RJLGJ3",
    "220": "@pantherspope @hornets @jam3s210 Definitely",
    "221": "@hornets My first live game. https://t.co/7VR7jDrH7C",
    "222": "@hornets @NovantHealth @Eric_Calkins1 that hurts",
    "223": "@hornets @NovantHealth Is bro going to keep getting away with quitting on the team?",
    "224": "@BigBorregoBrand @hornets @NovantHealth Who gonna accept is ass?",
    "225": "@hornets Kelly going nuclear in the 4th and hitting 9 threes probably",
    "226": "trade him @hornets. https://t.co/uqAD21s7I5",
    "227": "@hornets @NovantHealth bro is gone this offseason LMAO",
    "228": "@hornets When my boyfriend took me to my first hornets game for my birthday! https://t.co/qXVcVAsCFH",
    "229": "The Hornets say Gordon Hayward will be out indefinitely with discomfort in his left foot.\n\nCharlotte will be in the play-in tournament this week. Where they wind up will be determined this afternoon.",
    "230": "@hornets @MELOD1P making all star game",
    "231": "@KKjarvislover @hornets @NovantHealth @Lakers Nah Anthony Davis",
    "232": "@hornets @NovantHealth Please get this nigga off my team",
    "233": "@hornets @NovantHealth How long he been out",
    "234": "@hornets @NovantHealth nah, we just been playing so well without him it makes no sense to bring him back. finish this season out then he gone in the off-season",
    "235": "@hornets @NovantHealth Cut \n\nThe\n\nFat.",
    "236": "@hornets My sons birthday where we seen the hornets beat the raptors https://t.co/kJnymaio7A",
    "237": "@hornets @NovantHealth He needs to ne traded, he stay injured.",
    "238": "@hornets Melo’s game winner!",
    "239": "@hornets @NovantHealth mitch tryna explain why gordon haywards our best player even tho he struggles to play 2/3rds of the season https://t.co/kE3pwgc4Qw",
    "240": "@hornets When my son, his gf and I came to the Boston game. It was great cause all the Boston fans cheered for @isaiahthomas even though he’s with the @hornets! Very cool moments.",
    "241": "@hornets @NovantHealth \"indefinetely\" just say that he'll be OUT for the play-in game.",
    "242": "@hornets @NovantHealth The New Mr Glass https://t.co/YJEhf8U6tT",
    "243": "@hornets All the posters from this guy https://t.co/LxFgQ5uMuS",
    "244": "Today, we're all rooting for Indianapolis, Charlotte, and Cleveland.\n\n  I've always been a Cavalier Pacer Hornet afficionado.",
    "245": "@hornets @NovantHealth Better without him",
    "246": "While you’re waiting for @CharlotteFC and the @hornets to get going today, you could always read a Mailbag unlike any other — which covers all the burning Panthers topics.\n\nhttps://t.co/iY6ypoqObr",
    "247": "@hornets Court side saw meloooooo https://t.co/kXgs24tNUz",
    "248": "@hornets @NovantHealth Wtf nooo",
    "249": "@walterburks @CharlotteFC @hornets Living the dream !",
    "250": "OFFICIAL: Gordon Hayward will be out indefinitely with continued discomfort in his left foot. \n\n🔗: https://t.co/t3HLEIUHZM | @NovantHealth https://t.co/1RoRDnG8iL",
    "251": "@hornets Knowing we have a winning season!",
    "252": "@hornets This dunk right here!!! https://t.co/WEUTX53T5d",
    "253": "@hornets Lamelo behind the back ko look pass to Plum dog for the flush. My son and I were watching us and we both went crazy.",
    "254": "@hornets Took my daughter and son to their first Hornets game since the pandemic for their birthdays on Nov. 14 against the Warriors. It was the first trip we had taken since December 2019. It was the best time! #AllFly https://t.co/gSScpSIjfd",
    "255": "The second is more of a wildcard. Their Hornets are young and exciting. Some will say Charlotte is too close to the coast to deserve its own shirt. But we're of the belief that when you need an ocean, it would be nice to not have to drive 3.5 hours. https://t.co/nqMJviSmhM https://t.co/CjiSpAS7YH",
    "256": "@hornets My favorite moment was the Miles Bridges scoring outburst against the Knicks",
    "257": "@hornets My favorite moment was when Lamelo hit the game winning floater in the lane against Milwaukee at home. At that moment you knew He was ready for the next step. (And all the sensational Bridges dunks, I can’t pick one)\n#AllFly \n#BuzzCity",
    "258": "Say it with me: The EIGHTH-SEEDED Charlotte Hornets",
    "259": "@hornets Franchise record game against the pacers where we got 158. https://t.co/7kAYfwMdUv",
    "260": "@hornets opening night at the Hive!",
    "261": "@G22XRP @ShxunVET_XRP @Ballies_NFT @keivo__ @cryptocom @NBA @hornets @Raptors @dallasmavs @nuggets @TheNBACentral @TheHoopCentral Message me",
    "262": "@hornets I was able to see my first game ever this year against the mavs, #AllFly https://t.co/wOfCo36Xpq",
    "263": "@hornets When the team signed @isaiahthomas for the reason of the season and when you traded for @MONSTATREZZ",
    "264": "@hornets The between the legs, off the backboard alley oop from Melo to Trezz encapsulated the season. Fresh, exciting, unpredictable, and most importantly, fun",
    "265": "@hornets Gotta be Kelly hitting 9 threes in a quarter",
    "266": "@hornets Kelly Oubre breaking the record for most points off the bench!! 🔥 played out of his mind",
    "267": "@hornets @PJWashington 🫳🏽KD that was priceless lol",
    "268": "@hornets The signing of IT. That’s it.",
    "269": "Don't miss your chance to meet a @hornets legend today! \n\nPurchase a copy of Muggsy Bogues' new book from the Hornets Fan Shop during the first half of today's game to participate! \n\n#AllFly https://t.co/6ql4f2aqbe",
    "270": "@hornets For sure this @MELOD1P game winner against Milwaukee on my birthday! https://t.co/SZQUFYpSD1",
    "271": "@hornets Kyle lowery missed 3 call",
    "272": "@hornets LaMelo game winning floater vs the Pelicans",
    "273": "@hornets Going to Brooklyn and beating KD and the Nets twice as well as beating the Knicks twice, making us 4-0 in New York this season 👍",
    "274": "@hornets Favorite moment has to be us beating the Nets 🔥",
    "275": "2) @BrooklynNets @hornets @cavs @ATLHawks are battling for Play-ins position. These are must-win games, and we have an early preview of the play-ins. https://t.co/s8MJk6aRsy",
    "276": "@hornets Literally any Eric Collins reaction.",
    "277": "@hornets only the follow back is good to me 😊💙",
    "278": "@hornets When my wife and two of our best friends went to our first game! It was a blast! https://t.co/QcPrWfOlbH",
    "279": "@hornets Breaking franchise records in that last game vs IN 😈",
    "280": "@hornets LaMelo Magic Johnson game https://t.co/5SxVCDZL3E",
    "281": "@hornets Miles going off in MSG",
    "282": "@hornets I loved when Terry Rozier hit that game winner against Golden State, it was a great moment fs 🤝🏾",
    "283": "@hornets March 25th...went to the game for my birthday and Terry Rozier hit some clutch 3s for the Hornets to win.",
    "284": "@hornets My favorite play of the season was the LaMelo ball between the legs lob the miles bridges",
    "285": "@hornets My favorite moment this season was attending the Jazz game. Watching the Hornets played very hard fight against a very good Utah team. Attending the game felt like a playoff game.",
    "286": "@hornets First game of the season comeback win against the pacers",
    "287": "@hornets Tip off today at 3:30",
    "288": "@hornets Bridges career high against Knicks",
    "289": "@hornets Beating the nets in kyries first home game.",
    "290": "@hornets LaMelos game winning floater vs the Bucks",
    "291": "@hornets When Melo made them 3️⃣s",
    "292": "@hornets These past 2 games have been great! High energy and fun to watch!",
    "293": "@hornets Between the legs off the glass from Melo to Montrez!!",
    "294": "@hornets Do I have to pick just one Eric Collins call? HUM DIDDLY DEE! HOW DO YOU DO?!?!?",
    "295": "@hornets Lamelo goin off against the Bulls the other night!",
    "296": "@hornets breaking all those scoring records against the pacers; giving them payback for that play in match 🔥",
    "297": "@hornets The lamelo ball career high or any miles bridges dunk",
    "298": "@hornets Gotta be when Kelly hit 8 fourth quarter 3s vs Detroit 🔥",
    "299": "@hornets Between the legs alley oop!",
    "300": "@hornets Lamelo ball threw the legs alley oop to Montrezel Herreal",
    "301": "First game of the day is @CharlotteFC then headed across town to see the @hornets !! Great day for Charlotte sports! #AllFly #ForTheCrown https://t.co/YT3AfxmjOi",
    "302": "It's FAN APPRECIATION DAY, which means free stuff for the best fans in the world! 🤗 Tell us your favorite moment of the season for a chance to win a signed basketball. 🐝 \n\nRules: https://t.co/Y6mS0fdcAo | #AllFly https://t.co/LEWuq27eVO",
    "303": "Matt’s POD\n\nCharlotte Hornets -13 (-110) FD\n\nPorzingis, Kuzma, KCP out for WSH\nThis same lineup for WSH just lost to NY w/o Randle by 22. \nThis same lineup for CHA just beat NY by 11 and they had Randle. \nCHA can avoid Nets in Play-In with win and ATL loss",
    "304": "@erecasner @ca_rockets @HoustonRockets @MuggsyBogues @TheRealLJ2 @glenrice41 @hornets Many fans such as myself are interested in taking a look at a NBA travel itinerary and other things, big and small, that are related to the pro sports experience. @erecasner keep sharing stuff like that. 👍",
    "305": "In Rockingham, North Carolina driving back to Charlotte for our tailgate and two little kids get out of the car at the gas station wearing Hornets jerseys. Things are changing",
    "306": "Charlotte Hornets - Washington Wizards\nHouston Rockets - Atlanta Hawks\nBrooklyn Nets - Indiana Pacers\n\nBet slip link: https://t.co/pzyVHaDfvR https://t.co/4WbXeXAo7U",
    "307": "DasHaus made a bet!\n\nEvent: Washington Wizards vs Charlotte Hornets #NBA\nBet: Charlotte Hornets TO WIN -13\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "308": "DasHaus made a bet!\n\nEvent: Washington Wizards vs Charlotte Hornets #NBA\nBet: Washington Wizards TO WIN +13\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "309": "2 reasons the Charlotte Hornets should not trade for Russell Westbrook\nhttps://t.co/4BFMoTEjr3",
    "310": "Busy sports day in the QC today with both the @hornets and @CharlotteFC playing this afternoon! Let's get the win! #AllFly #ForTheCrown ✌️",
    "311": "@JFKVQ888 @AliceInChains @pandoramusic @hornets @Jumpman23 @HoustonRockets @AGoodDa95954430 @monsters_a_gogo @Gunnerr007 @Godstrojanhorse @BeLIEve1718 @Patriot25418086 @MAGAFOREVER24 @YatYas1776 Hello there 😊",
    "312": "Charlotte Hornets. @hornets \n\nOUR YEAR baybay https://t.co/ckGf3trK3T",
    "313": "Ending the 2022 regular season it made me think of @hornets legends. Absolutely love @RexChapman \n#MentalHealthMatters\n#Baller\n#MyBad https://t.co/CWBegPDrYi",
    "314": "@Jahiem_BellCow @hornets @drpepper Aye we tanking so take the W",
    "315": "What an insane sports day for me.  City- Liverpool. Charlotte fc.  Final round of masters.  Hornets playing for playoff position.",
    "316": "@NataTheScribe idk at least the Kings had the Chris Webber era. We charlotte hornets fans may have it worse than any fanbase in sports over the course of franchise history.",
    "317": "@lehall18 @hornets @drpepper Still a single chance at the 7 seed too. Hornets win, Nets/Cleveland/Atlanta loss.",
    "318": "The Charlotte Hornets take on the Washington Wizards at home today for their last regular game of the season 🏀🏀\n\nFor tailgating in the sunshine, you'll only need a light jacket with temperatures in the mid-60s. @wcnc https://t.co/SmrFNppzJp",
    "319": "@iamaaronchasejr @hornets @jam3s210 Real nice. 🙏🏽🙏🏽🙏🏽",
    "320": "Glad to be getting back to work after eye surgery!!! Let’s do this thing called win.\n#hornets #nba #charlotte #fims #joker https://t.co/O8U7hV7PdV",
    "321": "@LegionHoops I desperately hope the @Lakers don’t part with Russel Westbrook he is our best player!!! @hornets @DetroitPistons @nyknicks @SacramentoKings @Pacers",
    "322": "I need an excuse to fly back to Charlotte next week \n\nWe need a win today @hornets",
    "323": "Washington Wizards vs Charlotte Hornets NBA Pick and Prediction NBA Bett... https://t.co/0Shvw8n4eo via @YouTube",
    "324": "@iamaaronchasejr @hornets @jam3s210 Taking Ry to her fist game , let’s link up if time permits",
    "325": "Today on the Hornets Hive Cast:\n\n@Rob_Longo and I preview today's @hornets regular season finale against the Wizards and take you through the play in tournament scenarios.\n\nhttps://t.co/OqDLGfQBZi",
    "326": "4.10.22\nIndiana #Pacers vs Brooklyn #Nets\nWashington #Wizards vs Charlotte #Hornets\nMilwaukee #Bucks vs Cleveland #Cavaliers\n\nToday's #NBAPredictions: https://t.co/hltNwEZVnD\nBet on NBA:  https://t.co/ArbfnziqHj\n#Draftkings #Fanduel #sportsbook #BetMGM #WilliamHillUS https://t.co/9Fn9YpEaTO",
    "327": "@Eternity9 @HornetsPR @hornets Yes it was a great explanation compared to that other multi color messed that came out last week.",
    "328": "Major day in Charlotte sports yall.   Charlotte FC looking for revenge against Atlanta and the Hornets playing for seeding against Washington.    And don't sleep on the Indian Trail U14 boys in a battle on the pitch  against Weddington.",
    "329": "WASHINGTON WIZARDS vs\nCHARLOTTE HORNETS, 3:30PM.",
    "330": "@nullum_tempus @CLT_Nic @hornets @johnlewcats Thanks for sharing these",
    "331": "@hornets @drpepper Fan appreciation days for the Hornets and @CheckersHockey today. Let's send all the fans home happy today boys!!!",
    "332": "Charlotte Hornets - Washington Wizards\nBrooklyn Nets - Indiana Pacers\nMemphis Grizzlies - Boston Celtics\n\nBet slip link: https://t.co/1SP9NrMRL8 https://t.co/hC5dOxp3LV",
    "333": "The Sunday read. \n\n@LendingTree | #AllFly https://t.co/xvkWf8kH2t",
    "334": "Charlotte fc and hornets both need to win today",
    "335": "I felt good about the Charlotte Hornets chances of moving up in the standings on the last day of the season until I saw that the teams playing the Hawks, Nets and Cavaliers are pretty much allowing volunteers from the crowd fill out their starting fives today.",
    "336": "@KulbokasBurner @TheNBACentral @SeanDeveney LeBron James is IN a Charlotte Hornets Jersey.",
    "337": "@WashWizards close out the 21-22 season this afternoon against the @hornets . Follow The Focus on Twitter for updates throughout the game and postgame for Wizards Outlook. \n #TheFocusTV #NBA #DCAboveAll https://t.co/9fr93sIv4v",
    "338": "POD 🐮\n\nCharlotte Hornets -13 \n#AllFly \n\nfull card posted in discord under “ influencer bets “ BOL !! https://t.co/2VWy4XBz0h",
    "339": "It’s the final game of the regular season for the Wizards as they look to end the 2021-2022 campaign with a win as they take on the Charlotte Hornets #DCAboveAll https://t.co/K6TcHVy2Xd",
    "340": "@jdgman6 @CharlotteFC Have a great time I will be at @Hornets game.",
    "341": "@HornetsPR @hornets Great explanation. Thank you!",
    "342": "@CharlotteFC @ 1:30 @hornets @ 3:30 and @Canes @ 7 🥹 it’s beautiful",
    "343": "Smile! It's game day!!! 😁🏀💜\n\n#letsgohornets #GameDay #buzzcity #lastregseasongame @ Charlotte Hornets https://t.co/q0ZhWnvgjn",
    "344": "NBA Basketball Game Betting Picks Simulator: 3:30 PM ET - Washington Wizards vs. Charlotte Hornets - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/brb8GFsFiZ #nba #sportsbetting #freepicks #cappertek",
    "345": "@hornets @Corey_Dickerson I will be cheering loud for you guys while I'm heading up to Raleigh to see the @Canes play tonight! #AllFly #LetsGoCanes",
    "346": "ICYMI: @rodboone of @theobserver previews the final day of the regular season with quotes from key @hornets after Friday's win at CHI. #AllFly https://t.co/YGvClUq0sb",
    "347": "Heading in to Game 82 vs. WAS today, @hornets have clinched a spot in the 2022 Play-In Tournament and are assured of holding at least the 10-seed or better.  With a win today, Charlotte will hold the following scenarios for its seeding based on other game outcomes #AllFly https://t.co/wPh3zeQ26X",
    "348": "Big day today let’s get it @hornets",
    "349": "Consensus Line Move:\n2022-04-10 Washington Wizards at Charlotte Hornets from 234.00 to 232.50\nUnder who saw that coming?\n#NBA #bettingadvice #innovation #profit",
    "350": "Consensus Line Move:\n2022-04-10 Washington Wizards at Charlotte Hornets from -13.50 to -12.50\n#DCAboveAll fortune knocks\n#NBA #sports #ml #realestateagent",
    "351": "@lehall18 @hornets @drpepper also if Cavs lose and Hornets win we host Cleveland",
    "352": "It’s the regular season finale for your #Hornets today. \n\n@EvanBirchmore gets you ready for the matchup. \n\n#allfly \n\nCharlotte Hornets vs. Washington Wizards Preview (via @EvanBirchmore) https://t.co/GUSD8f9kle",
    "353": "i have no idea what imma do today man we have masters, a ton of baseball, charlotte fc, and the hornets https://t.co/Th3bHqhQ4O",
    "354": "@zac_harvey @CheckersHockey If only I wasn’t shooting @hornets.",
    "355": "@Pacers vs. @BrooklynNets \n@WashWizards vs. @hornets \n@Bucks vs. @cavs \n@ATLHawks vs. @HoustonRockets \n@celtics vs. @memgrizz \n@Raptors vs. @nyknicks \n@MiamiHEAT vs. @OrlandoMagic \n@DetroitPistons vs. @sixers \n@chicagobulls vs. @Timberwolves \n@spurs vs. @dallasmavs",
    "356": "Houston Rockets - Atlanta Hawks\nCleveland Cavaliers - Milwaukee Bucks\nBrooklyn Nets - Indiana Pacers\nCharlotte Hornets - Washington Wizards\n\nBet slip link: https://t.co/NEiPlhJ5gl https://t.co/IlXynqDA3h",
    "357": "@CLTdevelopment @CLT_Nic @hornets @johnlewcats For comparison’s sake, at the end of FY 21, there were 100 authorized FTE in rail operations, and by the end of FY 22, it was down to 89. The preliminary plan for FY 23 is to go back to 94. So, we’re still going to be short 6 operations positions compared to pre-pandemic levels.",
    "358": "Obviously, most realistic of these scenarios is a Charlotte win + Atlanta loss v. a frisky young Rockets squad in Houston. That at least gets #Hornets one home game. Getting to 8th would be awesome, guaranteeing these guys a min. of 2 high stakes games. https://t.co/eLFQl0MMAE",
    "359": "If all teams win, Charlotte will stay 10th. If Charlotte loses, they will also stay 10th.\n\nThe Hornets will only play the Hawks or Cavaliers in the 9/10 game if that’s the case. They cannot play the Nets unless it’s in the 7/8 game.",
    "360": "🚨 Line Change 🚨\n\nWashington Wizards @ Charlotte Hornets\nSun 3:40 PM EST\n\nFrom:\nCHA -13.5 -110\n\nTo:\nCHA -12.5 -110",
    "361": "Kyle tell me how the “real life needs” generate any meaningful ROI for rock hill, come on man. Charlotte would still be a town if the panthers and Hornets never existed. If you had 225m you’d rather invest in something that you *might* see the benefits of in 50 years than 10-15? https://t.co/dUWZ4oHxRY",
    "362": "Still an elite superstar. This is the kind of player your organization needs @hornets https://t.co/S73XCDrjCI",
    "363": "If the #Hornets want to move up, they need to win against the Wizards. Here are the possible scenarios for Charlotte IF they defeat Washington + any combination of the Hawks, Cavaliers, and Nets lose.\n\nIND vs. BKN (43-38), 3:30\nATL (42-39) vs. HOU, 3:30\nMIL vs. CLE (43-38), 3:30 https://t.co/YW747lZnRQ",
    "364": "@hornets @drpepper BEAT WASHINGTON",
    "365": "Awesome sports day ahead. \n\n1. Charlotte FC \n2. Sunday at the Masters\n3. Hornets \n4. Canes\n4. Yanks\n\nThe. Best. Time. Of. The. Year.",
    "366": "Wizards (35 - 46) @ Hornets (42 - 39)\n🚨 Buzzer Moment Watch\n🕞: 3:30 pm ET\n📱: Buzzer⚡️, NBA League Pass\nSpread: CHA -11 (@FDSportsbook)\n\n📰 There’s still hope for Charlotte to move up the play-in tournament bracket. Regardless, they have won 11 of their last 15 games.",
    "367": "Good morning #Hornets fam it’s the FINAL home game😢let’s get this W today and enjoy this game one last time for GAMEDAY! I NEED help y’all I want to get these signed before I don’t see my team again😭🙏🏾oh yeah btw looked what I picked up at the last game🔥💪🏾‼️#AllFly @hornets https://t.co/9zsopv1otT",
    "368": "Today is all about YOU! 🕺🏽\n\n#AllFly | @drpepper https://t.co/baqqFVz5aU",
    "369": "NBA เช้าวันที่11/04/65\nเวลา02.30\nWASHINGTON WIZARDS at CHARLOTTE HORNETS\n\nBest Bet: Wizards +13.5",
    "370": "@hornets is there an Isaiah Thomas jersey available?",
    "371": "I’ll be late to the @hornets game bec I have to work the @CharlotteFC game but I will be at the hive today no matter what!",
    "372": "🔥Big day in Charlotte\n\n⚽️@CharlotteFC hosting @ATLUTD \n\n🏀@hornets season finale vs @WashWizards https://t.co/t3TILkcS2r",
    "373": "🎟🎟🎟🎟\n\n🔘 Secure the last playoff spot\n🔘 Secure the @nbatopshot Playoff tickets \n#AllFly @hornets https://t.co/m1IWe8vCkr",
    "374": "I can’t wait to be in the Hive for the final regular season home game!! @hornets #AllFly",
    "375": "Game 2 - Charlotte Hornets vs. Washington Wizards\nSpread: CHA -13.5\n\nInjuries:\n- Pacers -\nOut: Myles Turner, Goga Bitadze, Chris Duarte, Ricky Rubio, TJ Warren\nQuestionable: Malcolm Brogdon, Jalen Smith\n- Nets -\nOut: Ben Simmons, Joe Harris, Goran Dragic, Probable: Seth Curry",
    "376": "I am interested to see what the Charlotte Hornets can do in the post-season...I don't think they'll make it very far...But if they even just get past the play-in they've done something substantial...I wanna see them play in a 7 game series so badly...",
    "377": "Charlotte Hornets bury Chicago Bulls early in 133-117 win #carolinanews https://t.co/BiICqLqCEM",
    "378": "Big day today @Hornets Lets goooo!!!!",
    "379": "🔴LIVE ~ Washington Wizards vs. Charlotte Hornets - NBA League Pass\n🔴Watch Now➠ https://t.co/Tn8ZYiE41s\n📅 : Sunday, April 10, 2022\n⏰ : 3:30 PM",
    "380": "🔴LIVE ~ Washington Wizards vs. Charlotte Hornets - NBA League 2022\n🔴Watch Here➠ https://t.co/8Zs5ywximz\n📅 : Sunday, April 10, 2022\n⏰ : 3:30 PM",
    "381": "@trayNTP @hornets @macwfnz Check the record with him vs without",
    "382": "Green Cracked Ice for Miles..\nPatch /56 … where my playoff bound Hornet Fans at… #Charlotte #Buzzcity #miles #bridges #whodoyoucollect https://t.co/gNLuTZFAQF",
    "383": "🚨 Line Change 🚨\n\nWashington Wizards @ Charlotte Hornets\nSun 3:40 PM EST\n\nFrom:\nCHA -11.5 -110\n\nTo:\nCHA -13.5 -110",
    "384": "LaMelo Ball Rookie Card RC Base Panini 2020-21 Illusions Charlotte Hornets #151 - https://t.co/L3M5PUfh1y\n\n#lebron #lebronjames #lakers #nba \nhttps://t.co/SINyvCIeLp",
    "385": "Charlotte Hornets - Washington Wizards İddaa Tahmini 10.04.22\nhttps://t.co/cbPITGczxu",
    "386": "@HornetsPR @hornets Nothing new 😒",
    "387": "FREE #livestream here👉https://t.co/2c6Ltz5wlw 😉\n——\nApr.10, Sun.\n🏀#NBA ‼️\n1.Brooklyn Nets Vs Indiana Pacers\n2.Houston Rockets Vs Atlanta Hawks\n3.Charlotte Hornets Vs Washington Wizards\n4.Cleveland Cavaliers Vs Milwaukee Bucks\n5. New York Knicks Vs Toronto Raptors",
    "388": "@MSTDENIS @NBAMemes A pelican truly. Back when New Orleans was the Hornets and Charlotte was the bobcats.",
    "389": "🏀NBA🏀 #NBA \n🏀Saison régulière🏀\n\nBrooklyn Nets - Indiana Pacers\nCharlotte Hornets - Washington Wizards\nCleveland Cavaliers - Milwaukee Bucks\nDallas Mavericks - San Antonio Spurs\nDenver Nuggets - Los Angeles Lakers\nHouston Rockets- Atlanta Hawks",
    "390": "Sports while i'm asleep (or trying to)\n\nHershey Bears Vs Springfield Thunderbirds (AHL Game 69 of 76)\n\nFace-Off: 11 P.m Swedish \n10 P.m British \n5 P.m Eastern \n2 P.m Western \n\nCharlotte Hornets Vs Washington Wizards (NBA Matchday 81 of 82)\n\nTip-off: 1 A.m Swedish \n12 P.m British",
    "391": "https://t.co/NKjJNAjKxa\n#Dallas #Mavericks vs. San Antonio #Spurs #NBA #Betting Tips and Best Bets\n#2021 #2022 #basketball #betting #BettingPicks #BettingTips #CharlotteHornets #Dallas #dal...",
    "392": "Easter Retail Break is still live and spots are filling up quickly￼ Don’t be late! The Charlotte Hornets are still available. You still have the chance at Lamelo Ball￼ Claim your spot now only $7! \n\nhttps://t.co/reqEu9uS8D\n\n#nba #packbreak #packs #break",
    "393": "Check out PJ WASHINGTON JR. 2019 20 PANINI MOSAIC #213 RC ROOKIE  CHARLOTTE HORNETS https://t.co/nxxaASsiqP #eBay via @eBay",
    "394": "hit my first autographed jersey in a break! @MuggsyBogues  @RSAutographs #beckett #autographedjersey #charlottehornets https://t.co/24GMWY69s6",
    "395": "Check out 21-22 Panini Sticker LaMelo Ball #149 Charlotte Hornets FREE SHIPPING ALL STAR https://t.co/u6HXRWWlXf #eBay via @eBay",
    "396": "Check out 2020-21 Mosaic Vernon Carey Jr. Green Prizm Rookie RC CHARLOTTE HORNETS https://t.co/kPsmEU43Df #eBay via @eBay",
    "397": "@Al93664054 @jphanned If the Hornets win and Hawks, Cavs, Nets all lose, Charlotte moves up the the #7 spot.",
    "398": "Charlotte Hornets Starter Jacket XL https://t.co/AYdHQtIctW eBay",
    "399": "Check out 2015-16 Panini Excalibur Terry Rozier RC Celtics Rookie CHARLOTTE HORNETS https://t.co/KD3fFwoGgD #eBay via @eBay",
    "400": "Check out 2018-19 Prizm Basketball Miles Bridges Rookie Emergent #12 Charlotte Hornets https://t.co/iEco1lkbD8 #eBay via @eBay",
    "401": "@akgwilliams @hornets @WashWizards @infiniteobjects @nbatopshot @MELOD1P I'm landing around 10am. I'll get to the Arena early. I'll be around until Monday evening around 6ish. Hit me up if you're around my dude.",
    "402": "@RE82 @hornets @WashWizards @infiniteobjects @nbatopshot @MELOD1P Welcome back Yashi 🙌",
    "403": "Congratulations to playwithfire05 (@playwithfire05) who moved up 94 spots to take #60 on the Charlotte Hornets team leaderboard.\n\nhttps://t.co/dYEEwV7pFm",
    "404": "@RE82 @hornets @WashWizards @infiniteobjects @nbatopshot @MELOD1P TS onay7 good luck bro and thankss",
    "405": "Going to Charlotte in the morning to see @hornets play the @WashWizards I'll have my @infiniteobjects on me, hoping for an autograph on the physical representation of this NFT. Well it's 30 @nbatopshot Cool Cats NFTs. I have this extra one I want to give to @MELOD1P also. #NLL https://t.co/pnsyvieGeG",
    "406": "Day 68 tweeting the @hornets to #BringBackTheCats court/uni combo for one night. Please don’t finish this season on a L. F the zards https://t.co/KHoZZ2bSn0",
    "407": "DeMar DeRozan could be the Melo of the Charlotte Hornets if he could get rebounds #AllFly https://t.co/cC8CpO7cXh",
    "408": "If the @ATLHawks, @cavs, and the @BrooklynNets all lose tomorrow, and the @hornets win, what will the East play-in seeding look like?? It's an impossible math problem! @BillSimmons\n@TheAthleticNBA #NBAPlayoffs2022",
    "409": "After the loss to @hornets (133-117), @ZachLaVine didn't mince his words on @chicagobulls current losing skid\n\nFull story: https://t.co/3ByKdqb33H\n\n#BullsNation https://t.co/aTCLr8veHn",
    "410": "Congratulations to idiotshawn who moved up 4 spots to take #8 on the Charlotte Hornets team leaderboard.\n\nhttps://t.co/dYEEwV7pFm",
    "411": "@macwebb @yaboiwawan @ConnerS1_ @MalcumJean @LakersStan17 @GuruLakers Brogdon and hield are both movable. So is hayward from the Hornets. Russ has and expiring contract next year and brogdon and hield have longer contracts that the pacers want to move off of. Hayward in Charlotte does as well",
    "412": "@1EntreProNegro @HornetsBeardGuy @spectrumcenter @NCTony @CHARLOTTEMAN3 @sugamama316 @jsk1030 @themiller46 @EricBerman72 @ShawnMichaels @hornets Hell yeah!!!! https://t.co/gBkF39VXXh",
    "413": "The Charlotte Hornets https://t.co/Q0lzHF1A2W",
    "414": "@jsk1030 @FKNTORO @1EntreProNegro @HornetsBeardGuy @spectrumcenter @NCTony @CHARLOTTEMAN3 @themiller46 @EricBerman72 @ShawnMichaels @hornets That would be epic!!! Both- Hornets making the finals , and watch party for Hornets fans",
    "415": "@1EntreProNegro @FKNTORO @spectrumcenter @NCTony @CHARLOTTEMAN3 @sugamama316 @jsk1030 @themiller46 @EricBerman72 @ShawnMichaels @hornets Bro, we need to have a watch party haha",
    "416": "@HornetsBeardGuy @FKNTORO @spectrumcenter @NCTony @CHARLOTTEMAN3 @sugamama316 @jsk1030 @themiller46 @EricBerman72 @ShawnMichaels @hornets He said keep the blanket over your head so your fluorescent skin doesn’t keep me awake all night 🥴🥴🤣🤣🤣🤣🤣🤣",
    "417": "@1EntreProNegro @FKNTORO @spectrumcenter @NCTony @CHARLOTTEMAN3 @sugamama316 @jsk1030 @themiller46 @EricBerman72 @ShawnMichaels @hornets “Life’s a risk, Carnal!”",
    "418": "@HornetsBeardGuy @FKNTORO @spectrumcenter @NCTony @CHARLOTTEMAN3 @sugamama316 @jsk1030 @themiller46 @EricBerman72 @ShawnMichaels @hornets @FKNTORO Doyers baseball and this it’s going down right now!! https://t.co/dhwZQ5FA54",
    "419": "@1EntreProNegro @FKNTORO @spectrumcenter @NCTony @CHARLOTTEMAN3 @sugamama316 @jsk1030 @themiller46 @EricBerman72 @ShawnMichaels @hornets “Blood in Blood Out” is my jam!!",
    "420": "@jsk1030 @FKNTORO @1EntreProNegro @spectrumcenter @NCTony @CHARLOTTEMAN3 @sugamama316 @themiller46 @EricBerman72 @ShawnMichaels @hornets Time to end the “one and done” narrative!",
    "421": "@jsk1030 @FKNTORO @1EntreProNegro @spectrumcenter @NCTony @CHARLOTTEMAN3 @sugamama316 @themiller46 @EricBerman72 @ShawnMichaels @hornets Most definitely! Shutting the city down for a week!",
    "422": "@FKNTORO @1EntreProNegro @HornetsBeardGuy @spectrumcenter @NCTony @CHARLOTTEMAN3 @sugamama316 @themiller46 @EricBerman72 @ShawnMichaels @hornets Man if we make the finals this year, we are having a huge celebration/watch party. Promise.",
    "423": "@Mint_Pro_Serve @hornets @NikeyMunes Let’s goo",
    "424": "@SteveSmith_13 @hornets @CHARLOTTEMAN3 @NBA_UKFans Fair play to you hope you enjoyed the game, I live in the UK and I'm praying one day I'll get to come over and watch a game but at the moment I'm getting up at 3am 4am to catch a game",
    "425": "#Charlotte #Hornets: A fierceness that never lets up.  — ##MIP... \n \nhttps://t.co/z5vw6kKGTw\n \n#Basketball #CharlotteHornets #NationalBasketballAssociation #NBA #NBAEasternConference #NBAEasternConferenceSoutheastDivision #NorthCarolina https://t.co/vRO1wM1OWk",
    "426": "Maillot Charlotte Hornets de LaMelo Ball #2 Blanc Association 75 Anniversaire https://t.co/r31lAahaei",
    "427": "Maillot Charlotte Hornets de LaMelo Ball #2 Vert Icon 75 Anniversaire https://t.co/tKL0bejfF1",
    "428": "Maillot Charlotte Hornets de LaMelo Ball #2 City Edition 75 Anniversaire https://t.co/6Imp4sTUuO",
    "429": "LaMelo Ball Charlotte Hornets Rookie Of The Year Bobblehead https://t.co/spO8xxOFBz eBay https://t.co/O0H8yrORiq",
    "430": "@LegionHoops Charlotte Hornets/Timber wolves",
    "431": "@NCTony @cannonshell @TheNBACentral @hornets @MilesBridges @FKNTORO @1EntreProNegro @BarresiFilippo4 @rodboone @CHARLOTTEMAN3 @HornetsBeardGuy Tell ‘em Tony.",
    "432": "You know the @hornets are the most hated team in the league. @Devonte4Graham should’ve been MIP a few seasons back. https://t.co/Zxm8AwPmw0",
    "433": "@NCTony @TheNBACentral @hornets @MilesBridges @FKNTORO @1EntreProNegro @BarresiFilippo4 @rodboone @CHARLOTTEMAN3 @HornetsBeardGuy @jsk1030 I don’t understand the parameters to this award.",
    "434": "@Mint_Pro_Serve @hornets @NikeyMunes Congrats!!",
    "435": "@NCTony @TheNBACentral @hornets @MilesBridges @FKNTORO @BarresiFilippo4 @rodboone @CHARLOTTEMAN3 @HornetsBeardGuy @jsk1030 500% it’s Miles Bridges!!! It’s not debatable! https://t.co/a460OLH44r",
    "436": "And the winner of the @hornets tickets for tomorrow's game is... @NikeyMunes \n\nShoot me a message so we can arrange ticket transfer!",
    "437": "@hornets @Barings @JCSUniversity @HornetsGive Follow back",
    "438": "@hornets @HusqvarnaUSA BEST HORNET EVER....easily",
    "439": "@OlehKosel The 5 fouls in 5:35 is the second fewest minutes played by a Pel when getting 5+ fouls. Ajinca had a game in 2014 when he had 5 fouls in 5:02 vs. @hornets \n\nIt is the fewest minutes by a starter w/ 5+ fouls.",
    "440": "Yesterday we partnered with @Barings to provide technology improvements at @JCSUniversity that includes the installation of a 12-bay self-service laptop kiosk, which will allow students to checkout laptops or tablets at their convenience using their student ID card.\n\n#AllFly https://t.co/jsJ0gJHFdo",
    "441": "🏀 Washington Wizards (@WashWizards) #DCAboveAll\n🆚 Charlotte Hornets #AllFly #WASvsCHA\n✈️ N666DN | DAL8945 | B752\n🛫 IAD - 2:54 pm ET\n🛬 CLT - 3:52 pm ET\n📡 Tracking: https://t.co/eiOGvvpOHI https://t.co/ATB3F2FujD",
    "442": "2020-21 Panini Origins Charlotte Hornets Lamelo Ball Rookie #73 RC - https://t.co/hnhEtRKkcR\n\n#lebron #lebronjames #lakers #nba \nhttps://t.co/Crts27UhWX",
    "443": "@FKNTORO @HornetsBeardGuy @spectrumcenter @NCTony @CHARLOTTEMAN3 @sugamama316 @jsk1030 @themiller46 @EricBerman72 @ShawnMichaels @hornets I love it!! East Los is one of my favorite places ever! I have so many homies from there and many went to Dominguez with me when they moved to Compton! Belvedere Gardens🔥🔥🔥🔥 https://t.co/mBje1WbDE3",
    "444": "The NBA fined three players a total of $50,000 on Saturday for their roles in Thursday night's on-court altercation between the Orlando Magic and host Charlotte Hornets. https://t.co/pvwuorGO1U",
    "445": "Does anyone want to be apart of a Atlanta Braves, Carolina Hurricanes or Charlotte Hornets group chat? I might make a group chat for each of those teams soon",
    "446": ".@OrlandoMagic's @admiralelite15, @rolopez42, and @hornets' @MONSTATREZZ fined for on-court altercation\nhttps://t.co/MgMQacZnZ0",
    "447": "@1EntreProNegro @HornetsBeardGuy @spectrumcenter @NCTony @CHARLOTTEMAN3 @sugamama316 @jsk1030 @themiller46 @EricBerman72 @ShawnMichaels @hornets Didn’t know you were from Compton homie!!!! Welcome!!! I’m from East Los!!! ( or West Montebello like we used to say when we want to be fancier) 😂 😂 😂",
    "448": "@HornetsBeardGuy @jsk1030 @sugamama316 @FKNTORO @spectrumcenter @NCTony @CHARLOTTEMAN3 @themiller46 @EricBerman72 @ShawnMichaels @hornets I could have easily pulled up to the Spectrum in this but I kept it classy CLT is my home now even though I’m an Angeleno for life! https://t.co/YM7wPGMm8M",
    "449": "/r/CharlotteHornets: [Dammarell] Giannis Antetokounmpo, Khris Middleton, Brook Lopez and Bobby Portis are all doubtful for tomorrow’s game between the #Cavs and the Bucks. #AllFly https://t.co/WKhIX5cGNf",
    "450": "/r/CharlotteHornets: We all need to be Pacers fans tomorrow #AllFly https://t.co/alrAQ4kpVt",
    "451": "2020-21 Panini Recon LAMELO BALL Rookie Card #102 RC Charlotte Hornets - https://t.co/OKtDXOLZkK\n\n#lebron #lebronjames #lakers #nba \nhttps://t.co/LY5ubZzYi9",
    "452": "P.J. Tucker Pays Tribute To Michael Jordan When Heat Played the Charlotte Hornets https://t.co/29DX16GWZk via @yardbarker",
    "453": "@SamFarberLive @dianabiffl @hornets When is announcer appreciation day???",
    "454": "Don't forget to check out today's Hornets Hive Cast.\n\n@dianabiffl and I break down last night's huge @hornets victory and give you a preview of fan appreciation day on Sunday!\n\nhttps://t.co/OqDLGfQBZi",
    "455": "Explained to kid 2 that the Jazz used to be in New Orleans but are now in Utah and the Hornets left Charlotte for New Orleans but kept the name till the Bobcats traded their name back and became the Hornets again and New Orleans became the Pelicans and Utah messed up in the 1980s",
    "456": "@HornetsBeardGuy @1EntreProNegro @FKNTORO @spectrumcenter @NCTony @CHARLOTTEMAN3 @jsk1030 @themiller46 @EricBerman72 @ShawnMichaels @hornets @AhmadMonk I can say I’m honestly happy for Malik, bcuz he’s getting well deserved playing time, and he’s doing really well this season",
    "457": "@sugamama316 @1EntreProNegro @FKNTORO @spectrumcenter @NCTony @CHARLOTTEMAN3 @jsk1030 @themiller46 @EricBerman72 @ShawnMichaels @hornets Lakers have @AhmadMonk though!!",
    "458": "@jsk1030 @1EntreProNegro @HornetsBeardGuy @FKNTORO @spectrumcenter @NCTony @CHARLOTTEMAN3 @themiller46 @EricBerman72 @ShawnMichaels @hornets And they can’t get him lol, even the Lakers fan in me wants Lamelo stay right here",
    "459": "@jsk1030 @1EntreProNegro @sugamama316 @FKNTORO @spectrumcenter @NCTony @CHARLOTTEMAN3 @themiller46 @EricBerman72 @ShawnMichaels @hornets I’m all the way out of this one.",
    "460": "@1EntreProNegro @HornetsBeardGuy @sugamama316 @FKNTORO @spectrumcenter @NCTony @CHARLOTTEMAN3 @themiller46 @EricBerman72 @ShawnMichaels @hornets They don’t have Lamelo though….",
    "461": "@HornetsBeardGuy @1EntreProNegro @FKNTORO @spectrumcenter @NCTony @CHARLOTTEMAN3 @jsk1030 @themiller46 @EricBerman72 @ShawnMichaels @hornets First time in history that the Hornets are better than the Lakers , idk how to feel about that 😩😩😩😩😂😂😂",
    "462": "@HornetsBeardGuy @sugamama316 @FKNTORO @spectrumcenter @NCTony @CHARLOTTEMAN3 @jsk1030 @themiller46 @EricBerman72 @ShawnMichaels @hornets Lakers got 17 rings my boy you’re on our feed!! 🤣🤣🤣🤣",
    "463": "@sugamama316 @1EntreProNegro @FKNTORO @spectrumcenter @NCTony @CHARLOTTEMAN3 @jsk1030 @themiller46 @EricBerman72 @ShawnMichaels @hornets Alright, take this Lakers convo off my feed now 🤣😂🤣",
    "464": "@1EntreProNegro @HornetsBeardGuy @FKNTORO @spectrumcenter @NCTony @CHARLOTTEMAN3 @jsk1030 @themiller46 @EricBerman72 @ShawnMichaels @hornets Lmao, that’s something I’d definitely do 😂😂😎",
    "465": "@a_duckett I would  love to see Westbrook  with the  Charlotte Hornets.  But that's just my opinion.",
    "466": "@sugamama316 @HornetsBeardGuy @FKNTORO @spectrumcenter @NCTony @CHARLOTTEMAN3 @jsk1030 @themiller46 @EricBerman72 @ShawnMichaels @hornets lol easily done unfortunately LA is fair weather fans Chargers home games are. Road games!! I literally walked through my neighborhood today in my dodgers jacket and stopped  and let all the braves fans with braves yard flags know we have Freddie Freeman now!! 🥴🤣",
    "467": "@1EntreProNegro @HornetsBeardGuy @FKNTORO @spectrumcenter @NCTony @CHARLOTTEMAN3 @jsk1030 @themiller46 @EricBerman72 @ShawnMichaels @hornets I did wear a Hornets jacket to the Staples center in November 😂😂😂 definitely no conflict for baseball lol, although there’s a lot of Braves fans here😩 I’m a Yankees fan. I’m a New Yorker loving life in Charlotte ☺️",
    "468": "@sugamama316 @HornetsBeardGuy @FKNTORO @spectrumcenter @NCTony @CHARLOTTEMAN3 @jsk1030 @themiller46 @EricBerman72 @ShawnMichaels @hornets lol salute! I figured since I have both the Lakers logo and dodgers logo tattooed on me I could just come neutral but I respect you rocking the purple and gold I’ll always be an #Angeleno even living in CLT! At least I’m not conflicted routing for the dodgers no baseball here!",
    "469": "How to watch Washington Wizards vs. Charlotte Hornets https://t.co/zPmGsTzG8i",
    "470": "@1EntreProNegro @HornetsBeardGuy @FKNTORO @spectrumcenter @NCTony @CHARLOTTEMAN3 @jsk1030 @themiller46 @EricBerman72 @ShawnMichaels @hornets You’re better than I am, I wear my Lakers gear when they come here, BUT I root for both teams 😂😂😂😂🤦🏻‍♀️",
    "471": "@HornetsPR @hornets INJURY UPDATE: \n@hornets\n Gordon Hayward (injury-prone is officially ruled out until his contact expire) #AllFly",
    "472": "@1EntreProNegro @FKNTORO @spectrumcenter @NCTony @CHARLOTTEMAN3 @sugamama316 @jsk1030 @themiller46 @EricBerman72 @ShawnMichaels @hornets You’re one of us now bro! No turning back!",
    "473": "@HornetsBeardGuy @FKNTORO @spectrumcenter @NCTony @CHARLOTTEMAN3 @sugamama316 @jsk1030 @themiller46 @EricBerman72 @ShawnMichaels @hornets I haven’t been in the trenches like y’all I was sleep in Compton but I’m here now screaming #LFGHornets I didn’t even wear Lakers gear when they came here and  my family has had lakers season tickets since magic and worthy at the forum too! 😂😂 https://t.co/8RpwEN5RfJ",
    "474": "Who would win: the Charlotte Hornets with Bradley Beal or the Dallas Mavericks with Carmelo Anthony? #AllFly #MFFL https://t.co/BG13Yr9ZY7",
    "475": "trade scenario 🚨🚨🚨🚨🚨\n3 way trade \n@Lakers : hield , brogdon , oubre jr \n@hornets : westbrook \n@Pacers : hayward , THT and a 1st LA \n\nwho says no ?",
    "476": "@nsanalytic @Sacrame34348053 @overtime @MELOD1P @hornets Exactly",
    "477": "@hornetsreports @HornetsPR @hornets dude is soft af",
    "478": "@dayvawn24 @burpingcummies No they became charlotte on their own, Pelicans were Hornets and rebranded",
    "479": "Gordon Hayward has played 93 games in his two seasons as a Charlotte Hornet. He’s missed 40% of his games and has never played 50 games in a season with Charlotte. 60 million in those two seasons\n\nCharlotte will be a much better franchise without his services this summer. https://t.co/fGT5irdLbq",
    "480": "I just noticed my hair is giving Charlotte Hornets 💀",
    "481": "@Comron_ @Dan_Savage @OrlandoMagic @hornets Had the same thought. That’s a rough fine for him.",
    "482": "@hornetsreports @HornetsPR @hornets Keeping him healthy for a trade",
    "483": "@HornetsPR @hornets Will he be back for the Play-In?",
    "484": "@HornetsPR @hornets Foot soreness my ass",
    "485": "INJURY UPDATE: @hornets vs. WAS 4/10\nGordon Hayward (L Foot Soreness) is out\n\n#AllFly",
    "486": "@Dan_Savage @OrlandoMagic @hornets Normally I don’t feel bad when players get these fines due to their salaries but I do feel pain for Schofield 😩",
    "487": "@HornetsBeardGuy @1EntreProNegro @spectrumcenter @NCTony @CHARLOTTEMAN3 @sugamama316 @jsk1030 @themiller46 @EricBerman72 @ShawnMichaels @hornets Yesssssssir!",
    "488": "@FKNTORO @1EntreProNegro @spectrumcenter @NCTony @CHARLOTTEMAN3 @sugamama316 @jsk1030 @themiller46 @EricBerman72 @ShawnMichaels @hornets I’ve been in the trenches since day 1!",
    "489": "@1EntreProNegro @HornetsBeardGuy @spectrumcenter @NCTony @CHARLOTTEMAN3 @sugamama316 @jsk1030 @themiller46 @EricBerman72 @ShawnMichaels 😂 😂 😂 Riding with this team until we make the finals!!! We’re getting that f***ing ring FAM!!! Or we’ll go down swinging trying to get that 🏆 #RideOrDie with the homies!!! @hornets https://t.co/X1TnF3U2ZB",
    "490": "Check out LaMelo! 2020-21 Panini Mosaic LaMelo Ball National Pride #257 Orange Reactive Prizm  https://t.co/9MGPRAD7gQ\n#lameloball #Hornets #charlottehornets #basketballcards #paninimosaic #whodoyoucollect @collectorfix",
    "491": "Rooting for @MELOD1P and @hornets on Sunday. There are 4 outcome combos that get them in the 7-8 game (1) Nets/Cavs/Hawks all lose, (2) Cavs win, Nets/Hawks lose (3) Nets win, Cavs/Hawks lose and (4) Cavs/Hawks win, Nets lose. According to Win Probability stats from @ringer 1/3",
    "492": "\"I'm rare\" 2 Chainz \n\n@MELOD1P @hornets \n@PUMAHoops @PUMA \n@nicekicks https://t.co/VoqPe3IuPh",
    "493": "A fierceness that never lets up. 😤 \n\n@MilesBridges x #MIP https://t.co/WfVru6Hcqi"
}