{
    "0": "The final 2 quarters in Sacramento plus the first 2 in Dallas tonight: #Knicks outscored #Kings/#Mavs 144-86. They shot 59.5% from the field and 46.3% from Three",
    "1": "Tonight's Starting Lineup powered by @Verizon ⤵️\n\n👑 @swipathefox \n👑 @JustHolla7 \n👑 @hbarnes \n👑 @TreyLyles \n👑 @alexlen https://t.co/I72ARfFclB",
    "2": "Minutes for Neemy please 🙏\n@SacramentoKings",
    "3": "what were the kings doing with bagley in Sacramento",
    "4": "@KnicksKnest @AltMobile1 @SacramentoKings I am speaking as a third party here.  Your thinking that it is okay for your guy to do it, but not others, is flawed at best.  Try to see past your personal bias and be more objective in your reasoning—otherwise, you aren’t bringing any value to the conversation.",
    "5": "Worst run franchises in every sport\nNBA: Sacramento Kings\nNHL: Buffalo Sabres\nMLB: Colorado Rockies\nNFL: Houston Texans",
    "6": "Ready for @SacramentoKings basketball!!! #SacramentoProud https://t.co/i1trG1lRHY",
    "7": "Let’s go @SacramentoKings  💜💜💜💜 yeeeeeeeeee @Dsabonis11 https://t.co/JPyWC6ZgPb",
    "8": "@James_HamNBA @SacramentoKings Happy to see Len getting the start",
    "9": "@FCartoscelli3 Official statement:  For the first time the Sacramento Kings are playing for a good draft position!!",
    "10": "@statmuse Sacramento Kings. No one respect this organization.",
    "11": "@James_HamNBA @SacramentoKings Why do we keep starting holiday?",
    "12": "Starters for @SacramentoKings vs. Denver Nuggets - 3/9:\n\nG - De’Aaron Fox \nG - Justin Holiday  \nF - Harrison Barnes \nF - Trey Lyles \nC - Alex Len",
    "13": "Sacramento Kings Starting Lineup 3/9\n PG: De'Aaron Fox\n SG: Justin Holiday\n SF: Harrison Barnes\n PF: Trey Lyles\n C: Alex Len\nhttps://t.co/o75oZ8vnE8",
    "14": "Tonight's starting lineup for the Sacramento Kings: Fox, Holiday, Barnes, Lyles, Len https://t.co/bVWH4AMCA2",
    "15": "Starters for @SacramentoKings vs. Denver Nuggets - 3/9:\n\nG - De’Aaron Fox \nG - Justin Holiday  \nF - Harrison Barnes \nF - Trey Lyles \nC - Alex Len",
    "16": "Uniforms for Denver Nuggets vs Sacramento Kings at 7:00 PM. \n\n#MileHighBasketball #SacramentoProud https://t.co/AV7HyDYLrg",
    "17": "Earlier this week NBA team @SacramentoKings held a \"Sikh American Heritage Night\" during a game.\n\nHundreds of Sikhs from across California attended the event, which included a performance from Sikh musician @raaginder and an educational exhibition on Sikh American history. https://t.co/f4NTYqoPwL",
    "18": "@SacramentoKings @ChrisDuerr Players reacting like this to officials is a large part of why sports are experiencing an officials shortage that is quickly turning into a crisis. If you want to confront and bump an official, deal with the consequences.",
    "19": "@gilbertgacilan @kayte_c @SacramentoKings Thank you so much for the offer but I think I'm going to stay home today. Hope all is well with you &amp; the fam.",
    "20": "@SacramentoKings W organization the nbas got an agenda fr",
    "21": "Nuggets and Kings meet tonight! Get your right pick from @RightSideVP \n\n🏀 #MileHighBasketball vs. #Sacramento Proud\n\nFull Pick &amp; Analysis: https://t.co/td4RddUFtE 📺👈\n\n#BMRPicks #NBATwitter https://t.co/kUoaGMXNfC",
    "22": "Sacramento Kings +6.5",
    "23": "Sacramento Kings https://t.co/yyE7cc6hWY",
    "24": "Sacramento Kings owner Vivek Ranadive reported to have bid for Chelsea.\n\nThat franchise is an embarrassment and Vivek has directly impacted that.\n\nHope it goes through 😄\n\n@touchlinefracas \n@courtsidefracas https://t.co/OVmQe0RoML",
    "25": "Today's NBA Picks: 10:10 PM ET - Denver Nuggets vs. Sacramento Kings - 20 PICKS AVAILABLE: https://t.co/kXNssB3l3Z #nba",
    "26": "#RipCity and @tcbbiggs Here are today's Blazers Draft Stock Matchups\n\nLakers over Rockets in Houston\nMagic over Pelicans in NO\nKnicks over Mavericks in Dallas\nSpurs over Raptors in San Antonio\nKings over Nuggets in Sacramento\n\nSorry it is late today!",
    "27": "@doge_tino @kayte_c @SacramentoKings Her college coach #ucsb",
    "28": "@SacramentoKings I miss @TyHaliburton22 ☹️",
    "29": "@kayte_c @SacramentoKings would be super lit to get a couple tix right this second, i would take my mom, disabled but never been to g1c",
    "30": "“We disagree with the NBA’s decision to suspend Domantas Sabonis”: Sacramento Kings defend their Lithuanian big man by Tweeting their dissent https://t.co/G6Efwfdkgy",
    "31": "@SacramentoKings @socios I did an entire prezi on why Lebron is the GOAT",
    "32": "@SacramentoKings A lot of us had high school graduations at Arco which is pretty awesome #ArcoFarewell",
    "33": "@NBA Y’all suck! The refs always have it in for the @SacramentoKings. Missing huge calls and then calling ticky tacky fouls on us! Refs you suck! @Dsabonis11 should not be suspended! Your refs should! Get some glasses 👓",
    "34": "@SacramentoKings @socios Why isn’t metu one of the options smh",
    "35": "Side-note: stay away @HoustonRockets @SacramentoKings",
    "36": "@mahreeahn2net @kayte_c @SacramentoKings I have two tickets I can send you if you’d like! If you want them, send me your email. 👍🏽",
    "37": "@DiogoLi44504715 @SacramentoKings @socios It is a good comparison younger generation never saw Jordan play or have any idea  what is to play back then. Let me ask you do you think if LeBron started his career in the 80s he'd be playing as long as he has , the answer is a hard no.",
    "38": "@gilbertgacilan @kayte_c @SacramentoKings No, but that’s ok",
    "39": "The NBA suspended Sacramento Kings star Domantas Sabonis one game without pay Wednesday for aggressively confronting and making contact with a game official. https://t.co/9rJtSzHxBD",
    "40": "The Sacramento kings do not exist, they are a myth",
    "41": "@kayte_c @SacramentoKings Haven’t been to game since they moved out of Arco. Would love to see the Kings with my better half!!",
    "42": "@SacramentoKings @socios None of the three, Larry Bird &amp; Magic Johnson all the way. Those two alone saved the corrupt NBA along with Commissioner Larry O’Brien. Those three players you listed wouldn’t have the nba to play in without Larry O’Brien, Bird &amp; Magic.",
    "43": "An updated #DraftKings #NBA Cheat Sheet has been posted for today! Check the updated sheet out ASAP, the next game is tipping off in about 1 hour! Alex Len is starting tonight for the Sacramento Kings, not Damian Jones!\n\nhttps://t.co/kpdtvLM0Tw",
    "44": "@_Talkin_NBA @SacramentoKings yeah that’s a horse shit call",
    "45": "@redrock_bball The @SacramentoKings are just a mess, the front office, the coaching staff, just tear it all down and hire fantasy basketball GM’s because we’d all do a better job",
    "46": "@kayte_c @SacramentoKings Would love them! Could really use something to cheer me up!",
    "47": "@kayte_c @SacramentoKings On a date need something fun to do! Pick love Katie pick love!",
    "48": "Hanging out in Sacramento this week (extremely underrated area btw). \n\nDo I stay in and watch the Jazz? \nOr go out and catch the Kings-Nuggets game? Tickets aren't bad.",
    "49": "@SacFilmRoom Fox doesn’t make the kings better. He was given a bad contract hence the only reason he’s still in Sacramento.",
    "50": "Bones Hyland and Will Barton are out against the Sacramento Kings.",
    "51": "@mahreeahn2net @kayte_c @SacramentoKings Were you able to get tickets, Marie!?",
    "52": "@SacramentoKings DJones classic 👌🏽",
    "53": "@nbatopshot One of my favorite Sacramento Kings players. Love seeing him back in action.",
    "54": "NBA Basketball Game Betting Picks Simulator: 10:10 PM ET - Denver Nuggets vs. Sacramento Kings - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/N5AOjSuchU #nba #sportsbetting #freepicks #cappertek",
    "55": "@SacramentoKings @MichelobULTRA Davion 💦",
    "56": "Tonight is a legit test for the Knicks. The Clippers were undermanned, the Kings are just under, can we beat a playoff bound Mavericks team. Sacramento Randle will be needed again. #NewYorkForever #Knicks",
    "57": "TONIGHT on DENVER'S ONLY HOME FOR #NUGGETS @NBA BASKETBALL: @Nuggets vs @SacramentoKings\n\n7:30 PM: @PointsbetUSA Pregame\n8 PM: Tip with Koz\n10:30 PM: #InThePaint w/ @JoshuaDover\n\n#MileHighBasketball   #SacramentoProud https://t.co/0NLRRlsyTw",
    "58": "@JessieJDickson @SacramentoKings @NBAOfficial Pathetic!!",
    "59": "@kayte_c @SacramentoKings hello me!",
    "60": "@SacramentoKings @CoorsLight How many people he scam in that time span?",
    "61": "suns out, shorts out.   \n  \n@MichelobULTRA | #ULTRADrip #JOYWINS https://t.co/YXo3vW4R3b",
    "62": "@exilen84 @SacramentoKings @socios That's not a good comparison... Even not fair because you had some players playing over 40. He simply didn't care and created a brand to him. LeBron is an excellent all around... Michael was the only one at the time that stand and he had the perfect team to play for him in bulls",
    "63": "@suuuuuummm1 @SacramentoKings I DON'T KNOW HOW MANY GAMES THEY'VE HAD THAT \"DAY AFTER\" REPORT SAYING THE REFS FUCKED UP.\n\nDOESN'T MATTER TO THE NBA BECAUSE WE'RE SAC KINGS FANS AND HAVE BECOME THE GO-TO MEME FRANCHISE, BUT SOMETHING ISN'T RIGHT THIS YEAR.\n\nFOX &amp; SABONIS WILL HAVE FRESH START NEXT SEASON.",
    "64": "@kayte_c @SacramentoKings Please 🙏🏼😬",
    "65": "@Gorilla_Rob @kayte_c @SacramentoKings Give em to Robin!",
    "66": "2 hours til tip-off\n\n@SacramentoKings you ready?? 🥱",
    "67": "Sacramento Kings' Domantas Sabonis Suspended 1 Game For Making Contact With Ref https://t.co/VUtXWU9JgM https://t.co/SmbkTKBRhS",
    "68": "@kayte_c @SacramentoKings Just kidding, got a flat tire 😭",
    "69": "Consensus Line Move:\n2022-03-09 Denver Nuggets at Sacramento Kings from 238.50 to 239.50\nOver blast away\n#NBA #sportsbetting #data #entrepreneurship",
    "70": "@kayte_c @SacramentoKings Me tf",
    "71": "@kayte_c @SacramentoKings I got two more to add. Lol",
    "72": "@kayte_c @SacramentoKings Me me me",
    "73": "@kayte_c @not_petar @SacramentoKings Who’s coach French 🤔",
    "74": "@MarkJonesESPN @SacramentoKings In your opinion Mark, and you commentated on hundreds, if not thousands of games for sure, do you think there are some bias calls/patterns of officiating against the kings?",
    "75": "@SacramentoKings @MattGeorgeSAC Dammed Right 🙏",
    "76": "@SacramentoKings @socios This  an age demographic. Folks under 30 35 are gonna say LeBron. Almost all folks over 35 will say Jordan. I'm over 35 and said Jordan because let's be honest LeBron career would never been prolonged as it is if he started his career in the early 80s.",
    "77": "📍 Bet #007 - 🏀 NBA 🏀\n\n🎮 Sacramento Kings - Denver Nuggets\n\n🎯 Fox 20P &amp; Nuggets  @1,66\n🏧 20% (20€)\n📚 Unibet",
    "78": "@mumugobbi @BSWest5 @TrevorWrites @SacramentoKings @socios Kobes a top 10 NBA player all time, but hw doesn't have a case to be the GOAT\n\nSo no disrespect to Kobe but the above people are right",
    "79": "@SacramentoKings @socios Kobe has 0 case for being the GOAT lol",
    "80": "@kayte_c @SacramentoKings Would love to take my wife to tonight’s game! It would be a great and much needed date night! 👑💜",
    "81": "@SacramentoKings @socios Those who pick Jordan and Kobe is cry baby. We all know Lebron is the goat.",
    "82": "@SacramentoKings @socios Let’s go queta!!!",
    "83": "@Kings_Insight @SacramentoKings @socios K, but he is",
    "84": "@SacramentoKings @socios Fox got two votes?",
    "85": "@kayte_c @SacramentoKings Pleaseee Kayte",
    "86": "@SacramentoKings @socios It's Jordan",
    "87": "@SacramentoKings @socios Even your polls suck.",
    "88": "@SacramentoKings @socios Metu lmfao.",
    "89": "@SacramentoKings @socios Harkless…hahaha wtf",
    "90": "@edreyheras @Darko251989 @SacramentoKings That's what I thought. I would have understood a fine. That's understandable. But for Randle to forcefully move the ref and Domas to brush against him but Domas gets punished worse than Randle makes no sense. Especially given the fact Randle has prior instances and Domas doesn't",
    "91": "@Kings_Insight @SacramentoKings @socios Still isn’t the goat tho 😭",
    "92": "@TrevorWrites @SacramentoKings @socios Word",
    "93": "Sacramento Kings center Domantas Sabonis has been suspended one game without pay for what the NBA says was aggressively confronting and making contact with an official who called him for a technical foul. https://t.co/mrfqwWrBKP",
    "94": "@itstheshorts @stanmonfort1 @thewiserwon @SacramentoKings I’d love to see different angle. Feels like ref was leaning in to help make “contact” or slowed down as Domas was walking toward. Either way, didn’t look like Domas was trying to make contact, then made minimal contact, and plenty of examples of ref “contact” w/o suspension.",
    "95": "@BSWest5 @SacramentoKings @socios Relatable if you ask me. As long as we all agree that Metu's worst take, ever, in his life.",
    "96": "Kings star Domantas Sabonis suspended by NBA for bumping referee  https://t.co/iFVnVL4EBN #NBA #SacramentoKings",
    "97": "@BSWest5 @SacramentoKings @socios Neither of these lists has Harrison Barnes’ name on it because Steph wasn’t an option.",
    "98": "@SacramentoKings y'all can i have a fb lmao",
    "99": "@kayte_c @SacramentoKings Ill take my kid! 🙏🏾❤️",
    "100": "@SacramentoKings @socios Fox cheating lol",
    "101": "@SacramentoKings @socios It should’ve been, MJ vs Lebron vs Kareem. Kobe ain’t top 5",
    "102": "@SacramentoKings @socios Metu with the best take",
    "103": "@sarinibanini @SacramentoKings @NBAOfficial The refs had a guy who admitted betting on games and nothing happened. The refs are Teflon",
    "104": "@SacramentoKings @socios Kobe isn't even close to Lebron or Jordan, not even top10",
    "105": "@SacramentoKings @socios Fox couldn't decide?",
    "106": "@SacramentoKings @socios Metu trying to be different",
    "107": "@SacramentoKings @socios Metu once again, with the best takes",
    "108": "Who's the 🐐? We asked our guys to find out what they think 👀     \n\n@socios 📊🏀",
    "109": "sacramento kings https://t.co/ARC5ftNU9s",
    "110": "@KnicksKnest @AltMobile1 @SacramentoKings Haha. “Attack”. 🤣",
    "111": "@PasionBasketNBA Sacramento Kings.",
    "112": "@_Talkin_NBA @SacramentoKings Now do the CP3 and Randle clips for comparison.",
    "113": "@SacramentoKings It's cool he'd probably get suspended after punching Jokic in the face Tonight if he was playing. Fuck Jokic",
    "114": "@PatrickKilken55 @SacramentoKings Clean!! 🔥",
    "115": "Each participant will receive an exclusive event t-shirt and water bottle. Plus, get 40% off with code INSIDER\n\nRegister here ⤵️ https://t.co/IQ0tx9XGzA",
    "116": "@kayte_c @SacramentoKings Send em",
    "117": "@spaghetti916 @Darko251989 @SacramentoKings Sabonis at worst deserved a small fine, like maybe 1/5 of randle. The only thing Sabonis did that the others didn’t do is went and got in the refs face but the contact was nothing. Randle intentionally moved the ref with force. No cp3 got nothing but a second T",
    "118": "@edreyheras @Darko251989 @SacramentoKings Ah. Ok. That's my bad. That's just another case of the refs being moronic. 🤣 \nThat's similar to Sabonis too though. CP3 didn't get a fine though. Right?",
    "119": "@kayte_c @SacramentoKings Yo I could use some tickets",
    "120": "@not_petar @SacramentoKings They’re yours!!! Check your DM for instructions!",
    "121": "@kayte_c @SacramentoKings I got my boogie jersey ready to go! Hook it up for me and my wife, finally a chance to get away from the kids for an evening :)",
    "122": "@kayte_c @SacramentoKings Cmon pick me",
    "123": "@kayte_c @SacramentoKings Please Trying to take my little bro. And plus I get to see boogie again.",
    "124": "@gangsterkim50 @kayte_c @SacramentoKings @blaxicanboy18 You’re welcome 😊 Hopefully she still has them and see’s the message.",
    "125": "NBA COLLAB W / @LeoPickz. Follow the legend for daily winners! \n\n🏀Sacramento Kings under 117.5 teamtotal \n\n-133 @ Coolbet (2u)\n\nLIKE IF TAILING https://t.co/HQ7TrFnc3C",
    "126": "@kayte_c @SacramentoKings I would love to take my grandson!",
    "127": "@sarinibanini @SacramentoKings @NBAOfficial The refs do get punished. They just don’t announce it. That’s all. They should. But they don’t.",
    "128": "@JeriTsaiNets @_Talkin_NBA @SacramentoKings CP knew what he was doing, too. This is the kinda stuff that makes it hard to disassociate “petty” with this man.",
    "129": "@kayte_c @SacramentoKings My daughter and I will go! Coach French says hi!",
    "130": "@kayte_c @SacramentoKings Pass",
    "131": "@spaghetti916 @Darko251989 @SacramentoKings He did not ever extend his arm, he walked into him while at the same time the ref turned into him. Knowing Paul he probably wanted it since he knew he was done with his hand being broken but he never ever pushed",
    "132": "@kayte_c @SacramentoKings Last time I won tickets nobody ever contacted me soooo I feel like this would make up for that 😂",
    "133": ".@SacramentoKings' @Dsabonis11 suspended 1 game for incident with official\nhttps://t.co/NpzsJMenIl",
    "134": "Sacramento Kings VS  Denver Nuggets\n\n50/1 bet builder ☘️ https://t.co/mLU9I1Xd11",
    "135": "@_petethetrainer @kayte_c @SacramentoKings @blaxicanboy18 Thank you, Pete!",
    "136": "The NBA has suspended Sacramento Kings center Domantas Sabonis one game without pay for aggressively confronting and making contact with an official who called him for a technical foul. https://t.co/48D5pL01YG",
    "137": "@kayte_c @SacramentoKings You are my favorite kings commentator!! Would be dope if I can get my wife to her first game!",
    "138": "@hooksjohnston That’s definitely what the kings do. They’re always fast to fix a situation instead of developing overtime and waiting for things to go well. I don’t really see Dear in Fox getting better than he is honestly at least with Sacramento",
    "139": "@kayte_c @SacramentoKings @rossmcculligan does",
    "140": "@PasionBasketNBA Los Sacramento Kings",
    "141": "@kayte_c @SacramentoKings Me plz!",
    "142": "@kayte_c @SacramentoKings i'm at school right now 😂 please 🙏",
    "143": "@gangsterkim50 @kayte_c @SacramentoKings @blaxicanboy18 Kayte my friend, I nominate Kim and her guy 💜🙏",
    "144": "@kayte_c @SacramentoKings Please and Thank you",
    "145": "@kayte_c @SacramentoKings @kayte_c  let fiancée and I are getting married the 17th!! Maybe an early wedding gift? Ahaha",
    "146": "@kayte_c @SacramentoKings Please! Kayte, @blaxicanboy18 and I haven't had a date night since our daughter was born 6 months ago! Please pick us!! 🙏🙏🙏",
    "147": "@statmuse The kings are a joke as an organization. That’s coming from someone in Sacramento. They are tough to root for",
    "148": "@kayte_c @SacramentoKings I do! Let's goooooo!",
    "149": "@kayte_c @SacramentoKings Right here kay C! 🙏🏼",
    "150": "@kayte_c @SacramentoKings I would love to go kayte!!!!",
    "151": "@kayte_c @SacramentoKings #Sacramentoproud I would love to see a game",
    "152": "@kayte_c @SacramentoKings Would love to take my girlfriend to this game to celebrate her getting accepted into Brown this fall :)",
    "153": "@SacramentoKings @Vivek: Appeal the NBA’s decision, and have Sabonis play tonight!!! He was angry, but that was not an aggressive bump into the ref. It looked incidental, like he accidentally a brushed against the ref.",
    "154": "@kayte_c @SacramentoKings I would love to go",
    "155": "@SacramentoKings Free my man sabonis he did nothing wrong",
    "156": "Come to our Wellness Amplified event @SacramentoKings THIS SUNDAY MARCH 13 @Golden1Center 💜🙏https://t.co/yEZa2W6zvU https://t.co/vgGMH1CxfP",
    "157": "@collazo530king @SacramentoKings That u it little man Hahaa 💯",
    "158": "@SacramentoKings Can we suspend referees? @NBA? Yes, it’s a very difficult job but nonetheless they suck!",
    "159": "@BookiesAdam Hey Adam! Its Steve Large at CBS13 in Sacramento! Are you available for an interview about the Bronny James odds of the Kings drafting him in 2024? Our station loves it! My cell is 805-260-2076. Can you call or text me? We could zoom?",
    "160": "@kayte_c @SacramentoKings I want them 😢 lol",
    "161": "This is a croc of shit and the NBA knows it.. The officials always doing the @SacramentoKings dirty and did @Dsabonis11 hella dirty. Refs should be fined too for BS… #SacramentoProud https://t.co/xiwt0D1XVK",
    "162": "NBA Betting Preview: Denver Nuggets vs. Sacramento Kings - Wednesday, March 9, 2022 https://t.co/nyUHTRt9jO",
    "163": "@AustinScott_16 @kayte_c @SacramentoKings Kings fans since day 1",
    "164": "@kayte_c @SacramentoKings Hey Kayte! I’m home for spring break from school for a few more days and haven’t seen a home Kings game this year. I’d love to go and support the team before I leave on Sunday! 😀",
    "165": "@kayte_c @SacramentoKings Would love to go",
    "166": "@kayte_c @SacramentoKings I’d love to go watch some kings basketball!! Friend who moved to AZ is in town too and would love to catch up with some Kings basketball",
    "167": "@kayte_c @SacramentoKings I’ve been on Twitter all day defending Domas and the Kings. Would love to go!!!!",
    "168": "@kayte_c @SacramentoKings Haven’t been able to get tickets, bills been kicking my ass lol 😂",
    "169": "@kayte_c @SacramentoKings I wanna go! I haven’t been all season",
    "170": "Get your heart pumping with a morning of fitness and fun at @Golden1Center! We’ve partnered with local fitness studios to host Wellness Amplified, a Sacramento Kings fitness event! https://t.co/r1hWvED1SK",
    "171": "@OrionStrehlow @TheGriff_1980 @DPRockies @psaundersdp My Sacramento Kings babayyy",
    "172": "@SacramentoKings Sacramento gm should point out whenever lebron has the same contact with the refs.",
    "173": "@Dallahgocrazy @kayte_c @SacramentoKings @Za_WorksYT @kayte_c hurry I got my kings shirt ready to be flat ironed",
    "174": "@MarcosBreton @Vivek @ChelseaFC @SacramentoKings Isn't he ( Vivek) a big part of the reason we still have a team in Sacramento?",
    "175": "@MattyBforThree @SacramentoKings Yeah, on trying to tank the Kings for the draft.",
    "176": "@spaghetti916 @Darko251989 @SacramentoKings But Randle and CP don't wear a Kings uniform that's why they get by without a suspension. How about Doncic who is always throwing fits, particularly if somebody is doing better than he is. No wonder he feels free to whine and throw fits.",
    "177": "Looking for a value bet?  See if the Denver Nuggets-Sacramento Kings Predictions and Preview for 3/9/2022 is one in our preview.  No crazy hype just a prediction and preview. #Punters #Picks https://t.co/1HCHgxFctc",
    "178": "@snooks1590 @SacramentoKings Exactly there’s been multiple times AFTER the game, the nba even says “oh ya those were bad calls” yet we still get bad calls?? And even get an ejection of a star player?? But think of it, who other team is close to 10 seed (lakers) and who does nba want in playoffs??",
    "179": "SACRAMENTO KINGS https://t.co/vZykOeY8wb",
    "180": "@kayte_c @SacramentoKings Me and my daughter!!",
    "181": "@suuuuuummm1 @SacramentoKings Missed calls at the end of critical games (3) and now Sabonis is suspended for one game. I've seen worse from Doncic and a few other players recently who have not been suspended. 2002 all over again. What's going on with the refs?",
    "182": "@vegandoIan @Moises78592826 @SacramentoKings @NBA @NBAonTNT Good talk, always enjoy a bit of homophobia when I'm discussing hoops.",
    "183": "@kayte_c @SacramentoKings Pick me please Kayte🙏🏼🙏🏼🙏🏼",
    "184": "@kayte_c @SacramentoKings Down fs",
    "185": "@kayte_c @SacramentoKings It'd be a good consolation for not having a Domas city jersey in my size #SacramentoProud",
    "186": "@kayte_c @SacramentoKings Dog chewed up my couch, need something to take my mind off of it",
    "187": "@kayte_c @SacramentoKings Me and this kid! https://t.co/BHIlg5dva7",
    "188": "@SacramentoKings Should serve it on the road so fans aren’t punished that paid to see Domas",
    "189": "@kayte_c @SacramentoKings Me pwetty plsss",
    "190": "@kayte_c @SacramentoKings I’ll take them :)",
    "191": "LA Clippers (They would be the Sacramento Kings if they didn't have all that money) https://t.co/88nJllVcir",
    "192": "Sacramento Kings Predictions and Preview for 3/9/2022 hosts Denver Nuggets.  Looking for betting action?  Find out if there is any value in our preview. #Punters #Picks https://t.co/1HCHgxFctc",
    "193": "Let's goooo. Would definitely love to go support the home team. What's the rules. True Kings fan, True follower of @kayte_c True @SacramentoKings fan. Devoted, dedicated, I'll make a sign especially for you. https://t.co/Xtc7iSmgNe",
    "194": "@kayte_c @SacramentoKings I would love them!!",
    "195": "#SacramentoKings vs Denver Nuggets tonight! \n\nThe Kings are 4 point UNDERDOGS at home … no Sabonis due to 1 game suspension \n\nWho ya got winning? \n\nGo Kings! #SacramentoProud",
    "196": "@bavila_96 @kayte_c @SacramentoKings Haha I appreciate you. I’ll vouch for you next game 😂",
    "197": "@kayte_c @SacramentoKings I’m already going but @Za_WorksYT @Rdote2 want them!!",
    "198": "Congratulations to Dizzzler who moved up 1 spot to take #8 on the Sacramento Kings team leaderboard.\n\nhttps://t.co/WHnq2718B3",
    "199": "@SacramentoKings @nba Sure suspend Sabonis, whatever. But is the official who made one of the worst calls of all-time getting punished? Can you acknowledge that terrible calls by the refs affect the game negatively? Not only for the players but for the fans especially. Show some accountability.",
    "200": "@kayte_c @SacramentoKings Please kayte",
    "201": "@kayte_c @SacramentoKings What’s good Katie hook it up!!!",
    "202": "@kayte_c @SacramentoKings My girlfriend is in nursing school and we havnt been able to do much. This would be a great day on a rare night off for us!",
    "203": "@javale_mcmeme @kayte_c @SacramentoKings Once a loser always a loser lol",
    "204": "@chrisovega @kayte_c @SacramentoKings Friendship ends tonight!",
    "205": "@PhilThaFuture @kayte_c @SacramentoKings This definitely ain’t the way",
    "206": "@Sajaque916 @nineonesickness @kayte_c @SacramentoKings U must want to break up w her for her birthday lol",
    "207": "@kayte_c @SacramentoKings Give ‘em to the homeless I’m sure they’d appreciate it",
    "208": "@thecamell42 @JeriTsaiNets @_Talkin_NBA @SacramentoKings How to you feel about this one? It was only a 50k fine no suspension. https://t.co/y4SRmkhfZi",
    "209": "@kayte_c @SacramentoKings Kayte is the best damn sports announcer.",
    "210": "@kayte_c @SacramentoKings Are they still available?! Would love to come out to the game with my cousin!",
    "211": "Washington could’ve had Rodgers or Wilson and then end up with Wentz.\n\nThey like the equivalent of the Sacramento Kings and Wentz is Sabonis @pickasidepod",
    "212": "@kayte_c @SacramentoKings Yes 🙌🏽 that would be awesome",
    "213": "@kayte_c @SacramentoKings I would love to go",
    "214": "@kayte_c @SacramentoKings I would love to go, but the way my heart was broken in last games 3rd quarter I think it’s better to stay home so I can at least sulk in peace 😐",
    "215": "@kayte_c @SacramentoKings My gf has never been to a basketball game lol please let me start her off right!",
    "216": "@DrZamalek @SacramentoKings Randle violently shoved an official and only got a fine",
    "217": "@statmuse Sacramento kings",
    "218": "@kayte_c @SacramentoKings Lets go me and the boys can go @kayte_c !!!",
    "219": "@kayte_c @SacramentoKings Would love to go to my first kings game as a Welcome to Sacramento just moved 😆",
    "220": "@kayte_c @SacramentoKings Yes please really like to take my girlfriend for and early birthday gift 💝",
    "221": "@kayte_c @SacramentoKings Please Kayte",
    "222": "@kayte_c @SacramentoKings @kayte_c my birthday is next Thursday! any tickets available next week!? 😬",
    "223": "@patmagroin916 @kayte_c @SacramentoKings He deserves them",
    "224": "@kayte_c @SacramentoKings Back in town from Long Beach! I got my fox jersey with me ready to go!",
    "225": "Why would @SacramentoKings players care about the rest of the season when their owner is more concerned about buying @premierleague @ChelseaFC than fixing his @NBA team? If the man at the top is distracted, everyone is distracted! 16 losing seasons, but who's counting?\n#helpus https://t.co/2iFsxSkkqg",
    "226": "\"Sacramento Kings Capitalize contest trims down to eight startups\" https://t.co/84CL3cnWxQ #sacramento #financial #business",
    "227": "@kayte_c @SacramentoKings Will trade the finest Lodi Wine for the tickets 🤣",
    "228": "@PasionBasketNBA Sacramento King sin duda 😂😂😂😂",
    "229": "@kayte_c @SacramentoKings Would love to take my daughter!",
    "230": "@kayte_c @SacramentoKings One time 🙏🏻",
    "231": "@kayte_c @SacramentoKings Would love to see the kings finally get a Victory tonight yes go kings",
    "232": "@kayte_c @SacramentoKings I would love to take my daughter! 👏",
    "233": "@kayte_c @SacramentoKings I’d love to take my 6 year old daughter to the game.  She’s starting to become a fan and her birthday is next week.",
    "234": "@SacramentoKings Well since our\nCenter is out for 1gm suspension,\nWhip up another Loss  for Sacto Kings tonight,prove me wrong Kings.xx",
    "235": "@kayte_c @SacramentoKings I’m going on vacation to Maui for 10 days tomorrow. The Kings game would be a good start to it by getting hammered(drunk) at the game.",
    "236": "@kayte_c @SacramentoKings I would to take my 2 year old daughter tonight for Boogies return",
    "237": "Hey @FanDuel we both know you guys got lucky with me going 1 for 3 last night. It is a new day and my 🔒 of the night is @nuggets -7 over the @SacramentoKings #GamblingTwitter #BettingTips https://t.co/zkAplJiZXO",
    "238": "@kayte_c @SacramentoKings Would love to see the fox play!",
    "239": "@kayte_c @SacramentoKings Me please",
    "240": "Denver Nuggets vs. Sacramento Kings - 3/9/22 Free Pick &amp; NBA Betting Prediction https://t.co/8NjcLfemYF\n.\n#Betting #FreePicks https://t.co/tTmwGGNla3",
    "241": "@kayte_c @SacramentoKings Please! Thanks for the opportunity. https://t.co/wysxb58jow",
    "242": "@kayte_c @SacramentoKings Give them to @Burnt_Samosa. He needs them after this finance exam",
    "243": "@kayte_c @SacramentoKings I’d like to take my son to the game!!! Please Kayte!!!",
    "244": "@kayte_c @SacramentoKings Meeeee 🥺 please",
    "245": "@kayte_c @SacramentoKings My best friend is in town tonight and we’re both huge kings fans who’ve never been to a kings game before! https://t.co/PPp6g2BfGw",
    "246": "@kayte_c @SacramentoKings Need to take my girl to a all girls game ! She’s never been!",
    "247": "@kayte_c @SacramentoKings Date night with the wife please!!!! 🙏",
    "248": "@kayte_c @SacramentoKings I would love to take my Fiance to the game!",
    "249": "@kayte_c @SacramentoKings Me please",
    "250": "@kayte_c @SacramentoKings Gonna need something to enjoy after I fail my finance exam tonight 🙋🏽‍♂️",
    "251": "@kayte_c @SacramentoKings Good Afternoon To You. Hope All Is Well. That Would Be Nice This Evening..Appreciate You In Advance..",
    "252": "@kayte_c @SacramentoKings Please, give me a reason to wear my boogie jersey!!!!! #SacramentoProud",
    "253": "@kayte_c @SacramentoKings Me me me. Kings never lose when I’m at Golden 1.",
    "254": "Happy birthday @JillAdge it’s not Sacramento but it’s still the Kings. 🤷🏻‍♂️ https://t.co/pxeThDqcP6",
    "255": "@kayte_c @SacramentoKings Me and my boy have been to three games and the Kings have lost all of them. Help us out and let us see a win today!!",
    "256": "@kayte_c @SacramentoKings I’d love to go to the game with my girl to celebrate a late birthday!!!",
    "257": "@kayte_c @SacramentoKings I’d love to go with my fiancé!",
    "258": "@kayte_c @SacramentoKings Me please !!!!",
    "259": "@kayte_c @SacramentoKings Ooooh yes pleeeeeaase 💜",
    "260": "@kayte_c @SacramentoKings Right here",
    "261": "Got to knock down some shots at the Sacramento Kings arena this afternoon with my daughter's basketball team https://t.co/ngkIQit46X",
    "262": "The Sacramento Kings are among betting favorites to acquire LeBron James and son Bronny https://t.co/UMlB2Y7WPG",
    "263": "The Sacramento Kings will never get any respect from the officials.",
    "264": "According to oddsmakers, the Sacramento Kings are among the odds-on-favorites to acquire LeBron James when his son enters the NBA in 2024.  https://t.co/wZPVi80mIA",
    "265": "@AcunaPlusButler @KnicksKnest @AltMobile1 @SacramentoKings I think he’d just like yt ppl to be called thugs too 😂",
    "266": "@SacramentoKings Vivek should threaten to keep his daughter out of next years celebrity game over this garbage.",
    "267": "According to oddsmakers, the Sacramento Kings are among the odds-on-favorites to acquire LeBron James when his son enters the NBA in 2024. https://t.co/Tq6sUpgL6f",
    "268": "SUSPENDED: The NBA suspended Sacramento Kings center Domantas Sabonis one game without pay on Wednesday for aggressively confronting and making contact with an official who called him for a technical foul.\n\nhttps://t.co/rlXorqOKVu",
    "269": "@Christo70194490 @SacramentoKings Ya good for the kings honestly, it's the right move by them, but it's just sad that the nba will fine them for it",
    "270": "According to oddsmakers, the Sacramento Kings are among the odds-on-favorites to acquire LeBron James when his son enters the NBA in 2024. https://t.co/15VZFsljf6",
    "271": "sacramento kings https://t.co/R5cbW3tDil",
    "272": "@KnicksKnest @AltMobile1 @SacramentoKings So you condemn Sabonis yet you support thug ass Randle whom exhibited similar behavior? Sure.",
    "273": "@SacramentoKings Incidental contact. Understand the rule. Fine would be more appropriate. Officials swallowed their whistles when Randle was hacking Sabonis most of the second half. He finally had had enough. Inconsistent officiating all night.",
    "274": "@NBAPR @NBA @nbacom man that contact is so soft. He barely grazed the ref. The #nba is so soft! Man loses money on contact like that. Pathetic! #sabonis @SacramentoKings #kings #NBA75 #NBATwitter #NBAonTNT",
    "275": "Nuggets vs Kings IV preview is up:\nTPM™ 2021-'22 Game #65 vs Sacramento - Pre-Game version\nhttps://t.co/rXOdASLZtx",
    "276": "Sacramento Kings https://t.co/wyoJWZ3P2s",
    "277": "Sacramento Kings https://t.co/oB3rnrF8Tf",
    "278": "@SLAMSTUDIOS He was exposed to how refs treat sacramento. Compare this to actions by chris paul and randle this season and you will only see the kings player suspended. Its interesting",
    "279": "@KnicksKnest @SacramentoKings Yet Randles punk ass got fined 50K lmao. Same behavior different label.",
    "280": "NUGGETS 4 GAMES IN 5 NIGHTS CONTINUES:\n\nA rough stretch of games continues as the @nuggets hit the road and take on the @SacramentoKings in the capital city of California. Can Nikola Jokic make it three triple-doubles in a row?\n\nTip-off at 8:00pm, watch via your choice or stream",
    "281": "@SacramentoKings Really? 😂🤣🤦",
    "282": "@spaghetti916 @Darko251989 @SacramentoKings Hamidou Diallo did too",
    "283": "@statmuse Sacramento Kings",
    "284": "Yo @bball_ref, it's time to add Sabonis' Sacramento nickname to his profile. Kings fans have already embraced it https://t.co/2spWnE4Zhf",
    "285": "@JeriTsaiNets @_Talkin_NBA @SacramentoKings “Assaulted” is a bit much lol. The ref ran into him there, and it was a tiny ass bump. Both ejections were bs though and Domas doesn’t deserve a suspension",
    "286": "@ngelettt Sacramento kings",
    "287": "@ProPelsTalk @SacramentoKings Got pushed and stumbled into the ref and its not a tech if you slam the ball as long as you catch",
    "288": "@ProPelsTalk @SacramentoKings Jokic is an MVP and the Pels are a poverty franchise. what did you expect?",
    "289": "@SacramentoKings Would be nice if the league was consistent https://t.co/nbnOg3HbVV",
    "290": "Sacramento Kings https://t.co/DVOvX8yqVs",
    "291": "@SacramentoKings We disagree with the whack ass testing requirements at GC1. Who Souled us out?",
    "292": "Sacramento Kings or Clippers 😭😭😭😭😭😭😭 https://t.co/msa5iIcczH",
    "293": "Today's NBA Picks: 10:10 PM ET - Denver Nuggets vs. Sacramento Kings - 16 PICKS AVAILABLE: https://t.co/kXNssB3l3Z #nba",
    "294": "Sacramento Kings https://t.co/X2TDbhsveO",
    "295": "ALERT: New high roller bet posted!\nA bet has been placed for $5415.65 on Sacramento Kings - Denver Nuggets to win $10,722.99.\nTo view this bet or copy it https://t.co/YqN22daXNh https://t.co/EyDmNswlmw",
    "296": "Paris Saint-Germain 🤝 Sacramento Kings",
    "297": ".@coorslight Cold Hard Fact ⤵️\n\nDe’Aaron Fox is averaging 25.3 PTS, 6.3 AST and 4.3 REB in Sacramento’s three previous matchups against the Nuggets this season. https://t.co/4NIri0wkOA",
    "298": "PSG really FUMBLED the bag and let Real Madrid score like 3 goals in a span of like 10 mins. Fell apart and played the Sacramento Kings 😩",
    "299": "@SacramentoKings He softly bumping him does not warrant a suspension",
    "300": "@aaronbruski is there a reason the @SacramentoKings keep getting destroyed in the third quarter?",
    "301": "Aurora and her basketball team got to play on the Sacramento Kings court! ❤️😁 https://t.co/qyXPhCrLvo",
    "302": "@SacramentoKings Such 💩",
    "303": "@ItWasAKindness @Darko251989 @SacramentoKings It's not a push in the same sense of what Randle did lol but by definition extending the arm is pushing. Even if it is with MUCH less force and more deflecting than anything. CP3 looked like he was trying to deflect the official more than anything.",
    "304": "@ItWasAKindness @Darko251989 @SacramentoKings CP3 did extend his arm though. By definition that's a push. The ref 100% backed into him. But he did extend his arm. It doesn't matter in the grand scheme of things because he plays for a team that wins so the league allows them luxuries like making contact with officials.",
    "305": "@spaghetti916 @Darko251989 @SacramentoKings NBA has a big problem with its officiating system and Sabonis should not be suspended.\n\nThat said, no need to make things up. CP3 pushed nobody and the braindead ref backed up into him.",
    "306": "@SacramentoKings New view from my first game as a full season ticket holder in 2011...when they were supposed to leave town...\n\nLast game with the season ticket fam... https://t.co/x5ojc5tsUs",
    "307": "@Darko251989 @SacramentoKings Lmao look at the vid, it’s not even a bump, their shoulders touched",
    "308": "@SacramentoKings Refs have been trash, they should be fined for making bullshit calls",
    "309": "@SacramentoKings Are they demolishing it or what",
    "310": "@KnicksKnest @SacramentoKings I guess you’re supporting a thug, thug… https://t.co/jjFxYXxcTT",
    "311": "@SacramentoKings I stand with Sabonis",
    "312": "@SacramentoKings Lol this statement sounds like he got kicked out the league",
    "313": "@N8Tality @SacramentoKings Randle straight up pushed a ref two games ago and got a fine",
    "314": "@ProPelsTalk @SacramentoKings One week later and you still salty.",
    "315": "@_Talkin_NBA @SacramentoKings Omg, if I was ejected every time my boob touched someone I’d never go anywhere. It’s not his fault his chest is bigger and proceeds him. This is seriously dumb.",
    "316": "@_Talkin_NBA @SacramentoKings Randle pushed a ref the game before this got a fine",
    "317": "@SacramentoKings NBA likes the Knicks",
    "318": "@KnicksKnest @SacramentoKings Of course a Knicks fan is soft",
    "319": "@sarinibanini @SacramentoKings @NBAOfficial The only thing Twitter can agree on is NBA officiating and @MLB umpiring are trash.  NBA slightly better because they don’t have Angel Hernandez.  Seriously, no one likes either of you, so that’s a little comforting.",
    "320": "Sabonis was probably more angry at being on the @SacramentoKings than he was at the ref. He gotta vent his frustration somehow at being banished to the NBA's shadow realm where careers go to die. https://t.co/978IiYeyqH",
    "321": "Pick -41-\n🎫 Sacramento Kings vs Denver Nuggets https://t.co/CdzWHarE0m",
    "322": ".@Lindsey_Harding encourages everyone to seek friends and/or family that can uplift their spirits through these difficult times.\n\n#CalHOPE offers free tools to help manage #COVID19 stress. Visit https://t.co/VYgyFYV11S to learn more. https://t.co/GhkS5CffAs",
    "323": "@SacramentoKings He still missing a game.    Why don’t the owners sell?   Worst owners in sport!",
    "324": "@_Talkin_NBA @SacramentoKings Such a garbage call",
    "325": "@SacramentoKings @NBA @OfficialNBARefs  Referee Joshua Tiven is an embarrassment to the league and has been his entire career. He has favorites and is biased throughout the game. He has no place in the #nba.",
    "326": "@ElValdeezy @ProPelsTalk @SacramentoKings Red missed an easy call ok Sabonis also. Twice.",
    "327": "@MarkJonesESPN @SacramentoKings I feel like this is the NBA saying we should tank the rest of the season. Doesn’t feel consistent.",
    "328": "@SacramentoKings Sounds like a pretty Domas move",
    "329": "@KnicksKnest @AltMobile1 @SacramentoKings Your team literally employs Julius Randle",
    "330": "@SacramentoKings Glad to see the Kings stand up for Sabonis. Respect!",
    "331": "@suuuuuummm1 @SacramentoKings Thats how its been all year.\n\nTime for some shed light",
    "332": "@SacramentoKings Love Domas, but it was a fair punishment",
    "333": "Just watched the play where Sabonis was ejected and ultimately suspended over. What a horrible call, both on the phantom foul and the suspension. The NBA is unwatchable now, and I say this as a lifetime fan. Basketball fans, especially @SacramentoKings fans deserve better.",
    "334": "@MarkJonesESPN @SacramentoKings Kings should be moved to Seattle or flat out dissolved. Pathetic franchise",
    "335": "@SacramentoKings Hopefully this pisses off the organization and the players. Are y’all finally tired of the NBA punking on Sac?",
    "336": "I don’t get that Sabonis suspensison. But I admire the \n“He’s My Ride or Die” statement by the @SacramentoKings 💪🏽 https://t.co/InunGM2ZLQ",
    "337": "@SacramentoKings Nah, he deserves it.",
    "338": "@_Talkin_NBA @SacramentoKings Thats was nothing",
    "339": "@KnicksKnest @SacramentoKings Bro barely tapped him?",
    "340": "@_Talkin_NBA @SacramentoKings Soft",
    "341": "@wyderic @SacramentoKings do u even watch basketball",
    "342": "@Moises78592826 @SacramentoKings @NBA @NBAonTNT He made contact with him, just watched it for the tenth time. \n\nDon't disagree that the league isn't being consistent, but they certainly called it right on this one.",
    "343": "@ashley_alfreda1 @Darko251989 @SacramentoKings ur mom",
    "344": "@SacramentoKings @KingsFrance_fr @Dsabonis11 WE LOVE YOU 🇨🇵🇺🇸",
    "345": "@SznNunn @SacramentoKings Lakers fans don’t stand with you, we don’t claim him.",
    "346": "@SacramentoKings Ayy, you gotta have emotions with nba's trash calls. All the travelling and no contact foul calls",
    "347": "@gonsolosgoku5 @Darko251989 @SacramentoKings You are 🗑",
    "348": "@Villide1 @SacramentoKings white",
    "349": "@edreyheras @Darko251989 @SacramentoKings It wasn't the same push as Randle but it was a push. He extended his arm. Intentionally or not. If you're arguing the rule is black and white intention means nothing.",
    "350": "@SacramentoKings He got suspended??? Bro suspend the refs for blowing the knicks the entire night",
    "351": "@edreyheras @spaghetti916 @Darko251989 @SacramentoKings Ref literally walked into CP3 and they ejected him and he's trying to compare the two.",
    "352": "@Darko251989 @SacramentoKings yo family ugly as hell😭 tell yo daughters to get in a meal plan or sum bro, they gonna be like you by the time they 30",
    "353": "@BolWrld @SacramentoKings @PrimeKAI_ touched a ref on accident",
    "354": "@_Talkin_NBA @SacramentoKings holy fuck thats so weak lmao",
    "355": "@nbatrend @SacramentoKings In a row I think so",
    "356": "@SacramentoKings @PrimeKAI_ What did he do",
    "357": "Sacramento Kings’ Domantas Sabonis suspended one game for confronting, making contact with official Monday night https://t.co/8wXS2kMjzN",
    "358": "The good news is that Sacramento’s improved perimeter defense has limited the number of opposing teams’ attempts at the rim.\n\nPrior to the trade, the Kings ranked 25th in opponent frequency at the rim.\n\nPost-trade, they’re 17th. https://t.co/gIX77gm5RB",
    "359": "@SacramentoKings Haliburton better",
    "360": "Kings center Domantas Sabonis receives one-game suspension #Sacramento #Kings #NBA https://t.co/nHSuBIThij",
    "361": "@SacramentoKings Why have you tweeted this😭",
    "362": "Andy Vermaut shares:Kings' Sabonis suspended 1 game for making contact with ref: The NBA suspended Sacramento Kings center Domantas Sabonis one game without pay on Wednesday for… https://t.co/5kS82ua8BV Thank you. #ThankYouJournalistsForTheNewsWeGetFromYou #AndyVermautThanksYou https://t.co/j3wNoUpvKU",
    "363": "@spaghetti916 @Darko251989 @SacramentoKings You lost all credibility by saying CP3 pushed a ref",
    "364": "@sarinibanini @SacramentoKings @NBAOfficial Yep they sure don’t hold themselves accountable when they are wrong no punishment for the refs for wrong calls that easily effects the game’s outcome..they just say my bad an no punishment and on top of that they don’t even fix the problem smh 🤦‍♂️",
    "365": "@SacramentoKings He rage quit because Ju was giving him the Business.",
    "366": "@HereWeKangz @Darko251989 @SacramentoKings This is fair lol you shouldn't be able to pick and choose might be better phrasing. But the NBA doesn't give a shit.",
    "367": "@HereWeKangz @spaghetti916 @SacramentoKings Since 79",
    "368": "@SacramentoKings Randle shoved a ref and got no suspension. This suspension is bull.",
    "369": "@itstheshorts @thewiserwon @SacramentoKings That's it? Players do that all the time.",
    "370": "@stanmonfort1 @thewiserwon @SacramentoKings That’s it, although the full play with more context is here;\n\nhttps://t.co/CVOHFjSLTg\n\nIt’s a soft foul, but the “contact” he makes with the official doesn’t really seem T-worthy",
    "371": "@Villide1 @SacramentoKings He did not he yelled at the ref, what about the Randle incident, CP3 they didn’t get suspended. You can’t just pick an choose when to use the rule. It’s straight B.S. @NBA @NBAonTNT",
    "372": "@spaghetti916 @Darko251989 @SacramentoKings Have you not followed the NBA for the last 25 years?",
    "373": "@SacramentoKings The site of my first NBA game 🏀 #ARCOFarewell https://t.co/uZt1XlFUgC",
    "374": "@SacramentoKings Sabonis barley breathed on the @NBA official and got suspended. What a bunch of 🤡 #sacramentoproud",
    "375": "@SacramentoKings If the NBA really wants to punish in that situation, it should’ve just been a fine. The Sabonis situation, and the Lakers/Pistons situation is not the same level.",
    "376": "@YZY_808 @SacramentoKings It was",
    "377": "@spaghetti916 @Darko251989 @SacramentoKings Exactly.",
    "378": "@Darko251989 @SacramentoKings He did not bump the ref he yelled in his face lol",
    "379": "@sarinibanini @SacramentoKings @NBAOfficial The nba cares more about referees then players and fans it’s really sad",
    "380": "Sacramento Kings’ Domantas Sabonis suspended one game for confronting, making contact with official Monday night https://t.co/V9kWXCKoJa",
    "381": "@YZY_808 @SacramentoKings But CJ McCollum yelling it hit the backboard, is a technical?",
    "382": "@SacramentoKings @swipathefox Lil big bruh a goat",
    "383": "Jokic's play has carried @nuggets to a 9-1 record (6-4 ATS) in its last 10 games, which includes a pair of wins over the Kings in late February. Without its best player down low, Sacramento will have its hands full in the rematch.\n\n#picks: @Nuggets -6.5 https://t.co/SlSunZkTpw",
    "384": "@N8Tality @SacramentoKings So you want the league to be unbalanced and only punish the teams who don’t have a real shot at the playoffs?",
    "385": "@SacramentoKings HUGE W",
    "386": "@SacramentoKings 💯💯💯love it",
    "387": "Have a special moment at ARCO in your camera roll? Share it with us using #ARCOFarewell to include your fan memories for the event on Saturday, March 19. https://t.co/gbklt0mK1I",
    "388": "The California Sikh Youth Alliance hosted its Third Annual Sikh-American Heritage Night Game With The Sacramento Kings. This off-season we plan on meeting with NBA officials to discuss accommodations appertaining to physical manifestations regarding the Sikh Articles of Faith. https://t.co/QtUpVARkAc",
    "389": "@ProPelsTalk @SacramentoKings Only a tech if you don't catch the ball after you slam it. Not to mention ref knew he missed an easy call so had to ask for help.",
    "390": "@itstheshorts @thewiserwon @SacramentoKings That's it?",
    "391": "@ProPelsTalk @SacramentoKings It's almost like the league has an agenda and will bend the rules for some players 🤔",
    "392": "@SacramentoKings NBA vs Kings what else is new. They don’t give the boys any love or respect",
    "393": "@spaghetti916 @Darko251989 @SacramentoKings Who do they think they are, the NFL??",
    "394": "@SacramentoKings Soft ref",
    "395": "Julius Randle shoved a ref out of the way on Friday night against the Suns and wasn't suspended a game. The inconsistencies by league officials are a huge issue. \n\nBut hey, it's the Sacramento Kings so who cares, right? https://t.co/jDzFtxD7oW",
    "396": "@SacramentoKings He’s frustrated with how the team gives up leads. Support him by providing him with help on the court. The 2 year clock with him is already ticking.",
    "397": "@SacramentoKings Kangz stank is rubbing off on Domas.",
    "398": "Culture building in Sacramento -- \n\n1. Competing and showing you care (hating to lose)\n2. Organization standing behind their own to build them up (making a concerted effort to show their support)\n\nMight be a turning point moment for the Kings. https://t.co/Dp8zeobs0Z",
    "399": "@SacramentoKings Who cares? Aren't they tanking anyway?",
    "400": "@SacramentoKings And Americans wonder why other countries don't take there sports seriously... U have suspended someone for shouting",
    "401": "@SacramentoKings Please, do whatever you have to in order to get two more wins.  Sincerely.",
    "402": "@SacramentoKings Not a technical foul 😂😂 https://t.co/xfARjuLMZt",
    "403": "@_cavenaghi_ @AriZonaPrince @NerdieTurtle @SacramentoKings He did touch him",
    "404": "@SacramentoKings Bunk call   Move on",
    "405": "@wyderic @SacramentoKings DMC had a legitimate issue with the way he was being ref'd and on a nightly basis would complain to the officials and it was a real detriment to the team. So yeah, it was a problem",
    "406": "@SacramentoKings The most Kings thing ever. The one game I get to go to this year and Sabonis isn't even playing. Got suckered again. #refundme",
    "407": "@TheFoxAndOx @Darko251989 @SacramentoKings That's what I'm saying. Like the league picks and chooses the situations when they enforce rules. Big markets can do anything. Small markets like Sac get the full wrath of the league. \nThe lack of consistency is embarrassing and disgraceful.",
    "408": "This is why “tanking” has always been a red herring. It is better to have a young, overmatched team playing hard and figuring stuff out, or, like, the Sacramento Kings doing whatever it is they’ve been doing for the past decade. https://t.co/TJ6xoVfKKi",
    "409": "@James_HamNBA I love Holmes but it appears that he has quit the Kings and the city of Sacramento.",
    "410": "@SacramentoKings Ratio",
    "411": "🔑facts: \n\n🏀 #Nuggets are scoring at will 🆚 #Kings on the season\n🏀 They’re averaging 121.3 points per game against them among the 3 games\n\nIs tonight different in Sacramento?\n\n@ThatGuyBets monetizes.\n\n#NBAPicks #bettingsports | #BeatTheOdds👊\n\nhttps://t.co/BNdaMkBIPW",
    "412": "@spaghetti916 @Darko251989 @SacramentoKings You do when it's the Kings 😭",
    "413": "@Dr_NManning He’s an angry man. As a KC native it took his football team 50 years to win anything and now their window is closing… and he’s likely still bitter that the Kings moved from KC to Sacramento in 1985, hence all the Jokic hate",
    "414": "@SacramentoKings Absolutely. Furthermore where’s the @NBAOfficial punishment for refs for all the missed calls and ongoing BS? Hold players accountable but not themselves? Sad, and telling.",
    "415": "@SacramentoKings Even in Indiana he didn't get no respect by the officials.. Ofc he is frustrated.. The way he is threated..",
    "416": "@SacramentoKings Get yourself a team that has your players back! 👑🤍💜.  Love this from you guys! @SacramentoKings",
    "417": "@Villide1 @SacramentoKings Found the loser",
    "418": "@SacramentoKings Ya.... That sucks. But ya.",
    "419": "@SacramentoKings What did he do?",
    "420": "@James_HamNBA Its because NBA refs have been screwing Sacramento since the Kings moved here. To the point i'd be willing to bet large sums of money that if someone checked the data they'd find the Kings are likely near the bottom in fouls for, and near the top of fouls against, back to 85",
    "421": "@SacramentoKings Tank time!!!",
    "422": "@SacramentoKings Mine too fuck that shit",
    "423": "@SacramentoKings As a lakers fan, you’re 100% correct, we stand with you",
    "424": "@SacramentoKings Twitter guy was paid to copy/paste this shit. ZERO CHANCE anybody thinks he was wronged here. Much deserved suspension.",
    "425": "@TedNewby @NBACobwebs @realchriswebber @SacramentoKings Agree....",
    "426": "Washington Football Team = Sacramento Kings",
    "427": "@N8Tality @SacramentoKings It's about consistency nothing to do with wins or losses",
    "428": "@SacramentoKings Clip??",
    "429": "@AltMobile1 @SacramentoKings @BobbyMarks42 Ironic",
    "430": "@SacramentoKings No place for that thug in this league control your players",
    "431": "@_cavenaghi_ @AriZonaPrince @SacramentoKings I thought the same thing, refs hate the Kings anyways",
    "432": "@SacramentoKings And still Neemias won't play more than 2 minutes... Wanna bet?",
    "433": "@SpoonOfZeke Life long Sacramento kings fan",
    "434": "@KnicksKnest @SacramentoKings Just saying… https://t.co/b2HADFrhFU",
    "435": "@AltMobile1 @wayne_6211 @SacramentoKings It is true",
    "436": "@TejS40 @SacramentoKings Don't think they care, tbh. I'm glad to see them standing up for him.",
    "437": "@wayne_6211 @SacramentoKings It takes one to know one…",
    "438": "@vanessa_jjX @SacramentoKings Fined 50K…",
    "439": "@KnicksKnest @SacramentoKings So barely bumping a ref is thug? Mf refs won’t give him any calls all game and he gets called on a soft ass foul leading up to it. Gtfo",
    "440": "@SacramentoKings oh but when it’s Demarcus Cousins it’s a problem ?",
    "441": "@SacramentoKings Just need a gif of him eating a doughnut to really nail this one. See the @Bucks blueprint",
    "442": "CalHOPE Supportive Relationships with Lindsey Harding #Sacramento #Kings #NBA Video: https://t.co/UmxA7qDw5x",
    "443": "@maxmaxmaxxx_ @SacramentoKings Sabonis suspended",
    "444": "@SacramentoKings So you support referee abuse??? This was thug behavior and it doesn’t belong in the league.",
    "445": "@GoatedFades @SacramentoKings Sabonis was suspended for a game.",
    "446": "@_cavenaghi_ @NerdieTurtle @SacramentoKings I’m assuming the slight contact+ aggression towards the ref doing a shit job",
    "447": "@SacramentoKings Can't win a game though! We sorry AF!",
    "448": "@LBJcrib @Don_Strokesss @DBeverly7_ This \"don't care\" attitude y'all talking about is literally completely made up. The Lakers will give up 70 points in the paint to the fucking Sacramento Kings, and dudes will say its Russ' fault. Media has successfully vilified this man and its sad.",
    "449": "@AriZonaPrince @NerdieTurtle @SacramentoKings No way he got suspension for this? He did not even touched him. Maybe he told him something?",
    "450": "@SacramentoKings @DeuceMason Same here deuce that's not right a lot of other players do that and the referee swallows the whistle not cool sabonis should fight it",
    "451": "@SacramentoKings disagree with deez nuts sadly",
    "452": "New post (Denver Nuggets at Sacramento Kings NBA Odds and Pick for March 9) has been published on The Sports Geek - https://t.co/YbbRkcYXjJ https://t.co/bqUE9odHFS",
    "453": "Charlotte Hornets - Boston Celtics\nDetroit Pistons - Chicago Bulls\nMiami Heat - Phoenix Suns\nSacramento Kings - Denver Nuggets\n\nBet slip link: https://t.co/unc89I0zZT https://t.co/I7wAEAEs5w",
    "454": "@SacramentoKings He intentionally made contact with the official. Easy call for the league. \n\nLove the fire, just don't get so close next time.",
    "455": "@Darko251989 @SacramentoKings By the rules yes, but Randle pushed a ref last week, CP3 pushed a ref earlier this year and neither of them got suspended. \nYou don't get to pick and choose when rules apply.",
    "456": "@_cavenaghi_ @NerdieTurtle @SacramentoKings Softest bump ever lmao https://t.co/sL3Qv8GIlc",
    "457": "@SacramentoKings Doesn't matter, we sorry AF!",
    "458": "@SacramentoKings @BobbyMarks42 You stand behind Julius randles son you mean",
    "459": "@SacramentoKings Yeah absolutely pathetic when Randle did worse and didn’t even get suspended",
    "460": "@SacramentoKings Free the king",
    "461": "@SacramentoKings @BobbyMarks42 holy own",
    "462": "@SacramentoKings @BobbyMarks42 This is awful. Thank you for having his back. 👍👍",
    "463": "@MattyBforThree @SacramentoKings Kings aren't important enough for anyone to care or have an agenda lol",
    "464": "@SacramentoKings Holy W",
    "465": "@SacramentoKings Poverty team traded your best player",
    "466": "@SacramentoKings OH NOW WHAT EVER WILL WE DO WITHOUT SABONIS FOR ONE GAME???? SHOW LOVE AND SUPPORT DURING THIS ROUGH TIME",
    "467": "@NerdieTurtle @SacramentoKings Need to see video but I can imagine…",
    "468": "@SacramentoKings Sacramento got Sabonis acting different 🤣",
    "469": "@SacramentoKings Refs are hella soft, lmao how you get suspended off a fucking look? Go watch game film on the pistons in the late 80s",
    "470": "@SacramentoKings you’re just a losers team.\ntank already",
    "471": "@_cavenaghi_ @SacramentoKings for \"making contact with an official\"",
    "472": "@SacramentoKings The refs will call everything on kings",
    "473": "@SacramentoKings Hell yes!",
    "474": "@SacramentoKings Free Sabonis",
    "475": "@SacramentoKings Nah y'all threw away your future for the 5000000th time",
    "476": "@SacramentoKings He bumped the ref. That’s automatic.",
    "477": "@SacramentoKings Ty betta",
    "478": "@SacramentoKings the league has an agenda",
    "479": "@_cavenaghi_ @SacramentoKings For accidentally bumping into a ref",
    "480": "@SacramentoKings He legit sized up the official 😂 not like y’all gonna are gonna win tonight \n\nJokic about to drop a double nickel 😂",
    "481": "@SacramentoKings @OfficialNBARefs call Kings games like Tim Donaghy used to. Its a disgrace",
    "482": "@BCHOMEHUNTER @miket136 Marvellous.  Too cool.  \nMy Dad would listen to Larry King out of Sacramento every night around midnite.  \nWhen he was in Miami broadcasting, too. \nStill cool after all these Decades.",
    "483": "@SacramentoKings Win a damn game",
    "484": "@SacramentoKings Incoming fine",
    "485": "@SacramentoKings Suspension for what?",
    "486": "@SacramentoKings how sweet https://t.co/iuNNClw9kX",
    "487": "@SacramentoKings what",
    "488": "@SacramentoKings We disagree with the chemistry.",
    "489": "@SacramentoKings Tank for paolo pls",
    "490": "@SacramentoKings Bro what",
    "491": "@SacramentoKings W kings",
    "492": "@SacramentoKings Wtf happened?",
    "493": "@SacramentoKings this feels illegal",
    "494": "@SacramentoKings Win a game",
    "495": "We disagree with the NBA’s decision to suspend Domantas Sabonis. He is a consummate professional and the ultimate competitor. We stand behind Domas, and he has our full support.",
    "496": "@TedNewby @NBACobwebs Although it started in the 90s ....98 was @realchriswebber first year in @SacramentoKings",
    "497": "Sacramento Kings’ Domantas Sabonis Suspended 1 Game For Making Contact With Ref https://t.co/IqzXYYc3Vg https://t.co/x8zQ9R2HrF",
    "498": "The Denver Nuggets face off against the Sacramento Kings tonight.\nWho are you rooting for?",
    "499": "@miss_daria45 @SwipaCam @getnickwright This is my theory too.  Growing up in KC and seeing Denver thrive next door.  Meanwhile, the Chiefs were in the Broncos shadow for 30+ years and losing the Kings to Sacramento.  That’s gotta be rough.",
    "500": "@CarmichaelDave The Sacramento kings bring out the best in people",
    "501": "NEW YORK (AP) — The NBA suspended Sacramento Kings center Domantas Sabonis one game without pay on Wednesday for aggressively confronting and making contact with an official who called him for a technical foul. https://t.co/fkbUiNvFg6",
    "502": "Kings' Sabonis suspended for contact with official #Sacramento #Kings #NBA https://t.co/v59YvEM5Ok",
    "503": "Chelsea FC sale tracker: New York Jets’ Woody Johnson, Sacramento Kings’ Vivek Ranadive reportedly prep bids https://t.co/5Gro5F8nnc",
    "504": ".@SacramentoKings Assistant Coach @Lindsey_Harding encourages everyone to seek friends and/or family that can uplift their spirits through these difficult times.\n\n#CalHOPE offers free tools to help manage #COVID19 stress. Visit https://t.co/wR8fGQVV9C to learn more. https://t.co/ihP8UZKdyn",
    "505": "Only 15 games remain for the Sacramento Kings.\n\n@kayte_c joined The @CarmichaelDave Show with @JasonRoss1140 this morning to discuss what the team can look to accomplish over the final stretch: https://t.co/r6W5MmtmJj",
    "506": "Sacramento Kings’ Domantas Sabonis suspended one game for confronting, making contact with official Monday night https://t.co/ZJqT1subXI",
    "507": "Consensus Line Move:\n2022-03-09 Denver Nuggets at Sacramento Kings from 4.50 to 6.50\n#MileHighBasketball who's in\n#NBA #sports #data #sharemarket",
    "508": "@mikekorz Literally any college team in history would still lose to the current Sacramento Kings, lmao do they not know how the NBA works",
    "509": "Sacramento Kings center Domantis Sabonis was suspended by the NBA for tonight's game, after he made contact with an official during Monday night's contest against the New York Knicks. https://t.co/LkHjYEu3Yg",
    "510": "Sacramento Kings center Domantis Sabonis was suspended by the NBA for tonight's game, after he made contact with an official during Monday night's contest against the New York Knicks. https://t.co/XJ0PVFzOUB",
    "511": "Y’all hate the @SacramentoKings so much. It’s ridiculous. https://t.co/0IdN3EkCmO",
    "512": "No Sabonis or Holmes tonight for the Kings as DeMarcus Cousins makes only his second on-court appearance back in Sacramento.\n\nGive me your stat line predictions for Boogie tonight",
    "513": "The Washington commanders are the Sacramento Kings of the NFL",
    "514": "The Denver Nuggets face the Sacramento Kings in Wednesday's NBA Basketball Action. \n\n#NBA #NBAPick #NBAPredictions #NBAOdds #Kings #SacramentoProud #Nuggets #MileHighBasketball #NuggetsVsKings https://t.co/LEExl4eUhV via @YouTube",
    "515": "Very happy with my pack today! I’ll be flipping all my Fresh Threads but I definitely wanted @Dsabonis11 first @SacramentoKings moment! 🙏 #NBATopShot https://t.co/i8aQ3kN3vI",
    "516": "Sacramento Kings’ Domantas Sabonis suspended one game for confronting, making contact with official on Monday night https://t.co/fmVFk6AnlL",
    "517": "Kings' Domantas Sabonis suspended for bumping official #DomantasSabonis #NBA\n #SacramentoKings #SacramentoProud  https://t.co/U53r7wye9b",
    "518": "@ShamsCharania The @SacramentoKings gonna coaches challenge the suspension, have it reviewed and the suspension will be upheld and a timeout will be taken away to start the game tonight.",
    "519": "I will play center tonight if need be @SacramentoKings",
    "520": "Sacramento Kings Domantas Sabonis has been suspended one game for aggressively confronting and making contact with a game official. #Kings \n\n https://t.co/nSHDheGJxC",
    "521": "@rkim3150 @anthonyVslater And better than the whole @SacramentoKings roster, including @swipathefox",
    "522": "🚨 Line Change 🚨\n\nDenver Nuggets @ Sacramento Kings\nWed 10:10 PM EST\n\nFrom:\nSAC 5.0 -115\n\nTo:\nSAC 6.0 -115",
    "523": "Chelsea FC sale tracker: New York Jets’ Woody Johnson, Sacramento Kings’ Vivek Ranadive reportedly prep bids https://t.co/d0MSiQHFHP",
    "524": "@P3RCNASH Sacramento kings btw",
    "525": "@SacramentoKings Please trade him so he can get on a good team, as a kings fan we are wasting his prime years and I hate to see it to such a good young talent",
    "526": "Game 68 of the Sacramento Kings baby!!! https://t.co/XA4LHVUMx4",
    "527": "Kings' Domantas Sabonis Suspended 1 Game for Aggressively Confronting Official #Sacramento #Kings #NBA https://t.co/cMQKLCMFxc",
    "528": "@SacramentoKings Kevin Martin should be in the rafters",
    "529": "Sacramento Kings center Domantas Sabonis will not play tonight vs Denver after being handed a one-game suspension after making contact with a referee during Monday's loss against the Knicks.\nhttps://t.co/QewieND4um",
    "530": "@SacramentoKings Are we winning?",
    "531": "Sacramento Kings center Domantas Sabonis has been suspended one game by the NBA: https://t.co/L3k8jR9uvF",
    "532": "@gadielcartagena The Sacramento Kings.",
    "533": "Sacramento Kings center Domantas Sabonis suspended one game without pay for aggressively confronting and making contact with a game official, says #NBA",
    "534": "Sacramento #Kings F Domantas Sabonis has been suspended 1 game for making contact with an official. #NBA https://t.co/uZlCtABWq9",
    "535": "@NBAPR The @NBA hates the @SacramentoKings",
    "536": "(FRI.MAR.18) NBA:BOS-SAC PICK:The Celtics visit the Kings in Sacramento! The Celtics w/star G/F Jayson Tatum win this one:CELTICS 118-115",
    "537": "@NBAPR @wojespn @SacKingsPR @SacramentoKings you better watch that Denver and New Orleans game and record what Joker did and file an appeal. According to the @NBA and @NBAPR , this should not even be a technical foul.",
    "538": "The Kings will be without Domantas Sabonis (one-game suspension) tonight when they face the Nuggets.\n\nNikola Jokic has averaged 25.3 points, 10.7 rebounds, and 9.0 assists in three games vs Sacramento this season.\n\nNo Sabonis or Holmes (personal) for the Kings tonight.",
    "539": "@SacramentoKings @swipathefox we have a losing record 🔥🔥",
    "540": "Fox is averaging 27.8 PTS and 6.3 AST over his last 13 games 🔥 \n\n@swipathefox | #SacramentoProud https://t.co/ytx5ZB2q5Q",
    "541": "Sacramento Kings center Domantas Sabonis has been suspended one game without pay for aggressively confronting and making contact with a game official #SacramentoProud #nba75 #porvida",
    "542": "@SacramentoKings 18 years since yalls last playoff appearance",
    "543": "@SacramentoKings is this the first time he’s gone 13 games with 20+?",
    "544": "NBA Player Prop:\nDomantas Sabonis Over 17.5 R + A -120 (Sacramento Kings)\n\nSabonis has 18+ combined 8/L10 and usually exceeds Ast total vs Jokic. \n\nFwiw I have Sabonis getting 7.8 Ast tonight (I will be sprinkling TD) https://t.co/hBsXT2Idoi",
    "545": "The Kings shooting since Sabonis has been with Sacramento (11 GP):\n\n30.6 3PA/G (25th in NBA)\n32.9% (27th in the NBA) https://t.co/tF6qOZVq80 https://t.co/iWFSrVgbMS",
    "546": "@MiasDAD19 @SacramentoKings @GrantNapearshow Eric Collins better tho….",
    "547": "@Golden1Center @SacramentoKings Thank you so much!",
    "548": "@spanishgodish @SacramentoKings Doors open at 5:30pm for a 7pm Kings game. Team shoot around times vary.",
    "549": "@erinkatedolan I'm on a 10 game losing streak.\nHere goes to 12.\nRice +4\nSacramento Kings +4.5\nFade me",
    "550": "@okcthunder vs. @Timberwolves \n@OrlandoMagic vs. @PelicansNBA \n@nyknicks vs. @dallasmavs \n@Raptors vs. @spurs \n@trailblazers vs. @utahjazz \n@nuggets vs. @SacramentoKings \n@WashWizards vs. @LAClippers",
    "551": "@nbatrend randle is a future king. notice how he went off in sacramento? they’d be a playoff team with the sandle frontcourt",
    "552": "Revenge Game: DeMarcus Cousins plays Sacramento tonight.  He played 470 games in his career for the Kings.",
    "553": "hey… the sacramento kings play today",
    "554": "@SacramentoKings Played against him few years back at a summer camp. Had me re thinking my whole life",
    "555": "My Sacramento Kings 2023 wishlist: https://t.co/i581CMROvc",
    "556": "Analyzing Wednesday’s Denver Nuggets at Sacramento Kings odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/2vZaLoWSYA",
    "557": "Denver Nuggets at Sacramento Kings odds, picks and predictions https://t.co/Sc6CGq50nm",
    "558": "I really thought I was gonna marry Jon B or Jason Williams from the Sacramento Kings when I was in high school 😅😅🥴",
    "559": "Man he still got it! Fundamentals at is finest can the @SacramentoKings bring in Jackie Moon as a player/coach? Asking for a friend?? https://t.co/fAVBOCyDXF",
    "560": "NBA 10/03/22\n\n08:00 Milwaukee Bucks*Over-238.5\n08:00 Minnesota Timberwolves *Over-231.5\n08:30 San Antonio Spurs *Over-228.5\n10:00 Sacramento Kings *Over-238\n10:30 L.A. Clippers *Over-217",
    "561": "Sacramento Kings Owner Vivek Ranadive Reportedly Wants To Buy Chelsea F.C. – NBA News https://t.co/PT6dPAOz1z",
    "562": "Sacramento Kings Owner Vivek Ranadive Reportedly Wants To Buy Chelsea F.C. – https://t.co/LrfVD6I5FC",
    "563": "Consensus Line Move:\n2022-03-09 Denver Nuggets at Sacramento Kings from 237.00 to 239.50\nOver what ya gonna do?\n#NBA #bettingexpert #coding #trade",
    "564": "@CornerPubSports Sacramento Kings",
    "565": "Denver Nuggets vs  Sacramento Kings Prediction 3/9/22 -  Free NBA Picks https://t.co/6EKlBpDNsi via @YouTube",
    "566": "@TimMaxwell22 \"But all we need is a new coach and better roleplayers around Fox and Ox!\" - your 34-win 2022-23 Sacramento Kings",
    "567": "If Chelsea let that Sacramento Kings owner take over......cry",
    "568": "Coming up today with @CarmichaelDave and @JasonRoss1140:\n\n7:41: @TheMikeSalk gives us Seattle's perspective on the Russell Wilson trade to Denver.\n\n8:00: @kayte_c talks all things Sacramento Kings!\n\n📻https://t.co/0uR1BbDJSF\n📺https://t.co/LHDsh6aPOK https://t.co/5FyVjTvKI2",
    "569": "🏀 𝗚𝗔𝗠𝗘𝗗𝗔𝗬 🏀\n\n⚒️ DENVER NUGGETS\n👑 SACRAMENTO KINGS\n📍 Golden 1 Center (Sacramento)\n📺 NBA League Pass\n\n#SacramentoProud https://t.co/BetzUkiLP6",
    "570": "@rbritoreis @MemphisHustle @nemi1599 @StocktonKings @nbagleague @SacramentoKings @BDA_Sports @BDASportsINTL @WME_Sports @USUBasketball @CBB_Europe @fpbasquetebol CALL THIS MAN BACK UP! HE'S GOING TO BE A SNEAKY GOOD PLAYER WHEN HE'S FINALLY GIVEN A CHANCE TO PLAY CONSISTENTLY",
    "571": "Watch Bronny go to the kings and LeBron head to Sacramento too .",
    "572": "Preview: Denver #Nuggets are looking for a season sweep of the Sacramento #Kings tonight #MileHighBasketball @denverstiffs https://t.co/0UHPkmzPNZ https://t.co/VsIEAl6oII",
    "573": "Preview: Denver #Nuggets are looking for season sweep of the Sacramento #Kings tonight #MileHighBasketball https://t.co/yuZ0eujf3T https://t.co/IZtb607exc",
    "574": "@ixrahim9 Bro it’s tough out here yday they said Sacramento kings owner wanted to buy us😭😭",
    "575": "10:00pm ET, Wed, Mar 9\n\nDenver Nuggets\nSacramento Kings\n\n📺: NBCSCA, Altitude\n\n#LEGENDoftheMiamiHEAT #NBA75",
    "576": "The owner of Sacramento Kings Vivek Ranadive is interested in buying of Chelsea https://t.co/oe5icUjuJe",
    "577": "Wtf is this mascot? A demonic Cowardly Lion? #NBA #sacramentokings https://t.co/91tWjGaS75",
    "578": "@TheNBACentral @MailSport Hopefully he sells the Kings to Chris Hansen so we can end the Sacramento nightmare",
    "579": "@fernandorubio90 @whorekage__ @gojowos @hemikow He plays for the Sacramento kings and is 6’12",
    "580": "Guess who is last Sacramento king fans? #sacramentokings https://t.co/TllFh4vfel",
    "581": "NBA Basketball Game Betting Picks Simulator: 10:10 PM ET - Denver Nuggets vs. Sacramento Kings - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/N5AOjSuchU #nba #sportsbetting #freepicks #cappertek",
    "582": "New York Knicks vs Sacramento Kings Full Game Highlights | March 7 | 202... https://t.co/3HAiMOGGAr @YouTube",
    "583": "Sacramento King away challenge Oklahoma City Thunder, the king cut 72 points in the second half, Jill Jess Alexander 37 points, 7 rebounds and 10 assists are still unable to return to the sky, and finally the king won the thunder 131-110, ending four consecutive defeats. https://t.co/DpFzRX0uzV",
    "584": "MAKE IT HAPPEN PLEAAASEEE RUIN CHELSEA LIKE YOU RUINED SACRAMENTO KINGS https://t.co/sxClJ6LiLq",
    "585": "@kors_andreas And forgot to add owner of the Sacramento kings. This is cap 🧢  pal he don’t got the money for us 💀💀",
    "586": "Chelsea FC sale tracker: New York Jets’ Woody Johnson, Sacramento Kings’ Vivek Ranadive reportedly prep bids https://t.co/4noxLJhJIY",
    "587": "I hate it here 🙄😢 @SacramentoKings https://t.co/ca6i7XLLog",
    "588": "The comeback begins - former heavyweight king George Foreman returned to the ring #OnThisDay in 1987 with a Round 4 TKO of Steve Zouski at the Arco Arena in Sacramento, California. The bout was his first for 10 years. https://t.co/GesqwHLHT3",
    "589": "Congratulations to JonBoyBeats (@jonboybeats) who moved up 1 spot to take #8 on the Sacramento Kings team leaderboard.\n\nhttps://t.co/WHnq26Jxct",
    "590": "@Airdrofreemoon Good news\n@SacramentoKings , @JoyVBehar , @FareedZakaria",
    "591": "@DimeDropperPod Is he a top 5 Sacramento Kings player? https://t.co/qBKby1JL1V",
    "592": "VIVIDESIGN Group -  Sacramento Kings Could Use Offseason To Gain 2023 Playoff Momentum https://t.co/qftS2LQHoj  - Call 270-723-3650 https://t.co/C3rorl0Sfx",
    "593": "Fadeaway World details the Sacramento Kings 16 year playoff drought 🥶 \nhttps://t.co/oBFYiXzj9o",
    "594": "@C_Marb @rickyricksmusic Wow, Deep Purple meets King Crimson? I'm sorry I never had the chance to see you, I grew up in Sacramento and saw a lot of harder rock shows in the area so it wouldn't have been impossible. Your name sure is difficult to Google though! I assume the singer liked Daltrey?",
    "595": "@SacramentoKings  when does shootaround start? @Golden1Center",
    "596": "Can the Sacramento Kings win some games.",
    "597": "Talked to someone from Sacramento yesterday and even they weren’t a kings fan these niggas truly don’t exist",
    "598": "@SpaceRunnersNFT @Lakers @nuggets @SacramentoKings dont miss",
    "599": "@nngpssn Good news, Chelsea would be good like Sacramento kings",
    "600": "Not sure why Atomic Mass Games felt the need to throw in a couple Sacramento Kings minis in the core set for Marvel Crisis Protocol, but I'm no game designer. https://t.co/QO92eGYOKE",
    "601": "Happy birthday to Kenny the jet smith of the Houston Rockets #kennythejetsmith #kennythejet #sacramentokings #atlantahawks #houstonrockets #detroitpistons #orlandomagic #denvernuggets https://t.co/znXJPNnGgP",
    "602": "Most significant?? i wouldn't put Russ/Bobby in top 5. \n\nBut if we are talking the top 5 emotional days in Seattle  sports history, Id go...\n1- Sonics leaving\n2- Griffey trade to Cincy\n3- Sacramento Kings to Seattle Veto'ed\n4- Russ/ Bobby\n5- Shawn Kemp trade https://t.co/qhvEd9wkeR",
    "603": "@SacramentoKings Was there",
    "604": "“Aye girl, if I was a fourth quarter lead, and you were the Sacramento Kings, would you blow me for 12 straight mins?” https://t.co/HUkF5ZOfOp",
    "605": "@PokerProErik @TopShotKingdom @SacramentoKings @nbatopshot @Eisenberg43 @ElDumboTS @ChewieWoolf @_PuzzlePieceDad @Klasik916 @BeerdadB @SQxBR @ShotTalkin @ByHardy @sethisanderson @jaysonlew Well have to next show!",
    "606": "@SacramentoKings GO KINGS! 🏀🔥🏀\nhttps://t.co/tmaRH4VIa0",
    "607": "Damn it’s almost like the Stockton Kings are playing the Sacramento Kings. https://t.co/KPVUrxiGbX",
    "608": "The Indiana Pacers and Sacramento Kings after their trade https://t.co/R4ZhAiQRHS",
    "609": "Just finished talking NFL's craziest day, MLB fails once again to fix baseball, and defend Sacramento Kings fans as the most supportive fan base in the NBA.\nhttps://t.co/GEZ37j4f2j",
    "610": "@SacramentoKings I can listen to @GrantNapearshow catch phrases all damn day!! Good and many more bad years, Grant and Jerry kept it real and entertaining. Miss em both!!",
    "611": "@Natestoo @nbatopshot @retroblockchain Sacramento Kings",
    "612": "@SacramentoKings I was there for this one!",
    "613": "Sacramento Kings Owner Vivek Ranadivé to Bid for English Soccer Team Chelsea F.C. https://t.co/HIVIYQU3qo via @americankahani",
    "614": "The countdown of the top 15 moments in ARCO Arena continues 👑    \n\nAt No. 11: Ronnie Price's poster dunk on Carlos Boozer 💪 https://t.co/BI69NfUmoW",
    "615": "@SacramentoKings You mean a simple pass to a wide open guy?   Color me shocked.  A freshman in HS can make that pass or the old man at the local YMCA",
    "616": "@WSandretto Moon would get minutes on the @SacramentoKings",
    "617": "I mean he’s welcomed in Sacramento for saving the Kings… AND THATS IT https://t.co/9LJ9xQZ7xq",
    "618": "@MarcosBreton @Vivek @ChelseaFC @SacramentoKings no passion for basketball",
    "619": "@SacramentoKings @Golden1Center So why are there no women playing for the Kings?",
    "620": "Happy #InternationalWomensDay from all the women at the Kings! https://t.co/G0umGewdUU",
    "621": "In the afternoon, all female employees had the opportunity to provide support to women-focused and women-run nonprofit organizations offering essential services in our community. https://t.co/Z3v09D5Zpz",
    "622": "As the Kings celebrate Women's Empowerment Month, all female team members participated in International Women's Day activities beginning with guided meditation in the Grand Entrance of @Golden1Center. https://t.co/u3lCSkEquo",
    "623": "Today we celebrated #InternationalWomensDay all day long! https://t.co/J6hLPI2IcP",
    "624": "The scout was probably a Sacramento Kings scout https://t.co/BEvMgXw9ws",
    "625": "@PortPowerAZ @MarcosBreton @Vivek @ChelseaFC @SacramentoKings He wants to cherry pick like his 5 on 4 in basketball without getting called for offsides.",
    "626": "@MarcosBreton @Vivek @ChelseaFC @SacramentoKings I'm sure he wants to bring the Jazz Band ting across the Pond.",
    "627": "@HooksAndHoops @SacramentoKings At least you got to see a rare good Julius Randle performance 🤷🏽‍♂️",
    "628": "@MarcosBreton @Vivek @ChelseaFC @SacramentoKings I finally agree with you!",
    "629": "@PokerProErik @TopShotKingdom @SacramentoKings @nbatopshot @Eisenberg43 @ElDumboTS @ChewieWoolf @_PuzzlePieceDad @Klasik916 @BeerdadB @ShotTalkin @ByHardy @sethisanderson @jaysonlew @clegainz I mean, it was on Twitch first through TalkShot, which also came first, so I mean...",
    "630": "@JillAdge Happy birthday young lady. Thanks for putting up with us basket cases who are commonly known as SACRAMENTO KINGS FANS",
    "631": "@Brett678 @MarcosBreton @Vivek @ChelseaFC @SacramentoKings Makes him a villian in my book, should have let the team gonto Seattle. They'd probably give a shit about the game over money.",
    "632": "@SacramentoKings @quickquack @MADDOnline I'm trying to forget last night",
    "633": "@MarcosBreton @Vivek @ChelseaFC @SacramentoKings So I guess everyone has forgotten that @Vivek saved the Kings from moving to Seattle a decade ago?  This is consistent with my other observations of Kings fans. 🙄",
    "634": "Last night, the Kings and @quickquack honored @MADDOnline with a $5,000 check for their ongoing commitment to the community 🤝 https://t.co/3ON7mkxRQq"
}