{
    "0": "It's time for @utahjazz basketball as they battle the @LAClippers at Vivint Arena.\n\nCatch all the action on the @ZoneSportsNet.\n\n#TakeNote \nhttps://t.co/LqmyLf0ake",
    "1": "Utah Jazz - Los Angeles Clippers\n\nBet slip link: https://t.co/ltwFr6Uugu https://t.co/SVIg9qVIff",
    "2": "Don’t sleep on Utah Jazz doe…even though I can’t stand watching them play",
    "3": "LA Clippers vs. Utah Jazz 10:00 on ESPN (Rematch of last year's 2nd round series when the Clippers beat 1 seed the Jazz in 6 games, including the final 2 games without Kawhi Leonard) https://t.co/cJ2O8Y8Ndn",
    "4": "#NBA75     FREE PICK 12/15\n\nTerrance Mann u6.5 rebounds (-158) [2 UNITS]\n\nTerrance averages 2.4 rebounds per game against the Utah Jazz. I mean, with the size difference of Rudy Gobert I’d run away too.  \n\n🔗 Premium picks: \nhttps://t.co/tphAc4Ycdb https://t.co/FbL7hFrMXp",
    "5": "@cwillpaynetrain @utahjazz I got your moisture right here #idontknowwhatthatmeans",
    "6": "brought my dad to his first jazz game @utahjazz #TakeNote https://t.co/3r8cDJmlxS",
    "7": "Today's NBA Picks: 10:10 PM ET - Los Angeles Clippers vs. Utah Jazz - 22 PICKS AVAILABLE: https://t.co/cUwSH0rfCe #nba",
    "8": "@Celtics_PRam @utahjazz @celtics @danielrainge Pretty sure there's only ever been one player-for-player swap (Blue Edwards for Jay Humphries) between the Celtics &amp; Jazz. \n\nThey've been involved in a couple of those convoluted multi-team deals.\n\nAnd, in a deal without winners, Celtics traded a 3rd round pick for Fred Roberts.",
    "9": "Utah Jazz vs Los Angeles Clippers: Game Thread https://t.co/PgFZaWY35S",
    "10": "Me right now, trying to wide awake to see almost the first quarter #utahjazz #takenote https://t.co/CLdcZFS1zS",
    "11": "The @UtahJazz starting Conley, Mitchell, Bogdanovic, O’Neale, Gobert on Wednesday. #TakeNote #NBA",
    "12": "Los Angeles Clippers Vs Utah Jazz | Live Reactions And Play By Play https://t.co/Nao9OkEZX0 via @YouTube",
    "13": "@danielrainge Congrats, @danielrainge 🙌\n\nExcited to see what your expertise &amp; strategic direction will bring to the best franchise in the @NBA 🔥\n\n#takenote #utahjazz",
    "14": "Utah Jazz vs Los Angeles Clippers: Game Thread #takenote https://t.co/8i0nRKPRvp",
    "15": "🏀 Clippers vs Utah Jazz\n🏆 NBA\n🗓 15/dic.\n⏰ 23:59\n📺 ESPN 2",
    "16": "Out here supporting the best team @utahjazz  #TakeNote https://t.co/6bfej74LB1",
    "17": "Utah Jazz Starters:\n\nMike Conley\nDonovan Mitchell\nBojan Bogdanovic\nRoyce O'Neale\nRudy Gobert\n\nPlayers out:\nUdoka Azubuike\nJared Butler\n#TakeNote #NBA #NBATwitter #NBA75",
    "18": "Utah Jazz hire Danny Ainge as CEO of the franchise – NBA News https://t.co/jq9z1t88cZ",
    "19": "Tonight's starting lineup for the Utah Jazz: Conley, Mitchell, Bogdanovic, O’Neale, Gobert https://t.co/bVWH4AMCA2",
    "20": "#NBA | These games are about to begin!\nWashington Wizards vs Sacramento Kings \n&amp;\nLos Angeles Clippers vs Utah Jazz \nBET HERE:\nhttps://t.co/IT7pYFdaVg",
    "21": "@kslsports @BensHoops @utahjazz Who's Danny Ainge tho 🥸",
    "22": "#NBA | SPREADS FOR THE NEXT GAMES!\nWashington Wizards -1 -110\nSacramento Kings +1 -110 \n&amp;\nLos Angeles Clippers +9½ -110\nUtah Jazz -9½ -110\nBET HERE:\nhttps://t.co/0rTJpgSrdP https://t.co/G72mqECrB3",
    "23": "Did yall remember to SHUT THE FUCK UP AND BRUSH YOUR TEETH? @utahjazz",
    "24": "John Stockton was selected by the @utahjazz 16th overall in the '84 draft. And the rest is history. The #Jazz went on to make the playoffs in each of his 19 seasons while Johnny Legend became the GOLD STANDARD of floor generals. https://t.co/cBTf2OM0R9",
    "25": "Former Boston Celtics President Danny Ainge has been hired by the Utah Jazz as CEO\n@utahjazz \nhttps://t.co/RpxRHYBsyK",
    "26": "Remember last season playoffs? It’s payback time for Utah Jazz against LA Clippers.  \nWhich team will make you win some money tonight?\nBET NOW.\n\nhttps://t.co/0rTJpgSrdP https://t.co/2FY6Erjx6G",
    "27": "@LAClippers @utahjazz @BallySportWest @ESPNNBA @AM570LASports @TuLigaRadio @AguaCalientePS Cant wait",
    "28": "Jazz Nation, make sure to tune in to the @utahjazz pregame show with @AlemaHarrington and @themikesmithway 👀 #SwaggerBelt #TakeNote https://t.co/j4QUyQFTl7",
    "29": "@scoop_clippers @utahjazz Who’s your daddy ? https://t.co/cUeEozrQMt",
    "30": "From Ryan Smith, to Justin Zanik, to Quin Snyder, everybody is excited to add Danny Ainge's 40 years of experience to the @utahjazz. \n\nPlus, more details on his role, and how he figures into roster moves and decision making. \n\n#takenote \n\nhttps://t.co/82NkjSuG1l",
    "31": "Wanna bet the @utahjazz NEVER make a trade with the @celtics while @danielrainge is employed by them?",
    "32": "NBA Basketball Game Betting Picks Simulator: 10:10 PM ET - Los Angeles Clippers vs. Utah Jazz - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/oQoQCUY5kl #nba #sportsbetting #freepicks #cappertek",
    "33": "After nearly two weeks away from the comfortable confines of Vivint Arena — I’M BACK. The @utahjazz open up a six-game homestand tonight \nY’all already know what it is… time to go to work!!!\nLove you, ma\n\n#TakeNote #GoJazz #JazzNation #saltlakecity https://t.co/yKIohuqa5B",
    "34": "cold outside, but we're getting warm \n\n#TakeNote https://t.co/aL9lzUAKlm",
    "35": "Sacramento Kings - Washington Wizards\nUtah Jazz - Los Angeles Clippers\nPortland Trail Blazers - Memphis Grizzlies\n\nBet slip link: https://t.co/AlDTf7q3lW https://t.co/1vdedyK674",
    "36": "Keys to victory: Utah Jazz\nRudy Gobert has to make his presence felt in the paint tonight. Mike Conley will have to step up and take some of the load off Donovan Mitchell’s hands. Conley is an experienced veteran and I expect him to have a solid game.\n#LAVvUtaMrC https://t.co/YwGbj4EFHH",
    "37": "@utahjazz Great hire. Guess what Utetards, Alex Jensen is a great coach and Danny Ainge is a world champion and grand slam hire for the jazz. None of this depends on the school they attended. Ryan Smith is going next level for the jazz.",
    "38": "put me on the jumbotron @utahjazz #takenote https://t.co/9UkXijxDWt",
    "39": "@AlPawlowski Former Utah Jazz John Crotty.\nSee, we all once played NBA Live '95.\nAm I right @DreKnott ?😂",
    "40": "So I guess the Utah Jazz hired Danny Ainge 😩😏🙄\n\nI'm going to guess that the same guy who fired Kristen Kenny made this brilliant move as well.",
    "41": "Much to discuss! Tune in with us at 7:30PM MT for the Jazz Pregame Show 📺\n\n@ATTSportsNetRM https://t.co/SmZSlsA1Ns",
    "42": "Utah Jazz hire Danny Ainge as CEO of the franchise #DannyAinge #UtahJazz https://t.co/O8IcqDVTNm",
    "43": "@jamorantfan23 @utahjazz THAT CLIP OF DON HAS ME CRYING EVERY SINGLE TIME I WATCH IT😭",
    "44": "NBA LIVE TODAY🔴 Los Angeles Clippers vs Utah Jazz - 15th December 2021 |... https://t.co/nUNGUiFThB",
    "45": "@chikalenys @utahjazz @RyanQualtrics I guess Ryan should take Managment afvice from your sorry butt? Uh, no.",
    "46": "@nmgarn_utdude @CamFlowers_ @utahjazz Someone more qualified and realistically available",
    "47": "Stephen A. does NOT believe in the Utah Jazz 👀 | NBA Countdown - https://t.co/FiErGM7W5L temporary covers https://t.co/Bn9IBaC7CG - https://t.co/vs1GbMWWiQ",
    "48": "hey everybody: MEET THE UTAH JAZZ‼️🖤 @utahjazz https://t.co/3Ymn3h86Mb",
    "49": "@801Loaf @5kl @utahjazz @RyanQualtrics Lol. Ok",
    "50": "That @utahjazz @vivintarena lighting tho!! 🔥\n#TakeNote https://t.co/8zbAdzRjHA",
    "51": "Consensus Line Move:\n2021-12-15 Los Angeles Clippers at Utah Jazz from -9.50 to -11.50\n#TakeNote feeling frisky\n#NBA #sports #developer #luxury",
    "52": "@JacobCHatch @RyanQualtrics @utahjazz Ainge is also a former NBA champion!",
    "53": "@utahjazz We love a MIX",
    "54": "Mix or 𝗠𝗔𝗧𝗖𝗛?\n\n#VivintCam | @VivintHome https://t.co/lcVfdKuT37",
    "55": "@themikesmithway @utahjazz @AlemaHarrington I need some pointers! PURE!",
    "56": "The Utah Jazz hired Danny Ainge as alternate governor and CEO to oversee the franchise's basketball operations. \n#NBA #NBATwitter https://t.co/aKbGkor2iY",
    "57": "The Utah Jazz hired Danny Ainge as alternate governor and CEO to oversee the franchise's basketball operations. \n#NBA #NBATwitter https://t.co/5BjVg92yn2",
    "58": "@utahjazz this is the only reason why he took the job https://t.co/aGsCEo42g2",
    "59": "@NBA @utahjazz I've been honestly wondering why Donovan hasn't been getting any love so far this season",
    "60": "@BensHoops @utahjazz Was he drunk when he said this?",
    "61": "Utah Jazz hire Danny Ainge to oversee basketball operations https://t.co/8IWcTwOh0v via @usatoday",
    "62": "@RunBMC2020 @utahjazz Same issue with DWade?  Or is it just because it’s a BYU alum?  A championship winning player and GM is, good ol’ boys club now?   Would think an organization that’s never won a championship would try and bring In as much experience as possible. DWade and Ainge do just that.",
    "63": "Danny Ainge joins Utah Jazz’s front office as alternate governor, CEO https://t.co/SwvMro2VIL https://t.co/L2H0XoIQoj",
    "64": "@utahjazz @ATTSportsNetRM @ESPNNBA @ZoneSportsNet @kslnewsradio @vivintarena Ok but what are they wearing in the tunnel",
    "65": "As a Jazz fan doesn't really care about college sports I'm about to mute the words BYU and Utes. Especially now that this rivalry bullshit is seeping into Utah Jazz conversations.",
    "66": "@Regalbeast1 @bigdondoo @CamFlowers_ @utahjazz Don’t talk facts with some who has “thicc” in their name.",
    "67": "Utah Jazz blowout win incoming https://t.co/GplEu6lsP0",
    "68": "Tell @utahjazz it’s up tonight",
    "69": "#e_RadioUS Stephen A. does NOT believe in the Utah Jazz 👀 | NBA Countdown https://t.co/2nVCFdH0nT https://t.co/It6K8Jm499",
    "70": "LA Clippers head coach Tyronn Lue called the Utah Jazz offense a \"model for the NBA.\"",
    "71": "Danny Ainge: \"I needed a break from Boston.\"\n\n@ChrisForsberg_ reacts to Ainge's move to the Utah Jazz https://t.co/2CgQtUJt8U",
    "72": "Utah Jazz Hiring Danny Ainge as Alternate Governor and CEO, Per Report https://t.co/MZYEGzHxy4",
    "73": "@jinglesss5 @utahjazz if i were the celtics i would want bojan pretty badly. seems like he would fix a lot of their issues",
    "74": "Former Celtics GM Danny Ainge joins Utah Jazz as CEO in \"natural and perfect fit\" https://t.co/SC1nCBSJWc",
    "75": "Quin Snyder on the @utahjazz addition of Danny Ainge: \n\n\"Adding Danny and his breadth of experience both in management and playing, coaching -- I think it just adds to a group that's already very strong. and I look forward to it.\"\n\n#TakeNote | @KSLSports",
    "76": "Utah Jazz look to extend there winning streak to 8 games tonight against the LA Clippers. Utah is currently third in the Western Conference standings and hope to earn win number 20 tonight.\n#LACvUtaMrC https://t.co/QJ01LR0Py3",
    "77": "NBA Clippers @ Jazz Odds &amp; Free Pick - Expert NBA Sports Betting Picks 12/15/21 https://t.co/qT8ZSi0juK #vegas #gamblingtwitter #bettingtips #nbapicks #freenbapicks #nba #sportsbettingpicks #sportsbettingadvice #utah #jazz #losangeles #clippers",
    "78": "Danny Ainge joins Utah Jazz’s front office as alternate governor, CEO https://t.co/3gmPMJJYLJ",
    "79": "tell @utahjazz it’s up tonight",
    "80": "Danny Ainge joins Utah Jazz as CEO of Basketball https://t.co/HwOHBxxEqu",
    "81": "Danny Ainge joins Utah Jazz as CEO of Basketball https://t.co/vQJrqPmKbB",
    "82": "Boston Celtics: Former #Celtics head Danny Ainge hired by Utah Jazz as CEO - The Boston Globe https://t.co/LbRVh594Fg",
    "83": "The LA Clippers (16-12) take on the Utah Jazz (19-7) tonight for the first time since last seasons Western Conference Semi-finals matchup.\nThe Clippers took down the Jazz in 6 games. \n#LACvUtaMrC https://t.co/BKfDrzZkjk",
    "84": "@themikesmithway @utahjazz @AlemaHarrington Toes on the line. Some don’t count. More like 55 in a row. Now I got a chance.",
    "85": "@utahjazz Great move! #TakeNote",
    "86": ".@utahjazz has hired Danny Ainge as CEO and Alternate Governor. Ainge is a 'longtime friend' of owner, @RyanQualtrics.\nhttps://t.co/FbTUmzQ2jK",
    "87": "@chikalenys @utahjazz @RyanQualtrics Is Danny Ryan’s uncle? Did they match on https://t.co/qwHbLNpTXl via their dna test? Pretty big insider news you’ve got there.",
    "88": "@themikesmithway @utahjazz @AlemaHarrington To be fair, your foot was on the line for shot 64 so your streak of 3’s should still be intact!  🤣🤣",
    "89": "Absolutely love seeing the Utah Jazz become an extension of BYU. We may need to rebrand the team altogether. “Jazz” is kind of outdated.\n\n“The Utah Built Bars”",
    "90": "In the spirit of the season, may we all express gratitude for:\n\nThe moisture. \n\nThe  @utahjazz  playing tonight. \n\nYour mom. \n\n#GoJazz",
    "91": "Utah Jazz vs Los Angeles Clippers is on ESPN (US). With commentary from Mark Jones. Co-commentator is Vince Carter.  For more details see https://t.co/00jhPpVhg7 #UtahJazz #LosAngelesClippers #ESPNUS",
    "92": "Back in 1981 on a rainy night in Chicago I saw newly minted Utah Jazz CEO Danny Ainge play shortstop for the Toronto Blue Jays. https://t.co/FB5ILPgTDQ",
    "93": "Former Celtics head Danny Ainge hired by Utah Jazz as CEO https://t.co/h0JVUkJJii",
    "94": "Los Angeles Clippers vs. Utah Jazz - USA: NBA \n📺 Watch Live Here =&gt; https://t.co/qXVsPB6z4s\nThis match will start at 10:00 PM, December 15, 2021\nVenue: Vivint Smart Home Arena (Salt Lake City)\nPlease Like And Share, Thank You https://t.co/EsFunjrmW2",
    "95": "@myguyknowsaguy They're like the Utah Jazz last season, HOT STREAK!",
    "96": "@utahjazz What was his issue before?",
    "97": "“I don’t believe in Utah Jazz” - Stephen A Smith. \n\n#NBACountdown https://t.co/BjGmb7o6n3",
    "98": "@themikesmithway @StephenCurry30 @utahjazz This is awesome! Will the post game show be available on YouTube afterwards? We don’t get to watch those anymore with YouTube TV. :(",
    "99": "stephen a smith said you can’t beat the utah jazz cause they big man who is averaging 14 ppg 6 rebounds…",
    "100": "Boston Celtics: What does the hiring of Danny Ainge mean for the Utah Jazz? - Deseret News https://t.co/H60yugCCwN",
    "101": "Today's NBA Picks: 10:10 PM ET - Los Angeles Clippers vs. Utah Jazz - 21 PICKS AVAILABLE: https://t.co/cUwSH0rfCe #nba",
    "102": "Ok that’s it - someone want my season tickets ? @utahjazz",
    "103": "@Super70sSports And now he is the  CEO of the @utahjazz. https://t.co/Esq3XETPbo",
    "104": "Dave Checketts joins The Drive to discuss his return to American soil, Danny Ainge joining the Utah Jazz front office, a good start to the season already, working in the SLC market as an NBA exec + more\n\nhttps://t.co/3zPMb09Jzy",
    "105": "@jinglesss5 @DCHAndrew @utahjazz Jazz traded all their depth away in the Conley trade. Best to keep what we got and spread the minutes around to keep them fresh. Jazz are finally playing Forrest and others some. Unlike last year. Beat the Clippers and the league takes notice.",
    "106": "Danny Ainge on his way to Utah Jazz to ruin their roster https://t.co/RaHIysScSQ",
    "107": "My @utahjazz just copped Danny Ainge 🤯 ….. we making moves baby!!! #takenote",
    "108": "@utahjazz Ute fans generally against the hire, Coug fans generally for it. I wish everyone could take a step back. If Ainge played for a random school in the East, the negative reactions would not be what they are.",
    "109": "@JazzJoshy @sportsnerd4life @utahjazz Ryan has done nothing, but good for the jazz organization. I trust in his decision making",
    "110": "@GivemHekBrigham @nmgarn_utdude @CamFlowers_ @utahjazz Danny Ainge got fired from Boston.",
    "111": "@kfitzfitz @utahjazz @BrandoTr3y Happy birthday Brandon.",
    "112": "I just want to say thankyou @danielrainge for everything you have done for the @celtics. And good luck with @utahjazz!",
    "113": "@GivemHekBrigham @CamFlowers_ @utahjazz Lol, the super team won a championship....over a decade ago. You think he is going to replicate that in Utah? \"Name one person more qualified\"??? Are you for real? Are you suggesting there is not a single gm that has done a better job then him?",
    "114": "The Utah Jazz will have to win by double digits in order to cover a lofty spread at home against the Kawhi Leonard-less Clippers. The Jazz should win outright, but we explain why they won't win a fourth straight blowout in our NBA betting picks.",
    "115": "@JazzfanJustin @themikesmithway @Mr_Jayy_Redd @StephenCurry30 @utahjazz I got a like by @themikesmithway     Let’s go for 2",
    "116": "@jinglesss5 @utahjazz can you imagine! would be awesome. who would you trade for him?",
    "117": "@UtePadre And your new Utah Jazz head coach…Mark Pope.",
    "118": "@themikesmithway @StephenCurry30 @utahjazz I think the @utahjazz should use you as a ringer, just in case 😉",
    "119": "@utahjazz I’m shocked this isn’t getting more positive feedback. Ainge has a lot of experience and I’m sure he will be an excellent hire.",
    "120": "Breaking: Ryan Smith has just named Kevin J. Worthen the new President of Player Development for the Utah Jazz.",
    "121": "Freeze VIP \n\n🏀3U Abilene Christian -7 -140\n\n🏀2U Utah Jazz -8 -140\n\n🏒2U Rangers/Coyotes U5.5 -115\n\n🏀1.5U Washington State -6 -140\n\nParlay 1:\nAbilene Christian ML\nJazz ML\n\nParlay 2:\nAbilene Christian ML\nRangers/Coyotes U5.5 \n\nParlay 3:\nAbilene Christian ML\nJazz ML\nWash St ML",
    "122": "Utah Jazz hiring Danny Ainge as CEO, alternate governor after brief retirement  https://t.co/YG79Y51mpf",
    "123": "Former Celtics president of basketball operations Danny Ainge admitted that he \"needed a break\" from Boston during his introductory press conference after landing a front office job with the Utah Jazz. https://t.co/9w127IXSYw",
    "124": "about time Utah jazz back on national television",
    "125": "Check out @IamDrewNorton's preview of tonight's Western Conference matchup between the Los Angeles Clippers vs Utah Jazz. https://t.co/ig01CnMXGO #NBA #TakeNote #ClipperNation https://t.co/mLsxf8IOkT",
    "126": "@utahjazz Such a smart hire",
    "127": "BREAKING: The Utah Jazz have named me, Jimbo Rudding, the Jazz UJPWVM (Utah Jazz Podcast with Video Mayor). I'm excited to begin this new journey and as mayor I hope to make you all proud.",
    "128": "Okkkk now that Danny Ainge is running the UTAH Jazz can we give him his binky? Tatum for Mitchell straight up?? Who says no? #BleedGreen #Celtics https://t.co/N5RB3eOGfR",
    "129": "@nmgarn_utdude @CamFlowers_ @utahjazz What decisions? And Regressing from what? Multiple NBA finals?  A world championship? \n\nYou're making this hire... name one person more qualified",
    "130": "@utahjazz @byu1984fan Welcome Mr. Ainge. I don't believe they could have made a better choice.",
    "131": "Why Utah Jazz were right fit for former Celtics boss Danny Ainge to take over as CEO https://t.co/rqjXfoDy6f",
    "132": "Ainge was fired because of his comments. He didn’t leave the Boston Celtics to go to the Utah Jazz.",
    "133": "@NBA @utahjazz Davion Mitchell is back, should be an easy W",
    "134": "@utahjazz This thread is a sad reminder of how petty UofU fans are. Ainge is obviously a HUGE get for the small-market Jazz",
    "135": "@GivemHekBrigham @CamFlowers_ @utahjazz He's made some pretty awful decisions and did not managed the Celtics well. The fact that they are regressing is evidence of that.",
    "136": "@wojespn @utahjazz congrats??? https://t.co/wPPYA9Hujh",
    "137": "The NBA Today crew showing some love for the Utah Jazz... but more specifically @spidadmitchell  and @rudygobert27.  Nice to see these guys getting the recognition they deserve 😍 https://t.co/JVhAK39NfH",
    "138": "@BensHoops @utahjazz Danny gonna trade someone and piss off like 90% of fan base 😒",
    "139": "@5kl @utahjazz @RyanQualtrics Why not hire Ainge?",
    "140": ".@RyanQualtrics now has a former #NBA agent-turned-executive in Justin Zanik, former NBA champion &amp; future Hall of Famer Dwyane Wade &amp; former NBA player, coach &amp; executive Danny Ainge in his Jazz brain trust. Pretty brilliant moves being made the @utahjazz owner IMO. #TakeNote",
    "141": "@NBA @utahjazz Who cares? Not the playoffs",
    "142": "Utah Jazz hire Danny Ainge to executive role https://t.co/l5KPCfJ30k",
    "143": "@NBA @utahjazz Overrated team so who cares",
    "144": "@NBA @utahjazz yea yea bulls in 6",
    "145": "@utahjazz Oh boy. A move that alienates about half the fan base. \n\nYikes.",
    "146": "Have you been following the @utahjazz daily countdown calendar? Today's deal is 25% off @DisneyOnIce tickets. Use code: COCO to get your tickets now!\nhttps://t.co/CKvye9dIo3 https://t.co/bg3E8grlKa",
    "147": "@utahjazz Garbage hire",
    "148": "Boston Celtics: Former #Celtics boss Danny Ainge joins Utah Jazz as CEO - The Washington Post https://t.co/PQFWy3WMEG",
    "149": "Danny Ainge on roster building with the @utahjazz:\n\n\"Oftentimes the only deals that are available to you are the deals that don't make you better, you have to give up something to get something in return. So, we understand that the window of opportunity when disorganization.\"",
    "150": "@utahjazz If the Utah jazz doesnt win this year the Larry o b expect coaching change trade their players for a first rounder just like he did in Boston example trades kg,Paul pierce for picks I'm not shocked if he trades gobert,mitchell and clarkson for picks its make or break for jazz now",
    "151": "@utahjazz them too them too don don n nem",
    "152": "@utahjazz Well there goes there him breaking up the Utah jazz like he did in Boston",
    "153": "Translation: Danny Ainge will function in a similar role that Dennis Lindsey had (coupled with being an alternate governor) in that he will have oversight over basketball decisions, but not run day-to-day team operations. #utahjazz #NBA",
    "154": "Ryan Smith on final decision making with the @utahjazz:\n\n\"It's really not about whether I'm right, or Danny's right, or Justin's right, it's about us getting it right.\"\n\n#TakeNote | @KSLSports",
    "155": "The Utah Jazz are arguably the most balanced team in the NBA. Here's why: \n\n(Also... Richard and Perk finally play one on one. SMH) https://t.co/o9HyrXKDqS",
    "156": "@JacobCHatch @utahjazz I didn't know the state of Utah had given authority to Ryan Smith to hire the \"alternate governor.\"  What are his duties in the executive branch?",
    "157": "@wojespn Give the Utah Jazz the championship",
    "158": "Danny Ainge on his role with the @utahjazz:\n\n\"It's a different role as governor of course. But I'm not going to be the President of Basketball Operations. \n\nI'm not going to be running the day to day, that's going to be Justin.\"\n\n#TakeNote | @KSLSports",
    "159": "Jazz owner Ryan Smith said Justin Zanik's role will not change with the addition of Danny Ainge to the team's front office. #utahjazz #NBA",
    "160": "New @utahjazz CEO &amp; alternate governor Danny Ainge &amp; team owner Ryan Smith are addressing the media right now LIVE on 97.5-FM &amp; 1280-AM, your exclusive radio home of the Utah Jazz.\n\n#TakeNote #NBA75 #NBA",
    "161": "WORLD TOUR,  MLB. NFL, NBA.: Danny Ainge fue nombrado CEO de los Utah Jazz https://t.co/ydpG8e70bI https://t.co/K0C6NNevX0",
    "162": "Danny Ainge sitting in our black and white back drop. It really is Ryan’s Utah Jazz now https://t.co/FNAGNjKtrJ",
    "163": "New @utahjazz CEO &amp; alternate governor Danny Ainge is being formally introduced by team owner Ryan Smith right now LIVE on 97.5-FM &amp; 1280-AM. Tune in now!\n\n#TakeNote #NBA75 #NBA",
    "164": "Danny Ainge on joining the @utahjazz. \n\n\"This is a different role, it's a unique role in the opportunity to work with ownership and work with Justin and what they're doing.\"\n\n#TakeNote | @KSLSports",
    "165": "Was hoping @trailblazers would hire @danielrainge  to replace Neil Olshey, and bring one of Oregon's favorite sons home. But, happy for the @utahjazz and Danny.",
    "166": "Very impressed that the Utah Jazz have hired their own Governor. Excited to see who they’ll pick for Mayor. https://t.co/qDN9hYpdYc",
    "167": "Danny Ainge and @utahjazz owner Ryan Smith at Ainge’s introductory press conference. \n\n#TakeNote https://t.co/F0Y0opoaPs",
    "168": "Danny Ainge getting introduced as the newest member of the Utah Jazz front office: https://t.co/pTWLzNXVFG",
    "169": "Utah Jazz welcoming Danny Ainge to the team like: https://t.co/TP3dD5m4RD",
    "170": "Parlay im gunna throw out.\n\nSpurs fq ml\nUtah jazz ml\nAbilene ml\nOld miss ml\n\n+221",
    "171": "@utahjazz Awesome!",
    "172": "@ZoDaMenace @utahjazz I’m so sorry for y’all 😂😭\n\nHe’s a good rebuilder but he can’t capitalize on it and make a championship team",
    "173": "The reason Utah Jazz had low OffRtg to start the season was their poor 3pt shooting. Once they reverted to normal, their numbers picked up. I think the Warriors' case will be like that once they start making those open 3s and free throws.",
    "174": "“The guys like him are invaluable, and make your team who they are,” Utah Jazz guard Mike Conley said of teammate Royce O'Neale. “We know who he is for us and how much we value him, regardless of what the outside world might think.” https://t.co/CBDzw0GYdG",
    "175": "@Regalbeast1 @utahjazz Amen!!!",
    "176": "Steve Budin \n50 Dime\nNBA Line Error Lock\nUtah Jazz",
    "177": "12/15 CARD\n\n1Q Cavs -3.5 (2U)\nOKC Thunder +4.5 (1U)\nUtah Jazz -9.5 (1U)\n\nTeaser (2U)\nHawks -2.5\nCavs -5",
    "178": "Lmfao.. #UtahJazz hiring #DannyAinge pretty much whites itself...",
    "179": "Los Angeles Clippers @ Utah Jazz\n\nPlayer Points Projections\n\nhttps://t.co/VyOGeB0qG5",
    "180": "@UT_Thnkr20 @utahjazz Wouldn't be surprised if we're 15 in the West in a couple of days.",
    "181": "@utahjazz Welp.",
    "182": "🏀 Utah Jazz -8.5\n🏀 Denver Nuggets -4\n🏀 Grizzlies/Blazers Under 219.5\n🏀 Bucks ML",
    "183": "I feel like Danny Ainge temporarily running the Utah Jazz was quietly one biggest NBA developments of the season.",
    "184": "@utahjazz Pass, would hope for more diversity not less",
    "185": "@utahjazz I hope alienated fans is on @danielrainge’s radar. Toxic environment within fan base —the sociopolitical polarizing policies of the league have created a rift. Can’t pretend it’s not real. Other fans can shout insults on SM. It just underscores the problem.",
    "186": "Boston Celtics: Former #Celtics boss Danny Ainge joins Utah Jazz as CEO | The Sacramento Bee https://t.co/KqW0TH96Vd",
    "187": "Boston Celtics: Former #Celtics boss Danny Ainge joins Utah Jazz as CEO | The Sacramento Bee https://t.co/GtwYTUBGhG",
    "188": "Danny Ainge joins Utah Jazz's front office as alternate governor, CEO - via @ESPN App https://t.co/ohTy8aUQOy",
    "189": "@JLCauvin Nope. He texted me that he was following the sounds of trump’s voice and found some Utah Jazz fan taller than he w better range 😂",
    "190": "@utahjazz I’m in the minority, I think this is a great move.",
    "191": "Rudy Gobert is going to pass Mark Eaton sometime this spring for 2nd-most rebounds in Utah Jazz history, and I'm bummed Big Mark won't be there in person to congratulate him when it happens. #TakeNote",
    "192": "@NBASarah As someone who has been a Utah Jazz fan for 20 years but just logged on to my bird app 20 mins ago I'm still immensely confused. \n\nLike, I see the news. Can you summ up the controversy? I apparently haven't *umm* taken note..",
    "193": "@JimboRudding Probably should make an emergency Utah Jazz Podcast with Video about that news.",
    "194": "\"How 'Bout This Jazz\" podcast: For Utah Jazz center Rudy Gobert, he has plenty of fellow NBA players who either like to hate on him or seemingly just don’t respect him — for some reason. So what’s up with the disrespect of Rudy? https://t.co/f42XjNws8a",
    "195": "Former Celtics GM Danny Ainge has been hired as alternate governor and CEO of the Utah Jazz. https://t.co/29MPNBssl1",
    "196": "Utah Jazz most 3-pt shots made\n1. Joe Ingles - 1045\n2. John Stockton - 845\n3. Donovan Mitchell - 808\n4. Gordon Hayward - 689\n5. Bryon Russell - 540\n6. Darrell Griffith - 530\n7. Mehmet Okur - 517\n8. Deron Williams - 511\n9. Rodney Hood - 439\n9. Jeff Hornacek - 439\n11. Bojan B - 433",
    "197": "Bojan Bogdanovic only needs 7 3's to leap past Rodney and Jeff Hornacek for 9th all-time in 3-pt shots made in Utah Jazz history. #TakeNote",
    "198": "I dunno where all this Danny Ainge hate is coming from and at this point I'm too afraid to ask... I just want to see the Jazz win a chip and Gobert win finals MVP. 😭😭😭 #TakeNote @utahjazz",
    "199": "@JazzfanJustin @themikesmithway @Mr_Jayy_Redd @StephenCurry30 @utahjazz Their loss... our gain",
    "200": "@SGT_B_Dub @themikesmithway @Mr_Jayy_Redd @StephenCurry30 @utahjazz He really is. Always engaging always encouraging… just a great guy to have on your team. Huge loss for the Clippers…kinda like a certain Joe Ingles.",
    "201": "Danny Ainge has joined the front office of the Utah Jazz after stepping down from his role as the Celtics president of basketball operations in June. \n\nThe development makes it more fair than ever to speculate that Ainge was forced out by the Celtics. https://t.co/ixUyI1QTSX",
    "202": "@JazzfanJustin @themikesmithway @Mr_Jayy_Redd @StephenCurry30 @utahjazz I love when he finds pictures of fans at games and makes sure to tell them \"enjoy the game\".  Seems like a good dude",
    "203": "Dallas Mavericks - Los Angeles Lakers\nUtah Jazz - Los Angeles Clippers\n\nBet slip link: https://t.co/6QaHn4bhCi https://t.co/fBClRJhixI",
    "204": "@themikesmithway @Mr_Jayy_Redd @StephenCurry30 @utahjazz I’m so glad you are on the broadcast team, Mike. You do a great job and bring insights like this. It’s awesome, you’ve been a great addition to the broadcast.",
    "205": "Playing for the Utah Jazz is crazy Karl Malone is a top two scorer and in nobodies top 10. John Stockton has more steals and assist than anyone. Rudy is a three time DPOY and no one cares",
    "206": "Danny Ainge becomes CEO of the Utah Jazz. Why here? Why now? Myself and @JaredWeissNBA bring you the story, here - https://t.co/F9nlQIRk7Q",
    "207": "Huge show today!! Talking a lot of early #NSD.\n\n- 3:25 #BYU head coach Kalani Sitake\n- 3:50 @SBartle247 to talk Utah recruiting\n- 4:50 @Mitch_Harper on #BYU's early class\n5:05 Voice of Utah Jazz @DLocke09 \n\nPlus a whole lot more.\n\nTUNE IN: https://t.co/ABY2k5iB93",
    "208": "The @UtahJazz hire former @Celtics exec and @BYU legend Danny Ainge as CEO and Alternate Governor. https://t.co/OQS4NLt4ho\n\n@danielrainge @RyanQualtrics \n#utahjazz #dannyainge #news3now #localnews8",
    "209": "That’s all fine and dandy but what I want to know is who is going to be the Attorney General or the Speaker of the House for the Utah Jazz 🤔 https://t.co/GVmYdjpojA",
    "210": "@utahjazz Ewww... even if he does a great job I've never been a fan of Ainge. Not stoked about this hire at all! Ainge has really screwed some players over before. Hopefully the whole team is down with this hire and it's not just Ryan Smith hiring someone because he's a legend from BYU.",
    "211": "@CamFlowers_ @utahjazz The Nets signing KD and Kyrie in free agency had nothing to do with this sure. But still... when was the last time the Jazz were in the conference finals? 09?! But the trade didn't go through and he drafted Brown. What about when he swindled the Sixers and still got Tatum?",
    "212": "PTSD for the @utahjazz 😂 https://t.co/d2gv6Ps4rB",
    "213": "@Regalbeast1 @utahjazz LOL, NO!\n\nBecause he casted doubt on players in Boston complaining about racist fans, then doubled down by saying that players aren't qualified or educated enough to speak out on social justice matters.",
    "214": "The Utah Jazz hiring Danny Ainge is spectacularly on-brand for them.",
    "215": "What does the hiring of Danny Ainge mean for the Utah Jazz? – NBA News https://t.co/37cATsA9Oa",
    "216": "@utahjazz Sounds good https://t.co/YawiHsfYFE",
    "217": "@themikesmithway @utahjazz @AlemaHarrington Reggie, Ray, Lillard and Larry.",
    "218": "@RunBMC2020 @utahjazz Someone who gets it",
    "219": "@JcsCommentary Danny Ainge new CEO of Utah Jazz &amp; he made his first signing: https://t.co/pYhg8yA50r",
    "220": "Utah Jazz hire former BYU, Boston Celtics legend Danny Ainge https://t.co/TJzzJlxfZH",
    "221": "Danny Ainge Hired By Utah Jazz As CEO, Alternate Governor https://t.co/r4LPlR8KGe @1201PM",
    "222": "What does the hiring of Danny Ainge mean for the Utah Jazz? https://t.co/hWtfiQ7BqU https://t.co/YOlp5zaRuf",
    "223": "@utahjazz First poor hire by @RyanQualtrics. Dude has such a boner for BYU alumni, it’s clouding his judgement.",
    "224": "@DLocke09 One of the worst days in Utah Jazz history. Will result in the Vegas or Seattle, or Mexico City Jazz - there, I said it.",
    "225": "Danny Ainge Named CEO of the Utah Jazz https://t.co/Ju5ygDGAZ0",
    "226": "A great regular season team but we already know how it will be in the playoffs… not entertaining this🤣 #NBATwitter #utahjazz https://t.co/L0KIQrPwf1",
    "227": "@Regalbeast1 @utahjazz He squandered so much draft capital in Boston and nothing to show for it",
    "228": "BELLY BUSTER PICK OF THE DAY #2               NBA🏀🚨🔒:                                                                                 \n\nL.A. Clippers +9.5 (-110) vs Utah Jazz\n\n#BusterBets https://t.co/o1sq1UHi4G",
    "229": "NBA: Danny Ainge gets 'unique opportunity' with Utah Jazz as CEO ... https://t.co/lwHNcgKGmE",
    "230": "I hope #celtics fans are happy. I know @JLCauvin is happy he now has the best GM in the #NBA. #utahjazz \n\n🙇🏻🙇🏻🙇🏻🙇🏻🙇🏻🙇🏻🙇🏻🙇🏻🙇🏻🙇🏻🙇🏻🙇🏻 https://t.co/sbJRCPBSO9",
    "231": "@RealTylerRiggs @utahjazz Go Sportsball!",
    "232": "@utahjazz Lot of upset fans in the comments. I'm gonna hold my judgement til we see how this plays out, but I'm very unsure at this point.",
    "233": "@sportsnerd4life @utahjazz I'm a fan of what Zanick has done, and I can't think of a reason that the Jazz need more friction in his decision making process. I'd guess we see him leave sooner than later.",
    "234": "@jsjjazzfan78 I mean the 80s absolutely,  so you’re telling me the Utah Jazz vs. Chicago Bulls in the 98 finals had no off the ball defense 🤨",
    "235": "The Jazz take on the Clippers tonight at 7:30pm!\n\n@utahjazz | #TakeNote https://t.co/zMGRauYkW9",
    "236": "Here are the reported details on former Boston Celtics exec Danny Ainge’s new role overseeing the Utah Jazz’s basketball operations. https://t.co/7uGhQgdoT4",
    "237": "Leave @utahjazz  @DwyaneWade https://t.co/35ooP7SczB",
    "238": "@ByronicBookworm @chikalenys @utahjazz @RyanQualtrics Maybe they are breaking news that Ryan is actually Danny’s son!!!",
    "239": "@utahjazz Recycling",
    "240": "Utah Jazz hire Danny Ainge to oversee basketball operations https://t.co/T3ynaNnvlR",
    "241": "What do you think this does for the Utah Jazz? https://t.co/nzVAm0U4Gx",
    "242": "@Regalbeast1 @utescootin @utahjazz Memphis is right behind the Jazz too. They don't miss Mike 1 bit. They are stacked with young talent. Jazz are old.",
    "243": "@Agreenhalgh @utahjazz They’re welcoming brother ainge through the veil",
    "244": "Utah Jazz: Is it time for former BYU star Danny Ainge’s Utah homecoming — with the Jazz? https://t.co/DlXBcXjmep via @DeseretNews",
    "245": "This year @utahjazz https://t.co/pUl196vnP9",
    "246": "@Regalbeast1 @utescootin @utahjazz This was a bad hire. The head guy that traded 5 guys for Conley needed to be replaced long time ago. 3 of them start and 1 is still an unused draft pick. Korver wasn't so bad either.",
    "247": ".@utahjazz add Danny Ainge to front office\nhttps://t.co/TX39tZ5ag7",
    "248": "If Keith Van Horn became a coach or an executive for the Utah Jazz, I would be stoked! \n\nDon’t make it weird. Ainge is a winner and a champion. Huge get for the Jazz even if he is a Cougar. #TakeNote",
    "249": "@Regalbeast1 @utescootin @utahjazz He was an asshole as a player and terrible running the Celtics. Jazz owner is Mormon. Of course they cater to their own kind. Look around 500 miles in every direction.",
    "250": "@utahjazz Fun branding, but the black and white makes it seems like he is now dead.",
    "251": "@utahjazz God.... plz no",
    "252": "Bout to go through another fake ass lockdown, just keep sports on so I can bet. None of that Utah Jazz ritual shit again where niggas take 3 months off.\n\nThis bout to be the cycle from now on.",
    "253": "BREAKING NEWS – Danny Ainge named CEO of Utah Jazz Basketball – Crossover with John Karalis - https://t.co/m3mOYW55iJ",
    "254": "@utahjazz I thought he was dead 💀",
    "255": "Danny Ainge to oversee Utah Jazz's basketball operations.\n\n\"Ainge gets 'unique opportunity' with Jazz as CEO\" https://t.co/PakkC6NMyE",
    "256": "Breaking - Danny Ainge Named CEO of Utah Jazz Basketball with John Karalis of Locked On Celtics ... https://t.co/F2pyCw8eUT via @YouTube",
    "257": "Utah Jazz vs LA Clippers | Betting Odds, Tips &amp; Predictions https://t.co/ex9warL58R",
    "258": "@DougTones @utahjazz Haha you’re going to hear how y’all almost traded for everyone.",
    "259": "Jazz fans that are mad about the Ainge hire, help me understand? Give me logical reasoning for it being a bad move? #TakeNote #UtahJazz",
    "260": "@utahjazz @ATTSportsNetRM @ESPNNBA @ZoneSportsNet @kslnewsradio @vivintarena Let’s go Jazz 💛🏀",
    "261": "the cognitive dissonance of reading the words “Utah Jazz”",
    "262": "@CamFlowers_ @utahjazz Well over the last 5 years he's put together teams that have made the conference finals 3x soooooo maybe it is his job performance over the last 5 years that got him the job?",
    "263": "Andy Larsen Hour on Utah Jazz including Danny Ainge hire and RSL, National Signing Day + more - https://t.co/xfjo6bKukA @andyblarsen",
    "264": "@TheToddHarris @trailblazers @utahjazz This is cool, but I’m 😠 because I thought he was going to fix my @trailblazers. The rich get richer 😢.",
    "265": "Utah Jazz add longtime NBA exec Danny Ainge to front office – ZellaNews https://t.co/T4vKC15UHM",
    "266": "@utahjazz No we don't this is a bad move",
    "267": "@brendonnguyen9 @wojespn He the CEO of BYU or The Utah Jazz?",
    "268": "Utah Jazz hire Danny Ainge to executive role https://t.co/jmTUyWvrZt via @DeseretNews",
    "269": "Servant Preacher .@danielrainge to lead .@utahjazz #nephi #nba #churchball https://t.co/Ig27BES2EN https://t.co/YFUBiPiNgZ",
    "270": "@sportsnerd4life @utahjazz I've never been a fan of Ainge and the way he negotiates. I felt like Boston had issues in recent years because teams figured out Ainge never does fair deals. So, maybe he helps maybe he hurts. We'll see but on the surface I'm not a fan.",
    "271": "@kfitzfitz @utahjazz @BrandoTr3y Happy birthday Brandon!",
    "272": "Orlando Magic - Atlanta Hawks\nCleveland Cavaliers - Houston Rockets\nArizona Coyotes - New York Rangers\nUtah Jazz - Los Angeles Clippers\nAnaheim Ducks - Seattle Kraken\n\nBet slip link: https://t.co/rl0TwWjrz3 https://t.co/TSWfn8HcOM",
    "273": "@utahjazz @x_hems Ute fans are comical.",
    "274": "@utahjazz Goodbye to everything good about the @utahjazz. He will destroy it. https://t.co/aRU2e5JMhe",
    "275": "Danny Ainge joins Utah Jazz front office as alternate governor and CEO, per report https://t.co/TIp8Bbhsql sad for my @trailblazers happy for the @utahjazz",
    "276": "@utahjazz @ATTSportsNetRM @ESPNNBA @ZoneSportsNet @kslnewsradio @vivintarena Win baby",
    "277": "First the Boston Celtics, now the Utah Jazz. I don't know where the triple crown city is for Danny Ainge is, but he'll be there at some point",
    "278": "Danny Ainge joins the Utah Jazz as the alternate governor and CEO of Jazz Basketball and the Smith Entertainment Group. #UtahJazz #DannyAinge #MiguelMikeMedina",
    "279": "@gwapojas @utahjazz byU enough said👎",
    "280": "SALT LAKE CITY (AP) — Danny Ainge, who helped the Boston Celtics win two NBA titles as a player and another as a team executive, is the new CEO of the Utah Jazz. https://t.co/Wj2lRUJ6gD",
    "281": "After stepping down from leading the Celtics front office in June, Danny Ainge is returning to the NBA. This time Ainge lead the Utah Jazz as their Alternate Governor and CEO.\n\n@GeorgeBalekji | #NBA | https://t.co/qFBBXwiFRL https://t.co/W29Ld8Of2o",
    "282": "@dirtyspyrte2 @utahjazz Lol they whoever runs their twitter always does this shit!",
    "283": "@TannerSpencer1 @utahjazz @wgu 🤣 exactly!",
    "284": "@AaronJFentress @dwightjaynes Winning program in Utah Jazz CEO, or struggling program in Blazers GM ... hmm, probably never had a chance in the first place.",
    "285": "Former Celtics boss Danny Ainge joins Utah Jazz as CEO – NBA News https://t.co/EqHd3mQ9Im",
    "286": "@utahjazz So many people hating this but how about we see what he does?",
    "287": "It's an @NBA doubleheader on Sportsnet tonight! 🏀\n\nThe @Lakers pay a visit to the @dallasmavs then the @LAclippers take on the @utahjazz. Who ya got? 🤔 #NBAonSN https://t.co/ZP04GVxD0Z",
    "288": "Danny Ainge is back in the @NBA \n\nThe former @celtics President will join the @utahjazz as a alternative Governor and Chief Executive Officer\n\nAinge stepped down from his post in June #Celtics #Jazz #NBA https://t.co/9cptedbYlI",
    "289": "@samjohnson How are you I’m @DLocke09, radio voice of the Utah Jazz.",
    "290": "@Regalbeast1 @utahjazz This has nothing to do with Utah and BYU, Ainge is terrible.",
    "291": "@Regalbeast1 @utahjazz Wake up, Dan is the wrong person to be running this team.\n\nHe's neither good at running a team nor is he the person you want as CEO if you want to foster an image and culture of racial equality in Utah.",
    "292": "Utah Jazz hiring Travis Hansen, Nick Emery, and the Reid brothers to be chief executives in charge of rascal shenanigans",
    "293": "@danielrainge Please allow for naturally immune people to have AT LEAST the same access as vaccinated people to the arena #utahjazz \nScience matters   Being woke isn’t on par with the science #NaturalImmunity",
    "294": "@utahjazz Because he is a Mormon???",
    "295": "Utah Jazz hire Danny Ainge as CEO and alternate governor https://t.co/sQg92zriks",
    "296": "@utahjazz Didn't see that coming.",
    "297": "LOVE this move by the @utahjazz !!!! So many great moves being made and while there is a lot of flash from several Western Conference teams there's  a HELL of a lot of substance in Salt Lake City right now. 👀👀👀👀 https://t.co/Qsrm4Z54Ep",
    "298": "UPDATE: Utah #Jazz have hired former Boston Celtics GM Danny Ainge to oversee the team’s basketball operations. \n\nCould Dealin’ Danny make a big trade in Utah soon? https://t.co/JDUMQN7q4o",
    "299": "Boston Celtics: Danny Ainge joining Utah Jazz's front office as alternate governor, CEO, sources say - ESPN https://t.co/AL6JzW5xy7",
    "300": "@Celtics__Pats @utahjazz Boston is shit haha",
    "301": "@utahjazz @ATTSportsNetRM @ESPNNBA @ZoneSportsNet @kslnewsradio @vivintarena Let's go!!  Redemption!!",
    "302": "The @LAClippers and @utahjazz are set to battle it out 😤\n\nCheck out what @Gamble_IQ has as his prediction and top bets to place 👇\nhttps://t.co/Xer3DtxiJ7 https://t.co/Cxoc07wi9z",
    "303": "Danny Ainge taking control of the Utah Jazz is REALLY convenient for my agenda",
    "304": "Snow day? ❄️ Game day!\n\n⏰ 8 PM MT\n📺 @ATTSportsNetRM | @ESPNNBA \n📻 @ZoneSportsNet | @kslnewsradio \n🎟 https://t.co/kSIBafwe3U\n📍 @vivintarena \n\n#TakeNote https://t.co/zhR9U8DEDu",
    "305": "@CamFlowers_ @utahjazz I am sure his collegiate affiliation has nothing to do with it. It's all due to his spotty resume.",
    "306": "https://t.co/izWFJilk2k\n\nThe Utah Jazz will name former Boston Celtics player and longtime president of basketball operations Danny Ainge the franchise's new CEO of basketball and an a...",
    "307": "@KendrickPerkins @utahjazz Now they can lose in the 2nd rd with a new CEO 😩",
    "308": "Danny Ainge Becomes Utah Jazz CEO: The former Blazers guard is joining a division rival. \n\nYou can cross one name off the Portland Trail Blazers general manager search. \n\nAccording to ESPN’s Adrian Wojnarowski, the Utah Jazz have named former… https://t.co/1pguOsqBYw #RipCity https://t.co/uBrfwsDf8a",
    "309": "@Regalbeast1 @utahjazz 1) I don't care what party he is affiliated with. He's made political contributions to both parties. \n2) This is about DANNY not Ryan.",
    "310": "Leaked footage of Danny Ainge after getting fired by the Celtics and getting approached by NBA teams without a history of racism in the job market. \n\nUntil finally taking his talents to the Utah Jazz. https://t.co/26BIFxF9H5",
    "311": "@utahjazz Oh god…",
    "312": "@utahjazz @pkkkthorup2007 @wgu Yeah, but you continue to disappoint in the playoffs 🤦🏾‍♂️",
    "313": "Danny Ainge joins Utah Jazz's front office as alternate governor, CEO - ESPN https://t.co/J99GLrLhES https://t.co/HLc0okxBcR",
    "314": "Danny Ainge joins Utah Jazz front office as alternate governor and CEO, per report – NBA News https://t.co/GrDd2N0SeW",
    "315": "@illiteratecoug @utahjazz Maybe they can hire ex-Jazz man LarryK to offset him.",
    "316": "Rip Utah Jazz. Danielle Ainge is overseeing ops.",
    "317": "@wojespn For @utahjazz sake don't let him near the draft. All those bums on the Celts bench are Ainge picks.",
    "318": "@utahjazz He could be the one to finally bring a ring to Utah. The Jazz need the right tools and Danny's championship experience could be exactly what is needed to get over the hump.",
    "319": "Wade greeting Danny Ainge in the Utah Jazz hallway for the first time.. https://t.co/PbyzCQjtm4 https://t.co/HWXYyPmqd8",
    "320": "@danielrainge - Congrats on the president of basketball ops for the @utahjazz ! Sorry to see you leave the @celtics \nAdams Bowl invite is open for you in 2022. I know you are familiar with the layout ! ⛳️",
    "321": "@Regalbeast1 @utahjazz Ryan is not a liberal nor is he innovative in his ownership of the Jazz. He is only innovative in comparison to the Millers.\n\nWhere did I say racist?",
    "322": "Kiss the Dennis Lindsey, Justin Zanick Utah Jazz culture goodbye.",
    "323": "Report: Ex-Celtics president Danny Ainge to join Utah Jazz as alternate governor and CEO of basketball operations https://t.co/VM0daQ1kMc",
    "324": "@utahjazz All Jazz players are hereby put on notice that They may be almost traded any day now!",
    "325": "5 defensive-minded NBA trade targets for the Utah Jazz to pursue (via @sell_dalton)\nhttps://t.co/21Nzmil6Mz",
    "326": "@utahjazz What’s wrong with singe?",
    "327": "@sportsnerd4life @utahjazz Been successful at every level.  It really doesn't get any better than this.  Haters can hate all they want, but Ryan Smith isn't dumb, he knows that bringing in this kind of experience is a homerun.",
    "328": "@ChadinRipCity Well, it really looks like the Bumbling Blazers really knocked it out of the ballpark this time! They lost Danny Ainge to the Utah Jazz... Terrific! Brovo Blazers! What next? Can't wait... 🤔🙄",
    "329": "Special shoutout to the Dallas Mavericks and the Utah Jazz for allowing this to happen. Forever grateful. ❤️ https://t.co/Vjp9PoSc2L",
    "330": "@chikalenys @utahjazz @RyanQualtrics You keep using that word, but I don't think you know what it means.",
    "331": "TONIGHT: We reach 25,000 commentator games listed in our database of national NBA telecasts. It took 8,748 games with 391 people commentating at least once.\n\n🏀 @LAClippers at @UtahJazz\n\n📺 @ESPNNBA @ESPNPR\n🕙 10:00 PM EST\n\n🎙️ @MarkJonesESPN\n👨‍🏫 @MrVinceCarter15 https://t.co/9yQ4m9EAe4",
    "332": "OK #jazznation, time to open up a can of worms…. Are you a fan of the @utahjazz and Danny Ainge hiring? Yay or nay, and why? #TakeNote",
    "333": "Another night, another @LAClippers game day, #ClipperNation!\n\nTonight we have NBA Finals cockblocker @JoeIngles7 &amp; the @UtahJazz so if you happen to be at the game, MAKE SOME NOISE. Have a great rest of your Wednesday, let’s extend that winning streak, and GO CLIPPERS!!!! https://t.co/kIv6e6bOuD",
    "334": "@247Sports was supposed air Nyjalik Kelly commit live and they are re-airing conversation about Danny Ainge taking over as Utah Jazz executive. On NSD? 🤦‍♂️. The important thing is Canes rec'd NLI from Kelly per @GabyUrrutia247",
    "335": "@JaylynScottt Maybe that’ll happen… Because if I’m Danny Ainge I just took over the Utah Jazz, dirty Dwyane Wade is the first guy I’m firing",
    "336": "@utahjazz What!?!?",
    "337": "Harper is already a big Utah Jazz fan! She’ll be watching the game tonight. @utahjazz @JazzSupporters @JazzNationNews #TakeNote https://t.co/rWZxqWkGHb",
    "338": "@LandonAinge @utahjazz 😂 congrats, @danielrainge!",
    "339": "The #UtahJazz #Jazz officially hired Danny Ainge as alternate governor and CEO. He will oversee basketball. Justin Zanik will remain general manager. President Jim Olson will continue to run business operations. https://t.co/8qyF1ehe7i",
    "340": "@Regalbeast1 @utahjazz Why would I give a shit where he played college ball 40 years ago? \n\nI don't want someone who has 0 recognition of racial inequality to be the CEO.",
    "341": "NEWS UPDATE: Former Celtics boss Danny Ainge has been hired by the Utah Jazz to head their basketball operations… His title there will be “alternate governor and CEO” https://t.co/cNxiBSUKme",
    "342": "@utahjazz Jazz are becoming Byu north",
    "343": "@utahjazz Oh man they fucked it up big time",
    "344": "@wojespn @VernonMaxwell11 😂 this is as Utah Jazz as it can get",
    "345": "Utah Jazz make massive change in front office with new hire – NBA News https://t.co/wrgFoRToCH",
    "346": "@youarejball @CormStormin @utahjazz Has to do more with his lack of racial awareness that disgusts me. Terrible hire for the team culture.",
    "347": "@nickthequick16 @utahjazz Yeah but he’s still top ten in franchise points, assists and top 20\nin rebounds. Was out best player for a few years, I can respect his game and still hate it",
    "348": "@utahjazz The perfect Christmas Gift. https://t.co/ViiSKyvI4C",
    "349": "@utahjazz Well this is definitely a wrinkle",
    "350": "@greenbean3742 Danny Ainge joins Utah Jazz's front office as alternate governor, CEO",
    "351": "@utahjazz Excited to see all the Ute fans that quit the Jazz over this. Cleanse the fanbase.",
    "352": "@utahjazz Why not promote Zanik @RyanQualtrics?",
    "353": "Danny Ainge's first move as CEO of Utah Jazz Basketball. https://t.co/wLddezk06S",
    "354": "@utahjazz Glad I don’t have the channel anymore https://t.co/rH8B0Mm7MW",
    "355": "Utah Jazz hire Danny Ainge as CEO and alternate governor https://t.co/6sjGioqswk",
    "356": "Analyzing Wednesday’s Los Angeles Clippers at Utah Jazz odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/GANk2DffxI",
    "357": "@utahjazz We want you to know that we don't like it https://t.co/zAMe0ut2Gi",
    "358": "📹| How does Rudy feel about facing the Clippers tonight? 🧐\n\n#ShootaroundInterviews | @ZionsBank",
    "359": "Former Celtics head Danny Ainge hired by Utah Jazz as CEO, per report https://t.co/dsh8MOUBIh",
    "360": "Danny Ainge joins Utah Jazz front office as alternate governor and CEO, per report https://t.co/x4e9PHtsuw https://t.co/oLsSfJpIbu",
    "361": "@denverbros @utahjazz Not in my book.  It's FGH in this house.",
    "362": "@utahjazz Now all the “Trader Danny” jokes belong to you and you can’t return them. I don’t make the rules. Thanks be to God, finally! @celtics",
    "363": "insidehoops: Danny Ainge named CEO of Utah Jazz https://t.co/HEQtGNOchn",
    "364": "@utahjazz \"We\" will be doing no such thing",
    "365": "Los Angeles Clippers at Utah Jazz odds, picks and prediction https://t.co/pPR8xEssg6",
    "366": "@wojespn @espn_macmahon \"Rarely do you get an opportunity to come into a franchise that is this close to being a special team. It’s a very unique opportunity.\" \n\nBREAKING! The Utah Jazz have traded Rudy Gobert to the Boston Celtics for Bruno Fernando and a 35M Trade Exception.",
    "367": "Former-Celtics president Danny Ainge has been hired by Utah Jazz as alternative Governor and CEO https://t.co/MmoiHw43xM",
    "368": "@utahjazz Every star he \"almost\" trades for adds a year to his unholy reign.",
    "369": "@utahjazz Seriously?? Why does this state seem to always take two steps forward then three steps back when it comes to progressing??  At the end of the day… good ol’ boys network still reigns over all else.",
    "370": "@RealTylerRiggs @utahjazz Can I have your tickets lol",
    "371": "Ainge to oversee Jazz's basketball operations: The Utah Jazz hired Danny Ainge as alternate governor and CEO to oversee the franchise's basketball operations. https://t.co/zkND3GfUZE https://t.co/4oXrzlS6eE",
    "372": "Whoa… @danielrainge coming back to Utah to run basketball ops for the @utahjazz??? 🎉🤯 #homecoming",
    "373": "Former Celtics head Danny Ainge hired by Utah Jazz as CEO, per report https://t.co/TjYn6yCGCM https://t.co/sA659lIHZl",
    "374": "I was close enough #utahjazz #dannyainge https://t.co/qWH1HLGD4a",
    "375": "@utahjazz Good luck 👍",
    "376": "@CormStormin @utahjazz Lots of dudes have rings. I see a lot of BYU guys coming to his defense. I get that you love it's \"your guy\". Let me reiterate this has nothing to do with that for me. I just don't think it's a good fit for the organization. Especially culturally",
    "377": "@utahjazz This is a terrible hire of a disgusting man.",
    "378": "@iwasacuteboi @utahjazz I’ll juice this Spencer. He will be great.",
    "379": "Danny Ainge named CEO of Utah Jazz: https://t.co/pR2Qb2v3Df",
    "380": "@utahjazz “Really‼️”👏🏼🏀👏🏼🏀👏🏼",
    "381": "HAHAHAHAHA god speed @utahjazz https://t.co/4wHvd2Xv1l",
    "382": "Danny Ainge joins Utah Jazz's front office as alternate governor, CEO - via @ESPN App https://t.co/vOcCkzYsqM",
    "383": "@CoachJustinWest Was gonna say happy birthday until I saw that Utah Jazz lanyard.",
    "384": "@utahjazz with a great move bringing in @danielrainge \nWatch out Western conference, #44 is the best!",
    "385": "@DOsably @utahjazz @KyrieIrving Dude is super intelligent, he just has a different opinion than you.",
    "386": "Utah Jazz hire Danny Ainge to oversee basketball operations https://t.co/0n37hIrtrf",
    "387": "Utah Jazz to name Danny Ainge an alternate governor and CEO of basketball - https://t.co/DAVr0NePwO https://t.co/4li9HtyfQx",
    "388": "@LandonAinge @utahjazz I’m sure he can find you a good gig though 😂😂",
    "389": "@kslsports @utahjazz @wojespn What is Alternate Governor? Who is he replacing?",
    "390": "@KSL5TV @utahjazz @kslsports Governor??  Alternate to Cox?🙃",
    "391": "@utahjazz Gross.",
    "392": "The Utah Jazz jokes just write themselves at this point. We’ll see come post season.",
    "393": "Without reading this I bet it is not the Director of Diversity and I bet its with the Utah Jazz. Let's see if I'm right... https://t.co/id5MdMYjSx",
    "394": "@utahjazz How is this a good idea?",
    "395": "According to multiple sources, the Utah Jazz have almost pulled off, like, so many trades that would make them elite, you guys, seriously",
    "396": "Former Celtics head Danny Ainge hired by Utah Jazz as CEO, per report https://t.co/6odQlmV4Dl https://t.co/S77guiDXMs",
    "397": "@youarejball @utahjazz Lol. Has a ring…",
    "398": "@utahjazz He played at my golf course a while back  time, and I politely asked how his round was and he could not have been a bigger asshole. The guy he was with picked up on it and was a nice guy.",
    "399": "@nickthequick16 @utahjazz I was kidding but Hayward is still a top 15ish jazz player",
    "400": "Utah Jazz vs LA Clippers | Betting Odds, Tips &amp; Predictions https://t.co/jdnE1M4w2B https://t.co/9CBrMyUQCK",
    "401": "The Utah Jazz are hiring longtime NBA executive Danny Ainge to oversee basketball operations. https://t.co/LGS9mOfawQ",
    "402": "@Regalbeast1 @utahjazz 18 years with the Celtics and a title back in 2008.  Don't act like the Jazz just hired a \"Diamond.\"",
    "403": "@hoopsjock His son is in the government in Utah they are Mitt Romney fans the whole Mormon thing.  Now a Mormon runs the Utah jazz they couldn't be happier.",
    "404": "It's official my chances on becoming the @utahjazz GM are officially tarnished.",
    "405": "@utahjazz The ol’ second baseman himself",
    "406": "LMFAO GOODBYE UTAH JAZZ CHUCK CURSE SO REAL AINT EVEN 24 HOURS HAHAHAHA https://t.co/EdlkDmJ5Me",
    "407": "Utah Jazz hire Danny Ainge to oversee basketball operations https://t.co/8hgkBKf6Hd",
    "408": "NBA: Danny Ainge appointed alternate Governor and CEO of the Utah Jazz. \n\nhttps://t.co/kW4ZaEJQEc\n\n#NBA #Jazz https://t.co/qiJdkTsnhH",
    "409": "Deron Michael Williams is an American former professional basketball player. 2005 NBA draft by the Utah Jazz. On Saturday he will box Frank Gore on Showtime at #paulvswoodley2 @VegasSports2Day @HardRockHolly @AgFight https://t.co/ximvbRLjAu",
    "410": "@utahjazz Stupid",
    "411": "Danny Ainge joining Utah Jazz's front office as alternate governor, CEO, sources say - via @ESPN App. #NBA.  https://t.co/NXlSW2S0FV",
    "412": "@themikesmithway @StephenCurry30 @utahjazz 77, those are rookie numbers you have to pump those numbers up!",
    "413": "@denverbros @utahjazz Dude screw Gordon Hayward. He left and we were better without him.",
    "414": "Utah Jazz Hiring Danny Ainge as Alternate Governor and CEO, Per Report https://t.co/Jk2h7tpXHa",
    "415": "Dell Curry spent his rookie year on the Utah Jazz but had a hard time getting on the floor with Bobby Hansen and Darrell Griffith ahead of him on the SG depth chart. Jazz traded him next offseason to Cavs for C Mel Turpin.",
    "416": "@RealTylerRiggs @utahjazz Alright. I didn’t know Ainge has a past of racist undertone. But 1) I don’t want you to be away from the franchise, we need you.  2) Steinbrenner had a past of racist undertones yet we didn’t have you leave the Yankees.  Please re consider. 😂",
    "417": "@utahjazz Damn... Fuvkkkkkkkk. I hate Boston.",
    "418": "\"Sources close to the Utah Jazz say that Ainge was this close from trading for...\" https://t.co/FWRb2KPUGt",
    "419": "🚨Breaking News: The Utah Jazz Bear will now be replaced by Cosmo The Cougar.",
    "420": "@utahjazz I love this aaddition!!!✅💯",
    "421": "Woj: Utah Jazz hire Danny Ainge to oversee basketball operations https://t.co/i6CWAuXiXW",
    "422": "@utahjazz People that don’t get this are clueless. DA is the player whisperer. He’s unrivaled in his balance of talents. Welcome D!",
    "423": "@utahjazz @RyanQualtrics this is a bad management decision on your part. Nepotism rarely works out long term.",
    "424": "@utahjazz BOOOO.  Ryan Smith helping out a BYU guy.  No other reason than that for this move.",
    "425": "Today - 5 years ago (15/12/16) - UTAH JAZZ GAME https://t.co/ms89TJ8wup",
    "426": "Big news out of Salt Lake City! After 18 years with Boston Celtics, Danny Ainge joins the Utah Jazz as their CEO. https://t.co/0fIZuSiVLH",
    "427": "@utahjazz are @BYUCougars North baby. #DannyAingeCEO",
    "428": "Utah Jazz hire Danny Ainge as CEO and alternate governor\n\nhttps://t.co/fu2e8AJZxZ",
    "429": "@utahjazz Throwback to Jeremy Evans!",
    "430": "Utah Jazz officially announce the appointment of Danny Ainge as CEO of Utah Jazz Basketball. Ainge will also represent the team as an Alternate Governor on the NBA’s Board of Governors. https://t.co/FRkBQcSLxD",
    "431": "The Utah Jazz are hiring former Celtics President of Basketball Operations Danny Ainge to oversee basketball operations, naming him alternate governor and CEO, per @wojespn https://t.co/mWJ4NBwPYM",
    "432": "The ultimate Danny Ainge Heist.  He goes to Utah under-cover… trades Mitchell to boston for Horford and salary fillers.  Boston’s new big 3… Tatum, Brown and Mitchell.  Ainge retires again.  Rebuild complete!  You heard it here first!  #celtics #NBA #utahjazz https://t.co/Ss7MLZ83sQ",
    "433": "BREAKING: Utah Jazz hire former BYU, Boston Celtics legend Danny Ainge as alternate governor, CEO\n\n@TalkinSports2 \nhttps://t.co/gHqkER0NG8",
    "434": "This is awesome the Utah Jazz 👏🏽👏🏽👏🏽 https://t.co/4eGrFGjEuq",
    "435": "@Tylerthegamer23 @utahjazz Yeah I’m just meme’ing",
    "436": "Jazz fans, why is everyone boo'ing the appointment of Ainge as CEO? I get he didn't have the best of endings at Boston - but is that the only reason? Need some more context 🤔\n#TakeNote #UtahJazz",
    "437": "The Jazz hire Danny Ainge as 'Alternate Governor and CEO'\n\n#nba #utahjazz #dannyainge",
    "438": "For those confused by todays hiring I think this answer from Tony sums it up pretty well on how things will work for Zanik &amp; Ainge\n\n#JazzNation #UtahJazz #TakeNote https://t.co/nGwYPBOM1A",
    "439": "@Gabriels_Daddy_ @mikeec721 @StoolGreenie It’s a long season. It’s not even Christmas and we just got our second all star back lol but sure use this moment in time to make us look bad and talk up the consistent playoff chokers the Utah Jazz",
    "440": "@utahjazz I love it.",
    "441": "@utahjazz Dumb move",
    "442": "@jaynftbeliever 1. Cleveland Cavaliers\n2. Atlanta Hawks\n3. Philadelphia 76ers\n4. Los Angeles Lakers\n5. Milwaukee Bucks\n6. Oklahoma City Thunder \n7. San Antonio Spurs\n8. Minnesota Timberwolves\n9. Utah Jazz\n10. Portland Trail Blazers\n11. Washington Wizards\n\nMy TS username: StathisVog",
    "443": "Danny Ainge is joining the Utah Jazz as the team’s “alternate governor and CEO”, per @wojespn https://t.co/C0g42rTQuQ",
    "444": "\"Danny Ainge joining Utah Jazz's front office as alternate governor, CEO, sources say\" https://t.co/KIOXPjPUFz",
    "445": "@ZoWrId @utahjazz Praying for your poverty franchise as well.",
    "446": "@utahjazz Nobody wanted this",
    "447": "NBA: Utah Jazz are hiring former Celtics GM Danny Ainge as alternate governor and CEO - Woj  https://t.co/96CoAhjhBZ",
    "448": "Tune in tonight to the Jazz pre game show. Steph Curry is obviously the greatest shooter in NBA history. I’ll reveal the next 4 best. I think you’ll be surprised. @utahjazz @AlemaHarrington #jazzpregame",
    "449": "@utahjazz Wtf guys?...",
    "450": "The Utah #Jazz have named Danny Ainge who is a close friend of new Jazz owner Ryan Smith as their new CEO of Basketball Operations. \n\n#TakeNote",
    "451": "Utah Jazz hiring Danny Ainge as CEO, alternate governor after brief retirement – NBA News https://t.co/1Fijjp1ROI",
    "452": "The Utah Jazz might as well change the name to the Utah Cougars",
    "453": "Hey @VernonMaxwell11 just wanted inform you that there is even more of a reason to despise the Utah Jazz now. https://t.co/Qn6oSt3dNc",
    "454": "@denverbros @utahjazz I understand your frustration, but Hayward never wanted to be here.",
    "455": "A move that was bound to happen. Former #Celtics GM, Danny Ainge, is heading back home to Utah. @wojespn reports he will now be the @utahjazz CEO and Alternative Governor #TakeNote \n\nhttps://t.co/xl8BF5xxgB",
    "456": "Ainge officially joins #UtahJazz https://t.co/4yYbEkxZtx",
    "457": "Reports: Jazz hiring Danny Ainge as CEO #DannyAinge #NBA\n #utahjazz #TakeNote  https://t.co/6NmcWtkP5y",
    "458": "@utahjazz It’s been a good run Jazz Fans…",
    "459": "@Celtics__Pats @utahjazz No it means Jaylen Brown to Utah",
    "460": "@utahjazz No we don't.",
    "461": "@utahjazz I actually own this exact B-Russ jersey LOL! https://t.co/XxuVkZxcyD",
    "462": "Utah Jazz got D Wade and Danny Ainge",
    "463": "@utahjazz Good hire! Can’t wait to help him bring us a ring here in Utah!! #TakeNote #UtahJazz #DannyAinge #WinningCulture  #GoJazz !!",
    "464": "Former Celtics head Danny Ainge hired by Utah Jazz as CEO, per report https://t.co/rHmmmBSfs8",
    "465": "Danny Ainge's official title is \"Alternate Governor and CEO\" meaning he will represent Smith Entertainment Group and the Jazz on the NBA's Board of Governors as needed. #utahjazz #NBA",
    "466": "@fox13 @utahjazz Oh boy!",
    "467": "@utahjazz Praying for Utah fans",
    "468": "I’m just waiting for the “Utah Jazz owner is a BYU fan, Utah Jazz CEO played basketball at BYU, therefore, Utes suck! WEEEEEEEEEE!” Twitter takes.",
    "469": "Former Celtics head Danny Ainge hired by Utah Jazz as CEO, per report https://t.co/oUDkWvuscN",
    "470": "Danny Ainge reportedly takes job with Utah Jazz https://t.co/qEPl5asPq7 https://t.co/THyStkO6wD",
    "471": "@utahjazz I don't",
    "472": "@utahjazz You want me to welcome danny ainge? The guy who stole Hayward from us?",
    "473": "@utahjazz Who’s the next byu alumni to be employed??",
    "474": "Just to be clear, I love you if you are a Utah Jazz fan no matter what, where are you come from, what you look like or where you studied. \n\nUnless you are racist, then we have issues. Other than that all love. \n\nGo Jazz. Let’s get a ring. One ring. That’s all I ask for.",
    "475": "@utahjazz very residentsleeper",
    "476": "@utahjazz Wait, what? Wow!",
    "477": "@utahjazz Why did you put it in black and white I thought he died",
    "478": "@utahjazz Douche",
    "479": "The Utah Jazz are hiring Danny Ainge as alternate governor and CEO, sources tell ESPN. Ainge will oversee basketball and Justin Zanik will remain GM.\nVia: Shams https://t.co/DO0uM8mNtr",
    "480": "@utahjazz This is a bad, bad idea",
    "481": "@utahjazz not a fan of this decision… 😑 Justin Zanik is what our future should be #disappointment",
    "482": "Danny Ainge returns to the NBA as the CEO of Utah Jazz basketball. Justin Zanik remains the GM. Ainge, a longtime friend of Jazz owner Ryan Smith, will oversee basketball operations. #utahjazz #NBA",
    "483": "Danny Ainge running the Utah Jazz is the least surprising thing to happen in the NBA this year.",
    "484": "Danny Ainge joining Utah Jazz's front office as alternate governor, CEO, sources say - via @ESPN App https://t.co/q4VqnTcMcd",
    "485": "@utahjazz Im expecting the same type of welcome when I visit in april ❤️",
    "486": "@jsnshep THIS!  Two big names in the NBA at the Utah Jazz.  It's huge. They could have gone anywhere.",
    "487": "@utahjazz Welcome DA💛",
    "488": "Danny Ainge to be named CEO of basketball ops for Utah Jazz, reports say\n\nhttps://t.co/tBiBTFM5Qc #utah #takenote",
    "489": "We want to welcome Danny Ainge as CEO of Utah Jazz Basketball.\n\nhttps://t.co/EczriIoygZ https://t.co/wOuzunNI8b",
    "490": "Danny Ainge is back in the NBA.\n\nHere are the reported details of his new role with the Utah Jazz: https://t.co/lVkvOVI3nC",
    "491": "#BREAKING Danny Ainge to be named CEO of Basketball Operations for the @utahjazz, multiple reports claim. https://t.co/WV7aM9xect",
    "492": "One “I have black friends” haven to another RT @wojespn: The Utah Jazz are hiring Danny Ainge as alternate governor and CEO, sources tell ESPN. Ainge will oversee basketball and Justin Zanik will remain GM.",
    "493": "@RealTylerRiggs @utahjazz Well as long as you’re on board with the Aggies then we good lol.",
    "494": "The term “alternate governor” implies Danny Ainge will hold an ownership stake in the Utah Jazz.",
    "495": "Danny Ainge to Utah Jazz as their alternate Governor and CEO go head Danny lol",
    "496": "What?…. Wow.. Danny Ainge joining Utah Jazz's front office as alternate governor, CEO, sources say - via @ESPN App https://t.co/xY7uWE3iYx",
    "497": "#NBA L.A. Clippers vs Utah #FreePick from Covers Expert Sean Murphy.\n\n@Murphy_Sports rides the hot hand with the Utah Jazz as he expects them to continue their 7 game win streak! - https://t.co/ElcSiITG39 https://t.co/uX8wJN4i5D",
    "498": "I hope the Utah Jazz are ready for a whole bunch of almost trades and almost signings",
    "499": "BREAKING: The @utahjazz have reportedly hired Danny Ainge to serve as the team’s CEO and alternate governor.\n\n@kslsports #TakeNote \nhttps://t.co/CuZlX6is6n",
    "500": "Danny Ainge joining Utah Jazz's front office as alternate governor, CEO, sources say - via @ESPN App https://t.co/tJVabIUVnB",
    "501": "The Utah Jazz just hired Danny Ainge.\n\nIn 2019, Danny Ainge showed disdain for NBA athletes like LeBron and Curry responding to Trump’s attacks, but said he does respect Pop and Kerr as people. https://t.co/eatGtjKDGb",
    "502": "Word is the @utahjazz are also looking at this guy for an alternate alternate governor. \n\n#JazzNation https://t.co/NXcKyq29uj",
    "503": "Utah Jazz add Danny Ainge to front office\nhttps://t.co/AJDwvo4z9k",
    "504": "Danny Ainge Hired By Utah Jazz As CEO, Alternate Governor https://t.co/4vCgORcxuN",
    "505": "Utah Jazz hiring Danny Ainge as CEO, alternate governor after brief retirement https://t.co/VngKytx0rm",
    "506": "Utah Jazz to hire Danny Ainge as alternate governor and CEO\nhttps://t.co/WRr4LQrVBD",
    "507": "Danny Ainge is joining the @utahjazz as the CEO and Alternate Governor per @wojespn. \n\n#TakeNote \n\nhttps://t.co/LBLy6YHKPw",
    "508": "@danielrainge please trade for Tatum! He'd be great with the @utahjazz !",
    "509": "Exciting news for @utahjazz fans. https://t.co/mzbHzTKzVk",
    "510": "Multiple league sources confirm to MassLive @wojespn's report that Danny Ainge is heading to Utah Jazz as CEO, alternate governor. Latest on the move: https://t.co/lNfaqazUvq",
    "511": "The Utah Jazz in two years after hiring Danny Ainge. https://t.co/AT3Uxfr08X",
    "512": "Day 6 of tweeting @spidadmitchell @rudygobert27 @utahjazz @RyanQualtrics or @DwyaneWade until I get invited to sit courtside at a home game.",
    "513": "Clearly, @utahjazz, Danny will make good decisions. Just look at his choice of quarter-zips. https://t.co/0aJPQpwbV5",
    "514": "It was speculated for months but it is official, Danny Ainge is a part of the Utah Jazz front office! #NBATwitter https://t.co/Zh2EKKg6zX",
    "515": "#BREAKING Per @wojespn: The @utahjazz are hiring #DannyAinge as alternate governor and CEO\n\n#NBA #NBATwitter #TakeNote https://t.co/G4KAfZu9T2 https://t.co/MDDZIEaAT6",
    "516": "The Utah Jazz Hired Danny Ainge. 😂😂😂😂😂😂😂😂😂😂😂😂😂😂. https://t.co/Ck6olL6mGZ",
    "517": "there's always a Mad Max tweet when it comes to the shitty utah jazz",
    "518": "Stupid excited to see @utahjazz spend the next 4 years as the 7 seed with Danny “trade assets” Ainge… https://t.co/eGAM0TlX2o",
    "519": "The Utah #Jazz are hiring former Boston #Celtics general manager Danny Ainge as their Alternate Governor and CEO. He’ll oversee basketball operations for the team.\n\n#NBA #NBATwitter #TakeNote #3ptcnvrsn https://t.co/bONR0RQBNZ",
    "520": "@KendrickPerkins @utahjazz The man Laker fans hated back in the day.  A very cerebral player. 2 sports, too!",
    "521": "Lets go!! #TakeNote #NBA #NBAtalk #UtahJazz https://t.co/qzpGJLnSoD",
    "522": "Utah Jazz reportedly hire Danny Ainge to executive role https://t.co/FwhmFvLAKH https://t.co/hxJy7qudfU",
    "523": "The Utah Jazz are hiring Danny Ainge as alternate governor and CEO, per @wojespn.\n\nAinge's title is Alternate Governor and CEO of Jazz Basketball. https://t.co/zk86nm45su",
    "524": "@janecoaston Once the legitimacy of \"Utah Jazz\" was conceded, the victory of uncoolness was never in doubt.",
    "525": "Danny Ainge will be the new CEO of Basketball Operations for the Utah Jazz, a source confirms to @Tjonesonthenba.\n\nAinge was previously the Celtics' President of Basketball Operations from 2003-early 2021. https://t.co/W6RVeY4oYr",
    "526": "I wish Spida, Jordan Clarkson, and Mike Conley success\nI do not wish the Utah Jazz success\nI wish for them to give that name back to New Orleans",
    "527": "Hope this is not the beginning of the end for the Utah Jazz - they need one more big risk-taking move, and I'm just not sure thats in Ainge's DNA.",
    "528": "@janecoaston If they were still in New Orleans, yeah. Alternate Governor of Utah Jazz Basketball can only be one man. https://t.co/jsigeqHUML",
    "529": "🧐 RT @wojespn: The Utah Jazz are hiring Danny Ainge as alternate governor and CEO, sources tell ESPN. Ainge will oversee basketball and Justin Zanik will remain GM.",
    "530": "Rumor: Boston Celtics are trading a bunch of former Danny Ainge draft picks, along with possible future picks, to the Utah Jazz for either Donovan Mitchell or Rudy Gobert. #TakeNote #BleedGreen https://t.co/9YsF5xVqdi",
    "531": "@wojespn The Utah Jazz will now be reluctant to ever commit a trade",
    "532": "The Utah Jazz are hiring Danny Ainge as alternate governor and CEO. He’ll oversee the basketball side of the franchise. \n\nAinge stepped down from his role as Celtics’ president of basketball operations last summer:\nhttps://t.co/5zQu5CQda8",
    "533": "Utah Jazz are hiring Danny Ainge as alternate governor and CEO, per @wojespn https://t.co/RY7aZMlA58",
    "534": "BREAKING: Utah Jazz have hired former long-time Boston Celtics executive Danny Ainge to be their alternate governor &amp; CEO. \n\nAinge will have a hand in all of the decisions made for the team. \n\nThoughts on the hire? 🤔 https://t.co/GVLM8wcLX2",
    "535": "@ski_824 The Utah jazz hire, he responded it",
    "536": "Danny Ainge is *almost* governor of the Utah Jazz https://t.co/8zbGKq6O3G",
    "537": "Utah Jazz en route to being awful because they hired the most braindead NBA exec in history Danny “Happy to have 87 second round picks” Ainge",
    "538": "@wojespn That’s too bad, I really wanted him in the Blazers Organization, Great; good hire Utah Jazz",
    "539": "BREAKING: @utahjazz are hiring Danny Ainge as alternate governor and CEO, according to @wojespn. \n\nStory to come on https://t.co/212sFF9EK9 https://t.co/g8kOURxdZy",
    "540": "Utah Jazz are adding to their front office https://t.co/1xW4QCL4Tf",
    "541": "BYU basketball alumnus Danny Ainge is joining the Utah Jazz front office after stepping down as the Boston Celtics’ president of basketball operations in June of this year. https://t.co/siPD5lrpdP",
    "542": "@KendrickPerkins @utahjazz Horrible gm I’m sure it was a better African American candidate that could do the same job",
    "543": "Danny Ainge becoming the head of basketball operations for the Utah Jazz seems like a big fail by the @trailblazers to me.",
    "544": "@wojespn Are the Utah Jazz a State of their own?",
    "545": "@KendrickPerkins @utahjazz Great move when he traded you",
    "546": "Report: The Utah Jazz are hiring Danny Ainge. He will server as an alternate governor and CEO for the franchise. (Per @wojespn)",
    "547": "@RyanQualtrics @utahjazz sorry ass Franchise get this bum away from this team https://t.co/gIAmLvNz6L",
    "548": "Tried to tell y’all Danny was on his way 🤷‍♂️\n\n#TakeNote #UtahJazz #Jazz",
    "549": "@Tjonesonthenba When the Utah Jazz almost trade for Zion in 2 years but hold out so they don't have to include an extra 1st round pick in the deal &gt;&gt;",
    "550": "Lmao.. destroyed Boston Celtics and now goes to Utah Jazz. Can't make this stuff up. 😂😂😂 https://t.co/5k0VCsvGGS https://t.co/HgFO2Xjiqu",
    "551": "Of course it’s the Utah Jazz that hires Ainge after Boston… https://t.co/MqH0hYfPu3 https://t.co/XSTdo1BlTP",
    "552": "It was only a matter of time!!! Great move by the @utahjazz Carry on... https://t.co/SDTd9OHAj4",
    "553": "The Utah #Jazz are hiring former #Celtics President of Basketball Operations Danny Ainge as alternate governor and CEO of Utah Jazz. He will oversee basketball operations.\n\nAinge had “retired” in June. Seems more and more like he was fired. #NBA https://t.co/FDFTXc2CLb",
    "554": "Can confirm Danny Ainge will be CEO of basketball operations for the Utah Jazz, as Woj reported",
    "555": "watch out @utahjazz  Danny Ainge will send all your best player to Boston. https://t.co/nMy24HKvC9",
    "556": "@ChadinRipCity The Utah Jazz have just taken advantage of Danny Ainge's unemployment. Why didn't the Blazers call him?",
    "557": "Danny Ainge meeting with the Utah Jazz front office to accept their CEO position https://t.co/jlCmqePCnE",
    "558": "🚨 The Utah Jazz are hiring Danny Ainge as their CEO, per @wojespn https://t.co/U7QpQZd289",
    "559": "The Danny Ainge running the Utah Jazz was about the most predictable thing to happen in the NBA.",
    "560": "The Utah Jazz are just the Mormon Boston Celtics without the championships",
    "561": "@wojespn The most Utah Jazz hire they could have made",
    "562": "@wojespn He’s the governor of Utah jazz now wow",
    "563": "just like we all thought, danny ainge and dwade working together on the Utah Jazz https://t.co/dPlUEKAVsk",
    "564": "BREAKING: The Utah Jazz are hiring Danny Ainge as alternate governor and CEO of Utah Jazz.",
    "565": "The Utah Jazz are hiring Danny Ainge as alternate governor and CEO, sources tell ESPN. Ainge will oversee basketball and Justin Zanik will remain GM.",
    "566": "My boys plays tonight here at home!!! @utahjazz #takenote",
    "567": "@PleasureASF @LAClippers @utahjazz @BallySportWest @ESPNNBA @AM570LASports @TuLigaRadio @AguaCalientePS Maybe. Maybe not",
    "568": "I am bored, exams over and have nothing to do so here is a thread of my favourite pictures in sports history\n\n#1- Michael Jordan's final series clinching shot in 98 vs Utah Jazz. I love this black and white version in particular, just the faces of everyone transfixed on the bball https://t.co/y2wU2cOpdF",
    "569": "@utahjazz tonight baby https://t.co/Ryp8B9li4a",
    "570": "@pw3nva @utahjazz @BrooklynNets @KyrieIrving Did you watch the full interview and the one in August? He didn't sound ignorant at all. He actually sounded super informed.",
    "571": "Check my betting analysis for tonight's marquee matchup between the Utah Jazz and the visiting Los Angeles Clippers.\nhttps://t.co/DLAFVi5gCO",
    "572": "More @NBA action tonight when @LAClippers face @utahjazz in a very tight game. You wanted betting odds? We got you covered, check them out here 👇\n\nhttps://t.co/24AZRvc9mV\n\n#NBA #utahjazz #ClipperNation",
    "573": "@limbkristacraig @utahjazz @limbkristacraig You are welcome.",
    "574": "@HawksOnBally @DWilkins21 @maggiehendricks But Nique was not drafted by the Hawks. He was drafted by Utah Jazz and traded to Hawks for John Drew +",
    "575": "What the Utah #Jazz are pursuing ahead of the #NBA trade deadline - Revealed, via @HoopAnalysisNet. \n\nhttps://t.co/7IyTuy2q2y",
    "576": "@benjamingazzi @Throwaw30161755 @MiddleAgedJoker @kiani_rumbo @RubinReport @GavinNewsom @GovRonDeSantis Yes, like a lot of people do. I also watch Utah Jazz NBA Basketball games. Does your tiny mind have a cliche quip for that, too? Maybe something about Mormons and polygamy, just to really hammer in how completely original you are?",
    "577": "all the vibes. last time we played the utah jazz  https://t.co/y1Q8RrYOra",
    "578": "Warren Lotas x @utahjazz making 17 weeks pregnant look good. ❄️🏔 #TakeNote https://t.co/6TlTEKrSce",
    "579": "- The Detroit Pistons have lost 12 games in a row\n- The Utah Jazz have won 7 straight games\n- The Trail Blazers have lost 6 games in a row",
    "580": "@ed_edd_eddielee Not gone happen. Wade own % of Utah Jazz and Lebron too far gone",
    "581": "We loved seeing alum Donovan Mitchell '15 featured on the cover of SLAM magazine! Read about how this Brewster grad is chasing an NBA title for the Utah Jazz in this awesome feature: https://t.co/BmbN5dCFS0 #BrewsterAcademy #BobcatNation #BrewsterAthletics @BrewsterHoops",
    "582": "@RideUTA @utahjazz Thanks!",
    "583": "@limbkristacraig @utahjazz Yes, the southbound FrontRunner from North Temple Station after the end of the game will take you to Lehi Station. Hope that helps!",
    "584": "@RideUTA @utahjazz We will actually need to ride Frontrunner back to Lehi. Will that have one after the game as well?",
    "585": "NBA Wednesday same game parlay (+1004): Los Angeles Clippers vs Utah Jazz https://t.co/W0h1nsQdxc https://t.co/cd0XwFyJbu",
    "586": "@limbkristacraig @utahjazz Hey there, Craig — We will hold the last northbound and southbound trains at North Temple Station immediately following the end of the Utah Jazz game. Be sure to board TRAX shortly following the game. Have fun!",
    "587": "Utah Jazz vs LA Clippers | Betting Odds, Tips &amp; Predictions https://t.co/V8J1Qktugk",
    "588": "@RideUTA is there extended Frontrunner service tonight since the @utahjazz game doesn't start until 8 pm?",
    "589": "So far the Utah Jazz have been able to dodge COVID-19 infections. Last year they were able to stay relatively unscathed as well. Wonder how much that has to do with having veteran team with families.",
    "590": "@dnpcdshow @utahjazz @BrooklynNets @KyrieIrving Stockton was fun to watch &amp; may be a 'legend' but he's ignorant on vaccinations.\nAnd he's \"proud\" of Kyrie's ignorance?\nHe has as much common sense as he has NBA championships.",
    "591": "Tonight’s Jazz Clippers game will be on ESPN &amp; also AT&amp;T SportsNet (for local audience)\n\n#JazzNation #UtahJazz #TakeNote https://t.co/V3W7BYfHuh",
    "592": "@LAClippers @utahjazz @BallySportWest @ESPNNBA @AM570LASports @TuLigaRadio @AguaCalientePS Tmann gets to see his son today",
    "593": "Game day in SLC. \n\n🕖 7:00PM PT \n🆚 @utahjazz \n📺 @BallySportWest, @ESPNNBA\n📻 @AM570LASports, @TuLigaRadio https://t.co/bTmAR6sEMR",
    "594": "@VatoNba @LAClippers @utahjazz @vivintarena Don't shovel dirt on 'em yet! Clips just beat Boston in these unis last week. Change is a'comin'.",
    "595": "@ClipsUniTracker @LAClippers @utahjazz @vivintarena Damn, if there was any chance we could sneak a W now it’s gone. This team can never win in that cursed uniform.",
    "596": "@utahJAZZ__ @KashVixen Weird",
    "597": "His venerated 3-point shooting aside, Royce O'Neale's stats don't jump off the page. And yet his Utah Jazz teammates all say he's one of the team's most important players, because of all the little things he does just to set the tone for success. https://t.co/aOl9LCElhA",
    "598": "Despite being a quiet presence, Royce O’Neale is the ‘pulse’ of the Utah Jazz, teammates say (Salt Lake Tribune),  \n⁦@mconley11⁩ a well deserved  shout out to ⁦@BucketsONeale00⁩.\nUtah Jazz BB tonite…much needed. https://t.co/ZgXbM48K1I",
    "599": "@C_SaccoIV @utahjazz @wgu Welcome to sports stats Carlo.😂 Where they literally make up crap for everything. \"This is the first time that so-and-so has worn red reeboks for 3 1/2 games in a row and scored 5 free throws while having their jersey tucked in, in NBA history!😯\"",
    "600": "The latest episode of @FoodOfTheGodsP1 features @utahjazz nutritionist &amp; chef Anthony Zamora, RD, who ensures #TakeNote players are fueled for the #NBA's 82-game schedule &amp; are putting spinach in ALL the smoothies. Listen here - https://t.co/JEULgaFmnh - or wherever you get pods! https://t.co/Ir9YfMG38X",
    "601": "Uniforms for today's matchup between the Clippers and Jazz\n@LAClippers Statement ⚫️\n@utahjazz Association ⚪️\n🕖 7:00 PM PT\n🛣️ @vivintarena \n📺 Bally Sports SoCal / ESPN\n#ClipperNation #CanoeNation🛶 https://t.co/mXvZRxMcIh",
    "602": "@utahjazz Congratulations!♥️🏀",
    "603": "Still mad @utahjazz for bring Covid 19 into the sports. With that being said how come the NFL has problems but the NBA does not ????",
    "604": "Let it be known that we are a Utah Jazz podcast that is in no way affiliated or supportive of John Stockton and/or the rapist Karl Malone. https://t.co/nOevUVKGIt",
    "605": "New \"How 'Bout This Jazz\" podcast episode🚨\n\nThis week, @tribjazz, @andyblarsen &amp; I talk:\n\n✅ Why is Rudy Gobert disrespected by other players, at times?\n✅ Utah Jazz trade reports\n✅ Which is the most impactful dynasty in NBA history\n\nListen now! 🎧👇🏽 https://t.co/GEk5hH23Vt",
    "606": "Boutta catch back to back L’s in the finals call her the Utah jazz https://t.co/VK5w9ubaBR",
    "607": "@SGS_3 @vivintarena @utahjazz @cavs The loudest fan in the NBA’s loudest arena 😂",
    "608": "In the latest \"How 'Bout This Jazz\" podcast episode, the guys discuss why Utah Jazz center Rudy Gobert is seemingly disrespected at times by other NBA players. Plus, are we seeing the apex of Quin Snyder's offensive creativity? https://t.co/6XFk5sE0Gk",
    "609": "@KOT4Q Talk abt the Utah Jazz please! 🙏",
    "610": "Karl Malone's Utah Jazz is the favorite to beat MJ's Chicago Bulls in the 98 NBA Finals. https://t.co/feIlHzHKKt",
    "611": "🗑️ #NBA Big Odds!\n\n⏰ Thu, 6:00 a.m\n\n🏀 Utah Jazz vs Los Angeles Clippers\n\n#Clippers have won their last 5 games against #UtahJazz \n\nShinda na M-Bet leo https://t.co/bYFGK4TIzM au Piga *798# https://t.co/jEkNsI4B8r",
    "612": "The Utah Jazz play basketball on national television tonight",
    "613": "Consensus Line Move:\n2021-12-15 Los Angeles Clippers at Utah Jazz from 216.50 to 217.50\nOver this just in\n#NBA #vegas #dataanalytics #business",
    "614": "@BasedPistons Indiana Pacers rolls off the tongue better than Indianapolis Pacers same for Utah Jazz vs Salt Lake City Jazz",
    "615": "Jazz vs. Clippers TONIGHT\nfind yourself some tickets 🎟 \n\nVividSeats tickets as low as $8.00\nLINK 👉 https://t.co/Mh5JokmYQG\n\nTicketMaster tickets as low as $10.00\nlower bowl $50\nLINK 👉 https://t.co/mljNOLw6CJ\n\n#JazzNation #UtahJazz #TakeNote\n#NBA #VividSeats #TicketMaster https://t.co/HxIgQ0tVGG",
    "616": "🔥Wednesday🔥\n\n25*\n\nParlay (-141)\nNBA Cleveland Cavaliers -400\nNBA Utah Jazz -425\nSoccer Borussia Dortmund -955\n\nParlay (+100)\nNBA Philadelphia 76ers -215\nSoccer Borussia Dortmund -275 for 1st Half",
    "617": "@SuicidePass The all time king of this will always be the Utah Jazz",
    "618": "LOCKED ON JAZZ - How are the Utah Jazz better than a year ago?  Previewing the Los Angeles Clippers - https://t.co/MkQuA2qwg6",
    "619": "@KOT4Q Talk about the Utah Jazz?",
    "620": "Royce O’Neale’s statistics don’t necessarily jump off the page. And yet, no less than Mike Conley calls him “the pulse” of the Utah Jazz. It’s about far more than simply “he’s a good defender.” Here’s why. https://t.co/syFSIbn72c",
    "621": "Haha, Chucks face vs their reactions! 😂 I agree Chuck! Go Jazz! #TakeNote @utahjazz https://t.co/peZqSW0fuX",
    "622": "The latest story in the partnership between The Salt Lake Tribune and Salt City Hoops has @danclayt0n looking at the unofficial start of the NBA’s trade season — specifically, who the Utah Jazz might send out, and who they could possible get in return.\nhttps://t.co/hwNvedBUPU",
    "623": "@OShiitakeShroom @utahjazz That's literally me when i'm watching hockey games",
    "624": "@OShiitakeShroom @utahjazz Nice hope you have fun I've been watching your videos for about a year now",
    "625": "Trade restrictions lift for most offseason acquisitions today. As the NBA's de facto trade season begins, @danclayt0n takes a deep dive into the Utah Jazz's assets, limitations and possible targets.\n\nhttps://t.co/Q7XUFVeaGO",
    "626": "Consensus Line Move:\n2021-12-15 Los Angeles Clippers at Utah Jazz from -8.50 to -9.50\n#TakeNote shhhh...\n#NBA #CryptoHoops #sabermetrics #entrepreneur",
    "627": "Your Price: $31.99 - Utah Jazz Mitchell &amp; Ness Hardwood Classics Tonal Snapback Hat - Purple https://t.co/2cRXrCtfqp https://t.co/voG3QMmxH4",
    "628": "The Utah Jazz play basketball today.",
    "629": "Los Angeles Clippers vs. Utah Jazz NBA Prediction12/15/21 – Free Basketball Picks\n\nFree NBA Picks: https://t.co/6zs5bCs6Dn\n\nBet on Basketball: https://t.co/rAFjp0NQxx\n\n#Draftkings #Fanduel #Pointsbet #Basketballpicks #Sportsbook #NBAPicks #NBATwitter #GamblingTwitter https://t.co/2cIiYLNARx",
    "630": "Do the Utah Jazz need to make a deal to win a title? Everything you need to know as the NBA trade season begins\nhttps://t.co/cdg49OOgV6",
    "631": "🏀 NBA PLAYS 🏀\n\nParlay (1U)\nLAC/Utah Jazz u216.5\nMemphis Grizzlies/Portland Trail Blazers O219.5",
    "632": "Tonight's NBA Wednesday double-header:\n\nLos Angeles Lakers @ Dallas Mavericks tonight at 7:30pm ET on ESPN. \n\nLos Angeles Clippers @ Utah Jazz tonight at 10pm ET on ESPN. https://t.co/mpLWG1y2Tc",
    "633": "📰 Utah Jazz vs Los Angeles Clippers Picks and Odds Dec 15!\n👉 https://t.co/mq11cdCqcw @wagertalk",
    "634": "Consensus Line Move:\n2021-12-15 Los Angeles Clippers at Utah Jazz from 215.50 to 216.50\nOver sharps say\n#NBA #bettingexpert #innovation #profit",
    "635": "Gameday! (27/82) \n\n🏀 Los Angeles Clippers x Utah Jazz\n📌 Vivint Arena, Salt Lake City, UT\n⌚ 0h\n📺 ESPN / NBA League Pass\n⚪ Association Edition \n\n#NBAnaESPN #TakeNote #NBA75 https://t.co/li9pyEODzx",
    "636": "December 15th edition of DJ &amp; PK in the Morning\n\n- @utahjazz vs. @LACLippers\n- @RileyJensen on #BYU &amp; #USU's bowl games as well as #NationalSigningDay \n- Former @BYUCougars AD Rondo Fehlberg\n\n📻 97.5-FM/1280-AM\n📱 The @ZoneSportsNet App\n🗣 @DavidDJJames/@PKKinahan\n\n#TakeNote #NBA https://t.co/Houm2t9VhK",
    "637": "@slcjuanb @utahjazz @UofUHealth No, ser, I'm tired of being a jazz fan for years to simply get early, disappointing playoff exists. Don't shush me I'm not the one bud lol",
    "638": "Despite being a quiet presence, Royce O’Neale is the ‘pulse’ of the Utah Jazz, teammates say\nhttps://t.co/qVw5YtWgvr",
    "639": "@utahjazz Good ole mailman 📫 https://t.co/o82mIPCUWH",
    "640": "Dell Curry Parents &amp; Wiki:- Dell Curry is an American former professional basketball player and a color commentator for the NBA Basketball team Charlotte Hornets. He used to play for the Utah Jazz of the National Basketball Association in the point\n\nhttps://t.co/5kwDCxBz9G https://t.co/EoPpOGl41Z",
    "641": "Congrats to @BraxtonThornley at BHS @homeoftheminers for being recognized as a @utahjazz @Instructure Most Valuable Educator! I love seeing awesome UT teachers recognized for the wonderful work they are doing. #uted #utedchat https://t.co/szpXhhjQji",
    "642": "Your Wednesday on The Zone:\n\n6-10 am: DJ &amp; PK in the Morning\n\n10 am-12 pm: Jake Scott &amp; Ben Anderson\n\n12-3 pm: Hans &amp; Scotty G\n\n3-6 pm: Unrivaled with Wasatch Medical\n\n6:30: @USUBasketball vs. @WeberStateMBB\n\n7 pm: @utahjazz vs. @LAClippers\n\n📻 97.5-FM/1280-AM\n📱 Download our app https://t.co/m1Jnsi8aGm",
    "643": "Los Angeles #Clippers vs Utah #Jazz  | Picks and Parlays |12/15/21 | NBA  Free Picks and Predictions | NBA Betting Tips      \n\nWatch: https://t.co/InPLrnCnp3\n\n#NBA #NBAPick #NBAPredictions #Jazz",
    "644": "@BraxtonThornley @utahjazz @Instructure Congrats!  Nobody deserves it more @BraxtonThornley! 👏🏼👏🏼👏🏼👏🏼",
    "645": "Thank you @utahjazz and @Instructure for the recognition. There is so much good that happens in Utah’s schools, and it’s humbling to be selected as one of this year’s MVEs. https://t.co/AjRdZoWS1m",
    "646": "Day 42 of tweeting Utah Jazz until they show more of the redesign \n@utahjazz",
    "647": "@Daldo315Dallas @utahjazz Yeahhh buddy got him too! @JordanClarksons https://t.co/VkpquEtquT",
    "648": "NBA Basketball Game Betting Picks Simulator: 10:00 PM ET - Los Angeles Clippers vs. Utah Jazz - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/oQoQCUY5kl #nba #sportsbetting #freepicks #cappertek",
    "649": "@utahjazz Oh yeah https://t.co/1FZSmDSnYv",
    "650": "@shenjoo @utahjazz Thank you!",
    "651": "@utahjazz Let’s goooo! https://t.co/kX57Jz4xoe",
    "652": "@utahjazz I did it like 10 different times, but this was my 1st one so that's the one I'm going with. No complaints here. https://t.co/8WLdrwHJuN",
    "653": "NBA 16/12/21\n\n08:00 Milwaukee Bucks-1\n10:00 Memphis Grizzlies+1.5\n10:00 Utah Jazz*Over-214.5",
    "654": "Good morning. It's a great day to watch the #UtahJazz. Today, may you fly high to see all your projects become slam dunks with Rudy #Gobert vibes. May you defy gravity &amp; succeed beautifully like Donovan #Mitchell under the rim. May your swag be as playful as Jordan #Clarkson. ❤",
    "655": "@Takka_Jordan @itsgabrielleu @DwyaneWade @utahjazz Open invite and a place to stay!!",
    "656": "@StewartOkell @RickinFay Sweet jesus you didn't just hop in my mentions and drop a Utah Jazz reference did you?",
    "657": "NBA investigating allegations of bigoted remarks, racially-charged threat made by Utah Jazz vice president – USA TODAY https://t.co/q2aunZf3WD",
    "658": "NBA investigating allegations of bigoted remarks, racially-charged threat made by Utah Jazz vice president – USA TODAY https://t.co/upH9apPWon",
    "659": "Jordan Clarkson Named NBA’s Sixth Man of the Year\n\nThe Utah Jazz officially has the Sixth Man of the Year. Jordan Clarkson was crowned Sixth Man on Inside the NBA and was surprised by his teammate Joe Ingles in receiving the trophy. During his extroadina https://t.co/Df5Ikv94PY",
    "660": "#NBAPowerRanking week 9\n1. Suns\n2. Warriors\n3. Jazz\nPhoenix has won 20 of its past 21 games and leads a trio of teams -- Golden State and the Utah Jazz are the others -- that have separated themselves from the pack in the Western Conference.\nhttps://t.co/4LwDLPebYC",
    "661": "@NBAonTNT It’s true @utahjazz",
    "662": "NBA team name changes:\n\n- Memphis Grizzlies ➡️ Memphis Sounds.\n- Utah Jazz ➡️ something else\n- New Orleans Pelicans ➡️ New Orleans Jazz\n- Los Angeles Lakers ➡️ something else\n- Minnesota Timberwolves ➡️ Minneapolis Lakers\n- and #BringBackOurSonics",
    "663": "Get your PtR special when the Spurs celebrate Star Wars Night - Pounding The Rock: Join Pounding the Rock as the San Antonio Spurs host the Utah Jazz for Star Wars Night! Lonnie Sky Walker IV, Obi-Wan Dejounte- R2D White, .... URL: https://t.co/2uhOYaAu05",
    "664": "ALERT: New high roller bet posted!\nA bet has been placed for $8169.15 on Utah Jazz - Los Angeles Clippers to win $9,466.76.\nTo view this bet or copy it https://t.co/AaYQvORWGD https://t.co/mfRy0LPTTU",
    "665": "Utah Jazz - Los Angeles Clippers\n\nBet slip link: https://t.co/o4fhiia2jq https://t.co/xy73viZLf9",
    "666": "@utahjazz That’s what I’m talking about https://t.co/WO8kdS1rg4",
    "667": "@HatchDave @utahjazz @WasatchFord Yes. Yes they should. 😂",
    "668": "@SpenSpenBurt @tribjazz @andyblarsen @NBASarah @utahjazz lol true",
    "669": "@PickDawgz #274 \nCBB Fairfield -9\nNHL New York Rangers -1.5 +125\nNBA Utah Jazz -9\n#PickDawgzCapperContest",
    "670": "@utahjazz @JordanClarksons @RudyGay @Joeingles7 I have Dish. It's no big deal.",
    "671": "This the one. Please give us purple, gold, green, and white @utahjazz !! https://t.co/Tutrwx5SbV https://t.co/ysYjzSdvsv",
    "672": "@JFKlopfenstein @tribjazz @andyblarsen @NBASarah @utahjazz oh and @millerjryan SORRY",
    "673": "@JFKlopfenstein My timeline when @tribjazz, @andyblarsen, @NBASarah and @utahjazz all tweet the same game-day injury update at the same time",
    "674": "Random fact the @utahjazz last game on a Tuesday was November 16, 2021. They won’t play another regularly scheduled game on a Tuesday until March 29, 2022. #takenote",
    "675": "@parker_andorasu @utahjazz Happy birthday! 😂",
    "676": "@Yg_Trece please be healthy and play tomorrow. I am coming to watch you play and beat the @utahjazz",
    "677": "@parker_andorasu @JMCCLEARY_10 @utahjazz Come on Jake. You're makin my pal ParuKaru feel old!!",
    "678": "@utahjazz @WasatchFord Honest question: should anyone be eating more than one hot dog, nachos, popcorn, and ice cream at a game? PS #GoJazz",
    "679": "@utahjazz Oh man! Can I get a redo? https://t.co/QVvrWRtP2i",
    "680": "@utahjazz Rudy!! https://t.co/fZUR5hjeOR",
    "681": "NBA Basketball Game Betting Picks Simulator: 12/15/2021 10:00 PM ET - Los Angeles Clippers vs. Utah Jazz - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/oQoQCUY5kl #nba #sportsbetting #freepicks #cappertek",
    "682": "Watch the Jazz take on the Clippers from the 𝗙𝗢𝗥𝗗 𝗙𝗔𝗡 𝗭𝗢𝗡𝗘🥳\n\n#TakeNote | @WasatchFord",
    "683": "@utahjazz Im not gonna complain https://t.co/IrDKxJfExE",
    "684": "@JMCCLEARY_10 @utahjazz Ironically, I was 33 last game. I'm now 34.",
    "685": "How old were you the last time the @utahjazz played a basketball game? \n\n#TakeNote",
    "686": "Yo did the @utahjazz forfeit the season ??? 😂 damn they haven’t played in like 3 weeks 😅 #takenote",
    "687": "Utah Jazz might overtake Warriors in NetRtg later today. They play the shorthanded Clippers and are on a roll.",
    "688": "@RyanStipUTES @utahjazz Mandie and I were just talking about this.",
    "689": "Imagine if Michael Jordan had social media he’d have been the most petty mofo on planet earth like imagine Twitter being around after the 1998 finals and MJ quote tweets the Utah Jazz and just says “Ratio.” 😂😂😂",
    "690": "@kslsports @utahjazz Alec Burks and Bryan Russel.  Going down in history.  The wrong side of it.",
    "691": "@JayCoolBeans @utahjazz @wgu Nuggets are irrelevant to the conversation. We shouldn’t be compared to an inferior franchise. You’re right on the golden state and Houston years. But the year we lost in the bubble people expected more from that roster",
    "692": "Today at Bingham High our very own Mr. Thornley was recognized as the Utah Jazz most valuable teacher.This recognition comes with a $1,000 classroom grant, six (6)  tickets in Instructure's suite to the Dec.15 Jazz game, recognition during the game and a personalized Jazz jersey. https://t.co/rRnA604NEy",
    "693": "@botalumePT @MLS @NHL Lol I don't know, New Orleans Pelicans and Utah Jazz are in the conversation.",
    "694": "@utahjazz @JordanClarksons @RudyGay @Joeingles7 Bored https://t.co/5onkMNOZTy",
    "695": "@van_jensen If you ever get a chance to sit that close for a Utah Jazz game … make sure whatever you do … DON’T TALK ABOUT QUINN SNYDER’S #$@!% WIFE!",
    "696": "@C_SaccoIV @utahjazz @wgu Even the Nuggets two years ago we weren’t favored going in. That one just stings cuz we were up 3-1 😬",
    "697": "@utahjazz I'll take it! https://t.co/AmMgRB9l9k",
    "698": "@C_SaccoIV @utahjazz @wgu Also, I think last year was the only year we fell below playoff expectations. Every year before we either met or exceeded expectations. If you were expecting to beat Houston and Golden State the last several years I think your expectations were a little too high",
    "699": "@C_SaccoIV @utahjazz @wgu When you said all their regular season wins mean NOTHING to you that really threw me off. I don’t understand that. I totally agree championship is the goal, but I still have fun cheering for a good team during the season.",
    "700": "@JayCoolBeans @utahjazz @wgu Why so cringe at an opinion buddy? Of course that’s all I care about. I have fun watching the Jazz wins. I don’t root for them to lose 🤣 the championship is the goal. And if you don’t win it when you’re a contender, it’s a lost season. But it’s okay, let’s be like the Cubs 😂",
    "701": "@utahjazz @UofUHealth He’s health as been amazing the past few years, that’s a big accomplishment for a guy his size. Keep it up Rudy! 💪",
    "702": "Random tweet … just noticed that the Jazz only 5️⃣ home games in January 😬\n\nSo ya best enjoy these 7️⃣ homes game in December \n\n#JazzNation #UtahJazz #TakeNote\n#NBA https://t.co/Jmjozqkiy9",
    "703": "@utahjazz @UofUHealth They always do this though.. go on an amazing run from holidays until a little after all star break, then fall apart like a card house in a wind storm in the playoffs.  Quit breaking the locals hearts please serrrr",
    "704": "I absolutely love that @utahjazz and it’s stars, including @rudygobert27 @JordanClarksons &amp; @spidadmitchell, support #education #humanrights and the #community! RETWEET if you agree! Making #Utah proud! #ThankYou https://t.co/064Ab0CPDD",
    "705": "@hula801 @itsgabrielleu @DwyaneWade @utahjazz Next time come to SLC I would love to see the arena",
    "706": "Oh there go Utah jazz season 🤞🏽🤣 https://t.co/rTFmFXvZ42",
    "707": "\"Just the work paying off.\"\n\nRudy Gobert on getting stronger and how it's helped his game.\n\n#JazzHealth | @UofUHealth https://t.co/MWw3X0faEb",
    "708": "@utahjazz Well I got the Stockton Purple away Jersey….twice in a row.  It must be meant to be.",
    "709": "@utahjazz Oh yeah! https://t.co/bwG2uLoTJI",
    "710": "@utahjazz I'll take it https://t.co/VR6inQTpBH",
    "711": "@5kl @cpen06 @utahjazz The Korver shot would have been an epic moment all by itself, but it gets overshadowed by Sundiata Gaines' INFAMOUS Jazz moment."
}