{
    "0": "Detroit Pistons vs Denver Nuggets Live Stream - NBA Today\nWatch Here : https://t.co/Bkjtp9HbHt\n\nVenue: Little Caesars Arena (Detroit)\n#DetroitPistons #Nuggets #NBA #Live https://t.co/hkbKp55wvM",
    "1": "@Rome_Beast Man all because pistons aren’t accepting THT + Nunn + a 2026 frp? Strong arming? How? He chose to sign here and Detroit is doing their due diligence and allowing him to choose a team.",
    "2": "@T_Horse95 @DetroitPistons Lmao",
    "3": "🔴Live ~ Denver Nuggets vs Detroit Pistons -  NBA League  2022 💯\n📅 : 01/25/22📌\n⏰: 7:00 PM📌\n▼F̾oͦl̾l̾oͦw▼ 🔗Link 🌐 ⭆ https://t.co/9YwvLBeWUm✅",
    "4": "We in here @nuggets vs @DetroitPistons #Pistons",
    "5": "The @DetroitPistons starting Cunningham, Joseph, Diallo, Bey, Stewart on Tuesday. #DetroitBasketball #NBA",
    "6": "Let’s get it @DetroitPistons https://t.co/iGz6e1M72L",
    "7": "@DetroitPistons @Kia @Cory_Joe @CadeCunningham_ @hamidoudiallo @SaddiqBey @Dreamville_33 Finally Hayes is out of the starting 5 #Pistons https://t.co/BsgVrfXBNb",
    "8": "🏀 Detroit Pistons vs Denver Nuggets\n🏆 NBA\n🗓 25/ene.\n⏰ 21:00\n📺 DIRECTV GO - DIRECTV SPORTS / 1610",
    "9": "【Stock information】CHAMPION \"DETROIT PISTONS 33 HILL\" BASKET TANK / EMERALD GREEN / https://t.co/ZWTUdQalay",
    "10": "@DetroitPistons Let’s get this dub baby!! @DetroitPistons https://t.co/B0BFRTsCdG",
    "11": "@DetroitPistons @Kia @Cory_Joe @CadeCunningham_ @hamidoudiallo @SaddiqBey @Dreamville_33 Stop Cojo please.\nHe is the Casey's son",
    "12": "Detroit Pistons Starting Lineup 1/25\n PG: Cade Cunningham\n SG: Cory Joseph\n SF: Hamidou Diallo\n PF: Saddiq Bey\n C: Isaiah Stewart\nhttps://t.co/o75oZ8vnE8",
    "13": "Let's run it back in the 313 tonight 🏠\n\n@Kia | #Pistons https://t.co/bVnoosxE09",
    "14": "Tonight's starting lineup for the Detroit Pistons: Cunningham, Joseph, Diallo, Bey, Stewart https://t.co/bVWH4AMCA2",
    "15": "@T_Horse95 👋 we see you, have a great time tonight",
    "16": "On this day - 1960 Wilt Chamberlain scores 58 points, the most ever by an NBA rookie, as Philadelphia Warriors beat Detroit Pistons, 127-117 at Bethlehem, PA #BTSGuruSportsHistory #NBA75",
    "17": "Section 119 we live @DetroitPistons",
    "18": "Basketball INPLAY TIP \nDenver Nuggets v Detroit Pistons\nDenver Nuggets handicap -7\nOdds: 5/6\n1U\n\n#bettingtips #inplay #gamblingtwitter #basketballtips \nHit Like ❤️ if you are on! 18+ Only",
    "19": "The Detroit Pistons play in Little Caesars Arena.\n\nShouldn't it be Little Caesars Arena Arena?",
    "20": "@DerrickS2 Welcome to tonight's game! 💙❤️",
    "21": "Monte Morris has scored 15 points or more in 3 straight games when playing in Detroit, while Aaron Gordon has seen 6 or more rebounds in 4 straight road games \n\n#Pistons #MileHighBasketball #NBA #NBATwitter #FantasyBasketball",
    "22": "NBA Basketball Game Betting Picks Simulator: 7:10 PM ET - Denver Nuggets vs. Detroit Pistons - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/JhP6Dsjefd #nba #sportsbetting #freepicks #cappertek",
    "23": "@ckash14 @tyler29646313 @woodwardsports @CadeCunningham_ @DetroitPistons @PistonOfTheDay U joking right?",
    "24": "@ArgenPistons @DetroitPistons Happy birthday 🙏🙏",
    "25": "The home team has won 7 of the last 8 games played between #MileHighBasketball and the #Pistons. Detroit is home but the underdog, given a 29.9% chance to win \n\n#NBA #NBATwitter",
    "26": "Bringing the amazing @MSchindlerNBA on the podcast next week to talk #Pistons and #NBA \n\nHe’s a great basketball mind, writer for @basketbllnews &amp; @137pm AND podcaster \n\nAND knows his DRAFT stuff!! Send in any Detroit specific or general 2022 NBA draft questions!!!! 🔥 https://t.co/on5BEkBIHo",
    "27": "Detroit Pistons - Denver Nuggets\nWashington Wizards - Los Angeles Clippers\nToronto Raptors - Charlotte Hornets\nPhiladelphia 76ers - New Orleans Pelicans\nBoston Celtics - Sacramento Kings\nHouston Rockets - San Antonio Spurs\n\nBet slip link: https://t.co/A2wBQUqiRV https://t.co/YEEaVQyDMt",
    "28": "@DetroitPistons @HenryFordNews BTW barton is out not probable lol",
    "29": "January 25, 1958: Philadelphia #Warriors C Wilt Chamberlain set an NBA rookie record with 58 PTS during a win over the Detroit Pistons. Wilt tied his own record less than a month later and no rookie has since surpassed it\n https://t.co/A6xevxUOt7",
    "30": "Little Hoopers sponsored by the @DetroitPistons is back for its’ first session of 2022! 🏀 https://t.co/3nBQrYMzdF",
    "31": "@glubaru We are all Detroit Pistons",
    "32": "#MileHighBasketball are -7.5 favorites on the road tonight against the Detroit Pistons. After a 1-3 West Coast road trip, the #Pistons return home to Little Caesar's Arena where they've been much more competitive. Can Detroit right the ship back home? 👀👀\nhttps://t.co/g6965TpfgS",
    "33": "Work hard, drip harder 🔥\n\n@CadeCunningham_ \n@Dreamville_33 \n@SabenLee \n@Cory_Joe \n@cassius_stanley\n@SaddiqBey \n\n#ULTRADrip | @MichelobULTRA",
    "34": "The @DetroitPistons put out a Goin' to Work collection, and it is honestly awesome. Need that high-vis vest so I can be seen doing yard work this summer. https://t.co/I1bWS8lMKk",
    "35": "@johvincan I agree bro. I’m just over getting hyped up for nothing. All the speculation stuff is fun and cute, but until I see a tweet from Woj or Shams that says “The Detroit Pistons are trading Jerami Grant to the…”, I’m just treating these rumors as pure entertainment",
    "36": "Finished 4th for my Pistons picks on Sunday... we both got some unfinished business to take care of tonight💪 @DetroitPistons #Pistons https://t.co/Vo8F0bfNgf",
    "37": "🏀 #NBA 01/25 Free Play:\n\nDetroit Pistons (+7.5)",
    "38": "Stop by @DiscountTire Power Hour today on the concourse to get a first look at our newest merch drop, the Goin’ to Work collection 🔥 https://t.co/kQAeODgScM",
    "39": "@ArturoL21952829 @woodwardsports @CadeCunningham_ @DetroitPistons @PistonOfTheDay Except Mobley is better.",
    "40": "Former Beckley great Henry Dickerson will be honored during Friday nights game. Dickerson was the first Beckley player to play in the NBA after playing for the Detroit Pistons in 1975 and the Atlanta Hawks in 1977!! https://t.co/KIeRUc3mCl",
    "41": "Chiefs will be the Bills equivalent of the Detroit Pistons to the MJ Bulls. We winning it all next year.",
    "42": "@woodwardsports @CadeCunningham_ @DetroitPistons @PistonOfTheDay Jalen who?",
    "43": "Detroit Pistons Predictions and Preview for 1/25/2022 hosts Denver Nuggets.  Looking for betting action?  Find out if there is any value in our preview. #Sportsbook #Punters https://t.co/BQMlEpP2fD",
    "44": "Should the #Pistons be willing to trade a coveted talent who actually wants to play in #Detroit? \n\n📸 @rebilasphoto https://t.co/l04cRkVGZV",
    "45": "Denver Nuggets visits Detroit Pistons Predictions and Preview for 1/25/2022 today.  Who are we taking in this game?  Find out now. #Sportsbook #Punters https://t.co/BQMlEpP2fD",
    "46": "Congratulations to DJDaski who moved up 5 spots to take #9 on the Detroit Pistons team leaderboard.\n\nhttps://t.co/LcCBBkwPJ5",
    "47": "Basketball \nBrazil \nNBB \nRio Claro - Pinheiros 1 @ 1,53\n NBA \nDetroit Pistons - Denver Nuggets 2 @ 1,31\n@ 2,00 (stoiximan) 5 units",
    "48": "@DetroitPistons @Nicholoff Um I would love to sit courtside for my bday around any games around 2/22! Please #Pistons",
    "49": "@Pistons_PR @DetroitPistons @nbastats Yeah and it doesn’t make sense",
    "50": "@DetroitPistons Tried to sign up but the phone verification process doesn’t seem to be working… it won’t send out the verification text 🤷‍♂️",
    "51": "@ckash14 @woodwardsports @CadeCunningham_ @DetroitPistons @PistonOfTheDay Dude is only known as a scorer. And isn’t even good at that. Maybe he can get to 40% fg eventually like Cade has",
    "52": "@CobraKyleMusic @Pistons__Talk @niranjangfx Detroit needs to make this happen if the Hawks are interested",
    "53": "@DetroitStrong55 @YouTubeTV @BallySportsDET @DetroitRedWings @DetroitPistons @DetroitTigersPR Preach my Detroit friend!!",
    "54": "Food, drinks and tickets on us! 🤯\n\n Make your picks for tonight's game and you could win two (2) all-inclusive lower level club tickets for the #Pistons vs. Memphis Grizzlies game on Thursday 2/10!\n\n🔗: https://t.co/xNUmhNrBRf https://t.co/KoFQRKx22s",
    "55": "Nuggets - Detroit Pistons Live Stream https://t.co/1Bqof39ca3",
    "56": "It’s still my  birthday Month let’s get this dub @DetroitPistons 💙❤️",
    "57": "@DetroitPistons @MotorCityCasino But……I’m in Florida! Uggghhhh",
    "58": "@Embiid_prodzz Role player for the Detroit pistons",
    "59": "Nuggets vs Pistons II preview is up {Return to anal}\nTPM™ 2021-'21 Game #46 vs Detroit - Pre-Game version\nhttps://t.co/luOA5tsdqQ",
    "60": "lmao so the planet fitness in midtown really sold it on being in the pistons practice facility - then didn’t work out a deal for validated parking so it’s paid street parking or $10 to park in the lot. like, wtf this isn’t downtown LA. it’s midtown detroit.",
    "61": "Here are our #NBA prop bets for tonight\n\n🏀 VanVleet OVER 22.5 Points vs Charlotte Hornets (-102)\n🏀 Jokic OVER 12.5 Rebounds vs Detroit Pistons(-114)\n\n(@BodogCA)\n\nhttps://t.co/27impQPBRM\n\n#NBA75 #NBATwitter #GamblingTwitter #SportsBettingPicks",
    "62": "April 22,1993 - @ChicagoBulls beat the \n@DetroitPistons 109-103 \n#VenusRetrograde \nhttps://t.co/EboM8FgqoB",
    "63": "April 12,1993 - @ChicagoBulls beat \n@DetroitPistons 98-95 \n   #VenusRetrograde   \nhttps://t.co/EXPh2db0JK",
    "64": "March 14, 1993 - @ChicagoBulls lose to \n@DetroitPistons 101-91 \n#VenusRetrograde \nhttps://t.co/ImGpAys1Fe",
    "65": "Everyone has a list.\nI have the grocery list / to do list but that doesn't mean you get everything on it.\nThe NBA  deadline can't come fast enough. Bye 🖐\n\nDetroit Pistons trade deadline rumors: Jerami Grant has a list of preferred destinations https://t.co/vl8itptBd5 via @freep",
    "66": "@ckash14 @woodwardsports @CadeCunningham_ @DetroitPistons @PistonOfTheDay Ratio",
    "67": "@DpistonsA @DetroitPistons Gracias crack!",
    "68": "@MeExplicanPls @DetroitPistons Graciass😘",
    "69": "@Retrogamebrews @3wojis @Tommyted1202 Yep and buffed Detroit pistons.",
    "70": "To win 2 units\n\nDetroit Pistons +7.5 -110",
    "71": "@Keith_Langlois @DetroitPistons Are there any teams that Jerami Grant seems more likely to land to than others or is still up in the air?",
    "72": "Nuggets look to go 4 games over .500 as they play the Detroit Pistons.                     Dear Lord please don’t lose to Detroit.       Jokic predicted Statline is 28-19-8. Go Nuggets",
    "73": "@DetroitPistons @MotorCityCasino Is there a giveaway on Feb 4?",
    "74": "What's up #Pistons fans!\n\n🧢 We're giving away FREE Pistons knit caps presented by @MotorCityCasino at the doors for tonight's game 🧢 https://t.co/uiMn6MYzw9",
    "75": "https://t.co/wHEBrtc48a\n\nJerami Grant and his representatives have presented a list of teams to the Detroit Pistons where he would prefer a trade if they decide to go in that direction...",
    "76": "C'on  it's a Just a birthday gif @DetroitPistons https://t.co/LmRN5xM2xR",
    "77": "@DetroitPistons @Nicholoff We’re dreaming of @DetroitPistons too",
    "78": "Yeah let my boy John Collins slide through @DetroitPistons",
    "79": "It wouldn’t be a new year without a new merch drop from the @DetroitPistons.\n\nOur Goin’ To Work collection is a nod to the 2004 champs and those relentless, hard working Detroiters. https://t.co/m4VK8RsJrD",
    "80": "@TheNBACentral @JakeLFischer I’m ngl I would Respect harden if he left the nets, most people in Hardens situation would probably extend with the nets because this big 3 could probably win 2-3 championships if they live up to potential. With that being said, Harden please come to the @DetroitPistons",
    "81": "@Keith_Langlois @DetroitPistons Is a Grant for John Collins swap actually a realistic trade?",
    "82": "@DetroitPistons GOOD LORD!",
    "83": "Jerami Grant got me back on a rant all of #Detroit let me hear ya chant don't go nothing but Detroit Love Bro #Trending #NBA #Pistons #NBAVOTE #NBAPicks",
    "84": "@woodwardsports @CadeCunningham_ @DetroitPistons @PistonOfTheDay 2nd rn",
    "85": "Let's go to work!\n\nThis collection recalls the Goin’ To Work era #Pistons and shows off that Detroiters give 100% effort to get the job done.\n\nClick the 🔗 below and grab some new merch from our latest capsule.\n\n🚨: https://t.co/63ezB2x31R https://t.co/jJloSUqi9j",
    "86": "Cade turns it up a notch when the #Pistons play at @LCArena_Detroit 🔥\n\nHome game averages this season:\n\n16.8 PPG\n5.8 RPG\n5.8 APG\n1.5 SPG https://t.co/dWIkPIRRgC",
    "87": "Hidden deep in this article is league sources are telling @JakeLFischer that The #Bulls have continued to explore avenues to trade for #Pistons F Jerami Grant without sacrificing prized swingman Patrick Williams in a deal. Good luck. I don't see Detroit budging off that stance. https://t.co/5AJaOfWa7T",
    "88": "NBA Betting Preview: Denver Nuggets vs. Detroit Pistons https://t.co/djaMGgfYxX",
    "89": "@trshcnterry @YaBoyToken @DetroitPistons Thanks , lmao man I be looking for shit sweet enough to wear with this hat so much 😭",
    "90": "@woodwardsports @CadeCunningham_ @DetroitPistons @PistonOfTheDay Every fan is gonna be bias especially Orlando, Toronto and Cleveland that’s what Houston did in the beginning. We got Cade cause we needed a player like him 6’6” 6’7” with point guard skills and he’s smart and mature.",
    "91": "@woodwardsports @CadeCunningham_ @DetroitPistons @PistonOfTheDay @ramanpabla79 that’s our rook",
    "92": "DENVER NUGGETS vs\nDETROIT PISTONS, 8:00PM.",
    "93": "@Loomin_Knotty @Ron_Clements @ALionEye @jstriebel22 Of course it is. However, there are limits - flagrant foul rules, not trying to make a play on the ball, etc. I think MSU was trying to take a page out of the old Detroit Pistons playbook - deliver physical punishment to the driver.  If you disagree, that’s fine.",
    "94": "Detroit Pistons trade deadline rumors: Jerami Grant has a list of preferred destinations https://t.co/ncBppRtGrB",
    "95": "🔴[LIVE'STREAM] ~ Denver Nuggets vs. Detroit Pistons - NBA League 2022\n🔴Broadcast Link !! https://t.co/h2tEUvUzBE ✅\nDate : On Tuesday. January 25 /2022\nTime : 7:00 PM",
    "96": "January 25, 1958: Philadelphia #Warriors C Wilt Chamberlain set an NBA rookie record with 58 points during a win over the Detroit Pistons. Wilt tied his own record less than a month later and no rookie has since surpassed it https://t.co/aBYY5GUYBw",
    "97": "@BradleyBundshuh @richardbrooks01 @woodwardsports @CadeCunningham_ @DetroitPistons @TheUndefeated Again..I wasn’t talking about Mobley’s defense. YOU said he scored in the paint AGAINST 3rd and 4th options.  U can’t even understand ur own gibberish",
    "98": "@kevin_ro Can confirm that i dont follow you for your Detroit Pistons thoughts or your opinions of pens.",
    "99": "Jerami Grant and his representatives have presented a list of teams to Detroit if they decide to make a move at the deadline.\n\nThe Pistons are currently not receiving many formal offers for Grant. (via The Athletic) https://t.co/MlJWqqshgV",
    "100": "Get me john collins @DetroitPistons",
    "101": "I don’t know why 2k of you follow me, but I’m pretty sure it isn’t for my Detroit Pistons thoughts 😆. Regardless, I’m thankful for all of you! Onto 3k! https://t.co/iQfJDU8ujC",
    "102": "Detroit Pistons trade deadline rumors: Jerami Grant has a list of preferred destinations https://t.co/FBr36bgEI0 https://t.co/sFv2fcCUFK",
    "103": "@DetroitPistons @MotorCityCruise @nbagleague I wish the Pistons were doing That good",
    "104": "@DetroitPistons @Acronis Bad boy defense 2.0 🚫",
    "105": "Detroit Pistons trade deadline rumors: Jerami Grant has a list of preferred destinations #Detroit #Pistons #NBA https://t.co/c3ILzkn9j1",
    "106": "@DetroitPistons @Acronis Bad Boys 3.0 https://t.co/jiGfqI427r",
    "107": "@TheCadeEra Exactly.  It was stupid.  And it isn’t even like they tried to reach out to a Detroit rapper. But the fact that the Pistons took the time to pull this stunt is embarrassing",
    "108": "📰 Denver Nuggets vs Detroit Pistons Predictions and Odds Jan 25!\n👉 https://t.co/SOkVi458A0 @sportsmemo",
    "109": "@DetroitPistons @Acronis better than jalen “i can only score” green",
    "110": "Cade said: 🖐 🚫\n\nThis swat from 2️⃣ earns Block of the Week, presented by @Acronis. https://t.co/1GN76iPGsN",
    "111": "Detroit Pistons trade deadline rumors: Jerami Grant has a list of preferred destinations https://t.co/FT1CWZNXLI",
    "112": "@Detroit_Stan14 That was directed at Pistons fans in general, but your original comment with 40 &gt;&gt;&gt;&gt;&gt;&gt;&gt; towards Cade alludes to it not being close https://t.co/jYghs8zmVV",
    "113": "@ArgenPistons @DetroitPistons Felicidades crack!",
    "114": "@DetroitPistons @MotorCityCruise @hamidoudiallo @SaddiqBey @Dreamville_33 @nbagleague Great to see the support and camaraderie of the Pistons &amp; Cruise",
    "115": "@DaCo0609 @whaamncheese The Pistons dont have to trade Jerami Grant. They will b just fine keeping a 20 Pts Player, who is a good Defender and great Teammate on a reasonable Contract. Only a good Trade offer will b considered. Grant + Weaver have this agreement, thats why Grant came to Detroit.",
    "116": "@ArgenPistons @DetroitPistons . @CadeCunningham_ please follow @ArgenPistons your biggest fan in the southern hemisphere.",
    "117": "@erinkatedolan Detroit! We have all 4 major sports teams located within a few blocks of each other. Storied history with all including the Red Wings being an original six team. Look at the size of the parades when the Wings, Pistons, or Tigers won championships. Let’s not talk about the Lions!",
    "118": "@Detroit_Stan14 I’m a Pistons fan lmao, I literally listened to multiple podcast that have gone over Cade looking winded in the second half after big first half’s",
    "119": "@BlazersArgento @DetroitPistons Gracias crack 😘",
    "120": "@ArgenPistons @DetroitPistons Feliz cumple 🥳🥳\n\n@DetroitPistons follow him please ‼️‼️‼️",
    "121": "@JNAVLA It's the Pistons. Given that context, I think any veteran in their prime whose had to endure a single season in Detroit gets that right.",
    "122": "Pops really think Detroit Pistons Isaiah Thomas is better than #11 😂 that’s why I got his hoop card now",
    "123": "Film Don't Lie: Taking stock of the Detroit Pistons defensive struggles and potential – NBA News https://t.co/zggHLOGO1C",
    "124": "@Nicholoff @DetroitPistons 👏👏🙌 HUGE W",
    "125": "Film Don’t Lie: Taking stock of the Detroit Pistons defensive struggles and potential https://t.co/XdYzDZAYzU",
    "126": "@DetroitPistons @Nicholoff Dope! Good job Team",
    "127": "Congratulations to jcoffey23 (@jcoffey23) who moved up 368 spots to take #42 on the Detroit Pistons team leaderboard.\n\nhttps://t.co/LcCBBkwPJ5",
    "128": "@Nicholoff @DetroitPistons Please tell Killian we love him",
    "129": "i’m not gonna pretend like i’m a frequent detroit pistons watcher but from what i’ve seen he’s #nice lol",
    "130": "@Nicholoff Well deserved. As a German Pistons Fan, one of my goals is to see the Pistons live in Detroit.",
    "131": "@BradleyBundshuh @richardbrooks01 @woodwardsports @CadeCunningham_ @DetroitPistons @TheUndefeated I did….it was u who chimed in when I was responding to someone else’s post…u can go back into hiding.",
    "132": "@BradleyBundshuh @richardbrooks01 @woodwardsports @CadeCunningham_ @DetroitPistons @TheUndefeated Obviously u just spew nonsense u can’t even keep track of..it’s a waste of time to debate with someone who forgets what he posted",
    "133": "@DetroitPistons @Nicholoff Hell yeah",
    "134": "@DANGDANNY25 @DetroitPistons @CadeCunningham_ sign your rookie card for my friend #GetDannyASignature",
    "135": "@DetroitPistons @Nicholoff Best team in the association! Bravo.",
    "136": "@NCourtney22 @barstoolsports @PardonMyTake @cavs  and @DetroitPistons better be ready for me😂😂😂",
    "137": "@ZANmadden As a Pistons fan I don’t see Troy moving him without including P Williams. Detroit will just keep him in that scenario. Colby white and late first round picks doesn’t push the needle imo",
    "138": "@DetroitPistons @Nicholoff Well done!",
    "139": "@DetroitGotNext @DetroitPistons @Nicholoff Dreams do come true !! Keep on grinding !!",
    "140": "Through games on Jan. 24, here's how all members of the Detroit Pistons have fared on both ends of the floor during the 2021-22 NBA season, per TPA. https://t.co/AYfSYZBKj2",
    "141": "@WorldofIsaac @DetroitPistons @Nicholoff I bet you Sausage Haus will be open, Isaac",
    "142": "@FanDuel Adrian Dantley Detroit Pistons",
    "143": "@WorldofIsaac @DetroitPistons @Nicholoff This is awesome!",
    "144": "@DetroitPistons @Nicholoff good job guys!",
    "145": "@JLEdwardsIII @DetroitPistons @Nicholoff I will start and complete this one day 🤞🏽",
    "146": "@Bucketsince88 Yeah. He also said he wanted to play for a black coach in a black city. I’m from Detroit. I love the Pistons. That rationale is amazing. EXCEPT now he doesn’t seem to give a shit. His big fish small pond stuff feels disingenuous now. Seems like he wasn’t being sincere.",
    "147": "@CRobertBuchanan @Bucketsince88 That I get. And also respect. I am from Detroit and love the Pistons. But my issue is if he’s shopping now, then he was full of shit and he should’ve just said he didn’t like playing in Denver. That rationale seems contrived now.",
    "148": "@DANGDANNY25 @DetroitPistons That boy nice",
    "149": "@Nicholoff @DetroitPistons Happy for u bro, have fun 🔥🔥",
    "150": "@DetroitPistons ARE YOU SERIOUS?! Thank you so so so so much!!! I seriously am at a loss for words, I can't believe this. Thank you!!!",
    "151": "On this day, 1996: One night after Terry Mills beat the Spurs at the buzzer, the Pistons hopped over to Dallas. Grant Hill set the table for 20- point nights for Otis Thorpe, Terry Mills and Allan Houston, but it was H20’s turn to hit the game-winner as Detroit went 2/2 in Texas: https://t.co/3aDi5VXaQ3",
    "152": "Detroit Pistons vs Chicago Bulls - Full Game Highlights | January 11, 2022 | 2021-22 NBA Season\nhttps://t.co/id2xPX9KXb\nhttps://t.co/id2xPX9KXb",
    "153": "@DetroitPistons @Nicholoff Good looking out @DetroitPistons",
    "154": "@DetroitPistons @Nicholoff my dream is to sit courtside man…",
    "155": "Denver Nuggets vs  Detroit Pistons Prediction 1/25/22 -  Free NBA Picks https://t.co/VkWFIWrlMV via @YouTube",
    "156": "@DetroitPistons @Nicholoff Could you make one of mine come true and follow back? 🙏😩",
    "157": "👋 @Nicholoff, we’d love to make one of your dreams come true. How about courtside front row for the February 26th game?\n\nYour Membership Experience Rep will be in touch. 😊 https://t.co/eSVXt42SFu",
    "158": "Should the NFL Change the OT Rule? Peyton Manning Believes in Goff Should Detroit? | @BigDWSN #OnePride #Pistons #LGRW https://t.co/aNt6pEaPHO",
    "159": "@MichiganKevin @nbatopshot Do you have any Detroit Pistons for sale?",
    "160": "Bryn Forbes (2016 PIT, Michigan State) scored 12 points (4-9 FG, 2-5 3-pt, 2-2 FT) in 21 minutes off the bench for the Denver Nuggets in a 117-111 win over the Detroit Pistons. It was Forbes' second game since being acquired by Denver. @MSU_Basketball @michiganstateu",
    "161": "On this day in 1960 Wilt Chamberlain scores 58 points, the most ever by an #NBA rookie, as Philadelphia Warriors (now Golden State @warriors)  beat @DetroitPistons , 127-117 #IndiePodcast #PodNation https://t.co/3GC3lmliR3",
    "162": "HOY JUEGA DENVER\n\nvs Detroit #Pistons \n\n⏰ 21:00 hs (ARG) \n🏟️ Little Caesars Arena, DET.\n📺 DIRECTV Sports\n\n🚑 Barton Probable, Jeff, Jamyke y Howard Cuestionables.\n\n#MileHighBasketball https://t.co/JkX8tatYEP",
    "163": "@jandro0o He was one of my favorites as well. Grew up a Pistons fan, growing up in Detroit.",
    "164": "Pistons vs. Nuggets Preview: Denver and Detroit face off for second time in three nights https://t.co/CnpO5jkfHa",
    "165": "Do any of the Jerami Grant trade rumors have any legs? Probably not; they aren't animals!\n\nThat being said, I'll talk about them and all things @DetroitPistons with @WilliamsLaurenL at 11:00 AM on the #Megacast on @mymichigantv and @CivicCenterTV !",
    "166": "Denver Nuggets vs. Detroit Pistons - NBA (1/25/22) | Tip-Off, How to Watch https://t.co/9mpFPrOWE4",
    "167": "Detroit Pistons demolished by Chicago Bulls in worst loss of the season, 133-87\nhttps://t.co/WZySiaDa49\nhttps://t.co/WZySiaDa49",
    "168": "@TheNBACentral @EricPincus @19MGroup @Ralph_MasonJr Neither the Lakers or the Pistons are going anywhere this year. Grant doesn't want to get tied up with a subpar team. Might as well stay with Detroit. LA isn't much better and Grant can run the show in Detroit.",
    "169": "@TimMcvay2 @LegionHoops @TheSteinLine @DetroitPistons That’s absolutely ridiculous 🤡",
    "170": "GOOD MORNING. \n\n#Pistons \n\n📸: @DetroitPistons https://t.co/8uVrfZE2Pi",
    "171": "DasHaus made a bet!\n\nEvent: Denver Nuggets vs Detroit Pistons #NBA\nBet: Detroit Pistons TO WIN +6.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "172": "DasHaus made a bet!\n\nEvent: Denver Nuggets vs Detroit Pistons #NBA\nBet: Denver Nuggets TO WIN -6.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "173": "Consensus Line Move:\n2022-01-25 Denver Nuggets at Detroit Pistons from 218.50 to 217.00\nUnder blast away\n#NBA #betting #analytics #financialliteracy",
    "174": "Senegal - Cape Verde\nMorocco - Malawi\nDetroit Pistons - Denver Nuggets\nPhiladelphia 76ers - New Orleans Pelicans\nBoston Celtics - Sacramento Kings\n\nBet slip link: https://t.co/F7XDH1vlM5 https://t.co/CgMrEkrwAr",
    "175": "Round 2 tonight vs. the @nuggets 🥊\n\n📺 @BallySportsDET \n📻 @971theticketxyt \n💻 NBA League Pass | https://t.co/PV8hXiHMVQ\\\n🤝 @Shopify | CODE 313\n📍 @LCArena_Detroit https://t.co/q3z6mldlS3",
    "176": "#pistons #NBAAllStar \n\nThe 2004 @DetroitPistons are the best defensive team in league history . \n\nActually ,  they are CRIMINALLY UNDERRATED in their entirety. \n\n@1MrBigShot ☝️ this applies to your career also ,from start to finish.",
    "177": "Denver Nuggets vs. Detroit Pistons - NBA (1/25/22) | Tip-Off, How to Watch https://t.co/fKfG4bE89V",
    "178": "@BallySportsDET @DetroitPistons @MotorCityCruise This great. Where is the rest of it?",
    "179": "The Detroit Pistons have recalled Saben Lee, Luka Garza and Cassius Stanley from the Motor City Cruise.",
    "180": "The Detroit Pistons have recalled Saben Lee, Luka Garza and Cassius Stanley from the Motor City Cruise.",
    "181": "The Detroit Pistons will take on the Denver Nuggets tonight at 7pm ET. https://t.co/LlCZwJqd7A",
    "182": "Detroit Pistons rematch vs. Denver Nuggets: Time, TV channel, game info https://t.co/smx92LOckb",
    "183": "NBA Early Win Double\n\nNuggets to beat Pistons - 1.30\nHornets to beat Toronto - 2.25 (Gut feel)\n\nDouble pays 3/1\n\nBet on https://t.co/Tss3gzMqEN\n\n#NBA #Basketball #GamblingTwitter #GamblingTwiitter #Freepicks #Nuggets #Pistons #Hornets #Toronto #Raptors #Detroit @AfribetNigeria https://t.co/azQ0NWZey9",
    "184": "On this day in sports history January 25, Philadelphia Warriors Center Wilt Chamberlain recorded 58 Points and 42 Rebounds in a 127-117 win against the Detroit Pistons in 1960.",
    "185": "On this day in sports history January 25, Boston Celtics Center Bill Russell recorded 20 Points and 39 Rebounds in a 119-118 OT win against the Detroit Pistons in 1959.",
    "186": "@Irma_Spikeymama Long Live The Detroit Tigers, Red Wings, Pistons and The 2023 Superbowl Champion Detroit Lions!",
    "187": "Not that youre wrong, but Detroit is among the worst in developing talent. Name 1 rookie in the last 20yrs the Pistons developed into a solid NBA pro. Not an All Star just a solid pro. @sean_corp \n\nDetroit Bad Boys: Killian Hayes is bad at basketball.\nhttps://t.co/emhVc2JsRd",
    "188": "@TyR503 @richardbrooks01 @woodwardsports @CadeCunningham_ @DetroitPistons @TheUndefeated Now stop talking to me casual.",
    "189": "@TyR503 @richardbrooks01 @woodwardsports @CadeCunningham_ @DetroitPistons @TheUndefeated R U serious right now? Yes that's exactly what I said, but what does Cade get guarded by the opponents best defender have to do with how Cade plays defense? If I want to brag about Cade's defense I would say Cade guards the opponents best player every night, which he does as well",
    "190": "@BradleyBundshuh @richardbrooks01 @woodwardsports @CadeCunningham_ @DetroitPistons @TheUndefeated YOUR follow up post saying Mobley takes his shots in the paint against 3rd or 4th options.  BOTH of your posts comparing the DEFENDERS they face",
    "191": "@BradleyBundshuh @richardbrooks01 @woodwardsports @CadeCunningham_ @DetroitPistons @TheUndefeated YOUR INITIAL POST saying Cade gets the best DEFENDER on him every night",
    "192": "🚨GAMEDAY \n\nDenver Nuggets(24-21) vs \nDetroit Pistons(11-35) \n\nSorry for not posting recently, i have been really busy. \n\n#Pistons",
    "193": "I love my city but gaadammm let’s samtart doing d good in sports…specifically basketball and football  @Lions @DetroitPistons #detroitpride #detroitvseveryone",
    "194": "@TyR503 @richardbrooks01 @woodwardsports @CadeCunningham_ @DetroitPistons @TheUndefeated Omg, when I said Mobley scores most of his points in the paint and Cade shoots alot more 3's obviously I'm talking about their offensive game. I don't know where you got defense out of anything I said.",
    "195": "@BradleyBundshuh @richardbrooks01 @woodwardsports @CadeCunningham_ @DetroitPistons @TheUndefeated u obviously are a child",
    "196": "@BradleyBundshuh @richardbrooks01 @woodwardsports @CadeCunningham_ @DetroitPistons @TheUndefeated U said Mobley scores most of his points in the paint against 3rd or 4th options...if u're not meaning defense than exactly what does that mean?",
    "197": "@BradleyBundshuh @richardbrooks01 @woodwardsports @CadeCunningham_ @DetroitPistons @TheUndefeated umm no they're not just as good as Mobley..I never said they were trash rookies either.  Mobley deserves to be at the top because his elite defense is a big reason for their success.  Mobley was better than both dudes in the college tourney also, in fact Wagner was on a 1 seed",
    "198": "@TyR503 @richardbrooks01 @woodwardsports @CadeCunningham_ @DetroitPistons @TheUndefeated What is your debate besides repeating what I said and calling me names like a child like that is going to hurt my feeling?",
    "199": "@TyR503 @richardbrooks01 @woodwardsports @CadeCunningham_ @DetroitPistons @TheUndefeated I never mentioned anything about defense. Mobley does score most of his points in the paint, that's a fact. While Cade shoots way more 3's",
    "200": "@TyR503 @richardbrooks01 @woodwardsports @CadeCunningham_ @DetroitPistons @TheUndefeated Mobley deserves to be at the top because of team success but Cade and Wagner are just as good as Mobley and Barnes but they are stuck on bad teams, but that don't make them trash rookies like you think. That's why I posted the link.",
    "201": "@BradleyBundshuh @richardbrooks01 @woodwardsports @CadeCunningham_ @DetroitPistons @TheUndefeated I never said Mobley was the number one option...we were talking about defense dumb dumb.  U said Cade faces the opponent's best defender every nite while Mobley is scoring his points in the paint against 3rd and 4th options.  U really dont know how to debate, go back into hiding",
    "202": "@BradleyBundshuh @richardbrooks01 @woodwardsports @CadeCunningham_ @DetroitPistons @TheUndefeated lol how deep did u dig to find this obscure website? Too bad the vast majority of unbiased and far more known reputable and known rankings have Mobley number 1",
    "203": "1960 Wilt Chamberlain scores 58 points, the most ever by an NBA rookie, as Philadelphia Warriors beat Detroit Pistons, 127-117 at Bethlehem, PA",
    "204": "Preview: Denver #Nuggets start a road trip against the Detroit #Pistons #MileHighBasketball @denverstiffs https://t.co/je7qte5oHr https://t.co/uH73m9VDJt",
    "205": "Preview: Denver #Nuggets start a road trip against the Detroit #Pistons #MileHighBasketball https://t.co/NIrpT8SgSx https://t.co/OSFumDbdXb",
    "206": "▶️▶️https://t.co/U1lgtQSBz4◀️◀️\n#NBA match today:\n#DetroitPistons vs #DenverNuggets\nand more coming live https://t.co/EJy18OTXBH",
    "207": "@TyR503 @richardbrooks01 @woodwardsports @CadeCunningham_ @DetroitPistons @TheUndefeated R you comparing Mobley to every big man? LMAO. Mobley isn't the number one option that's a fact. If you want to compare va rookie to Giannis, that would be Barnes, and Barnes is a 4th option as well but that doesn't mean he is trash. Lmao.",
    "208": "Detroit Pistons rematch vs. Denver Nuggets: Time, TV channel, game info #YahooSports #NBA https://t.co/7qTcWXujfQ",
    "209": "@Pistons__Talk I’m done watching Grant dribble the ball for 20 seconds and when he can’t get a shot off, he passes to Bey for a prayer rushed shot. \nThe bland average offense Detroit runs, stalls with Grant.",
    "210": "Detroit Pistons rematch vs. Denver Nuggets: Time, TV channel, game info #Detroit #Pistons #NBA https://t.co/UmazmeoFeG",
    "211": "⛹️‍♂️NBA --  Detroit Pistons vs Denver Nuggets\n\n🏀Play Time: Jan 25 2022, 20:00 (GMT-4)\n\n📣Prediction: Denver Nuggets\n\n👇Click here 2 view more\n\nhttps://t.co/CtoajLEg2S\n\n#DENvsDET #Pistons #Nuggets #NBA #NBA75 #NBAPicks #NBATwitter #ThatsGame #NBAECF #NBAWCF https://t.co/DItj6ILErV",
    "212": "Week Fourteen Ends On a High Note\n\nThe week began with a (102-86) victory over the Detroit Pistons and an overtime loss (117-121) to the Indiana Pacers, but the dubs fought hard to maintain their home-court record (21-4) with a thriller Friday. Read More: https://t.co/QlnsQMnVyC https://t.co/7RW1wW2AqR",
    "213": "New listing! \n\nKentavious Caldwell-Pope RC 2013-14 Panini Prestige #168 Detroit Pistons Rookie \n\nCheck it out: https://t.co/7PgMCOOhQm\n\n#TradingCards #ForSale #eBay https://t.co/mjKIizn4MK",
    "214": "@DetroitPistons so y’all haven’t learned from the @PelicansNBA whoever the GM is you gon lose yo job bud https://t.co/wnnDBtAzR8",
    "215": "@PreKobeEra @Benzene21 @stickyfingersFR @AirJordans2323 Detroit was the 4th best team in the league. \n\nYou guys expect Lebron to beat Toronto and Atlanta…but Jordan had no chance versus the Pistons. \n\nIt’s so funny.",
    "216": "#OnThisDay #25January #Year1960\nSports History:\nWilt Chamberlain scores 58 points, the most ever by an NBA rookie, as Philadelphia Warriors beat Detroit Pistons, 127-117 at Bethlehem, PA",
    "217": "Check out 2021 #Panini  Select #Pistons  Lot of 8 - Stewart Hayes Bey Lee  All Rookies Detroit  https://t.co/WMinnemHBh via @eBay",
    "218": "NBA\n7:00pm New Orleans Pelicans vs Philadelphia 76ers\n7:00pm Denver Nuggets vs Detroit Pistons \n7:00pm Charlotte Hornets vs Toronto Raptors \n7:00pm Los Angeles Clippers vs Washington Wizards\n7:30pm Sacramento Kings vs Boston Celtics \n7:30pm Los Angeles Lakers vs Brooklyn Nets",
    "219": "@BradleyBundshuh @richardbrooks01 @woodwardsports @CadeCunningham_ @DetroitPistons @TheUndefeated U're seriously sped..u think every big man is a 3rd or 4th option? who won MVP and who won Finals MVP last year? U're embarrassing yourself AGAIN",
    "220": "@BradleyBundshuh @richardbrooks01 @woodwardsports @CadeCunningham_ @DetroitPistons @TheUndefeated lmao he doesn't get the best defender on him every nite...I'm in the minority among Pistons homers, not the unbiased across the NBA",
    "221": "@EverythingxKing @JohnnyKaneTV @grantlong43 @DetroitPistons Beat Denver tomorrow",
    "222": "Congratulations to Keenxn who moved up 2 spots to take #24 on the Detroit Pistons team leaderboard.\n\nhttps://t.co/LcCBBkwPJ5",
    "223": "@TheNBACentral @EricPincus @19MGroup @Ralph_MasonJr \"Tertiary\"?? 😂😂😂 100% certified on crack. Good luck continuing to be a shining star on the Detroit Pistons.",
    "224": "@TheDonVisuals @CadeCunningham_ @DetroitPistons Thanks bro",
    "225": "@ZayTurner24 @Detroit_Stan14 @DetroitPistons @MotorCityCruise @hamidoudiallo @SaddiqBey @Dreamville_33 @nbagleague Lmaooooooooo",
    "226": "@hollowdadon Tay Roc “Detroit $$$$$ pissed on (Piston) with 11 in his back”",
    "227": "NBA Basketball Game Betting Picks Simulator: 1/25/2022 7:10 PM ET - Denver Nuggets vs. Detroit Pistons - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/JhP6Dsjefd #nba #sportsbetting #freepicks #cappertek",
    "228": "January 25, 1960 Wilt Chamberlain scores 58 points, the most ever by an NBA rookie, as Philadelphia Warriors beat Detroit Pistons, 127-117 at Bethlehem, PA #Today #OnThisDate #People #History #Event #Now #PR https://t.co/Uxni1IDsco",
    "229": "@DetroitPistons @MotorCityCruise @hamidoudiallo @SaddiqBey @Dreamville_33 @nbagleague you love to see it",
    "230": "The NBA some of the next round games in play in the NBA Basketball league:\n\nDetroit Pistons v Denver Nuggets\n\nhttps://t.co/zsdRGVvRQZ\n\n@NBA \n#Basketball https://t.co/LZ9Z12xdht",
    "231": "@Dreamville_33 Aye Man! When You gone show mfs you that dude and make mfs scared of you dominate put fear in these mfs hearts have them respect you you a damn @DetroitPistons  my baby in detroit WE ROLE DIFFERENT WE CUT DIFFERENT! You are the HEart of the team man! U gt DOG IN U?",
    "232": "@erictwigs @jesterthaclown @DetroitPistons @MotorCityCruise @BallySportsDET @nbagleague … (cont.) besides, being a GR native in Detroit, this is too much fun. Besides, GR still has the affiliates of the Tigers (Whitecaps) &amp; Red Wings (hockey). Just think of it as a friendly sibling rivalry. With that being said, let’s go Cruise!!! #StartYourEngines",
    "233": "@erictwigs @jesterthaclown @DetroitPistons @MotorCityCruise @BallySportsDET @nbagleague Relax dude, I’m from Grand Rapids originally &amp; I’m enjoying this. I’m a Pistons fan first, so I’m not rooting for the Nuggets affiliate against the Pistons’ affiliate. It’s just a fun rivalry. Are fans across the state alienated over MSU vs U of M, nah. It’s just for fun…",
    "234": "@MotorCityCruise @DetroitPistons Coney Island Hot Dogs.",
    "235": "@erictwigs @jesterthaclown @DetroitPistons @MotorCityCruise @BallySportsDET @nbagleague It's banter.",
    "236": "@ichheissesonnig @jesterthaclown @DetroitPistons @MotorCityCruise @BallySportsDET @nbagleague Find me any other example of a team hating on a large section of their own fanbase…you won’t",
    "237": "For those of you wondering where ex-NBA player Lindsey Hunter is…he’s the men’s HC at Mississippi Valley State U.\nHunter played for the @DetroitPistons @chicagobulls @Raptors @Bucks &amp; @Lakers winning 2 Championships during his 17 year career. https://t.co/P3pv2GZNXs",
    "238": "@DetroitPistons @sixers @HoustonRockets @Raptors @celtics y’all boys trippin man this some nice talent. I can send y’all film on these guys https://t.co/dLaIp9W8qu",
    "239": "@clutchfans Detroit’s playing better Go Pistons",
    "240": "@EverythingxKing @JohnnyKaneTV @grantlong43 @DetroitPistons What did I miss?",
    "241": "Check out \"I'm a bad boy like a Detroit piston\" https://t.co/opLyrbFqNh",
    "242": "@MotorCityCruise Tbh you deserved that L for all the west side slander. We give our all to the @DetroitPistons too",
    "243": "@Pistons_PR @DetroitPistons Feel sorry for them! Garza and Stanley gave their all! There has to be a place next season on Pistons for Lee! All three will get the playing time they need on Cruise! Nice to have Pistons G League team right in city! Looking forward to Wednesday game against Raps G League team!",
    "244": "@DetroitPistons @MotorCityCruise Please stream Motor City Cuise games on Facebook!",
    "245": "@erictwigs @jesterthaclown @DetroitPistons @MotorCityCruise @BallySportsDET @nbagleague 1. It's rivalry banter.\n2. They're located in Detroit...",
    "246": "Check out this listing I just added to my #Poshmark closet: Rick Mahorn Signed NBA Basketball Detroit Pistons Proof Beckett BAS Autographed. https://t.co/XCfBiysHpV #shopmycloset @poshmarkapp",
    "247": "@DetroitPistons @MotorCityCruise Thanks!👍",
    "248": "@erictwigs @jesterthaclown @DetroitPistons @MotorCityCruise @BallySportsDET @nbagleague Drive aren't the Pistons affiliate anymore. Should they not be rooting for the team they own?",
    "249": "@DetroitPistons @MotorCityCruise @hamidoudiallo @SaddiqBey @Dreamville_33 @nbagleague That Detroit crew 😍",
    "250": "@MotorCityCruise @YumVillage @EVERYDAYIMOK_ @DetroitPistons  thank you for the honor and the privilege to be present! @alexis_is_it always ready to represent",
    "251": "If you wasn’t in the city during the blackout or when the Pistons won back in 04 can u really even say u from Detroit",
    "252": "Eminem X Bleacher Detroit Pistons Jersey T-Shirt Shady\nhttps://t.co/m86i2v4UIe",
    "253": "@DetroitPistons @MotorCityCruise @hamidoudiallo @SaddiqBey @Dreamville_33 @nbagleague This is awesome!",
    "254": "@KuKhahil @lockedonpistons If Detroit Pistons didn’t exist, who’s your team in the NBA?",
    "255": "@DetroitPistons @MotorCityCruise @hamidoudiallo @SaddiqBey @Dreamville_33 @nbagleague future lions rb lowkey pissed himself",
    "256": "@jesterthaclown @DetroitPistons @MotorCityCruise @BallySportsDET @nbagleague So you’re going to pretend that the Grand Rapids Drive meant nothing to the second biggest city of Pistons fans? Surely not?",
    "257": "@Detroit_Stan14 @DetroitPistons @MotorCityCruise @hamidoudiallo @SaddiqBey @Dreamville_33 @nbagleague Scared of his future home",
    "258": "@DetroitPistons @MotorCityCruise @hamidoudiallo @SaddiqBey @Dreamville_33 @nbagleague Why does Stew look scared 😭😭",
    "259": "Some familiar faces in the crowd tonight at the @MotorCityCruise game. #StartYourEngines https://t.co/4DdttKU9UW",
    "260": "1/24/01 – Cliff Robinson (27p; grey headband), and the Phoenix #Suns recorded their largest margin of victory ever over the Detroit Pistons, with a 106-73 win at Auburn Hills. DET: 15-32 FTs, B. Wallace: 0-4 w/2 air balls. Marion: 18p/16/5a. Tsakalidis: 9p/11r/5b. #ValleyProud https://t.co/VyzC5W5YPq",
    "261": "What should Detroit Pistons do about Cassius Stanley now? (via @Realstuartl)\n#Pistons \n#NBA @DukeMBB\nhttps://t.co/Jj5T2autRw",
    "262": "Excellent job from @JohnnyKaneTV and @grantlong43 !!! and S/O to Troy Weaver for dropping some jewels just now... creating a philosophy is the focus, the #Pistons way!!! Patience @DetroitPistons",
    "263": "@BallySportsDET @DetroitPistons @MotorCityCruise That audio 😬",
    "264": "We hear from @DetroitPistons GM Troy Weaver, who talks about the importance for growth of the @MotorCityCruise players. #StartYourEngines #Pistons https://t.co/G0lczp4J4K",
    "265": "2nd quarter right around the corner on Bally Sports Detroit. #StartYourEngines #Pistons https://t.co/iHJsYCWW8p",
    "266": "@erictwigs @DetroitPistons @MotorCityCruise @BallySportsDET @nbagleague Mf its a gleague game",
    "267": "Week Fourteen Ends On a High Note\n\nThe week began with a (102-86) victory over the Detroit Pistons and an overtime loss (117-121) to the Indiana Pacers, but the dubs fought hard to maintain their home-court record (21-4) with a thriller Friday. Read More: https://t.co/QlnsQMnVyC https://t.co/V8O4iA45fe",
    "268": "@detroit_weekly @Pistons__Talk Ayton it is.",
    "269": "@mattramage Matt in Detroit here the new pistons GM said the Detroit Pistons don't rebuild they restore same goes for GB",
    "270": "@Edoliver_11 Even the 90s Bulls had to pay their dues before breaking through years of Detroit Piston smackdowns. Bulls got better every year until one year they were just flat out better and destroyed the Bad Boys. The rest is history",
    "271": "@detroit_weekly @LumberghFukter @Pistons__Talk And if we end up with Chet? Cade Hami Bridges Saddiq Chet sounds like a fun lineup to me tbh",
    "272": "@CadeOverJalen @DetroitPistons @MotorCityCruise @BallySportsDET @nbagleague @mcuban a 🐐 owner. he cut the price in half for direct tv stream in dallas. @TomGores doesn’t do shit for us pistons fans",
    "273": "@baasitashraf @DetroitPistons @MotorCityCruise @BallySportsDET @nbagleague They gotta make Bally more accessible, can’t watch shit",
    "274": "@DetroitPistons @MotorCityCruise @BallySportsDET @nbagleague Really cool that you’re trying to alienate your fan base in the west side of the state even further today.",
    "275": "@DetroitPistons @MotorCityCruise @BallySportsDET @nbagleague barely any of us have access to @BallySportsDET",
    "276": "Go get ‘em, @MotorCityCruise. \n\nTune in to watch on @BallySportsDET. https://t.co/midbtqNcgN"
}