{
    "0": "Up Next on NBA League Pass:\n\n@sixers v @trailblazers \n@utahjazz v @SacramentoKings \n\n#NBA75 https://t.co/kgd2tJDcPM",
    "1": "NBA Rumors: Sacramento Kings center calls out team for lack of effort (@JackSimoneNBA)\nhttps://t.co/BH2jrjUXfQ",
    "2": "Sacramento Kings - Utah Jazz, over 221.5 1.98 58% 3u #Sukkelat",
    "3": "@SacramentoKings @CaliBeefCouncil Does Walton eat this….have a special ingredient I’d like to add 💩",
    "4": "@chemgal1 Sounds like the life of a Sacramento Kings fan tbh",
    "5": "Guess who is about to waste another 2 and a half hours watching the Sacramento Kings? https://t.co/RMWpLrqLMO",
    "6": "@SacramentoKings Hello!! 👋🏻👋🏻👋🏻 #SacramentoProud https://t.co/UjCfYHDwMv",
    "7": "Sacramento Kings fans getting ready for the game tonight https://t.co/58kEREO6NE",
    "8": "Utah Jazz @ Sacramento Kings\n\nProjected Score and Player Point Projections\n\n1 x SPREAD BET RECOMMENDED\n1 x PLAYER PROP RECOMMENDED\n\nhttps://t.co/8KbWNd6HQx",
    "9": "@SacramentoKings @MattressFirm Oh I have a great memory, I remember when I became a kings fan, 9 years later I’m just a miserable #firewalton \n\nhttps://t.co/B8axdkvx3H",
    "10": "@SacramentoKings @Verizon @swipathefox @TyHaliburton22 @hbarnes @Chimezie_Metu @Rich_Holmes22 FIRE WALTON UNLESS WE WANT ANOTHER BOOGIE SITUATION #SAVEDEAARON #FIREWALTON\nhttps://t.co/B8axdkvx3H",
    "11": "Sitting at a kings game pre tip-off.   No one within 6feet of me.   Do I need to wear a mask? @SacramentoKings",
    "12": "@SacramentoKings @Verizon @swipathefox @TyHaliburton22 @hbarnes @Chimezie_Metu @Rich_Holmes22 Please put Harkless and Len in the second unit at least",
    "13": "@SacramentoKings @Verizon @swipathefox @TyHaliburton22 @hbarnes @Chimezie_Metu @Rich_Holmes22 I feel so bad for Fox",
    "14": "@SacramentoKings @Verizon @swipathefox @TyHaliburton22 @hbarnes @Chimezie_Metu @Rich_Holmes22 Why do you suck? 😂",
    "15": "Y’all want Ben Simmons? @SacramentoKings https://t.co/7Nwn0BtY2X",
    "16": "@SacramentoKings @Verizon @swipathefox @TyHaliburton22 @hbarnes @Chimezie_Metu @Rich_Holmes22 No @nemi1599, no party 🤷",
    "17": "Utah Jazz vs Sacramento Kings: Game Thread https://t.co/dHLZepc6xe",
    "18": "@SacramentoKings @Verizon @swipathefox @TyHaliburton22 @hbarnes @Chimezie_Metu @Rich_Holmes22 Why? Play 12 games with one starting 5 now were completely taking 2 key players out of the rotation honestly fire Walton",
    "19": "ALERT: New high roller bet posted!\nA bet has been placed for $6,300.00 on Sacramento Kings - Utah Jazz to win $8,190.00.\nTo view this bet or copy it https://t.co/4eMjwiUMg7 https://t.co/egaYGDHjGv",
    "20": "4 Sacramento Kings coaching candidates to replace Luke Walton https://t.co/uxko0dFs0g #NBA #SacramentoKings",
    "21": "@SacramentoKings @Verizon @swipathefox @TyHaliburton22 @hbarnes @Chimezie_Metu @Rich_Holmes22 It’s like they say, if it’s BROKEN definitely don’t fix it…",
    "22": "@SacramentoKings @Verizon @swipathefox @TyHaliburton22 @hbarnes @Chimezie_Metu @Rich_Holmes22 I hate you",
    "23": "@SacramentoKings @Verizon @swipathefox @TyHaliburton22 @hbarnes @Chimezie_Metu @Rich_Holmes22 switch something up… smh",
    "24": "@SpareRibShane @SacramentoKings Show them the sprint video in the park. You'll get signed immediately 😂😂😂😂",
    "25": "Who y'all got tonight .@utahjazz x .@SacramentoKings \n#UtahJazz #SacramentoKings #NBA75 #NBATwitter #NBA #nbaontnt #DFS #FantasySports #DraftKings #FanDuel #Twitter #Facebook #instagram #Poll #Vote",
    "26": "Going with the purple De’Aaron Fox jersey tonight!!! 🦊🦊🦊 Hoping for a @SacramentoKings win tonight!! #SacramentoProud https://t.co/6pklfR5pGy",
    "27": "You're 60 second preview for tonight's Utah Jazz versus Sacramento Kings. Well the key things to watch and look for #TikTok https://t.co/B45vwibeFW",
    "28": "@FarmAndSport @CarmichaelDave I'm actually a Warriors fan but have casually followed the Kings as I have lived in Sacramento for most of the past 20 years, and my twitter feed had more politics and gaming/Arcane tweets over the past few days.",
    "29": "@matthew_peirson @SacramentoKings When they want to get serious about making the play-in they’ll give me a call lmao",
    "30": "I mean, @JCrossover can STILL do this and no NBA team wants to give him a chance to help. Any team with young players @HoustonRockets @DetroitPistons @SacramentoKings @PelicansNBA could use his guidance https://t.co/JjTfMncexr",
    "31": "So they gonna let Luke coach this team still! 😔😔😔😔 @SacramentoKings",
    "32": "@RealTalk900 2000s Sacramento Kings and Phoenix Suns if a couple plays turned out different.",
    "33": "@SpareRibShane @SacramentoKings GIVE HIM A LIFETIME CONTRACT RIGHT NOW",
    "34": "@KaseyRayScott @SacramentoKings @nbatopshot This is fantastic, can’t believe I missed this",
    "35": "Join us for Christ the King Sunday at St Paul's Lutheran Church in Sacramento, CA. Worship Service begins at 9:30 AM. \n\nhttps://t.co/vEL7hShZzX",
    "36": "Hoping the Sacramento Kings win tonight and it's not a... https://t.co/1cqgCx5ynZ",
    "37": "@kennythomasnba @momoragan @NBCSKings @SacramentoKings Did you bring the gold jersey Kenny?!? C’mon man, let’s get it!!!",
    "38": "@Scottscooterpie @TimMaxwell22 Exactly don't forget Dave was undermined my the front office. He loved the fans, the team, and every single player. Sacramento deserved to have him here for the long haul. He would have helped create a gold standard. Single worst decision by Kings ever.",
    "39": "Hello @SacramentoKings , today I would like to make a couple suggestions to become a 70-12 win team. Fire Luke Walton, hire Becky Hammon, bench Moe Harkless, start Lou King, trade Bagley for anything that has a heartbeat. There you go.",
    "40": "@JackieChristie @TheDougChristie @SacramentoKings Looks like a great time Mrs. Christie 🖤",
    "41": "It’s time for Rico to be the Head Coach of the Sacramento Kings. …Kings better not let this man walk. Could another Monty Williams. https://t.co/gPI0ojIKFM",
    "42": "I didn’t even realize we play the Sacramento Kings again tonight. How is it possible to play them a third time already?!??!!",
    "43": "@lilgmusic_ @SacramentoKings so sick, and honored by your soundtrack choice 🥺",
    "44": "@SacramentoKings @MattressFirm what happened to ur social media presence",
    "45": "@SacramentoKings I Think if Coach Walton doesn't find a way too Win on this hm stand.He will out of a Job.We are already a laughing https://t.co/XcXGMpGrcd booing on Friday's https://t.co/DzqGXBnJZH Heart in this Team.xx",
    "46": "Utah Jazz vs Sacramento Kings #NBATwitter #uniwatch https://t.co/WH3lEBgUa9",
    "47": "@CourtneyLoveNJ @sports_sell @HobbyConnector @Huff330 @24_7SportsCards @TheHobby247 Just a little update\n\nToronto Raptors$41\nOklahoma City Thunder$55\nDetroit Pistons$65\nNew York Knicks$90\nGolden State Warriors $95\nSacramento Kings$95",
    "48": "And yet another night of paying for the NBA package, only to have the Jazz game blocked because it's against Sacramento. Dear Dish, Living in NV doesn't equate to being a @SacramentoKings fan.\nIf I pay, let me watch my @utahjazz play.",
    "49": "@SacramentoKings @MattressFirm Court side seats would be nice regardless of how the team is playing",
    "50": "@SacramentoKings @MattressFirm Fire walton",
    "51": "@EllaHernangomez @momoragan @NBCSKings @SacramentoKings No we are not. Sorry",
    "52": "@SacramentoKings @MattressFirm who wants courtside seats to begin with",
    "53": "@kennythomasnba @momoragan @NBCSKings @SacramentoKings Are y'all goin to brodcast how to fire Luke?",
    "54": "@kennythomasnba @momoragan @NBCSKings @SacramentoKings Starting to love you guys as a duo. After last nights stinker I might tune into pre and post game and skip the game so I only get the good parts lol",
    "55": "I will be on with @momoragan on @NBCSKings at 630 PST, check us out for @SacramentoKings pregame",
    "56": "@drewtay8 @SacramentoKings lol, I can't believe they thought people wouldn't notice these were so obvs fake",
    "57": "Pretty sure I shared these super-fun-facts the last time the Kings faced Utah, buttttt....\n\nThe Sacramento Kings:\n- have not defeated the Jazz since November 1, 2019\n- are currently on a six-game losing streak vs Utah\n- hold a 6-22 record vs Utah since the 2013-14 season\n\nNeat!",
    "58": "Plus I was lucky enough to be there for the Robert Horry game against the Sacramento Kings... Several NBA Finals games... Sat by dozens of A-listers... Annoyed almost every single one. \n\nJust saying... Thank you Staples Center. I truly had the time of my life with you.",
    "59": "Sacramento Kings",
    "60": "NBA Picks &amp; Parlays Today: Best Expert Betting Picks &amp; Predictions | Sacramento Kings &amp; De’Aaron Fox 11/20 — @Bucn4life \n\nhttps://t.co/Vq4Nv9bGLs",
    "61": "NBA Picks &amp; Parlays Today: Best Expert Betting Picks &amp; Predictions | Sacramento Kings &amp; De’Aaron Fox 11/20 — @Bucn4life \n\nhttps://t.co/GbFUawQ9dv",
    "62": "NBA Picks &amp; Parlays Today: Best Expert Betting Picks &amp; Predictions | Sacramento Kings &amp; De’Aaron Fox 11/20 — @Bucn4life \n\nhttps://t.co/IlzygJoQgR",
    "63": "Sacramento Kings can't go another season just going through the motions and miss another play-off berth. Make that Ben Simmons trade happen and surround him with shooters like Haliburton and Buddy Hield",
    "64": "Kings vs. San Antonio Spurs Highlights 11.10.21 https://t.co/IuKS6nlP6o via @sacramentokings",
    "65": "Kings vs. Phoenix Suns Highlights 11.8.21 https://t.co/OmOtzHJ1Ha via @sacramentokings",
    "66": "I'm really going to miss Jaden when he's playing for the Sacramento Kings next year. #BoilerUp",
    "67": "With all the talent on the team, Sacramento Kings cant get enough wins to look like a team that could attract free agents. Trade Fox, a first round draft pick, another player filler &amp; Harrison Barnes for Ben Simmons. With Halliburton, Hield &amp; Terrence Davis, Simmons will thrive.",
    "68": "The Knicks &amp; Rockets are currently teaming up to put together one of the worst quarters of basketball I’ve ever seen. And that says a lot considering that I’m a lifelong Sacramento Kings fan. I https://t.co/IVmJdYP82o",
    "69": "better than masks @SacramentoKings",
    "70": "In 2013, then NBA owners voted 22-8 to keep the Kings in Sacramento instead of move them to Seattle. https://t.co/2HzjEsBkxR",
    "71": "are the @SacramentoKings handing out paper bags tonight to fans?",
    "72": "@VTownGotSmoke @VicTafur @LibbySchaaf @NFL @SacramentoKings So then what’s the deal? Why are the As buying land in Vegas? Something is off. As far as the nfl and an expansion team, I don’t think the Nfl wants a team in oak. To put it gently, I don’t think they like “our kind”",
    "73": "@Kings_6thMan @SacramentoKings Bless your heart Barbara, you are so faithful. I have stuck with the Kings through thick and thin, but right now I am so down.",
    "74": "Sacramento Kings center calls out team for lack of effort | SportsNus https://t.co/XZQgK4CVWg",
    "75": "New tumblr post: \"#NBA2K22 Sacramento Kings vs Oklahoma City Thunder MyLeague PS4...\" https://t.co/ILt5I7tgLF ifttt, youtube",
    "76": "@DalanoDimes @SacramentoKings FVV and Boucher",
    "77": "@d__swartz @SacramentoKings Had to show mr rob what’s up",
    "78": "@d__swartz @JJ_redmon31 @SacramentoKings Nothings changed I guess🤷🏻‍♂️",
    "79": "Hey @SacramentoKings there’s only one more week left in the junior high season, I’d be available to coach starting december. Resume is a 3-5 record with a 20 victory over cross town rival https://t.co/1Tbevd6zZW",
    "80": "@SacramentoKings 🆚 @utahjazz \n@nyknicks 🆚 @HoustonRockets \n\n@JCMacriNBA delivers his picks for both of these Saturday night games. ⤵️\n\n#NBA75 #NBAPicks | #BeatTheOdds👊\nhttps://t.co/MLNhMtCZEZ",
    "81": "@realchriswebber Can you Buy the @SacramentoKings please?",
    "82": "We bicker and banter, but nothing fires me up more than Sacramento Kings fans getting jobbed. \n\nThis goes way beyond a coach. It’s the whole thing. The WHOLE thing. \n\nBottom line, a fanbase can only take so much. Clock is ticking. Loyalties aren’t infinite, even here.",
    "83": "Utah Jazz has dominated Sacramento winning six straight games in nine of the last 10 matchups.\n\nFind the right pick for you: https://t.co/biRMM0Tsr0\n\n#TakeNote #Kings #NBA75 https://t.co/NitfANNN2f",
    "84": "Live pregame, in-game and postgame updates on tonight’s game between the Sacramento Kings and Utah Jazz at Golden 1 Center. https://t.co/usoLqUjXDA",
    "85": "@SacramentoKings @CaliBeefCouncil I DONT CARE @mmcnair FIRE LUKE WALTON #FIREWALTON",
    "86": "Oh shit, I forgot the @SacramentoKings get to lose another game in blowout fashion tonight 😄😄😄😄😄😄😄😄😄😄😄😄😄😄😄 https://t.co/zoTJomSN9T",
    "87": "𝗚𝗔𝗠𝗘𝗗𝗔𝗬\n🏀 » Utah Jazz at Sacramento Kings\n⏰ » 7:00 PM PST\n📺 » NBCS CA\n📍 » Golden 1 Center https://t.co/AZdVaEjqtn",
    "88": "Dude looks so over the Sacramento Kings https://t.co/J9onk7vcYB",
    "89": "#TradingCards #SacramentoKings #TyreseHaliburton #NBA 2020-21 Prizm Tyrese Haliburton Rookie Card RC #262 Sacramento Kings NBA https://t.co/hyqpc0YTBv @eBay",
    "90": "Sacramento Kings fans. Every year. About this time. https://t.co/NnLiIkVdwh",
    "91": "@SacramentoKings Luke Walton is so dumb, his teammates got caught stealing from a vending machine while he was the lookout.",
    "92": "@rbritoreis No @nemi1599 , no party! @SacramentoKings",
    "93": "@nerd_wit @colinswerld @TheAthleticNBA @buddyhield @SacramentoKings Ya. Curry didn’t start really cooking until like his 4th year. That is when he started changing the way the game is played.",
    "94": "@ards_yt @johnnyz54 @DrDraiders @VicTafur @LibbySchaaf @NFL @SacramentoKings Okay, this is a little different. The O Coliseum will be no more. Jack London Square is the target location for a new sports complex. We shall see...",
    "95": "@PLS4061 @SacramentoKings @CoorsLight @hoopculture13 Duh. Lol",
    "96": "@thekingsherald Sacramento Kings Basketball Of Confusion https://t.co/BPRU7I5un2",
    "97": "@ards_yt @johnnyz54 @DrDraiders @VicTafur @LibbySchaaf @NFL @SacramentoKings Similar group was part of the NFL expansion in LA but in the end they couldn't raise enough money. I'm not familiar with this group but I will check them out.",
    "98": "@B3NAMI @SacramentoKings LOL this has to be the one 😂",
    "99": "@SacTownKingCA @SacramentoKings Again ? Lol",
    "100": "@SacramentoKings @CoorsLight @hoopculture13 dont care fire luke walton",
    "101": "Utah Jazz vs Sacramento Kings 11/20/2021 Picks Predictions Previews\n\nhttps://t.co/i3MyTb0fEV\n\n#NBABbetting #NBA #NBApicks #NBAprediction #NBAparlay #expertpicks #odds #picks #freepick #freepicks #sportsbetting #basketballpicks #handicapper #sportspicks #Jazz #Kings https://t.co/U5Yu1lrtQ2",
    "102": "Looking for a value bet?  See if the Utah Jazz-Sacramento Kings Predictions and Preview for 11/20/2021 is one in our preview.  No crazy hype just a prediction and preview. #Sportsbook #SportsBetting https://t.co/xnmYmwa6Ve",
    "103": "My big brother is here for a short visit (and Kings vs Jazz game tonight). He really enjoyed the Midtown Farmers Market here in #sacramento! https://t.co/PecNy8abJE",
    "104": "@commissioneryas @SacramentoKings #SACKINGS love it",
    "105": "@SacramentoKings @MB3FIVE Please.. Fire Luke! 3 horrible season",
    "106": "Sacramento Kings Predictions and Preview for 11/20/2021 hosts Utah Jazz.  Find out who we are taking in this matchup. #Sportsbook #SportsBetting https://t.co/xnmYmwa6Ve",
    "107": "Game 17 of the Sacramento Kings baby!!! https://t.co/TtvgRWLItN",
    "108": "@KevinOConnorNBA @ringer The situation in Sacramento is really turning ugly and I don’t think getting rid of Walton fixes anything what flaws do you see in the Kings roster? And do you believe Fox might play better as an omega instead of an alpha ?",
    "109": "thank you for the hospitality @SacramentoKings and thanks for having my pops back for the halftime show. had a blast.\n•\nsong: kawa - @ox_themoron https://t.co/WLVCj4OgTj",
    "110": "Painful to watch the Kings lose but this is our team &amp; I am going to keep my hope until I die! 👊🏻We appreciate Phil san for taking us out tonight! 🙏🏻#SacramentoProud #DeAaronFox #haliburton @swipathefox @SacramentoKings @CoachOates https://t.co/6JTbZyk5r3",
    "111": "I lost so many high profile followers from my other account. Im shaking and screaming. I had big anitwt people following me and the Sacramento kings as an example 😭",
    "112": "@KevinOConnorNBA @ringer Are the Sacramento Kings issues a Luke Walton, player talent or roster construction issue?",
    "113": "@JackieChristie @SacramentoKings @NBA Awesomeness 🖤",
    "114": "♠️💜 Game Night 🤍 with Hubby @TheDougChristie love our @SacramentoKings #sacproud #dougchristie #coacheswife https://t.co/ALF1kGdv0T",
    "115": "@brandonjinx @DragonflyJonez This and “More foreign shooters than the Sacramento Kings” always stick with me",
    "116": "♠️last night🤍 @SacramentoKings @NBA https://t.co/48dXCoKBvS",
    "117": "@YaitesJames @SacramentoKings Man I been donating money to this franchise for the past 15 years season tickets jerseys all of it but man we’re a clown of a franchise it’s drained me to the fullest 😩😩",
    "118": "🏀 #NBA\n\nUtah Jazz 🆚 Sacramento Kings\n📆 Dom 21 nov 04:10\n\n#Raspibets #FreePicks #FreeTips #StatBets #SportsBetting #BettingTipster #TakeNote #Kings\n🆓🔎📈⬇ https://t.co/Ylq2MscvOk",
    "119": "@WordsmithRich @Arsenal @SacramentoKings Seems like it’s just a matter of time",
    "120": "@MarcosBreton @Arsenal @SacramentoKings Gotta wonder how safe Luke Walton's job is these days.",
    "121": "@collazo530king @SacramentoKings You hella faithful dawg and I love it",
    "122": "The self-titled debut of @joshgroban's 20. From a Queen of CA (Sacramento Kings—Groban) to a Duke of York (NJ Devils—Hell's Kitchen's A. Keys (née Cook), I stayed true @ Pembroke Hill—2022 Best HS in KC Area—to America's CŒUR—Chiefs/Royals—by staying HOME.\nhttps://t.co/1o08dAUOew",
    "123": "@aaronbruski Thanks for your support bruski your honesty is what makes us @SacramentoKings fans feel better",
    "124": "Well, @Arsenal got destroyed but at least I have the @SacramentoKings to lift my spirits. Oh wait….",
    "125": "The Utah Jazz aim for their second victory of the season in Sacramento when they oppose the staggering Kings on Saturday night. https://t.co/cE7Mv4kRpW",
    "126": "@TheJenK3 @roham @Eisenberg43 @arthcmr @SacramentoKings That's very cool 🔥",
    "127": "@ards_yt @johnnyz54 @VTownGotSmoke @VicTafur @LibbySchaaf @NFL @SacramentoKings Let us know when that pans out.  Im not trying to be completely negative, but the road to an expansion team is so far beyond having investors who want to make it happen.  There are thousands of miles of red tape, owners, and Oakland simply isn’t the market the NFL wants.",
    "128": "@johnnyz54 @DrDraiders @VTownGotSmoke @VicTafur @LibbySchaaf @NFL @SacramentoKings Google AASEG NFL",
    "129": "@kfippin @TimMaxwell22 What they should do is move the team to Seattle, in King County Washington. The 'Sacramento Kings' will always suck. No player wants to be drafted here, and fo sho, no superstar will ever come here.",
    "130": "@SacramentoKings @CoorsLight @hoopculture13 Walton won’t make it past all star wknd.. already lost the locker.. &amp; someone please recognize TT for his motivated 9 minutes of dogshit play 💩",
    "131": "@RobParkerFS1 @utahjazz @SacramentoKings @BALENCIAGA Look out now! Moving on up haha",
    "132": "Headed to Sac-Town for the @utahjazz - @SacramentoKings game tonight. Rockin those @BALENCIAGA kicks my niece, Brandi, got me. #socomfy https://t.co/aBXKuQiVX2",
    "133": "Memphis Grizzlies x Minnesota Timberwolves\nNBA LEAGUE PASS\n00:00 – Philadelphia 76ers x Portland Trail Blazers\nESPN, WATCH ESPN, STAR+ e NBA LEAGUE PASS\nUtah Jazz x Sacramento Kings\nNBA LEAGUE PASS",
    "134": "@joshuabporter @KhrayanGrant @Golden1Center @SacramentoKings That would’ve worked too lol horrible game last night",
    "135": "@AcampoJo_49er @KhrayanGrant @Golden1Center @SacramentoKings 4th quarter: Why is the arena so empty?",
    "136": "@SacramentoKings @CoorsLight @hoopculture13 Cold hard fact : Luke Walton NEVER should have been hired in the first place…..NOW FIRE HIM!",
    "137": "Sacramento Kings should just do the needful and trade for Ben Simmons from Philadelphia Sixers and surround him with him the bevy of Guards. Trade De'Aaron Young for Simmons for a Guard for Guard swap",
    "138": "What would the Sacramento Kings flavored ice cream be? 🍦#sacramentoproud https://t.co/EeLj0iFoDn",
    "139": "It’s so funny to me how after all of the ups and downs that @SacramentoKings have had to go through that Kings fans can’t clearly see that Luke Walton and co. wasn’t the problem with this team. Do they share a little responsibility? Ultimately yes because they are the Coaches.",
    "140": "@TheJenK3 @roham @Eisenberg43 @arthcmr @SacramentoKings WOW! Seriously impressive Jenny ✨❤️‍🔥✨",
    "141": "Feel like the Utah Jazz absolutely dismantle the Sacramento Kings tonight.",
    "142": "@TheJenK3 @roham @Eisenberg43 @arthcmr @SacramentoKings Very impressive!",
    "143": "Showing my love for my team 💖…I hear you @roham @Eisenberg43 @arthcmr @SacramentoKings   … here’s my Kings “Pure” Team set 😁🥰🥂 at least 1 of every moment available, all tiers!! Let’s go!! Lol!\nhttps://t.co/znktTLBu5J",
    "144": "Monte McNair performance can’t be judged until he gets to hire his own coach. #sacramentokings",
    "145": "The feeling I get when I watch my college hoops team or the Sacramento kings is the same feeling I used to get when I watched the chargers.",
    "146": "@LowDump @CarmichaelDave @SacramentoKings I told Dave last night great time to be a Warrior fan !",
    "147": "Fire Luke Walton, should’ve never been hired in the first place @SacramentoKings",
    "148": "Its Saturday 10AM PST! And Luke Walton is STILL HC of the @SacramentoKings 🤦🏿‍♂️🤦🏿‍♂️🤦🏿‍♂️🤦🏿‍♂️🤦🏿‍♂️",
    "149": "@SacramentoKings @Chimezie_Metu @Acronis @Executech You should stop tweeting at this point…..nobody gives a f**k ….FIRE LUKE WALTON",
    "150": "@SociosHoops @MiamiHEAT @WashWizards @hornets @ATLHawks @okcthunder @celtics @OrlandoMagic @Bucks @memgrizz @Timberwolves @utahjazz @SacramentoKings LET'S GO HEAT!!! #HeatCulture",
    "151": "@SacramentoKings Starting a petition for Bobby Jackson as head coach",
    "152": "NBA Picks &amp; Parlays Today: Best Expert Betting Picks &amp; Predictions | Sacramento Kings &amp; De’Aaron Fox 11/20 — @Bucn4life \nhttps://t.co/Vq4Nv9bGLs",
    "153": "@JohnMiddlekauff Looks more like the @SacramentoKings 🤬",
    "154": "NBA Picks &amp; Parlays Today: Best Expert Betting Picks &amp; Predictions | Sacramento Kings &amp; De’Aaron Fox 11/20 — @Bucn4life \nhttps://t.co/IlzygJoQgR",
    "155": "NBA Picks &amp; Parlays Today: Best Expert Betting Picks &amp; Predictions | Sacramento Kings &amp; De’Aaron Fox 11/20 — @Bucn4life \nhttps://t.co/GbFUawQ9dv",
    "156": "@FCartoscelli3 Love love love them waiting for big sizes to come out! Too tall for 3xl do better @SacramentoKings your a basketball team for heaven’s sake and don’t have jersey’s for tall people 🤔🤷🏻‍♂️",
    "157": "@SacramentoKings @CoorsLight @hoopculture13 Fire Walton. Trade Fox. Or trade Haliburton to a better team where he deserves.",
    "158": "Gameday! (16/82)\n\n🏀 Utah Jazz x Sacramento Kings\n📌 Golden 1 Center, Sacramento, CA\n⌚ 0h\n📺 NBA League Pass / Bet365\n🟡 Statement Edition\n\n#NBA75 #TakeNote https://t.co/LOg8a8dxiH",
    "159": "@SacramentoKings hit my line im ready",
    "160": "Paskal Siakam raised the #Raptors to the away win over #SacramentoKings  32 points, 8 rebounds and 2 blocks, with stratospheric shooting percentages:\n - 10/12 in tc (83.3 %)\n - 3/3 in triples (100 %)\n - 9/10 in free practice (90 %)\n  https://t.co/FfX5aY2QOx",
    "161": "@SacramentoKings \nGood Morning \nQuick question \nIs Luke Walton gone yet?\nAsking for a friend …. Actually asking for myself",
    "162": "I want to take my dad to a Sacramento Kings game \n\nAt Kings games … do you have to show VIRTUAL vaccine cards or do they allow the paper copy?\n\nMy 82 year old dad has a flip phone and has NO clue what a QR code is lol \n\nGo Kings! @Golden1Center",
    "163": "@MarketWatch Took my twins to the @SacramentoKings game last night for less than $50. But okay....",
    "164": "@SeanCunningham said it well on the The Kings Best podcast with @James_HamNBA Thursday … \n\n“Most families really only get to go to one game a year because of prices.”\n\n@SacramentoKings here ya go :)",
    "165": "@andreynuke @SacramentoKings That’s cool bro if this about me unfollowing u cuz I don’t wanna associate with someone who feels the need to bring skin color into things that’s fine",
    "166": "@CarmichaelDave my wife told me during last nights game that she feels sorry for me, The amount of time and money I’ve spent as @SacramentoKings fans and they just never get better. I need a new team to fan for, any suggestions?\n#abusiveNBAteam #kangz",
    "167": "@SacramentoKings @CoorsLight @hoopculture13 Did they win?",
    "168": "@Mr_MrsPL8M8KER @VicTafur @LibbySchaaf @NFL @SacramentoKings I disagreed. Let's just hope Oakland gets more not less professional sports.",
    "169": "@SacramentoKings @CoorsLight @hoopculture13 Lock em up!",
    "170": "Kings gameday live: Rudy Gay coming back to Sacramento after big debut with Utah Jazz https://t.co/Rp2FbYXpdU",
    "171": "A Sacramento Kings fan and a Manchester United fan. What have I done in a past life to deserve this?",
    "172": "@SacramentoKings @CoorsLight @hoopculture13 cold hard fact: not buying any tickets or merch till luke’s gone",
    "173": "Consensus Line Move:\n2021-11-20 Utah Jazz at Sacramento Kings from 222.00 to 221.00\nUnder nervous?\n#NBA #bettingsports #technology #realtor",
    "174": "Kings have just lost 7 of their last 8 games, if the Kings lose their next 2 games to Utah and Philly that could be a wrap to Luke Walton’s time in Sacramento.",
    "175": "@Mr_MrsPL8M8KER @VicTafur @LibbySchaaf @NFL @SacramentoKings That's funny. The point is the Yay Area is starving for professional sports and I don't want to see another city get the next NFL over Oakland.",
    "176": "I'm not sure what's more confusing...Luke Walton STILL having one of only 30 available NBA head coaching jobs or Jason Kidd getting ANOTHER NBA head coaching job after his performance in prior roles. I wish @dallasmavs  and @SacramentoKings had better coaches.",
    "177": "11/19 #NBA🏀\n\n➖3u - Indiana Pacers +3 -109\n✅3u - Detroit Pistons +8.5 -110\n❌3u - LA Lakers +2 -108\n✅3u - New Orleans Pelicans +3.5 -109\n✅3u - Chicago Bulls +4.5 -113\n➖3u - Dallas Mavericks +8 -107\n❌3u - Sacramento Kings -3.5 -112",
    "178": "If @SacramentoKings fans REALLY think trading Fox for a dude WHO CAN'T AND WON'T SHOOT! And won't report to his team because his FEELINGS are hurt! Then I have to question your Hoops knowledge! Atleast Fox is playing despite his struggles! 🤦🏿‍♂️🤦🏿‍♂️🤦🏿‍♂️",
    "179": "@ards_yt @VicTafur @LibbySchaaf @NFL @SacramentoKings Don't underestimate the number of Oakland and Bay Area fans there are that want a team of there own! https://t.co/KedBRWZhNB",
    "180": "The idea that the Sacramento Kings' problems are because of Luke Walton is ridiculous. There's a front office problem going back decades... but they gotta fire someone and the execs never seem to fire themselves. https://t.co/ItCEswWruu",
    "181": "I am so proud of my 7/8th grade boys basketball team 4 making it to the Championship  game @ https://t.co/k47J5hWanv Unfortunately,we didn't win the game,but they persevered through losing 3 players to injuries.@SacramentoKings can you please help me with getting them tickets❓ https://t.co/o3aaZRGJcV",
    "182": "@commissioneryas @SacramentoKings Love that shirt even tho we suck lol",
    "183": "\"Yeah Ernie, it's called defense. I mean, I wouldn't know anything about it personally, but I've heard about it through the grapevine.\" Charles Barkely\nPlease start Davion Mitchell. #sacramentokings \nKings basketball",
    "184": "@ards_yt @VicTafur @LibbySchaaf @NFL @SacramentoKings Not joking at all! https://t.co/e4zbTQivUQ",
    "185": "Encerrado:\n\nSacramento Kings (6-10) 89 x 108 (8-9) Toronto Raptors\n\nTOR 📊\nPascal Siakam: 32PTS/8REB/1AST/2BLK\nGary Trent Jr: 23PTS/4REB/1AST/1BLK\n\nSAC 📊\nDe'Aaron Fox: 17PTS/1REB/3AST/2STL\nHarrison Barnes: 14PTS/1REB/3AST/1STL\n\n#NBA https://t.co/jFa02maYWy",
    "186": "Sacramento Kings – Utah Jazz Predictions &amp; Odds\nhttps://t.co/bVWpgTFr6x\n#NBA #NBATwitter #bettingtips #bettingpicks #bettingtipster #bettingsports #sportsbets #basketball #bettingtwitter",
    "187": "Good morning Luke Walton is still the head coach of the Sacramento Kings",
    "188": "@Mr_MrsPL8M8KER @VicTafur @LibbySchaaf @NFL @SacramentoKings Exactly why we have a voting system.",
    "189": "@ArshadDahlan123 @FCartoscelli3 @DetroitPistons @SacramentoKings Josh Jackson or Frank Jackson who had 27 points last night plus Trey lyles who shoots 35% from 3 stretch 4 and had a good year last year isn’t getting much time and a couple of second round picks we don’t have a ton to part with on the roster that isn’t a untouchable asset",
    "190": "WATCH: Toronto Raptors stroll to victory over Sacramento Kings https://t.co/16RmUiEj4t",
    "191": "En el resto de las ciudades, el voto resultó positivo para Biden: Los Angeles (Clippers y Lakers), Portland (Trail Blazers), Sacramento (Kings), Oakland (Warriors), Salt Lake City (Jazz), Phoenix (Suns), Denver (Nuggets), San Antonio (Spurs), Houston (Rockets), Dallas (Mavs). (+) https://t.co/5X1KFbyA84",
    "192": "\"The Sacramento Kings are just a half game out of the play-in.\"\n\nI addressed this pathetically low bar and where this Kings team looks like they belong on last night's Locked On Kings Podcast. https://t.co/5WxNArzXks",
    "193": "Revenge Game: Rudy Gay plays Sacramento tonight.  He played 223 games in his career for the Kings.",
    "194": "@SacramentoKings @Chimezie_Metu @Acronis @Executech Well at least we had that!",
    "195": "@SacramentoKings where tf the memes go",
    "196": "@SacramentoKings @swipathefox @TyHaliburton22 @MattressFirm 🙄…🔥Luke.",
    "197": "@VTownGotSmoke @VicTafur @LibbySchaaf @NFL @SacramentoKings Lol people can't be this dumb",
    "198": "Woke up today and Luke Walton still is coach of the Sacramento Kings. Gonna go back to sleep until he isn’t.",
    "199": "Ben Simmons trade for every team\nTeam 27: Kings \n\nSacramento:\nBen Simmons \n\nPhiladelphia:\nBuddy Hield \nMarvin Bagley III\n4 first round pick",
    "200": "Manchester United = Sacramento Kings",
    "201": "Chimezie Metu with 10 points and 9 rebounds last night for the @SacramentoKings",
    "202": "WATCH: Toronto Raptors stroll to victory over Sacramento Kings https://t.co/Prsk98qJ4p #GameScores #NBA #SacramentoKings",
    "203": "@6ixIn6 @warriors @Lakers @Bucks @LAClippers @sixers @dallasmavs @BrooklynNets @nuggets @celtics @utahjazz @Suns @nyknicks @MiamiHEAT @HoustonRockets @WashWizards @cavs @hornets @spurs @memgrizz @Timberwolves @SacramentoKings @Pacers @OrlandoMagic LMFAOOOOO",
    "204": "@ards_yt @VTownGotSmoke @VicTafur @LibbySchaaf @NFL @SacramentoKings If Kings go anywhere it's Vegas",
    "205": "DasHaus made a bet!\n\nEvent: Utah Jazz vs Sacramento Kings #NBA\nBet: Sacramento Kings TO WIN +7.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "206": "DasHaus made a bet!\n\nEvent: Utah Jazz vs Sacramento Kings #NBA\nBet: Utah Jazz TO WIN -7.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "207": "👉🏀Sacramento Kings vs Utah Jazz\n👉⌚️00:00 horas Uy/Arg // 8 PM MT\n👉🏟️Golden 1 Center, Sacramento\n👉📺League Pass/Streams\n👉📝Ganen o no hay croquetas mañana \n#utahjazz #TakeNote \nph: Melissa Majchrzak/GettyImages https://t.co/XBw9a2hI2p",
    "208": "@TheFatPanther @SacramentoKings I don’t know what you’re paying and I don’t know you, but I’ll do it for half and use part of it to buy you a beer occasionally.",
    "209": "12 years ago today it was announced that the Sacramento Monarchs, the 2005 #WNBA champions, had folded.\n\nThe Maloof family, who owned the Kings and the Monarchs, refocused on the Kings while the W sought out new owners, but ultimately failed.\n\nhttps://t.co/wup97y1pnZ",
    "210": "Name the second-best wing on the Sacramento Kings and that answer will  tell you why they’re 6-10.",
    "211": "@10OnFo @NBCSKings @TyHaliburton22 Alex Len is Sacramento kings only true big.  We are super undersized team need a big guy helping with rebounds",
    "212": "The irony of this item sold at the @SacramentoKings team store a few years ago never escapes me. #SacramentoProud https://t.co/1C664xy6mN",
    "213": "@50NuancesDeNBA - Myles Turner: Charlotte Hornets\n- Marvin Bagley: Sacramento Kings\n- Ben Simmons: Sacramento Kings\n- Pascal Siakam: Portland Trail Blazers\n- Buddy Hield: Philadelphia Sixers \n- Jerami Grant: Detroit Pistons",
    "214": "The Toronto Raptors got a much-needed big performance from Pascal Siakam on Friday in a win over the Sacramento Kings. (@michaelgrange)\n\nhttps://t.co/LX06VKzEWB",
    "215": "Consensus Line Move:\n2021-11-20 Utah Jazz at Sacramento Kings from 223.00 to 222.00\nUnder nervous?\n#NBA #bettingonline #machinelearning #invest",
    "216": "Pascal Siakam scores a season high 32 points in a 108-89 victory against the Kings in Sacramento. \n\n@william_lou breaks down last night's game on the #Raptors Reaction podcast! #WeTheNorth \n\n🍎 https://t.co/9WO0Y1GpNg\n🔊⤵️ https://t.co/IY8f5avhKU",
    "217": "Minnesota Timberwolves vs Memphis Grizzlies(1h)\nPortland Trail Blazers vs Philadelphia 76ers(3h)\nSacramento Kings vs Utah Jazz (3h)",
    "218": "Imagine being the @SacramentoKings and saying you don't want or can't use a #BenSimmons...this league is wild. Cocky losing franchise doesn't see value in the sheepish latent super star. Then again any star goes there who is coaching and leading in the front office?? Terrible https://t.co/nriLf9cbHn",
    "219": "@MitchNobis We are all Kings, Sacramento Kings.",
    "220": "November 19th\n\nPremium Picks\nVancouver Canucks ML ✅\nPhoenix Suns 1H -5❌\n\nFree Picks\nAir Force v. Nevada O53.5 ✅\nSDSU Aztecs -10.5❌\nDenver Nuggets ML❌\nSacramento Kings -3.5❌\nSiena Saints +15.5❌\nMemphis Tigers 1H -8❌",
    "221": "San Francisco:: Kings gameday live: Rudy Gay coming back to Sacramento after big debut with Utah Jazz https://t.co/c1Q4RbzBDN",
    "222": "@eb214a6d7ba14de @AlvaroNBAMartin @SacramentoKings @Raptors Westbrook no es DT",
    "223": "#Sacramento Kings - Toronto Raptors ★ #VIDEO: Full Highlights by: #SofaScore",
    "224": "#Sacramento Kings - Toronto Raptors ★ #Partido finalizado: 89 - 108 by: #SofaScore",
    "225": "#Sacramento Kings - Toronto Raptors ★ #2º cuarto terminado: 45 - 63 by: #SofaScore",
    "226": "Let's just put the blame on the Sacramento Kings' failures on where it fully belongs: The owner.  Vivek is one of the worst sports team owners out there.  Even some of the previously worst have learned their lesson to listen to experts.  Ranadive's meddling has been painful.",
    "227": "Phoenix Suns 112 (Chris Paul 18 pts, 14 asists) Dallas Mavericks 104 (Kristaps Porzingis 23 pts, 12 rebs, Jalen Brunson 18 pts, 10 asists), Sacramento Kings 89 (De'Aaron Fox 17 pts) Toronto Raptors 108 (Pascal Siakam 32 pts)",
    "228": "It's Saturday 6:04AM PST! And Luke Walton is STILL HC of the @SacramentoKings  🤦🏿‍♂️🤦🏿‍♂️🤦🏿‍♂️",
    "229": "TIP: Sacramento Kings - Utah Jazz, 2&amp;+223.5, 2.55 by #tipster YNWA1990 (profit this month: +68.61)\n  #betting #Basketball #Sacramento #Kings #Utah #Jazz",
    "230": "Since May 2013 @SacramentoKings have had:\n5 Head coaches\n4 GM's\nDozens of players\n7 Top 15 draft picks\n2 Head Trainers\n2 Tv Voices\nOnly 2 Things Have Remained Constant: 1. Terrible Record 2. Head of the organization https://t.co/z9ETgIBwpb",
    "231": "Philadelphia 76ers vs Portland Trail Blazers\nUtah Jazz vs Sacramento Kings\n#NBA2022",
    "232": "Live pregame, in-game and postgame updates on tonight’s NBA game between the Sacramento Kings and Utah Jazz at Golden 1 Center. https://t.co/DGS27Vyci6",
    "233": "Live pregame, in-game and postgame updates on tonight’s NBA game between the Sacramento Kings and Utah Jazz at Golden 1 Center. https://t.co/Dm5BWwk3QJ",
    "234": "Live pregame, in-game and postgame updates on tonight’s NBA game between the Sacramento Kings and Utah Jazz at Golden 1 Center. https://t.co/E8tOEqpVuh",
    "235": "Jazz seek another Rudy Gay jump-start in clash with Kings: The Utah Jazz aim for their second victory of the season in Sacramento when they oppose the staggering Kings on Saturday night. Utah has lost its past two road games, but those results came after… https://t.co/1R0qfzT5tB",
    "236": "Every Sacramento Kings player should be available. No more of this untouchable player bullshit.",
    "237": "@TDChannel1 The @Raptors topped the @SacramentoKings last night 108-89.  @pskills43 scored a season-high 32 points.  Next game is tomorrow at 8:30PM against the @warriors \n\n@MapleLeafs are back in action tonight against @penguins…puck drops at 7PM.\n\n#TDCPressBox https://t.co/XlDiHnMDZx",
    "238": "@johnnyz54 @ards_yt @DrDraiders @VicTafur @LibbySchaaf @NFL @SacramentoKings I know. I believe there is more pressure now to build a stadium after the Raiders left.",
    "239": "@johnnyz54 @VicTafur @LibbySchaaf @NFL @SacramentoKings I'm saying that Oakland needs to develop a new sports complex.",
    "240": "@BrendenNunesNBA I miss the fox who came in his second season saying he was going to fight for Sacramento and Kings fans. Two years later and we get this shit. What is this bullshit? This is supposed to be the leader of the team? He looks like he doesn’t give a fuck.",
    "241": "Toronto Raptors vs Sacramento Kings live stream play-by-play https://t.co/jgRAf1o9U4 via @YouTube @6ixHigh #TorontoRaptors #Raptors #WETHENORTH #SacramentoKings #Kings #SacKings #NBA",
    "242": "@RickAlanman @arlandass @TheAthleticNBA @buddyhield @SacramentoKings They're really like 1 star player away. I keep waiting for HB to be that guy",
    "243": "@garylmorey @colinswerld @TheAthleticNBA @buddyhield @SacramentoKings But in a much different league, a league that curry shaped",
    "244": "@_michelob_ @SacramentoKings Team hasn’t sniffed .500 since they got him …. Chucker who barely runs back on d he just fouls at half court now … pathetic",
    "245": "Trade Fox for Ben Simmons, and picks for Kyrie. New look, playoffs for sure. Whatever it takes, Its worth it already!!! #SacramentoProud @SacramentoKings",
    "246": "@SacramentoKings I mean we were 5-7 with our original starting 5 and normal rotation and our lineups now were 1-3 with our new rotation. Harkless really made the difference, also Len, mostly defense but still it kept our games close besides the Spurs where they just got on fire",
    "247": "@SacramentoKings it’s sooo hard to support this franchise, I mean #sacproud but this ain’t doing nothing for this damn city @Vivek @mmcnair",
    "248": "Toronto Raptors vs Sacramento Kings Full Game Replay 2021 Nov 19 NBA Replay HD\nhttps://t.co/Htu7L325Tc https://t.co/obh5Cui34n",
    "249": "@SacramentoKings The worst part is we have fans like @SHSInvesting thinking that bagley would be better than Doncic in a few years. Its either Kings fans have no clue about bball or shs is vlades burner acct.",
    "250": "@SacramentoKings FIRE LUKE WALTON",
    "251": "@Jhas00047284 @SacramentoKings I feel you man us kings fans have been suffering for years 😂",
    "252": "@SacramentoKings I was a Kings fan since the Reggie Theus days. I no longer was a fan after they drafted Bagley over Doncic. I will never forgive Vlade. That set this franchise back 10 years and I dont have that time to give.",
    "253": "@NBA @SacramentoKings I literally watch sports to get away from politics on tv and then this crap pc messaging gets shoved down my throat anyway.",
    "254": "🏀NBA🏀 #NBA \n🏀Saison régulière🏀\n\nDenver Nuggets - Chicago Bulls\nPhoenix Suns - Dallas Mavericks\nSacramento Kings - Toronto Raptors\nNew York Knicks-Houston RocketsHouston Rockets",
    "255": "@LIGHTSOUTB @SacramentoKings He’s the least of our problems",
    "256": "@SacramentoKings ...  I came to sac the same year the Kings did....  I gotta tell you, I GIVE UP,",
    "257": "God damn, being a fan of the Sacramento Kings and the Orioles is just the fucking worst. At least with the Orioles I know they suck because of the roster and they have a plan to rebuild within the farm system but the kings are a better than 6-10 team and they suck cuz of Walton",
    "258": "Jazz seek another Rudy Gay jump-start in clash with Kings  #NBA\n #SacramentoKings #SacramentoProud #utahjazz #TakeN https://t.co/X2Svo7EDSj",
    "259": "Fred VanVleet beats the halftime buzzer.\n\n@Raptors 63\n@SacramentoKings 45\n\nSecond half coming up on NBA League Pass: https://t.co/v6K0bTigd9 https://t.co/NkmKZopu9B #NBA",
    "260": "Utah Jazz (9-5, third in the Western Conference) vs. Sacramento Kings (6-10, 12th in the Western Conference) https://t.co/Y3a5a6UYKV",
    "261": "@KaseyRayScott @SacramentoKings @nbatopshot hell ya… i can see in the future announcers, nba on tnt, sports center and others makin top shot references to highlight a player and/or a specific play… “thats gonna be a top shot moment”, “u know his top shot bouta moon” etc etc",
    "262": "1/3 I’m just pissed at the Sacramento kings in general. I mean, some coaches have it and some don’t. Walton is the worst in the league at in game adjustments. He doesn’t know how to utilize players strengths. Instead he tries to force them into situations they’re not strong at.",
    "263": "@KingsForever94 @FCartoscelli3 They shoudve won in 2002! it can be done!!…Chris Webber 2.0 is sitting In Philadelphia waiting for kings to pull the trigger and save his career. He needs Sacramento and Sacramento needs him.",
    "264": "@Buffalo95847 @CarmichaelDave You’re probably right but I hate to say but I’m going to say it anyway…the players on this team seem like they just don’t want to be a member of the Sacramento kings a lot of the time 🤦🏻‍♂️ no heart, no energy, no hustle…like they want to be somewhere else. Not all players",
    "265": "Fred VanVleet beats the halftime buzzer.\n\n@Raptors 63\n@SacramentoKings 45\n\nSecond half coming up on NBA League Pass: https://t.co/yKzqQqYS0r https://t.co/dAbILpwUyR",
    "266": "@SacramentoKings You dont play with @nemi1599 , you loose.",
    "267": "@warriors B squad killing it with the W...@SacramentoKings Supposed \"A\" squad getting killed by a bottom 5 team smh #Kings #Iguesssameolkings",
    "268": "I legitimately hope everything is okay with De’Aaron Fox. This guy on the floor isn’t the same guy we’ve cheered the last 4 seasons. 😢\n\n#SacramentoProud \n@SacramentoKings",
    "269": "▶ Sacramento Kings 89:108 Toronto Raptors (8-9)\n🧮 Issac Bonga: nicht im Kader (Raptors905). \n\nhttps://t.co/UaBbmICnxi",
    "270": "@SacramentoKings If if it’s not Luke’s fault, who tf does this fall on? Feels like they are talking about a certain minority of players. I need answers",
    "271": "Heat Check Episode Blog: The Sacramento Kings are a damn mess (again) https://t.co/bzuvvGKu7A",
    "272": "Wasted time only kills young talent.\n#SacramentoKings",
    "273": "The Sacramento Kings' DJ played ‘Bleeding Love’ in the arena after Pascal Siakam got cut open by an elbow. 💀\n\n@pskills43 🇨🇲 @raptors #AfroBallers https://t.co/5DzggNOTnC",
    "274": "The team doesn't rebild properly, so it never moves forward.\n#SacramentoKings",
    "275": "@SacramentoKings f**k a “back to back” FIRE LUKE WALTON",
    "276": "@JakeTCarlisle @SacramentoKings Please offer a response. https://t.co/D6jqJHwldh",
    "277": "@SacramentoKings I can hear ESPN hosts saying now “well this is something that should have happened 2 years ago” ….NOW PULL YOUR HEADS OUT OF YOUR ASS’S AND FIRE LUKE WALTON!!!",
    "278": "@SacramentoKings @MB3FIVE I need Bagley to work out in sac, I need that redemption story",
    "279": "@6ixIn6 @warriors @Lakers @Bucks @LAClippers @sixers @dallasmavs @BrooklynNets @nuggets @celtics @utahjazz @Suns @nyknicks @MiamiHEAT @HoustonRockets @WashWizards @cavs @hornets @spurs @memgrizz @Timberwolves @SacramentoKings @Pacers @OrlandoMagic @WNBA take notice",
    "280": "I have so much respect for people who manage to have the sacramento kings logo as their twitter pic",
    "281": "@HR_6IX @SacramentoKings Horrible front office",
    "282": "@blaineconti123 @FCartoscelli3 @DetroitPistons @SacramentoKings Honestly, who'd Detroit give up for Bagley because there definitely seems to be a trade there",
    "283": "@SacramentoKings @DialpadHQ FIRE LUKE WALTON",
    "284": "@SacramentoKings one more thing NOBODY cares what TT has to say ….we the fans could careless (to use he’s phrase “I think I speak for all of us”) Walton NEVER should have been hired we had a coach who had this team headed in the right direction NOW FIRE LUKE WALTON",
    "285": "Best way I can sum up another potential Sacramento Kings coaching change...\n\nFull Locked On Kings pod coming soon. https://t.co/6Cy52RNqL3",
    "286": "@damienbarling Once the Kings lose against Utah, management will look ridiculous if they keep Walton. They knew what they were doing when the stories about Walton's status came out. #sacramentokings #SacramentoProud #NBA",
    "287": "@momoragan The players claim it's not on the coach, but their play has not improved. They have certainly heard reports about Walton's future. They must know he's finished here. Team would look stupid if Kings lose tomorrow and Walton stays. #nba #NBATwitterLive #sacramentokings",
    "288": "@VTownGotSmoke @VicTafur @LibbySchaaf @NFL @SacramentoKings Libby Schaff is not interested in a football team whatsoever , or any pro sport for that matter. Sucks for the city of Oakland",
    "289": "@ards_yt @DrDraiders @VTownGotSmoke @VicTafur @LibbySchaaf @NFL @SacramentoKings Oakland didn’t build a football stadium to keep the Raiders but now they are going to build a stadium and hope for an expansion team?!? It’s never happening.",
    "290": "@damienbarling @IamKDiddy @James_HamNBA Saw the pan shot to the Upper deck tonight @SacramentoKings - No one in the uppers and scattered fans in the lower seats. BAD Optics!",
    "291": "@HeuristicLineup @Robdw18W This is probably why the players claim it's not on the coach. They say that, but the play seems to have gotten worse. They know he's a dead man walking. #sacramentokings #sacramentoproud #nba #NBATwitter",
    "292": "@Robdw18W @HeuristicLineup Firing won't help the win totals, but haven't the Kings painted themselves into a corner with Walton? If they lose tomorrow (which they certainly will), won't they look stupid if they DON'T fire the coach? #nba #sacramentokings #sacramentoproud",
    "293": "@SacramentoKings Nope",
    "294": "@YAnunoby I've waited decades for North Kipling representation and I will not give it up for a player from the Sacramento Kings",
    "295": "All jokes aside, it’s time @SacramentoKings",
    "296": "the @Pacers vs @hornets game was okay, and I didn't get a chance to watch any of the @Raptors vs @SacramentoKings. I'm okay with that though, because this @dallasmavs vs @Suns game was F I R E.",
    "297": "@commissioneryas @SacramentoKings Was at the game tonight,Kings got absolutely smacked",
    "298": "@LiamWebbs @LFRO210695 @jablamsports @Raptors @SacramentoKings 🌶 P, stealing the crown?!!",
    "299": "@sjwolves @kfippin @thekingsherald Honestly, the team looks lost right now. It's as if they are not all on the same team. #nba #sacramentokings",
    "300": "@LFRO210695 @jablamsports @Raptors @SacramentoKings Love the edits Luis! Keep them coming!",
    "301": "@SacramentoKings Forced 18 turnovers but then had about 40 turnovers so what’s the point",
    "302": "@BoeDoe_ @pand_duh @SacramentoKings Mo Bamba clean though.",
    "303": "One positive thing for the @SacramentoKings:\n\nThey always got mad slaps at Golden 1 Center.",
    "304": "@SactownKings23 @damienbarling I'd really like to disagree with you, but I can't. This team stinks out loud. #sacramentokings #nba #basketball #NBATwitter",
    "305": "@ards_yt @VTownGotSmoke @VicTafur @LibbySchaaf @NFL @SacramentoKings Go warriors vest team in basketball my raider brother and we raiders doing well just need to avoid another late season collaspe",
    "306": "Sacramento Kings sold out like their first entire decade.",
    "307": "@SacramentoKings love you but wtf",
    "308": "@KhrayanGrant @Golden1Center @SacramentoKings Pregame",
    "309": "#Raptors snap a 3-game losing streak as they beat the #Kings 108-89 in Sacramento. \n\n@william_lou recaps tonight's game on Raptors Reaction! \n\n🍎 https://t.co/9WO0Y1GpNg\n🔊⤵️ https://t.co/IY8f5avhKU",
    "310": "My 3 rules of betting are:\n1) Never bet against the Sacramento Kings. Sometimes they just show up. \n\n2) No matter how big the spread is, never take Vandy. \n\n3) Bet the under on the Bears",
    "311": "SACRAMENTO, Calif. (AP) — Pascal Siakam scored 18 of his season-high 32 points in the first half and the Toronto Raptors continued their recent dominance in Sacramento, thumping the Kings 108-89 on Friday night. https://t.co/7sB6oBSoAb",
    "312": "@BoeDoe_ @SacramentoKings Okay, you’re right lol",
    "313": "@pand_duh @SacramentoKings I’m a Magic’s fan…you’ll be iight lol",
    "314": "@ards_yt @DrDraiders @VTownGotSmoke @VicTafur @LibbySchaaf @NFL @SacramentoKings They still don't have a decent stadium and are not able to build a new one, so the problem is still there. If the Bay Area ever gets a second NFL team, it will go to San Jose and they will most likely share Levi Stadium with the 49ers. Oakland is going the same way as Pottstown.",
    "315": "@FCartoscelli3 Will say that this generation of fans seems much less patient than previous generations of Kings fans. This is a good thing. Management needs to feel every bit of pressure possible. #nba #sacramentokings #basketball #NBATwitter",
    "316": "@SacramentoKings tuff break! You’ll get ‘em next time!! \n\nTil then, slide thru and chill with us at @nobagelsnolife we’re right down K street and ready to show our pride for a game we’ll fought!! #sacramento #kings #sactown",
    "317": "FIRE LUKE RN @SacramentoKings @mmcnair",
    "318": "😂Then who's fault is it, Bill Walton?🙄 The @SacramentoKings will never go anywhere with #AgentWaltonOut. All the Kings owners are doing is telling the fans to settle for this garbage basketball &amp; \"leadership\" while milking them to pay for a team unworthy of its arena. https://t.co/EsPPgTbgyo",
    "319": "@SacramentoKings Luke needs to resign https://t.co/MSW7O9oYDh",
    "320": "Being a #sacramentokings fan is rough, I'll ride til I die though #kangz",
    "321": "Is Monte doing the 24 hour cooling off period before making a decision? 🤔🤔🤔🤔 @SacramentoKings",
    "322": "@TheTypicalAlex_ @SacramentoKings How about them Celtics",
    "323": "@DrDraiders @VTownGotSmoke @VicTafur @LibbySchaaf @NFL @SacramentoKings They didn’t have as good as attendance because the stadium sucked. Doesn’t mean it won’t work again.",
    "324": "@SacramentoKings Kings won’t be a .500 team until they get rid of buddy",
    "325": "Hey @SacramentoKings I don’t think there’s a kings fan out here that thinks if you fire Walton things are going to turn around and be great…,,but at least they’ll know your doing the right thing",
    "326": "When will the @SacramentoKings  say enough. Is enough and start winning basketball games, again and compete for a playoff spot in the NBA playoffs kings fans deserve better. Monte McNair has to turn this Kings team around and trade some players to stop these losses",
    "327": "I hope Joe Ingles drops 50 on us tomorrow. @SacramentoKings",
    "328": "City of Sacramento Kings fans gotta stop going to Sacramento Kings  games.",
    "329": "@SacramentoKings you're terrible at everything but at least you have #BlackLivesMatter in your bio 🤡🤡🤡",
    "330": "Me after every @SacramentoKings game https://t.co/6WQZA5ZAvs",
    "331": "@SacramentoKings Jeebus that was bad.",
    "332": "@Kinglam94 @SacramentoKings @MB3FIVE @nryan916 *Kings",
    "333": "@Kinglam94 @SacramentoKings @MB3FIVE @nryan916 Told you, Marvin Bagley the best player who played for the Akins franchise",
    "334": "im going to lose my mind\n\nfix ur shit @SacramentoKings",
    "335": "I’ll say it again. The @SacramentoKings are an absolute fucking joke at this point we should have just let the team go to Seattle",
    "336": "@SacramentoKings When can we get a real social media team again? If we're gonna be awful and still employ Luke Walton, at least make the awful play enjoyable with memes.",
    "337": "@MarkJackson13 please resurrect the Sacramento kings like how you did the bottom feeding warriors a time ago \n🆘 🚨 https://t.co/sItW4HzoQo",
    "338": "@SacramentoKings I miss the previous social media guy",
    "339": "@Raptors6Man @SacramentoKings can fred donate at least one of his massive balls because no one on our team has any",
    "340": "@6ixIn6 @warriors @Lakers @Bucks @LAClippers @sixers @dallasmavs @BrooklynNets @nuggets @celtics @utahjazz @Suns @nyknicks @MiamiHEAT @HoustonRockets @WashWizards @cavs @hornets @spurs @memgrizz @Timberwolves @SacramentoKings @Pacers @OrlandoMagic Your a sick man for this but I completely understand",
    "341": "@SacramentoKings FIRE LUKE WALTON PATHETIC PIECE OF TRASH!!",
    "342": "Welcome to basketball hell @SacramentoKings #firelukewalton",
    "343": "You have poverty and then you have the Sacramento Kings",
    "344": "@SacramentoKings I appreciate that Kings social has to paint lipstick on this pig. But we dont need it.",
    "345": "@SacramentoKings Fire Luke Walton..should have been done last year 🙄",
    "346": "@SacramentoKings I feel for @ggerould  that has to see this year in and year out. #hesarealPRO",
    "347": "@SacramentoKings ENOUGH!!! FIRE LUKE WALTON",
    "348": "@alecmartin345 @SacramentoKings Hopefully",
    "349": "Love seeing #firelukewalton trending in the US at 15. #SacramentoProud #sacramento #sacramentokings https://t.co/ZZshYBXO6r",
    "350": "10 PTS 12 REB for Chris Boucher 🔥💪🏾\n\n@warriors @Lakers @Bucks @LAClippers @sixers @dallasmavs @BrooklynNets @nuggets @celtics @utahjazz @Suns @nyknicks @MiamiHEAT @HoustonRockets @WashWizards @cavs @hornets @spurs @memgrizz @Timberwolves @SacramentoKings @Pacers @OrlandoMagic",
    "351": "@SacramentoKings “we gotta watch film” words from losers like their coach who’s been “watching film” for over 3 years ….it’s the same movie it’s called “we suck” …now FIRE LUKE WALTON",
    "352": "@KOT4Q Hopefully @SacramentoKings",
    "353": "@SacramentoKings 🔥🔥🔥SO FRIGGIN CLOSE 🔥🔥🔥 https://t.co/rJ4Jv0G3ZW",
    "354": "@SacramentoKings it's gonna actually be hilarious if Walton is still coaching tomorrow",
    "355": "@SacramentoKings I'm at the point where idc who they trade. Just so depressed and tired of the same thing every year",
    "356": "I still believe in this Kings core as a playoff caliber team. Really don’t know what’s missing. Coaching? Sure. But the NBA ain’t a coaches league. Let’s hope Monte can pinpoint it 🤷🏼‍♂️ go @SacramentoKings",
    "357": "@SacramentoKings Soon.. 🙏🙏🙏 https://t.co/vacaQ4RcSk",
    "358": "@SacramentoKings “we got his back we like him he’s a great guy” …..words of a team that doesn’t want things to change because their comfortable….time to get uncomfortable gentlemen",
    "359": "@amrcnbf And to think I really got a fat ass Sacramento kings tattoo. Smh",
    "360": "After a rough outing in Utah on Thursday, Pascal Siakam delivered a much-needed strong performance for the Toronto Raptors. The forward finished with a season-high 32 points as Toronto crushed the Sacramento Kings on Friday. (@michaelgrange)\n\nhttps://t.co/LX06VKzEWB",
    "361": "@CarmichaelDave Every time I see Bagley play defense (or try to), I wonder why he was drafted so high in the first place…#nba nbatwitter #SacramentoProud #sacramentokings",
    "362": "Trade for Ben Simmons @SacramentoKings",
    "363": "@SacramentoKings sounds a lot like “it’s not my buddy’s fault we don’t want him fired” ….know what f**k that",
    "364": "@lucarosano3 I agree ! This was a good win and they needed it but the next 2 games is where you’ll be able to get a better understanding of where they are . Again good win but let’s be honest … Sacramento kings are a mess right now",
    "365": "@CatchSumZs @SacramentoKings Or a 1/2 &amp; 1/2 pack of Cookies - 6 DoCo, 6 J Street.",
    "366": "@SacramentoKings @ArdenFair Terrible and ugly loss, I am sure the Kings will not make the playoffs this season, 100%",
    "367": "I bet the ax falls tonight on Luke Walton in Sacramento  after another brutal performance by the Kings.",
    "368": "Raptors stroll to victory over Kings  #NBA\n #SacramentoKings #SacramentoProud #Raptors #WeTheNorth #RTZ https://t.co/xEoeizfNyJ",
    "369": "@marvataiel he happened to at one point in his career play for the sacramento kings. doesn’t take much for this franchise to offer you a spot… commentator.. post game.. GM.. lol",
    "370": "@notthaticonguy @SacramentoKings Yes Yes Yes! Make Doug the coach!",
    "371": "I might be close with 31 wins for the Kings this season. Sacramento Kings need to figure it out. Chemistry is gone along with the confidence. A step and a half slow on defense. Letting opposing team gave one play open for a three point shot. Stay together and simplified \"D\"",
    "372": "Sources close to me are telling me that Vivek and the Sacramento Kings will dismiss Luke Walton from the team",
    "373": "Toronto Raptors tops Sacramento Kings 108-89 Pascal Siakam 32points 8rebounds 1assists.",
    "374": "🤖 #SofiAlert \n📅 19-11-2021 \nToronto Raptors - Sacramento Kings \n🛋 3.1/5 Sofis https://t.co/8eAyplbteN",
    "375": "#NBA | FULL-TIME!\nPhoenix Suns 112-104 Dallas Mavericks\nSacramento Kings 89-108 Toronto Raptors\nFor more games, don't forget to visit our page! https://t.co/oKQtEWhzhS",
    "376": "#NBA | FULL-TIME!\nPhoenix Suns 112-104 Dallas Mavericks\nSacramento Kings 89-108 Toronto Raptors\nFor more games, don't forget to visit our page! https://t.co/wRKSqRguCu",
    "377": "🚨VIP ends the day 3-1 +5.5u 🏀\n\nWe are red hot🔥🔥🔥\n\nKentucky -12 -115 (2u)✅\n\nWKU +15 -110 (2.5u)✅\n\nOver 138 Arizona vs. Wichita st (3u)✅\n\nSacramento Kings -3.5 -110 (2u)❌\n\n#GamblingTwitter \n\nDM to join➡️ Been in the green 4 out of the L5 days🔥🔥🔥👍🏾",
    "378": "Outside of wins against the bottom-dwelling Pistons and Pelicans, the Sacramento Kings are 3-10 this season.",
    "379": "The Toronto Raptors dominate on both sides of the ball all night long, en route to a 108-89 win over the Sacramento Kings. The score is misleading, the Raptors should have won by 30+ that’s how good the entire team was tonight.",
    "380": "@Coach_Popovic @willarchambault @SacramentoKings I can list you other misses by the Kings. It might take a couple of dozens donuts to go over this list",
    "381": "Congratulations Toronto @Raptors on your 108-89 win over the Sacramento Kings 2021-2022NBASeason",
    "382": "…@SacramentoKings have talent on their team. I really like a LOT of them. They just seriously need a new coach.",
    "383": "@Sportsnet It’s yessir from here on out @SacramentoKings https://t.co/QaM6w0XT7w",
    "384": "Luke, it’s obviously not all on you, but like the coaches before you’ll be the sacrificial lamb. Best of luck to you in the future. Maybe this time the @SacramentoKings will interview more than one person! Or maybe A person, I don’t believe Luke interviewed. https://t.co/T3CFjohjLu",
    "385": "@SacramentoKings Bad coaching is the reason for this team losing games. This team should be better prepared to compete. It’s obvious that length at the Raptor 3,4,5 spot + zone would shutdown the inside game &amp; lead to fast breaks.",
    "386": "Toronto #Raptors 108 - Sacramento Kings 89 | Final\n\nPascal Siakam 32p/8r/2b\nGary Trent Jr. 23p/4r/1s\nFred VanVleet 13p/6a/3r\n🇨🇦🏀🍁 Khem Birch 10p/9r/4s/2b\n🇨🇦🏀🍁Chris Boucher 10p/12r/2b/1s\n\n#WeTheNorth 38-83 (45.8%) FG | 12-31 (38.7%) 3PT | 20-24 (83.3%) FT\n\n#NBA75 #TORvsSAC https://t.co/Ej8wWTCNH3",
    "387": "GIVE US HEAD COACH CHRISTIE!!! @SacramentoKings https://t.co/AzGfKIUauo",
    "388": "@willarchambault @SacramentoKings You mean the guy they picked instead of Luka 🤦‍♂️🤦‍♂️🤦‍♂️ and I’m a real Kings fan from back in the day of Peja, Vlade, Bibby, Webber",
    "389": "@SacramentoKings \nWhatever bro.",
    "390": "It has to happen. Monte has to fire Luke! Like before this tweet was sent! @SacramentoKings",
    "391": "I’ve been a Sacramento Kings fan since I went to my first game at Arco Arena in 1998. This is, by far, the weirdest, most chaotic and infuriating season in a long line of WTF moments. #SacramentoProud????",
    "392": "RAPTORS WIN!\n\nA equipe de Toronto bateu o Sacramento Kings por 108 a 89.\n\nSiakam: 32PTS/8REB\nTrent Jr: 23PTS\nBoucher: 10PTS/12REB\n\nFox: 17PTS\n\n#WeTheNorth #NBA75 https://t.co/DnY1I4Iwjz",
    "393": "The Kings media personalities care more about losses than the Sacramento Kings players",
    "394": "Damian Jones - Sacramento Kings\n6 PTS\n9 RBD\n1 BK\n[FD(19.8) DK(19.25)]",
    "395": "Chimezie Metu - Sacramento Kings\n10 PTS\n9 RBD\n1 BK\n1 STL\n2 TO\n[FD(24.8) DK(25.25)]",
    "396": "A requiem for a King..sad AF @SacramentoKings #SacramentoProud #kangs https://t.co/T6KU6FbQhZ",
    "397": "FINAL: @raptors 108, @SacramentoKings 89 \n\n@william_lou breaks down tonight's game on #Raptors Reaction next! \n\n🔊 https://t.co/Kos4ulFufT                 \n🍎 https://t.co/zrtTpSmWjp \n\nListen live 📻 https://t.co/VXgyFfR24Z https://t.co/FKRkPP2sdF",
    "398": "And seriously … WTF has happened to De’Aaron? He looks so disengaged out there. :( \n\n#SacramentoProud (lol) \n@SacramentoKings",
    "399": "Ohhhhhh now I now why the @SacramentoKings play on L st. https://t.co/rUiWKeY6bL",
    "400": "I’m 75% sure #LukeWalton gets fired as #SacramentoKings Head  Coach tonight. That game was an complete  embarrassment.",
    "401": "If you’re a basketball fan in general! Let’s get this trending. #FireLukeWalton\n@SacramentoKings",
    "402": "@BenzemasBurner @SacramentoKings @ArdenFair No more fauls",
    "403": "I wouldn’t go to a @SacramentoKings if they gave me free court side seats",
    "404": "@BenzemasBurner @SacramentoKings @ArdenFair I am angry",
    "405": "@FCartoscelli3 I’m sorry for your guys loss we took a tough one as well time to trade Bagley to the pistons we can hook you guys up with better defense player for him we have like 1 center left after tonight need to get this deal done @DetroitPistons @SacramentoKings",
    "406": "as in Sacramento Kings",
    "407": "It’s time @SacramentoKings time for change! https://t.co/5XEi2MbXuk",
    "408": "When will @SacramentoKings realise that @Rich_Holmes22 is the best player on their team? 13 player rotation is WAY too broad. More minutes for @Rich_Holmes22 !!",
    "409": "The Sacramento Kings played basketball tonight. It was not a fun time.\nhttps://t.co/HfjucGAKcN",
    "410": "@willarchambault @SacramentoKings We’ll take him 😭",
    "411": "Fire Luke Walton. Fire Luke Walton. Fire Luke Walton. Fire Luke Walton.\n\nI think the Sacramento Kings should fire Luke Walton.\n\n#SacramentoProud #FireWalton",
    "412": "I think it might be time for the Sacramento Kings to fire Luke Walton. I didn’t even think the Kings should have hired him in the first place 💁‍♂️",
    "413": "Score\n\nToronto Raptors\n108\n\nSacramento Kings\n89\nFinal #TORvsSAC",
    "414": "#PascalSiakam goes for 32 points and eight rebounds as the #Raptors dominate the #Kings in Sacramento. FINAL: TOR 108 - 89 SAC",
    "415": "Hey @SacramentoKings’ fans, what’s up with Marvin Bagley? #2 pick, 22 year old averaging 3.7ppg?! 🤔",
    "416": "@SacramentoKings you just Lost to the penguin note gang\n\n#WeTheNorth https://t.co/cAIPTQVAmq",
    "417": "\"Something about this season feels different.\"\n\n-my dumb ass about the Sacramento Kings about a month ago",
    "418": "I’m broken @SacramentoKings",
    "419": "🏀 Final Score 🏀\nToronto Raptors 108 - 89 Sacramento Kings\n\nSiakam 47.0 DK, 45.1 FD\nBirch 34.8 DK, 40.3 FD\nBoucher 34.0 DK, 33.9 FD\n\nhttps://t.co/IIuYCTQkL5",
    "420": "Sacramento Kings Twitter refreshing their screens all night after the game https://t.co/RmVC65fj3U",
    "421": "Sacramento Kings fans really hyped up Terence Davis last season to get him fazed out this season 😂",
    "422": "I hope they fire Luke Walton within the hour…I tweet this from Texas as a @SacramentoKings fan",
    "423": "3. 8-0. After a big showing in the first half, Pascal Siakam hit the Kings with 8 unanswered points to open up the third quarter. The All-Star forward pounded Sacramento for 32 points and 8 rebounds. He helped push the Raptors lead as high as 29 in the third.",
    "424": "2. Torched. The Kings selected Gary Trent Jr. with the No. 37 overall pick in the 2018 NBA Draft. They traded him away before ever letting him step on the floor in Sacramento, which was a mistake. Trent lit the Kings up for 18 of his 23 points in the first half.",
    "425": "1. Game plan gone wrong. The Raptors love to overplay, get in the passing lanes and they foul a ton. The Kings took advantage of this fact, at least in theory. Sacramento got to the free throw line early and often, but failed to capitalize, hitting just 13-for-20 from the stripe.",
    "426": "Step right up Alvin Gentry! You're the next coach of the Sacramento Kings!",
    "427": "Games like tonight definitely don’t help Luka Walton who is on the “hot seat” as the Kings lose 108-89 to the Raptors in Sacramento. \n\nPascal Siakam had his best game of the season with 32 PTS and 8 REB. Gary Trent Jr. continues to play well with 23 PTS (5-11 3PT).",
    "428": "@SacramentoKings @DialpadHQ Lol \"Sactown\" is so 🌽🏀\n\nJust stop",
    "429": "I can confirm that Monte McNair of the Sacramento Kings is having human resources draft the termination paperwork for soon to be former head coach Luke Walton. \nLuke isn't expected to have any suitors in the league and will likely be relinquished to coaching his children's teams.",
    "430": "So I’ve basically been paying $700/ year for YouTubeTV just to watch the @SacramentoKings. I think I’m going to reclaim that spend. I could pay someone less than that to punch me in the taint a couple times a week.",
    "431": "This city deserves better, this arena deserves better, and most of all, the fans deserve better from the Sacramento Kings.",
    "432": "THE SACRAMENTO KINGS SUCK, THERE IS NI HOPE FOR THIS TEAM… BLOW IT UP AGAIN",
    "433": "At some point, season tickets to the @SacramentoKings games should include open bar privileges.",
    "434": "@47Speaklife @SacramentoKings Embarrassment to the city.",
    "435": "This is  Basketball hell @SacramentoKings",
    "436": "If you’re at the @Golden1Center I want to hear you BOO as loud as you can when the game is over. @SacramentoKings",
    "437": "@SacramentoKings @ArdenFair Hey @SacramentoKings. Why would I pay for this garbage?",
    "438": "Siakam actually owns the Sacramento Kings",
    "439": "@sactownroyalty @SacramentoKings That’s was a terrible debut.",
    "440": "Being a Sacramento kings fan feels like.. Ugh I miss the early 2000s when Arco Arena was really rockin and we actually won games 😢😢 https://t.co/kDHNfkgGHA",
    "441": "@SacramentoKings The Kings are so lost it’s embarrassing to be a fan they better turn this around or more fans will be lost now i got a question do the kings actually care to win cause they play like they don’t care to Win",
    "442": "If the Sacramento Kings folded I honestly don't think anyone would notice #irrelevant",
    "443": "Having a great time at the @SacramentoKings vs Toronto w/my sister. Thank you @MarnieAtKings for everything you do! #SacramentoProud https://t.co/ZjOXCENdAD",
    "444": "I'm not even mad anymore @SacramentoKings",
    "445": "Is it too late for the Maloofs to save the @SacramentoKings ? 🤷🏻‍♀️",
    "446": "Wtf is this crap @mmcnair @Vivek @SacramentoKings @Sports1140KHTK #firewalton #kangz",
    "447": "@SacramentoKings @ArdenFair The Kings are so lost it’s embarrassing to be a fan they better turn this around or more fans will be lost now i got a question do the kings actually care to win cause they play like they don’t care to Win",
    "448": "@SacramentoKings Have some pride!!",
    "449": "Don’t get me wrong, as a small market sports fan I’m glad the kings stayed in Sacramento. Downtown Sac and the area is so much better and fun, but it sucks seeing this year after year….",
    "450": "@SacramentoKings you lost the Toronto! Embarrassing",
    "451": "@SacramentoKings Why u suck so bad!!",
    "452": "@SacramentoKings Dude forget it we’re a joke",
    "453": "disgusting @SacramentoKings",
    "454": "@o_a_khan The first thing I want to see if we do anything is:\nTerence Davis has been waived by the Sacramento Kings.",
    "455": "Luke gonna make me puke. #KANGZ\n\nAnother sub 30 win season. Yay @SacramentoKings @Vivek",
    "456": "@momoragan The Sacramento Kings look absolutely so lost it’s embarrassing to be a Fan they better start figuring this out or more Fans will be lost.",
    "457": "Sacramento Kings ownership to Luke Walton after tonight's game: https://t.co/wOutVNZOzh",
    "458": "@SacramentoKings fire Luke Walton",
    "459": "@SacramentoKings why should I go to the game tomorrow? Convince me…",
    "460": "Sacramento kings are terrible.\nThat’s the tweet.",
    "461": "I'm all in for Doug Christie as the new coach for the Sacramento Kings.",
    "462": "Q4 Update:\n\n@dallasmavs  84-82 @Suns, 11 to play!\n\n@Raptors 98-75 @SacramentoKings, 9 to play!\n\n#NBA75 https://t.co/VMzO3QdtWU",
    "463": "@SacramentoKings Getting beat by 30 at home with the Raptors as public dogs, wow.",
    "464": "Sacramento Kings have hit a new low. But not surprised. ..I think Luke Walton is done",
    "465": "These Sacramento Kings are pathetic. Fucking disgraceful to basketball. I’m embarrassed to be attending tomorrow’s game. I’m already upset with you.",
    "466": "Left my brother house @SacramentoKings were down 20 and now that I’m home we’re down 30🥲",
    "467": "The good news is the Sacramento Kings get to play the Utah Jazz for the 47th time this year in 22 hours",
    "468": "I would imagine being a Sacramento Kings fan is akin to being a masochist.",
    "469": "@Raptors are out rebounding @SacramentoKings \n44-24.\nAnd the @Raptors have 8 blocked shots.\nWow.",
    "470": "Everyone talks about the obvious mistake of passing on Luka, let us not forget we drafted Gary Trent Jr. and traded him on draft night for two future 2nd round draft picks. Which of those two second rounders is lighting it up for the Sacramento Kings??",
    "471": "Curious when the  @SacramentoKings will realize Luke Walton ain’t the guy. Feel badly for the fans and people who pay money to support this 🐶💩",
    "472": "This @SacramentoKings team is a complete joke right now behind coach Walton. When are you going to get rid of this 🤡 already? #SacramentoProud #sacramentokings #sactown #sackings #NBATwitter #nba",
    "473": "@ESPN1320 @DeuceMason #SacramentoKings Damn, team playing like they want Luke to get fired. More Sacking than SacKings.",
    "474": "@SacramentoKings \nFire Walton!!!",
    "475": "Raptors 96 Kings 66 End 3rd\n\nThe Kings will be playing back-to-back home games tomorrow vs the Jazz.  This will be 6 losses in the last 7 games for Sacramento. The win was over Detroit.",
    "476": "Somebody gettin fired #SacramentoProud #Sacramento #SacramentoKings",
    "477": "The @SacramentoKings and @Vivek  are an embarrassment to the city of Sacramento.",
    "478": "Sacramento Kings are garbage and so is there entire coaching staff!!!",
    "479": "BigfuckinYIKES @SacramentoKings",
    "480": "Welp.  @SacramentoKings",
    "481": "#Kings down 30 smh @SacramentoKings #SacramentoKings",
    "482": "The @SacramentoKings isn’t good for my mental health",
    "483": "GTJ shutting up that @SacramentoKings bench #WeTheNorth #RTZ",
    "484": "@nba @Raptors @SacramentoKings Can we implement a mercy rule in the #NBA if a team is down 30 or more points at the end of third quarter....the game is over. #NBA75",
    "485": "The Sacramento Kings are a psyop",
    "486": "@SacramentoKings why does buddy yeilds game remind of Kuzma's wanna be a 3pt shooter😅 lol",
    "487": "Down by 30? \n\nBye Luke. \n\n@SacramentoKings",
    "488": "nick nurse said we 1-6 in our last seven games so now yall gotta be in hell @SacramentoKings",
    "489": "Sacramento Kings fans deserve better.",
    "490": "@DesWtf @SacramentoKings my guy 😎😎😎",
    "491": "I see 4 Sacramento Kings on the floor and one giant human sized trash can",
    "492": "@GottliebShow @SacramentoKings Let’s be honest: Sacramento should not have any major league teams",
    "493": "Lol\n\n#SacramentoProud (not even a little) \n@SacramentoKings",
    "494": "@DangIWantHer @SacramentoKings vouch",
    "495": "@SacramentoKings yall are something 🤦🏽‍♂️",
    "496": "@DeckerMavado @SacramentoKings I need to pay off my auto loan 😩",
    "497": "@SacramentoKings  Unfollow me",
    "498": "@SacramentoKings piss me off man.",
    "499": "Dear @SacramentoKings, blow the team up",
    "500": "@SacramentoKings don’t even post memes anymore now it’s just a sad franchise #fireluke #bringbackadmin",
    "501": "The @SacramentoKings are simply not good. https://t.co/UStZQEuGu5",
    "502": "@SacramentoKings change your colors and Wallahi you guys will get so much better",
    "503": "@SacramentoKings stop being so bad.",
    "504": "Stop buying @SacramentoKings gear stop wasting your money on @SacramentoKings tickets…your just donating at this point…Pure garbage is what they are",
    "505": "Ok @SacramentoKings I had crazy hope for this year and year even fought @Rjeff24 but damn we gotta right this ship!",
    "506": "@GottliebShow @SacramentoKings Move the Sacramento Kings to Las Vegas and make them the Las Vegas Kings 🤴",
    "507": "Svi Mykhailiuk can really stick that orange thang.\n\nToronto #Raptors | Sacramento Kings\n\n#WeTheNorth #NBA75 #SacramentoProud #TORvsSAC https://t.co/seKMxup59N",
    "508": "your options aren't great and I could use the head coach salary for the rest of this season. I'll step down in April just fire Luke Walton and give me a chance @SacramentoKings",
    "509": ".@SacramentoKings can u play vamp anthem at the game rn pls and thank u",
    "510": "Never change Sacramento kings",
    "511": "Sacramento Kings are pathetic dawg",
    "512": "In what has been the biggest surprise to come out of this Raps/Kings game, the resident DJ for The Sacramento Kings is the best I’ve heard in the entire league.",
    "513": "@SacramentoKings options going forward:",
    "514": "@momoragan @NBCSAuthentic Being a @SacramentoKings fan is worse than being a Washington Generals fan. At least the Generals never get your hopes up.",
    "515": "@SacramentoKings embarrassed to be a Kings fan tonight. A guy from Michigan",
    "516": "The Sacramento kings getting torched.",
    "517": "@SacramentoKings well I turned this pathetic excuse for a game off …this team is not this bad ..not saying their great or a playoff team or anything else..BUT THIER NOT THIS BAD ..PULL YOUR HEADS OUT OF YOUR ASS AND FIRE LUKE WALTON ENOUGH WITH YOUR EXCUSE’S !!!!!",
    "518": "Went on ESPN Sacramento today and the hosts @damienbarling and @IamKDiddy said the exact same thing. No reason Kings should be getting the doors blown off tonight with the talent they have https://t.co/GNZmuVx39D",
    "519": "The Sacramento Kings deserve nome of our hard earned money or time. 15 years of being a bottom feeder in the NBA is exhausting.",
    "520": "@SacramentoKings are the most irrelevant franchise in all of sports, even the @hcolomouc is more relevant than y'all #sactown #morelikesackofshit",
    "521": "i better wake up to news of @SacramentoKings having a new coach tomorrow! https://t.co/kSZwU2PG7x",
    "522": "Fire Walton @SacramentoKings",
    "523": "sacramento kings under 50 pts almost 5 mins into the 3rd quarter",
    "524": "@SacramentoKings ... please. https://t.co/aAW6z8iRKp",
    "525": "Down 29 @SacramentoKings we need some help",
    "526": "@ingvidual @SacramentoKings kyle is so fuckin annoy he spends 48 min sucking the other team off",
    "527": "Sacramento Kings are … https://t.co/5oBn4sBGGn",
    "528": "WE SUCK @SacramentoKings #SacramentoProud",
    "529": "Gone ahead and hand over Bagley @SacramentoKings. Nets will also take Thompson as well",
    "530": "Gotta give Sacramento Kings fans their props man. Some of the Most Ride or Die Fans in sports EVER",
    "531": "Sometimes I wonder how different my life would be if the Sacramento Kings were a decent franchise…",
    "532": "We’re pathetic @SacramentoKings",
    "533": "@mattty_k @SacramentoKings Might as well put me and @JuanWeek in",
    "534": "@SacramentoKings @MB3FIVE The look of a loser https://t.co/3vHYkuR9eN",
    "535": "Fuck. Play the Sacramento Kings all of the time. Fix the schedule.",
    "536": "@evan12341234 @SacramentoKings @DialpadHQ You mf’er https://t.co/UkhMczhabh",
    "537": "Game ain’t rollin like We hoped but still time.. big shout out to our guy @DayTrader916 for the ticket upgrade.  My man always looking out and showin up for Sactown  let’s go @SacramentoKings  and also love the new city gear 🔥🔥🔥🔥🔥🔥🔥🔥💥 https://t.co/yyB3OpYOvL",
    "538": "Khem Birch - Protect your rim!\n\nToronto #Raptors | Sacramento Kings\n\n#WeTheNorth #NBA75 #SacramentoProud #TORvsSAC https://t.co/I0hzFmvSoJ",
    "539": "Oh the pain of being a Sacramento Kings fan",
    "540": "@SacramentoKings PLAY some better DEFENSE and score some baskets",
    "541": "#TORvsSAC\nDear / To: @Raptors ;\nI would appreciate You beating the @SacramentoKings \nSo if You do win this game thanks.",
    "542": "@SacramentoKings this team is so embarrassing. From the ownership down. We watch a pathetic performance night after night while having to listen to kaity Christensen sound like moron. Couldnt be a worse organization",
    "543": "3 reasons why the De'Aaron Fox &amp; Tyrese Haliburton backcourt will not work for the Sacramento Kings.\nhttps://t.co/lXRir9wVlR",
    "544": "@SacramentoKings @ArdenFair I hate ￼￼Pascal Siakam \nAnd Scottie Barnes Gary Trent, Jr. FRED\nVANVLEET",
    "545": "How do the Sacramento Kings still suck SO bad?",
    "546": "Wtf @SacramentoKings you are blowing my 8 team parlay",
    "547": "I don’t typically watch @SacramentoKings games, but when I do, it’s usually on mute",
    "548": "The @SacramentoKings have become unwatchable. Switched over to @ESPNNBA",
    "549": "How do we get @MarkJackson13 to coach the Sacramento Kings.. #SacramentoProud",
    "550": "The Sugarhill Gang rocking the half-time show 🎶👌\n\nToronto #Raptors | #Sacramento Kings\n\n#WeTheNorth #NBA75 #SacramentoProud #TORvsSAC https://t.co/DN6JY4cNtS",
    "551": "@mnsuperfan27 @SacramentoKings @ArdenFair History and way more people in LA.",
    "552": "If you’re reading this, please take a moment of silence for all @SacramentoKings media…they don’t have the option to just turn the games off. They must watch them all.",
    "553": "Sacramento Kings are just a bad team.. with bad coaching. #NBATwitter",
    "554": "@SacramentoKings @DialpadHQ And we suck AGIAN !!! FIRE LUKE WALTON",
    "555": "Imagine supporting the Sacramento Kings willingly…",
    "556": "This @SacramentoKings is gettng flat out embarrassed right now. SMH.",
    "557": "@AcampoJo_49er @Golden1Center @SacramentoKings Why is the arena that empty?",
    "558": "@mnsuperfan27 @SacramentoKings @ArdenFair Also they have history.",
    "559": "@SacramentoKings @MB3FIVE Dang Luke. Early third quarter. Kings down by 26. Resign Luke   Do the honorable thing RESIGN LUKE.",
    "560": "@mnsuperfan27 @SacramentoKings @ArdenFair The Lakers are terrible too.",
    "561": "So Pascal Siakam turned into Khris Middleton huh? Yeah I know the Sacramento kings mild now 🥱",
    "562": "Put me in coach @SacramentoKings",
    "563": "Sacramento Kings belong in the gleague",
    "564": "@SacramentoKings you guys forgot how to play basketball???? Again one freaking bet ruins the entire slip! WHYYY",
    "565": "THESE SHOULD B OUR REGULAR JERSEY @SacramentoKings GET THAT GRAY SHIT OUTTA HERE‼️‼️‼️ #FireWalton #Waltonout #vamoskings",
    "566": "@CarmichaelDave It’s too bad Sacramento got a team otherwise you would be a Warriors fan. The Warriors are good as the Kings are bad",
    "567": "The Sacramento Kings should make NBA history by firing Luke Walton at halftime.\nI say that with all due respect, he isn't cut out for this. \nIt isn't fair to the fans or players to further accept mediocrity. \nThe city of Sacramento deserves better. \n#sacramentoproud",
    "568": "The @SacramentoKings are playing like ass but our play-by-play announcer, @KyleDraperTV, is openly rooting for the other team?\nNo excuses.\nBe better, Kyle.\n@momoragan @kayte_c @TimMaxwell22\n@CarmichaelDave @DeuceMason https://t.co/GQrggpj4qc",
    "569": "@SacramentoKings @ArdenFair RATIO",
    "570": "These Sacramento kings are so untrustworthy",
    "571": "@SacramentoKings @ArdenFair Look at this attendance. Terrible. Ramifications from your covid protocol and being ultra woke last year. Congrats kings.",
    "572": "@SacramentoKings Who’s gonna perform tomorrow? Ja rule?",
    "573": "@looooolgetmad @SacramentoKings @ArdenFair Hopefully us Raptors can help y'all fire Luke",
    "574": "Fuck @SacramentoKings",
    "575": "@SacramentoKings @ArdenFair Might as well keep em out there for the  2nd half",
    "576": "Gentle reminder that the Sacramento Kings drafted Gary Trent, Jr but decided to trade him for 2 other picks...",
    "577": "When you have kids that are starting to drive and get jobs that were born AFTER the last time you made the playoffs, this is what happens. Kings fans have been so faithful to a bad franchise for so long. @SacramentoKings fans deserve better. https://t.co/t17VX7vBLV",
    "578": "The Sacramento Kings broadcast team no longer hides how disappointing the team is. If you asked them to vote on whether or not Walton should coach after tonight the team could just begin the search now.",
    "579": "@NBA @Raptors @SacramentoKings Please fire Luke Walton",
    "580": "So @TheRealSHG just played halftime at the Kings game. That was #lit @SacramentoKings perfect halftime!",
    "581": "@NBA @Raptors @SacramentoKings LETS GOOOOOOO",
    "582": "Fred VanVleet beats the halftime buzzer.\n\n@Raptors 63\n@SacramentoKings 45\n\nSecond half coming up on NBA League Pass: https://t.co/V0kkYEEIkG https://t.co/r3P8gSGOLL",
    "583": "@SacramentoKings Sacramento Queens lol.  How are you favorite over anyone",
    "584": "@alex_ruban_ess @SacramentoKings @MB3FIVE Bobby jackson coached the kings better in summer league",
    "585": "@SacramentoKings Sacramento Queens. Lol",
    "586": "@SacramentoKings @MB3FIVE fire Luke Walton",
    "587": "@georgeaBrooks Had a fun time when I went to a Raps game there. I think it’s easy to be a Kings fan if you live on Sacramento.",
    "588": "Toronto #Raptors 63 - Sacramento Kings 45 | Half\n\nFred VanVleet buzzer-beating kiss off the glass. 💋\n\n#WeTheNorth #NBA75 #SacramentoProud #TORvsSAC https://t.co/xNuADHzAUJ",
    "589": "Hi @NBA can you trustee a franchise? @SacramentoKings are impossible to support and @Vivek has never given us a winning season",
    "590": "I love my @SacramentoKings but the titanic music is pretty loud right now. https://t.co/pbjI3oOLf2",
    "591": "This is the @SacramentoKings team the fans wanted. Playoff bound!",
    "592": "@SacramentoKings fire Luke Walton. #freesacramento",
    "593": "@SacramentoKings @MB3FIVE y’all gonna put a movie on? Feeling like this is the Kings’ lowest point in quite some time. I really can’t watch anymore",
    "594": "@YABarnes4ROTY @KarateBarnes @SacramentoKings dont reply to this if ur gonna hire me",
    "595": "Can we play the Sacramento Kings every night?",
    "596": "@SacramentoKings your tv color analyst are unlistenable. Just as bad as the team",
    "597": "@CarmichaelDave Watching summer league and preseason I was super excited @SacramentoKings 😔",
    "598": "Sacramento Kings more like the Sacramento Losers smh",
    "599": "@SacramentoKings @MB3FIVE What is the point of this worthless franchise?? They have always sucked and always will suck.",
    "600": "The @SacramentoKings are a joke right now. Not just from a coaching aspect but a player aspect as well. Year after year it’s the same thing. Play as a team for a few minutes stop get behind play hero ball get further behind decide to play team ball again after it’s too late",
    "601": "Depressed @SacramentoKings fan",
    "602": "Great 1st half for @Raptors vs @SacramentoKings. Fun. But gotta show that they can finish a game as killers. #WeTheNorth",
    "603": "Do the Sacramento Kings have fans?!",
    "604": "@Suneeta21 @SacramentoKings They salty af rn",
    "605": "Kings led the Raptors 27-21 in the first quarter with 1:28 to go.\n\nRaptors outscored Sacramento 42-18 the rest of the half.",
    "606": "Didn't expect that @SacramentoKings",
    "607": "The Sacramento Kings will beat the Toronto Raptors and if I’m wrong, I will buy everyone that RTs this and follows\nhttps://t.co/OX7jwWcsGe\na beer... https://t.co/1hvIJ6R0ir",
    "608": "@SacramentoKings @MB3FIVE Trash ass team",
    "609": "Is @SacramentoKings really playing keep bleeding love while Pascal had blood coming down his face🤦🏾‍♀️",
    "610": "@SacramentoKings are so brutal. All this because Webber missed a free throw in 2002",
    "611": "@SacramentoKings playing that song when @pskills43 is actually bleeding from an elbow to the head - seriously? #WeTheNorth",
    "612": "@SacramentoKings @MB3FIVE Marvin bagley makes $8.65MM per year. Wow",
    "613": "LOOOL who’s the Sacramento kings DJ!? No way they’re playing “keep bleeding” has bloods coming down pascals face 😭",
    "614": "Toronto Raptors Scottie Barnes scorching, the Sacramento Kings, in Sacramento. That five minutes, was up tempo. #WeTheNorth #NBA75",
    "615": "@SacramentoKings fire luke walton stat",
    "616": "“Bleeding love” @SacramentoKings….? Really? Tasteless…..#we the North",
    "617": "To say I’m disappointed w the reffing at the @SacramentoKings game is an understatement.   Call it both ways…",
    "618": "@SacramentoKings really playing \"Keep bleeding\" in the arena...\n\nWe see you.\n\n#WeTheNorth",
    "619": "Kicking off the weekend with the flailing #SacramentoKings https://t.co/oNwuDemePA",
    "620": "Whoever is in charge of the ticket prices needs to lower them bad cause nobody is there...the kings aren't good enough for them being expensive lol @SacramentoKings",
    "621": "being a Sacramento Kings fan is fucking embarrassing.",
    "622": "@SacramentoKings @Verizon @swipathefox @TyHaliburton22 @hbarnes @Chimezie_Metu @Rich_Holmes22 Tristan Thompson \"I don't need no f*cking motivation\" 7 minutes 0 points 0 rebounds 0 assists 🔥🔥🔥🔥",
    "623": "@SacramentoKings  suck",
    "624": "Sacramento Kings 🗑 #NBA75",
    "625": "Gary Trent Jr. (15p/3r, 5/10 FG, 3/6 3PT) has it stuck on automatic!\n\nToronto #Raptors | Sacramento Kings\n\n#WeTheNorth \n#NBA75 #SacramentoProud #TORvsSAC https://t.co/G4otIAWKrY",
    "626": "Wake the fuck up you stupid bitches @SacramentoKings",
    "627": "@RapsReport you’ve probably noticed how many soft calls and 1’s sacramento have got tonight but i’m watching with kings announcers and they’ve been complaining all game about the fouls and physicality",
    "628": "@PaisTamra and I are in #Sacramento to see the @Raptors play the @SacramentoKings \n\n#wethenorth \n#tamradanny\n#vlogging \n#vlog https://t.co/6upJv6iXqU",
    "629": "Game stream: Toronto Raptors vs. Sacramento Kings https://t.co/wGYzaxQAcm",
    "630": "Check out 1999-00 UPPER DECK RETRO JASON WILLIAMS SACRAMENTO KINGS #67 #SacramentoKings https://t.co/Gc18VElJBU via @eBay",
    "631": "Phoenix Suns - Dallas Mavericks\nSacramento Kings - Toronto Raptors\n\nBet slip link: https://t.co/Id4ZuYsRET https://t.co/3GYDyEqALK",
    "632": "@SacramentoKings you suck and i hate you",
    "633": "@SacramentoKings @MB3FIVE Luka &gt;&gt;&gt;! well ofc the front office never saw that !",
    "634": "The Sacramento Kings https://t.co/xpzDpChoyT",
    "635": "@SacramentoKings @MB3FIVE Surprised he didn't shatter like glass",
    "636": "ALERT: New high roller bet posted!\nA bet has been placed for $48,799.06 on Sacramento Kings - Toronto Raptors to win $92,718.22.\nTo view this bet or copy it https://t.co/ioPVmEUjrk https://t.co/BBPTW3fDRb",
    "637": "@SacramentoKings @MB3FIVE Play him more",
    "638": "It’s incredible how an already bad team gets even more bad the second Bagels checks in. 😂\n\n#SacramentoProud \n@SacramentoKings",
    "639": "@Beingbala_ @SacramentoKings @Raptors @Sabanatarajan2 Match innum mudiyala 🤓",
    "640": "@SacramentoKings @MB3FIVE Luke needs to play him more",
    "641": "Marvin Bagley refuses to enter a game but then we play him?  And for what so he can score a bit and be out of position on defense?\n\nLuke can’t adjust to game flow or the other teams adjustments.  Luke doesn’t put players in position to utilize strengths.  @SacramentoKings @Vivek",
    "642": "💣 Sacramento kings kick off the season running whit 2-0 blowout games lead by their pg No Lies King he kinda remind’s me of de’Aaron fox🐺 https://t.co/X4FNcVD1IS",
    "643": "ALERT: New high roller bet posted!\nA bet has been placed for $5,004.31 on Sacramento Kings - Toronto Raptors to win $9,007.76.\nTo view this bet or copy it https://t.co/PKORUDW0RO https://t.co/znbIZQrYs8",
    "644": "At the Kings game with Dad, enjoying our favorite team. Only person missing is @streetsavvyGMG #sactown @SacramentoKings https://t.co/lbqELlDZWZ",
    "645": "#Sacramento Kings - Toronto Raptors ★ #1er cuarto terminado: 27 - 30 by: #SofaScore",
    "646": "What's going on with Referee #51 and @SacramentoKings #40? Every time a @Raptors player passes him, he calls a foul. It's ridiculous. Ten fouls in the first quarter. #bias",
    "647": "Bagley in. The fans cheer. \n\nThis is the norm. \n\nTwitter isn't real life. \n\nThe general Kings fan truly wants Bagley to succeed and succeed in Sacramento",
    "648": "ALERT: New high roller bet posted!\nA bet has been placed for $5,804.77 on Sacramento Kings - Toronto Raptors to win $14,221.67.\nTo view this bet or copy it https://t.co/8aBmRtqbIo https://t.co/0T8X0KoUii",
    "649": "The @SacramentoKings have literally no idea how to run plays. All they can do is set screens for Buddy, and run pick &amp; rolls 🤦🏻‍♂️ otherwise they just run around in circles waiting for someone to get open. Am I missing anything?",
    "650": "Raptors Pascal Siakam’s improvement over the years is due in part to @SacramentoKings asst coach  @ricohinesbball who’s in the lab with Siakam every summer in Los Angeles where he works out. \nFacts 💯",
    "651": "@SacramentoKings fake",
    "652": "Sacramento tipped off about 15 minutes ago, so the Kings will be working for the next 2 hours or so to get past the Toronto Raptors.\n\nMeanwhile the Jazz are sitting in Sacramento like: https://t.co/LlumaSX2Pk",
    "653": "Guys you have one jobb  @SacramentoKings @Raptors 😒 https://t.co/pbAtgrJq0y",
    "654": "Sleep Train Arena in Sacramento... \n\nit’s fitting though because the Kings have been sleep since 2004 https://t.co/I60Dg6Xxsk",
    "655": "@SacramentoKings @Verizon @swipathefox @TyHaliburton22 @hbarnes @Chimezie_Metu @Rich_Holmes22 Like fox",
    "656": "@SacramentoKings @Verizon @swipathefox @TyHaliburton22 @hbarnes @Chimezie_Metu @Rich_Holmes22 hey  is walker so I need all kings players will get dunk on ball on the Rims  I need allow kings players will get dunk to please so we need it",
    "657": "Episode 93 - Sacramento Kings and Toronto Raptors Watch Party https://t.co/zT2Uq1qLmW",
    "658": "@SacramentoKings @Verizon @swipathefox @TyHaliburton22 @hbarnes @Chimezie_Metu @Rich_Holmes22 hey James is walker so I need all kings players will get dunk on ball on the Rims  I need allow kings players will get dunk to please so we need it",
    "659": "This @SacramentoKings Raptors game is ALL of that early.  Up and down, fun as hell!",
    "660": "@JayceSZN @SacramentoKings @Verizon @swipathefox @TyHaliburton22 @hbarnes @Chimezie_Metu @Rich_Holmes22 He’s better then Harkless and Metu lol. If Bagley plays and gets the mins he’s a 20 and 10 guy every game.",
    "661": "No one is jumping on the Raptors fakes and the rotations defensively have been solid. The #Kings are also pushing in transition. Great start to the first quarter for Sacramento as they lead 15-9 over the Raptors.",
    "662": "ALERT: New high roller bet posted!\nA bet has been placed for $22,657.65 on Sacramento Kings - Toronto Raptors to win $55,511.24.\nTo view this bet or copy it https://t.co/wkDZmshZh1 https://t.co/JrP2vthiXu",
    "663": "Live bet\nSacramento Kings 1Q ML\nGuaranteed winner\nLock it in immediately\n🤑🤑🤑🤑🤑🤑🤑 https://t.co/RKnu7Ks348",
    "664": "these @SacramentoKings jerseys are cleannnnnnn 🔥💦",
    "665": "Those jerseys should be our standard jerseys and city editions should be something a bit more different @SacramentoKings",
    "666": "It’s GAME DAY FOR @raptors As They Play The Sacramento Kings https://t.co/hFUKGJQmOg",
    "667": "Sacramento Kings vs. Toronto Raptors https://t.co/MVuvzJbZud",
    "668": "Win or she’s never coming out @SacramentoKings https://t.co/bgo6OvCTue",
    "669": "@BenJCarlos @SacramentoKings Same reaction",
    "670": "What the hell, @SacramentoKings. https://t.co/AG6VuOSdre",
    "671": "If we lose to an irrelevant franchise like the Sacramento Kings…",
    "672": "Sacramento Kings vs Toronto Raptors is on Sportsnet One. With commentary from Matt Devlin. Co-commentator is Alvin Williams.  For more details see https://t.co/dRUhUN8EZ2 #SacramentoKings #TorontoRaptors #SportsnetOne",
    "673": "@SacramentoKings @Verizon @swipathefox @TyHaliburton22 @hbarnes @Chimezie_Metu @Rich_Holmes22 Luke Walton has got to go. Bring back Rick Adelman",
    "674": "Let’s go @SacramentoKings!!!! #SacramentoProud https://t.co/kbBSj7iDye",
    "675": "These @SacramentoKings warm-up bowling jerseys kinda fuego 🔥🔥🔥",
    "676": "@SacramentoKings @Verizon @swipathefox @TyHaliburton22 @hbarnes @Chimezie_Metu @Rich_Holmes22 So this will be the starting lineup for a week maybe I guess.",
    "677": "The new @SacramentoKings warmups 👌🏽",
    "678": "#NBA #NBATwitter Today's Lineups\n\n#WeTheNorth \nToronto Raptors Starting 5:\nFred VanVleet\nGary Trent Jr\nScottie Barnes\nPascal Siakam\nKhem Birch\n\n#SacramentoProud\nSacramento Kings Starting 5:\nDe’Aaron Fox\nTyrese Haliburton\nHarrison Barnes\nChimezie Metu\nRichaun Holmes",
    "679": "Watch Live Stream of Toronto Raptors vs Sacramento Kings\nhttps://t.co/CDwPpiE4pI",
    "680": "The Toronto Raptors continue a daunting road trip when they face the Sacramento Kings on Friday starting at 10 p.m. ET / 7 p.m. PT.\n\nWatch the game on Sportsnet One, and follow along on our NBA Live Tracker..\n\nhttps://t.co/eNEWxtqDOb https://t.co/DZhJuJuwaI"
}