{
    "0": "@Ansgar_L @AdamWylde In NBA land my team the Charlotte hornets own all NBA records from Charlotte. So that is the og team from 88-02 and then the bobcats plus new hornets from 04-present",
    "1": "My head is starting to spin with so many sports options tonight. \n\nThe Xfinity Series race won’t end. The home debut of Charlotte FC is starting soon. And the Spurs are in CLT playing the Hornets where a win would give Coach Pop a tie for the all-time mark",
    "2": "I feel people are making too much of @MELOD1P being benched last game. He was in foul trouble early. Then the @hornets were up big with the team and @isaiahthomas firing late. They chose not to risk our franchise player and ruin the team dynamic with very little to gain.",
    "3": "@hornets @CrumblCookies Start the win streak please",
    "4": "It's always great to have @betsy_mack join the show.\n\nThe executive director of the Charlotte Hornets Foundation talks to @ashahahmadi and @WesGotRange about the organization's March plans and more!\n\n#AllFly https://t.co/SsYwLmcOg7",
    "5": "@allykirtley @hornets Me too!",
    "6": "@SportsGamerJon @hornets Thanks!",
    "7": "Game night with the wife. @hornets https://t.co/4XLFufeYVC",
    "8": "Charlotte Hornets (-3.5) vs. San Antonio Spurs! #AllFly #PorVida #NBA #NBATwitter #NBA75",
    "9": "@hornets @CrumblCookies Happy birthday @masonplumlee",
    "10": "@TreBos10 I don’t know but Charlotte can’t handle the hornets and the FC on the same night",
    "11": "The bros are out here doing things tonight 🙌🙌 \n\n#BroSquad #CharlotteHornets #Nba #basketball https://t.co/pcmO9wMkAN",
    "12": "@hornets @CrumblCookies Cmoon Milees min. 20 points.",
    "13": "Atmosphere for Charlotte FC has been better than 99% of all Panthers/Hornets games I’ve ever been to.",
    "14": "@hornets @CrumblCookies Bench Lamelo for 5 mins every foul he gets",
    "15": "Tonight's starting lineup for the Charlotte Hornets: Ball, Rozier, Bridges, Washington, Plumlee https://t.co/bVWH4AMCA2",
    "16": "@hornets @CrumblCookies PLUMLEE NOOO",
    "17": "@AndyFromCLT @hornets @CrumblCookies About to lose by 5",
    "18": "Our game against the @hornets starts at 7:00 p.m. EST, only a few more minutes before game time.",
    "19": "Charlotte Hornets Starting Lineup 3/5\n PG: LaMelo Ball\n SG: Terry Rozier\n SF: Miles Bridges\n PF: PJ Washington\n C: Mason Plumlee\nhttps://t.co/o75oZ8vnE8",
    "20": "@hornets @CrumblCookies Lets win this baby",
    "21": "@hornets @CrumblCookies CLT FC on unfortunately",
    "22": "@joanpzls @hornets I wish I could’ve come. 😭😭😭",
    "23": "@joanpzls @hornets look at Charlotte sports. growing up so fast. 2 pro games at the same time.  bravo",
    "24": "@NotoriousVIC007 @hornets I was shocked when I checked. $80 was too good to pass up",
    "25": "@joanpzls @hornets Good seats",
    "26": "@WinstonVictoria and I Taking in the @hornets game tonight! #AllFly https://t.co/ZLZnAjUFAw",
    "27": "Game day, go @hornets #AllFly https://t.co/xAMRHZ4X7d",
    "28": "charlotte hornets swag tbh https://t.co/u2Do8B6xTp",
    "29": "@space_diff @KoolAidAustin @HornetsPR @hornets Nah, we just need to sign a better contract.",
    "30": "It’s a good day for NC sports. Charlotte FC, Hornets home game, and UNC-Duke tonight!",
    "31": "@hornets @isaiahthomas What’s the flag for again?",
    "32": "CHARLOTTE HORNETS VS SAN ANTONIO LAMELO VS DEJOUNTE WATCH LIVE NOW!! https://t.co/arxG5wydzg via @YouTube",
    "33": "Hmm… @MELOD1P TRIPLE DOUBLE +1550?! 😏😏😏 Will you tail? #AllFly @hornets",
    "34": "@hornets @isaiahthomas Y’all better sign him for the rest of the year",
    "35": "the IT factor 🏁\n\n#AllFly https://t.co/maVWke4Goe",
    "36": "CHARLOTTE HORNETS VS SAN ANTONIO LAMELO VS DEJOUNTE WATCH LIVE NOW!! https://t.co/IV208oiciG via @YouTube we are live in the #LiTHoUSe Frenemies in the building tonight Dejounte Murray is in town https://t.co/zbQWImPuVD",
    "37": "About 35 minutes till #BuzzCity is back in action back home in Charlotte!\n\n@hornets hosting San Antonio tonight. \n\nExcited to talk to @TBoneWFNZ and @stansportsman on our new FM home 92.7!\n\nTip is at 7 on @wfnz the Hornets Mobile App and the Hornets Radio Network! https://t.co/6H1poQHM9M",
    "38": "Can’t wait to see this @spurs vs. @hornets  game! It’s the first time in years that I’ll have seen an @NBA game!",
    "39": "@hornets if mj is looking for another player like rodman just sign me",
    "40": "@hornets let’s stand on business tonight",
    "41": "@hornets @MichelobULTRA @isaiahthomas @MilesBridges @PJWashington @KELLYOUBREJR Kelly Oubre 😮‍💨",
    "42": "FIT CHECK ✔️\n\n#ULTRADrip | @MichelobULTRA https://t.co/VJZyvd5Jd4",
    "43": "@adamcawa @hornets I’m so sorry, I didn’t realise, I can only apologise",
    "44": "Working a different basketball game today. \n\nHello @hornets 👋 https://t.co/25V5JK54mr",
    "45": "@rx7ls6 @hornets @NovantHealth Slowest healer in the NBA.",
    "46": "@hornets @NovantHealth Rinse and Repeat",
    "47": "@hornets @NovantHealth Man this is crazy you niggas really going to trade bouk",
    "48": "@hornets @NovantHealth Hayword not worth the contract",
    "49": "@hornets @NovantHealth Neck soreness😂😂😂",
    "50": "@hornets @NovantHealth What the hell happened to that man neck Bra ain’t no way… Been damn near two weeks",
    "51": "@British_Buzz @hornets Organization.  We don’t spell that girly British way. We used hard z’s like real men.",
    "52": "@hornets @NovantHealth \"Sore neck\" my ass",
    "53": "INJURY REPORT vs SAS\n\nGordon Hayward (L Ankle) is out.\nJames Bouknight (Neck Soreness) is out.\nJalen McDaniels (L Ankle Sprain) is doubtful.\n\n#AllFly | @NovantHealth https://t.co/ZUDrNfruLx",
    "54": "Saturday Night Spurs 🏀 \n\n🆚 @hornets    \n⏰ 6pm CT\n📍 Spectrum Center\n📱 Spurs App (SA and Austin markets only)\n📺 @CW35SA \n📻 @1200WOAI, @kxtn1350 AM &amp; 107.5 FM HD 2 https://t.co/9GCDsfXqMA",
    "55": "@JimGrayOfficial It was understood that it was going to happen but he was not drafted by the Lakers. I lived in Charlotte at the time and had tickets to the Hornets.",
    "56": "@TheEthanSchmidt Good luck on the locks!\nI like the Spurs and the over in Charlotte. Hornets 1-9 last 10 home games. Both teams up tempo and should race up and down the floor.",
    "57": "@JimGrayOfficial Currently reading your book. I love it. I’m 54 and lived through all of this. Found an error. You mentioned that Kobe was drafted straight out of high school by the Lakers. He was in fact selected by the Charlotte Hornets and traded.",
    "58": "Coach JB is on the mic! 🎙 #SASvsCHA https://t.co/GwTlV9Nx0F",
    "59": "@hornets @masonplumlee Stop trying to be the joker bumlee HBD tho",
    "60": "NBA parlay:\n\nCharlotte Hornets\nMiami Heat \nUnder 235.5 Timberwolves\n$5 for $18.36",
    "61": "Charlotte Hornets PG LaMelo Ball could probably lace up for Charlotte FC tonight and instantly be their best player. \n\nBut something in the air tells me they’ll get at least a draw tonight vs LA Galaxy, thanks to the expected crazy atmosphere. https://t.co/hQL1ANyOqA",
    "62": "Portland traded their whole team for nothing. Any non-all star can be traded at a low cost\n#SoYouthinkYoureAGM #HoopSpaces #CharlotteHornets\n\nhttps://t.co/20R8aka4ZQ",
    "63": "Here is my #ViewFromMyOffice on a great night for Hornets Basketball in Charlotte! @Tommy_the_V @allanw98 @JESSEDIEBOLT @laurawolffphoto https://t.co/54ucu9MBHY",
    "64": "With 6 3's tonight @T_Rozzay3 would tie his total from his 1st season in Charlotte (166 in 2019/20) and give him 3 of the top 11 seasons for made 3's in @hornets franchise history!\n\n#BuzzCity hosts San Antonio tonight at 7!",
    "65": "Check out new work on my @Behance profile: \"Charlotte Hornets\" https://t.co/ATKAk84oNt",
    "66": "@NBA @masonplumlee @hornets Proud of former Duke Mason Plumlee.",
    "67": "Let’s go Charlotte Hornets 🐝 !!!",
    "68": "@Pavvy8 @hornets I probably wouldn’t have done the Hayward signing, but I understand why they did and I don’t think it’s a disaster. Definitely can’t pay them all, but a good position to be in to choose which fit best term",
    "69": "Vintage Starter 90s Charlotte Hornets 1/4 Zip Pullover Jacket XL Puffer Winter https://t.co/dAa3m707tg eBay https://t.co/b5WTdwoGAx",
    "70": "2022-03-05 : #NBA #Basketball : #SanAntonioSpurs @ #CharlotteHornets Basketball Betting Preview Link: https://t.co/1Yt4fz47bh",
    "71": "@British_Buzz @hornets Don't forget Batum, Zeller and Biyombo. U think Hayward was the wrong player to sign last summer?? You can't develop and pay all the young players so some will have to go....im sure PJ Washington will be 1 of 1st players to want out",
    "72": "@Pavvy8 @hornets Maybe for a vet team, like the Marvin Williams/Kemba/Lamb Hornets teams I would agree. But Charlotte are the 4th youngest team in the league with 3 VERY young players in Thor/Bouk/Kai, patience is the key IMO",
    "73": "@hornets @masonplumlee Happy birthday to the best center in the east",
    "74": "Uniforms for San Antonio Spurs vs Charlotte Hornets at 4:00 PM. \n\n#PorVida #AllFly https://t.co/dkoJFW2XjS",
    "75": "@British_Buzz @hornets I can understand that although if a team is stuck at mediocre with same players for a number of years then they should either make that leap for a big star like bulls/76ers or reset and rebuild like pacers/blazers",
    "76": "@Pavvy8 @hornets We want to build something sustainable E.G. Spurs, that requires a huge amount of self control but the reward can be massive",
    "77": "@Pavvy8 @hornets I think that’s unlikely, what you’re beginning to see is a lot of people wanting to contend right now and trade picks/young players for immediate impact. I’m of the idea that isn’t the path to the championship, it caps us as a frisky 5/6 seed who will fall off in 2-3 years",
    "78": "@British_Buzz @hornets What do you think can happen? Miles leaving in summer as a free agent?",
    "79": "Don't forget to check out today's Hornets Hive Cast!\n\n@wsoctv Sports Director @philorbanWSOC9 helps me preview tonight's matchup between the @hornets and the San Antonio Spurs.\n\nhttps://t.co/OqDLGfQBZi",
    "80": "Just realised the Cs get two days off before they play Charlotte, while the Hornets have play us on a b2b (Nets). Beat the Nets tomorrow and we should have a 5 game win streak going into KG night against the Mavs.",
    "81": "🏀Overnight NBA Acca 🏀\n⏰ Starts at 12:00am\n⭐️ Returns 3/1\n\n🗣️\"Charlotte Hornets have hammered the Cleveland Cavs by 20+ points last Wednesday. We expect them  ...\"\n\nView here 🔽\nhttps://t.co/iCCJRgqrQ8\n\n(18+ begambleaware) https://t.co/ENoMFjrsYM",
    "82": "@mastersan244 Nosso querido Charlotte Hornet, Mason Plumlee",
    "83": "Charlotte Hornets Predictions and Preview for 3/5/2022 hosts San Antonio Spurs.  Looking for betting action?  Find out if there is any value in our preview. #NBATwitter #Sportsbook https://t.co/DC78lFPaSo",
    "84": "My 🔒 of the night is my favorite team this year and I’m my opinion the most fun team to watch! @hornets money line over the @spurs #GamblingTwitter #FreeBets #Hornets https://t.co/Lj6Oe0A6X7",
    "85": "Hey #RipCity    here is our Blazers Draft Stock Matchups for today, 3/5/22\n\nKings over Mavs in Dallas\nSpurs over Hornets in Charlotte \nLakers over Warriors in LA\n\nShout out to @tcbbiggs for asking for these updates, accidentally lol!\n\nDisclaimer to follow",
    "86": "San Antonio Spurs visits Charlotte Hornets Predictions and Preview for 3/5/2022 today.  Who are we taking in this game?  Find out now. #NBATwitter #Sportsbook https://t.co/DC78lFPaSo",
    "87": "As a Tar Heel living in CLT, I am AWASH with sports-ball on today:\n-UNC/d00k\n-Hornets/Spurs\n-Charlotte FC/????\n-Half Marathon uptown",
    "88": "🏀NBA Picks\n\nLA Lakers +8.5\nCharlotte Hornets ML\nSacramento Kings +9.5\n\n#nba #nbapicks #NBA75 #NBATwitterLive #GamblingTwitter https://t.co/JPOT29bAKZ",
    "89": "@hornets @sam_perley @LendingTree Aint know way you said tonights key matchup is Plumlee against pearltl when Lamelo and Murray are right there",
    "90": "Happy birthday to mason plumlee of the Portland Trail Blazers #masonplumlee #masonalexanderplumlee #portlandtrailblazers #newjerseynets #charlottehornets #denvernuggets #detroitpistons https://t.co/xpnrVkxFbg",
    "91": "@marino13882 @hornets Respect",
    "92": "7:00pm ET, Sat, Mar 5\nSan Antonio Spurs\nCharlotte Hornets\n📺: Bally Sports SE-CHA, CW35\n\n#LEGENDoftheMiamiHEAT #NBA75",
    "93": "@British_Buzz @hornets I’m a nerd",
    "94": "Half the State of NC in Durham for coach K last game other Half in Charlotte for Charlotte FC first ever game and Hornets game #ForTheCrown",
    "95": "@__PLAINVANILLA @hornets @sam_perley @LendingTree Just did quick research, Hornets should win.👍🏾",
    "96": "@freakin_capt @SagED_UP It may act similar to the charlotte/new orleans hornets situation. would be cool.",
    "97": "Free NBA Prediction San Antonio Spurs vs Charlotte Hornets 3-5-22 By Mea... https://t.co/3z583QBykI via @YouTube Meet me at the window!!! #meangreenvip #youtube https://t.co/ETixSe1GT3",
    "98": "@__PLAINVANILLA @hornets @sam_perley @LendingTree Spurs can easily cause an upset. These stats mean nothing 😂",
    "99": "Analyzing Saturday’s San Antonio Spurs at Charlotte Hornets odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/37yrPSVLR4",
    "100": "San Antonio Spurs at Charlotte Hornets odds, picks and predictions https://t.co/WQY5AKjAnU",
    "101": "@hornets @sam_perley @LendingTree only put mason bc it’s his bday 😂",
    "102": "All the info you need about tonight's matchup vs the Spurs, thanks to @sam_perley of https://t.co/BzkRIrrehy! \n\n#AllFly | @LendingTree https://t.co/1JUzA1Migo",
    "103": "David Wesley with 15 points in Hornets' overtime win over Charlotte #NBA #NBA9798",
    "104": "i need to get to a hornets game and a Charlotte FC game this month",
    "105": "Sports Checklist Today\n\n☑️ Hornets W \n\n☑️ Charlotte FC W @ Home\n\n☑️ UNC beat Dook at Coach Ks Finale \n\n☑️ My HS basketball team winning the State Championship",
    "106": "@money_talks65 @TakeDeezPolls @TheLakersReview @MagicJohnson Like I said, Montrez Harrell plays for the Charlotte Hornets now. 😂😂😂\nTurned down a significant multi-year contract offer from Charlotte to join the Lakers for revenge in the Playoffs against the Clippers. Failed to happen. https://t.co/Qc6TO1wDlW",
    "107": "Today's NBA Consensus (So Far):\n\nDallas Mavericks 75%\nCharlotte Hornets 71%\nGolden State Warriors 70%\nOrlando Magic 57%\nPhiladelphia 76ers 53%\nPortland Trail Blazers 51%",
    "108": "@British_Buzz @hornets We are adapting the George HW Bush 92 motto?",
    "109": "The Sixers had #TrustTheProcess, now I'm wanting to kickstart a the Hornets new unofficial phrase of #StayTheCourse.\n\nAccompanying this are three values which underpin #StayTheCourse \n\nYou know you like it @Hornets https://t.co/uOlDaCuFZv",
    "110": "Check out 2020-21 Panini Mosaic GENESIS LaMelo Ball RC 202 Charlotte Hornets Rookie PSA 10 https://t.co/wuyDz4znYq @eBay",
    "111": "@hornets @masonplumlee happy b-day!!!",
    "112": "@tradestreetpost @HornetsPR @Arthurlee_M @hornets Guess you missed it last game too",
    "113": "@tradestreetpost @HornetsPR @Arthurlee_M @hornets For real.",
    "114": "Michael Jordan Patch. Tounge out, basketball assassin.\n.\n.\n.\n #MichaelJordan #cardart #thehobby @beckettcollect @EricNorton316 @tradercracks @Jumpman23 @TarHeelTimes @chicagobulls @hornets https://t.co/F1BsLA7yto",
    "115": "2day LIVEWITHTHEQCB is live INSIDE the BOJANGLES COLISEUM 1P-3P @FoxSportsCLT for the @BigSouthSports Tourney - WE TALKING DUKE v HEELS, HORNETS, CHARLOTTE FC, BEST OF THE WHINER LINE! - TUNE IN 94.7FM or Online https://t.co/kLcTwkFlkO or on the App Foxsportsradiocharlotte. 📻 https://t.co/bUXLhDGs5e",
    "116": "So let’s get this straight for NC sports today:\n12PM: Big South Semis in CLT\n2PM: Big South Semis in CLT\n6PM: Coach K’s Last Game\n7PM: Hornets vs Spurs\n7:30PM: Charlotte FC’s inaugural home game, 74K attending and maybe more just partying uptown\n\nAm I forgetting anything?",
    "117": "/r/CharlotteHornets: Getting to at least the 8th Seed #AllFly https://t.co/4k9N2bFcaS",
    "118": "@HornetsPR @Arthurlee_M @hornets Neck soreness? What happened?",
    "119": "@hornets @masonplumlee At basketball not life",
    "120": "@hornets @masonplumlee Go spurs go",
    "121": "@hornets @masonplumlee Happy birthday big man protecting the hive.......#beelieve",
    "122": "@NFTLlama @DinosChibi You should watch out for this one! Not only they are cute but they're going up with a bang! starting w/ NBA star PJ Washington of the Charlotte Hornets on the team! Their first P2E game is about to be release within these month so get one now! 🚀#FloorIsChibi https://t.co/dzQyooEQXT",
    "123": "@Nuclearisfuture @BLee_CLT @hornets Either way it’s def not the hornets fault since the NBA schedule was released well before any of this",
    "124": "@plshelp1888 @hornets You blamed it on the hornets like it’s their fault. You’re the one that needs to get a life",
    "125": "Idea from @CallingOurShot — Jakob Poeltl over 3.5 Assists +140 (.75U) \n\nHe’s hit this in 5 straight games, and plays the hornets today. Always bet on Centers vs Charlotte",
    "126": "@memgrizz @OrlandoMagic @hornets @spurs @Timberwolves @trailblazers Direct links to the events\n\n@memgrizz vs @OrlandoMagic \n\nhttps://t.co/R7x8kMi4Sv",
    "127": "@NFTLlama @DinosChibi they are teamed up with PJ Washington of the Charlotte Hornets and he is wearing the Chibi Dinos custom designed shoe today on court!! 3 P2E games coming out soon that are being made by top of the line game developers that worked on Fifa and Topshot! https://t.co/GEqnfsUX4n",
    "128": "New post (San Antonio Spurs vs Charlotte Hornets NBA Pick – March 5) has been published on The Sports Geek - https://t.co/IHfuwoNWMo https://t.co/vPKAk1vj8C",
    "129": "Spurs vs. Hornets Charlotte -4\n\nRecord 1-1",
    "130": "Check out this listing I just added to my #Poshmark closet: Women’s Black Long Sleeve Bejeweled Charlotte Hornets Tee 💜. https://t.co/A9ZImdcrNs #shopmycloset @poshmarkapp",
    "131": "The San Antonio Spurs are back on the road as they visit the Charlotte Hornets and look to snap their three-game losing skid. Here are five things to watch for in tonight's game. https://t.co/pDn2SRldsG",
    "132": "@linzsports Huh? I was doing contracting for Ping and legit was told a while ago to leave, and consider leaving your belongings. Nike sent me a email in jan, so did the charlottes hornets. Did they like.. not tell payers to flee?",
    "133": "NBA 🇺🇲 12-8 = +0.3u\nCharlotte Hornets (-170) 0.5u 🔥\n\n#NBA #Basketball #GamblingTwitter #BettingTips #SportsBetting #SportsPicks #FreePicks",
    "134": "🏀Big South Basketball Championships Starts Today At The Bojangles Coliseum At 12PM On ESPN+Charlotte, NC #BigSouthMBB #BigSouthWBB #CollegeBasketball \n🏀San Antonio Spurs #PorVida vs Charlotte Hornets #AllFly⌚️7PM 🖥Bally Sports SouthEast #NBA75 #NBA https://t.co/M1O4YFfhYK",
    "135": "@NBA @masonplumlee @hornets I don’t really like him",
    "136": "@MichSUGA19 @BTS_twt Charlotte Hornets\n\nHYPE STAY ALIVE \n\nListen to #StayAlive the record-breaking OST by #JungKook prod by #SUGA of #BTS (@BTS_twt)",
    "137": "@hornets fuck you bring back the cats. Rawr",
    "138": "Why Did The NBA Fear This 5'3 Basketball Player? | Muggsy Bogues | Goalcast https://t.co/Ui2OxCE38K #CharlotteHornetsGreat #NBA #Basketball #CharlotteHornets",
    "139": "The Batman \nUNC duke \nHornets \nCharlotte FC\nLakers \n\nEverything I’m going to watch today 😂😂",
    "140": "Charlotte FC home opener and the Hornets/Spurs game are by far the most important sporting events in the state of North Carolina today",
    "141": "Let’s see:\n\nHow might I fully represent the Tarheels, @hornets , AND @CharlotteFC today??? \n\nStay tuned!!! #AllFly #GDTBATH #ForTheCrown",
    "142": "Whatcha man you're not coming to the game tonight?? 🤪💜🏀\n\n#GameDay #gohornets #clt #nba #hornets #charlottehornets @ Charlotte Hornets https://t.co/HOQLgPe3ft",
    "143": "@utdad21 @ccards003 @BostonCardGuy @hornets @HornetsPR Looks Awesome! Glad I can contribute and help you complete that art project with your son. The memories you made are most important!",
    "144": "@HornetsPR @hornets So we get to see Richard’s &amp; Trez on the court at the same time? https://t.co/5jgtSEiiUz",
    "145": "@hornets @masonplumlee Wish he was on a different team lol happy b day!",
    "146": "@plshelp1888 @hornets Hornets don’t make their schedule…",
    "147": "Consensus Line Move:\n2022-03-05 San Antonio Spurs at Charlotte Hornets from 239.00 to 237.00\nUnder steam engine\n#NBA #bet #dataanalyst #entrepreneurship",
    "148": "@hornets @masonplumlee Happy birthday plumlee! I may talk shit at you but you a good dude",
    "149": "@Kano9112 @memgrizz @OrlandoMagic @hornets @spurs @Timberwolves @trailblazers Yeah, if anyone picks the wrong winner, there's a clear path to dispute already!\n\nTheir discord has support/bets channels to chat as well if you run into any issues. Link is on their site.",
    "150": "@PatrickMogul @memgrizz @OrlandoMagic @hornets @spurs @Timberwolves @trailblazers Noticed that on the filters but also recognize this is release version and that should be easy enough to feature later.  Yeah, good to know there was a dispute function.  Don't need any shenanigans",
    "151": "@lil_r1les @NBA @masonplumlee @hornets 🤣🤣i deadass laughed out loud....way too long. Gif of the day",
    "152": "@NickDePaula @boogiecousins @PUMAHoops @PUMA @MELOD1P @nuggets @hornets would’ve been nice. And he rock with Melo ball",
    "153": "@hornets @masonplumlee happy birthday but stop dribbling",
    "154": "@hornets @masonplumlee not a hornets fan but hbd plumlee 🥳",
    "155": "@hornets @masonplumlee all my homies love plumdog",
    "156": "@hornets @masonplumlee Happy birthday @masonplumlee get a W tonight!",
    "157": "BUZZ CITY! Join us in wishing our guy @masonplumlee a HAPPY BIRTHDAY! 🎉🎂 🥳 https://t.co/w1Gbp7xdsA",
    "158": "@lil_r1les @NBA @masonplumlee @hornets Yeah but hes palming 2 balls at once!",
    "159": "Today on the Hornets Hive Cast:\n\nWe preview tonight's game vs. the Spurs and examine the end of season awards opportunities for @hornets  stars @MilesBridges ,  @MONSTATREZZ  and @KELLYOUBREJR with @wsoctv sports director @philorbanWSOC9 \n\nhttps://t.co/OqDLGfQBZi",
    "160": "@nbatopshot Proud of my Charlotte @hornets collection. Love these guys! @T_Rozzay3 @gordonhayward  @LaMeloverse @LaMeloverse @KELLYOUBREJR @PJWashington @cody_martin15 @masonplumlee @thorrjt @IshSmith @jam3s210 @Jmcdaniels7  @HornetsPR @HornetsOnBally https://t.co/6rZZQgAXQY",
    "161": "Top #NBA play today: Charlotte Hornets -3.5 (7 value)\n\nLike = tailing",
    "162": "@CJohnsonTC @NBA @masonplumlee @hornets I think he's older than the percentage he shoots from the FT line.",
    "163": "@Kano9112 @memgrizz @OrlandoMagic @hornets @spurs @Timberwolves @trailblazers Would be nice to see it shortened up enough to free up your funds for events the next day, imho!\n\nThey also need some filters as the events are only listed in submission order at this time. For some of today's events you need to scroll down the page a bit but it's only day 1.",
    "164": "@MtnDude1020 @BLee_CLT @hornets I'm pretty sure the galaxy were probably more responsible for that seeing as they're the bigger team.",
    "165": "@hornets Hornets playing at home and Charlotte FC’s home opener is 2 blocks down 😡 https://t.co/zSO3UNKE9h",
    "166": "@dollaholla85 @Ballislife Also can't believe @hornets didn't go after him",
    "167": "@PatrickMogul @memgrizz @OrlandoMagic @hornets @spurs @Timberwolves @trailblazers Put 200 on the UFC main event going the distance.  This is a really cool idea.  I'm curious how the inners work though - is the outcome manually inputed by the author or a program?",
    "168": "it’s A LOT going on today.. Charlotte FC home game, Hornets home game with IT making his home debut, Puke vs UNC, just a great day in sports…",
    "169": "@hornets I told y’all boogie was still alive! Smh.",
    "170": "@BLee_CLT @hornets Yea on Charlotte FC’s part",
    "171": "Today's games so far, we've got 3 up for the #NBA tonight!\n\n@memgrizz vs @OrlandoMagic \n@hornets vs @spurs \n@Timberwolves vs @trailblazers \n\nAll have action already and are posted on https://t.co/6xIfywr695 for your gambling pleasures.\n\n#fuzzbets #harmonybets #nbacrypto #gambling https://t.co/QzICFICZy6",
    "172": "@plshelp1888 @hornets Charlotte FC home opener was scheduled way after",
    "173": "@British_Buzz My mom is a HUGE ….. and I mean HUGE Duke fan! \n\nWe’ll be watching the game most likely in Concord away from the Hornets/Charlotte FC traffic this evening!",
    "174": "🎂 Mason Plumlee - Charlotte Hornets has a birthday today",
    "175": "@NBA @masonplumlee @hornets Guy who left AD open for that iconic 3,hurts till this day",
    "176": "How salty should I be as a Hornets fan, given how little Charlotte got from the 5 position all year, now that Boogie (a FA most of the season) is contributing to a playoff team? https://t.co/KE4gucm3hD",
    "177": "Consensus Line Move:\n2022-03-05 San Antonio Spurs at Charlotte Hornets from 240.50 to 239.00\nUnder has books scared\n#NBA #sportsbook #dataanalysis #realestate",
    "178": "@NBA @masonplumlee @hornets Happy birthday",
    "179": "@hornets Lmfaoo same time as Charlotte fc terrible scheduling",
    "180": "@TianLombard @NBA @masonplumlee @hornets *life",
    "181": "@NBA @masonplumlee @hornets @lil_r1les this i needed to know!",
    "182": "Great Saturday for sports \n\nDuke vs UNC at 6:00\n\nHornets play at 7 \n\nFirst ever Charlotte FC home match at 7:30 \n\nApp state vs Georgia Southern at 8:30 \n\nPlus App baseball vs UNCW at 1:00\n\nWe lit",
    "183": "@chicagobulls @Lakers @Timberwolves @PelicansNBA @SacramentoKings @WashWizards @hornets @MiamiHEAT @nyknicks @spurs @trailblazers GO GET THISWIN ON WEDNESDAY GUYS!!!YES YOU GUYS CAN DO THIS!!!YES YOU GUYS CAN WIN AGAINST THISTEAM!!!YESYOUCAN!YESYOUCAN!!YESYOUCANGUYS!!!!!GO OUT,,,",
    "184": "@NBA @masonplumlee @hornets happy b-day",
    "185": "Game Day y'all! #AllFly @Hornets https://t.co/lh2xDKPZdU",
    "186": "@hornets This picture is creepy lol",
    "187": "What to Watch For: Saturday 3/5\n\n⚽️Inaugural Home Match for @CharlotteFC vs. LA Galaxy (7:30pm FOX) #ForTheCrown \n\n🏀UNC at Duke for Coach K's final game at Cameron Indoor (6pm ESPN)\n\n🏀@hornets at home vs. San Antonio - could clinch a season sweep over the Spurs (7pm Bally SE)",
    "188": "It’s a Saturday showdown. 😤\n\n#AllFly https://t.co/ErClhC9cXc",
    "189": "@NBA @masonplumlee @hornets Who c_ tarted dah wheet...",
    "190": "@deftlyinane The last time I was in Smith Reynolds, I saw the Charlotte Hornets' charter plane.I remember seeing Glen Rice &amp; Hugo the Hornet was emblazoned on the cockpit. This could be a conflated haze of composite memories brought on, not by a madeleine, but by a Costco stroopwafel.",
    "191": "@Knicker4Life @NBA @masonplumlee @hornets No way. Justice for Stephen adams",
    "192": "gonna be about 100k people there if you include the hornets game (75k at charlotte fc, probably like 15k for hornets)",
    "193": "Last week, Hugo, the Charlotte Hornets mascot, visited North Elementary in Kings Mountain to reward students for good reading habits. https://t.co/pDkiJJHQ2l",
    "194": "Last week, Hugo, the Charlotte Hornets mascot, visited North Elementary in Kings Mountain to reward students for good reading habits. https://t.co/6MisZXaraS",
    "195": "@HanisSalvador Bro I’m in Charlotte. MJ lives in NC and even owns the Hornets and we don’t get no type of exclusives across the whole state of NC! I don’t wanna hear that shit 😂",
    "196": "@NBA @masonplumlee @hornets Rember that Steven Adams saved his career",
    "197": "ALERT: New high roller bet posted!\nA bet has been placed for $7,803.36 on Charlotte Hornets - San Antonio Spurs to win $15,216.54.\nTo view this bet or copy it https://t.co/NaRlYxxrf1 https://t.co/b0EYjQdkUt",
    "198": "Too easy @NBATV another easy one tonight as well @spurs @hornets !!!! 3.5?!?!  Okaaaaay.   Lets go 10k tonight",
    "199": "San Antonio Spurs vs  Charlotte Hornets Prediction 3/5/22 -  Free NBA Picks https://t.co/yaGfD77rwT via @YouTube \n\n#NBA #NBAPick #NBAPrediction #basketball",
    "200": "Good morning all! Here’s where we stand this morning:\n7. Toronto.            34-29\n8. Brooklyn.          32-32\n9. Atlanta.             31-32\n10. Charlotte.       31-33\n11. Washington.    28-34\n\nTonight: Spurs at Hornets.",
    "201": "@ssholeBiden @NBA @masonplumlee @hornets ewww little kid who prob likes the confederate flag",
    "202": "@FPL_Keanu @NBA @masonplumlee @hornets the basketballs are his hand",
    "203": "Would be a decent day for @CATSRideTransit to increase the frequency of the light rail. Charlotte FC opening night, hornets game, and business from Saturday night. It just makes too much sense.",
    "204": "𝐆𝐀𝐌𝐄𝐃𝐀𝐘! #PorVida \n\n🆚 Charlotte Hornets \n📍 Spectrum Center, NC\n⏰ 21h00 (BRT)\n📺 NBA League Pass https://t.co/LUjdTMuXjm",
    "205": "@johnearlfink @PowellAnalytics would be interesting if they return would they be given the history of the super sonics which transferred to OKC. We saw it when Charlotte became the hornets again.",
    "206": "Charlotte FC’s home debut, Coach K’s last regular season game, and the Hornets’ next disappointing loss all in one night??",
    "207": "Charlotte Hornets are 1-8-1 ATS at home in the last 10 games.. but i’m sure that just means they’ll win todays game by 50",
    "208": "@NBA @masonplumlee @hornets Now here is a player I’d let date my daughter",
    "209": "\"The NBA fined Cleveland coach J.B. Bickerstaff $20,000 on Friday for the outburst that saw him tossed from the Cavaliers’ loss to the Charlotte Hornets on Wednesday.\"\n\n https://t.co/gAzqXzYICa",
    "210": "@NBA @masonplumlee @hornets The \"random highlight every year\" guy",
    "211": "@NBA @masonplumlee @hornets NEVER!!!! I hope he does not have a happy birthday. I hope its unhappy and he gets 0 presents and his friends and family all laugh at him and throw rocks at him.",
    "212": "@ssholeBiden @NBA @masonplumlee @hornets You probably go for china in table tennis LMFAO 💀💀",
    "213": "Join us in wishing @masonplumlee of the @hornets a HAPPY 32nd BIRTHDAY! #NBABDAY https://t.co/Ucc7mAnrjp",
    "214": "Charlotte #Hornets vs. San Antonio #Spurs | 3/5/22 | NBA Free Picks and Predictions | NBA Betting tips.\n\nWatch: https://t.co/8XJ77kxlbW\n\n #NBA #NBAPick #NBAPredictions #spursvshornet",
    "215": "I really wish the @hornets were smart enough to grab him when I asked https://t.co/LO1YdvPElE",
    "216": "@TweetsByBritt Blue eyes like Charlotte hornet baby blue",
    "217": "/r/CharlotteHornets: Miles Bridges: Agent talked me out of taking (reportedly $60M) contract extension with Hornets #AllFly https://t.co/LRoFdLpvvi",
    "218": "/r/CharlotteHornets: Game Thread: San Antonio Spurs (24-39) at Charlotte Hornets (31-33) Mar 05 2022 7:00 PM #AllFly https://t.co/ZkIcSgqM03",
    "219": "Charlotte Hornets n Toronto Raptors https://t.co/tcszV7RDfi",
    "220": "@hornets why didn’t y’all sign this man again? https://t.co/PQwIFJE11r",
    "221": "@CoachCollazo @StackzVA @workinhard555 @LawsNation He also owns the Hornets. A very small market team with no real rich history in NBA. No NBA superstars are going to go to Charlotte. They'll always go to the big money market teams.",
    "222": "@kennymac_49 @NBA @hornets Aww, I love this. Have a blast!",
    "223": "FREE #livestream here👉https://t.co/2c6Ltzn7d4 😉\n——\nMar.5, Sat.\n🏀#NBA ‼️\n1.Dallas Mavericks Vs Sacramento Kings\n2.Charlotte Hornets Vs San Antonio Spurs\n3.Minnesota Timberwolves Vs Portland Trail Blazers\n4.Memphis Grizzlies Vs Orlando Magic\n5. Miami Heat Vs Philadelphia 76ers.. https://t.co/W3KDuyKsiP",
    "224": "@BradyHawk305 I just want to have the 1 Seed and get a quick 1st round Sweep no stress would not mind facing @hornets",
    "225": "Game Preview: San Antonio Spurs vs. Charlotte Hornets https://t.co/e8j9AVf31b",
    "226": "@TheQueenBeeBBQ @mccrystal_alex @JHarden13 The Charlotte Hornets/Bobcats exist 😂",
    "227": "@hornets @isaiahthomas Good onya IT! Looking forward to seeing more of ya on the court again!",
    "228": "Top five teams I would like for Obi Toppin to sign a 2 year deal with next is:\n\n1. @warriors🔺👏👏👏\n2. @dallasmavs 🔺 Would love for him to play for Mark Cuban, build the Jordan brand with luka.\n3. @trailblazers \n4. @cavs 👏👏👏\n5. @WashWizards 🔻@hornets 🔺 reunite with Jalen",
    "229": "@PussySommelier The Pelicans have to go back to Charlotte, change their name to the Bobcats and then back to the Hornets",
    "230": "@rishi_sahadeo @WalderSports @TheTraeYoung @Raptors @hornets @ATLHawks @DetroitPistons @OrlandoMagic \nBahahahahhahaha! Where you at now.  You have the mosr embarassing fake players period. @pskills43 @OAnunoby @FredVanVleet Ain't it. Weak and garbage skillsets.  \nhttps://t.co/as5Rml0Fqd #Raptors #rtz",
    "231": "@Raptors Dead! \n1. @hornets \n2. @ATLHawks\n3. @DetroitPistons\n4. @OrlandoMagic \nYou guys are amazing! You just exposed and destroyed the @Raptors clowns.  The Raptors are a horrible organization &amp; fanbase. They stay lost and confused. Jaded! Poor overrated players.  #Raptors #rtz",
    "232": "NBA Basketball Game Betting Picks Simulator: 3/5/2022 7:10 PM ET - San Antonio Spurs vs. Charlotte Hornets - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/tIZPmEQSVZ #nba #sportsbetting #freepicks #cappertek",
    "233": "Why on earth are the Hornets at home on the same night as Charlotte FC’s first ever home game? Not to mention the Big South tournament going on at Bojangles Coliseum. Traffic is going to be a nightmare tomorrow in Charlotte. 🤦🏼‍♂️",
    "234": "@getsit OK, I have consulted the history books\n\n1. LeBron never played against v1 of the Charlotte Hornets; they moved in 2002\n2. His 46-6 record against the city of Charlotte starts in 2004-05 with the Bobcats and continues through the renaming to Hornets",
    "235": "@getsit I noticed this and I *think* that line item is Charlotte Hornets v1 and v2 but NOT New Orleans Hornets, who are grouped in with the Pelicans.",
    "236": "@money_talks65 @TakeDeezPolls @TheLakersReview @MagicJohnson Washington Wizards actually traded Montrez Harrell to the Charlotte Hornets. 😂😂😂 Outdated game tape, nice try.",
    "237": "Day 33 tweeting the @hornets to #BringBackTheCats court and uni combo for one night. I predict we are under 365 days from a bobcat night at the hive https://t.co/MzYdSrOuac",
    "238": "Check out NEW Nike Air Flight 89 Charlotte Hornets Purple Lamelo Ball Zo Mourning DS W/Rec #Nike https://t.co/yLD4sHGKnv via @eBay #hornets #charlottehornets #lamelo",
    "239": "NBA Basketball Game Betting Picks Simulator: 3/5/2022 7:10 PM ET - San Antonio Spurs vs. Charlotte Hornets - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/tIZPmEzi4r #nba #sportsbetting #freepicks #cappertek",
    "240": "@banslovesmom @hornets I don't think it really was a G league then they had the development league you couldn't send your drafted players especially those on the reg team roster back and forth to a farm team.",
    "241": "The Charlotte Hornets just put me in a networking group with everyone who has made a name for themselves &amp; has been doing amazing work in Charlotte. 🥲💜",
    "242": "@antjams @hornets Yeah but they didn’t send giannis to the gleague all the time",
    "243": "The NBA fined Cleveland (@cavs) coach J.B. Bickerstaff $20,000 on Friday for the outburst that saw him tossed from the Cavaliers' loss to the Charlotte Hornets on Wednesday. #NBA | via @AFP\nhttps://t.co/kA18SanYy0",
    "244": "@hornets @greensboroswarm Good at least he can actually play some basketball…",
    "245": "@banslovesmom @hornets Right I forgot what the Milwaukee done with Giannis his first two seasons to get better his first couple of seasons were horrible with him been so tall and skinny.",
    "246": "@protectedpick The Charlotte Hornets https://t.co/WjikJoAedP",
    "247": "@hornets stop sending him to the gleague https://t.co/Dj2FvmgWUF",
    "248": "@alyssakeiko Muggy Bogues (5'3) and Gerald Wallace (6'7) are 1 and 2 in steals for the Charlotte Hornets according to a quick Google search",
    "249": "Charlotte Hornets lineup in 3 years:\nPG - LaMelo Ball\nSG - James Bouknight\nSF - JT Thor\nPF - Miles Bridges\nC - Kai Jones\n+ Future 1st rounders.\n#AllFly",
    "250": "Hawks-Hornets is the perfect 9-10 play-in game, especially if it's in Charlotte.",
    "251": "Check out this listing I just added to my #Poshmark closet: Charlotte Hornets NBA Hat New Era One Size. https://t.co/btz8jVg3F9 #shopmycloset @poshmarkapp",
    "252": "#ATL passed #CLT house divide #TopTen #NBATwitter \n#AtlantaHawks ninth spot \n#CharlotteHornets 🤷🏾‍♂️",
    "253": "@DonCornelius70 @unccharlotte @hornets @Panthers @CharlotteFC @queensfirm &amp; I was still a baby at my parents’ house.",
    "254": "Charlotte hornets are officially the 10th seed.",
    "255": "@pulte goin 2 the Charlotte hornets v spurs game tomorrow night!",
    "256": "The @chicagobulls and @hornets have the best broadcasters in sports! I hate getting stuck listening to anyone else when I’m watching either of my teams.",
    "257": "@Nikki98388797 @Canes Canes had held good attendance up until 2014 when UNC and Duke got really good, Charlotte is just based on the seasons. Hornets are 15th in NBA this year, 28th in 2020",
    "258": ".@SamFarberLive dropped by the @ClubhouseKB as he looked at how important tomorrow is for the @hornets to get a W at home, and what might be behind some of LaMelo's recent struggles with foul trouble.\n\nListen Here: https://t.co/eruZgZ3n1R",
    "259": "Tomorrow night will feature:\n\nCharlotte Hornets home game vs. San Antonio Spurs (Isaiah Thomas’ first home game with the Hornets) \n\nFirst ever home match for Charlotte FC\n\nCoach K’s final home game at Duke vs. UNC \n\nQuite a weekend of sports in the Old North State",
    "260": "@svall_18 @hornets What happened the rest of the game then?",
    "261": "I just started out @unccharlotte (Fall 1988) when the @hornets began and saw the start of the expansion bid for the @panthers from start to finish (Fall 1995)  . . Now I get to see the QCs 3rd pro team make its home debut @charlottefc 😎😎 !! @queensfirm\nhttps://t.co/St1yApnInJ https://t.co/8w7OBs2zqG",
    "262": "@guypostings @hornets JB got himself tossed as a way to say “welp, not giving me what I’m asking for, so have fun getting whooped”",
    "263": "We needed that ass beating. Thank u @hornets",
    "264": "Make your ride to the @hornets vs the @spurs tomorrow night smooth sailing by choosing #I77 Express. Take a quick look to see how easy it is to transform your travels - https://t.co/lRgQQwLKQt #NBA #clt #hornets #spurs #clttraffic",
    "265": ".@hornets @MELOD1P getting fancy at the rim 🔥 Lets see what you got #JrNBA ‼ https://t.co/GrxtjsRFv2"
}