{
    "0": "@celtics Dennis should be replaced by Pritchard have him come off the bench 🤦‍♂️",
    "1": "@celtics It’s his city. https://t.co/MmhUDXgIkU",
    "2": "@celtics come on boston !! today we have to win !!\nforce from spain !!",
    "3": "@ArtCovUnion247 @celtics So u don’t like him cuz he is hurt often? Mad at someone for something uncontrollable? Makes sense",
    "4": "@ArtCovUnion247 @alex______0 @celtics you should also be aware of your horrible takes .",
    "5": "Boston Celtics - Orlando Magic\n\nBet slip link: https://t.co/DrRCCmtrrz https://t.co/e0zDum5OFh",
    "6": "@yummyceltics @alex______0 @celtics I’m aware he’s out in very happy",
    "7": "@alex______0 @ArtCovUnion247 @celtics I think he’ll be joyful when he finds out Romeo out tonight lol..",
    "8": "@LucasSarrasin @DHendersonCO @LordBrOFFICIAL @BryenJ_5 @celtics I did not",
    "9": "@SnottieDrippen @celtics Lol beat us for all I care",
    "10": "@alex______0 @celtics No. Constant talk about potential and never able to put it together longterm and constantly injured.",
    "11": "@ArtCovUnion247 @DHendersonCO @LordBrOFFICIAL @BryenJ_5 @celtics acted like i did",
    "12": "Boston Celtics - Orlando Magic\n\nBet slip link: https://t.co/Qm3TPtJf0b https://t.co/f7eSuvdCcT",
    "13": "@ArtCovUnion247 @celtics So a future 2x all star? Not bad",
    "14": "@LucasSarrasin @DHendersonCO @LordBrOFFICIAL @BryenJ_5 @celtics Did I say you did?",
    "15": "@ArtCovUnion247 @DHendersonCO @LordBrOFFICIAL @BryenJ_5 @celtics not me who brought Bird to the conversation",
    "16": "Alright @celtics let's take care of the Magic tonight (preferably in convincing blowout fashion) and give me a New England Sports Sweep. @Patriots @NHLBruins #BleedGreen #NHLBruins #ForeverNE",
    "17": "🏀🏀🏈Parlay 1U\n\nBoston Celtics Ohio State Packers MLP (-155)\n\nNBA CBB NFL",
    "18": "@alex______0 @celtics Great on ball defender. Not a great team defender, constantly falls asleep, seems to never be active. He’s the clay bucholz of the Celtics",
    "19": "@celtics let’s go☘️☘️☘️",
    "20": "@ArtCovUnion247 @celtics Obviously you don’t watch the games, he plays great defense",
    "21": "@celtics you have big shoes to fill. @NHLBruins &amp; @Patriots put in work today.",
    "22": "@LucasSarrasin @DHendersonCO @LordBrOFFICIAL @BryenJ_5 @celtics Tatum can’t even tie Birds shoes. Tatum is a fine player but it’s unfair to the kid to even put him in that conversation. Bird had heart, toughness and brought culture to the Celtics.",
    "23": "For the Love of all that's holy, please don't embarrass me today @celtics",
    "24": "@DHendersonCO @ArtCovUnion247 @LordBrOFFICIAL @BryenJ_5 @celtics he was a rookie ;)",
    "25": "@alex______0 @celtics 1 good game out of every 15 he plays in",
    "26": "Urgh how the hell did Robert Williams get hurt after Friday? Are you kidding me with these ticky tak injuries? @celtics",
    "27": "@ArtCovUnion247 @celtics Romeo had 16 points on Friday bozo",
    "28": "@BadNewsBarton_ @celtics I don’t think he has given that that’s now how he’s starting the game 😃",
    "29": "@celtics Drats!  No Williams and No Tatum :(",
    "30": "@maha_med1 @celtics Cause he’s ass😂",
    "31": "The @Celtics starting Schroder, Smart, Brown, G. Williams, Horford on Sunday. #Celtics #NBA",
    "32": "@celtics Why not start Josh Richardson instead of dennis 🤔",
    "33": "@celtics Surely ime has realised it is better to have smart starting pg and Dennis coming off the bench",
    "34": "@llockmade @celtics Wasted pick",
    "35": "@Pxaull_ @celtics Thank god to Romeo, that’s unfortunate to Rob",
    "36": "@TheGoatedMan @celtics Thank god",
    "37": "@celtics why is pritchard on the bench?",
    "38": "@ArtCovUnion247 @celtics dude he is out for today with rob",
    "39": "@LucasSarrasin @ArtCovUnion247 @LordBrOFFICIAL @BryenJ_5 @celtics Go look up Bird at 23.",
    "40": "@ArtCovUnion247 @celtics Romeo out tonight",
    "41": "@ArtCovUnion247 @celtics look for a job",
    "42": "@ArtCovUnion247 @celtics romeo’s out like always",
    "43": "@celtics Schroder back 💪🏾",
    "44": "🏀 Boston Celtics vs Orlando Magic\n🏆 NBA\n🗓 02/ene.\n⏰ 20:00\n📺 NBA TV",
    "45": "@celtics Why are we starting Schroeder over Payton",
    "46": "@celtics Lucky it’s the magic",
    "47": "@Carter33699732 @_UnitedOpinion @celtics Yea well end up losing and giving up 30 points to their worst player",
    "48": "@celtics Schroder and Smart that’s surely gonna work",
    "49": "Tonight’s starting 5️⃣ https://t.co/23S7dJXMEX",
    "50": "Boston Celtics Starters:\n\nMarcus Smart\nDennis Schroder\nJaylen Brown\nGrant Williams\nAl Horford\n\nPlayers out:\nEnes Freedom\nRomeo Langford\nAaron Nesmith\nJayson Tatum\nBrodric Thomas\nRobert Williams\n#BleedGreen #NBA #NBATwitter #NBA75",
    "51": "Anyone at @celtics game tn? https://t.co/ChyiiXCNfe",
    "52": "@JohnnyH004 @Romans6_11 @celtics Lmao, you must be out of your mind. Tatum is way behind if you compare this two’s accomplishments. https://t.co/qMKtQH4BSs",
    "53": "2022 Resolution:  “Slay the Bucket List!” Celtics warm-up Live from TD Garden!  #Boston! Celtics vs Orlando! ✅ @ Boston Celtics https://t.co/938fHX41Xf",
    "54": "@ThomasB22809527 @_UnitedOpinion @celtics Tbh I doubt it. I have no hope for this team anymore",
    "55": "@LucasSarrasin @LordBrOFFICIAL @DHendersonCO @BryenJ_5 @celtics I hope, but in my opinion when you pay a guy like one of the greats he’s gotta perform like one",
    "56": "@LordBrOFFICIAL @ArtCovUnion247 @celtics I appreciate this tweet. You are far to kind sit! 😂",
    "57": "@_UnitedOpinion @Carter33699732 @celtics We still gonna win",
    "58": "@ArtCovUnion247 @LordBrOFFICIAL @DHendersonCO @BryenJ_5 @celtics dude u comparing a 23years old Tatum to some of the greatest of the game, give him time he’ll prove u wrong",
    "59": "@celtics How the hell can you sprain your big toe?",
    "60": "@celtics Dang it",
    "61": "Tonight's starting lineup for the Boston Celtics: Schroder, Smart, Brown, Grant Williams, Horford https://t.co/bVWH4AMCA2",
    "62": "Boston Celtics: 3 Rajon Rondo type players to pursue in a trade https://t.co/pTabWP3UuW",
    "63": "Orlando Magic\n@ Boston Celtics\nSun 6:00 PM EST\n\n🏀 Bet of the Game 🏀\n\n🟡 ORL ML +410",
    "64": "Penn State up 8 on Indiana. Mike Woodson not only coach with NBA ties, new Penn State coach Micah Shrewsberry coached with Brad Stevens on Boston Celtics.",
    "65": "@ArtCovUnion247 @LordBrOFFICIAL @BryenJ_5 @celtics When you have no ExCeltics in the organization, maybe that's why.\n\nAll I know is if the cut and move like last game and win by 20 and then Tatum comes back and we're back to slow down iso brick ball, then we will have a data point on the prob\n\nUnder 500 everything is on the table",
    "66": "(Boston) Celtics\n(Scotland) Celtics\n(Ireland) Celtics\n\nPeople are just starting to catch on -- to the Title.",
    "67": "@celtics Damn i wanted @jaytatum0 and Robert Williams to play",
    "68": "@DHendersonCO @LordBrOFFICIAL @BryenJ_5 @celtics These kids are too young. They probably barely remember 08, let alone back in the day when the Celtics were NBA royalty. Unfortunately that is no longer the expectation and the standard in Boston anymore.",
    "69": "@celtics I sure hope Larry Legend never reads this. Lower back pain? Bird couldn’t even sit on the bench. Big toe sprain?? Bird broke his face in Indiana playoff game and played. This team complains about people being out your “best player” (JT) has to recondition. 🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡",
    "70": "@LordBrOFFICIAL @BryenJ_5 @ArtCovUnion247 @celtics He's not THE PROBLEM.\n\nBut he is certainly PART of the problem.  That's undeniable.  \n\nBasketball is team sport.  Well it use to be in Boston anyway....",
    "71": "@celtics Dennis is back! He's gonna hog the ball for even longer now that JT is out",
    "72": "@SkyBet do you know why you cannot bet on the Boston Celtics match ?",
    "73": "@King46706884 @celtics Lakers fan 😭",
    "74": "@LordBrOFFICIAL @DHendersonCO @BryenJ_5 @celtics The great ones have found ways to make it happen. Lebron, Giannis, KD. Having one of those guys is essentially a gaurentee top 3 seed regardless of who’s around them. Tatum can’t do that",
    "75": "@PhillipM113 @celtics Off-Season",
    "76": "@DHendersonCO @BryenJ_5 @LordBrOFFICIAL @celtics Facts, did we win the championship in any of those years? No. Failed seasons.",
    "77": "@DHendersonCO @BryenJ_5 @ArtCovUnion247 @celtics Tatum not the problem, its the team as a whole, our bench is not deep at all, and nobody can contribute if tatum or brown have a bad night💀",
    "78": "@DHendersonCO @BryenJ_5 @LordBrOFFICIAL @celtics He just doesn’t have the mentality of the great ones. Watch KD and Lebron, they just take over games differently. Tatum doesn’t have that.",
    "79": "@BryenJ_5 @ArtCovUnion247 @LordBrOFFICIAL @celtics Forget other seasons... what about this year?",
    "80": "@BryenJ_5 @DHendersonCO @LordBrOFFICIAL @celtics What are they since the beginning of 2020?",
    "81": "@BryenJ_5 @LordBrOFFICIAL @ArtCovUnion247 @celtics How many game winners this year?\n\nHow many take over in the 4thQ and win games for us this year?\n\nAgain... just saying.\n\nThat's what the great ones do....even on a bad team.",
    "82": "@LordBrOFFICIAL @BryenJ_5 @DHendersonCO @celtics Are they an above 500 team when Tatum plays? I don’t know I’m genuinely curious",
    "83": "@ArtCovUnion247 @BryenJ_5 @DHendersonCO @celtics Nothing💀 we fasho aint shit when brown has to lead",
    "84": "@BryenJ_5 @DHendersonCO @LordBrOFFICIAL @celtics Well, then what is it?",
    "85": "@ArtCovUnion247 @LordBrOFFICIAL @celtics I think he is an incredible talent...unbelievable skills. \n\nDoes he make players around him better or worse?  That's the big question.",
    "86": "@BryenJ_5 @DHendersonCO @LordBrOFFICIAL @celtics What are they with Tatum?",
    "87": "@LordBrOFFICIAL @DHendersonCO @celtics “I have no response to your logical argument so I’m going to spam emojis so it seems like I’m right”",
    "88": "Boston Celtics: HH talks Russell Westbrook for Al Horford/Josh Richardson deal – NBA News https://t.co/oQ2tuRcwhY",
    "89": "@DHendersonCO @LordBrOFFICIAL @celtics Agreed. I do think he could be a great player but he definitely needs to humble himself a bit. I think he’d be deadly as the #2 option on a team but he’s too selfish to be the main guy",
    "90": "@LordBrOFFICIAL @ArtCovUnion247 @celtics Excuse me...Clippers game was without Smart.\n\nDude we are an under 500 basketball team for the last 100 games (almost all) with Tatum playing.\n\nCould he be the problem? Slows the game down, Iso ball, many bad shots.... just saying.\n\nHe needs to lose the Kobe bullshit...",
    "91": "@mr52pickup Boston Celtics Flash Challenge\n\nEasy - Beat the Orlando Magic in Basketball\n\nHard - Also Beat the Orlando Magic in Basketball",
    "92": "Let’s go @celtics https://t.co/gTvgPlTUC9",
    "93": "Boston Celtics do what you're supposed to and beat bad teams challenge. https://t.co/sprmwN8Xnj",
    "94": "@ArtCovUnion247 @celtics only if its against the orlando magic",
    "95": "@DHendersonCO @ArtCovUnion247 @celtics Did u delete the clippers game off yo brain",
    "96": "@RedSoxHRCart @celtics You like watching selfish inefficient basketball?",
    "97": "@ArtCovUnion247 @LordBrOFFICIAL @celtics He makes a valid point.  Now we get to see if the problem is Tatum.  Timberwolves game was without Smart, FYI.   \n\nBut they beat the Suns easily with Smart back and Tatum out.  They also cut, moved without the ball, assisted, and played D.\n\nSo now we'll see... if that continues",
    "98": "@ArtCovUnion247 @celtics wow you're weirder than I thought",
    "99": "Boston Celtics 6 card lot!\n\n$10 \n\nShipping details are on my pinned tweet #TTSCards https://t.co/0okoD24RJP",
    "100": "@stellarct @BrownOfJaylen @LordBrOFFICIAL @celtics Smart is the heart and soul of the team. Just wish he was a more efficient player",
    "101": "@LostReach_ @celtics i cant take it",
    "102": "@greenbean3742 @jusscali @celtics They will play longer than 3 games without being hurt! \"The best ability is availability\"",
    "103": "@celtics @John_Zannis why does rob always play amazing and then get hurt it can’t be a coincidence right ?",
    "104": "@BrownOfJaylen @ArtCovUnion247 @LordBrOFFICIAL @celtics You mean without Tatum AND Smart? But when Smart is back we play beautifully?",
    "105": "@ThomasB22809527 @Carter33699732 @celtics Well we’re ab to find out since we have neither",
    "106": "@celtics y’all give this mans 1 shot and was like yea that’s it????? Dumb as HELL https://t.co/fRO7S86BTT",
    "107": "@BobbyDSixers @celtics ratio",
    "108": "@celtics Thank god",
    "109": "Consensus Line Move:\n2022-01-02 Orlando Magic at Boston Celtics from 215.50 to 214.50\nUnder market flood\n#NBA #handicapper #ml #wallstreet",
    "110": "Consensus Line Move:\n2022-01-02 Orlando Magic at Boston Celtics from -11.00 to -10.00\n#MagicTogether sharps say\n#NBA #sports #data #cash",
    "111": "GAME #38\n\nTrying to start the New Year off right with the @OrlandoMagic taking on the @celtics in Boston!\n\nPregame starts at 5:30 PM with @JakeChapmanOM with tip off set for 6 PM on @969thegame https://t.co/qc08hJLwWQ",
    "112": "@jusscali @greenbean3742 @celtics Need to sell high on Rob so fast man",
    "113": "@ArtCovUnion247 @celtics thats it, thats what you should have the doctor scan for",
    "114": "@redsoxandstuff @celtics As serious as a brain tumor.",
    "115": "@celtics Finally some good news! Dennis Schröder is the key for today’s win!",
    "116": "@ArtCovUnion247 @LordBrOFFICIAL @celtics we definitely watched real basketball vs the suns and wolves",
    "117": "@ArtCovUnion247 @celtics I actually cant tell if your serious or not",
    "118": "“His shooting ability and what he does defensively, he covers a lot of holes for us.” - @celtics Head Coach Ime Udoka on @Grant2Will. #ImeUdoka #GrantWilliams #bostonceltics #celtics #bostonathlete #boston #NBA75 #NBA #basketball #BleedGreen #goceltics #bostonathletemagazine",
    "119": "@celtics Is it just or RW III just can't help himself but catching injuries left and right? Like bro plays a good game and next thing you know he's out with some kind of sprain that even he doesn't know where got that",
    "120": "@celtics No way",
    "121": "@CodyBC0329 @celtics Thank you so very much!!! That is so cool teaching your children basketball history...thank you truly!!! ❤❤❤❤🙏",
    "122": "@LondonSlammer @LordBrOFFICIAL @ArtCovUnion247 @celtics Lmaoo",
    "123": "@redsoxandstuff @celtics Watch how much better they’d get if they were to trade Tatum for his worth. Did it in 2k a few times and it always makes them better.",
    "124": "@celtics Let @jaytatum0 rest! He’s been playing a lot and carrying the load.",
    "125": "@celtics Everytime I get enthusiastic about Robert Williams he is on the injury report the next game Discouraging",
    "126": "@celtics Timelord trip dubbed and is now exhausted",
    "127": "@celtics Tatum please play Wednesday",
    "128": "@fredsterv2 @celtics - Famous last words",
    "129": "@LordBrOFFICIAL @ArtCovUnion247 @celtics Mf would be unstoppable then 😭",
    "130": "@ArtCovUnion247 @celtics u a grown ass man mature a bit",
    "131": "@ArtCovUnion247 @celtics this fanbase is so pathetic lmfao",
    "132": "@LordBrOFFICIAL @celtics How am I hating? We get to watch real basketball as opposed to constant contested step backs",
    "133": "@celtics @J_Rich1 get em on your back tonight",
    "134": "@jamesouttapkttt @celtics You agree??",
    "135": "@ArtCovUnion247 @celtics Why dont u put this effort u put on hating into a Job or something",
    "136": "@celtics oof but its the magic we should be fine",
    "137": "@fredsterv2 @celtics but with tatum and rob it would be great lineup",
    "138": "@celtics Fuck man…",
    "139": "@celtics pain",
    "140": "@celtics not the type of content I like to see, though",
    "141": "@celtics Myself - AVAILABLE. Put me in coach 😈",
    "142": "@celtics it’s the magic, we should win anyway",
    "143": "@celtics Thank god no Tatum",
    "144": "@celtics pain",
    "145": "@celtics pain",
    "146": "@celtics The dribble guy is back",
    "147": "@celtics Pain",
    "148": "#NEBHInjuryReport update:\n\nDennis Schroder - AVAILABLE\nJayson Tatum (return to competition reconditioning) - OUT\nBrodric Thomas (low back pain) - OUT\nRobert Williams (right big toe sprain) - OUT",
    "149": "@Jim22Palmer @celtics Thank you so much, Sir! Uncle Sam will be missed. 💚🙏🍀",
    "150": "Check out 2020 Aaron Nesmith Red, White &amp; Blue Prizm Boston Celtics #282 Pack Fresh!  https://t.co/0J5LeY98Cc via @eBay",
    "151": "@JaylenTatum0 @celtics @Marc_DAmico these could be symptoms of the third dose of the vaccine",
    "152": "@celtics Yea.. keep relying on G.Williams.. wonder why team is under .500…???",
    "153": "Boston Celtics News - @yeahyeah22 is out for tonight's game due to a non-COVID illness. #RomeoLangford #bostonceltics #celtics #bostonathlete #boston #bostonsports #basketball #NBA75 #NBA #bostonathletemagazine",
    "154": "@flocajne @Dan_Savage @OrlandoMagic @celtics And his mom",
    "155": "@celtics Udokas' problem is this is still his bosses' team.",
    "156": "@celtics Not like him to miss a game.  He’d the Cal Ripken of hoop",
    "157": "@Dan_Savage @OrlandoMagic @celtics Mo Bamba! Is back",
    "158": "Sunday Parlay #2\n\nBoston Celtics ML\nOhio State ML (CBB)\nGreen Bay Packers ML\nLos Angeles Lakers ML\n\nPlacing 2u on this @ +104 odds\n\n#GamblingTwitter https://t.co/NtpuVyKziS",
    "159": "@magicscotti @Dan_Savage @OrlandoMagic @celtics I have him worse than Duhon on my Magic PGs",
    "160": "@celtics 45% from three btw",
    "161": "@celtics he's a beast in the post too",
    "162": "@ThomasB22809527 @_UnitedOpinion @celtics Damn near Brody",
    "163": "@TheGoatedMan @celtics You’re definitley white",
    "164": "@ryanparent121 @jaytatum0 @celtics I did not, I asked for tickets",
    "165": "Learn more about the legacy of the late Boston Celtics &amp; North Carolina Central University Legend Sam Jones. Jones died December 30, 2021 at the age of 88. #NCCU #HBCU  #BostonCeltics #Army #NBA #Basketball #HallOfFame #Champion 🏀🍀 🏆🏆🏆🏆🏆🏆🏆🏆🏆🏆\n https://t.co/Oj1vwm0UxH https://t.co/EFOOgtQacw",
    "166": "The @OrlandoMagic will start Tim Frazier, Gary Harris, Franz Wagner, Wendell Carter Jr. and Mo Bamba against the @Celtics tonight.",
    "167": "@dyonthecrayon @celtics Lol this received a laugh aloud.",
    "168": "@Carter33699732 @_UnitedOpinion @celtics fax but  were worse than the  magic?",
    "169": "@celtics The greatest shooter ever.",
    "170": "@celtics That’s my boy @Grant2Will #VFL",
    "171": "@ThomasB22809527 @_UnitedOpinion @celtics My guy. WE SUCK",
    "172": "@celtics Celtics gonna have 18 players on the bench",
    "173": "@mrjirkdake @flovatar You a Boston Celtics fan? With 1 more you could create a first five.",
    "174": "@celtics Trap game.",
    "175": "Coach Udoka says of Grant Williams: “His shooting ability and what he does defensively, he covers a lot of holes for us.”",
    "176": "@celtics Jayson better play",
    "177": "@celtics just call him rob lmao",
    "178": "@celtics play all of them",
    "179": "#NEBHInjuryReport update: Jayson, Dennis, and Robert will each go through pregame workouts and will be game-time decisions, per Coach Udoka.\nhttps://t.co/zJLZXgjP5X",
    "180": "@T_Kmino -Barsa\n-Saints\n-Patriots\n-Athletic\n-Boston Celtics",
    "181": "Let's get the #BostonSports trifecta wins! @Patriots win ☑️ @NHLBruins win ☑️, your turn to get a W, @Celtics! #BleedGreen!!! https://t.co/JBkPSFfQcM",
    "182": "4 Fewer Wins &amp;amp; We Would Have the 4th Worst Record in the League https://t.co/JiiAYC6vAT #celticsstrong #nba #bostonceltics",
    "183": "@celtics Is he actually sick or is something else going on outside of work?",
    "184": "@celtics what abt tatum",
    "185": "@celtics He can borrow my immune system",
    "186": "@celtics same as the last one",
    "187": "@celtics Fans (fed up, don’t care) - OUT",
    "188": "@celtics Take my immune system",
    "189": "@celtics @Marc_DAmico why does he have an illness every other week",
    "190": "@LeJobless6 @celtics @OrlandoMagic @NBCSBoston @1057WROR me. i wanna join a celtics group chat",
    "191": "@celtics High on edibles",
    "192": "@celtics This nigga Romeo made of glass wtf",
    "193": "@celtics Bust",
    "194": "@celtics Just great",
    "195": "@celtics romeo has one of the worst immune systems in the league...",
    "196": "@celtics Noooooo!!!Is TaGOAT playing?",
    "197": "#NEBHInjuryReport update:\n\nRomeo Langford (illness, non-COVID) - OUT",
    "198": "Boston Celtics Predictions and Preview for 1/2/2022 hosts Orlando Magic.  Looking for betting action?  Find out if there is any value in our preview. #NBATwitter #NBA https://t.co/iSxJIhN1ZT",
    "199": "\"Jared Sullinger's goofy interview after blowing out Sacramento\"\n\nhttps://t.co/opWzBN5V4j\n\n[via r/bostonceltics Jan 02, 2015 #Celtics]",
    "200": "@dad_supa @reginaldpain3 @jaytatum0 @celtics Ok well I’m not going to argue with faucci or you but all I’m gonna say is everyone is different",
    "201": "Avis matchs #NBA75  🇺🇸📍\n\nMiami Heat ➡️ 1.61 \nBoston Celtics ➡️ 1.12 \nCleveland Cavaliers ➡️ 1.67 \nPhenix Suns ➡️ 1.71 \nMavericks ➡️ 1.20 \nLakers ➡️ 1.28 \n\n#TeamParieur \nGood luck ! 🍀💸 https://t.co/9lktBkc6WU",
    "202": "3 Boston Celtics most likely to be moved by the trade deadline – NBA News https://t.co/Y2qF0Gsm6s",
    "203": "@Becoming_Bryna @celtics I just saw this, but your dad, and Sam Jones, are a piece of history. I’m sorry for your loss. I love the Celtics, and I teach my kids them the history of the Celtics as I do with America. May your pops Rest Peacefully!",
    "204": "Marcus Smart for Christian Wood @celtics 👀",
    "205": "@celtics A new year of pain.",
    "206": "NBA Basketball Game Betting Picks Simulator: 6:00 PM ET - Orlando Magic vs. Boston Celtics - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/xjw7XD81RP #nba #sportsbetting #freepicks #cappertek",
    "207": "Orlando Magic visits Boston Celtics Predictions and Preview for 1/2/2022 today.  Who are we taking in this game?  Find out now. #NBATwitter #NBA https://t.co/iSxJIhN1ZT",
    "208": "B’s and Pats both winning big. Don’t fuck it up @celtics",
    "209": "New B/R analysis highlights four trade targets to add shooting to the Boston Celtics #YahooSports #NBA https://t.co/DRsP4FyBdg",
    "210": "@_Rzayp @celtics Thank youuu",
    "211": "@celtics Let's hope it's not another new year of mediocrity. Make some changes before the deadline, this team needs proper big men and a bench",
    "212": "3  Interception lets go I wish @celtics could turn there shit around lmao",
    "213": "On this date in 1971 the @Lakers defeated the Boston Celtics 122-113 for their 31st of a record setting 33 consecutive victories",
    "214": "Hoje : NBA 2021/2022\n20:00 Boston Celtics x Orlando Magic / Canal 1\n20:00 Sacramento Kings x Miami Heat / Canal 2",
    "215": "New B/R analysis highlights four trade targets to add shooting to the Boston Celtics https://t.co/PhCXTstjk0",
    "216": "PARLEY 02/'01/2022\nNBA\n🏀💪🤑\nMiami Heat 02/01/2022 NBA Baloncesto : -3.5 -114\nNew York Knicks / Toronto Raptors: B 206.5 -109 \nLos Angeles Lakers: -7.5 -110 \nBoston Celtics: -8.5 -179\nIndiana Pacers / Cleveland Cavaliers: A 210.5 -106",
    "217": "@penarroyo @celtics Maybe he is out for “smart” reasons? 😂",
    "218": "@celtics Will tatum be back today?",
    "219": "Check out 2010/11 Upper Deck Greats of the Game Bill Russell Auto /10 #BostonCeltics https://t.co/kk00eLSUyq via @eBay",
    "220": "@tdgarden @celtics does anyone know if they do on site testing? there was 0 available tasting times all of december for this thing",
    "221": "@rob_williamsIII @celtics how is your toe? are you playing today? I need to set my fantasy lineup before 3:30 pm. Please let me know",
    "222": "Attending the @celtics game tonight?\n\n✔️ Proof of vaccination OR qualifying negative COVID-19 test is required for all guests 12 years and older. \n✔️ Masks are required for all guests 2 years and older.\n✔️ Have your mobile ticket ready. \n\nMore info: https://t.co/hWOT5KtSDr https://t.co/iee2y0oJnt",
    "223": "Back BOSTON CELTICS to BEAT Orlando Magic tonight in the @NBA (Game Starts at 23.10 GMT) #NBA #Basketball",
    "224": "Going to watch this @celtics game tonight. new year new faith. 🍀",
    "225": "@celtics @DrHoodieMaddog turning point starts now.",
    "226": "🔮 NBA Score Predictions for January 2\n@celtics 92, @OrlandoMagic 91\n@hornets 111, @Suns 110\n@cavs 99, @Pacers 93\n https://t.co/k4qTkmFCW4",
    "227": "@ShamsCharania The best punishment for Christian Wood is to trade him to a faltering team like the @celtics for Bruno Fernando and a 2nd Round pick. He will definitely learn his lesson. https://t.co/WWTzrT16AV",
    "228": "New tumblr post: \"#NBA2K22 Boston Celtics vs. Toronto Raptors MyLeague PS4 GAMES...\" https://t.co/UaokUjvksO ifttt, youtube",
    "229": "@GilletteStadium The food court at the Boston Garden before the @Celtics game tonight!!",
    "230": "@celtics Idc. Please win and the Patriots and Bruins are on right now",
    "231": "@celtics With a Celtic's win. #BleedGreen",
    "232": "@BobbyDSixers @celtics @NBCSBoston I don’t think the Celtics will ever trade brown away for Simmons",
    "233": "@celtics timelord triple double number 2 today",
    "234": "@celtics more grant post ups tbh",
    "235": "@celtics pla don’t choke no more🙏🏼",
    "236": "@celtics Can’t believe I haven’t been to a game since last year! 😏",
    "237": "@celtics stop",
    "238": "@celtics Let’s turn this season around PLEASE",
    "239": "@celtics Undefeated this year 💪🏼",
    "240": "@celtics Idc just win",
    "241": "A new year of basketball starts today  📼☘️🎊 https://t.co/WM6mD2UXlX",
    "242": "[LIVE] 2022 NBA Boston Celtics vs Orlando Magic | Watch Live HD : https://t.co/JkfL12gPft | Sunday Jan 02, 2022 | 18:00 | Basketball | NBA | Orlando Magic | Boston Celtics | Orlando Magic vs Boston Celtics NBA LIVE 2022 https://t.co/XlKRtidjsL",
    "243": "@mikeob59 @jaytatum0 @celtics Did you congratulate T, when he became a d-line coach for Umass? Of course you did it is an accomplishment of your friend, that is what he did.",
    "244": "@celtics i need another dub today I would gladly appreciate that",
    "245": "Long losing streak for Lions, Patriots, Bees, Celtics, Liverpool, Michigan ends with 2022 win by @BrentfordFC v @AVFC\nNow hoping for wins @LFC @Patriots &amp; @Celtics later today\n#YNWA\n#Beelieve\n#GoPats\n#GoCeltics",
    "246": "@ryanparent121 @jaytatum0 @celtics Congrats on being the second all time leading scorer in wizards history. #whocares",
    "247": "@BOOKBETTER7 @JuanTAtheGoat @pay_or_stay @antonin_org @celtics Lmao you watch too much anime",
    "248": "NBA Betting Preview and free play: Boston Celtics vs. Orlando Magic https://t.co/IYnLpwfFKl",
    "249": "@celtics who they playing?",
    "250": "@HoopsRumors @celtics PLEASE 🙏",
    "251": "BRAD THIS WOULD BE HUGE FOR US !!! If you could finagle those too!!!! @celtics @BCCoachStevens  #Celtics https://t.co/BHy5N3Velc",
    "252": "Celtics will b good if u have brown get 5 assist 7 boards an 25 an Tatum his normal score with also 6-7 passes an 10 board an Celtics defense @celtics",
    "253": "@ShamsCharania @TheAthletic @Stadium Boston Celtics legend",
    "254": "Check out 2020 Payton Pritchard Green Prizm Draft Picks Boston Celtics #36 Pack Fresh!  https://t.co/Qvf0NpcqyC via @eBay",
    "255": "Just heard @Hasselbeck describe the Rams as not having a chemistry issue, but an identity issue\nAnd for me, that perfectly describes the Boston Celtics\n\nAlmost halfway through the season and I don’t know what kind of team they want to be, and I think that may be their big issue",
    "256": "@mikeob59 @jaytatum0 @celtics He is recognizing his oldest and closest friend. Stop trying to create drama",
    "257": "Analyzing Sunday’s Orlando Magic at Boston Celtics odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/EFiec4ahqT",
    "258": "Boston Bruins, Boston Celtics and New England Patriots play today and they all better win. #LFG",
    "259": "Orlando Magic vs. Boston Celtics - 1/2/2022 Free Pick &amp; NBA Betting Prediction https://t.co/BTQkrzEgXh\n.\n#Betting #FreePicks https://t.co/k19ySCNNtO",
    "260": "@Becoming_Bryna @PeterVecsey1 -- 1984 - The White House Rose Garden - The NBA World Champion Boston Celtics - President Reagan ---- https://t.co/SQaoM0rq5c",
    "261": "The Boston Celtics play tonight.",
    "262": "This is why @jaytatum0 will never be elite, he cares about this BS way too much. He would rather score a bunch of points and never make the playoffs. I hope he changes but I don’t think he will. #celtics #NBA @celtics https://t.co/xYI0QMuRA6",
    "263": "@celtics @OrlandoMagic @NBCSBoston @1057WROR 2 in  row?",
    "264": "@BobbyDSixers @celtics @NBCSBoston Congratulations you've posted the dumbest thing I've seen today!!! 🎉🎉🎉",
    "265": "🚨🚨🚨🚨🚨 \n\nI’m selling Knicks tickets for Thursday January 6. \n\nBoston Celtics vs New York Knicks \n\nSection: 217 (picture above will be your view) \n\nTickets are currently selling for $80 per ticket on seatgeek I’m selling for cheaper \n\n#Knicks #NewYorkForever https://t.co/mkK0HuIKyG",
    "266": "@celtics The legendary Sam Jones made his final infamous bank shot!  \n\nGreat American player, fellow HBCU Graduate of North Carolina Central University and our member of Kappa Alpha Psi Fraternity...oh yeah, he was my home boy (NC)!",
    "267": "@brucejuice18 @celtics Ooh no not upset at all..soo happy you shared it!!! \n\nJust showing you the depth of Dad's heart!! ❤❤❤",
    "268": "@realStanVG My @celtics are going for the other record.  4-42 the other night. https://t.co/fbfUhLHys5",
    "269": "@Becoming_Bryna @celtics Ty, sorry if my interaction with your dad upset you 😢, I was just letting you know how much just that little chat meant to me.",
    "270": "@celtics called it the same thing. Arthritis is not joke https://t.co/JEUefZuIfe",
    "271": "DeMar is 🥶❕\n\nIf Jaylen Brown’s ceiling is DeMar DeRozan would @celtics fans be upset? \n\nI, personally, would not be mad at all. https://t.co/Lt0yGwtIoY",
    "272": "Sam Jones, Hall of Fame shooting star of Boston Celtics dynasty, dies at 88 https://t.co/PPAzaTNnVb",
    "273": "@TheBostonBrit @OrlandoMagicUK @celtics @tdgarden @OrlandoMagic @NBA_UKfans @BallyMagic @mikeyclark87 @gera1nt @biffabacon439 @NBAUK Leading by 18 at the half to loose by 4. We know how this goes for the Celtics. Time and time again.",
    "274": "🔥Sunday🔥\n\n25*\n\nParlay (-102)\nNFL Los Angeles Rams -280\nNBA Toronto Raptors -350\nNBA Boston Celtics -750",
    "275": "@Timi_093 @celtics Brown needs to stay in his lane, 1st half players actively avoid passing him the ball and we play fantastic",
    "276": "@MrBeastBurner1 @celtics Hahahhah",
    "277": "The Boston Celtics play basketball today ☘️ https://t.co/XDpHREiDD2",
    "278": "@gatorhoops316 @OrlandoMagic @celtics @BallySportsFL @969thegame @RjHampton14 @Timfraz23 Celtics suck",
    "279": "@APB70 @cedricmaxwell81 @celtics Andre it disappoints me that we don’t celebrate the pioneers of the game enough. I heard about Sam Jones but it was street legend talk, never really saw him receive the credit for great he was. He played for one of the greatest college basketball coaches ever in John McClendon…",
    "280": "@celtics @OrlandoMagic @NBCSBoston @1057WROR Easy win hopefully",
    "281": "@JCDWorld @im_aumyrrh @celtics Consult this ratio",
    "282": "@celtics you host large events for vaccine and health",
    "283": "@BOBBYBUYCALLS @legacy_ricky @celtics @thebig3 @icecube Fantastic news thanks for the update Bobby!\n#YetiCoin",
    "284": "@celtics @OrlandoMagic @NBCSBoston @1057WROR Who wants to join a Celtics gc?",
    "285": "@celtics @OrlandoMagic @NBCSBoston @1057WROR @jaytatum0 attack the basket.",
    "286": "@celtics @OrlandoMagic @NBCSBoston @1057WROR Just win",
    "287": "TONIGHT ☘️ Celtics vs @OrlandoMagic \n\n⏰ 6PM\n📺 @NBCSBoston\n🎙 @1057WROR\nSmall Business of the Game: https://t.co/WYBW0VUnwV\n\n#BleedGreen https://t.co/dk8IohwfXd",
    "288": "@Becoming_Bryna @celtics He was a real soul man.  I hope you are doing well.  Ask for help if you struggle, no shame in that.",
    "289": "Sam Jones, Boston Celtics Great and HBCU Legend Died at 88 #NewsBreak https://t.co/KyxWZdF3t2",
    "290": "@celtics Me (Watching the Celtics game) Questionable",
    "291": "🏀🏀🔥🔥Ricky Davis is officially part of #YetiStrong \n\n👏👏AWESOME STUFF TEAM YETI!!! \n\nRicky is a former NBA scoring machine as well as NBA Slam Dunk contestant!  \n\nDex: https://t.co/9R4olXWrs7\n\n#MoveToEarn #YetiCoin #Crypto 🤯\n\n@legacy_ricky @celtics @thebig3 @icecube $YETIC https://t.co/nLy0uM0BcW",
    "292": "@hyypherr @celtics Can you say that if they don’t really give him a chance ?",
    "293": "@paulgp OTOH stirs good memories. “The only other player to win back-to-back games at the buzzer was Boston Celtics legend Larry Bird on January 27 and 29, 1985.” On a West coast swing as I recall.",
    "294": "@Timi_093 @celtics Literally all they need to do is cut more. Teams have picked up that they don’t cut and want to stand behind the line to shoot. They should be cutting everytime they pass the ball.",
    "295": "@OrlandoMagic @celtics @BallySportsFL @969thegame @RjHampton14 @Timfraz23 gg, from a Celtics fan.",
    "296": "Just been out playing basketball with my 2 to christen Niamhs @celtics shirt and ball. Niamh has loads more skill than me, Aidan is the same height as me now and I’m very unfit. Safe to say I’ve just been schooled 😂",
    "297": "🏀🏀🔥🔥Ricky Davis is officially part of #YetiStrong \n\n👏👏AWESOME STUFF TEAM YETI!!! \n\nRicky is a former NBA scoring machine as well as NBA Slam Dunk contestant!  \n\nDex: https://t.co/lmfkgo76s6\n\n#MoveToEarn #YetiCoin #Crypto 🤯\n\n@legacy_ricky @celtics @thebig3 @icecube $YETIC https://t.co/gQ4xDfSPTP",
    "298": "@celtics Take my immune system",
    "299": "@WashedClarkson @celtics i mean i think it’s a bit strange too but he did legally change his name, we should respect that",
    "300": "@Sedano @Bucks @celtics @DavePasch We haven’t forgotten @Sedano https://t.co/714DG6ZBtU",
    "301": "RIP @celtics great Sam Jones and NFL player and coach Dan Reeves https://t.co/etAuuqCkhT",
    "302": "@brucejuice18 @celtics Ironically Dad didn't talk at home either..he was quiet..I wanted the same thing..got it later in life. Thankful he opened up...I think that is one of the reasons Dad reached out to everyone...Dad had that in his heart.\n\nSending love to you...❤️❤️❤️",
    "303": "“Rest-in-Peace” - Sam Jones - HOF Shooting Guard for the Boston Celtics &amp; winner of TEN NBA Championships. The great hoops writer Bob Ryan on Sam:  https://t.co/M7z0rgCs97.  As a young Knicks fan, Jones &amp; the late Sixers Shooting Guard Hal Greer broke my heart over and over.",
    "304": "@Marmitez56 @celtics Put some respeckk on Schröder's name. He's been one of the more consistent Celtics this year. 🙌🏾",
    "305": "TONIGHT: @Celtics vs #Magic live from @tdgarden on @1057WROR! @NBA #NBA https://t.co/JHHwwKMUiK",
    "306": "Boston Celtics legend Sam Jones has died at age 88, according to the team.  https://t.co/KWMHS2PEMe",
    "307": "@_UnitedOpinion @celtics there playing the magic",
    "308": "@im_aumyrrh @celtics No of course not about health.. just OUT! I don’t like the rotations either and I think he should be getting more out of this team.. that 3 point shit by the brick layers is tough to watch (in replay when I am out of the country). I think they are a better team!",
    "309": "@WashedClarkson @celtics I mean legally it’s Freedom but ok",
    "310": "@theCyberZon @im_aumyrrh @celtics Always the ugly guys chirping.",
    "311": "@Becoming_Bryna @celtics Ty, I just couldn’t believe that he spent time talking to me, I mean he had zero idea who I was, yet he took the time to sit and talk with me. I so appreciate him doing that, wish my dad had taken the time to do that when I was younger, all he wanted to do was drink 🍺😭💔.",
    "312": "@OrlandoMagic @celtics @BallySportsFL @969thegame @RjHampton14 @Timfraz23 add another L",
    "313": "@GeorgeWTrumpWon Not being able to attend a Boston Celtics game because you are not vaccinated is not \"coercion\".\n\nIt's a consequence of your personal decision.",
    "314": "My Sam Jones story: As a kid, he and his @Celtics broke my heart annually by beating my @sixers. I finally felt vindicated when he coached @NCCU. My JC-SU Golden Bulls were NOT kind to them and neither was I! 😉 Mr. Jones, RIP.",
    "315": "@JCDWorld @im_aumyrrh @celtics Always the old men saying shit like this",
    "316": "@JCDWorld @celtics he has some questionable rotations i have to admit, but if you are basically wanting a guy to not be healthy is just messed up",
    "317": "@im_aumyrrh @celtics This coach is a stiff!!!",
    "318": "@celtics Nesmith Is a bust",
    "319": "I just need my @celtics to go on a 30 game win streak ☘️😅",
    "320": "@celtics I'll save Noah on this one. Take my immune system.  Take my big toe and my condition.",
    "321": "@celtics take my immune system",
    "322": "@celtics When I’me Idiot is Questionsble, I’ll be happy.",
    "323": "@celtics rest Tatum",
    "324": "@celtics How is nesmith back in protocols ?",
    "325": "@celtics please be okay rob and jt",
    "326": "#NEBHInjuryReport continued:\n\nJayson Tatum (return to competition reconditioning) - QUESTIONABLE\nRobert Williams (right big toe sprain) - QUESTIONABLE",
    "327": "#NEBHInjuryReport update:\n\nEnes Freedom (Health &amp; Safety Protocols) - OUT\nAaron Nesmith (Health &amp; Safety Protocols) - OUT\nDennis Schroder (return to competition reconditioning) - QUESTIONABLE",
    "328": "@OrlandoMagic @celtics @BallySportsFL @969thegame @RjHampton14 @Timfraz23 Win vibes",
    "329": "@OrlandoMagic @celtics @BallySportsFL @969thegame @RjHampton14 @Timfraz23 Good luck team!",
    "330": "@Becoming_Bryna @celtics May \"the Jones boys\" rest in peace.  Here are\nK.C. and Sam in 1977 Miller Light ad:\nhttps://t.co/Kj1umLnalv",
    "331": "game day vibes 🤟\n\n🆚: @celtics \n📍: Boston, MA\n🕕: 6 p.m.\n📺: @BallySportsFL\n📻: @969thegame https://t.co/ns5K3MghFk",
    "332": "@celtics WIN - Maybe??",
    "333": "NBA 03/01/21\n\n06:00 Miami Heat-3.5\n06:00 Boston Celtics-10.5\n07:00 Phoenix Suns-2",
    "334": "@brucejuice18 @celtics I'm so glad you had that time with him....❤❤❤🙏",
    "335": "Sam Jones, the Boston Celtics’ sharpshooting Hall of Fame guard who played on 10 N.B.A. championship teams, a milestone exceeded only by his teammate Bill Russell, has died at 88. https://t.co/8eECPYPx1D",
    "336": "@celtics That big toe better unsprain itself asap",
    "337": "@OldSchoolBoston @ChristianArcand @celtics I Was in that movie sitting by the players entrance. Remember between takes Dan Aykroyd was standing right at the entrance taliking to me ,even gave me an autograph for my now wife. Really nice guy.",
    "338": "Happy Birthday Kaleigh. I need a Celtics and Pats win? KC Chiefs and Boston Celtics? Hmm? Why? Happy Bday! https://t.co/C5AJBMRl10",
    "339": "Boston Celtics great Sam Jones has died at 88 https://t.co/OW1xf4hgNC https://t.co/99vdcGKZjy",
    "340": "@Becoming_Bryna Your dad was a great player,coach but above all, a great man and role model! Watching him play &amp; coach was an absolute joy! Lifelong @celtics fan! met your dad a few years ago, after I had lost my 2nd leg, such a great man, took time to talk w/me, I’ll remember it always ty. 🙏🏻💔",
    "341": "RIP 🕊️🙏🏾 Sam Jones\n\nThe HBCU legend and Hall of Famer, who won 10 titles with the Boston Celtics, has passed away at the age of 88. https://t.co/oSaFTumOeS",
    "342": "Check out BOSTON CELTICS JAE CROWDER ADIDAS SWINGMAN STITCHED JERSEY ADULT LARGE + 2 IN #adidas https://t.co/CcZR7qZ6PH via @eBay",
    "343": "@erecasner @cedricmaxwell81 @celtics Not just off the glass, Sam could shoot anyhow it needed to be done.  He was cool, smart and deadly out there, an absolute pleasure to watch.  A few of us college kids met him in '71, praised his play and contributions to 10 C's banners.  Sam said \"Not me.  That was ALL Russell.\"",
    "344": "@DonnieSimpson @celtics Prayers and condolences for the family",
    "345": "@cedricmaxwell81 @celtics Sam delighted in getting under Wilt Chamberlain's thin skin.  Often tired in the second half, Wilt took as much time as he could getting back down the floor on D.  Sam loved the top of the key, and would shoot just as Wilt got close.  Swish. \"Too late.\" Sam would say to Wilt.",
    "346": "@SadMagicFan1996 @OrlandoMagic @celtics @AmwayCenter @BallySportsFL @969thegame @wendellcarter34 I wasn’t taking to the players only. The organization as a whole and now you are an embarrassment",
    "347": "Basket: Pillole di Nba, Scomparso The Shooter Sam Jones #nba #basket #samjones\n#bostonceltics https://t.co/HzehHsCtAM",
    "348": "Basket: Pillole di Nba, Scomparso The Shooter Sam Jones #nba #basket #samjones\n#bostonceltics https://t.co/yYK5W1yCPo",
    "349": "\"Yeah, it's fast, isn't it? When I get confused I just give the ball to Larry Bird.\"   --  Boston Celtics teammate Dennis Johnson",
    "350": "@Timi_093 @celtics I'm wondering if they should be running hub n spoke more with time lord like joker does. Especially when Tatum is on the bike.",
    "351": "Boston Celtics play basketball today",
    "352": "@willpalmi2 @celtics Clearly not…Celtics keep blowing 4th quarter leagues and getting beat by trash! Al hasn’t been good since Atlanta…gtfoh",
    "353": "The Magic tip off the New Year with a road back to back starting in Boston | Celtics Game Preview👇🏼\n\n📲 https://t.co/ZlVHbvLA1Q\n\n#MagicTogether",
    "354": "ORLANDO MAGIC vs\nBOSTON CELTICS, 7:00PM.\n#BleedGreen",
    "355": "Consensus Line Move:\n2022-01-02 Orlando Magic at Boston Celtics from 213.50 to 215.50\nOver in trouble\n#NBA #bet #datascientist #entrepreneur",
    "356": "PHOENIX SUNS 108-123\nBOSTON CELTICS, Final.\n#BleedGreen",
    "357": "@mr_ice @celtics @AfAmAthlete @Zoom @Facebook Yeppers! DM the details please and we are set. 👍",
    "358": "Lunar Year Swingman Jersey Boston Celtics 85-86 Larry Bird https://t.co/1GLw5XWKKV eBay https://t.co/i19ZzRPfYL",
    "359": "@TheBostonBrit @OrlandoMagicUK @celtics @tdgarden @OrlandoMagic @NBA_UKfans @BallyMagic @gera1nt @biffabacon439 @NBAUK Have no idea what you're on about Nath 😂",
    "360": "Boston Celtics: 2 players we need to see more of in 2022 – NBA News https://t.co/HdDKY7O50z",
    "361": "@DavidVe64270691 @ScottieBurner @NBA @celtics Bulls run this league now",
    "362": "@ScottieBurner @NBA @celtics Bulls run this league now",
    "363": "@Frazzy241 @NBA @celtics Bulls run this league now",
    "364": "@water_SZN @NBA @celtics Bulls run this league now",
    "365": "Boston Celtics great Sam Jones has died at 88.",
    "366": "The Boston Celtics great and Hall of Famer Sam Jones has passed away at the age of 88.",
    "367": "🔵ORLANDO M⭐️GIC GAMEDAY⚫️\n\n🏀: @Celtics \n🗓: Sunday 2nd January\n⌚️: 11:00pm 🇬🇧\n📍: @TDGarden\n\nOrlando tip off 2022 with a back to back starting in Boston\n\nWatch the entire 2021/22 season with NBA League Pass UK: https://t.co/KlfvJJzQnK\n\n#MagicTogether https://t.co/cIpUkkPzX5",
    "368": "It's a busy #BostonSports #GameDay @Bruins #NHLBruins @Patriots #ForeverNE @Celtics #BleedGreen !!! https://t.co/9UqNc1n6L4",
    "369": "Orlando Magic at Boston Celtics: Stream, lineups, injury reports and broadcast info (1/2) https://t.co/esWu2upvwY",
    "370": "@Becoming_Bryna @celtics @AfAmAthlete @Zoom @Facebook Next week may be moved to Wednesday, so I hope you’re still available then?",
    "371": "@celtics Never give up 💪💪💪",
    "372": "@NBA @celtics Make no mistake about it...Jesus Christ is the ONE &amp; ONlY true LORD 👏🏾",
    "373": "what a disgrace! id be embarrassed to have them on my team… with that being said, send them to the @celtics https://t.co/lHDdCfARbk",
    "374": "@celtics trade for @BolBol plz",
    "375": "@mileshuman @sixers @Suns @spurs @DetroitPistons What would you say to this as a @sixers fan? Would @celtics @SacramentoKings fans agree?\n#Sixers #Celtics #Kings #Spurs #Pacers #NBATrade",
    "376": "How I Want The 2022 NBA FINALS To Look Like!!!!\n\nGames Won:\n\nPHOENIX SUNS: 4 ☑️\n\nBOSTON CELTICS: 0\n\nPHOENIX SUNS 2022 NBA FINALS CHAMPIONS!!!!",
    "377": "@Timi_093 @celtics I think this was the most important game of the season for the celtics..they changed things up and ran the offense through the big men and the offense worked. Run the offense through our bigs.",
    "378": "@ChineduAdikwu How? With dis mumu govt wey una get? Bros it's like d Boston Celtics Basketball guy, Giannis wey hin parents turn to Greek citizens 4get our own, u don ever hear dem mention Nigeria? Do u know dat NFL(American football) na igbo guys full dere? Abeg leave matta o",
    "379": "CNN: The Boston Celtics great and Hall of Famer Sam Jones has passed away at the age of 88, according to the Celtics and his son.\nhttps://t.co/qo6gw5v3KQ (via https://t.co/lgfjwGPwdG )",
    "380": "@celtics Can Udoka take some rest so he won't lose the game against the Magic?",
    "381": "The Boston Celtics great and Hall of Famer Sam Jones has passed away at the age of 88, according to the Celtics and his son.\nhttps://t.co/d2I7FXaoCU",
    "382": "New listing! \n\nENES KANTER 2020-21 Prizm Purple Wave Prizm #212 Boston Celtics MINT \n\nCheck it out: https://t.co/yM7McXeleV\n\n#TradingCards #ForSale #eBay https://t.co/PsaQ16wLDU",
    "383": "NBA Basketball Game Betting Picks Simulator: 6:00 PM ET - Orlando Magic vs. Boston Celtics - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/xjw7XD81RP #nba #sportsbetting #freepicks #cappertek",
    "384": "The Boston Celtics great and Hall of Famer Sam Jones has passed away at the age of 88, according to the Celtics and his son.\nhttps://t.co/mk3LUAwCTb",
    "385": "The Boston Celtics great and Hall of Famer Sam Jones has passed away at the age of 88, according to the Celtics and his son.\nhttps://t.co/Mt8kOCFWas",
    "386": "@ShawtyReed @ItsPlayedToWin @celtics Lol chi got a long we to go",
    "387": "@celtics Let’s get dis second win tomorrow night",
    "388": "@BleacherReport @ShamsCharania @celtics jump onto this situation",
    "389": "@Marmitez56 @celtics Casual",
    "390": "Every 🐐🐐🐐 Has His/Her BITCH\n\nMichael Jordan Had The @nyknicks \nKobe had @celtics \nSasha has Becky Lynch as Her BITCH https://t.co/3Sh0gnrfGK",
    "391": "Kobe Bryant scoring 81 is still my fav NBA moment.\nBeating Boston Celtics 2010 my second \nBubble ring 3rd",
    "392": "Check out 2021 Panini Prism Basketball Boston #Celtics  Team Lot 7 Cards Walker Red Ice #Celtic https://t.co/TgyzS32Bk7 via @eBay",
    "393": "Send that thug Christian Wood to the Boston Celtics",
    "394": "Just last week, the @celtics lost a game because they went 4-42 on 3-point attempts https://t.co/moZNXxkuyQ",
    "395": "@celtics TIMELORD ILL GLADLY GIVE YOU MY TOE",
    "396": "@celtics get them both please https://t.co/VNqErAcxkP",
    "397": "@celtics trade for Wood https://t.co/wusVYW3qWe",
    "398": "@BostonCeltics_7 Sit Schultz",
    "399": "Come to the @celtics @Kevinporterjr. @BCCoachStevens move in https://t.co/bxOQHWwEUb",
    "400": "@CelticsRiley We are going to lose one of the games to the pacers because we are the Boston Celtics",
    "401": "@espn_macmahon @wojespn @Kevinporterjr come to the @celtics looking for a PG",
    "402": "Atleast we aren’t the only team splitting at the seams @celtics https://t.co/6IW3EyRODa",
    "403": "@mr_ice @celtics @AfAmAthlete @Zoom @Facebook That would be awesome...I can do it next week if that is okay!",
    "404": "From The Rafters Episode 162: What Is Wrong With the Boston Celtics? w/ @John_Karalis\n\n@JackSimoneNBA and @SamLaFranceNBA talk about Boston’s recent struggles:\nhttps://t.co/pXX39Z0BuS",
    "405": "On this day in sports history January 2, Philadelphia Warriors Center Wilt Chamberlain recorded 47 Points and 36 Rebounds in a 118-117 win against the Boston Celtics in 1960.",
    "406": "Bulls about to have a 2008 Boston Celtics szn. WATCH THIS!!!",
    "407": "@celtics Cut Freedom",
    "408": "1/1/72 – Among myriad other spectacular plays that made him the superstar that he was, Connie Hawkins (25p/12r) dunked the ball in arguably the most impressive way, a one-handed jam over Hank Finkel, leading the Phoenix #Suns to a 114-104 win over the Boston Celtics. #ValleyProud https://t.co/1RGk1MxJVd",
    "409": "Phoenix Suns Game Today vs Boston Celtics Odds, Lineups, Prediction\nhttps://t.co/TWZGmlnBnJ https://t.co/sUNny0S0cl",
    "410": "@Becoming_Bryna @celtics You’re welcome.  Also, if you like, we’d welcome you on the @AfAmAthlete Show via @Zoom and on @Facebook Live, Tuesday Night 6P/9E.  We can talk about your father and Sam, who was actually a special guest on our show. https://t.co/FeikjBczQk",
    "411": "@CELTICSVSREFS @celtics I would do this in. A heart beat",
    "412": "Bulls ain’t fuckin around. Cc: @celtics 😒😒😒 https://t.co/bRxPZftjAM",
    "413": "@Farbod_E Why can’t you @celtics be like that!! Damn!! 😂",
    "414": "@celtics @Vistaprint Hey I know them",
    "415": "@LAClippers So the @celtics are not that bad!! 😬😂",
    "416": "Imagine jokic passing to Jayson Tatum and Jaylen brown instead of bol bol and maga porter jr. @celtics get it done",
    "417": "@celtics @Vistaprint How bout get some assists on the court?",
    "418": "@Pxaull_ @Marmitez56 @celtics Mfs forget he was dropping 17 a night and top 5 in the 6moty race just a month ago",
    "419": "@TuasexuaI @celtics We have a bunch of mid role players that can’t shoot and a 2nd “star” that sucks",
    "420": "Boston Celtics and New York Knicks",
    "421": "Also get him some help lolz @celtics",
    "422": "@OldSchoolBoston @ChristianArcand @celtics A very strong argument has been made this is one of the worst movies ever made",
    "423": "WATCH: Are the Boston Celtics neglecting the development of one of the best players on their roster? https://t.co/HJTNSOBJ5a #sports #feedly",
    "424": "@fakeshoredrive I remember seeing Jay on one of the late night shows - opening night of the 2007-08 NBA seasons. Had just been in attendance as the KG @celtics destroyed the @WashWizards. Roc Boys…..drinks is on the housssssse",
    "425": "@celtics Anytime rob is on the injury report it’s a concern",
    "426": "@2511154l @celtics They don’t need to know 😂",
    "427": "Goodnight world.  @Patriots tomorow and. @celtics     Leggo",
    "428": "@ItsPlayedToWin @celtics No comment",
    "429": "There hasn’t been an NBA All Star game in Boston since 1964. @NBA BRING IT BACK TO BOSTON PLEASE @celtics",
    "430": "@Vini_veiga5 @KBEvans09 @celtics @NBA Stop it… You haters hate him regardless he’s leading Celtics in assists and the NBA in steals lol. Boston might be the only city where fake Celtics fans root for their players to do bad and get upset when those players help them win. You’re def not part of Celtics Nation.",
    "431": "@celtics “Big right toe sprain?” Holy F, I give up.",
    "432": "@isaiahthomas The Boston Celtics",
    "433": "@dirtyaIbanian @celtics buddy he’s not going to be a celtic .",
    "434": "@mr_ice @celtics Thanks!!",
    "435": "Sam Jones, Hall of Fame shooting star of Boston Celtics dynasty, dies at 88 - https://t.co/9dRZZsJ2cq (Washington Post)",
    "436": "@jnoijen @ClayTravis Watch Rudy Gobert/the Boston Celtics/Miami if you want to see good defense in this modern era",
    "437": "@celtics Wait so Tatum is back for magic game ?",
    "438": "@BostonCeltics_7 Correct",
    "439": "@BostonCeltics_7 Yeah Penny. Also, could you toss me a follow if you like threads like this? The support really helps. Thanks!",
    "440": "@_Misael5 @justgotdone1 @arhooptalk @cyladin @RealBillRussell @kaj33 @BillWalton @WiltCArchive @DR34M @SHAQ Wilt has literally said he wouldn’t have fit on the Boston Celtics. Besides Wilt played with even greater teams than bill did. Remember Paul arizin won a chip in 56 without Wilt. Billy Cunningham finished 3rd in mvp voting his first year without Wilt.",
    "441": "@celtics I hope Tatum plays",
    "442": "@dad_supa @reginaldpain3 @jaytatum0 @celtics bro what",
    "443": "Sam Jones, the Boston Celtics’ sharpshooting Hall of Fame guard who played on 10 N.B.A. championship teams, a milestone exceeded only by his teammate Bill Russell, has died at 88. https://t.co/askD37LquR",
    "444": "@statmuse @celtics @celtics_stats Way to go, but I'll always a @Lakers Fan",
    "445": "@Becoming_Bryna Awesome 👏 picture! @celtics",
    "446": "Christmas may be over but our NYE Sale is still on. Continue to celebrate with 10% off these Boston Celtics slippers. \n\nShop Now: https://t.co/sMbVlY0lhl https://t.co/4JBfKv91xq",
    "447": "@ItsPlayedToWin @celtics I was skeptical at first with these guys being put together but man are they entertaining! And they’re winning! I think the Celtics are just stale right now. They may turn it up but they need a spark. The talent is definitely there.",
    "448": "FACT OF THE DAY\n\nDespite having the worst offensive rating out of all the teams in the NBA in the 1961, 1963 and 1964 season,\n\n...the Boston Celtics still won the chip those years! 😱😱😱\n\nThis was the only time in NBA History that the worst offensive t… https://t.co/R8o0SvOlCn https://t.co/EEXFfBp5oh",
    "449": "@CELTICSVSREFS @celtics Lol why would Houston do this",
    "450": "Sam Jones, Hall of Fame shooting star of Boston Celtics dynasty, dies at 88 https://t.co/raFdtuygRw",
    "451": "Yahoo! Sports:  WATCH: Are the Boston Celtics neglecting the development of one of the best players on their roster? https://t.co/bAOKUUN0fw",
    "452": "@celtics Health &amp; Safety Protocols??? Yeah right! https://t.co/O8CFpMUrsa",
    "453": "@celtics Incredibly nice guy and very modest.",
    "454": "Why haven’t y’all put it together like them yet &amp;&amp; this is their first yr @celtics ?! https://t.co/1GDWR6Ivam",
    "455": "@LeJobless6 @celtics vouch ?",
    "456": "@celtics Tatum e Rob questionable, insta lose",
    "457": "@celtics Icon ....#legend RIP",
    "458": "@celtics Playing again tomorrow?? 🤦‍♂️",
    "459": "Celtics seek strong start to 2022 against visiting Magic https://t.co/wcbVNHaV1Z #NBA #BostonCeltics #OrlandoMagic",
    "460": "Stop fucking with @celtics .. stop betting against @okcthunder 🤦🏽‍♂️ https://t.co/LOXSFKSTiO",
    "461": "Boston Celtics Potential Trade Destination For Russell Westbrook #NBA #NBA75 #NBATwitter #RussellWestbrook #LakeShow #BleedGreen \n\nRead More- https://t.co/eWVWJmcNjU https://t.co/bZjjDc5oJO",
    "462": "@celtics is a really sexy team brooooo",
    "463": "@CastTtm @celtics Sam Jones worked some hoops camps in WV I attended as a child in the ‘70s. I was in awe of the man as I had read books about the great Celtics teams he played for. RIP, Mr. Jones.",
    "464": "Celtics seek strong start to 2022 against visiting Magic  #NBA\n #celtics #BostonCeltics #OrlandoMagic #PureMagic https://t.co/TljlO2CxLZ",
    "465": "Time zones are crazy:\nAustralia living in 2022\nUSA still living in 2021\nBoston Celtics fans living in 2008",
    "466": "@Timi_093 @celtics Al is an amazing mentor. Few centers can pass the ball like him. We're seeing Rob soaking in that skill",
    "467": "@celtics So close to the \"we getting the band back together\" tweet! 😂🤞💪🍀",
    "468": "@bijancbayne @TomBradyRules12 @gfgcom @celtics @rebelsart @HonestLarry1 @RyansVintageCA @AdamsCardShop @SportsCardBOT @djlphotos @NBA @CardboardHistry @basketballfosho @PhilSwaun Sure did",
    "469": "@Markhoyle4 @TomBradyRules12 @gfgcom @celtics @rebelsart @HonestLarry1 @RyansVintageCA @AdamsCardShop @SportsCardBOT @djlphotos @NBA @CardboardHistry @basketballfosho @PhilSwaun He could to that seated- and I bet you saw him do it",
    "470": "@TomBradyRules12 @gfgcom @celtics @rebelsart @HonestLarry1 @RyansVintageCA @AdamsCardShop @SportsCardBOT @djlphotos @NBA @CardboardHistry @basketballfosho @PhilSwaun @bijancbayne Yes.   I just saw Sam shooting at his basketball camp I attended as a kid. Literally shot from all over the court and banked in every shot",
    "471": "@FrogmansWorld @celtics they may just be resting him",
    "472": "The late Sam Jones once reflected on the night Boston Celtics coach Red Auerbach started five Black players for the first time in NBA history.\n\n#Celtics | #RIPSamJones | @BigTimeTimJim \nhttps://t.co/CRsPLZwwL0",
    "473": "@Becoming_Bryna @celtics Sorry for your loss. Your dad was a great player and apparently a great man as well.",
    "474": "If @Grant2Will hits his next 3 free throws, he'll be averaging a 50-40-90 shooting split on the season. @celtics #BleedGreen",
    "475": "Check out 2015 NBA Hoops Boston Celtics R.J. Hunter Rookie Trading Card #BostonCeltics https://t.co/GTnxS41aFY via @eBay #RockinEve #NBA75 #NBAonTNT #NBATwitter #TheHobby",
    "476": "Boston Celtics center &amp; human rights advocate Enes Kanter Freedom takes on China &amp; the Chinese Communist Party &amp; woke companies doing business with them. It’s about time someone used their status to take on Xi Jinping and the tyrannical CCP. https://t.co/7N4N2KGWGL",
    "477": "Rest peacefully Sam Jones. A true trailblazer for the @Celtics. #BleedGreen #NBA75",
    "478": "@FrogmansWorld @celtics I think they used that as a cover for him resting",
    "479": "@directedbysunny @Judon4President @celtics Yeah I doubt it’s serious and hope it’s not",
    "480": "@celtics Well its shorter",
    "481": "En cualquier momento leemos\n\nBrandon Bass is signing a 10-day contract with the Boston Celtics, per @ShamsCharania https://t.co/stJDQFZfbd",
    "482": "@Primo618 @celtics We open 9-2",
    "483": "@WhaleAquatic @legacy_ricky @celtics @thebig3 @icecube @YetiCoinEth CRAZY!",
    "484": "@HoopsForHaiti12 @KBEvans09 @celtics @NBA No response huh",
    "485": "@TheHoopCentral @celtics your bum ass roster building has caused people to think this is an argument I hope you’re happy",
    "486": "Boston #Celtics suggested as potential trade destination for #Lakers' Russell Westbrook, via @HoopAnalysisNet. #NBA \n\nhttps://t.co/9S8VZ9qOxK",
    "487": "@WhaleAquatic @legacy_ricky @celtics @thebig3 @icecube @YetiCoinEth @YetiCoinEth making big plays to start off the Year of the Yeti!! 🚀🏀🚀🏀 #YetiCoin #YetiGang",
    "488": "@hottakeharry Also, didn’t we just watch the Boston Celtics have the stars, assets, picks, and do absolutely NOTHING with it? Look how well that played out with them.",
    "489": "@SuperbowlBillss @celtics he will be, he out of protocal and everything",
    "490": "@Pxaull_ @celtics I get it but they need some rest",
    "491": "@Pxaull_ @milkviaoreo @celtics It’s 5 days",
    "492": "@Noah_Sayed529 @jake_easy115 @celtics lmfaoooooooo",
    "493": "@celtics What a surprise Robert Williams is hurt again"
}