{
    "0": "Nba Live\n\nLos Angeles Lakers vs Oklahoma City Thunder Live Stream \n\n#NBAAllStar\n\nhttps://t.co/vOmlLLQkzz",
    "1": "Los Angeles Lakers - Oklahoma City Thunder\n\nBet slip link: https://t.co/VDCazHVJQ5 https://t.co/bidzhm6ZGF",
    "2": "🙏RETWEET https://t.co/DRkvTqktjL story FACT OF THE DAY\n\nThe number of different starting lineups that the Los Angeles Lakers had this season:\n\n39 different starting line ups\n\nThe number of wins by the Los Angeles Lakers this season:\n\n31 total wins\n\nSee you around Vogel! 🤣🤣🤣… https://t.co/JcoonIlsen",
    "3": "Tonight's giveaway in honor of the legendary Kareem Abdul-Jabbar's 75th birthday 🎂 https://t.co/guEqENXygq",
    "4": "https://t.co/gnmqg3dWJo Los Angeles Lakers Vs Golden State Warriors April 7 2022 Live Stream Scoreboard &amp; Play By Play Watch https://t.co/femj6B0b8N https://t.co/KgeGggtKj1",
    "5": "Check out this listing I just added to my #Poshmark closet: NBA Boy's Gray Los Angeles Lakers Sweatpants Size Large. https://t.co/lgP6oI5Xvm #shopmycloset @poshmarkapp",
    "6": "⚡️ “The Big Fail: Inside the Lakers’ most disappointing season in franchise history” by @latimes https://t.co/D3KDsGHr0Y",
    "7": "First five on the floor. \n\n#SuitingUpTogether | @ToyotaSoCal https://t.co/GHSGtmdGqI",
    "8": "Today's NBA Picks: 10:30 PM ET - Oklahoma City Thunder vs. Los Angeles Lakers - 24 PICKS AVAILABLE: https://t.co/Bt5ViYpU70 #nba",
    "9": "Los Angeles Lakers (-5.5) vs. Oklahoma City Thunder! #LakeShow #ThunderUp #NBA #NBATwitter #NBA75",
    "10": "Los Angeles Lakers Starters:\n\nMalik Monk\nAustin Reaves\nTalen Horton-Tucker\nStanley Johnson\nDwight Howard\n\nPlayers out:\nCarmelo Anthony\nAnthony Davis\nRussell Westbrook\n#LakeShow #NBA #NBATwitter #NBA75",
    "11": "NBA Fan Compares 1998 Chicago Bulls And 2022 Los Angeles Lakers: \"The GOAT Made The Real Difference Here\" https://t.co/WijDAHO48A BILL GOT 8 IN A ROW HE MADE THE DIFFERENCE. mj CAN BE THE LAMB LMAO BILL 13 IN ALL mj GOAT WAT IF THAT'S UR ARGUMENT. NOW SHOW ME mj's 8 OR 11?? CAN'T",
    "12": "Los Angeles Lakers Starting Lineup 4/8\n PG: Talen Horton-Tucker\n SG: Malik Monk\n SF: Austin Reaves\n PF: Stanley Johnson\n C: Dwight Howard\nhttps://t.co/o75oZ8vnE8",
    "13": "The Big Fail: Inside the Lakers' most disappointing season in franchise history https://t.co/5JmzjFqeIA",
    "14": "Los Angeles Lakers Vs Oklahoma City Thunder Live Play By Play &amp; Reaction https://t.co/nttEDIHtFF",
    "15": "Uniforms for Oklahoma City Thunder vs Los Angeles Lakers at 7:30 PM.\n\n#ThunderUp #LakeShow https://t.co/yYTsZVaVPY",
    "16": "Today's NBA Picks: 10:30 PM ET - Oklahoma City Thunder vs. Los Angeles Lakers - 23 PICKS AVAILABLE: https://t.co/Bt5ViYpU70 #nba",
    "17": "Watching #WinningTimeHBO? \n\nCheck out our companion podcast, \"Binge Sesh,\" where we give you a behind-the-scenes look at the real-life Lakers stories that inspired the show. https://t.co/1DjgWBWEx7 https://t.co/kiGmVGqr20",
    "18": "Why this Los Angeles Lakers season was doomed from their first team outing in October https://t.co/mapan8pLnY",
    "19": "5 moves the Los Angeles Lakers can take this summer: \n\n https://t.co/ux2uQdmq56",
    "20": "LeBron James will miss the Los Angeles Lakers' final two games of the season due to an ankle injury. 😢\n\nhttps://t.co/c6R9nG1VR7",
    "21": "@imma_do_me20 Maybe you should pass some of that aspiration to the Los Angeles Lakers. They don't seem to share your sentiment 🤷🏾‍♂️",
    "22": "Today's NBA Picks: 10:30 PM ET - Oklahoma City Thunder vs. Los Angeles Lakers - 22 PICKS AVAILABLE: https://t.co/Bt5ViYpU70 #nba",
    "23": "LeBron James to miss Los Angeles Lakers’ final two games due to ankle injury - https://t.co/TRXdx6CrKl https://t.co/bZSkmgKxoY",
    "24": "Tonight marks the Zavier Simpson revenge game.\n\nSimpson was signed by the Lakers as an UDFA in November of 2020. They waived him that December.\n\nAfter his rookie campaign with the Blue, he played for Los Angeles in the Summer League.\n\nCaptain Hook is going Hollywood tonight 🍿 https://t.co/msLojCEk2s",
    "25": "GAMEDAY!📍\n-\nThe Los Angeles Lakers take on the Oklahoma City Thunder at 7:30 PM PST tonight in the https://t.co/8kT67grctA Arena. 💜💛\n-\nWho do you think will win this game tonight? 🤔 \n- \nFollow @lalakersquad for more! 🔥 https://t.co/BphsXygek8",
    "26": "KOBE BRYANT RETIREMENT NEW ERA SNAPBACK HAT/CAP/LID LOS ANGELES LAKERS \"MAMBA\" https://t.co/QSyWfTRYue eBay https://t.co/eKQ2tHJINn",
    "27": "https://t.co/OJV6gwF3we Los Angeles Lakers Sign 11x17 Wood Wordage Design #LosAngelesLakers #LA #LosAngeles #Lakers https://t.co/XmTs7bBcbt",
    "28": "@latimes @DanWoikeSports @BA_Turner Look at the bright side. LeBron is denied another ring while playing for the Lakers.",
    "29": "Los Angeles Lakers star @KingJames plans on retiring after this season to pursue a college degree, sources tell ESPN.",
    "30": "At age 37 😳\n\n(h/t LegionHoops/Twitter)\n\nLeBron James | Los Angeles Lakers https://t.co/BsMfmGjYWZ",
    "31": "Fun fact: \n\nLos Angeles Lakers have played a grand total FIVE playoff games in the Staples/Crypto center in the last 9 (non-bubble) seasons",
    "32": "Inside the #Lakers’ fall: Problems arose behind closed doors in training camp, team personnel seeing their worst fears realized before the team played a real game. \n\n“Russ never respected Frank from Day 1,” said one person with knowledge of the situation. https://t.co/5JmzjF8Dk0 https://t.co/HtMjkt2XDD",
    "33": "if Anthony Davis led the NBA in blocks (and stocks) on a top-5 defense for the Los Angeles Lakers, would he win DPOY?\n\n asking for a friend https://t.co/VIOghMKZyE",
    "34": "LeBron James to miss Los Angeles Lakers' final two games due to ankle injury – Lakers News https://t.co/7ZFlaOSrGk",
    "35": "HBO Renews Los Angeles Lakers Series WINNING TIME for a Second Season\n\nLink: https://t.co/SORr2dbFLh https://t.co/L6CZ8G8r86",
    "36": "LeBron James will miss the Lakers' final two games https://t.co/gmiaG9YuZx",
    "37": "LeBron James to miss Los Angeles Lakers' final two games due to ankle injury – https://t.co/ddnFCCuQgg",
    "38": "LeBron James will not play in the final two games of the Los Angeles Lakers’ season because of soreness in his left ankle.\nhttps://t.co/l19wUbzMMj",
    "39": "Friday Night Basketball https://t.co/TgZdPgvEpj",
    "40": "@PersonaSpeaks If those Niggas are insiders then I’m the starting center for the Los Angeles Lakers",
    "41": "\"Los Angeles #Lakers #LeBronJames to miss another game due to not giving a damn\" https://t.co/c9kLbMOQFI",
    "42": "LeBron James to miss Los Angeles Lakers' final two games due to ankle injury https://t.co/gTCDka4GID https://t.co/JAr26BTTpe",
    "43": "LeBron James to miss Los Angeles #Lakers' final two games due to ankle injury https://t.co/hVEL7NaRB3 via @upi #NBA #NBA75 #NBATwitter #NBATwitterLive #LakeShow",
    "44": "LeBron James to miss Los Angeles Lakers' final two games due to ankle injury https://t.co/DVOtL5IAOl",
    "45": "LeBron James to miss Los Angeles Lakers' final two games due to ankle injury https://t.co/jzKbtQV9X5 https://t.co/2JpqFj6TM8",
    "46": "Half time \nMilwaukee Bucks vs. Detroit Pistons\n live Clicks her:https://t.co/Qh3qa46AMT\nOr HD her:https://t.co/GGTPfr2u3o\n#nbatrades #nbahistory #nbadraft #nbachamps #derrickrose #losangeleslakers #kobebryant #nbalive #nfl #antetokounmpo https://t.co/Zuih2exMMB",
    "47": "MAKE A SERIOUS OFFER ON 2 tickets tonight free replica jersey giveaway \nDM OFFER\nface value is $600 total + fees\n\n#okc #thunder @ Los Angeles Lakers VIP Premier 8 row 2 tonight 4/8 7:30p\n\nprivate section, in seat service, free program\n#lakers #lakeshow #lakersnation https://t.co/1aCOqkqPuy",
    "48": "Three Things to Know: Lakers vs Thunder - 4/8/22 | Los Angeles Lakers - https://t.co/d1syEXXaRY https://t.co/zjHUmlDxA0",
    "49": "LeBron James to miss Los Angeles Lakers' final 2 games because of sprained ankle - ESPN https://t.co/hgi62EPXTj",
    "50": "HBO Renews Los Angeles Lakers Series WINNING TIME for a Second Season — GeekTyrant https://t.co/8cp7jvNW9D",
    "51": "Former Wildcat Wenyen Gabriel has signed a two-year deal with the Los Angeles Lakers. https://t.co/L7NjA9CM7o",
    "52": "Big Fail: Inside Lakers' most disappointing season in history - Los Angeles Times https://t.co/JV88yciI6L",
    "53": "Toronto Raptors - Houston Rockets\nBrooklyn Nets - Cleveland Cavaliers\nMiami Heat - Atlanta Hawks\nLos Angeles Lakers - Oklahoma City Thunder\n\nBet slip link: https://t.co/MfbUekL8pW https://t.co/xhlE7fyaId",
    "54": "@craighofeld has made a pick for @Lakers vs. @okcthunder\n\nPerformance:\nOKC Games: 110-83-2 (57%) \nOverall: 110-83-2 (57%) \n\n#LosAngelesLakers | #OklahomaCityThunder\n    \nhttps://t.co/mUZCYSstN5",
    "55": "@SportsHeartland has made a pick for @Lakers vs. @okcthunder\n\nPerformance:\nOKC Games: 124-85-4 (59%) \nOverall: 329-242-6 (58%) \n\n#LosAngelesLakers | #OklahomaCityThunder\n    \nhttps://t.co/GHDVQSwsop",
    "56": "@ZacharyLowNBA has made a pick for @Lakers vs. @okcthunder\n\nPerformance:\nOKC Games: 122-90-4 (58%) \nOverall: 226-188-6 (55%) \n\n#LosAngelesLakers | #OklahomaCityThunder\n    \nhttps://t.co/39Gm50CdKO",
    "57": "HBO Renews Los Angeles Lakers Series WINNING TIME for a Second Season — GeekTyrant https://t.co/MpE5HEd0ZG",
    "58": "@JosephR___ Like bruh just say you do not fuck with lebron james and the Los Angeles lakers because this is just a dumbass tweet for thousand of likes",
    "59": "@dakzwrld @shane_2104 I’m from Los Angeles, I’m a Dodgers and Lakers fan, should I not be a Cowboys fan?",
    "60": "@jr_xxi \"The New York Knicks have acquired G Russell Westbrook from the Los Angeles Lakers for F Julius Randle, G Quentin Grimes, and G Alec Burks.\" https://t.co/vxAp0C3LeE",
    "61": "Show 153 of \"New Report, Old Report\" w/ myself &amp; NY sports radio’s favorite caller, Al from White Plains! Kansas is your national champs and IN MEMORIAM of the Los Angeles Lakers. \n\n🍎📱: https://t.co/8DC5b47sVI\n\nSpotify: https://t.co/vMmuYSk7zb\n\n💻: https://t.co/HbfX28q8pg https://t.co/7frciQkT05",
    "62": "Check out 1997 Upper Deck #58 Kobe Bryant Los Angeles Lakers HOF Csg 8.5 NM - MINT https://t.co/cMdK4dYDnJ #eBay via @eBay",
    "63": "The 2022 NBA \"We Have TV Time\" Award Goes to the Los Angeles Lakers!!! https://t.co/06T5ramayf https://t.co/zq45r9IZMJ",
    "64": "Rams now in the hunt to land Tyrann Mathieu. This team is out there with that Kobe/Shaq era Los Angeles Lakers energy. Everyone wanting to become part of what they’ve built and I’m here for every minute of it. The @RamsNFL have the best team culture of any team in the NFL by far!",
    "65": "Los Angeles Lakers Acrylic Team Logo Cap Display Case - Basketball Hat Display Cases\nhttps://t.co/OqbicX0j4P",
    "66": "Los Angeles #Lakers: It's Time for Dodger Baseball \n\nBest of luck this ... \n \nhttps://t.co/5177emxsja\n \n#Basketball #California #LakersOfficial #LosAngeles #LosAngelesLakers #NationalBasketballAssociation #NBA #NBAWesternConference #NBAWesternConferencePacificDivision https://t.co/E3VgaX7NOe",
    "67": "#TV HBO Renews Los Angeles Lakers Series WINNING TIME for a Second Season: HBO has announced the renewal of their Los Angeles Lakers series Winning Time for a second season. The pickup comes midway through the show’s first season, which chronicles Jerry… https://t.co/nkGuD73en7",
    "68": "Today's the last Lakers home game of the season. Stop on by to get game ready 🥵\n\nThe Red Chickz 📍\n557 S Spring St, Los Angeles, CA 90013\n\n#NashvilleHot #HotterThanYou https://t.co/9NEKLGm5tM",
    "69": "LeBron James to miss Los Angeles Lakers' final 2 games because of sprained ankle\nhttps://t.co/O8L71Hx5jm",
    "70": "🏀 GAME ANALYSIS 🏀\n\n🏟 Oklahoma City Thunder vs Los Angeles Lakers 🏟\n\n▶️ BET THE NBA ▶️ https://t.co/odroCYfQFJ\n\n#NBA #GamblingTwitter \n\nhttps://t.co/2g3QNTCaRY",
    "71": "Keep Gordon Hayward out of LA please. Not even *off the Lakers* just out of Los Angeles entirely. https://t.co/EPzQyBf4Vv",
    "72": "https://t.co/TAYYjDscac Los Angeles Lakers Keychain Classic Basketball CO #LosAngelesLakers #LA #LosAngeles #Lakers https://t.co/dscWeVyaZh",
    "73": "Back LOS ANGELES LAKERS to BEAT Oklahoma City Thunder tonight in the @NBA (Game Starts at 03.40 BST) #NBA #Basketball",
    "74": "@latimes I can't believe that the writer of this article persuasively asking the readers to defend for Vogel and not showing how bad last season Lakers were also. Especially with the lineups and not making in-game adjustments when necessary. Oh well.",
    "75": "@latimes Maybe Russell Westbrook bet against the Lakers, idk. With so much money invested in gambling, it's only a matter of time before a huge fixing scheme comes to light.",
    "76": "Wenyen Gabriel has been signed a two-year deal with the Los Angeles Lakers after just 17 games with the organization. \nhttps://t.co/YHnzusOgvA",
    "77": "@latimes It is time to trade Lebron and AD for draft picks and build up young talent to leverage later like the Lakers did post Magic and post Kobe.  \n\nI would say westbrook too but it will cost resources to trade him.  Cut him and spread it out.",
    "78": "[LIVE] Oklahoma City Thunder Vs. Los Angeles Lakers - NBA League Pass\n🔴Watch Here📺📱➠ https://t.co/19OfprVtci\n📅 : 4/8/2022 ⏰ 10:30 PM",
    "79": "[LIVE] Oklahoma City Thunder Vs. Los Angeles Lakers - NBA League 2022\n🔴Watch Here📺📱➠ https://t.co/kShPTLWobz\n📅 : 4/8/2022 ⏰ 10:30 PM",
    "80": "Chris Broussard explains why he thinks the Los Angeles Lakers need to trade Russell Westbrook ‘at all costs’, as Broussard details to Rob Parker why the Lakers cannot bring Westbrook back next season under any circumstance. https://t.co/iET3nAyykq",
    "81": "Chris Broussard explains why he thinks the Los Angeles Lakers need to trade Russell Westbrook ‘at all costs’, as Broussard details to Rob Parker why the Lakers cannot bring Westbrook back next season under any circumstance. https://t.co/C4QrQ6LiYD",
    "82": "“What happened?” one late-season opposing player wondered after beating the Lakers. “They stink.”\n\nThe Times talked to 20 coaches, players, scouts and executives with the #Lakers and rivals to recount the most disappointing season in franchise history. https://t.co/5JmzjFqeIA",
    "83": "Tonight: Home Finale 2022 \n\n⏰: 7:30 PT\n📺: @SpectrumSN \n📻: 710 ESPN &amp; 1330 KWKW\n\n#LakeShow x @SociosUSA \n\nhttps://t.co/CCfztdF5ta",
    "84": "The Los Angeles Lakers announced Friday that Lebron James will not play in the final two games of the season, due to an ankle injury he sustained last week\n#AFPSports\n\nhttps://t.co/S5c7RJCZSc",
    "85": "@latimes Well, if all this is factual and I would speculate the Lakers, Vogel and Russ would deny it (true or not) then it's up to Vogel to sit Russ down and say, \"how bout that motherf*cker? How do you like me now? You want to be a team player and play or get a sore ass from sitting?\"",
    "86": "@PeterVecsey1 This just in; HBO's next drama will be titled; \"NOT Winning Time\", on the 2021-22 Los Angeles Lakers!",
    "87": "Los Angeles Lakers announce LeBron James is done for season with ankle injury – Lakers News https://t.co/0K2Rlq5UlN",
    "88": "Big Fail: Inside Lakers' most disappointing season in history - Los Angeles Times https://t.co/rDgnqJLsRY",
    "89": "LeBron James Is Eligible for a 2 Year $97 Million USD Extension With the Los Angeles Lakers https://t.co/hqzTLZnNcz \n\nWe think LeBron is worth about $15 million per year at this time.  So if he has that option he should jump on that deal.\n\nThe Lakers should trade him.",
    "90": "@DrGuru_ They were the best team in the league before the shut down. Who knows how it would have played out big the pandemic didn’t happen. One thing we all know is that the Los Angeles Lakers won the 2020 NBA Finals. It’s ok we know you hate the lakers just say that. 🤡",
    "91": "@nahrelax @Frediculous I feel like we're talking about a trade for the Los Angeles Lakers now, and not marriage, which is the scary part. Maybe I'm just sentimental about marriage moreso than transactional 😅",
    "92": "The betting public cemented the #Lakers as NBA title favorites by picking them ahead of the Suns, Warriors and Bucks.\n\nWhether it was those trips to the windows in Vegas or the Lakers’ $150M payroll, trusting this team turned out to be money poorly spent. https://t.co/5JmzjF8Dk0",
    "93": "The Los Angeles Lakers announced today that Lebron James will miss the final two games of the 2021-22 regular season due to a sprained ankle.  He is expected to make a full recovery and be ready for next season.",
    "94": "It's Time for Dodger Baseball ⚾️\n\nBest of luck this season, @Dodgers! https://t.co/MnCZPenN9I",
    "95": "@Lakers What a baby!!! Jack Youngblood who played for thr Los Angeles Rams played the superbowl with a broken leg.",
    "96": "LeBron James to miss Los Angeles Lakers’ final 2 games because of sprained ankle https://t.co/eiD9y2K5UA https://t.co/4RtF5gKb02",
    "97": "LOADED #Lakers trade rumors today! 🏀\n\nTrade buzz growing on AD, Russ AND LeBron? @HGrahamNFL breaks it all down!\n\nPLUS, could Los Angeles still decide to waive or buy out Westbrook?\n\nWATCH NOW AND SUBSCRIBE: https://t.co/kgqjMBXFe4",
    "98": "BREAKING NEWS: LeBron James to miss remainder of 2021-22 season; Doesn’t qualify for scoring title  https://t.co/DaZNr84S2D #LALakers #LosAngelesLakers",
    "99": "In honor of @shaqtin coming near the end of another season here are my awards for biggest flops:\n\n5. James Harden\n4. Zion Williamson\n3. Julius Randle\n2. Russell Westbrook\n\nand finally...\n\n1. The Los Angeles Lakers",
    "100": "LeBron James to miss Los Angeles Lakers' final 2 games because of sprained ankle - via @ESPN App https://t.co/SIpSQV4693",
    "101": "In a city that loves its stars, the Lakers' roster was a purple-and-gold constellation.\n\nA wasted season later, @DanWoikeSports and @BA_Turner take a deep dive into a team that wound up too old and too slow, with square pegs being pushed into round holes.  https://t.co/5JmzjFqeIA",
    "102": "“1,2,3…CANCUN” Shaquille O’Neal along with rest of NBA on TNT crew mercilessly troll Lakers  https://t.co/uQO4jq7pBh #LALakers #LosAngelesLakers",
    "103": "Big Fail: Inside Lakers' most disappointing season in history - Los Angeles Times https://t.co/HH3mTuWp6C",
    "104": "#NBA \n\nOKC/LA\n\nThunder are 6-0 ATS in the last 6 meetings in Los Angeles\nThunder are 9-3 ATS in their last 12 games overall.\nThunder are 27-9 ATS in their last 36 games as a road dog\nLakers are 2-5 ATS in their last 7 games\nLakers are 1-6 ATS in their last 7 games as a favorite",
    "105": "The Los Angeles lakers is the worse nba super team of all time",
    "106": "@tipsylaker @zein_p1O @casualtakeking Westbrook isn't the only player on the Los Angeles Lakers who knows how to dribble the damn ball.\n\nConvenient you left out AD and LeBron from that question though.",
    "107": "Consensus Line Move:\n2022-04-08 Oklahoma City Thunder at Los Angeles Lakers from 226.50 to 225.00\nUnder business... man\n#NBA #sportsgambling #datascientist #personalfinance",
    "108": "April 8, 1980: Los Angeles #Lakers PG Magic Johnson became the only rookie to record a triple-double during his NBA postseason debut and recorded the most AST (16) in a playoff debut by any player in NBA history to this day https://t.co/wYpCdCytsg",
    "109": "Los Angeles Lakers Predictions and Preview for 4/8/2022 hosts Oklahoma City Thunder.  Looking for betting action?  Find out if there is any value in our preview. #NBATwitter #SportsBetting https://t.co/5YDbeSPSDt",
    "110": "Lakers will miss the remainder of the season to recover from a ankle sprain. \n\nThe Los Angeles Lakers have two games remaining and were eliminated from playoff contention earlier this week. https://t.co/trQhj3UqJd",
    "111": "Two books I will be first in line for 5-10 years down the road when they inevitably get published: the 2021-22 seasons for the Jacksonville Jaguars and Los Angeles Lakers. https://t.co/TcbH9c2bt4",
    "112": "Oklahoma City Thunder visits Los Angeles Lakers Predictions and Preview for 4/8/2022 today.  Who are we taking in this game?  Find out now. #NBATwitter #SportsBetting https://t.co/5YDbeSPSDt",
    "113": "Los Angeles, it's the last home game of the season! The Lakers are taking on Oklahoma at 7:30 PM! Are you going to the game?! Drop a 💜  in the comments to show your support. #Lakers #LakerNation #LakeShow https://t.co/vActnIrMEO",
    "114": "This story is a soft piece. This is what all the fuss is about??\n\n#Big Fail: Inside Lakers' most disappointing season in history - Los Angeles Times https://t.co/bEnRTlxKlQ",
    "115": "The betting public cemented the #Lakers as NBA title favorites by picking them ahead of the Suns, Warriors and Bucks.\n\nHow could they not be favorites? \n\n@DanWoikeSports and @BA_Turner take a deep dive inside what sunk the Lakers’ championship hopes. https://t.co/5JmzjF8Dk0",
    "116": "The Los Angeles @Lakers have signed Wenyen Gabriel to a standard NBA contract, it was announced today. Carmelo Anthony, Russell Westbrook and out tonight with LeBron James as expected after being eliminated. #LakeShow",
    "117": "The Los Angeles @Lakers have signed Wenyen Gabriel to a standard NBA contract, it was announced today. Carmelo Anthony, Russell Westbrook and out tonight with LeBron James as expected after being eliminated. #LakeShow",
    "118": "The Los Angeles Lakers have signed two-way forward Wenyen Gabriel to a new standard NBA deal. Source @ShamsCharania #Lakers",
    "119": "The Big Fail: Inside the Lakers' most disappointing season in franc... (Los Angeles Times)\n\nThe Los Angeles Lakers weren't a sure thing; they were, though, the surest thing for bettors.\n\nAdd your highlights:\nhttps://t.co/aoZhYPxECf\n #LA_Lakers",
    "120": "The Los Angeles Lakers have signed two-way forward Wenyen Gabriel to a new standard NBA deal, team says.",
    "121": "OFFICIAL: Congrats to @WenyenGabriel on signing a standard NBA contract with the #LakeShow after originally joining on a two-way contract. https://t.co/xMFjAlxXA0",
    "122": "New article! The Lakers are in a bad situation. I’m stepping in with the goal of turning things around.\n\nI Become the GM of the Los Angeles Lakers\nhttps://t.co/8lc8SqOwSt",
    "123": "🏀 #NBA'de Bu Gece👇\n\nDetroit Pistons 🆚 Milwaukee Bucks\n⏱ 02:00\n\nBrooklyn Nets 🆚 Cleveland Cavaliers\n⏱ 02:30\n\nLos Angeles Lakers 🆚 Oklahoma City Thunder\n⏱ 05:30 https://t.co/tSC31WAgm6",
    "124": "LeBron James to miss Los Angeles Lakers’ final 2 games because of sprained ankle https://t.co/wIxRYMzaKY",
    "125": "LeBron James to miss Los Angeles Lakers’ final 2 games because of sprained ankle https://t.co/p16rPcYBU5",
    "126": "Why this Los Angeles Lakers season was doomed from their first team outing in October - via @ESPN App https://t.co/zkFH87pT3u",
    "127": "Two things I am sick and tired of hearing about:\n\n1) The Los Angeles Lakers and their losing season. \n\n2) Will Smith.",
    "128": "Why this Los Angeles Lakers season was doomed from their first team outing in October  https://t.co/z2mtvQNS9t",
    "129": "@shesforRussy Report, Russell Westbrook's \"prideful\" nature could reportedly prevent him from accepting a contract buyout from the Los Angeles Lakers.  Not pride, pay his full contract and release him.  He earned that contract.",
    "130": "Lebron is not playing the rest of the season for he is hurt, it’s hard to play when you have no season left, lol seriously ofcourse, he don’t play more this season,  the season is over, L in Lakers stands for Losers and the other L  in Los Angeles for Double Losers #NBATwitter https://t.co/htDA05e5BR",
    "131": "The Los Angeles lakers is a very nasty organization",
    "132": "😍 LeBron James Los Angeles Lakers 23 Jersey 😍 \nShop now 👉👉 https://t.co/1cRCZBjJaO\n.\n#sportsfans\n#sportsjerseys\n#sportswearstor\n#nflfans\n#nbafans\n#mlbfans\n#nhlfans https://t.co/MWH9h5IgbC",
    "133": "“Winning Time: The Rise of the Lakers Dynasty” has been a slam-dunk for HBO and now the network has ordered a second season of the drama series, which is set to end its first run Sunday, May 8. Based on the book “Showtime: Magic, Kareem, Riley and the Los Angeles Lakers Dynasty",
    "134": "@NBAMemes You talking about LeBron, right? The thing is there's nothing at stake for the Los Angeles Lakers at this point lmao. They could win every game and still be out of the playoffs lol. Disappointing season.",
    "135": "Have the Los Angeles Lakers let me and the city of LA down tremendously? Yes. Will the Dodgers redeem our city and be the greatest thing this year since the Rams won the Super Bowl a couple months ago? Also yes. #AlwaysLA",
    "136": "Big Fail: Inside Lakers' most disappointing season in history - Los Angeles Times https://t.co/ovKpb6LqwO",
    "137": "#FBF … @MagicJohnson 7up commercials from the 80’s #MagicJohnson #7up #1980s #Commercials #Basketball #LosAngelesLakers https://t.co/4kmDSKdO2Z",
    "138": "It's The Right Choice I Was One Of The People That Said Shut Him Down For The Season... 👑💯 #LeBronJames #KingJames👑 #JamesGang #StriveForGreatness🚀 #LosAngelesLakers #LakeShow #NBA75 #NBATwitter #NBATwitterLive #NBABasketball #NBAOnTNT #InsideTheNBA #NBAOnESPN #ESPN https://t.co/KqhHfLLQFa",
    "139": "Read more about the most disappointing season in Lakers history from reporters @DanWoikeSports and @BA_Turner \n\nhttps://t.co/5JmzjF8Dk0 https://t.co/IkBdn6xPRk",
    "140": "Los Angeles Lakers won 4 games since the All-Star break. \n\nToronto Raptors have won 4 games since April 1st.",
    "141": "LeBron James to miss Los Angeles Lakers’ final 2 games because of sprained ankle https://t.co/WXEiZrdLwH",
    "142": "The Lakers’ problems arose behind closed doors in training camp, team staff members seeing their worst fears realized before the team played a real game. \n\n“Russ never respected Frank from Day One,” said one person with knowledge of the situation. https://t.co/5JmzjF8Dk0 https://t.co/CULmN7Tu9e",
    "143": "LeBron James will miss the Lakers' final two games (Los Angeles Times)\n\nLakers star LeBron James will miss the team's final two games of the season because of his a...\n\nAdd your highlights:\nhttps://t.co/meKB74lc3X\n #LA_Rams",
    "144": "NBA Betting Trend: We have Los Angeles Lakers at -1417, which is a 1192 point difference from the current line.\n#tipster\n#sportbetting",
    "145": "@dylanw @hpdailyrant Reminds me of @imkylelambert's post about \"We can't all be All-Stars, but we don't need to be\" https://t.co/xD495SkGeG\n\nOtherwise you get the...*sigh*...2021-22 Los Angeles Lakers",
    "146": "“What happened?” one late-season opposing player wondered after beating the Lakers. “They stink.”\n\nThe Times talked to 20 coaches, players, scouts and executives with the #Lakers and rivals to recount the most disappointing season in franchise history.\n\nhttps://t.co/5JmzjF8Dk0",
    "147": "LeBron James to miss Los Angeles Lakers' final 2 games because of sprained ankle - via @ESPN App.  #NBA.   #Lakers.  https://t.co/128XJDf0Qz",
    "148": "LeBron James to miss Los Angeles Lakers’ final 2 games because of sprained ankle https://t.co/MVjGf0uAOn",
    "149": "LeBron James to miss Los Angeles Lakers’ final 2 games because of sprained ankle https://t.co/RoMTTqOj2X",
    "150": "LeBron James to miss Los Angeles Lakers'' final 2 games because of sprained ankle - ESPN #NBA #Lakers \n\nhttps://t.co/NqS98cNepi",
    "151": "LeBron James to miss Los Angeles Lakers' final 2 games due to sprained ankle – NBA News https://t.co/dlhNTOUIuG",
    "152": "LeBron James to miss Los Angeles Lakers' final 2 games because of sprained ankle – NBA News https://t.co/UH2XHBndaJ",
    "153": "LeBron James to miss Los Angeles Lakers' final 2 games because of sprained ankle – Lakers News https://t.co/mCD62NK2ys",
    "154": "@lafcftv We concluded whatever we felt on that day. After seeing Galaxy cater to MLS instead of LA, Seeing Los Ángeles  conquered by an away team, and seeing weak energy which isn’t on par to Dodgers/Lakers fans- we made a oft then to switch. So no one would call us bandwagoners later.",
    "155": "https://t.co/J2anhYEF1t Los Angeles Lakers Garden Gnome - Mad Hatter #LosAngelesLakers #LA #LosAngeles #Lakers https://t.co/sHsNRgJ4hQ",
    "156": "The Los Angeles Lakers will WIN the NBA Championship in dominate fashion next season.\n\nI’ll be quoting this tweet a year from now.",
    "157": "“I don’t know if he wants to chase Michael Jordan?” Jackie MacMullan gets real on LeBron James leaving Lakers in order to win another NBA ring  https://t.co/9fVdxa4hf8 #LALakers #LosAngelesLakers",
    "158": "I will stand by this until the Lakers win a actual championship\n\nThe Los Angeles Lakers are a Mickey Mouse team and their 2020 “NBA Championship” was nonsense. They are a disappointment of a team and have let down their fans undoubtedly. Clippers run LA no doubt \n\nCome at me.",
    "159": "LeBron James to miss Los Angeles Lakers' final 2 games because of sprained ankle\nhttps://t.co/ttRiXMTdby",
    "160": "The Los Angeles Lakers announced Friday NBA superstar LeBron James will not play in the final two games of the season.  https://t.co/UHVpGP5vHx",
    "161": "LeBron James will miss the final two games of the Los Angeles Lakers’ season with a sprained left ankle. That almost certainly prevents him from winning his second NBA scoring title. The Lakers made the announcement before they hosted the… https://t.co/cQ2sNpxtoN",
    "162": "@KingJames to miss Los Angeles @Lakers ' final 2 games because of sprained ankle\n\nPhiladelphia @Eagles  sign Olympic hurdler and former Oregon Ducks WR Devon Allen to 3-year deal\n\nTop of 3rd  @tigers are losing to @whitesox 3-0",
    "163": "The Los Angeles Lakers have become the biggest disappointment this season, if not in the history of the NBA. #News https://t.co/FlJh4otYbC",
    "164": "LeBron James to miss Los Angeles Lakers' final 2 games due to sprained ankle\nCHUMP, CHUMP, CHUMP.  DEFINITELY NO MJ! https://t.co/XfyYBfodkv",
    "165": "Anthony Davis isn't sure what to expect this offseason with the Los Angeles Lakers. https://t.co/2i3pKTTtm7",
    "166": "Lakers: LeBron James out for the rest of the NBA season - CBS Los Angeles https://t.co/yRvBCN1iDC",
    "167": "Anyone who thinks the 2021-2022 Los Angeles Lakers were a “Superteam” needs to stop talking basketball.",
    "168": "LeBron James to miss Los Angeles Lakers' final 2 games due to sprained ankle\nHe’s NO MJ!  Not even close.   https://t.co/lce0kVWQ5u",
    "169": "horologicalmarvel's IG\n\nThai singer and songwriter @bambam1a was spotted wearing @jacobandco Astronomia Solar Jewelry Planets Zodiac when watching the Golden State Warriors game against the Los Angeles Lakers in San Francisco, CA.\n\n🔗https://t.co/d7SlNOMf88\n\n#BamBamxGSW #BamBam https://t.co/r2NPoOx2wv",
    "170": "LeBron James will miss the final two games of the Los Angeles Lakers’ season with a sprained left ankle, almost certainly preventing him from winning his second NBA scoring title. https://t.co/TJ0QxYh0M3",
    "171": "Live Photo of the Los Angeles Lakers https://t.co/jm7NJBEBLH",
    "172": "BRODIE BACK IN THE H, WALL IN LA 🤯 \n \nThe Los Angeles Lakers have agreed to trade Russell Westbrook to Houston for John Wall, and a first-round pick, per @ShamsCharania 🚨 https://t.co/3XmCyCK7ly",
    "173": "LeBron James to miss Los Angeles Lakers’ final 2 games due to sprained ankle https://t.co/fO9Ny5ImAK",
    "174": "LeBron James to miss Los Angeles Lakers' final 2 games due to sprained ankle - via @ESPN App https://t.co/Xw0ItSz1Tf",
    "175": "I KNOW THE STORIED LOS ANGELES LAKERS DIDN'T HAVE A TOP 5 PLAYER ALL-TIME OUT HERE FOCUSED SOLELY ON BEATING THE NEW ORLEANS PELICANS.\n\nTELL ME THAT DIDN'T HAPPEN. I WAS TOLD WE DON'T MATTER. LeBRON JAMES TOLD Y'ALL WITH HIS ACTIONS WE DO. WE MATTER A LOT.",
    "176": "LEBRON FIRES A THREE… WONT GO. REBOUND TO GIANNIS, THROWS IT AHEAD TO MIDDLETON… STOLEN BY HORTON TUCKER!!! 3 SECONDS LEFT! 2! 1!! FOR THE WIN… BANG! BANG! TALEN HORTON TUCKER FROM DOWNTOWN. THE LOS ANGELES LAKERS ARE YOUR 2022 NBA CHAMPIONS!",
    "177": "I watched The Lakers during this era every night with my dad. Best memories in my life. On KCAL channel 9 Los Angeles. #lalakers #magicjohnson https://t.co/7cAzmiQSM2",
    "178": "Boston Celtics - 50 Wins ☘️\nLos Angeles Lakers - 49 Losses 🫤\n\n🤭🫣🫠🫢🫥😲🫤🥱😦🙄😐😵‍💫 https://t.co/4IRN2s82eK",
    "179": "LeBron James to miss Los Angeles Lakers' final 2 games due to sprained ankle - via @ESPN App. Were you expecting this Lakers Fan !? https://t.co/OfwIvxcGBN",
    "180": "LeBron James will miss the remaining two games of the season to recover from a left ankle sprain 🤕\n\nThe Los Angeles Lakers were eliminated from playoff contention earlier this week ✖️\n\n#NBA #NBATwitter #LakeShow #LeBronJames https://t.co/MsKAyvyzOV",
    "181": "LeBron James to miss Los Angeles Lakers' final 2 games due to sprained ankle  https://t.co/4vZceEg41H",
    "182": "Why this Los Angeles Lakers season was doomed from their first team outing in October https://t.co/3c1MQHTkxn",
    "183": "Oklahoma City Thunder vs Los Angeles Lakers NBA Pick and Prediction NBA ... https://t.co/rekqU1voUg via @YouTube",
    "184": "BREAKING: Los Angeles #Lakers F LeBron James will miss the remainder of the season due to his ankle sprain after evalutation by the medical staff. \n\nHe finishes the season with 30.3 ppg, 8.2 rpg, and 6.2 apg. He will not qualify for the league leaders falling 2 games short. #NBA https://t.co/LWT0NtSoSJ",
    "185": "The Raptors have 13 wins in the last 30 days\n\nThe Lakers have 13 wins in the last 97 days \n\nThe Raptors in one month have as many wins as the Los Angeles Lakers do all 2022. \n\nAgain, I ask, is he All-NBA?",
    "186": "LeBron James’ left ankle was recently reevaluated by Lakers medical staff, and it was determined that due to the ankle sprain James suffered in a game on March 27th, he will miss the remainder of the 2021-22 NBA season to allow for continued healing and an expected full recovery.",
    "187": "LA Lakers: The Los Angeles #Lakers and Houston #Rockets are expected to revisit a Russell Westbrook ... https://t.co/GGqzWF4q6V",
    "188": "Will the Lakers trade Russell Westbrook? #LosAngelesLakers #RussellWestbrook https://t.co/IFlx5r3eua",
    "189": "Why this Los Angeles Lakers season was doomed from their first team outing in October https://t.co/DkaTn33Zt4",
    "190": "🏀 Golden State Warriors vs Los Angeles Lakers\n\n👦🏿 OKC THT\n🤢 I quintetti misteriosi di Cancun Vogel\n\n📊 I nostri consueti Plus &amp; Minus by @stuani89\n\n#NBA75 #Lakeshow \n\nhttps://t.co/uRCoFQtwWt",
    "191": "Analyzing Friday’s Oklahoma City Thunder at Los Angeles Lakers odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/I3j9J6wyqW",
    "192": "Fighting Stigma : Russell Westbrook Rumors: Lakers Star Concerned with 'Stigma' of Contract Buyout: Russell Westbrook's \"prideful\" nature could reportedly prevent him from accepting a contract buyout from the Los Angeles Lakers. https://t.co/8XJApS8q1F",
    "193": "Must read. ( ca fait bosser l’anglais)\n\nWhy this Los Angeles Lakers season was doomed from their first team outing in October https://t.co/S3NbUzLi1y",
    "194": "NBA Defensive GOAT?! Golden State Warriors vs Los Angeles Lakers Full Game Highlights | April 7, 2022 | FreeDawkins https://t.co/1rBxZVcKmo https://t.co/xi7MsffwYo",
    "195": "Your Los Angeles Lakers 2022 Summer theme song https://t.co/D6aodhX1iP",
    "196": "DasHaus made a bet!\n\nEvent: Oklahoma City Thunder vs Los Angeles Lakers #NBA\nBet: Los Angeles Lakers TO WIN -5.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "197": "DasHaus made a bet!\n\nEvent: Oklahoma City Thunder vs Los Angeles Lakers #NBA\nBet: Oklahoma City Thunder TO WIN +5.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "198": "Klay Thompson continues to throw paper airplanes at the press while Iguodala jokes about his age. Read about all these good vibes and more from the Warriors postgame pressers following their win against the Los Angeles Lakers. https://t.co/yoMIfCCVFB",
    "199": "Los Angeles Lakers finally put an end to miserable season https://t.co/QBFgCe55Il",
    "200": "🏀 @HBO's drama series #WinningTime, which delves into the 1980s #Lakers, has been renewed for a second season.\n\nDon't miss the @latimes' companion podcast \"Binge Sesh,\" which examines what's real, fiction, and creative choices in between. \n\nSubscribe: https://t.co/ccuF9PnKga",
    "201": "Mens Los Angeles Lakers 23 Lebron James Jersey Tank Purple Yellow Large Sports - https://t.co/tlK8V2Yl6u\n\n#lebron #lebronjames #lakers #nba \nhttps://t.co/H6rqn3FKg4",
    "202": "Oklahoma City Thunder | Game # 81: Los Angeles Lakers – Heartland Sports https://t.co/mBbbudtgnl",
    "203": "2021-22 Los Angeles Lakers win title of most disappointing team in NBA history https://t.co/stOu4HGanw via @Yahoo money money money money",
    "204": "Reminder: nothing Ramona writes about the Los Angeles Lakers is to be taken serious. Save yourself the time. https://t.co/LhFn6fOe7J",
    "205": "Los Angeles Lakers expected to fire Frank Vogel, keep Rob Pelinka, Kurt Rambis #LakeShow #NBA #NBATwitter #NBATwitterLive #FrankVogel #RobPelinka #KurtRambis\n\nRead More- https://t.co/exl597Fopf https://t.co/PXWPv4OdAr",
    "206": "ALERT: New high roller bet posted!\nA bet has been placed for $8,000.00 on Los Angeles Lakers - Oklahoma City Thunder to win $15,280.00.\nTo view this bet or copy it https://t.co/xNCeLbIcSu https://t.co/4RynLHtpM2",
    "207": "2021-22 Los Angeles Lakers win title of most disappointing team in NBA history https://t.co/cyHrCbRlXC via @Yahoo",
    "208": "LOS ANGELES LAKERS….. Please hire this man https://t.co/zwMRzLfgNE",
    "209": "Woj, sometime next week: “Sources tell ESPN that Jay Mohr will be named the new head coach of the Los Angeles Lakers.”",
    "210": "Los Angeles Lakers vs Golden State Warriors Full Game Highlights | April... https://t.co/9mXk30e6rm via @YouTube",
    "211": "this week on Threads: the Los Angeles Lakers https://t.co/A05qxrbsTc",
    "212": "⚽️ | Vasco Gigantesco da Gama\n🏀 | Los Angeles Lakers \n🥊 | Jon Jones\n🏈 | Las Vegas Raiders\n🏎 | Hamilton / Mercedes\n⚾️ | Los Angeles Dodgers",
    "213": "NBA Basketball Game Betting Picks Simulator: 10:30 PM ET - Oklahoma City Thunder vs. Los Angeles Lakers - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/b5xPFgnYHc #nba #sportsbetting #freepicks #cappertek",
    "214": "@russwest44 You know you a bum you bout to get bout out or waived. Westbrick you need to go change your name came home to #LosAngeles just to not make anyone proud. You bring shame to #LosAngelesLakers #lalakers #nba worst point guard in the league. Most overrated inflated stat stuffer.",
    "215": "5 Moves The Los Angeles #Lakers Can Take This Summer To Become Title Contenders For The 2022-23 Season https://t.co/esefYvlx3s",
    "216": "LeBron James Is Eligible for a Two Year $97 Million USD Extension With the Los Angeles Lakers - #naijaforum #naijablog #naijamusic - https://t.co/HBvZ9JV7C4 https://t.co/i9MJJRdxnb",
    "217": "Los Angeles Lakers vs Golden State Warriors Full Game Highlights | April 7 | 2022 NBA Season #LosAngeles #Clippers #NBA Video: https://t.co/CUlrQ0zfAu",
    "218": "Los Angeles Lakers vs Golden State Warriors Full Game Highlights | April 7 | 2022 NBA Season #GoldenState #Warriors #NBA Video: https://t.co/0lD54h7sll",
    "219": "Watch Red Hot Chili Peppers bassist Flea perform a solo rendition of the U.S. national anthem prior to a Los Angeles Lakers' NBA home game on Apr. 3. #Music  https://t.co/DR5IkADyeH https://t.co/qLco30ISyQ",
    "220": "Special thanks to the Los Angeles Lakers for supporting our 46th Annual Scholarship Benefit. #uscbaa #blacktrojans #fighton https://t.co/OfqRhEhxNe",
    "221": "🏀 Los Angeles Lakers (@Lakers) #LakeShow\n🆚 L @ Golden State Warriors #DubNation #LALvsGSW\n✈️ N651DL | DAL8929 | B752\n🛫 SFO - 11:40 pm PT\n🛬 LAX - 12:34 am PT\n📡 Tracking: https://t.co/ElSVOH2SFO https://t.co/5lstQ5npiq",
    "222": "@LakersDailyCom 31-49   so  far   for  the   2021-22   Los   Angeles   Lakers  !  Let's  go  back   fifty   years  ! The   1971-72   World   Champion  Los   Angeles  Lakers  won  33   games  in  a  row  still  a  NBA  record  !",
    "223": "Oklahoma City Thunder vs  Los Angeles Lakers Prediction 4/8/22 -   Free ... https://t.co/VVQDJpzEuY via @YouTube",
    "224": "LeBron James has not won a series in Los Angeles in his four years with the Lakers. https://t.co/MtkPb0EwQw",
    "225": "🚨 Line Change 🚨\n\nOklahoma City Thunder @ Los Angeles Lakers\nFri 10:40 PM EST\n\nFrom:\nLAL -4.5 -110\n\nTo:\nLAL -5.5 -110",
    "226": "Consensus Line Move:\n2022-04-08 Oklahoma City Thunder at Los Angeles Lakers from -4.50 to -5.50\n#LakeShow get on board\n#NBA #betting #ai #finance",
    "227": "With South Bay's playoff loss last night, and the Lakers clearly looking to trim the roster, Jones could see an NBA opportunity in Los Angeles pop up as the season nears its end.\n\nI really hope so. \n\n#NBAGLeague #LakeShow https://t.co/1U5Q2gO2FQ",
    "228": "Nike Los Angeles Lakers Diamond Icon Edition LeBron James Jersey Men's XL #6 NBA - https://t.co/ELpMsuZtnn\n\n#lebron #lebronjames #lakers #nba \nhttps://t.co/fukoJ3VzGb",
    "229": "Los Angeles Lakers star Anthony Davis says he \"can't control\" any of the hypothetical trade scenarios that are likely to pop up after... \n#NBA #NBATwitter https://t.co/Vh6KXSb3jJ",
    "230": "Los Angeles Lakers star Anthony Davis says he \"can't control\" any of the hypothetical trade scenarios that are likely to pop up after... \n#NBA #NBATwitter https://t.co/6wgBP1j6gD",
    "231": "5 Moves The Los Angeles Lakers Can Take This Summer To Become Title Contenders For The 2022-23 Season – Lakers News https://t.co/00mleMXTRT",
    "232": "@alshipley Portishead regroups after a 40-point drubbing by the Los Angeles Lakers.",
    "233": "Everything \"woke\" turns to s**t!🤔\n2021-22 Los Angeles Lakers win title of most disappointing team in NBA history https://t.co/4BYZKucnil via @Yahoo",
    "234": "ENOUGH Lakers..\n\nGive us and them a rest!\n\nWhy this Los Angeles Lakers season was doomed from their first team outing in October - via @ESPN App https://t.co/s1QjuDeAtY",
    "235": "On this day in sports history April 8, Don Nelson became the 8th coach in NBA history to win 750 career games, as the Golden State Warriors defeated the Los Angeles Lakers 122-116 in OT in 1993.",
    "236": "On this day in sports history April 8, Los Angeles Lakers Point Guard Magic Johnson became the 1st rookie in NBA history to record a triple-double in his postseason debut, recording 13 Points, 12 Rebounds, and 16 Assists in a 119-110 win against the Phoenix Suns in 1980.",
    "237": "Los Angeles: \"City of Angels\" 📍🌴\n\n#losangeles #LA #california #californialove #lajobs #lacareers #Larams #lakers #City #feauture #bandw https://t.co/fyuDhRNuU6",
    "238": "The 24-56 Oklahoma City Thunder travel on the road to take on the 31-48 Los Angeles Lakers on Friday.  https://t.co/tHc4vHbP1G",
    "239": "🚨 Line Change 🚨\n\nOklahoma City Thunder @ Los Angeles Lakers\nFri 10:40 PM EST\n\nFrom:\nLAL -8.0 -110\n\nTo:\nLAL -4.5 -110",
    "240": "Consensus Line Move:\n2022-04-08 Oklahoma City Thunder at Los Angeles Lakers from -8.00 to -4.50\n#ThunderUp lollipops\n#NBA #CryptoHoops #dataanalytics #money",
    "241": "OKLAHOMA CITY THUNDER vs\nLOS ANGELES LAKERS, 10:30PM.",
    "242": "LOS ANGELES LAKERS 112-128\nGOLDEN STATE WARRIORS, Final.",
    "243": "NBA Basketball Game Betting Picks Simulator: 10:30 PM ET - Oklahoma City Thunder vs. Los Angeles Lakers - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/b5xPFgFzyK #nba #sportsbetting #freepicks #cappertek",
    "244": "https://t.co/K3Usia5cb5  News For Us Golden State Warriors’ Steph Curry On LeBron James Wanting To Play With Him, “I’m Good Right Now” - The Los Angeles Lakers season is a wash. That's not stopping LeBron James from making headlines. The four-time NBA champion h...",
    "245": "DeMar DeRozan thought Los Angeles Lakers were in 'disarray' after 2021 free agent visit – NBA News https://t.co/Ntscb6xGoZ",
    "246": "DeMar DeRozan thought Los Angeles Lakers were in 'disarray' after 2021 free agent visit – Lakers News https://t.co/MzKz4LkQ3H",
    "247": "Los Angeles Lakers Memorial Service | FMC https://t.co/4lDxR4XaL8",
    "248": "Los Angeles Lakers Memorial Service | FMC https://t.co/17BeHC9Usz",
    "249": "Los Angeles Lakers Memorial Service | FMC https://t.co/Iii5zdGFDR",
    "250": "I thought me and @jeremylambert88 were friends! Join us on @Fightful Overbooked for an all new @FMC_NBA \n\nLos Angeles Lakers Memorial Service | FMC https://t.co/0oZI1A14Kf via @YouTube",
    "251": "DeMar DeRozan thought Los Angeles Lakers were in ‘disarray’ after 2021 free agent visit https://t.co/PpMeRszNZu",
    "252": "FMC IS BACK!\n\n@TruHeelSP3 &amp; I are going to mourn the Los Angeles Lakers.\n\nhttps://t.co/35lphJjtOJ",
    "253": "DeMar DeRozan thought Los Angeles Lakers were in ‘disarray’ after 2021 free agent visit https://t.co/N3Wyv4p7MW",
    "254": "DeMar DeRozan thought Los Angeles Lakers were in ‘disarray’ after 2021 free agent visit https://t.co/7ATas9Zq1J",
    "255": "DeMar DeRozan thought Los Angeles Lakers were in ‘disarray’ after 2021 free agent visit https://t.co/xU2GWCBz7u",
    "256": "Why this Los Angeles Lakers season was doomed from their first team outing in October - via @ESPN App https://t.co/VH9m2N9bFw",
    "257": "Why this Los Angeles Lakers season was doomed — from their first team outing in October – Major League Baseball News https://t.co/uOM0GLWcWA",
    "258": "Every single role player the Los Angeles Lakers traded away last season could have made an impact , all for a bunch of 38 year olds and Westbrook. SMH 🤦‍♂️",
    "259": "Why this Los Angeles Lakers season was doomed — from their first team outing in October – Lakers News https://t.co/u3hpZJUXe1 https://t.co/Z767QOkvqE",
    "260": "https://t.co/G5DqhAHkED🏀🏀🏀 🤔 Los Angeles Lakers Davis,*unfortunately things happen.*Sometimes you have to wear  the label street clothes and shoes until you can prove better.",
    "261": "Why this Los Angeles Lakers season was doomed -- from their first team outing in October https://t.co/cIsDLVDjta https://t.co/Iuzy0ovQB7",
    "262": "The Lakers were booed off the Arena court Sunday night, their 123-95 beatdown by the New Orleans Pelicans leaving their fans displeased and leaving the players from Los Angeles searching for answers for a season that has gone off the rails. 🏀\n#letsqua\n\n#NBAPlayoffs #NBA75 #NBA https://t.co/qs5lWbBtZt",
    "263": "https://t.co/cKqNOTqfY0 Los Angeles Lakers Decal 4x4 Perfect Cut White #LosAngelesLakers #LA #LosAngeles #Lakers https://t.co/luwalQPOMd",
    "264": "“I’m too tough for this team” Andrew Wiggins cannot stop laughing after elbowing life out of Austin Reaves https://t.co/bQqtj0epXs #GoldenStateWarriors #LosAngelesLakers",
    "265": "Carmelo Anthony, Anthony Davis, and LeBron James (L-R) of the Los Angeles #Lakers sat out the game against the Golden State Warriors after the Lakers failed to qualify for the #NBA play-in tournament with seven straight losses.\nhttps://t.co/iZoOndK92W https://t.co/y3NdCmJwPp",
    "266": "@Lakers @Thortontucker @AhmadMonk @DwightHoward Reasons Why The Los Angeles Lakers' Season Went Wrong - Fadeaway World\nhttps://t.co/QKKbMBG584",
    "267": "Any potential trade partner for Russell Westbrook is good news for the Los Angeles Lakers\nhttps://t.co/T3hGnMFBXF",
    "268": "@kmfyy Manchester United, Los Angeles Lakers you use be fumming....",
    "269": "The Lakers are the biggest BUST in NBA history! – Kendrick Perkins #LosAngelesLakers https://t.co/aqKzzyzgL1",
    "270": "Anthony Davis: “To be honest, my training methods were top tier” #AnthonyDavis #LosAngelesLakers https://t.co/4OFHSaqdlR",
    "271": "LeBron James Is Eligible for a Two Year $97 Million USD Extension With the Los Angeles Lakers – Lakers News https://t.co/ChrMx0CUl4",
    "272": "LeBron James Is Eligible for a Two Year $97 Million USD Extension With the Los Angeles Lakers – NBA News https://t.co/HLe2oePPKE",
    "273": "LeBron James Is Eligible for a Two Year $97 Million USD Extension With the Los Angeles Lakers – https://t.co/7auUcR71dx",
    "274": "This year’s LeBron James, Anthony Davis, and Russell Westbrook Lakers team is worst than the Shaq and Kobe team with Malone, Gary Payton, and Rick Fox. Smh 🤦🏾‍♂️ #LakeShow  #LosAngelesLakers  @stephenasmith @RealSkipBayless @ShannonSharpe @undisputed @FirstTake",
    "275": "Russell Westbrook’s debut season with the Los Angeles Lakers did not go as planned.\n\nREAD MORE HERE: https://t.co/Q0XMMTa7s1",
    "276": "🏀 Should the Los Angeles Lakers trade AD for a player who is less prone to injuries? 🤔\n\n#NBA #Basketball https://t.co/0F270AA8Wo",
    "277": "6. Miami Heat Vs Atlanta Hawks\n7.Dallas Mavericks Vs Portland Trail Blazers\n8.Utah Jazz Vs Phoenix Suns\n9.Los Angeles Lakers Vs Oklahoma City Thunder https://t.co/xUrIAFLNeZ",
    "278": "It's hard to remember exactly when it sank in that the Los Angeles Lakers were flawed beyond repair this season.\nhttps://t.co/JGEB3MbB7Q",
    "279": "Los Angeles hosts the Oklahoma City Thunder after Talen Horton-Tucker scored 40 points in the Los Angeles Lakers' 128-112 loss to the Golden State Warriors. Friday's game is the fourth meeting of the season between the two teams. The Lakers… https://t.co/dhLse37wkh",
    "280": "NBA - Thompson guida il successo Warriors sui Los Angeles Lakers https://t.co/YJKpj88pwy",
    "281": "Los Angeles hosts the Oklahoma City Thunder after Talen Horton-Tucker scored 40 points in the Los Angeles Lakers' 128-112 loss to the Golden State Warriors. Friday's game is the fourth meeting of the season between the two teams. The Lakers… https://t.co/LZq8tCDOS1",
    "282": "[Wojnarowski] Los Angeles #Lakers guard Russell #Westbrook— who has played 78 of 79 games this season — is expected to be out vs. Golden State tonight, sources tell ESPN. 🏀\nhttps://t.co/013AcK1g2s",
    "283": "https://t.co/NGcHam9yYb Los Angeles Lakers Lanyard - Two-Tone #LosAngelesLakers #LA #LosAngeles #Lakers https://t.co/yjtpGPN0tS",
    "284": "Golden State Warriors vs Los Angeles Lakers Full Game Highlights | April 7, 2022 | FreeDawkins https://t.co/2hG6ao6xHs",
    "285": "1996-1997 Upper Deck CC # LA2 KOBE BRYANT ROOKIE RC Los Angeles Lakers Sharp ! - https://t.co/kmyMHvVIFx\n\n#lebron #lebronjames #lakers #nba \nhttps://t.co/JKHEtuY4tS",
    "286": "Onde assistir Golden State Warriors x Los Angeles Lakers Basquete AO VIVO NBA 2022\n\n#futebolstats\n\nhttps://t.co/OOUolsJ8Za",
    "287": "Thompson scored 33 points with six 3-pointers and Golden State won its third straight game after dropping four in a row, running away late from the depleted Los Angeles Lakers for a victory. https://t.co/Bdzi3qGCJI",
    "288": "NBA Basketball Game Betting Picks Simulator: 10:30 PM ET - Oklahoma City Thunder vs. Los Angeles Lakers - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/b5xPFgnYHc #nba #sportsbetting #freepicks #cappertek",
    "289": "Klay Thompson continued a hot stretch with a team-high 33 points and the host Golden State Warriors rallied late in the third quarter to claim a 128-112 victory over the superstar-depleted Los Angeles Lakers. https://t.co/eKwxQkTFWJ",
    "290": "Los Angeles Lakers: https://t.co/tKQTvmjWLt",
    "291": "Almost everyone who left Los Angeles last year has had a better campaign than the Lakers:\n\n▪️Kentavious Caldwell-Pope and Kyle Kuzma: more wins than the Lakers\n\n▪️Montrezl Harrell and Andre Drummond: play-in\n\n▪️Markieff Morris, Wes Matthews, and Alex Caruso: playoff-bound https://t.co/O7ShKxIvCE",
    "292": "Los Angeles Lakers vs Golden State Warriors - Full Game Highlights | April 7, 2022 NBA Season\nhttps://t.co/b0xLumlDe8",
    "293": "Talen Horton-Tucker talks about his role with Lakers #LosAngelesLakers #TalenHortonTucker https://t.co/KkCMNBQUEm",
    "294": "Winning Time Season 2 Is Happening: HBO Renews Los Angeles Lakers Show\n\nYES YES YES YES YES YES YES\n\nIm so excited for this.  I love this show and so underrated!\n\n#WinningTime  #HBOMax  #HBO",
    "295": "NBA Defensive GOAT?! Klay Thompson 33 points! Los Angeles Lakers vs Golden State Warriors Full Game Highlights https://t.co/zCc2MQHbTq https://t.co/xi7MsffwYo",
    "296": "Los Angeles Lakers vs Golden State Warriors Full Game Replay 2022 Apr 7 NBA Replay HD\nhttps://t.co/CYZWNK4IM3 https://t.co/IDqtTR94hB",
    "297": "Watch “Los Angeles Lakers 1986/87 Documentary | The Drive For Five | Championship Season Movie” on YouTube https://t.co/4JrlzOjkKZ",
    "298": "Lakers vs. Thunder Preview: The saddest NBA game (Silver Screen and...)\n\nThe &amp;quot; Los Angeles Lakers&amp;quot; will be playing the &amp;quot; Oklahoma City Thunder &amp;quot; ...\n\nAdd your highlights:\nhttps://t.co/Q8o4US9wLM\n #LA_Lakers",
    "299": "Talen Horton-Tucker scores 40 as Lakers' stars get front-row seats ... (Los Angeles Times)\n\nFour veterans sat.Another was waived.\n\nAdd your highlights:\nhttps://t.co/kpduELH5xk\n #LA_Rams",
    "300": "Lakers Get Silver Against Golden State | Los Angeles Lakers (Los Angeles Lakers)\n\nThe Lakers landed in the Bay to play the third to last game of their https://t.co/ob10C1YNF8 was a promisi...\n\nAdd your highlights:\nhttps://t.co/rZYWH0tk7I\n #LA_Lakers",
    "301": "Watch “Los Angeles Lakers 1987/88 Documentary | Back To Back | Final ‘Chip in Showtime Era” on YouTube https://t.co/0Hiy1MpSC9",
    "302": "@kendyle__ Apparently he tried during the Los Angeles Lakers but he got rejected bones were too weak because of lack of milk",
    "303": "Klay Thompson scored 33 points as the Golden State Warriors saw off the Los Angeles Lakers 128-112 to wrap up a 3rd straight victory #SSBasketball",
    "304": "@Lakers i dont give a darn if its the first game or the last game.this is the Los Angeles Lakers. the most prestigious team in the NBA.losing 48 games is not an option.",
    "305": "https://t.co/5JKdx08OwX Los Angeles Lakers Bracelet Classic Basketball CO #LosAngelesLakers #LA #LosAngeles #Lakers https://t.co/OLQjpm5SjR",
    "306": "The 2021-22 NBA Season Should be a Wakeup Call for the Los Angeles Lakers https://t.co/ib3myEwIH5",
    "307": "Klay Thompson scored 33 points with six 3-pointers and the Golden State Warriors won their third straight game after dropping four in a row, running away late from the depleted Los Angeles Lakers for a 128-112 victory. Jordan Poole added… https://t.co/sBBCM1S22b",
    "308": "Los Angeles Lakers have 31 wins this season 💥💥. #nba #losangeleslakers #losangeles #basketball https://t.co/KO2D5fUYie",
    "309": "The Los Angeles Lakers are an embarrassment to the game of basketball and I am calling Adam Silver @nba to do something.",
    "310": "🤖 #SofiAlert \n📅 07-04-2022 \nLos Angeles Lakers - Golden State Warriors \n🛋 3.7/5 Sofis https://t.co/gVDaTPLR0N",
    "311": "SAN DIEGO IS ALREADY IN THEIR MIDSEASON FORM LMAOOOOOOOOO\n\nThe Padres are the Lakers of the MLB...I guess that puts them on par with Los Angeles for something... 🤷‍♂️",
    "312": "Klay Thompson scored 33 points with six 3-pointers and the Golden State Warriors won their third straight game defeating the depleted Los Angeles Lakers 128-112 Thursday night. \n\nhttps://t.co/RGJs95c7jw",
    "313": "@hmfaigen Mac Attack + Mason now with the Los Angeles Lakers🙏",
    "314": "NBA Defensive GOAT?! Golden State Warriors vs. Los Angeles Lakers Full Game Highlights | 2021-22 NBA Season https://t.co/ZD5nuHUJv5 https://t.co/xi7MsffwYo",
    "315": "NBA Defensive GOAT?! Klay Thompson talks after Golden State Warriors blowout Los Angeles Lakers 128-112 https://t.co/ERBseFPqCq https://t.co/xi7MsffwYo",
    "316": "Klay Thompson erupts for 33 points in Warriors' win over Lakers (East Bay Times)\n\nSAN FRANCISCO - Klay Thompson scored 33 points Thursday as the Warriors beat the Los Angeles...\n\nAdd your highlights:\nhttps://t.co/q5ReAbPzAm\n #GoldenStateWarriors",
    "317": "NBA Basketball Game Betting Picks Simulator: 4/8/2022 10:30 PM ET - Oklahoma City Thunder vs. Los Angeles Lakers - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/b5xPFgnYHc #nba #sportsbetting #freepicks #cappertek",
    "318": "Congratulations Golden State @warriors on your 128-112 win over the Los Angeles Lakers 2021-2022NBASeason",
    "319": "Cheers Up @BamBam1A Los Angeles Lakers v Golden State Warriors \n\nCr Noah Graham/NBAE ,Ezra Shaw\n\n@BamBam1A \n@BAMBAMxABYSS \n#BamBam     #뱀뱀     \n#GOT7 #갓세븐 \n#BamBamxGSW \n@GOT7Official https://t.co/XK25dzNiVT",
    "320": "Golden State Warriors 128 (Klay Thompson 33 pts, Jordan Poole 19 pts, 11 asists) Los Angeles Lakers 112 (Talen Horton Tucker 40 pts, Dwight Howard 16 pts, 13 rebs)",
    "321": "NBA Defensive GOAT?! Golden State Warriors vs. Los Angeles Lakers Full Highlights 4th QTR | 2021-22 NBA Season https://t.co/l6IDf0omUP https://t.co/xi7MsffwYo",
    "322": "@ShutupToshi9227 Best 7 year peak 👀\n\nDuring the 2000s decade (2000 – 2009), no NBA team experienced more success than the Los Angeles Lakers. During that span, the Lakers reached the NBA Finals six times and won four of them.",
    "323": "Encerrado:\n\nGolden State Warriors (51-29) 128 x 112 (31-49) Los Angeles Lakers\n\nGSW 📊\nKlay Thompson: 33PTS/4REB/4AST\nJordan Poole: 19PTS/4REB/11AST/1STL\n\nLAL 📊\nTalen Horton-Tucker: 40PTS/3REB/3AST/4STL\nMalik Monk: 24PTS/7REB/4AST/1STL/2BLK\n\n#NBA https://t.co/6kgkD26KsN",
    "324": "2021-2022 Los Angeles Lakers were the NBA version of the 2000 Washington Redskins.\n\nWhat should have been.....",
    "325": "The 2021 Chicago Bulls have a higher win percentage than the 2022 Los Angeles Lakers. https://t.co/KtI3NA8t21",
    "326": "BamBam performs at halftime between the Golden State Warriors and Los Angeles Lakers – Lakers News https://t.co/g28AMkTasD",
    "327": "BamBam performs at halftime between the Golden State Warriors and Los Angeles Lakers – NBA News https://t.co/tMQQnJUvdU",
    "328": "ENCERRADO: O Golden State Warriors (51-29), em casa, venceu o Los Angeles Lakers (31-49) por 128 a 112. #DubNation\n\nKLAY: 33PTS, 4REB &amp; 4AST.\nPoole: 19pts, 4reb &amp; 11ast.\n\nTHT: 40PTS (career-high), 3AST &amp; 4STL.\nMonk: 24pts, 7reb &amp; 4ast.\n\nFIM DA RODADA! #NBA75 https://t.co/W4pPsqj3Fl",
    "329": "@bucketsondaily @drippy_Drip1 @LakersNation Its funny because you could read it on the comments of: Laker nation here and on fb, los angeles lakers official page both here and FB, hell even mike trudells comment section here. No need to look far to see it",
    "330": "@LeBronGoCrazyy @Lakers @Thortontucker @AhmadMonk @DwightHoward what a playoff spot for the los angeles lakers!",
    "331": "Talen Horton-Tucker - Los Angeles Lakers\n40 PTS\n3 RBD\n3 AST\n4 STL\n2 TO\n[FD(58.1) DK(56.25)]",
    "332": "Dwight Howard - Los Angeles Lakers\n16 PTS\n12 RBD\n1 AST\n1 BK\n1 STL\n1 TO\n[FD(36.9) DK(38)]",
    "333": "Stanley Johnson - Los Angeles Lakers\n8 PTS\n6 RBD\n2 AST\n2 STL\n6 TO\n[FD(18.2) DK(20)]",
    "334": "Back to LA.\n\n@Thortontucker: 40 pts (career high), 4 stl\n@AhmadMonk: 24 pts, 7 reb\n@DwightHoward: 16 pts, 12 reb https://t.co/ii6SXV66TD",
    "335": "VITÓRIA DO WARRIORS!!!\n\nGolden State Warriors 128 X 112 Los Angeles Lakers\n\n#DubNation\n• Thompson: 33 PTS\n• Poole: 19 PTS e 11 AST\n\n#LakeShow\n• Horton-Tucker: 40 PTS\n• Monk: 24 PTS e 7 REB\n\n📸 Ezra Shaw https://t.co/p4O1NUHykX",
    "336": "220407 BamBam performing at halftime during the game between the Los Angeles Lakers and Golden State Warriors at Chase Center!\n\nhttps://t.co/P41VTVpXW7\n\nBAMBAM AT NBA GAME #BamBamxGSW #BamBam #뱀뱀 @BamBam1A @GOT7Official https://t.co/n19P1bsSSs",
    "337": "tonight Los Angeles Lakers score over  104.5 points winner both teams to score over 218.5 points winner.",
    "338": "Koniec!\n\nWarriors 128 - 112 Los Angeles Lakers",
    "339": "FINAL: Seven players in double figures for the Golden State Warriors as they get 128-112 WIN over the Los Angeles Lakers.\n\nKlay Thompson with 33 PTS with 6 3PT shots. Jordan Poole with a double-double of 19 PTS and 11 AST. Andrew Wiggins also chips in 17 PTS.",
    "340": "@warriors jus whooped #LosAngelesLakers hell yeah",
    "341": "He’s going to pick it up, and then I want my Los Angeles Lakers to give him a 5 year extension on top of that as well #LakeShow  @BamBam1A #BamBamxGSW #BamBam https://t.co/FM80F0UQUf",
    "342": "220407 BamBam performing at halftime during the game between the Los Angeles Lakers and Golden State Warriors at Chase Center!\n\nhttps://t.co/P41VTVpXW7\n\nBAMBAM AT NBA GAME #BamBamxGSW #BamBam #뱀뱀 @BamBam1A @GOT7Official https://t.co/rx1aI4ZJEw",
    "343": "The rebuilding San Antonio Spurs made the play-in over the Los Angeles Lakers… Ludicrous 🤦‍♂️",
    "344": "BamBam performs at halftime between the Golden State Warriors and Los Angeles Lakers https://t.co/HtZgFi1YWe) via @SFGate",
    "345": "Los Angeles Lakers superstar LeBron James admitted that he wants to team up with Stephen Curry in the near future.\nhttps://t.co/uaWOR9bVWp\n#StephenCurry\n#LeBronJames\n#HoopSnoop \n#Fastbreak",
    "346": "Los Angeles Lakers' most disappointing player?! #NBA",
    "347": "NBA Defensive GOAT?! Golden State Warriors vs. Los Angeles Lakers Full Highlights 3rd QTR | 2021-22 NBA Season https://t.co/RCtn0sp5YD https://t.co/xi7MsffwYo",
    "348": "The Los Angeles Lakers who once were a well oiled, shined up, top of the line mint automobile, with all the toys. But Pelinka, LeBron, and Vogel have turned it into an old jalopy with flat tires and spare parts that can’t run. #LALvsGSW https://t.co/KtNgRV8x3D",
    "349": "Anthony Davis Los Angeles Lakers 2019-20 Panini Donruss Opti\n#sportsCards\nSource: Fanatics Checker\nReason: In Stock\n\n12:00:02.0030 AM EDT #Ad\n\nhttps://t.co/LXtag8WMDp",
    "350": "Anthony Davis Los Angeles Lakers 2019-20 Panini Donruss Opti\n#sportsCards\nSource: Fanatics Checker\nReason: In Stock\n\n12:00:02.0030 AM EDT #Ad\n\nhttps://t.co/PfJUwhvxY2",
    "351": "220408 Bambam attends the game between the Los Angeles Lakers and Golden State Warriors\n\ncr: cyjprint\n\nBAMBAM AT NBA GAME\n#BamBamxGSW @BamBam1A @warriors \n#BamBam #GOT7 @BAMBAMxABYSS https://t.co/62puHhx6Lt",
    "352": "In Season 1 of \"Binge Sesh,\" we pull back the curtain on HBO's #WinningTime series about the #Lakers of the 1980s, one of sports' most unforgettable dynasties. #LakeShow https://t.co/1DjgWBWEx7",
    "353": "BamBam from GOT7 performs at halftime during the game between the Los Angeles Lakers and Golden State Warriors at Chase Center in San Francisco, California.\n\n#BamBamxGSW @BamBam1A https://t.co/7SBrgBAzpr",
    "354": "BamBam from GOT7 performs at halftime during the game between the Los Angeles Lakers and Golden State Warriors at Chase Center in San Francisco, California.\n\n#BamBamxGSW @BamBam1A https://t.co/jQWApErnku",
    "355": "220407 Bambam attends the game between the Los Angeles Lakers and Golden State Warriors\n\nBAMBAM AT NBA GAME\n#BamBamxGSW @BamBam1A @warriors \n#BamBam #GOT7 @BAMBAMxABYSS https://t.co/vfdPVWWXwX",
    "356": "220407 Bambam attends the game between the Los Angeles Lakers and Golden State Warriors\n\nBAMBAM AT NBA GAME\n#BamBamxGSW @BamBam1A @warriors \n#BamBam #GOT7 @BAMBAMxABYSS https://t.co/CtoYLY651Y",
    "357": "Heading to the 4th. https://t.co/ziXHASLGYm",
    "358": "The Golden State Warriors close the quarter on a 13-3 run as they lead the Los Angeles Lakers, 91-84 heading into the final 12 minutes.",
    "359": "BamBam of GOT7 attends the game between the Los Angeles Lakers and Golden State Warriors at Chase Center in San Francisco, California.\n\n#BamBamxGSW @BamBam1A https://t.co/vwWyYHTum5",
    "360": "BamBam of GOT7 attends the game between the Los Angeles Lakers and Golden State Warriors at Chase Center in San Francisco, California.\n\n#BamBamxGSW @BamBam1A https://t.co/87odvb6pxs",
    "361": "Seven passes and an air ball 3 after the shot clock expires. Ladies and gentlemen, your 2022 Los Angeles  #Lakers.",
    "362": "The Los Angeles Lakers.\n\n#NBA75 #LakeShow #DubNation https://t.co/WesjodNSfx",
    "363": "Los Angeles Lakers Lebron James Jersey Officially Licensed NBA jersey LARGE NWT - https://t.co/JSNb2LPEIe\n\n#lebron #lebronjames #lakers #nba \nhttps://t.co/ZL54PTxtYd",
    "364": "First time I ever watched a Los Angeles Lakers game and heard Reggie Miller say “is this a Preseason Game” ? Nah PRESEASON is crazy 😂😂",
    "365": "Dwight takes flight ✈️ https://t.co/BHxnmm320H",
    "366": "🚨 UPDATE: Dwight Howard - Los Angeles Lakers has a Double Double\n5:35 3rd\n13 PTS\n11 RBD\n1 AST\n1 BK\n1 STL\n[FD(33.7) DK(33.75)]",
    "367": "ALERT: New high roller bet posted!\nA bet has been placed for $6076.56 on Golden State Warriors - Los Angeles Lakers to win $17,925.84.\nTo view this bet or copy it https://t.co/TiHB3RmK79 https://t.co/DZYuxyx3R5",
    "368": "There is tons of young, exciting talent in the NBA, none of which is on the Los Angeles Lakers. For the love of the basketball gods, please slash that team's national TV presence to the bone next season.",
    "369": "@Angels no time to sleep for los angeles angels and its time to sleep to los angeles lakers",
    "370": "NBA Defensive GOAT?! Golden State Warriors vs. Los Angeles Lakers Full Highlights 2nd QTR | 2021-22 NBA Season https://t.co/PMoX3VsPpX https://t.co/xi7MsffwYo",
    "371": "Soul Searching Ahead for Los Angeles Lakers After Missing Playoffs https://t.co/Z6pFEskgKt",
    "372": "Check out \"Binge Sesh,\" our podcast exploring one of the most memorable dynasties in #Lakers history. #LakeShow #LakersNation \nhttps://t.co/1DjgWBF38x",
    "373": "DID LEBRON JAMES HAVE LET THIS HAPPEN TO THE LOS ANGELES LAKERS?",
    "374": "2021-2022 Los Angeles Lakers Purple American NBA Training Shorts-311 https://t.co/mAyGdcoWtk",
    "375": "75th Anniversary Los Angeles Lakers Blue NBA Shorts-311 https://t.co/O13EGMYniq",
    "376": "Tell ‘em why he goin off tho. 58 days after his bday. 307 days until next. Los Angeles Lakers = 58. Los Angeles = 37 😈 https://t.co/t9Ycfa0YeO",
    "377": "ONE SHINING MOMENT. 2021- 2022 LOS ANGELES LAKERS https://t.co/JCfCTKlhMc via @YouTube @NBAonTNT",
    "378": "Tight race.\n\n@Thortontucker: 17 pts, 2 stl\n@AhmadMonk: 13 pts\nAustin Reaves: 12 pts https://t.co/ZZOn115YDM",
    "379": "Warriors lead the Lakers 65-62 at halftime. Los Angeles is 18-20 from the free throw line. If Golden State chills with the fouling they should be able to create some separation. Klay is going off.\n\nThompson: 23 points (6-10 from 3)\nWiggins: 11 points\nPoole: 4 points, 7 assists",
    "380": "Klay Thompson's 23 PTS and 6 three-pointers \nleads the Golden State Warriors to a 9-2 run to end the second quarter. They lead the Los Angeles Lakers, 65-62.",
    "381": "Rattling Rims https://t.co/jA85MKNQhB",
    "382": "HBO's 'Winning Time' is a soothing balm after Los Angeles #Lakers unsurprising playoff elimination https://t.co/Z5fTbuCeOt",
    "383": "NBA Defensive GOAT?! Golden State Warriors vs. Los Angeles Lakers Full Highlights 1st QTR | 2021-22 NBA Season https://t.co/sXaRn3YnMW https://t.co/xi7MsffwYo",
    "384": "Golden State Warriors vs Los Angeles Lakers is on TNT (usa). Co-commentator is Reggie Miller. Reporter is Allie LaForce.  For more details see https://t.co/1Sic4itIgr #GoldenStateWarriors #LosAngelesLakers #TNTusa",
    "385": "Down the lane and above the rim. https://t.co/GDxM3O9LEX",
    "386": "I don't know why #RussellWestbrook not playing  tonight  he needs to be out there with the rest of the scrubs. Straight trash @russwest44 @Lakers #losangeleslakers #LeBronJames #RussellWestbrick",
    "387": "The Los Angeles Lakers pushed that article about the Hornets wanting Russ Westbrook in that article today in order to get other teams interested in Russ. The Charlotte Hornets should sue Jeannie Buss for putting out false information.",
    "388": "God bless the the Los Angeles Lakers! https://t.co/WLrzARPOwq",
    "389": "Up after 1.\n\n@Thortontucker: 11 pts, 1 stl\nAustin Reaves: 10 pts https://t.co/oZ8ku5gtcC",
    "390": "Six turnovers by the Golden State Warriors have led to a 32-27 deficit over the Los Angeles Lakers, who took double-digit free throws in the first twelve minutes of play.",
    "391": "With sincere congratulations to the Los Angeles Lakers for the effort, Joe Biden remains the bigger disappointment.",
    "392": "ALERT: New high roller bet posted!\nA bet has been placed for $7,000.00 on Golden State Warriors - Los Angeles Lakers to win $12,329.80.\nTo view this bet or copy it https://t.co/ya3l5hbqmU https://t.co/YX0ufc0Ddd",
    "393": "Live Streaming - Golden State Warriors vs Los Angeles Lakers - NBA\nWatch Full Game Here : https://t.co/RQXeCM1Uqo Golden State Warriors vs Los Angeles Lakers Live Los Angeles Lakers vs Golden State Warriors En Vivo\n#NBA https://t.co/fN1SUQhM4I",
    "394": "Fri, 8th Apr: #GoldenStateWarriors vs #LosAngelesLakers - ODD @ 2.62\nMore details on: https://t.co/cHBtsRn9PM\n#baskettips #basketprediction #basketballbets #nba #usabasket"
}