{
    "0": "Pregame reading: Updated with all the latest as the Sacramento Kings prepare to face the New Orleans Pelicans tonight at Smoothie King Center.\nhttps://t.co/i1yRo3hhM9",
    "1": "Free Pick: #NBA New Orleans Pelicans +1.5 (-110) 3Units 🔥🔥🔥 #DedLocks #LFG #FreePicks",
    "2": "NBA 2K22 New Orleans Pelicans Franchise Ep14 vs Mavs y2g23 https://t.co/EFjZMGPEP2",
    "3": "Friday Night Hoops 🏀\n\nPelicans Live counts you down to Pels/Kings NOW on Bally Sports New Orleans! 📺 https://t.co/DrWBzJj2Ug",
    "4": "Catch me in New Orleans at a Pelicans game….",
    "5": "New Orleans Pelicans Starters:\n\nDevonte' Graham\nNickeil Alexander-Walker\nJosh Hart\nBrandon Ingram\nJonas Valanciunas\n\nPlayers out:\nGarrett Temple\nZion Williamson\n#WBD #NBA #NBATwitter #NBA75",
    "6": "Tonight's starting lineup for the New Orleans Pelicans: Graham, Alexander-Walker, H. Jones, Ingram, Valanciunas  https://t.co/bVWH4Av1bs",
    "7": "🏀New Orleans Pelicans - Sacramento Kings\n🔹Harrison Barnes\n📎Plus de 28,5 PRP\n💵1,84\n\n#TeamParieur https://t.co/xaQMIWyIU5",
    "8": "TIP: New Orleans Pelicans - Sacramento Kings, B. Ingram 24.5 Over, 1.88 by #tipster Eazy (profit this month: +172.84)\n  #betting #Basketball #New #Orleans #Pelicans #Sacramento #Kings",
    "9": "Today's NBA Picks: 8:10 PM ET - Sacramento Kings vs. New Orleans Pelicans - 37 PICKS AVAILABLE: https://t.co/8yGrLzt5u6 #nba",
    "10": "Brooklyn Nets - Indiana Pacers\nMiami Heat - Charlotte Hornets\nNew Orleans Pelicans - Sacramento Kings\nPortland Trail Blazers - Los Angeles Clippers\n\nBet slip link: https://t.co/oKhrgsIar7 https://t.co/nmlVgcc5yp",
    "11": "@GriffinPresser Due to the barriers imposed on us by the creators of this application I am unable to properly explain this concept so I kindly ask you, Mr. Griffin, to bless me with admission to tonight’s battle in support of the New Orleans Basketball Playing Pelicans",
    "12": "**Premium #4**      10-29-21\n\nPick: New Orleans Pelicans +1.5 (-110) 5u\n\nSimply too many people on the Kings spread. If the Pelicans are going to win some games, it's going to start at home. Kings 2-0 on the road, that comes to an end tonight.",
    "13": "The Sacramento Kings are fully healthy headed into tonight’s matchup against the New Orleans Pelicans.",
    "14": "PREVIEW\n\nSacramento Kings @ New Orleans Pelicans\n\nMoneyline Bet Recommended\n\nhttps://t.co/2Dq7XaOyX5",
    "15": "New Orleans Pelicans at Golden State Warriors. Friday, November 05, 2021 at 7:00 pm.\nhttps://t.co/0P61luOXUt https://t.co/3vfy3Kd78d",
    "16": "Gold and Black Saints Colors is Part of New Orleans Culture. \n\nRebrand next Year @SwinCash \n@dg_riff \n\nBlack and Gold Pelicans 🔥🤞🏾\nBrings the City That much Closer to the Pelicans.\n\nThats Elite Front Office Moves.\n(Hope yall see the Vision)",
    "17": "@Cogno_Scentist @sam_amick @TheAthletic Rondo needs to spend more time with Lebron James and Rondo’s former New Orleans Pelicans teammate Anthony Davis anyway.",
    "18": "@price21 @PelicansNBA Kenneth \"Trey\" Murphy III is an American professional basketball player for the New Orleans Pelicans of the National Basketball Association. He played college basketball for the Rice Owls and the Virginia Cavaliers.",
    "19": "Sacramento Kings vs New Orleans Pelicans!? 🧐 #nba #basketball",
    "20": "1st Quarter threesome for this Friday..\n\nToronto Raptors 1Q -2.5\nMiami Heat 1Q -1.5\nNew Orleans Pelicans 1Q +.5 (2U)\n\nMaybe one more later…\n\n#WeTheNorth #HeatCulture #pelicans",
    "21": "Toronto Raptors - Orlando Magic\nBrooklyn Nets - Indiana Pacers\nMiami Heat - Charlotte Hornets\nNew Orleans Pelicans - Sacramento Kings\nDenver Nuggets - Dallas Mavericks\nPortland Trail Blazers - Los Angeles Clippers\n\nBet slip link: https://t.co/dqEgBaJOZD https://t.co/37ehZXND0A",
    "22": "The Sacramento Kings will look to build off of Wednesday's thrilling win when they face the New Orleans Pelicans tonight at the Smoothie King Center 👑 \n\nWednesday's recap ✍\nhttps://t.co/anRf42N2Yi️",
    "23": "NBA PICK 🏀 \n\nSacramento Kings vs New Orleans Pelicans \n\nKings -1.5\n\nOdds: -110\n\nUnits: 1\n\n#GamblingTwiitter",
    "24": "New Orleans Pelicans https://t.co/z4f5X7iuyl",
    "25": "@injuryexpert New Orleans Pelicans to Seattle and their new arena and a revival of the Seattle SuperSonics",
    "26": "𝗚𝗔𝗠𝗘𝗗𝗔𝗬\n🏀 » Sacramento Kings at New Orleans Pelicans\n⏰ » 5:00 PM PST\n📺 » NBCS CA\n📍 » Smoothie King Center https://t.co/Kd11TK4wWF",
    "27": "Sacramento Kings at New Orleans Pelicans – 10/29/21 https://t.co/o93sAEBlsU",
    "28": "Love being back in New Orleans for a Saints home game weekend.. brunch.. then daytime visit to the casino.. need to pick up a new Pelicans jersey for the game tonight.. happy hour then Pels v Kings game then several bar stops later tonight in the French Quarters! 🥵⚜️",
    "29": "@hmfaigen Are you doubting the wisdom of the New Orleans Pelicans' Assistant to the Vice President of Concession Readiness?",
    "30": "#Pelicans shootaround update (Garrett Temple not expected to play vs. Kings due to ankle sprain; reduction in turnovers helping New Orleans set defense; Sacramento scouting report; lineups, notes, keys): https://t.co/vEdeXcWr73 https://t.co/zlWXAOmY9b",
    "31": "also, the new orleans pelicans, it's the new orleans alcatraz.\n\n...\n\n...huh.\n\nit's a basketball team.\n\njust silence. the deafening silence. it's like throwing a gun that you murdered your family with down a canyon, that silence.",
    "32": "@LyleSwithenbank I really get so tired of the “new sports media” its one reason why I listen to podcasts now.  If i want my news and analysis I go to The New Orleans Pelicans podcast, no BS, no agenda just facts!!",
    "33": "@Laynie_Red In Birmingham now. I’m blacked out from the Memphis Grizzlies, Atlanta Hawks, AND New Orleans Pelicans. Past the point of insanity by @WeAreSinclair",
    "34": "@fasteddiegloor @PackripEwing @PelicansNBA @Royals Except even worse there's an ideal market to move the pelicans too but when they were sold to the bensons they had to promise not to move them...new orleans does not have the income levels to really support so many teams.  Seattle might",
    "35": ".@Jim_Eichenhofer's keys to tonight's game ⤵️\n\n▪️ Pels held Hawks to 42% FGs, 27% on three-pointers Wednesday\n▪️ New Orleans bench coming off best performance of 2021-22\n▪️ Valanciunas vs. Holmes in the paint a contrast in center styles\n\n#WBD | @FanDuel https://t.co/d67grbiB2Q",
    "36": "NBA Betting Preview: New Orleans Pelicans vs. Sacramento Kings https://t.co/YDtDqAV0Iu",
    "37": "Revenge Game: Buddy Hield plays New Orleans tonight.  He played 57 games in his career for the Pelicans.",
    "38": "Their 94 points per 100 possessions on offense is more than six points worse than the next worse team this season -- the New Orleans Pelicans. \n\nAlso, because their defense has been pretty decent (14th), they have a better net rating than the Magic and the Thunder",
    "39": "T4\n20. Cleveland Cavs (+3)\n21. Toronto Raptors (-4)\n22. LA Clippers (-6)\n23. Indiana Pacers (-5)\nT5\n24. Sacramento Kings \n25. SA Spurs (+1)\n26. New Orleans Pelicans (-1)\nT6\n27. Orlando Magic (+3)\n28. Houston Rockets (-1)\nT7\n29. OKC Thunder\n30. Detroit Pistons (-2)",
    "40": "NBA Day 1️⃣1️⃣ 🏀🏀🏀\nOrlando Magic vs Toronto Raptors\nCharlotte Hornets vs Miami Heat\nIndiana Pacers vs Brooklyn Nets\nSacramento Kings vs New Orleans Pelicans\nDallas Mavericks vs Denver Nuggets\nLA. Clippers vs Portland Trail Blazers\nCleveland Cavaliers vs LA. Lakers \n#NBA2022",
    "41": "Consensus Line Move:\n2021-10-29 Sacramento Kings at New Orleans Pelicans from 220.00 to 222.50\nOver kryptonite on a stick\n#NBA #bettingpicks #computerscience #makemoney",
    "42": "Sacramento Kings vs New Orleans Pelicans 10/29/2021 Picks Predictions Previews\n\nhttps://t.co/FQyyunjMbV\n\n#basketballpicks #NBA #NBApicks #NBAparlay #NBAprediction #NBAbetting #expertpicks #sportsbetting #freepick #freepicks #sportspicks #handicapper #odds #picks #Kings #Pelicans https://t.co/P9LaETcagx",
    "43": "I'm playing a season on #NBA2K22 as the Lakers. After 73 wins in a row, in game 74, a New Orleans Pelicans team that traded Brandon Ingram for Klay Thompson beats me in OT. GW dunk by Zion from a behind the head pass by Klay. Imagine this happening in real life 😭😭😭",
    "44": "Yall make sure Buddy doesn't leave New Orleans tonight @PelicansNBA",
    "45": "Pelicans are back home in the Smoothie King Center against the Kings. After a close loss vs the Hawks, New Orleans looks to bounce back. Check out my latest Pelican Preview here on @PelicanDebrief! \n\nhttps://t.co/nfBoAYrgbu",
    "46": "A little over a year ago the New Orleans Pelicans had Zion, BI, Jrue, JJ, and Lonzo, as well as some other nice pieces…now they maybe have one of the worst rosters in the league. How does anyone in that front office still have a job?",
    "47": "The New Orleans Pelicans look to rebound from a tough loss tonight vs the Sacramento Kings in the Smoothie King Center @ 7PM CST. \n\nIf you aren’t busy tonight try to go out and support the team. You can get lower bowl tickets for under $10.",
    "48": "New Orleans Pelicans - Sacramento Kings İddaa Tahmini 30.10.21\nhttps://t.co/0pR3Ju811I",
    "49": "Zion Williamson ทีม New Orleans pelicans....Super cool!!! https://t.co/0HioXRtRy7",
    "50": "@thatdamnbrook “Where the rest of it at” Why? So you can stash them New Orleans Pelicans https://t.co/T3S9AVx7M7",
    "51": "The New Orleans Pelicans have a chance to post their first home victory of the season by beating the Sacramento Kings tonight.\n\nLet’s Geaux! https://t.co/OQJIpIEUV9 https://t.co/BjE6TlALJL",
    "52": "Live pregame, in-game and postgame updates on tonight’s NBA game between the Sacramento Kings and New Orleans Pelicans. https://t.co/GTHCaTjhhV",
    "53": "Live pregame, in-game and postgame updates on tonight’s NBA game between the Sacramento Kings and New Orleans Pelicans. https://t.co/GijTNDwR4L",
    "54": "Live pregame, in-game and postgame updates on tonight’s NBA game between the Sacramento Kings and New Orleans Pelicans. https://t.co/jNY5CIeFD6",
    "55": "New Orleans Pelicans 🆚 New York Knicks\n \nThe New Orleans Pelicans will chase a home victory over the New York Knicks when the teams meet in an NBA Regular Season game at the Smoothie King Center in New Orleans.\n\nRead more about it in our blog 👉 https://t.co/mrVEQb8tOx https://t.co/o0kItf1XQ1",
    "56": "One more time, @chapulana brings you a delicious daily package containing a handful of good/bad @DraftKings plays for tonight’s main slate, highlighted by Richaun Holmes and the Sacramento Kings taking on the New Orleans Pelicans https://t.co/2UYwULGqwj",
    "57": "Real Money Picks Betting Card 10/29/21\n\nLight card for the model \n\nCFB\nNavy +11\n\nNBA\nNew Orleans Pelicans +2",
    "58": "New Orleans #Pelicans: “This was for my anime f ...\n \nhttps://t.co/bngJXaAFVz\n \n#Louisiana #NBASouthwest #NBASouthwestDivision #NBAWestern #NBAWesternConference #NBAWesternConferenceSouthwest #NBAWesternConferenceSouthwestDivision #NewOrleans #NewOrleansPelicans #NewOrleans https://t.co/umiWgLpQ3e",
    "59": "Philadelphia 76ers center Joel Embiid is dealing with knee problems early in the 2021-22 NBA season. \nPer ESPN's Ramona Shelburne, Embiid said he \"couldn't walk for two days\" after the Sixers' season-opening win over the New Orleans Pelicans on Oct. 20.",
    "60": "Willie Green improving New Orleans Pelicans rotations around Brandon Ingram | Defense better than it looks\n\nhttps://t.co/WeNJD9yyHg https://t.co/2K8gRSvtzK",
    "61": "\"Multiple Man\" (NBA: 2-3)\npresents\n100* \"ROAD WARRIOR\"\n\nSACRAMENTO KINGS (-2) over New Orleans Pelicans https://t.co/YxYAdUAJDE",
    "62": "Surprised to see so many empty seats in the Lower Bowl up in San Francisco at this Warriors-Grizzlies game.\n\nNot a good look for the League or for the New Orleans Pelicans.",
    "63": "New Orleans next? Julius former team? Had a bad scoring night? Sorry pelicans Julius dropping 40 piece on y’all",
    "64": "By any means necessary , Knicks Win (4-1) , can't complain about the sloppy play in the final minutes , we just beat a 4-0 squad in their house after spanking the 76ers it has been a hell of a week to be a Knicks fan now we get the Zion Williamson less New Orleans Pelicans next ! https://t.co/tUmBMr3RUu",
    "65": "Sacramento Kings vs. New Orleans Pelicans - 10/29/2021 Free Pick &amp; NBA Betting Prediction https://t.co/gCYvnn1dyH #FreePicks ... https://t.co/x8dBu2jCC4",
    "66": "New Orleans Pelicans vs Atlanta Hawks - NBA prediction https://t.co/O9BweMWcYS",
    "67": "@JustEsBaraheni Just another player that the joke of a franchise new Orleans pelicans wasted",
    "68": "@TMZ What's next \"Chicago Bulls\" \"Memphis Grizzlies\" \"New Orleans Pelicans\" \"Baltimore Orioles\" \" St Louis Cardinals\""
}