{
    "0": "@JSchlick03 @warriors That’s Steve Kerr for you lmao",
    "1": "@LevoSkeet @REALEST2DOIT_25 @SwizoYT @NBAAllStar @warriors @Money23Green Idk what your argument is, you really aren’t making an argument, just trolling and trying to twist the conversation. Efficiency is how efficiently a guy scores the ball. Draymond isn’t good in that regard. He’s average to below average in many areas in that regard",
    "2": "@warriors @KlayThompson @AMGTrip he finna go for 30 lmao bitch look like Deebo 🤣🤣",
    "3": "@jonsanders32 @area2srs @comcast @Olympics @warriors We are having our own installed as we speak... https://t.co/7e1ApW6S1L",
    "4": "@aparikh24 @warriors Shut up 😂 clearly don’t know what’s up with the warriors \n\nIsn’t beli our injured ? 🤣 how do they put him 🤡",
    "5": "3 Warrior from @warriors \n#DubNation https://t.co/3TgNrTgXDU",
    "6": "@warriors Let’s get this dub today fellas",
    "7": "@NA30SC @warriors @Money23Green And you lost an argument https://t.co/qTyPfJ1H4X",
    "8": "Leggo PG 30 @StephenCurry30 and the @warriors 💦 💦 time",
    "9": "@area2srs @News24680 @comcast @Olympics @warriors Isn't Moraga rich enough to just buy their own cables??? 🤷🏾‍♂️ https://t.co/NyYD7DLSL8",
    "10": "@LevoSkeet @REALEST2DOIT_25 @SwizoYT @NBAAllStar @warriors @Money23Green Green is well below Myles turner in terms of PER and many other efficiency stats. So I’m not using his overall efficiency as some way to validate his all star appearance. You wanna talk net rating defense passing then sure I’ll hear it, scoring efficiency? Not buying it for a min",
    "11": "@warriors @KlayThompson should come in next time in a Lyft bike",
    "12": "@warriors idk Steve",
    "13": "#NBA  Today's Lineups\n\n#SacramentoProud\nSacramento Kings Starting 5:\nDavion Mitchell\nTyrese Haliburton\nHarrison Barnes\nMaurice Harkless\nRichaun Holmes\n\n#DubNation\nGolden State Warriors Starting 5:\nStarters\nStephen Curry\nMoses Moody\nKlay Thompson\nAndrew Wiggins\nKevon Looney",
    "14": "Warriors' Draymond Green projects his timeline for return: \"I just ... (East Bay Times)\n\nSAN FRANCISCO - The last time Draymond Green saw game action was January 9.\n\nAdd your highlights:\nhttps://t.co/EPKhxm7MNL\n #GoldenStateWarriors",
    "15": "Lock in! 🔒 #DubNation! Let’s go @warriors! https://t.co/BW5ydPT3m5",
    "16": "@Patrickgreen18 @REALEST2DOIT_25 @SwizoYT @NBAAllStar @warriors @Money23Green You conceded the efficiency is not awful and not even below average, just based on stats, I'll take it.",
    "17": "@Patrickgreen18 @REALEST2DOIT_25 @SwizoYT @NBAAllStar @warriors @Money23Green Smarts not young enough that I think he takes that jump defensively, but Tatum (speaking of efficiency), is good enough that I think he can eventually get the wins necessary to carry some defensive specialist to the all star game.",
    "18": "Suns don finish people 😂\n\nSuns streak comes to an  end \n\nYk what to do @warriors @StephenCurry30 @KlayThompson",
    "19": "@News24680 @comcast @Olympics @warriors Can we leave a spare one on the side of the road for the next time?",
    "20": "@LevoSkeet @REALEST2DOIT_25 @SwizoYT @NBAAllStar @warriors @Money23Green I don’t concede anything, on low volume he’s not very efficient. As you said he’s barely league average on low volume playing off tons of great shooters. It’s laughable",
    "21": "@warriors Let’s extend the winning streak to 8🔥",
    "22": "@area2srs @comcast @Olympics @warriors That one pole... that pole on Moraga Road... we were talking about it about 15 minutes before the wires fell... anyone care to talk about infrastructure?",
    "23": "@warriors Moses really either in the G league or starting lmao",
    "24": "Kings vs Golden State Warriors live Basketball.\nLive:- https://t.co/IXbvt9Gori https://t.co/LCe3dgnf02",
    "25": "@Patrickgreen18 @REALEST2DOIT_25 @SwizoYT @NBAAllStar @warriors @Money23Green Totally fine argument, and that's stuff I don't necessarily disagree with.",
    "26": "@LevoSkeet @REALEST2DOIT_25 @SwizoYT @NBAAllStar @warriors @Money23Green I’m just waiting for tatum to carry smart to some allstar appearances as well! Because defense!",
    "27": "@warriors Is there a stream for Germany?",
    "28": "@warriors @Money23Green If we’re being honest Jordan Poole has been the Warriors 3rd best player this season not Draymond 🤷🏻‍♂️",
    "29": "@Patrickgreen18 @REALEST2DOIT_25 @SwizoYT @NBAAllStar @warriors @Money23Green Two different arguments. Efficiency, you at least concede the above average part, but of course draymond ain't the guy to go get baskets when you need them.",
    "30": "@LevoSkeet @REALEST2DOIT_25 @SwizoYT @NBAAllStar @warriors @Money23Green Idk call me crazy I look at a guy that can’t shoot the basketball from anywhere, can’t hit fts , can’t score out of the post and isn’t a beast on the glass and doesn’t exactly scream allstar to me. But that curry guy 🤔",
    "31": "@warriors @Money23Green Now let’s sell some bitcoin.",
    "32": "UNF has turned into prime golden state warriors this is unbelievable.",
    "33": "@warriors Tyrese Haliburton owns Stephen Lurry 😭😭😭",
    "34": "@eshaLegal @DanielDumbrill @injaelee @michaelsobolik @warriors @chamath thinkers and researchers found sufficient counter-examples and problems to debunk the theory.\n\nKant also couldn't get past the individual level to the social, which the Fichte-Schelling-Hegel (and lesser known figures) to Marx trajectory was all about.",
    "35": "@LevoSkeet @REALEST2DOIT_25 @SwizoYT @NBAAllStar @warriors @Money23Green I don’t actually, if you asked him to score the ball he’s awful. If you can’t provide anything in impactful in terms of scoring then you shouldn’t be an allstar, especially missing games . But lucky for him he plays with curry so he makes it",
    "36": "@aparikh24 @warriors Klay’s secondary position is SF🤦🏾‍♂️",
    "37": "@SamaliTimi @warriors Big men built like Looney don’t get injured.",
    "38": "@warriors 💙💛💙💛💙💛💙💛\n\n.....🏀\n..KEEP\n..CALM\n....AND\nSPLASH\n.....ON\n\n#GoWarriors \n#DubNation \n#LockedIn\n\n💙💛💙💛💙💛💙💛 https://t.co/A2FCepL9xc",
    "39": "@HermanKosta @warriors Also coming off two bad injuries he’s only played ten games",
    "40": "@aparikh24 @warriors Klay is 6'6. He can easily be a small forward.",
    "41": "@warriors Y’all hella early",
    "42": "Let’s go @warriors!!! Let’s get this W!!! #DubNation",
    "43": "@warriors Lock in",
    "44": "@LevoSkeet @REALEST2DOIT_25 @SwizoYT @NBAAllStar @warriors @Money23Green In terms of player efficiency rating he’s floating around guys like Scottie barnes , Larry nance , diallo, Carmelo,",
    "45": "@Patrickgreen18 @REALEST2DOIT_25 @SwizoYT @NBAAllStar @warriors @Money23Green Thanks I try and the Draymond arguments are always assisted by the titles but at least you agree he's been above average efficient this year. Haha",
    "46": "@warriors Iggans Wiggins of Andrew",
    "47": "All smiles on #WarriorsGround \n\nStream the game live 👉 https://t.co/OMrtDufAON https://t.co/9DmFcikwvh",
    "48": "@Rahul_Reaper57 @JaMorant @NBCSWarriors @warriors @WarriorsPR @NBA @NBATV @NBAPR @NBAHistory @NBAonTNT @NBAAllStar @StephenCurry30 I’m confused who took out the warriors last year 😉",
    "49": "@eshaLegal @DanielDumbrill @injaelee @michaelsobolik @warriors @chamath I don't know if he has said this out loud but the genealogy is there, from Neo-Kantianism to analytic philosophy to his \"Universal Grammar\" you have very similar abstract universal ideas of Reason that serve as a matrix for concrete thought (or speech), but which subsequent...",
    "50": "Golden State Warriors' Draymond Green says he'll miss All-Star Game, aims to return in 3-4 weeks - via @ESPN App https://t.co/zfU9E9ZfOm",
    "51": "🏀 Golden State Warriors vs Sacramento Kings\n🏆 NBA\n🗓 03/feb.\n⏰ 23:59\n📺 NBA LEAGUE PASS",
    "52": "@warriors Moody minutes! You love to see it",
    "53": "@NA30SC @warriors @Money23Green Ant, jjj, dejounte, lamelo, and jb all better + didn’t name BI + stalker",
    "54": "@warriors LETS GET IT DONE.",
    "55": "@NotChadge @warriors Buddy it was a back to back and they were banged up",
    "56": "Getting serious. Jacket time for #azabuki @warriors @ Chase Center https://t.co/b2RdLxCgF3",
    "57": "Sacramento Kings vs Golden State Warriors live Basketball.\nLive:- https://t.co/I0c5FTvjcZ\n#Kings #Warriors #NBA #nbalivemobile https://t.co/DxOVuCG6Iq",
    "58": "@warriors @Aidonis__ MOODY SIGHTING",
    "59": "@LevoSkeet @REALEST2DOIT_25 @SwizoYT @NBAAllStar @warriors @Money23Green The 19-20 season was one of his worst seasons of his career. Can’t make this shit up 😂, they got people like you in every fanbase I guess. At least you have titles to base this madness off unlike most nba fans",
    "60": "@ayden_mcdowell @warriors There is more to Basketball than that. With Draymond they were#1 without they fell 3 games behind the Suns. Losing to teams that they should have dusted! That's what I see.",
    "61": "Sacramento Kings (+13.5) @ Golden State Warriors #DubNation #SacramentoProud #NBA #NBATwitter #NBA75",
    "62": "@eshaLegal @DanielDumbrill @injaelee @michaelsobolik @warriors @chamath So he can only appeal to an ethic of self, rather than what a system of justice would look like let alone how to get there.",
    "63": "@warriors Let’s get this Win Stay Aggressive shoot the ball Moody attack the rim Warriors",
    "64": "Warriors’ Draymond Green projects his timeline for return: “I just got to get back and dominate” #GoldenState #Warriors #NBA https://t.co/4552tBskYl",
    "65": "@REALEST2DOIT_25 @NBAAllStar @warriors @Money23Green then why does he make all star teams and win goal medals?  🤷‍♂️💍💍💍",
    "66": "Golden State Warriors star Draymond Green won't play in All-Star Game hopes to avoid back surgery which could have been a setback for the All Star + the team",
    "67": "@_JanDanyell @ayden_mcdowell @warriors @Money23Green Draymond could never be half the player AD is on defense and definitely not offense . He fooling everybody",
    "68": "@dqmayne @warriors @KlayThompson I fw with klay lol",
    "69": "Who has the biggest winning streak in the NBA now bitches???? @warriors #DubNation",
    "70": "@warriors MOODY MASTERCLASS",
    "71": "@SwizoYT @REALEST2DOIT_25 @NBAAllStar @warriors @Money23Green How about 2019 when Curry and Thompson were out and he shot 38% from the field on the worst team in the NBA? Most overrated player in the NBA",
    "72": "@eshaLegal @DanielDumbrill @injaelee @michaelsobolik @warriors @chamath 'brain-works' that is supposed to hold for everybody, but in actuality applies to nobody.",
    "73": "@warriors Moody on the starting lineup😎",
    "74": "@A2J15 @warriors Nice!! Enjoy man, it's a great venue!",
    "75": "@Patrickgreen18 @REALEST2DOIT_25 @SwizoYT @NBAAllStar @warriors @Money23Green What, I just explained it to you. How is a guy well above the median in the any weighted efficiency stats below average ...by definition? 😂",
    "76": "@NA30SC @warriors @Money23Green Kum bucket gpii and wiseman&gt; casual saying “go watch cartoons”💀",
    "77": "@Patrickgreen18 @REALEST2DOIT_25 @SwizoYT @NBAAllStar @warriors @Money23Green O saying his sucks is dismissed but pointing out that it shouldn't really be debatable that he's an all star (this year especially) isn't controversial. Are there even any analysts that disagree?",
    "78": "@eshaLegal @DanielDumbrill @injaelee @michaelsobolik @warriors @chamath \"what can I hope for?\" is Kant's own nugget version of his moral philosophy; likewise Chomsky's epistemology is Kantian &amp; subject to the same criticisms Kant faced. Marxism of course emerged out of a long series of critiques of Kant; basically his abstract universal...",
    "79": "@warriors win today pls. Phoenix losing rn",
    "80": "@LevoSkeet @REALEST2DOIT_25 @SwizoYT @NBAAllStar @warriors @Money23Green Actually no they don’t. They show he’s mediocre to bad in many areas offensively",
    "81": "#DubNation grandpas first game at 78 years old!! @WarriorsPR @warriors https://t.co/QfbHfBTNvc",
    "82": "@LevoSkeet @REALEST2DOIT_25 @SwizoYT @NBAAllStar @warriors @Money23Green Never said he wasn’t impactful to their titles absolutely is. That’s the issue with fans , you say a guy isn’t an allstar and they act like you said he sucks overall. He’s a star in his role, not an allstar",
    "83": "@warriors Hoping Moody continues to show up.",
    "84": "@LevoSkeet @REALEST2DOIT_25 @SwizoYT @NBAAllStar @warriors @Money23Green Yeah they slip him out of curry screens and he plays 4 on 3 on many of his possessions. Obviously not a traditional big , he’s more of a playmaking 4 but regardless his efficiency is low while playing at an advantage",
    "85": "@Patrickgreen18 @REALEST2DOIT_25 @SwizoYT @NBAAllStar @warriors @Money23Green Although taking passing out of \"offense\" doesn't make sense. I do agree, he's not a good floor, but he might be the best in the league to take good to great and if rings are the goal, it's an easy choice.",
    "86": "#NBA\n\n@warriors -13\n\n@Rich_Holmes22 \nOVER 10.5 Pts",
    "87": "@MikeRos95911018 @BankStatementzz @alexontweeter99 @GSWRevengeTour @warriors So hundreds of players, coaches, media and thousands of fans say Draymond has been and continues to be among the elite NBA All-Stars. But some random guy on Twitter says he’s not. I guess we’ll never know for sure. 😂😂😂😂😂",
    "88": "Sacramento Kings Vs Golden State Warriors | Live Reactions And Play By Play https://t.co/WXdNiwgLWb via @YouTube",
    "89": "@warriors @juanonjuan10 @StephenCurry30 OKAY STEPH",
    "90": "@warriors @KlayThompson no boat??",
    "91": "@LevoSkeet @REALEST2DOIT_25 @SwizoYT @NBAAllStar @warriors @Money23Green Screening and passing is important in every offense…. We’ve seen what he was without curry and Thompson, a bottom 6 nba team. Great defender, very good passer, subpar offensively. If he wasn’t on currys team he wouldn’t sniff an allstar game ever.",
    "92": "@Patrickgreen18 @REALEST2DOIT_25 @SwizoYT @NBAAllStar @warriors @Money23Green Just be one of the best screeners, passers and a generational defensive player...yup doesn't sound like enough.",
    "93": "Sacramento Kings / Golden State Warriors 🏀 NBA Wager\n\n$55,000 to win $50,000 🤝 #GamblingTwitter\n\nWe are going for our 16th win in a row. No stupid worthless parlays, no small bets, just big money with real winners 💵\n\nDM for access 💰 https://t.co/Txi4jVDIPd",
    "94": "@warriors @Money23Green congrats! #GoWarriors! #NBAAllStar 😎🤙🏾",
    "95": "@NBAAllStar @NBA @warriors @Money23Green Why in the world was Draymond Green picked? Not even avg. double figures in any category.",
    "96": "@Patrickgreen18 @REALEST2DOIT_25 @SwizoYT @NBAAllStar @warriors @Money23Green Wait you think he plays a traditional big role? Haha come on that might be the worst one yet. Draymond Dampier.",
    "97": "Some interesting bets to make when the @SacramentoKings take on the @warriors tonight. https://t.co/j5RfKvym5Z https://t.co/ftgJateDpB",
    "98": "@YashDoshi123 @SpiderCarnage06 @warriors 3-4* close enough tho https://t.co/NGywRCb3ng",
    "99": "@warriors Congrats to Moody for earning a starting spot on the rotation. Hmm #NBA 😎🤙🏾",
    "100": "@Patrickgreen18 @REALEST2DOIT_25 @SwizoYT @NBAAllStar @warriors @Money23Green Yea but how in the world would you not weigh those categories. Stats 101.",
    "101": "@Patrickgreen18 @REALEST2DOIT_25 @SwizoYT @NBAAllStar @warriors @Money23Green You're trying kid but you're making your own counter arguments with those points.",
    "102": "@DUBNATION2000 @warriors @KlayThompson He’s probably getting a bag for this lol",
    "103": "@D_C_M_15 @NBAAllStar @NBA @warriors @Money23Green I would assume you mean the coaches snubbed him?",
    "104": "@SpiderCarnage06 @warriors Atleast 3-4 weeks",
    "105": "@warriors Called it https://t.co/muKZkm4l9v",
    "106": "@warriors Shout Out to Kevon Looney for staying injured free and never misses a game ! Improved a lot as well !!",
    "107": "@Patrickgreen18 @REALEST2DOIT_25 @SwizoYT @NBAAllStar @warriors @Money23Green Screening and passing definitely not important in that offense.",
    "108": "@Patrickgreen18 @REALEST2DOIT_25 @SwizoYT @NBAAllStar @warriors @Money23Green If he's in the top 150 even in those categories...and there's close to 400 players...this math isn't hard. He's above average and actually a few tiers above average.",
    "109": "@LevoSkeet @REALEST2DOIT_25 @SwizoYT @NBAAllStar @warriors @Money23Green His fg% is still below average for a low volume big also . Dude barely attempts shots and is still bad everywhere",
    "110": "@Blazersplzwin @warriors Weak bait",
    "111": "@warriors 40 wins &gt;",
    "112": "@LevoSkeet @REALEST2DOIT_25 @SwizoYT @NBAAllStar @warriors @Money23Green Efficiency is all of your percentages from all areas. He’s simply not good offensively, there’s no argument. All defense absolutely. Not an allstar",
    "113": "@warriors Moooooody",
    "114": "@Randomp00711062 @jadenfelix34 @TrolledByLBJ @LeChefCurry30 @HardensBetta @warriors @juanonjuan10 @StephenCurry30 0 bitches",
    "115": "@warriors Power Wiggins? https://t.co/RJIQgrnEJZ",
    "116": "@warriors MOOOOODYYYYY",
    "117": "@warriors Conclusion: young ones doesn't rest, moody fr played 4 games in 5 days and all of em are heavy mins",
    "118": "@NotChadge @warriors Worked out though",
    "119": "@warriors MOODY ROTY AGENDA",
    "120": "@warriors What are these line ups bro why is moody in take him out and put someone else Klay is not a small forward put beli in",
    "121": "@warriors Kerr loves moody",
    "122": "@warriors moody earned his shit",
    "123": "Sacramento Kings / Golden State Warriors 🏀 NBA Wager \n\n$55,000 to win $50,000 💵\n\nDM for NBA 🏀 Access. Thanks! https://t.co/zXjlBkXlhe",
    "124": "@warriors Moises modey getting rewarded",
    "125": "@Vasu @rmandal @futurefitapp I’m still mad the @warriors haven’t picked you up on a 10 day… https://t.co/Z0eTPVrZvv",
    "126": "@NBAAllStar @warriors @Money23Green How the hell he a all star",
    "127": "@SpiderCarnage06 @warriors He said at least 2-3 weeks today so I’d guess Mid- late march",
    "128": "@warriors Wiggins 40 piece incoming",
    "129": "@warriors Moody 40 bomb tonight",
    "130": "@warriors @KlayThompson All Star !!!",
    "131": "@warriors Love love them.",
    "132": "@warriors Moddy of moses",
    "133": "@warriors Anybody know when Dray is coming back?",
    "134": "@warriors LETS GOO MOODY GETTING REWARDED FOR HIS GOOD PLAY",
    "135": "@warriors let’s go dubbbbbbbbsssss",
    "136": "@warriors Lets get it!",
    "137": "@DanielDumbrill @injaelee @michaelsobolik @warriors @chamath Yikes. Cringe. He should be stopped from appearing in public",
    "138": "Leading off ⤵️ https://t.co/Pe24D5CAgE",
    "139": "@LeBronGoCrazyy @warriors @juanonjuan10 @StephenCurry30 Someone's Jealous 😂",
    "140": "@Patrickgreen18 @REALEST2DOIT_25 @SwizoYT @NBAAllStar @warriors @Money23Green So the stats that would matter for weighing efficiency, i.e- efg and true shooting are below average? what's the league average?",
    "141": "@NA30SC @warriors @Money23Green Dray not even the best defender on his team💀",
    "142": "@warriors @Oracle Kings winning",
    "143": "@LevoSkeet @REALEST2DOIT_25 @SwizoYT @NBAAllStar @warriors @Money23Green Yeah your arrogance made me dig into the stats deeper and yes his efficiency is below average to bad especially when you consider every shot he attempts is basically wide open playing off Steph. Your cherry picked categories are decent overall he’s awful in terms of efficiency",
    "144": "EricPMusselman: @warriorsvox @mosesmoody starting again tonight for the @warriors vs @SacramentoKings. I know what @DanyelleSargent and I will have on NBA League Pass tonight at 9PM central.",
    "145": "@teccccy @guythemenace @KingLone5 @NBAAllStar @warriors @Money23Green Idk why I even bother reading the tweets abt ppl saying “he averages a triple single”",
    "146": "@Elcallz @warriors @Money23Green S T F U.",
    "147": "@warriors @KlayThompson Sea Captain 👨‍✈️ #DubNation",
    "148": "@warriors @KlayThompson Klay taking care of the Environement, no air polution, more championships.",
    "149": "@NA30SC @warriors @Money23Green Gimme old ass chuck over draymond",
    "150": "@warriors @KlayThompson He must have taken the boat 😎",
    "151": "@LeBronGoCrazyy @warriors @KlayThompson Curry And His Super Team Thanks For The Rings LeBron's Cleveland Gave Him",
    "152": "@warriors @Money23Green YESSSSSSSSSSS ! WTG Draymond!!",
    "153": "@warriors @KlayThompson Wear a helmet my man.",
    "154": "@Patrickgreen18 @REALEST2DOIT_25 @SwizoYT @NBAAllStar @warriors @Money23Green \"those stats are decent\"",
    "155": "i love that @BJustinR and our son are at the @warriors game tonight❤️",
    "156": "@Patrickgreen18 @REALEST2DOIT_25 @SwizoYT @NBAAllStar @warriors @Money23Green hahahaha did you just expand it to include guys that played less than 10 minutes? I mean there's cherry picking and then blatantly not understanding statistics. Stretch armstrong stretch.",
    "157": "@warriors @Oracle YESSIR",
    "158": "@warriors @Oracle WARRIORS!!!",
    "159": "@warriors @Oracle We out here #DubNation https://t.co/nyY3yGLQjP",
    "160": "@haileyaleah2 @memgrizz next stop @warriors",
    "161": "@warriors @Oracle Bust",
    "162": "@warriors @Oracle come on 💙💛",
    "163": "@TrolledByLBJ @LeChefCurry30 @HardensBetta @warriors @juanonjuan10 @StephenCurry30 0 rings 💀",
    "164": "@warriors @Oracle Lock in",
    "165": "Range finder 📍 \n\n@Oracle || Game Ready https://t.co/uF0Oah2F8I",
    "166": "@LeChefCurry30 @HardensBetta @warriors @juanonjuan10 @StephenCurry30 0 finals mvp’s",
    "167": "@warriors Get one big man, I beg",
    "168": "@warriors @juanonjuan10 @StephenCurry30 with all the respect in the world stephen is so hot in that suit 🥺🥺🥺🥺",
    "169": "@HermanKosta @warriors I live just north of Sac but made the trip down",
    "170": "@warriors Let’s get it. @Money23Green",
    "171": "ALERT: New high roller bet posted!\nA bet has been placed for $49,032.26 on Golden State Warriors - Sacramento Kings to win $411,870.98.\nTo view this bet or copy it https://t.co/3elXfgY8uy https://t.co/BvsePeIpww",
    "172": "@DanielDumbrill @injaelee @michaelsobolik @warriors @chamath How old is this?",
    "173": "@LevoSkeet @REALEST2DOIT_25 @SwizoYT @NBAAllStar @warriors @Money23Green Awful",
    "174": "Golden State Warriors - Sacramento Kings\n\nBet slip link: https://t.co/xnnfX3YirX https://t.co/LAgf5SVuTR",
    "175": "@HardensBetta @warriors @juanonjuan10 @StephenCurry30 4 points",
    "176": "Draymond Green injury update | GSW vs Kings https://t.co/JvMbQ3lXbY via @YouTube\n\n#NBA #DraymondGreen #StephenCurry #Warriors #GoldenStateWarriors #NBAALLSTAR",
    "177": "@A2J15 @warriors Extended Kuminga and Moody minutes are great. Have a great time anyway! Wish I actually lived in SF so I could as well lol",
    "178": "@warriors @KlayThompson This is very Klay thing",
    "179": "@warriors @Money23Green @Money23Green\nWell deserved. 👏\nThe best defender in the world. 🙌",
    "180": "@LevoSkeet @REALEST2DOIT_25 @SwizoYT @NBAAllStar @warriors @Money23Green Draymond green is ranked 135th Efg%\n86th in Fg% \n171st in true shooting, 453rd in ft%, 365th in 3pt% , 147th PER",
    "181": "@HermanKosta @warriors I’m not against a blowout by any means lol",
    "182": "@warriors @KlayThompson did he take BART?",
    "183": "🏀The Kings were able to snap their losing skid last night against the Nets as they travel to Golden State to take on the Warriors who are winners of seven straight. @JohnRyanSports1 breaks down this game from a betting perspective in this article.\n\nhttps://t.co/XDHIgJis34 https://t.co/X4Ixkrp1xV",
    "184": "@warriors @KlayThompson Life goes in cycles, what goes around comes back around 🚲🚴🏽‍♂️",
    "185": "@warriors @juanonjuan10 @StephenCurry30 Lookin sharp men",
    "186": "@A2J15 @warriors Not gonna lie, i hope you dont see a great game. 😅 We should blow these bums out",
    "187": "@warriors @juanonjuan10 @StephenCurry30 Steph been dressin like the CEO lately ...I like it!!",
    "188": "@LeBronGoCrazyy @warriors @juanonjuan10 @StephenCurry30 Boy if you don’t get your under .500 team loving a** off the Warriors team page🤣. Go troll the Clippers. 👈That’s who y’all play tonight.",
    "189": "@warriors @KlayThompson He forgot he had a game",
    "190": "@EricPMusselman @mosesmoody @warriors @SacramentoKings @DanyelleSargent Well Coach, It shows that he was taught well, and has a good feel for the game!",
    "191": "@warriors @NBCSAuthentic @957thegame @Chase LETS GO WARRIORS, LETS GO WARRIORS.",
    "192": "@LeBronGoCrazyy @warriors @juanonjuan10 @StephenCurry30 Lebron fan talking about superteams?? Man ur trolling is shit",
    "193": "@warriors @juanonjuan10 @StephenCurry30 @StephenCurry30 My Warriors Favorite Player",
    "194": "@ayden_mcdowell @warriors @Money23Green Cause his IQ and defense is way better than AD who's always injured. And stats dont give justice to what Draymond do.",
    "195": "First @warriors game at Chase Center. Should be a great one👍👍 https://t.co/NfxBBVPGDz",
    "196": "@warriors congrats, dray!",
    "197": "@warriors @juanonjuan10 @StephenCurry30 It's gonna be a Poole party again",
    "198": "Putting some time in on apex legends before my @warriors play tonight 🔥 Apex streams officially start next week 💙 can't wait",
    "199": "@PAYNE_21 They were going to do that with any name.\n\nThe only name that stood a chance was Warriors if they did it 10 years ago and kept the logo. But even then they would say stupid stuff about sharing it with Golden State or something.",
    "200": "@Vette510 @warriors Like what cause he certainly can’t score. He has no shot creation either via paint penetration.",
    "201": "@warriors @KlayThompson Yo wtf Klay😂",
    "202": "@warriors @juanonjuan10 @StephenCurry30 Steph lookin dapper",
    "203": "@warriors @KlayThompson @PegasusLace big bike guy 😂",
    "204": "@ayden_mcdowell @warriors Those 3 games. And, Draymond does things that don't show up in stats but, everyone can see it!",
    "205": "@ayden_mcdowell @warriors ADisney is trash this season wtf you talkin about",
    "206": "@warriors @juanonjuan10 @StephenCurry30 Wowww Stephen 😍😍😍",
    "207": "@warriors @KlayThompson KT get the @juanonjuan10 hook up with the bike?",
    "208": "Hey @Money23Green &amp; @warriors @WarriorsPR grandpa Leonard is 78 years old and this is his 1st warriors game! Section 101 WCA PLEASE GIVE HIM A SHOUT OUT!! 🏀 he’s been a life long fan! https://t.co/XsH7zEDXOm",
    "209": "@warriors @juanonjuan10 @StephenCurry30 I be the cleanest when I step in the arena.\n-Mac Dre",
    "210": "@LeBronGoCrazyy @warriors @juanonjuan10 @StephenCurry30 Ratio",
    "211": "@warriors @juanonjuan10 @StephenCurry30 Curry 50 points",
    "212": "@warriors @juanonjuan10 @StephenCurry30 Steph in a suit. 💪🏻💪🏻💪🏻",
    "213": "@warriors @juanonjuan10 @StephenCurry30 Steph masterclass for sure and the win",
    "214": "@warriors @Money23Green Well Deserved 👏👏👏",
    "215": "@warriors @juanonjuan10 @StephenCurry30 Mis bbs",
    "216": "@warriors @KlayThompson These bike run from $800 to 12k",
    "217": "@warriors @juanonjuan10 @StephenCurry30 Curry w",
    "218": "Welcome to the party. https://t.co/a2G6IQ1wor",
    "219": "@ESPNPR @bethmowins @heydb @saltersl @NBA @warriors @utahjazz @ESPNNBA These women are exceptional in every way. Honored to have had the pleasure of working with them!!!",
    "220": "@jdg21_ @warriors I need to see that step back one time 🔥",
    "221": "@warriors @KlayThompson Love you Klay 🥰🥰🥰",
    "222": "@Prooxyau1 @PainJulianmode @LeBronGoCrazyy @warriors @KlayThompson freak is right because his own mom calls him that https://t.co/tw4Drkz54A",
    "223": "⭐️ | STEPHEN CURRY, DRAYMOND GREEN E ANDREW WIGGINS FORAM CONVOCADOS E O GOLDEN STATE WARRIORS TERÁ 3 ALL-STARS NO ALL-STAR GAME DESSE ANO! 🔥🔥🔥\n\n#DubNation #NBA75 https://t.co/4Wq4OHWLp1",
    "224": "@Patrickgreen18 @REALEST2DOIT_25 @SwizoYT @NBAAllStar @warriors @Money23Green Marcus Smart gets to Draymond's level on defense then absolutely. Also funny that you bring up efficiency but then cry about how efficiency stats are cherry-picking, be consistent at least.",
    "225": "50pts Curry @GoIdenState  @warriors",
    "226": "@warriors @KlayThompson That's Draymond replacement for the Allstar",
    "227": "@warriors BUM IS THE ONLY WAY TO DESCRIBE A TRIPLE SINGLE DUDE WHO HAS BAMBOOZLED HIS WAY INTO THE ALL STAR GAME 😂 YOU KNOW YOU AIN'T NO ALL STAR!",
    "228": "@warriors Let’s go!!!! @Money23Green 🔥🔥🔥💕",
    "229": "Draymond Green's Best Plays of the Season (So Far!) | 2021-2022 Highlights #GoldenState #Warriors #NBA Video: https://t.co/C6sEilPa3p",
    "230": "@warriors @KlayThompson no excuses whatsoever to not win by more than 15 after the way they won last game...",
    "231": "@LeBronGoCrazyy @joffffffffffff @RookieRocc @warriors @KlayThompson Rent Free + he owns you",
    "232": "@warriors @KlayThompson Let's goooooooo",
    "233": "@LeBronGoCrazyy @warriors @KlayThompson Ratio then",
    "234": "@LevoSkeet @REALEST2DOIT_25 @SwizoYT @NBAAllStar @warriors @Money23Green Cherry picking stats dude averages 8pts, 7rbs and 6 asts on 53/28/53 splits playing with Steph curry lmao. Again All defense absolutely, all star hell no. With your logic Marcus smart should be an allstar too",
    "235": "@MSU_Basketball @Money23Green @warriors Let’s go Dray!!! 🔥🔥🔥",
    "236": "@anthonyVslater I hope not we are Good @warriors",
    "237": "@warriors @KlayThompson Klay always doing the most",
    "238": "@warriors @KlayThompson Lowkey a W way to come in",
    "239": "@warriors @KlayThompson So cringe",
    "240": "@henrykmin @warriors @Verizon Good luck finding a single Wolves fan that would want Wiggins back.",
    "241": "Arriving in style 😎 https://t.co/ezZF9Nele6",
    "242": "@D_C_M_15 @NBAAllStar @NBA @warriors @Money23Green Oh i feel sorry for you Draymond has a lot of fans.",
    "243": "@Patrickgreen18 @REALEST2DOIT_25 @SwizoYT @NBAAllStar @warriors @Money23Green So not awful? lol. The best defensive player in the league, that's also not a zero on offense is an all star, didn't think that'd be disputable. The efficiency seems to be a career-high as well.",
    "244": "@warriors he say this like he ain’t been an all star 3 times before",
    "245": "@DogSurfRoadshow @warriors What’s one position you feel needs to be upgraded, if at all?",
    "246": "@ShamsCharania R u fucking kidding me? The @warriors have 3 all stars? How much fucking help does @StephenCurry30 need?",
    "247": "@MSU_Basketball @Money23Green @warriors FUTURE HALL OF FAMER",
    "248": "@shaderedemption @rs7united @warriors The only thing therefore that Draymond has over AD is defense and playmaking. The gap defensively is not even big as AD is a solid defender himself.  It when comparing their offensive games AD simply demolishes Dray in skill. 7 vs 23 PPG remember. And it is a down year for AD.",
    "249": "Sacramento Kings vs Golden State Warriors | NBA Live Stream\n\nᴡᴀᴛᴄʜ ᴄʟɪᴄᴋ ʜᴇʀᴇ ▶️ https://t.co/UHkmKv7Bta",
    "250": "Congratulations คนที่ 3 🎉🎉🎉\n#NBAAllStar 🎁 Draymond Green\n#BamBamxGSW #BamBam \n@BamBam1A @warriors https://t.co/DTf9AqGDO9",
    "251": "@ayden_mcdowell @rs7united @warriors There is more to defense than rebounds",
    "252": "@warriors now a SUPERTEAM COMING!! https://t.co/QgjdQF7kIL",
    "253": "@warriorsvox @mosesmoody starting again tonight for the @warriors vs @SacramentoKings. I know what @DanyelleSargent and I will have on NBA League Pass tonight at 9PM central.",
    "254": "@MarkJackson13 BUILT THE GOLDEN STATE WARRIORS THAT YALL KNOW AND LOVE. #BlackHistoryMonth",
    "255": "O descansado Golden State Warriors está confirmado para o confronto desta madrugada vs. #SacramentoProud, por @anthonyVslater:\n\nPG • #⃣3⃣0⃣ Stephen Curry\nSG • #⃣4⃣ Moses Moody\nSF • #⃣1⃣1⃣ Klay Thompson\nPF • #⃣2⃣2⃣ Andrew Wiggins\nC • #⃣5⃣ Kevon Looney\n\n#DubNation https://t.co/mgfhDz8CaW",
    "256": "@rs7united @warriors Then what does bozo. Stats record what a player does so to me it looks like he does a whole lot of nothing. Not to mention he is a offensive liability. Teams don’t even have to worry about him. Glorified system player. Put him on any other team and he getting little time.",
    "257": "@thegoodgodabove IDK... Probably watching court side every @warriors games",
    "258": "@LevoSkeet @REALEST2DOIT_25 @SwizoYT @NBAAllStar @warriors @Money23Green Sure those stats are decent and the rest are downright bad, he’s also only played 34 games and producing minimal stats. And we’ve seen what his impact is without curry. All defense team? Absolutely. Nba allstar hell no.",
    "259": "@DogSurfRoadshow @warriors why are we not pursuing backup big options, wiseman is out indefinitely, draymond is out indefinitely, otto has a back issue now. How sustainable do you, as a gm, think playing heavy small ball is for an 82 game season?",
    "260": "The @Warriors starting Curry, Moody, Thompson, Wiggins, Looney on Thursday. #DubNation #NBA",
    "261": "@warriors We can’t wait brother!",
    "262": "@LevoSkeet @Patrickgreen18 @SwizoYT @NBAAllStar @warriors @Money23Green Hell naw",
    "263": "@arodismyname @DogSurfRoadshow @warriors That really is the only pressing question, with Wiseman’s undetermined return and suitability for playoffs.",
    "264": "this game more entertaining than any golden state game all season @warriors are boring #PHXvsATL",
    "265": "@Patrickgreen18 @REALEST2DOIT_25 @SwizoYT @NBAAllStar @warriors @Money23Green damn I thought his fg, true shooting and efg were decent this year",
    "266": "@NBAAllStar @warriors @Money23Green Weak",
    "267": "@REALEST2DOIT_25 @LevoSkeet @SwizoYT @NBAAllStar @warriors @Money23Green Awful 😞",
    "268": "@LevoSkeet @Patrickgreen18 @SwizoYT @NBAAllStar @warriors @Money23Green Not good lol",
    "269": "@DogSurfRoadshow @warriors Are you putting too much pressure on loon being our only big guy for an extended stretch now?",
    "270": "@NBAAllStar @NBA @warriors @Money23Green Man hell nah lol",
    "271": "@Patrickgreen18 @SwizoYT @REALEST2DOIT_25 @NBAAllStar @warriors @Money23Green hows his efficiency this year?",
    "272": "Warriors' Draymond Green Says Doctors Don't Believe He Needs Surgery for Back Injury #GoldenState #Warriors #NBA https://t.co/Ayhkxop2BY",
    "273": "Making his 4th #NBAAllStar appearance... Draymond Green of the @warriors.\n\nDrafted as the 35th pick in 2012 out of Michigan State, @Money23Green is averaging 7.9 PPG, 7.6 RPG and 7.4 APG for the Warriors this season. https://t.co/WVhtgYvCxb",
    "274": "@warriors @Money23Green Dray🗣🗣🗣🗣",
    "275": "@D_C_M_15 @NBAAllStar @NBA @warriors @Money23Green Did you see the interview of Draymond saying he hopes Murray replaces him cuz he can’t play?",
    "276": "Draymond Green update on his injury https://t.co/fnjJoyp45u via @YouTube\n\n#NBA #DraymondGreen #StephenCurry #Warriors #GoldenStateWarriors #NBAALLSTAR",
    "277": "@mikeqdowg @warriors @Money23Green Stop",
    "278": "@warriors Carried to another allstar ooof",
    "279": "@warriors @Money23Green Congratulations",
    "280": "@warriors WHATS UP ALL STAR!!!!",
    "281": "@ShamsCharania Literally, if Khris Middleton was on the Golden State Warriors GSW, he would be starting in the ASG… Wiggins PER is 16.6, 18ppg/2a/4e… KM PER 20, 19.6ppg/5a/5r… show some respect to Khris NBA Champ",
    "282": "@GoldenBoys027 @warriors lol wym im just saying its funny to see a 32 year old with white spots on his beard already",
    "283": "@evanssnt @warriors He was chosen, but will not compete due to his back injury. Someone else will take his place",
    "284": "@Brookwood408 @warriors Steph doesn’t  aged at all what is u talkin about💀💀",
    "285": "@King2Goat @warriors Didn't they JUST beat the Nets this last Saturday. But sure, they'll sweep them in the playoffs🤭",
    "286": "@warriors I thought he announce he's not going to participate",
    "287": "@warriors @Money23Green Triple single",
    "288": "@warriors @Money23Green ⭐️ much deserved @Money23Green 🎉\nBeen fun following ur career with @warriors! You’re also gonna make a great coach someday. Your mom @BabersGreen must be proud 💪🔥",
    "289": "NBA Basketball Game Betting Picks Simulator: 10:10 PM ET - Sacramento Kings vs. Golden State Warriors - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/aJQHjQcglK #nba #sportsbetting #freepicks #cappertek",
    "290": "@spymacaque @LockedOnDubs @dieter @warriors @mosesmoody @JonathanKuming6 @juanonjuan10 I’m not hating on him in any regard but if you told me a @warriors player was in the slam dunk contest and didn’t tell me who, my first guesses would’ve been GPII or Kuminga. I’ve seen dunks like that but was it really that special where you think “Dunk Contest” when watching it?",
    "291": "@warriors Greatest defender of all time. We miss you Draymond. 💪🏻💪🏻",
    "292": "@merlzobinguar @NBAAllStar @NBA @warriors @Money23Green What do you mean why didn’t I vote for him? I did and I am a fan.🤔",
    "293": "@warriors y’all have that pic of Otto Porter Jr pointing at the suns bench during the Christmas game? Need it for my wallpaper 😏",
    "294": "@warriors Love u bro get well soon but Man U need to shave 🪒 🙃",
    "295": "@GoldenBoys027 @warriors Lol his melanin last short Steph dont even got snowflakes yet",
    "296": "@ESPNPR @SarahSpain @bethmowins @heydb @saltersl @NBA @warriors @utahjazz @ESPNNBA Three of the very best. Congrats ladies.",
    "297": "GOLDEN STATE WARRIORS https://t.co/44PWFk5A7L",
    "298": "@warriors Yes sir!",
    "299": "@warriors Why his beard turning grey already",
    "300": "@Brookwood408 @warriors Because he’s old💀",
    "301": "@Brooksbrosmedia @warriors bruh be having me beyond weak with the champ is here song",
    "302": "@PHolmes4x @SomborFiesta @NBAAllStar @warriors @Money23Green That's why the Warriors have won 7 games in a row without him I guess",
    "303": "@warriors WELL DESERVED!!!",
    "304": "Congratulations NBA ALL⭐STAR RESERVE @Money23Green OF THE @warriors 👏🏻👏🏻👏🏻 https://t.co/4iPSyw8OZL",
    "305": "@NBAAllStar @warriors @Money23Green 11-4 in games where Draymond hasn't played, but Steph has. Won 7 games in a row. 4 wins against playoff teams in those 7 games. \n\nBut, you told us the Warriors fall apart without him and he's the reason they win?! Guys got SNUBBED for a triple single and some defense. Pathetic.",
    "306": "@King2Goat @warriors You need 8 because of Kyrie. Oh wait… 🤣",
    "307": "@warriors @Money23Green WE LOVE YOU!!!",
    "308": "@warriors Deserves MVP",
    "309": "@NBAAllStar @warriors @Money23Green How hard did you guys laugh typing out that stat line for an “ALL-STAR”…",
    "310": "@SwizoYT @REALEST2DOIT_25 @NBAAllStar @warriors @Money23Green Triple single!!!!",
    "311": "@warriors Congrats Dray and cant wait to see you soon!",
    "312": "@warriors good TV when dray is on",
    "313": "@Patrickgreen18 @REALEST2DOIT_25 @NBAAllStar @warriors @Money23Green Who cares about your opinion he already made it and Celtics ain’t making it out the first round a",
    "314": "@King2Goat @warriors ratio plus yall are 6th seed",
    "315": "@King2Goat @warriors Sike nets suck",
    "316": "@warriors @Money23Green He should be the top 5 in the MVP race",
    "317": "@warriors Soon https://t.co/sO4Gg9vEL1",
    "318": "@warriors Gonna get another W",
    "319": "@warriors Why his beard got snowflakes on",
    "320": "@warriors Draymon 'the Leader' Green 💜",
    "321": "@warriors thats cute, Nets in 4",
    "322": "A message from 4x #NBAAllStar Draymond Green 🗣️ https://t.co/s9B6zgtIkq",
    "323": "@MSU_Basketball @Money23Green @warriors No miles or jaren?",
    "324": "🏀 Sacramento Kings(+13.5) @ Golden State Warriors(-13.5)\n\n⌚ 10 PM ET\n\nO/U: 224\n\n🔥 Kings are 5-1 ATS in their last 6 Thursday games.\n\nBet #BTC ➡️ https://t.co/spMiJIy3iL\n\n#NBABetting #NBAPicks #SportsBetting #BitcoinBetting https://t.co/ogkUWbt9RM",
    "325": "5th game of the season 💛💙 @warriors I LOVE IT HERE #DubNation https://t.co/ckCrQI9XVi",
    "326": "@warriors @Money23Green RIGHT ON!...What's up with kerr's negativity towards JMK?",
    "327": "@warriors @Money23Green LETS GOOOO",
    "328": "@AfrisporaGaming :-) #FellowBruins Get 'Love' Seemed NBA 2K22 #BlackStarSports #UCLABasketball #GoldenStateWarriors #AfrisporaGaming",
    "329": "@warriors @Money23Green No one hustle harder! Period full stop",
    "330": "@warriors Brandon Ingram &gt; Green,wiggins",
    "331": "@NBAAllStar @warriors @Money23Green Congratulations",
    "332": "@clappedfranky @SomborFiesta @PHolmes4x @NBAAllStar @warriors @Money23Green bro dickriding jokic and says that doesn’t care about impact. Twitter casuals are hella fun 😭",
    "333": "@NBAAllStar @warriors @Money23Green Brandon Ingram &gt; Green, wiggins",
    "334": "@SwizoYT @REALEST2DOIT_25 @NBAAllStar @warriors @Money23Green Stats and efficiency absolutely matter for an allstar and green sucks in that regard, also only played 34 games",
    "335": "@NBAdabad Golden State Warriors",
    "336": "@Iam_ghostryder @warriors He’s pure comedy! That’s our dawg✊🏾",
    "337": "@warriors @Money23Green NO KLAY? 🥲",
    "338": "@NBAAllStar @warriors @Money23Green Replace him with https://t.co/2hFQu7Loss",
    "339": "SACRAMENTO vs. GOLDEN STATE - Totals Prediction = 76.47% going UNDER #Kings #Warriors  Full odds at https://t.co/nUn5OcMhOI",
    "340": "@warriors @Money23Green LEGEND WE LOVE YOU",
    "341": "@NBAAllStar @warriors @Money23Green ppl tweeting out how many points he averages like that matters😭. There are way too many casuals on this platform",
    "342": "Golden State Warriors have agreed to a contract extension with Steven Adams, league sources tell ESPN.",
    "343": "@warriors @Money23Green Of course!",
    "344": "@pill_cosby1 @b_kawucha @warriors @mosesmoody @StephenCurry30 L reply",
    "345": "Warriors’ Draymond Green named All-Star reserve, but won’t go to Cleveland #GoldenState #Warriors #NBA https://t.co/dfCD1OJXRH",
    "346": "@NBAAllStar @warriors @Money23Green @Money23Green to haters https://t.co/a8WmCkaxcf",
    "347": "@warriors He's not playing :((",
    "348": "@D_C_M_15 @NBAAllStar @NBA @warriors @Money23Green Why didn’t you vote for him where are his fans? 🤷🏻‍♀️",
    "349": "@Brooksbrosmedia @warriors Crazy how many times the warriors have had 3 all stars in their history",
    "350": "@namedalexander @IanDrummerBoy @warriors 😭😭 bro stfu",
    "351": "@Brooksbrosmedia @warriors chabatt be having me weak",
    "352": "@NBAAllStar @NBA @warriors @Money23Green Green is the same player he was in 2020. But because warriors were the worst team, no one cared about him.\n\nNow in 2022 warriors have the second best record and green is an all star\n\n🤦🏻‍♂️",
    "353": "@warriors Took y’all ages to find good clips on him 😂",
    "354": "Getting ready to enjoy an evening of Basketball 🏀 Golden State Warriors vs Sacramento Kings!! Let’s Go Sac!! https://t.co/u8O2lPnA8j",
    "355": "👀 the BEST from #NBAAllStar Draymond Green so far this season 💪 https://t.co/qioXdpRx35",
    "356": "@SomborFiesta @NBAAllStar @warriors @Money23Green Clearly u don’t watch how he plays and how dray impacts the game 😂 pls watch some games before u talk",
    "357": "@NBAAllStar @warriors @Money23Green Deserve!!!! Congrats @Money23Green 🔥💪💪💪",
    "358": "@NBAAllStar @warriors @Money23Green Dejounte Murray robbed my goodness",
    "359": "Es la quinta vez en la era Steph Curry en que los Warriors llevan +3 representantes al #NBAAllStar\n\n2016: Steph, Klay y Dray\n2017: Steph, Durant, Klay y Dray\n2018: Steph, Durant, Klay y Dray\n2019: Steph, Durant y Klay\n2022: Steph, Wiggins y Dray\n\nGolden State Warriors⭐💛 https://t.co/kjgZN3S84H",
    "360": "@NBAAllStar @warriors @Money23Green Very, very, very deserved",
    "361": "@warriors @Money23Green Steph needs 2 all stars to carry him to the 2 seed, Book only needs 1 to get the 1 seed.",
    "362": "that one time in @warriors history when spree put on a mini-dunk contest in the middle of the 1997 nba allstar game. #dubnation \n\nhttps://t.co/ZAJ5EIjbfJ",
    "363": "@SomborFiesta @matthewyang_12 @NBAAllStar @warriors @Money23Green Numbers aren’t everything in basketball. Dray before he got injured was having a great season. He’s the key of warriors success this season, he helps them everywhere in the court, defence or attack",
    "364": "@WayneeCal1 @warriors Waste of a pick to me til he prove me wrong I will wait",
    "365": "@REALEST2DOIT_25 @NBAAllStar @warriors @Money23Green Points don’t matter look at how his team is playing well with him On the floor",
    "366": "@TheTedKord @Chr1sgamble @warriors @Money23Green I believe in equal rights for everyone",
    "367": "@warriors @Money23Green Congratulations Dray! 🥳 #DubNation",
    "368": "@NBAAllStar @warriors @Money23Green Congratulations you deserve it @Money23Green",
    "369": "@warriors @Money23Green This just solidified his hof spot",
    "370": "@TwoWayKlay @Chr1sgamble @warriors @Money23Green are u disrespecting me a women??",
    "371": "@NBAAllStar @warriors @Money23Green Dude drops like 5 pts per game lmfao",
    "372": "@NBAAllStar @NBA @warriors @Money23Green How draymond get this spot over dejonte Murray? Look at the numbers cmon man just because he’s on the spurs ? It’s about how players play not teams for all star weekend",
    "373": "@warriors @Money23Green He won't play per sources",
    "374": "@alepouda @NBAAllStar @warriors @Money23Green All star impact",
    "375": "@warriors @Money23Green *brakes.",
    "376": "@TheTedKord @Chr1sgamble @warriors @Money23Green No one asked",
    "377": "@guythemenace @KingLone5 @NBAAllStar @warriors @Money23Green His impact on the team u clearly don’t watch him play lmao",
    "378": "@NBAAllStar @warriors @Money23Green 7-7-7 is not All Star Stats",
    "379": "Sooo based on my timeline no @warriors player should have made Allstar...#carryon",
    "380": "@NBAAllStar @warriors @Money23Green Yessir💙💙💛",
    "381": "@warriors @Money23Green He won’t play lol",
    "382": "@SomborFiesta @matthewyang_12 @NBAAllStar @warriors @Money23Green He is the reason the warriors are so good",
    "383": "@warriors @Money23Green YESSIR MY GUY DRAY!!!!",
    "384": "@teccccy @KingLone5 @NBAAllStar @warriors @Money23Green 8 points a game 😭😭😭😭😭",
    "385": "@warriors @Money23Green congratulations dray, well deserved dpoy !",
    "386": "@Imdotun @warriors @Money23Green Rehabbing his back.",
    "387": "@GreenbossP @warriors @Money23Green W, also don’t for curmickey has 0 finals mvps. Curbum only can shoots threes and sucks at that. He currently is not top 50 in my books. Cursuperteam will never win another ring",
    "388": "@warriors @Money23Green This is by far a superteam",
    "389": "jordan poole ,golden state warrior's future, so brilliant at 22, hard work pays off",
    "390": "@warriors @Money23Green I miss you draymond!!!!",
    "391": "@bronbetta23 @warriors @Money23Green Do you know that basketball is a team sport! 🤣 Tf? If one's off, others will step up! C'mon man!",
    "392": "Draymond Green became the Golden State Warriors’ third All-Star on Thursday, but unlike Steph Curry and Andrew Wiggins, Green won’t play in the Feb. 20 showcase in Cleveland.\nhttps://t.co/SJ7MW5xEaB",
    "393": "@warriors @Money23Green He pulled out?",
    "394": "@warriors @Money23Green Green not playing in the all stars\nWhy",
    "395": "Day day! @Money23Green get it bro! Wishing you a speedy recovery. Three @warriors now on the @NBA All Star team! Let’s Gooo!\n\n@StephenCurry30 @22wiggins \n\n#DubNation #NBAAllStar https://t.co/ZH2CVfNU7z",
    "396": "@edveeee1 @Liam33381636 @king_armish @NBA @warriors @JonathanKuming6 @Dami0nLee for sure, steph gonna prob become prime steph there",
    "397": "Let's go @warriors",
    "398": "The Golden State Warriors bias is crazy man ….Why is Draymond a All Star in the 1st place ?",
    "399": "the golden state warriors officially have 3 nba all stars this season https://t.co/EQmo4v9MhO",
    "400": "golden state warriors only team from the west with three all star players🔥🔥",
    "401": "Making his 4th #NBAAllStar appearance... Draymond Green of the @warriors.\n\nDrafted as the 35th pick in 2012 out of Michigan State, @Money23Green is averaging 7.9 PPG, 7.6 RPG and 7.4 APG for the Warriors this season. https://t.co/ESn5E163Zg",
    "402": "@jdg21_ @warriors is this an AD for @HydroFlask ?? because this video made me want to buy one. sponsor him plz",
    "403": "@GreenDarryn Sorry I blocked ya, got triggered when you said @warriors labeling court w \"San Francisco\" looked trash 🗑.",
    "404": "@warriors @Money23Green DRAY DRAY",
    "405": "Stephen Curry\nAndrew Wiggins\nDraymond Green\n\nThe Golden State Warriors now have three players as NBA All Stars this year! Last time this happened was in 2018. https://t.co/6Fdd4kcJHA",
    "406": "@D_C_M_15 @NBAAllStar @NBA @warriors @Money23Green Rightly so",
    "407": "@warriors @Money23Green Dray be on TV looking good.  Sorry guys showing yall up.",
    "408": "@Chr1sgamble @warriors @Money23Green i literally make porn for a living.  better money than you'll ever make",
    "409": "@warriors *brakes",
    "410": "@Grandson_Yates @NBAAllStar @warriors @Money23Green Casual at",
    "411": "@NBAAllStar @NBA @warriors @Money23Green Meanwhile, Dejounte Murray is averaging 19.6, 9.1, and 8.5 with 10 triple doubles this season while leading the league in steals per game but he will get snubbed. Ridiculous!🙄",
    "412": "@crfbrayan @NBAAllStar @warriors @Money23Green Seems like ur new to basketball",
    "413": "The only team in the NBA with 3 All-Stars: the Golden State Warriors\n\nSuperteam? 🤔",
    "414": "@SomborFiesta @NBAAllStar @warriors @Money23Green I’m guessing ur new to basketball?",
    "415": "@warriors @Money23Green lets fucking go",
    "416": "Dray won’t play in the ASG because he’s injured…. but anyone who says he doesn’t deserve it clearly doesn’t watch @Warriors basketball closely.",
    "417": "@warriors @Money23Green speedy recovery bro 🙏🏻",
    "418": "@warriors @Money23Green Day Day!! ❤️ from #DubNation",
    "419": "@TrusikiILosini @Gokuduzumaki3 @bronbetta23 @warriors @Money23Green Counter x3",
    "420": "@ESPNPR @bethmowins @heydb @saltersl @NBA @warriors @utahjazz @ESPNNBA Umm NO...THE RAPTORS (an NBA team btw) had the first all female crew last year and it was on NATIONAL TV...Canada is a nation after all...",
    "421": "@warriors @Money23Green Where is the announcement video? i can't find it ;(",
    "422": "@warriors @Money23Green This is actually unreal dickriding",
    "423": "How many ppl remember @Warriors historic run fr. 2010 to 73-wins. They always have Bogut.. w/ DLee, Dray, or Iggy, then later West, Pachulia. Always 2 bigs. Bjelica haters think just bec he's not a good center means he's not effective. Watch d time he played w both Splash Bros..",
    "424": "@TrusikiILosini @xGoatedz @bronbetta23 @warriors @Money23Green Check again",
    "425": "@MSU_Basketball @Money23Green @warriors He’s not playing 😞",
    "426": "Los Angeles Lakers: 1 All-star.\nGolden State Warriors: 3 All-stars.\n\nThis further proves that the Warriors are a superteam and the Lakers aren’t.🚶🏾‍♂️",
    "427": "@warriors @Money23Green LETS FUCKING GOOO",
    "428": "@SomborFiesta @PHolmes4x @NBAAllStar @warriors @Money23Green Ratio then",
    "429": "@therealselena23 @warriors @Money23Green This ratio is well deserved",
    "430": "@NBAAllStar @warriors @Money23Green OMG HE BACK!! @breakingdead1",
    "431": "Damn Golden State Warriors players just taking away all star spots",
    "432": "@NBAAllStar @warriors @Money23Green Warriors superteam",
    "433": "Top Teams in The Western Conference \nPhoenix Suns\nGolden State Warriors \nMemphis Grizzlies\nUtah Jazz https://t.co/1VXmuRHJTj",
    "434": "@warriors @Money23Green Locked",
    "435": "@TrusikiILosini @Gokuduzumaki3 @bronbetta23 @warriors @Money23Green Counter x2",
    "436": "@Blazersplzwin @warriors @Money23Green Where is Lillard",
    "437": "@warriors @GSWReddit @Money23Green VERY DESERVED",
    "438": "@warriors @Money23Green Yeaaaah https://t.co/YUMaz1iEYx",
    "439": "@warriors @Money23Green LET'S GO! 🔥 https://t.co/EmN0iKoXMX",
    "440": "@warriors @Money23Green LETS GOOOOOOOOO",
    "441": "@warriors @Money23Green How about Klay",
    "442": "@warriors @Money23Green that pretty much describes him",
    "443": "@warriors @Money23Green Let’s goooo https://t.co/WURFNELnqE",
    "444": "@warriors @Money23Green An all star for averaging 8 points 😂😂😂",
    "445": "@warriors @Money23Green WARRIORS!!!!",
    "446": "@SomborFiesta @NBAAllStar @warriors @Money23Green Impact is amazing",
    "447": "@warriors @Money23Green not deserved +kings better",
    "448": "@warriors @Money23Green Yessir💪",
    "449": "@warriors @Money23Green Underrated",
    "450": "@warriors @Money23Green W DRAY",
    "451": "@NBAAllStar @NBA @warriors @Money23Green Well deserved",
    "452": "All gas, no breaks.\n\n@Money23Green is once again a #NBAAllStar https://t.co/ESjOemvna3",
    "453": "@NBAAllStar @warriors @Money23Green Warriors officially a super team",
    "454": "@NBAAllStar @warriors @Money23Green Whole west is mid",
    "455": "@warriors @Money23Green Yesss congrats dray!",
    "456": "@warriors @Money23Green nice",
    "457": "Making his 4th #NBAAllStar appearance... Draymond Green of the @warriors.\n\nDrafted as the 35th pick in 2012 out of Michigan State, @Money23Green is averaging 7.9 PPG, 7.6 RPG and 7.4 APG for the Warriors this season. https://t.co/0KTZhKoze7",
    "458": "@therealselena23 @warriors @Money23Green Ratio + job?",
    "459": "@warriors @Money23Green this is why draymond green is the best defender ever",
    "460": "@warriors @Money23Green LETS GOOO DPOYMOND",
    "461": "@TrusikiILosini @xGoatedz @bronbetta23 @warriors @Money23Green Counterer",
    "462": "@warriors @Money23Green LETS GOOOOOOOOOOO",
    "463": "@warriors @Money23Green congrats,Dray!!!!!💪🏾",
    "464": "@warriors @Money23Green Undeserved",
    "465": "@bronbetta23 @warriors @Money23Green This ratio doesn’t need help",
    "466": "@warriors @Money23Green DESERVED",
    "467": "@warriors @Money23Green YESSIRRR",
    "468": "@warriors @Money23Green Ratio wtf",
    "469": "@warriors @Money23Green Let’s go Dr Dray",
    "470": "@warriors @Money23Green LETS GOOO",
    "471": "@warriors @Money23Green Well deserved",
    "472": "@warriors @Money23Green LETS GOOOOOO",
    "473": "Few hustle harder.\n@Money23Green is now a 4x #NBAAllStar \n\n⭐️ CONGRATS, DRAY ⭐️ https://t.co/DiBLL55CjB",
    "474": "Sacramento Kings @ Golden State Warriors \nOver  225 \n#GamblingTwitter #FreePick",
    "475": "Tagging this thread with @StephenCurry30 @SteveKerr @KlayThompson @andre @WarriorsPR @Money23Green @warriors @anthonyVslater every single day until answers or change.",
    "476": "@D__A__R__Y__L @Dave74991413 @SharlaMcBride @warriors @NBA They've taken their decision to get a different name.",
    "477": "@BovadaOfficial @WhatsYaWager #whatsyawager \nGOLDEN STATE WARRIORS\n\nSteph Curry over 31.5 Points and Assists\n\nThanks! 🙏",
    "478": "Andre Iguodala on Kevon Looney's career growth https://t.co/WrIWsXc0nJ via @YouTube\n\n#NBA #AndreIguodala #KevonLooney #StephenCurry #Warriors #GoldenStateWarriors #NBAALLSTAR",
    "479": "@ESPNPR @RobertIger @bethmowins @heydb @saltersl @NBA @warriors @utahjazz @ESPNNBA Do you know what I love most about this? It doesn't say WNBA. 💕💕💕💕",
    "480": "@j_ocaceres @D__A__R__Y__L @SharlaMcBride @warriors @NBA @CleGuardians @MLB Another awful name",
    "481": "@ElGuarizama @WarriorNationCP @warriors @Money23Green Lol Draymond shouldnt have been suspended that was LeBum’s doing in a succesful effort to rig the series",
    "482": "@ESPNPR @bethmowins @heydb @saltersl @NBA @warriors @utahjazz @ESPNNBA Prob will suck",
    "483": ".@espn to have all-woman crew for @warriors-@utahjazz game next week\nhttps://t.co/JOtl7UhrkU",
    "484": "Just posted a photo @ Golden State Warriors https://t.co/xOkrG5M6QM",
    "485": "@warriors @NBCSAuthentic @957thegame @Chase Will Curry play?",
    "486": "@Dave74991413 @D__A__R__Y__L @SharlaMcBride @warriors @NBA As @CleGuardians in the @MLB as a club, also deserves to be curious to see a fan poll.",
    "487": "@disisstupid21 @Jonatha11179756 @ESPNNBA @warriors @Money23Green They still important to our team and the rotation🤷🏽‍♂️",
    "488": "No NHL til the 7th. Gonna do two plays to win .5U in NBA. \n\n🏀Phoenix Suns 1Q ML (-134)\n🏀Golden State Warriors 1H -8 (-115)\n\n#GamblingTwitter #NBATwitter",
    "489": "@ESPNPR @bethmowins @heydb @saltersl @NBA @warriors @utahjazz @ESPNNBA Hellllllllo ladies/🐐’s!!! Love it!!!",
    "490": "@warriors Series over",
    "491": "@KBjR510 @warriors You have some personal issues with Wiseman, maybe he didn't give enough effort for you?",
    "492": "@jimmeroz @warriors Suck something",
    "493": "Western Conference Finals Match-up \nPhoenix Suns VS Golden State Warriors https://t.co/JsRhAs8mgW",
    "494": "The Golden State Warriors have won 7-straight games, all without Draymond Green https://t.co/Y8H7onLHA1",
    "495": "@WayneeCal1 @warriors He worth all the baggage especially if we end up trading wiseman an he never plays again for us an we winning w/o him a number 2 overall pick",
    "496": "Klay Thompson practice/ shootaround | GSW vs Kings https://t.co/UZTD5cXzo6 via @YouTube\n\n#NBA #KlayThompson #StephenCurry #Warriors #GoldenStateWarriors #NBAALLSTAR",
    "497": "@ESPNPR @bethmowins @heydb @saltersl @NBA @warriors @utahjazz @ESPNNBA Hell yeah. You should create an all womens basketball league and air that too! People would love it",
    "498": "@DogSurfRoadshow @LockedOnDubs @dieter @warriors @mosesmoody @JonathanKuming6 @juanonjuan10 Never seen a Toscano dunk that stood out to you?  Do you watch every game?\n\nhttps://t.co/HVduHoUyJL",
    "499": "@ESPNPR @bethmowins @heydb @saltersl @NBA @warriors @utahjazz @ESPNNBA Canada did it last year for a Raptors game and it was excellent!!",
    "500": "Tonight is the night the Golden State Warriors extend their win streak to 8 games for the first time this season.\n\nThey’ve won 7 games in a row (3 times) only to fall short the next game.",
    "501": "@warriors @NBCSAuthentic @957thegame @Chase Lets Go Black and Gold! Show em how to ball..",
    "502": "What's #Best on https://t.co/DVTf2jd2ZR ?\nDefinition Series: Injustice\nhttps://t.co/zz26ydo1h4\n#sports #goldenstatewarriors #goldenstate #warriors #gsw #dubs #dubnation #dubnation https://t.co/qQdm5YWqoq",
    "503": "What's #Best on https://t.co/VfZu3jgOen ?\nDefinition Series: Injustice\nhttps://t.co/yXjyJBXp05\n#sports #goldenstatewarriors #goldenstate #warriors #gsw #dubs #dubnation #dubnation",
    "504": "Thursday night will be the first time Golden State @warriors fans will have to show proof they got a COVID vaccine booster to cheer the team on in person at the Chase Center. #SanFrancisco #NewsBreakLocal\n\nhttps://t.co/VXWcE9hwyJ",
    "505": "@KBjR510 @warriors Mello will fade or we might have. To big a project, to much baggage.",
    "506": "@WayneeCal1 @warriors Already messed it up by drafting him instead of Melo Melo should b an all star this year an Anthony Edwards is nasty Wiseman haven’t even played a full season 🤦🏽‍♂️",
    "507": "@lakersfan3PL @HoopsReference Nor golden state or the lakers can make that happen it’s damn near impossible even if they find a trade partner for the Westbrook the lakers can’t😂 and the clippers can’t either only the warriors can and there’s better moves to make if they decided to go all in",
    "508": "@KBjR510 @warriors They are so scared to mess this up. We should have took Parish.",
    "509": "@RockwoodSupt This reapeat got me feeling like the Golden State warriors fax Adam shift",
    "510": "NEW @LockedOnDubs with @dieter!\n\n—@StephenCurry30 MVP debate\n—How to improve home court advantage\n—Latest trade rumors\n—Previewing @warriors-@SacramentoKings\n—And more!\n\n📻: https://t.co/1J4qqnRqzi\n📺: https://t.co/v47jWhdqj2",
    "511": "@ElGuarizama @WarriorNationCP @warriors @Money23Green Typical currysexual, wants his daddy to get all the MVPs",
    "512": "Daqui 4 horas tem Golden State Warriors Basketball. https://t.co/elqAA9ytey",
    "513": "Stephen Curry practice/ shootaround | GSW vs Kings https://t.co/xFMHGfgG0t via @YouTube\n\n#NBA #StephenCurry #Warriors #GoldenStateWarriors #NBAALLSTAR #GSW",
    "514": "Double-digit favorites this NBA season are 43-62-1 (41%) ATS per @Bet_Labs.\n\n@warriors -13.5 vs. Kings.",
    "515": "Dia de Golden State Warriors Basketball. #DubNation https://t.co/7bNSKXkVC5",
    "516": "@Childish_Edbino @StephenCurry30 @LockedOnDubs @warriors The whole thing’s asinine.",
    "517": "New post (Sacramento Kings vs. Golden State Warriors Pick - NBA February 3, 2022) has been published on The Sports Geek - https://t.co/2BEIiVx1O0 https://t.co/b6nkFFyZAY",
    "518": "Thur NCAA &amp; NBA added\n2 TEAM TEASER 4.5 PT -118\n[510] GOLDEN STATE WARRIORS -9 (B+4½)\n[731] ST. JOHNS -½ (B+4½)",
    "519": "Congratulations to bigskybear (@bigskybear) who moved up 7 spots to take #9 on the Golden State Warriors team leaderboard.\n\nhttps://t.co/W6VN3LlptP",
    "520": "@HellaADZ @warriors 🎉Nice! Happy shopping.",
    "521": "@GB75214794 @warriors @Rakuten I love the Warriors they are such an exciting team to watch. It is appalling such comments are made. What kind of example is he setting for all the young Warriors fans out there",
    "522": "Excited to be watching the @warriors tonight courtside at @ChaseCenter 😀",
    "523": "@DogSurfRoadshow @StephenCurry30 @LockedOnDubs @warriors Chris Paul over Steph Curry is just ridiculous lol",
    "524": "Golden State Warriors star Draymond Green says vaccine mandates go 'against everything America stands for' – LeBron James strongly agrees https://t.co/Jw95lNXcJI via @theblaze",
    "525": "@ESPNPR @bethmowins @heydb @saltersl @NBA @warriors @utahjazz @ESPNNBA Canada is a country....its' broadcasts are national...Raptors have been there and done that LAST YEAR!!!!!",
    "526": "Ya, know all things considered … we got it damn good around here. \n\n3:00 - The Big Open \n3:30 - @NickFriedell \n4:00 - Olympics huh? \n5:00 - @bomani_jones \n5:30 - @warriors LIVE\nhttps://t.co/1hQ0NML2zL",
    "527": "@sbjsbd @NBA @bethmowins @saltersl @warriors @utahjazz @ESPNPR The best in the business! I don’t watch the NBA but sure will on the 9th!",
    "528": "Play-by-play announcer Beth Mowins will work the @warriors vs. @utahjazz game with analyst Doris Burke and reporter Lisa Salters.\n\nIn addition, 33 other women will handle production roles on site and in the control room from ESPN headquarters. https://t.co/C5aLltk3gc",
    "529": "With only 6 @nba games tonight it's slim pickings, but we have gotta work with what we have.\n @Raptors v @chicagobulls is a prop bettors paradise. \n@Suns/@hawks and @SacramentoKings/@warriors also present some interesting #action.\n\n#bettingtips #bettingtwitter #bettingpicks",
    "530": "@KumareNiKiara @warriors Ofc. I know you, Mare💛💙",
    "531": "NBA Betting Preview: Golden State Warriors vs. Sacramento Kings - Thursday, February 3, 2022 https://t.co/Q0EDaRc9F4",
    "532": "@LakeShowGr8Sho @thepoisonpilson @ESPNPR @bethmowins @heydb @saltersl @NBA @warriors @utahjazz @ESPNNBA These men just think they rule the world. We’re taking over get used to it",
    "533": "@warriorsshop @warriors @Rakuten This is why Stephen curry the greatest player off all time",
    "534": "The Golden State Warriors play basketball 🏀🏀 today 💙💛",
    "535": "Arkansas native and Golden State Warrior is just what I thought he would be. I called him and RJ Hampton the best shooters in to They class. Congrats to Kareem and Rona Moody. Great parents https://t.co/lalby883bA",
    "536": "@stephenasmith Cane toad, ugly with a big mouth! The Philly fans are the sooks, carry on when things don't go their way! Draymond Green can't shoot but you giggle about his defence @BenSimmons25 is an explosive, damaging YOUNG all star. @warriors I'd take Ben over Dray anyday! @StephenCurry30",
    "537": "@ESPNPR @bethmowins @heydb @saltersl @NBA @warriors @utahjazz @ESPNNBA Yikes.",
    "538": "@StephenCurrysB2 @warriors @StephenCurry30 he’s out cuz the toe",
    "539": "@LakeShowGr8Sho @thepoisonpilson @ESPNPR @bethmowins @heydb @saltersl @NBA @warriors @utahjazz @ESPNNBA here’s the thing sonny. there’s something out there they call google. as i said, do your own research 🧐",
    "540": "ALERT: New high roller bet posted!\nA bet has been placed for $18,457.00 on Golden State Warriors - Sacramento Kings to win $36,544.85.\nTo view this bet or copy it https://t.co/LXB8MMNSnO https://t.co/PwYQl87AOA",
    "541": "Golden State Warriors - Sacramento Kings\n\nBet slip link: https://t.co/Y0udIc4b2O https://t.co/gZsvcu3EG6",
    "542": "@sbjsbd @NBA @bethmowins @saltersl @warriors @utahjazz @ESPNPR It ah national basketball association\nNOT the national men's basketball association\nRight @KingJames  @PhilMushnick ?",
    "543": "@ESPNPR @RobertIger @bethmowins @heydb @saltersl @NBA @warriors @utahjazz @ESPNNBA Congratulations ESPN,\nfor this breakthrough!\n\nThank you for sharing and for the RT Your Excellency Mr. R.I.\n\nRespectfully",
    "544": "@sbjsbd @NBA @bethmowins @saltersl @warriors @utahjazz @ESPNPR I'm confused when will the @nba have women players?\nSeems discrimination..no?",
    "545": "NBA LIVE TODAY🔴 Sacramento Kings vs Golden State Warriors - 3rd February... https://t.co/FV7CzoGlVN",
    "546": "Golden State Warriors",
    "547": "Cheers to the first women-led @NBA broadcast in history (@warriors v. @utahjazz), featuring @bethmowins, @heydb, @saltersl, and all-women production and ops. teams. \n\nTune in on 2/9! https://t.co/9dgpRYydHt",
    "548": "NBA Defensive GOAT?! Sacramento Kings at Golden State Warriors odds, picks and predictions https://t.co/YC2uy1CCt2 https://t.co/xi7MsffwYo",
    "549": "ESPN will produce the first women-led national @NBA broadcast, including production and operations teams 👏\n\n@bethmowins, @heydband, and @saltersl will team up for the historic @warriors vs. @utahjazz broadcast on February 9th 📺\n\n(via @ESPNPR) https://t.co/TyLf4Tdqn9",
    "550": "📌 Winamax\n 👉🏼 Cote Boostée Golden State Warriors - Sacramento Kings\n 💡 S. Curry + K. Thompson marquent 50 points ou plus\n 🔥 3.4 ➜ 4\n 🔗 https://t.co/PUXO36qoFV\n\n #TeamParieur #GCB #CoteBoostée",
    "551": "The Sacramento Kings (+14) are up against the Golden State Warriors (-14) at 10:10 PM EST today.\n\n25% of Shark Pick users are taking SAC (+14, -108) and 75% are taking GSW (-14, -109).\n\nWho do you like?",
    "552": "@ESPNPR @SarahSpain @bethmowins @heydb @saltersl @NBA @warriors @utahjazz @ESPNNBA This is Awesome!!  Bout damn time!! :-)",
    "553": "@ESPNPR @SarahSpain @bethmowins @heydb @saltersl @NBA @warriors @utahjazz @ESPNNBA Just popped in here to see all of the sad excuses for men complain about this while they eat their pizza rolls in their mama’s basement. 😆",
    "554": "Detroit Pistons - Minnesota Timberwolves\nAtlanta Hawks - Phoenix Suns\nLos Angeles Clippers - Los Angeles Lakers\nGolden State Warriors - Sacramento Kings\n\nBet slip link: https://t.co/qmzbgMdMT9 https://t.co/VwGR4W62Bi",
    "555": "@ESPNPR @togethxr @bethmowins @heydb @saltersl @NBA @warriors @utahjazz @ESPNNBA 👏👏👏\nI might actually watch a @NBA game in support.",
    "556": "Kevon Looney is having the best offensive rebounding season by a @warriors player in the Steve Kerr era. It's no fluke, either. @Loon_Rebel5 has the second best season as well. \n\nhttps://t.co/Nib49sxwvL",
    "557": "\"If Golden State is healthy, I'd pick them. I think they have another level.\"\n\n@Scalabrine on who he'd choose to come out of the Western Conference between the #Warriors and Suns.\n\n🎧 https://t.co/FnMj7Jv6NA https://t.co/2tT0xrF9B9",
    "558": "@JaqenJordan @warriors He had a foot injury or somethin like that so they rested him",
    "559": "@warriors colors look familiar?\n\n😏 #DubNation #Warriors https://t.co/cTnUqT2Irj",
    "560": "@BoardSkiNM @warriors They made an agreement with klay to only play him one game on back to backs and steph had a foot injury or somethin like that",
    "561": "@ESPNPR @SainAsylum @bethmowins @heydb @saltersl @NBA @warriors @utahjazz @ESPNNBA It will be a full broadcast about the Knicks and how even missing shots is progress?  Will they talk about the Triangle Shirtwaist factory Fire all game too?",
    "562": "@WarriorNationCP What’s the opposite of the MVP?  Like for a player that can’t control himself and gets himself ejected and then suspended because he’d accumulated too many T’s and basically loses the finals for his team?  I mean hypothetically, of course. @warriors @Money23Green",
    "563": "This preposterous segment is what prompted me to bring up @StephenCurry30’s MVP candidacy today on @LockedOnDubs. It blows my mind that Steph isn’t the leader let alone top 5 for the simple reason the @warriors aren’t even in the playoffs let alone second best record without him. https://t.co/25PvCDDsiz",
    "564": "Although the Sacramento Kings finally got back into the win column last night, they will have a tough matchup tonight when they face the Golden State Warriors at Chase Center.\n\nLast night's recap vs Brooklyn, injury updates, stats &amp; more: https://t.co/0jA3GgY0Qx",
    "565": "@SacramentoKings  vs @warriors \n\n-13.5 to -14  91 % on warriors #\n221 to 225.5 on the total",
    "566": "@LakeShowGr8Sho @thepoisonpilson @ESPNPR @bethmowins @heydb @saltersl @NBA @warriors @utahjazz @ESPNNBA research before you embarrass yourself anymore 🙄",
    "567": "@TheRealWizXTRA Golden State Warriors and Las Vegas Raiders.",
    "568": "Warriors should be patient and not trade James Wiseman. Look at Joel Embiid with the Sixers being patient with him. And Steph Curry. Sometimes you gotta ride out the early bad and just keep coaching them up @warriors",
    "569": "Just did a Zoom with my CFO in a @warriors shirt because…. Causal Friday is RESPECTED in my house.",
    "570": "@Loon_Rebel5 is the glue that holds the dubs together. What a tremendous heart this dude has. To overcome the amount of injuries and to stay ready when called upon speaks to the professionalism. I’m so happy for him to be having a breakout year. Keep it up baller! @warriors",
    "571": "@Dubs6x @warriors @NBCSAuthentic @957thegame @Chase Factsssss",
    "572": "Golden State Warriors proved depth is their greatest strength – NBA News https://t.co/RZYXfNMpNO",
    "573": "@ESPNPR @bethmowins @heydb @saltersl @NBA @warriors @utahjazz @ESPNNBA Hell yeah!",
    "574": "The 2022 Grizzlies are next Home made team ..The new 2013 Golden State warriors with Marc Jackson on the verge  of title runs @stephenasmith @ColemanESPN  @FirstTake",
    "575": "Highlights: Dejounte Murray 27 PTS, 9 AST, 9 REB, 2 STL | San Antonio Spurs vs Golden State Warriors\nhttps://t.co/yiTqTzuiS7\nhttps://t.co/yiTqTzuiS7",
    "576": "ESPN to have all-woman crew for Golden State Warriors-Utah Jazz game https://t.co/uSeFoQ6nm7",
    "577": "4 Reasons The Golden State Warriors Run Is Over #NBA #Warriors https://t.co/D6usuDt01K",
    "578": "@warriors @NBCSAuthentic @957thegame @Chase Ah when both ny favorite teams square off",
    "579": "Analyzing Thursday’s Sacramento Kings at Golden State Warriors odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/ZKIZPWydWn",
    "580": "Highlights: San Antonio Spurs 120, Golden State Warriors 124 | 2.1.2022\nhttps://t.co/C9zY4hAFEy\nhttps://t.co/C9zY4hAFEy",
    "581": "Golden State Warriors some fools if they don’t trade for a big man. Depending on Looney and Wiseman to give you solid minutes against Towns, AD, Nurkic, Jokic, Ayton, Adams, and Porzingas is a risky gamble. Especially with the number of bigs on the trade block right now",
    "582": "NEW with @dieter &amp; @DogSurfRoadshow!\n\n—@StephenCurry30 MVP debate\n—How to improve home court advantage\n—Latest trade rumors\n—Previewing @warriors-@SacramentoKings\n—And more!\n\n📻: https://t.co/JeUzRXXIo0\n📺: https://t.co/3HbLo3jvw0",
    "583": "@TeamMurray05 Golden State Warriors head coach Steve Kerr firmly believes San Antonio Spurs guard Dejounte Murray should be in the All-Star game, which is why he voted for him.",
    "584": "Women broadcast team will make history on ESPN when the Utah Jazz and the Golden State Warriors versus each other. The NBA game announced and directed by all women. #basketball #nba #women #broadcasting #espn #history 🏀😮 https://t.co/rikszfMF7m",
    "585": "Golden State Warriors Predictions and Preview for 2/3/2022 hosts Sacramento Kings.  Looking for betting action?  Find out if there is any value in our preview. #Picks #Basketball https://t.co/hO7VLHp823",
    "586": "Today in 2016, Stephen Curry of the Golden State Warriors hit 11 of 15 3-pointers and scored 51 points in a 134 - 121 win over the Washington Wizards. https://t.co/6LYPJ1T5yh https://t.co/JlYbUaiShd",
    "587": "Into your Basketball? \n\nCheck out my fancies for tonight! \n#basketball #NBA #GoldenStateWarriors #LAClippers #MiamiHeat #Phoenixsuns #torontoraptors https://t.co/nKFtwn5SGT",
    "588": "Looking for a value bet?  See if the Sacramento Kings-Golden State Warriors Predictions and Preview for 2/3/2022 is one in our preview.  No crazy hype just a prediction and preview. #Picks #Basketball https://t.co/hO7VLHp823",
    "589": "@its_vid Game time golden state warriors !!!",
    "590": "@DrGuru_ Anybody watching the game time golden state warriors ??",
    "591": "@feels_tee @warriors Yeah so your opinion was really needed, tell us who one Nostradumbass",
    "592": "@ilichRodriguezG @957thegame @andre @warriors Gp2 and looney deserve it more",
    "593": "Record in Back-to-Backs\n\nPhoenix Suns: 5-2\nBoston Celtics: 7-3\nGolden State Warriors: 6-3\nDallas Mavericks: 6-4\nChicago Bulls: 6-4\nMemphis Grizzlies: 6-4\nMilwaukee Bucks: 4-5\nPhiladelphia 76ers: 2-3\nUtah Jazz: 3-6\nLos Angeles Lakers: 2-4\nMiami Heat: 2-7\nBKN: 2-7\nDEN: 2-7\n\nVia CTG",
    "594": "@ESPNPR @bethmowins @heydb @saltersl @NBA @warriors @utahjazz @ESPNNBA ESPN is following on Raptors all-women broadcast from the last year in March https://t.co/Uvn5zJ4hy5",
    "595": "Golden State warriors can  subsidies offense in rebounds",
    "596": "Why not it’s so much fun to see vets help teams but it’s a hard working team and it’s not for them but is a honest honor hope all things are well no one can say anything about the truth about anything especially the Golden State Warriors has been conquer powerful by faith in Jah https://t.co/5gmUcywPjy",
    "597": "Game-Time Decisions: Sacramento Kings (18-34) Vs. Golden State Warriors (39-13) Thursday, Feb 3, 2022. \nRead More: https://t.co/pOoW4RTHkU https://t.co/IgKZo91XfK",
    "598": "Post-Game Review: San Antonio Spurs - 120 Vs. Golden State Warriors - 124 Tuesday, February 1, 2022.\nRead More: https://t.co/pOoW4RTHkU https://t.co/MCu4ZbKKCn",
    "599": "@JaMorant Let's win a playoff game first and we can talk about going up and down bud...@NBCSWarriors @warriors @WarriorsPR @JaMorant @NBA @NBATV @NBAPR @NBAHistory @NBAonTNT @NBAAllStar @StephenCurry30",
    "600": "@957thegame Give more money to @andre guys @warriors. He deserves it",
    "601": "Golden State Warriors Stats:\n\n For game-time decisions and post-game review.\n https://t.co/hXs2o8Hh8l https://t.co/IyJkrWFbvx",
    "602": "@Tia_dubs The @warriors are the #2 seed in the league and we aren't fully peaked yet #dubnation",
    "603": "@honestsportz @warriors .\n😂😂😂\nSure, because he didn't play!!!",
    "604": "@LakeShowGr8Sho @thepoisonpilson @ESPNPR @bethmowins @heydb @saltersl @NBA @warriors @utahjazz @ESPNNBA Fucking men",
    "605": "ESPN to have all-woman crew for Golden State Warriors-Utah Jazz game - via @ESPN App.   #NBA.   https://t.co/NVH0ASBEVW",
    "606": "Westmont senior guard Stefanie Berberabe was named the Golden State Athletic Conference Women’s Basketball Player of the Week for her role in leading the fifth-ranked Warriors (17-3, 10-2) to a 64-49 win over No. 3-ranked The Master’s (22-1, 11-1) on Sat\nhttps://t.co/7uwpPrWEVr https://t.co/IZGoqAiI3G",
    "607": "@Noelsdaman @unstoppablebaby @warriors @kendra__andrews @ESPNStatsInfo @anthonyVslater Why they don't have negative numbers?",
    "608": "Golden State Warriors have agreed to a contract buyout with Andre Iguodala.",
    "609": "@Seby76335955 @BrooklynNets Because they were fake asterisks rings why did he leave a real team in okc who was superior to the golden state whorers wait didn’t he get smoked by the craptors. Yeah no wonder he bailed. Warriors only can win injury asterisks rings.",
    "610": "1991 and 1992 Hoops Golden State Warriors cards\n\n$0.25 for both @HobbyConnector @Hobby_Connect \n\nSHIPPING: $3.50 BMWT (3 or more cards) - - - $1.00 PWE (1 or 2 cards) https://t.co/dt1nq5voNV",
    "611": "“ESPN to have all-woman crew for Golden State Warriors-Utah Jazz game.” Big milestone. 👏 https://t.co/z6vjsEO1K1",
    "612": "👏🏽 Next Wednesday's Golden State Warriors vs. Utah Jazz game on ESPN will be led entirely by women. https://t.co/bc0qXp5BdN",
    "613": "I feel like the @warriors should recreate the team photo from the 1966-67 Warriors. 🔥@SteveKerr make it happen! https://t.co/CZ5xv11Apa",
    "614": "Hoje tem golden state warriors fml!💯 https://t.co/NwyD25OQsM",
    "615": "@warriors @NBCSAuthentic @957thegame @Chase Who’s our starting 5?",
    "616": "@warriors #KlayThompson plays basketball today!",
    "617": "@warriors @Loon_Rebel5 literal loon god",
    "618": "📅 On this day in 2016, the @warriors Stephen Curry scored 51 points with 11 3PM in a win over the Wizards.\n\nThere have been 15 games in NBA history in which a player scored at least 50 points with 10 3PM. Curry is responsible for seven of them. No one else has more than two. https://t.co/5XCX9pLGKs",
    "619": "@warriors @NBCSAuthentic @957thegame @Chase Y’all really like these jerseys huh",
    "620": "@ShaanVP was lucky enough to work on Golden State Warriors ads for years, and there's just a different level response you can expect from fans of a sports team vs. a brand. \n\nWe made the announcers cry in the last game at Oracle by \"retiring\" the arena with a banner in the rafters",
    "621": "@zookylander1 @warriors @NBCSAuthentic @957thegame @Chase Hell no there is a 3 day rest after this what’s the point of resting him",
    "622": "@warriors @Loon_Rebel5 Loon Dog 💪🏽",
    "623": "@zookylander1 @warriors @NBCSAuthentic @957thegame @Chase Don’t though",
    "624": "@ESPNPR @bethmowins @heydb @saltersl @NBA @warriors @utahjazz @ESPNNBA That’ll be perfect broadcast.",
    "625": "@warriors @NBCSAuthentic @957thegame @Chase Rest steph today",
    "626": "@warriors are gunna take it this year and I'm also betting that Bron will move to another team or retire.",
    "627": "@MattGeorgeSAC Davion’s  defense is outstanding. Wanted my @warriors to draft him.",
    "628": "@SwipaCam Does MVP stand for “most valuable numbers”?\n\nCurry is still the Warriors entire offense, they remain a bottom offense every single time they put a lineup without him on the floor.\n\nHis unique gravity and court warping allow Golden State to slant defense and still produce good O.",
    "629": "Congratulations to dubsDK, CurryFlurry19 and Iggythecat (@iggythecat3) who moved up to take #9, #10 and #24 on the Golden State Warriors team leaderboard.\n\nhttps://t.co/W6VN3LlptP",
    "630": "@jasonskyknight @SLAMonline @warriors They showed some of his worst dunks idk what they are doing",
    "631": "@crypto_pb @terra_money NBA - golden state warriors",
    "632": "Curry scores 40 points as Golden State Warriors win sixth game in a row https://t.co/hr3tmyr4IA",
    "633": "@warriors The finishing five are ones that do more trouble",
    "634": "@C0LE333 @Marcusbruh69 @warriors It’s a 3 day rest not 4",
    "635": "ESPN to have all-woman crew for Golden State Warriors-Utah Jazz game https://t.co/mww174ZpC5",
    "636": "I love this.. #AndrewWiggins joining in makes it so much better.. 😂😂 #DubNation @warriors https://t.co/QC7N6xHQgH",
    "637": "ESPN will produce the Utah Jazz vs Golden State Warriors game on Feb. 9 with 33 all-women crew, including behind-the-scenes staff. The all-women telecast panel will have Beth Mowins calling play-by-play alongside analyst Doris Burke and reporter Lisa Salters.",
    "638": "For the first time ever, an upcoming NBA game between the @UtahJazz and @warriors in Salt Lake City at @vivintarena will be announced and directed by an all-female crew for ESPN  --&gt;\n\nhttps://t.co/VIgQbVJCKx via @DeseretNews",
    "639": "@warriors FLAAANDERS https://t.co/cVAzKcMJR3",
    "640": "Golden State Warriors are Coming off a 7 game winning streak #Warriors  Full odds at https://t.co/nUn5OcMhOI",
    "641": "@3119143830W @forestwithout Golden State Warriors are sponsored by FTX unfortunately",
    "642": "@warriors Please win",
    "643": "@warriors I’m a huge Jordan Poole fan and would love one day To tell him thanks for bringing me back into Michigan Basketball when he was there after he hit that Buzzer Beater shot he did",
    "644": "Ende #Basketball Herren #NBA \n124:120 #GoldenStateWarriors  vs SanAntonioSpurs \n111:121 BrooklynNets vs #PhoenixSuns",
    "645": "Golden State Warriors Last 10 games: 8 Win 2 Lost  (PF)112.7 - (PA)106.2 #Warriors  Full odds at https://t.co/nUn5OcMhOI",
    "646": "ICYMI: @TheFDHLounge brings the latest NBA Future Watch featuring Jordan Poole of the @warriors. https://t.co/5mSln2p44U #TheHobby https://t.co/vuWg4TOYaY",
    "647": "Sacramento Kings vs Golden State Warriors NBA Pick and Prediction NBA Betting Tips 2/3/2022 https://t.co/EA7n5bwiSZ via @YouTube #NBA #NBAPick #NBAPredictions #NBAOdds #Warriors #Kings #SacramentoProud #DubNation #WarriorsVsKings",
    "648": "@warriors @NBCSAuthentic @957thegame @Chase We will most certainly be cheering on Warriors game and GP2!",
    "649": "Utah Jazz vs Golden State Warriors is on ESPN (Caribbean). With commentary from Beth Mowins. Co-commentator is Doris Burke. Reporter is Lisa Salters.  For more details see https://t.co/0cKLxJdo88 #UtahJazz #GoldenStateWarriors #ESPNCaribbean",
    "650": "Consensus Line Move:\n2022-02-03 Sacramento Kings at Golden State Warriors from 224.00 to 225.00\nOver business time\n#NBA #sportsbetting #datascientist #forextrader",
    "651": "Utah Jazz vs Golden State Warriors is on ESPN (US). With commentary from Beth Mowins. Co-commentator is Doris Burke. Reporter is Lisa Salters.  For more details see https://t.co/0cKLxJdo88 #UtahJazz #GoldenStateWarriors #ESPNUS",
    "652": "“[It’s a] great event for the Warriors Foundation. We make $2 million in one night for the foundation. All the players play, plus coaches, owners and an amazing crew.\" -@phil_hellmuth \n\nPhil Hellmuth Speaks About Upcoming @Warriors Charity Poker Event: https://t.co/vLBleYZYii",
    "653": "@dbltree227 @warriors I deserved that 🤣🤣",
    "654": "NBA Betting Trend: Golden State Warriors are 18 - 8 versus poor foul drawing teams - attempting &amp;lt;=24 free throws/game while at home this season\n #bettingtips",
    "655": "@thepoisonpilson @ESPNPR @bethmowins @heydb @saltersl @NBA @warriors @utahjazz @ESPNNBA Oh yeah?  Which other sport is doing that??????\n\nDon't worry I'll wait 🥱",
    "656": "@Ben_ESPN @warriors @utahjazz @bethmowins @heydb @CignalTV will air this game in the Philippines on Feb. 10 at 11 am.",
    "657": "@warriors Watch out for him in the playoffs",
    "658": "@Warriorsnin3rs @warriors @NBCSAuthentic @957thegame @Chase Happy birthday from Brazil, bro! enjoy your day",
    "659": "@warriors I wanna know who's starting tonight so badly",
    "660": "@warriors @NBCSAuthentic @957thegame @Chase Best of luck my dear warriors ❤️❤️❤️",
    "661": "@ESPNPR @bethmowins @heydb @saltersl @NBA @warriors @utahjazz @ESPNNBA Maybe just do it without patting yourself on the back for being wildly behind the times",
    "662": "@FatboyFadeaway @warriors That Kyrie shot 😈 https://t.co/F8WaqTvvRL",
    "663": "@HoustonRockets Vs @warriors \nCurry killed us with 40 plus I walked out so Idk 🤷🏽‍♂️ #greatestshooter https://t.co/NZNSMNftxe",
    "664": "@dbltree227 Funny how sports work, you can win 5 rings but the losses we remember the most.. Its how I feel about the @warriors  in 2016.. PAIN!!",
    "665": "@GSWRevengeTour @warriors @NBCSAuthentic @957thegame @Chase I mean they are great",
    "666": "NEW 🏀NBA betting picks:\n\n🔒Minnesota Timberwolves -5\n🔒Karl-Anthony Towns rebounds [over 9.5]\n🔒Phoenix Suns ML\n🔒Chris Paul points [over 15.5]\n🔒Miami Heat ML\n🔒Golden State Warriors -12\n🔒Los Angeles Lakers +4\n\nLet's get some more wins! 💵\n\n#NBAPicks #gamblingtwitter https://t.co/nR8ORYFkmy",
    "667": "No Steph\nNo Klay \nNo Draymond \nNo Wiggins\nNo Wiseman\n\nNo problem @warriors win without any starting 5 ! \n\nThe @NBA has a problem ! #splashbrothers #WarriorNation",
    "668": "Golden State Warriors at -13.5 for the spread is crazy at the kings that trash #GamblingTwiitter",
    "669": "🏀 More ESPN NBA firsts. This @Warriors vs @UtahJazz broadcast Feb 9 will be led by all women behind the scenes as well as on commentary\n\nIn total 33 women who are ESPN staff and personnel that regularly work on the NBA property will be in every key production and operations role https://t.co/jQgSjQaV1M",
    "670": "ESPN to have all-woman crew for Golden State Warriors-Utah Jazz game https://t.co/z6XR96M7dr",
    "671": "Curious to know why the @warriors are so far down this list? https://t.co/ic6vpCKF2f",
    "672": "@Warriorsnin3rs @warriors @NBCSAuthentic @957thegame @Chase HAPPY BIRTHDAY BRO!!! HOPE YOU ENJOY IT!",
    "673": "@warriors @NBCSAuthentic @957thegame @Chase Worry not dubnation we will win tonight's coz God is always with us may God strength curry and his team mates, let's go worry not it's already known ☝️☝️☝️☝️",
    "674": "@sevhesi @warriors @NBCSAuthentic @957thegame @Chase So edgy",
    "675": "@JPFinlayNBCS Positive vibe: We'll be the best known Commanders franchise in sports. If we were the Warriors we'd be the lesser Warriors to Golden State.",
    "676": "@warriors @NBCSAuthentic @957thegame @Chase This looks nice",
    "677": "Tipping off #BlackHistoryMonth tonight on Warriors Ground\n\n🏀 GSW vs. SAC\n🕖 7pm PT\n📺 @NBCSAuthentic\n📻 @957thegame\n📲 https://t.co/ZkjPJjiF76\n📝 https://t.co/O1jKYRL54T\n\n@Chase || #DubNation https://t.co/ain9OxOB3v",
    "678": "ESPN will have a women’s team for the Golden State Warriors-Utah Jazz game https://t.co/8O2LQll6RT",
    "679": "@warriors vs @utahjazz game on Feb 9 to have all women crew\n\nLet's fucking gooooooo",
    "680": "The Golden State Warriors play basketball today against the Sacramento Kings!",
    "681": "Hi GSW, let's extend our winning streak to 8!\nLet's play hard and w ENERGY! Show ur Killer Instinct! Go @warriors!\n\nPreview: Golden State Warriors face struggling Sacramento Kings https://t.co/SfYRRLJdTD via @unstoppablebaby",
    "682": "@SLAMonline @warriors signed",
    "683": "@Con_Chron @JohnSheaHey This is unacceptable since you’re not allowed to leave your post covering the @warriors ever.",
    "684": "ESPN to Produce First NBA Game Broadcast on National Scale Led By All Women on Camera and in Pivotal Behind the Scenes Roles: All Women-led Crew to Include 33 ESPN Staff and Personnel for Marquee Utah Jazz vs. Golden State Warriors Game on February 9 https://t.co/QHoHK7pbxi",
    "685": "#ESPN to have all-woman crew for Golden State Warriors-Utah Jazz game. 🏀 #NBATwitter  https://t.co/XIoes4JDUB",
    "686": "Love to see this: ⁦@espn⁩ to have all-woman crew for Golden State Warriors-Utah Jazz game  https://t.co/7mVkOjQfZL",
    "687": "ESPN to have all-woman crew for Golden State Warriors-Utah Jazz game  https://t.co/oGAwCz2XHl",
    "688": "Lowe on the Warriors at the deadline: \"I don't think Golden State is upending the apple card at all this year in any serious way... I don't anything big at all is happening with Golden State\"",
    "689": "@ESPNNFL @McClain_on_NFL Lol 😂 it’s fixed could you imagine the dream team in 92 was an actual NBA team then losing to the @warriors 73 win team? No but for marketing and an value you can bet they have a rematch the following season",
    "690": "@Quee03 @warriors Please don't unfollow me hehe",
    "691": ".@warriors go get a solid dub tonight so you can enjoy the 3 day break in peace",
    "692": "ESPN to have all-woman crew for Golden State Warriors-Utah Jazz game - via @ESPN App\n\nInspirational and about time!! Let’s go lady’s  https://t.co/uwhH6twszx",
    "693": "On this date,  February 3, 2011:\n#LeBronJames of the Miami Heat scored 51 points in a 104-100 win over the Orlando Magic.\n\nFebruary 3, 2016:\n#StephenCurry of the Golden State Warriors scored 51 points in a 134-121 win over the Wizards. 🏀 #NBA75 #NBAHistory #NBATwitter",
    "694": "@warriors Let's go get that W",
    "695": "@jamestsang8888 @AndrewKSchlecht There's certainly no guarantee. But you need to maximize the odds of getting a top pick. And even last year shows that. If OKC been had the 7th pick and Golden State the 6th, the Warriors would have taken Josh Giddey.",
    "696": "ESPN to have all-woman crew for Golden State Warriors-Utah Jazz game https://t.co/aKsbfjUUgN",
    "697": "ESPN to have all-woman crew for Warriors-Jazz #GoldenState #Warriors #NBA https://t.co/f9Gl89PN7z",
    "698": "Jakob Poeltl with a dunk vs the Golden State Warriors\nhttps://t.co/yrw5rXP2hy\nhttps://t.co/yrw5rXP2hy",
    "699": "@DanielleCoulan1 @StephenCurry30 @warriors Thank you! 😊 💕",
    "700": "Breaking: The Golden State Warriors are waiving Al Horford, league sources tell ESPN.",
    "701": "Bom dia com Golden State Warriors",
    "702": "Need to unfollow some of my followers who are not active in order for me to follow other @warriors fan accounts. If you read this, kindly say something.  Let's do it.",
    "703": "Stephen Curry has earnings of $74.4 million. Stephen Curry plays for the Golden State Warriors of the National Basketball Association at the point guard position. https://t.co/TcntodSvQ6 https://t.co/gSNDHKTqdf",
    "704": "@warriors Let’s gooo",
    "705": "@iamjhowdelle @warriors its the black jerseys",
    "706": "Golden State Warriors 124, San Antonio Spurs 120\nhttps://t.co/m2Rx8PvJyU\nhttps://t.co/m2Rx8PvJyU",
    "707": "@ooskiziiz @warriors Best record doesn’t mean best team",
    "708": "Team 3 pointers made this season\n\n1.Utah Jazz - 755\n2.Golden State Warriors - 752\n3.Milwaukee Bucks - 745\n4.Minnesota Timberwolves - 727\n5.Charlotte Hornets - 725",
    "709": "@warriors Steph curry playing day👌🥳🏀",
    "710": "@warriors 🌚am I the only ONE inlove with Poole&amp;Kuminga energy this season 🥰",
    "711": "@warriors @Loon_Rebel5 Makes sense. Someone's gotta clean up all those bricks from Curry",
    "712": "@chrissyb34 @warriors That reaction! 😊",
    "713": "@SLAMonline @warriors Kuminga or GP3 should be in not Jta",
    "714": "New Curry Tee Coming Soon! #stephcurry #stephencurry #curry #warriors #gsw #goldenstatewarriors https://t.co/TnKqfLtwPs",
    "715": "@warriors another W",
    "716": "@BamaGrad00 6. Auburn basketball has all of a sudden turned into the Golden State Warriors",
    "717": "@warriors ugh jordan ur so sexy",
    "718": "@SrtaChris @StephenCurry30 @warriors Happy belated birthday Ruth! What a treat! - Best wishes.",
    "719": "@warriors I thought there was a 4 day rest?",
    "720": "@warriors LETS GET IT DUBS.",
    "721": "@HeataoMil_grau @warriors @Raptors Will @MiamiHEAT even make it to the Finals this year? I hope so 🙏🏻 hope y’all get that w today against Spurs",
    "722": "@rightway_7 @warriors #DubNation LET'S GO 🙌🏾 https://t.co/uBt8w7Wq0X",
    "723": "@StephenCurrysB2 @warriors This really is a Curry burner lmao",
    "724": "@warriors Look at JP man, so inspirational 😎",
    "725": "@warriors Lets go Warriors! Lets win this game! 💪🏻💪🏻",
    "726": "Revenge Game: Harrison Barnes plays Golden State tonight.  He played 307 games in his career for the Warriors.",
    "727": "@okayystark @warriors You just answered your own question",
    "728": "@Tony_Mach1 @CThesouthside @LacroixButler @WaynerDorsey Naw, Run and Gun! Golden State Warriors 1980’s“ TMC”🏀⚡️🔥\n#GetBuckets",
    "729": "@warriors W black jersey merchants at it again",
    "730": "@HeataoMil_grau @warriors @Raptors That was a well deserved W by the @Raptors  I was even cheering for them",
    "731": "@warriors What type of jersey they will wear today?\nHope its \"association jersey\" my fav",
    "732": "@warriors Poole is a black jersey merchant,let him start 😂",
    "733": "@GSWnoBrasil @warriors ratio + strus better than washed Klay Thompson",
    "734": "@justinreyesv @warriors @Raptors In the Finals? No. https://t.co/hEw0tbSLZA",
    "735": "@warriors Lets go Warriors 🔥🔥",
    "736": "My favorite picks for today!!🤑\nMorehead State -10/-6 1H\nCollege of Charleston -8\nGolden State Warriors -7 1H\nTimberwolves -3.5 1H",
    "737": "@HeataoMil_grau @warriors Y’all just lost to @Raptors tho?",
    "738": "@warriors @Loon_Rebel5 Kevon is a monster this season, very happy for him.",
    "739": "@warriors Make it 8 in a row!!!",
    "740": "@Dswift05 @warriors bro why",
    "741": "@warriors Jordan Poole plays basketball today",
    "742": "@warriors herro better",
    "743": "@warriors WARRIORS",
    "744": "GAME DAY https://t.co/98PhME4X0D",
    "745": "@DXSF_BHockey I don’t know what to say here fellas, I thought this was Dexter-Southfield not the Golden State Warriors, but I guess even the best can blow a 3-1 lead. I’m optimistic about things getting figured out down the stretch #OnToTheNext",
    "746": "Golden State Warriors vs San Antonio Spurs - Full Game Highlights | February 1, 2022 NBA Season\nhttps://t.co/vmpNgFhTM5\nhttps://t.co/vmpNgFhTM5",
    "747": "📰 Sacramento Kings at Golden State Warriors Predictions and Odds Feb 3!\n👉 https://t.co/kJDVoy0lxT @sportsmemo",
    "748": "@SacramentoKings (19-34)-@warriors (39-13)\n📺NBA LEAGUE PASS📺\n#DubNation https://t.co/62Z0zz1mcM",
    "749": "@XonZone Support Golden State Warriors, idk if they are good or shit rn tho, I haven't watched them much this season",
    "750": "I know its early but you have to hear the best joke in the @NBA. Knock knock? Who's there? The @Lakers. That's it, that's the whole joke. Hehe haha lol 😅😂🤣😭🏀 @Warriors @Clippers @latimes @california #petty #fail #legends #jerrywestrules #nba  https://t.co/nyrNKSvjXw",
    "751": "@warriors  go and check out Jaxon Hayes",
    "752": "Sacramento Kings vs  Golden State Warriors Prediction 2/3/22 -  Free NBA... https://t.co/Nm5Nkb6MHg via @YouTube",
    "753": "Sacramento beat the Nets last night and today they find themselves facing the Golden State #Warriors. Can the #Kings rattle off two impressive wins back to back?\n\nFind out in my latest NBA preview piece for @TWSN___ \n\n#SacramentoProud #DubNation\n\nhttps://t.co/KPbKXle6LV",
    "754": "🏀 𝗚𝗔𝗠𝗘𝗗𝗔𝗬 🏀\n\n👑 SACRAMENTO KINGS\n💦 GOLDEN STATE WARRIORS\n📍 Chase Center (San Francisco)\n📺 NBA League Pass \n\n#SacramentoProud https://t.co/Pyrk67zu2o",
    "755": "@WonderfulMrSims @Commanders Warriors would have been great. But I think it was availability of IP. And in this case everything “Warriors” was probably taken by the the Golden State Warriors.",
    "756": "Let's officially call Jordan Poole the \"Daredevil\". He has no fear. Ice in the veins.\n@warriors",
    "757": "Warriors' Complete 2022 NBA Trade Deadline Preview, Predictions #GoldenState #Warriors #NBA https://t.co/RmeoFpnZsF",
    "758": "Sorry @SacramentoKings\nWe #DubNation can't help but remind ourselves about this legendary performance everytime you guys play the @warriors and even more so when you visit us. Sincere apologies from the bottom of our hearts. \n\nWith that said, Let's demolish them #splashbrothers https://t.co/GYmIqxFU7O",
    "759": "@warriors Love it😂",
    "760": "DIA DE WARRIORS \n🏀 kings (19-34) x warriors (39-13)\n⏰ 00:00\n📺 league pass e links \n📍 chase center\n#DubNation #Warriors #GoldenStateWarriors #NBA \n\n https://t.co/uK7AydmbGe",
    "761": "What we learned from Warriors' Texas trip: Signs Curry busted his s... (East Bay Times)\n\nSAN ANTONIO - Navigating a minefield of injuries and a Steph Curry slump, the Warriors added...\n\nAdd your highlights:\nhttps://t.co/12MhTVkqkr\n #GoldenStateWarriors",
    "762": "It’ll be crazy if harden leaves and kd requests a trade to join the golden state warriors",
    "763": "Consensus Line Move:\n2022-02-03 Sacramento Kings at Golden State Warriors from 222.00 to 223.00\nOver kryptonite on a stick\n#NBA #handicapper #ai #wealth",
    "764": "After spending time with the Orlando Magic and the Golden State Warriors, @AsherWeiss has joined the startup world and founded Tixologi, a blockchain-based ticketing software company. 👇\n\n🎟️ Issue #30: A New Era Of Ticketing \nhttps://t.co/rORm2hhBvo",
    "765": "@warriors @Chase We are winning tonight!! Let’s go the Dubs",
    "766": "@_klaynation_ @warriors @mosesmoody @StephenCurry30 splash nephew? or could be jp’s brother 😂",
    "767": "Golden State Warriors losing Klay Thompson. https://t.co/BjEVNZDaq8",
    "768": "@warriors will plays basketball tomorrow... good luck!!!",
    "769": "Golden State Warriors Basketball.  https://t.co/XrWmIndSd7",
    "770": "@itzzzztea @warriors @Chase you're welcome, associate!",
    "771": "@imnotangelo_ @warriors @Chase thank you!",
    "772": "@itzzzztea @warriors @Chase good response!",
    "773": "@warriors @Chase Sure!!! 💖",
    "774": "@warriors @Chase sure",
    "775": "#DubNation, it's time to get prepped for game day.\n\nDownload the Warriors app before tonight's tip to experience Game Mode, presented by @Chase",
    "776": "@laurajfagan @hamill_law @sfchronicle @warriors Teacher's Unions",
    "777": "@jimmeroz @warriors I turned it off Before 4th quarter and either way i meant what i said  regardless of the game outcome",
    "778": "SACRAMENTO KINGS vs\nGOLDEN STATE WARRIORS, 11:00PM.",
    "779": "Scared of this squad more than the suns to be honest @warriors https://t.co/qtSLhavZTE",
    "780": "@TheWarriorsTalk Judging the Nets from what we've seen already from them, I'd take the Warriors in 5. \n\nGolden State's ball movement&gt;&gt;&gt;",
    "781": "Are the Suns being DISRESPECTED? | #NBA Countdown - https://t.co/rNvdVphGqd - #Brooklyn #ESPN #GoldenStateWarriors #Phoenix #PhoenixSuns #Warriors",
    "782": "What sport do you like the most me\nBasketball my fav team: golden state warriors",
    "783": "Don’t the Golden State Warriors also go by that? Not saying that we couldn’t too, just asking https://t.co/Y3V3Umj7iT",
    "784": "@tessde @warriors @mosesmoody agree",
    "785": "@JayBanzia @ebartlett25 @warriors @Loon_Rebel5 He’s making a joke bro",
    "786": "@warriors @Loon_Rebel5 Underrated",
    "787": "@reem_ibrahim02 It’s even more horrifying when people in the limelight (such as the owner of the Golden State Warriors NBA team) openly say they don’t care about this. Truly disturbing that such atrocities are still going on today around the world",
    "788": "Consensus Line Move:\n2022-02-03 Sacramento Kings at Golden State Warriors from 221.00 to 222.00\nOver pushing weight\n#NBA #bettingtips #programmer #crypto",
    "789": "@karaholiday17 Probably somewhere watching @warriors play but idk",
    "790": "@DantrellWalker1 @TheWarriorsTalk Well, look at the Golden State, too. What you all said was the ball is in Nets' possession. Think of it if the possession was on the Warriors. Nets are great offensively, but defensively? Goodluck on how you'll gonna guard the Splash Bros when Draymond was on the point.",
    "791": "@WarriorNationCP Eyes 👀 on Championship title @warriors let's go for 7th title.",
    "792": "@warriors @Loon_Rebel5 He's improving. Nice job sir. @Loon_Rebel5",
    "793": "@piusmwilson @warriors Thank you",
    "794": "Golden State Warriors Stats:\n\n For game-time decisions and post-game review.\n https://t.co/hXs2o8Hh8l https://t.co/4AkQ0uVg5L",
    "795": "Game-Time Decisions: Sacramento Kings (18-34) Vs. Golden State Warriors (39-13) Thursday, Feb 3, 2022. \nRead More: https://t.co/pOoW4RTHkU https://t.co/p4kL3hKyKm",
    "796": "🏀 When basketball meets poker ♠️\n\nSteph Curry, poker legend Phil Hellmuth and the entire Golden State Warriors will compete in a $10,000 buy-in charity poker tournament this weekend.\n\nWill the Golden Boy be able to outwit the Poker Brat at the poker tables? 👀 https://t.co/Hiene167AH",
    "797": "@korsah_ @warriors @momma_first @Loon_Rebel5 you shoot better than us ?",
    "798": "@dcsportsbog @MarkZuckerman The Golden State Warriors managed to make their nickname “Dubs” so anything is possible. I’m sure someone creative will figure out something that will stick.",
    "799": "i missed #NGWSD cause i was busy editing sports.. \n\n#ladieswhohustle #goldenstatewarriors #nba https://t.co/2qejvmlCQ0",
    "800": "Calvary Christian vs. St. Petersburg Catholic | High School Boys Soccer Live Stream\nWatch Live On :https://t.co/Bm7243Xn6y\n@Warriors\n9-10-1\n@Barons\n7-9\n Thursday, February 3 @ 6p.\nThis game is a part of the \"2022 Boys Soccer District Tournament - 3A District 8 \".",
    "801": "Can we just go back to oracle arena for 10 games @warriors? thanks in advance",
    "802": "All I can say in the @warriors rooks right now is they are now confident to show what they can do, to show their skills and talents. They are really stepping up right now. Pretty sure all the Dub Nation are really really proud to this guys💯💛💙",
    "803": "Warriors HC Steve Kerr says All-Star selection ‘infused Andrew Wiggins with more confidence than ever’ #AndrewWiggins #GoldenStateWarriors #SteveKerr https://t.co/cJNhfrcvip",
    "804": "@HonestDubsFan @warriors He a nobody",
    "805": "@TheWarriorsTalk no doubt Golden State Warriors will nail this one @warriors @StephenCurry30 @Money23Green @KlayThompson",
    "806": "@warriors My guy! 🇨🇩",
    "807": "🏀 We have a couple of picks from tonight’s NBA schedule, including a selection from the @warriors game as well as the all-LA affair between @LAClippers and @Lakers!\n\nhttps://t.co/SKPH17Zaeu",
    "808": "The trio from the Golden State Warriors and it's not even close. They've two lockdown defenders in Draymond Green and Klay Thompson and the greatest shooter God ever created. Also Dray has one the the best pick and roll IQs ever in the game and most importantly they've Chemistry. https://t.co/f9aunayAPW",
    "809": "@OHBmatt3 @R073SH @anthonyVslater 2016 west finals ,who won?who join golden state warriors?who leave OKC?",
    "810": "@feels_tee @warriors You probably turned off mid 4th quarter cause that’s the only explanation",
    "811": "Which team was the 2014-2015 NBA Champions?\n\nAnswer: Golden State Warriors",
    "812": "Jonathan Kuminga Golden State Warriors Fanatics Exclusive Pa\n#sportsCards\nSource: Fanatics Checker\nReason: In Stock\n\n04:29:48.8830 AM EST #Ad\n\nhttps://t.co/hIBbOo28cZ",
    "813": "Jonathan Kuminga Golden State Warriors Fanatics Exclusive Pa\n#sportsCards\nSource: Fanatics Checker\nReason: In Stock\n\n04:29:48.8830 AM EST #Ad\n\nhttps://t.co/Eqy4PtcWET",
    "814": "@hmfaigen @TheSteinLine @SpotifyGrnroom if @lakers dont get anything done, all us laker fans bandwagoning @warriors or @Suns No Cap!!!",
    "815": "@warriors The warrior from congo DRC🇨🇩🔥🔥🔥",
    "816": "#NBA75 Bet of the Day\n\n🇺🇸 Golden State Warriors - Sacramento Kings\n🏀 Sacramento Kings Under 104.5 Points (1.90)\n\nSeason: 49-2-52, -9.46 units\n#bettingtipster \nhttps://t.co/CPjvD1TNrX",
    "817": "Which team was the 2014-2015 NBA Champions?\n\nA: Houston Rockets\nB: Cleveland Cavaliers\nC: Golden State Warriors\nD: Atlanta Hawks",
    "818": "@warriors poole party🕺",
    "819": "@FanDuel 2015 Golden State Warriors",
    "820": "Live streaming Golden State Warriors v Sacramento Kings tv watch February 03, 2022 https://t.co/ipFInsajph Live stream available here &gt;&gt;&gt; https://t.co/pEjXBvWxfP",
    "821": "@MoJoJoJeaux Why? Embrace the bandwagon, welcome them. Some will stick around when the downfall happens. Best of luck in a few weeks. Sincerely, a lifelong Golden State Warriors fan.",
    "822": "Sacramento Kings (19-34, 13th in the Western Conference) vs. Golden State Warriors (39-13, second in the Western Conference) https://t.co/osLdceD9Hf",
    "823": "@WarriorNationCP He deserves it he needs the help also Moody @warriors",
    "824": "Sacramento Kings (19-34, 13th in the Western Conference) vs. Golden State Warriors (39-13, second in the Western Conference) https://t.co/Lxz6MD06ho",
    "825": "@warriors @Loon_Rebel5 The unsung hero finally sung! You make more opportunities for the team! Salute to you @Loon_Rebel5",
    "826": "@ChrisCamiller1 @Suns @warriors Not sure, haven't seen enough of them but Pop is getting old",
    "827": "@DDDGURU @JonathanKuming6 @warriors @BontaHill Who cares about minutes! Clearly he’s better and more showtime than all but maybe 3",
    "828": "lol @warriors aint scared of nobody\n\nwarriors in 4 https://t.co/KRg2n3Oh6m",
    "829": "Golden State Warriors without Stephen Curry, Andrew Wiggins, Klay Thompson but still beat San Antonio Spurs https://t.co/DMLrDXwPVa",
    "830": "@HugoKitano The 2025 Golden State Warriors https://t.co/sKsKq8O2vF",
    "831": "Game-Time Decisions: Sacramento Kings (18-34) Vs. Golden State Warriors (39-13) Thursday, Feb 3, 2022. \nRead More: https://t.co/pOoW4RTHkU https://t.co/K2qZSUryok",
    "832": "Post-Game Review: San Antonio Spurs - 120 Vs. Golden State Warriors - 124 Tuesday, February 1, 2022.\nRead More: https://t.co/pOoW4RTHkU https://t.co/ys3yX8HP4b",
    "833": "Golden State Warriors Stats:\n\n For game-time decisions and post-game review.\n https://t.co/hXs2o8Hh8l https://t.co/YXKcFVWzvA",
    "834": "Golden State Warriors Stats:\n\n For game-time decisions and post-game review.\n https://t.co/hXs2o8Hh8l https://t.co/Tge3e1FlN7",
    "835": "@zaza27 @warriors @2K Just watched a vid you giving an autograph before. Yea, give us a visit here 🇵🇭. You are very welcome.",
    "836": "ESPN reporting: Golden State Warriors are claiming Joel Embiid off waivers.",
    "837": "Going to my first @warriors game tomorrow night. Pretty stoked about it honestly.",
    "838": "Golden State Warriors Stats:\n\n For game-time decisions and post-game review.\n https://t.co/Lt19FOBzle https://t.co/BkxJBAe9BU",
    "839": "Post-Game Review: San Antonio Spurs - 120 Vs. Golden State Warriors - 124 Tuesday, February 1, 2022.\nRead More: https://t.co/QlnsQMnVyC https://t.co/LtvvBabhE5",
    "840": "Game-Time Decisions: Sacramento Kings (18-34) Vs. Golden State Warriors (39-13) Thursday, Feb 3, 2022. \nRead More: https://t.co/QlnsQMnVyC https://t.co/uRyoHDVJP1",
    "841": "@warriors @Loon_Rebel5 Contract year, let's go Kevon!",
    "842": "@himu797 @UrinatingTree As opposed to what Golden State literally has a fucking bridge in the logo not a literal native warrior of anything they should have more claim and even then Gatekeep is some dumb shit to spit when the NBA miles behind the NFL",
    "843": "@korsah_ @warriors @momma_first @Loon_Rebel5 Your agenda dey toss Komot 🤣",
    "844": "The Kings made the Raptors bench, the worst bench in the league, look like the Golden State Warriors TWICE this season. I promise you Kyrie y’all just sucked. Ain’t no adjustments were made. And if KINGS adjustments have you flustered you’re down BAD! https://t.co/TiLPimuedd",
    "845": "@HoopSpaces @warriors @natfluential You are alone 😂 😂 😂",
    "846": "@LSencherey @warriors @momma_first @Loon_Rebel5 i don’t make the rules. 🤷🏽‍♂️",
    "847": "@DanielDones7 @warriors @Loon_Rebel5 “Another rebound”\n\nThat’s definitely from looney putback miss 😭",
    "848": "Warriors film study: How Moses Moody is parting the sea of inattention - Golden State Of Mind #Dubnation  https://t.co/a0u7MBjBFT",
    "849": "@broken_rol @warriors @mosesmoody @StephenCurry30 Moses leader to promise land\nJordan is where Jesus baptised\nJames is the brother of Jesus\nJonathan faithful friend of David\nStephen is 1st Christian martyr\nAndrew one of the disciple",
    "850": "@upillaitweet @warriors @Oracle Think I like is Jk learned this system in Santa Cruz. Now Moody is learning it also without the pressure of playing on the A team. Think that’s how all rookies should go and come up after all star break ready and knowing system",
    "851": "@korsah_ @warriors @momma_first @Loon_Rebel5 Lmfao",
    "852": "Can all @NBA fans just come together and agree that @warriors fans are the absolute worst. 🤢🤮",
    "853": "@Rowan2U @1067theFan Razorbacks so we're ripping off Arkansas, Warriors so we're ripping off Golden state? \n\nPeople are complaining about us \"copying\" a defunct AAF franchise and you want them to go with Warriors or Razorbacks? \n\nSeriously?",
    "854": "@warriors @Verizon Need dray back, bad",
    "855": "It would be sooooo Kings (or Kangz) to lose back to back home games to Houston and Detroit, lose 5 straight on the road and then win back to back games against Brooklyn and Golden State. \n\nKings and Warriors Thursday at Chase.",
    "856": "@2victoriuuh @warriors ❤️Yesssss thank u boo You tooo😻",
    "857": "@benithebutcher @warriors Oh yes 4-0😂😂",
    "858": "My beloved @warriors would smack this lakers team in a 7 game series. Let’s be honest.",
    "859": "@case_russell @957thegame @DamonAndRatto @warriors Either one will be great",
    "860": "@warriors Good Dub‼️",
    "861": "G.O. Klay 22 HOF badges 💎 shoes/contract up on auction (Xbox). Ends in 4 hours around 4 AM Eastern time.This card is super bad ya'll check it out! Comes w/headband at no extra charge 🤣 #2kMyTeamCommunity #NBA2k22 #GoldenStateWarriors @NBA2K @NBA2K_MyTEAM  #KlayThompson #NBA75 https://t.co/Np2SZGLKtg",
    "862": "@KDTrey5 really left the @warriors for this lmao. The Nets have no heart.",
    "863": "@mannymoe707 @SacramentoKings @warriors Of course the Kings at 40 ETH and the Warriors at 1.5 ETH. Makes sense.",
    "864": "@BowTiedFrog @SacramentoKings Warriors floor is slowly creeping up 👀 @warriors https://t.co/Fnc4SvyZ5L",
    "865": "Times que eu simpatizo:\nGolden State Warriors ❤\nToronto Raptors\nSacramento Kings\nOrlando Magic\nIndiana Pacers\nMinnesota Timberwolves",
    "866": "Who Do You Have More Confidence In: The Phoenix Suns OR The Golden State Warriors? | NBA on TNT https://t.co/nN3SkDjN3g",
    "867": "I see the @BrooklynNets are getting the full “last season in Houston” @JHarden13 experience. 4 points….#nba #nets The @warriors broke this man.",
    "868": "@WardellPlsWin I made to this account for @warriors updates",
    "869": "@JaMorant Thag guy would be Draymond Green of the Golden State Warriors who owns you and the Grizzlies",
    "870": "@warriors @Verizon This is the top feel-good win of the season!",
    "871": "@WardellPlsWin Golden State Warriors",
    "872": "Since I was little, every time the @warriors aren’t playing and I turn on @SacramentoKings games…I see the same offense. Iso or pick n roll wit the primary ball handler while everyone else stands. 9 head coaches later, same shit. 😂😂😂",
    "873": "@Dave74991413 @j_ocaceres @SharlaMcBride @warriors @NBA I'm gonna stick with my team.Would never be a Ravens fan that's for sure. Lol",
    "874": "@warriors So beautiful shoots",
    "875": "get christian wood or myles turner @warriors",
    "876": "@D__A__R__Y__L @j_ocaceres @SharlaMcBride @warriors @NBA Correct. Red Wolves would have been a cool #2 and different. Probably would appeal to younger kids much better. Commanders is very boring not to mention Commies as the nickname. Also, Chase Young gave this an F…I’d be curious to see a fan poll",
    "877": "@Neferpi74723512 @warriors @Loon_Rebel5 You can’t get an ORB unless your team bricks a bucket.",
    "878": "@j_ocaceres @Dave74991413 @SharlaMcBride @warriors @NBA Failed logic.There are Giants in NFL and Giants in MLB. There are Kings in NBA and Kings in NHL .",
    "879": "@warriors go grab him https://t.co/gR5QWKH8jh",
    "880": "@warriors Great nation💛 https://t.co/yWq8xx63Kk",
    "881": "@greggpsmith You mean like a Golden State Warrior? 😃",
    "882": "@957thegame @DamonAndRatto He can be another Ja Morant he has that athleticism @warriors",
    "883": "@Dave74991413 @SharlaMcBride No way! There are only @warriors, but in the @NBA (basketball).",
    "884": "The 39-13 Golden State Warriors https://t.co/uGI2tVHhJ5",
    "885": "Check out this listing I just added to my #Poshmark closet: Majestic Golden State Warriors Shirt 1/4 Zip Cool Base Long Sleeve Pullover. https://t.co/ZeVZv164ds #shopmycloset @poshmarkapp",
    "886": "@omega_apex128 @Nushy_Miami @Jeopardy @warriors @missmayim @KenJennings late but thank you for putting “sarcasm” after your response so I knew it was indeed sarcasm",
    "887": "Preview: Golden State Warriors face struggling Sacramento Kings. https://t.co/cgiPobnflX https://t.co/2H8GiIcs1J",
    "888": "One of my favorite things about my dad is that he’ll rewatch @warriors games and still show emotion like he’s watching it for the first time. He’s such a big fan!",
    "889": "Jordan Poole 2019-2020 Panini Mosaic FOTL Pink Fluorescent #/10 RC\n#jordanpoole #jordanpoolecards #goldenstatewarriors #warriors #nba #panini #paninimosaic #FOTL #pooleparty https://t.co/o7cohJB24Q",
    "890": "@JelaniJzk @FWI_Warrior @NBA @warriors just nevermind have a good day instead of arguing with me 😶😑",
    "891": "@JelaniJzk @FWI_Warrior @NBA @warriors you clearly don't understand. I didn't say pull out the race card because NBA sent condolences to the HCBUs. The HCBUs deserve the prayers. I said that because the guy I responded to wanted to make this about the NBA being \"racist\". You're probably not very bright.",
    "892": "@StephhWurry @warriors @NBCSWarriors Discovered methstreams! \nI can see all the games.\nKool!",
    "893": "@SLAMonline @warriors This ain’t it",
    "894": "@warriors @Oracle Consistency is the problem with the guys. If Kuminga, Moody and Lee can give 12-15 minutes of consistent, efficient scoring from bench, that would be the best possible scenario.",
    "895": "@Lurchokebestpal @warriors @Oracle ratio",
    "896": "@warriors @Oracle you have the best team slogan in the NBA. \"tots units fem força\" 💪\n#GoDubs",
    "897": "Gave the kid one of her birthday gifts a few weeks early.  A pair of Curry Flow 8 basketball shoes.  She loves basketball and loves @StephenCurry30 .  Such a cool feeling for my wife and I to be able to get these for her. #DubNation @warriors https://t.co/TBtBFrzx4k",
    "898": "@warriors @Oracle Give moody of Moodus more minutes pls",
    "899": "@warriors @Oracle Give him more mins or I riot",
    "900": "One team, one dream.\n\n@Oracle || Warriors Talk https://t.co/5y9bEla6Mz"
}