{
    "0": "Los Angeles Clippers vs Denver Nuggets || 🔴 𝐋𝐈𝐕𝐄 𝐒𝐓𝐑𝐄𝐀𝐌𝐈𝐍𝐆 HD https://t.co/ufzTrqUNDJ via @YouTube",
    "1": "Denver Nuggets vs Los Angeles Clippers | NBA live stream\nClick Live Here ➡ https://t.co/nW9tQblC3X",
    "2": "Los Angeles Clippers (+3.5) vs. Denver Nuggets #MileHighBasketball #ClipperNation #NBA #NBATwitter #NBA75",
    "3": "Today's NBA Picks: 9:10 PM ET - Denver Nuggets vs. Los Angeles Clippers - 32 PICKS AVAILABLE: https://t.co/N35x5Fp6Ee #nba",
    "4": "Chicago Bulls - Indiana Pacers\nLos Angeles Clippers - Denver Nuggets\n\nBet slip link: https://t.co/Zy2QkYrBzr https://t.co/gRenVoyacT",
    "5": "Today's NBA Picks: 9:10 PM ET - Denver Nuggets vs. Los Angeles Clippers - 32 PICKS AVAILABLE: https://t.co/N35x5FoyOG #nba",
    "6": "Consensus Line Move:\n2021-12-26 Denver Nuggets at Los Angeles Clippers from 211.50 to 210.50\nUnder what ya gonna do?\n#NBA #NBATwitter #ai #ethereum",
    "7": "Consensus Line Move:\n2021-12-26 Denver Nuggets at Los Angeles Clippers from 4.00 to 3.00\n#ClipperNation track it\n#NBA #sportspicks #dataanalysis #binaryoptions",
    "8": "Los Angeles Clippers all-star guard Beesav is entering Covid protocols, sources tell ESPN",
    "9": "LOS ANGELES (AFP) — Los Angeles Clippers leading scorer Paul George will miss at least four weeks with a torn ligament in his right elbow, the National Basketball Association team said Saturday.\n\nREAD MORE:\nhttps://t.co/l6HqWG0pCG\n\n#NBA\n#clippers",
    "10": "LOS ANGELES (AFP) — Los Angeles Clippers leading scorer Paul George will miss at least four weeks with a torn ligament in his right elbow, the National Basketball Association team said Saturday.\n\nREAD MORE:\nhttps://t.co/qBKihb7Eek\n\n#NBA\n#clippers",
    "11": "Los Angeles Clippers Starters:\n\nEric Bledsoe\nLuke Kennard\nTerance Mann\nNicolas Batum\nIvica Zubac\n\nPlayers out:\nPaul George\nIsaiah Hartenstein\nReggie Jackson\nKawhi Leonard\nMarcus Morris\nJason Preston\nJay Scrubb\n#ClipperNation #NBA #NBATwitter #NBA75",
    "12": "🏀 Denver Nuggets(-4) @ Los Angeles Clippers(+4)\n\n⌚ 9 PM ET\n\nO/U: 211.5\n\n📋 Over is 13-3 in Nuggets last 16 overall.\n\nBet BTC ➡️ https://t.co/spMiJIgrUb\n\n#NBATwitter #NBAPicks #SportsBetting #GamblingTwitter https://t.co/Cd50DQy7bK",
    "13": "The Nets’ status report for tomorrow’s game against the Los Angeles Clippers: https://t.co/GE9srgdV3P",
    "14": "NBA Basketball Game Betting Picks Simulator: 9:10 PM ET - Denver Nuggets vs. Los Angeles Clippers - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/E1KRa7s2eG #nba #sportsbetting #freepicks #cappertek",
    "15": "Today's NBA Picks: 9:10 PM ET - Denver Nuggets vs. Los Angeles Clippers - 31 PICKS AVAILABLE: https://t.co/N35x5FoyOG #nba",
    "16": "@MattWelch The coldest move was the Celtics losing 2-4 in 84-85 and sending Cedric Maxwell to end his career in Los Angeles with the Clippers.",
    "17": "Three-time CEBL Player of the Year Xavier Moon sign with Los Angeles Clippers | CBC Sports https://t.co/HJRySfBPs4",
    "18": "Today's NBA Picks: 9:10 PM ET - Denver Nuggets vs. Los Angeles Clippers - 27 PICKS AVAILABLE: https://t.co/N35x5FoyOG #nba",
    "19": "Washington Wizards - Philadelphia 76ers\nDallas Cowboys - Washington Football Team\nLos Angeles Clippers - Denver Nuggets\n\nBet slip link: https://t.co/fdGxjslfKk https://t.co/G6fJDZjMCU",
    "20": "CLEVELAND CAVALIERS -8.5\nLOS ANGELES CLIPPERS  +4\n12/26",
    "21": "New post (Denver Nuggets vs. Los Angeles Clippers Pick - NBA December 26, 2021) has been published on The Sports Geek - https://t.co/nRWRTJaSoP https://t.co/Hc43YckLP9",
    "22": "NBA Basketball Game Betting Picks Simulator: 9:10 PM ET - Denver Nuggets vs. Los Angeles Clippers - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/E1KRa7JDDg #nba #sportsbetting #freepicks #cappertek",
    "23": "Check out LAMAR ODOM LOS ANGELES CLIPPERS NIKE STITCHED ADULT MEDIUM + 2 INCHES IN LENGTH #adidas https://t.co/n1ls7N1RGn via @eBay",
    "24": "Los Angeles Clippers sign Edmonton Stingers standout https://t.co/Wwd8ZbAgTR via @StCatStandard",
    "25": "Los Angeles Clippers sign Edmonton Stingers standout https://t.co/Vm0MujGC5O via @WellandTribune",
    "26": "Los Angeles Clippers",
    "27": "Los Angeles Clippers leading scorer Paul George will miss at least four weeks with a torn ligament in his right elbow, the NBA team said Saturday (Sunday, Manila time). https://t.co/k9poiPSqkl",
    "28": "Today's NBA Picks: 9:10 PM ET - Denver Nuggets vs. Los Angeles Clippers - 24 PICKS AVAILABLE: https://t.co/N35x5FoyOG #nba",
    "29": "Three-time CEBL Player of the Year Xavier Moon sign with Los Angeles Clippers | CBC Sports https://t.co/WQKf2HazIv",
    "30": "Three-time @CEBLeague MVP Xavier Moon signed a 10-day contract with the NBA's Los Angeles Clippers on Sunday https://t.co/ugniZJsTh6",
    "31": "BREAKING: G-League star Xavier Moon has signed a 10-day hardship deal with the Los Angeles Clippers. \n\nJust 3 days ago, Moon joined NBA Buzz’s ‘Inside Buzz With Mikey Domagala’ to discuss his desire of making the NBA &amp; his journey. 3 days later, Moon signed with the Clippers. https://t.co/yxCCPTgziX",
    "32": "Clippers sign guard Xavier Moon (Los Angeles Times)\n\nThe Clippers signed Xavier Moon to a 10-day contract Sunday.\n\nAdd your highlights:\nhttps://t.co/QqOxQDAWjJ\n #LA_Rams",
    "33": "Los Angeles Clippers leading scorer Paul George will miss at least four weeks with a torn ligament in his right elbow, the NBA team said Saturday. https://t.co/Ifk4q0epD8",
    "34": "NIG NEWS‼️ @officialnblc\n・・・\nLEAGUE HIM 🗣: The Los Angeles Clippers have called up Xavier Moon. \n\nOn behalf of the NBLC and TBL @tbasketballleague, we are beyond proud of our very own for this opportunity. Excited to see you play @xmoon02 🙌 https://t.co/wollqj6juD",
    "35": "LEAGUE HIM 🗣\n\nThe Los Angeles Clippers have called up Xavier Moon.\n\nOn behalf of the NBLC and TBL (@TBLproleague), we are beyond proud of our very own for this accomplishment. Excited to see you on the hardwood @xavier_moon 🙌 https://t.co/JjeC2NfgGg",
    "36": "December 26, 1989: Charles Smith of the Clippers scores on a reverse dunk and is fouled by Boston’s Kevin McHale.\n\nSmith scored a game-high 33 points for Los Angeles. Reggie Lewis scored 28 points and Larry Bird had 27 for the Celtics (who won, 112-111). https://t.co/oJvuux7px9",
    "37": "The Los Angeles Clippers said they have signed three-time CEBL MVP Xavier Moon to a 10-day hardship deal. \n\nhttps://t.co/l1mIjWrQdG",
    "38": "@alexbaldman @PeterVecsey1 What is so weird, a lot of fans of @NBA may not know that Buffalo had a team and were pretty good during their run before moving to San Diego and then eventually Los Angeles to become the #Clippers. Randy Smith, Ernie D and of course Bob McAdoo.",
    "39": "The Los Angeles Clippers sign Xavier Moon\n\nhttps://t.co/csCIAukqMY",
    "40": "I Los Angeles Clippers firmano Xavier Moon\n\nhttps://t.co/13zI7wxUeG",
    "41": "Analyzing Sunday’s Denver Nuggets at Los Angeles Clippers odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/PxlBki7xz0",
    "42": "Denver Nuggets at Los Angeles Clippers odds, picks and prediction https://t.co/NuKyRWAmeH",
    "43": "DasHaus made a bet!\n\nEvent: Denver Nuggets vs Los Angeles Clippers #NBA\nBet: Los Angeles Clippers TO WIN +4.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "44": "Spurs: Paul George: Los Angeles Clippers star sidelined with elbow ligament tear, injury requires ... https://t.co/xlxdoyUWqX",
    "45": "DasHaus made a bet!\n\nEvent: Denver Nuggets vs Los Angeles Clippers #NBA\nBet: Denver Nuggets TO WIN -4.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "46": "BREAKING: Los Angeles Clippers Lose All-Star Paul George To Long Term Injury https://t.co/qyMGrN9khE",
    "47": "Consensus Line Move:\n2021-12-26 Denver Nuggets at Los Angeles Clippers from 212.50 to 211.50\nUnder lollipops\n#NBA #sportsbets #statistics #marketing",
    "48": "Please don’t pick on children for believing in Santa.🎅🏾 I know adults that still believe in the Los Angeles Clippers. 🏀",
    "49": "2021-22 #NBA75 Regular Season: Denver Nuggets vs. Los Angeles Clippers\n\n📅 December 27\n⏰ 10 a.m. LIVE\n📺 One Sports\n\n#AlwaysAFan #NBAonOneSports https://t.co/TUKSqhtDHM",
    "50": "Denver Nuggets @ Los Angeles Clippers\nPick : Los Angeles Clippers.\nBasketball. NBA\n\nOrlando Magic @ Miami Heat\nPick : Miami Heat.\nBasketball. NBA\n\nMemphis Grizzlies @ Sacramento Kings\nPick : Memphis Grizzlies.\nBasketball. NBA",
    "51": "Paul George’s return didn’t last long. The Los Angeles Clippers star will miss three to four weeks with a torn ulnar collateral ligament in his right elbow, the team announced on Saturday.",
    "52": "@BobbyMarks42 You’re the Los Angeles Freakin’ Lakers.\n\nIf they can’t keep up with the tech/hedge-fund billionaires, the Busses need to sell the team. Clippers sold for $2B in 2014. Nets for $2.35B in 2019. Lakers could fetch $5–6B.\n\nThis “we’re just a mom-and-poop org” stuff is embarrassing.",
    "53": "Los Angeles Clipper superstar Paul George is expected to be out for at least a month after suffering a torn ulnar collateral ligament (UCL) on his right elbow, the team announced on Saturday (Sunday, Manila time).\nhttps://t.co/eHbwZbaKan\n@Yg_Trece\n#FastbreakNews",
    "54": "NBA Basketball Game Betting Picks Simulator: 9:10 PM ET - Denver Nuggets vs. Los Angeles Clippers - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/E1KRa7JDDg #nba #sportsbetting #freepicks #cappertek",
    "55": "NBA Leader: 25.6 PPG Live Score: Chicago Bulls v Indiana Pacers I Los Angeles Clippers v Denver Nuggets https://t.co/hD9LcogggF https://t.co/feA8VJoofv",
    "56": "Los Angeles Clippers leading scorer Paul George will miss at least four weeks with a torn ligament in his right elbow, the NBA team said. | @AFP https://t.co/DDCUlws6KL",
    "57": "\"..and serves as the official home of the NBA’s Los Angeles Lakers and LA Clippers, the NHL’s LA Kings and the WNBA’s Los Angeles Sparks. This agreement also makes https://t.co/hKN6GUaAlb an official cryptocurrency platform partner of the Los Angeles Lakers and the LA Kings.\" 🔥 https://t.co/57TzdTG7S0",
    "58": "Hi, my name is Jeff Koppel of the Los Angeles Clippers and I am the guy that you guys are looking at. https://t.co/yUpdw5njgO",
    "59": "Paul George: Los Angeles Clippers star sidelined with elbow ligament tear, injury requires rest and further evaluation https://t.co/RstBfFxesg",
    "60": "@shannonjmcc @wojespn los angeles clippers more like bad",
    "61": "Check out 1999-00 SPx Los Angeles Clippers #94 Lamar Odom Rookie 3156/3500 FREE SHIPPING https://t.co/rzHEvcjP7Z @eBay",
    "62": "On this day in sports history December 26, Larry Brown became the 9th coach in NBA history to reach 800 career wins, as the Philadelphia 76ers defeated the Los Angeles Clippers 100-86 in 2001.",
    "63": "Chicomnews: Clippers' Paul George out with torn ligament in right elbow #auspol #chinesenews LOS ANGELES (AP) — Paul George has a torn ulnar collateral ligament in his right elbow and will be out up to a month.\nThe Los Angeles Clippers announced George’s  https://t.co/qccNf3ODAB",
    "64": "Awts! RT @ChrisBHaynes: Los Angeles Clippers say Paul George suffered a torn ulnar collateral ligament in his right elbow. He will rest and be re-evaluated in 3-4 weeks.",
    "65": "Check out this listing I just added to my #Poshmark closet: Adidas Men's Pullover Los Angeles Clippers Size XL Blue. https://t.co/ePyekiaeDp #shopmycloset @poshmarkapp",
    "66": "@Lakers bums and losers along with the Los angeles clippers and the Boston celtics and your terrible los angeles lakers.",
    "67": "Los Angeles Clippers star Paul George will miss at least 3 weeks with a tear in the ulnar collateral ligament in his right elbow.\n\nhttps://t.co/oBIzGq2Y6l",
    "68": "OFFICIALLY the new home of the Los Angeles Lakers and L.A. Clippers. 👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍 https://t.co/tXMlUN8hNg"
}