{
    "0": "The staff at @LCArena_Detroit is seriously unmatched, \nLarry in Event Security, Andrea at the Goose Island Bar and @Dlindsey313 in the West Club are at the top of the list 👏🏼👏🏼👏🏼 #GiveThemRaises #Pistons",
    "1": "@DetroitSportsMa @DetroitPistons 😍 I love you",
    "2": "#NBA #NBATwitter Today's Lineups\n\n#GoldBlooded \nIndiana Pacers Starting 5:\nMalcolm Brogdon\nCaris LeVert\nKelan Martin\nDomantas Sabonis\nMyles Turner\n\n#Pistons \nDetroit Pistons Starting 5:\nKillian Hayes\nCade Cunningham\nSaddiq Bey\nJerami Grant\nIsaiah Stewart",
    "3": "In tonight's @Raptors rest,  I want @DetroitPistons win, ok @WashWizards win  so that it's a @hornets L, @OrlandoMagic W, @Lakers W, can @celtics and @ATLHawks go on a tie? #ahihihi hope nobody got seriously injured and Refs don't fuck up the games @NBA @jv19thole",
    "4": "@DetroitPistons @Kia @iam_killian @CadeCunningham_ @SaddiqBey @JeramiGrant @Dreamville_33 wrong HC sadly",
    "5": "🏀 Pacers vs. Pistons 🏀\n\nAfter surging as of late, Indiana fell to the Knicks on Monday, but they look to get back on track against Detroit. Join @kateconstable @punt_school @_noops as they share their best bets and predictions\n\n📺 WATCH NOW ➡️ https://t.co/dLJMIIShtA\n\n#NBAOdds https://t.co/ftMusGxHAO",
    "6": "@DetroitPistons @Kia @iam_killian @CadeCunningham_ @SaddiqBey @JeramiGrant @Dreamville_33 Don’t play CoJo. Please and thank you.",
    "7": "Tonight's @Kia starting 🖐️ \n\n@iam_killian \n@CadeCunningham_ \n@SaddiqBey \n@JeramiGrant \n@Dreamville_33 https://t.co/MD8S3wflzT",
    "8": "@DetroitPistons Very nice!",
    "9": "@leotheceo_ @TemP_Glide518 @DetroitPistons @HenryFordNews But in my opinion it’s so bad that a guy that gives 0 production offensively is a walk up starter guarantee lee if he had killians minutes would double killians production killian wouldn’t go back to G league and do what lee just did no chance",
    "10": "@DetroitPistons Sweet!  Is this the official logo now?",
    "11": "The @DetroitPistons starting Hayes, Cunningham, Bey, Grant, Stewart on Wednesday. #DetroitBasketball #NBA",
    "12": "@leotheceo_ @TemP_Glide518 @DetroitPistons @HenryFordNews Honestly would love nothing more than for him to turn in to a superstar and me be so wrong thing I haven’t seen  these flashes yet and I’d have no issues if he was coming off bench and they were bringing him along slowly",
    "13": "Tonight's starting lineup for the Detroit Pistons: Hayes, Cunningham, Bey, Grant, Stewart https://t.co/bVWH4AMCA2",
    "14": "@DetroitPistons @PistonsHooper @PistonsDancers @DiscountTire @nbacares Aye yo someone come get this dude 💀😂😂 https://t.co/qWoiNfjlMT",
    "15": "Detroit Pistons game with the Sports Law Society. But first, a panel with their general counsel.",
    "16": "Hoops for Troops themed Power Hour. @PistonsHooper and @PistonsDancers understood the mission 🇺🇸\n\n@DiscountTire | @nbacares https://t.co/82u2pBPgBo",
    "17": "@conna5423 @TemP_Glide518 @DetroitPistons @HenryFordNews you must not understand that if we had haliburton we wouldn’t have gotten the first pick we’d never have been able to get Cade. Trust the process bro. We were lucky killian got injured and never really got to develop &amp; we “perfected the tank”. Killian is showing flashes, he’s otw",
    "18": "@zandingo_ Favourite team: Detroit Pistons\nFavourite player: Tacko Fall\n\nMost Disliked team: San Antonio Spurs\nMost Disliked Player: Davis Bertans",
    "19": "Y’all like Indiana Pacers -6 vs Detroit Pistons tonight?",
    "20": "@AG2000000 @DetroitPistons @NBA Pistons didn't even get here until 1957, I believe.",
    "21": "Chris Duarte (right shoulder) will not suit up for Wednesday’s game vs. the Detroit Pistons. For Fantasy Analysis Click Here: https://t.co/ibsxYMayJG",
    "22": "Pistons host the Pacers tonight. 7 PM Tip-off. \nDPD and Traffic Control Officers (TCO's) have been deployed to major intersections near @LCArena_Detroit for the ingress. #DetTraffic🚦🏀🚔👮 https://t.co/3RAxaNPAFH",
    "23": "Kash Doll Celebrates Detroit Pistons-Themed Baby Shower In A Stunning Gold Gown https://t.co/9OBOvkxFzU",
    "24": "@TreshJason @BallySportsDET @CadeCunningham_ @DetroitPistons Big facts! I would never pick Jalen Green over Cade Cunningham. Cade will win you chips, while Jalen is the more flashy, for the clout player. In their last matchup vs eachother Jalen scored well then went scoreless in the 4th, I also noticed he kept adjusting his hair mid game🤔",
    "25": "@TemP_Glide518 @DetroitPistons @HenryFordNews And it pisses me off more when we could of had someone like haliburton but no we are stuck with this guy",
    "26": "@AG2000000 @DetroitPistons @NBA Well…🤣😂🤣😂🥲😂🤣😂🤣😂 https://t.co/hfJ5FbOlVx",
    "27": "@AG2000000 @DetroitPistons @NBA I got it right!\nI got lucky on this one!\nI had no clue! https://t.co/WiMDe9WCAk",
    "28": "@TemP_Glide518 @DetroitPistons @HenryFordNews I don’t watch the games?😂 actually I watch every single minute of every game I actually wonder if the fans defending him watch the games or are just biased because he is a top 10 pick the guy averages 6 &amp;3 and had a donut last game",
    "29": "@DetroitPistons @MichelobULTRA Who’s the dude in the green sweater?",
    "30": "Sweater weather in Detroit 🌃\n \n#ULTRADrip | @MichelobULTRA",
    "31": "As you can see from the picture text below, the \"Allen County War Memorial Coliseum\" was where the @DetroitPistons #Pistons had their home games from 1952 - 1957. It may interest you that at some point, the team had to share home games w/Redwings &amp; Lions as well. RT! #NBA @NBA https://t.co/Ag2IbAopHe",
    "32": "Detroit Pistons - Indiana Pacers\nBrooklyn Nets - Cleveland Cavaliers\nNew York Knicks - Orlando Magic\n\nBet slip link: https://t.co/STNKWltJ2C https://t.co/MFfsifF2d3",
    "33": "@conna5423 @DetroitPistons @HenryFordNews -Hasn't watched a single Pistons game this season.",
    "34": "@leotheceo_ @BallySportsDET @CadeCunningham_ @DetroitPistons Agreed. And he’s showing a lot of those intangibles that you’re talking about already! So glad we get to watch him on our team lmao",
    "35": "@conna5423 @DetroitPistons @HenryFordNews There's no way ya'll are real people.",
    "36": "@KrispyFlakes2k @DetroitPistons @HenryFordNews Why do u keep asking😐 why would he not",
    "37": "@DetroitPistons @HenryFordNews Is Cade playing?",
    "38": "@DetroitPistons @HenryFordNews Give saben a go and put killian in the G league seriously he needs it more than anyone",
    "39": "ALERT: New high roller bet posted!\nA bet has been placed for $9,041.28 on Detroit Pistons - Indiana Pacers to win $16,093.47.\nTo view this bet or copy it https://t.co/NjewgH996F https://t.co/IEGzQK0uGW",
    "40": "Tonight’s @HenryFordNews status/injury report against the visiting Indiana Pacers: https://t.co/1kxF7PknSO",
    "41": "@TreshJason @BallySportsDET @CadeCunningham_ @DetroitPistons Yea Cade lowkey athletic af. Explosiveness is not what i personally look for, bc winning championships takes more intangibles like being able to read the game and be in the right place off the ball, switching without being told to, defense, playmaking, the clutch gene 🧬 , ect.",
    "42": "Indiana Pacers vs Detroit Pistons Predictions Picks and Game Preview https://t.co/XQtsZmwHd0",
    "43": "Daily Card 11/17 🏀🏈\n\nDetroit Pistons +7 -115 2u\nRider -2 -110 1u\nBoston Celtics +5 -110 1u\nNO Pelicans +7 -120 1u\nMichigan State/Butler over 131.5 -110 1u\nIndiana -5.5 -110 1u\nC. Michigan/Ball State under 57 -110 1u\n\nGood luck!\n\n#BrightPicks #GamblingTwitter",
    "44": "@FanSidedNBA “It’s natural for Detroit Pistons fans to be frustrated with Cade Cunningham’s early-season struggles” \n\nBro what????? Lmfaoooo \n\nJournalism is not for you bro… find a different hobby",
    "45": "Detroit Pistons - Indiana Pacers\nBrooklyn Nets - Cleveland Cavaliers\n\nBet slip link: https://t.co/r1O673y5qE https://t.co/qU09rwEcaz",
    "46": "@EverythingxKing @DetroitPistons @CadeCunningham_ @iam_killian Its always easier to wake up and go to work knowing i get to see the squad play that night 😤 lets have a close game and see what clutch cade can do",
    "47": "November 17, 1994: Detroit's Terry Mills hits a 20-footer over Dikembe Mutombo to beat the Nuggets at the buzzer in Denver.\n\nMills scored 20 PTS and Joe Dumars added 21 for the Pistons. Bryant Stith had 22 PTS and Mutombo added 14 PTS &amp; 20 REB for Denver.\n\nPistons 94, Nuggets 92. https://t.co/afanzmNzyQ",
    "48": "#pistonsplaylist Young Dolph - Preach @DetroitPistons \n\nRIP Dolph 🐬",
    "49": "#Pistons have failed to cover the spread in 8 of their last 9 home games when playing as underdogs. Detroit has been given a 52.4% chance to cover a +6-point spread against #GoldBlooded \n\n#NBA #NBATwitter",
    "50": "@detroitpistons @realgranthill33 needs his #numberretired",
    "51": "POD #15: Pacers -6.5 in Detroit. Pacers view themselves as a playoff team and and if so they have to stomp out teams like the Pistons especially after letting go of the rope on Monday in the Garden",
    "52": "Stat to watch for tonight in the #Pacers matchup with the @DetroitPistons :\n\nDetroit is second in the league in bench scoring (40.5 ppg). Indiana ranks 22nd (30.9 ppg)",
    "53": "My #BirthdayNight #51 @DetroitPistons game tonight with my ❤️ @gypsysoul43 ! \nAny of my followers gonna be at the #Pistons Game tonight ??? \nHit me up and I have 2 extra club tickets to giveaway !!!",
    "54": "@hardwoodhype the Detroit Pistons are owned by a guy whose company successfully lobbied to take away in-person visitation rights in some states so they could overcharge prisoners for phone calls. Now he's a billionaire. The creepiness kinda starts from within, no?",
    "55": "🏀 PISTONS GAMEDAY 🏀\n\nCade and the Pistons will be back at it tonight when the Pacers make the trip to LCA. \n\nThey’ll be looking to bounce back strong after their last performance. \n\n📺: Bally Sports Detroit\n🏀: 7 PM EST https://t.co/DGiNeKtq4b",
    "56": "@Mark_J_Boyle @Pacers @DetroitPistons @1075thefan Are we able to stream this or is it blacked out and only available via radio? Thanks",
    "57": "Stewie insists that the Detroit center is a relative. How someone so smart is unable to distinguish the difference between given names and surnames baffles me. Join us for @pacers - @detroitpistons tonight at 6:30 on @1075thefan and 93.5 FM. https://t.co/BdHa6pkmCb",
    "58": "@EverythingxKing @DetroitPistons @CadeCunningham_ @iam_killian Let’s pray we don’t get blown out again lol",
    "59": "Kash Doll Celebrates Detroit Pistons-Themed Baby Shower In A Stunning Gold Gown https://t.co/TfcoaEpQMO",
    "60": "@amandacarpenter Vaccine resistance.  Detroit has been ignored by media and heroes.\n@DetroitPistons ? @DetroitLionsPro ? @tigers ? @TheRevAl ?",
    "61": "@DetroitPistons Why 8 stars",
    "62": "Indiana Pacers visits Detroit Pistons Predictions and Preview for 11/17/2021 today.  Who are we taking in this game?  Find out now. #Picks #NBA https://t.co/LwNUVx66k9",
    "63": "@DetroitPistons @Pacers @BallySportsDET @971theticketxyt @Shopify @genusee_tweets @LCArena_Detroit Hoops for troops can I get some free tickets to tonight’s game or a future one I’m active duty airforce from Detroit",
    "64": "@DetroitPistons Hoops for troops can I get some free tickets to tonight’s game or a future one I’m active duty airforce from Detroit",
    "65": "Looking for a value bet?  See if the Indiana Pacers-Detroit Pistons Predictions and Preview for 11/17/2021 is one in our preview.  No crazy hype just a prediction and preview. #Picks #NBA https://t.co/LwNUVx66k9",
    "66": "Easy smack last game we back for another round 🤑🤑🤑🤑🙏🏾🙏🏾🙏🏾\n\nDomantas Sabonis Over 0.5 3Pt Made vs Detroit Pistons 🏀 \n\n#GamblingTwitter #FreePicks",
    "67": "@BallySportsDET @CadeCunningham_ @DetroitPistons Love this dunk and the Super-Maxx screen by @LukaG_55",
    "68": "@AG2000000 @DetroitPistons @NBA I picked one",
    "69": "@leotheceo_ @BallySportsDET @CadeCunningham_ @DetroitPistons Yea, his athleticism was one of the first things I noticed when watching him in his first few games. It was a question mark how well it would translate but he looks completely fine out there. Hes shifty &amp; quick, obviously not everyone will be as explosive as Green but thats ok",
    "70": "Top NBA predictions: Warriors keep it going, Bucks get back on track https://t.co/oiLQtO4Kzo #NBA #DetroitPistons #GoldenStateWarriors",
    "71": "@TreshJason @BallySportsDET @CadeCunningham_ @DetroitPistons don’t let them fool you check out all this stuff from high school and college this dude been dunking crazy he just don’t do it all the time but i’m sure we gone see some crazy Cade dunks in the maybe near future",
    "72": "@DetroitPistons Man do u really expect us to just start win 50 games this year \nSTFU\nBeen a fan since I was 8 in the 85-86 season \nAnd I seen us grow to become champions in 89,90, and 04\nWe gotta crawl b4 we walk\nYall sound like a bunch of casuals\nWe don't need fans like yall",
    "73": "@SociosHoops @Wizards @hornets @Pacers @DetroitPistons @celtics @ATLHawks @cavs @BrooklynNets @Lakers @Bucks @SacramentoKings @Timberwolves @HoustonRockets @okcthunder Prediction for the Celtics, come out strong and the get slammed in the second half. https://t.co/3OcTtXCnlt",
    "74": "@SociosHoops @Wizards @hornets @Pacers @DetroitPistons @celtics @ATLHawks @cavs @BrooklynNets @Lakers @Bucks @SacramentoKings @Timberwolves @HoustonRockets @okcthunder Cavs-Nets!",
    "75": "@NBAFan23302408 @DetroitPistons Are u a Pistons fan?",
    "76": "@ToddAdams83 @DetroitPistons Log off",
    "77": "7 games on the NBA slate tonight featuring #socios Team Partners:\n\n@Wizards v @hornets \n@Pacers v @DetroitPistons \n@celtics v @ATLHawks \n@cavs v @BrooklynNets \n@Lakers v @Bucks \n@SacramentoKings v @Timberwolves \n@HoustonRockets v @okcthunder \n\nWhich game are you watching tonight?",
    "78": "@EverythingxKing @DetroitPistons @CadeCunningham_ @iam_killian My boys. 😌",
    "79": "Sports betting thread for 11/17:\n\nAs I sit here in Vegas about to grab lunch before heading to @CircaSports to watch an 11-game NBA slate unfold with Taylor Swift in my earholes, I cannot imagine anything making today worse.\n\nExcept watching the Detroit Pistons play basketball... https://t.co/IerIAIjo2L",
    "80": "@SportsTalkTrav @DetroitPistons Ouch🤭 is that your way of defending the team, that’s so cute but why you gotta make it personal over my facial hair while you don’t have a pfp of your own goddamn self?",
    "81": "@EverythingxKing @DetroitPistons @CadeCunningham_ @iam_killian Cade hitting 25/8/8 tonight",
    "82": "@maxtoscano1 @frankbumb Donors already said sign it or they are pulling every singe penny of their money. You can’t afford to lose both UWM and the Detroit Pistons money here.",
    "83": "@EverythingxKing @DetroitPistons @CadeCunningham_ @iam_killian I swear if I see Cory Joseph playing more minutes than diallo I swear",
    "84": "@EverythingxKing @DetroitPistons @CadeCunningham_ @iam_killian Let’s goo",
    "85": "Pistons have the ball on a string, limiting turnovers, while hitting shooters in the pockets for a sweet-shooting victory for Detroit. https://t.co/LNK1WL80sM",
    "86": "@BallySportsDET @CadeCunningham_ @DetroitPistons Man he really did get UP for that",
    "87": "The Team Store at Little Caesars Arena is open during Detroit Red Wings and Detroit Pistons home games! 😀🏒🏀\n#TeamStore #redwings #detroitbasketball https://t.co/1sPWZz5rjg",
    "88": "@michaeldomps @Lions @tigers @DetroitRedWings @DetroitPistons Would still be nice to have the option. I only go when the Tigers have $10 tickets so it would work for me. I usually ride the bus to Grand Circus anyway because I'm not paying to park by the stadium.",
    "89": "@EverythingxKing @DetroitPistons @CadeCunningham_ @iam_killian Cade killian breakout game again 🙏🏽",
    "90": "Hey @DetroitPistons fans... @CadeCunningham_ and @iam_killian play tonight 😤💪🏿 #DetroitUp #Pistons #NoBrakes",
    "91": "@DetroitPistons @Pacers @BallySportsDET @971theticketxyt @Shopify @genusee_tweets @LCArena_Detroit You have those new red jerseys for sale ?",
    "92": "@DetroitPistons let's sign @boogiecousins please 👀🙏🏽😂",
    "93": "@Attilio_Marz @DetroitPistons Awesome, keep grinding!",
    "94": "@donniekellybaby All we know is pain. 23, and never once got to celebrate a championship. Happy for the wings I’ll root them on, but not invested in hockey. And i was 6 when the Pistons won😕 Michigan/Detroit must have a curse",
    "95": "@SpenceD__ I’m grinding the @DetroitPistons team set right now. My last 3 pieces are super expensive so I’m lingering until I get rich or there’s a massive dip lol https://t.co/Ky2NzmJeb7",
    "96": "@CadePistons @DetroitPistons They went on sale on the 15th so they should be there have fun man!",
    "97": "The Plastic Man, Stacey Augmon, was acquired from the Pistons in a pre-deadline trade with Detroit in '97; he averaged 5 ppg/3 rebs over nearly 5 seasons as a Blazer!\n\n24-hr bids for this '00-01 Upper Deck card begin at only $7 below!\n\n#RipCity https://t.co/HXI9gi9AOy",
    "98": "Back DETROIT PISTONS to BEAT Indiana Pacers tonight in the @NBA (Game Starts at 00.10 GMT) #NBA #Basketball",
    "99": "I'd love to see the @Lions, @tigers, @DetroitRedWings and @DetroitPistons do this but one team is owned by the Ford family &amp; the other two stadiums are owned by parking lot czars. Parking!Parking! https://t.co/k7sczHmA0t",
    "100": "#Warriors stud @StephenCurry30 got a special shoutout from legendary @DetroitPistons PG @IsiahThomas last night!\n\n#DubNation #Pistons #GSvsBKN #NBA \n\nWarriors Star Stephen Curry Congratulated by Pistons Hall-of-Famer https://t.co/pXpLydvndX via @heavysan",
    "101": "@overtime @CadeCunningham_ @DetroitPistons NGl, he earned my panties with this one 🥵😩💦💦💦💦 🇬🇧",
    "102": "#NBA Rewind - 1988:\n\n@DetroitPistons beat @celtics in 6 to reach Finals. @dallasmavs lose Game 7 to @Lakers in West as @MagicJohnson nearly has a triple-double.\n\n*Lakers win Finals 4-3, winning Games 6 &amp; 7 at home. @JamesWorthy42 scores 36 in Game 7.\n\nhttps://t.co/fjU5ByEqRC https://t.co/CiyLiVDliJ",
    "103": "🏀\nMinnesota Timberwolves -2 (-110)\nDetroit Pistons +7 (-110)\nWashington Wizards +1 (-110)\n______________________________\nI also played under 211 on Pistons/Pacers game but line went rapidly down. If you like that, I would play it for smaller wager! Good luck guys🔥🏀",
    "104": "@BallySportsDET @CadeCunningham_ @DetroitPistons Lessssssss Goooooooooooooooooooooo!",
    "105": "@playersonlynft My favorite sports memory is my @DetroitPistons FINALLY getting over the hump and winning their first championship in '89!",
    "106": "@tekmunnee I’d be shocked if the Pistons cover. Detroit not scoring 100 tonight and the Pacers can score 110 on them",
    "107": "Perhaps more Cade jams tonight? 🤔\n\nThe #Pistons are at home against the Pacers.\n\n6:30 p.m. on Bally Sports Detroit. https://t.co/GP1uuWJd19",
    "108": "For tonight's Item of the Game, we're taking $5 off all Hoops for Troops &amp; Camo gear! \n\nPROMO CODE: HOOPSFORTROOPS\n\n⭐️: https://t.co/rhaVbJ01Zp https://t.co/6ylTmfAL3A",
    "109": "@Ligers_Pistons I've said all summer that Hinch worked wonders. Guy did a great job. He's excellent. But I refuse to fawn all over them like a good number of Detroit media slappies.",
    "110": "@CadePistons @DetroitPistons Gotta get the red ones",
    "111": "Kash Doll Celebrates Detroit Pistons-Themed Baby Shower In A Stunning Gold Gown https://t.co/cck1DfpaF0",
    "112": "@OspinaDiego @fhqwhgads2020 @PFF You wouldn’t have a car if it wasn’t for Detroit shut up. Looking at the history of the redwings pistons tigers and college teams Michigan is a sports state lions are the only team that haven’t done well",
    "113": "Kash Doll Celebrates Detroit Pistons-Themed Baby Shower In A Stunning Gold Gown https://t.co/5cLoOJBcRq",
    "114": "@Ligers_Pistons Yes it is. And according to a good chunk of the Detroit media, your team is going to win it all!",
    "115": "I need @MB3FIVE on the @DetroitPistons ASAP! #NBA",
    "116": "@XXXMEEZY I too was thinking about the same. I’m a Pistons fan in Detroit and many of us have high hopes in CC turning the team around.",
    "117": "@DetroitPistons I’m not going today cause I don’t like y’all no mo’…",
    "118": "⭐️ Fresh wallpapers for our Hoops for Troops night! ⭐️\n\n#WallpaperWednesdays | #Pistons https://t.co/jUrIOWnmEx",
    "119": "@StephenCurry30 should play vs the cavs and rest the next game vs Detroit. \n\n@SteveKerr Rest him and Dray on that second string of b2b games. JP and Wiggs can handle the pistons by themselves. \n#DubNation",
    "120": "@DetroitPistons @BallySportsDET @CadeCunningham_ Good no-call on the red in the paint area.",
    "121": "So thankful to have @DetroitPistons star rookie @CadeCunningham_ and @myUHC teaming up to give new winter coats to every kid at Boys and Girls Clubs of Southeast Michigan!  Another great event! #Pistons #NBA #Dreambuilders https://t.co/CeCHhFQDN2",
    "122": "@nbagleague @NBA @Dom_2k @YourGirlGi_ @MotorCityCruise @DetroitPistons Overrated league so who cares",
    "123": "@DetroitPistons @j_josh11 Cut josh Jackson",
    "124": "For @j_josh11, thanking the men and women who serve our country is an extra special honor. Both his parents were in the military and that's where they met.\n\nTonight the #Pistons are hosting Hoops for Troops night. 🇺🇸 \nJoin us: https://t.co/heFeZQDRQe https://t.co/agELgjiB2F",
    "125": "Here are the latest odds, injury report, and predictions as the Indiana Pacers take on the Detroit Pistons on the road.\n\nhttps://t.co/0wuyHLse8Q",
    "126": "Hey guys! I’m working on behalf of the Detroit Pistons selling tickets, use my link below to get discounted tickets and packages to any upcoming games!! Please remember to put my name down if you do make a purchase through the link, Thankyou😁        https://t.co/QizYX6gV94 https://t.co/ekfNl8h7FB",
    "127": "@DetroitPistons Bring the horse back you dildo",
    "128": "1990-91 NBA Hoops #109 Dennis Rodman Detroit Pistons DPOY #DetroitPistons https://t.co/j4iG6Q8599 via @eBay",
    "129": "Yo @DetroitPistons sign this man. He's a 3pt sniper and can take you off the dribble. I heard he's a pretty big fan also. https://t.co/jR2ZDDdmZw",
    "130": "@DetroitPistons We adding a star for each Loss?  🤔",
    "131": "This week's #Pistons Mailbag features @Keith_Langlois' answers to your questions on this year’s draft class, @SabenLee, and more! \n\n🔗: https://t.co/LeU08b9KPH https://t.co/QcDB64vU21",
    "132": "Detroit Pistons vs Indiana Pacers NBA Picks, Odds, Predictions 11/17/21 » Sports Chat Place https://t.co/sClXfpV2t2 #NBA #NBAPick #FreePick #FreePicks #SportsBetting #ExpertPick #NBATwitter  #ExpertBettingAdvice #BettingTipster #Handicapper #SportsGambling #goldblooded #pistons https://t.co/V5Ow0RVaFO",
    "133": "Did the @DetroitPistons take the wrong guy with the 1st pick in the @NBA draft? Oddsmakers from @DKSportsbook &amp; @FDSportsbook weigh in @MichiganBets https://t.co/fME7b2k57R @jsheeran1981 @julianedlow @cavs",
    "134": "https://t.co/5QKU6D3hii \nUse promo code ADAMS for discounts on SINGLE GAME TICKETS \n\n#NBA #DetroitPistons",
    "135": "Indiana Pacers vs. Detroit Pistons - NBA (11/17/21) | How to Watch, Start Time https://t.co/24r3m9WtfV",
    "136": "@DetroitPistons New profile pic, ok. But, when will we win again???",
    "137": "@Pacers  vs @DetroitPistons tonight",
    "138": "Analyzing Wednesday’s Indiana Pacers at Detroit Pistons odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/RNyliOK12Y",
    "139": "@ShamsCharania Trade Frank for 2nd rounder and sign him back @DetroitPistons",
    "140": "DasHaus made a bet!\n\nEvent: Indiana Pacers vs Detroit Pistons #NBA\nBet: Detroit Pistons TO WIN +6.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "141": "DETROIT PISTONS TURKEY DINNER 59FIFTY HATS now available from NEWERACAP\n\n#newdrop #neweracap #nba #detroitpistons #pistons #detroitbasketball #detroit #michigan #turkey #dinner #59fifty #hats #hatcrawler #fitted #fitteds #flyyourownflag\n\nhttps://t.co/WEGE3WVvvK",
    "142": "DasHaus made a bet!\n\nEvent: Indiana Pacers vs Detroit Pistons #NBA\nBet: Indiana Pacers TO WIN -6.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "143": "@DetroitPistons The profile picture and team look GREAT! Good luck this season from one Detroit brand to another! \n\nYaGottaOlga!",
    "144": "@DetroitPistons When you have to put stars on your logo because you can’t get any “stars” in free agency",
    "145": "@AG2000000 @CanswpP @DetroitPistons @NBA They didn’t move to Detroit until 57-58 season they played in Ft Wayne",
    "146": "The #pistons @DetroitPistons give playing time to players that would probably get DNP'd on most teams (lol). https://t.co/TDPTJchWtQ",
    "147": "Indiana Pacers vs. Detroit Pistons - NBA (11/17/21) | How to Watch, Start Time https://t.co/UHbxUC3OZs",
    "148": "@DetroitPistons @Jacob_Schu_24 I thought it was something important like Hoopers birthday",
    "149": "Indiana Pacers vs. Detroit Pistons - NBA (11/17/21) | How to Watch, Start Time https://t.co/dQU5mkRSYk",
    "150": "The Detroit Pistons did it with Ben Wallace! https://t.co/f5iZc7CXga",
    "151": "@CadePistons @DetroitPistons Damn I should slide. Happy bday!!!",
    "152": "@DetroitPistons @Pacers @BallySportsDET @971theticketxyt @Shopify @genusee_tweets @LCArena_Detroit Cut trey lyles",
    "153": "Hoops for Troops night in the 313 🇺🇸 \n\n🆚 @Pacers \n📺 @BallySportsDET \n📻 @971theticketxyt \n💻 https://t.co/PV8hXiHMVQ\n🤝 @Shopify | @genusee_tweets \n📌 @LCArena_Detroit https://t.co/bhKRwkHX8m",
    "154": "What are the different fuel type segments considered in the piston pin market?\n\nView Detail TOC @ https://t.co/6i1AXSdqkL\n\n#automotive #automobile #technology #technews #Trending #DigitalMarketing #Pistons @pistonbrake @DetroitPistons @PistonHeads https://t.co/VdOqXe7SUa",
    "155": "@Dangles_jangles @rdanch @Super70sSports Don't I know it. I never understood it growing up in Detroit. The Pistons, Tigers, and Red Wings have all had their moments. Maybe someday the Lions, well, we can dream...",
    "156": "@DetroitPistons Signed Meadowlark?",
    "157": "Pistons vs. Pacers preview: Detroit looks to right the ship in second game of homestand https://t.co/ARoLQelgvH",
    "158": "the detroit pistons play ah game of basketball tonight",
    "159": "@DetroitPistons Thank you!! #Pistons",
    "160": "@CadePistons @DetroitPistons hour late but happy birthday 🎉",
    "161": "@leotheceo_ Association",
    "162": "@DetroitPistons What Up Doe! 🙏",
    "163": "@DetroitPistons which jerseys are we wearing tonight for Hoops For Troops night?",
    "164": "@DetroitPistons @Jacob_Schu_24 ahh thats dope… lets get this dub",
    "165": "@DetroitPistons Ohhh ok gotcha",
    "166": "@DetroitPistons OK OK OK OK",
    "167": "@Jacob_Schu_24 Tonight is our Hoops for Troops night.",
    "168": "@DetroitPistons it’s hoops for troops yall calm down😭",
    "169": "@DetroitPistons im confuzzled",
    "170": "@DetroitPistons Fuck is this",
    "171": "@DetroitPistons One star for each championship like the Lakers have??\nOh wait...no",
    "172": "@DetroitPistons Any significance behind this?",
    "173": "@DetroitPistons Beautiful😍",
    "174": "“Cade shot 1/21 from 3 and had a negative assist to turnover ratio in his first couple games”\n\n*starts to play better, as he was expected*\n\nPistons fans- “old takes exposed! This didn’t age well! Detroit vs. Everybody! 🤪”",
    "175": "Welcome to the #NBA Detroit Pistons quizzes. Your first question is the following: In the @DetroitPistons long existence as an @NBA team, they have been in 8 home facilities. What home facility did the team play in from 1952 - 1957? Answer at 6pm EST. Kindly RT! Thanks! #Pistons",
    "176": "Please don't be on bullshit tonight @DetroitPistons also play Hami.",
    "177": "The Detroit Pistons will take on the Indiana Pacers at home tonight at 7pm ET. https://t.co/joFMt1Lf4r",
    "178": "This is so awesome. My worlds are colliding. \n\nCongratulations to our @DetroitPistons jersey patch partner @Mishbia15 and the @UWMlending @UWMLife organization on the recognition. @EY_US’ #EOYUS is an amazing honor. 👏🏽 https://t.co/fMKfhm38gp",
    "179": "@dvn69 @I_M_12 @jpapers7 @NBCSWarriors @KDTrey5 Wrong, 2004 Detroit Pistons.",
    "180": "Must win. \n\n🆚️ Detroit Pistons\n🕛 Midnight\n\n#Pacers #GoldBlooded https://t.co/BkIwhB72ke",
    "181": "Also called the 2003-2004 Detroit Pistons. https://t.co/q8z8Z9KIvx",
    "182": "▶️https://t.co/U1lgtQSBz4◀️ Coming Live:\n#NBAseason \n#CharlotteHornets vs. #WashingtonWizards\n#DetroitPistons vs. #IndianaPacers",
    "183": "Another great opportunity to work in sports! #DetroitPistons #CRMinSports https://t.co/uSKWupUXfu",
    "184": "back in the Motor City 👊\n\n🆚: Detroit Pistons\n📍: Little Caesars Arena\n🕖: 7pm ET\n📺: @BallySportsIN\n📻: @1075thefan\n📱: https://t.co/vKGotPusnP https://t.co/mHB8SVTPGZ",
    "185": "@BoboInTheD @JC29i @PistonsThoughts @PistonPowered @Pistons__Talk @omarisankofa @DetroitPistons @lockedonpistons @KeithSmithNBA @KuKhahil @MotorCityHoops @johnhollinger Reddish isnt starting but I dont value Grant this high. Bad efficiency &amp; meh advanced stats. No way hes getting 3 recent top 10 picks on their rookie contract + another 1st rounder. Hawks could of got someone much better than Grant with that offer before the season with that pkg",
    "186": "Your Daily NBA Tip is Here!\nDomantas Sabonis - Over 16.5 against the Detroit Pistons #nbabets #nbabetting https://t.co/1ua36JL175",
    "187": "The Sixers without Embiid and Simmons basically the Detroit Pistons 😭",
    "188": "GAME DAY\n\n🏀 Pistons 🆚️ Pacers\n⏰ 21:00h\n📺 League Pass\n🏟 Little Caesars Arena, DETROIT https://t.co/vu59ikdZn9",
    "189": "Detroit Pistons game vs. Indiana Pacers: TV channel, time, radio info https://t.co/B641qgrrTO",
    "190": "NBA Day 3️⃣0️⃣ 🏀🏀🏀\nIndiana Pacers vs Detroit Pistons\nWashington Wizards vs Charlotte Hornets\nLos Angeles Lakers vs Milwaukee Bucks\nBoston Celtics vs Atlanta Hawks\nNew Orleans Pelicans vs Miami Heat\nCleveland Cavs vs Brooklyn Nets\nOrlando Magic vs New York Knicks",
    "191": "@PistonPowered @TheBukShow @DetroitPistons That would put us at 7 (7.8) wins over 13 games at .6% wpct? 8th in the East or nah? #pistons",
    "192": "So grateful for the work @EarlTheTwirl is doing as ambassador for @DetroitPistons to revitalize the legendary Ceciliaville! My students were blessed to hear him speak about new initiative and playing in NBA with Jordan et al @detmercy @MidwestJesuits @sport4humanity @UDMCLAE https://t.co/ZRqT9CM62n",
    "193": "@DetroitPistons @CadeCunningham_ @Keith_Langlois Cade's seems to have his head screwed on correctly, I like like this kid😊",
    "194": "#NBA75  Bet Of The Day \n\n🇺🇲 Detroit Pistons - Indiana Pacers\n🏀 Click on the link (1.87)\n\n🇺🇲 Atlanta Hawks - Boston Celtics\n🏀 Over 214.5 (1.97)\n\nSeason: 16-0-16, -2.19 units\n#NBATwitter \nhttps://t.co/LJ561W8wGj",
    "195": "@PistonPowered @TheBukShow Whats the @DetroitPistons record in games he's played in?",
    "196": "@Jacob_Schu_24 @DetroitPistons @CadeCunningham_ That should’ve been me! https://t.co/W83KCIn7Wp",
    "197": "Lock those teams in ASAP.  ONLY GOT ROOM FOR 40 TEAMS!!!  CHAMPIONSHIP GAMES @ THE LITTLE CAESAR ARENA IN DOWNTOWN DETROIT, MI.  Each team gets 12 tickets to the Pistons vs New Orleans February 1st.   Can't beat it.  No money grab.  Straight ❤ for the game!🔥  Tap IN!!!! https://t.co/8ZQVKFxHsJ",
    "198": "Detroit Pistons game vs. Indiana Pacers: TV channel, time, radio info https://t.co/bsGFzA999r https://t.co/Y1bOwuQXgm #nba #sportsnews #basketball https://t.co/meZw008r9a",
    "199": "Match: Detroit Pistons - Indiana Pacers\n\nBet slip link: https://t.co/CeNKmjfKvG\n\n#DetroitPistons #IndianaPacers #cdai #sportspicks https://t.co/yTIvKHjIJO",
    "200": "Detroit Pistons game vs. Indiana Pacers: TV channel, time, radio info https://t.co/pR42yCEWRH https://t.co/FdpauRvk7g",
    "201": "Detroit Pistons game vs. Indiana Pacers: TV channel, time, radio info https://t.co/7CoKmVgmnL",
    "202": "@NBAonTNT How do you get A ring what is the strategy I always liked kobe bryant, kevin Garrett, charles Barkley, larry Bird, DannyAimes, chaq o neal, Michael Jordan, stephen Curry, Magic Johnson and Cookie, Kareem Abdul Jaber,Spud Webb Atlanta Hawks, Detroit Pistons. WNBA NCAA.",
    "203": "New listing! \n\nGRANT HILL 1995-96 NBA Hoops Sizzlin’ Sophs #199 Detroit Pistons NM-MT \n\nCheck it out: https://t.co/gHbqJh6z6t\n\n#TradingCards #ForSale #eBay https://t.co/PK98epc7lu",
    "204": "@MattOswaltVA I tell you what.  Our sports teams here in Detroit may not be that good, but I doubt the Ford family will change the name of Ford field for the Lions.  Or the Illitch family with Little Caesar's Arena for the Red Wings and Pistons.",
    "205": "Indiana Pacers vs. Detroit Pistons- 11/17/21 Free Pick &amp; NBA Betting Prediction https://t.co/q6Pp6ERT2P\n.\n#Betting #FreePicks https://t.co/GDkpB75ZZi",
    "206": "https://t.co/eFiDCb8GuB\n\n🏀Who's winning 🏀\n\n Detroit Pistons 🚙\n                 V,S\n  Indiana Pacers 🏃\n\nPrediction in the comments section below and I will read them and give them a like",
    "207": "You know the warriors a problem when Detroit local news is talking about them, like bro they not playing the pistons 😭",
    "208": "@Super70sSports Detroit Pistons beating LA Lakers in 2004 NBA Finals. The Pistons had no breakout stars whereas LA brought in two stars, Karl Malone and Gary Payton, in search of their first championship. They already had Kobe and Shaq.",
    "209": "@DunkedNetwork @RyBry53 @notrazpberry @DetroitPistons We need talent outside of Cade Cunningham, a guard that can score fits that",
    "210": "Detroit Pistons - Indiana Pacers\nAtlanta Hawks - Boston Celtics\nOklahoma City Thunder - Houston Rockets\n\nBet slip link: https://t.co/x9ZmoaYvhr https://t.co/amivcT4hjo",
    "211": "1 in 14 Americans claim they would miss last second shots against the Detroit Pistons.",
    "212": "I don’t understand why. Nothing against Killian but the list of guys they didn’t choose after him,,,Haliburton, Cole Anthony, Ty Maxey, Quickl and Bane…is pretty extensive. Detroit fans fall in love with their teams’ picks but the Pistons overlooked better options. Bottom line. https://t.co/0q6zwoo5Rx",
    "213": "@Trysta_Krick Are they playing the 2004 Detroit Pistons?",
    "214": "@TheHobby247 2021 Cleveland Cavaliers &amp; Oklahoma City Thunder $15 Shipped BMWT\n2021 Dallas Mavericks Lot $50 OBO\n2021 Denver Nuggets Lot $15 Shipped BMWT\n2021 Detroit Pistons Lot $60 OBO https://t.co/DqLVBi0Xqf",
    "215": "@North2North Not taking anything away from Curry. But how do you think he would’ve done against 89 Detroit Pistons defense?",
    "216": "@_RalphMyMans If you can’t be the 15th man on the Detroit Pistons then 😬",
    "217": "@BayleeEllaRae Gameday Detroit at Great Lakes Crossing. They have all the Pistons throwbacks",
    "218": "@mcwheezer @wasted_voter @JustinTbao @cavs @cediosman @deanwade3232 @_bigjayy_ @rickyrubio9 @dariusgarland22 Why it took a buzzer beater to beat those bums. Detroit pistons owned Jordan until they got pippen nice try bum",
    "219": "Little Hot Shots Division - OKC Thunder #1 def. Detroit Pistons #4 12-7 #SFLYBASKETBALL @exposurebball",
    "220": "Pistons fans can see him in Detroit on Sunday https://t.co/jJBvWxxzBO",
    "221": "Bring him back. @MotorCityCruise @DetroitPistons\n\n#Pistons #DetroitBasketball #StartYourEngines https://t.co/tIXOMx1NQq",
    "222": "I want better for Sekou. @DetroitPistons pick this man back up https://t.co/4COmfIyRuK",
    "223": "Come back to Detroit, Bruce Brown - Future Hall of Famer - Bruce Brown! - Signed, Pistons Fan https://t.co/qy4H56ZWw6",
    "224": "@BobSaietta Imagine a 2001 movie reliant on its cast for appeal airing on TNT on a Tues. evening between Natl. Treasure 2 and a Detroit Pistons game.\nNow change nothing but make it a 2021 release that has heaps of Ryan Reynolds' schtick in it. This is that movie.\nAlso the Rock's tux is fake. https://t.co/pblQqkDQj5",
    "225": "Detroit piston trade: Grant to Warriors for Kuminga and Wiseman",
    "226": "@nateschramke @DetroitPistons @SaddiqBey @CadeCunningham_ @FWJackson15 They were missing layups and shots in the paint too 😂",
    "227": "The DETROIT PISTONS are a DUMPSTER FIRE + Im BETTER than James Harden! N... https://t.co/GlHUgvwmP6 via @YouTube",
    "228": "@DetBadger @DetroitPistons @SaddiqBey @CadeCunningham_ @FWJackson15 ok but maybe if the shots aren't falling don't have them shoot every play",
    "229": "@FastBreak1993 @amort9924 Ya not the lions and probably not the pistons for a while so HALF of Detroit sports are back. How bout that? 😂",
    "230": "Alma Powell with the Bad Boys Detroit Pistons should be afforded the full protection under it's mandate."
}