{
    "0": "Time for some Friday NBA action! #PorVida\n\n@zachcolwellPtR with y'all tonight as the San Antonio Spurs try to break a 4 game losing streak.\n\nTo do so they will have to beat a young and talented Cleveland Cavaliers team. This will be the first time SA will see #3 pick Evan Mobley.",
    "1": "Cleveland Cavaliers to beat San Antonio Spurs @1.66",
    "2": "Cleveland Cavaliers to beat San Antonio Spurs @1.66",
    "3": "Cleveland Cavaliers vs San Antonio Spurs LIVE REACTION/Play-By-Play https://t.co/pjSM7EZRQt via @YouTube",
    "4": "Tonight's starting lineup for the San Antonio Spurs: Murray, Vassell, Johnson, McDermott, Poeltl https://t.co/bVWH4AMCA2",
    "5": "🏀 San Antonio Spurs vs Cleveland\n🏆 NBA\n🗓 14/ene.\n⏰ 22:30\n📺 NBA LEAGUE PASS",
    "6": "It’s time for Basketball: San Antonio Spurs vs Cleveland Cavaliers https://t.co/ux9bdrfNEL https://t.co/Zm0e6uMcGU",
    "7": "Congratulations to JPMunoz who moved up 1 spot to take #1 on the San Antonio Spurs team leaderboard.\n\nhttps://t.co/HQxWdPfRe7",
    "8": "San Antonio Spurs’ Devin Vassell hopes to pick up where he left off after second COVID bout https://t.co/VHVnEGM2iC",
    "9": "What's #Best today on https://t.co/VfZu3jgOen ?\nHighlights: Dejounte Murray Career-high 32 Pts : San Antonio Spurs Vs. Houston Rockets : 1.12.22\nhttps://t.co/VlUpw9Dliw\n#sports",
    "10": "NBA Basketball Game Betting Picks Simulator: 8:40 PM ET - Cleveland Cavaliers vs. San Antonio Spurs - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/JQ90w4YT8n #nba #sportsbetting #freepicks #cappertek",
    "11": "New windbreakers @spurs !! #spurs #SanAntonio https://t.co/l8KQpmUsPp",
    "12": "Yea but the media always hates on San Antonio and because spurs haven’t won many games. That’s okay you fucks @espn https://t.co/OuuuunaxDP",
    "13": "@BobaConLeche This is the kind of move that the spurs need to be thinking of. I’d prefer her not to tank and to add a star through trade. Simmons is a difference maker and exactly the kind of player San Antonio should be going after",
    "14": "@ZachLaVine @spurs @DaeshonHall @DejounteMurray Plz come to San Antonio",
    "15": "@BobaConLeche If that is the case, the spurs should make that offer today. Simmons be a great fit in San Antonio",
    "16": "The NLSC NBA Jam: On Fire Edition Tournament continues, thanks to @ParsecTeam! Next up is Game 1 of the first round matchup between @BBallVideoGames (Chicago Bulls) and Sevin0Seven (San Antonio Spurs).\n\n📹: @Dee4Three84\n\nhttps://t.co/K8Kg1c1oDl",
    "17": "What's #Best today on https://t.co/VfZu3jgOen ?\nHighlights: San Antonio Spurs 124 Houston Rockets 128 : 1.12.22\nhttps://t.co/0FJdGJKgxS\n#sports",
    "18": "🏀 Cleveland Cavaliers(-3.5) @ San Antonio Spurs(+3.5)\n\n⌚ 8:30 PM ET\n\nO/U: 223.5\n\n📋 Cavaliers are 5-1 ATS in their last 6 Friday games.\n\nBet BTC ➡️ https://t.co/spMiJIgrUb\n\n#NBATwitter #NBAPicks #SportsBetting #GamblingTwitter https://t.co/p5GbaY1ndy",
    "19": "@HuskerExtraPG Loved his time with the San Antonio Spurs.",
    "20": "Cleveland Cavaliers vs. San Antonio Spurs\n\nDerrick White (protocols) Questionable\nDrew Eubanks (illness) Probable",
    "21": "@Gumm0WRLD @Breno3012 @thebellapoarch @KendrickPerkins @LegionHoops @JaMorant You must live in New York City, in a 39 room penthouse on the 110th floor on 5th Avenue across from Central Park.  Talking about location.  Naw, a 1 bedroom walkup on skid row with a hot plate for a stove and cold running water. The Spurs won 5 championships in San Antonio.",
    "22": "@TroyMangram @king_zsz @HoopMixOnly I give u all of that except the skill part. U must've forgot tmac dropped 13 points in 33 seconds on defending champs San Antonio Spurs. One of the most clutch performances of all time and i hate to say he never reached prime. Orlando tmac was the best we've seen. All love tho",
    "23": "Congratulations to EagleTex who moved up 1 spot to take #1 on the San Antonio Spurs team leaderboard.\n\nhttps://t.co/HQxWdPfRe7",
    "24": "San Antonio Spurs: Devin Vassell Is Turning Into A Crucial Player For The Spurs https://t.co/AzfMs0NFz2",
    "25": "New post (Cleveland Cavaliers vs. San Antonio Spurs Pick - NBA January 14, 2022) has been published on The Sports Geek - https://t.co/2IeJf4BhgV https://t.co/btAJqLHmPS",
    "26": "Also I really like the PG matchup; Darius Garland vs Dejounte Murray. I give Garland a slight edge but I think they play each other to a draw. 🍿#SanAntonio #Spurs #Cleveland #Cavs",
    "27": "ALERT: New high roller bet posted!\nA bet has been placed for $6,648.94 on San Antonio Spurs - Cleveland Cavaliers to win $12,566.49.\nTo view this bet or copy it https://t.co/6AlZzY8lVa https://t.co/65PDzSmb2m",
    "28": "San Antonio Spurs Predictions and Preview for 1/14/2022 hosts Cleveland Cavaliers.  Find out who we are taking in this matchup. #GamblingTwitter #NBA https://t.co/I8p0Gtl47X",
    "29": "🔴[LIVE'STREAM] ~ Cleveland Cavaliers vs. San Antonio Spurs - NBA League 2021-2022\n🔴Broadcast Link !! https://t.co/0v2Om55Oh3 ✅\nOn Friday. January 14 /2022\nTime : 8:30 PM",
    "30": "TIP: San Antonio Spurs - Cleveland Cavaliers, P1&amp;P-(113.5), 4.15 by #tipster milan76 (profit this month: +64.56)\n  #betting #Basketball #San #Antonio #Spurs #Cleveland #Cavaliers",
    "31": "San Antonio Spurs’ Josh Primo not a star of his draft class — yet  https://t.co/MXqeTmkKCV #SpursNation #GoSpursGo https://t.co/mtIdwQSq0i",
    "32": "NBA Betting Preview: San Antonio Spurs vs. Cleveland Cavaliers - February 25, 2018 https://t.co/h1KVfrbkyx",
    "33": "San Antonio Spurs’ Josh Primo not a star of his draft class — yet https://t.co/oNjV6eHj5S",
    "34": "San Antonio Spurs NBA Backpack Black FOCO Action | eBay - https://t.co/ILRESEP5eY on @eBay",
    "35": "NBA\nPhoenix Suns - 1H -3.0 (-110)\nToronto Raptors - 1H -5.5 (-110)\nCharlotte Hornets - 1H -6.5 (-110)\nSan Antonio Spurs - 1H +1.5 (-110)\n\n@Clappa12\n@StreakCoolers",
    "36": "San Antonio Spurs: All-American recruits vote: Who has college football's best facilities? https://t.co/CFFqUhAHRj",
    "37": "mr. LaVine would you like to come play in San Antonio? you will be the first scoring option playing alongside the best defensive guard in the league and future Spur and MVP Paolo Banchero 👁️ https://t.co/3DBv7aTRqE",
    "38": "Jarrett Allen 15+ PTS / 1+ BLK (-140 @ DK)\n\nAllen is averaging 16.9 PPG in 31 games with Garland. \n\nSan Antonio allows the 6th most PTS to C’s in NBA.\n\nAllen has a BLK in 18 of his last 19 games. Spurs allow 7th most BLKS to C’s.\n\nClose spread is a positive as well. https://t.co/ZiFra1eBoM",
    "39": "Their record may not be among the league's best, but there are some bright spots about the San Antonio Spurs this season.\n\nOne of them is the team being among the best in the NBA at low turnovers. https://t.co/zGgpxsguqZ",
    "40": "Check out San Antonio Spurs NBA Backpack Black FOCO Action #FOCO #SanAntonioSpurs https://t.co/47idbBP40W via @eBay",
    "41": "@JeffGSpursZone Demar has had nothing but good things to say about his time in San Antonio. It was the Spurs and pop that evolved him and took his game to the next level",
    "42": "🏀The Cleveland Cavaliers travel to San Antonio to take on the Spurs in a game the Cavs need to stay in the Eastern Conference playoff race.  @MejiaDinero breaks down the matchup including the team he sees winning and why.  Tip is at 8:30 EST!\n\n➡️https://t.co/wMADRslMiu https://t.co/TFxhTve3sS",
    "43": "This would be a hell of a blow it up move. Especially if the Spurs are eyeing one of the bigs at the top of the draft. \n\nBut it’s San Antonio so this is probably nothing. https://t.co/hjQoteacsu",
    "44": "San Antonio Spurs: Raptors rumors: Toronto considering reunion with Jakob Poeltl https://t.co/cf5FVvMoDf",
    "45": "🏀 Los Angeles Clippers (@LAClippers) #ClipperNation\n🆚 L 113-89 @ New Orleans Pelicans #WBD #LACvsNOP\n⏭️ San Antonio Spurs #PorVida #LACvsSAS\n✈️ N666DN | DAL8928 | B752\n🛫 MSY - 11:09 pm CT\n🛬 SAT - 12:19 am CT\n📡 Tracking: https://t.co/WapmPAfqaZ https://t.co/SB7SeAiAHb",
    "46": "The @cavs are 3-1 so far on their 6-game road trip. Tonight, they will face the San Antonio Spurs for the first time this season. \n\nGame Notes 1/14/22 - #CavsSpurs: Overall Game #43, Road Game #23\nhttps://t.co/tFkpYs6Ay6",
    "47": "Imagine Masai gets Poeltl back after he traded him to San Antonio for Kawhi who ended up winning us a championship. That’s like double homicide for the Spurs 😭",
    "48": "I got my spurs on, San Antonio",
    "49": "🚨 Line Change 🚨\n\nCleveland Cavaliers @ San Antonio Spurs\nFri 8:40 PM EST\n\nFrom:\nSA 2.5 +110\n\nTo:\nSA 3.5 -110",
    "50": "#NBA \n\nCle/SA\n\nCavaliers are 5-2 ATS in the last 7 meetings in San Antonio\nCavaliers are 21-5 ATS in their last 26 games following a ATS win\nSpurs are 8-3 ATS in their last 11 games following a ATS loss\nSpurs are 2-6 ATS in their last 8 games overall",
    "51": "San Antonio Spurs: Keys to the Game: Cavaliers at Spurs https://t.co/XQahZ5KqWR",
    "52": "🚨 Line Change 🚨\n\nCleveland Cavaliers @ San Antonio Spurs\nFri 8:40 PM EST\n\nFrom:\nSA 3.5 -110\n\nTo:\nSA 2.5 +110",
    "53": "Analyzing Friday’s Cleveland Cavaliers at San Antonio Spurs odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/ZQk4T9S452",
    "54": "(FRI.JAN.21) NBA:BKN-SA PICK:The Nets visit the Spurs in San Antonio! THe Nets w/F KD &amp; G Kyrie Irving win this one:NETS 121-109",
    "55": "Cleveland Cavaliers vs. San Antonio Spurs: game preview and how to watch https://t.co/qR16ECKrw5",
    "56": "On this episode of Locked On Spurs, host @JeffGSpursZone welcomes San Antonio Sports Star's Michael Jimenez to evaluate the Spurs at the midpoint of the season and preview Friday night's Spurs-Cavs game. https://t.co/c0Q0DvlkaK",
    "57": "@ZachLaVine @spurs @DaeshonHall @DejounteMurray welcome to san antonio",
    "58": "This evening on WLEC, we'll have the Cleveland Cavaliers vs. the San Antonio Spurs game.  Pregame starts at 8:00pm and the game starts at 8:30pm. https://t.co/0amTc1o3yV",
    "59": "📷 It’s a SPURS🏀GAMEDAY! Check out the @spurshypesquad at the center today! Rock those Fiesta colors and cheer on our Team! #GOSPURSGO #GAMEDAY #SPURSHYPESQUAD #SPURSFLAG #SPURSFAMILY #SATX #FIESTA (at San Antonio, Texas)... https://t.co/KMzorHyELf",
    "60": "It's a SPURS🏀GAMEDAY! \nCheck out the @spurshypesquad at the center today! Rock those Fiesta colors and cheer on our Team! #GOSPURSGO #GAMEDAY #SPURSHYPESQUAD #SPURSFLAG #SPURSFAMILY #SATX #FIESTA @ San Antonio, Texas https://t.co/q9w5qTPldW",
    "61": "@SUPERMANE_D @KendallP_23 Nah, you stay out of my business San Antonio bone spurs",
    "62": "Our first #BestBets play of the day is the Cavaliers -2.5 VS Spurs (-110)\n-Spurs have only covered in 2 of last 8 games.\n-Cavs 14-7-1 ATS on the road\n-Cavs had a bounceback win VS Utah by 20\n-Bad matchup for San Antonio\n#GamblingTwiitter #NBA https://t.co/AKA8nSmjWA",
    "63": "San Antonio Spurs: The \"safest bets\" from the Adidas All-American Bowl https://t.co/AoszDqFAaD",
    "64": "GO SPURS GO: The San Antonio Spurs (15-26) will host the Cleveland Cavaliers (24-18) Friday night. https://t.co/oJxTyfTxWl",
    "65": "Also playing Cavs -2.5 as a straight bet.\n\nGreat matchup here vs San Antonio as the Spurs give up lots of shots at the rim, where the Cavs excel.\n\nThe Cavs are the better team here and this should be a solid game for Jarrett Allen to put up numbers.\n\nCavs have been a wagon.",
    "66": "CLEVELAND CAVALIERS vs\nSAN ANTONIO SPURS, 9:00PM.",
    "67": "sports memorabilia. David Robinson. San Antonio Spurs from $5.99 https://t.co/v8MnWyiPge",
    "68": "Great article Richard! #spurs #pantsoptional #coyotecannon The San Antonio Spurs Coyote helped build the modern T-shirt cannon, a gunlike device used to launch swag in arenas all over the world https://t.co/sP5MNAyxoM",
    "69": "HOUSTON ROCKETS 128-124\nSAN ANTONIO SPURS, Final.",
    "70": "Cleveland Cavaliers vs. San Antonio Spurs - NBA League 2022\n📺📱Watch Now➠  https://t.co/gyD2cjsozu\nFriday, January 14, 2022 - Time : 8:30 PM",
    "71": "Like racing wiener dogs and spandexed dance teams, the T-shirt launcher has become a beloved component of timeout entertainment in sports arenas throughout the world. And it all started right here in San Antonio. @ExpressNews @mySA @spurs https://t.co/734ZtnuxKT",
    "72": "DasHaus made a bet!\n\nEvent: Cleveland Cavaliers vs San Antonio Spurs #NBA\nBet: San Antonio Spurs TO WIN +4\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "73": "DasHaus made a bet!\n\nEvent: Cleveland Cavaliers vs San Antonio Spurs #NBA\nBet: Cleveland Cavaliers TO WIN -4\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "74": "@JimmyTheBag @PubSportsRadio I see the Spurs play the Grizz march 30th in San Antonio 👀 … I’m trying to figure out exactly when I can come down and still need to know some details but I think we should go to that game for sure my guys … can’t wait to hang with the fam weeeee",
    "75": "10 Best Scorers In San Antonio Spurs History: George Gervin's Record Is Untouchable – NBA News https://t.co/HCozar9wzE",
    "76": "10 Best Scorers In San Antonio Spurs History: George Gervin's Record Is Untouchable https://t.co/yNJuSF6Mqy https://t.co/WeGjKLjf4t",
    "77": "@barclayscenter @ReynosoBrooklyn @Patty_Mills One of my fav players!! San Antonio Spurs days too!!",
    "78": "“That’s my big brother everyone knows that,” said Rockets guard Kevin Porter Jr. when I asked him about the battle against San Antonio Spurs guard Dejounte Murray. “Every time I see him it’s like ‘Who is the best in Seattle?’”\n#Rockets #Sarge @DejounteMurray https://t.co/zjTRLI7VDe",
    "79": "🧐 Últimos 7 partidos de los Brooklyn Nets como locales\n\n❌100-93 vs Orlando Magic\n❌102-110 vs Philadelphia 76ers\n❌116-120 vs Los Angeles Clippers\n❌104-118 vs Memphis Grizzlies\n❌109-121 vs Milwaukee Bucks\n✅121-119 (TE) vs San Antonio Spurs\n❌109-130 VS Oklahoma City Thunder https://t.co/IDMxpc4vwa",
    "80": "The Cavaliers of Cleveland are favored by 3.5 tonight over the Spurs of San Antonio.\n\nThe Cavs are 5-5 in their last 10 games.\n\nThe Spurs are 2-8 in their last 10 games.\n\nPlayers out\nCavs 2\nSpurs 4\n\nPlayers questionable or probable to play:\n\nCavs 2\nSpurs 2",
    "81": "The San Antonio Spurs Coyote helped build the modern T-shirt cannon, a gunlike device used to launch swag in arenas all over the world https://t.co/FpBbz8hUfQ",
    "82": "Today's NBA Picks: 8:40 PM ET - Cleveland Cavaliers vs. San Antonio Spurs - 1 PICK AVAILABLE: https://t.co/7au6GVkTfT #nba",
    "83": "NBA Basketball Game Betting Picks Simulator: 8:40 PM ET - Cleveland Cavaliers vs. San Antonio Spurs - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/JQ90w4YT8n #nba #sportsbetting #freepicks #cappertek",
    "84": "Detroit Pistons - Toronto Raptors\nIndiana Pacers - Phoenix Suns\nSan Antonio Spurs - Cleveland Cavaliers\nMemphis Grizzlies - Dallas Mavericks\n\nBet slip link: https://t.co/0mrMjGmP8t https://t.co/tYVGyPmfBW",
    "85": "San Antonio Spurs | Best Plays of 2021 https://t.co/m2IbSzxoCf @YouTubeより",
    "86": "I really hope that the Los Angeles Clippers will destroy the San Antonio Spurs in the finals #ClipperNation #GoSpursGo",
    "87": "Game Preview: San Antonio Spurs vs. Cleveland Cavaliers  https://t.co/3z6Tj5u3lj",
    "88": "Cleveland Cavaliers vs. San Antonio Spurs - 1/14/2022 Free Pick &amp; NBA Betting Prediction https://t.co/KQbqVrTIi9\n.\n#Betting #FreePicks https://t.co/BL39856ycu",
    "89": "San Antonio Spurs: Cleveland Cavaliers vs San Antonio Spurs: : Live Stream, Score Updates and How to Watch NBA 2022 https://t.co/Yzg5qeOqda",
    "90": "@KENS5 Jjredick never won a championship, and was a one trick ponytail. He has no weight in San Antonio Spurs basketball.",
    "91": "NBA Basketball Game Betting Picks Simulator: 1/14/2022 8:30 PM ET - Cleveland Cavaliers vs. San Antonio Spurs - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/JQ90w4YT8n #nba #sportsbetting #freepicks #cappertek",
    "92": "@BriantheTaxMan @nwlifer @DanTown22 @JeffPassan Milwaukee Bucks\nGreen Bay Packers\nNew Orleans Saints (Before Brees retired at least).\nBuffalo Bills\nBaltimore Ravens \nSan Antonio Spurs\nThese teams seem to have been doing pretty well for themselves for a good bit now. Spurs and the Saints are exceptions to that recently.",
    "93": "With the 1st pick in the 2022 NBA draft, the San Antonio @Spurs select….           #PorVida",
    "94": "Check out this listing I just added to my #Poshmark closet: Official NBA San Antonio Spurs Face Mask (White/Grey). https://t.co/TScDWFmoa2 #shopmycloset @poshmarkapp",
    "95": "The third Clippers win streak of the season is the shortest, as Pelicans go 3-0 against Clippers this season with a 113-89 win.\n\nIt was basically over in the first 9:10. Clippers now 21-22 and go to San Antonio Saturday. This game tied Dec. 20 vs Spurs for Clippers worst margin.",
    "96": "3 San Antonio Spurs trade targets ahead of NBA trade deadline https://t.co/oCh1Drv1BP #NBA #SanAntonioSpurs",
    "97": "i swear, bobby portis looks like san antonio spurs mascot"
}