{
    "0": "@doctornoperope @RocketStarRL @officialmutombo @dekker @HoustonRockets @GeekSquad ^^^ yeah how tall 🤣",
    "1": "@akaChrisx @911Mrlonely9 @HoustonRockets That man plays 20 mins a game and does more on the defensive end then on offense. Jalen green plays 31 mins a game and shoots waaaay below league average on fg%. 38 % is horrendous.He has the worst +/- in the league. Stats don't lie. Rockets are more efficient without jalen green",
    "2": "Houston Rockets vs Brooklyn https://t.co/Q9l7CSF2VE",
    "3": "@HoustonRockets @JalenGreen @adidasoriginals @WeAreIvyPark He look like young Michael Jackson 🤣🔴",
    "4": "Happy RedNation Day!!!!! Geaux @HoustonRockets!!!!!🐻🏀🚀 #RocketsGameday #Rockets #NBATwitter #NBA #NBA75",
    "5": "HOUSTON ROCKETS +3.5\nUTAH JAZZ -6.5\nBOSTON CELTICS +3.5\n12/8",
    "6": "@DieHrdSportsInc @911Mrlonely9 @HoustonRockets No, youre poorly mistaken. The entire team plays better when Daniel Theis is not playing.",
    "7": "@RocketStarRL @officialmutombo @dekker @HoustonRockets @GeekSquad HOW TALL ARE YOU",
    "8": "LET’S GOOOOO, ROCKETS 🚀🚀. Thanks to @HTOWN4LIFE40 and @HoustonRockets for the tickets 🧡 https://t.co/69gvgWRHpC",
    "9": "Heard 7 Ain't Playing , So Let's Get #7InnaRow @HoustonRockets",
    "10": "@LeefromAHN Houston is the #8 TV market in the country. They've got history (Gordie Howe played there for 4 years!). And a billionaire (Tilman Fertitta) who wants an NHL team to join the Rockets in his hockey-ready arena. And they've got a ready-made rivalry with Dallas.",
    "11": "The @HoustonRockets starting Brooks, Gordon, Mathews, Tate, Wood on Wednesday. #Rockets50 #NBA",
    "12": "James Harden return game  against the Houston Rockets tonight 👀",
    "13": "The Houston Rockets James Harden had a slip and slide free throw contest.",
    "14": "@DaninOttawa My $$$ is that a stadium deal will be reached.\nTemporary lease and Play out of the same arena as the Rockets.\nJust can’t name the team the Houston Oilers… shame",
    "15": "Fuck that choke artist let's get this Dub 😤 @HoustonRockets",
    "16": "@HoustonRockets @SportsTalk790 @ATTSportsNetSW The most over hyped player in the world",
    "17": "@Less_HumbleTeej @HoustonRockets It’s Banchero time https://t.co/LYoZA9EORX",
    "18": "@Blainer93 @HoustonRockets We got a lot more wins!!",
    "19": "@Less_HumbleTeej @HoustonRockets This the last game I’ll allow them to win",
    "20": "NBA \n1 Unit \nHouston Rockets +3.5",
    "21": "@levilock34 @cayleighgriffin Brewer went 21/50 in his first 10 games as a Rocket. He has some great moments in Houston, who could forget game 6 vs Clippers!!",
    "22": "PLZ BROS @HoustonRockets https://t.co/RgeG4Vj571",
    "23": "NBA Live Scores: Game open! Follow to get updates as HOU hosts BKN.  @HoustonRockets @BrooklynNets #NBAGame open! Follow to get updates as MEM hosts DAL.  @memgrizz @dallasmavs #NBA",
    "24": "Tonight's starting lineup for the Houston Rockets:  Brooks, Gordon, Mathews, Tate, Wood https://t.co/bVWH4AMCA2",
    "25": "Brooklyn Nets (-3.5) @ Houston Rockets! #NetsWorld #Rockets #NBA #NBATwitter #NBA75",
    "26": "Houston Rockets Starters:\n\nArmoni Brooks\nEric Gordon\nGarrison Mathews\nJae'Sean Tate\nChristian Wood\n\nPlayers out:\nUsman Garuba\nJalen Green\nDanuel House\nKevin Porter\nJohn Wall\n#Rockets #NBA #NBATwitter #NBA75",
    "27": "Sticking Houston with the Coyotes is going to be the cruelest act of aggression by Dallas since the Mavs did this to the Rockets in a Game 7 https://t.co/HNjxXvrfaI",
    "28": "NBA Live Thread: Brooklyn Nets at Houston Rockets, 8:00 PM EST https://t.co/fyeB0ZC4FN https://t.co/lxf8hvFAQS",
    "29": "the houston rockets owner reading this https://t.co/CPbUV9k43z https://t.co/PMa1eTRxbe",
    "30": "@countryboi409 @emilyestrada39 @HoustonRockets Playoffs..... https://t.co/FSC1ElYTbt",
    "31": "Harden finna go for 40 tonight …but @HoustonRockets GIVE JOSH CHRISTOPHER MORE PT SINCE ITS HIS BIRTHDAY 🗣",
    "32": "@marioelie1 @HoustonRockets So awesome hearing from the Junkyard Dog! https://t.co/6ofzLDs6fO",
    "33": "@ManGuyFriendBro @onlyunlimited1 @statmuse @Chriswood_5 @HoustonRockets and your guys are very critical of a kid who’s hasn’t been in the LEAUGE for a year, and y’all don’t watch games it’s just popular to hate on Jalen.",
    "34": "@newguymeltz I hope the rockets literally just shut him down. At this point, don't even care about winning. If he doesn't get 10pts, that's the win. And all of Houston would agree. 🤣",
    "35": "My wife won tix to the Mavs game and didn’t even invite me bc I’m a @HoustonRockets fan lol",
    "36": "@00rocketgirl @TommyTim304 @HoustonRockets No problem! Thanks for all the Rocket tweets and prizes you put up!",
    "37": "@marioelie1 @HoustonRockets The who???",
    "38": "Let’s go @HoustonRockets ! https://t.co/Fvq6rJbsFF",
    "39": "Detroit Pistons - Washington Wizards\nToronto Raptors - Oklahoma City Thunder\nHouston Rockets - Brooklyn Nets\n\nBet slip link: https://t.co/PUQk0Xl1Fz https://t.co/TZGXWDmvRO",
    "40": "@HoustonRockets @ATTSportsNetSW @SportsTalk790 Let’s Go Rockets!!!!! 🤟🏾🤟🏾🚀🚀 #LightTheFuse",
    "41": "@HoustonRockets @ATTSportsNetSW @SportsTalk790 Bring back Hakeem and Bill Worrell.",
    "42": "@HoustonRockets @MichelobULTRA @Chriswood_5 @snipabrooks_ @alperennsengun @Jaygup23 Jaygup’s Birthday drip 💧💧❄️❄️🥶🥶",
    "43": "📺It's Watch 2 Win time!📺\n\nClick over to AT&amp;T SportsNet for your chance to win an ERIC GORDON autographed jersey!\n\nPLUS, you could be entered to win a grand prize trip to a Rockets away game in March!\n\nFind out how to WIN during our @HoustonRockets broadcast RIGHT NOW! #Rockets https://t.co/Gh8AhOwcLX",
    "44": "@pablofdza @brianmctaggart @MarkBermanFox26 @HoustonRockets @UHCougarFB You beat me to it. Lol",
    "45": "@TinaLara29 Houston Rockets! Dream team.",
    "46": "1 Unit De’Andre Bembry (BKN) Under 9.5 Pts vs Houston #Nets #Props #NBA #NBAPicks #NBATwitter #NetsWorld #Bembry #Houston #Rockets https://t.co/llOJpA9Xuc",
    "47": "Brooklyn Nets @ Houston Rockets\nPick : Brooklyn Nets.\nBasketball. NBA",
    "48": "@rockhettired @Jaygup23 @RGVVipers @HoustonRockets WOWW HUGE WWW",
    "49": "The Houston Rockets Terik Black had  to go to the bathroom during the game so he hit his juul.",
    "50": "Asked Steve Nash if tonight's return to Houston means more to James Harden: \"I think it definitely means something to James. I don't want to overstate it, but I also don't want to understate it. He had such a historic run here. This city means a ton to him.\" #Nets #Rockets #NBA",
    "51": "“I definitely think it means something to James (Harden) — He had a historic run here. I know this city means a lot to him.”\n\n⁃Steve Nash on playing the Houston Rockets.",
    "52": "@HoustonRockets @TheofficialEG10 \nDo this… for the H!",
    "53": "@HoustonRockets B-E-A-T Brooklyn. More later!",
    "54": "Houston Rockets: How far has James Harden fallen off in second year in Brooklyn? https://t.co/DIQuf4VNzK",
    "55": "@HeraKrossHS @Jaygup23 @RGVVipers @HoustonRockets Gleague shop has them to customize. Might want to hurry and get one before they’re gone",
    "56": "@RocketsSznn @HoustonRockets @RafaelStone12 not really, garuba can play the 3 or 4 as well and if anything he’d probably get mins ahead due to his upside",
    "57": "@2017WSCHAMPIONS @HoustonRockets @RafaelStone12 Let’s just say the Rockets do get Hayes that’ll set Garuba back from playing time tho",
    "58": "@rockhettired @Jaygup23 @RGVVipers @HoustonRockets How did you get this it’s amazing!",
    "59": "Asked Houston coach Stephen Silas what kind of reception he thinks James Harden will get tonight at Toyota Center: \"I hope he gets a great reception. You know, he's one of the best #Rockets ever. So I certainly hope he get a great reception.\" #Nets",
    "60": "Houston Rockets vs Brooklyn Nets\n\nProjected Score\n\nPlayer Prop Projections\n\nhttps://t.co/LImKLNCpFe",
    "61": "@RocketsSznn @HoustonRockets @RafaelStone12 because hes one of the best defensive prospects to come into the draft in years and you can get hayes without giving up anyone young",
    "62": "@2017WSCHAMPIONS @HoustonRockets @RafaelStone12 Why not",
    "63": "@JayEyeGee222 @HoustonRockets @RafaelStone12 Lmaoo I’m willing to give up Garuba for Hayes.",
    "64": "Pls @HoustonRockets @RafaelStone12 give em EG hell even Garuba. https://t.co/o2QdK8JaN0",
    "65": "@rocketsszn13 @SportsCenter I'm new to this but what I'm getting if Chris Wood wasn't with a team like the Houston Rockets he would be playing better with a wayyyy more stronger team👀",
    "66": "@HoustonRockets @ATTSportsNetSW Are fans outside the US allowed to join?",
    "67": "On this date in 1971 the @Lakers defeated the Houston Rockets 125-120 for their 18th of a record setting 33 consecutive victories",
    "68": "@GuapoSuavee @NBA @Jaygup23 @HoustonRockets TF you talkn abot",
    "69": "@dbwilliams009 @silvadjr_94 I was sort of a team that did due diligence on bringing nhl to Houston. There are challenges with current provisions in agreements between TC-HSA-Rockets and other third parties that limit who can be a tenant of TC. That’s as simple as I can put it.",
    "70": "@grantlittle09 @jrduncans She has been a fantastic super-sub for many years who usually brought a level of intensity that many times saved a match or better won a match thanks to spectacular goals, like that last-minute goal against Orlando, or that incredible rocket against Houston, both in 2019",
    "71": "@ATTSportsNetSW @HoustonRockets @CalvinMurphyHOF @Toyota @marioelie1 @KevinEsch1 Sengun vs harden in the post. I wonder who will win",
    "72": "It's the @HoustonRockets vs Brooklyn Nets TONIGHT\n\nHere are @CalvinMurphyHOF's Keys to the Game presented by @Toyota \n\nJoin Calvin, @marioelie1 &amp; @KevinEsch1 as they begin our coverage with #Rockets Tip-Off on AT&amp;T SportsNet\n\n#toyotausa\nhttps://t.co/HOouXfTS9S https://t.co/PsQzmqYewl",
    "73": "Look what just got delivered on @Jaygup23 bday. Shout out to the @RGVVipers &amp; @HoustonRockets this one getting framed in the game room.\n#rockets #RocketsTwitter #NBA75 #NBATwitter https://t.co/TqJqnrXOKm",
    "74": "Detroit Pistons - Washington Wizards\nHouston Rockets - Brooklyn Nets\n\nBet slip link: https://t.co/US2tc6I1Pp https://t.co/LO9NYmWkK3",
    "75": "#Basketball,\n\n#NBA, #NBATwitter,\n\n#WeGoHard, #Nets, #BrooklynNets, vs. #HoustonRockets, #Rockets, #RedNation, #RunAsOne, Get your best odds - fast at https://t.co/Ohl03KWAVe https://t.co/SpC5BGh0pO",
    "76": "🏀 Brooklyn Nets(-6.5) @ Houston Rockets(+6.5)\n\n⌚ 8 PM ET\n\nO/U: 225\n\n📋 Rockets are 5-1 ATS in their last 6 games overall.\n\nBet BTC ➡️ https://t.co/spMiJIy3iL\n\n#NBATwitter #NBAPicks #SportsBetting #GamblingTwitter https://t.co/9erfTd3P4s",
    "77": "Please cheer for the 2nd greatest Rocket to ever play for the team, who still contributes meaningful efforts in the city of Houston.\nHarden is ALL TIME champ. He and the Rockets are better off where they are now.\nRemember the good times.",
    "78": "@a_duckett @HoustonRockets @ApolloLaunchPad I’m giving 2 away for $120 lol",
    "79": "@HoustonRockets @ATTSportsNetSW @SportsTalk790 Let’s Go Rockets!!!",
    "80": "@emilyestrada39 @HoustonRockets Hell yeah. going with my son. Be good to see Harden and Durant.",
    "81": "Check out this listing I just added to my #Poshmark closet: Houston rockets ballcap. https://t.co/adVDEykhJ7 #shopmycloset @poshmarkapp",
    "82": "The Houston Rockets P.J. Tucker had  to go to the bathroom during the game so he hit his juul.",
    "83": "If the @HoustonRockets follow me we will win 👀👀",
    "84": "@JalenGreen Sounds like Houston Rockets drama",
    "85": "Im expecting Blake Griffin to play tonight against @HoustonRockets.",
    "86": "@HoustonRockets @bull50 Tmac was deadly for us here in Houston....for some reason he and Yao couldn't stay healthy when it counted especially the playoffs....if you retired Yao 11 I don't understand why Tmac 1 ain't hanging up in Toyota center...both are HOFamers...they need to honor Tracy McGrady man",
    "87": "Keep it going @HoustonRockets.  It all started HERE… https://t.co/gaOuehoj7l https://t.co/BWVVoUiJ3j",
    "88": "I moved on from James Harden's ugly departure from Houston, but I'm not above hoping the #Rockets upset him and Brooklyn to push the winning streak to a season-high seven game. #LightTheFuse",
    "89": "• In their last 10 games as the betting favorite, Brooklyn is 3-7 ATS. Brooklyn is 5-7 ATS this season when favored by fewer than 7 points.\n\n• In their last 5 games as the betting underdog, Houston is 4-1 ATS.\n\n#NetsWorld | #Rockets | #NBA",
    "90": "It's GAME NIGHT for the @HoustonRockets \n\n@cayleighgriffin has a preview of today's game against the Nets in the Midday Minute presented by @memorialhermann \n\nCoverage begins at 6PM on AT&amp;T SportsNet\n\n#memorialhermann https://t.co/3yeeiDFaMv",
    "91": "Now 17-7 all other conditions remain the same. Tonight ripe for some super star rest vs @HoustonRockets #NetsWorld https://t.co/zNLtbvrfWC",
    "92": "@HouRocketsNews @telev1x @HoustonRockets @ATTSportsNetSW @SportsTalk790 Eg been balling recently at oh",
    "93": "Adrian Wojnarowski (@wojespn) says John Wall wants to play for the Houston #Rockets again.\n\n... because they' re winning?  Hmmm....\n#NBA75\n#NBA\n\nhttps://t.co/K9nQiEY1hb",
    "94": "@911Mrlonely9 @HoustonRockets What do you mean he practice at being more efficient and has gotten better at it now? He's been consistently in the minus for majority of the year. It's showing that the rockets play better when he's not playing.",
    "95": "James Harden will face the Rockets in Houston without the help of Kevin Durant.\nhttps://t.co/WpobYPxy2l",
    "96": "@DieHrdSportsInc @HoustonRockets He was doing really good on the bulls game before getting injured. Maybe he practice being more efficient and got better at it now?",
    "97": "If the rockets lose to a hobbled nets team after fans boasting about a win streak, it's gonna be rox slander time.\n\nIf James harden loses to a tanking rockets team, it's gonna be harden slander time.\n\nEither way Houston fans both win and lose I guess https://t.co/QNNvwYyZj1",
    "98": "\"If you would not trust Houston Rocket or Cincinnati Red with your wallet, you could at least imagine reading them on a list of people who got gut-shot while trying to hijack a steamboat in 1888 and died of sepsis in a flophouse a week later.\"\n\nhttps://t.co/8JG9yJCPkd",
    "99": "🇺🇸 NBA (22:10) \n\n🏈 Brooklyn Nets x Houston Rockets \n\n▶️ ML Nets (1.62) \n\n💰 1 unidade \n\n📱 BET 365\n\nGRUPO FREE TELEGRAM 👇🏽👇🏽👇🏽\n\nhttps://t.co/ExR7IWVUqa",
    "100": "Houston recording artist @MAXOKREAM is taking the \"First Shot\" before tonight's #Rockets - #Nets game at Toyota Center.",
    "101": "@HoustonRockets @ATTSportsNetSW @SportsTalk790 Haha",
    "102": "@HoustonRockets Bill Worrell was the goat announcer in my time before I started playing special Olympics back in 07... Hope Clyde &amp; Bull be there on that special day!",
    "103": "Houston #Rockets guard Armoni Brooks (@snipabrooks_) hosted a group of children from Pathways Youth &amp; Family Services for a private holiday gathering at Shoot 360, a technology-based basketball training center in northwest Houston. https://t.co/of8HbBG7NJ",
    "104": "Minutes have been trending up and the rockets have been playing very well. Game is now +3 so the rockets should be able to keep it close. \n\nLast 5 Games 3s made: 4,3,4,5,5. \n\nHe’s good in the clutch and houston has been moving the ball recently. \n\n@PicksByDynasty @phillyboy415",
    "105": "Just 4 years ago Josh Christopher was showing great promise as a HS soph. 4 years later he's in the NBA with the Houston Rockets.  Wow time flies!\n@FCPPangos https://t.co/J8Fg6ABgTk",
    "106": "The Houston Rockets Ryan Anderson had a fan warm his seat up while he was playing.",
    "107": "@HouRocketsNews @HoustonRockets @ATTSportsNetSW @SportsTalk790 No, unfortunately. EG as the point guard.",
    "108": "This was a real fun episode exploring some of the greatest teams of all-time... and the 2008 Houston Rockets too! https://t.co/xTxu75tzGH",
    "109": "One of the most legendary players in Houston Rockets history is back inside Toyota Center tonight.\n\nIt'll be James Harden's first time playing against him. https://t.co/HMnDoK989x",
    "110": "My first NBA game #Big30 #HoustonRockets https://t.co/PPpGRPQEo8",
    "111": "SOTD: During the @HoustonRockets 6-game win streak, Houston has had the @NBA's 3rd best offense at 119.5 points per 100 possessions (per @cleantheglass). Prior to that run, Houston’s offense rated as 27th at only 103.5 pt.s per 100 poss. over their first 23 games. https://t.co/or4gosYqVu",
    "112": "@HoustonRockets @ATTSportsNetSW @SportsTalk790 Rt I hope it’s a close one lmao",
    "113": "@emilyestrada39 @HoustonRockets Harden gonna have lime a 40 pt triple double on yall 🤣",
    "114": "@HoustonRockets @ATTSportsNetSW @SportsTalk790 No akward. We gone welcome and then ball. 🏀✨",
    "115": "@HoustonRockets Hopefully jalen green is still out. Yall actually win when he doesn't play lmao 🤣😂 I just looked it up jalen green has the worst +/- in the nba",
    "116": "@hrockets_memes2 @HoustonRockets W life",
    "117": "@WhatIfiWasWhYte @jalengreenismo @HoustonRockets @ATTSportsNetSW @SportsTalk790 A win against them would be so sweet",
    "118": "@HoustonRockets @ATTSportsNetSW @SportsTalk790 does kpj play?",
    "119": "@HoustonRockets @ATTSportsNetSW @SportsTalk790 I’m wearing one of my Harden jerseys 😈🚀🧔🏾‍♂️",
    "120": "@jalengreenismo @HoustonRockets @ATTSportsNetSW @SportsTalk790 Ok we shall see",
    "121": "@jalengreenismo @HoustonRockets @ATTSportsNetSW @SportsTalk790 Promise?",
    "122": "Check out this listing I just added to my #Poshmark closet: Boys NBA Nike Dri-fit Houston Rockets Shorts.Large. https://t.co/5Z1sBxzMSV #shopmycloset @poshmarkapp",
    "123": "@HoustonRockets @ATTSportsNetSW @SportsTalk790 Fb please?",
    "124": "@HoustonRockets @ATTSportsNetSW @SportsTalk790 I know chances are small to win this one but it sure would feel good!",
    "125": "@WheresDaPrtyAt @emilyestrada39 @HoustonRockets You forgot 8 straight playoff appearances, two western conference finals appearances, and a MVP.",
    "126": "@HoustonRockets @ATTSportsNetSW @SportsTalk790 not sorry ass Eric Gordon being our highlighted profile player matchup against harden",
    "127": "@HoustonRockets @JalenGreen @adidasoriginals @WeAreIvyPark He needs to be in a court he still have to prove himself",
    "128": "TIP: Houston Rockets - Brooklyn Nets, 2, 1.65 by #tipster dorrez14 (profit this month: +95.24)\n  #betting #Basketball #Houston #Rockets #Brooklyn #Nets",
    "129": "@iFilmTK @Rockets_Insider He hasn’t been built like that since he left Houston",
    "130": "@HoustonRockets @ATTSportsNetSW @SportsTalk790 7 straight ?",
    "131": "@HoustonRockets @ATTSportsNetSW @SportsTalk790 The best Shooting Guard in Rockets history and James Harden 👀",
    "132": "Insane Stat Alert: The Houston Rockets are on a historic streak of winning 6 games in a row after losing 15 straight.  First time this has ever happened in any US professional team sports.",
    "133": "New #Rockets from Houston Chronicle — Nets' Kevin Durant, LaMarcus Aldridge to sit out vs. Rockets for rest https://t.co/fgkonYixqm",
    "134": "New #Rockets from Houston Chronicle — Rockets' short-handed surge keyed by undrafted players and a two-way find https://t.co/62bLdpiWAC",
    "135": "Detroit Pistons - Washington Wizards\nHouston Rockets - Brooklyn Nets\nSacramento Kings - Orlando Magic\nVegas Golden Knights - Dallas Stars\n\nBet slip link: https://t.co/LR0Xd4l0Dm https://t.co/KyOUUd4oBL",
    "136": "@HoustonRockets   If we can get one win all season, let it be tonight against the Diva @BrooklynNets .  #HoustonHardenHater",
    "137": "We've got a new episode of @HoustonRockets All Access presented by @memorialhermann ready to go at 5:30!\n\nCheck out this piece highlighting the Rockets partnership with @camhouston! #Lightthefuse https://t.co/EZ9oBrJh9f",
    "138": "#Nets vs #Rockets Preview. No KD tonight so expecting vintage Harden as he returns to Houston. #NetsWorld #NBA #NBA75 #LightTheFuse https://t.co/mElTKGnJ0R",
    "139": "@HoustonRockets see you in a few🥺",
    "140": "@TinaLara29 @HoustonRockets Same I’ll smile when he hits a step back 3 though cause of the memories 😭❤️",
    "141": "Robinson went 3/7 a few days ago when these 2 teams played (and Connaughton wasn't an option... Yet). Steph might shoot 30 3's to try and break the record 😂. Harden in Houston vs the Rockets + no Durant = 🟢. https://t.co/caNr3sQiZX",
    "142": "The Houston Rockets Terik Black had a slip and slide free throw contest.",
    "143": "@scullytaco @HoustonRockets @cayleighgriffin I love watching your show !!!! https://t.co/49H2dbRlus",
    "144": "@PickDawgz 1. NHL - Calgary Flames ML +110 L -100\n2. NBA - Houston Rockets ML +125 W +125\n3. NFL - Washington Redskins ML +110 W +110\n\n+135",
    "145": "No KD, No Kyrie No LA, Nets vs Rockets in Houston.  \nHarden BBQ loading.",
    "146": "The Rockets take on the Nets tonight! Coverage begins at 6pm!\n\n@HoustonRockets | #Rockets https://t.co/7CDZkMuKjB",
    "147": "@JoseEFlores13 @TommyTim304 @HoustonRockets LOVE it! What a great idea.Thanks for sharing!",
    "148": "The @HoustonRockets are the only team in 🇺🇸 Sports history to Win 6 straight after a 15 game L-streak. \n.......7 next?!\n\nGO #Rockets !!!!!!!\n\nhttps://t.co/uOLpSKfpFa",
    "149": "GAME DAY!  #Rockets \n\n🏀 : Brooklyn Nets (17-7)\n🕘 : 22:00\n📌 : Toyota Center - Houston, TX\n🖥 : League Pass e Link https://t.co/SeiL7FzbrT",
    "150": "@NoIGDon @HoustonRockets Bro what. Yao went down and everyone was saying we were getting swept and almost pulled it off. Aaron Brooks had that crazy buzzer beater alley oop going into HT had Toyota going crazy. Battier getting elbowed with the bloody eye and Artest being a dog. They don’t know mayne!!",
    "151": "@HoustonRockets Hello",
    "152": "#Rockets Chatter Presented by Topo Chico\n\nRockets look to extend their win streak to 7 games tonight against former teammate James Harden and the Brooklyn Nets \n\nCoverage begins at 6PM on AT&amp;T SportsNet\n\n@HoustonRockets\n@topochicohard\n #topochicohardseltzer https://t.co/V4F8Ye7XhD",
    "153": "@scoot2mylou @HoustonRockets On God Niggas Be Forgetting Bout That Team That Almost Took The Lakers Down In 09 Or Chuck Hayes And Aaron Brooks And How The Media Labeled Them \"Average At Best\" But Was Giving Teams Hell Everynight And Constantly Stayed In The Playoffs And At Or Above .500 Them Seasons #IMissIt",
    "154": "New from Houston Chronicle — Nets' Kevin Durant, LaMarcus Aldridge to sit out vs. Rockets for rest https://t.co/Q267KoW47o",
    "155": "New from Houston Chronicle — Rockets' short-handed surge keyed by undrafted players and a two-way find https://t.co/Ua40DiLzUQ",
    "156": "You gotta give josh 20 minutes for his 20th birthday @HoustonRockets it’s only right",
    "157": "@NoIGDon @HoustonRockets Hell yeah same, memories hearing them call Scola the ice cream man when he had a scoop layup and “Air-Bud” when Budinger went flying were some good ass times. Those 2 are legends in my eyes, had my 10 year old ass hyped.",
    "158": "Kevin Durant e LaMarcus Aldridge saranno out stanotte contro gli Houston Rockets.\n\n#LightTheFuse",
    "159": "@HoustonRockets Damn I forgot how tall and bouncy McGrady was lol",
    "160": "@HoustonRockets What a good stream to watch the game on?",
    "161": "@thekidhimseIf @HoustonRockets @JalenGreen @adidasoriginals @WeAreIvyPark Who do you work Loriel? https://t.co/MBcygZoQDW",
    "162": "James Harden has scored 40 or more vs 29 teams in the NBA, the only team not on that list is the Houston Rockets, will that change tonight? 👀",
    "163": "🏀 GAME DAY 🏀\n\nNets look to keep the Texas winning streak alive\n\n🆚Houston Rockets\n🏟️Toyota Center\n🎽 Statement\n⏰8:00 PM\n📺YES\n📻WFAN https://t.co/P67z6kI7h1",
    "164": "@RedNinetyFour The way Harden left was the latest [and most painful] reminder of why I cheer team over player. I appreciate Harden for what he did in Houston and wish he stayed, but I’ll always be #Rockets first 🚀",
    "165": "The Houston Rockets Trevor Ariza had a terrible warmup and won't play.",
    "166": "Gameday: The Nets play their 2nd game in a 4 game road trip against the Houston Rockets. The Nets will be short-handed with no Durant or Aldridge. James Harden will be playing his former team. \nGametime: 8pm\nToyota Center, Houston Texas https://t.co/TybhxFHz13",
    "167": "@NBA @Jaygup23 @HoustonRockets Future MVP and NBA Finals Champion.",
    "168": "@a_duckett @HoustonRockets @ApolloLaunchPad Done 🤘🏾💯✔️",
    "169": "@brianmctaggart @MarkBermanFox26 @HoustonRockets @UHCougarFB Because they finished second. 🤪",
    "170": "@tresonjamar @HoustonRockets Aye we need him back",
    "171": "@Grady It’s gonna be a tough road game against the young hot athletic Houston Rockets 🚀",
    "172": "@HoustonRockets \"TMAC TO THE RACK!\"🐐",
    "173": "@MarkBermanFox26 @HoustonRockets @UHCougarFB Why not first quarter?",
    "174": "@HoustonRockets T for 3!",
    "175": "@HoustonRockets I Grew Up On This Man's Commentary Him And Bull In 08-11 Everyday In My Stepfather Mother House",
    "176": "The @HoustonRockets will honor @UHCougarFB tonight during the second quarter of their game against the Nets.",
    "177": "@HoustonRockets Goat announcer, I miss his phrases &amp; calls",
    "178": "Team: Brooklyn #Nets vs Houston #Rockets\nStart time: December 08, 2021, 20:00 ET\nNBA Free Stream - https://t.co/mgeRcmlwyd\nVenue Name: Toyota Center\nVenue Location: Houston, TX 77002, USA\nCompetition: Regular Season\nSport: #NBA https://t.co/1o4YV8rJP9",
    "179": "Check out the Rockets upcoming schedule and tune-in!\n\nSponsored by fuboTV, LIVE SPORTS &amp; TV WITHOUT CABLE\nhttps://t.co/bKIHwE4A7G\n\n@fuboTV | @HoustonRockets https://t.co/ZXI1HxkGzL",
    "180": "@g_yappin @HoustonRockets Did you know that James has never lost in the first round? Did you know that MJ got swept multiple times in the first round?",
    "181": "@RooshWilliams @HoustonRockets Had no idea you were working with the team - that is really cool of them! Hopefully some young folks or other big fans are getting the experiences they wouldn’t have otherwise. Keep it up man!",
    "182": "If the Rockets win, then it wouldn’t be the first time a Houston victory has an asterisk attached to it. https://t.co/Ag7cZVLOyT",
    "183": "The Nets are resting Durant in their second game of a back-to-back against the Houston Rockets on Wednesday. \n\nThe Nets will also rest LaMarcus Aldridge against the Rockets. @krisplashed https://t.co/BacoOxtS2W",
    "184": "@AdamJWexler @SportsTalk790 I can’t name 3 Texans and 2 Rockets player although I can name you 8-9 players from 94 championship team.\nI used to be a diehard Houston sports fan. \nRockets and Texans are a joke now. \nWhat the hell is going on with our sports team?",
    "185": "I was honestly OK with some of the booing of James Harden last year. The Rockets were left in a major bind and he handled it poorly. Fans felt betrayed. But both parties have moved on and I think now is the time to reflect on all he did in Houston. https://t.co/RQ9Z0nyFNY",
    "186": "@chron @clutchthebear The @HoustonRockets and @clutchthebear like https://t.co/4AYrPgUndG",
    "187": "@g_yappin @HoustonRockets Lol every player in NBA history is a playoff choker if harden is a playoff choker",
    "188": "@Rockets_Insider Bet James Harden Over. This won’t be the rockets beating the nets by 2. This will be harden dropping 50/10/5 and blowing out Houston.",
    "189": "Consensus Line Move:\n2021-12-08 Brooklyn Nets at Houston Rockets from 227.50 to 223.50\nUnder get on board\n#NBA #bettingonline #tech #bitcoinmining",
    "190": "Consensus Line Move:\n2021-12-08 Brooklyn Nets at Houston Rockets from 6.00 to 3.00\n#Rockets lollipops\n#NBA #parlay #programming #motivation",
    "191": "@TTWirePodcast The houston rockets",
    "192": "@gilliankemmerer This series goes to 22-0 like the Houston Rockets in the past in the NBA.",
    "193": "No KD, no Jalen, and no KPJ why the fuck did I pay to see this game @HoustonRockets @BrooklynNets",
    "194": "Random Analysis: @HoustonRockets gotta get a new coach, play @Jaygup23 @JalenGreen as starters, then it’s UP - draft @BatesEmoni @ChetHolmgren, 2022 looking bright. @Kevinporterjr gotta go crazy over the Summer too before next season",
    "195": "#Basketball\n#Nba (Usa)\nHouston Rockets - Brooklyn Nets\n#1xbet\ninfo: https://t.co/hPVoMtCwkR https://t.co/F1cBwMutCv",
    "196": "Looks like a James Harden 50piece  tonight back at his Houston Rockets home afterwards strip clubs in houston https://t.co/IPSnvy3aRJ",
    "197": "5 #FreePicks All #NBA @juniorsports7 @BetOpenly \nWe also are starting to run simulations and test runs on Player Props. Tip- James Harden has scored 40 Points or more against every Team except his former Team the Houston Rockets. James Hardens O/U Total is usually set @ 21.5 😯 https://t.co/bVGn0II8k3",
    "198": "Wednesdays are for Bingo and Booze! 🤣 Enjoy $5 Jumbo Frozen Margaritas all day!! 🥶 @jamminfrickinj kicks off Bingo for Booze at 7pm. More specials tonight plus the #Rockets 🚀 game! Doors open at 4pm. 😈\n.\n#diabloloco #houston #humpday #happyhour  #houstonsbestwingsperiod https://t.co/sn5M2u8FjG",
    "199": "Bittersweet. James Harden was my favorite player for the better part of a decade. I still follow him and hope he wins a championship some day, but the @HoustonRockets come first and I want this win streak to keep going. https://t.co/PkrcVebFUA",
    "200": "The Houston Rockets Trevor Ariza had a fan warm his seat up while he was playing.",
    "201": "@whitepersuas1on @BiasedHouston “What he’s given to us” he had a great run here and that won’t be forgotten, but the Rockets weren’t a downtrodden organization not used to winning before he got here. He became a superstar/MVP in Houston.",
    "202": "Toronto Raptors - Oklahoma City Thunder\nHouston Rockets - Brooklyn Nets\nGolden State Warriors - Portland Trail Blazers\n\nBet slip link: https://t.co/amZUoWkD49 https://t.co/q673TpuYU6",
    "203": "@HoustonRockets @JalenGreen @adidasoriginals @WeAreIvyPark TOO BAD HE CANT MAKE A SHOT",
    "204": "@HoustonRockets win against Nets is needed tomorrow morning 🤞🏾",
    "205": "@HoustonRockets @JalenGreen @adidasoriginals @WeAreIvyPark What the black finger nails? This is the NBA not a post Malone concert",
    "206": "@HoustonRockets @JalenGreen @adidasoriginals @WeAreIvyPark BREAKING: The Houston Rockets admin has signed a 10 year, 300 Million Dollar extension.",
    "207": "@ChefDavid119 @HoustonRockets Lmfao if we win😂",
    "208": "@Rockets_Insider harden vs houston",
    "209": "Kevin Durant and LaMarcus Aldridge are both OUT for tonight's game in Houston. #Rockets",
    "210": "Houston Rockets: Nets Game Tonight: Nets vs. Rockets prediction, betting odds, TV channel for Dec. 8 https://t.co/Slu0ZAmIXS",
    "211": "Kevin Durant (rest) and LaMarcus Aldridge (rest) have been listed as out tonight against the Houston Rockets, the team says.",
    "212": "Brooklyn Nets say Kevin Durant and LaMarcus Aldridge will be out for tonight’s game against the Houston Rockets for rest purposes",
    "213": "Had a blast talking all things #Rockets with the homies @JTGatlin and @TheRyanHollins (we are Houston's new Big 3):\n\n1. KPJ excelling at PG\n\n2. The legend of OVO Garry Bird\n\n3. What makes Al-P Sengun so special\n\n4. Harden's Homecoming Part Deaux\n\nLink: https://t.co/jQx3iNGfvl",
    "214": "NBA MAX PLAY🍀🔥\n\n🏀NBA: Houston Rockets +6.5 vs the Brooklyn Nets (-110) 5U MAX\n\nThis play will not make sense to anyone, myself included. However, it is going to cash and Houston might even win outright. I don’t make the rules, Vegas does🤷🏼‍♂️😈\n#GamblingTwitter https://t.co/q0UrPn7u1w",
    "215": "@emilyestrada39 @HoustonRockets He did all he could for Houston. It was time for him to move on.",
    "216": "@HoustonRockets Easy W https://t.co/F2v1dHVvZj",
    "217": "Houston Rockets 💕\nFor all Houston Rockets lovers\nIf you like it pls support with ❤\n\n#Houstonrockets https://t.co/rrqATx8VzW",
    "218": "@NBA @Jaygup23 @HoustonRockets this man lost all his hype smh",
    "219": "@HoustonRockets gotta give @Jaygup23 20 minutes for his 20th !! @RafaelStone12 !! https://t.co/vdyZqdar5b",
    "220": "@RooshWilliams @HoustonRockets Hell yeah especially the fans that watch every game for years",
    "221": "@HoustonRockets @clutchthebear Meeting up with that kid at the top of the stairs last game was the BEST HYPE EVER!! 👍🔥🚀♥️",
    "222": "@HoustonRockets should be on national television it is a crime",
    "223": "The Houston Rockets Terik Black had 69 points 24 rebounds.",
    "224": "Jalen Green Houston Rockets Fanatics Exclusive Parallel Pani\n#sportsCards\nSource: Fanatics Checker\nReason: In Stock\n\n12:40:25.6580 PM EST #Ad\n\nhttps://t.co/gdQsevvLRG",
    "225": "Jalen Green Houston Rockets Fanatics Exclusive Parallel Pani\n#sportsCards\nSource: Fanatics Checker\nReason: In Stock\n\n12:40:25.6580 PM EST #Ad\n\nhttps://t.co/L8ZTU4737J",
    "226": "@NBA @Jaygup23 @HoustonRockets Gay ass shoes",
    "227": "@HoustonRockets @Jaygup23 Happy Birthday to us! 🥳I need some rockets gear👀 \na fan since 05'",
    "228": "@HoustonRockets please win tonight",
    "229": "@HoustonRockets @Jaygup23 Happy Birthday Jaygup",
    "230": "Jalen Green Houston Rockets Fanatics Exclusive Parallel Pani\n#sportsCards\nSource: Fanatics Checker\nReason: In Stock\n\n12:31:11.2800 PM EST #Ad\n\nhttps://t.co/N0AY2AnXoN",
    "231": "Jalen Green Houston Rockets Fanatics Exclusive Parallel Pani\n#sportsCards\nSource: Fanatics Checker\nReason: In Stock\n\n12:31:11.2800 PM EST #Ad\n\nhttps://t.co/pUpRtTU8mG",
    "232": "New post (Brooklyn Nets vs Houston Rockets NBA Pick – December 8) has been published on The Sports Geek - https://t.co/7hRhYMjbur https://t.co/TGlnUrrcWk",
    "233": "@HoustonRockets Forget winning if we stop harden from dropping 40 on us we having a parade and hanging banners",
    "234": "@marioelie1 @HoustonRockets Beat Brooklyn!",
    "235": "@HoustonRockets Wish KPJ was active",
    "236": "Will it be broken tonight or will it continue? I’ll be locked in tonight. #prolificvisionsent #dasp8rtsfix #houstonpodcast #victhemiestro #houstonrockets🚀 @ Houston, Texas https://t.co/aTTpSaFLbM",
    "237": "In light of James Harden returning to Houston tonight, thought it would be fun to write this:\n\n 5 greatest James Harden moments in Rockets franchise history (unranked)\n\nhttps://t.co/CDsvZLLWng",
    "238": "@RooshWilliams @HoustonRockets I'm so happy that they engage us so positively 🙏🏾",
    "239": "Dia de perder pro Houston Rockets ein💪😎",
    "240": "@HoustonRockets @KDTrey5 you not actually going to play 48 minutes right? Right?",
    "241": "@HoustonRockets 7 game win streak?",
    "242": "@RooshWilliams @HoustonRockets Hey we really appreciate it! Great stuff!",
    "243": "@RooshWilliams @HoustonRockets Absolutely. I have never heard of another franchise reaching out to its fans like the Rockets do on a regular basis",
    "244": "It was a hell of a run for James Harden with the Houston #Rockets. https://t.co/UIB9RCsBMS",
    "245": "@HoustonRockets @Jaygup23 Happy Birthday bro!",
    "246": "@RooshWilliams @HoustonRockets Agree! We seem to be ahead of the social media game!\n\nIt starts with how loyal and interactive we've been, them recognizing it, hiring great people that fit (cayleigh and Ryan)\nAnd of course whoever runs the Rockets social accounts is also top tier 🔥",
    "247": "James Harden returns to Houston tonight\n\nIn 8 years with Rockets:\n\n• 1 60-win season\n• 5 50-win seasons\n• 2 WCF appearances\n• .639 win % in games played\n• 1x MVP\n• 3x Scoring champ\n• 1x Assist champ\n• 330 30-point games\n• 106 40-point games\n• 23 50-point games\n\nLegend https://t.co/uZCvDDwbOf",
    "248": "Big game tonight. Can the Nets beat the hottest team in the NBA right now, the Houston Rockets. YEAH, I said it. The Houston Rockets are the hottest team in the NBA right now.",
    "249": "@RooshWilliams @HoustonRockets I love it!!! 🚀🚀🚀 I wish I was at to ight’s game tho 🤞🏾🤞🏾",
    "250": "Consensus Line Move:\n2021-12-08 Brooklyn Nets at Houston Rockets from 226.50 to 227.50\nOver just a touch\n#NBA #bettingtips #deeplearning #luxury",
    "251": "You really gotta hand it to the @HoustonRockets for acknowledging, appreciating and interacting with #Rockets Twitter. The ticket giveaways are so much fun.\n\nPretty innovative stuff, and it's super cool to see the team appreciate its fans that go so hard for their squad.",
    "252": "@NBA @Jaygup23 @HoustonRockets I fell in love with the shoes❤️",
    "253": "@HoustonRockets Admin is goated",
    "254": "James Harden's tenure with the Houston Rockets may likely be the biggest failure in NBA history.",
    "255": "@kosmokage @HoustonRockets @alperennsengun @Jaygup23 Kanki means friend in Turkish btw",
    "256": "The Houston Rockets Luc Monte had the Run DMC CD playing during the game.",
    "257": "T3\n20. Toronto Raptors (+3)\n21. Minnesota Wolves (-10)\nT4\n22. Houston Rockets (+8)\n23. Sacramento Kings (+1)\n24. Indiana Pacers (-3)\n25. Portland Blazers (-12)\n26. San Antonio Spurs (-1)\n27. New Orleans Pelicans (-1)\n28. OKC Thunder (-1)\nT5\n29.Orlando Magic\n30.Detroit Pist (-2)",
    "258": "So many matches being played tonight but ima be watching Houston Rockets vs Brooklyn Nets showdown cos why not! \nWatching Kevin Durant play brings me great joy\n#NetsWorld https://t.co/VhQ6YO3iM8",
    "259": "@HoustonRockets @Jaygup23 Happy Birthday Josh 🥞🎂🎂",
    "260": "Houston Rockets: Red-hot Rockets host Nets in James Harden homecoming https://t.co/yiC4gltfbz",
    "261": "I have no problem with people who want to boo Harden soon as he lands in Houston and have no problem if people want to cheer long as the booing or heckling doesn’t go over the line. Personally he is just like any other opponent the Rockets play. I’ll recognize him once he retires https://t.co/gZZ9crZkaf",
    "262": "Guess who has the longest winning streak in the NBA right now...\n❔\n   ?\nˀ\n ❔\n❔\n  ˀ\n   ❔\n?\nˀ\n❔\n     |￣￣￣￣￣| \n     |       The       | \n     |   Houston  | \n     |   Rockets   | \n     | ＿＿＿＿ _ |  \n   ʕ•́ᴥ•̀ʔ     || \n/ ᴿᴼᶜᴷᴱᵀˢ \\づ\n|    ⁰⁰    |\n@clutchthebear",
    "263": "@emilyestrada39 @HoustonRockets Go Rockets 🚀 💪",
    "264": "The Houston Rockets are the only team in the NBA that James Harden has never scored at least 30 points against in a game over his entire career (he did it against every team just in 2018-19!)\n His career high against Houston is 29 points last season. Will he get 30 tonight?",
    "265": "Rockets vs. Nets: 5 things to watch - Houston Chronicle https://t.co/kLJ06H10jW",
    "266": "@HoustonRockets yall gotta add an epilepsy warning for the video or something fam gaahd damn",
    "267": "@kazcysnki @bhulin_d_luffy @Jody_McFly Do you really think Morey leaves the Houston Rockets if China doesn’t happen? Please be serious…..",
    "268": "@HoustonRockets @Jaygup23 Give bro birthday minutes 😂😭",
    "269": "@marioelie1 @HoustonRockets The Who?",
    "270": "After playing extending themselves to beat Dallas Mavericks last night, don't be surprised to see Houston Rockets win its seventh game in a row with a win over Brooklyn Nets early tomorrow morning",
    "271": "Revenge Game: James Harden plays Houston tonight.  He played 613 games in his career for the Rockets.",
    "272": "🎂 Josh Christopher - Houston Rockets has a birthday today",
    "273": "@HoustonRockets @Jaygup23 Happy birthday!",
    "274": "Literally the reason I love this @HoustonRockets team s/o @alperennsengun and a BIG HAPPY BIRTHDAY TO @Jaygup23 #Rockets #Lightthefuse https://t.co/9pBzTmlRFp",
    "275": "@HoustonRockets Harden owns the Rockets",
    "276": "New #Rockets from Houston Chronicle — Rockets vs. Nets: 5 things to watch https://t.co/xskpjdbuCe",
    "277": "@Pacers\n@BrooklynNets\n@LAClippers\n@nyknicks \n@sixers\n@spurs\n@utahjazz\n@Lakers\n@suns\n@trailblazers\n@DetroitPistons\n@HoustonRockets\n@dallasmavs\n@warriors\n@MiamiHEAT\n@celtics\n@chicagobulls\n@cavs\n@nuggets\n@Bucks\nSome bad people hold onto their guns\nLousy @NBA people hold onto CCP🇨🇳💰 https://t.co/YL36BHKa3D",
    "278": "@fjejejej2 @HoustonRockets @Jaygup23 We all do...",
    "279": "Houston Rockets - Brooklyn Nets İddaa Tahmini 09.12.21\nhttps://t.co/06tdz1eRR5",
    "280": "@vicecity4life @HoustonRockets @Jaygup23 I miss rockets harden 😭",
    "281": "The Houston Rockets Luc Monte had a disco ball hung up in his locker.",
    "282": "Houston Rockets: Eric Gordon thrilled for match up against James Harden https://t.co/TbZ9cxIdrQ",
    "283": "@NBA @Jaygup23 @HoustonRockets Happy birthday",
    "284": "@xterrylee_ @HoustonRockets Lmaooo",
    "285": "After the Rockets started the season 1-16, it's also dumbfounding to see the words, \"Can Brooklyn and Kevin Durant snap Houston's winning streak?\"\n\nOne of several 🔥 #NBA betting previews &amp; picks to tonight from our guy @peterdewey2 over at @BetSided: https://t.co/S5l0WTJCHo",
    "286": "@emilyestrada39 @HoustonRockets There were multiple scenarios possible 😛",
    "287": "@Kicky80 @HoustonRockets Uh I know why do think I said “ fck harden ” 🤣",
    "288": "@emilyestrada39 @HoustonRockets Harden plays for the Nets 😜",
    "289": "12/8 #NBAWednesday #NBAPicks\n\n1* Washington Wizards vs Detroit Pistons ~ Washington Wizards -5.5 -105\n \n1* Milwaukee Bucks vs Miami Heat ~ Milwaukee Bucks -6.5 -105\n \n1* Brooklyn Nets vs Houston Rockets ~ Brooklyn Nets -6 -103",
    "290": "@HoustonRockets @JHarden13 Thank you for this tribute for the greatest player of all time",
    "291": "Your Price: $31.99 - Houston Rockets Mitchell &amp; Ness Cool Snapback Hat - Gray https://t.co/q3xDk2O65b https://t.co/hXDnk6lG3Q",
    "292": "@HoustonRockets How long is this sale going  on?",
    "293": "@HoustonRockets @Jaygup23 Happy Birthday Kid 🎂",
    "294": "@NBA @Jaygup23 @HoustonRockets The Steph Curry hater",
    "295": "Houston Rockets, Game 7, 2018 Western Conference Finals:\n\n7-44 (15.9%) https://t.co/0IPYM9D4YS",
    "296": "@HoustonRockets Yoo slide the Instagram wtf",
    "297": "@TinaLara29 @HoustonRockets Lmao im always rooting for the rockets I just got respect for the nets so I can't say fuck em. 😭",
    "298": "@_BoobieJohnson @HoustonRockets I love Harden but my team comes first lol.",
    "299": "@Huntshelton @HoustonRockets MY GUY!",
    "300": "@HoustonRockets @Jaygup23 Happy birthday JayGup!",
    "301": "@marioelie1 @HoustonRockets He droppin FIDDY!!! https://t.co/hFm05zGxAD",
    "302": "@TinaLara29 @HoustonRockets Kevin went to Texas and one of my favorites and of course harden I can't do it 😭😭",
    "303": "@HoustonRockets @Jaygup23 I know someone who might leave him hanging. https://t.co/c1CeiAxLG3",
    "304": "@HoustonRockets @Jaygup23 This time with full arena we want another tribute video 🙏 https://t.co/DsE9x8WDDG",
    "305": "@_BoobieJohnson @HoustonRockets Fuck the Nets lol",
    "306": "Consensus Line Move:\n2021-12-08 Brooklyn Nets at Houston Rockets from 225.00 to 226.50\nOver certainly\n#NBA #sports #sabermetrics #rich",
    "307": "@TinaLara29 @HoustonRockets I ain't gone say fuck the nets but I support everything else 😂🤣",
    "308": "@HoustonRockets @Jaygup23 Happy birthday Josh! 🎂",
    "309": "The Brooklyn Nets take on the Houston Rockets in NBA Basketball betting action.\n\nAndrew Cook has a free pick on this game today!\n\nhttps://t.co/9rTLwvygFB\n\n#NBA #NBAfreepicks #sportsbet #sportsbetting #BrooklynNets #HoustonRockets #GamblingTwitter #procappers https://t.co/DAE4SB6Ehw",
    "310": "Tuesday’s Locked on Rockets dives into Houston’s historic six-game winning streak, as well as encouraging new comments by owner Tilman Fertitta.  https://t.co/waQdKJAcWj",
    "311": "Rockets forward Jae’Sean Tate knows the atmosphere will be a little different on Wednesday with the return of former Houston Rockets guard James Harden, but to the team it’s business as usual. #Rockets #LightTheFuse #Sarge https://t.co/pPq2tJvJvw",
    "312": "@HoustonRockets @CarolMagoo o time virou boomer",
    "313": "Official #astrostwitter meet up thread! For the @HoustonRockets game. I’ll be in section 112 row 20 stop by and see us @alexmeighoo will be hanging! #AllGasNoBreaks \n#BeatHardin #BeattheNets \nLike @ApolloDez1 says “Don’t meet me there, beat me there.” https://t.co/kw2Gx0hlnl",
    "314": "Christian Wood has been a big part of Houston's six-game winning streak and more on the Rockets: https://t.co/uzcupKYX2w",
    "315": "@statmuse Trade @luka7doncic  to @HoustonRockets  por favor",
    "316": "The Houston Rockets P.J. Tucker had a disco ball hung up in his locker.",
    "317": "@HoustonRockets WADMIN",
    "318": "Excited for the game against the nets. I hope our young guys learn as much as possible from the houston legend james harden and hopefully win the game💪🏻 Go rockets🚀",
    "319": "@HoustonRockets THE SONG SLAPS SOOO MUCH NEVER GOT TIRED OF THE BEAT🔥🔥🔥 #LightTheFuse🚀🚀🚀",
    "320": "@marioelie1 @HoustonRockets Hopefully the 40 plus minutes KD and Harden played last night works in the Rockets favor",
    "321": "NBA 09/12/21\n\n07:30 Milwaukee Bucks-7\n08:00 Houston Rockets*Over-224.5\n08:00 New Orleans Pelicans*Over-213.5 \n10:00 Golden State Warriors-14.5",
    "322": "I am Harden fan always will be but my team goes first!! @HoustonRockets 🤘🏼 https://t.co/LVG0HXinpo",
    "323": "@marioelie1 @HoustonRockets Let's get this W fellas🚀🚀🚀🚀🤟🤟🤟",
    "324": "@ShimPorter @HoustonRockets Yesss sir🤘🏼🤘🏼🤘🏼",
    "325": "@YoItsKenneth @HoustonRockets That’s like half the Rockets fan base",
    "326": "@BrendanBmore @HoustonRockets I’m going to have to be blocked by all Nets fans ngl",
    "327": "Here’s all you need to know ahead of Wednesday’s Nets vs. Rockets game in Houston.  https://t.co/4H662Drslt",
    "328": "@marioelie1 @HoustonRockets Yea 7 about to lay the smack down https://t.co/hdJrb0z6ip",
    "329": "@TinaLara29 @HoustonRockets Let's get this W fam 🚀🚀🚀🚀🤟🤟🤟",
    "330": "Good morning everyone &amp; Good morning to all the @HoustonRockets fans  it’s game day let’s get this 7th win in a row 🤘🏼🚀&amp; it’s always Fuck the Nets!!!! @HoustonRockets 🚀🤘🏼 https://t.co/3tDG0npgJy",
    "331": "@marioelie1 @HoustonRockets LETS GO🚀🚀",
    "332": "GAME DAY and The Beard back at Toyota Center should be a fun night @HoustonRockets 🏀🏀🏀🚀🚀🚀 Lucky number 7 tonight. #Lightthefuse",
    "333": "@NBA @Jaygup23 @HoustonRockets Happy Bday an all but those shoes are amazin",
    "334": "@HoustonRockets Might be the biggest dub of the season.",
    "335": "It’s still fk Harden tonight. Let’s go @HoustonRockets 🤘🏼🚀 https://t.co/4qQxVto3HE",
    "336": "@Cesarspr @HoustonRockets Kid was on the screen last home game and the crowd was getting hyped so they kept putting him up lol. It was nuts",
    "337": "🏀 Brooklyn Nets (@BrooklynNets) #NetsWorld\n🆚 W 102-99 @ Dallas Mavericks #MFFL #BKNvsDAL\n⏭️ Houston #Rockets #BKNvsHOU\n✈️ N664DN | DAL8920 | B752\n🛫 DAL - 10:45 pm CT\n🛬 HOU - 11:22 pm CT\n📡 Tracking: https://t.co/vAkFrRJyVJ https://t.co/Ub2jpn0j4V",
    "338": "I should be paid for these hot takes. Today’s the big game folks! #Rockets #Nets #Houston https://t.co/iYEXbwd3eD https://t.co/UdbvktBJPB",
    "339": "@NBA @Jaygup23 @HoustonRockets uglass shoes",
    "340": "@ImmaStayLow Hey we’ve beating ya so fuck it and didn’t ya lose to Houston Rockets 👀😭",
    "341": "[See price in cart]\nFunko POP! NBA: Legends - Hakeem Olajuwon (Houston Rockets H\n#funkoPOP\nSource: Target Search\nReason: Shipping availability: IN_STOCK\nPromise Count: 1\n\n09:09:10.2340 AM EST #Ad\n\nhttps://t.co/7Ngj7ZP1ZI",
    "342": "On this day in sports history December 8, Houston Rockets Center Hakeem Olajuwon became the 5th Player in NBA history to record 26,000 career points and 13,000 career rebounds in 2000.",
    "343": "@HoustonRockets 😂 Rockets team twitter never lets me down / IM HYPED",
    "344": "@NBA @Jaygup23 @HoustonRockets Happy birthday young man. Enjoy your day to the fullest!",
    "345": "@HoustonRockets Leeetttts gooooooooo https://t.co/eZNwOueStp",
    "346": "@HoustonRockets TURN THAT ISH UP WINTERN",
    "347": "@HoustonRockets This time with fans we need another tribute video... https://t.co/NLhh1BJPKT",
    "348": "@HoustonRockets WADMIN. Also looking forward to the game. Lets get this W!",
    "349": "@HoustonRockets Admin deserves a max contract",
    "350": "@HoustonRockets WWWWW BEAT THEY ASS",
    "351": "Consensus Line Move:\n2021-12-08 Brooklyn Nets at Houston Rockets from 7.00 to 6.00\n#Rockets there's a pulse\n#NBA #bettingpicks #datascientist #realestate",
    "352": "THE BEST PLAYER ON THE PLANET PLAYS BASKETBALL VS THE HOUSTON ROCKETS TODAY 😈 https://t.co/T7PGBt4DFq",
    "353": "New from Houston Chronicle — Rockets vs. Nets: 5 things to watch https://t.co/TkfNzzUYlI",
    "354": "@NBA @Jaygup23 @HoustonRockets Happy birthday!",
    "355": "After starting 1-16, the Houston #Rockets are now only 3 games behind #TrailBlazers for the final playoff spot in West.\n#JamesHarden returns to Houston strip clubs tonight following the #Brooklyn #Nets #Rockets game.\n\nNo word if #DeshaunWatson GF Jilly will be at game again. https://t.co/le5TyBFcGO",
    "356": "The Houston Rockets Nene had his gucci flip flops on during the first half.",
    "357": "@NBA @Jaygup23 @HoustonRockets Happy birthday goat",
    "358": "$3.00 - ----&gt; Card Price includes shipping\nPlayer: Kenyon Martin Jr.\nTeam: Houston Rockets\nYear: 2021\nMfg: Panini\nSet: Chronicles\nSubset: Marquee\n\n@ReplinApp Reviews:\n⭐ 5.0 (280 Ratings)\n✅ eBay: krupp-34 (142) 100%\n\nhttps://t.co/Rk99wSH5B9\n\n@HobbyConnector @sports_sell",
    "359": "Brooklyn Nets vs. Houston Rockets Prediction 12/8/21 – Free NBA Picks\n\nNBA Pick Here: https://t.co/5jxDGbnjzn\n\nBet This NBA Game Here: https://t.co/c53tq5Fk5O\n\n#Draftkings #Fanduel #Pointsbet #BETNOW #Sportsbook #bettingpicks #bettingtips #NBA https://t.co/gjQykNXjVT",
    "360": "@a_duckett @HoustonRockets @ApolloLaunchPad I’d love to take my brother to a game. It’s funny that the Nets and Rockets are my two fav teams lol 😂",
    "361": "Houston Rockets: 4 best James Harden performances at the Toyota Center https://t.co/JKdHp8T9EO",
    "362": "Tonight the Brooklyn Nets (17-7) visit the Houston Rockets (7-16) at 8:00 🕗 @YESNetwork #Brooklyn #Nets #NBA #BrooklynTogether",
    "363": "Join us in wishing @Jaygup23 of the @HoustonRockets a HAPPY 20th BIRTHDAY! #NBABDAY https://t.co/T4tipLyFKe",
    "364": "@NBA @Jaygup23 @HoustonRockets Happy birthday ❤️",
    "365": "@NBA @Jaygup23 @HoustonRockets Happy birthday Guppy boy!",
    "366": "@NBA @Jaygup23 @HoustonRockets Happy Birthday @Jaygup23 🤟🤟🤟🚀🚀🚀🚀",
    "367": "@NBA @Jaygup23 @HoustonRockets Happy bday daddy jaygup🐐 #ForksUp 🔱 #AsuPride",
    "368": "@NBA @Jaygup23 @HoustonRockets Our young star 🤞🏾",
    "369": "@NBA @Jaygup23 @HoustonRockets Happy bday 🐐",
    "370": "@Vh1India @PelicansNBA @HoustonRockets @OfficialJioTV @NBAIndia @NBA @Vh1India  🥺🥺❤️❤️ play butterfly by @loonatheworld  at #Vh1Playlist",
    "371": "@NBA @Jaygup23 @HoustonRockets Happy Birthday!!! and many more enjoy your special day",
    "372": "@NBA @Jaygup23 @HoustonRockets Happy Birthday Young Lad 🔥🔥 Your time will come soon. Be patient with Houston. @Jaygup23",
    "373": "@NBA @Jaygup23 @HoustonRockets Overrated",
    "374": "Join us in wishing @Jaygup23 of the @HoustonRockets a HAPPY 20th BIRTHDAY! #NBABDAY https://t.co/uYGjteHOt6",
    "375": "The Houston Rockets Nene had a terrible warmup and won't play.",
    "376": "NBA Basketball Game Betting Picks Simulator: 8:10 PM ET - Brooklyn Nets vs. Houston Rockets - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/WJQAUR3AeK #nba #sportsbetting #freepicks #cappertek",
    "377": "📰 Houston Rockets vs Brooklyn Nets Picks and Odds Dec 8!\n👉 https://t.co/WWR07DkTWL @wagertalk",
    "378": "@Vh1India @PelicansNBA @HoustonRockets @OfficialJioTV @NBAIndia @NBA @Vh1India  please play butterfly by @loonatheworld  at #Vh1Playlist",
    "379": "James Harden is returning to Houston!!! Tonight, the @BrooklynNets head to H-Town to take on the @HoustonRockets, who are on a 6-game win streak! Who’s gonna win the matchup of Harden’s former team vs. his current team? #NBA75 #Rockets #NetsWorld",
    "380": "Match: Houston Rockets - Brooklyn Nets\n\nBet slip link: https://t.co/Wf9dOwyIB1\n\n#HoustonRockets #BrooklynNets #iota #miota #sportsbook https://t.co/V0IvtUWYLp",
    "381": "RT taylorlpate: Thanks to the HoustonRockets, I have 2 tickets to Wednesday’s game against the Brooklyn #Nets to give away. \n\nTo enter, r… #BrooklynNets",
    "382": "Had a great time in Houston doing shooting consultation with Rockets forward @o_tate_ over the last several days. https://t.co/As35AR0snP",
    "383": "Today the Houston Rockets played Against Brooklyn Nets…… we gon play against James Harden.. All Good tho! I believe we got this as long as we play as a team! And I really hope we win so we can continue our winning streak!!",
    "384": "Good match guys we played very well in the last quarter we have do the job and we continue like that tonight against @HoustonRockets !! #NetsWorld   💪💪🖤🤍 https://t.co/aZPdOE7XPh",
    "385": "The Houston Rockets Nene had a poptart warming up in his shoes.",
    "386": "@HoustonRockets Time to own hardiaper",
    "387": "WOAH 😳 📊 CP3 is such a Talented Leader from the 2003 #NBA Draft Class. #GamblingTwitter Who remembers making money with this Trio? WE DO. #RunAsOne #HoustonRockets #2018 #Throwback https://t.co/3fS1jlQ3gL",
    "388": "@trapman1985 @Original_Turner @HoustonRockets EG from there lol",
    "389": "The Houston Rockets Gerald Green had 64 hotdogs in his pockets while playing.",
    "390": "Damian Lillard's request for a two year extension on his deal is poor timing on his part because Portland will look at what is happening with Houston Rockets and John Wall and see themselves in that situation in a couple of years so there is no reason to make that deal",
    "391": "Some love home cooking and some enjoy eating out. I guess u could say the same about @NBA teams.\n@trailblazers and @HoustonRockets are a combined 16-9 at home but 2-21 on the road.\n@cavs @nyknicks @Raptors are a combined 14-23 at home but 22-14 on the road.",
    "392": "@Vh1India @PelicansNBA @HoustonRockets @OfficialJioTV @NBAIndia @NBA We don't want this stupid match here today. Play birthday bumps of nickiminaj instead",
    "393": "New from Houston Chronicle — Podcast: Inside a Rockets winning streak https://t.co/r589gZ5T0H",
    "394": "The Houston Rockets Gerald Green had 89 points scored with his head.",
    "395": "Analyzing Wednesday’s Brooklyn Nets at Houston Rockets odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/MTOiFY0ezB",
    "396": "Brooklyn Nets (17-7, first in the Eastern Conference) vs. Houston Rockets (7-16, 13th in the Western Conference) https://t.co/XDdPmhRAQ6",
    "397": "The Houston Rockets Nene had a falling out with his uncle billy.",
    "398": "James Harden returns to Houston today…\n\nDespite the rocky exit, he will go down as the 2nd greatest player to ever wear a #Rockets uniform, and was a huge reason the younger generation got into Rockets basketball. \n\nWelcome back, goat. The city still loves you. @JHarden13 🖤🖤 https://t.co/e04cN7PIwf",
    "399": "New-and-improved Rockets face stern test from Nets  #NBA\n #HoustonRockets #Rockets50 #BrooklynNets #BrooklynGrit https://t.co/g7OyTzxnyl",
    "400": "Crazy fun fact:\n\nThe Houston rockets…yes, the Houston rockets. Have the LONGEST…LONGEST win streak in the nba. Yes, the LONGEST… it’s crazy, I know it’s crazy.",
    "401": "@HoustonRockets H-Town stand up",
    "402": "The Houston Rockets Eric Gordan had 64 hotdogs in his pockets while playing.",
    "403": "Houston Rockets: Houston Rockets:  vs. Brooklyn Nets game preview https://t.co/2m1tux5IKh",
    "404": "Houston Rockets vs. Brooklyn Nets game preview, in which one team’s random Wednesday night game is another team’s Super Bowl https://t.co/FiIHd7wZDD",
    "405": "Houston Rockets vs. Brooklyn Nets game preview, in which one team’s random Wednesday night game is another team’s Super Bowl.  https://t.co/cAkLxrd8Eg",
    "406": "Before @KDTrey5 visits Clutch City, take a look at the best crunchtime moments by KD for BKN! 🚨\n\nWatch the @BrooklynNets take on the @HoustonRockets tomorrow at 9 AM on NBA TV Philippines via @CignalTV. 📺\n\n#NBA75 https://t.co/7zIQtYzmYp",
    "407": "New #Rockets from Houston Chronicle — Podcast: Inside a Rockets winning streak https://t.co/6MMvhprRJK",
    "408": "@a_duckett @HoustonRockets @ApolloLaunchPad bless the kid🚀",
    "409": "The Houston Rockets Trevor Ariza had a six pack of budlight for breakfast on game day.",
    "410": "@a_duckett @HoustonRockets @ApolloLaunchPad A surprise gift for a loved one and I'm free tomorrow! 🙏😭☺️",
    "411": "@HoustonRockets can me and my friend get some tickets to the game for New Years? We coming to Houston for our 1st time together! I would love to surprise them with good seats. #goodseats #basketballfan #Please",
    "412": "FINAL Houston Rockets 41 - 60 Los Angeles Lakers \n\nPain.",
    "413": "After 3Qs Houston Rockets 34 - 50 Los Angeles Lakers",
    "414": "HALFTIME Houston Rockets 25 - 34 Los Angeles Lakers",
    "415": "@EricMacramalla Nobody will care that much in Houston when they have Astros, Texans, Rockets on the NHL will be a distant thought\n\nYes in theory what you say is true, and can say the same about Arizona and Atlanta. But now look how much more money the Jets make in Winnipeg than Atlanta ever did",
    "416": "@a_duckett @HoustonRockets @ApolloLaunchPad Would be a great birthday game♐️",
    "417": "Co-signed\n\n-The 2019-2020 Houston Rockets https://t.co/mWKKxp2yv6",
    "418": "After 1Q Houston Rockets 12 - 8 Los Angeles Lakers",
    "419": "FINAL Houston Rockets 32 - 73 Minnesota Timberwolves \n\nPain.",
    "420": "Just let me win one of these @HoustonRockets ticket giveaways for tomorrow please 🤞🏽",
    "421": "Check out 2019-20 PANINI MOSAIC JAMES HARDEN GIVE AND GO INSERT CARD #6 (ROCKETS) NETS  https://t.co/YEWTSHpmmG via @eBay #HoustonRockets #TheBeard #StepDaddy #Rockets #LightTheFuse",
    "422": "computer engineer.  India have played like rubbish: Description by a sanitation engineer.\"  Ateeq: \"Indian Cricket is just down in the dumps: Description by a Fan.\"  Niranjan: \"\"Houston, we have a problem\". - Description by a rocket scientist.\" 10/n\n\n\"",
    "423": "The Houston Rockets Luc Monte had 64 hotdogs in his pockets while playing.",
    "424": "After 3Qs Houston Rockets 24 - 57 Minnesota Timberwolves",
    "425": "HALFTIME Houston Rockets 19 - 34 Minnesota Timberwolves",
    "426": "Rockets fans gonna boo the shit outta Harden tomorrow, he’s gonna act hurt post game, then the national media is gonna berate Houston fans for being “ungrateful”.",
    "427": "Please win @HoustonRockets https://t.co/CbObCu16KC",
    "428": "After 1Q Houston Rockets 6 - Minnesota Timberwolves 16",
    "429": "@timelesssports_ They just showed some vision of @celtics v @HoustonRockets in the NBA finals from court side. It was awesome.",
    "430": "Earning gift cards for selling my stuff on @Listia! Join me using code \"CCHXQP\" for an extra 250 PTS. I just listed this: 2017 Panini Immaculate Trevor Ariza Triple Jersey /99 card Houston Rockets https://t.co/pDfSCcPHxN",
    "431": "The Mavs only have 4 more wins than the Houston Rockets",
    "432": "The Houston Rockets Clint Capela had 64 hotdogs in his pockets while playing.",
    "433": "@__cd5 They're a worse version of James Harden's Houston Rockets.\n\nShut up @ryangf10",
    "434": "@ESPNPlus @espn 2018 Houston Rockets",
    "435": "@erecasner @jsido @HoustonRockets @LSUBasketball @nuggets Loved watching him play.",
    "436": "Take the night off tomorrow vs. the Rockets. Don’t care if we don’t get a W. Let Houston continue their winning streak. https://t.co/eMAYZv5hdZ",
    "437": "@Itamar_17_10 The Houston rocket killer THJ",
    "438": "Tuesday’s Locked on Rockets dives into Houston’s historic six-game winning streak, as well as encouraging new comments by owner Tilman Fertitta.  https://t.co/AXDXY2LS2l",
    "439": ".@HoustonRockets game tomorrow. 🤩",
    "440": "The Houston Rockets James Harden had a blind fold on during the game.",
    "441": "@a_duckett @HoustonRockets @ApolloLaunchPad Pick me!! It’s gonna be a great game!!🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀 https://t.co/1C5MCXqFSt",
    "442": "@PCreighton1 @espn975 When will Houston get an NHL team? \nWill the Toyota center be the home of the rockets and NHL team? \nWhat team does Harden play for next year? \nWho plays first kyrie or Simmons?",
    "443": "This must be what fans of the 2018 Houston Rockets felt like during Game 7 of the Western Conference Finals",
    "444": "The Houston Rockets Luc Monte had a terrible warmup and won't play.",
    "445": "I have no words\n\nThis is Houston Rockets game 7 level",
    "446": "@BrianPuspos @officialccd @HoustonRockets WOW 👏 👏 \nAmazing \n#BrianPuspos \n\nhttps://t.co/QJNW57Ftsg",
    "447": "@pizzaknicks @SBondyNYDN @NBA @HoustonRockets Oh but the Rockets gonna wipe the floor with the 76ers 🚀🚀",
    "448": "@a_duckett @J_Namikaze23 @HoustonRockets @ApolloLaunchPad Pick me pleaseeeeee 🥺🚀 https://t.co/7Lw5B1CEGG",
    "449": "Most Valuable Pre-Game Dancer is returning to Houston tomorrow night. 🤣 #Rockets #Nets https://t.co/IkorMOoNH8",
    "450": "Though James Harden and the Nets visited Houston last March, fan attendance was severely limited. That won’t be the case on Wednesday, and the #Rockets are excited for the atmosphere.\nhttps://t.co/o6nCzD7OUk",
    "451": "@_Houston_Rocket Nah .. it was good don’t get me wrong but demon slayer is still better",
    "452": "@HoustonRockets @socios I have been a big fan of the Rockets since Yao Ming joined, and I still am.",
    "453": "@a_duckett @HoustonRockets @ApolloLaunchPad Alright round 2 , come on giveaway tickets 🙏🙏🙏",
    "454": "@nbafan177928243 @Jonny_Da @gmathews_24 @nbatopshot @HoustonRockets @DreamShake_R @alxocity @NBATopShotTalk @intangible_eth @joeswam @FreeBritneyTS @jonnyp7474 Yah I had a bit of an S2 fire sale"
}