{
    "0": "The Toronto Raptors are set to take on the Charlotte Hornets in the first game back from the All-Star break. The #Raptors have won 10 of their last 12 games, the #Hornets have lost 9 of their last 10. #TORvsCHA #NBA \n\nPhoto: https://t.co/MMLRHraaYV https://t.co/V9ukJRiJh2",
    "1": "@hornets @CrumblCookies Let's go!",
    "2": "@hornets @CrumblCookies Why is BUMlee still starting over trez??😩😑😑🤦‍♂️",
    "3": "@embreyNBA @hornets @CrumblCookies Easing him in with limited minutes maybe?",
    "4": "@hornets @CrumblCookies Plumlee disaster class today https://t.co/KCCaS8k53D",
    "5": "@hornets @CrumblCookies where is Cody Martin 🙄",
    "6": "@TevinIsiah @Brooks20Alonzo @Sorrowinfinity @DKM_Sports @SamFarberLive @MELOD1P @hornets Hayward record with the Hornets is 26-22, Lamelo record with the Hornets this season 25-28, I do not see where we won more with Hayward 1 more win does not make you the best player. And for the losses Hayward could have made a difference but that doesn't make him the best player.",
    "7": "Starting 🖐\n\n#AllFly | @CrumblCookies https://t.co/zyM1B9LHYJ",
    "8": "LIVE: The @Raptors are taking on the @hornets tonight in Charlotte at 7:00pm ET.\n\nCatch the action live now on TSN 1/4 and TSN Direct!",
    "9": "Tune into the @hornets game tonight to see me row B behind the Hornets bench. I’m channeling my inner Rob Lowe tonight.",
    "10": "@ChristoFlash92 @Brooks20Alonzo @Sorrowinfinity @DKM_Sports @SamFarberLive @MELOD1P @hornets Best player of the TEAM is the best player for the TEAM. LaMelo's decision making and game awareness aren't NBA ready YET, this is Hayward's importance. If you watched the team the year before Hayward got there, you'd understand the importance of a vet presence.",
    "11": "The @raptors are back in action following the all-star break as they take on the @hornets in Charlotte. \n\n@Eric__Smith will have the call coming up next, you can catch #Raptors Reaction with @william_lou right after the game! #WeTheNorth \n\nListen live 📻 https://t.co/VXgyFg8CWx https://t.co/p3PB9CiCQE",
    "12": "charlotte hornets time..",
    "13": "Weird @hornets thing happening. Six players came out for warmups. No Lamelo noticeably",
    "14": "Welcome back @cody_martin15! \n\n#AllFly | @hornets https://t.co/EfrcmMc5al",
    "15": "Charlotte Hornets - Toronto Raptors\n40/1 bet builder https://t.co/9LYSlMyxZ8",
    "16": "Friday night hoops 🏀 And club level views 🤩 #charlottehornets #nba https://t.co/t6HAWt0AKN",
    "17": "@Raptors playing @hornets tonight. @chrisboucher better not be wearing Melos shoes again.",
    "18": "@ChristoFlash92 @Brooks20Alonzo @Sorrowinfinity @DKM_Sports @SamFarberLive @MELOD1P @hornets They win more often when he plays, that's a pretty big impact",
    "19": "@hornets @greensboroswarm Like I said in the “Trez to Hornets” spaces Borrego is gonna definitely find a way to get Cody Martin to play the most amount of minutes possible despite Bouknight being the obvious choice",
    "20": "@CharlotteFC @cody_martin15 yo, can y'all tell the @hornets to unblock me?",
    "21": "Show out @MELOD1P! \n\nWhat a debut in his first NBA All-Star game! 🤩\n\n#AllFly | @hornets https://t.co/RHI6NqPBXz",
    "22": "@TevinIsiah @Brooks20Alonzo @Sorrowinfinity @DKM_Sports @SamFarberLive @MELOD1P @hornets I understand he is a very good player but you should review the characteristics of the \"best player of the team\" having 10 years of experience does not make you the best but the most experienced.",
    "23": "@FKNTORO @hornets Let’s go!",
    "24": "@TevinIsiah @Brooks20Alonzo @Sorrowinfinity @DKM_Sports @SamFarberLive @MELOD1P @hornets Look I think it's you who doesn't understand so I think I'll stop arguing with it, I feel like I'm talking to a wall if Hayward's experience is so blatant then explain to me why he doesn't lead the team on different aspects and why he doesn't have a bigger impact ?",
    "25": "Tonight's starting lineup for the Charlotte Hornets: Ball, Rozier, Bridges, Washington, Plumlee https://t.co/bVWH4AMCA2",
    "26": "Mr. 80%? M. Plumlee's rebound prop looking juicy tonight when considering his recent form and matchup history.\n\n# GamblingTwitter #NBATwitter #Charlotte #hornets #raptors #props #playerprops #sportsbetting https://t.co/ULyL4disLY",
    "27": "Time to get back to work! \n\n@hornets basketball is back! \n\n@ashahahmadi and @WesGotRange are taking you up to tipoff! Only on @HornetsOnBally! \n\n#AllFly https://t.co/VEbSPGcXm0",
    "28": "🏀NBA VIP System Play: Charlotte Hornets +2\n\n#selectivebets #provensystem #sportsbettingpicks #NBAPicks \n\nhttps://t.co/qTWuyW81Lw https://t.co/qN0aQQ2KB1",
    "29": "We chillin wit Hugo today 😉 @hornets https://t.co/LhxLGqfiqv",
    "30": "@hornetsgamenite how about a little all I do is win??? Let’s get these @hornets on a winning streak!!!",
    "31": "Yo @MELOD1P I wore the fire red ones and everyone started copping at my gym , I need the purple joints help a playa out @PUMA @hornets 😤👀 https://t.co/5pYignUJTY",
    "32": "@TevinIsiah @Brooks20Alonzo @Sorrowinfinity @DKM_Sports @SamFarberLive @MELOD1P @hornets So explain to me what more Lamelo has to do to be a better player than Hayward this year? And please be polite we support the same team and I understand very well what you are saying I just don't agree with you that's all there is no need to be condescending..",
    "33": "CHARLOTTE HORNETS VS TORONTO RAPTORS WATCH LIVE NOW!! https://t.co/0N24hCScnp via @YouTube we live in the House of lit and yeah we in Charlotte That Way #LiThouse https://t.co/f8zlNvs0Ns",
    "34": "@TevinIsiah @Brooks20Alonzo @Sorrowinfinity @DKM_Sports @SamFarberLive @MELOD1P @hornets . So now you're telling me that an all star like Lamelo isn't the best player on the team? A player who dominates the team in points and rebounds and assists. So for you a player who has 16/4/4 has more impact and is better than an All star who has 20/7/7 ?",
    "35": "CHARLOTTE HORNETS VS TORONTO RAPTORS WATCH LIVE NOW!! https://t.co/7tKQ97NPTQ via @YouTube",
    "36": "@chapmamba_ @hornets @greensboroswarm Only getting assigned bc he coming back from injury",
    "37": "The NBA is LIVE on #SiriusXM 167 at 7pmET! Don't miss #WeTheNorth at @hornets #AllFly!\n\nListen anywhere in Canada on the SiriusXM app! Get it here: https://t.co/8Cuvf52Slc https://t.co/uB2dDHGdcr",
    "38": "Charlotte Hornets Foundation Selects Noah Monroe As First Recipient of Rick Bonnell Memorial Scholarship | Charlotte Hornets #hornets #rickbonnell #charlotte  https://t.co/4uxxQzxjsJ",
    "39": "@FKNTORO @hornets I’m here to bro!",
    "40": "Here for the @hornets vs Raptors #AllFly https://t.co/v3J8Dewc8Y",
    "41": "@ChristoFlash92 @Brooks20Alonzo @Sorrowinfinity @DKM_Sports @SamFarberLive @MELOD1P @hornets Also, \nI was talking about what makes Hayward the better player at the moment, and that would be his previous experience over more years with different teammates against more players, in tougher games.\n\nSo yes, judging what he brings to the team NOW is INFORMED by his other years",
    "42": "@ChristoFlash92 @Brooks20Alonzo @Sorrowinfinity @DKM_Sports @SamFarberLive @MELOD1P @hornets Last 2 years would be considering BOTH years and that means he's correct, which is probably why he didn't say just this year.\n\nLamelo is having a better year, but better year doesn't mean better player team-wise. Ie Westbrook stats are always good, not always good for the team",
    "43": "The Raptors are back in action! They're on the road to visit the Charlotte Hornets. What's the play?\n\n📉Bet Trends📈\n🔘TOR is 4-1 ATS in last 5 road games\n🔘CHA is 1-9-1 ATS in last 11 home games\n🔘Over is 1-4 in CHA last 5 home games\n\nBet Here ▶ https://t.co/hoMFYOtKcl\n\n19+ https://t.co/WYUVQED68a",
    "44": "@Brooks20Alonzo @Sorrowinfinity @DKM_Sports @SamFarberLive @MELOD1P @hornets Damn, I hurt your feelings huh\n\nHornets fans watch the Hornets play and understand what Mitch is saying.",
    "45": "Rested and ready to roll into the home stretch here at the Hive. \n@hornets hosting Toronto tonight with 22 games left in the season. \n@KyleBaileyClub and @TBoneWFNZ have pregame and I’ll have the call at 7 on @wfnz the Hornets Mobile App and the Hornets Radio Network! https://t.co/1Sa2Fg3weQ",
    "46": "@hornets @cody_martin15 @CharlotteFC @MichelobULTRA That's a nice shirt. From a football fan Brit. 🤷‍♂️",
    "47": "@hornets @MichelobULTRA @KELLYOUBREJR @T_Rozzay3 @MONSTATREZZ @PJWashington Gordans playing ?",
    "48": "@TevinIsiah @Brooks20Alonzo @Sorrowinfinity @DKM_Sports @SamFarberLive @MELOD1P @hornets Gordon is absolutely not the best player on the team. And since you are changing the narrative on these 10 years of NBA, at no time this season and the previous one these 10 years of « experience\" are reflected.",
    "49": ".@cody_martin15 is representing the @CharlotteFC fam today 👊⚽️\n\n#ULTRADrip | @MichelobULTRA https://t.co/XqZWUfrwWX",
    "50": "@TevinIsiah @Brooks20Alonzo @Sorrowinfinity @DKM_Sports @SamFarberLive @MELOD1P @hornets you just change the narrative, you talk about the years of Haywzard, while Mitch said I quote \"Gordon Hayward is the best player on the last two years\". last year why not, since Lamelo was Rookie and injured after. But certainly not this year!",
    "51": "@hornets @MichelobULTRA @KELLYOUBREJR @T_Rozzay3 @MONSTATREZZ @PJWashington I want to see Lamelo",
    "52": "@hornets @MichelobULTRA @KELLYOUBREJR @T_Rozzay3 @MONSTATREZZ @PJWashington Bro why are they still wearing masks 😭",
    "53": "Back at the HIVE!\n\n#ULTRADrip | @MichelobULTRA https://t.co/URBwYJeAJF",
    "54": "Hornets' Gordon Hayward Enters NBA's COVID-19 Protocols; Out vs. Pacers #Charlotte #Hornets #NBA https://t.co/uZeGmrwtct",
    "55": "🏀 RAPS VS HORNETS!\n\nThe @Raptors are back in action against the @hornets tonight in Charlotte!\n\nWill the 🦖’s start their second half with a W? \n\n#MakeAPlay ➡️ https://t.co/qUPBOzx6EM #WeTheNorth #AllFly https://t.co/UHSPqhawnq",
    "56": "Can someone tell @TzviLovesSports @isqiisi and @TheSpun to correct this…Perkins was talking about the @PelicansNBA moving not the @hornets  🤦🏾‍♂️ #thehiveisalive https://t.co/kwKGEkjZEB",
    "57": "11 years ago my amazing wife @BESMonday took me to see the bobcats for my birthday. We are back for the @hornets a better team and better seats! #AllFly https://t.co/c0uwBsgjq2",
    "58": "Cody Martin (chump)  available to play Friday.\n\n#CREAMgetsTheMONEY at\nhttps://t.co/Nn0iNg7L2I\n\n@cody_martin15 #AllFly @Hornets #NBADFS #DFS https://t.co/XBxL1MSys2",
    "59": "Martinez, Pedro - Hanfmann, Yannick\nTabilo, Alejandro - Kecmanovic, Miomir\nCharlotte Hornets - Toronto Raptors\nSaville, Daria - Stephens, Sloane\nPhoenix Suns - New Orleans Pelicans\n\nBet slip link: https://t.co/4CW6XXgkIM https://t.co/0nQPpKtNyg",
    "60": "Toronto and Charlotte are headed in very different directions coming back from the All-Star break, and nothing about this matchup makes us think they're about change. Find out why we're Dino hunting with our Raptors vs. Hornets picks.\n\nhttps://t.co/ljL4yZtMuQ",
    "61": "🏀NBA🏀\nCharlotte Hornets vs Toronto Raptors \n\nCharlotte looks to snap a three-game losing streak. Charlotte was defeated by the Miami Heat 111-107 in their last game prior to the All-Star Game break. Charlotte has lost nine of its last 10 games. https://t.co/QBqOZcIYrn",
    "62": "I will once again be asking the Charlotte Hornets to beat the Raptors",
    "63": "@Reecespuffs1738 @hornets @NovantHealth Yeah but he been playing backup pg when lamelo is resting",
    "64": ".@hornets reserve Cody Martin (L Ankle/Achilles) has been upgraded and is available to play. Richards and McDaniels are both out. \n\n#AllFly https://t.co/JYcnRhIrPy",
    "65": "@banslovesmom @hornets @NovantHealth Isn’t he our starter",
    "66": "@banslovesmom @hornets @NovantHealth Ngl still don’t know who that is",
    "67": "@hornets @NovantHealth We need Martin bad for defense",
    "68": "@Reecespuffs1738 @hornets @NovantHealth The dude that thinks he better than Kyrie",
    "69": "I was getting ready for the @hornets game, hype, ready. Maaaaan why did I get back on here, now I’m back depressed 🤣 This group is making present &amp; future decisions, oh crap 😵‍💫 😂😭 https://t.co/4GTOgVsXYH",
    "70": "@hornets @NovantHealth Who is our back up pg",
    "71": "INJURY REPORT vs TOR\n\nMcDaniels (L Ankle Sprain) is doubtful.\nRichards (R Foot Soreness) is doubtful.\nMartin (L Ankle/Achilles) is probable.\nHayward (L Ankle) is out.\n\n#AllFly | @NovantHealth https://t.co/38XCDJa5op",
    "72": "Happy birthday to the 1️⃣x all star ⭐️ @FredVanVleet have more things to come Brotha 🏀🦖🏆💍☝🏽 and good luck tonight against the Charlotte hornets LETS GO @Raptors 🥳🥂",
    "73": "@CLT_Bandit @KyleBaileyClub @hornets Its to protect terry for going against the big guards Alone and help pumplee Because he has no presence whatsoever in the Paint",
    "74": "Cody Martin (shenanigans)  won't have a minutes limit if he plays Friday.\n\n#CREAMgetsTheMONEY at\nhttps://t.co/Nn0iNg7L2I\n\n@cody_martin15 #AllFly @Hornets #NBADFS #DFS https://t.co/4yW0wJ4eQU",
    "75": "Can’t wait to be back in the Hive tonight @hornets 💜💜💜",
    "76": "@EricBerman72 @CrownClubCLT @MONSTATREZZ @FKNTORO @hornets Cool, but weird pic. I was about to call the police on y'all. 😂 😂",
    "77": "@Brooks20Alonzo @Sorrowinfinity @DKM_Sports @SamFarberLive @MELOD1P @hornets I never moved the goalposts, you just can't follow a thread lmao.\n\nMore years in the league is experience, NBA playoff experience is experience, which makes a player a better NBA player developmentally, situationally. You can't develop those until you've experienced them.",
    "78": "Here's @JTFOz's pick for tonights matchup between the @Raptors and the @hornets \n\nKeep an eye on the #Raptors tomorrow though as they're 10-1 ATS when playing back to backs\n\n#NBATwitter #NBAProps https://t.co/ROnKP0xeID",
    "79": "Congratulations to LameloBallGOAT, CasualHindu (@casualhindu), Melissa60979187 (@Melissa60979187) and woodosa who moved up to take #23, #24, #25 and #35 on the Charlotte Hornets team leaderboard.\n\nhttps://t.co/dYEEwV7pFm",
    "80": "@hornets @greensboroswarm Send Borrego to the Greensboro Swarm instead.",
    "81": "Stop by and visit us at the @hornets game tonight! We're teaming up with @HornetsVenomGT to host the first-ever LevelUp Hive camp for kids ages 8-17 on March 12!\n\nLearn more and register: https://t.co/3hjHsLPTvy https://t.co/Ww0XeZ4oQJ",
    "82": "@TevinIsiah @Sorrowinfinity @DKM_Sports @SamFarberLive @MELOD1P @hornets No it’s clear you don’t you’ve tried to move the goal post 4 time 1st it was Melo not the best player . Then it’s Hayward because more yrs in the league then it’s more experience in the playoffs when he only played in 29 games in his miserable career not to mention stays injured",
    "83": "@Raptors vs @hornets \n\n-2.5 now to -2 all the money on raps on the road. \n\nBoth spread and ML - raps getting all the money % and bet % \n\n225.5 to 225 81 % of bets on the over but 33 % money % on the over - \n\nRefs: \n\nEric D. 203.6 PPG \nNathalie S. 217.3 PPG \nKane F. 201.1 PPG",
    "84": "It’s GAME DAY FOR @raptors As They Play The Charlotte Hornets https://t.co/Dk0Ne5TcrK",
    "85": "Tough matchup for the Hornets tonight. The last time Charlotte was swept in the season series against Toronto was the 2017-2018 season. They've lost the first two of three against them so far this season. Gotta come out hot and defend the interior.",
    "86": "@Brooks20Alonzo @Sorrowinfinity @DKM_Sports @SamFarberLive @MELOD1P @hornets They didn't resign him because they had an younger, emerging star at the same position lmao\n\n29 games his whole career??? oh you mean playoffs? 29 games is 4-5 7 games series, Playoff Basketball is very different. But it's clear you don't know basketball, Stay in school kid.",
    "87": "@hornets @greensboroswarm Low blow.",
    "88": "Welcome Back from All-Star Break! Let’s check in with coach…  #AllFly  #TORvsCHA https://t.co/DQHVjEcNQL",
    "89": "@KingJRools @mad_ant @ChasePletcher4 @KyleBaileyClub @hornets And you are? lol",
    "90": "@astiles @KyleBaileyClub @hornets So more like no earlier than March 8th https://t.co/hmCoFdRtYz",
    "91": "@chapmamba_ @hornets @greensboroswarm Agreed",
    "92": "Inbox: Among board/commission appointments &amp; nominations disclosed today by @NC_Governor is the appointment of @hornets Executive VP of Operations James Jordan to @edpnc board. Jordan was added as an expert in military/defense; he served 31 years in @USArmy and retired in 2006.",
    "93": "@TheDougRush The Charlotte Hornets logo says New Orleans on it 😂",
    "94": "@xTHEDRAWx @hornets @greensboroswarm No, they don't do that on game days.  Why would they make him drive to Greensboro and back today if they planned to play him tonight?",
    "95": "@MtnDude1020 @chapmamba_ @hornets @greensboroswarm Ur fucking on drugs",
    "96": "@chapmamba_ @hornets @greensboroswarm He's been getting more PT of late, in case you hadn't noticed.  I think this is more of a \"message\" demotion  re: some of his actions off the court recently (his blow-up at Borrego on the bench and the disruption he caused at the UConn game during the All-Star break).",
    "97": "@TevinIsiah @Sorrowinfinity @DKM_Sports @SamFarberLive @MELOD1P That doesn’t have a dam thing to do with the narrative 🤡. He was trash in Boston which is why they didn’t resign him and injury prone and he’s the same at the @hornets . So let’s not talk about experience BS . He has only played in 29 games his whole career and average 15 points https://t.co/Pu7FeQPOlq",
    "98": "So do my @hornets 🙏🙏 https://t.co/LYOKgbePq8 https://t.co/7WoAnVKooT",
    "99": "@hornets ur thoughts? https://t.co/q4tbuKuYeJ",
    "100": "Charlotte Hornets, then the Seattle SuperSonics, who need to come back to the NBA. https://t.co/XhxM5lVbgd",
    "101": "Today's NBA Picks: 7:10 PM ET - Toronto Raptors vs. Charlotte Hornets - 23 PICKS AVAILABLE: https://t.co/u0eP5mYmPH #nba",
    "102": "@and_hennessy @VegasBabyKJ @KyleBaileyClub @hornets And still no sniff of the playoffs!",
    "103": "@CouchCoachKyle @ChasePletcher4 @KyleBaileyClub @hornets I don’t see nobody else benched for there misque be Lamelo",
    "104": "Time to see what the @hornets are made of in this 2nd half of the season. Start off strong tonight and set the tone",
    "105": "@KyleBaileyClub @hornets Why does no one tell Mason Plumlee to stop dribbling the ball!",
    "106": "@KyleBaileyClub @hornets Can we look at giving Thor more minutes!",
    "107": "@KyleBaileyClub @ClubhouseKB @DEWALTtough @jonmalexander @Panthers @Riceman61 @NASCAR @hornets @jppalmCBS @wfnz JB is going with a 9 guy rotation…. 🙌🏾🙌🏾🙌🏾🙌🏾 Keep them legs fresh through the stretch https://t.co/3DQSDcZJEx",
    "108": "@banslovesmom @hornets Please free Bouk. Cut that string and let the kite fly to Orlando 🙏",
    "109": "@noahmnroe @hornets @scott_fowler Congrats! That’s awesome!",
    "110": "@KyleBaileyClub @hornets Need a Kai Jones update whats his status how’s he fairing maybe in comparison to other bigs nick Richards etc. what’s Kai have to do to see the floor",
    "111": "Ep. 21 of \"In The Front Row\" features former @uncwmenshoops\nand @hornets standout Brian Rowsom who shares his journey including the early days of the @CAASports and his battles with @DavidtheAdmiral, plus his coaching career.\n\n📺 https://t.co/Xf4YzleQ5K\n📻 https://t.co/X2By3A6e3F https://t.co/YVEXGmwlnp",
    "112": "@hornets Free lamelo\nFree bouk  \nFree miles",
    "113": "@KyleBaileyClub @hornets Why has the defense been struggling so much?",
    "114": "We love this game and we love our fans 💜🏀\n\n🎙: https://t.co/YnraNZs8f0\n\n#AllFly https://t.co/Z1KH3UJ5GI",
    "115": "@KyleBaileyClub @hornets Who is the number 1 option? Why have they been losing so many games?",
    "116": "@and_hennessy @KyleBaileyClub @hornets Where do you see that? I only see their status for tonight’s game and the listed injury.",
    "117": "@s24taofeek @CouchCoachKyle @Amanda_m_helms @KyleBaileyClub @hornets 1000%. You can act like that if you’re a star. Bouk is the 4th best guard at best ON THE TEAM. Going to sound like old man yelling at the sky, but maybe focus more on your game and less time trying to fight the guy who determines your minutes bc you’re mad…About your minutes!",
    "118": "@banslovesmom White Hornets fans I doubt you find any Black person in any All Black neighborhood in Charlotte or that many Black people that are Hornets fans that see any value in Cody Martin. Black fans like winners we could careless if they are mean outside the court.",
    "119": "@MtnDude1020 @plugyuh @hornets @greensboroswarm Have u ever watch the g league team? they don’t develop shit there and yall should not be talking about development cuz this franchise got no development system every player y’all claim to develop plays shit when they leaves",
    "120": "@and_hennessy @KyleBaileyClub @hornets In what way. You were below .500 then. Ur below .500 now",
    "121": "(the bee is not a khive thing, the charlotte area is known as “the hornets nest”)",
    "122": "@tone_houston @hornets @greensboroswarm What playoff push😂😂😂😂James borrego  is your coach bruh😂 y’all ain’t making no damn playoff 😂ur coach got out coached by Stephen Silas",
    "123": "@VegasBabyKJ @KyleBaileyClub @hornets Since Kemba left, the team has improved every year under Borrego. Ppl just be saying anything on here.",
    "124": "@astiles @KyleBaileyClub @hornets Projected for March 8th return according to the injury report",
    "125": "@KyleBaileyClub @hornets Also another one I’ve really been interested about that I’ve never understood is the zone defense we run, always gives up open 3s want to hear what he thinks about it",
    "126": "@KyleBaileyClub @hornets Why do we not run more pick and rolls with Lamelo and Montrez",
    "127": "@KyleBaileyClub @hornets Ask the real question. Why hasn’t his team made any wide improvements since he has been here?",
    "128": "The Charlotte Hornets are a cool 0-7 OU (-10.38 ppg) at home when the line is within 3 of pick. The SDQL text is :\n\n‘team=Hornets and -3&lt;=line&lt;=3 and H and date&gt;=20220000’\n\nActive today against Toronto. https://t.co/S9f7xfT1YE",
    "129": "Don't forget to check out today's Hornets Hive Cast!\n\nWe preview tonight's @hornets matchup with Toronto and review yesterday's podcast interview with Charlotte Hornets GM Mitch Kupchak with @Rob_Longo on today's HHC.\n\nhttps://t.co/OqDLGfQBZi",
    "130": "Charlotte Hornets Predictions and Preview for 2/25/2022 hosts Toronto Raptors.  Looking for betting action?  Find out if there is any value in our preview. #Picks #Punters https://t.co/kR7nFfxLId",
    "131": "@KyleBaileyClub @hornets Do you trust LaMelo to finish the game off with him having the ball in his hands scoring or passing?",
    "132": "@KyleBaileyClub @hornets Is LaMelo the franchise player?",
    "133": "@DKM_Sports @hornets You way to mad about this it’s just business speak Gordon has been around awhile it’s kinda a respect thing plus got justify the money to the media everyone from top to bottom knows it’s Melos team we can probably trade Gordon this off season gotta hype him up a bit to do so",
    "134": "@KyleBaileyClub @hornets How about a Gordon Hayward update? We saw him in uniform and at some sort of practice, but no timetable.",
    "135": "@kojikrzywosz @chapmamba_ @hornets @greensboroswarm He’s played pretty good in some games but I think he still has a lot of growing up to do. No other player on the team has acted the way he did on the bench. Could be an attitude that’s holding him back. Just speculation at this point",
    "136": "Toronto Raptors visits Charlotte Hornets Predictions and Preview for 2/25/2022 today.  Who are we taking in this game?  Find out now. #Picks #Punters https://t.co/kR7nFfxLId",
    "137": "@vin_moviesPW @chicagobulls Ja is my favorite non @hornets current player!",
    "138": "@KyleBaileyClub @hornets Ask him why he thought davante little grahams was better than Lamelo",
    "139": "@MtnDude1020 @chapmamba_ @hornets @greensboroswarm I agree when Cody Martin was playing well in the beginning of the season but he hasn't been the same player after he went out with covid. Terry has been up and down, Gordon has been injured. If not now then when?",
    "140": "@Black_Brutha_15 @BleacherReport @sixers Ain’t you a Charlotte hornets fan ?!?!?",
    "141": "Charlotte Hornets Foundation Selects Noah Monroe As First Recipient of Rick Bonnell Memorial Scholarship https://t.co/GjQSbPRk6l",
    "142": "@zmoretz @hornets @scott_fowler Thanks Mr. Moretz!",
    "143": "#latestnews GAME #58: TORONTO RAPTORS (31-25) @ Charlotte Hornets (29-31) - 7:00pm (EST) on TSN 1/4 - https://t.co/szYquf56m4 (POST_EXCERPT}",
    "144": "@DJdev420 @MELOD1P @hornets @MilesBridges I see you @DJdev420 https://t.co/VzYhRc6JGI",
    "145": "NBA Betting Preview: Charlotte Hornets vs. Toronto Raptors - Friday, February 25, 2022 https://t.co/6hLI6ejuCK",
    "146": "@antjams @yowhitemike @MtnDude1020 @chapmamba_ @hornets @greensboroswarm Receipts 🧾 👏",
    "147": "1/2\n#TorontoSports gameday (majors):\n\n🏀#Raptors (32-25) ✈ @hornets (29-31)\n⏰7PM\n🏟@spectrumcenter\n📺@TSN_Sports 1/4\n📻@FAN590\n\nNo #OGAnunoby tonight (right ring finger fracture)!\n\n#WeTheNorth #RTZ #TORvCHA #AllFly #NBA #TorontoSports #Alex6ixSports #Anunoby https://t.co/Yy9fPlEER1",
    "148": "@KyleBaileyClub @hornets Ask how the team seems coming back from the break ahead of tonight’s game.",
    "149": "@noahmnroe @hornets @scott_fowler Great job Noah, well deserved!",
    "150": "@KyleBaileyClub @hornets This is the best Hornets team in 20 years — there is tons of young talents, but what does he think is missing from turning the corner to be able to win 60% of games?",
    "151": ".@hornets beat reporter for the @theobserver, @rodboone joins @nickwilsonshow to talk about all the storylines around the team, as they return to action tonight coming off the All-Star break. \n\n🎧: https://t.co/KdypZJIWmX",
    "152": "@chapmamba_ @hornets @greensboroswarm He was a bad draft pick wil be gone in three years",
    "153": "@hornets @greensboroswarm Drafting wrong",
    "154": "@mad_ant @hornets @greensboroswarm I watch every game. I know what everyone brings to the table. I also know we are 1-9 in the last 10 games, most of which Cody and Jalen have missed.",
    "155": ".@NickWilsonSays takes a look at all 3 pro teams in Charlotte, and wonders which is best set up to win the most this decade. @rodboone from @theobserver joins to talk Hornets &amp; Nick and @HTBJosh host the Gold Brick Ceremony \n\n🎧: https://t.co/GdPcSrwTzO",
    "156": "4 potential offseason Anthony Davis trades for Los Angeles Lakers https://t.co/2Gi61j0FXQ #NBA #CharlotteHornets #ChicagoBulls",
    "157": "@KyleBaileyClub @hornets I want to know if he feels like he is in the hot seat now.",
    "158": "Our guys are back on the floor in 5 hours! 🕺🙌\n\n#AllFly | @LendingTree https://t.co/xHC1TkDrYu",
    "159": "@CouchCoachKyle @mad_ant @ChasePletcher4 @KyleBaileyClub @hornets Nobody knows you lil bro",
    "160": "BLACK HISTORY MONTH: In 2001, Robert L. Johnson, founder of BET, became the first Black American billionaire. In 2002, he would also become the first Black majority owner of a professional American sports team when he bought a majority stake in the Charlotte Hornets.\n#AbriCU https://t.co/fpVmPIZSLg",
    "161": "Consensus Line Move:\n2022-02-25 Toronto Raptors at Charlotte Hornets from 226.00 to 225.00\nUnder getting dough\n#NBA #parlay #innovation #sharemarket",
    "162": "RANT TIME!!! I've lived in Charlotte NC for 11 years and have over 7 years in video production. With that being said, I've applied for jobs at the Carolina Panthers and Hornets and NOT ONCE did I get an interview for 5-6 YEARS!!! (I do get that thousands are applying though) https://t.co/IIGeqpTV1n",
    "163": "@KyleBaileyClub @ClubhouseKB @DEWALTtough @jonmalexander @Panthers @Riceman61 @NASCAR @hornets @jppalmCBS @wfnz Can you maybe have a segment that explains to me exactly why I choose to be a Panthers fan?",
    "164": "@KyleBaileyClub @hornets Hornets fans are sounding more and more like Cowboy fans every day.",
    "165": "Just popped my sedative to get my eye balls lasered. Please forgive any tweets over the next ~8 hours or so, I can’t be held responsible for them. \n\nHopefully this will make the @hornets @panthers @CharlotteFC look better. \n\n@canes, you guys don’t change a thing.",
    "166": "@kingveteran78 @KyleBaileyClub @hornets I knew the punishment would come later on.. this must be it lol",
    "167": "Toronto is 9-2 both SU &amp; ATS in its last 11 games, including a 116-101 win at Charlotte &amp; a 125-113 home win over the Hornets. The Raptors, who are 18-10 ATS in 28 road assignments, are -2 at Charlotte tonight. OG Anunoby (17.5 PPG, 5.5 RPG &amp; 1.5 SPG) is 'out' (finger).",
    "168": "Today's NBA Picks: 7:10 PM ET - Toronto Raptors vs. Charlotte Hornets - 18 PICKS AVAILABLE: https://t.co/u0eP5mYmPH #nba",
    "169": "XXL @ClubhouseKB Finale…\n\n2:00 Opening segment, built by @DEWALTtough \n\n2:40 @jonmalexander on Ian Thomas, @Panthers \n\n3:20 @Riceman61 on @NASCAR’s big start\n\n4:00 @Hornets HC James Borrego\n\n5:00 @jppalmCBS with some bracket intel\n\nOnly on @wfnz https://t.co/rauLNOGYzO",
    "170": "@mad_ant @ChasePletcher4 @KyleBaileyClub @hornets Watch the games and remember me 🤡",
    "171": "@CouchCoachKyle @ChasePletcher4 @KyleBaileyClub @hornets Lol says the guy who didnt even back any of his original statement with reasons. I already knew what you was gonna say clown. You were easy and had to get personal.  Hold this L https://t.co/XVq7QAaeQc",
    "172": "@ImRalphyDavis Miles bridges from the Charlotte Hornets",
    "173": "@sakatierney45 @KyleBaileyClub @hornets why send bouknight to the Swarm when you need offense at times during the game",
    "174": "@mad_ant @ChasePletcher4 @KyleBaileyClub @hornets You can drop the mic all you want. You’re bitch to a empty crowd lol you didn’t correct me on anything but okay! Good luck with your coaching career that you’ll never have!",
    "175": "@CouchCoachKyle @ChasePletcher4 @KyleBaileyClub @hornets Dont need to be one to correct you. And borrego has just as many winning seasons and playoff appearances as i do. Want a mic drop with that??",
    "176": "Pascal Siakam at even odds for a double double looks good to me. Already has 2 this season against Charlotte and the Hornets’ struggles against big men are well documented. #GamblingTwitter",
    "177": "@mad_ant @ChasePletcher4 @KyleBaileyClub @hornets Let me know when you become a NBA head coach!",
    "178": "@KyleBaileyClub @hornets Ask him why lamelo can't run the PnR more than 2 times in a row unless there down 10+ points?",
    "179": "@KyleBaileyClub @hornets Has he ever considered nasolabial fold filler?",
    "180": "@CouchCoachKyle @ChasePletcher4 @KyleBaileyClub @hornets If you are talking about foul trouble melo has been benched plenty of times without that. If you talking about defense he is one of the top defenders on team, if you talking turnovers rozier and others do it more and they aint the PG. Yall keep trying this angle &amp; it never works",
    "181": "@KyleBaileyClub @hornets Ask him why he looks so serious all the time ?",
    "182": "Watch out for the Hornets they’ve won one game this whole month and I feel like they have had enough at strong finish coming from Charlotte",
    "183": "Charlotte Hornets Foundation Selects Noah Monroe As First Recipient of Rick Bonnell Memorial Scholarship https://t.co/ptyOFKz9Ly",
    "184": "📰 Charlotte Hornets vs Toronto Raptors Betting Odds and Prediction Feb 25!\n👉 https://t.co/BRfMpvBzBY @wagertalk",
    "185": "@KyleBaileyClub @hornets Ask JB about bouknight development approach and how good he thinks he can be",
    "186": "@KyleBaileyClub @hornets 😄Yes, because you know he’s going to give you a BS answer first.",
    "187": "@EdThegr8one @hornets LOL ask it just like that?",
    "188": "@ChasePletcher4 @KyleBaileyClub @hornets People who say that don’t actually watch the games or else they would understand why melo gets benched",
    "189": "OG Anunoby will miss Friday’s game against the Charlotte Hornets and possibly longer for the Raptors with a broken right ring finger.\n\nhttps://t.co/pv9RFh4E7Y",
    "190": "2022-02-25 @Raptors at @Hornets\npicks: 1H #WeTheNorth -1.0 \n    FG Over 225.5 \n    FG #WeTheNorth Over 114.0 \n    \n#NBA #CryptoHoops #pythonprogramming #daytrader https://t.co/kL0ITXvAh0",
    "191": "@KyleBaileyClub @hornets How’s his relationship with Bouk? Then ask him… how is it, really?",
    "192": "@KyleBaileyClub @hornets Why does he want to sabotage lamelos career? /s",
    "193": "@HornCats89 @hornets 100%. Pretty sure he’s the President of the Fan Club.",
    "194": "@KyleBaileyClub @hornets Is he a LaMelo Stan?",
    "195": "@KyleBaileyClub @hornets Him singing songs in a Vegas lounge style",
    "196": "@KyleBaileyClub @hornets What is his plan to turn it around make the most of these next 22 games.  Also what is the status of Gordon.   Why is he not back yet?   How long can we afford to go without him and still make a run?",
    "197": "@hornets @greensboroswarm Chill people, he'll be recalled in a few hours. Been doing this all season with Kai, Bouk, Carey, Thor etc. Melo even went for extra conditioning after his stint in H&amp;S protocols.",
    "198": "@Amanda_m_helms @KyleBaileyClub @hornets To learn how to act at a basketball game",
    "199": "@hornets @greensboroswarm Whoever just made this decision needs to be fired. Ish Smith is gone and Bouknight has proven he can play in the NBA. Stop beating yourselves. #LosingCulture",
    "200": "It’s @hornets game day! Ready to see @MELOD1P &amp; @MONSTATREZZ ! 🔥🔥",
    "201": "@DonBraxton9 @MtnDude1020 @Whoalock @qdhaggss10 @hornets @greensboroswarm Frank got more time playing as a rookie for the Hornets over the years he has shown that he is a bust. Bouknight when given the chance to play he is a much superior player than Frank. Jokic is the rare good second round pick an anomaly Cody Martin is trash and will never be a MVP",
    "202": "Join us in congratulating Noah Monroe who has been selected as the first recipient of the Rick Bonnell Memorial Scholarship! 📚\n\nThis scholarship was created to honor the legacy &amp; impact made of late @theobserver Hornets beat writer Rick Bonnell, who passed away in June 2021.",
    "203": "@js3kbullies @EricBerman72 @MONSTATREZZ @FKNTORO @hornets Can’t wait to see them tonight!! #AllFly",
    "204": "@EricBerman72 @MONSTATREZZ @FKNTORO @hornets Yup we got some new ones to put up on the big screen",
    "205": "@chicagobulls @PigSkinCards17 Happy birthday MJ! Please get 🙏 the Hornets what they need who ever that might be #evenfamily I'm proud to be a Charlotte Hornets fan a born and raised.... I bleed Carolina blue 💙",
    "206": "It's Friday night and we have to bet the NBA. It's in the Geneva Conventions. Lucky for us, Pascal Siakam is playing the Charlotte Hornets tonight and the books gave us a plus money move. It's almost too good to be true.\n\nhttps://t.co/c2cInDSybb",
    "207": "The Raptors are just 3 point favorites at Charlotte. The hornets have lost 9 of their last 10, while Toronto is 8-2 in their last 10.",
    "208": "/r/CharlotteHornets: Autographs at the game? #AllFly https://t.co/aldxClDhdk",
    "209": "@KyleBaileyClub @hornets Why he keeps sending the rookies down to Greensboro?  We need them here. Especially with injuries. Could use Bouk.",
    "210": "@hornets @greensboroswarm GREAT...cant wait to see cody martin come back and play 40 minutes and only score 4 freakin points!!",
    "211": "@KyleBaileyClub @hornets Should we be hopeful that they're going to come out of the tailspin after the break? If so why?",
    "212": "@KyleBaileyClub @hornets Why they sent Bouk to the Swarm AGAIN.",
    "213": "Charlotte Hornets got a bunch of drill rappers 😂",
    "214": "Uniforms for Toronto Raptors vs Charlotte Hornets at 4:00 PM.\n\n#WeTheNorth #AllFly https://t.co/dPno2sZjK6",
    "215": "Heads up… @Hornets HC James Borrego joins me today at 4:00 ahead of tonight’s restart vs. Toronto.\n\nWhat do you want to hear from JB?",
    "216": "@yowhitemike @MtnDude1020 @chapmamba_ @hornets @greensboroswarm Borrego was Miles Bridges coach his rookie year and I complained about how he mistreated Miles too https://t.co/fx4Qup1Uuo",
    "217": "@tone_houston @hornets @greensboroswarm MORE VALUABLE MY ASS. i seriously think a lot of yall just dont know basketball.",
    "218": "@antjams @MtnDude1020 @Whoalock @qdhaggss10 @hornets @greensboroswarm “Frank Kaminsky was a lottery pick and Nikola Jokic was a lowly second round pick” FOH. Also Miles, PJ, Martin, Devonte etc all spent time in the G League",
    "219": "@aDrunkenMonk @hornets @greensboroswarm Fuck monk",
    "220": "@antjams @MtnDude1020 @chapmamba_ @hornets @greensboroswarm Problem is you are putting entirely too much blame where it doesnt belong.  When Burrego started, Kubchak wasnt GM and we had a bloated roster with no-talent hacks like Batum taking up entirely too much cap space.  Burrego is only able to work with what he has.",
    "221": "@hornets @greensboroswarm Trade him please",
    "222": "@MtnDude1020 @chapmamba_ @hornets @greensboroswarm Stick to liking baseball and in your hillbilly mountain town business. Stay out of people in Charlotte business we are not going to tolerate a multiple losing seasons coach that says the most bizarre things in press conferences.",
    "223": "@antjams @chapmamba_ @hornets @greensboroswarm Again. Stop responding. You know nothing about my thoughts or who I am. You don’t know if I’m white black Hispanic Asian or anything else. You’re making yourself look foolish",
    "224": "Analyzing Friday’s Toronto Raptors at Charlotte Hornets odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/HQ2ovXGesV",
    "225": "@antjams @MtnDude1020 @chapmamba_ @hornets @greensboroswarm Were you expecting James Burrego to take us to the playoffs when Zeller and Batum were still on the roster?",
    "226": "Toronto Raptors at Charlotte Hornets odds, picks and predictions https://t.co/KJ2oGuT36I",
    "227": "@MtnDude1020 @chapmamba_ @hornets @greensboroswarm I am born and lived all my life in Charlotte if the people in the city are tired of Borrego bs stay out of it. Your profile name sounds like you from the mountains you don't understand the national embarrassment Borrego is causing fans in Charlotte with his bad in game decisions.",
    "228": "CHARLOTTE HORNET’S MITCH KUPCHAK SAYS THAT GORDON HAYWARD IS THEIR BEST ... https://t.co/buZ1vL0qCb @DJsRawUncutTru1",
    "229": "@antjams @chapmamba_ @hornets @greensboroswarm Once again proving you know nothing. Just stops responding. You’re embarrassing yourself",
    "230": "(Metro Charlotte Students) We connected with Elijah at the 2020 Charlotte Hornets HBCU Night and he is now a thriving sophomore at @JacksonStateU! We look forward to connecting with more prospective JSU students this Sunday at the 2022 HBCU Night! Get your tickets! 💙 @hornets https://t.co/C85LPwXbLM",
    "231": "@xTHEDRAWx @justinxdance @hornets @greensboroswarm Don’t get your hopes up that Hayward will play again this season. I say likely he won’t.",
    "232": "@MtnDude1020 @chapmamba_ @hornets @greensboroswarm Borrego need to be fired like any multiple seasons losing coaches don't matter if you Black, White or whatever race. He shouldn't be given the pass because he is the first and only Hispanic NBA coach the man just isn't a NBA level coach need to coach high school lol",
    "233": "@CHARLOTTEMAN3 @392392h @js3kbullies @hornets @greensboroswarm He is a very avg defender. On most good defensive teams he'd be the 5th best defender if that. That's just how bad we are defensively as team.",
    "234": "CHARLOTTE HORNET’S MITCH KUPCHAK SAYS THAT GORDON HAYWARD IS THEIR BEST ... https://t.co/JmEDq375Rk via @YouTube  #AllFly #hornets",
    "235": "@MtnDude1020 @chapmamba_ @hornets @greensboroswarm Only the White racists that want Black star athletes like LeBron to shut up and dribble defends Borrego even with him having a losing every season or time period he coached. The multi champion Heat coach proves that Borrego players assessment is bad during the All Star weekend.",
    "236": "Raptors basketball is LIVE on #SiriusXM 167 at 7pmET! Don't miss #WeTheNorth at @hornets #AllFly!\n\nListen anywhere in Canada on the SiriusXM app! Get it here: https://t.co/iS1bHf1P66 https://t.co/PvoQCGQd7Y",
    "237": "@MtnDude1020 @chapmamba_ @hornets @greensboroswarm Casey isn't causing major PR issues for his teams or the cities he coaches in like Borrego. Casey treat Cade Cunningham his top draft pick like a star and isn't minimizing his minutes. You racists love some Borrego keeping Black star athletes in line and keeping them humbled.",
    "238": "@NBASTORESupport Any insight on why The Charlotte Hornets who have the only black owner in the league wouldn't also have BHM jackets. It would make sense right?",
    "239": "@392392h @js3kbullies @Jdcostin910 @hornets @greensboroswarm He is the best defensive player on the team. We need someone to defend and bouk isn’t there yet",
    "240": "Toronto Raptors vs Charlotte Hornets NBA Pick and Prediction NBA Betting Tips 2/25/2022 https://t.co/yJFmAtULrn via @YouTube #NBA #NBAPick #NBAPredictions #NBAOdds #Hornets #Raptors #WeTheNorth #AllFly #HornetsVsRaptors",
    "241": "@KingPin_Pro Here we go Charlotte Hornets! 📈 #AllFly #NBA #NBATwitter #NBAInformatics",
    "242": "Mitch you a bird brain fr for this one 🤯 no one talked about Charlotte before MB1! 😂GH really carrying the hornets come on world 😅 @MELOD1P  @Lavarbigballer @hornets @SportsCenter https://t.co/8zD6vsgFnN",
    "243": "The @Raptors are back in town tonight, and our @hornets are ready! Are you going to the game? If so, use #I77 Express to get there reliably. #NBA #clt #hornets #raptors https://t.co/hwGclPjnez",
    "244": "@js3kbullies @CHARLOTTEMAN3 @hornets @greensboroswarm Don't forget Jalen",
    "245": "@hornets @greensboroswarm Calm down folks. Yall forget Gordon, Cody, and Jalen are all missing from the rotation, players who are more valuable for the playoff push than Bouk.",
    "246": "@antjams @DonBraxton9 @MtnDude1020 @Whoalock @qdhaggss10 @hornets @greensboroswarm You clearly don't watch the games. Cody is way more valuable on our team than Bouk right now.",
    "247": "@hornets @greensboroswarm As long as he’s back before the game tonight",
    "248": "Congratulations to stevenhan11 who moved up 126 spots to take #95 on the Charlotte Hornets team leaderboard.\n\nhttps://t.co/dYEEwV7pFm",
    "249": "@Whoalock @hornets @greensboroswarm My fault, will absolutely eat my crow here. It feels like he’s always been on that roster. Borrego seems for some reason to always play the feel good stories and washed up vets over guys that need to play, which isn’t a good plan to sustain success",
    "250": "Our #NBA prop bets for today feature:\n\n🏀 Wendell Carter Jr. Rebounds vs Houston Rockets - OVER 10.5 Rebounds\n🏀 Pascal Siakam Points + Rebounds + Assists vs Charlotte Hornets - OVER 36.5 P,R, + A\n\nDo you think these 2 will be able to hit their lines?\n\nhttps://t.co/27impQPBRM",
    "251": "NBA 🏀 Temporada: 86-76\n\nViernes 25/2:\n\nSan Antonio Spurs vs Washington Wizards O224 (-110)\nToronto Raptors vs Charlotte Hornets O226 (-110)\nPhiladelphia 76ers vs Minnesota Timberwolves U229 (-110)",
    "252": "@antjams @chapmamba_ @hornets @greensboroswarm Man you are really reaching trying to come up with anything as to why he should be fired. Look at Dwayne Casey and what he did in Toronto and now in Detroit. What’s different? Should he be fired?",
    "253": "@hornets @greensboroswarm You guys did this literally the best player on our team last year…. James has the potential need to get some rotating minutes w lamelo and bridges, those 3 would tear down every arena",
    "254": "@hornets @greensboroswarm Lol. What a joke",
    "255": "@antjams @chapmamba_ @hornets @greensboroswarm He’s our worst coach because he’s a PR nightmare. Got it. Makes total sense",
    "256": "Look at this nice #lameloball Rookie Card PSA 10 02/25 Jersey Numbered. #sportscardsforsale #rookiecard @hornets DM me https://t.co/uNMXVCmXah",
    "257": "@MtnDude1020 @chapmamba_ @hornets @greensboroswarm The only reason Borrego still have a job because he is the first Hispanic coach in NBA history and still the only one. A Black or even non Hispanic White coach would of been fired after two losing seasons. This is the worst case of affirmative action Borrego need to go.",
    "258": "@NBASTORESupport @NBASTORE  @hornets Do you have the Hornets Black History Month NBA 75th Anniversary Full-Zip Starter Jacket for purchase? I don't see them in the NBA store.",
    "259": "Toronto Raptors vs. Charlotte Hornets - 2/25/22 Free Pick &amp; NBA Betting Prediction https://t.co/8Y4ubpBLio\n.\n#Betting #FreePicks https://t.co/QOrGEHaR8v",
    "260": "@hornets @greensboroswarm Can’t wait till James leaves ruining the start of his career",
    "261": "@MtnDude1020 @chapmamba_ @hornets @greensboroswarm Borrego is our worst coach because he is a PR nightmare always saying the most dumb things causing an embarrassment to the Hornets organization and people in Charlotte on a national level. The Heat coach shouldn't be given our star player Melo better praise than Borrego.",
    "262": "@hornets are masks still required for games?",
    "263": "@LoganWebb1053 @paleochef Charlotte Hornets would be a neutral team",
    "264": "@MtnDude1020 @chapmamba_ @hornets @greensboroswarm Dunlap still played our lottery pick that year and it was a shortened lock out season. Dunlap rightfully so was fired for his one losing season and losing the locker room. So why is Borrego is able to have three losing seasons in a row yet he isn't fired.",
    "265": "@hornets Do you have the Hornets Black History Month NBA 75th Anniversary Full-Zip Jacket for purchase? I don't see them in the NBA store.",
    "266": "@hornets @greensboroswarm Free Bouknight!",
    "267": "@hornets @greensboroswarm Allan Bristow, Dave Cowens, Gene Littles, Paul Silas, Bernie Bickerstaff, Larry Brown and even Dunlap didn't put lowly second round players like a Cody Martin over a lottery pick. Clifford and Borrego are the only idiots to play our lottery picks minimum minutes Fire Borrego",
    "268": "@antjams @chapmamba_ @hornets @greensboroswarm Also clearly you haven’t been a fan since 88 if you think JB is the worst coach we’ve ever had. Mike Dunlap would like a word with you about his 7 win season",
    "269": "Friday's Free Pick: Raptors/Hornets UNDER 226.5\n\nThe Charlotte Hornets are 7-3 UNDER in their last 10 games overall.  That would be 8-2 if not for overtime against the Timberwolves two games back. That game was tied 108-108 at the end of regulation for 216 combined points.",
    "270": "@antjams @DonBraxton9 @Whoalock @qdhaggss10 @hornets @greensboroswarm Look at the guys in the All-Star game besides Melo. Every one of them is a veteran and they are balling out. This isn’t a rookie league. This is a league where pace is fast and the game is physical and you have to learn and develop before you can be consistently good",
    "271": "Kicking of #UCPSBooksandBrackets with the Charlotte Hornets Book Bus! For the Love of Reading! 📚@westernuniones @hornets #UCPSLibraryLife @AGHoulihan @jttopp https://t.co/hHriwZMA5F",
    "272": "#NBAPick for tonight's @Raptors vs @hornets game. #FreePicks \nhttps://t.co/ECOzmV08fM https://t.co/42WwIbslNf",
    "273": "Upon re-listening to the audio, Donovan said: \"I go back to a draft story. I was supposed to go to Charlotte, I was supposed to be on the Hornets. At least that’s what I was informed. So I thought that’s where I was going to be.\" https://t.co/mzSMGVC03L",
    "274": "@jamesbonknight @hornets @greensboroswarm Usually it’s to play in a swarm game but since the hornets have a game tonight as well he should be recalled",
    "275": "MARCH 5th @JooseLord LIVE!!!\nHosted by: @DJCHUCKT @hornets vs @spurs  🔒 IN🏴‍☠️🏴‍☠️🏴‍☠️ https://t.co/qxpF4N1QBV",
    "276": "@js3kbullies @Jdcostin910 @hornets @greensboroswarm No Lamelo needs to play 46 minutes. I’m not letting Martin take any of that play time",
    "277": "@DonBraxton9 @MtnDude1020 @Whoalock @qdhaggss10 @hornets @greensboroswarm Bouknight is a first round lottery pick with Cody Martin been a lowly second round pick. Just because Cody is a local from North Carolina doesn't mean he is a talented NBA level player the feel good stories players need to be cut from this team.",
    "278": "@Jdcostin910 @CHARLOTTEMAN3 @hornets @greensboroswarm I could see something along those lines.",
    "279": "@antjams @MtnDude1020 @chapmamba_ @hornets @greensboroswarm Miles Bridges? 🧐",
    "280": "@MtnDude1020 @chapmamba_ @hornets @greensboroswarm I been a fan since 1988 I have never seen a Hornets coach not play our first round draft picks major minutes their rookie year and many of those coaches led us to 50 plus wins. Borrego is the worst coach we ever had and making us in Charlotte a laughing stock. Fire him now.",
    "281": "@js3kbullies @CHARLOTTEMAN3 @hornets @greensboroswarm I don't think it is sarcastic. JB played him 22 minutes first game back from covid.",
    "282": "@Jdcostin910 @CHARLOTTEMAN3 @hornets @greensboroswarm Yea I feel u .. i was being a lil sarcastic with the word heavy tho",
    "283": "@hornets @T_Rozzay3 Win. Just… win.",
    "284": "NBA Basketball Game Betting Picks Simulator: 7:10 PM ET - Toronto Raptors vs. Charlotte Hornets - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/BlynI0db7g #nba #sportsbetting #freepicks #cappertek",
    "285": "@BelkForever @SportsDespair @hornets @FKNTORO Yea you know he brings that energy",
    "286": "@DonBraxton9 @MtnDude1020 @Whoalock @qdhaggss10 @hornets @greensboroswarm Did you see his last 20 games after his return from covid? He was awful.",
    "287": "@MONSTATREZZ We ready for you tonight in #buzzcity \n@MONSTATREZZ\n !!! #allfly @FKNTORO @hornets https://t.co/iPoQbIRLvX",
    "288": "/r/CharlotteHornets: Light Rail to the Game Tonight #AllFly https://t.co/yLU29mPTzs",
    "289": "I’m excited about the debut of Charlotte FC this weekend to distract me from Panthers and Hornets Twitter. #ForTheCrown",
    "290": "@js3kbullies @CHARLOTTEMAN3 @hornets @greensboroswarm His conditioning should be in question. Can't just ramp up the minutes after an achilles injury.",
    "291": "@MtnDude1020 @hornets @greensboroswarm nah but the previous times he was called to the swarm he played a game and came back for hornets practice and then went back to the swarm",
    "292": "@hornets @greensboroswarm JB revenge assignment?\n\nDoesn’t make sense any other way.",
    "293": "@SportsDespair @js3kbullies @hornets @FKNTORO I have yet to be in there with Trezz now, I know it’s bout to be WILD",
    "294": "@CHARLOTTEMAN3 @hornets @greensboroswarm Im sure this means Martin is gonna be back and playing heavy minutes",
    "295": "@jamesbonknight @hornets @greensboroswarm Yep. You’ll see a tweet around 3pm today saying he’s been recalled for tonight’s game",
    "296": "@hornets @greensboroswarm Hornets have a game at 7\nSwarm have a game at 7 \nHe's playing for the Swarm tonight.",
    "297": "@BelkForever @js3kbullies @hornets @FKNTORO 103 is the best section in the house",
    "298": "I guess it’s a good thing I’m the @hornets Beard Guy and not the Panthers one?? #AllFly",
    "299": "RAPTORS GAME PREVIEW\n\n🏀: @Raptors vs. @hornets \n📺: TSN\n🕢: 7 PM/ET\n\nhttps://t.co/3tfDkrM6XJ",
    "300": "@MtnDude1020 @hornets @greensboroswarm are you sure",
    "301": "Who will win tonight’s game @NBA @Raptors @hornets",
    "302": "@xTHEDRAWx @hornets @greensboroswarm Because the swarm and the Hornets have games today. Why send him when there's probably no practice just shoot around?",
    "303": "@justinxdance @hornets @greensboroswarm Ah didn’t see that yesterday, last I heard he was expected to return after the break. Then yea, being game day, seems like a weird move since they are still a bit thin with Martin banged up too.",
    "304": "@BelkForever @hornets @FKNTORO Im pretty sure im on that end tonight. Hornets bench side",
    "305": "@BelkForever @FKNTORO @hornets @EricBerman72 Niceeee🔥🔥🔥",
    "306": "@pashasetoudeh1 @Rhe20k @WashedJaden @hornets @greensboroswarm I think last year was a disappointment if I’m being honest. He isn’t a good coach but this fanbase loves him",
    "307": "@Rhe20k @WashedJaden @hornets @greensboroswarm And that would be ok still. Give it a couple years and he’ll be a fixture in the starting rotation",
    "308": "@hornets @greensboroswarm This organization making me hate them day by day",
    "309": "@js3kbullies @hornets @FKNTORO Section 103, but I’mma try to make my rounds",
    "310": "@pashasetoudeh1 @graycarter2115 @WashedJaden @hornets @greensboroswarm fax a team with this type of talent should be in the playoff bracket",
    "311": "@hornets @greensboroswarm If you was going to use bouk you could’ve kept monk or graham",
    "312": "@YearEightyThree @hornets @greensboroswarm Nah he’s getting some scrimmage time today and he’ll be back in a few hrs before tonight’s game",
    "313": "@BelkForever @hornets @FKNTORO Thats whats up let me know💪",
    "314": "@graycarter2115 @Rhe20k @WashedJaden @hornets @greensboroswarm Hornets would never do this but i think we're at the point where we should look for a new coach. I was cool with Jb being the coach during last year and 19-20 because we were really in a rebuild, but i think now we need a better coach that knows what he's doing.",
    "315": "@hornets @greensboroswarm LaMelo right now https://t.co/87gQO9xqiN",
    "316": "@pashasetoudeh1 @Rhe20k @WashedJaden @hornets @greensboroswarm Oh I agree with you but our coach is so incompetent that he doesn’t realize how bad his rotations are.",
    "317": "@Brxnxo @hornets @greensboroswarm For what?",
    "318": "@MtnDude1020 @WashedJaden @hornets @greensboroswarm Some of the decisions they’ve been making recently make it hard to believe. I’m thinking Cody’s coming back and Bouknight’s minutes are getting cut down again",
    "319": "@hornets @greensboroswarm HERE WE GO MAN",
    "320": "@jamesbonknight @hornets @greensboroswarm He’s going to scrimmage before tonight’s game. Clam down",
    "321": "@graycarter2115 @Rhe20k @WashedJaden @hornets @greensboroswarm Kupchak called hayward our best player lmao, our front office doesnt want to unleash the youth not sure why",
    "322": "@hornets @greensboroswarm Don’t we have a game tonight… and we’re down a few players?",
    "323": "@xTHEDRAWx @hornets @greensboroswarm Hayward isn’t coming back",
    "324": "@chapmamba_ @hornets @greensboroswarm Just cause he doesn’t play a lot his rookie year doesn’t mean there isn’t a spot for him on this team. Patience. Look at the guys who are balling out right now and their years in the league. This kids gonna be special just like Melo. His time will come",
    "325": "@BelkForever @hornets @js3kbullies @EricBerman72 Yessssssir! You’ll be to my right then!!!",
    "326": "@hornets @greensboroswarm yup Borrego gotta go",
    "327": "@chapmamba_ @hornets @greensboroswarm He still gets to play what are you talking about",
    "328": "@MtnDude1020 @Whoalock @qdhaggss10 @hornets @greensboroswarm Also Martin has been way better than Bouk lmao",
    "329": "@TraeFor3 @MeIoWRLD @hornets @greensboroswarm Common hornets W. He gets to scrimmage with the swarm today before he plays tonight",
    "330": "@Whoalock @qdhaggss10 @hornets @greensboroswarm Shows how much they pay attention",
    "331": "@chatsball @DatNiqqaKam @hornets @greensboroswarm Once he gets off his injury he will be signed to a team immediately",
    "332": "@plugyuh @hornets @greensboroswarm Sure it is. Gets him some scrimmage time with the swarm today before the game tonight. He’s a rookie. They can do this an unlimited times this season as they want. Helps with his development",
    "333": "@hornets @greensboroswarm Why is everyone upset? We all know there will be a post in like 3 hours saying he’s been recalled. But either way with Hayward coming back there are less minutes to go around.",
    "334": "@hornets @greensboroswarm Wtf man…",
    "335": "@Rhe20k @WashedJaden @hornets @greensboroswarm Sure they do. Just getting him some scrimmage time today. He should be recalled before the game tonight",
    "336": "@hornets @greensboroswarm FREE JAMES BOUKNIGHT",
    "337": "@hornets @greensboroswarm Getting Malik Monk flashbacks",
    "338": "@hornets @greensboroswarm YOU ARE FUCKING KIDDING",
    "339": "@hornets @greensboroswarm UNSERIOUS TEAM",
    "340": "@hornets @greensboroswarm The is the most ass backwards team I’ve ever seen. https://t.co/5SG8himRfm",
    "341": "@qdhaggss10 @hornets @greensboroswarm Zeller? He been gone",
    "342": "@LetsGoZeller40 @DatNiqqaKam @hornets @greensboroswarm Cody Zeller is not in the league at the moment",
    "343": "@MeIoWRLD @hornets @greensboroswarm Common Hornets L 😹",
    "344": "@Rhe20k @WashedJaden @hornets @greensboroswarm Coach*^",
    "345": "@hornets @greensboroswarm bring gelo then",
    "346": "@hornets @greensboroswarm WHAT THE FUCK????",
    "347": "@hornets @greensboroswarm Why did we draft him then? He's definitely got a lot of talent but if we have no spot for him in the rotation, what is the point?",
    "348": "Today on the Hornets Hive Cast:\n\nThe @hornets resume play after the All Star break. @Rob_Longo and I preview the matchup and dig into the most talked about portions of our interview with GM Mitch Kupchak.\n\nhttps://t.co/OqDLGfQBZi",
    "349": "@hornets @greensboroswarm So you keep Martin on the team and zeller but can’t develop a great draft pick lol",
    "350": "@WashedJaden @hornets @greensboroswarm I’m betting they did this odd him to go practice with them today and he’ll be recalled for the game tonight",
    "351": "@hornets @greensboroswarm BRING GELOOOOOO",
    "352": "@LetsGoZeller40 @hornets @greensboroswarm you’re a cody zeller fan account…",
    "353": "@WashedJaden @hornets @greensboroswarm why are you surprised lol this org dont know what they’re doing",
    "354": "@hornets @greensboroswarm Here come the pissed off melo fans and borrego haters.",
    "355": ".@hornets have assigned James Bouknight to the Swarm. https://t.co/JNLO91emIp",
    "356": "@hornets @greensboroswarm Bruhhhhh this ain’t it",
    "357": "OFFICIAL: We have assigned guard James Bouknight to the @greensboroswarm. \n\n#AllFly https://t.co/f8wfxf37p1",
    "358": "DasHaus made a bet!\n\nEvent: Toronto Raptors vs Charlotte Hornets #NBA\nBet: Charlotte Hornets TO WIN +2.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "359": "DasHaus made a bet!\n\nEvent: Toronto Raptors vs Charlotte Hornets #NBA\nBet: Toronto Raptors TO WIN -2.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "360": "@FKNTORO @hornets @js3kbullies @EricBerman72 If I’m correct we 107 right beside the tunnel 🔥🔥🔥",
    "361": "Non-Appalachian General Discussion • Charlotte Hornets Tickets https://t.co/7gmrDvjdRc - Join the discussion on Appalachian State's Mountaineer Message Board!",
    "362": "@hornets can we pls win.",
    "363": "@BelkForever @hornets @js3kbullies Yesssssir!!! Sec 109 row H seats 1 &amp; 2 that’s where @EricBerman72 and I will be!!! https://t.co/cei4B9hQ88",
    "364": "Looks like I’ll be at the @Hornets game tonight. @js3kbullies it’s time big dawg. I think we sitting down near @FKNTORO too #AllFly",
    "365": "TGIF on @TobaccoRadio \n\n10a: @SportsChannel8 \n2p: #Bleav in Charlotte Hornets\n3p: @TheScoreTRSR with @broadcastbrett LIVE!\n5p: Franchise Players with @JP_Mundy &amp; @RyanStoneSports guest @DaronVaught \n\n💻: https://t.co/axTBLgScxH\n📻: WWBG 1470am (Franchise Players @ 6p) https://t.co/jQRLemwbBd",
    "366": "@QRoyalty91 @Eternity9 LaMelo is an All-Star now and a superstar now.I think that LaMelo is not about to deal with the Hornets stupidity for that long I feel like he's probably going to leave soon if they don't fix this stupidity in Charlotte.",
    "367": "I’m happy to announce that I’m the inaugural recipient of the Rick Bonnell Memorial Scholarship! Thank you to the @hornets and the Bonnell family, for choosing me, it’s an honor. \n\nThank you to @scott_fowler for telling my story and go read it below!\n\nhttps://t.co/wmpQJPpZI8",
    "368": "Toronto Raptors vs. Charlotte Hornets - NBA League 2022\n🔴Live Now➠ https://t.co/K7gkOvttgn\n📅 : 25-Feb-22\n⏰ : 7:00 PM",
    "369": "🏀Toronto Raptors #WeTheNorth vs Charlotte Hornets #AllFly⌚️7PM 🖥Bally Sports SouthEast #NBA75 #NBA https://t.co/CjraxeUASP",
    "370": "@hornets winstreak and 🅿️layoff 🅿️ush starts now",
    "371": "@hornets My guy JT",
    "372": "@DKM_Sports @hornets gotta label him the best player if you want to get good offers in a trade, don't want to diminish his game.",
    "373": "@hornets Jt Thor minutes incoming",
    "374": "Charlotte Hornets star Miles Bridges showing his value – ZellaNews https://t.co/glm4xc3QID",
    "375": "Charlotte Hornets star Miles Bridges showing his value – ZellaNews https://t.co/9uL79zpsNW",
    "376": "@macwfnz I love my @Panthers not so much the @hornets , but I have told you many times , @CharlotteFC  give us the best chance of a parade in uptown.\nPpl that said soccer don't matter? Are those stuck on the 80s, demographics have changed. Get use to it!!\n#forthecrown",
    "377": "Toronto Raptors vs  Charlotte Hornets Prediction 2-25-22 - Free NBA Picks https://t.co/eLzZNzeA1z via @YouTube",
    "378": "Don't forget everyone with the Mask mandate officially ending tomorrow in Charlotte with the Hornets playing tonight Spectrum Center the first 5000 fans in attendance will receive a custom made Hornets mask to wear. #Masks #AllFly",
    "379": "2020-21 Mosaic Lamelo Ball Rookie RC Variation #202 Charlotte Hornets - https://t.co/MuQS84XNDY\n\n#lebron #lebronjames #lakers #nba \nhttps://t.co/ctMvYnOwUX",
    "380": "@hornets Coming tonight for my birthday!!!",
    "381": "@hornets Please win i can't bear it anymore",
    "382": "Happy birthday to Vernon Carey jr of the Charlotte hornets son of Vernon Carey #vernoncareyjr #vernonacareyjr #charlottehornets #washingtonwizards https://t.co/oRGCePKaJa",
    "383": "@macwfnz @TBoneWFNZ\n1. Panthers\n2. Hornets\n3. 49ner football\n4. Knights\n5. Ardrey Kell girls basketball\n6. Grandma's pickleball game\n\n99. Charlotte FC (soccer :(",
    "384": "@HornetsPR @hornets Hayward has replaced Zeller and Kidd-Gilchrist as the Hornets representative on the All Injured team.",
    "385": "We missed you Buzz City 🥲 Let’s get to it!\n\n#AllFly https://t.co/MdLm0px5g9",
    "386": "Hornets' LaMelo Ball Launches Esports Brand 'MB1 Gaming' with One Up #Charlotte #Hornets #NBA https://t.co/hXnsZfCz1k",
    "387": "@macwfnz @TBoneWFNZ 1st- Hornets; 2nd - Charlotte FC and in a distant 3rd - Panthers. Having said all that I love all of Charlotte’s pro sports teams and a fan for life! #757ForTheCrown!",
    "388": "@MVPnuby @hornets He def be snapping",
    "389": "@MacAttackWFNZ @macwfnz @TBoneWFNZ Hope for professional Charlotte sports teams\n1. Charlotte Hornets \n2. Charlotte FC\n3. Charlotte Knights\n4. Charlotte Checkers\n5. RUTGERS \n6. Carolina Panthers",
    "390": "This is freakin’ awesome. Congrats on everything Noah. Kudos to everyone at @theobserver and @hornets for honoring such a great legacy. https://t.co/Xb2aFLtuIA",
    "391": "#AtThePolls Over/Under 10.5 wins for @hornets over their final 22 games this season? #AllFly",
    "392": "“Brodie a real nigga he took the charge.. Shane Battier” \n\n@hornets sign this man to the max https://t.co/Sn5xtDusPm https://t.co/h4KwKL7cgE",
    "393": "Toronto #Raptors vs. Charlotte #Hornets | 2/25|22 | NBA Free Picks and Predictions | NBA Betting tips. \n\nWatch: https://t.co/eM66oLmOms\n\n#NBA #NBAPick #NBAPredictions #raptorsvshornets",
    "394": "@antjams @DKM_Sports @hornets 100% Terry lucky for us is still worth something Gordon isn't worth the bench he's sitting on anymore",
    "395": "@hornets big crew in section 226 tonight. @mcginnis45 childhood dream was to get a picture with the Hornet. Make it happen. @HornetsPR",
    "396": "▶️▶️https://t.co/WB3mDXBjWh◀️◀️\nUpcoming #NBA live streams:\n#CharlotteHornets vs #TorontoRaptors\nand many more coming today https://t.co/8OTj5AYCn1",
    "397": "@Walty25105602 @hornets @MELOD1P @Kia Gordon Hayward in year 12 now. He only avg 20 points once in his career and been a alstar once. Also, he hasn't played a full season in a few years. 🤔",
    "398": "@TDChannel1 The @MapleLeafs beat the @mnwild 3-1 last night and @AM34 is now the leading goal scorer in the @NHL with 36 goals.\n\nThe @Raptors are in Charlotte to take on the @hornets tonight at 7PM.\n\n#TDCPressBox https://t.co/OITyGSJKF6",
    "399": "Toronto Raptors vs Charlotte Hornets: Injury Report, Predicted Lineups and Starting 5s – February 25th, 2022 https://t.co/FXtm6N5v65",
    "400": "/r/CharlotteHornets: Early Draft Prospect: Mark Williams #AllFly https://t.co/kpAqnf9uvf",
    "401": "@DKM_Sports @hornets Cus he was hurt, like always",
    "402": "Friday's #NBA75 #BettingPicks from \n@SpreadAstaire\n\n🏀Toronto Raptors vs. Charlotte Hornets: Banker at -110 (1.91)\n\n+Parlay at +265 (3.65)\n👇👇👇\nhttps://t.co/DAQuUMN64g",
    "403": "@Walty25105602 @hornets @MELOD1P @Kia He isnt",
    "404": "Coming up: Panthers/Watson news, Charlotte FC regular season debut, Hornets back tonight, Coach K as a radio caller, and Mac is upset with phone snobs \n\n820: @JessTalksFootie \n9: @PFF_Mike",
    "405": "Miles Bridges Charlotte Hornets player hoodie, always love the Hornets colours! https://t.co/8nml79FjDZ",
    "406": "/r/CharlotteHornets: Charlotte Hornets vs Toronto Raptors [2/25/22 - 7:00 PM ET] #AllFly https://t.co/DgMI9gme4H",
    "407": "Toronto Raptors vs Charlotte Hornets: Injury Report, Predicted Lineups and Starting 5s - February 25th, 2022 | NBA Season 2021-22\nhttps://t.co/OLNoOZHcd8",
    "408": "@Embiid_prodzz Contract the league too many wretched teams as is, 5 teams have 20 or fewer wins, outside of North Carolina, who can name 3 players on the charlotte team are they the bobcats, the hornets, does anyone really care",
    "409": "⭐️FREE #livestream here👉https://t.co/2c6Ltzn7d4 😉\n——\n🏀#NBA ‼️\n1.Indiana Pacers Vs Oklahoma City Thunder\n2.Charlotte Hornets Vs Toronto Raptors\n3.Orlando Magic Vs Houston Rockets\n4.Washington Wizards Vs San Antonio Spurs\n5. New York Knicks Vs Miami Heat ... https://t.co/ikmhsU3TXR",
    "410": "@SP_FreePicks @PointsBetUSA @Rjeff24 No, the current Pelicans existed in Charlotte. I'm not going along with this BS from the NBA that tries to pretend the Hornets disappeared for two years and came back with a new nickname while another team played with their name. The retcon doesn't work.",
    "411": "#Charlotte #Hornets: From 1 to @rozier, how hyped are you for #Hornets #Basketball tomorrow?! ... \n \nhttps://t.co/ncGusoiTrM\n \n#CharlotteHornets #NationalBasketballAssociation #NBA #NBAEasternConference #NBAEasternConferenceSoutheastDivision #NorthCarolina https://t.co/WLBHMYaAGr",
    "412": "New post (Toronto Raptors vs Charlotte Hornets NBA Pick – February 25) has been published on The Sports Geek - https://t.co/lwRlVivBsA https://t.co/fGKxc5Yvxp",
    "413": "@s24taofeek @kingveteran78 Charlotte is near one million people when I was born in 1979 it had 300,000 people. The city is around 40% Black meaning it should be around 400,000 Black I can guarantee near all love Lamelo Ball if they are Hornets fans or not. Wanting him to play in the city.",
    "414": "#latestnews RAPTOR NATION WAKE UP AFTER 9 LONG DAYS OUR BELOVED TORONTO RAPTORS ARE BACK TONIGHT AGAINST THE CHARLOTTE HORNETS!!!!! - https://t.co/ccyPpmmEAW (POST_EXCERPT}",
    "415": "Charlotte Hornets basketball is back in my life today https://t.co/p4AyFrvEwV",
    "416": "Quick Six: Aaron Rodgers’ next move, how will the Hornets do, and Tom Brady’s movie - Fox 46 Charlotte https://t.co/s9lhM5hSr8",
    "417": "@s24taofeek @kingveteran78 Jordan only had the team since 2010 but yes people in Charlotte are tired of both the Hornets and Panthers not winning championships. Sadly North Carolina only professional championships and finals have come from the NHL Carolina Hurricanes in the NC capitol of Raleigh.",
    "418": "@Eternity9 @hornets @MELOD1P Preach he needs to resign yesterday",
    "419": "Day 25 tweeting the @hornets to #BringBackTheCats court and uni combo for just one night. This man unfortunately didn’t get to wear the original unis or the pinstripes but he is either 1A or 1B in bobcats history so we make an exception https://t.co/15Jzwy6i4z",
    "420": "@0255fore The Charlotte Hornets are 0-8-1 ATS in L8 home games. Maybe due… 👀😅 https://t.co/Gks7w6IWiW",
    "421": "@shendy456 @If33lprettygood @rsandns I know that, and traded on thesame night to the Bulls, that's why we don't call Kobe the greatest Charlotte hornet. He didn't even get to take a picture holding the sonics Jersey.",
    "422": "IF THE BIG THREE LEAVES IM LEAVING TOO. BEST FUCKIN TRIO SINCE INCEPTION AND GORDON IS OUR BEST PLAYER?! THE WASHED ONE?! NUMBERS DONT LIE!! UGH OUR PERSONNEL ITS HORRIBLE!!!! @hornets I been saying it. HIGH YER ME IM SICK OF IT https://t.co/4Du2W0UqVl",
    "423": "Tonight @Raptors vs @hornets #NBA75",
    "424": "2.25.22\nHouston #Rockets vs Orlando #Magic\nOklahoma City #Thunder vs Indiana #Pacers\nToronto #Raptors vs Charlotte #Hornets\n\nToday's #NBAPredictions: https://t.co/hltNwEZVnD\nBet on Basketball: https://t.co/ArbfnziqHj\n#Draftkings #Fanduel #sportsbook #BetMGM #WilliamHillUS https://t.co/XzRrzorbFv",
    "425": "@VGK_Watch @NHLJackManning @shi_fs @TheodoreTooth I get it. The 1990’s Charlotte Hornets jerseys were perfect. The LJ/Zo/Muggsy years. https://t.co/64rfl1zyGk",
    "426": "@antjams @QRoyalty91 @hornets Facts 💯💯💯💯",
    "427": "@hornets I think we need a back up point guard! https://t.co/nL9pQNBdZy",
    "428": "@DKM_Sports @hornets reSPECK",
    "429": "the hawks getting eliminated by the hornets in charlotte is gonna be the end of my sanity",
    "430": "Please sign Dwayne Bacon, so we can get them two on tracks again @hornets https://t.co/naUvnov3fW",
    "431": "@Northofhades @macwfnz The Charlotte Hornets went 20-62 in their first season in Charlotte! It’s a journey! Come On! ⚽️",
    "432": "@T_Rozzay3 @hornets Terry…where can I find these shoes???\nI’ve had zero luck and I’ve been looking for months https://t.co/hgZpKl9CV2",
    "433": ".@Raptors @hornets I expect the same from you guys https://t.co/PwMZTNByFS",
    "434": "Heading to Greensboro tomorrow. @greensboroswarm @hornets https://t.co/8K5KyFRN55",
    "435": "@s24taofeek @hornets @MELOD1P @Kia Sell him for dirt cheap 🤣🤣",
    "436": "@SO_FightClub @celtics @hornets I’d argue that Boston has only just started playing this well in recent weeks, whereas the Hornets have been fun to watch all year. Edge going to Boston due to the sudden change and win streak, makes it a more fun watch. I’m also probably biased so who cares lol",
    "437": "Kawhi to Charlotte? #KawhiNot @hornets https://t.co/K0SzIHRBJc",
    "438": "@Kryynt @celtics @hornets Yes they’re playing great defense and the ball movement on the offensive end is beautiful tonight but the @hornets are exciting to watch day in and day out on both sides of the ball.",
    "439": "@SO_FightClub @celtics @hornets Hornets are up there too. But I don’t think anyone is playing better defense than Celtics rn. Plus the offensive ball movement and shot making. It’s great basketball",
    "440": "Very clearly a huge @celtics fan here, but the most fun team to watch is the @hornets. https://t.co/fTrxBsZBGh",
    "441": "@DYSF_BYRD @WC_Lions_Sports @hornets Fire",
    "442": "As we continue to celebrate #BlackHistoryMonth, @jalenmcdaniels5 gives a brief lesson on Rosenwald Schools in Mecklenburg County.\n\n@BlueCrossNC | #AllFly https://t.co/dLV6gR4ePR",
    "443": "@_dan92__ @hornets @MELOD1P @Kia He tryna make a quick buck 🤣🤣🤣",
    "444": "@s24taofeek @hornets @MELOD1P @Kia Mf only saying that to sell him 🤣🤣🤣🤣 wake up !!!",
    "445": "@hornets @MELOD1P @Kia I hope mitch is simply trying to boost gordon's trade value with that statement",
    "446": "We need jj redick to get on the charlotte hornets ass",
    "447": "@camtheman30 @CrownClubCLT I been waiting since 1988 for Charlotte to win it first championship the Hornets and Panthers sadly have failed to do so. So forgive me if I am not excited about Kemba coming back is he going to be a extra piece that gets us to a championship screw the nostalgia bs.",
    "448": "@nofac3perc The hornets play in Charlotte, North carolina 😂",
    "449": "@Walty25105602 @hornets @MELOD1P @Kia once upon a time......he's a has been now",
    "450": "Tomorrows slate (2/25):\n\nToronto Raptors -2 (-110) vs Charlotte Hornets\n\n#GamblingTwiitter #NBA",
    "451": "@Farbod_E Could you imagine Kawhi Leonard with Charlotte Hornets",
    "452": "BROADCAST SCHEDULE 2-5-22\nhttps://t.co/eNu5i2pjH3\n\n6am WOHS &amp; WCSL - Carolina Cruise\n8am WAGY - Pat Nanney\n9am WCSL - Milton Baker’s Mornings\n10am WCSL - America’s Tailgate Party\n1pm WOHS - Fessa Hook\n1pm WCSL - ZMAX  Country Classics\n7pm WOHS - Toronto @ Charlotte Hornets https://t.co/lw9j1aKeFD",
    "453": "@DKM_Sports @hornets Thank the dude Mitch Kupchak is a 🤡 it’s almost laughable. 1st you over pay for bum and nobody repeat was going to give him that type of money . Now your trying to say he’s your best player that’s a insult to those 3 players .",
    "454": "Going to Charlotte tomorrow to see my Hornets family, makes my heart happy ♥️♥️ can’t wait!",
    "455": "@bartranbluflame @hornetsdip @hornets The two highest scoring average and total players are Miles and LaMelo. Meanwhile, they have 55 million+ tied up in Gordon and Terry.",
    "456": "Never have to watch the Charlotte Hornets play basketball again AND I get money?????? Wow https://t.co/RXqwV4L6JY",
    "457": "@Zsaheem856 @DMGrubb Though technically the Hornet's team history and records from the 80s to 2002 are a part of the team in Charlotte today and NOLA's team records start in 2002. It's weird lol",
    "458": "@Zsaheem856 @DMGrubb Nah bro, the team that's in NOLA used to the original Charlotte Hornets from the 80s that moved to NOLA on 2002. Then in 2004 the NBA created the Charlotte Bobcats who changed their name to the Hornets after NOLA changed to the Pels in 2014.",
    "459": "@AVKingJames @warneagle Fair\nAlthough now I’m thinking about how the current hornets look would be but with Charlotte across the front instead of hornets",
    "460": "@STAAtalent @hornets The Hornets are privileged to have 2 outstanding pbp announcers doing TV and radio. Good guys both when I have worked with them in SoCal.",
    "461": "@Zsaheem856 @Jer_de_Bear @DMGrubb Uh yeah you wrong…Benson bought the Hornets and changed the name to Pelicans. Charlotte then got the Hornets name back and changed the Bobcats back to Hornets. Team never left. Good try tho",
    "462": "@Jer_de_Bear @DMGrubb They got Disneyland. Lol. And what u mean who else left. The hornets is in Charlotte ain’t they? Correct me if I’m wrong. Before the pels came y’all didn’t have no team for a year? But bro. Orlando should probably move too. But they don’t have Zion. So who cares. Lol.",
    "463": "@r1_traffik @MilesBridges @T_Rozzay3 @hornets lamelo ain’t goin nowhere for the next 5 years at the least. rookies at a minimum stay 7 years mainly because of just how nba contracts work.",
    "464": ".@KelliBartik dropped by the @ClubhouseKB with @KyleBaileyClub today as she looked at the sports scene in Charlotte from the @hornets recent struggles, to the upcoming debut of @CharlotteFC and more.\n\nListen Here: https://t.co/FC3I5huuDa",
    "465": "Not only did Donovan Mitchell miss the All-Star game, he missed his opportunity to meet Michael Jordan. \n\nAnd, it's not the first time it's happened. \n\nMJ was supposed to be Mitchell's boss with the Charlotte Hornets.\n\nHe told the story here. \n\n#TakeNote \n\nhttps://t.co/Gk6BGiWak7",
    "466": "Lmfaoo why this shit go @hornets https://t.co/BZmE2gyONF",
    "467": "@DKM_Sports @hornets Probably sitting in the lover room with ice packs.",
    "468": "But he’ll bring you a title tho? I think the Sac Kings, Charlotte Hornets of the world would kill for one glory season https://t.co/QomqB99gHe",
    "469": "@hornets @T_Rozzay3 Terry wildin'",
    "470": "When we talk about bringing NBA energy to your broadcasts. This is what we mean. \n\n#InTheBooth with Eric Collins on @hornets broadcasts. \nhttps://t.co/Lp3M3L0Wxi"
}