{
    "0": "Lou King is in Sacramento and on the active roster tonight.",
    "1": "(Fox's) biggest asset is speed (literally his only + attribute) 🙄\n\nGotta hide your \"best player\" is a garbage can somehow huh coach @AlvinGentry 🤷‍♂️\n\nI feel it though 💯🚮🗑 \n\n@mmcnair @SacramentoKings https://t.co/N3X4rXld3x",
    "2": "Game time! Let's go @SacramentoKings https://t.co/kDm8B6K0Hs",
    "3": "#NBA #NBATwitter Today's Lineups\n\n#RipCity\nPortland Trail Blazers Starting 5:\nDamian Lillard\nC.J. McCollum\nNorman Powell\nRobert Covington\nJusuf Nurkic\n\n#SacramentoProud\nSacramento Kings Starting 5:\nDe’Aaron Fox\nTyrese Haliburton\nHarrison Barnes\nMaurice Harkless\nAlex Len",
    "4": "@Brendan90417153 @SacramentoKings @TyHaliburton22 @dameology @MichelobULTRA Vouch",
    "5": "@sabonisSZN11 @Brendan90417153 @SacramentoKings @TyHaliburton22 @dameology @MichelobULTRA Vouch",
    "6": "@Brendan90417153 @SacramentoKings @TyHaliburton22 @dameology @MichelobULTRA Vouch",
    "7": "@Brendan90417153 @SacramentoKings @TyHaliburton22 @dameology @MichelobULTRA Vouch",
    "8": "Gonna try to enjoy my Sacramento kings tonight will we win? Prolly not but Ima ride this ship till I can’t anymore",
    "9": "@SacramentoKings @TyHaliburton22 @dameology @MichelobULTRA Can I get a FB tho??",
    "10": "Assista NBA Sacramento Kings x Portland Trail Blazers ao vivo\n\nLink:https://t.co/UylJvmxYCH https://t.co/Hm2IMridDh",
    "11": "The @SacramentoKings starting Fox, Haliburton, Barnes, Harkless, Len on Wednesday. #SacramentoProud #NBA",
    "12": "@SacramentoKings people gripping about Fox only having 2 assists last game.   A shot has to be made after you pass it to them to get an assist. How many times did Fox pass to Buddy and Barnes last game and they missed the shot! It's like you didn't watch just looked at box score",
    "13": "@JAYMKTG @nbatopshot #TopShotThanksgiving I'm thankful for the @SacramentoKings &amp; humanitarian @hbarnes. Certified Baller and community advocate. #SacramentoProud",
    "14": "Its timeeee! What’s better on Thanksgiving eve than a late night disgusting poop play in Sacramento? Sac on a L4 and blazers look good on a W4 of their own. Go kings +3.5 or 4. I found 4. Gooo Home poop dogs! @FadeUsports @Joe_Knows___ @_TurtleSports @BigNellyBuckets 💩💩 https://t.co/FDFkZOIC4I",
    "15": "NBA Live Scores: HOU v CHI 68-73 4:57mins rem in 3Q (HOU takes back some of the difference)... OKC v UTA 66-67 6:16mins rem in 3Q (UTA gains the advantage, tight game)... Game open! Follow to get updates as SAC hosts POR.  @SacramentoKings @trailblazers #NBA",
    "16": "Sacramento Kings Starters:\n\nDe'Aaron Fox\nTyrese Haliburton\nHarrison Barnes\nMaurice Harkless\nAlex Len\n\nPlayers out:\nRichaun Holmes\n#SacramentoProud #NBA #NBATwitter #NBA75",
    "17": "Know how I’m gearing up for tonight’s @SacramentoKings game? By getting in that workout in",
    "18": "@AlexKennedyNBA @nbatopshot I’m thankful for Robert Horry for teaching me to have low expectations as a @SacramentoKings fan over the past 20 years. It still hurts. But I love the game. \n\nhttps://t.co/XSlQvWMgs9 https://t.co/yZ99JdQW8R",
    "19": "@tyleraellis_ Sounds like Sacramento kings Twitter",
    "20": "Showing Thanks for our @SacramentoKings family. Happy Thanksgiving to all Kings staff and fans! 💜 #SacramentoProud \n@NBCSKings https://t.co/SJG718YmPv",
    "21": "@nicoleloscavio @SacramentoKings @socios Your all wrong all these dishes except Brussels sprouts are at there best when they play together similar to our kings",
    "22": "@AlexKennedyNBA @nbatopshot #TopShotThanksgiving \nI am thankful that @CarmichaelDave helped saved the @SacramentoKings to keep them #SacramentoProud \nTS = ChewieWoolf",
    "23": "@SacramentoKings 1 win , is all it takes to break the monotony , stop the bleeding , and get this thing turned around . 1 win .",
    "24": "@trailblazers @SacramentoKings @RipCityRadio620 I'm here 🇳🇬🇳🇬",
    "25": "Last season the Kings tied the NBA record for consecutive seasons missing the playoffs, with the Clippers from 77-92\n\nNo one ever mentions is that the Clippers moved from San Diego to LA in 1984, plus LA has the Lakers.\n\nNo city has been tortured for 15 years like Sacramento has.",
    "26": "@robot_sheed @trailblazers @SacramentoKings @RipCityRadio620 If you have xfinity it’s on channel 1253",
    "27": "@SacramentoKings @TyHaliburton22 @ankr Nice",
    "28": "@blumenfeld Count your blessings every day that you are not a Sacramento kings fan.",
    "29": "@trailblazers @SacramentoKings @RipCityRadio620 Can’t watch because root sports is wack. #RipShitty",
    "30": "@AlexKennedyNBA @nbatopshot I’m thankful the @SacramentoKings are still in Sacramento. TS: GMEhold4ever #TopShotThanksgiving",
    "31": "As a @SacramentoKings fan, I'm thankful to have @TyHaliburton22, @hbarnes and @Rich_Holmes22 actively participating in @nbatopshot . Can't wait for TS moment autograph utility one day in the future. #SacramentoProud #TopShotThanksgiving \nTS: Klasik916 https://t.co/s5ROYI2exJ",
    "32": "@AlexKennedyNBA @nbatopshot @SacramentoKings will make the playoffs. Username: DeAaronDang #TopShotThanksgiving",
    "33": "Today's NBA Picks: 10:10 PM ET - Portland Trail Blazers vs. Sacramento Kings - 21 PICKS AVAILABLE: https://t.co/2TvvTsjJaA #nba",
    "34": "@trailblazers @SacramentoKings @RipCityRadio620 Lets get business done 💪",
    "35": "@trailblazers @SacramentoKings @RipCityRadio620 It’s time to get revenge on Sacramento",
    "36": "Tonight is the start of the winning streak!  Let’s gooooooo! @SacramentoKings",
    "37": "I’m thankful for the Sacramento kings finally getting rid of coach Walton 💯 https://t.co/ommNeGXxgs",
    "38": "The Sacramento Kings SUCK! https://t.co/as6MiBDexE via @YouTube",
    "39": "@SacramentoKings time to forget the last 3 weeks , just play . Basketball is fun , and the kings should have fun out there.",
    "40": "@KyleAMadson @bw3052 @ChelseaFC @SacramentoKings Steph Curry is just Peja with a fade.",
    "41": "@AndrewM71072397 knowing the Kings it'll still be Alex Len or Tristan Thompson..  but Bagley is officially the Sacramento Chris Boucher if he doesn't get a minutes boost now.  New coach and no Holmes...",
    "42": "@coffey1962 @SacramentoKings @Vivek @GrantNapearshow if he does rehire Grant I will be relieved.  Because as it stands now, I never know who is going to have the ball to start the 4th quarter. Therefore - I don't remember that play. Constant state of anxiety.  Basically my whole experience is wrecked without Grant Napear.",
    "43": "@howiehowieee @SacramentoKings @SociosHoops LMAO",
    "44": "@AyePseudonym_ @SacramentoKings You my agent 🤣🤣🤣",
    "45": "\"[Woj] Hassan Whiteside has signed a one year deal with the Sacramento Kings.\"\n\nhttps://t.co/GA87NzBDCj\n\n[via r/heat Nov 25, 2020 #Heat]",
    "46": "\"[Wojnarowski] The Sacramento Kings have declined to match the Atlanta Hawks’ four-year, …\"\n\nhttps://t.co/yEgk5M8E02\n\n[via r/nba Nov 25, 2020 #NBA]",
    "47": "@Jason_Wise @SacramentoKings @socios Probably true",
    "48": "@nicoleloscavio @SacramentoKings @socios Never mattered. Mashed potatoes beats all",
    "49": "@coffey1962 @SacramentoKings @Vivek @GrantNapearshow Hey @GrantNapearshow I got an idea instead of liking these tweets have His Dad on your show and Hash it out and build up instead of suing",
    "50": "@SacramentoKings @SociosHoops Hoodie, it's cold at night in Sac Town.....",
    "51": "Love seeing Lakers fans say they hate watching their team while I have to watch the Sacramento Kings every other night",
    "52": "@coffey1962 @SacramentoKings @Vivek @GrantNapearshow Grant didn’t say that tho. He didn’t explain himself in such a passionate manner he said it to Boogie and got what he deserved",
    "53": "@JackieChristie @VH1 @BasketballWives @SacramentoKings @NBA Sacramento shows up and shows out! Thank you and Blessings!",
    "54": "Sacramento Kings tickets be so expensive 😒",
    "55": "@nicoleloscavio @SacramentoKings @socios Great sponsorship integration",
    "56": "Fed up with the Sacramento Kings? Go check out Sacramento State and UC Davis teams https://t.co/YrqixOm530",
    "57": "@SacramentoKings All lives matter b&amp;tches",
    "58": "@nicoleloscavio @SacramentoKings @socios Way to get that partner added value! Also, mashed potatoes and it's not even close.",
    "59": "The @SacramentoKings partnerships thanksgiving bracket has all come down to this… mashed potatoes vs rolls for the 👑. \n\nMoral of the story: we 💜 carbs. \n\nPresented by @socios, obviously! https://t.co/SuC1pjVxye",
    "60": "Game 19 of the Sacramento Kings baby!!! https://t.co/6sC2aYrZqP",
    "61": "@sackingscov @SacramentoKings Yeah it is 100%",
    "62": "@ChrisBiderman @bw3052 @ChelseaFC @SacramentoKings Widely known big Kings guy. Excited for you to unleash your Pooh Jeter takes on the pod tonight.",
    "63": "@bw3052 @KyleAMadson @ChelseaFC @SacramentoKings News to me.",
    "64": "Can we not lose tonight? thanks in advance @SacramentoKings",
    "65": "@JerseyMike__ @mnwildPR The Detroit Lions, Sacramento Kings, and unfortunately the Minnesota Timberwolves would like a word about worst run organization.",
    "66": "@breyyyattt @scharpling On a side note, some rich drunkard hurled all over the court at the Sacramento Kings game the other day. The sweat mop guy approached then reversed course and was like that’s not my job. Rudy Gobert said the man smiling and puking simultaneously \nhttps://t.co/H1lbi7ezGe",
    "67": "@BleacherReport not giving the Sacramento Kings much love \n\nWe can only go UP! #SacramentoProud https://t.co/VcmbFvfqIE",
    "68": "Gerry was so devastated by this he could not be bothered to look up the name of the play by play guy for the Sacramento kings https://t.co/aek5R1QSzB",
    "69": "@SacramentoKings I believe you can dominate!! We’ve all seen it happen before!! Flip that gamer switch and make Doug Christie proud!!!",
    "70": "@BSWest5 \"and with the 8th pick in the 2022 NBA Draft, the Sacramento Kings select, Jaden Hardy\"",
    "71": "Thank you @coachTaylorsac and the best Athletic Director/General Manager in the USA: @OrrMarkC for turning the @SacHornetsFB franchise around. This is the team that makes @TheCityofSac @SacCountyCA and the @SACOG Region proud. Tell your turnaround story to the @SacramentoKings.🤝 https://t.co/PkdI6chbA7",
    "72": "Back SACRAMENTO KINGS to BEAT Portland Trail Blazers tonight in the @NBA (Game Starts at 03.10 GMT) #NBA #Basketball",
    "73": "@SacramentoKings @SociosHoops hoodie",
    "74": "No im not going to a game tonight but I felt like rocking m new #cityedition jersey for the @sacramentokings 🔥 #ceromiedo #sacramentoproud https://t.co/Ye6PqxCW7U",
    "75": "@KOT4Q what’s good Kenny. Just a fellow Sacramento Kings fan",
    "76": "@SacramentoKings @SociosHoops it’s crew sorry",
    "77": "@TimmyTwoShirts The Sacramento Kings lack leadership from the owners down making them have the longest playoff drought in the nba, 15 years",
    "78": "If you are selling upper level Sacramento Kings tickets for tonight’s game Vs Portland Trailblazers please DM me!",
    "79": "@Nikedyer @ShellenbergerMD @GrantNapearshow As a King's fan, we once had a hall of Fame broadcaster who devoted his life to Sacramento. He raised hundreds of thousands if not millions of dollars to put minorities through college via the Future Foundation. This man's reputation was destroyed by three meaningless words.",
    "80": "2-2 last night.. fuck that. Got 7 locks tonight. All guarantees.\n\nSacramento Kings ML\nNY Rangers ML\nNJ Devils ML\nBoston Celtics ML\nTimberwolves ML\nWizards -4\nWashington caps ML\n\nLock that shit in. Trust.\n\n- The Locksmith 🔒",
    "81": "@StevyFBaby @SacramentoKings Is it reliable?",
    "82": "@sackingscov @SacramentoKings Gametime. I just use safari from my phone tho.",
    "83": "@SacramentoKings @SociosHoops Do they wear grown up clothes or gonna stick with the high school motif?",
    "84": "@Breaking911 @GrantNapearshow @SacramentoKings @Sports1140KHTK your thoughts?",
    "85": "@SacramentoKings @SociosHoops Why ask? Vivek will do what he wants.",
    "86": "@StevyFBaby @SacramentoKings What app is this?",
    "87": "@SacramentoKings @SociosHoops Team Hoodie for sure",
    "88": "@sacramentokings your upper management and leadership sucks. This city deserves better #Kings #Sacramento\n\nI will be at the game tonight",
    "89": "@Blk_Guerrero @SacramentoKings Good idea lol they are in the main team store",
    "90": "@SacramentoKings @SociosHoops Cut Harkless and Woodard ASAP",
    "91": "@SacramentoKings @SociosHoops Crew",
    "92": "♠️ Happy Holidays!  From our family to yours! \n\n🤍🤍🤍\nSacramento #boysandgirlsclub \n#InfiniteloveFoundation &amp; #ChristiesbridgetoKids #sacproud\n@vh1 @basketballwives #bbwla @sacramentokings @nba #dougchristie https://t.co/SpikDInXO2",
    "93": "@Blk_Guerrero @SacramentoKings They are also on the team store website",
    "94": "@Blk_Guerrero @SacramentoKings Yes, I saw them at the arena on Monday",
    "95": "If the Sacramento Kings could get two wings they might be able to fly",
    "96": "@ryan_merical @JillAdge You can’t tell the story without KJ and his prominent role in the fight to keep the Kings in Sacramento.",
    "97": "@JoshEberley Past Sacramento Kings GM’s/Front Office",
    "98": "@ScottJHulsey @JillAdge Down in the Valley is mostly focused on how KJ led the fight to keep the Kings in Sacramento along with some historical context of himself and on the team. Has very little to do with the fans and the community.",
    "99": "@SacramentoKings @SociosHoops How about Team Win A Game This Month?",
    "100": "@SacramentoKings @SociosHoops Team win a basketball game",
    "101": "@SacramentoKings @SociosHoops Win a game",
    "102": "@SacramentoKings @SociosHoops Team make a damn bucket",
    "103": "@SacramentoKings @SociosHoops Hoodie easily",
    "104": "@SacramentoKings @SociosHoops Not sure about team hoodie or team crewneck but I do know this entire teams sucks. Blow it up... start over. Also Kings Twitter is a disgrace.",
    "105": "@SacramentoKings are the city edition shorts in the team store yet?",
    "106": "@SacramentoKings @SociosHoops Team get your shit together and win ball game",
    "107": "The Philadelphia 76ers praise Andre Drummond for his big performance in a win over the Sacramento Kings.  https://t.co/N45u8wAWRK",
    "108": "@SacramentoKings @SociosHoops Hoodie",
    "109": "@SacramentoKings @RealTristan13 @ankr Kings best player",
    "110": "Scottie explaining to British people who know nothing about the NBA what it’s like for me as a Sacramento Kings fan:\n\n“It’s like she’s supporting Arsenal.”",
    "111": "@7bjoy7 @StocktonKings @SacramentoKings @mmcnair He was 3 of 17 in this game…",
    "112": "I live in Sacramento in every single kings fan i know hate buddy Hield and would trade him for lays chips, yet laker fans foaming out the mouth for his weak ass 🤦🏾‍♂️",
    "113": "@damienbarling @IamKDiddy Thank you for having me on the @DLoAndKC Show on @ESPN1320, and having the conversation on where the @SacramentoKings have to look to, to turn their franchise around. @OrrMarkC &amp; @coachTaylorsac are the local/regional example of that. #ExperienceElevated",
    "114": "23 NOV A vs @SacramentoKings \n\n11 PTS\n2 REB\n6 AST\n2 STL",
    "115": "@SacramentoKings @RealTristan13 @ankr All time low when all we have is the kings, promoting a wallpaper of a guy, that is probably in his last season in the NBA. Fire @Vivek. @NBA get this terrible owner out!",
    "116": "@ankr @ethereum @avalancheavax @BinanceChain @solana @FantomFDN @0xPolygon Think your ticker is broken. Signed with @SacramentoKings did nothing for price action. Patience you say while we are in a BULL MARKET &amp; @ankr just shits the bed daily is fucking tiring.  Can't un-stake as this DOWN from 6 months ago.  Said no other crypto.",
    "117": "My #NBA Picks For 11/23/21:\n\nPortland #TrailBlazers @ Sacramento #Kings - Over 225 (-110)\n\nMy Current ‘21-‘22 NBA Season Record: (23-13-1)\n\n#SportsBetting #GamblingTwitter #FreePicks #DraftKings  #BettingTwitter #sports #NBATwitter  #Tipster #Sports",
    "118": "The play by play guy for the Sacramento Kings got fired for saying. \"All lives matter.\" https://t.co/FN8DozSD6K",
    "119": "Trail Blazers Game Notes: Portland Trail Blazers (10-8) vs. Sacramento Kings (6-12) https://t.co/IUdVCQKcvK https://t.co/s0TXjOQcNM",
    "120": "Join us on the @kfbk Afternoon News at 5:17 and 6:47 today when iHeart Media Sports Guy @billherenda talks the latest @SacramentoKings coaching change! https://t.co/vw6BV7dUM8",
    "121": "@SacramentoKings @RealTristan13 @ankr sweet just what i was looking for huge fan of @RealTristan13 🔥 https://t.co/3pPtz9Ml1M",
    "122": "@SacramentoKings @RealTristan13 @ankr That’s 🔥🔥🔥",
    "123": "Can Alvin Gentry save season for Sacramento Kings? Doc Rivers thinks he can ‘fix things’ https://t.co/uhv2eLfIfF",
    "124": "Can Alvin Gentry save season for Sacramento Kings? Doc Rivers thinks he can ‘fix things’ https://t.co/vyvv9TXK2q",
    "125": "Mr Triple Double. The heart and soul of the Cincinnati Royals. That franchise was never the same after he was traded (and they still aren’t as the Sacramento Kings). https://t.co/Y0n9enb1Ad",
    "126": "@thekapman @kapjhood @ESPN1000 That goes to the Lions. Or maybe Sacramento Kings.",
    "127": "@damienbarling @IamKDiddy @James_HamNBA Things need to change within the @SacramentoKings organization. They need to look no further than @hornetsports Athletics Director @OrrMarkC and his hiring of @coachTaylorsac. He has turned @SacHornetsFB around. How he did it is the answer.",
    "128": "Portland Trail Blazers visits Sacramento Kings Predictions and Preview for 11/24/2021 today.  Who are we taking in this game?  Find out now. #Sportsbook #SportsBetting https://t.co/kxmZsyjuZf",
    "129": "Watch the @trailblazers take on the Sacramento Kings tonight at 6:30 PM PT on ROOT SPORTS Plus! #RipCity \n\nFind ROOT SPORTS Plus ➡️ https://t.co/BKOBbvUK0S https://t.co/eEp8SpTHY4",
    "130": "𝗚𝗔𝗠𝗘𝗗𝗔𝗬\n🏀 » Portland Trail Blazers at Sacramento Kings\n⏰ » 7:00 PM PST\n📺 » NBCS CA\n📍 » Golden 1 Center https://t.co/bnmcpJpgEf",
    "131": "Please, let's have @SacramentoKings and @Timberwolves win some games. The world needs Lakers outside the playins #schadenfreude #NBA",
    "132": "Sacramento Kings Predictions and Preview for 11/24/2021 hosts Portland Trail Blazers.  Find out who we are taking in this matchup. #Sportsbook #SportsBetting https://t.co/kxmZsyjuZf",
    "133": "@ClayTravis sign him @SacramentoKings",
    "134": "This can’t be real. I’d believe this if it was over how soft the @SacramentoKings have played lately. Can’t be soft on the court but hard off it https://t.co/vZBDl4Hjt3",
    "135": "KANGS. Consider this my resignation from my lifelong Kings fandom. I hope things change. @CarmichaelDave  @SacramentoKings @thekingsherald https://t.co/cy0NimfY9R",
    "136": "@fansloveIshy @highkin I honestly don't mind if he's out at whatever number but the reasons you give gotta be consistent with everyone lol\n\nI think the most egregious part is having 3 Sacramento Kings on this list lol",
    "137": "the Bears are bad. but they are not as bad as the Detroit Lions, Jacksonville Jaguars, Sacramento Kings, Minnesota Timberwolves, Seattle Mariners...even the Mets tbh https://t.co/Lb1nruWhWU",
    "138": "Today's NBA Picks: 10:10 PM ET - Portland Trail Blazers vs. Sacramento Kings - 17 PICKS AVAILABLE: https://t.co/2TvvTsjbl2 #nba",
    "139": "Revenge spot for the Portland Trail Blazers tonight against the Sacramento Kings. The Blazers are 3-0 this season in the next game against opponents who beat them the first time (Clippers, 76ers and Nuggets)\n#NBA #GamblingTwitter\n#NBATwitter #RipCity",
    "140": "Yesterday on The @JasonRoss1140 Show, @kayte_c joined the show to discuss the ongoing struggles for the Sacramento Kings, explain what needs to happen for the team to turn the page &amp; much more 👑\nhttps://t.co/eaIbJHbQLj",
    "141": "@SacramentoKings Dear Slim, I wrote you but you still ain’t calling: https://t.co/XYtnnYvhK9",
    "142": "Another bad Kings stat during this 1-8 stretch...\n\nWorst second-half point differentials -- Last 9 games:\n\nHouston Rockets            -8.1\nSacramento Kings           -5.9  &lt;&lt;&lt;&lt;&lt;&lt;&lt;\nToronto Raptors               -5.1\nNew Orleans Pelicans    -4.4\nNew York Knicks            -4.4",
    "143": "@mtemi_bin_fatma @Moseshuez Sacramento Kings",
    "144": "@kangzcastEric @SacramentoKings I dont want to though thats going to hurt if i kick a rock 😆",
    "145": "@AtwalKings05 @SacramentoKings Kick rocks, Tanvir 😂",
    "146": "@kangzcastEric Bring iman back @SacramentoKings hes a winner",
    "147": "@SimonStilesNBA Whoooooaaaaa someone on the @SacramentoKings has some fight in them after all!!! @DLoAndKC @ESPN1320 @damienbarling @IamKDiddy",
    "148": "@StocktonKings Bring him up @SacramentoKings @mmcnair !  Many Kings players are very inconsistent with productivity.  Maybe we need to see if there is something he can contribute to the Kings since he is obviously on top in G league right now.",
    "149": "@justwatchkach @StocktonKings We should swap our G-leaguers @StocktonKings for our @SacramentoKings …\n#Effort #Grit @ESPN1320 @DLoAndKC @damienbarling @IamKDiddy",
    "150": "@SacramentoKings I will not be watching the game tonight. I will start watching when you pull it together.",
    "151": "Gave out my FIRST magnet to the #sacramentokings fan working behind the bar at The Pour Choice coffee shop in Auburn, CA! \n\nGo Kings! https://t.co/iuqKhTGQ89",
    "152": "@SacramentoKings I want to bring my Dad to a game tonight but he's been vaccinated outside of the US (The UK). I just wanted to check that his vaccination card be accepted for entry into the arena?",
    "153": "We need @imanshumpert energy back here @SacramentoKings!!!\n\nhttps://t.co/TgQ5N5xHk4",
    "154": "@Ryno023 @55buckets @SacramentoKings Teaching the young 👍🏽",
    "155": "Backyard for the next week! \n\nShould I invite the #sacramentokings over for some practice? https://t.co/fE6LpflcCs",
    "156": "i love the sacramento kings https://t.co/aFRO1gKTPq",
    "157": "@TheDeviltoad34 @Andyvela84 @NBCSKings @Lakers @SacramentoKings Richmond literally played one season there, his last season, after being traded to the wizards. Didn't go directly from the Kings and wasn't in his prime... same thing for Divac.",
    "158": "The Sacramento Kings will look to avoid a five-game losing streak tonight when they face Damian Lillard and the Portland Trail Blazers.\n\nHere is what happened during Monday night's contest against Philadelphia  ✍️ \nhttps://t.co/pgU4wMkN5c",
    "159": "Portland Trail Blazers vs. Sacramento Kings - 11/24/2021 Free Pick &amp; NBA Betting Prediction https://t.co/5SMcyyTAZt\n.\n#Betting #FreePicks https://t.co/QNyf4hlsNR",
    "160": "Jordan 10s are clean to me. Re drop the shadow 10s or the Sacramento kings 10s and it will be a must cop.",
    "161": "@SacramentoKings What wrong with this team. Very disappointing.",
    "162": "Portland Trail Blazers @ Sacramento Kings\n\nSacramento Kings +1.5\n\n-110\n\nRisking 1.1 units to win 1.0 unit. 🔒 https://t.co/ADEnOic8ke",
    "163": "The Portland Trail Blazers take on the Kings tonight in Sacramento, looking for revenge for their season opener.\n\n@joecapraro has you covered with a @WynnBET betting guide:\nhttps://t.co/G6aPRlpTB4",
    "164": "@Andyvela84 @NBCSKings @Lakers @SacramentoKings Close doesn't count. Almost doesn't count NBA championships count. \n\nRichmond to the Lakers\nDivac to the Lakers\nThe list is long they just go to the Lakers.\n\nLosing in the playoffs is the definition of a disappointment. \nAll that work to come short and then trade to the Lakers.",
    "165": "HOY JUEGAN LOS KINGS!\n\n#SacramentoProud  (6-12) 🆚 #RipCity (10-8)\n\n📍Golden 1 Center. Sacramento, CA\n\n⏰12:00 AM (🇦🇷/🇺🇾/🇨🇱/🇵🇾/🇧🇷)\n⏰11:00 PM (🇧🇴/🇻🇪/🇩🇴/🇨🇺/🇵🇷)\n⏰10:00 PM (🇲🇽 /🇵🇪 /🇨🇴/🇪🇨)\n⏰4:00 AM (🇪🇸)\n\n📺 League Pass / Streaming https://t.co/AJPxKtf6FW",
    "166": "Betting odds for the Sacramento Kings' next head coach (via Bet Online)\n\nKenny Atkinson - 4/1\nTerry Stotts - 5/1\nBecky Hammon - 11/2\nAlvin Gentry - 7/1\nDarvin Ham - 8/1\nDoug Christie - 10/1\nMike D'Antoni - 10/1\nBobby Jackson - 12/1\nMark Jackson - 12/1\nJeff Van Gundy - 14/1",
    "167": "9-1 at Home\n1-7 Away\n\nNext two games:\n@ Sacramento Kings\n@ Golden State Warriors\n\nThese next two games will reveal a lot about our Blazers! #RipCity",
    "168": "@hbarnes @SacramentoKings @LouisKing The best predictions https://t.co/WKE9y5jg52",
    "169": "@SacBee_JoeD @SacHornetsFB @BigSkyConf What @coachTaylorsac has done for @SacHornetsFB in two seasons, + the hiring of him by @OrrMarkC is a success story the @SacramentoKings need to ask them, “How did you turn your team around?🤔 What takeaways can we use to turn our 🏀 franchise around?”🧐 Great job, Mark &amp; Troy!🤝",
    "170": "In my @SacramentoKings fit today! Joggers and hoodie GO KINGS!!! #SacramentoProud https://t.co/bX5wnO8J0G",
    "171": "@trailblazers @SacramentoKings @Golden1Center @RipCityRadio620 Revenge is needed for season opener",
    "172": "Game day @SacramentoKings let’s see if we can pull a win! 🙏🏾 #SacramentoProud",
    "173": "Portland Trail Blazers vs. Sacramento Kings Preview: Troy Wayrynen-USA TODAY Sports The Blazers have struggled on the road this year, but the Kings have struggled, period. Can the Blazers get the win? Portland Trail Blazers (10-8) vs Sacramento… https://t.co/66lumqd2wE #RipCity https://t.co/EYVeS9S56a",
    "174": "The Sacramento Kings are still not making De’Aaron Fox and Tyrese Haliburton available in a trade.  https://t.co/yDaShLt0qx",
    "175": "@trailblazers @SacramentoKings @Golden1Center @RipCityRadio620 Let’s keep this winning streak going",
    "176": "Taking the show on the road.  \n\n🏀 #RipCity vs @SacramentoKings \n🏟 @Golden1Center\n🕰 7:00PM\n📺 ROOT SPORTS Plus\n📻 @RipCityRadio620 https://t.co/vFSaEFlaZM",
    "177": "Basketball season is in full swing! 🏀🍺  Come down to #DowntownSac and check out a @sacramentokings game at the @golden1center 🏀🍺 \n\n📸  @sacfoodandbooze https://t.co/BYE8shRrQ9",
    "178": "Our stars had themselves a night in the win against the Denver Nuggets. Next up, the Sacramento Kings!  \n\n#RIPCITY #NBA\n\nPhoto Cred:  https://t.co/BpukyUaqo5 @ Portland, Oregon https://t.co/cOreevAOgF",
    "179": "@KevinOConnorNBA let the choppa sing on @vivek and his bum ass team @SacramentoKings, and rightfully so",
    "180": "@hbarnes @SacramentoKings @LouisKing Goated fr",
    "181": "@nbatopshot Oh damn let's go TopShot!!! And I've got a pack to open up at the @SacramentoKings game tonight!!!",
    "182": ".@Trysta_Krick gives her take on the Luke Walton firing and looks ahead at what’s next for the Sacramento Kings in her latest episode of ‘Heat Check.’ 🔥 \n\n🎧 Listen to Heat Check with Trysta Krick on Audacy: https://t.co/ouWxjGbxtY\nhttps://t.co/uAVlB6pmEg",
    "183": "Carolina Hurricanes x Seattle Kraken\nSTAR+\n\n00:00 – 🏀NBA\nPhiladelphia 76ers x Golden State Warriors\nESPN, WATCH ESPN, STAR+ e NBA LEAGUE PASS\nPortland Trail Blazers x Sacramento Kings\nNBA LEAGUE PASS\n\n00:30 – 🏒NHL\nOttawa Senators x San Jose Sharks\nSTAR+",
    "184": "@bw3052 @ChrisBiderman @ChelseaFC @SacramentoKings Which one of us is that?",
    "185": "Kings gameday live: Blazers’ Lillard, McCollum come to Sacramento for Thanksgiving feast. Updates to come before, during and after tonight's game against the Blazers.\n\nhttps://t.co/GOrFC28xUN",
    "186": "@fuboSports @mitchrichmond23 @SacramentoKings @terrellowens @Hatch89 Imagine breaking up Run TMC because you had no vision of how the game would be played for the next 30 years.",
    "187": "Revenge Game: Ben McLemore plays Sacramento tonight.  He played 312 games in his career for the Kings.",
    "188": "@BigRorDawg @sactowncrown Ain’t that true @SacramentoKings same old sh*t",
    "189": "@Ryno023 @55buckets @SacramentoKings Finally a winner at the Golden 1 Center 🙌\n🤜🏽🤛🏽",
    "190": "@IamKDiddy This Franchise has ruined many young talents @SacramentoKings",
    "191": "@teets_mcgeets @SacramentoKings Yo that’s my team! https://t.co/STSK9Ta2HF",
    "192": "@DeuceMason Stockton Kings look like they know how to run plays, maybe they should teach the Sacramento squad to do the same.",
    "193": "@Vivek So you &amp; Matina thought it was a good idea to give Christie a 3 yr deal but came to your senses? I guess it’s a win. Sell the team &amp; stop listening to Matina. This isn’t the 02’ team. We can’t even be the 10th worst team with your awful hires and meddling @SacramentoKings",
    "194": "@BobbyGerould The Stockton Kings could beat the Sacramento Kings.",
    "195": "I love that the Lions are a cornerstone of Thanksgiving. But we could go further… put the Sacramento Kings midday on Christmas. How about a nationally televised Rockies game on the 4th of July? We have the rest of the year for the stars, I say holidays for the other guys!",
    "196": "@newanimprovedJR seriously how is not a main stay in the roster. The @StocktonKings got some talent and the @SacramentoKings need to bring some guys up to shake things up.",
    "197": "@SimonStilesNBA Sources say the argument ended with Luke Walton coming back into the locker room and saying it should be. The Sacramento Kings then jumped him and poured Mac and Cheese into his ears. Sources tell ESPN.",
    "198": "@byDavidGardner Lol I actually don’t mind this take bc turkey is only great if it’s smothered in gravy or fried. Ham is the Sacramento Kings of the meal options. For most black folks we know that Mac N’ Cheese is the star of the show 😌🤤",
    "199": "@ch0cablok @SacramentoKings I'd say refusing to work out is an indication you don't want to be there, being close to the person that wants to draft you means even more that finishing a season wouldn't matter u made my point 4 me.. like I said fake fans!!",
    "200": "Someone named \"Chris in Sacramento\" called into the .@dpshow and made a bet that the Kings would make the playoffs. It didn't sound like @ChrisDuerr, but he could've disguised his voice",
    "201": "Chris in Sacramento bets the Kings will make the playoffs with @andrewperloff with either a shower of shame or pie to the face",
    "202": "When @mitchrichmond23 got traded to the @SacramentoKings breaking up Run TMC, he \"cried like a baby\"\n😭😭😭\nWatch more of the 6x NBA All-Star &amp; 5x All-NBA Team member with @terrellowens &amp; @Hatch89 on our YouTube channel! https://t.co/x4phmUo9Yn https://t.co/9Z5OwvrqIE",
    "203": "@willoneill27 What about $ankr crazy undervalued is being marketed on the Sacramento kings basketball floor",
    "204": "DasHaus made a bet!\n\nEvent: Portland Trail Blazers vs Sacramento Kings #NBA\nBet: Sacramento Kings TO WIN +2.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "205": "DasHaus made a bet!\n\nEvent: Portland Trail Blazers vs Sacramento Kings #NBA\nBet: Portland Trail Blazers TO WIN -2.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "206": "@KOT4Q The Sacramento Kings would literally win every dead ball, with Fox. He's got jets for legs",
    "207": "Congrats to Sacramento Kings legend @imanshumpert on his dancing with the stars win! #SacramentoProud",
    "208": "@SacramentoKings @imanshumpert @DancingABC SHUMP got the scores to win. Congrats!",
    "209": "\" Passion and Pride \" Sacramento Kings don't have. @MattGeorgeSAC https://t.co/JDxzFkrzZN",
    "210": "Portland Trail Blazers vs Sacramento Kings 11/24/2021 Picks Predictions Previews\n\nhttps://t.co/0KoItdRKg6\n\n#odds #picks #NBA #NBApicks #NBAprediction #NBAparlay #NBAbetting #expertpicks #sportsbetting #basketballpicks #handicapper #sportspicks #freepicks #TrailBlazers #Kings https://t.co/nTC6jtykqT",
    "211": "When will Sacramento Kings GM Monte McNair give the people MORE?\n\nSan Francisco 49er first time GM John Lynch talks to the local radio shows each week\n\nSame with SF Giants GM Farhan Zaidi …\n\nAnd their head coaches …\n\nCome on Kings! #SacramentoProud",
    "212": "Enter our drawing for Chicago Bulls tickets! We're holding a drawing for two tickets + one parking pass to the Chicago Bulls vs. Sacramento Kings game on February 16, 2022 at the United Center. For a chance to win, make a donation of $50 or more: https://t.co/yYerogoeEQ https://t.co/iYphtPL3Yk",
    "213": "@CarmichaelDave As bad as this team is right now why can we not see Lewis King in Sacramento or more of those guys could that fourth quarter have been any worse with them on the floor I don't think so",
    "214": "San Francisco:: Can Alvin Gentry save season for Sacramento Kings? Doc Rivers thinks he can ‘fix things’ https://t.co/whzoN1jUTk",
    "215": "@kfg1010 @SacramentoKings Thanks bud I had an awesome day. And yes I thought he was a bad hire from the jump.",
    "216": "#sacramentokings fans deserve better!\n\nAnd the Barry Bonds deserves the be in the baseball HOF!",
    "217": "Had a dream last night I got hired as the new Sacramento Kings coach. I don’t know anything about basketball &amp; apparently that’s what they needed 😂",
    "218": "@Blazer_Gang @SacramentoKings A great win!!",
    "219": "SMH 🤦🏽‍♂️🥺 @SacramentoKings I’d pay $99 tops for a losing product https://t.co/jiLFBuwWp8",
    "220": "@Raptors vs. @memgrizz \n@DetroitPistons vs. @Bucks \n@MiamiHEAT vs. @Timberwolves \n@WashWizards vs. @PelicansNBA \n@utahjazz vs. @okcthunder \n@ATLHawks vs. @spurs \n@sixers vs. @warriors \n@trailblazers vs. @SacramentoKings",
    "221": "Sacramento Kings after drafting a bust in the Draft lottery… https://t.co/8K5OM1eQfI",
    "222": "Can Sacramento Kings save their season with interim coach Alvin Gentry? \n\n– Detailing Gentry's history of midseason takeovers\n– Tough love/compassion\n– Why GM Monte McNair picked Gentry to replace Luke Walton\n– Why Doc Rivers thinks Gentry can ‘fix things’\nhttps://t.co/tFOLvGxltX",
    "223": "I’m a Sacramento Kings fan. I definitely would. https://t.co/v3035SoT7z",
    "224": "NBA trade machine: Sacramento Kings",
    "225": "Here’s what makes Alvin Gentry so uniquely qualified to take over as interim head coach of the Sacramento Kings. https://t.co/dWLWHJ6VIy",
    "226": "Here’s what makes Alvin Gentry so uniquely qualified to take over as interim head coach of the Sacramento Kings. https://t.co/QSYz7gAnR4",
    "227": "Here’s what makes Alvin Gentry so uniquely qualified to take over as interim head coach of the Sacramento Kings. https://t.co/yP5Kik6Fum",
    "228": "@mikegolicjr Have you seen the Thursday line-up? Imagine the NBA making Sacramento  Kings a Christmas tradition....😬 😬",
    "229": "In a recent report, the Sacramento Kings are unwilling to part with De’Aaron Fox or Tyrese Haliburton in a Ben Simmons deal: https://t.co/gpmEISRXr6 https://t.co/LAhprK3vHs",
    "230": "🏀❤️🖤⛹️ Blazers won  A wonderful game, and it is so nice to see them clicking while at home.\nBlazers vs Kings 7pm PT in Sacramento #RipCity \n🏀76ers vs Warriors at 7pm PT \n🏀Happy Birthday to Blazers Keljin Blevins \n\n“A person's a person, no matter how small.”― Dr. Seuss",
    "231": "@SacramentoKings @sixers @ChrisVernonShow @KevinOConnorNBA @BillSimmons @KlutchSports \nRighto, let’s get this done. For everyone’s sake. Enough is enough. Speak it into existence guys… https://t.co/L9g2EmNxv3",
    "232": "Live pregame, in-game and postgame updates on tonight’s NBA game between the Sacramento Kings and Portland Trail Blazers at Golden 1 Center. https://t.co/tfOL4BMLoV",
    "233": "Live pregame, in-game and postgame updates on tonight’s NBA game between the Sacramento Kings and Portland Trail Blazers at Golden 1 Center. https://t.co/jUdJggtsOg",
    "234": "Miami Heat vs Minnesota Twolves\nUtah Jazz vs Oklahoma City Thunder\nToronto Raptors vs Memphis Grizzlies\nAtlanta Hawks vs San Antonio Spurs\nPhiladelphia 76ers vs Golden State Warriors\nPortland Trail Blazers vs Sacramento Kings\n#NBA2022",
    "235": "@LBJszn19 Lakers without LeBron are just the Sacramento Kings.",
    "236": "@TA1297 @SacramentoKings what would we even trade for him",
    "237": "🏀 𝗚𝗔𝗠𝗘𝗗𝗔𝗬 🏀\n\n🔴 PORTLAND TRAIL BLAZERS\n👑 SACRAMENTO KINGS\n📍 Golden 1 Center (Sacramento)\n📺 NBA League Pass\n\n#SacramentoProud https://t.co/8unmvopdtv",
    "238": "Portland Trail Blazers @ Sacramento Kings \n\nPlayer Points Projections \n\nhttps://t.co/1zzNQFQcIq",
    "239": "Call him up @SacramentoKings https://t.co/zDyrAS4to4",
    "240": "Bol bol to @SacramentoKings pls",
    "241": "Portland Trail Blazers (10-8, sixth in the Western Conference) vs. Sacramento Kings (6-12, 12th in the Western Conference) https://t.co/TPOhbzliLP",
    "242": "Factory Mutual has urged a California federal judge to dismiss the Sacramento Kings' lawsuit demanding coverage for pandemic-related losses. https://t.co/MtF2nwNdmV",
    "243": "Blazers attempt to solve road woes against Kings  #NBA\n #SacramentoKings #SacramentoProud #trailblazers #RipCity https://t.co/leThjsxrej",
    "244": "Hey @SacramentoKings, let @nemi1599 play in @NBA https://t.co/WfyXEW7PR6",
    "245": "The Blazers (4-6 ATS last ten) are a -2 point favorite in Sacramento tomorrow against the Kings (2-8 ATS last ten), per @oregon_lottery.\n\nWhat do you think the outcome of the game will be?\n\n#PWEBets",
    "246": "@securinDaBagley @buddyhield @SacramentoKings How’s you put in on this?  On the auction site or was it something at the arena?",
    "247": "@TheHoopCentral @joeylinn_ We beat them by 51 points last year come on now “all the time” 🙄 the Phoenix Suns are really the only team that actually beats us all the time tbh. Hell, even the Sacramento Kings beat us more than the clippers 😂",
    "248": "@BShep40 @SacramentoKings I’m sure there are plenty of teams in the league that would love a 7’2-7’4” center that can handle the ball and spot up shoot. On top of great passing and then locking ability. There’s not really a situation I see anyone losing that trade",
    "249": "@TrillBroDude @SacramentoKings Somebody rescue that mascot",
    "250": "@ShockleyBowls If I am the @SacramentoKings i would trade for him because They’ve been futile for over 20 years",
    "251": "The 76ers have shown interest in De'Aaron Fox but the King's continue to be unwilling to make him available.\n\nSacramento still believe they can make the playoffs this year, even after a bad start.\n\nThis kind of thinking is exactly the reason why the franchise is mediocre. Insane. https://t.co/CxQer4mbc2",
    "252": "The Clippers have lost 3 out their last 5 games. The Lakers roster is average at best. The  LA Kings have lost 4 straight games. The Sacramento Kings fired their head coach. Free agency hits the Dodgers. California is going thru a rough patch right now. #sportsnews",
    "253": "ICYMI: @SJSUAthletics Legend Tariq Abdul-Wahad talks Doc Rivers, @SacramentoKings  Women's Basketball, Lebron, playing against Michael Jordan, @WNBA @Candace_Parker  &amp; more with @therealknelson - https://t.co/fut2olQN3D https://t.co/LOldRmbuEq",
    "254": "@LakersNation The same old Song!! We, looking more and more like The Sacramento King s!! Vogel, Coach the same way  Walton Coach. Magic get rid of  Luke and then we pick Vogel who will we realize can't Coach!! Jennie, Fire Rob and him!! You Mess up!! A real Coach!!",
    "255": "@SacramentoKings It's tough to win when everybody not named Buddy shot 2/20 on 3-pointers. Sometimes this isn't that difficult to figure out. No matter who the coach is if you don't make shots, you don't win.",
    "256": "@SacramentoKings Oh wait too late",
    "257": "@SacramentoKings This season is gunna be a another dumpster fire i already know it",
    "258": "@blazersforreal A road game against the Kings. We got this one. I believe we’ll defeat the Kings in Sacramento tomorrow",
    "259": "@SacramentoKings @imanshumpert @DancingABC Kings biggest accomplishment",
    "260": "In a 75-63 win over UC Davis at @Golden1Center, @SacHornetsMBB had a bit of a dunkathon against their rivals across the Causeway. @BigSkyMBB is showing off their talents towards @SacramentoKings &amp; @NBA Scouts inside a league arena. @TheDougChristie @thebobbyjackson @JasonRoss1140 https://t.co/QgqUxEULll",
    "261": "Prominent analysts are wondering if the Kings guard’s days in Sacramento are numbered.  https://t.co/O2KEK8R37t",
    "262": "Philadelphia 76ers coach Doc Rivers reacts to the Sacramento Kings firing Luke Walton and hiring Alvin Gentry.  https://t.co/QZdFqvb3yj",
    "263": "I’m convinced the Stockton Kings are better than the Sacramento Kings https://t.co/SiDeC4sDds",
    "264": "@DaraUnn @SacramentoKings Why this look like your junior high gym Stocktonmanuel",
    "265": "Bring him up now! And send fox to stockton @SacramentoKings https://t.co/Q9SRnmH9jt",
    "266": "@securinDaBagley @buddyhield @SacramentoKings Congrats!!!",
    "267": "@ChewieWoolf @buddyhield @SacramentoKings @igotitauction Now just need it signed by @buddyhield",
    "268": "#SacramentoProud @SacramentoKings Couldn't be more trilled for my guy @securinDaBagley winning this! So glad to see it go to a local awesome fan! https://t.co/0gKtiObCXa",
    "269": "@securinDaBagley @buddyhield @SacramentoKings @igotitauction oh damn! stoked for you bro! awesome!",
    "270": "@ChewieWoolf @buddyhield @SacramentoKings @igotitauction I entered on their website",
    "271": "@SacramentoKings @CaliBeefCouncil Causes climate change and bad for health",
    "272": "@securinDaBagley @buddyhield @SacramentoKings hellz yea! was this from in the @igotitauction discord? or twitter?",
    "273": "I still can't believe I won the @buddyhield giveaway. I was so confused when this got delivered and spent like 2 hours trying to figure out how TF it got sent to me @SacramentoKings #kings https://t.co/BMxCHhmjMq https://t.co/gsmsXk5TQG",
    "274": "@judekay17 Lololol, I'm from Sacramento when her and her brothers owned the Kings she was always very kind and much loved here!! She always cracked me up I wish they had her do more guest appearances",
    "275": "@MitchellAEvans @SacramentoKings take Notes",
    "276": "We make it 4 wins in a row and 9 wins in a row at home! CJ and Dame both shot efficiently for a very comfortable win. See you tomorrow @SacramentoKings!\n\n#RipCity https://t.co/3tPTKD3tlj",
    "277": "Damian Lillard and CJ McCollum combined for an easy 57 points on 22-of-33 shooting in a blowout win over the Nuggets tonight. They’ll be in Sacramento tomorrow night for a pre-Thanksgiving feast with the Kings.",
    "278": "@StocktonKings @LouisKing PLEASE CALL HIM UP @SacramentoKings",
    "279": "Someone is gonna be taking this Kings popcorn tin home. Just saying.  @SacramentoKings https://t.co/1rxJo1Df2s",
    "280": "@StocktonKings @SacramentoKings @LouisKing Tuff",
    "281": "@ucdavismbb I respect it, you guys are playing a homage to the current Sacramento kings team on their own court.",
    "282": "@SacramentoKings @imanshumpert @DancingABC Can you guys win a game tho",
    "283": "Happy birthday to my guy @jhein23 hopefully you had a great day .also you guys happy out there that your coach got the axed finally @SacramentoKings",
    "284": "@SacramentoKings @imanshumpert @DancingABC So the @SacramentoKings can win something. Anything 🙄",
    "285": "@DeuceMason We need our summer league team back playing for the @SacramentoKings !!",
    "286": "Tank for Chet @SacramentoKings https://t.co/RJPghSad5D",
    "287": "At @Golden1Center for @SacHornetsMBB Causeway Classic where @sacstate leads UC Davis, 41-23 at halftime. Four of the best first half photos from @DowntownSac inside an @NBA Arena for Division I College Basketball. @BigSkyCommish @BigSkyMBB @SacramentoKings @mmcnair @JasonRoss1140 https://t.co/4YTMluwnJf",
    "288": "Sacramento Kings Fire Luke Walton 17 Games into the 20-21 Season https://t.co/Oz8tPZjHB0 via @YouTube",
    "289": "Just looking at the seat map for tomorrow nights game. Interesting how the cheap upper bowl tickets are almost sold out and the lower bowl is a a ghost town. U need fans to create a winning culture. Lower the ticket prices and the G1C will be packed @SacramentoKings",
    "290": "@SteveThunderfan To think, Seattle wanted the Kings to relocate from Sacramento. They dodged a really bad rebuild.",
    "291": "Run a box zone defense and have davion front the the ball handler copy the warriors if u have too @SacramentoKings https://t.co/qoccEgMENw",
    "292": "@SacramentoKings Like someone posted TT and MB35 were controlling the paint and they went up. Sub for starters never to see floor again down the stretch. It has already been proven the starters can’t finish games. Quit playing analytics and play to win with who is doing well.",
    "293": "@DannyParkIRL @SacramentoKings @imanshumpert @DancingABC Lol yeah that aint happening",
    "294": "@StocktonKings @LouisKing @SacramentoKings call this man up",
    "295": "RT for Sacramento Kings fans https://t.co/uqIkZjT7fq",
    "296": "This might be the year I finally give-up being a Sacramento Kings fan.  \n\nAfter 22 years, give me a reason not to.",
    "297": "Why not Scottie Brooks for the @SacramentoKings",
    "298": "8 points in 10 minutes. The Bruins must have been watching the Sacramento Kings last night.\nWhat a disappointment. Game over.",
    "299": "Some interesting details on Sacramento's coaching change and more on the Kings: https://t.co/NtrlrQX9y6",
    "300": "Former Sacramento King Iman Shumpert Makes History With 'Dancing With The Stars' Win https://t.co/ZJas9gXY16 https://t.co/yNRbxVGHgd",
    "301": "@MarcosBreton @SacramentoKings Unfortunately, without him there are no Sac Kings, no DoCo, nothing. So I can’t hate on him too much.",
    "302": "The @Suns last loss this season was against the Sacramento Kings Oct 27th. They have won 13 straight since. #PhoenixSuns #NBA",
    "303": "@Ryno023 @55buckets @SacramentoKings Nice jersey!\nHopefully he doesn’t have to wait another lifetime for the Kings to be good again!\nKids don’t even have any playoff or J-Will highlights in HD. I’d love to see J Will highlights in HD.",
    "304": "Hop on the Game Day Express and let #RosevilleTransit do the driving.\n\nJoin other #SacramentoKings fans and ride non-stop to regular season games.\n\nRound-trip tickets are as low as $6.50.\n\nLearn more and make your purchase online: https://t.co/7s3dtGoD3S https://t.co/TBN9rEaMGL",
    "305": "The Sacramento Kings are still not making De’Aaron Fox and Tyrese Haliburton available in a trade.  https://t.co/cYMOankFHX"
}