{
    "0": "Detroit Pistons vs San Antonio Spurs | NBA live stream\nClick Live Here ➡ https://t.co/nW9tQblC3X",
    "1": "San Antonio Spurs karşısında ilk beşimiz:\n\n2️⃣5️⃣Derrick Walton Jr\n5️⃣Frank Jackson\n6⃣ Hamidou Diallo\n4⃣1⃣ Saddiq Bey\n5️⃣5️⃣Luka Garza",
    "2": "San Antonio Spurs Starters:\n\nDerrick White\nDoug McDermott\nKeldon Johnson\nKeita Bates-Diop\nJakob Poeltl\n\nPlayers out:\nZach Collins\nDejounte Murray\n#PorVida #NBA #NBATwitter #NBA75",
    "3": "Tonight's starting lineup for the San Antonio Spurs: White, Johnson, McDermott, Bates-Diop, Poeltl https://t.co/bVWH4AMCA2",
    "4": "For Spurs' Doug McDermott, golf is a family affair - San Antonio Express-News https://t.co/jtfQd2i0qk",
    "5": "On Sunday, the increasingly hot San Antonio Spurs will will face off with still-cold Detroit #PorVida https://t.co/dyNuyY7McP",
    "6": "San Antonio Spurs vs the Motor City Cruise is gonna go crazy https://t.co/5xWypEk78o",
    "7": "It’s time for Basketball: San Antonio Spurs vs Detroit Pistons https://t.co/LKcODOoEL7",
    "8": "¡HOY JUEGAN LOS PISTONS!\n\n🆚San Antonio Spurs\n⏰21:00 hs.🇦🇷\n🏟️AT&amp;T Center\n📺NBA TV\n\n🚑🐴Cade Cunningham, Jerami Grant, Killian Hayes, Josh Jackson, Isaiah Stewart, Cory Joseph, Saben Lee, Isaiah Livers, Trey Lyles, Rodney McGruder, Kelly Olynyk.\n\nInsólito que se juegue. https://t.co/20wAKITDTM",
    "9": "Check out this listing I just added to my #Poshmark closet: Brand New San Antonio Spurs Cap 7 5/8. https://t.co/ZqoZGu67UV #shopmycloset @poshmarkapp",
    "10": "Check out this listing I just added to my #Poshmark closet: Brand New San Antonio Spurs Cap. https://t.co/pUABAcBwyA #shopmycloset @poshmarkapp",
    "11": "The Motor City Cruise takes on the San Antonio Spurs tonight https://t.co/aaFAcIJlwh",
    "12": "One of the side benefits of being w/ the Spurs for Doug McDermott: They're in a golf heavy town.\n\nOn Christmas, he enjoyed playing with his dad &amp; brother at TPC San Antonio.\n\n“It was good to be outside on Christmas,” said Doug, who hails from the Midwest.\n\nhttps://t.co/h05ZXzWPGz",
    "13": "Tonight's @HenryFordNews injury/status report against the San Antonio Spurs ⤵️ https://t.co/HsVNU3Buc9",
    "14": "@ATFulemin The Red Wings and San Antonio Spurs are the two forgotten dynasties of my childhood",
    "15": "@mattinaq @jackfrank_jjf Jeff Green didn’t have Patty Mills’s NBA Championship resume, so we didn’t expect Green to have that kind of impact. Utah Jazz kicked Jeff Green off their team. San Antonio Spurs trained Patty supposed to do this.",
    "16": "How to Watch Detroit Pistons vs. San Antonio Spurs: NBA Live Stream, TV Channel, Start Time https://t.co/eb7rtx4gJp",
    "17": "Consensus Line Move:\n2021-12-26 Detroit Pistons at San Antonio Spurs from 220.00 to 221.50\nOver invested\n#NBA #sports #coding #rich",
    "18": "ALERT: New high roller bet posted!\nA bet has been placed for $5,325.69 on San Antonio Spurs - Detroit Pistons to win $10,690.71.\nTo view this bet or copy it https://t.co/3iGzjJzXAW https://t.co/bUGuzhXr1H",
    "19": "A look back at one of the many moving Rush stories of 2021. Kara Allen is now chief impact officer with the San Antonio @spurs. https://t.co/ybQYbOG3da https://t.co/nKC2JRohtY",
    "20": "On this day in 2001, Tim Duncan of the San Antonio Spurs scored 53 points in a 126-123 loss to the Dallas Mavericks.",
    "21": "Today's NBA Picks: 7:10 PM ET - Detroit Pistons vs. San Antonio Spurs - 19 PICKS AVAILABLE: https://t.co/nV0Ap4rV76 #nba",
    "22": "@wojespn Motor City Cruise vs San Antonio Spurs 😭",
    "23": "Miami Heat - Orlando Magic\nKansas City Chiefs - Pittsburgh Steelers\nSan Antonio Spurs - Detroit Pistons\nDallas Cowboys - Washington Football Team\n\nBet slip link: https://t.co/8IiuzPV6zE https://t.co/7lvD8anwOs",
    "24": "San Antonio Spurs: San Antonio #Spurs vs Detroit Pistons Prediction: Surging #Spurs Feast - Oddschecker https://t.co/KOGeNrTWSL",
    "25": "TIP: San Antonio Spurs - Detroit Pistons, ck 2-1, 4.60 by #tipster sxomili95 (profit this month: +101.40)\n  #betting #Basketball #San #Antonio #Spurs #Detroit #Pistons",
    "26": "@DuncanSmithNBA I'm so scared that San Antonio, after the high of the last two games, does something dumb like lose tonight.  \nAs a Spurs fan, I'm taking the Detroit +10",
    "27": "The San Antonio Spurs are signing The Group We Have to a 10 day Hardship contract. R.C, Buford added “We really really like this player.” and expressed confidence in signing this player long term at the end of the 10 days.",
    "28": "George Gervin has himself a great game scoring 36 points, also accumulating 4 rebounds, 2 assists, and 1 block.\n\nTree Rollins scored 11 points, Charlie Criss had 18 points, as Atlanta Hawks defeated San Antonio Spurs, 103-95, on March 23, 1980. https://t.co/xCwpbq7DXs",
    "29": "San Antonio Spurs: Former Spur Patty Mills lights up Los Angeles for the Holidays https://t.co/wCPplBk7Gw",
    "30": "We haven't had one of these for a while. The Jazz fly to San Antonio this afternoon in preparation for tomorrow's game against the Spurs. The Spurs play the shorthanded Pistons tonight, so they'll be on a no-travel B2B tomorrow. https://t.co/QunBzZbdrn",
    "31": "Today's NBA Picks: 7:10 PM ET - Detroit Pistons vs. San Antonio Spurs - 18 PICKS AVAILABLE: https://t.co/nV0Ap4rV76 #nba",
    "32": "🏀 Detroit (107.6) @ San Antonio (109.4)\n\nDejounte Murray was just announced out as he's entering H&amp;S protocols so it might be safe to expect more Spurs to miss time. I like DET in this game regardless.\n\n💰 Value: Spurs team total u115, Pistons team total o105 &amp; Pistons +10",
    "33": "San Antonio Spurs: Dejounte Murray has entered COVID Health and Safety Protocols https://t.co/XjaCtqfA2I",
    "34": "San Antonio Spurs",
    "35": "@BookitWithTrent Nba Detoit/San Antonio u220 half of Detroit is out and Murray out for spurs free money imo",
    "36": "Quadruple-doubles, water cannons and NBA championships: This is a great look at 46 colorful years of Spurs basketball in San Antonio. https://t.co/vqKJy5IHxL",
    "37": "Spurs:  Pistons vs. #Spurs Prediction and Odds: San Antonio Eyeing Third Straight Blowout Win - FanSided https://t.co/Qf0onNzhK9",
    "38": "Consensus Line Move:\n2021-12-26 Detroit Pistons at San Antonio Spurs from 218.00 to 220.00\nOver this just in\n#NBA #bettingonline #dataanalytics #forextrader",
    "39": "San Antonio Spurs: Spurs guard Dejounte Murray enters COVID protocols https://t.co/l9JmcLxjua",
    "40": "San Antonio Spurs: NBA: LA Clippers star Paul George ruled out with elbow injury - https://t.co/YXgtoZMsP8 - https://t.co/YXgtoZMsP8 English https://t.co/EnetvDBFBE",
    "41": "Avis #NBAXmas \n\n8 matchs au programme : \n\n- Chicago Bulls\n- Cleveland Cavaliers\n- San Antonio Spurs\n- Memphis Grizzlies\n- Philadelphia 76ers\n- Miami Heat\n- Denver Nuggets\n- New Orleans Pelicans\n\nPlus il y'a d'interaction, plus il y'a de chance de taper Full Map 👀! #TeamParieur https://t.co/lehXtgZvS5",
    "42": "I will say this: my mentions haven't been this full of soccer mom-level defense lawyers on behalf of Baker since I poked at San Antonio Spurs fans. You Sooners will ride a boat all the way to the bottom of the sea. Respect the blind loyalty!",
    "43": "tonight… WE GOT G LEAGUE NBA BASKETBALL!! HEADBAND SADDIQ WILL CARRY THE PISTONS TO A WIN AGAINST THE AUSTIN- I MEAN SAN ANTONIO SPURS! https://t.co/zz3l1BgIhb",
    "44": "Check out 1991-92 Fleer Wheaties Pro Vision #72 David Robinson San Antonio Spurs https://t.co/ubBOXiRiZ7 @eBay",
    "45": "San Antonio Spurs, Dejounte Murray out contro i Pistons\n\nhttps://t.co/vlnhQomjV2",
    "46": "Consensus Line Move:\n2021-12-26 Detroit Pistons at San Antonio Spurs from 219.50 to 218.00\nUnder market flood\n#NBA #sportsbettingadvice #coding #investment",
    "47": "Consensus Line Move:\n2021-12-26 Detroit Pistons at San Antonio Spurs from -11.50 to -10.00\n#Pistons sharps say\n#NBA #vegas #data #investment",
    "48": "Breaking: San Antonio Spurs guard Dejounte Murray has entered health and safety protocols. He’ll miss tonight’s game vs. the Pistons. (Per @wojespn)",
    "49": "San Antonio #Spurs G Dejounte Murray has entered health and safety protocols. #NBA https://t.co/Utq7AyuPsW",
    "50": "@Jumpshot8 Does R.C. Before for the San Antonio Spurs is 4-1 on that same time span or is he disqualified because he did it with only one team?",
    "51": "Game Preview: San Antonio Spurs vs. Detroit Pistons\n https://t.co/rI6WqGQVlZ",
    "52": "my aunt was telling me her brother’s gf does not allow him to wear red because his ex-gf’s car is red.. can’t watch the spurs game because the ex lives in san antonio.. can’t wear a blue cap because that’s the ex’s favorite color… \n\nactually, they just broke up https://t.co/t1k9U4YFdt",
    "53": "TRIALS OF DAVID SAN ANTONIO SPURS CENTER AND BORN AGAIN CHRISTIAN DAVID ROBINSON IS TRYING TO LEAD HIS TEAM TO AN NBA TITLE AND REMAIN PURE IN A WORLD BESET BY THE SEVEN DEADLY SINS https://t.co/IFVTN8UGgW",
    "54": "If you have not seen a Motor City Cruise game yet, you get a sneak peak (with a few real Pistons sprinkled in) against the San Antonio Spurs on TV tonight. #Pistons https://t.co/XDQ2wH6Vnf",
    "55": "@JayhawkRob 2/ Honestly, I'm not sure how Kawhi fits with this SA roster with Keldon and Vassell. Health would be a concern to bring him in for one of those guys. Patty and DeMar were professionals in San Antonio, in the end, Kawhi wasn't. Spurs will claim him in the HoF, but that's it.",
    "56": "On this day in 2011, 5-time All-Star Kawhi Leonard made his NBA debut for the San Antonio Spurs in a 95-82 win over the Memphis Grizzlies.",
    "57": "@JayhawkRob DeMar left it all on the court in San Antonio. You can see traces of his impact in the games of Keldon, Dejounte, and Derrick. The playoff run might have ended in his time here, but he didn't ask for that situation. The Spurs will benefit from his time here for years to come. https://t.co/Se6XKbfclQ",
    "58": "@BloveMc @andrejamal79 It’s like GSW/New England Patriots. You can put any player within their system and get the most out of that player. San Antonio Spurs is another example of that..The LA champs bubble team was much better than this current team because each player knew and executed their roles.",
    "59": "The San Antonio Spurs have recalled Josh Primo from the G League.",
    "60": "Consensus Line Move:\n2021-12-26 Detroit Pistons at San Antonio Spurs from 220.50 to 219.50\nUnder did I do that?\n#NBA #sportspicks #developer #investor",
    "61": "Consensus Line Move:\n2021-12-26 Detroit Pistons at San Antonio Spurs from -10.50 to -11.50\n#PorVida snake in the weeds\n#NBA #vegas #data #bitcoins",
    "62": "San Antonio Spurs assistant Becky Hammon is being seriously pursued by the New York Liberty and Las Vegas Aces for both WNBA teams’ head coaching job, according to @TheAthletic. \n\nMore:\nhttps://t.co/ZQrK1Fme55",
    "63": "@ActuFoot_ San Antonio Spurs?",
    "64": "Spurs: San Antonio #Spurs vs Detroit Pistons 12/26/21 NBA Picks, Predictions, Odds - Sports Chat Place https://t.co/VGMuWJ5Iii",
    "65": "Spurs: San Antonio #Spurs vs Detroit Pistons 12/26/21 NBA Picks, Predictions, Odds - Sports Chat Place https://t.co/6OH035K8gq",
    "66": "San Antonio Spurs: Detroit Pistons game score vs. San Antonio #Spurs: Time, TV, radio https://t.co/KOGeNrTWSL",
    "67": "Sounds like it’ll be the San Antonio Spurs vs. Saddiq Bey, Frank Jackson, Hamidou Diallo and the Motor City Cruise https://t.co/4iUjwETxfg",
    "68": "DasHaus made a bet!\n\nEvent: Detroit Pistons vs San Antonio Spurs #NBA\nBet: San Antonio Spurs TO WIN -10.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "69": "DasHaus made a bet!\n\nEvent: Detroit Pistons vs San Antonio Spurs #NBA\nBet: Detroit Pistons TO WIN +10.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "70": "🚨ITS GAMEDAY\n\nDetroit Pistons(5-26) vs\nSan Antonio Spurs(13-18)\n\nPistons only lost by 3 last game with a short handed team without our two superstars. Now with the call-ups from the g league and momentum, I won’t be surprised if we win tonight.\n\n#Pistons",
    "71": "Detroit Pistons vs. San Antonio Spurs - NBA (12/26/21) | Tip-Off, How to Watch https://t.co/q8Hhz9LrNV",
    "72": "Detroit Pistons vs. San Antonio Spurs - NBA (12/26/21) | Tip-Off, How to Watch https://t.co/yPxJZOTLZ8",
    "73": "Detroit Pistons vs. San Antonio Spurs - NBA (12/26/21) | Tip-Off, How to Watch https://t.co/XGCTkVnqfk",
    "74": "Consensus Line Move:\n2021-12-26 Detroit Pistons at San Antonio Spurs from 217.00 to 220.50\nOver gonna eat\n#NBA #sports #ai #business",
    "75": "@PickDawgz #120 #PickDawgzCapperContest \nPick #1 NFL: Dallas Cowboys -9.5 \nPick #2 NFL: KC chiefs vs. Pittsburgh Steelers Under 45\nPick #3 NBA: San Antonio Spurs -10.5",
    "76": "Jogos do Miami Heat pós Natal:\n\n• Orlando Magic (26/12 | 17:30)\n• Washington Wizards (28/12 | 21:30)\n• San Antonio Spurs (29/12 | 22:30)\n• Houston Rockets (31/12 | 21:00)\n• Sacramento Kings (02/01 | 20:00)\n\n#HEATCulture https://t.co/JFv3hlWEXx",
    "77": "Spurs:  Detroit Pistons game score vs. San Antonio #Spurs: Time, TV, radio https://t.co/Qf0onNzhK9",
    "78": "Detroit Pistons @ San Antonio Spurs\nPick : San Antonio Spurs.\nBasketball. NBA\n\nNew Orleans Pelicans @ Oklahoma City Thunder\nPick : New Orleans Pelicans.\nBasketball. NBA\n\nIndiana Pacers @ Chicago Bulls\nPick : Indiana Pacers.\nBasketball. NBA",
    "79": "Consensus Line Move:\n2021-12-26 Detroit Pistons at San Antonio Spurs from 217.50 to 216.50\nUnder this just in\n#NBA #sport #python #stockmarket",
    "80": "The Detroit Pistons will take on the San Antonio Spurs on the road tonight at 7pm ET. https://t.co/7olmRvrm0A",
    "81": "NBA Basketball Game Betting Picks Simulator: 7:10 PM ET - Detroit Pistons vs. San Antonio Spurs - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/rdNJcQGjqW #nba #sportsbetting #freepicks #cappertek",
    "82": "San Antonio Spurs: #Spurs assistant coach Becky Hammon may return to WNBA / News - https://t.co/RCLcMiw6Yw https://t.co/EnetvDBFBE",
    "83": "Spurs: Detroit Pistons game score vs. San Antonio #Spurs: Time, TV, radio https://t.co/X5GGe072cQ",
    "84": "Detroit Pistons game score vs. San Antonio Spurs: Time, TV, radio and how to watch #YahooSports #NBA https://t.co/EVTI76PrcL",
    "85": "Spurs: Detroit Pistons game score vs. San Antonio #Spurs: Time, TV, radio https://t.co/F6XTLARq6P",
    "86": "Spurs: Detroit Pistons game score vs. San Antonio #Spurs: Time, TV, radio https://t.co/AiM1vW1vBk",
    "87": "@drclftbl @Arsenal Top 5 Spurs\n\nSan Antonio Spurs\nCaspur the friendly ghost\nMountain Spur\nLongspur bird\nLarkspur plant\n\nBottleham Hotspur is not Top 5 spurs in my book😹😹😹",
    "88": "Detroit Pistons game score vs. San Antonio Spurs: Time, TV, radio and how to watch https://t.co/lD93h8gTjt https://t.co/6bsdVtsoJY",
    "89": "Detroit Pistons game score vs. San Antonio Spurs: Time, TV, radio and how to watch https://t.co/oGWuCMSQou",
    "90": "Detroit Pistons game score vs. San Antonio Spurs: Time, TV, radio and how to watch https://t.co/q9cMVHomaB",
    "91": "NBA 27/12/21\n\n06:00 Washington Wizards*Over-207.5\n06:00 Cleveland Cavaliers*Over-206.5\n07:00 San Antonio Spurs-9.5",
    "92": "Game Preview: San Antonio Spurs vs. Detroit Pistons https://t.co/7BmA0tx4nV",
    "93": "@Coach_LizMills @afrobasketwomen Even San Antonio Spurs... that Lady never got chance to be HC. Becky Hammon, I think she even, about it, came to the public? Good that us who live in Africa have advance with Kenyan basketball.",
    "94": "San Antonio Spurs: Game Preview: San Antonio Spurs:  vs. Detroit Pistons https://t.co/aZaUlKtQrb",
    "95": "San Antonio Spurs: WNBA teams targeting #Spurs assistant Becky Hammon | HoopsHype https://t.co/KOGeNrTWSL",
    "96": "@BleacherReport Patty Mills is a San Antonio Spur on loan to Brooklyn just remember that.",
    "97": "NBA Basketball Game Betting Picks Simulator: 7:00 PM ET - Detroit Pistons vs. San Antonio Spurs - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/rdNJcQGjqW #nba #sportsbetting #freepicks #cappertek",
    "98": "San Antonio Spurs assistant coach Becky Hammon is drawing interest from two WNBA teams for their head coaching jobs 👀👇\n\nhttps://t.co/9qznyacnEH",
    "99": "Spurs' Becky Hammon Reportedly Being Pursued by WNBA's Liberty, Aces for HC Jobs #sports\n\nSan Antonio Spurs assistant Becky Hammon is reportedly being pursued by the WNBA's New York Liberty and Las Vegas Aces for their head coaching positions, per\n\nhttps://t.co/OMfOnSceF1",
    "100": "Game Preview: San Antonio Spurs vs. Detroit Pistons https://t.co/jdl8VPmQ8E",
    "101": "Check out Jakob Poeltl #159 2016-17 Donruss Optic Rookie RC RAPTORS SAN ANTONIO SPURS https://t.co/qwJ8YRtCpj @eBay",
    "102": "Check out 1999-00 SPx Basketball #73 Tim Duncan SAN ANTONIO SPURS FREE SHIPPING https://t.co/zi9O0NdBs4 @eBay",
    "103": "@Brandon_Warne 2013 San Antonio Spurs.\n\nThey were close, and made up for it the next year and obliterated their opponent in the championship round.",
    "104": "What's #Best today on https://t.co/VfZu3jgOen ?\nHighlights: Keita Bates-diop's 30 Pts 7 Reb Vs. Lal : 2021-22 San Antonio Spurs Season\nhttps://t.co/LOHm0PrqwD\n#sports",
    "105": "San Antonio Spurs: 'Magical': America loses it over Aussie in best game to date - The Australian https://t.co/EnetvDBFBE",
    "106": "Spurs: NBA 2021: Jock Landale stats, response, social media reaction, San Antonio #Spurs v LA #Lakers https://t.co/fMiQ0ARFVg",
    "107": "What's #Best today on https://t.co/VfZu3jgOen ?\nHighlights: Lonnie Walker's 21 Pts 3 Ast And 2 Reb Vs. Lal : 2021-22 San Antonio Spurs Season\nhttps://t.co/LN65wyNj2S\n#sports",
    "108": "@Brandon_Warne The 1996-97 San Antonio Spurs. Tecnically, that season gave me joy for 19 straight years",
    "109": "Check out Jakob Poeltl 97 2016-17 Studio Rookie RC SAN ANTONIO SPURS FREE SHIPPING https://t.co/jyyCGFYHrw @eBay",
    "110": "What's #Best today on https://t.co/DVTf2jd2ZR ?\nHighlights: Derrick White's 23 Pts 7 Ast And 3 Reb Vs. Lal : 2021-22 San Antonio Spurs Season\nhttps://t.co/2GsugQwUmL\n#sports https://t.co/xx6NhzM9KH",
    "111": "#Best of the day on https://t.co/MqmlMsmdvk\nHighlights: Derrick White's 23 Pts 7 Ast And 3 Reb Vs. Lal : 2021-22 San Antonio Spurs Season\nhttps://t.co/4kZSBCnlG9\n#sports",
    "112": "What's #Best today on https://t.co/VfZu3jgOen ?\nHighlights: Derrick White's 23 Pts 7 Ast And 3 Reb Vs. Lal : 2021-22 San Antonio Spurs Season\nhttps://t.co/2OXpy7CODS\n#sports",
    "113": "@BigJu71362656 @kylegoon He support and a fan san Antonio spurs blame on you 😂😂😂😂😂😂 team so so bad you are ridiculous",
    "114": "On this day in sports history December 26, San Antonio Spurs Power Forward Tim Duncan recorded 53 Points, 11 Rebounds, 4 Assists, and 3 Steals against the Dallas Mavericks in 2001.",
    "115": "On this day in sports history December 26, San Antonio Spurs Power Forward Larry Kenon recorded 29 Points, 15 Rebounds, 4 Assists, and 11 Steals in a 110-105 win against the Kansas City Kings in 1976.",
    "116": "@AssassinateHate 🙏 Thank you, San Antonio!\n\nBut starting to question: After seeing the rejuvenated seasons Patty, DeRozan, and LaMarcus are having—plus Dejounte and all the fun young guys you still have—did Pop underachieve with the Spurs the past 2 or 3 years? 🤔",
    "117": "@RealSkipBayless You had one sour come in and was perfect against the lakers then you had a former Spurs come in and drop 30 🤣🤣🤣….lakers out here supporting San Antonio",
    "118": "San Antonio Spurs: Becky Hammon is drawing head coaching interest from WNBA’s Aces and Liberty https://t.co/3508kIbxlJ",
    "119": "San Antonio Spurs: NBA Christmas: 1 Thing the #Spurs Can Learn From Every Matchup - Air Alamo https://t.co/KOGeNrTWSL",
    "120": "Los Angeles Lakers star LeBron James again made history after blocking two shots against the San Antonio Spurs.  https://t.co/t6a2oyuJJe",
    "121": "San Antonio Spurs: Report: Spurs Assistant Becky Hammon Targeted for Aces, Liberty Jobs https://t.co/AWIsBdSHSc",
    "122": "@olishaan This is what South Texan Mexicans do to every San Antonio Spurs/Dallas Cowboys player. Try to find the Mexican angle... When we found out Tony Romo was half mexican, the jerseys flew off the shelves.",
    "123": "The WNBA's New York Liberty and Las Vegas Aces both are making strong pitches to hire San Antonio Spurs assistant Becky Hammon as their head coach, The Athletic reports.\n\nhttps://t.co/WvEpDKTvyz",
    "124": "The two WNBA franchises that Becky Hammon once played for are reportedly interested in hiring the San Antonio Spurs assistant to be their next head coach, according to a report from Shams Charania and the Athletic.\n https://t.co/XzNsjg7rtd",
    "125": "Lol Perk a fool. \"Lakers shouldn't be losing to the San Antonio Spurs\" a team with with cohesiveness and chemistry can beat a team without one. \n\nMiscommunication is the largest issue in all relationships.",
    "126": "San Antonio Spurs: Spurs assistant Becky Hammon being seriously pursued by Aces, Liberty for head coaching\u0085 https://t.co/N30dU9GNK1",
    "127": "Spurs: Detroit plays San Antonio on 9-game road slide | Tacoma News Tribune https://t.co/fMiQ0ARFVg",
    "128": "Spurs: Detroit plays San Antonio on 9-game road slide | Tacoma News Tribune https://t.co/X5GGe072cQ",
    "129": "San Antonio Spurs: Jock Landale could be the answer to the #Spurs' backup center conundrum - Pounding The Rock https://t.co/EnetvDBFBE",
    "130": "\"I really enjoy giving back and helping whenever I can.\"\n\nKJ took over for Santa during this #SeasonOfGiving and surprised families on the westside of San Antonio with Christmas gifts, Spurs tickets and holiday cheer 🙏🎅\n\n@elflouiseCP | @nbacares https://t.co/OSj0k4TdxM #act…",
    "131": "The last team to win without a true offensive superstar were the '14 san Antonio Spurs, but I think the Suns really have a high chance if doing it, they're elite as a team both on offense and defense"
}