{
    "0": "Crazy to see so many empty seats just before tip. Let’s go @SacramentoKings!!",
    "1": "The @SacramentoKings are the @Lions  of the @NBA",
    "2": "@SacramentoKings @CoorsLight @hoopculture13 It was against CJ, doesn’t count",
    "3": "Let’s go Doug !!!!! See what happens his energy may be contagious @SacramentoKings team ball",
    "4": "Ok @SacramentoKings we're back on our home court back at home feeling good feeling energized let's go out there play together as a team and let's get this w",
    "5": "@SacramentoKings @CoorsLight @hoopculture13 FINALLY",
    "6": "@James_HamNBA @SacramentoKings Been waiting for this lineup",
    "7": "@JaMorant let me get yo shoes when y’all go against the kings on the 17th up in Sacramento 🙏🏽😩",
    "8": "Y’all say black lives matter @SacramentoKings? Do you think the BLACK LIVES of all these fxcking kids Tristan Thompson is having matters? Cus he doesn’t. So how do you reconcile having him on your team?",
    "9": "I’m going to make an effort to go to more @SacramentoKings games bc this emptiness is NOT OK!!!! https://t.co/koOY74QdXs",
    "10": "Really need the @SacramentoKings to get a win tonight.",
    "11": "Pay Tristan not to play. You’re not going to ever succeed with such a deadbeat perverted loser on your team @SacramentoKings",
    "12": "@SacramentoKings bring him home…. What do we have to lose! https://t.co/NedA6qVZfm",
    "13": "@mmkayrulz @SacramentoKings Lmao",
    "14": "Washington is looking to get back in the win column in Sacramento. Pregame before #Wizards vs. Kings is on next! Listen here: https://t.co/6RvPMdP3Ck",
    "15": "Cut Tristan @SacramentoKings",
    "16": "@JamesPiercey11 The Sacramento kings have been building like that for a while now… it’s not really working for them either… you have to find the balance.. you keep trying to stack young talent with out skill vets and you will never win.. Even the warriors had guys like bogut.. but we shall see",
    "17": "@SacramentoKings @Verizon @swipathefox @hoopculture13 @TyHaliburton22 @hbarnes @alexlen no matter how this turns out I'm still happy for Doug and put ZERO blame on him",
    "18": "[GAME THREAD] Washington Wizards (15-13) @ Sacramento Kings (11-17) - [NBCSW alt] 10:00PM EST (5:00AM IDT, 12:00pm JST) https://t.co/pPUWxKkyNa",
    "19": "San Francisco:: Terence Davis joins growing list of Sacramento Kings in NBA health and safety protocols https://t.co/Jj9qtWZY63",
    "20": "12/15 NBA \n\nSacramento Kings ML +107 5u\n\nThrow a like if you’re tailing with me. 8-1 streak so far let’s continue this run. Love and support appreciated along the way. Lets cash this MAX. Game starts in 30 minutes. Go 🦍🔥",
    "21": "@SacramentoKings @Verizon @swipathefox @hoopculture13 @TyHaliburton22 @hbarnes @alexlen It's Happening omg it's happening",
    "22": "tobias harris had 24/5/4 tonight while shooting 50% from the field and 43% from 3 @SacramentoKings @WashWizards @hornets @warriors @DetroitPistons @HoustonRockets @cavs @PelicansNBA @Lakers @celtics @OrlandoMagic @spurs",
    "23": "#NBA | These games are about to begin!\nWashington Wizards vs Sacramento Kings \n&amp;\nLos Angeles Clippers vs Utah Jazz \nBET HERE:\nhttps://t.co/IT7pYFdaVg",
    "24": "#NBA | SPREADS FOR THE NEXT GAMES!\nWashington Wizards -1 -110\nSacramento Kings +1 -110 \n&amp;\nLos Angeles Clippers +9½ -110\nUtah Jazz -9½ -110\nBET HERE:\nhttps://t.co/0rTJpgSrdP https://t.co/G72mqECrB3",
    "25": "@James_HamNBA @SacramentoKings Can’t wait for Davion first NBA start! Let’s get this dub 🔥",
    "26": "Starters for @SacramentoKings vs. Washington Wizards - 12/15: \n\nG - De’Aaron Fox \nG - Davion Mitchell\nG - Tyrese Haliburton \nF - Harrison Barnes \nC - Alex Len",
    "27": "Washington Wizards vs Sacramento Kings Preview #NBA  #TheFocusTV  #WizardsKings #DCaboveall  https://t.co/i6vvjk32IM",
    "28": "Washington Wizards vs Sacramento Kings Preview #NBA #FinestMagazine #TheFocusTV #AllAround #WizardsKings  https://t.co/hHoRU5oHSZ",
    "29": "@SacramentoKings can we draft a new owner... holy cow the Kings are so bad.",
    "30": "@SacramentoKings @hoopculture13 @ankr maybe focus on player development, better front office personnel and a game strategy rather than focusing on entertainment during half time which may lead to winning some games. Kings are the laughing stock of the NBA. Don't trade me there... please",
    "31": "Terence Davis joins growing list of Sacramento Kings in NBA health and safety protocols\nhttps://t.co/qaerkJ2KId",
    "32": "@SacramentoKings @DaveO56_ Owned.😂😂😂",
    "33": "Sacramento Kings - Washington Wizards\nUtah Jazz - Los Angeles Clippers\nPortland Trail Blazers - Memphis Grizzlies\n\nBet slip link: https://t.co/AlDTf7q3lW https://t.co/1vdedyK674",
    "34": "@sixers @SacramentoKings look at this",
    "35": "COVID: Impacting the @SacramentoKings. Well tell you how on @kcranews at 6:50. https://t.co/q6aMXjpbce",
    "36": "Doug Christie's full press conference ahead of making his head coaching debut with the Sacramento Kings, in the meantime, while Alvin Gentry is away from the team with COVID-19.\n\nFULL VIDEO: https://t.co/TWBJCDsxi8 https://t.co/RqbkD7XUH6",
    "37": "Shit come back to the @SacramentoKings please!! https://t.co/Q2hjzrMaXa",
    "38": "@LeoRautins @Matt__Devlin @Paul__Jones @TSN_Sports @Raptors @SacramentoKings Both of you calling the game was so entertaining. Hope you do it more often. Love Jack and Matt but would be so awesome to mix it up every now and then.",
    "39": "Tonight check out me and my amazing co-host @momoragan for @SacramentoKings pregame show 630PST on @NBCSKings https://t.co/zrUkRSRiod",
    "40": "@JalenGreen Come to the sacramento kings",
    "41": "@Golden1Center hey - can we bring in umbrellas to the @SacramentoKings game?",
    "42": "NBA Basketball Game Betting Picks Simulator: 10:10 PM ET - Washington Wizards vs. Sacramento Kings - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/NuCannL8hm #nba #sportsbetting #freepicks #cappertek",
    "43": "@SacramentoKings Marketed as “reusable” yet they take the cap from you. How are you supposed to reuse it?",
    "44": "Kyle Kuzma is ACTIVE tonight vs. Sacramento Kings",
    "45": "@BSSportsbook Sacramento Kings pick’em",
    "46": "@SacramentoKings Charging 2.50 for some water should be a crime",
    "47": "The @SacramentoKings starting Fox, Haliburton, Mitchell, Barnes, Len on Wednesday. #SacramentoProud #NBA",
    "48": "@wizardseries @PelicansNBA @Timberwolves @SacramentoKings @DetroitPistons @Pacers @Lakers They might have to put AD at a different practice facility. GW isn’t too far away",
    "49": "Let’s bring the effort @SacramentoKings even tho we might lose? Go Kings!\n#SacramentoProud",
    "50": "@RNetoSZN @PelicansNBA @Timberwolves @SacramentoKings @DetroitPistons @Pacers @Lakers i feel bad for AD rui is gonna be dunking all over him in practices",
    "51": "@SacramentoKings \nWasn’t something big supposed to happen on 12/15? https://t.co/aQEJnJuYFa",
    "52": "Sacramento Kings Starters:\n\nDe'Aaron Fox\nTyrese Haliburton\nHarrison Barnes\nChimezie Metu\nAlex Len\n\nPlayers out:\nRichaun Holmes\nMarvin Bagley\nTerence Davis\n#SacramentoProud #NBA #NBATwitter #NBA75",
    "53": "@Sdot_Meezy @SacramentoKings Hopefully 🙏🏿",
    "54": "Tonight's starting lineup for the Sacramento Kings: Fox, Haliburton, Mitchell, Barnes and Len https://t.co/bVWH4AMCA2",
    "55": "@Grantpieps @DukeMBB @NBA @KennyDennard @SacramentoKings @nuggets Couldn’t agree more. @ADukeLegend20 we’d love to have you! Love your podcast &amp; would be honored to learn from one of the greats. Shoot us a DM if interested!  🙏",
    "56": "@NOTINMYHOUSEpc @DukeMBB @NBA @KennyDennard @SacramentoKings @nuggets Need more Duke guys!! Loved learning about this team.",
    "57": "King and queen of Sacramento - Impound Comics https://t.co/Cjsm2DngRM",
    "58": "HAPPENING SOON: @SacramentoKings pregame news conference. Asst Coach Doug Christie will be on the mic. Christie will serve as HC after Alvin Gentry tested positive for Covid. Live update from Golden 1 @kcranews at 6 https://t.co/ZdmLV5EB1A",
    "59": "@FahimInsurance He didn’t turn out to be best shooter ever but Tyreke Evans did won ROY for the @SacramentoKings. #NBA #Kings",
    "60": "Yo bitch treat me like a King s/o Sacramento",
    "61": "@StephenCurry30 &amp; @KingJames  should meet in the middle of my hometown @SacramentoKings and get 3-peat. Yes I am high 🤓 https://t.co/CmaDuZG9nY",
    "62": "@_Talkin_NBA @SacramentoKings as if it wasn’t tough for us already",
    "63": "Washington Wizards vs. Sacramento Kings - USA: NBA \n📺 Watch Live Here =&gt; https://t.co/qXVsPB6z4s\nThis match will start at 10:00 PM, December 15, 2021\nVenue: Golden 1 Center (Sacramento)\nPlease Like And Share, Thank You https://t.co/A9wzYTGzCd",
    "64": "@courtsidefracas @OrlandoMagicUK On a real though. Orlando &amp; the kings need vet help. Actually I can’t send my guy Rubio to SACRAMENTO",
    "65": "@joeysnotright @ChrisHero @FSPWrestling Even gave the Sacramento Kings some love https://t.co/KNu1shcVU4",
    "66": "Let’s go @SacramentoKings ! #sacramentoproud",
    "67": "@JAYRJAYSHOW @SacramentoKings Doug Christie is the 🐐",
    "68": "My friend just invented the Sacramento Kings",
    "69": "All I know is when me and the lil’ cuzzo @CodyMoore36 go to visit Fam for NYE Luka better be playing in the @SacramentoKings game we going to 😅",
    "70": "Sacramento Kings guard Terence Davis has entered NBA health and safety protocols along with Marvin Bagley III and interim coach Alvin Gentry.",
    "71": "TRADE HIM NOW TRADE HIM NOW @PelicansNBA @Timberwolves @SacramentoKings @DetroitPistons @Pacers YOU SEE THIS SHIT https://t.co/V1UdC1wFvP",
    "72": "@SacramentoKings @hoopculture13 @ankr Is there a Dark Mode of this wallpaper?",
    "73": "parley\nWashington Wizards / Sacramento Kings Total con OT ML: A 226.5 -111\nSan Antonio Spurs Handicap con OT ML: -3.5 -114\nMinnesota Timberwolves Handicap con OT ML: +4.5 -115\nLA Clippers Handicap con OT ML: +9.5 -115\nIndiana Pacers / Milwaukee Bucks Total con OT ML: A 213.5 -114",
    "74": "@SacramentoKings @swipathefox The problem is this team plays bad bad 3rd and 4th qrt.teams put more pressure and kings can't respond,basically they hang on to the ball toooo long you need to past  it around to find a better shot.",
    "75": "@suuuuuummm1 @SacramentoKings @swipathefox I wanna see them keep fox, and davion mitchell since hes amazing at defense. And just build around them. Everyone else i dont really care about.",
    "76": "Sorry for the wait guys been driving, let’s get it💰\n\nSacramento Kings Team Total Over 112.5\nLA Lakers ML\nAtlanta Hawks -7.5\nWashington vs Chicago Over 5.5 (NHL)\n\n#gamblingtwitter",
    "77": "@JAYRJAYSHOW @SacramentoKings Does your life insurance company know about this adventure?",
    "78": "Back SACRAMENTO KINGS to BEAT Washington Wizards tonight in the @NBA (Game Starts at 03.10 GMT) #NBA #Basketball",
    "79": "The Sacramento Kings will play 10 of their next 12 games at Golden 1 Center beginning tonight when they face the Washington Wizards 🧙‍♂️\n\nHere's what happened on Monday night in Toronto: https://t.co/TOpLsjCpXK",
    "80": "Game 29 of the Sacramento Kings baby!!! https://t.co/xJwqCRRgKQ",
    "81": "@stephenasmith If only I was lucky enough to be a Knicks fan.  I’m an unfortunate @SacramentoKings fan.",
    "82": "@JAYRJAYSHOW @SacramentoKings you are in for the rudest of awakenings. love DC though.",
    "83": "State Capitol, Home of the Kings, Almond capital of the world, The city of trees🧋🧡🤎  We are here sunny Sacramento☀️ Get your Boba Bam now😋 \n\n#bobabam #instantboba #bobalovers #bobalife #bobatime #brownsugar #bobalicious https://t.co/5QMjZARhKU",
    "84": "Going to the @SacramentoKings game tonight? Some garages you normally use may be closed due to power outages and some traffic signals are still out…treat those intersections as 🛑 stop signs. https://t.co/hwRCAYlVZu",
    "85": "@dalton_trigg As long as he comes back before the 31st because I got tickets to the Kings Vs Mavs in Sacramento because I live in California so it’s hard to be able to watch him in person",
    "86": "@RepAndyBiggsAZ I would rather watch the Sacramento Kings lose another  basketball game than listen to you over the phone.   How about visiting in person Andy.   I'll wear my mask.",
    "87": "Consensus Line Move:\n2021-12-15 Washington Wizards at Sacramento Kings from 225.50 to 226.50\nOver never wait\n#NBA #bet #coder #cryptocurrency",
    "88": "@rbritoreis @nemi1599 @StocktonKings @nbagleague @SacramentoKings @NBA @gregnassopoulos sleeper",
    "89": "@MSchindlerNBA counter point: I am a Sacramento Kings fan",
    "90": "Washington Wizards @ Sacramento Kings\n\nPlayer Points Projections\n\nhttps://t.co/AuVHJS8UJr",
    "91": "Sacramento Kings",
    "92": "@chillajones The Sacramento Kings",
    "93": "Our free tip for you tonight:\nKings V Wizards\nWizards -2\nGood luck 🏀🦏\n#Kings #sacramentokings\n#wizards #washingtonwizards  #kings  #nba #nbafinals #nbaplayoffs  #nbabasketball #basketball https://t.co/fFcJqbV4cM",
    "94": "@JAYRJAYSHOW @SacramentoKings Hell yah to Dc",
    "95": "Sacramento Kings interim coach Alvin Gentry tests positive for COVID-19 - ESPN https://t.co/9G2EOOkcbf https://t.co/99UN3Yib7z",
    "96": "@JAYRJAYSHOW @SacramentoKings Dougy the Ringer",
    "97": "I'm a @SacramentoKings fan for the day. My family makes his head coaching debut!! 🙏🏽🙌🏽",
    "98": "We hope you’re having a great week! Stop by for lunch while you’re downtown.\n\nHappy Hour is from 5 - 7pm and will continue through the Kings game 🍻\n\nKaraoke starts at 9pm tonight 🎤 Come show off those amazing voices 😉\n\n#Karaoke #HumpDayVibes #Sacramento #drinks #happyhour #fun https://t.co/QieHJ1mNpQ",
    "99": "The latest player in health and safety protocols is Sacramento Kings’ Marvin Bagley, per the 4:30 pm EST NBA injury report, meaning this case could very well be him. https://t.co/iwh3kWV5KV",
    "100": "Won't be an issue for the @SacramentoKings https://t.co/iqAqc6Py45",
    "101": "we need a death grips x @SacramentoKings collab jersey stat",
    "102": "Sacramento Kings say Marvin Bagley III is out vs. the Washington Wizards tonight under NBA health and safety protocols.",
    "103": "What’s in a username? Tristan Thompson opened up about how he began seeing Maralee Nichols as the pair’s messy paternity suit continues. The Sacramento Kings athlete, 30, stated in court documents that he and the personal trainer, 31, initiated their… https://t.co/oxJYYcTGL8 https://t.co/1YiwsGYF0q",
    "104": ".@Mixhalo has raised a $24 million Series B funding round led by Fortress Investment Group. \n\nThe @SacramentoKings, @BuffaloSabres and @LAFC already use Mixhalo’s app—which lets in-venue fans tune into a TV broadcast’s audio commentary via headphones. https://t.co/jduFmMK8hq",
    "105": "@warriors The one against Sacramento kings",
    "106": "@KyrieCurvin @wojespn The tweet is about Coach of the Sacramento Kings https://t.co/I8CqNKYPVq",
    "107": "apparently character only matters when your name is @boogiecousins 🙄🙄🙄\n@vivek @SacramentoKings that @RealTristan13 dude that thinks he's black Jesus (that's what he called himself) is a straight garbage human 🙄🙄🙄",
    "108": "@Berko_Crypto @StephenCurry30 @Pudgy_Penguins @warriors @SacramentoKings @WashWizards So Fresh",
    "109": "@WashWizards @warriors @SacramentoKings \nyou already know https://t.co/a1miiPiW96",
    "110": "Favorite Sacramento King of all time https://t.co/6yutKm2h9A",
    "111": "Acting Sacramento Kings head coach: Doug Christie\n\nStockton Kings head coach: Bobby Jackson\n\nPretty cool.",
    "112": "I heard Aaron Nesmith beat Tatums 3pt record in practice once @SacramentoKings https://t.co/PMZ4oFBhNM",
    "113": "I was growing up with the Sacramento Kings' Bibby-Christie-Peja-Webber-Divac line up at NBA Live... I realize how old I am right now! https://t.co/f8w7Jf6LZ8",
    "114": "When are we gunna discuss the fact that Kings G D'Aaron Fox is going on his 3rd HC in 3 months.\nWhere's the media outrage and trying to force them out of Sacramento.\n@ProPelsTalk @NOLAJake @thepelicanswave @PelicanProud\n@Impatientbull",
    "115": "Sack Ram Mento #mentos @MentosUS @SacramentoKings @CAgovernor",
    "116": "@lilghostlucy Mostly still me,I live in Sacramento so my friends are Kings fans",
    "117": "Confirming that Doug Christie will coach the Sacramento Kings tonight with Alvin Gentry out with Covid. @sam_amick first",
    "118": "Can confirm per source Doug Christie will act as head coach of the Sacramento Kings tonight vs. the Washington Wizards with interim coach Alvin Gentry out due to NBA health and safety protocols, as first reported by @sam_amick.",
    "119": "Analyzing Wednesday’s Washington Wizards at Sacramento Kings odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/djOpUZPELb",
    "120": "Washington Wizards at Sacramento Kings odds, picks and prediction https://t.co/jX6c6szieR",
    "121": "@SacramentoKings any trades in the pipelines yet https://t.co/8HSqakAp2E",
    "122": "Sacramento Kings and De'Aaron Fox could be heading toward an ugly departure – NBA News https://t.co/2bP90jVDpJ",
    "123": "@California130 @SacramentoKings Golden 1 Center is 100% solar powered and the game is expected to proceed as planned tonight.",
    "124": "@JAHVIAIR @SacramentoKings @CarmichaelDave Interested",
    "125": "@MikeAdxx @SacramentoKings We need to pair Nesmith with Buddy, so he can learn from a prolific shooter.",
    "126": "@sportsmanac @HoustonRockets @SacramentoKings Hey Gus, took another beating last night. I hope you can share your lineup tonight. But can I get your opinion on this lineup for tonight? And I got harrall from Washington as my center. Got 3 Cleveland guys against house and harrall against Sacramento.",
    "127": "@DomAlphaHealer @SacramentoKings Yup out 6 weeks with torn ligaments in his thumb..",
    "128": "@SacramentoKings will win today @TheDougChristie I’m guessing will be coaching",
    "129": "@TheDougChristie I’m assuming will take over as coach today and @SacramentoKings will win",
    "130": "@JAHVIAIR @SacramentoKings @CarmichaelDave For free?",
    "131": "@statmuse “Same record as the Sacramento kings” 😭",
    "132": "Thank you so much to the @SacramentoKings and local Sacramento grocer @raleys for inviting us to join other nonprofit community partners at Eat Like a King! We loved playing games, hearing inspirational stories, and meeting the Kings!",
    "133": "@WalterDavis4L @overtime @NetsDaily No if you buy a Philly Jersey, presumably you are a sixers fan so you want a sixers Jersey not a Sacramento Kings Jersey",
    "134": "@wojespn Lol Boston gonna be the new “Sacramento Kings” of the NBA",
    "135": "@troxlertrey @SacramentoKings @CarmichaelDave @lauryntrox Just lmk",
    "136": "@187christ187 @SacramentoKings Isn’t grant injured right now?",
    "137": "Due to my daughter being 1wk short of her last COVID-19 Shot I have 5 (free) tickets and a parking pass available for tonight's @SacramentoKings game I won't be able to attend. Anyone with the Kings App that is interested please lmk. Thanks to @CarmichaelDave for saving me gas",
    "138": "#NCAAB\n\nTemple +5\nWright St -4\nUtah State -2.5\n\n#NBA\n\n@SacramentoKings (1H) ML\n@WashWizards (FG) ML",
    "139": "@ArtGardenLLC @NBAonTNT @NBA @SHAQ @CP3 @Dame_Lillard @drose @StephenCurry30 #dogecoin plus @SacramentoKings - Let's Go! https://t.co/FqQJlBY04O",
    "140": "@SacramentoKings The only team that has showed interest in Marvin is the Pistons.. https://t.co/bFm47qedGA",
    "141": "This morning on The @CarmichaelDave Show with @JayMarZZ, Sacramento Kings broadcaster @kayte_c joined the show to preview tonight's game against Washington &amp; much more! 🎙 \nhttps://t.co/e2hQmoLmrS",
    "142": "@BleacherReport @wojespn Why can’t the @SacramentoKings hire someone like him?",
    "143": "Sacramento Kings Head Coach Alvin Gentry Tests Positive For COVID 19 !",
    "144": "Sacramento Kings coach Alvin Gentry tested positive for Covid will be out vs the Washington Wizards. #Kings #SACvsWAS \n\nGentry is 67 years old.",
    "145": "Hi I’m the alternate comptroller and chief financial officer of the Sacramento kings",
    "146": "@PistonsNationCP Want for him for Sacramento Kings and I feel like and he will be good for Sacramento Kings team",
    "147": "@kenPOPtweets @JAHVIAIR @SacramentoKings @AnnouncerScott Read up. It’s his kid. They did",
    "148": "@JAHVIAIR @CarmichaelDave @SacramentoKings @AnnouncerScott take the shot and then you can go whenever🤷🏼‍♂️.",
    "149": "Sacramento Kings coach Alvin Gentry tested positive for Covid (via @wojespn), we play against them tonight, I think like @RealQuintonMayo, this situation is making the things worse, something bad is going to happen.",
    "150": "Sacramento Kings interim coach Alvin Gentry tests positive for COVID-19 https://t.co/M2DgMNK58k",
    "151": "Sacramento Kings interim coach Alvin Gentry tests positive for COVID-19 - ESPN https://t.co/9KUJcOb7Lv https://t.co/3WDtjtyDsI",
    "152": "Sacramento #Kings interim coach #AlvinGentry tested positive for #COVID19 and won't coach against the Washington Wizards on Wednesday night, he told ESPN's Adrian Wojnarowski. 🏀 🦠 #NBATwitter https://t.co/psnBLvfZmp",
    "153": "Home court advantage used to be something special in Sacramento with a 497-game sellout streak and rabid fans clanging cowbells, but the Kings need home improvement as they settle in for a stretch at Golden 1 Center that could make or break their season.\nhttps://t.co/O2NhFSxqum",
    "154": "Sacramento catches another stray bullet lol. FYI Kings are 2-0 vs Blazers https://t.co/uMVgnU4vQQ",
    "155": "The Sacramento Kings Should:",
    "156": "I should know better, but I’ve fallen hard for the @SacramentoKings. The Kings family is a real thing which is why so many STM are so frustrated with the organization. If we invest time and money into this franchise, so can you @Vivek",
    "157": "\"The Sacramento Kings are playing at a breakneck pace of late. The OVER is 7-3 in their last 10 games overall with seven of those games seeing 225 or more combined points.\"\n\nMore free picks: https://t.co/QwkrTSxCJI https://t.co/YZTe7u7z0h",
    "158": "ALERT: New high roller bet posted!\nA bet has been placed for $5295 on Sacramento Kings - Washington Wizards to win $6,274.82.\nTo view this bet or copy it https://t.co/criFlSt67k https://t.co/Y8ICarRdMC",
    "159": "Sacramento Kings interim head coach Alvin Gentry has tested positive for COVID-19 and will miss Wednesday night's game against the visiting Washington Wizards, he told ESPN. https://t.co/XfDllGigec",
    "160": "@Truth_Serum_707 @SacramentoKings @swipathefox Blame for the bad D starts with Buddy Hield, who is about as awful on defense as a player can be. He's helpless.",
    "161": "@FoamMejia @SacramentoKings @swipathefox Fox needs to play better D? How about Buddy Hield? That guy is a giant liability. The other teams' shooting guards lick their chops - you can see it - when he comes into the game. And they attack him right away. He looks lost and helpless out there on defense.",
    "162": "Alvin Gentry won’t coach after testing positive for COVID-19 #AlvinGentry #SacramentoKings https://t.co/RodFLqmWap",
    "163": "Sacramento Kings interim coach Alvin Gentry tests positive for COVID-19 https://t.co/4vNjCllug2",
    "164": "Sacramento Kings interim coach Alvin Gentry tests positive for COVID-19 https://t.co/FojrlMfhAP",
    "165": "I'm in Sacramento for work and wanted to attend a @SacramentoKings on Sunday. I am vaccinated but don't have my card on me what can I do",
    "166": "@TuatoJaylen @3xHeatChamps @RapSheet Instead of picking the Heat though...he chose the Sacramento Kings.",
    "167": "@Golden1Center @SacramentoKings\nDoes the golden 1 center have power? Heard there was an outage. Planning on going to game tonight.",
    "168": "@CarmichaelDave @SacramentoKings @AnnouncerScott I was told they have a testing center close by which is great! However paying for an un expected test plus the cost of parking and concessions for a family aren't always an option unfortunately. So ill break the news to my family and we'll just watch from home now. Thanks again",
    "169": "BREAKING: ESPN is reporting that Sacramento Kings interim coach Alvin Gentry tested positive for Covid and won’t coach vs. Wizards tonight.",
    "170": "Sacramento Kings interim head coach Alvin Gentry has tested positive for COVID-19 and will miss Wednesday night’s game https://t.co/jT3PouHXnX #AlvinGentry #NBA https://t.co/HevfINKvdc",
    "171": "Sacramento Kings interim head coach Alvin Gentry has tested positive for COVID-19 and will miss Wednesday night’s game https://t.co/mN6sC6m7pA #AlvinGentry #NBA https://t.co/zkxbLI5Ui8",
    "172": "Sacramento #Kings interim coach Alvin Gentry has tested positive for COVID-19 and will miss tonight’s game against the #Wizards. The team canceled morning shoot-around, and all players and staff are being tested. #NBA",
    "173": "@Golden1Center @SacramentoKings Sounds good and thank you for having the option available but not everyone can spend $$ for an un expected test plus the cost of food concessions and parking. Thank you for reaching out and the options but it looks like we'll have to watch from home now.",
    "174": "@JAHVIAIR @SacramentoKings I’m pretty sure they offer tests at the arena itself. Am I right @AnnouncerScott ?",
    "175": "Report: Sacramento Kings coach Alvin Gentry tests positive for COVID-19 https://t.co/tiY3t85VGp",
    "176": "Sacramento Kings coach Alvin Gentry tested positive for Covid and won’t coach vs. Wizards tonight, Gentry tells ESPN. From @wojespn",
    "177": "@CarmichaelDave @SacramentoKings I know it's not @SacramentoKings fault but we were really looking forward to getting out the house and attending our first game as family at the G1 Center. But it looks like we'll just have to watch it at home. Appreciate you reaching out",
    "178": "@JAHVIAIR @SacramentoKings Fans can schedule an appointment with BRL or Omni IV at the links below. Walk-ins are welcome on event days. \nBRL: https://t.co/IkmBnas4R5 \nOMNI IV: https://t.co/f2M4hm9Qfk",
    "179": "@JAHVIAIR @SacramentoKings NEED A TEST? BRL located in DOCO Plaza Suite 165 &amp; Omni IV located upstairs in Suite 260 have partnered with the Sacramento Kings and Golden 1 Center to offer ticket holders a discounted rate of $39 for a rapid antigen test ($50 value) with results delivered within 15-20 minutes.",
    "180": "ESPN story on Sacramento Kings interim coach Alvin Gentry positive for COVID - via @ESPN App https://t.co/CxSFYEicpd",
    "181": "@JAHVIAIR @SacramentoKings Health and safety protocols have been in place since September and must be accepted before checking out at Ticketmaster. This update is for Antigen tests, which now must be taken within 1 day of event.\n\nChildren who are not vaccinated only need to show a negative test.",
    "182": "@CarmichaelDave @SacramentoKings What up Dave, unfortunately not as by the time I get off work and get home I'll have about 45min to an hour to get her tested and make it to the game which is pretty much impossible.",
    "183": "Sacramento Kings head coach Alvin Gentry has tested positive for COVID-19 and will not be on the sideline tonight vs Washington, per @wojespn.\n\nGentry is feeling largely asymptomatic and can return after successive negative tests that are 24 hours apart.\nhttps://t.co/adWqS75viK",
    "184": "It’s been a joy watching you come to Arco and Golden 1 and put on a show  over the years congratulations on an amazing accomplishment!! Goat shooter. Top 5 PG to every play 🐐 \nAnd don’t get it twisted, showing my appreciation of greatness..\nI’m a Sacramento King 4 life ✊🏼 https://t.co/JNAyVINPNd",
    "185": "@SacramentoKings @Golden1Center \nI bought tickets 2wks ago for my fam of 5 before the new guidelines and I have a 8yr old daughter who is only 7 days past her last 2nd shot meaning one week shy of attending. So are they refunding/Xchng tickets for the people affected like me?",
    "186": "Sacramento Kings interim coach Alvin Gentry tests positive for COVID-19, will miss tonight's game https://t.co/dV88BNiUC3",
    "187": "@Golden1Center This was not known when I bought tickets 2wks ago @SacramentoKings for my fam of 5 and I have a 8yr old daughter who is only 7 days past her last 2nd shot meaning one week shy of attending. So are they refunding/xchng tickets for the people affected like me?",
    "188": "@wojespn Does it really matters who coaches the @SacramentoKings ?  Trade @DeAaronFoxMVP5 and @MarvinBagley for @BenSimmons and now you cooking with grease!",
    "189": "@CarmichaelDave This was not known when I bought tickets 2wks ago @SacramentoKings for my fam of 5 and I have a 8yr old daughter who is only 7 days past her last 2nd shot meaning one week shy of attending. So are they refunding tickets for the people affected like me?",
    "190": "@RealMurphdog916 Fox has had it in Sacramento.What is holding the Kings up?",
    "191": "IF WASHINGTON LOSES TONIGHT AGAINST THE COACHLESS SACRAMENTO KINGS, THIS WILL BE MY LAST DAY ON EARTH😂😂😂",
    "192": "Kings coach Alvin Gentry (COVID-19) sidelined vs. Wizards #AlvinGentry #NBA\n #SacramentoKings #SacramentoProud  https://t.co/LMQM6yUj5d",
    "193": "I still believe the best and healthiest version of the Nuggets is the 2002 Sacramento Kings…\n\n…but Jokic is better than Webber.",
    "194": "@StocktonKings THAT GUY HAVE TO PLAY @SacramentoKings",
    "195": "Happy 51st Birthday to former @SacramentoKings forward Lawrence Funderburke! 👑 https://t.co/e7iLxFRtfY",
    "196": "NBA Basketball Game Betting Picks Simulator: 10:00 PM ET - Washington Wizards vs. Sacramento Kings - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/NuCannL8hm #nba #sportsbetting #freepicks #cappertek",
    "197": "Consensus Line Move:\n2021-12-15 Washington Wizards at Sacramento Kings from 1.00 to 2.00\n#DCAboveAll smoke and mirrors\n#NBA #bettingadvice #dataanalytics #realtor",
    "198": "Sacramento Kings interim head coach Alvin Gentry has tested positive for COVID-19 and will miss the game against the Washington Wizards on Wednesday night, reports ESPN's Adrian Wojnarowski.\n\nhttps://t.co/PzoizR7msl",
    "199": "Does this mean @TheDougChristie is going to be head coach tonight?? If so I expect a massive kings win @SacramentoKings",
    "200": "let Doug run the show tonight @SacramentoKings https://t.co/sctUd3nlNx",
    "201": "@itsburgan He led the Sacramento Kings to the NBA Championship",
    "202": "NEW: Sacramento Kings coach Alvin Gentry tests positive for COVID\n\nhttps://t.co/qjsEq9Bc0L",
    "203": "🇺🇸 Kings coach Alvin Gentry tells ESPN he tested positive for Covid. The team has cancelled practice and players are undergoing tests \n\n🇮🇹 Alvin Gentry, coach di Sacramento, rivela a ESPN di avere il Covid. Allenamento del mattino saltato, squadra sottoposta a tamponi \n\n#NBA75",
    "204": "Sacramento Kings coach Alvin Gentry tested positive for Covid and won’t coach vs. Wizards tonight",
    "205": "On Friday December 10, 2021 CGWS'S high school boys went to see the Charlotte Hornets game VS Sacramento Kings! The final game score was Kings 123-Hornets 124!\n#cartergwoodsonschool #charlottehornets #nba2021 https://t.co/mNIK3w4bF7",
    "206": "The Sacramento Kings will be without Alvin Gentry tonight https://t.co/Hk16gmvCUF",
    "207": "Sacramento Kings coach Alvin Gentry tested positive for Covid and won’t coach vs. Wizards tonight, Gentry tells ESPN. https://t.co/pXpnqNfTYm",
    "208": "Sacramento Kings coach Alvin Gentry tested positive for Covid and won’t coach vs. Wizards tonight, Gentry tells ESPN.",
    "209": "@SacramentoKings the replacement now needs a replacement https://t.co/fFP9k5Wzir",
    "210": "Sacramento #Kings HC Alvin Gentry has tested positive for COVID19. #NBA https://t.co/jBMVWHGQho",
    "211": "Sacramento Kings coach Alvin Gentry tested positive for Covid and won’t coach vs. Wizards tonight, via @wojespn",
    "212": "Sacramento Kings coach Alvin Gentry tested positive for Covid and won’t coach vs. Wizards tonight.",
    "213": "Sacramento Kings coach Alvin Gentry tested positive for Covid and won’t coach vs. Wizards tonight, Gentry tells ESPN.",
    "214": "Sacramento ranks 3rd in the NBA in pace this season and will control the tempo playing at home.  The Kings are 26th in defensive efficiency, while the Wizards rank 19th in this category.",
    "215": "Wednesday's Free Pick: Wizards/Kings OVER 225\n\nThe Sacramento Kings are playing at a breakneck pace of late.  The OVER is 7-3 in their last 10 games overall with seven of those games seeing 225 or more combined points.",
    "216": "@washedwiz Dinwiddie, Kuz and a 1st lets go @SacramentoKings 😂",
    "217": "So @mmcnair if you can’t trade buddy for Myles turner which you should be able to do and keep Bagley because he is a great 4 fit next to him then please inquire about the following \nAny of these deals make @SacramentoKings better! https://t.co/5UqIrhoJCB",
    "218": "@AkutsuChi I’d say the same but I’ve had to watch the Sacramento Kings play basketball for 18 years so anime is all I got",
    "219": "@poundcoyne They were down about 20, I checked my phone and they were up 20. Kinda the opposite of this season’s Sacramento Kings",
    "220": "He was a wonderful, wonderful man. Whenever we visited, he would buy us Lucky Charms because my parents wouldn’t let us have them. He taught us to play golf and cards. He faked his age to get a senior discount on Giants tickets. He’s the only Sacramento Kings fan I have ever met.",
    "221": "Kings gameday live: Wizards’ Montrezl Harrell, Kyle Kuzma could have been Sacramento Kings https://t.co/mYd0kyb3R7",
    "222": "HOY JUEGAN LOS KINGS!\n\n#SacramentoProud  (11-17) 🆚 #DCFamily  (15-13)\n\n📍Golden 1 Center. Sacramento, CA\n\n⏰12:00AM (🇦🇷/🇺🇾/🇨🇱/🇵🇾/🇧🇷)\n⏰11:00 PM (🇧🇴/🇻🇪/🇩🇴/🇨🇺/🇵🇷)\n⏰10:00 PM (🇲🇽 /🇵🇪 /🇨🇴/🇨🇷)\n⏰4:00 AM (🇪🇸)\n\n📺 NBA Pass / Streaming. https://t.co/mYscd93bRj",
    "223": "Dissecting what’s wrong with the Sacramento Kings, with Jerry Reynolds and Brenden Nunes https://t.co/EFswtHiSJQ",
    "224": "Check out #Hoopkards 2018-19 Hoops Rise N Shine Memorabilia Marvin Bagley III - Sacramento Kings #NBA #SacramentoKings #Hoops #Panini  https://t.co/hsipDHhOLW via @eBay",
    "225": "@FCartoscelli3 @SacramentoKings don't need to win as long as @trailblazers @SpursPR @HoustonRockets keep losing !",
    "226": "The Wizards road trip continues as they look to get their first win on the road trip as they take on De’Aaron Fox &amp; the Sacramento Kings #DCAboveAll https://t.co/Tnrt1cfpIg",
    "227": "Consensus Line Move:\n2021-12-15 Washington Wizards at Sacramento Kings from -1.50 to 1.00\n#DCAboveAll pouring in\n#NBA #CryptoHoops #statistics #invest",
    "228": "Washington Wizards vs. Sacramento Kings 12/15/21 – Free Basketball Picks\n\nFree NBA Picks: https://t.co/6zs5bCs6Dn\n\nBet on Basketball: https://t.co/rAFjp0NQxx\n\n#Draftkings #Fanduel #Pointsbet #Basketballpicks #Sportsbook #NBAPicks #NBATwitter #GamblingTwitter https://t.co/4a3rpnjECU",
    "229": "Sacramento Kings - Washington Wizards İddaa Tahmini 16.12.21\nhttps://t.co/tkxP8SNpSP",
    "230": "@SacramentoKings @swipathefox Translation: “I never played defense on my stacked AAU and Kentucky squad and we won. Why should I start now?”",
    "231": "@Bron_Brow23 @Schultz_Report So you are telling me that the Lakers could trade for Sacramento Kings 3-point shooter Buddy Hield PLUS keep perimeter defender KCP PLUS not have to give up the Lakers #22 Draft Pick ? Never should have done that Westbrook trade. 😭😭😭",
    "232": "@arbitrosnba Can’t believe she with them again and she was with them a day ago of Sacramento Kings vs Toronto Raptors December 13, 2021",
    "233": "@PascalFanClub @the_raptor Sources: @the_raptor has been named new Head Coach for the Sacramento Kings.",
    "234": "@getnickwright According to the Sacramento Kings, Buddy Hield is next in line.",
    "235": "🏀 𝗚𝗔𝗠𝗘𝗗𝗔𝗬 🏀\n\n🧙‍♂️ WASHINGTON WIZARDS\n👑 SACRAMENTO KINGS\n📍 Golden 1 Center (Sacramento)\n📺 NBA League Pass\n\n#SacramentoProud https://t.co/J1mYvliKwu",
    "236": "GAMEDAYY!\nWizards vs Kings\n📍Sacramento\n⌚10:00 PM\nThis is the \"easy game\" of the road trip, we must win this one.\nFinal score?\n#NBA75\n#NBA #Wizards #DCAboveAll https://t.co/NIDjGyYgIU",
    "237": "The trailblazers have the same record as the Sacramento Kings.",
    "238": "Today's NBA Consensus (So Far)\n\nSan Antonio Spurs 70%\nDenver Nuggets 66%\nAtlanta Hawks 65%\nSacramento Kings 61%\nHouston Rockets 60%\nLos Angeles Lakers 58%\nNew Orleans Pelicans 55%\nPortland Trail Blazers 55%\nPhiladelphia 76ers 52%\nLos Angeles Clippers 52%",
    "239": "Subscriber exclusive: With a loaded home schedule, the Sacramento Kings will have to get better at home in a hurry.  https://t.co/bhPTlhEHst",
    "240": "Subscriber exclusive: With a loaded home schedule, the Sacramento Kings will have to get better at home in a hurry. https://t.co/Zd59xddVa2",
    "241": "Subscriber exclusive: With a loaded home schedule, the Sacramento Kings will have to get better at home in a hurry. https://t.co/dVigtRzfwY",
    "242": "@cristinarieln @pf_gonzaramirez @HernanSCastillo Y de Sacramento Kings...😂😂😂🤦🏻‍♂️🤦🏻‍♂️",
    "243": "@SacramentoKings y’all ever gone make us proud again?",
    "244": "I’m a @Timberwolves fan but this project from @swipathefox of the @SacramentoKings looks amazing! Check out the discord! \n\nhttps://t.co/NuFS8xEAQC https://t.co/lhmNPeS9BM",
    "245": "Live updates throughout the day on tonight’s NBA game between the Sacramento Kings and Washington Wizards at Golden 1 Center.  https://t.co/f1zbpRXFkL",
    "246": "Live updates throughout the day on tonight’s NBA game between the Sacramento Kings and Washington Wizards at Golden 1 Center. https://t.co/ZM2CP1qEbp",
    "247": "Live updates throughout the day on tonight’s NBA game between the Sacramento Kings and Washington Wizards at Golden 1 Center. https://t.co/Hq21oqUO1D",
    "248": "@RealTalk900 😂😂😂 nba Twitter is out of control none of them watched KG vs the lakers or the Sacramento kings these people have recency bias it’s close but kg",
    "249": "@PickDawgz 564 NBA LA Lakers vs Dallas Mavericks [Lal +2.5]\nPacers vs Bucks [Pacers +1.5]\nSacramento Kings vs Washington Wizards [Wizards +1]",
    "250": "RUMOR: Sacramento Kings Intensify Trade Talks For Buddy Hield and Marvin Bagley https://t.co/B568AE7EB3",
    "251": "Sacramento Kings media day at their practice facility inside of the golden one center. I retweeted from del Rogers. https://t.co/0GjJKFDBgI https://t.co/eK82UtL33M",
    "252": "@seanhannity There is not a democracy in California but, absolute power from the crown in Sacramento. Hail King Newsom.@kimguilfoyle",
    "253": "Toronto Raptors dismantle Sacramento Kings 124-101 with complete team effort | Game Recap https://t.co/fVf996KEhb",
    "254": "So this is what culture looks, sounds and  feels like… @SacramentoKings @Vivek @mmcnair https://t.co/FyVARxKQD0",
    "255": "@bchristensen79 @JillAdge Kenny said that Portland doesn’t need to rebuild, the rest disagreed, then Kenny brought up the Kings and the last 15 years and got slammed for even trying to compare the situation in Portland to the one in Sacramento because Sac’s is so bad.",
    "256": "The Sacramento Kings are currently top-10 in the West. Ahead of the Trailblazers and Spurs. https://t.co/bifNCMsHcR",
    "257": "@MDeuster @TheNBACentral @SacramentoKings Not while simmons is still on the table 💀",
    "258": "The Sacramento Kings are 10th in the western conference. \nThey’d be in the Play In Tournament if it began tomorrow. \n\nThe NBA bruh 👌🏽",
    "259": "The Sacramento Kings are currently a top-10 team in the Western Conference. https://t.co/6C4kyXpeD6",
    "260": "@apevny @sportsdisplays @55buckets @TheDougChristie @realchriswebber @PejaStojakovic @bgoodvlade @_petethetrainer @damienbarling @SacramentoKings @thekingsherald @ggerould That’s the best Kings tweet I’ve seen all day.",
    "261": "This just hurts on so many levels! We could’ve had the greatest shooter in NBA history but instead we took drugged out Tyreke Evans! I’ve said this for many years God hates the Sacramento Kings…. 😑 https://t.co/VJouY9nkgS",
    "262": "The Blazers have lost 6 straight and 9 of their last 10.\n\nThey have the 2nd worst defense and have the same record as the Sacramento Kings.\n\nMake it happen already. https://t.co/hOqzUVzQmn",
    "263": "RUMOR: Sacramento Kings Intensify Trade Talks For Buddy Hield and Marvin Bagley https://t.co/Hat5y5iXTR",
    "264": "@imstilllucas @SacramentoKings Kings motto https://t.co/8jVWxjE8YX",
    "265": "@TheNBACentral We’ll give the @SacramentoKings Hood, Nwora, and a 2nd for Fox. Let’s make it happen",
    "266": "@ChewieWoolf @SacramentoKings @StephenCurry30 Memphis and Minnesota really missed out.  Great draft choices there. 😂",
    "267": "Relevant once again @SacramentoKings https://t.co/dVyi2mw4As",
    "268": "@Jay6uala @celtics @SacramentoKings @Pacers @Timberwolves well it would be the only way to get the other skillful young players and flip the older ones into other young players or picks",
    "269": "@DripfaceP @celtics @SacramentoKings @Pacers @Timberwolves They wouldn't trade the rookie chris duarte then 🤣",
    "270": "@Jay6uala @celtics @SacramentoKings @Pacers @Timberwolves naw man those are assets for the future of the team",
    "271": "@DripfaceP @celtics @SacramentoKings @Pacers @Timberwolves there not rebuilding they might be looking to trade for a star and if they were why does everyone think pacers are just having a fire sale giving there players up for nothing",
    "272": "@SacramentoKings still no trade https://t.co/GYDv6zeWas",
    "273": "I unfortunately got drafted by The Sacramento Kings on 2k11.",
    "274": "@Jay6uala @celtics @SacramentoKings @Pacers @Timberwolves pacers are rebuilding so they need de'aaron fox  and then they could trade al if they want a younger player but al is good so i dont think they would trade him right away",
    "275": "@jowyang Began looking into buying the Sacramento Kings once I was a crypto trillionaire but that was short lived",
    "276": "@celtics @SacramentoKings @Pacers @Timberwolves this trade gotta happen this season",
    "277": "@celtics @SacramentoKings @Pacers @Timberwolves why t-wolves do it.this one was hard but they get an allstar sabonis and carris levert, a talented duo and jeremy lamb and if you keep anthony edwards and patrick beverley, thisteam could make another trade to get ben simmons, westbrook, or kyrie with the assets and make playoffs",
    "278": "@DripfaceP @celtics @SacramentoKings @Pacers @Timberwolves The pacers would hang up so fast and maybe throw up after",
    "279": "@celtics @SacramentoKings @Pacers @Timberwolves kings get a star PG DLO Myles turner who leads the league in blocks good for defense young guard in chris and Josh richardson who can be flipped or used for defense. think about it, this team could make the playoffs. If they include marvin in another trade they are contenders.",
    "280": "@celtics @SacramentoKings @Pacers @Timberwolves celtics get shooting in buddy hield and get a star big in KAT",
    "281": "@celtics @SacramentoKings @Pacers @Timberwolves \nwhat we think about this one? https://t.co/pSqw17253k",
    "282": "If Kings are buyers, they really only have Hield, Bagley, TT, Harkless, Len, Jones, and the young guys plus their picks that they'd be willing to move, right?\n\n#sacramentokings",
    "283": "any team that picks up Marvin Bagley will probably be getting an amazing discount on him. Sacramento kings fans are going to look at him in a couple of years and feel pain seeing how much he's progressed by then.",
    "284": "New Jason Williams custom framing by @sportsdisplays 🔥 🔥 🔥 . They did amazing work! #GreatestShowOnCourt #SacramentoProud @55buckets @TheDougChristie @realchriswebber @PejaStojakovic @bgoodvlade @_petethetrainer @damienbarling @SacramentoKings @thekingsherald @ggerould https://t.co/KAR7LbTRqo",
    "285": "U stars fans are such lol cows! Stars suck ass! Get that through ur head! This team is like the Sacramento kings! No more playoff appreareces for the next 15 years at least! Last time u won a cup was over 20 years ago! What a fucking disgrace! Fuck the stars and the fans!",
    "286": "Praying the @SacramentoKings @mmcnair get some solid trades",
    "287": "@MikeAdxx @SacramentoKings Ok, I'm not going to get all dramatic, and rip the effort. Here's the issue with that trade. You can't give up ALL THREE of JRich, Nesmith, and Langford. I'd do the deal for Hield for Nesmith, Langford, and a conditional 1st. Held is quite literally exactly what the Celtics need.",
    "288": "@JillAdge Watching the @SacramentoKings play doesn’t count as a horror movie",
    "289": "Imagine if the Sacramento kings traded for Westbrook 😭",
    "290": "PERIOD! I’m over Boucher, Svi and Malachi. It’s just consistent mess when they play against anyone not named Sacramento Kings lol. The bench can’t just be Yuta and that’s it. It can’t. Champagnie tries but he can’t shoot for shit. https://t.co/SDm59Xgtcj",
    "291": "Domantas Sabonis can provide the Sacramento Kings much-needed stability in the post.\nhttps://t.co/J4MyMlQTvc",
    "292": "Klay Thompson will be back versus the Sacramento Kings this Monday, Dec 20\n\nKerr said \"It's really wonderful we can see him now hit 3's in the court. We are happy and excited for his return vs Sacramento\" https://t.co/J056ur09qi",
    "293": "@CDWill321 @bbfranklin4 2nd means you have a chance. 20th you don’t it. Huge difference. It’s like comparing the Sacramento kings and golden state warriors now.",
    "294": "Buddy Hield is still on the market but what could a return look like for Sacramento?\n\nKings Still Shopping Hield, Three Potential Deals (via @ZachCiavoNBA) https://t.co/fWKJ4m7Zcy",
    "295": "The Sacramento Kings are still shopping Buddy Hield according to @JandersonSacBee. What could the team hope to get in return?\n\n#SacramentoProud \nhttps://t.co/ksgGMCik2c",
    "296": "@SacramentoKings @swipathefox Most underrated guard in the NBA right now.",
    "297": "@MikeAdxx @SacramentoKings need mitchell 2.0 in green like kd needs the elon musk hair transplant, smart cannot guard patty mills and james harden at the same time"
}