{
    "0": "@br_orlandomagic @The_ColeAnthony Facts",
    "1": "@br_orlandomagic @The_ColeAnthony Facts",
    "2": "🏀A THIRD DONE!!🏀\n\n@NBA stadium 10/30!!!!\n\nOn a journey to see the #Denver @Nuggets play in every #NBA arena, and the bucket list effort is 1/3 complete!\n\nIn #Orlando, #Florida to see the Denver #Nuggets take on the #Magic!\n\n#MileHighBasketball https://t.co/b6FNXvrSnD https://t.co/O3R8s4TZl3",
    "3": "Back at the Amway Center tonight! Former Magic star Aaron Gordon makes his return to Orlando. Caught a bit of his warmup. @SpecSports360 https://t.co/CHEt0ojOjW",
    "4": "@KTS_OGBNG @csbanterPFB @OrlandoMagic @Double0AG We have the MVP. 2 future all star caliber players in Jamal and MPJ. Jamal is already moving around fine I'm sure he'll be OK. Most athletes with MPJ's back history have healthy careers so don't bring up injuries. Bones is gonna be another Jamal Crawford. Then the rest like AG",
    "5": "@OrlandoMagic @The_ColeAnthony finally",
    "6": "@nuggetscountry_ @csbanterPFB @OrlandoMagic @Double0AG You stick with them and unlike Aaron Gordon these players understand that a rebuild needs to be done to reach the biggest goal of them all.",
    "7": "Magic kingdom, Orlando Florida. https://t.co/2kBONZNCxe",
    "8": "@nuggetscountry_ @csbanterPFB @OrlandoMagic @Double0AG Wendell carter, rj Hampton who will be out 6th man of the future, Mo bamba who is having his best season to date, and the chances of these players leaving are slim to none because Orlando is one of the best cities in the United States and when you are drafted by these teams…",
    "9": "welcome back @The_ColeAnthony 🤝 https://t.co/1MddswiKXx",
    "10": "@KTS_OGBNG @Justin2k_ @OrlandoMagic @Double0AG You gotta be fucking kidding me 😂😂😂",
    "11": "Orlando Magic have some really cool gear, too bad I am not invested in the franchise",
    "12": "@nuggetscountry_ @csbanterPFB @OrlandoMagic @Double0AG You know nothing about basketball. Cole Anthony who is already an mip candidate and a future all star, Jalen Suggs who has shown flashes in just his first season, franz Wagner who is a top 5 maybe 3 rookie of the year candidate, Jonathan Isaac a future dpoy…",
    "13": ".@OrlandoMagic coach Jamahl Mosley reflects on his time with Denver and what his squad has to do tonight against the Nuggets. #MagicTogether https://t.co/2UQqDIEDGL",
    "14": ".@OrlandoMagic coach Jamahl Mosley reflects on his time with Denver and what his squad has to do tonight against the Nuggets. #MagicTogether https://t.co/rJp5F2Uncr",
    "15": "Let’s Go @OrlandoMagic Get that #Win tonight #MagicTogether",
    "16": "@KTS_OGBNG @csbanterPFB @OrlandoMagic @Double0AG Don't lie to urself lmao",
    "17": "@nuggetscountry_ @csbanterPFB @OrlandoMagic @Double0AG Orlando has a better future than Denver",
    "18": "@Justin2k_ @Orlandrew5 @OrlandoMagic We don’t slander former nuggets Justin",
    "19": "@JavyRosado76 @OrlandoMagic @Double0AG One of our best decisions too he's been awesome",
    "20": "@Justin2k_ @Loot_Sports @BeenKnightedUCF @Orlandrew5 @OrlandoMagic We got rid of Aaron Gordon and it allowed us to start a new era. And that era has the best future in the nba.",
    "21": "@csbanterPFB @OrlandoMagic @Double0AG He isn't having 2nd thoughts lmao he's as happy as ever. Denver wins games",
    "22": "@Justin2k_ @OrlandoMagic @Double0AG Maybe we are 4-18 because we are supposed to be… we are in rebuild mode like you said and from what it looks like Franz Wagner is already better than anything Aaron Gordon did for us plus we have the best future in the nba.",
    "23": "The @OrlandoMagic starting Anthony, Harris, F. Wagner, Carter Jr., Bamba on Wednesday. #LetsGoMagic #NBA",
    "24": "@OrlandoMagic @Double0AG Yeah and we booing him unlike Evan and vuc",
    "25": "Tonight is brief stop at home for the @OrlandoMagic, who have their next five games on the road. #MagicTogether https://t.co/lBBX7GOr0e",
    "26": "Tonight is brief stop at home for the @OrlandoMagic, who have their next five games on the road. #MagicTogether https://t.co/nWL9R3jDqM",
    "27": "A funny twist to tonight's pregame: While @nuggets F Aaron Gordon was going through his pregame warmups prior to facing the @OrlandoMagic  the Amway Center's PA system blared his rap song, \"Pull Up\" that featured rapper, Moe.",
    "28": "Orlando Magic vs Denver Nuggets - NBA live stream \nwach live click link is here: https://t.co/gMsPnIF6cO",
    "29": "@OrlandoMagic Hey @The_ColeAnthony 👋. Welcome back.",
    "30": "@OrlandoMagic It’s an ice COLE world 💪💙👑",
    "31": "Los iniciadores del @OrlandoMagic para el partido de hoy. \n@OrlandoMagic vs @nuggets \n\n2️⃣2️⃣F: @franzboogie \n3️⃣4️⃣F: @wendellcarter34 \n5️⃣C: @TheRealMoBamba \n1️⃣4️⃣G: @thats_G_ \n5️⃣0️⃣G: @The_ColeAnthony",
    "32": "Cole’s back let’s get it https://t.co/yS4zUvVhAT",
    "33": "Wed \n\nOrlando magic under 99.5 tt small .5 u\n\nHawks over 107.5 tt .5 u\nHawks margin of victory prop\nTo win by 7-9 points .1 u +900\n\nTrae young over 20.5 points player prop 1 u",
    "34": "Some good news for the @OrlandoMagic. https://t.co/cYGX7LgaN6",
    "35": "Orlando Magic (+7.5) vs. Denver Nuggets #MileHighBasketball #MagicTogether #NBA #NBATwitter #NBA75",
    "36": "Orlando Magic Starters:\n\nCole Anthony\nGary Harris\nFranz Wagner\nWendell Carter\nMo Bamba\n\nPlayers out:\nMichael Carter-Williams\nMarkelle Fultz\nJonathan Isaac\nE'Twaun Moore\nJalen Suggs\n#MagicTogether #NBA #NBATwitter #NBA75",
    "37": "Orlando Magic vs Denver Nuggets - NBA live stream \nwach live click link is here: https://t.co/gMsPnIF6cO\n\n#OrlandoMagic vs #DenverNuggets https://t.co/H7SQrP9Nxw",
    "38": "Cole Anthony is back for the @OrlandoMagic tonight! #MagicTogether https://t.co/AylHSPYA4G",
    "39": "Cole Anthony is back for the @OrlandoMagic tonight! #MagicTogether https://t.co/k2RsyvZoTK",
    "40": "Tonight's starting lineup for the Orlando Magic: Anthony, Harris, Franz Wagner, Carter Jr., Bamba https://t.co/bVWH4AMCA2",
    "41": "The @OrlandoMagic square off against the Nuggets tonight!\n\nGet ready for the game with Magic LIVE right now on Bally Sports Florida! #MagicTogether https://t.co/kM14sBoAbY",
    "42": "The @OrlandoMagic square off against the Nuggets tonight!\n\nGet ready for the game with Magic LIVE right now on Bally Sports Florida! #MagicTogether https://t.co/oIZ6A7ZwoA",
    "43": "@kiree13 @OrlandoMagic @Double0AG Me too!",
    "44": "The Denver Nuggets without Bones Hyland tonight against the Orlando Magic | DNVR Nuggets Pregame https://t.co/1bBOVn95DT",
    "45": "@OrlandoMagic @Double0AG 💙 youuuuuu AG!",
    "46": "#NBAMagicPolls AG will receive more cheers than boos Tonight. #TrueOrFalse\n\n#OrlandoMagicGame23\n\n#MileHighBasketball\nvs\n#MagicTogether\n\n#OrlandoMagic #MagicTogether  #WeGotAlotPopping #MagicSzn2021\nWE💥G O T💥ALOT💥P O P P I N G",
    "47": "@BeenKnightedUCF @BroncoNuggs @OrlandoMagic @Double0AG Injuries man.",
    "48": "Game 23: Magic vs Nuggets GameThread\n\nAaron Gordon is back in Orlando as the Magic look for their second home win of the season. https://t.co/h18LjL3p4B https://t.co/dXdnAZla4Z",
    "49": "#NBAMagicPolls Who Wins Tonight? \n#OrlandoMagicGame23\n\n#MileHighBasketball\nvs\n#MagicTogether\n\n#OrlandoMagic #MagicTogether  #WeGotAlotPopping #MagicSzn2021\nWE💥G O T💥ALOT💥P O P P I N G",
    "50": "@drivenbydarrien @dabigdonAB @Lj_Foster Lol my Fox News obsessed dad opened his mouth briefly and said Kyrie’s name and I was like “YOU KNOW HE WANTS TO DEFUND THE POLICE TOO, RIGHT??!!”. \n\nHe immediately countered “Well there’s this one well spoken Orlando Magic player…”",
    "51": "@BeenKnightedUCF @CrankDatAllDay @BroncoNuggs @OrlandoMagic @Double0AG Had a injury never came back the same kinda lost the shot and never recovered it.",
    "52": "Former @ArizonaMBB star @Double0AG  makes his return to Orlando to take on the Magic. #BearDown https://t.co/BfNUOITf2N",
    "53": "Orlando Magic's (@OrlandoMagic) 2000-01 Shot Chart:\n\nVolume: HIGH | P_83 (percentile)\nShot Skill: AVERAGE | P_41\nEfficiency: AVERAGE | P_58\nEfficiency Value: AVERAGE | P_58\n\nFavorite Zone: Break3\nBest Skill Zone: Break3\nBest Value Zone: Restricted\n\n#OrlandoMagic\n#PureMagic https://t.co/o1wOiGSUOp",
    "54": "Special thanks to Coach John Sloggett for delivering an inspirational message to our team tonight! \n\nTigers also received a personal video message from the Orlando Magic GM John Hammond &amp; 2017 #1 NBA Draft Pick, Markelle Fultz.\n\n#Believe https://t.co/5LTWLRVhUr",
    "55": "@OrlandoMagic @Double0AG Y’all nasty ash 😭😭",
    "56": "GAME #23\n\nOld friend @Double0AG and the @nuggets come into town to take on the @OrlandoMagic!\n\nPregame starts at 6:30 PM with @JakeChapmanOM with tip off set for 7 PM on @1045thebeat https://t.co/s3FijMfD1Y",
    "57": "@OrlandoMagic @Double0AG Idk whats up with that one Nuggets fan. But also as a Nuggets fan, ngl, tearing up a bit to be reunited with RJ and Gary \"Gary Harris\" Harris 🥲\nOur goat and former young king.",
    "58": "Orlando Magic add first exclusive health insurance partner #sponsorship https://t.co/afPNr8iE04",
    "59": "@br_betting Aaron Gordon o14.5pts playing his former team in Orlando. First game against magic when they traded him he went for 24. Averaging 18.6pts L5",
    "60": "@BeenKnightedUCF @CrankDatAllDay @BroncoNuggs @OrlandoMagic @Double0AG Denver fans definitely shared that confusion. A bad core injury happened and he just regressed at an almost unprecedented pace.",
    "61": "@OrlandoMagic @Double0AG Salty ass fans. He was the greatest player y’all drafted since Dwight. Y’all really just never had a team around him.",
    "62": "@OCPDesigns @BeenKnightedUCF @Brycen77 @A_Watt91 @OrlandoMagic Your pretending Gordon was ever good... opportunity is what he had.",
    "63": "@OrlandoMagic @Double0AG The best dunker robbed of a slam dunk contest he did so many it’s crazy https://t.co/PNBdlzei32",
    "64": "@OrlandoMagic @Double0AG AG may be having second thoughts, Magic have some good up and coming players Cole,Suggs ,Mo Bamba he could have been the team leader.",
    "65": "@OCPDesigns @BeenKnightedUCF @Brycen77 @A_Watt91 @OrlandoMagic Gordon won the slam dunk contest...that's what he did. His hype makes people think he's better than what he is. I thought for sure he'd blossom a bit in Denver but I was wrong. He's that bad.",
    "66": "@OrlandoMagic let's go 🔥🔥 we got this 💪💪🔥🔥",
    "67": "@Magic_PR @OrlandoMagic @The_ColeAnthony For some reason I feel a STATEMENT GAME coming from Cole tonight🙌💯",
    "68": "@OrlandoMagic @The_ColeAnthony Played it a very reasonable 407 times, as is my right",
    "69": "NBA:\nAtlanta Hawks ML vs Indiana Pacers @ 2.06 HIGH\nPhiladelphia 76ers ML vs Boston Celtic @ 2.26 MEDIUM\nCharlotte Hornets +10 vs Milwaukee Bucks @ 1.80 MEDIUM\nLA Clippers -5 vs Sacramento Kings @ 1.83 MEDIUM\nOrlando Magic +8.5 vs Denver Nuggets @ 1.83 LOW",
    "70": "@OrlandoMagic @Double0AG Who is @Double0AG ????",
    "71": "ALERT: New high roller bet posted!\nA bet has been placed for $28,441.41 on Orlando Magic - Denver Nuggets to win $36,120.59.\nTo view this bet or copy it https://t.co/t3709EOe1Y https://t.co/nxRWN2Pz6T",
    "72": "@Magic_PR @OrlandoMagic @The_ColeAnthony So cole comes back once Suggs got injured hmmm  🤔",
    "73": "@quiescent77 @OrlandoMagic @Double0AG He doesn't do that with the Nuggets because he's not asked to be the main guy. He's been great for Denver",
    "74": "@OrlandoMagic @The_ColeAnthony same",
    "75": "@BeenKnightedUCF @drnugget @OrlandoMagic @Double0AG I imagine Orlando wanted him to help develop your youngins into the same type of defender he is. Gary's shot has been mysteriously missing for 3 years now",
    "76": "Since November 7th, only the Orlando Magic have posted a worse record than the Sacramento Kings. \n\nYes that includes tankers like the Pistons, the Rockets, and the Thunder.",
    "77": "It's time for Florida round 2 and @chrisadempsey with your game preview!\nThe @nuggets take on the @OrlandoMagic, coverage starts at 4:30 pm on Altitude. #MileHighBasketball https://t.co/zkEGh7lYqB",
    "78": "love this song https://t.co/NVeKXqNEe1 https://t.co/W263acgPl5",
    "79": "Pregame with @OrlandoMagic Head Coach Jamahl Mosely. The Magic face the @nuggets tonight in Orlando at the @AmwayCenter. Former Magic Star Aaron Gordon makes his return to Orlando as a member of the @nuggets tonight. @FortyEightMins #OrlandoMagic #MagicTogether #NBAFloridaMan https://t.co/E9r0D5lvio",
    "80": "@BeenKnightedUCF @Justin2k_ @Orlandrew5 @OrlandoMagic Idk why this Nuggets fan is bashing RJ. I was so excited for his potential when he was in Denver. He's gonna be really good if he can put it all together. Plus he's an awesome kid! But AG has been a perfect role guy for us so it worked out on both ends!",
    "81": "@BeenKnightedUCF @Hoeffel85 @Brycen77 @A_Watt91 @OrlandoMagic That's just objectively false. They were averaging near single digits points on atrocious efficiency during their last years here.",
    "82": "Anthony is starting tonight for the Orlando Magic. https://t.co/ufQXigS3Gh",
    "83": "@Magic_PR @OrlandoMagic @The_ColeAnthony Lets go",
    "84": "@OCPDesigns @Hoeffel85 @Brycen77 @A_Watt91 @OrlandoMagic Lewis missed the cutoff by a year, big whoop",
    "85": "🚨 INJURY UPDATE:\n@OrlandoMagic guard @The_ColeAnthony, who has missed the last six games with a sprained right ankle, will be active and start tonight vs Denver.\n\n#MagicTogether",
    "86": "@OCPDesigns @Hoeffel85 @Brycen77 @A_Watt91 @OrlandoMagic Dwight 2011, Hedo 2012, Jameer 2013",
    "87": "@OCPDesigns @Hoeffel85 @Brycen77 @A_Watt91 @OrlandoMagic Hedo and Jameer as a shell of themselves are still way better than AG lmfao 💀",
    "88": "Cole Anthony is back for the Orlando Magic tonight and will start, per Coach Mosley.",
    "89": "@Hoeffel85 @BeenKnightedUCF @Brycen77 @A_Watt91 @OrlandoMagic Theyre not in the past decade.",
    "90": "@AaronGoldstone future orlando magic big man",
    "91": "@AltitudeSR @nuggets @OrlandoMagic @Avalanche @MapleLeafs @ConorMcGahey Early game!!! with @ConorMcGahey \nSWEET!!!\nLIGHT THEM UP!!!!!",
    "92": "@Hoeffel85 @Brycen77 @BeenKnightedUCF @A_Watt91 @OrlandoMagic Cmon man. Its clear you dont like AG. This isnt even a debate. Does it suck that he is one of our best players in the last decade? Of course. But it is what it is. Dwight was barely in this decade. Jameer, hedo were shells of their former selfs and lewis wasnt here in the decade",
    "93": "@Brycen77 @OCPDesigns @BeenKnightedUCF @A_Watt91 @OrlandoMagic I'd put Gordon somewhere around elfrid Payton.",
    "94": "The Orlando Magic host the ‘21 NBA MVP Nikola Jokic and the Denver Nuggets.\n\nI’m covering the game tonight over at @OPPMagicBlog https://t.co/ekV9ox1UXH",
    "95": "@OCPDesigns @BeenKnightedUCF @Brycen77 @A_Watt91 @OrlandoMagic I forgot JI played basketball. But your right...he's another one.",
    "96": "@Brycen77 @Hoeffel85 @OCPDesigns @A_Watt91 @OrlandoMagic Yes, it isn’t even close either lmfao. Gordon was a liability. Those two actually contribute *something*",
    "97": "@OCPDesigns @BeenKnightedUCF @Brycen77 @A_Watt91 @OrlandoMagic How does Howard Nelson Lewis hedo get knocked off?",
    "98": "@Brycen77 @OCPDesigns @BeenKnightedUCF @A_Watt91 @OrlandoMagic Franz rookie season is better than any season Gordon has played. This isn't even debatable",
    "99": "@Hoeffel85 @BeenKnightedUCF @Brycen77 @A_Watt91 @OrlandoMagic There's really no debate. He's been one of our best players in the last decade whether you like or dislike him personally. Vuc, Fournier, JI, tobias harris and maybe terrence ross are the only ones in this discussion.",
    "100": "@Brycen77 @OCPDesigns @BeenKnightedUCF @A_Watt91 @OrlandoMagic Yes they both better than Gordon already.... easily bro.",
    "101": "@OrlandoMagic @Double0AG Why orlando Salty.  You want players to live and die as magics just cuz you as fans have to?  Tsk tsk tsk.",
    "102": "@Hoeffel85 @Brycen77 @OCPDesigns @A_Watt91 @OrlandoMagic Once Fultz and Isaac are fully healthy they’ll make this list too. Id leave Franz off only because he has played just 20 games. However he has been so much better than anything I’ve ever seen from AG.",
    "103": "@Brycen77 @OCPDesigns @BeenKnightedUCF @A_Watt91 @OrlandoMagic Howard, Hedo, Lewis, Nelson, Vuc, Fournier, Franz, Cole, Reddick, Tobias Harris, oladipo, Ross. \n\nThat's just off the top of my head. You could argue many others.",
    "104": "@Justin2k_ @Orlandrew5 @OrlandoMagic And you can’t forget we got a frp out of it. RJ has insane potential though. Like I said he is still 20 years old and has shown some extreme flashes at times. When he puts it all together it’s going to be something special.",
    "105": "@fayzeeeg Makes sense. I’m crying about Seager but have worn my Orlando Magic Shaq jersey before. I’m just pissed he left. You root for these guys for years then they bounce. Joc was a Dodger for 10 years. That’s 1/4 of my life.",
    "106": "@Hoeffel85 @OCPDesigns @BeenKnightedUCF @A_Watt91 @OrlandoMagic Im interested in hearing them",
    "107": "@Justin2k_ @Orlandrew5 @OrlandoMagic Ain’t nobody care about Gary Harris, and RJ is way more impactful this year, his efficiency is down but it’s just an issue of slowing himself down. Some days he shows he is capable of that, just gotta show consistency. He’s 20 lol",
    "108": "TODAY ON ALTITUDE SPORTS RADIO:\n\n92.5 FM:\n@Nuggets at @OrlandoMagic - 4:30 PM with Koz\n\n950 AM and the @AltitudeSR Mobile App:\n@Avalanche at @MapleLeafs - 5:00 PM with @ConorMcGahey\n\n#GoAvsGo #MileHighBasketball https://t.co/WF09lzP5Oq",
    "109": "NBA Betting Picks: Denver Nuggets vs Orlando Magic preview, picks and prediction https://t.co/wcm3V5uMxv",
    "110": "@bulls_pain Bulls fans don’t exist, they are all closeted Orlando Magic fans unfort",
    "111": "@CrankDatAllDay @BroncoNuggs @OrlandoMagic @Double0AG we want prime denver gary. Which I don’t understand why he’s past that. Dude is 27!",
    "112": "@OrlandoMagic @Double0AG Whistle him",
    "113": "Franz Wagner and Wendell Carter Jr. are developing beautiful chemistry in the two-man game with the Orlando Magic.\n\nhere's a look at *EVERY* dime between Franz and Wendell in pick-and-rolls and handoffs.\n\n+ a few highlights from The Wagner - Carter Connection https://t.co/PgrecaHlOf",
    "114": "@OCPDesigns @BeenKnightedUCF @Brycen77 @A_Watt91 @OrlandoMagic That is a key statement but I'm still not sure it's true. I believe I can get to 10 better players easily. I think lol",
    "115": "@OCPDesigns @OrlandoMagic @Double0AG Should’ve been co champs or something",
    "116": "@BeenKnightedUCF @BroncoNuggs @OrlandoMagic @Double0AG You mean prime Denver Gary. Gary was pretty rough last 2 seasons with us",
    "117": "@BeenKnightedUCF @Brycen77 @Hoeffel85 @A_Watt91 @OrlandoMagic Both things can be true. That's why I said the fact that he was one of our best players on the last decade is sad, but true. It's more a statement about our franchise than it is a statement about AG.",
    "118": "@drnugget @OrlandoMagic @Double0AG I can allow it. He hasn’t done anything positive in Orlando yet sadly",
    "119": "@BroncoNuggs @OrlandoMagic @Double0AG mane he’s been trash over here 😭 I know he surrounded by a bunch of youngins who won’t be very good for 2-3 years but he just can’t even make an open 3 it’s tough to watch...we want Denver Gary",
    "120": "HOY JUEGA DENVER!\n\nvs Orlando Magic.\n\n🏟️ Amway Center, FL.\n📺 NBA League Pass\n⏰ 21:00 hs 🇦🇷\n\n*Murray OUT. Porter Jr OUT. Dozier OUT. Rivers OUT. Hyland OUT.\n\n*Jamychal Green CUESTIONABLE. https://t.co/HAzZ7ZXt2M",
    "121": "@Justin2k_ @Orlandrew5 @OrlandoMagic Yea we have 8 players out AND the youngest starting lineup in NBA history AND a first year head coach...it’s about building and you gave us the perfect pieces to build around.",
    "122": "Preview for Nuggets vs Magic is up:\n\nTPM™ 2021-'21 Game #21 vs Orlando - Pre-Game version\nhttps://t.co/OgEaEGN3Cx",
    "123": "Looking for a value bet?  See if the Denver Nuggets-Orlando Magic Predictions and Preview for 12/1/2021 is one in our preview.  No crazy hype just a prediction and preview. #GamblingTwitter #Punters https://t.co/vZQMEwFShY",
    "124": "@stop2116 @OrlandoMagic @statmuse @Gatorade @franzboogie it starts tonight",
    "125": "@Brycen77 @Hoeffel85 @OCPDesigns @A_Watt91 @OrlandoMagic Did you watch him play? He single handedly cost Orlando so many games it’s unbelievable. Everyone wanted him gone for so long. He was not a top 3 player on any of the teams lol. Stats or no stats. In terms of IMPACT, he made the team worse.",
    "126": "ALERT: New high roller bet posted!\nA bet has been placed for $9,070.15 on Orlando Magic - Denver Nuggets to win $11,609.79.\nTo view this bet or copy it https://t.co/YJ1TR0ATf6 https://t.co/WKUGnEzfJP",
    "127": "The \"Magic\" have only beaten three teams this year in 22 games: The Knicks (twice, both away...in NYC), the Celtics in Orlando, and Minnesota in Minnesota.",
    "128": "@DorothyJGentry @CamilleBuxeda @wslam Y'all remind me of the old Orlando magic pics that was took in the 90s Shaq penny and Nick Anderson Dennis Scott Horace grant my first favorite basketball team ever then came the Lakers and the north Carolina tar heels let's go tar heel nation",
    "129": "@OrlandoMagic @nuggets @AmwayCenter @BallySportsFL @1045thebeat @Ticketmaster @RjHampton14 Why are you having an anti-vax, anti-government musical guest open tonight’s game?",
    "130": "@OrlandoMagic having their game tonight opened by anti-vax, anti-government musical guest.\n#antivaxxers #OrlandoMagic #CovidDeniers",
    "131": "@Trikuuuu @OrlandoMagic @Ticketmaster @The_ColeAnthony I prefer the calendar setup instead of dates. But still looks good",
    "132": "This will be Jent’s first game as an NBA head coach since he was the interim for Orlando Magic in 2005. https://t.co/qNSK1q5KCi",
    "133": "@OrlandoMagic @Double0AG We only care so we can boo him.  Underachiever who in the end didn’t want to be here and talked smack after leaving.",
    "134": "@taylor_stein @OrlandoMagic @Double0AG @AmwayCenter @RjHampton14 Oh ya, I forgot about Gary",
    "135": "@OrlandoMagic @Ticketmaster @The_ColeAnthony W love these wallpapers",
    "136": "Denver Nuggets @ Orlando Magic\n\nProjected Score\n\nPlayer Points Projections\n\nPLAYER PROP RECOMMENDED\n\nhttps://t.co/WyTsYeJN1S",
    "137": "Orlando Magic guard Jalen Suggs and his girlfriend Hailey Van Lith. She plays basketball at the University of Louisville. 🖤🖤🖤 https://t.co/OeJWYCj6SO",
    "138": "@OrlandoMagic @Double0AG “The Mile High Man Himself” https://t.co/1VGN0drj0J",
    "139": "@OrlandoMagic @Double0AG I still love AG, but I hope he lose",
    "140": "@iRacer77 @OrlandoMagic @Double0AG @AmwayCenter @RjHampton14 Gary Harris getting some of that revenge game magic (😉) too?",
    "141": "Florida Blue Becomes Official Health Insurance Provider of the Orlando Magic\n\nhttps://t.co/tOYpp8uK7l",
    "142": "I still stand with you @Jaguars. I still stand with you @OrlandoMagic",
    "143": "With Jokic averaging 26.2 pts a game and the Magic on a 4 game home losing streak. What's your wager going to be for tonights match up in Orlando? 😎🏀\n\n📲 Download the Bet Maverick Sports App today: \n🔹 Apple: https://t.co/gJgUHB9j4S\n🔹 Google: https://t.co/bPIxoMAQrV https://t.co/ssaq0Rvrnx",
    "144": "@OrlandoMagic @Ticketmaster @The_ColeAnthony @packers make Your version, plz",
    "145": "@OrlandoMagic @Ticketmaster @The_ColeAnthony Cole Anthony has been a spark for a franchise that is going to sell him for as many assets as possible, The second the time is right. Sorry cole that’s how they operate in O-Town",
    "146": "@OrlandoMagic @Ticketmaster @The_ColeAnthony Poor magic fans Y’all really deserve better. Sell the team Dan we want a winner. You’ve made enough on this investment. Turn the team over to someone with wining ambition.",
    "147": "@james71590963 @OrlandoMagic @Ticketmaster @The_ColeAnthony Heres some more https://t.co/mh0VtH5mti",
    "148": "@james71590963 @OrlandoMagic @Ticketmaster @The_ColeAnthony No idea i just have a folded of random wallpapers i saved off twitter by searching #WallpaperWednesdays",
    "149": "@PickDawgz #122         Orlando magic +7.5-110/Boston Celtics-2.5-110/Los Angeles clippers-5.5-110",
    "150": "Sometimes I forget that the Orlando Magic were mostly a winning team for 20 years straight.\n\nThere really were no terrible seasons outside of T-Mac’s final year.\n\nI was spoiled growing up watching this team, and that’s probably what’s made these last 9 seasons even harder. https://t.co/kpz70JE1op",
    "151": "@Omagic_social @OrlandoMagic @Ticketmaster @The_ColeAnthony Who is that",
    "152": "@Pacers @Timberwolves @OrlandoMagic @cavs @PelicansNBA @HoustonRockets @SacramentoKings @celtics @hornets GO GET THISWIN TODAY GUYS!!!YES YOU GUYS CAN DO THIS!!!YES YOU GUYS CAN WIN AGAINST THISTEAM!!!!!!YESYOUCAN!YESYOUCAN!!YESYOUCANGUYS!!!!!GO OUT THERE ON THE COURT,PLAYHARD,,,",
    "153": "@OrlandoMagic @Ticketmaster @The_ColeAnthony Wallpaper Wednesday https://t.co/oDltnLtSeA",
    "154": "@OrlandoMagic @Ticketmaster @The_ColeAnthony Bulls did it better, sorry not sorry https://t.co/sMlivbOy28",
    "155": "@OrlandoMagic @Ticketmaster @The_ColeAnthony Need a new ceo? Bet I’m you’re guy. Better then that bum @OrlandoMagicCEO",
    "156": "@OrlandoMagic @Ticketmaster @The_ColeAnthony Thanks magic",
    "157": "need a new lock screen for December? bet https://t.co/wLGD0LO6bd",
    "158": "Back ORLANDO MAGIC to BEAT Denver Nuggets tonight in the @NBA (Game Starts at 00.10 GMT) #NBA #Basketball",
    "159": "@Ceruti Got tickets to @OrlandoMagic X @HoustonRockets Friday you wanna go?",
    "160": "Think I’ll start to PC @SHAQ cards but specifically is @OrlandoMagic cards 🤔",
    "161": "Tonight's @OrlandoMagic game should be a good one. @Double0AG makes his return to the @AmwayCenter for the first time since being traded, and @RjHampton14  will undoubtedly turn up to get revenge against his former team. #MagicTogether",
    "162": "@OrlandoMagic @Double0AG Can't wait to watch as he turns the ball over while trying to do too much and shoot inconsistently on open shots. Lets not forget the occasional dunk off of a quick cut... Oh the memories.",
    "163": "@Brycen77 @OCPDesigns @A_Watt91 @OrlandoMagic Stats don't make him a top player. Opportunity may have but he was not good and is not good.",
    "164": "🏀 #NBA\n\nDenver Nuggets 🆚 Orlando Magic\n📆 Jue 2 dic 01:10\n\n#Raspibets #FreePicks #FreeTips #StatBets #SportsBetting #BettingTipster #MileHighBasketball #MagicTogether\n🆓🔎📈⬇ https://t.co/5TXAo1ROGU",
    "165": "@OrlandoMagic @Double0AG I’m excited.",
    "166": "@AidanComerford2 @PaulVelch @OrlandoMagic @Double0AG don't get him excited pal👍",
    "167": "Orlando Magic Announces Florida Blue as a Champions of the Community Partner – NBA News https://t.co/qnauTcLIWw",
    "168": "He’s gonna get boo’d but that’s lame imo. He liked being in Orlando and he called it home plenty of times. He named his dog Magic ffs. I would cheer him tonight if I was going https://t.co/wfRH28115b",
    "169": "Hey, can we find 5 more subscribers and finally hit 350?\n\nSubscribe Here https://t.co/KpnZYEsiNH\n\nPlease RT &amp; Share 🙏🏻\n\n#MagicTogether #OrlandoMagic #MagicBasketball #Orlando #NBAPodcast #BasketballPodcast #NBAintheUK https://t.co/I416Ki3VCJ",
    "170": "6. Growing up in Florida, there were no Miami Heat or Orlando Magic and the University of Miami had dropped basketball back in '71. No one in my family had interest in the sport. I hadn't even seen it on TV yet. That would change living in Central NC.",
    "171": "@WarriorsPR is he playin against Orlando Magic?",
    "172": "@OrlandoMagic @nuggets @AmwayCenter @BallySportsFL @1045thebeat @Ticketmaster @RjHampton14 very excited to watch these two!",
    "173": "back in the O  🪄\n\n🆚: @nuggets \n📍: @AmwayCenter\n🕖: 7 p.m.\n📺: @BallySportsFL \n📻: @1045thebeat https://t.co/78N5TVN17t",
    "174": "#ORLANDOMAGIC\n\nE'Twaun Moore\nMichael Carter-Williams\nJalen Suggs\nMarkelle Fultz\nJonathan Isaac\n\n#DENVERNUGGETS\n\nAustin Rivers\nNah'Shon Hyland\nMichael Porter Jr.\nPJ Dozier\nJamal Murray",
    "175": "@OrlandoMagic @Double0AG Lol all you lame ass Magic fans saying you don’t care when we all thought AG was a core piece for years. He didn’t say anything out of the ordinary once he left don’t know why y’all keep crying about it",
    "176": "To my #1 podcast of 2021, The OZone: Orlando Magic Podcast: thank you for keeping me company on @Spotify all year long! #SpotifyWrapped https://t.co/K4ctYhv3eI",
    "177": "Denver Nuggets at Orlando Magic - 12/1/21 NBA Picks and Prediction https://t.co/zsCS0LoiWJ #NBA #NBAPick #FreePick #FreePicks #SportsBetting #ExpertPick #NBATwitter #ExpertBettingAdvice #sportsbettingadvice #handicappers #SportsGambling #Picks #MagicTogether #MileHighBasketball https://t.co/9uqfZhKitf",
    "178": "Aaron Gordon revenge game vs Orlando in Orlando. Last time he dropped 24 on them. Magic weren't starting both Carter Jr. &amp; Bamba together back then. Instead they were starting OKEKE, who happened to drop 19 to lead the Magic that game.😂 Fun times https://t.co/JI4IV8M1ps https://t.co/c3GPTt7q4K",
    "179": "We are proud to be the official health insurance provider of the @OrlandoMagic. #MagicTogether https://t.co/LZ345gjjWb",
    "180": "┏┓  \n┃┃╱╲ in this\n┃╱╱╲╲  house we\n╱╱╭╮╲╲ Stand and Cheer\n▔▏┗┛▕▔ for The Orlando\n╱▔▔▔▔▔▔▔▔▔▔╲ Magic \n╱╱┏┳┓╭╮┏┳┓ ╲╲ \n▔▏┗┻┛┃┃┗┻┛▕▔",
    "181": "ALERT: New high roller bet posted!\nA bet has been placed for $9350.16 on Orlando Magic - Denver Nuggets to win $9,420.54.\nTo view this bet or copy it https://t.co/j39Yxg4MRw https://t.co/brQKcF2Azx",
    "182": "ALERT: New high roller bet posted!\nA bet has been placed for $6545.11 on Orlando Magic - Denver Nuggets to win $6,618.38.\nTo view this bet or copy it https://t.co/VOCyvtRUOD https://t.co/lbLWADLTpZ",
    "183": "@OTownNBA @OrlandoMagic @Double0AG Hell nah",
    "184": "@OrlandoMagic @Double0AG Who cares",
    "185": "@OrlandoMagic @Double0AG Good luck @Double0AG",
    "186": "@ORL_EGW @Hoeffel85 @OCPDesigns @A_Watt91 @OrlandoMagic Well with his style of play, the only way he would be remembered is with his dunks and athleticism, so his personality was based around that.",
    "187": "@OrlandoMagic @Double0AG The guy who takes 5 steps foward and 10 steps back, one of the few best decision magic front office did by getting rid off him!!",
    "188": "@Brycen77 @Hoeffel85 @OCPDesigns @A_Watt91 @OrlandoMagic That being said Vooch and Fournier actually liked being here and wanted to make it work. AG was all about his brand and making a big deal about his dunk contest snubs.",
    "189": "@Hoeffel85 @OCPDesigns @A_Watt91 @OrlandoMagic He’s literally the 3rd leading scorer in the last ten years of the franchise, 2nd in blocks, 2nd in rebounds… easily he’s one of the best players behind Vuc and Fournier",
    "190": "@Hoeffel85 @Brycen77 @OCPDesigns @A_Watt91 @OrlandoMagic To be fair he was a top 3 player on the team before JI reached his peak a couple seasons ago",
    "191": "@OrlandoMagic there is no love for the other side @Double0AG",
    "192": "Risk: $2.25 - Win: $2.08\nCBB - TOTAL u142½-108 (Memphis vrs Georgia)\n\nRisk: $2.25 - Win: $2.05\nNBA - Orlando Magic +8-110",
    "193": "@Brycen77 @OCPDesigns @A_Watt91 @OrlandoMagic Maybe the most overhyped. He wasn't even a top 3 player on his teams here in orlando",
    "194": "@OrlandoMagic @Double0AG Hes getting booed ‼️‼️",
    "195": "@Hoeffel85 @OCPDesigns @A_Watt91 @OrlandoMagic He literally is",
    "196": "@OrlandoMagic @Double0AG Shelvin Mack with the dimes type of energy",
    "197": "@OrlandoMagic @Double0AG It's always good to see family. https://t.co/HWlySFTckW",
    "198": "Aaron Gordon returns to Orlando tonight.  \n\nCole Anthony is expected to be available tonight after missing the last week and a half with an ankle injury. \n\n#MagicTogether #OrlandoMagic #NBA https://t.co/5lSWndrShl",
    "199": "@OrlandoMagic @Double0AG Ratio",
    "200": "@OrlandoMagic @Double0AG You setting you self up with this one magic",
    "201": "@OrlandoMagic @Double0AG Who cares about him?",
    "202": "@OrlandoMagic @Double0AG Why would I care",
    "203": "@OrlandoMagic @Double0AG We don't care",
    "204": "@OCPDesigns @A_Watt91 @OrlandoMagic Yeah because that bar is set so high",
    "205": "@OrlandoMagic @Double0AG Yeah really want to celebrate a guy who burned every bridge out on the way",
    "206": "@reoisrad @OrlandoMagic @Double0AG Let us borrow jokic",
    "207": "@OrlandoMagic @Double0AG Damn I always liked AG. It was a bummer to see everyone turn on him so fast.",
    "208": "@OrlandoMagic @Double0AG Don’t care sadly",
    "209": "Orlando Magic in 2022 - reboot for scoot https://t.co/kfwdAx6MuH",
    "210": "@OrlandoMagic @Double0AG If I was in charge I would have our greatest offensive player in team history at every practice showing these players how  to create offense off the dribble we need a offensive coordinator bring tmac back to Orlando",
    "211": "@OCPDesigns @A_Watt91 @OrlandoMagic Lol no he's not. Not even close",
    "212": "@OrlandoMagic @hidoturkoglu15 @realgranthill33 @MountainDew The Magic almost had Grant Hill, Tracy McGrady and Tim Duncan. If that had happened and Hill had stayed healthy, Magic history would look a lot different now.",
    "213": "@OrlandoMagic @Double0AG can we borrow gary and rj tonight",
    "214": "@OrlandoMagic @Double0AG Dwade back in my hood graces after dumping this famous dunker",
    "215": ".@OrlandoMagic Announce @FLBlue as a Champions of the Community Partner\n\n#MagicTogether \n\nhttps://t.co/WoAiAgqWZF",
    "216": "@OrlandoMagic @Double0AG Best thing that ever happen to him was taking off that tragic jersey.  I hope the real dunk champ drops a 40 piece on ya heads. More life",
    "217": "@OrlandoMagic @Double0AG Ya gave old boy away like some old sneakers as soon as he found out the only thing this franchise cares about is selling seats and merchandise Foh",
    "218": "🏀 @OrlandoMagic vs @Nuggets Preview 🏀\n\n🔹Magic look to build off effort in Philly\n🔹Franz aims to remain aggressive\n🔹Cole Anthony expected to return\n🔹Suggs won't need surgery\n🔹AG returns to Orlando\n🔹Rivals Report with Nuggets dot com's @EricSpyroNBA:\nhttps://t.co/yAnj17xkAz",
    "219": "@OrlandoMagic @Double0AG Trash",
    "220": "@OrlandoMagic @Double0AG I remember when I thought he was gonna be the new Shawn Marion....and then that never happened.",
    "221": "this is the way @OrlandoMagic https://t.co/qpdxdplmhR",
    "222": "Why the Orlando magic wearin orange now? I fcking hate it lmao",
    "223": "@OrlandoMagic @Double0AG Ungrateful, disrespectful, and never lived up to promise. Not making it a point to go to this one like I did to cheer Vooch.",
    "224": "@JacksonSpiess @OrlandoMagic @Double0AG Well, best of luck cheering for a mediocre player who was never close to what was expected. I´ll pass that.",
    "225": "I want to go to the Orlando magic vs Miami hear game 12/17 but I think I get off at 6 &amp;&amp; the game start at 7 😭😩😩😩",
    "226": "@A_Watt91 @OrlandoMagic I mean he's one of the best magic players in the past decade as sad as that is",
    "227": "@OrlandoMagic @Double0AG Dunk contest at halftime?",
    "228": "@OrlandoMagic @Double0AG 2 time dunk champ in my eyes.",
    "229": "@MattyWorldPiece @OrlandoMagic @Double0AG I’m crying lolll",
    "230": "@OrlandoMagic We honoring average players that wanted out of Orl?",
    "231": "@OrlandoMagic @Double0AG who cares",
    "232": "@ChrisUnbias That's where the ratings are....They have analytics that tell them what topics to flog..... Nobody cares about what the Colts are doing or who Orlando magic defeated .... It's a business .. Would you blog about John Doe from Wanker Battle league ? probably not",
    "233": "@OrlandoMagic @Double0AG Magic legend. 🐐",
    "234": "Tonight. AG back. https://t.co/0MwghItGAO",
    "235": "give us rj and gary @OrlandoMagic https://t.co/jy0P6pzsUr",
    "236": "Podcast Highlight 🎬\n\nRyan DeVos - VP, Shareholder Engagement - on how the @OrlandoMagic are able to keep their brand fresh while also paying homage to the team's history.\n\n📺: https://t.co/qJdMlHAvve https://t.co/pozUlSyCph",
    "237": "@holy_cockroach @OrlandoMagic @chicagobulls Probably yeah",
    "238": "@The_6ix_man @OrlandoMagic @chicagobulls Can we get Coby with that if we throw in picks?",
    "239": "First thing I think of when I hear @OrlandoMagic and Denver Nuggets is “The Three” game winner by @jameernelson lol https://t.co/wbO5SU8LhZ",
    "240": "@Thunderblunder7 I’m a middle school teacher n basketball coach, got our first scrimmage today gonna have them lads looking like the Orlando Magic out there",
    "241": "After winning his second NBA title, a free agent Tim Duncan was looking on to new horizons with an almost done deal move to the Orlando Magic. However after a request to allow his family on the team plane during trips was rejected by head coach Doc Rivers, he declined the deal https://t.co/pYm2r2ZkKN",
    "242": "The @OrlandoMagic are back on their home court for a showdown against the Nuggets tonight!\n\nGet ready for the game with Magic LIVE at 6:30pm on Bally Sports Florida! #MagicTogether https://t.co/V3NovZK4VS",
    "243": "Denver Nuggets vs Orlando Magic 12/1/2021 Picks Predictions Previews\n\nhttps://t.co/2myKsD54JX\n\n#sportspicks #NBAbetting #NBAprediction #NBA #NBApicks #NBAparlay #odds #picks #freepick #freepicks #expertpicks #basketballpicks #sportsbetting #handicapper #Nuggets #Magic https://t.co/1PEdJHE63S",
    "244": "NBA Betting Picks: Denver Nuggets vs Orlando Magic preview, picks and prediction https://t.co/u6oNIYreJk",
    "245": "@The_6ix_man @OrlandoMagic @chicagobulls Orlando yes bulls no",
    "246": "@The_6ix_man @randykfox @OrlandoMagic @chicagobulls but do they 😞",
    "247": "Denver Nuggets vs Orlando Magic preview and picks | SportsNus https://t.co/DF6anN1hkb",
    "248": "@randykfox @OrlandoMagic @chicagobulls You see it",
    "249": "To my #1 podcast of 2021, The OZone: Orlando Magic Podcast: thank you for keeping me company on @Spotify all year long! #SpotifyWrapped https://t.co/8iLDn4DDku @theozonepod",
    "250": "@_arsenal717 @OrlandoMagic @chicagobulls The Yuta role so he’s not the only one running around",
    "251": "@The_6ix_man @OrlandoMagic @chicagobulls I'm liking that magic very balanced but don't sleep on malachi he'll get better trust",
    "252": "@The_6ix_man @OrlandoMagic @chicagobulls The hell we need Derrick jones for",
    "253": "🇺🇸 Bones Hyland has also entered the health and safety protcol, per reports. Nuggets will really be shorthanded at Magic tonight\n\n🇮🇹 Denver perde anche Bones Hyland per il protocollo Covid. Squadra decimata stanotte contro Orlando\n\n#NBA75 https://t.co/t2w73lz4ct",
    "254": "⛔️ LAST MINUTE OFFER ⛔️\n🌞 Early Summer Family Fun 🌞\n📌 Orlando, Florida 📌\n📆 May-June 2022 📆\nBe surrounded in the artistry, enchantment and magic of Walt Disney and Disney and Pixar movies. Stay at a Disney Resort hotel that invites you to explore the…https://t.co/uVlB8FavBN",
    "255": "@ATLHawks vs. @Pacers \n@nuggets vs. @OrlandoMagic \n@Timberwolves vs. @WashWizards \n@sixers vs. @celtics \n@cavs vs. @MiamiHEAT \n@hornets vs. @Bucks \n@dallasmavs vs. @PelicansNBA \n@HoustonRockets vs. @okcthunder \n@SacramentoKings vs. @LAClippers",
    "256": "Free plays today\n\n⚽️Premier league Manchester city 1st half goal total over 1.5 +170 1u⚽️\n\n🏀In The Association the Orlando magic ML vs Denver Nuggets +265 1u🏀\n\n🏀College basketball Akron ML +110🏀\n\n#mancestercity #ManCity #nuggets #Denver #Akronbasketball #GamblingTwiitter #LFG",
    "257": "@mrfitzyfitz I think it's a bit like dumping on the 12th man on the Orlando Magic's roster. He's objectively probably one of the 500 best basketball players in the world, but if you're putting a lineup together you'd probably be objectively wrong to pick him over any of the other 499 guys.",
    "258": "Here are the #LMWAB daily FREE** picks for Wednesday December 1st!\n\nOrlando Magic +7.5\nMinnesota Timberwolves +4.5\n\nToronto Maple Leafs -120\nSeattle Kraken -120\n\n💸HAVE FUN LOSING MONEY💸\n\n**always free, never pay for picks\n\n#GamblingTwitter",
    "259": "Orlando Magic vs Denver Nuggets 12/1/21 NBA Picks, Predictions, Odds » Sports Chat Place https://t.co/Z24vYQMs5b #NBA #NBAPick #FreePick #FreePicks #SportsBetting #ExpertPick #NBATwitter  #ExpertBettingAdvice #BettingTipster #Handicapper #Sports #magictogether #MileHighBasketball https://t.co/feDwwS2KAH",
    "260": "NBA Day 4️⃣3️⃣ 🏀🏀🏀\nAtlanta Hawks vs Indiana Pacers\nDenver Nuggets vs Orlando Magic\nMinnesota Timberwolves vs Washington Wizards\nPhiladelphia 76ers vs Boston Celtics\nCleveland Cavaliers vs Miami Heat\nDallas Mavericks vs New Orleans Pelicans\nCharlotte Hornets vs vs Milwaukee Bucks",
    "261": "@NikolaVucevic went crazy against the @OrlandoMagic is this a trend hopefully!#BullsNation https://t.co/9VEvX9lkck",
    "262": "@Dan_Savage @OrlandoMagic Same magic injury report?",
    "263": "21:00 – 🏀NBA\nAtlanta Hawks x Indiana Pacers\nNBA LEAGUE PASS\nDenver Nuggets x Orlando Magic\nNBA LEAGUE PASS\nMinnesota Timberwolves x Washington Wizards\nNBA LEAGUE PASS\n21:30 – Philadelphia 76ers x Boston Celtics\nNBA LEAGUE PASS\nCleveland Cavaliers x Miami Heat\nNBA LEAGUE PASS\n\n+",
    "264": "@Dan_Savage @OrlandoMagic We still gonna get blown out",
    "265": "@comebac30720755 I took both personally! \n\nLittle less on Orlando since they are just a 4 win team. They are 9-13 against the spread though - better than the Nuggets. Should be a tight game! I have .25u on Magic &amp; .50u on Cavs 👍🏼",
    "266": "The Denver Nuggets will already be without P.J. Dozier (left ACL), Jamal Murray (left knee), and Michael Porter Jr. (low back) against the @OrlandoMagic. JaMychal Green (left elbow sprain) is questionable. https://t.co/Oayyo3owjC",
    "267": "TICKET GIVEAWAY!\n\nDo you want to see the @OrlandoMagic take on Aaron Gordon and the @nuggets tonight at 7 PM?\n\nAll you have to do to enter is like this tweet and we will pick a random winner by 3 PM⬇️ https://t.co/kSr1wHkM2z",
    "268": "**SYSTEM PLAYS**\n\nOrlando Magic +8, 2u\n\n-Jokic is questionable and with this being a 4 game road trip I look for them to limit his minutes.\n\nBoston Celtics -3, 1u\n\n-Celtics are a better team at home. There are countless questions surrounding this 76ers team, so Boston is the play https://t.co/CUf01Q8Bqn",
    "269": ".@hidoturkoglu15 🤝 @realgranthill33 \n\n15 YEARS AGO today, Grant Hill took the lob from Hedo Turkoglu ftw 🙌\n\n@MountainDew x #MagicTogether https://t.co/Y91mME3h9J",
    "270": "Reebok Orlando Magic Tracy McGrady Size 48 Jersey / sn2183 R1 https://t.co/mT6QXFrnRh eBay https://t.co/TCMXPdNvEo",
    "271": "As a fan of the @OrlandoMagic we've had our fair share of injuries, but I'll continue to watch their games on @BallyMagic. Because I'm a loyal fan",
    "272": "The @OrlandoMagic have a new partner..they announced Florida Blue becomes Official Health Insurance Provider of the Orlando Magic. #NBA https://t.co/Bai51eUybu",
    "273": "Orlando Magic say Jalen Suggs to have thumb reevaluated every two weeks - https://t.co/QvBc1Iixll\n#worldwidetweets https://t.co/lvDGQAzRQ0",
    "274": "Revenge Game: Aaron Gordon plays Orlando tonight.  He played 403 games in his career for the Magic.",
    "275": "shoutout @SixthManShow for helping me cope with this orlando magic team all 2021 😪 https://t.co/FmHREMe9i3",
    "276": "DasHaus made a bet!\n\nEvent: Denver Nuggets vs Orlando Magic #NBA\nBet: Orlando Magic TO WIN +8.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "277": "DasHaus made a bet!\n\nEvent: Denver Nuggets vs Orlando Magic #NBA\nBet: Denver Nuggets TO WIN -8.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "278": "NBA ML. Date: 12-01\nDenver Nuggets vs Orlando Magic. 1.2%\nBetMGM. Nuggets @ -300\nPointsBet. Magic @ +320\n#arbitrage #bettingtwitter #bettingpicks #sportsbets #freepicks #freemoney #mlb",
    "279": "This Pacers core reminds me a lot of the Vooch-Gordon-Fournier Orlando Magic team.",
    "280": "Welcome to Dec. TerraMia invites you to \"the best Happy Hour in town\" starting at 4 PM. Don't forget, it's time to plan your Holiday Party. Let's discuss the possibilities. (407) 774-8466 @CityofAltamonte @SeminoleCoFL @OrlandoMagic @citybeautiful @CHARLIEWINES @brianwineforall https://t.co/H8vkhHuWIc",
    "281": "Orlando Magic is 0-18 ATS in the first half against opponents averaging 20+ assists a game in non conference play \n\nThis Betlabs system would indicate play on Denver -5 1H\n\n#Betlabs https://t.co/hY0c3WpMJm",
    "282": "For all the campers that will attend the camp, you’ll have the option to watch the @OrlandoMagic and the @Bucks pregame workout from 5:00pm - 5:45pm. Get your tickets today!  Reach out to @Lac25_ or myself to get tix and if you have anymore information about camp. 29 more days! https://t.co/PCUEgdnOVd",
    "283": "We're rolling with Nikola Jokic prop bets tonight against the Orlando Magic. The reigning MVP is playing even better this season! \n\nhttps://t.co/fDInZtPHek",
    "284": "Our first article by @_TimJones1 is up!\nFinding Gems In A Rocky Start for the Orlando Magic. #MagicTogether\n\nCheck it out! \nhttps://t.co/EgymphwX92",
    "285": "🔵ORLANDO M⭐️GIC GAMEDAY⚫️\n\n🏀: @Nuggets \n🗓: Wednesday 1st December\n⌚️: 12:00am 🇬🇧\n📍: @AmwayCenter \n\nWill the Magic pick up its 5th win before heading out west for 5 games? \n\nWatch the entire 2021/22 season with NBA League Pass UK: https://t.co/KlfvJJzQnK\n\n#MagicTogether #NBA75 https://t.co/mM17bhUJaC",
    "286": "@MatzTruther Orlando Magic",
    "287": "This morning, 43 dancers from the Dance Gallery of Lubbock are heading to Orlando, Florida to perform in this year's Disney World Dance the Magic Holiday Spectacular Parade. https://t.co/UgbQtZiphP",
    "288": "On this day 15 years ago, Grant Hill's lay-in off of an inbound lob in the final second lifted the Orlando Magic to a thrilling 91-89 win over the Portland Trail Blazers: https://t.co/y3fzQfGugX #MagicTogether https://t.co/Dpfp8D7YCt",
    "289": "NBA Authentic Vince Carter Orlando Magic Jersey Adidas 44 Home White L #15 VC https://t.co/ocd2yZJSoE eBay https://t.co/7z4K0iTDjU",
    "290": "From the Magic Kingdom to magical spa treatments, Orlando sparkles with the promise of adventure. Spend a day exploring the world-famous Disney theme parks or screaming your head off on a Universal... \n\nAir ticket from Abu Dhabi to Orlando\nhttps://t.co/yIf8LM88Ba",
    "291": "Hecate’s Wheel will be playing at Summer Magic Festival  June  9, 2022 Doubletree Hotel, Orlando FL. Get your tickets early! #SummerMagick https://t.co/4L8E502Yge",
    "292": "TONIGHT Orlando Magic face the Denver Nuggets at @AmwayCenter. Game time 7 PM.\n\nTickets!\n#Orlando #Sports \nhttps://t.co/bOELchRrC5",
    "293": "Woke up feeling happy knowing that franz wagner plays basketball for the Orlando magic today 😃",
    "294": "@Magic_PR @OrlandoMagic @jalensuggs Thats great.  Gives the front office an excuse to provide no updates ever on his progress and to keep him out 9 months.  Life as a magic fan",
    "295": "🚨 ORLANDO MAGIC CITY JERSEY 🚨\nGrab your Magic City jersey and other Magic merchandise at NBA Eu or Fanatics!!! \n\nRemember to add ‘MAGICUK10’ at the checkout 🛒 for 10% off on selected items.\n\n*Some exclusions may apply*\n\nFanatics UK https://t.co/Rmo6CyF4ad https://t.co/TKHWnOgeSt",
    "296": "NbaUnderTips \n\nOrlando Magic - Denver Nuggets\nUnder 208",
    "297": "My cousin in canada used to kick my ass using jj reddick on the orlando magic on 2k8-2k9, either he was a good player or jj Reddick was unstoppable in that game",
    "298": "@DwightHoward Hey DH, you played a good game last night. We miss the old Orlando Magic DH. Hopefully you can bring half of that super DH to the Lakers this season. Lakers fans need you.",
    "299": "NBA Early Win Treble\n\nAtlanta to beat Pacers - 2.00\nNuggets to beat Orlando - 1.30\nWizards to beat Minnesota - 1.62\n\nTreble pays 4/1\n\nBet on https://t.co/khxEfPyRlJ\n\n#Basketball #NBA #Bball #GamblingTwitter #Freepicks #Tips @AfribetS #Hawks #Pacers #Nuggets #Magic #Wizards https://t.co/zS1bCuR5Sy",
    "300": "Hot Takes Pt 3:\n\n7. The Brooklyn Nets will lose over 50% of their games in December (Lose 8/15 Games)\n8. The Orlando Magic will not win a game in December.\n9. DeMar DeRozan has not improved this season, rather he has just gotten a higher usage rate and more recognition.",
    "301": "🌎 The Magic is Back for 2022 &amp; 2023 at Universal Orlando Resort  🌎\n\nFrom £989 per person^, includes:\n⭐ 14 nights' at Universal's Cabana Bay Beach Resort\n⭐ Universal Orlando 14-day 3 Park Explorer Tickets\n⭐ Early Park Admission*\n\nhttps://t.co/ZSYEGwGCzX\n\n☎️01268941180☎️ https://t.co/B3TlbbQ7UG",
    "302": "#NBA75 Bet of the Day\n\n🇺🇸 Orlando Magic - Denver Nuggets\n🏀 Orlando Magic Under 99.5 TT (1.90)\n\n#NBA #NBATwitter #MagicTogether #MileHighBasketball \nhttps://t.co/ArKVjhGsEP",
    "303": "The Philadelphia 76ers discuss their struggles against the zone defense employed by the Orlando Magic in their win at home.  https://t.co/Q8TOZfJZrE",
    "304": "Orlando Magic say Jalen Suggs to have thumb reevaluated every two weeks https://t.co/x4P0SITQKD",
    "305": "Match: Orlando Magic - Denver Nuggets\n\nBet slip link: https://t.co/bQclarA5ui\n\n#OrlandoMagic #DenverNuggets #eoscoin #eos #lasvegas https://t.co/NA3akoQTKk",
    "306": "ALERT: New high roller bet posted!\nA bet has been placed for $5,005.71 on Orlando Magic - Denver Nuggets to win $9,811.19.\nTo view this bet or copy it https://t.co/ecr9MwtqJv https://t.co/JkU9GndSQc",
    "307": "@theScoreNBA Thank you whoever saved this Orlando Magic legend 💙",
    "308": "TNT takes yet another shot at the Magic on inside the NBA. So tired of it. Chuck: Shouldn’t they be working on there games. Might explain the BS in Orlando. #MagicTogether  They don’t have a clue https://t.co/MLTCw2UlKb",
    "309": "I hated @SHAQ when he left the @OrlandoMagic but now I can't front he like my best friend &amp; he don't even know me. Go head SHAQ! Next billionaire #Shaq",
    "310": "6/24/92 @shaq drafted 1 by @OrlandoMagic  (8) days after (33) yr mark of George Reeves death original Superman \n\nShaq wore (33) at @LSUBasketball 89-92\n\nGeorge would have been age (78) for shaq draft. 1st Superman movie came out 12/15/(78) 14 yrs prior https://t.co/anWzMS5YXO",
    "311": "Orlando Magic great Otto Porter Jr.  playing big for GSW tonight",
    "312": "The #Nuggets are looking for their second straight victory on the road against the #Magic. Preview: Denver Nuggets look for win against Orlando Magic #MileHighBasketball @GbridgfordNFL https://t.co/V1POgb9ECT https://t.co/awPFs7mBUv",
    "313": "https://t.co/V3fD6ZABt7 NBA2k22; With #2 Orlando Magic 43-21. 3 game line-up. Rookie season record,  MyCareer mode part 33. Looking to take over that #1 Eastern spot as we face Memphis Grizzlies, Phoenix Suns then N.O. Pelicans. As I work my way to the Bulls.",
    "314": "Check out 1996-97 Stadium Club Class Acts Anfernee Hardaway Refractor #CA9  #OrlandoMagic https://t.co/ntGYuJFK7C via @eBay",
    "315": "@TheHoopCentral Anthony Cole from #OrlandoMagic",
    "316": "This is the Otto Porter the Wizards paid, bulls traded for and the Orlando magic brought off the bench. Crazy",
    "317": "Want to see the @SacramentoKings take on the @OrlandoMagic on December 8th at @Golden1Center? Listen LIVE in 15 minutes for your shot to WIN a pair of tickets! 🏀 https://t.co/t0zuctjrjU",
    "318": "What’s your favorite nickname for Franz Wagner? \n\n#MagicTogether #OrlandoMagic #NBA https://t.co/uAnmoK2IAn",
    "319": "@jandro0o So most people don’t know that they actually did an investigation in Orlando over this and found that one of the ceiling tiles in Bulls locker room had been moved and his Jersey hidden in the ceiling.  The Magic fired the employee responsible.  He never got away with this.",
    "320": "Looking like Orlando magic Dwight",
    "321": "@_SantiMagic @OrlandoMagic Not sure",
    "322": "@OTownNBA @OrlandoMagic When’s MCW back",
    "323": "@BobbyCa75435324 Haha of course I do. (Dennis Scott was a legend on my Orlando Magic btw!) Just making Georgia jokes :)",
    "324": "Gordon MacPhee is such a cool dude. We share love for food, New Orleans, travel and of course Chino. Can’t wait to hang next time you’re in town.\n\nThanks for putting up with my incessant jokes about Orlando Magics 💙\n\nThank you for your Movember donation.\n\nhttps://t.co/8uzG1k5F7x https://t.co/GVm53Tj0Il",
    "325": "Serious question … Is Franz Wagner the best player right out of colllege the Magic have drafted in recent years?\n\nBetter than JI, Mo, Okeke, Cole? \n\nThoughts? #OrlandoMagic #MagicTogether https://t.co/64jnPZxmUI",
    "326": "Seth Curry led the way in order for the Philadelphia 76ers to escape the Orlando Magic at home.  https://t.co/hnpCX9OdXw",
    "327": "The best game by a team in week 5 was by the @PelicansNBA  when they took on the @WashWizards on 11/24/2021.\n\nThe worst game by a team in week 5 was by the @OrlandoMagic when they took on the @chicagobulls  on 11/26/2021.\n\nWhich games do you consider the best and worst this week?",
    "328": "@HanaHoops Orlando magic legend",
    "329": "ORLANDO MAGIC LEGEND EVAN FOURNIER",
    "330": "@OrlandoMagic @AdventHealth @franzboogie Love him, no homo",
    "331": "@OrlandoMagic @jalensuggs Yes, heal up your hand and please come back stronger… need more beast mode upon ur return",
    "332": "@OrlandoMagic He’s by far top 3 Magic players on our roster, I would even say he’s a possible #1 with all he does on the court….",
    "333": "Magic’s Jalen Suggs not requiring surgery on injured thumb #JalenSuggs #OrlandoMagic https://t.co/xd0Xnk83Qs",
    "334": "Every time I see a player flourishing after leaving the Orlando Magic https://t.co/lQLbykcuYa",
    "335": "@Noah33185330 @Heat4life01 Exactly, usually it’s Miami snagging former Orlando Magic players",
    "336": "@DomiNateFF Are you kidding me? \n\nRocking the Orlando Magic, playing some @shaq diesel on my discman. \n\nVery happy social media was limited to ICQ and we don't have those pictures everywhere 🤣🤣 https://t.co/9414otGhEg",
    "337": "@HoopMixOnly i remember back in the day when Anthony Hardaway take easy jump shot or he would Shaquille O’Neal in side The paint for the dunk I  used to watch the Miami Heat versus Orlando Magic  on nbc back in 1997",
    "338": "Playing Now - Orlando's In The House by Dj Magic Mike &amp; Mc Madness https://t.co/O0OqR2vFil https://t.co/a8hhJCRul8",
    "339": "Without Fred and Scottie we'd basically be the @OrlandoMagic this year....",
    "340": "@OrlandoMagic @jalensuggs God is good 🙏🏻",
    "341": "@OrlandoMagic @jalensuggs Rest up Jalen Suggs 🙏😔 🕊",
    "342": "Jalen Suggs avoided surgery on fractured thumb, Orlando Magic announced Tuesday night  https://t.co/aZFevdOWhH",
    "343": "@OrlandoMagic @jalensuggs Prayers goat",
    "344": "Going to LA for the @OrlandoMagic game and my mom just asked if we’re still gonna go since LeBron won’t be there 🙄🙄🙄🙄",
    "345": "heal up @jalensuggs 🙏\n\n#MagicTogether \n\nhttps://t.co/Tln3yIeknG",
    "346": "An Improved Player Overall, Wendell Carter Jr.’s Greatest Impact Might Be on Defensive End\n https://t.co/cwK8jWZkU4 via @OrlandoMagic \n\n@wendellcarter34 @dukebasketball @VanguardSG",
    "347": "🚨 INJURY UPDATE:\n\n@OrlandoMagic guard @jalensuggs will not need surgery; will be re-evaluated every two weeks\n\n#MagicTogether \n\nhttps://t.co/A3JDXLPU0h",
    "348": "@JoshuaR65507965 @SixthManShow @OrlandoMagic For sure, I know success is cyclical in this league but this cycle has been a tough hang",
    "349": "I’m sure it will cost me an airdrop soon… But I am still holding strong over here with my one man protest against Pierce for his years of hating on the Orlando Magic. ✊🏼\n\n#MagicTogether https://t.co/AE9fdOPfPN",
    "350": "No surgery needed on Orlando Magic guard Jalen Suggs' fractured right thumb, per team. He will be evaluated every two weeks to gauge healing.",
    "351": "@DraftKings Orlando magic throwback jerseys",
    "352": "@FloGr0wn239 @OrlandoMagic Everyone knows who that beast is",
    "353": "@SwoopLuke Get a Mychal Mulder #2 @OrlandoMagic jersey, can guarantee 99.99% of Australians have no idea who that is…"
}