{
    "0": "San Antonio Spurs (-1) vs. Brooklyn Nets! #NetsWorld #PorVida #NBA #NBATwitter #NBA75",
    "1": "San Antonio Spurs Starters:\n\nDejounte Murray\nDerrick White\nDoug McDermott\nKeldon Johnson\nJakob Poeltl\n\n#PorVida #NBA #NBATwitter #NBA75",
    "2": "Tonight's starting lineup for the San Antonio Spurs: Murray, White, Johnson, McDermott, Poeltl https://t.co/bVWH4AMCA2",
    "3": "Greetings from San Antonio. Nets-Spurs tip shortly. It's colder here than it should be. Homecoming for Patty Mills, LaMarcus Aldridge and 359305 team personnel associated with this place. Nets looking to make it two in a row.",
    "4": "San Antonio Spurs vs Brooklyn Nets Live Stream - NBA 2022\nWatch : https://t.co/XcINMUvAxz\n\nVenue: AT&amp;T Center (San Antonio)\n#SanAntonioSpurs #BrooklynNets #NBAAllStar #Livestream https://t.co/qMooxMPfCZ",
    "5": "San Antonio Spurs - Brooklyn Nets\n\nBet slip link: https://t.co/AGtJgaTHgC\n\n#SanAntonioSpurs #BrooklynNets #tron #trx #lasvegas https://t.co/SipLcncXJU",
    "6": "It's 🇦🇺 vs. 🇦🇺 today in San Antonio as @Patty_Mills and the Nets take on @JockLandale and the Spurs. \nTip-off at 1230pm AEDT. \n\n#NBA75 \n\n📲💻 Watch live on League Pass: https://t.co/7kdyNBxy64 https://t.co/vqFbGmktmc",
    "7": "Patty Mills returns to San Antonio in Friday night matchup between the Spurs and Brooklyn Nets #PorVida\nhttps://t.co/8RLCbvGAGs",
    "8": "It’s time for Basketball: San Antonio Spurs vs Brooklyn Nets https://t.co/r70fEFKEDI https://t.co/gh85rG32U0",
    "9": "NBA Live Thread: Brooklyn Nets at San Antonio Spurs, 8:30 PM EST https://t.co/v6mTUbXxBc https://t.co/ca6iavALgk",
    "10": "Devin Vassell 1/1 Rookie Titan Black Parallel pulled last night from our @paniniamerica Flux Basketball breaks!\n💣💥🔥 @Yvngdevo \n#boom #whodoyoucollect #rookie #spurs #sanantonio #basketball #titan #nba #groupbreaks #1of1 #thehobby https://t.co/W8VcJVZyoM",
    "11": "Today's NBA Picks: 8:40 PM ET - Brooklyn Nets vs. San Antonio Spurs - 17 PICKS AVAILABLE: https://t.co/B84la4zejf #nba",
    "12": "Spurs haven't made any moves since losing them.\nI like the energy, but we need wins.\n#Spurs #SpursNation #PorVida #SanAntonio https://t.co/ilaDE2zvNJ",
    "13": "The AT&amp;T Center crowd will show Patty Mills a ton of love for everything he did for San Antonio.\n\nBut I hope everyone gives LaMarcus Aldridge his flowers for his time with the team.\n\nHe had multiple All-NBA nods with the Spurs and kept the playoff streak alive when Kawhi bailed.",
    "14": "What's #Best today on https://t.co/DVTf2jd2ZR ?\nHighlights: Dejounte Murray 23 Pts 14 Ast 10 Reb 3 Stl : San Antonio Spurs Vs. Okc Thunder : 1.19\nhttps://t.co/GSsi6VvI0v\n#sports https://t.co/wEQ8m5Vq7B",
    "15": "#Best of the day on https://t.co/MqmlMsmdvk\nHighlights: Dejounte Murray 23 Pts 14 Ast 10 Reb 3 Stl : San Antonio Spurs Vs. Okc Thunder : 1.19\nhttps://t.co/hf9knjpj1m\n#sports",
    "16": "What's #Best today on https://t.co/VfZu3jgOen ?\nHighlights: Dejounte Murray 23 Pts 14 Ast 10 Reb 3 Stl : San Antonio Spurs Vs. Okc Thunder : 1.19\nhttps://t.co/RlEdG3kBJq\n#sports",
    "17": "Spurs: ESPN replaces Memphis Grizzlies vs. San Antonio #Spurs with #Heat-#Knicks - The Commercial Appeal https://t.co/fMiQ0ARFVg",
    "18": "NBA Basketball Game Betting Picks Simulator: 8:40 PM ET - Brooklyn Nets vs. San Antonio Spurs - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/zbLJqkJF9t #nba #sportsbetting #freepicks #cappertek",
    "19": "ALERT: New high roller bet posted!\nA bet has been placed for $5,909.99 on San Antonio Spurs - Brooklyn Nets to win $11,701.78.\nTo view this bet or copy it https://t.co/UDZl3YX5MZ https://t.co/geWjN28UQi",
    "20": "San Antonio Spurs: #Nets Injury Report Against The #Spurs - Fastbreak on FanNation - Sports Illustrated https://t.co/EnetvDBFBE",
    "21": "Brooklyn Nets vs. San Antonio Spurs | USA: NBA\nThe match will start at 08:30 PM, January 21, 2022\nVenue: AT&amp;T Center (San Antonio)\n🔴 Link for this Match 👉 https://t.co/dWAshmqwTK\nLet's watch live online, Thank you https://t.co/asEPS7f7ET",
    "22": "😭 RT @DamichaelC: Memphis Grizzlies vs. San Antonio Spurs on Jan. 26 will no longer be televised nationally on ESPN. That game is being replaced by New York Knicks vs. Miami Heat. Grizzlies lose one of their seven nationally televised games.",
    "23": "🔴Live ~ Brooklyn Nets vs. San Antonio Spurs - NBA League  2022 💯\n📅 : 21 January, 2022📌\n⏰: 8:30 PM📌\n▼F̾oͦl̾l̾oͦw▼ 🔗Link 🌐 ⭆ https://t.co/lAy4yvZpt0✅",
    "24": "1/21/16 – On TNT, Tyson Chandler had 9p/20r, but the San Antonio Spurs blew out the Phoenix #Suns 117-89. Devin Booker led all scorers with 24p while Archie Goodwin followed him up with 20p. T.J. Warren had 18p off the bench. The loss was PHX's 15th out of 16 games. #ValleyProud https://t.co/Boif7Aw3mR",
    "25": "Relentless\nWHALE PLAY PACKAGE:\n1. Denver Nuggets ML (NBA) 🏀 01/21/2022 6:00 PM PST\n\nNBA VIP PACKAGE\n\n1.)Denver Nuggets ML (NBA) 🏀 01/21/2022 6:00 PM PST\n\n2.) San Antonio Spurs ML (NBA) 🏀 5:30 PM PST\n\n3.) Washington Wizards +2 (NBA) 🏀 5:00 PM PST",
    "26": "San Antonio Spurs’ Drew Eubanks grateful for LaMarcus Aldridge’s mentorship  https://t.co/fslcOCetlp #SpursNation #GoSpursGo https://t.co/rAii8n8pdo",
    "27": "Patty Mills making the most of moving on from San Antonio Spurs  https://t.co/fpFcxXHrXN #SpursNation #GoSpursGo https://t.co/e4re6JaRAF",
    "28": "San Antonio Spurs: ESPN removes Memphis Grizzlies vs. San Antonio Spurs:  from Jan. 26 slate https://t.co/SMs7ZPIgau",
    "29": "Little trip to San Antonio. Gonna watch the beard and kyrie trash the spurs. https://t.co/pmovAjN39h",
    "30": "NBA Pick of the Day  🏀⭐️\n\nSan Antonio Spurs -1.5 vs. Brooklyn Nets (2U)\n\n$1,100 bet to win $1,000\n\nAs always, please bet responsibly \n\n#GamblingTwitter #MercenaryBet \n\n#NBA  #NBA75 https://t.co/y3mwIWnRO3",
    "31": "Loaded free card! \n\nSt Bonaventure -6 -110\nPittsburgh Pens -1.5 +115\nAtlanta Hawks -2.5 -110\nSan Antonio Spurs -1.5 -110\nFL Panthers Van Canucks over 6.5 -125\n\nTwo client plays ⬇️\nhttps://t.co/agiQfMFEyS",
    "32": "[LIVE] 2022 NBA Basketball San Antonio Spurs vs Brooklyn Nets | [Stream Now] : https://t.co/wsbjwgcejk | Date : 21-Jan-22 | 20:30 | NBA | Basketball | San Antonio Spurs | Brooklyn Nets | Brooklyn Nets vs San Antonio Spurs NBA Basketball [LIVE] 2022 https://t.co/fxhMA8X2ew",
    "33": "\"The last time a Spurs player averaged more assists was Avery Johnson in the 1995-96 season. Bob Hill was coaching San Antonio, and Murray was in utero.\"\n\nAmazing line and article overall from @RealTomPetrini #DejounteMurray #NBAAllStar https://t.co/8p6NoG5kVi",
    "34": "If @VivaAerobus wants to send me to Monterrey to rep @spurs + #SanAntonio, I’m down! 😆 https://t.co/ORwjx8AvKQ",
    "35": "🔴[LIVE'STREAM] ~ Brooklyn Nets vs San Antonio Spurs - NBA League 2022\n🔴Broadcast Link !! https://t.co/UbF9L5f9mD ✅\nDate : On Friday. January 21 /2022\nTime : 8:30 PM",
    "36": "🇦🇺 From adapting to the NBA to carrying the Aussie legacy in San Antonio and working with Coach Pop, check in with @JockLandale on this week's episode of Courtside Huddle.\n\n#CourtsideHuddle #NBAAustralia #NBA75 #GoSpursGo @spurs https://t.co/Kw9dYX0gJy",
    "37": "San Antonio Spurs - Brooklyn Nets\nBrooklyn Nets +1,5 AH (1.95)\nPinnacle/2 units",
    "38": "If the team was called the Las Vegas Spurs this would never happen the nba hates San Antonio https://t.co/nZoWsXX8Rs",
    "39": "Patty Mills making the most of moving on from San Antonio Spurs https://t.co/cvWm6ZLINJ",
    "40": "Back BROOKLYN NETRS to BEAT San Antonio Spurs tonight in the @NBA (Game Starts at 01.40 GMT) #NBA #Basketball",
    "41": "1/21\n\n#NBA\nSan Antonio Spurs ML (-120)\n\n#NBATopShotThis #NBATwitter #FanDuel #DraftKings #Spurs #NetsWorld #GamblingTwitter https://t.co/7xibrNCwAf",
    "42": "Todays pick is the over in the Brooklyn Nets vs Spurs game. The last 5 matchups have hit the over and Kyrie usually goes crazy in SanAntonio. That’s the play today.",
    "43": "ESPN announce that the Knicks-Heat game on Jan. 26 replaces the previously scheduled game between the Memphis Grizzlies and San Antonio Spurs. Telecast starts at 7:30 pm.",
    "44": "@Tiffscribes Funny Popp story: back in 2019, I got hubs and I nosebleed seats to see the Spurs play the Mavs here in Dallas (hubs grew up in San Antonio). \n\nI swear I had Popp yelling at somebody from the nosebleed section. 🤣",
    "45": "Today @Patty_Mills makes his return to San Antonio as the @BrooklynNets take on the @spurs.\n\n#AussieHoops #NBA",
    "46": "San Antonio Spurs’ Drew Eubanks grateful for LaMarcus Aldridge’s mentorship https://t.co/7GM2Dy7glr",
    "47": "San Antonio Spurs -1 -111 (1 unit)",
    "48": "NBA:\nPortland Trail Blazers Alta  212 -110 [1]\nPortland Trail Blazers +8.5 -110 [1]\nOklahoma City Thunder Over 224 -110 [3] MAX \nSan Antonio Spurs -1 -110 [1]\nHouston Rockets Alta  229 -110 [3] MAX",
    "49": "Check out San Antonio Spurs's video! #TikTok https://t.co/cXkvcwAtWW",
    "50": "San Antonio Spurs: The Comeback Trail: Zach Collins Takes Us Through His Return To Basketball, Part 1 https://t.co/1J5i2vqvtk",
    "51": "The 1997 GMC Yukon 2 Door Sport SUV is in need of a total restoration. Nevertheless, it's listed for $10,000. #SanAntonio #SATX #SanAntonioTX #Spurs #TimDuncan #NBA #basketball #Sports \n\nhttps://t.co/T9O9vBOVS3",
    "52": "BROOKLYN NETS vs\nSAN ANTONIO SPURS, 9:30PM.",
    "53": "NBA Play: 🏀✨\n\n1️⃣Spurs ML (-120)\n\n-San Antonio is 17-1 SU in its last 18 games when playing at home against Brooklyn.\n\nNets beat Spurs in OT in their last matchup, so this is a revenge spot for the Spurs https://t.co/vUyLcrrfMy",
    "54": "Heads up, Spurs fans...\n\nThe Memphis at San Antonio game will no longer be televised by ESPN, game time changed to 8:30 PM ET / 7:30 PM CT #porvida #nba75",
    "55": "Memphis Grizzlies vs. San Antonio Spurs on Jan. 26 will no longer be televised nationally on ESPN. That game is being replaced by New York Knicks vs. Miami Heat. Grizzlies lose one of their seven nationally televised games.",
    "56": "Brooklyn Nets at San Antonio Spurs Tips &amp; Preview\n\n#Nets #Spurs #NBA \n\nhttps://t.co/s9FjI86b3V",
    "57": "It me, the Tottenham fan because it was easier for me to root for two Spurs in the early 2000s than it was to remember to root for the San Antonio Spurs and then a thing called a “Chelsea” https://t.co/fdI4U0psdx",
    "58": "San Antonio Spurs: Former Portland Trail Blazers lottery-pick Zach Collins close to return https://t.co/84Gkxm0GJJ",
    "59": "BCAARKDZ\n\n250.5+\nAtlanta Hawks v Miami Heat\nPoint range\n27.00\n\n 250.5+\nSan Antonio Spurs v Brooklyn Nets\nPoint range\n5.70\n\n 250.5+\nDenver Nuggets v Memphis Grizzlies\nPoint range\n14.50\n\n2,231 ODD\nSINGLE AND STAKE",
    "60": "@spurs This will be my first Spurs game in San Antonio in almost 10 years!! 🤩",
    "61": "Nets in San Antonio tonight, 3rd game of a 4 game road trip, looking to win back to back games for the 1st time since December 25th/27th when they beat the Lakers &amp; Clippers in LA- #Nets vs #Spurs Preview. #NetsWorld #PorVida #NBA #NBA75 https://t.co/0sw57jGBnk",
    "62": "San Antonio Spurs-themed airplane to take flight soon https://t.co/WbqZNJoBCp",
    "63": "OKC Thunder: #Nets take on #Spurs in San Antonio as Patty Mills, LaMarcus Aldridge return - #NetsDaily https://t.co/TtRLMomq1u",
    "64": "I love how all these Spurs related deals and moves all point to the Spurs staying in San Antonio and yet theres still nature repulsed mind goblins being like \"the Spurs are going to vegas, its all a False flag and smokescreen\" like its some kind of FBI shadow op.",
    "65": "Juancho Hernangomez has made it to San Antonio from Boston. He's hoping to bring energy to this young #Spurs squad. \n\n@News4SA | @KABBFOX29 https://t.co/2gYfmPVsuW",
    "66": "Consensus Line Move:\n2022-01-21 Brooklyn Nets at San Antonio Spurs from 232.50 to 234.50\nOver business time\n#NBA #bettingtips #datascience #money",
    "67": "Consensus Line Move:\n2022-01-21 Brooklyn Nets at San Antonio Spurs from 0.00 to -1.00\n#PorVida feeling frisky\n#NBA #sportspicks #datascientist #success",
    "68": "Juancho Hernangomez was in the dark for hours about the three-way trade that sent him from Boston to San Antonio.\n\n\"It's a crazy story,\" he said today at #Spurs shootaround.\nhttps://t.co/MGMswXmrp4",
    "69": "Both still in the game, just not in providing hoops content to the fans. ED with CAA (agency) and Telep with San Antonio Spurs",
    "70": "@JeffGSpursZone Yes. Played crucial role in many moments. And supporting the idea, his contributions to the San Antonio community as a representative for the Spurs puts him over the top. It's not the hall of fame. Jersey retirements IMO are wholly about contribution to organisation",
    "71": "Check out 1997 Bowman's Best #106 Tim Duncan Rookie Card San Antonio Spurs Graded SGC 9.5 https://t.co/m6adVZEx6O @eBay",
    "72": "San Antonio Spurs, Mexican carrier Viva Aerobus announce sponsorship https://t.co/KyjV654ytw",
    "73": "Brooklyn Nets vs. San Antonio Spurs | USA: NBA\nThe match will start at 08:30 PM, January 21, 2022\nVenue: AT&amp;T Center (San Antonio)\n🔴 Link for this Match 👉 https://t.co/dWAshmqwTK\nLet's watch live online, Thank you https://t.co/wmoLuSnDlg",
    "74": "Consensus Line Move:\n2022-01-21 Brooklyn Nets at San Antonio Spurs from 1.00 to 0.00\n#PorVida adjust quickly\n#NBA #handicapper #statistics #makemoney",
    "75": "On this episode of Locked On Spurs, host @JeffGSpursZone welcomes San Antonio Sports Star's Michael Jimenez to preview Friday night's Spurs game versus the Nets, as well as look at Lonnie Walker IV's recent slump. https://t.co/ksVV8QlGvX",
    "76": "San Antonio Spurs: SB Nation Reacts: The Spurs are getting in on the trade deadline festivities https://t.co/RxjolcjfXd",
    "77": "New tumblr post: \"### NBA2K22 San Antonio Spurs vs Phoenix Suns MyLeague PS4 GAMES...\" https://t.co/wo7WHUTxop ifttt, youtube",
    "78": "Spurs: San Antonio #Spurs vs Brooklyn #Nets - Preview, Tips and Odds - Sportingpedia https://t.co/fMiQ0ARFVg",
    "79": "Analyzing Friday’s Brooklyn Nets at San Antonio Spurs odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/nhHQmoDwFg",
    "80": "Brooklyn Nets at San Antonio Spurs odds, picks and predictions https://t.co/tOLsuFpazi",
    "81": "Spurs: San Antonio #Spurs vs Brooklyn #Nets 1/21/22 NBA Picks, Predictions, Odds - Sports Chat Place https://t.co/VGMuWJ5Iii",
    "82": "San Antonio Spurs: Brooklyn #Nets vs. San Antonio #Spurs Prediction and Odds (Back Brooklyn On The Road) - FanSided https://t.co/EnetvDBFBE",
    "83": "Hernangomez says he can be a versatile, high-energy player for Spurs.\n\n\"I love the way San Antonio competes every time. They beat us two times this year…I know they are trying to rebuild and they have young guys and they are working really, really hard...It’s going to be fun.\"",
    "84": "🏀 GAME DAY 🏀\n\nNets head to the lone-star state to battle the Spurs\n\n🆚 San Antonio Spurs\n🏟️ AT&amp;T Center\n🎽 Statement\n⏰ 8:30 PM\n📺 YES\n📻 WFAN https://t.co/HvhFxVMAiI",
    "85": "Show love and RT for these Spurs legends coming back tonight!! Show love San Antonio 🖤🤍\n#DejounteMurray #NBAAllStar https://t.co/YuouJf3qUi",
    "86": "Look up: There will soon be a Spurs-themed airplane in the skies. \n\n🖊️: @camillesaccount \n\nRead more on how to catch the flight out of San Antonio: https://t.co/yXeeKesnMz #PorVida @mySA https://t.co/cxxBf0gxMC",
    "87": "Including earlier this month, Patty Mills has played just 4 games AGAINST the Spurs in his career. Tonight will be his first game in San Antonio as a visitor since March 28, 2011.",
    "88": "LIVE ~ Brooklyn Nets vs San Antonio Spurs - NBA League 2022\n🔴Official Live📺📱:  https://t.co/QeV1waPXiM\nDate : Friday, Jan. 21 - Time : 8:30 PM",
    "89": "#NBA75 tonight:\n\nHouston Rockets +10.5 @ 1.90\nSan Antonio Spurs (Money Line) @ 1.97\nWashington Wizards (Money Line) @ 1.91\nBoston Celtics -8.5 @ 1.96\n\nGood luck !",
    "90": "When the Spurs host the Nets on Friday night, it will mark the first time that both former Spurs LaMarcus Aldridge and Patty Mills come back to San Antonio albeit as the opposition. https://t.co/oxhyojF1SU",
    "91": "Looking ahead to tonight: The Nets are carrying a four-game win streak against the Spurs — longest ever streak in franchise history. \n\nLaMarcus Aldridge said he “excited” to play in San Antonio to play, and added how he’s excited for Patty Mills to play in San Antonio as well.",
    "92": "Congratulations to sql who moved up 66 spots to take #42 on the San Antonio Spurs team leaderboard.\n\nhttps://t.co/HQxWdPfRe7",
    "93": "San Antonio Spurs: With Eye On The Future, San Antonio Spurs:  Trade Bryn Forbes To Denver Nuggets In Rare Mid-Season Move https://t.co/XLkXQHNV9j",
    "94": "NBA Betting Preview: Brooklyn Nets vs. San Antonio Spurs https://t.co/d0jod0eBb4",
    "95": "Brooklyn Nets vs. San Antonio Spurs - NBA League 2022\n📺📱Live Stream Available➠  https://t.co/T84jXID4q9\n📅 : Friday, January 21, 2022\n⏰ : 8:30 PM",
    "96": "With Eye On The Future, San Antonio Spurs Trade Bryn Forbes To Denver Nuggets In Rare Mid-Season Move https://t.co/3AWBvyyNKl https://t.co/2pEuU9zGo7",
    "97": "New post (Brooklyn Nets vs San Antonio Spurs NBA Pick – January 21) has been published on The Sports Geek - https://t.co/t7IjHa6lPL https://t.co/kMVCSncGUe",
    "98": "375000 Texans in S. TX are food insecure . Leadership SA\n Alumni Association  donated $43k to SA Food Bank.\n\nSpurs' Tim Duncan matched that amount.\n\nSo San Antonio Food Bank now has $86k to fight hunger",
    "99": "Revenge Game: Patty Mills plays San Antonio tonight.  He played 597 games in his career for the Spurs.",
    "100": "Revenge Game: LaMarcus Aldridge plays San Antonio tonight.  He played 355 games in his career for the Spurs.",
    "101": "Hey #Spurs fans. I know that @mattbonner_15 didnt treat Himself sirius in His life/#NBA carrer but this is MUST WATCH PURE GOLD &lt;3\n\n#MattBonnerr #SanAntonio #SanAntonioSpurs #NBAtwitter #NBAtwitterLive #NBAhistory #NBA75 #SpursNation #SpursTwitter\n\nhttps://t.co/amL1OGcSug",
    "102": "@ttrinityb SAN ANTONIO SPURS",
    "103": "LIVE NOW: San Antonio Spurs announce VIVA Aerobus partnership at San Antonio International Airport. https://t.co/ogbLnRNdl0\n https://t.co/4OvRGnzBjf",
    "104": "WATCH IT LIVE: San Antonio Spurs announce VIVA Aerobus partnership at San Antonio International Airport. https://t.co/ZbJXRjefIv\n https://t.co/wpMHfjZYLX",
    "105": "📰 Brooklyn Nets vs San Antonio Spurs Predictions and Odds Jan 21!\n👉 https://t.co/eFhAp8YeNS @wagertalk",
    "106": "Denver, Boston and San Antonio are making a three-way trade that includes  Pedro Gomez to Spurs, Bryn Forbes-List to Denver, Manute Bol and Hunter Dozier to Celtics, sources tell ESPN.",
    "107": "With Eye On The Future, San Antonio Spurs Trade Bryn Forbes To Denver Nuggets In Rare Mid-Season Move https://t.co/dpJKC6jHVH",
    "108": "All you need to know ahead of Friday’s Nets at Spurs game in San Antonio.  https://t.co/6Igs6ac9Vx",
    "109": "GO SPURS GO: The San Antonio Spurs (17-28) will host the Brooklyn Nets (28-16) Friday night for their final meeting of the season. https://t.co/9jFlSu3N2h",
    "110": "DasHaus made a bet!\n\nEvent: Brooklyn Nets vs San Antonio Spurs #NBA\nBet: Brooklyn Nets TO WIN -1.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "111": "With Eye On The Future, San Antonio Spurs Trade Bryn Forbes To Denver Nuggets In Rare Mid-Season Move https://t.co/bXMTv5ZJP1",
    "112": "With Eye On The Future, San Antonio Spurs Trade Bryn Forbes To Denver Nuggets In Rare Mid-Season Move https://t.co/Q3t9eyE0jq https://t.co/UOarnzqZ00",
    "113": "With Eye On The Future, San Antonio Spurs Trade Bryn Forbes To Denver Nuggets In Rare Mid-Season Move https://t.co/OALvILyzxe",
    "114": "Spurs: How to Watch Brooklyn #Nets vs. San Antonio #Spurs Game Live Online on January 21, 2022 https://t.co/AiM1vW1vBk",
    "115": "Consensus Line Move:\n2022-01-21 Brooklyn Nets at San Antonio Spurs from 2.50 to 1.00\n#PorVida with respect\n#NBA #bettingexpert #datascientist #entrepreneurship",
    "116": "Nets take on Spurs in San Antonio as Patty Mills, LaMarcus Aldridge return – NBA News https://t.co/LsHb0dBumt",
    "117": "Spurs: How to Watch Brooklyn #Nets vs. San Antonio #Spurs Game Live Online on January 21, 2022 https://t.co/F6XTLARq6P",
    "118": "🏀NBA Play:\n\nSan Antonio (+2.5) vs Brooklyn (-130) (1u)\n\nBuying a point here. 88% of the bets are on Brooklyn spread. Brooklyn are 12-24-1 ATS as favorites this season. (3rd worst in the NBA) Spurs are 16-15 ATS as underdogs this season.\n\n#GamblingTwitter #NBA\n#NBATwitter #NBA75 https://t.co/2ZVgUZ2XPk",
    "119": "NBA Player Prop:\nDerrick White Under 17.5 Points -112 (San Antonio Spurs)\n\nWhite has scored 17 or less in 65% of his gp this year. I have him projected to finish with 14.",
    "120": "Check out San Antonio Spurs's video! #TikTok https://t.co/T3m26T8dhF",
    "121": "Dejounte Murray is an All Star. I don’t wanna hear it…man is too raw.\n\nGonna hit up a Spurs game when I’m in San Antonio this summer😎",
    "122": "Nets take on Spurs in San Antonio as Patty Mills, LaMarcus Aldridge return to fold https://t.co/3lMCIyzITJ https://t.co/HG2598KbDv",
    "123": "🚨 Line Change 🚨\n\nBrooklyn Nets @ San Antonio Spurs\nFri 8:40 PM EST\n\nFrom:\nSA 2.5 -110\n\nTo:\nSA 1.5 -105",
    "124": "@KBowen1070 @jakequery despite enjoying the win last night are we at the point now where it's better for the Pacers to lose? Pulling a San Antonio Spurs this year doesn't seem like a bad idea.",
    "125": "I decided the Mount Rushmore should hung on not only who dominated but who best grew the sport\n\nTo that end, I nearly put Dale Jr. Its no fault of Johnson, aka NASCAR’s equivalent of the turn of the century San Antonio Spurs https://t.co/yys9rxrEyT",
    "126": "Consensus Line Move:\n2022-01-21 Brooklyn Nets at San Antonio Spurs from 234.50 to 232.50\nUnder in trouble\n#NBA #espn #technology #cash",
    "127": "Tonight the Brooklyn Nets (28-16) visit the San Antonio Spurs (17-28) at 8:30 🕣 @YESNetwork #Brooklyn #Nets #NBA #NetsWorld",
    "128": "San Antonio Spurs: Pop is nine wins from being named “all time” winningest coach in NBA history...again https://t.co/2SGkWQykzv",
    "129": "Doctrines, I'm preparing a table, but it's still a big mess. My focus are San Antonio Spurs &amp; Miami Heat as examples of franchises with a clear set of prevalent doctrines that makes everything else happen.\n\nLack of clear culture (for instance Sacramento Kings) is also helping me",
    "130": "San Antonio Spurs: Becky Hammon, DeLisha Milton-Jones, Penny Taylor among 12 finalists for Women's ... - ABC7 https://t.co/EnetvDBFBE",
    "131": "Game Preview: San Antonio Spurs vs. Brooklyn Nets https://t.co/AU7Zj3V51u",
    "132": "San Antonio Spurs: Game Preview: San Antonio Spurs:  vs. Brooklyn Nets https://t.co/Z3z0jigxVS",
    "133": "Dejounte Murray crucial for San Antonio Spurs in close win vs. Boston Celtics 🤩 https://t.co/DfFqa8x7uU",
    "134": "NBA Basketball Game Betting Picks Simulator: 8:40 PM ET - Brooklyn Nets vs. San Antonio Spurs - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/zbLJqkJF9t #nba #sportsbetting #freepicks #cappertek",
    "135": "Game Preview: San Antonio Spurs vs. Brooklyn Nets https://t.co/vor9uYHMt9",
    "136": "Orlando Magic - Los Angeles Lakers\nPhiladelphia 76ers - Los Angeles Clippers\nBoston Celtics - Portland Trail Blazers\nMilwaukee Bucks - Chicago Bulls\nSan Antonio Spurs - Brooklyn Nets\n\nBet slip link: https://t.co/frvTRKL6aZ https://t.co/ggflhfa7ay",
    "137": "Congratulations to nole91 and stephen_flurry (@fdeaconf) who moved up to take #30 and #38 on the San Antonio Spurs team leaderboard.\n\nhttps://t.co/HQxWdPfRe7",
    "138": "Spurs: Bryn Forbes says bye to San Antonio | https://t.co/9l575GBzpf https://t.co/fMiQ0ARFVg",
    "139": "Spurs: San Antonio #Spurs vs Brooklyn #Nets: Predictions, odds, and how to watch or live stream free ... https://t.co/6OH035K8gq",
    "140": "Spurs: Top Performers: Daigneault's \"Bench Mob\" Bolsters #Thunder Versus San Antonio - Sports Illustrated https://t.co/xlxdoyUWqX",
    "141": "San Antonio Spurs: San Antonio #Spurs Stax | Sports | https://t.co/VbSo7wn59Z https://t.co/EnetvDBFBE",
    "142": "What's #Best today on https://t.co/DVTf2jd2ZR ?\nHighlights: San Antonio Spurs 118 Oklahoma City Thunder 96 : 1.20.2022\nhttps://t.co/oMastW2AqO\n#sports https://t.co/2WCGQDHiks",
    "143": "#Best of the day on https://t.co/MqmlMsmdvk\nHighlights: San Antonio Spurs 118 Oklahoma City Thunder 96 : 1.20.2022\nhttps://t.co/rs6id5bOeF\n#sports",
    "144": "What's #Best today on https://t.co/VfZu3jgOen ?\nHighlights: San Antonio Spurs 118 Oklahoma City Thunder 96 : 1.20.2022\nhttps://t.co/oLJCtxFASP\n#sports",
    "145": "If you play the San Antonio Spurs in an NBA basketball game your team loses. The Spurs would then be 82-0 by default. https://t.co/to5XXLbMCi",
    "146": "Antonio Daniels on Jose Alvarado. Not something I ever expected to see. Two of my favorite championship guards from different generations: Daniels on the San Antonio Spurs 1999 NBA championship team and Alvarado on the Georgia Tech Yellow Jackets 2021 ACC championship team. 🏆🏆 https://t.co/1qsCe87dgm",
    "147": "Dave's Picks for Jan 21st, 2022\n\nCBB:\nMichigan State Spartans +4.5\nToledo Rockets +4.5\nKent State Golden Flashes +7.5\n\nNBA:\nMemphis Grizzlies +4\nBrooklyn Nets/San Antonio Spurs UNDER 234.5",
    "148": "Congratulations to PandaBearGuy who moved up 1 spot to take #4 on the San Antonio Spurs team leaderboard.\n\nhttps://t.co/HQxWdPfRe7",
    "149": "San Antonio Spurs: Why trading Bryn Forbes was the right move for the Spurs https://t.co/NDxX2PyEKh",
    "150": "Warriors run an old San Antonio Spurs staple out of the timeout. \"Loop\" action, beginning with a Zipper cut and feed to Wiggins, followed by Steph running around three staggered screens. Two go to Steph, feed to the rolling Looney for the dunk https://t.co/0lBCznDSTc",
    "151": "Check out San Antonio Spurs's video! #TikTok https://t.co/fq2alcCYep #NBAAllStar #DejounteMurray",
    "152": "Top 6 San Antonio Spurs Jackets For Winter 2022\nhttps://t.co/CGkRcjmLTN\n\n#gospursgo #porvida #dejountemurray #NBA75 #NBAAIIStar",
    "153": "The Brooklyn Nets resume life without Kevin Durant on the road with a battle against the San Antonio Spurs at the AT&amp;T Center. See more: https://t.co/0zyHZdGBVO\n.\n.\n#PNXBET\n#NBA\n#Nets\n#Spurs https://t.co/B2JAMF46XJ",
    "154": "🏀 Jan. 20, 2006: Tony Parker bests Dwyane Wade's 36 points with 38 as the San Antonio Spurs top the Heat, 101-94, as division leaders meet. #GoSpurs\n📋 Box score: https://t.co/ZbVjiUm6IU https://t.co/VZMPHnB66B",
    "155": "@TrevorWrites If anyone were to say this is a bad trade, they haven't been watching the games. Period.\n\nSan Antonio Spurs\n\nRECEIVE\n\nJerami Grant\n\nKillian Hayes\n\nDetroit Pistons\n\nRECEIVE\n\nDerrick White\n\nLonnie Walker\n\nKeita Bates-Diop\n\n2022 2nd round pick Spurs\n\nIt's gonna happen.",
    "156": "@EricSal_7 @jobes44 If anyone were to say this is a bad trade, they haven't been watching the games. Period.\n\nSan Antonio Spurs\n\nRECEIVE\n\nJerami Grant\n\nKillian Hayes\n\nDetroit Pistons\n\nRECEIVES\n\nDerrick White\n\nLonnie Walker\n\nKeita Bates-Diop\n\n2022 2nd round pick Spurs\n\nIt's gonna happen.",
    "157": "Cold ass night here in the H! Excited for tomorrow. I’ll be in San Antonio to watch the Nets vs Spurs live at AT&amp;T Center!!!! #NetsWorld",
    "158": "'Thank you San Antonio… for the second time' | Bryn Forbes says goodbye to fans after Spurs trade him to Denver https://t.co/tH8EX69RBw",
    "159": "Bryn Forbes says bye to San Antonio, Spurs players wish him the best https://t.co/HBx1ZbpNAu #nba75 #porvida #nbatwitter",
    "160": "Congratulations to Kurtchou and kizaza who moved up to take #15 and #90 on the San Antonio Spurs team leaderboard.\n\nhttps://t.co/HQxWdOYfPx",
    "161": "OKC Thunder: Highlights: San Antonio #Spurs 118, Oklahoma City #Thunder 96 | 1.20.2022 - YouTube https://t.co/JXr7dbngRC",
    "162": "I’m ready for this game however my employees decided to get covid lol jk I hope they get better soon and I hope to be out by 6:45. Can’t wait!! ⁦⁦@spurs⁩ San Antonio ready to welcome back former Spur Patty Mills with open arms https://t.co/msHuo6Ok0o",
    "163": "What's #Best today on https://t.co/DVTf2juDRp ?\nHighlights: Doug Mcdermott 20 Pts 6 3pm 2 Reb : San Antonio Spurs Vs  Oklahoma City Thunder : 1.19\nhttps://t.co/vUhxRsfzVa\n#sports https://t.co/eyxNTkKO4S",
    "164": "#Best of the day on https://t.co/MqmlMs4C6K\nHighlights: Doug Mcdermott 20 Pts 6 3pm 2 Reb : San Antonio Spurs Vs  Oklahoma City Thunder : 1.19\nhttps://t.co/mA753w7Ak3\n#sports",
    "165": "What's #Best today on https://t.co/VfZu3iZcPN ?\nHighlights: Doug Mcdermott 20 Pts 6 3pm 2 Reb : San Antonio Spurs Vs  Oklahoma City Thunder : 1.19\nhttps://t.co/YkZzaJltFr\n#sports",
    "166": "San Antonio Spurs Mitchell &amp; Ness Hardwood Classics XL Wordmark Snapback Hat - Pink |\nhttps://t.co/IqfT14grve\n\nIn Stock - This item will ship within 1 business day. | Your Price: $34.99\n\n#gospursgo #porvida #dejountemurray #NBAAlIStar",
    "167": "This is a 4 out 1 in set play from the San Antonio Spurs playbook https://t.co/nuZGyrmZO3"
}