{
    "0": "@Raptors @hudsonsbay Grateful for Scottie and Danny’s energy!! Love them both!’🔥❤️",
    "1": "@ogDamare @Raptors @Invisalign we beat them w/o og and fred last time lmao",
    "2": "@wensparks @Raptors They’ll be there and will be a problem for anyone they face…if healthy. OG is huge for them cause he can guard anyone plus make bigs guard him outside. Hoping the Raps can have a long run. Cheers Wendy",
    "3": "Danny Green wasn’t with us long, but he’s one of my fave #raptors. He loved &amp; respected our city/fans, still does to this day. He speaks of the team/Toronto with respect &amp; fondness - deserves this night &amp; a standing O. Congrats @DGreen_14 👏🏼\n\n#WeTheNorth @Raptors https://t.co/KKuzNhPLf8",
    "4": "@Raptors @pskills43 Congratulations to the entire Raptors team on securing a playoff berth. In 2019 I was a Maple Leafs fan from way back. I started watching the Raptors in the playoffs that year and I haven’t looked back. They are so fun to watch! I’m proud of what they accomplished! Go Raptors!!",
    "5": "@SacramentoKings @spurs @Raptors @utahjazz @WashWizards \nI’m 17, \nI’m from Sweden, \nI live in Sweden, \nI watch a lot of nba, \nI like basketball, \ndoes anyone got some kind of job???? \nPlease, I need it, I’m desperate.",
    "6": "🏀 GAME ANALYSIS 🏀\n\n🏟 Philadelphia 76ers vs Toronto Raptors  🏟\n\n▶️ BET THE NBA ▶️ https://t.co/odroCYfQFJ\n\n#NBA #GamblingTwitter \n\nhttps://t.co/R9mN9WxJzG",
    "7": "@wensparks @Raptors Raps are so fun to watch and the playoffs will be a great chance for further development. The season has been a success no matter what happens.",
    "8": "@Raptors Play Malachi",
    "9": "Let’s go Toronto Raptors!!! Got my @pskills43 jersey on! #NBAPlayoffs #PlayoffPreview #wethenorth #SiakhamBestCameroonBaller https://t.co/ooTzqthBL2",
    "10": "Watching the @Raptors in person for the 10th time @ScotiabankArena can’t wait for playoff basketball!! \n#WeTheNorth #NBAPlayoffs",
    "11": "@TheDream55_ @Raptors @Invisalign create turnovers",
    "12": "@KrystleRich THE TORONTO RAPTORS DON'T HAVE NOTHING ON OUR ULTIMATE 3, WHO'S BRINGING THEM \"3 THE HARD WAY\" 💯💯💯💪 BABY BAABY!! SAVE THIS FOR THE END OF YALL SEGMENT &amp; SHOW IT PLEASE?? https://t.co/RRa4LqROMO",
    "13": "@MaxeyBetta @Raptors @Invisalign we own Embfraud https://t.co/ZpOCdPj0y6",
    "14": "Great pre-game interview with @DGreen_14 \n\nFabulous questions from @SNMichaud and such thoughtful answers and overall class from Danny\n\nWelcome back to Toronto, and congrats on finally receiving your @Raptors Championship ring \n\n#WeTheNorth",
    "15": "@Raptors @Invisalign okay precious we move.",
    "16": "@wensparks @Raptors Love to see it. Knew this team would be fun to watch, and competitive. Pascal Siakam's performance will be a big deciding factor as will health. A healthy Raptors team is a three headed monster on offense as will as lockdown on defence. #WeTheNorth",
    "17": "@alekscygal @Raptors @sixers …but for Toronto to come away with the W. 😏",
    "18": "@Raptors @Invisalign I mean… I guess they answered my prayers and started achiuwa… but khem birch is still there😐",
    "19": "@Raptors @Invisalign That spacing is atrocious. Gary gotta do some half court offense carrying!!!!",
    "20": "@Raptors @Invisalign play armoni",
    "21": "@Raptors @Invisalign point scottie :)",
    "22": "@MaxeyBetta @Raptors @Invisalign Ratio",
    "23": "@wensparks @Raptors We’re consistently underestimated as a team and while that drives a lot of people crazy, I think it’s one of our greatest advantages. We love an underdog and take nothing for granted - and our team thrives on that footing.",
    "24": "Let's go!!!! Time to show another top team in the East that they best respect us! Trust me... You don't want to face the Raptors in the playoffs.  Championship DNA? Check.  Big game coming up!\n\n#WeTheNorth #nba #toronto #basketball #canada https://t.co/qKXCG1dPpl",
    "25": "Tonight’s @invisalign Starting Lineup https://t.co/5APGgcMtBN",
    "26": "NBA Basketball: Philadelphia 76ers vs Toronto Raptors | Live Play-By-Play &amp; Reactions https://t.co/Fcj0Q8bxqo",
    "27": "@Raptors @hudsonsbay Testing out the fit for when he wins his own. 🏆",
    "28": "Finally after 3 years @DGreen_14 is getting his ring tonight!! @Raptors",
    "29": "GAME DAY 🆙 NORTH. \n\n🕖7:30PM\n📺@NBCSPhilly \n📻@975TheFanatic\n🎙️https://t.co/HJxiVNHyOH                      \n🏀@Raptors \n\nPres. By @Ticketmaster https://t.co/HwZ1TSb4RD",
    "30": "@ScottFoxonair @MolsonCoors @Raptors Good choice!!",
    "31": "@MrsMorganSB @TangerineHoops @Raptors Munchies!!!",
    "32": "@Raptors Malachi masterclass incoming",
    "33": "@Raptors Let’s Gooo!🔥🔥🔥",
    "34": "Happy #NationalBeerDay \n\n@MolsonCoors @Raptors https://t.co/q1TyXSrHuh",
    "35": "@wensparks @Raptors We can go far as long as we have our core players. Praying for a healthy playoff for our players ❤️",
    "36": "@Raptors Hmmmm how about you post the line up????",
    "37": "we heating up nowww 🔥 https://t.co/H2uHigBKnU",
    "38": "We are live for 76ers vs Raptors! Get your favorite drink and snack and come chill Philadelphia 76ers vs Toronto Raptors | Live Play-By-Play &amp; Reactions https://t.co/INHRQHKwqS via @YouTube",
    "39": "@wensparks @Raptors I am so happy the boys have made it into the playoffs!! This team is so much fun to watch and have exceeded expectations. Their heart and determination will take them far. I am so proud of all our players.❤❤❤❤",
    "40": "Obsessed with everyone who is showing love to my ring necklace @Raptors https://t.co/YLoUEx5Vzq",
    "41": "Danny Green will finally receive his 2019 Toronto Raptors ring tonight\n\n2020 - Bubble\n2021 - Health safety protocols \n2022 - Ring https://t.co/MhgqOlSaZF",
    "42": "@wensparks @Raptors This was supposed to be a \"development year\" after the departure of Kyle but what he has left behind with Masai and Nick's involvement is a brand of basketball that oozes grit, grind and a dogged determination to WIN! This team has no ceiling when they're healthy and locked in.",
    "43": "@wensparks @Raptors I was a firm believer that we'd be back and that Tampa was a one-off. But I always have optimism for my boys 🙌🏾 the 5th seed is ours! 🦖",
    "44": "@Raptors Lmao completely forgot about this",
    "45": "A preview of Round 1 of the playoffs? 🤔\n\n76ers are in Toronto tonight to take on the Raptors. Who gets the W in this one? https://t.co/zfu1PNJ1Dc",
    "46": "@Raptors @CleClinicCanada Oh my fucking days. Post the LINE UP",
    "47": "how do i get me a giant freddy head cut out PLS @Raptors",
    "48": "@wensparks @Raptors Never say never with this team! They embrace adversity and their resilience is umatched! You can absolutely tell they really and truly like each other and that is huge! Been saying this for years \"Building Superstars from within!\" Let's gooooo! #WeTheNorth",
    "49": "Well, we decided to get another pair of nosebleed tickets. After all, we drove 3000km from Saskatchewan to see our first @Raptors/@NBA game so why not go to another. #WeTheNorth https://t.co/5AbXjLMxFU",
    "50": "@Raptors @hudsonsbay Yeah!!",
    "51": "My Raptors playoff prediction: \nRaptors will lose first round game 1 then go on to win 16 games straight! #nba #nbaplayoffs #nbafinals #nbabasketball #nbaallstar #torontoraptors #raptors #raptorsnation #raptorsbasketball #toronto #pascalsiakam #fredvanvleet #canada #scottiebarnes https://t.co/E5289Uarrm",
    "52": "MISSED U @Raptors https://t.co/OYfXYlkp8c",
    "53": "@TangerineHoops @Raptors All time favorite POUTINE",
    "54": "@Raptors OG WYA IM WAITING FOR U https://t.co/WL7E6D9KVp",
    "55": "@Raptors @hudsonsbay This kid just fucking gets it!!",
    "56": "Malachi Flynn erasure again huh? @raptors https://t.co/gvQg7IeR5e https://t.co/qwWLzc5ltV",
    "57": "From Newfoundland Canada #WeTheNorth @Raptors https://t.co/MNzbkoDPRp",
    "58": "Let's goo @Raptors  #WeTheNorth https://t.co/lp0Md00SQQ",
    "59": "Interesting business, @Raptors collect money for the play-in games (I conservatively calculate at $8MM/game), no play-in games needed, so they will reimburse you within 30 days. Free float of $16MM for 30 days!",
    "60": "I just eurostepped this whole entire family pick me up @Raptors",
    "61": "@LeafsRapsBills @Raptors Shouts to Raps Legend @mrjloyd !!\n\nHope you're good man",
    "62": "Toronto Raptors Starters:\n\nScottie Barnes\nGary Trent\nPascal Siakam\nKhem Birch\nPrecious Achiuwa\n\nPlayers out:\nOG Anunoby\nFred VanVleet\nYuta Watanabe\n#WeTheNorth #NBA #NBATwitter #NBA75",
    "63": "@nikkiola99 @Raptors And thank you!! I am on the other side of things now thankfully!!",
    "64": "@nikkiola99 @Raptors Where is that??",
    "65": "@gosportsgo6 @Raptors @hudsonsbay I thought this was Reggie Evans for a second lol",
    "66": "@DGreen_14 Your ring presentation will close the book on the @Raptors amazing run to the 2019 championship. \nThank you for being part of that.",
    "67": "BIG @Bucks and @Raptors fan tonight…. (That’s so gross to say) 🤢🤮",
    "68": "Tonight's starting lineup for the Toronto Raptors: Barnes, Trent Jr., Siakam, Birch, Achiuwa\nhttps://t.co/bVWH4AMCA2",
    "69": "Danny Green getting the ring tonight. Have to admit I’m glad he extended the @Raptors championship celebration.",
    "70": "@Raptors @hudsonsbay He’ll be there one day 👍🏻",
    "71": "Toronto Raptors Starting Lineup 4/7\n PG: Scottie Barnes\n SG: Gary Trent Jr.\n SF: Pascal Siakam\n PF: Khem Birch\n C: Precious Achiuwa\nhttps://t.co/o75oZ8vnE8",
    "72": "@Raptors Congrats Danny!! We miss you and thanks for helping to win us the chip!!🙏🏻❤️",
    "73": "@Raptors @CleClinicCanada Post the Goddamn line up",
    "74": "@YABarnes4ROTY @Raptors The way OG saunters off the court",
    "75": "Here to support the best @raptors #WeTheNorth https://t.co/Bn6y9OOZS5",
    "76": "@wensparks @Raptors Team is coming together nicely and ahead of schedule. I’m expecting a hard fought first round matchup, no matter who we’re playing.",
    "77": "Indian Cowboy NBA\n\n4 unit - Philadelphia -1.5 over Toronto Raptors\n\nSince March 10, IC's NBA is 8-16 -$4,640.\n\nOn the NBA season, he is 91-76 +2,240",
    "78": "@wensparks @Raptors I’m all for it.",
    "79": "@Raptors I love this!",
    "80": "@wensparks @Raptors Stoked to see Scottie get some play off experience, thinking we could upset someone in the 1st round",
    "81": "@wensparks @Raptors I think it shows how good our players, coaching staff, and management team is. We have high character, hard working players. How good they are is no surprise to those of us who watch every game. We are still fairly young and very hungry. #WeTheNorth",
    "82": "Game thread: Toronto Raptors vs. Philadelphia 76ers https://t.co/t2BKVTePVT",
    "83": "Okay huge games for @MapleLeafs and @Raptors tonight 🔥🔥🔥 Then Bluejays start tomorrow 👏 it's going to be a good spring/summer 😍",
    "84": "@wensparks @Raptors Wendy ..I’ve been a Raptors fan since day 1 , was at first game at SkyDome..I’ve seen a lot of players come and go, cried over a few ..but this team, has got something special ..it makes me so happy ..I truly believe they have what it takes and hope they take it game by game 🙌🏻🏀",
    "85": "Today, @strizzzy and @Iamjemeni from our sister station in Toronto sat down with Kyana Kingbird to talk about her legendary performance at the Toronto Raptors halftime show! If you missed it we've got you - https://t.co/As0UAq6Mjb\n\n#Indigenous #TorontoRaptors #Representation https://t.co/UqcL02Axi3",
    "86": "Uniforms for Philadelphia 76ers vs Toronto Raptors at 4:30 PM. \n\n#Sixers #WeTheNorth https://t.co/0gBLP9GQOu",
    "87": "This morning, @strizzzy and @Iamjemeni sat down with Kyana Kingbird to talk about her legendary performance at the @Raptors halftime show! If you missed it, we've got you - https://t.co/9YRkokFGzh\n\n#Indigenous #TorontoRaptors #Representation https://t.co/FuRneL3jO4",
    "88": "This picture makes me so happy. Love love love that Danny Green gave it to him. 📸@Raptors https://t.co/Y1gtkNWAQg",
    "89": "@wensparks @Raptors We making the finals",
    "90": "@wensparks @Raptors Last year was all about Covid 19 and injures, this season we’ve seen the Raptors ARE STILL a top 10 team in the NBA. \n\nOG could be the best wing defender in the East",
    "91": "@Sportsnet @FAN590 @Raptors @DGreen_14 @michaelgrange Just as important? This would be great time for the edit button",
    "92": "The Philadelphia @sixers are north of the border to take on the Toronto Raptors tonight at 7:30pm on News Talk 830 WEEU! https://t.co/nZ8Ay78c2M",
    "93": "@Raptors @pskills43 And SCROTY Barnes too.",
    "94": "@wensparks @Raptors I really started watching since the Tampa season, so improving from what/where we were to this now is mind blowing. Our vets/youngsters really played the best they can. Just grateful for this team, grateful for having these players 🙏🙏❤️",
    "95": "Well hello @pskills43 @gtrentjr @JHarden13 \nFinally back @Raptors \n#WeTheNorth https://t.co/WI6ZEPnDvj",
    "96": "@wensparks @Raptors Thanks Wendy! I think if we’re healthy we are able to beat any team in the East in a 7-game series",
    "97": "@wensparks @Raptors So much heart with this team. Battling injuries and adjusting to some new players, they have exceeded expectation. KEEP ROLLING FELLAS!",
    "98": "@HiKifakCava @wensparks @Raptors with just Marcus smart from the starters it was a tough game. was OG in then ? may not be that easy round 1",
    "99": "@wensparks @Raptors Not surprised. The team has that winning \"play hard\" culture.",
    "100": "Local teen Kyra Daniels sings both national anthems at Toronto Raptors game. https://t.co/IE3WU0cT8p #ICYMI #YGK @Raptors",
    "101": "Careful what you wish for @Raptors fans. Seeking out the best team in the nba for almost 3 months is not a wise decision.",
    "102": "@wensparks @Raptors I'm stoked!!! WE ARE THE BEST! WEARETHENORTH 🏀🏀🏀🗑🔥🔥🔥🔥🔥\nWe will win!!!! 🏆💪🏾🙌🏾🙏🏾💙❤",
    "103": "2 more #NBAplayoff bound teams are going to grind it out as the #NBA season winds down. The @sixers take on the @Raptors in what could be a late-round playoff matchup.\n\nWhether you want pre game or #livebetting action, we've got it all! Check out https://t.co/QpAus7m4O5 now! https://t.co/2TPNden5Vh",
    "104": "Toronto's @the_raptor took a trip 40-ft into the air to visit Leader in History @chrisoverholt this afternoon!\n\nYou can support Chris and JDRF's mission to raise $15M in support of T1D research at https://t.co/Bjs0ZySDDM https://t.co/QExVTGx4OZ",
    "105": "@wensparks @Raptors I am stoked!   They deserve to be there. Grit, Team Play, connections etc.... love watching them.",
    "106": "Made it from Nova Scotia to see the @Raptors #WeTheNorth https://t.co/stVnkRNpYO",
    "107": "@wensparks @Raptors So excited playing with free money! But we going all the way 🙌🏻🤟🏻",
    "108": "@Raptors @hudsonsbay Manifesting",
    "109": "@Raptors @hudsonsbay This dramatically increases our chances! Scottie starting his collection! ✨",
    "110": "Godfather Locks\n\n*** massive 10k unit pick ***\n\n#1- los angeles angels -120\n\n*** huge 5k unit picks ***\n\n#1 - new york mets -120\n\n#2 - toronto raptors +2\n\n#3 - milwaukee bucks -8.5",
    "111": "@Sportsnet @Raptors @DGreen_14 @michaelgrange Why is he just now getting it? That seems like a very long time",
    "112": "@wensparks @Raptors Never a doubt, last year wasn’t even that bad just couldn’t get it done at times.",
    "113": "Our view for tonight’s #Toronto @Raptors vs @#Philadelphia @sixers game. #WeTheNorth https://t.co/NJTqbmzOpC",
    "114": "@wensparks @Raptors i’m just glad they proved everyone wrong. they didn’t only silence their haters, but they did it through all the ups and downs. several injuries, run ins with covid, as well as the general hate on the media? i’ve always loved the raptors for their resilience",
    "115": "@wensparks @Raptors Really excited to see what this team can do!  I like the way they approach all of their opponents and the coaching staff will have them prepared!  Big fan of Khem and I love what you do!",
    "116": "Great prizes from @CleClinicCanada are up for grabs in Game Time.\n\nPlay while you countdown to tip-off for the chance to WIN!\n\n📲: https://t.co/QwAD1fF392 https://t.co/n9wzkoIdPP",
    "117": "#76ers player #DannyGreen will receive his 2019 championship ring on the road against the #Raptors today. He followed the Raptors to a championship in 2018-19, he didn't choose to receive the ring last season because he wanted to complete the ceremony in front of Toronto fans. https://t.co/w2nZDzkKzO",
    "118": "MVP candidate Joel Embiid and the @sixers (4th in East) are up for a battle vs. the @Raptors (5th in East). \n\nCould we see this matchup in the 1st round? Don’t miss it on @buzzer with NBA League Pass tonight 🍿 https://t.co/ZK6g1zFz6h",
    "119": "@Sportsnet @Raptors @DGreen_14 @michaelgrange He loved his time as a raptor and he was a fan favourite from the start. Glad he gets his tonight",
    "120": "@Raptors Winner nights",
    "121": "@Raptors @hudsonsbay He got the jacket! Niceee 🔥🔥🔥🔥 https://t.co/0H3Rgubj7Y",
    "122": "@wensparks @Raptors They’re winning the chip this year",
    "123": "@siakamandlowry1 @Raptors Get well sorry you are going through this. I just saw your post. I would love to go you should come to the raptors group u could have a chance to sell your tickets.",
    "124": "@wensparks @Raptors The team is mostly healthy and really playing excellent defence. Excited to see the team experience the raucous playoff atmosphere Scotiabank Arena and win a round or two!",
    "125": "@wensparks @Raptors I LOVE how this team has exceeded others' expectations of us.  They are so fun to watch.  Keep fighting and proving everyone wrong!",
    "126": "@wensparks @Raptors It’s what they do. So many people think Tampa Raptors. That shit wasn’t us. This. This is us. And win or lose, God help whomever has to face us.",
    "127": "Philadelphia 76ers vs Toronto Raptors | Live Play-By-Play &amp; Reactions https://t.co/23B3pMk26C via @YouTube",
    "128": "I'm at @ScotiabankArena for @Raptors @Sixers in Toronto, Ontario https://t.co/aElZVGr0iP https://t.co/ETEPrvvPBy",
    "129": "@ScottiesBetter @Raptors Welcome! Whatever you feel to follow your choice if you want u can follow me. 🙂",
    "130": "@wensparks @Raptors Super excited. Started off the season to just enjoy and not expect anything \nAs a fan since day one, I’m used to the ups and many downs. \nThey’ve exceeded expectations. Watch out!",
    "131": "@DGreen_14 @Raptors fans appreciate you Danny #WeTheNorth https://t.co/hC8MvVknMa",
    "132": "@wensparks @Raptors Phenomenal, really truly phenomenal!  With ups, downs injuries and we manage to pull through",
    "133": "@wensparks @Raptors It’s so awesome that the Raptors have proved they are in a position to make a run for another Championship as much as any other team when so many people did not have faith in them. I don’t think there are any teams looking forward to playing the Raptors now!!🏀🏀🏀🏀",
    "134": "Can’t help being sad that this awesome kid can’t go to his Ont Cup championship b/c he contracted COVID this week. He’s kept safe for over 2 years. Done his part. So sure he’d be playing had the mask mandate been kept.@WildhawkBBall #TheTealisReal @LeoRautins @Raptors https://t.co/XLF6L5unpR",
    "135": "@RdotChung @NBA @Raptors @ScottBarnes561 Yass correct now, that’s about right 👍🏾! Thanks for the fix 😜😀❤️🖤 🤍 WeTheNorth Raptors",
    "136": "@Sportsnet @Raptors @DGreen_14 @michaelgrange The words “just as” are doing a lot of heavy lifting here…",
    "137": "@TangerineHoops @Raptors Chips - specifically party mix!",
    "138": "@wensparks @Raptors I'm pumped! Can't wait to see the guys ball out in the playoffs... no team wants this smoke 😤",
    "139": "The Toronto Raptors could change their name to the Toronto Rappers no problem and they should.",
    "140": "I don’t often share pictures of my cooking, but when I do, it’s likely game day for the @Raptors \n\nBroccoli-Cheddar-Chicken-Bacon dish \n\nI hear OG and Freddy are out tonight; doesn’t mean we can’t go for the win\n\n#WeTheNorth https://t.co/YdgVXWMJG0",
    "141": "Caught up with @DGreen_14 pre-game and he told me Kyle Lowry called him to discuss the big night and show love. Championship vibes are forever.\n\nCatch our convo when @Sportsnet coverage starts at 7:00pm.\n\n@Raptors | #WeTheNorth https://t.co/70fChT5yry",
    "142": "@wensparks @Raptors All I can say is being a Raps fan is as close as you can get to fan nirvana. No matter what happens to this team, we always find a way. We about to make some noise this playoffs. And no matter what happens, we are playing with House money. Our future is absolute 🔥 https://t.co/2014TxtXup",
    "143": "@wensparks @Raptors And I think what makes us most dangerous come playoff time is that we have nothing to lose.\n\nThere are a lot of teams with a lot of pressure on them to win now or a lot to prove but we are playing with house money at this point. Every game is a win because it helps us get better.",
    "144": "Toronto got the best of Philadelphia in their last matchup, and we like Canada's team to win again on Thursday night. The Sixers will be without lockdown wing Matisse Thybulle, and that will prove costly. Find out more in our 76ers vs. Raptors picks.\n\nhttps://t.co/9xmjbgKi4C",
    "145": "@Marrirez @OmDip8 @Raptors @hudsonsbay I think OG gave it to @ScottBarnes561 and then sort of asked @DGreen_14 - in true OG style",
    "146": "🚨DON'T MISS BEST #NBA BET\n\n🏀Raptors vs 76ers\n1⃣ Under is 5-1 in the last 6 meetings in Toronto.\n2⃣ Raptors are 4-1 ATS in last 5 Thursday games.\n3⃣ 76ers are 1-5 ATS in last 6 games overall.\n\nRead our analysis⬇️\nhttps://t.co/N5XPXripO9\n\n#bettingtips #gamblingtwitter #freepicks",
    "147": "@fready_steady @Heat4life01 @Raptors @Bucks I think seeding wise we want the versus the 76ers they basically our team but with 2 free throw merchants",
    "148": "@HR_6IX @Raptors @hudsonsbay In 3 months",
    "149": "@Raptors When embiid was crying after the series lost",
    "150": "@Raptors @hudsonsbay Get it broke in before @DGreen_14 gets to town. @nba @Raptors",
    "151": "@wensparks @Raptors I couldn't be more excited.\n\nWe have a really special group right now and they seem to all be on the right page at the right time.\n\nSo many players willing to do the dirty work and hustle and grind it out for each other.\n\nI am really proud of this team and the way they play ball.",
    "152": "@fready_steady @Raptors @Bucks No we need both to win",
    "153": "@Heat4life01 @Raptors @Bucks Raptors W and bucks L plz",
    "154": "@Raptors @Bucks please",
    "155": "@Raptors @hudsonsbay Our boy looking fresh",
    "156": "@wensparks @Raptors Been a fan for years and this one feels great because no matter what happens going forward, the team has proved so many “experts” wrong!",
    "157": "@TangerineHoops @Raptors Keep it 🇨🇦 with chips from @nealbrothers",
    "158": "Big game tonight for the #76ers taking on the #Raptors \n\nOdds @BetRivers \n\n76ers (-3) / PHI ML (-148)\nTotal: 220\n\n#Sixers will be without Thybulle \n\nToronto has won 12 of their last 15 and find themselves in 5th in the East, Sixers are 4th. \n\nI am siding with the MVP, PHI ML",
    "159": "@wensparks @Raptors It’s the Raptors DNA that’s been established over the past 3/4 years. “Next man up”. The culture of having anyone step up and deliver gives everyone the opportunity to play a huge role.",
    "160": "@wensparks @Raptors Raptors will drop game 1 of opening round and then proceed to win 16 straight games. 😀",
    "161": "@Ponder07721658 @enra6ed @Raptors @hudsonsbay W mans",
    "162": "@TangerineHoops @Raptors Chips!! https://t.co/qculOkOi5I",
    "163": "@Mikey50002 @sixers @dmorey @NBCSPhilly @975TheFanatic @Raptors @Ticketmaster Toronto is resting some starters  for the playoffs.",
    "164": "@wensparks @Raptors I think they CAN make it in the conference finals but will definitely make it to the second round and give a good fight",
    "165": "@wensparks @Raptors I'm happy. It's house money at this point and I'm glad we're back to our winning ways",
    "166": "@wensparks @Raptors I'm for it",
    "167": "@Raptors @hudsonsbay same kicks",
    "168": "@OmDip8 @Raptors @hudsonsbay Tbf its not like Scottie flexing on Lowry on his return. https://t.co/lWxDNHTO7P",
    "169": "@wensparks @Raptors Our guys rock !! They are always the under dog, then kick butt !! 🔥💪🙏🇨🇦",
    "170": "@wensparks @Raptors Hyped, optimistic and above all PROUD 🥲♥️",
    "171": "@wensparks @Raptors Status quo.... Tampa doesn't count! 😊",
    "172": "🏀 SIXERS VS RAPTORS!\n\nMassive Eastern Conference battle in Toronto as the @Raptors host the @Sixers tonight! \n\nWill the 🦖’s sink the Sixers?  \n\n#MakeAPlay ➡️ https://t.co/qUPBOzx6EM #WeTheNorth \n#Sixers https://t.co/moL3WGQU8m",
    "173": "The Toronto Raptors are facing off against the Philadelphia 76ers tonight at 7:30PM\n\nWho do you think will win? https://t.co/ByoFy2t7ID",
    "174": "@dannygreen_7 will finally get his bling! @michaelgrange explains why he was so crucial to the @Raptors success in the another can’t miss Words by Grange! https://t.co/zc6oSxpvrh",
    "175": "Someone can’t make the @Raptors game so @ErrolMott and I get to go. The things we do for friends!! 😁😁 #WeTheNorth Let’s go Raps!!!! 🙌🏽🙌🏽",
    "176": "@wensparks @Raptors So happy for them. At the beginning of the season, no one expected much as this is a \"rebuilding\" year. Can you imagine what they will accomplish when they have *rebuilt*?",
    "177": "@wensparks @Raptors Right where we belong!",
    "178": "@Sportsnet @Raptors @DGreen_14 @michaelgrange No he wasn’t.",
    "179": "@Sportsnet @Raptors @DGreen_14 @michaelgrange You’re kidding!  Danny Green was horrid in the finals.  He almost threw away game 6 with his bone headed turnover.  He was a horrid 3 point shooter too.",
    "180": "@gosportsgo6 @Raptors @hudsonsbay bro this is wild haha I love it",
    "181": "Toronto Raptors starters Fred VanVleet and OG Anunoby are out for this matchup with the Philadelphia 76ers.  https://t.co/PXTJOgZjOF",
    "182": "@wensparks @Raptors that being said, I am still going to lose my Sh!t when we lose any game.",
    "183": "@wensparks @Raptors Tampa was an outlier, Making the playoffs for the raptors is business as usual.\n\nOnly difference this time is no one has championship expectations,  we know we are developing for the next and after season.\n\nSo anything from now on is just gravy.",
    "184": "@wensparks @Raptors Super happy that they qualified for the playoffs and not just the play-in. It’s been an amazing season. Anything they do in the playoffs is a bonus. Excited to watch 😊",
    "185": "@wensparks @Raptors Loving this season and hoping for the best ! #WeTheNorth 🏀🏀🏀",
    "186": "April 7th: Full card is posted\nhttps://t.co/F1tJRXzLzO\n\nFREE PLAY OF THE DAY:\nNBA: Toronto Raptors +3 (7:40PM) EST",
    "187": "@wensparks @Raptors Too much skill, pride and championship DNA to NOT make post-season.",
    "188": "@wensparks @Raptors So excited for play off basketball games and vibes downtown again!",
    "189": "@wensparks @Raptors Back to where belong! Can’t wait to have Jurassic Park in full swing! You will love it!",
    "190": "@wensparks @Raptors I think we can beat the Celtics or the sixers in the 1st round, especially with the unavailability of the unvaxxed players. Probably a 2nd round exit, but this year is for development, the playoff experience is gonna gel this group even more, and next year will be contenders",
    "191": "@wensparks @Raptors Super excited they are back where they belong, I am hoping for a strong showing as I know this year is just the start!!",
    "192": "@RunItBackPhilly @Raptors Win. Claim.",
    "193": "Godfather locks\nReport Post\nMlb &amp; nba\nmassive 10k unit pick\n3 huge 5k unit picks\n\n*** massive 10k unit pick ***\n(3-1 last four 10k unit picks)\n\nlos angeles angels -120\n\n*** huge 5k unit picks ***\n\nnew york mets -120\n\ntoronto raptors +2\n\nmilwaukee bucks -8.5",
    "194": "From the 🎧 Podcast Player\n\nLOCKED ON RAPTORS\nWhy might the Sixers, Bucks and Celtics fear the Toronto Raptors in a first round series?\n\n🎙️ Sean Woodley\n⏲️ 37:16\n\n#Raptors #NBA\nhttps://t.co/05CxOduusa",
    "195": "@wensparks @Raptors Wendy, you know the vibes https://t.co/LbFiECdtBw",
    "196": "@BlakeMurphyODC Seems like an odd night to rest Fred. Could've been an opportunity to treat this as a potential first round preview.\nA win here would also make the 4-5 Sixers-Raptors matchup more likely. Not a bad thing with a key roleplayer like Thybulle ineligible to play in Toronto.",
    "197": "@Raptors @hudsonsbay one of the flyest in the league",
    "198": "@KyleNeubeck I think we lose in 6 to toronto without matisse away and in 5 to Nets...he has put this team in a very very ugly situation where NOW they may have to play harden Embiid starters to win out to avoid raptors..cannot tell u how angry i am at this team doesnt matter selfish dude",
    "199": "Hey Raps fam, I’m so interested in hearing your thoughts about the @Raptors making the playoffs. Drop a comment below. 🦖🔥🏀",
    "200": "@Raptors Imagine this lol what timing. Turns around to his team to show Embid the ring he lost out on because of Kawhi. Raps trolling Philly bad with this one 😂",
    "201": "@Sportsnet @Raptors @DGreen_14 @michaelgrange Just as important? I dunno bout all that",
    "202": "1-1 in MLB today, let’s go #NBA\n\n76ers ML (-145) DK\n\nPhilly won two straight in Toronto and are 8-2 on the ML away from home with James Harden.\n\nI’d say Raptors are safely the No. 5 seed with Rockets and Knicks next.\nThis game means more for 76ers and Embiid (MVP, scoring title). https://t.co/EUH0PJN86O",
    "203": "🚨 Line Change 🚨\n\nPhiladelphia 76ers @ Toronto Raptors\nThu 7:40 PM EST\n\nFrom:\nTOR 2.0 -110\n\nTo:\nTOR 3.0 -110",
    "204": "#AllStarSportsNight \n\nTONIGHT: \n@Raptors @ 7:30pm \n@MapleLeafs @ 8:30pm",
    "205": "@Sportsnet @Raptors @DGreen_14 @michaelgrange He can wait longer!",
    "206": "@Raptors @hudsonsbay Scottie puttin up 30 tonight",
    "207": "Consensus Line Move:\n2022-04-07 Philadelphia 76ers at Toronto Raptors from 2.00 to 3.00\n#Sixers feeling frisky\n#NBA #sport #datascience #businessowner",
    "208": "@21flat @Raptors 4th quarter ppg",
    "209": "@Raptors @hudsonsbay 4 @ScottBarnes561 ode to #NBAChampion @DGreen_14  @Raptors @nba championship #WeTheNorth ring ceremony https://t.co/RUdEW80MCI",
    "210": "@Raptors  the debate is over, the award belongs to @ScottBarnes561 https://t.co/BCRaoUmwYk",
    "211": "@TangerineHoops @Raptors Popcorn!",
    "212": "@Raptors @hudsonsbay Let's go!!! Scottie's first of many future jackets. 😁😁 Danny's a legend!",
    "213": "@BlakeMurphyODC Thybulle played in the Dec 28th game against the Raptors in Toronto. If he wasn’t vaccinated, how would he have been able to play then but now?",
    "214": "#Toronto #Raptors: HOMAGE. ... \n \nhttps://t.co/xF4pDOh2YQ\n \n#Basketball #NationalBasketballAssociation #NBA #NBAEasternConference #NBAEasternConferenceAtlanticDivision #Ontario #TorontoRaptors https://t.co/tDHa1SvCkO",
    "215": "@TangerineHoops @Raptors Popcorn 🍿",
    "216": "@TangerineHoops @Raptors Beer",
    "217": "Raptors (+2) vs. 76ers Tonight 🏀\n\nBoth of these teams are 3-1 in their last 4 games coming into tonight's game which is crucial for playoff seeding \n\nWho wins tonight in Toronto ⁉️ #NBA75 #WeTheNorth #76ers \n\nFind All NBA Odds Here ⬇️\nhttps://t.co/LMjKLA7b2J https://t.co/J251HRBxz4",
    "218": "@Raptors 4.2 seconds on the shotclock, Gasol inbounds the ball to Kawhi with Ben Simmons in pursuit and Embiid joining in to close out. Kawhi heads to the corner, fades and shoots. Time seems to stops as the ball bounces 4 improbable times before going in. Mayhem ensues. Best moment ever.",
    "219": "@Sportsnet Toronto Blue Jays. Knock out CWS in ALCS in 7 games before topping the Dodgers in 6 for the World Series. Do we really have to wait til October for Toronto to shut up any naysayers like the Raptors did?",
    "220": "@Raptors @hudsonsbay A gift or a loan (for the photo) from @DGreen_14 ?",
    "221": "@wensparks @Raptors Thank you!",
    "222": "@MikeMiss25 hey Mike for 2 yrs the exact same rules apply for any Canadian trying to get into the USA!!  You people don’t understand!!  The US government has the same rules.  Any Toronto Raptors not vaccinated can not get into the USA to play games",
    "223": "Two of the hotter teams in the Eastern Conference clash tonight when the Philadelphia 76ers visit the Toronto Raptors 🤩 \n\n#NBA #HereTheyCome #WeTheNorth\nhttps://t.co/I4L5DmptLD",
    "224": "@quinn_donaldson @Raptors Still questioning where all that hair came from lmaoo",
    "225": "@Raptors @hudsonsbay The whole fit hard",
    "226": "Tonight at 7:30PM Eastern. Brandon &amp; the gents break down @sixers/@Raptors as it happens.\n\nGet their thoughts and tell us your own at https://t.co/omgriHjr9T!\n#streampunksports #76ers #Raptors https://t.co/4EBCogYHtS",
    "227": "@Raptors @pskills43 Win today",
    "228": "@OwnedByToronto @Raptors @hudsonsbay He’s dropping 30",
    "229": "Taking my 11 yr old son to the @Raptors game tonight. He doesn't know it yet. Thinks we're going downtown to meet up with one of my friends who happens to be a Pascal fan so I made him wear his Jersey. Lol Looking forward to the moment he realizes where we're going.",
    "230": "@Raptors @hudsonsbay Cutie",
    "231": "@steven_lebron @william_lou you brought up all the good points after he left man stand up for our guy!!! @ScottBarnes561 @Raptors",
    "232": "@Raptors @hudsonsbay BARNES!!!!",
    "233": "@Raptors @hudsonsbay Nah. Rook is a hypebeast",
    "234": "@theshift_sports @welcomeOVO @Raptors This is awesome!! Obviously foreshadowing what's to come!",
    "235": "@CedricHexter @Raptors What's this supposed to be ?",
    "236": "@Raptors @hudsonsbay Kyle to Scottie: this club is yours if you want it\nScottie to Danny: I'm taking your jacket",
    "237": "ALERT: New high roller bet posted!\nA bet has been placed for $8,811.51 on Toronto Raptors - Philadelphia 76ers to win $14,619.10.\nTo view this bet or copy it https://t.co/BvpTsKopnN https://t.co/8KB3B0pXj7",
    "238": "RT: Raptors: Rook payin homage ✨ https://t.co/3OQUUUVuqf @raptors @olgproline @NBACanada",
    "239": "'How will Matisse Thybulle's absence impact the Philadelphia 76ers in Thursday's game vs the Toronto Raptors?' by Locked On 76ers - Daily Podcast On The Philadelphia Sixers https://t.co/oLhulmJRdC #NBA",
    "240": "@Raptors @hudsonsbay This is amazing 🤩",
    "241": "@Raptors @hudsonsbay Man im feending for that jacket",
    "242": "@TangerineHoops @Raptors 🍿 popcorn",
    "243": "@NateFell @Mitchell_NBA @Raptors and @BrooklynNets give us trouble in the regular season. I'd love for someone else to knock them out.",
    "244": "In today's news and sports update, @joelazzano99 covered Ontario's expanded fourth COVID-19 booster eligibility and the new hours for the St. Marys Service Ontario, plus tonight's Toronto Raptors game. Listen to more news and sports tomorrow on St. Marys Radio. https://t.co/Sr2VCujNPU",
    "245": "TODAY’S #NBA #MarketMover from @Nicole_luvsabet is the Philadelphia 76ers H2H v Toronto Raptors #RadioTAB📻",
    "246": "Shout-out the boys 🤩 let’s go @Raptors‼️ make sure to stop by our store to cop all your game day gear or shop now here 🔑: https://t.co/qgNNEOWiYj \n\n@ScottBarnes561 x @FredVanVleet 🔥🔥 #RSAGameDay #WeTheNorth https://t.co/pOu2PlkNGm",
    "247": "@theshift_sports @caseybannerman @welcomeOVO @Raptors Danny's jacket!",
    "248": "🚨RAPTORS &amp; LEAFS BEST BETS🚨\n\nAN ALL TORONTO TEAM DAY BABY🙌 lets win some money heading into the weekend baby💰💰 (drink responsibly) @HowlerHead #WeTheNorth #LeafsForever #YBBETS https://t.co/pM3VBFwGI7",
    "249": "@TangerineHoops @Raptors $15 Poutine from Scotiabank Arena",
    "250": "@Marrirez @Raptors @hudsonsbay Yea Ik, I wanna gonna use a different gif but when I saw that Danny and Scottie gif yk I just had to",
    "251": "@OmDip8 @Raptors @hudsonsbay You really used Scottie gif of him blowing by Danny Green on his ring night...\n\nDanny Green gave him his Championship jacket.",
    "252": "@Raptors @hudsonsbay Great act by Danny for giving his championship jacket to Scottie. Foreshadowing of a chip in the near future? 😉🤞",
    "253": "@Raptors @hudsonsbay What happend to the username?",
    "254": "Philly takes on the toughest opponent of their remaining schedule tonight in the Toronto Raptors.\n\n#HereTheyCome | @LeoSilverman \n\nhttps://t.co/Ek5fUKI0AS",
    "255": "@Raptors @hudsonsbay Y’all gotta get him his own jacket mannnn",
    "256": "@TangerineHoops @Raptors Chips",
    "257": "@AMacleine @WestSS_101 @WorldWideWob @celtics You misspelled “2019 NBA Champion Toronto Raptors”",
    "258": "Ahal FC - Shabab Al-Ahli Dubai FC\nAtletico Morelia SA CV - Venados  FC\nToronto Raptors - Philadelphia 76ers\nGolden State Warriors - Los Angeles Lakers\n\nBet slip link: https://t.co/EOYxRYPTPm https://t.co/rWnCPd8SSV",
    "259": "It’s GAME DAY FOR @raptors As They Play The Philadelphia 76ers https://t.co/aY6JNTw4xC",
    "260": "@Raptors @hudsonsbay THIS HARD",
    "261": "@Raptors @hudsonsbay Danny a Real one @DGreen_14",
    "262": "@Raptors Danny blowing the dust on the ring after 3 years https://t.co/EYMo8GFQ18",
    "263": "@Raptors @hudsonsbay Nah scottie raptor for life",
    "264": "@Raptors @hudsonsbay he’s perfect",
    "265": "@scarytrentjr @Clapz23 @Raptors @pskills43 I am really really sorry for that",
    "266": "@Raptors I love how @Raptors shout out some people for disbelieving. Those people better delete their accounts!",
    "267": "@Raptors @hudsonsbay 😭😭😭 it even had D. Green highlighted",
    "268": "@theshift_sports @welcomeOVO @Raptors Danny gave him the jacket.",
    "269": "@Raptors @hudsonsbay Scottie dropping a 50 piece, confirmed 😤 https://t.co/UexD18Xfy0",
    "270": "@jebronsburner @ChewLook @Raptors @hudsonsbay That explains the gold name 👌",
    "271": "@Raptors @hudsonsbay Why am I picturing a jersey swap with the jacket tonight lol. https://t.co/ShSptuIgx4",
    "272": "@Raptors When we beat James Harden and Joel Embiid. Two players Nick Nurse has a history of tormenting with his lineups.",
    "273": "Just dropped a new video: Who do you think would win a Raptors Sixers series? #raptors #torontoraptors #raptorsnation #sixers! Check it out! \nhttps://t.co/qXZ39eaPUw https://t.co/UB1ehWS6h7",
    "274": "@AMacleine @WorldWideWob philly loses in 5 or 6 against the raptors if their best defender cant even play in half the games, same goes with the celtics as jb and horford cant play in toronto either, and the raptors swept the bucks in the season series, although they would be my main concern for the raps",
    "275": "@Raptors @hudsonsbay manifesting!",
    "276": "Scottie pulling up in the Raptors x @welcomeOVO 2019 championship jacket on the same night as Danny Green’s ring ceremony 😭 he’s THE PERFECT RAPTOR.\n\n📸: @Raptors https://t.co/EpFNtYjWxb",
    "277": "@Raptors @hudsonsbay Hard",
    "278": "@Raptors @hudsonsbay Damn. Danny’s gonna want that back. One of one",
    "279": "@0TyreseMaxey @Raptors @TyreseMaxey W tweet https://t.co/OsUFgLUHF7",
    "280": "@dslv93 @Raptors @hudsonsbay It's for the champs only, Danny gave his to Scottie",
    "281": "@Raptors @hudsonsbay His best fit yet",
    "282": "@NotBlizzzo @Raptors @hudsonsbay -warriors fan",
    "283": "@TheHoopCentral @Raptors to salty fans https://t.co/IjN5UMy6Zu",
    "284": "Check out how @JohnRyanSports1 says to #bet the #nba game #today pitting the #torontoraptors vs. #76ers in #toronto. https://t.co/3qYTL5nVnH https://t.co/Hnz67ZntkB",
    "285": "@Raptors @hudsonsbay He’s gonna have his own jacket 🔜",
    "286": "@Raptors @hudsonsbay Scottie masterclass incoming",
    "287": "@Raptors @hudsonsbay He’s gonna have about 5 of those championship jackets",
    "288": "@Raptors @hudsonsbay Danny Green’s jacket?",
    "289": "@Raptors @hudsonsbay Wanny green",
    "290": "Rook payin homage ✨ https://t.co/YteoG3WfVE",
    "291": "@Raptors Lmao it really took 3 years for him to get his ring 😭",
    "292": "The Toronto Raptors are winning a NBA championship in 2023.",
    "293": "@AndersPass @MaxeyBetta @Raptors “No L’s” but ratio’d twice. More like nothing but L’s",
    "294": "The first playoff game in Toronto will likely be on the 21st, so it seems like any player(s) currently ineligible to play in Canada for a Raptors series could in fact take the Johnson &amp; Johnson vaccine today and meet the 14 day requirement before game 3 in Toronto.",
    "295": "@Raptors championship parade mohawk was somethin else 🔥 https://t.co/Ezf4Atb5Bc",
    "296": "@celticsideline @mohedabeast simple as that :\nsince Masai Ujiri arrived, in 8 years in Toronto, raptors have won 420 games out of 643 which is a .653 winning percentage, and with no season below .500",
    "297": "@TangerineHoops @Raptors My go-to game snack is homemade nachos",
    "298": "🏀 The 76ers ride a three game winning streak into Toronto to take on a Raptors team that is 6-1 in their last seven games. @robvenosports breaks this matchup down with @MejiaDinero and @SkeeProfit along with other games on tonight's slate!\n\n➡️ https://t.co/UamkdAzM1F https://t.co/cKpZYlo5iR",
    "299": "@RdotChung @NBA @Raptors @ScottBarnes561 Seems about right",
    "300": "Who’s watching the @Raptors game tonight? 🏀\n\nSelect sizes are still available for this iconic Roots x Raptors Award Jacket. Available exclusively in-store @ShopRSApparel, while supplies last.  \n\n🎥: @thekcagency feat. @shehroz_asad https://t.co/q7LbhcQiV2",
    "301": "@celticsideline @mohedabeast what Drake has to do with it ?\nIt's Masai who brought winning culture\nsince he arrived -&gt; in 8 years in Toronto, raptors qualified 8 times for the playoffs",
    "302": "Danny Green finally getting 2019 Raptors Championship ring after almost 1030 days https://t.co/vsWyw4MNLx #Toronto #TorontoRaptors #Raptors #WeTheNorth #NBA #DannyGreen",
    "303": "The Raptors are 12-3 over their last 15 games and currently sit at the No. 5 Seed in the East…Hell of a season for Toronto. 🔥 https://t.co/pMyUkMZtRR",
    "304": "@Raptors Super cool i dont know him",
    "305": "@RunItBackPhilly @Raptors I think if we win today they play next game and if they lose theyll rest the last game.",
    "306": "The @Bucks &amp; the @Raptors when Deandre Jordan or Paul Millsap are on the court. https://t.co/TFDpGYJWTV",
    "307": "@MaxeyBetta @Raptors Let me remind you that the “Poverty raptors” still have the biggest and most expensive championship ring ever made. You guys started that process a decade ago. Only thing you got to show for in that period.. Joel Embiid",
    "308": "RING NIGHT FINALLY!! CHAMPS FOREVER @Raptors @DGreen_14 🏆😤 #WeTheNorth https://t.co/YAh8hduldV",
    "309": "@TangerineHoops @Raptors Popcorn https://t.co/mcifccIIhU",
    "310": "@Raptors Hey #Raptors fans I’m selling 2 tickets for the game tonight in section 115!! I tested positive after the Lowry game and can’t go 😩 lemme know if you’re interested!!  140$ per ticket",
    "311": "@enra6ed @Raptors It's all about the championship and they know that! You'll see them play more minutes now unless they've decided to push a little higher if we can before the end. I feel the same way for @wacchi1013! ❤❤",
    "312": "@Mrs___Young21 @Mrs___Young21 There is also CB Squared Hair studio in Brampton. Tasha Reyes hooks me up and makes sure that my hair is legit before stepping to @Raptors game. Hit her up on IG @tashana_Reyes.  For me it is worth the 25 minute drive from downtown.",
    "313": "@MaxeyBetta @Raptors We own y’all 💀",
    "314": "TurboTax saves you time on your taxes, so you can see the 3-time champ get his ring. Finally. Take a #TurboTaxBreak. File today. https://t.co/FVTWTjvyKX \n\n@Raptors vs Philly, 7:30 PM EST. #WeTheChamps https://t.co/V7M1CO63ms",
    "315": "@jebronsburner @Raptors pls dont",
    "316": "@Raptors Let's go Raptors 🇨🇦",
    "317": "@TangerineHoops @Raptors @OrvillePopcorn Popcorn!",
    "318": "For the games in Toronto, I believe Green would start. That is what they have done this year. - @rich_hofmann thinks this could help the offense because the Raptors can't double as much BUT they would need to move a bench player up and the bench has been very poor",
    "319": "@LMcD34785232 @TimBontemps @Raptors 100% I bet all the players that r unvaxxed have a ton of other shots for shit we nvr even hear about anymore like polio , diphtheria , chickenpox etc when the last time u hear anybody die from them. If they don't want the shot , fine, but stay to fuck home.",
    "320": "My quick 2 min take on #NBAPlayoffs and #TorontoRaptors as it relates to players not able to travel and play in the playoffs. #Celtics #BleedGreen @sixers @celtics https://t.co/ZWt5YqdHQ5",
    "321": "@Raptors This is historical ! Amazing and thank you!",
    "322": "@TangerineHoops @Raptors Buttered popcorn, followed shortly by a guilt ridden apple.",
    "323": "@TangerineHoops @Raptors Chip's and Popcorn",
    "324": "RT: Raptors: We've been waiting for this one 👀 https://t.co/yYmb7y8HK7 @raptors @olgproline @NBACanada",
    "325": "@DrGuru_ Ask the Toronto Raptors with home court advantage in Canada lol",
    "326": "@TangerineHoops @Raptors Boursin cheese, salami, and crackers 😛😛😛",
    "327": "@TangerineHoops @Raptors Let’s do it! Popcorn and Malteasers!",
    "328": "We’re ready for another night of @Raptors basketball! 🏀 What’s your go-to game snack?",
    "329": "@Orleanpelicanos @MaxeyBetta @Raptors Bro still crying about that Kawhi buzzzer beater💀",
    "330": "BEST NBA BET\n\n🏀Raptors vs 76ers\n1⃣ Under is 5-1 in the last 6 meetings in Toronto.\n2⃣ Raptors are 4-1 ATS in their last 5 Thursday games.\n3⃣ 76ers are 1-5 ATS in their last 6 games overall.\n\nRead our analysis⬇️\nhttps://t.co/9nmWJiZWFh\n\n#bettingtips #gamblingtwitter #freepicks https://t.co/jU5nbFIHNQ",
    "331": "@Raptors bring him back",
    "332": "@LegionHoops Thays so fucking dumb, then the raptors shouldn’t have games in toronto 🤷🏻‍♂️ not our fuckin country",
    "333": "@Raptors Are you going to show a clip of \"The Shot\" as part of your montage? I fully support this 😂",
    "334": "@Raptors high-key this organization is goated",
    "335": "@MaxeyBetta @Raptors i really can't believe y'all still couldn't win with your stacked roster 😂😂😂\n\nhttps://t.co/QCOYDPzi1h",
    "336": "@MaxeyBetta @Raptors Who’s going to post the picture of Embiid crying? Raptors living rent free in Sixers heads!",
    "337": "@Raptors Welcome home!!! @DGreen_14",
    "338": "@Lubna545A @celticspIswin @RaptorsGen @rapsmuse_nba @Raptors 3-0 against them",
    "339": "@MaxeyBetta @Raptors @pskills43 Yup Embid cries better than Siakam 🤣",
    "340": "Renae and I are in Toronto and are going to it first @Raptors game together tonight! Happy Birthday Renae!! https://t.co/8uM3hRev0k",
    "341": "@MaxeyBetta @Raptors That Kawhi shot still burns doesnt it?",
    "342": "@MaxeyBetta @Raptors win something this year, because their window is almost shut.",
    "343": "@Raptors Waiting a loooooooooong time…😂",
    "344": "@Le3ronto @Raptors Fuck no",
    "345": "@NBAonTNT @NBCSPhilly WE'RE GONNA BEAT THE RAPTORS TONIGHT IN TORONTO PLAYING WITH 💯💪🏀 BABY BAABY!! GO SIXERS. https://t.co/zfxgT81JZL",
    "346": "@Raptors Fitting, since I still talk like we the champs",
    "347": "@Orleanpelicanos @MaxeyBetta @Raptors Ouch! 😂😂",
    "348": "@Raptors Love Danny. Finally we get to celebrate him",
    "349": "@Raptors The universe once Danny Green put his ring on his finger https://t.co/TrpnHtW9P3",
    "350": "@Raptors Oh man Finally 🤣🤣🤣",
    "351": "@MaxeyBetta @Raptors Said by the man who is a fan from a team that the last time they won a ring his father wasn't even born",
    "352": "@DPommellsNBCS @DonBellonCBS3 OUR SIXERS ARE WINNING TONIGHT, AS THEY BEAT THE RAPTORS IN TORONTO WITH 💯💪🏀 PLAYING..BABY BAABY!! https://t.co/KKWAQq2Or9",
    "353": "@Ace3Boom's account is temporarily unavailable because it violates the Twitter Media Policy. Learn more.",
    "354": "@Raptors @pskills43 Jaylen Brown better fr",
    "355": "@MaxeyBetta @Raptors When was your last ring?",
    "356": "@Raptors After 3 years",
    "357": "1. Miami Heat \n2. Milwaukee Bucks \n3. Boston Celtics \n4. Philadelphia 76ers \n5. Toronto Raptors \n6. Chicago Bulls \n7. Brooklyn Nets \n8. Cavs/Hornets/Hawks",
    "358": "@MaxeyBetta @Raptors This ratio better troll 😹+ I own ur fraudulent account 😹😹😹",
    "359": "@MaxeyBetta @Raptors not making it past the 1st round",
    "360": "@Raptors Crowd better get loud!!",
    "361": "@Raptors Danny a W mans for giving Scottie the championship jacket",
    "362": "@Raptors Wanny Wreen then",
    "363": "@Raptors LMAO",
    "364": "We've been waiting for this one 👀 https://t.co/Kq8iXLilpd",
    "365": "@JamieApody @duciswild ITS GOING DOWN IN TORONTO, AS OUR 76ERS BEAT THE RAPTORS 🔥💪🏀BABY BAABY!! GO SIXERS!! https://t.co/dp9vWlXYgN",
    "366": "SPORTING NEWS\nRaptors look to keep top four seed, home court advantage dream alive in important matchup vs. 76ers\n\nBy Scott Rafferty\n\n#Toronto #Raptors\nhttps://t.co/bjNg1Z87Re",
    "367": "ALERT: New high roller bet posted!\nA bet has been placed for $8,093.00 on Toronto Raptors - Philadelphia 76ers to win $13,851.00.\nTo view this bet or copy it https://t.co/9rX2mB5WAq https://t.co/uais5nLCMi",
    "368": "The Raptors shouldn’t be allowed to play games at home in Toronto, especially not playoff games until that mandate is lifted (if it ever is) unfair competitive advantage #NBA #NBAPlayoffs",
    "369": "@LegionHoops return game in toronto with the lakers was canceled and played in the bubble, following season raptors were in tampa and he wanted to receive the ring in front of the home crowd, earlier this season when 6ers played in toronto danny was injured and didnt travel. But now, finally",
    "370": "@MaxeyBetta @Raptors @Bell Philly &lt; Anyone in the east",
    "371": "#SixersOutsiders @KrystleRich. ITS GOING DOWN IN TORONTO TONIGHT, AS OUR 76ERS BEAT THE RAPTORS 💯💪🏀BABY BAABY!! GO SIXERS. https://t.co/zrsVhLuBYx",
    "372": "@Clapz23 @scarytrentjr @Raptors @pskills43 Propaganda ain’t a bad thing. Doesn’t mean the numbers aren’t accurate",
    "373": "Raptors +1.5 (-106)\n\n- Nick Nurse &gt; Doc Rivers\n- TOR 11-4 ATS last 15 games\n- Harden avg 19pts and 38 FG% 30 3PT% last 5 games\n- 76ers 1-4 ATS L5 vs Raptors\n- Embiid struggles vs Toronto\n\n🚨10-1 IN MY LAST 11 NBA BETS🚨\n\n#SportsBetting #WeTheNorth #FreePick #NBATwitter https://t.co/eRkpbyC9PI",
    "374": "@MBarkannNBCS @NBCSPhilly @sixers @Raptors Rivers actually coach half decent game",
    "375": "@ralealdreams @Raptors Because the Raptors and Tune Squad are bringing huge numbers of Canadian children into basketball 🏀.",
    "376": "Root \nReserve-Toronto Raptors",
    "377": "here...I fixed it @nba \n\n@Raptors @ScottBarnes561 https://t.co/Xf2SWRHuCf",
    "378": "76ers vs. Raptors picks and odds: Take Toronto on the spread https://t.co/debnBidATl",
    "379": "@PUMAHoops @Rookicks_ All those Kicks are dope!!! I would have to say Purple because I'm a @Raptors Fan and because it's my favorite color. Congrats to @DGreen_14 who finally gets his Ring tonight after 1030 days.  Thanks again Danny #Raptors #DannyGreen #TrusTheProcess #PumaHoops #WeTheNorth #Puma 🏀",
    "380": "@blogTO Toronto Raptors https://t.co/wmzRZPdAzj",
    "381": "Please win tonight @Bucks @Raptors",
    "382": "@Sportsnet @sixers @Raptors Resting Freddy, they're in the playoffs, let's see what happens when it counts! https://t.co/QVzHus1m8h",
    "383": "Paolo put as much work into this thread as Scottie Barnes! #ROTY #ScottieBarnes #WeTheNorth @raptors https://t.co/bzc0o58ULg",
    "384": "@ShamsCharania @Raptors we may need him off the bench for the playoffs 👀",
    "385": "Wayne Root \n\nReserve-Toronto Raptors",
    "386": "Only team the Warriors have ever beaten in the NBA championship was the Cleveland Cavaliers 🤣 Toronto Raptors exposed the Warriors as nobody's? Draymond played every game and was a non factor! Curry played and was good but not enough? What has changed to see otherwise? Nothing😏",
    "387": "@TimBontemps The laws will change once the @Raptors are out of the payoffs",
    "388": "@JesusIsKingRO @RocketsCulture Regardless of the wording, I’m pretty sure if you poll the Toronto Raptors fan base now, the consensus would be Barnes &gt;&gt;&gt; Suggs by a very wide margin",
    "389": "@Raptors thumbs up funny amphora number theory, watt's up. [ottffssent] complete set amp/emp/imp amphora Hermes Mercury ithyphallic man [ottffssent] tweet, sweet sweep , scopa. broom, broom, mush mushy mushiest the whole mushroom. The one in all ,the all in one. ouroboros. codex marcianus https://t.co/8NHCYcqLvU",
    "390": "@TheDream55_ @Raptors Glad someone remembers this shot, literally was stressing until it went in 😭",
    "391": "@Raptors Get that dub tonight.",
    "392": "Philadelphia 76ers vs Toronto Raptors 4/7/2022 Picks Predictions Previews\n\nhttps://t.co/0dsYEsN6Rd\n\n#NBAparlay #NBAprediction #NBAbetting #NBAbettingpicks #NBA #NBApicks #expertpicks #odds #picks #prediction #basketballpicks #Expertbettingpicks #handicapper #76ers #Raptors https://t.co/aayKfQusRn",
    "393": "@MapleLeafFoods @Raptors There’s a small picture of a guy planting trees in the article but ok 🤷🏽‍♀️",
    "394": "Things can change in the next two weeks, but do you think the @sixers can contain the @raptors without Matisse? #HereTheyCome https://t.co/8ue8ccWzVH",
    "395": "Here is the latest playoff update as the Philadelphia 76ers prepare for the Toronto Raptors on the road.  https://t.co/lVzb7EZZ3e",
    "396": "🏀#NBA'de Bu Gece👇\n\nMilwaukee Bucks 🆚 Boston Celtics\n⏱ 02:30\n\nToronto Raptors 🆚 Philadelphia 76ers\n⏱ 02:30\n\nGolden State Warriors 🆚 Los Angeles Lakers\n⏱ 05:00 https://t.co/hmtmZkDm54",
    "397": "https://t.co/gnmqg3dWJo I Got Drunk And Talked About The Toronto Raptors | How Good Are They Actually? https://t.co/kaqPxyNglv https://t.co/KgeGggtKj1",
    "398": "@Sportsnet @sixers @Raptors Hopefully 50 or less",
    "399": "The Playoffs are COMING, and a potential 1st Round date is on tap as @sixers 🤜💥🤛 @Raptors‼️ Will the 🦖 D stymie Philly once again or will Embiid &amp; Harden strike back❓ The 🔮 has some 💭 on this meeting of division rivals...\n#NBA WeTheNorth\n\nhttps://t.co/Aah8SWTJp6",
    "400": "Harden and Embiid have been an unstoppable duo since Harden joined the @sixers.🥵🔥 \n\nHow many points will the @Raptors hold them to tonight? 🤔 https://t.co/orXcFxWzBF",
    "401": "#Celtics injury report for tonight against the Bucks. C's seems to be prioritizing rest but it could come back to haunt them if they end up as the fourth seed facing the Raptors in the first round and Jaylen Brown and Al Horford can't play in Toronto. \nhttps://t.co/xULGrBNw8q",
    "402": "@pskills43 #AllNBA put him on the ballot @Raptors #WeTheNorth https://t.co/QuwZQvCeBA",
    "403": "@MoCooray @Raptors @fordnation @celliottability @ONgov small businesses to compete... in what? with what?",
    "404": "@RunItBackPhilly @Raptors 3rd seed.  Bulls in the first round, and  likely Bucks in the second round.",
    "405": "@brittni__d former @SCNorthGirlsBB1 and UNI player will working with @CampsofChamps this summer.  Brittni is a former Asst Coach with the 2019 NBA Champions Toronto Raptors.  A great opportunity for our Siouxland Girl. She knows basketball and will offer so much to our camp.",
    "406": "Toronto Raptors Tip-off vs. Philadelphia 76ers tonight at 7:30pm EST. \n\nOur friends @pointspreads11 analyzed the game tonight so check out https://t.co/yayKcrqHCn for their thoughts\n\n#nba #raptors #76ers https://t.co/Kp6mtFjUyq",
    "407": "This is a much needed conversation as 1 in 3 girls drops out of sport by their late teens according to Canadian Women and Sport. Thank you for highlighting and celebrating these athletes ❤️ @Raptors 🇨🇦 #Ramadan https://t.co/Kq6NYQmlPS",
    "408": "@rapsmuse_nba @DGreen_14 @Raptors Deadshot Danny🎯",
    "409": "@MomOfEverybody @Raptors While we don’t have details on the types of trees, we partnered with the Raptors to help contribute to Forest Ontario’s larger tree planting initiative last spring. You can read more about the work they are doing here https://t.co/WYzbRwc1UT",
    "410": "New post: \"Cappers Picks • PITBULL BARKING NBA\" Philadelphia 76ers vs Toronto Raptors OVER 218 -110 (7:40 PM)\n\nStatistics: Posted by pitbull6 — Thu Apr 07, 2022 1:33 pm\n\npitbull6 https://t.co/ZOchVlZavE",
    "411": "@RunItBackPhilly @Raptors win all 3 and go for the 2nd seed,that might win embiid the mvp",
    "412": "Are the @Raptors the underdogs of the @NBA East? If so, who they beating in the playoffs? 🤔 https://t.co/4gJRPuo3RW",
    "413": "HWRK (04.07.22): Narratives (next Thursday); Current Events/Canadian Reader (next Thursday); Response Journals (Edmond, Warden, Yousaf, Zachery, Furkan, and Mehmet). Have a great night! @Raptors play tonight!!! https://t.co/i96DslT0ag",
    "414": "After 1,030 days, the Covid-19 pandemic &amp; injuries, Danny Green will finally receive his 2019 Raptors championship ring in front of the fans tonight in Toronto 🏆\n\nGreen has been on three teams, been traded twice, &amp; won another championship in that span!",
    "415": "@RunItBackPhilly @iAmDjEastwood @Raptors get the 3rd seed",
    "416": "76ers vs Raptors prop picks: Tyrese Maxey stays hot in Toronto https://t.co/IR8XPmm2oJ",
    "417": "@RunItBackPhilly @Raptors Get that 3rd",
    "418": "📅GAME DAY📅\n\n🏒 @OHLSteelheads at 7pm\n🏀 @Raptors905 at 7:30pm\n🏀 @Raptors at 7:30pm\n⚽️ @yorkutdfc at 7:30pm\n🏒 @MapleLeafs at 8:30pm\n\n#DONTMISS #RoadToTheSix #WeTheNorth #UnitedByYou #LeafsForever https://t.co/hu06p7MnfV",
    "419": "Danny Green’s Raptors tenure (80 games):\n\n10.3 PPG\n4.0 RPG\n1.6 APG\n46.5 FG%\n45.5 3P%* (Franchise Record)\n198 3PM\n\nTwo teams, another championship, and 1,029 days later, he’ll finally get his Toronto ring in front of the home crowd tonight. https://t.co/DmLUk8bsHO",
    "420": "@almost0jake @Lvl1Reese You can't compare free throw drawing to a Toronto Raptors player. Even Kawhi who never talks complained about the Refs when he was here watch a game and you'll see Siakam get smacked and they'll call and offensive foul",
    "421": "@Raptors @MapleLeafFoods Can we see the trees? ❤️",
    "422": "@RunItBackPhilly @iAmDjEastwood @Raptors 3rd don’t wanna play the raps in the 1st",
    "423": "@RunItBackPhilly @Raptors Lol please get the 3 seed 😭",
    "424": "If the #Sixers win tonight at the @Raptors do they then rest players for the final 2 games to stay in the 4th seed or do they try to win out and claim the 3rd seed? 🤔",
    "425": "Danny Green will FINALLY receive his ring for his championship with the Raptors in front of fans in Toronto.\n\nIt’s been delayed for three years due to COVID/injuries. 🤯 https://t.co/myRIXNyJZd",
    "426": "GAMEDAY \n\n🆚 Toronto Raptors\n🏟️ Scotiabank Arena, Toronto, ON\n⏰ 20:30\n📺 League Pass https://t.co/6ElWzDuIlY",
    "427": "I don’t think this will become a major issue until that unvaccinated player who can’t play in Toronto, results in a swinging of the series in favor of the Raptors. Until then, this is a non story. https://t.co/hYJ0rSGsXS",
    "428": "@terron_francis Nets have flaws on defense but the Raptors are the weakest team in the east top 8 when everyone is fully healthy. Yes healthy cavaliers and bulls are better than Toronto.",
    "429": "The Toronto Raptors are scary",
    "430": "Philadelphia 76ers vs Toronto Raptors Free NBA Prediction 4/7/22 https://t.co/jEBSXepJNa via @YouTube",
    "431": "Philadelphia 76ers at Toronto Raptors 4/7/22 NBA Picks and Prediction https://t.co/b198uSyoaw\n\n#NBA #NBAPick #FreePick #FreePicks #SportsBetting #ExpertPick #NBATwitter #ExpertBettingAdvice #sportsbettingadvice #handicappers #SportsGambling #SportsPicks #WeTheNorth #HereTheyCome https://t.co/YJMJ42kRwy",
    "432": "@MBarkannNBCS @sixers @Raptors @NBCSPhilly I wan to see a win",
    "433": "Did you know @Covers runs a pick contest for every \n@MapleLeafs and @Raptors game?\n\nChoose which team will win outright, total points as well as some player props for a chance to win a Covers swag pack! \n\nPlay here for free! : https://t.co/lulfFAIVhd https://t.co/u9UlPyqhdk",
    "434": "@Raptors Hahah acting like there is more than one option here #embiidtears",
    "435": "@Raptors @MapleLeafFoods This is awesome program.\nCan you see this Mr. @Ranorahman ?",
    "436": "@Raptors @MapleLeafFoods Can we do some GET THAT GARBAGE OUTTA HEAH volunteer litter clean ups as well?",
    "437": "@blogTO The Toronto Maple Leafs and the Toronto Raptors will not win their respective championships in their league",
    "438": "@MBarkannNBCS @NBCSPhilly @sixers @Raptors How about Thybulle doing the unselfish, responsible thing and getting vaccinated?",
    "439": "72 team blocks in March means we’ve now planted over 12,000 trees 🌳\n\nIn April, the Raptors and @MapleLeafFoods will plant 100 trees per block and 5 every time you play Guard the Globe in the Raptors app!\n\n📲: https://t.co/jydBSA5Osh https://t.co/DWEw1gKw2E",
    "440": "@MBarkannNBCS @NBCSPhilly @sixers @Raptors I’d like to see Matisse Thybulle playing",
    "441": "Thank you @Raptors https://t.co/d5vzv9byef",
    "442": "RT: Raptors: Put PascAll-NBA Siakam on the ballot 😤\n\n@pskills43 https://t.co/IEKGG3LMNZ @raptors @olgproline @NBACanada",
    "443": "@ScottBarnes561 deserves to be this year's NBA Rookie of The Year. He has been dominating the game as a rookie and helping the @Raptors make it into the playoffs!\nhttps://t.co/MdywC9C35w",
    "444": "Here are five prop bets as the Philadelphia 76ers get set to take on the Toronto Raptors on the road.  https://t.co/6A5qBgfxua",
    "445": "@MBarkannNBCS @sixers @Raptors @NBCSPhilly Paul Reed or Bassey , no DJ.",
    "446": "@MBarkannNBCS @NBCSPhilly @sixers @Raptors Anybody back up Embiid besides Jordan or Millsap.",
    "447": "@Raptors @pskills43 Raps Twitter if PascAll NBA Siakim is left off the ballot https://t.co/4EoxJIUsYi",
    "448": "🎉 Toronto Raptors 1 WINNER gets 3x tickets!!! 🎉\n\n🏆 3x Toronto Raptors Tickets Raptors vs Rockets Fri Apr 8 2022 @ 730pm Eastern for one winner. Seats are together.\n\n1️⃣ Follow @Topdowninthe6ix  \n2️⃣ RT &amp; ❤️\n3️⃣ Tag 2 Friends\n\n⏰24h⏰\nClaim within 1hr of winning DM. No exceptions. https://t.co/cmE01rkPXU",
    "449": "#NBA \n\nPhi/Tor\n\n76ers are 1-4 ATS in the last 5 meetings in Toronto\n76ers are 1-5 ATS in their last 6 games\n76ers are 0-4 ATS in their last 4 road games\nRaptors are 11-4 ATS in their last 15 games\nRaptors are 8-3 ATS in their last 11 games playing on 1 days rest",
    "450": "Possible playoff preview tonight for the @Sixers at @Raptors.\nWhat do you want to see from the Sixers tonight?\n\nUse #thewarmupSixers and see responses at 6 p.m. on…\n\n“The Warmup.” \n@NBCSPhilly https://t.co/6JPX3vun5Y",
    "451": "@Sviat_10 My children attend Josyf Cardinal Slipyj 🇺🇦 Catholic School in Toronto, which is planning a silent auction fundraiser to support Ukraine at the end of April/beginning of May. Wondering if we could count on your support to put an item in the auction? @Raptors @NBA",
    "452": "Toronto Raptors v Philadelphia 76ers, can you predict the winner?\n\n#NBA #Canada",
    "453": "Philadelphia 76ers vs Toronto Raptors Free NBA Prediction 4/7/22 https://t.co/29HDbVDSBW via @YouTube\n\n#gamblingtwitter",
    "454": "The Toronto Raptors are going to win the Championship this year",
    "455": "Check out our very own Lauren Tuiskula hopping on @CTVNews to chat all things Toronto Raptors and Blue Jays! 🇨🇦👏\nhttps://t.co/GMfGjRIN0W",
    "456": "@DalanoDimesV2 @5ft10reboundgod @Raptors @pskills43 How we clinched already",
    "457": "Nice to get two images in today’s Sports Section of the Toronto Sun. One from the last Raptors game and an earlier one from the championship parade. @imagncontent @usatodaysports @torontosunonline @raptors https://t.co/XHAvbOiYNB",
    "458": "Back TORONTO RAPTORS to BEAT Philadelphia 76ers tonight in the @NBA (Game Starts at 00.40 BST) #NBA #Basketball",
    "459": "@DalanoDimesV2 @Raptors @pskills43 Oh wait nvm I didn’t realize you play today too, Sixers are frauds so you’ll still win",
    "460": "Raps Twitter is coming if PascALL NBA Siakim is not on the ballet…#WeTheNorth #TorontoRaptors https://t.co/X4QL8VLxB6",
    "461": "@DalanoDimesV2 @Raptors @pskills43 Bro ur gonna win 😭 it’s a given",
    "462": "@kunert_ben @MaxeyBetta @Raptors @TangerineHoops Ironic",
    "463": "@Raptors That's why we are the number franchise in the league",
    "464": "@steviebattz21 @MaxeyBetta @Raptors @pskills43 I came here just to tweet that Gif lol",
    "465": "@MaxeyBetta @Raptors @pskills43 Potential back to back ratios on your poverty franchise? https://t.co/gP3UUBtAvl",
    "466": "@Raptors I’m glad there’s no city jersey here. They’re bad luck.",
    "467": "@Dana_patrick_d 3 things:\n\n- the Raptors stink and they have 0 shot at winning a game in Boston\n\n- I choose to believe they’ll all be available in Toronto, as they have said, until they’re literally not on the court\n\n- Toronto wins vs Philly tonight and this is moot. Celtics (likely) get 3 seed",
    "468": "The #Sixers are 1.5-pt favorites in Toronto tonight against the #Raptors on @DKSportsbook. \n\n-125 on the ML. O/U 220. \n\nWho you got? https://t.co/QX1Mup7Qtu",
    "469": "@Sportsnet @BlueJays for sure. Celebrate like when the @Raptors did it",
    "470": "@Raptors @pskills43 Getting another Pascal Jersey today for the playoffs! Let’s get it Spicy!! 🌶🌶",
    "471": "@Raptors @pskills43 He'll get there",
    "472": "@Raptors @pskills43 All-NBA Siakam\nAll-Star Vanvleet\nROTY Scottie Barnes\n\nit's all coming together",
    "473": "@Cuhlexah @Raptors That’s a good one!!",
    "474": "@ekoreen You've gotta think Toronto wants Philly out of those three, no? All will be favoured over the Raptors but they seem the least scary to me.",
    "475": "@Raptors @pskills43 Pls don’t trade for Gobert 👍",
    "476": "Analyzing Thursday’s Philadelphia 76ers at Toronto Raptors and lines, with NBA expert picks, predictions and best bets.  https://t.co/5OviH5zuzn",
    "477": "Put PascAll-NBA Siakam on the ballot 😤\n\n@pskills43 https://t.co/zZkckqsDeI",
    "478": "Philadelphia 76ers at Toronto Raptors odds, picks and predictions https://t.co/x6Kw9AE8VE",
    "479": "Listened @HowardBeck appreciate time and perspective on raptors show @william_lou  @ScottBarnes561  top 3 categories, guards 1-5 , plays 1-5 positions, create own shot, no plays ever made for him. core played least amount of games-  injuries... #ROTY  @Raptors  #WeTheNorth https://t.co/wZqoMMrF7A",
    "480": "Danny Green waited over 1000 days to get his @Raptors championship ring in front of a packed house in Toronto.\n\nIf you're there tonight. Get loud for him! \n\n#WeTheNorth\n#reallybigrings https://t.co/LB5gJhEzI6",
    "481": "@drawthenorth @ScottBarnes561 @Raptors Wow! You gott get artist of the year man AOTY - I hope @ScottBarnes561 sees your talent!! 🔥",
    "482": "@BarnesFanClub @Raptors Absolutely!! Fingers crossed they help!",
    "483": "Matisse Thybulle Ineligible to Play against Toronto Raptors https://t.co/dk1GHkfGrn",
    "484": "Matisse Thybulle Ineligible to Play against Toronto Raptors https://t.co/NMKGxFB4vM",
    "485": "@TyJohnsonNews @HurtsSzn2 He's right. If all it takes for the Raptors to beat us is Thybulle sitting the 3 games in Toronto, we deserve to lose. https://t.co/sD5k36wxa4",
    "486": "Season 2 of My Toronto Raptors Rebuild dropping tonight or tomorrow ‼️",
    "487": "New tumblr post: \"### NBA2K22 Utah Jazz vs Toronto Raptors MyLeague PS4 GAMES...\" https://t.co/K1fzIgX0GZ ifttt, youtube",
    "488": "RAPTORS GAME PREVIEW:\n\n🏀: @sixers vs. @Raptors \n📺: Sportsnet One\n🕢: 7:30 PM/ET\n\nhttps://t.co/UOhmmuj5cn",
    "489": "Vince Carter played 7 seasons in Toronto and never made it passed the 2nd round.\n\nLowry was their for 9. Made multiple ECF. Won a ring. \n\nLowry is 2nd in games played, most assists, most 3s, 2nd most pts.\n\nDerozan accomplished more for Raptors than Vince ever did nvm Lowry. https://t.co/rinK7OeHOT",
    "490": "1/ Thanks to the @raptors for providing a space for visibly Muslim girl and women athletes to talk about their hopes and challenges in sports. https://t.co/VMOLjSAAbp",
    "491": "Remember when they said Trent Jr. didn't play defence when the Raps traded Norm for him? On Nick Nurse's @Raptors you play D or you sit. https://t.co/1y5q3QADn8",
    "492": "@Raptors @Muneeb_AC this is what believing in the city looks like, love to see it.",
    "493": "Philadelphia 76ers vs Toronto Raptors - NBA League 2022\n🔴Live Now📺📱:  https://t.co/jlULlWCCJ0\nDate : Thursday, April 07, 2022 - Time : 7:30 PM",
    "494": "Good week for former @Raptors showing TO some love! First @Klow7 now @DGreen_14. https://t.co/2mRmjIryvz",
    "495": "Philadelphia 76ers vs Toronto Raptors - NBA League Pass\n🔴Live Streaming📺📱:  https://t.co/lKCTOF7C5z\nDate : Thursday, April 07, 2022 - Time : 7:30 PM",
    "496": "@MaxeyBetta @Raptors 100% you have notifs on for when @Raptors tweet 12:41/12:41",
    "497": "@MatisseThybulle is unvaccinated and won't be able to play tonight's game against Raptors in Toronto. \n\n4th seeded @sixers are lined up to face 5th seeded @Raptors in the first round. This is going to get interesting! 🍿👀\n\n#matissethybulle #76ers #raptors #nba https://t.co/0JD5XXBjP1",
    "498": "@Raptors Game Day",
    "499": "The Raptors made life difficult for Joel Embiid the last time Toronto and Philly played…but how did they do it?\n\n@samfolkk has the answers 📝\n🎥: https://t.co/OUDcRBLNXA https://t.co/jwZbugjkXe",
    "500": "@MaxeyBetta @Raptors @ScottBarnes561 look at embiid hugging his dad man, so inspirational https://t.co/Aq5knO3C3g",
    "501": "76ers’ Matisse Thybulle listed as ‘ineligible to play’ against Raptors in Toronto https://t.co/k7uxcjvXnp",
    "502": "NBA FREE PICK 🚨\n76ers vs Raptors  🏀\n\nPreview and Prediction 📋 \n\n▶️https://t.co/XpZjgAl8Df\n\n#NBA  #GamblingTwitter #freepicks #freepick #NBAPicks \n#76ers #Philadelphia \n#WeTheNorth    #Toronto \n#freebet #sportsbets \n#nbabets #bettingtips #NBATwitter     #basketball https://t.co/JhXZiryzrM",
    "503": "So that means Thybulle can’t play in Toronto if they play the Raptors in the first round.",
    "504": "NBA fortsetter i kveld også!\n\n🏀 Boston Celtics vs Milwaukee Bucks:star:\n🏀 La Lakers vs Golden State Warriors:star:\n🏀 Philadelphia 76ers vs Toronto Raptors:star:\n🏀 Memphis Grizzlies vs Denver Nuggets\n\nLegg dine vedd her: https://t.co/UyNoRNvDoL https://t.co/8dgzP6zmcf",
    "505": "Embiid, Harden and the 76ers are in Toronto hoping to avoid a season series sweep at the hand of the Raptors.\n\nSixers        -1½ -105\nRaptors     220 -105\n\nSU Winner: PHI -123, TOR +103 https://t.co/eFaTuhG6Uu",
    "506": "I predicted 47 to 49 #Raptors wins in our office pre-season pool. Let's go @Raptors. An all-expenses paid cup of coffee is riding on this! #WeTheNorth \n\n@steven_lebron @william_lou @DocNaismith @toebeesaw https://t.co/vJrlgJhoJO",
    "507": "@MishaConfession Not everyone. Boston has two stars who are not vaccinated, Brooklyn as well. Everyone is hoping for the Toronto Raptors be eliminated first round so they can take their covid politics home with them.",
    "508": "76ers' Matisse Thybulle listed as 'ineligible to play' against Raptors in Toronto #CBSSports #NBA https://t.co/Z70EFYuLrg",
    "509": "@Struzz21 @AcKash95 @ChrisForsberg_ What? A loss tonight and we are going to be playing the Raptors with who knows what lineup in Toronto. Unless your automatically giving the Raps a win tonight against the Sixers",
    "510": "The Philadelphia 76ers react to Matisse Thybulle being ineligible to play against the Toronto Raptors.  https://t.co/Z4YHV7M2SI",
    "511": "@MatisseThybulle is unvaccinated and won't be able to play tonight's game against Raptors in Toronto. \n\n4th seeded @sixers are lined up to face 5th seeded @Raptors in the first round. This is going to get interesting! 🍿👀\n\n#matissethybulle #76ers #raptors #nba https://t.co/y7DtDK58Fd",
    "512": "@TyJohnsonNews Any chance @NBA tries to have the @Raptors play games in the US? I think it would set a bad precedent but not sure how missing a Kyrie level player or multiple @Celtics players would be good for money.",
    "513": "The #NBAPlayoffs around just around and the corner and I can confidently say, no one will want to see the #Toronto #Raptors.\n\n#WeTheNorth #NBA #NBA75 #NBATwitter #Basketball #YouTube #Canada\n\nhttps://t.co/Y3cv6A9bCs",
    "514": "🚨ATTENTION!🚨 NEW LIVE STREAM AT 7:20PM EST/ 4:20PM PST NBA Basketball: Philadelphia 76ers vs Toronto Raptors | Live Play-By-Pla... https://t.co/SvHT8WiYgh via @YouTube #Sixers #HereTheyCome https://t.co/wA7HVoCw5B",
    "515": "@YoSoyFiestaaa If they play the raptors 2 of the players can’t play in Toronto in the playoffs",
    "516": "@AaRrCcHhY If they play the raptors 2 of the players can’t play in Toronto in the playoffs",
    "517": "@Myles__B If they play the raptors 2 of the players can’t play in Toronto in the playoffs",
    "518": "Celebrating and creating space for Muslim women in sports remains crucial.\n\nShout out to the @Raptors for using their platform — and we also recommend checking out the work that @hijabiballers is doing to create more opportunities for hijab-wearing athletes! https://t.co/9uqgv4PS4j",
    "519": "@RedsTriangle @ProbablyNoRadio @ECUTarheel4Life @BeltranJean1 @ZeNotoriousBTC @TheBallnChikn @RaptOriginZ @chikn_nft @steph_p13 @s04p_ @solngmi @BubbaCrypto23 @Chiknwhalegod @FRENLYFISH @Raptors @Raptors905 @the_raptor @SmithRaps @dinosaurcomics @avalabsofficial @TylerEmonk @_Pricy_ @CoachCFoss @Apeliens @ISLAND_MARTINI @TweetsbyCoachP @TRossPodcast @SelfEnhancement I know YOU KNOW Hanks!!!! https://t.co/BQ1D58t5yB",
    "520": "@Raptors W organization",
    "521": "@Raptors Toronto should be disqualified for cheating",
    "522": "@TheKobeMuse @mrvincecarter15 @Raptors @warriors yea crazy",
    "523": "Have you entered to win a #TorontoRaptors coffee table, made from a piece of the '95 Rewind court? 👀 Contest is on now!! 🔥 Get your entries in here - &gt; https://t.co/tCYpXtT8uZ\nOpen to Ontario residents only. https://t.co/VDxc2A6acb",
    "524": "@Raptors about upset your fav Team 💪🏾💯",
    "525": "@cavs, @chicagobulls and @Raptors missed the playoffs last season but have come back stronger this year! 🔥🙌\n\nWhich team has been the most surprising this year and who do you think will make a deeper playoffs run? 🗣️👇\n\n#chicagobulls #cavaliers #torontoraptors #nba https://t.co/mQgjalF0ev",
    "526": "NBA Betting Pick &amp; Prediction: Philadelphia 76ers vs. Toronto Raptors - Thursday, April 7, 2022 https://t.co/9P6VEovnrX",
    "527": "Last night, former Raptor (and CHAMPION😤) Danny Green (@DGreen_14) sat down with Rod Black (@RodBlackTV) to chat about finally getting his ring, being back in Toronto, and much more.\n\nWatch below⤵️\n\n#RTZ #Raptors #WeTheNorth https://t.co/So8e82R6Rq",
    "528": "@ProbablyNoRadio @ECUTarheel4Life @hoopdreamsbball @BeltranJean1 @ZeNotoriousBTC @TheBallnChikn @RaptOriginZ @chikn_nft @steph_p13 @s04p_ @solngmi @BubbaCrypto23 @Chiknwhalegod @FRENLYFISH @Raptors @Raptors905 @the_raptor @SmithRaps @dinosaurcomics @avalabsofficial @TylerEmonk @_Pricy_ @CoachCFoss @Apeliens @ISLAND_MARTINI @TweetsbyCoachP @TRossPodcast @SelfEnhancement Facts",
    "529": "@CoreyB08 Yes, maybe they took care of it in the meantime, maybe not. Only way we’ll know is when the injury report comes out the day before a game with the raptors in Toronto. Until then no one’s will know for sure.",
    "530": "08/04/22 GAME 80 - CALM BEFORE THE STORM !\n\n🦖[46-33] @RaptorsBE @Mike_LaviolRaps\n@Raptors_FR @RaptorsFRA\n🔔[49-30] @FR_Sixers @76ersFRA\n⏱️1:30\n📺 League Pass\n🏟 ScotiaBank Arena Toronto 🇨🇦\n🖼 by @JeffCreaDesign\n\n#WeTheNorth | #TrustTheProcess | #Embiid | #Canada | #Toronto | https://t.co/U88ql08Bgz",
    "531": "logiciel : Milwaukee Bucks\n\nToronto Raptors\n\nOrlando Magic\n\nSan Antonio Spurs\n\nGolden State Warriors\n\nNew Orleans Pelicans\n\nMemphis Grizzlies",
    "532": "@Raptors Obviously this https://t.co/FYn675usbC",
    "533": "@Pat_brownie @nicekicksgabe @Pysted @Modekongen @NeilStewartWC @ryenarussillo 😂😂😂😂 luckily live I didn’t even notice the kawhi travel after the catch or I would cried like that kid, for real though doc is in pre K for coaches nick Nurse has a masters lol raptors are the sixers krptonite so no wonder you don’t think JoJo is good he was awful in Toronto",
    "534": "@Raptors Whoever thought the way the team was built and structured that they werent gonna make it... needs to reevaluate their basketball knowledge",
    "535": "@Raptors Oh how can it NOT be that shot that made all of us hold our breath for what seemed like an eternity!!! https://t.co/OaZnMYZXyX",
    "536": "Philadelphia 76ers vs Toronto Raptors NBA Pick and Prediction NBA Bettin... https://t.co/09ieW9Y4Iv via @YouTube",
    "537": "@Raptors \"Thank god raptors didnt make the playoffs\" must have been a bucks fan",
    "538": "@Raptors Why's my guy rocking a Tune Squad jacket tho",
    "539": "The Raptors won't know their first-round opponent until the last day of the season but some will be more disadvantaged than others. \n\n@chengwesley assesses Toronto’s first-round opponents: https://t.co/rW51gLG0Ao https://t.co/W3ZbDCMWri",
    "540": "@Raptors @ScottBarnes561 People dont realize the crazy part of this. This kid is so good he playing like a vet with one of the best starting lineups in the league. He integrates &amp; compliments with confidence. On a already experienced ... winning team at that",
    "541": "@Raptors Awesome!!!!❤❤❤❤❤",
    "542": "@Raptors Meet people where they are to empower them..💪🏿🙌🏿",
    "543": "@MaxeyBetta @Raptors Is this the dagger?",
    "544": "Joel Embiid and James Harden are an offensive issue for opposing teams. But, they’re players that Toronto can neutralize and contain.\n\nMy take on why the 76ers are exactly who the Raptors want to face in the first round 🏀 @YahooCASports #RTZ #Raptors https://t.co/0hPMF1HxgJ",
    "545": "@Raptors Give malachi and armoni minutes",
    "546": "We held a #breakingthebias event to highlight hijab-wearing athletes in sport. This event helped us to value and celebrate these athletes by giving them a safe space to have a conversation on allyship so we can continue to grow as a team. https://t.co/W4dKOXw339",
    "547": "@Raptors @pskills43 These numbers are wrong tho. He’s at 22.5",
    "548": "Let’s add \n\n33 - MIP 😉 \n\n@Raptors @gtrentjr https://t.co/Qax4KCS2Cg",
    "549": "@BklynGM @mathiefflybulle @sixers @NBCSPhilly @975TheFanatic @Raptors @Ticketmaster nice burner kyrie",
    "550": "RT: Raptors: ROTY leading the way\n\n#ROTY | @ScottBarnes561 https://t.co/yymrtLmE0N @raptors @olgproline @NBACanada",
    "551": "@Raptors Anyone having problems with accepting tickets into the Raptors Ticketmaster account?",
    "552": "Based on the @bball_ref Playoff Probabilities, chances for each team to be Boston Celtics Round 1 opponent:\n\n26.8% Chicago Bulls\n15.8% Cleveland Cavs\n15% Atlanta Hawks\n14.9% Brooklyn Nets\n14.8% Toronto Raptors\n12.4% Charlotte Hornets\n0.2% Milwaukee Bucks\n0.1% Philadelphia 76ers https://t.co/LZphcgHDjG",
    "553": "@DrGuru_ The Toronto Raptors... Are your NBA champions",
    "554": "The Raptors offered to deliver the ring to Danny in LA. He could've gotten it when the Lakers played the Raps in the bubble, when the Sixers visited Tampa, or this past preseason. He waited this long to do it in a packed house in Toronto. Glad he'll finally get that experience.",
    "555": "@offwhiteferrari @Raptors Should have never left the Raptors we could have run it back!",
    "556": "Matisse Thybulle will be ineligible for the game in Toronto tonight due to vaccine mandates\n\nThis could be come a bigger concern as the Sixers are slated to play the Raptors in the first round of the playoffs at the moment https://t.co/GfPrEygBeW",
    "557": "nba playoffs are back in toronto and so am i at raptors games https://t.co/aTbCqp0A9Y",
    "558": "@Raptors The.Shot. #WeTheNorth",
    "559": "@Raptors @ScottBarnes561 Haters gonna hate 😤",
    "560": "1,030 days later...we still celebrate the best team in 🇨🇦!  Congrats @DGreen_14!  Happy Ring Day @Raptors fans! #WeTheNorth #wethechamps 🏀🏆🍾 https://t.co/t2PM7GOeuU",
    "561": "@Raptors the kawhi shot to win the series",
    "562": "April 7, 2002: Indiana's Ron Artest kicks the ball into the stands in Toronto.\n\nRaptors 94, Pacers 84.\n📺 CNN https://t.co/x9VuKBmb8O",
    "563": "@DGreen_14 will finally get his @Raptors 2019 championship ring today #WeTheNorth",
    "564": "@Raptors can yall please not sweep the bucks in the first round. need to prove my friend wrong. thanks :)",
    "565": "Here we go @Raptors 👌👌!!! #WeTheNorth #raptors #Drake #Toronto #Canada #nba https://t.co/d1IfupP3T3",
    "566": "@MaxeyBetta @Raptors @ScottBarnes561 Is this the dagger?",
    "567": "@SimuLiu @Raptors Show support for Gary Trent jr for MIP",
    "568": "No choice but to make these bets early as I'm occupied the remainder of the day. I'm going to gamble that Boston and Toronto do try to win their respective games.\n\nGrizzlies (+6) against the Nuggets\nCeltics (+7) against the Bucks\nRaptors (+2) against the 76ers",
    "569": "@boogiefromtheH @sixers @NBCSPhilly @975TheFanatic @Raptors @Ticketmaster Read into it if that makes you feel better. The only team I’m worried about is the Bucks",
    "570": "canada in the fifa world cup AND toronto raptors in the playoffs?? this our year fr",
    "571": "Tickets for the Toronto Raptors are on sale today and you don't need a code\n\n@Raptors playoffs\n\nLINK: https://t.co/enLoEMEGwg\n\nBEST WISHES",
    "572": "The @sixers play basketball tonight! \n\nSixers V Raptors\n\n⏰ 12:30am GMT\n\n📍Toronto, Canada\n\nWill be a tough game made tougher by the news that Matisse Thybulle is ineligible to play due to being unvaccinated.\n\nWe’re 2-1 down in the season series, be nice to level it!",
    "573": "@boxofficeqbs I’m gonna propose a trade and free agent scenario. \n\nUtah gets the Raptors name\nNew Orleans gets the Jazz name back\nVancouver expansion gets Grizz\nToronto brings back the Huskies \nMemphis Hounds\n\nCharlotte sends old name Bobcats and New Orleans sends Pelicans name to G-League",
    "574": "@ThatPrinceJT @Banner18loading @TheNBACentral @GwashburnGlobe The Celtics C team took the Raptors to OT in toronto....Lmao",
    "575": "Can the Toronto Raptors make any noise in the playoffs? (via @MaisonMaerz1)\nhttps://t.co/G1Qh2xzKa6",
    "576": "@Raptors @ScottBarnes561 More impactful than Levan Lobley",
    "577": "@KendrickPerkins Hell yeah! More @Raptors love on #nbatoday Sick of hearing about the f*ckin’ @Lakers 😂",
    "578": "@roto_sports @bjneitzel @maxeysburneracc @Elmoprods @sixers @NBCSPhilly @975TheFanatic @Raptors @Ticketmaster but it does if we play Toronto in the first round it does affect the whole team, all the fans, and the rest of the organization. Oh and according to standings with 2-3 games left in the season guess who we play as of now. TORONTO!!! stfu mf",
    "579": "Sixers in the Six to battle the Toronto Raptors Today !",
    "580": "@MaxeyBetta @Raptors @ScottBarnes561 Scottie owns embid",
    "581": "@Raptors @ScottBarnes561 should’ve been an all-star",
    "582": "@Raptors @ScottBarnes561 Scottie =goat",
    "583": "@MaxeyBetta @Raptors @ScottBarnes561 1st round exits",
    "584": "The sun is shining in Toronto, baseball opening day, Raptors clinched a playoff spot and are playing tonight \n\nIt's a great Thursday in T.O ☀️⚾️🏀",
    "585": "ROTY leading the way\n\n#ROTY | @ScottBarnes561 https://t.co/QRjQqjsMGL",
    "586": "Toronto Raptors vs Philadelphia 76ers Odds\nGame odds:\nToronto Raptors: 4/5 \nPhiladelphia 76ers: 21/20\nBoth teams head over to the Scotiabank Arena to battle it out!\nEnjoy your free bets with Karamba, just click here:\nhttps://t.co/iwx5vHFvbQ\n🔞 | https://t.co/0IH46X21v0 https://t.co/VbfYnvwtsu",
    "587": "Huge game tonight for the Raptors. Basically a must win, in my opinion. \n\nIf Toronto can beat Philly tonight, it will really go a long way towards securing the Sixers as our first round matchup, which is what every Raptors fan should be hoping for.",
    "588": "Today's NBA Consensus (So Far):\n\nPortland Trail Blazers 69%\nOrlando Magic 62%\nToronto Raptors 60%\nMemphis Grizzlies 55%\nGolden State Warriors 55%\nMinnesota Timberwolves 54%\nBoston Celtics 50%",
    "589": "@roto_sports @bjneitzel @maxeysburneracc @Elmoprods @sixers @NBCSPhilly @975TheFanatic @Raptors @Ticketmaster Guy saw a long word on Google and now he just repeats it lmao.",
    "590": "@megastarvc @rapsfan902 @Raptors he has torn knee ligaments. 🤣🤣\nYou clowns make it a habit of putting injured players on your bench for the playoff run?  SMH",
    "591": "@celticspIswin @RaptorsGen @rapsmuse_nba @Raptors Maybe but I don't think the supporting cast is the best. We would only need to stop ginnais. We did beat  milwaukee in the beginning of the seosen",
    "592": "@rapsfan902 @megastarvc @Raptors Lmao! Never gonna happen",
    "593": "@OmDip8 @Raptors I actually think they should run way more plays thru Scottie , especially in the paint and in the latter part of close games. He seems like he could be \"that guy\"",
    "594": "@DabossVinny @Elmoprods @sixers @NBCSPhilly @975TheFanatic @Raptors @Ticketmaster So you’d rather have our rights violated?",
    "595": "Sixers take on the Raptors in Toronto tonight!\n\n- No Matisse Thybulle as it appears he is the unvaccinated Sixer…\n\n- Can Embiid do anything else to gain ground on the MVP award?\n\n- Can Philly split the season series?\n\n#Sixers #DoSomethingMajor https://t.co/tZbfR9r5Ju",
    "596": "So either 76ers playing Paul Millsap, Georges Niang against Raptors(Thybulle out)  or Celtics without Al Horford &amp; Jaylen Brown in Toronto for round 1. Noice\n\nPlease Bucks win tonight",
    "597": "I almost became a professional #basketball coach! A clip from the recent @raptors against @celtics game at the @scotiabankarena. Needless to say we won 🙌 Read my article from 2018 praising the bold trade Masai made &amp; how it could lead to a championship 🏆 https://t.co/BL2FKKNewW https://t.co/LrkWHMJYGu",
    "598": "@DEK_KingGaming @sixers @NBCSPhilly @975TheFanatic @Raptors @Ticketmaster You responded to a sixers tweet that has absolutely nothing to do with that, just to bring up the fact that you’ll be without him. That tells me you’re worried about it, which you shouldn’t be… but you are. It’s ok to admit it",
    "599": "@Raptors So much fun to watch this team. I think alot of teams don't want to meet them in the playoffs #WeTheNorth",
    "600": "@roto_sports @bjneitzel @maxeysburneracc @Elmoprods @sixers @NBCSPhilly @975TheFanatic @Raptors @Ticketmaster I bet these are terns you’ve never ever heard of until you proclaimed yourself a researcher. The vaccine doesn’t keep you from getting it, it keeps you from getting ill. There’s a reason why cases are lower where the majority of people are vaccinated.",
    "601": "Toronto raptors clinch the playoffs spot",
    "602": "Make these available rn @Raptors https://t.co/k7PepUtwW3",
    "603": "@rapsmuse_nba @Raptors Love it when things finally start to click and the right time",
    "604": "@sixers -1.5 @Raptors without @MatisseThybulle bc he’s not vax’d and it’s Canada. Why… @JustinTrudeau",
    "605": "@celticspIswin @RaptorsGen @rapsmuse_nba @Raptors I actually don't know no one seems capable accept maybe celtics",
    "606": "@Raptors  HELP! where's the pre sale code for playoff tickets??",
    "607": "@ACE_PAID_N_FULL If they play the raptors yeah cause they can’t play in Toronto lol",
    "608": "DasHaus made a bet!\n\nEvent: Philadelphia 76ers vs Toronto Raptors #NBA\nBet: Toronto Raptors TO WIN +1.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "609": "DasHaus made a bet!\n\nEvent: Philadelphia 76ers vs Toronto Raptors #NBA\nBet: Philadelphia 76ers TO WIN -1.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "610": "@rapsmuse_nba @Raptors Preach to the masses. Spread the good word.",
    "611": "There's really nothing better then warm weather. Late playoff pushes for the #Raptors and #Leafs and then the #BlueJays Home Opener in ONE DAY!\n\nSummer is just around the corner.\n\nBask it all in, Toronto!\n\n#WeTheNorth #LeafsForever #WeAreBlueJays",
    "612": "Will #toronto sports teams all will win their respective championships this year? #daretodream @Raptors  @MapleLeafs @TorontoFC @BlueJays",
    "613": "RT: Raptors: LET'S GO 🔥 https://t.co/sSc6kUqTJ7 @raptors @olgproline @NBACanada",
    "614": "@heretheycome215 @maxeysburneracc @Elmoprods @sixers @NBCSPhilly @975TheFanatic @Raptors @Ticketmaster it is his choice but it shouldn't be",
    "615": "@maxeysburneracc @Elmoprods @sixers @NBCSPhilly @975TheFanatic @Raptors @Ticketmaster shouldn't be",
    "616": "Right now the Sixers are seeded fourth and would face the Raptors in the playoffs. Matisse Thybulle as of now would not be able to play the road games in Toronto https://t.co/CKSdSgQHuh",
    "617": "@boogiefromtheH @sixers @NBCSPhilly @975TheFanatic @Raptors @Ticketmaster Wow lol you’re kind of a tool huh? We aren’t scared of the Raptors. All I meant was Thybulle wouldn’t be able to play in the series if we played them which would be annoying much like yourself",
    "618": "@Raptors @TangerineHoops Please don't let Fred be anywhere near the arena these last few games",
    "619": "@Clapz23 @scarytrentjr @Raptors @pskills43 I am pretty sure by propaganda he means the \"Siakam for All-NBA\" campaign, like not in a negative connotation",
    "620": "@WATSOBR If they end up playing the Raptors in the 1st round, they can't play in Toronto due to Canada's restrictions",
    "621": "@EqualizerHuman1 @celtics @chicagobulls @BrooklynNets @ATLHawks @Raptors @religionofsport @OAnunoby This my favorite time of year bc it prompts irrational revulsion for some of my favorite cities in the world. F the @Raptors !",
    "622": "@Raptors @TangerineHoops WELCOME HOME @DGreen_14",
    "623": "@EqualizerHuman1 @gothamchopra @celtics @chicagobulls @BrooklynNets @ATLHawks @Raptors @religionofsport @OAnunoby First round exit",
    "624": "@JustEsBaraheni Yes, but only if the criterion works against Toronto.\nIf it works in favor of the raptors,  then it doesn't matter",
    "625": "@Raptors Lets Go @CapitalCityGoGo",
    "626": "@EqualizerHuman1 @celtics @chicagobulls @BrooklynNets @ATLHawks @Raptors @religionofsport Bro - we just went to OT in Toronto w/o Tatum, Brown, Al, and Time Lord. 🙄 Not afraid. 💁🏽‍♂️",
    "627": "@BuzzIlk @offwhiteferrari @Raptors @FredVanVleet he quite literally shot 12% fg and 7% from 3 https://t.co/kz5OQZwTSt",
    "628": "@Raptors Kawhi buzzer beater in the 2019 ECSF",
    "629": "@OpenGymAnunoby welcome to the club of Toronto-based lawyers who are raptors fans 🤝 congrats!",
    "630": "“Vaccine Advantage” ft The Toronto Raptors",
    "631": "@DEK_KingGaming @sixers @NBCSPhilly @975TheFanatic @Raptors @Ticketmaster If y’all are scared of the RAPTORS because Yal probably won’t have a guy that plays 20 minutes a game, you’re not a contender anyway so just give up any finals hopes you may have now before you get disappointed",
    "632": "Who Inspired Kobe Bryant to Score 81 Points Against the Toronto Raptors?\n#FantasticFacts\nhttps://t.co/DZL178QIz6",
    "633": "Would rather face the Bulls in the first round than the raptors since a couple players can’t play in a Toronto series",
    "634": "Boston Celtics would given those players wouldn’t be able to play the Raptors in Toronto but wouldn’t expect someone from indiana to get it https://t.co/VFlQwOo8OS",
    "635": "@MagneticTurtle9 @sixers @TSN1050Radio @MapleLeafs @DallasStars @Raptors @Sportsnet @FAN590 🎶Hello ... is it bling you're looking for?🎵 https://t.co/HQkTg0IY7B",
    "636": "@DalanoDimesV2 @Lubna545A @TSMDhaka @Raptors @TangerineHoops Fvv and we resting others as well just to keep them fresh for the playoffs",
    "637": "@megastarvc @Raptors 905 playoff reinforcements",
    "638": "@rapsfan902 @Raptors with deandre bembry on our bench https://t.co/4qiw8q2ukL",
    "639": "So while everyone was focused on @KyrieIrving not being vaccinated, the @sixers was hiding the fact that we have our own Kyrie in @MatisseThybulle. When we play the @Raptors in Toronto during the playoffs, he will be a spectator? No wonder he did not get traded to @BrooklynNets",
    "640": "@megastarvc @Raptors Sweep the bucks in the conference finals",
    "641": "Its slowly sinking in that the @Raptors are going to be a top 6 playoff team... the same team I personally yet respectfully wrote off prior to this season...",
    "642": "#latestnews GAME #80: Philadelphia 76ers (49-30) @ TORONTO RAPTORS (46-33) - 7:30pm (EDT) on SN 1 - https://t.co/WHdnHWHSua (POST_EXCERPT}",
    "643": "@Vo_Vision Smart played against raptors last month in Toronto",
    "644": "@DalanoDimesV2 @TSMDhaka @Raptors @TangerineHoops Because they are injured",
    "645": "@intangible_eth @DGreen_14 @Raptors @nbatopshot Pros/Cons of being on vacay\nPro: it’s 31 degrees in Mexico 🥵\nCon: missing the meet up 🥲",
    "646": "@MaxeyBetta @Raptors This ratio better troll 😹",
    "647": "@Raptors Hell yeah. https://t.co/lIMz3Wd7AT",
    "648": "u know what to do @Raptors https://t.co/Cg8i7pHLpQ",
    "649": "@TheNBACentral @GwashburnGlobe Uh oh… they cant play in Toronto if they see the Raptors first round",
    "650": "#RandomThoughts My sports alligences:\n* NBA - Neutral. Although I do usually have a soft spot for the Toronto Raptors. I might commit someday.\n* NFL - New York Giants\n* MLB - New York Mets\n* Soccer - Neutral",
    "651": "@alex6ixsports @sixers @TSN1050Radio @MapleLeafs @DallasStars @Raptors @Sportsnet @FAN590 After 3 years, Danny Green gets his ring",
    "652": "@rapsmuse_nba @Raptors Who’s beating us in 7 games?",
    "653": "Makes no sense why the league would let the Raptors play in Toronto if it effected visiting players https://t.co/mbkdbMjR0H",
    "654": "@Pluuuut0 @ValtGang @TheNBACentral @GwashburnGlobe Yea they did. Not worried tho. We almost beat raptors with gleague team. It’s only 3 games at most in Toronto IF we even play them. We will still have Tatum and no one is locking him up on Toronto",
    "655": "Celebration Season l Raptors Rundown pres. by Coors Light #Toronto #Raptors #NBA Video: https://t.co/rQ81aaLiV0",
    "656": "@DalanoDimesV2 @Raptors @TangerineHoops no really",
    "657": "LET'S GO 🔥 https://t.co/9vQSLYGTuy",
    "658": "@snrmlnc @espn @stephenasmith @nyknicks @sixers @Raptors @MatisseThybulle @ScottBarnes561 @JoelEmbiid Not vaccinated",
    "659": "Even whole expansion teams late 80s Miami Minnesota Charlotte Orlando &amp; in the 90s with the Vancouver Grizzlies &amp; Toronto raptors. So the league talent was washed down because teams could protect 7-8 guys but the rest can be selected in the expansion draft. Weakening top teams 🤷🏾‍♂️",
    "660": "Currently obsessing over #nba playoff seeding. For @celtics prefer 3 v @chicagobulls vs 2 v @BrooklynNets or @ATLHawks. But tanking last 2 could easily put us at 4 which means ascending @Raptors. But then vax issue!I know: focus on ourselves. But so much time! Cc @religionofsport",
    "661": "probably some legs that could use some resting tonight @Raptors https://t.co/cKD3VhDoXN",
    "662": "@Raptors are ELITE at forcing turnovers https://t.co/Rnd1J6FzsS",
    "663": "Saving the best for last tonight @dannygreen_7 gets his ring 💍 @Raptors #WeTheNorth https://t.co/PCIHwOed9X",
    "664": "@PHILABURNER7671 @mathiefflybulle @sixers @NBCSPhilly @975TheFanatic @Raptors @Ticketmaster @FoxNews @OANN Anti vaxx? Im a believer in \"real vaccines\" - go ask someone why THEY had to change the definition of what is \"considered\" a vaccine?  Goosh you are so clueless to whats going on",
    "665": "@Raptors @TangerineHoops Let's get a W",
    "666": "Almost three years after winning the 2019 title with the Toronto Raptors, Danny Green will finally receive his championship ring tonight at Scotiabank Arena",
    "667": "@TheNBACentral @GwashburnGlobe Toronto Raptors exposing everyone",
    "668": "@BklynGM @mathiefflybulle @sixers @NBCSPhilly @975TheFanatic @Raptors @Ticketmaster Don’t know if you noticed. This is a Sixers thread. All I care bout is basketball. \n\nGo talk to your anti vax people @FoxNews @OANN",
    "669": "RT: Raptors: Back at it tonight 🏀\n\nIt’s @TangerineHoops Raptors Game Day https://t.co/u2ZEDw6hRX @raptors @olgproline @NBACanada",
    "670": "#ROTY @ScottBarnes561 guards 1-5, plays ,1-5 for 5th playoffs team.. #BeGreat4 #ScottieROY @Raptors #WeTheNorth https://t.co/uYLamM7M1w",
    "671": "@PHILABURNER7671 @mathiefflybulle @sixers @NBCSPhilly @975TheFanatic @Raptors @Ticketmaster Fuk outta here if thats all you care about",
    "672": "Spotted in the wild @Raptors https://t.co/otPAVmwAL1",
    "673": "@BklynGM @mathiefflybulle @sixers @NBCSPhilly @975TheFanatic @Raptors @Ticketmaster Bro I don’t care about any of those players you talking bout. I don’t care about any of your vax opinions. \n\nWe’re going to miss our best perimeter defender for 3 games. He hurt the teams chances to win a championship. Period",
    "674": "GOOD MORNING RAPS FANS!\n\nFinal stretch.\n\n3 Games left.\n\nThe Chicago Bulls lost AGAIN last night to the Celtics. Which means Toronto now 1.5 ahead of Chicago.\n\n#Raptors vs 76ers tonight. Let's gain some momentum. BUT STAY healthy. And not show all our cards ;)\n\n#WeTheNorth https://t.co/2YMw3BWFnw",
    "675": "@BklynGM @mathiefflybulle @sixers @NBCSPhilly @975TheFanatic @Raptors @Ticketmaster you know we have to do the same shit to get into the US right",
    "676": "@PHILABURNER7671 @mathiefflybulle @sixers @NBCSPhilly @975TheFanatic @Raptors @Ticketmaster Did i say ALL players? U MUST do your research - go look at why Claxton had issues, what about Goodwin who cant play anymore? Exactly who are they u ask? U really think THEY want a Bron or Tom Brady collapsing? THEN ask why are Soccer players dropping? Follow the $$ my friend.",
    "677": "@TTWirePodcast Ofc the only time you want to talk about the Raptors is when its to trade one of them, honestly embarrassing. But ofc this will be ignored as usual. Made the playoffs 8 straight years in Toronto smh, won a chip in that time",
    "678": "@Raptors It’s always this one if you know you know #lifesgoodmoment https://t.co/gVD6trUjia",
    "679": "TONIGHT…Danny Green will receive his championship ring from the Toronto Raptors 💍 https://t.co/VO4jqqG45Y",
    "680": "Just noticed @BodogCA has the Toronto Raptors as the second most likely team to have Rudy Gobert next season at +650 🤷‍♂️ https://t.co/BpkFeOE40O",
    "681": "Toronto Raptors - Philadelphia 76ers\n\nBet slip link: https://t.co/DafgisbG6X\n\n#TorontoRaptors #Philadelphia76ers #yearnfinance #yfi #footballbetting https://t.co/r14We3mFFa",
    "682": "@BklynGM @mathiefflybulle @sixers @NBCSPhilly @975TheFanatic @Raptors @Ticketmaster Now we’re just making stuff up… ok if they all got fake cards why didn’t tisse get a fake card?",
    "683": "@Raptors @TangerineHoops Playoff preview lets get it",
    "684": "@espn @stephenasmith @Espngreeny @jj_redick @JalenRose Stephen shouted out @ScottBarnes561 as his ROTY, yessir! Top five in all categories among rooks, starting on a playoff team (not play-in or a lottery bound), and often defending the opponent’s best player on any given night. #ROTY #NBA75 #TheRaptors #WeTheNorth @Raptors @NBA #RoY",
    "685": "@PHILABURNER7671 @mathiefflybulle @sixers @NBCSPhilly @975TheFanatic @Raptors @Ticketmaster LOL you must love and believe the news - TRUST me folks did NOT take it - Ant Brown just got ratted out on by his ex-cook who knew he had a fake card - never question WHY NONE of the players came to Kyrie's defense? CUZ THEY ALL got cards fam - trust that - they stay silent.",
    "686": "@SandroW30 @Raptors @Ticketmaster Code please",
    "687": "@BklynGM @mathiefflybulle @sixers @NBCSPhilly @975TheFanatic @Raptors @Ticketmaster So experimental that the rest of the league got it with 0 issues. He hurt the team. period",
    "688": "The former #Toronto #Raptors guard #DannyGreen is expected to finally receive his 2019 Championship ring today. He is the last of the 2019 Raptors championship team to get his ring. https://t.co/EzqRfFN3hw",
    "689": "Celtics/Bucks tonight is going to be huge for deciding the No. 2 seed in the East but Sixers/Raptors is also important.\nToronto wraps up against the Rockets and Knicks, they should easily stay in the 5th spot. Boston should be rooting for them to beat Philly to stay ahead of them https://t.co/bIKZL1TAjY",
    "690": "NBA Basketball Game Betting Picks Simulator: 7:30 PM ET - Philadelphia 76ers vs. Toronto Raptors - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/3wxrFIzYib #nba #sportsbetting #freepicks #cappertek",
    "691": "@Raptors @TangerineHoops Win tonight!",
    "692": "@KevSacdalan @Raptors Yes can we sign Marc Gasol for a 10 day contract???😀",
    "693": "@Lubna545A @DalanoDimesV2 @Raptors @TangerineHoops OG and Trent will be resting, they are not on the betting sheets",
    "694": "@Raptors @TangerineHoops lets go lets continue to fight hard lets get it",
    "695": "@MaxeyBetta @Raptors @TangerineHoops Sixers are fraudulent",
    "696": "@sollo_raptor @Raptors @TangerineHoops Raptors need to win to try and avoid playing Bucks are Celtics in the 1st.",
    "697": "@DalanoDimesV2 @Lubna545A @Raptors @TangerineHoops Nick Nurse, the coaching staff, Masai, Bobby, the whole front office",
    "698": "@DalanoDimesV2 @Raptors @TangerineHoops Nah they resting players",
    "699": "Tonight hoops 🏀 @Raptors #WeTheNorth https://t.co/inmITmojPT",
    "700": "@sixers @NBCSPhilly @975TheFanatic @Raptors @Ticketmaster LET'S GO SIXERS",
    "701": "Consensus Line Move:\n2022-04-07 Philadelphia 76ers at Toronto Raptors from 0.00 to 1.50\n#Sixers in trouble\n#NBA #bettingonline #computerscience #invest",
    "702": "@EricStokesSzn6 @Raptors @TangerineHoops I do bozo",
    "703": "@Raptors @TangerineHoops We not resting fred?",
    "704": "@Raptors @TangerineHoops GTJ gonna expose Harden",
    "705": "@Raptors @TangerineHoops manifesting a toronto raptors win and for og to stay healthy jeez",
    "706": "Back at it tonight 🏀\n\nIt’s @TangerineHoops Raptors Game Day https://t.co/IrLiSW2gzx",
    "707": "Toronto Raptors https://t.co/V9ShwvdQDg",
    "708": "Philadelphia 76ers vs  Toronto Raptors Prediction 4/7/22 - Free NBA Picks https://t.co/NgvklYanJK via @YouTube",
    "709": "Toronto Raptors vs Philadelphia 76ers 4/7/22 NBA Picks, Predictions, Odds » Sports Chat Place https://t.co/9ZFs8HHDvb\n\n#NBA #NBAPick #FreePick #FreePicks #SportsBetting #ExpertPick #NBATwitter  #ExpertBettingAdvice #BettingTipster #Handicapper #SportsGambling #Wethenorth https://t.co/VCGRzBqGsP",
    "710": "Downtown Toronto gonna be a shit storm tomorrow\n\nJays home opener\nRaptors vs Houston (last home game til playoffs)",
    "711": "Mans can’t play in Toronto and they might face Raptors in first round. The Beard just can’t catch a break. https://t.co/18utsDKhRi",
    "712": "RICHIE: Danny Green FINALLY gets his 2019 championship ring in a special pregame ceremony at tonight's @Raptors game in #Toronto! 🤞 https://t.co/wowvi9skpY",
    "713": "Do you remember Danny Green?\n\nThe former Toronto Raptors guard is expected to finally receive his 2019 Championship ring today. \n\nHe is the last of the 2019 Raptors team to get his ring. \n\n#WeTheNorth @DGreen_14 https://t.co/R6J7Ew3hLB",
    "714": "@loveisourfiller @DerozanFan10 @ice_moke @RapsMuse @Raptors SVG and Tom Gores gutted the Pistons with horrible picks and trades. Cade is the leader of the Pistons and not just defensively.",
    "715": "@sixers @NBCSPhilly @975TheFanatic @Raptors @Ticketmaster There’s always something wrong with the Philadelphia 76ers",
    "716": "@loveisourfiller @DerozanFan10 @ice_moke @RapsMuse @Raptors What does that say about the raptors besides one season?? That they were a playoff team prior to Scottie?",
    "717": "@Raptors @pskills43 He looks like Kawhi Siakam 🏀",
    "718": "It’s game day‼️\n\n⏰: 7:30 PM\n📍: Scotiabank Arena\nVS: Toronto Raptors https://t.co/zungqygLlV",
    "719": "Toronto Raptors Game Night at SIA\n\n66% of the betting action at Sports Interaction like the #Raptors (+1) over the #76ers\n\nHere is our preview &amp; prediction:\nhttps://t.co/5KyJv8PlHX",
    "720": "@heretheycome215 @Elmoprods @sixers @NBCSPhilly @975TheFanatic @Raptors @Ticketmaster Am I wrong?",
    "721": "Ziti sports\n\nThe MLB season kicks off today. I am looking to have MY BIGGEST season ever. \n\nMLB\nMilwaukee Brewers -182 Chicago Cubs (2:20 PM)\nSan Diego Padres vs Arizona Diamondbacks OVER 9 -110 (9:40 PM)\n\nNBA\nPhiladelphia 76ers vs Toronto Raptors OVER 218 -110 (7:40 PM)",
    "722": "Matisse Thybulle was ruled ineligible to play against the Raptors on their road trip to Toronto. \n\nAs of Jan. 15, players need to be fully vaccinated to enter Canada.\n\nhttps://t.co/WksyE56BGU",
    "723": "@NBA @LAClippers @npowell2404 Powell. We miss you in Toronto. What a great team we had back then.... \n@Raptors  @npowell2404",
    "724": "@AdamKoffler I don’t think Canada enforced their mandate until January which is why he was able to play in the first game in Toronto earlier this season. But if 76ers/Raptors face off in the playoffs he won’t be able to play road games",
    "725": "Good article outlining why Matisse may be ineligible to play in Toronto. Very likely he’s the unvaccinated Sixer player. It will be interesting what he decides to do if the Sixers play the Raptors in the first round https://t.co/6lsj3dF7Y6",
    "726": "It's funny looking at the @espn pre-season predictions for the #Toronto @Raptors -- they predicted a 35-47 record:\n\nhttps://t.co/rqlYUlW0vZ\n\nwhereas the Raptors are at 46-33 with 3 games left to play! #NBA\n\nCheck how your team did, compared to what the 'experts' predicted!",
    "727": "@heretheycome215 @Elmoprods @sixers @NBCSPhilly @975TheFanatic @Raptors @Ticketmaster I’m literally not wrong😂 educate yourself on rights bub",
    "728": "@sixers @NBCSPhilly @975TheFanatic @Raptors @Ticketmaster People slandering my guy Tisse lookin like: https://t.co/NCPI65TNiU",
    "729": "The Sixers are the better team, but I absolutely hope the Raptors get them in the first round. Feel like Boston and Milwaukee may just roll over Toronto, andg Philadelphia has at least a 20% chance of implosion.",
    "730": "@sixers @NBCSPhilly @975TheFanatic @Raptors @Ticketmaster Good to see we’ll be playing this important game at full strength. 🙄 Thanks, Matisse.",
    "731": "@PHILABURNER7671 @mathiefflybulle @sixers @NBCSPhilly @975TheFanatic @Raptors @Ticketmaster Cuz he didnt take the experimental shot my guy",
    "732": "@maxeysburneracc @Elmoprods @sixers @NBCSPhilly @975TheFanatic @Raptors @Ticketmaster Yes it is. And it’s a selfish and ignorant one.",
    "733": "@Cantguardbeard Didn't the @Raptors crush them a couple weeks back?",
    "734": "@DrGuru_ THE TORONTO RAPTORS ARE THE 2022 NBA CHAMPIONS 😎",
    "735": "Consensus Line Move:\n2022-04-07 Philadelphia 76ers at Toronto Raptors from 219.00 to 220.00\nOver that's crazy\n#NBA #parlay #pythonprogramming #lifestyle",
    "736": "@sixers @NBCSPhilly @975TheFanatic @Raptors @Ticketmaster Right now we're lined up to play the Raptors 1st round. That's not good",
    "737": "@sixers @NBCSPhilly @975TheFanatic @Raptors @Ticketmaster Tell Matisse to get fully vaccinated",
    "738": "@cu86grad @Raptors Good morning Bro!! Thank you!! I hope you have a beautiful day too!! ☕☕❤☺☀️🤗",
    "739": "Not much on the line as @Raptors play the @sixers tonight in their last tilt before #NBAPlayoffs. \n\n#Raptors #Sixers #NBA #TimAndFriends @timandfriends @tim_micallef @jesserubinoff @LeoRautins @Matt__Devlin @Kayla_Grey @KayNurse11 @HelloooJack https://t.co/EGKehdY0eN",
    "740": "@sixers @NBCSPhilly @975TheFanatic @Raptors @Ticketmaster Three (3) important reasons why Joel Embiid should win the MVP:☑️\n    - \n    -\n    -\n\nWell deserved😤💯",
    "741": "@Elmoprods @sixers @NBCSPhilly @975TheFanatic @Raptors @Ticketmaster It’s his choice",
    "742": "@julijays @Raptors Good morning Sis! Happy Game Day. Have a beautiful day. ☕️☕️♥️🤗☀️🏀",
    "743": "Nike City OVO Toronto Raptors Authentic Scottie Barnes Jersey 48 L Diamond Logo https://t.co/dQ6caYcaec eBay https://t.co/R6ULHA9lWE",
    "744": "Happy @raptors game day!! Philly is in town and Danny G finally gets his championship ring!!!🙌❤🏀🙌❤🏀 #WeTheNorth https://t.co/D3bRyRcu9S",
    "745": "Good morning everyone especially Sixers fans!  Drinking coffee and hoping for a Sixers win tonight in Toronto. Raptors are well coached and a tough matchup for the sixers. Would be a good game for Harden to go off. https://t.co/2oOrSEWL9l",
    "746": "#TBT Five years ago, I ran into @superfan_nav after a Raptors game. It was Toronto’s last game at The Palace https://t.co/WE6SQNkIMA",
    "747": "@intangible_eth @TheJurassicPack @DGreen_14 @Raptors @nbatopshot Damn missed this thread. I will be keeping eye out for next game you guys go to. Just live near Hamilton and would love to Link up for a game!!",
    "748": "@donjuanhiphop25 @LoLAllenL @enra6ed @Raptors @ScottBarnes561 can you repeat that in English",
    "749": "@BklynGM @mathiefflybulle @sixers @NBCSPhilly @975TheFanatic @Raptors @Ticketmaster Dogg what? I just want this dude available for every game. The rest of the team is good to to go. Why is he the exception?",
    "750": "@RGK91605631 @loveisourfiller @ice_moke @RapsMuse @Raptors Despite all the injuries (forgot to mention Achiuwa missed 9), we’re still 5th in the East and Scottie had a lot to do with that.  He kept the ship afloat.",
    "751": "@PompeyOnSixers @YouTube I think, the Sixers will survive a series against the Raptors, even without Tisse playing in Toronto. For me it's more important: Why doesn't he talks about his decicion being unvaccinated? It's his decicion, fine but he should stand for.\nNow it's not cool to learn it this way.",
    "752": "@GraceKroboth @BklynGM @mathiefflybulle @sixers @NBCSPhilly @975TheFanatic @Raptors @Ticketmaster I’ve seen players play on broken legs, toes, torn meniscus, strained calf’s. Y’all talking bout getting vaxed… I’m not tryna hear it.",
    "753": "@DerozanFan10 @loveisourfiller @ice_moke @RapsMuse @Raptors You would be at 49 wins three more than you are now.",
    "754": "@sixers @NBCSPhilly @975TheFanatic @Raptors @Ticketmaster Don't care if we win, just wanna see us play well. Who knows if winning or losing gets us a better 1st round match up at this point",
    "755": "Happy Born Day to my little brother, @julian_nieva !!! This was our last game together, when Vince played his last game. I hope we can go to a @Raptors game together soon. #WeTheNorth https://t.co/kDJE0XNVrT",
    "756": "@RGK91605631 @loveisourfiller @ice_moke @RapsMuse @Raptors @Raptors starting 5 only played 17 games together this year.  That’s only 20% of the regular season.  Fred missed 14, Pascal missed 13, GTJ missed 12, OG missed 32(!) games and Birch missed 27.  We’re so damn lucky to have a versatile rookie in Scottie who can play any position.",
    "757": "@Ramyy23 @Raptors @ScottBarnes561 @AlaaRetima @sabriibelaid 3a scholes",
    "758": "@PHILABURNER7671 @mathiefflybulle @sixers @NBCSPhilly @975TheFanatic @Raptors @Ticketmaster Who cares? Lol what an ignorant comment , keep acting like nothing is wrong and hope nobody u know drops dead from a \"sudden death'.......",
    "759": "NBA Basketball Game Betting Picks Simulator: 7:30 PM ET - Philadelphia 76ers vs. Toronto Raptors - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/3wxrFIRzGL #nba #sportsbetting #freepicks #cappertek",
    "760": "@BklynGM @mathiefflybulle @sixers @NBCSPhilly @975TheFanatic @Raptors @Ticketmaster Shut up. Who cares about effects or whatever. Losing a starter for 3 games is unacceptable considering that our bench is short as is.",
    "761": "@G_Marie215 @sixers @NBCSPhilly @975TheFanatic @Raptors @Ticketmaster I can't,  I'm working",
    "762": "@mathiefflybulle @sixers @NBCSPhilly @975TheFanatic @Raptors @Ticketmaster I mean he's smart not to be.....and Canada is stupid for having a mandate for something that clearly doesn't work as even the cdc and ceo of Pfizer admitted.....I mean shit data itself shows natural Immunity is more effective plus the Adverse events are horrendous",
    "763": "@sixers @NBCSPhilly @975TheFanatic @Raptors @Ticketmaster For most…..",
    "764": "@sama Scottie Barnes, at a packed euphoric Scotiabank arena, in a Toronto Raptors jersey, triumphantly raising the Larry O'Brien NBA Championship Trophy, surrounded by his ecstatic teammates.",
    "765": "@sixers @NBCSPhilly @975TheFanatic @Raptors @Ticketmaster Let’s go! ❤️💙",
    "766": "#latestnews WAKE UP, IT'S GAMEDAY! Your playoff-bound Toronto Raptors take on the Philadelphia 76ers tonight at 7:30pm at Scotiabank Arena - https://t.co/xV4Qv0d4vo (POST_EXCERPT}",
    "767": "PHILLADELPHIA 76SIXERS vs\nTORONTO RAPTORS, 7:30PM.",
    "768": "@Raptors Eliminating Philly in the 2019 playoffs",
    "769": "@sixers @NBCSPhilly @975TheFanatic @Raptors @Ticketmaster Rare L for Matisse",
    "770": "@donjuanhiphop25 @Sytherr @Raptors @ScottBarnes561 Raptors starters only played like 18 games together this season lol",
    "771": "Philadelphia 76ers vs Toronto Raptors: Injury Report, Starting 5s, Betting Odds &amp; Spreads - April 7th, 2022 | NBA Season 2021-22 https://t.co/iotzFIXs16 #NBA #Basketball",
    "772": "@dinghbhappy @sixers @NBCSPhilly @975TheFanatic @Raptors @Ticketmaster Historically it’s not looking good bro 😭",
    "773": "@sixers @NBCSPhilly @975TheFanatic @Raptors @Ticketmaster Come on, beat the Raptors",
    "774": "@2Adult2Person @sixers @NBCSPhilly @975TheFanatic @Raptors @Ticketmaster Not vaxxed according to these comments",
    "775": "@sixers @NBCSPhilly @975TheFanatic @Raptors @Ticketmaster Need Embiid to drop 40 again",
    "776": "@sixers @NBCSPhilly @975TheFanatic @Raptors @Ticketmaster Get Matisse To the CVS",
    "777": "@sixers @NBCSPhilly @975TheFanatic @Raptors @Ticketmaster Gon be a tough game",
    "778": "@sixers @NBCSPhilly @975TheFanatic @Raptors @Ticketmaster tell tisse to get vaccinated",
    "779": "🚨 Line Change 🚨\n\nPhiladelphia 76ers @ Toronto Raptors\nThu 7:40 PM EST\n\nFrom:\nTOR -1.0 -110\n\nTo:\nTOR 1.0 -115",
    "780": "GAME DAY 🆙 NORTH. \n\n🕖7:30PM\n📺@NBCSPhilly \n📻@975TheFanatic\n🎙️https://t.co/7sb9wW6SKL                      \n🏀@Raptors \n\nPres. By @Ticketmaster https://t.co/v9o62KFuEc",
    "781": "Consensus Line Move:\n2022-04-07 Philadelphia 76ers at Toronto Raptors from 218.00 to 219.00\nOver adjust quickly\n#NBA #sports #technology #realestateagent",
    "782": "Consensus Line Move:\n2022-04-07 Philadelphia 76ers at Toronto Raptors from -1.50 to 0.00\n#Sixers kryptonite on a stick\n#NBA #sportsbettingadvice #deeplearning #stock",
    "783": "@BurgarMatthew @b0nerpills @NBA @Raptors How does it feel gettin owned by the Raptors?",
    "784": "@drawthenorth @ScottBarnes561 @Raptors So the ROY is selected by a panel of United States and Canadian sportswriters and broadcasters.  What are the chances of a Cdn candidate being voted in.  US media is quite dismissive of the Raptors team no matter how good they are!!  #ScottieBarnesROY",
    "785": "@DerozanFan10 @loveisourfiller @ice_moke @RapsMuse @Raptors You ignore the fact you have two all stars and Cade has been playing without Jerami Grant basically all year. Super Reach there Stretch. Lol",
    "786": "@RGK91605631 @loveisourfiller @ice_moke @RapsMuse @Raptors You ignore the fact that Barnes took over the spots of Van Vleet, GTJ, OG, Pascal and Birch when they were injured.  Without Barnes’ versatility, we would probably be fighting for a play-in or not at all.",
    "787": "@Raptors Kawhi Leonard buzzer beater #WeTheNorth https://t.co/Yv2txF9WcW",
    "788": "@DerozanFan10 @loveisourfiller @ice_moke @RAPSMUSE @Raptors Maybe this is why your are at number three on the leaderboard . Thanks for bringing this to light.",
    "789": "It’s hard to believe how tight the Eastern Conference really is, here’s another look at what’s going on. If the standings hold up, we are seeing a first round preview with the Toronto Raptors tonight… https://t.co/5K2upbevwp",
    "790": "@DerozanFan10 @loveisourfiller @ice_moke @RAPSMUSE @Raptors With Barnes the raptors would have won 58 games without Barnes 49. Tell me what the variance is between Cade and Barnes?",
    "791": "The Philadelphia 76ers will wrap up their 3-game road trip on Thursday when they take on the Toronto Raptors.  https://t.co/7jqzcWDuXf",
    "792": "@DerozanFan10 @loveisourfiller @ice_moke @RAPSMUSE @Raptors So with Cade they would have won 26 games and without 14.",
    "793": "Thu, 7th Apr: #TorontoRaptors vs #Philadelphia76ers - ODD @ 2.01\nMore details on: https://t.co/8SHdJmDG8k\n#baskettips #basketprediction #basketballbets #nba #usabasket",
    "794": "@Raptors Too obvious.... Kawhi buzzer beater game 7 of course....",
    "795": "The Atlanta Hawks lost to the Toronto Raptors in less than three minutes https://t.co/LlAmZkqN64",
    "796": "The Atlanta Hawks lost to the Toronto Raptors in less than three minutes https://t.co/QO61GzecK2",
    "797": "@NBA recent rankings do not reflect reality. Do you even watch the raps games? \n\n@ScottBarnes561 for #ROTY and its not particularly close. \n\n@Raptors keep up the good ScottieRoy PR campaign!",
    "798": "@rcoh23 @notorioustei And here’s Sixer Danny Green in Toronto last night saying the Raptors  have a “vaccination advantage” over Philly right after Thybulle’s status was announced. He was doing a live recording of his podcast so this should come out soon on those platforms. Seems like a confirmation https://t.co/2ujS7j2P2h",
    "799": "@DerozanFan10 @loveisourfiller @ice_moke @RAPSMUSE @Raptors Do Scottie Barnes",
    "800": "@BGeltzNBA \n@SiriusXMNBA\nDanny Green gets his 2019 championship ring tonight vs Raptors \n1st time back in Toronto with fans!",
    "801": "'How will Matisse Thybulle's absence impact the Philadelphia 76ers in Thursday's game vs the Toronto Raptors?' by Locked On 76ers - Daily Podcast On The Philadelphia Sixers https://t.co/oLhulmJRdC",
    "802": "@MapleLeafs what is going on with the music and energy in the Maple Leafs Arena it's so dull Raptor games are full of energy and entertainment even the music sucks.Nashville Predators type goal songs needed in Toronto not the crap we listen to now. Please address this ASAP OMG.",
    "803": "@GarrettGross20 @offwhiteferrari @Raptors But I bet you love watching Vince miss in 2001….",
    "804": "Toronto Raptors Atlanta Hawks Cleveland Cavaliers playoffs https://t.co/NLcBP9i5Xu",
    "805": "@sp_136_Rp @offwhiteferrari @Raptors Sixers fan here, I was tired of it after watching it live",
    "806": "@Jelou71268269 @Raptors @ScottBarnes561 @AlaaRetima @sabriibelaid 3a chkoun yahki",
    "807": "@ScottBarnes561 @Raptors @SunLifeCA ROTY of the NBA and MVP of Charisma",
    "808": "@isTrashAccount @LoLAllenL @enra6ed @Raptors @ScottBarnes561 lebronto we own y’all y’all a first round exit with all your players talk to us at full we’ll sweep y’all at full easily we at we’re we at cause of injuries",
    "809": "@Sytherr @enra6ed @Raptors @ScottBarnes561 Collin out for the season Rubio out for the season Allen out for two minths total garland was out a month in a half total okoro was out for a month like are three best players only played 40 damn games together stop",
    "810": "What you think? @FredVanVleet @npowell2404 @Raptors. Once you understand the grind then you can bet on yourself #BetOnYourself #UnderstandTheGrind https://t.co/YEwKTdTrP4",
    "811": "Toronto Raptors 2022 NBA Playoffs Hype T-shirt https://t.co/wY6wgKz3xb https://t.co/OjIuyDkquP",
    "812": "@PodvalicNFT @ThePlagueNFT @rimbikd @A_Pons_Asinorum Toronto Raptors Jersey! NEED! Repping The 6ix!",
    "813": "FREE #livestream here👉https://t.co/2c6Ltzn7d4 😉\n——\nApr.7, Thu.\n🏀#NBA ‼️\n1.Charlotte Hornets Vs Orlando Magic\n2.Milwaukee Bucks Vs Boston Celtics\n3.Toronto Raptors Vs Philadelphia 76ers\n4. New Orleans Pelicans Vs Portland Trail Blazers",
    "814": "@DetroitBabalawo @DerozanFan10 @RugalBossB @NBA @AschNBA @Raptors KD, Jayson Tatum, LeBron, Dwade and Beal all gave high praise to scottie there are more too",
    "815": "@Spinandwin007 @JBick21 @James_Krampiii @DrazeExperience Lebron played d rose and the bulls. How many hof on that team. Or Paul George and the pacers 2 years to get to the finals. How many hof on that team? Toronto raptors. How many hof on that team. He beat the Celtics with Isiah Thomas as the lead dog. Or the Atlanta hawks 🤣🤣🤣",
    "816": "@Raptors Scottie Barnes is the first rookie since Luka Doncic and only the 22nd rookie in NBA history to average over 15 points, 7 rebounds, and 3 assists in a season. \n\nEvery single rookie to achieve that over the last 10 seasons has won ROTY.",
    "817": "@taariq_aziz21 @Raptors @abusites_ @ABUZaria_DUA @ABUSRC_media Happy birthday to Coachie 🏀",
    "818": "🏆🎉 @Raptors secure playoff spot &amp; @RidersBball secure BBL championship in back to back nights 🏆😍 GO SPORTS! #WeTheNorth  #champions  #BritishBasketball #nba",
    "819": "@DrGuru_ Toronto Raptors",
    "820": "🏀NBA🏀\n🏀Saison régulière🏀\n\nAtlanta Hawks - Washington Wizards\nChicago Bulls - Boston Celtics\nUtah Jazz - Oklahoma City Thunder\nLos Angeles Clippers - Phoenix Suns\nCharlotte Hornets - Orlando Magic\nToronto Raptors - Philadelphia 76ers\nMilwaukee Bucks- Boston Celtics",
    "821": "@Raptors @ScottBarnes561 @paulzeus98 mates",
    "822": "#Toronto #Raptors: ALL-#NBA type of numbers ... \n \nhttps://t.co/aaojxAywB3\n \n#Basketball #NationalBasketballAssociation #NBAEasternConference #NBAEasternConferenceAtlanticDivision #Ontario #TorontoRaptors https://t.co/nqjqxCoKDk",
    "823": "We will have more exclusive passwords for you right here Toronto Raptors, Florida Panthers. Shawn Mendes, Backstreet Boys and More ...\n\nStay Tuned with us while we bring you the presales for your favorite sport and concert events including festivals",
    "824": "Philadelphia 76ers vs Toronto Raptors Match Preview, Prediction, Betting Odds &amp; Spreads - April 7th, 2022 | NBA Season 2021-22 https://t.co/ubgH89VUxI #NBA #Basketball",
    "825": "@Raptors boink boink boink boink...W! Everyone knows this, the 4 bounces, period.",
    "826": "76ers' Matisse Thybulle listed as 'ineligible to play' against Raptors in Toronto\n                     \n                                                https://t.co/SdDPGdrX2y",
    "827": "@Raptors The steep decline from Embiid airplanes wing to literal tears on the way to the locker room. https://t.co/dFOfejaiwu",
    "828": "@Raptors #5 in the eastern conference and some people still have the audacity to say raptors suck lmao stupid haters #WeTheNorth https://t.co/9PXwNVPgPy",
    "829": "@CharlieKime1 @espn @stephenasmith @nyknicks @sixers @Raptors @MatisseThybulle @ScottBarnes561 @JoelEmbiid Why Matisse is ineligible?",
    "830": "@TimBontemps Same rule for @Raptors players entering United States - they’re just smart enough to be vaccinated",
    "831": "@Raptors @McBlunt1 Kawhi game winning shot",
    "832": "Let's go on the 2nd guess\n#poeltl #nba #toronto #Raptors https://t.co/idzNnI9t4J",
    "833": "Or Memphis gets Jazz\nToronto gets Grizzlies\nUtah gets Raptors\n\nWould also accept straight across jazz for Grizzlies",
    "834": "Trade idea...\nMinnesota gets the name Lakers\nLA gets the name pelicans\nNew Orleans gets the name Jazz\nToronto gets the name Timberwolves\nUtah gets the name Raptors.",
    "835": "@ScottBarnes561 @Raptors @SunLifeCA Longest arms EVER",
    "836": "@RugalBossB @NBA @AschNBA @Raptors @KendrickPerkins And to say that during a Pistons game makes it even funnier.",
    "837": "@RugalBossB @NBA @AschNBA @Raptors @KendrickPerkins Listen to Stephen A Smith towards the end.  I'm shocked he got something right this time LOL! https://t.co/6f7nxsHivp",
    "838": "@stephenasmith has made public that his vote goes to @ScottBarnes561 for #ROTY.  @Raptors https://t.co/6f7nxsHivp",
    "839": "@Raptors Game 7 Semifinals when Kawhi hit the game winning shot to advance to the Eastern Conference Finals!",
    "840": "@paraaand Yes yes yes @Raptors lets do this already\n@SimuLiu",
    "841": "@bballbreakdown would thybulle missing road games in a Philly Toronto series lead to a raptors win https://t.co/MJb4xd5aPL",
    "842": "@loveisourfiller @RGK91605631 @ice_moke @RAPSMUSE @Raptors Pistons record (without or with Cade):\n3-14: 18% \n20-43: 32%\nCurrent record is 23-57 with 2 gms left. Win both gms= 25-57.\n\nAssume Cade plays all 82 gms. Applying the same 32%,  Pistons would have won:\n\n32% of 82 = 26 games (26-56 vs 25-57).\n\nWith or w/o Cade, same result. 🤣",
    "843": "Matisse Thybulle is ineligible to play in Toronto on Thursday because he is not vaccinated. \n\nIf the season ended today, the Philadelphia 76ers would play the Toronto Raptors in the 1st round of the playoffs. \n\nThoughts? 🤔 https://t.co/JtPfRM5KtP",
    "844": "@CharlieKime1 @stephenasmith @espn @ScottBarnes561 @Raptors Is there a clip",
    "845": "@NoahLevick Dumbass if we will play the Raptors in 1st round. If 76ers wont get vaccinated in Toronto",
    "846": "@Raptors When we narrowly beat Seventy sixers in Game 7!  Beat the Seventy sixers!",
    "847": "76ers' Matisse Thybulle listed as 'ineligible to play' against Raptors in Toronto\nhttps://t.co/ZC2MKfNYZs",
    "848": "@MarxGasol it’s still a crock that the raptors didn’t get a 75th anniversary jersey and they didn’t even hold the game in Toronto",
    "849": "@Raptors @MLSEFoundation Explain what you mean by systemic and societal barriers, Toronto raptors. Go into detail about these barriers and these people who are facing them. You said systemic so we need proof to back up your post.",
    "850": "@espn thanks for the @ATLHawks @WashWizards highlights during @SportsCenter LA except you showed @ATLHawks @Raptors highlights! No love for the A!",
    "851": "Matisse Thybulle will be ineligible to play in Toronto tomorrow due to him not being vaccinated.\n\nIf the season ended today, the 76ers would face the Raptors in the first round of the playoffs… https://t.co/lH7dMWKApw",
    "852": "@Avi_inb @ScottBarnes561 @michaelgrange @Eric__Smith @SmrtAsh Agreed!! Like I said Toronto not sexy and not sure voters have watched 10 complete Raptor games all season. His impact is undeniable if you are watching games",
    "853": "@Marilyn0926 @RAPSMUSE @AschNBA @Raptors If they haven't watched Marilyn they definitely have",
    "854": "@Raptors Hands Down https://t.co/GzLb948aVJ",
    "855": "@RGK91605631 @DerozanFan10 @ice_moke @RAPSMUSE @Raptors raps clinched the playoffs this yr after getting roty caliber player in scottie barnes the one yr out of 9 they suck",
    "856": "@Raptors IDK, might have something to do with the fun guy hitting a super crazy shot over Simmons in game 7...",
    "857": "@Paul__Jones @RAPSMUSE @AschNBA @Raptors They’ve missed out on a Wonderful Season by this Young Man!",
    "858": "Leon's is giving YOU a chance to bring home a piece of Toronto Raptors franchise history! Enter to win a one-of-a-kind coffee table, made from a piece of the 25th Anniversary “95 Rewind Court”! Don’t miss your chance to enter! https://t.co/j6FsEFIB4S",
    "859": "@RAPSMUSE @AschNBA Because the @Raptors aren't sexy and voters probably haven't watched 10 complete games all season ....LOL",
    "860": "@heydb always giving the @Raptors love when talking about coach of the year for Nick Nurse, all team for Fred Van Vleet and Pascal Siakim. #WeTheNorth https://t.co/28l8Fo4Kgl",
    "861": "@Raptors Any other answer is wrong \n\n“THE SHOT” https://t.co/XXmrX7AK4v",
    "862": "@JacobPacheco6 Kids that grew up around Toronto while the Leafs were garbage just weren’t Leaf fans. Instead they cheer for Washington, Pittsburgh, Chicago, Boston, and other teams like that.\n\nEveryone from around Toronto is a Raptor because they are a model franchise, and don’t make their…",
    "863": "@donjuanhiphop25 @FranticRise @enra6ed @Raptors @ScottBarnes561 We had all our players for only 19 games, man",
    "864": "@NevaCared_FN @SimuLiu @Raptors 11 likes to ur one “no” says otherwise",
    "865": "Can we get the @MapleLeafs @Raptors to do a switcheroo \n\nLeafs play basketball \nRaptors play hockey \n\nIt would be very fun to see @MLSEPR",
    "866": "@DerozanFan10 @loveisourfiller @ice_moke @RAPSMUSE @Raptors How many titles do you have?",
    "867": "@Raptors Kawhi game 7 game winner of course. 🔥🔥🔥",
    "868": "@donjuanhiphop25 @LoLAllenL @enra6ed @Raptors @ScottBarnes561 make the playoffs first",
    "869": "@Sportsnet @Raptors Well said, he's a pretty good interview.",
    "870": "raptors playoff tickets secured. i’d like to thank chris paul for only coming to toronto during the covid wave that led me to the refund that paid for these tickets. he always comes thru for me ❤️",
    "871": "@TbirdTr3y_10 @ScampySummers Trey did I ever tell you that my neighbour gentleman took us to see Kobe Bryant's final basketball match In Toronto.  Everyone was cheering for him and not for The Raptors.",
    "872": "Been saying @Raptors are on the S tier for best ran franchise, top to bottom👏🏾 https://t.co/xoFbOZzfed",
    "873": "@isTrashAccount @LoLAllenL @enra6ed @Raptors @ScottBarnes561 lmao ok we snaked y’all three times sit down",
    "874": "Consensus Line Move:\n2022-04-07 Philadelphia 76ers at Toronto Raptors from 215.50 to 217.50\nOver snake in the weeds\n#NBA #sportsbetting #ai #stock",
    "875": "4/7\n\nNBA \n\nToronto Raptors ML -125.   1 Unit\n\nNHL \n\nDallas Stars +115.    2 Units \n\n🍀🍀🍀🍀🍀🍀",
    "876": "Our Toronto Raptors are in fifth place thanks to the Boston Celtics.  #WeTheNorth",
    "877": "Kawhi choose the clippers with not even half the players LeBron had coming to the lakers. Everyone had high hopes for Kawhi bc he just came off a championship with the raptors. If he stayed in Toronto he would have won again. Not to mention he’s literally been injured https://t.co/KuEQGlf6DE",
    "878": "There is no Raptor player I dislike. Of course the team can get better, but I like the culture of this team. #Toronto #RTZ",
    "879": "@ScottBarnes561 @Raptors @SunLifeCA Your biggest fan here Scottie!!! Would love to see you play live. Please send tickets man that would be amazing. Or autograph jar of peanut butter and jam haha",
    "880": "@SagED_UP #WeTheNorth The Toronto Raptors ❤🖤",
    "881": "@donjuanhiphop25 @LoLAllenL @enra6ed @Raptors @ScottBarnes561 and still owns that lob merchant in Cleveland",
    "882": "@FranticRise @enra6ed @Raptors @ScottBarnes561 we were injured all four buddy what’s your point had most of your players all year we only had all our players for 25 games after injures all year stop",
    "883": "@isTrashAccount @LoLAllenL @enra6ed @Raptors @ScottBarnes561 barnes is the fifth best player on the raptors lmao stop it",
    "884": "The LA Clippers gave up 9 points in the second quarter. It's the fewest points they've allowed in a quarter since giving up 8 to the Toronto Raptors in the third quarter on November 22, 2015.",
    "885": "Thursday April 7, 2022\n\nDanny Green FINALLY gets his 2019 Toronto @Raptors NBA Championship ring.\n\nNo speaker fires. No new pandemics. No   alien invasions.\n\nDanny Green will get his ring no matter what.\n#WeTheNorth #WeTheChamps https://t.co/EQgOUtwXmV",
    "886": "@intangible_eth @TheJurassicPack @DGreen_14 @Raptors @nbatopshot Got to connect with you guys!",
    "887": "@Raptors Thinking about Embiid regretting his airplane wave celebration!",
    "888": "@Raptors @pskills43 Check the stats. The eye test is too obvious.",
    "889": "🙏RETWEET https://t.co/rIVQU29Qta story Who is your dark horse championship contender? 💍 \n\nI got the Toronto Raptors 🦖 https://t.co/TO0pD1sp7O",
    "890": "Tomorrow night @sixers vs @Raptors #WeTheNorth",
    "891": "@Raptors @ScottBarnes561 All good, but I don’t and neither does any Raptors fan, need Lebron’s validation of Scottie to know Scottie’s got game. Masai knew what he was doing and I love him for it!",
    "892": "WHAT is @ESPN doing w. Rookie Ladder?? Mobley is OUT and still #1? Are you kidding me?? All Barnes has done in his last 4 games: 19/14, 19/7, 19/8, 17/5!! And you don't move him up?!? Look at the adv stats too! Raps have made the playoffs thanks to him! @NBAonTNT @NBATV @Raptors",
    "893": "Philadelphia 76ers guard Matisse Thybulle is listed as \"ineligible to play\" for Thursday's game against the Toronto Raptors in Toronto.",
    "894": "@Eric__Smith @Raptors @BlueJays @MapleLeafs  looking at you guys",
    "895": "@johndoe63460857 @AndrewRiffe1 @SDeslippe ok but why over the last 20 games Raps defense is better?  \n\nBest Team Defensive Rating By Their Last 20 Games:\n\nMemphis Grizzlies - 109.7\nToronto Raptors - 109.9\nBoston Celtics - 111.7\nPhoenix Suns - 112.0\nOrlando Magic - 112.1",
    "896": "@donjuanhiphop25 @LoLAllenL @enra6ed @Raptors @ScottBarnes561 unrelated + Lobley is a Jarrett Allen merchant",
    "897": "They want Chicago. It would be real funny tho if they ended up playing the Raptors and Jaylen Brown couldn’t play in Toronto https://t.co/gfW1puoPb7",
    "898": "@EddieSwantek @JClarkNBCS @NBCPhiladelphia @NBCSPhilly Kyrie Irving cannot play in Toronto either. If the Nets play the Raptors he’d be ineligible in 3 of the 7 games too.",
    "899": "@Raptors @Bell #PLAYOFFS2022 clinched @Raptors #WeTheNorth",
    "900": "@RGK91605631 @loveisourfiller @ice_moke @RAPSMUSE @Raptors Against KD 😂😂😂 https://t.co/biROcXBzFK",
    "901": "@RGK91605631 @loveisourfiller @ice_moke @RAPSMUSE @Raptors I’m not going to use the word “joke” if I’m a Pistons fan.",
    "902": "Interesting news on Matisse Thybulle today. His \"ineligibility\" to play in Toronto is a sure sign he's unvaccinated.\n\nThe Toronto Raptors should really be aiming for the 4-5 Playoff matchup with the Philadelphia 76ers now. Beating them tomorrow will go a long way to secure that.",
    "903": "@johndoe63460857 @AndrewRiffe1 @SDeslippe This is the definition of facts and unbiased😅\n\nBest Team Defensive Rating By Their Last 20 Games:\n\nMemphis Grizzlies - 109.7\nToronto Raptors - 109.9\nBoston Celtics - 111.7\nPhoenix Suns - 112.0\nOrlando Magic - 112.1\nMiami Heat - 112.6",
    "904": "@Raptors That is all.. #WeTheNorth https://t.co/Vi1gRMmlXz",
    "905": "@intangible_eth @PackripEwing @DGreen_14 @Raptors @nbatopshot Really dope!",
    "906": "@ScottBarnes561 @Raptors @SunLifeCA #Spice n #rook fitness for #Playoffs2022 @pskills43 @ScottBarnes561 🤣🤣",
    "907": "@DerozanFan10 @loveisourfiller @ice_moke @RAPSMUSE @Raptors Against the joke of the lakers.",
    "908": "The @Raptors team are the scariest team in the east.",
    "909": "@chicagobulls, @raptors, @utahjazz and @warriors got the spot in the playoffs https://t.co/MU5WU3EKma",
    "910": "@RGK91605631 @loveisourfiller @ice_moke @RAPSMUSE @Raptors An efficient 14/21 from the field by the way, which is rare for Cade.",
    "911": "@JabarTuzo don’t matter about the rest, just flagging @Raptors 🔥🔥🔥",
    "912": "@theScore @Raptors Which other teams can claim this?",
    "913": "@RGK91605631 @loveisourfiller @ice_moke @RAPSMUSE @Raptors Over 30 against Lebron good enough? 😂 https://t.co/Vf4JqhnI9p",
    "914": "Looking forward to #NBAPlayoffs and seeing our boys wash out these #washed #frauds who are scared to play us in our house 🇨🇦 #WeTheNorth  @Raptors",
    "915": "@Clapz23 @scarytrentjr @Raptors @pskills43 Exactly. These propaganda people are weird af on this app",
    "916": "@DerozanFan10 @loveisourfiller @ice_moke @RAPSMUSE @Raptors Wow three threes. 19 pts wow. I’ll give you 14 rebounds. When he gets over 20 let me know",
    "917": "If the NBA Playoffs began today: \n\nEastern Confrence: \n1️⃣ Miami Heat\n8️⃣ Brooklyn Nets\n\n2️⃣ Boston Celtics\n7️⃣ Cleveland Cavaliers\n\n3️⃣ Milwaukee Bucks\n6️⃣ Chicago Bulls\n\n4️⃣ Philadelphia 76ers\n5️⃣ Toronto Raptors",
    "918": "@mxtina88 Awww….🥰🥰 hope we can exchange something then. Some Canadian memento perhaps? Toronto Raptors hat? Maple leaf syrup? Lol let me know 😊😊",
    "919": "Pretty damn impressive season for the Toronto Raptors.\n\nAmazing what playing in legit home games can do for a team.\n\nWe'll look back in appreciation of that COVID-mulligan season because it got us a stud in Scottie Barnes.",
    "920": "@shawnhawaii @vivekmjacob Yeah the Celtics players havent been confirmed, just reading between the lines. But yeah if Raptors played Brooklyn they wouldn’t see Kyrie in Toronto games",
    "921": "Every Toronto Raptors home game should be on national television just to see who is suddenly unavailable to play.  They handled COVID like I wish New York could have.  I can't wait to see them host a playoff game and see who gets exposed. https://t.co/mYbTMGx0wv",
    "922": "@johndoe63460857 @AndrewRiffe1 @SDeslippe Still think the last 4 months is historical 😅\n\nBest Team Defensive Rating By Their Last 20 Games:\n\nMemphis Grizzlies - 109.7\nToronto Raptors - 109.9\nBoston Celtics - 111.7\nPhoenix Suns - 112.0\nOrlando Magic - 112.1\nMiami Heat - 112.6",
    "923": "Dave Feschuk: The Raptors might make a deep playoff run with the NBA’s worst bench, but it’s a risky game #Toronto #Raptors #NBA https://t.co/jlTNwL482H",
    "924": "@Raptors @pskills43 Worth every penny 🔥🔥",
    "925": "The 2022 Toronto Raptors 2nd round pick the Warriors own and protected top-54 in the Brad Wanamaker salary dump trade will not convey to the Charlotte Hornets and will stay with GSW.\n\nGolden State will have three selections (one 1st round and two 2nd round) this upcoming draft.",
    "926": "You're on notice @Raptors @Bucks\nhttps://t.co/xT08hFubWF https://t.co/DFz8lczdtm",
    "927": "@LakeShowYo I just compare the Lakers with Bron and the Raptors with Kawhi and how the teams handled it. They each won one for their teams and then the things that happened next. I realize how amazing &amp; farsighted the Toronto front office is to have them positioned way ahead of schedule.",
    "928": "It was such a joy &amp; inspiration to listen to @superfan_nav share his story this morning! We can accomplish more when we work as a team &amp; we should always treat others the way we want to be treated. @PeelSchools @rjlee_ps #SikhHeritageMonth #ImWithSuperfanNav #WeTheNorth @Raptors https://t.co/YqfVuN6coW",
    "929": "can og please present danny’s ring tomorrow?? @Raptors @OAnunoby @DGreen_14 make it happen",
    "930": "@Raptors Embiid going scoreless vs Gasol",
    "931": "@CelticsFan2003 @Raptors @pskills43 would still be ALL NBA",
    "932": "@DerozanFan10 @NBA @AschNBA @Raptors @KendrickPerkins Yep that’s what we are doing smh 🤦‍♂️",
    "933": "The Bulls fall 1.5 games behind the Toronto Raptors with tonight's loss to the Celtics, deepening their position in the sixth seed.",
    "934": "@RugalBossB @NBA @AschNBA @Raptors @KendrickPerkins Enjoy the Ls and the annual lottery",
    "935": "Players to have at least 1400 PTS, 300 AST, 500 REB, 70 STL, &amp; 40 BLK this season are \n\nPascal ALL-NBA Siakam\nNikola Jokic \nJayson Tatum\n\n#pascalsiakam #WeTheNorth #torontoraptors #Raptors https://t.co/jMgJ7QZdGU",
    "936": "@DerozanFan10 @NBA @AschNBA @Raptors @KendrickPerkins Apparently you don’t",
    "937": "@Raptors You aint curious. You already know the answer. You just want us to flaunt it. https://t.co/HoNjKLa3tH",
    "938": "@intangible_eth @DGreen_14 @Raptors @nbatopshot So much fomo",
    "939": "@RugalBossB @NBA @AschNBA @Raptors @KendrickPerkins I don’t care.  Perk has a vote.  That’s all that matters.",
    "940": "@Raptors This is in my mancave https://t.co/Z5B4wUN0T8",
    "941": "@Raptors It has to be the Shot.  Nothing else comes close.  #WeTheNorth https://t.co/6SUv8SQ8ap",
    "942": "@DerozanFan10 @NBA @AschNBA @Raptors @KendrickPerkins Yeah the dude that said the Lakers would win 70 games is your backup. Raptor fans 🤦‍♂️",
    "943": "Scottie Barnes last 20 games is averaging 18/8/4 on 58.1% TS. His diverse skillset on this Raptors team his ability to be your POA defender but also an offball defender. His onball passing combined with his offball movement as a cutter. He has also played all 5 POS for Toronto. https://t.co/p2pXyIC0to",
    "944": "@RugalBossB @NBA @AschNBA @Raptors @KendrickPerkins Facts",
    "945": "@RugalBossB @NBA @AschNBA @Raptors Just in : @KendrickPerkins #ThankYou #PerkKnows https://t.co/gVvVKXCKrJ",
    "946": "Reports are telling me Glenn “doc” rivers is not vaxed @Canada @Raptors",
    "947": "NBA Basketball Game Betting Picks Simulator: 4/7/2022 7:30 PM ET - Philadelphia 76ers vs. Toronto Raptors - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/3wxrFIRzGL #nba #sportsbetting #freepicks #cappertek",
    "948": "@Raptors @pskills43 @pskills43 got All-NBA 🔒. We need the @ScottBarnes561 #ROTY push now. The NBA on some b.s. again. If they give it to Cade ama R.I.O.T.",
    "949": "@CharlieKime1 @NoahLevick @Raptors That would be yes",
    "950": "@ChasinTheGraph Former Toronto Raptors great, Hubert Davis 😅 https://t.co/JYO65mBEyI",
    "951": "Thybulle is listed as \"ineligible to play\" for a road game against the Raptors, heightening concerns he might miss road playoff games in the first round should the Sixers draw Toronto.  https://t.co/1J1o9sJ7NB",
    "952": "@RaptorsBrazil @_emmajbrown @tracywine105 @Anthonysmdoyle  Danny Green is doing a live recording of his podcast in Toronto tonight and he says here the Raptors have a \"vaccination advantage\" so I guess it's true about Thybulle.",
    "953": "Sixers' Thybulle 'ineligible to play' in Toronto: Philadelphia 76ers guard Matisse Thybulle, one of the top wing defenders in the NBA, has been listed as \"ineligible to play\" in Thursday's game in Toronto against the Raptors, who are a potential… https://t.co/Fw7HgSQewi https://t.co/dYIBQc8ar0",
    "954": "@Raptors Is this the dagger?",
    "955": "The road was long, but your defensively-sound Toronto Raptors are playoff ready https://t.co/7GPVY6JahX https://t.co/iXQp1fnbrE",
    "956": "@RGK91605631 @loveisourfiller @ice_moke @RAPSMUSE @Raptors You probably didn’t see Barnes make 3 3s against the Heat.  He also had 19pts and 14rebs last night for a W vs the Hawks including that sick left handed layup he made against Capela.",
    "957": "@LoLAllenL @enra6ed @Raptors @ScottBarnes561 do they have rings",
    "958": "The Toronto Raptors don't have a \"vaccine advantage\", every Raptor has to follow the same rules to get into the US as well as back into Canada (both countries have the same mandate). If a Raptor decided to not get vaccinated they would have the same consequence of not being able",
    "959": "@DerozanFan10 @loveisourfiller @ice_moke @RAPSMUSE @Raptors Must be nice to have Siakam to do all the scoring and he can have his 4ft put backs.",
    "960": "@DerozanFan10 @NBA @AschNBA @Raptors That’s not a fact Barnes third on the list because he is 3rd behind Cade and Mobley. That’s fact. The praise you talking about is not the point I made the fact that Cade IQ makes him different. KD and Paul were pointing that out not just praise. Cade went No.1 for a reason fact!",
    "961": "@RGK91605631 @DerozanFan10 @ice_moke @RAPSMUSE @Raptors u def faded for cade",
    "962": "@Raptors Holding Joel scoreless the season after the chip",
    "963": "@RugalBossB @NBA @AschNBA @Raptors Oh and by the way... https://t.co/p6KD0SrZ3v",
    "964": "@Raptors @vivekmjacob @TangerineHoops Absolutely!!🥰🥰🥰",
    "965": "@RGK91605631 @loveisourfiller @ice_moke @RAPSMUSE @Raptors 7/19 from field including 1/4 from 3.  Nice ! 😂😂😂",
    "966": "@RGK91605631 @loveisourfiller @ice_moke @RAPSMUSE @Raptors It must be nice to jack up those many shots without any concern for efficiency.  Another L.  What’s new?",
    "967": "Here’s my Atlantic division of my NBA cards I collect of @celtics @BrooklynNets @nyknicks @sixers &amp; @Raptors https://t.co/48CKgnvrQQ",
    "968": "@Raptors Lol. “The shot”. Obviously",
    "969": "@RugalBossB @NBA @AschNBA @Raptors Just look uo what KD, DWade and Lebron said.   We are talking about best rookie for THIS YEAR and not the best rookie moving forward coz no one knows that.  You just ignore the facts.",
    "970": "@DerozanFan10 @NBA @AschNBA @Raptors Missed the point like most of this other Raptor fans and y’all wonder why he is 3rd on the list is because y’all living in 2012 instead of 2022. Raptor fans this is why nobody listens to y’all because y’all don’t read or listen correctly, Good day sir.",
    "971": "@Sportsnet @Raptors Nice",
    "972": "@DerozanFan10 @RugalBossB @NBA @AschNBA @Raptors KD, CP3, Kyrie, Beal and many more gave praise to Cade. Candace had to give him a special segment when he played against Jokic because the media kisses Mobley's ass",
    "973": "@princethegoat10 @Raptors @pskills43 Dude hes averaging 69pts on 420 shots a game on a G-league team clearly MVP",
    "974": "@MaxeyBetta @Raptors @Bell Maybe but we might make some noise🤞😉",
    "975": "@scarytrentjr @Raptors @pskills43 This isn’t fucking politics these are numbers that are confirmed by The NBA",
    "976": "@ScottBarnes561 @Raptors @SunLifeCA W as always, now follow me",
    "977": "@MaxeyBetta @Raptors @Bell Lmao this your team? https://t.co/4JUhJ2UR8b",
    "978": "@Raptors @pskills43 We literally need Scottie agenda rn people are giving Cade ROTY shouts for a 7-19 game in a blowout loss 😭☠️",
    "979": "@Raptors @pskills43 W graphic designer and admin. #wethenorth proved all them Reporters and Writers wrong",
    "980": "RT: Raptors: ALL-NBA type of numbers ⤵️\n\n#ALLNBA | @pskills43 https://t.co/f2zqzzffYp @raptors @olgproline @NBACanada",
    "981": "RT: Raptors: Playoffs, Clinched \n\nOpen Gym: Moment presented by @Bell https://t.co/xORtI8vlYz @raptors @olgproline @NBACanada",
    "982": "@Raptors @pskills43 Mvp numbers",
    "983": "@Raptors Last time I checked the only thing Evan Frobley fans could clinch was a ride on his Dick😂",
    "984": "ALL-NBA type of numbers ⤵️\n\n#ALLNBA | @pskills43 https://t.co/RDW9u1fqQp",
    "985": "Finally @DGreen_14 will get his @Raptors Championship ring tomorrow! #WeTheNorth https://t.co/PWorUHWWCe",
    "986": "76ers' Matisse Thybulle 'Ineligible to Play' for Game vs. Raptors in Toronto: Philadelphia 76ers guard Matissse Thb https://t.co/czAVjjxCdy #NBA #Philadelphia76ers #MatisseThybulle #BNTNBA https://t.co/66R7IrZYet",
    "987": "@donjuanhiphop25 @Raptors @ScottBarnes561 cuz we played them hella late",
    "988": "@donjuanhiphop25 @enra6ed @Raptors @ScottBarnes561 we were injured for those 3 Ls lmao mobley is mid",
    "989": "@JaMoraht @Raptors Underrated defensive performance",
    "990": "@Raptors Is this the dagger? https://t.co/OJtSkcJ5w1",
    "991": "@Raptors God bless the Raptors!",
    "992": "@donjuanhiphop25 @enra6ed @Raptors @ScottBarnes561 yeah its not like garland and jarrett allen are allstars or anything lol",
    "993": "Proud of @Raptors ! They have made a great season. Gotta go to Toronto. #WeTheNorth 🇨🇦🇨🇦🇨🇦🇨🇦🇨🇦🇨🇦🇨🇦🇨🇦🇨🇦🇨🇦🇨🇦🇨🇦🇨🇦🇨🇦🇨🇦🇨🇦",
    "994": "@BlueJays @Raptors Yeah baby.",
    "995": "@Raptors Only one https://t.co/ZjL7wsCIol",
    "996": "Check out 2020-21 MOSAIC GREEN PRIZM #290 VINCE CARTER TORONTO RAPTORS  https://t.co/NWLmAUBcat via @eBay",
    "997": "@Raptors @ScottBarnes561 Nobody cares about what LeBron thinks. Our ROTY was a Kobe fan. He's telling us things we already know. https://t.co/2SMVNMhv99",
    "998": "Thanks @Raptors and Canada for making all of Philadelphia have to discuss and argue over covid AGAIN! God damn it. https://t.co/NCcst0lQVB",
    "999": "@Raptors Always this ❤️ https://t.co/GEe1hneczy",
    "1000": "Do you guys think the @Raptors could make a surprise run in the postseason?\n\n#WeTheNorth",
    "1001": "@Raptors The only piece we need is a centre . Simms from the Knicks would be an excellent choice . Fits the age group of our team , and aggressive",
    "1002": "Some of y’all needa fill this up😭😭 \n\n@Raptors #WeTheNorth https://t.co/p408axFrEA",
    "1003": "76ers’ Matisse Thybulle ineligible to play Raptors in Toronto https://t.co/sl1uqbsy4J",
    "1004": "Since 2015, the Toronto #Raptors have won more games than any other NBA team except Golden State. \n#WeTheNorth",
    "1005": "Not BTS related …\n\nTHE @Raptors ARE BACK IN THE #PLAYOFFS \nLETS GOOOOO!!!\n#WeTheNorth https://t.co/3n7PCw4vD3",
    "1006": "@Raptors So good i have it framed on my wall.\n#WeTheNorth https://t.co/DBmcm5vLJ7",
    "1007": "@YABarnes4ROTY @Raptors this game was so awesome",
    "1008": "@CovidiusDuck Fair. I just think it's going to feel dated in a few years, kind of how I perceive the Toronto Raptors now. Also, I like alliteration so I was a fan of \"Sockeyes.\" 🤷‍♂️",
    "1009": "@ScottBarnes561 @Raptors @SunLifeCA 😂 😂 😂 Let's gooo4️⃣ https://t.co/6oUmic0Zmr",
    "1010": "Matisse Thybulle vaccination, Philadelphia 76ers news, Canada, Toronto Raptors playoffs picture https://t.co/Kc3znLPvFV",
    "1011": "Matisse Thybulle ruled out vs. Raptors; ineligible to play due to COVID regulations #nba #toronto https://t.co/L8ydjd509U",
    "1012": "@ScottBarnes561 @Raptors @SunLifeCA Hi king and roty",
    "1013": "Matisse Thybulle vaccination, Philadelphia 76ers news, Canada, Toronto Raptors playoffs picture https://t.co/7lH51dFXUw",
    "1014": "@Raptors Kawhi Leonard's winner",
    "1015": "@RugalBossB @NBA @AschNBA @Raptors KD and Lebron gave high praise to Scottie after they played against him.  DWade too.",
    "1016": "@Raptors @Bell Yippee. Can't wait to see you play.",
    "1017": "4.7.22\nOrlando #Magic vs Charlotte #Hornets\nBoston #Celtics vs Milwaukee #Bucks\nPhiladelphia #76ers vs  Toronto #Raptors\n\nToday's #NBAPredictions: https://t.co/hltNwEZVnD\nBet on NBA:  https://t.co/ArbfnziqHj\n#Draftkings #Fanduel #sportsbook #BetMGM #WilliamHillUS https://t.co/2wkDNfenIP",
    "1018": "@Raptors Forever!!!💯👏👏 https://t.co/gQeOeikU89",
    "1019": "@Raptors Joel embid crying. Straight up. 😂",
    "1020": "76ers’ Matisse Thybulle ineligible to play Raptors in Toronto https://t.co/wJWoeXkFqA",
    "1021": "@Raptors Round 2, Game 7, 2019 Playoffs... when Kawhi hit \"the shot\" 😁😁",
    "1022": "@Raptors @Bell Go Toronto Raptors go playoffs time. https://t.co/VDObVCK6ix",
    "1023": "@ScottBarnes561 @Raptors @SunLifeCA 😊😊☺️🥰 You two are so cute.",
    "1024": "Actually? Seriously, how is Scottie Barnes in 3rd spot for ROTY?\n\n#WeTheNorth #raptors #toronto @Raptors #nba https://t.co/AI0rGmLVJu",
    "1025": "@Raptors @ScottBarnes561 Bron seems like a genuine person and very nice",
    "1026": "@SimuLiu @Raptors Every time I see someone famous cheering for the Raptors it hits me in the feels.",
    "1027": "@CharlieKime1 @stephenasmith @ScottBarnes561 @Raptors Didn’t hear that….good to hear because he is the ROY!",
    "1028": "@Raptors @Bell I like ur name",
    "1029": "76ers’ Matisse Thybulle ineligible to play Raptors in Toronto https://t.co/pfKH1h0M5n",
    "1030": "Playoffs, Clinched \n\nOpen Gym: Moment presented by @Bell https://t.co/QIatSE6Vzq",
    "1031": "@TimAAmor @Raptors @NBA @william_lou @The_6ix_man @steven_lebron @TermineRadio @bomani_jones Nope!",
    "1032": "@enra6ed @Raptors @ScottBarnes561 not mobley the clear cut winner and mobley won the battle three times out of four while playing with a injured roster yiu got all star vets over there in siakem and vleet stop barnes good though",
    "1033": "@stephenasmith just said in on @espn  halftime show that @ScottBarnes561 is his RoY. Yessir! Top 5 in all stat categories among rooks, starting on a playoff team, defending the opponent’s best player any given night. #WeTheNorth @Raptors #NBA75 #RoY https://t.co/Q8naXRerBK",
    "1034": "@RapJayz @Raptors Ayy u finally tweeted",
    "1035": "@Raptors Ohhh this one is eazyyyy \n#WeTheNorth #Raptors #NBA https://t.co/2hygUVWv0m",
    "1036": "@Ayan_SB @Raptors You chose ..... wisely.",
    "1037": "Chris Boucher just said that Toronto Raptors can win the Championship 👀 \n\n#WeTheNorth https://t.co/NoJp8m9k94",
    "1038": "@RossMil04069834 @stephenasmith He just said @ScottBarnes561 was his RoY… @Raptors #WeTheNorth",
    "1039": "@RealMattCarey Toronto Raptors are going to won the NBA 🏆 BC mF's don't have their vaccine/booster shots 😅🤣😅. Can't play there https://t.co/drZUi2vnKN",
    "1040": "@Raptors Without stating the obvious…\nJoel Embiid’s Goose egg!\n\nhttps://t.co/sMto7Yi1II",
    "1041": "@money_talks65 @Boom___Shaka @CJMendenhall24 @Yourbad98036065 @GuruLakers @MagicJohnson @Lakers @JeanieBuss @EricPincus Abandoned their 2019 motto, “Defense wins Championships.” 👎\nTraded JaVale McGee to make room for Marc Gasol 38.5% for 3-pointers at Center for the Toronto Raptors. Perfect for 5-Out Offense.",
    "1042": "@Raptors @ScottBarnes561 MVP LFG",
    "1043": "@Raptors Kawhi's shot. It was like a movie where Vince Carter put it up 18 years before, and rattled around the rafters, and then through.",
    "1044": "Clinched Playoffs | Raptors Today #Toronto #Raptors #NBA Video: https://t.co/ICKSTrAXKM",
    "1045": "@Raptors Embiid’s disbelief face after Kawhi’s buzzer beater",
    "1046": "@Raptors KAWHIS SHOT FOR THE WIN!",
    "1047": "@Raptors That absolutely life changing shot by Kawhi #LifesGoodMoment @Raptors @LGCanada",
    "1048": "@JasonHirsch16 Biased and stupid take! clearly not watching @Raptors games to have this BS excuses #WeTheNorth https://t.co/W7MnTwhwtB",
    "1049": "@Raptors \"The shot\" never gets old!!❤ https://t.co/JldyBtF0ZO",
    "1050": "@Raptors My friend and I bought last min tickets and drove up from Montreal to Toronto to watch a certain Game 7 vs Philly on May 12, 2019...\n\nFirst and only live Raps game I’ve seen to this day. https://t.co/Uu7GZryCl9",
    "1051": "@Raptors There’s nothing like “the shot”. It felt like time stood still while everyone watched that ball go in.",
    "1052": "@jasimxmalik @_hnkumr @TorontoScottie @LegionHoops Why? Because you’re a Toronto raptors fan and need the bragging rights to feel like you won?",
    "1053": "@Raptors @TorontoDame @ScottBarnes561 this is why bron is the goat",
    "1054": "@ScottBarnes561 @Raptors @SunLifeCA This is 🔥",
    "1055": "@sp_136_Rp @offwhiteferrari @Raptors Pure dope straight in my veins 💉",
    "1056": "The @Raptors shouldn't be held accountable for players in the NBA who refuse to get their COVID-19 vaccines.  #WeTheNorth",
    "1057": "@Raptors Underrated moment https://t.co/yxxdE1aNY2",
    "1058": "@offwhiteferrari @Raptors 20 years from now I will still watch this",
    "1059": "76ers' Matisse Thybulle 'Ineligible to Play' for Game vs. Raptors in Toronto #Philadelphia #76ers #NBA https://t.co/9WgLYm0DbK",
    "1060": "@Raptors @ScottBarnes561 he’s praising scottie and y’all still hating 😭",
    "1061": "@theScore @Raptors 8th time in the last 8 seasons. We’re not seriously counting Tampa as a real season right?",
    "1062": "@offwhiteferrari @Raptors I remember watching as it happened .. late night both kids asleep. I couldn’t turn the sound on and I screamed! Lost it… new we were winning the chip",
    "1063": "@ScottBarnes561 @Raptors @SunLifeCA you will be the best raptor ever in 15 years",
    "1064": "@SexyS3xton @HoodlumsNFT Lmao. I didn't even look that far down 🤦\nI retract my previous statement.\nRaptors 1000%! Fortunate enough to see them play when I was in Toronto in 2020 before Covid hit. Would love to see them play again!",
    "1065": "@ScottBarnes561 @Raptors @SunLifeCA ROOKIE OF THE YEAR!!!!!!!",
    "1066": "@ScottBarnes561 @Raptors @SunLifeCA Ily Scottie",
    "1067": "@Raptors Raptors D putting Embiid in jail November 25th 2019 https://t.co/RIhDvBb26H",
    "1068": "@Raptors Won them outside at Jurassic Park too, got 2 tickets and brought my friend. Best day of my life. Besides meeting my girl of course....🤥😅 https://t.co/r03BKrwIYk",
    "1069": "@ScottBarnes561 @Raptors @SunLifeCA You two are so cute 😄",
    "1070": "@ScottBarnes561 @Raptors_Noahh @Raptors @SunLifeCA Scottie you deserve ROTY",
    "1071": "RT: Raptors: game recognizes game 🤝\n\n#ROTY | @ScottBarnes561 https://t.co/n2cziSS6PG @raptors @olgproline @NBACanada",
    "1072": "@ScottBarnes561 @Raptors @SunLifeCA Ur the ROTY",
    "1073": "@ScottBarnes561 @Raptors @SunLifeCA Hi Scottie",
    "1074": "@ScottBarnes561 @Raptors @SunLifeCA Scottie I need you to work on your finishing in the off-season especially at getting around the defender. Let’s go ROTY",
    "1075": "@ShamsMo_ @Raptors What's your wingspan?",
    "1076": "So,  76ers' Matisse Thybulle 'Ineligible to Play' for Game vs. Raptors in Toronto https://t.co/pWX3o3pmpE https://t.co/2ZzBohiXwm",
    "1077": "76ers' Matisse Thybulle 'Ineligible to Play' for Game vs. Raptors in Toronto https://t.co/5hQuX2Po2T",
    "1078": "@ScottBarnes561 @Raptors @SunLifeCA WAKE UP BABE ROTY TWEET",
    "1079": "@ScottBarnes561 @Raptors @SunLifeCA I am now active",
    "1080": "@ScottBarnes561 @Raptors @SunLifeCA your better then Lebron",
    "1081": "@ScottBarnes561 @Raptors @SunLifeCA goat",
    "1082": "@ScottBarnes561 @Raptors @SunLifeCA Get that bag Scott",
    "1083": "@ScottBarnes561 @Raptors @SunLifeCA WAKE UP THE ROTY TWEETED",
    "1084": "Rookie takes the gold! Take a #SunLifeHealthTimeout from your busy day and get moving with @Raptors and @SunLifeCA #sponsored https://t.co/pq4fOTmVtB",
    "1085": "@pskills43 @Raptors @SunLifeCA Miss you more",
    "1086": "76ers' Matisse Thybulle 'Ineligible to Play' for Game vs. Raptors in Toronto https://t.co/1nerJyPcNm #sports #feedly",
    "1087": "@Raptors Gotta be Kawhi - how can you say anything else!!",
    "1088": "@intangible_eth @DGreen_14 @Raptors @nbatopshot TS: curtiewurtie\n\nThis is hype! We the North!",
    "1089": "@Raptors Cannot not be this https://t.co/xwEAQoVlSM",
    "1090": "@Raptors @ScottBarnes561 Rookie. Of. The. Year. @NBA please don’t mess this up.",
    "1091": "@Raptors @ScottBarnes561 Tell NBA to give us a fuckin national tv game for the season finale",
    "1092": "@Raptors @ScottBarnes561 clear cut winner",
    "1093": "@MaxeyBetta @Raptors @ScottBarnes561 That's an L",
    "1094": "@Raptors @ScottBarnes561 scottie clears lebron",
    "1095": "@Raptors Held Joel Embiid to 0 points at a regular season game.",
    "1096": "game recognizes game 🤝\n\n#ROTY | @ScottBarnes561 https://t.co/jDZuZSrCA9",
    "1097": "Crossing the fingers that @Raptors first play-off game will not be on April 16th. I got tickets but wont be able to go if it is on the 16th 🙈🙈🙈",
    "1098": "@Raptors @MLSEFoundation When are you going to show sympathy and public support for @Sviat_10 in light of the war on his homeland? #StandWithUkraine",
    "1099": "@Raptors Close second: Drake leading the crowd in the airplane troll session on Embiid",
    "1100": "@Raptors The shot! https://t.co/BF5d94pjhz",
    "1101": "@Raptors THIS will forever be my favourite memory vs Philly PERIODT! #theshot #WeTheNorth https://t.co/lkvLGcOmkF",
    "1102": "@Raptors Kahwi. No need to say or post anything else. Cheers!",
    "1103": "Sixers swingman Matisse Thybulle ruled ineligible to play road game against the Toronto Raptors – NBA News https://t.co/qo8Fi1igLF",
    "1104": "@Raptors so how we poaching kyrie? what’s the plan baes",
    "1105": "@Raptors Kawhi with the dagger.",
    "1106": "@PerthWildcats @Raptors This is great news! Well done Raptors",
    "1107": "@Raptors The 4 rim shot! https://t.co/Gb3pDMEUxF",
    "1108": "Trudeau doing the @Raptors favours with the mandate https://t.co/R7aBD81byb",
    "1109": "@Raptors We have a lot of fire moments against the 76ers",
    "1110": "@Raptors Everything Kawhi did in that 7 game series. He was elite on every level",
    "1111": "@KendrickPerkins As a @Raptors fan, I concur with your ROTY pick!!!",
    "1112": "@SimuLiu @Raptors I love that you’re a legit fan!",
    "1113": "@MadJimboSpeaks Toronto Raptor....young kid and very talented...he’s a good player, plays honest and good defence\nIf you followed basketball I would have to say you would like him Jimbo ...then again, I was wrong on Dermott 😂👍🍻",
    "1114": "@Raptors We all should have the same answer",
    "1115": "@PascalFanClub @Raptors Put em in the spin cycle so smooth 🔥",
    "1116": "@Lubna545A @SimuLiu @Raptors Lol my brain didn’t even think bout drake just instant fight mode for nav so my bad to",
    "1117": "Real question here: \n\nWho has a better chance of making it past the first round?\n\nToronto Raptors or Toronto Maple Leafs\n\n@FanDuelCanada has the #LeafsForever odds to win a round at (-115) https://t.co/05l5vOnYr1",
    "1118": "@Raptors The shot https://t.co/L1coDEVtp7",
    "1119": "@SimuLiu @Raptors Someone start a petition to make him the ambassador over drake",
    "1120": "@10Ronaldinho @Raptors @NBA Deep love legends ♥️🌏",
    "1121": "If the Sixers face the Raptors in the 1st rd of playoffs, remember that Matisse Thybulle is \"ineligible\" for tomorrow's game in Toronto. He's clearly not vaccinated and wouldn't play there in a playoff series, either. @SportsLine",
    "1122": "Tomorrow is built today. \n\nWhen we start investing in youth facing systemic and societal barriers we Change the Game for the athletes, leaders and community builders of tomorrow. \n\nLearn how to get involved with @MLSEFoundation \n »  https://t.co/Ayz7DXIrux https://t.co/gMB3DUWcni",
    "1123": "I'm sorry @NBA and @Raptors, this is insane. Why the hell can't unvaccinated players play in Toronto? https://t.co/lfLaCcB2cE",
    "1124": "Matisse Thybulle was listed as ineligible to play in Thursday night’s game against the Toronto Raptors at Scotiabank Arena. Players who aren’t fully unvaccinated now have to be listed as ineligible when held out of playing games in Toronto.\n\nhttps://t.co/yH9kHmWlS6",
    "1125": "@Raptors game 5 ✈️ https://t.co/H7KgGqUFWY",
    "1126": "The Toronto Raptors faced obstacles unlike any other NBA franchise last season, roadblocks so unwieldy that Nick Nurse said they were more like \"cement walls.\" https://t.co/WGqbsO8ikF",
    "1127": "@Lubna545A @SimuLiu @Raptors Don’t hate on nav like that  please",
    "1128": "@elijahburke138 @Raptors they do",
    "1129": "@espn As per @stephenasmith , you keep featuring @nyknicks games… what about the probable playoff series preview tomorrow of @sixers at @Raptors with subtext of @MatisseThybulle being placed on the ineligible list? Featuring RoY finalist @ScottBarnes561 and MVP finalist @JoelEmbiid!",
    "1130": "@Raptors All time! https://t.co/Mkj38GGOqk",
    "1131": "@matthewrtpower @Raptors they hate you",
    "1132": "@SimuLiu @Raptors The only ambassador we need",
    "1133": "@Raptors The only one that counts https://t.co/dDu7G4D6Q8",
    "1134": "@SimuLiu @Raptors How far do you think/hope we will go ???",
    "1135": "@Raptors My fav is this after @kawhileonard sunk the corner basket #WeTheNorth https://t.co/yD9M6f9dZB",
    "1136": "@Raptors When we sent Embid home crying. I wanted to hug him, but that feeling subsided real quick. https://t.co/F7WSewZGo4",
    "1137": "@Raptors watching that shot frm kawahi wit my friends while on discord frm another country.",
    "1138": "@Raptors LET'S GOOOOOOOOOOO!!!!!!!!",
    "1139": "@Raptors Has to be https://t.co/uyQohzR0HZ",
    "1140": "@Raptors Kyle refueling the team with cookies at midnight from  legendary Philly joint Insomnia after a rough loss. And then beating the Sixers the next day.",
    "1141": "@Raptors Holding embiid to zero points is a great choice,  or the kawhi shot. Coming back to beat them. Honestly there is too many great moments. The kawhi shot was a dream come true though and I was screaming and running through my house when it happened",
    "1142": "Leon's is giving YOU a chance to bring home a piece of Toronto Raptors franchise history! Enter to win a one-of-a-kind coffee table, made from a piece of the 25th Anniversary “95 Rewind Court”! Don’t miss your chance to enter! https://t.co/vu0oL2u6sN",
    "1143": "@Raptors *other than game 7* my favorite moment against philly was when demar dropped 45 against them and we came back by 22 in the 2017-18 season",
    "1144": "The road was long, but your defensively-sound Toronto Raptors are playoff ready https://t.co/N0uuo8d9Kn",
    "1145": "@pgawhite @Raptors @NBA @william_lou @The_6ix_man @steven_lebron @TermineRadio @bomani_jones 🇨🇦 content with some 🟠, I believe…",
    "1146": "@Raptors Ahhhhhhhhhhh Kawhi. Bounce bounce bounce game.",
    "1147": "@Raptors IS THIS THE DAGGER?",
    "1148": "76ers' Matisse Thybulle listed as 'ineligible to play' against Raptors in Toronto https://t.co/sP8ynERjb6",
    "1149": "@Raptors Would love too see this raps team play, please pick me!!! 😂",
    "1150": "@Raptors Donyell Marshall 12 3s",
    "1151": "@Raptors There can’t be any answer other than The Shot!!",
    "1152": "@Raptors Only right answer! #WeTheNorth https://t.co/0eAP1gWsw7",
    "1153": "@Raptors @vivekmjacob @TangerineHoops Team work every game 🏀",
    "1154": "@Raptors We going way back.... Donyell Marshall setting the record for most 3pm in a single game! https://t.co/XvSxjMLTAV",
    "1155": "@JosephWongUT @Klow7 @Raptors @adidas @william_lou @steven_lebron @DOH_34 @kngprry @_shireenahmed_ @ttheMOVEMENT @AyimWhoAyim I insist you wear that for a certain show!",
    "1156": "@Raptors Only answer is #theshot",
    "1157": "@Raptors A store had my fave memory so I had to take a pic with it 🏀🏀🏀🏀 https://t.co/OVgIoY6EFo",
    "1158": "@Raptors The shot",
    "1159": "@sp_136_Rp @Raptors chills everytime",
    "1160": "@Raptors Being in Philly https://t.co/ut41kwTd14",
    "1161": "@Raptors Just to be a little different for the sake of it but Kyle wanting to scrap with Ben Simmons in the hallway after both of them got ejected",
    "1162": "@Raptors Can’t help it sorry https://t.co/FtIEL5nuww",
    "1163": "@Raptors Vincsanity and The Answer going head to head in the playoffs.",
    "1164": "@Raptors Lmao how is this even a question?",
    "1165": "@offwhiteferrari @Raptors I will never ever ever… EVER get tired of watching this",
    "1166": "@jasmcrns @Raptors 😂😂 only for that tweet",
    "1167": "@Raptors the shot.",
    "1168": "@Raptors I mean is there any other option than ‘the shot’?",
    "1169": "@DerozanFan10 @NBA @AschNBA @Raptors Scottie could play more position than Jordan doesn’t make him better. Barnes good but y’all talking like he Magic he is not that. He a good kid that will better. Cade shows the bball IQ that doesn’t come around that often just ask Durant and Chris Paul they told you.",
    "1170": "@Raptors Vince 50 points vs. Iverson’s 76ers in Game 3",
    "1171": "@Raptors Kawhi dunking on Joel Embiid. That was hype.",
    "1172": "@Raptors I was at game 6 of Philly at the Raptors when Vince scored 50… impressive, but nothing like the barking in the dog pound when the Junk Yard Dog entered the game as 6th man!  His spirited game was absolutely infectious! Would thrive with todays Raps!! Incredible moment",
    "1173": "Look what I got in the mail today. Limited drop @Klow7 return commemorative T. Thx @Raptors @adidas.\n#WeTheNorth #kloe \n@william_lou @steven_lebron @DOH_34 @kngprry @_shireenahmed_ @ttheMOVEMENT @AyimWhoAyim https://t.co/B4qYOb38xl",
    "1174": "@ScottBarnes561 Im an obsessed @Raptors fan and cannot afford to come to a game to watch you and the raptors because I am a low-income family so I don’t have money for things like basketball games and wish I could meet you and the team",
    "1175": "@Raptors #NoMorePovertyPWD (Persons With Disabilities) 🇨🇦",
    "1176": "Sixers' Thybulle 'ineligible to play' in Toronto #Toronto #Raptors #NBA https://t.co/jHnDZXVkxH",
    "1177": "@Raptors Gotta be that final Kawhi shot! So dramatic and had us all stunned in silence for that epic moment!",
    "1178": "@Raptors Sunday, May 12th, 2019. Section 306, Row 12, Seat 5. One of the craziest experiences of my life! #WeTheNorth https://t.co/tHtcrGNN9M",
    "1179": "@Raptors The Kawhi shot during the playoffs 🏀",
    "1180": "@Raptors This was better than the game winner for me. Kawhi was carrying us so hard this series, he and Marc gasol were the only one’s not afraid lol.",
    "1181": "Matisse Thybulle showed up on tonight's #NBA injury report as \"ineligible to play\" in tomorrow's contest in Toronto against the Raptors. This could potentially have major implications for the #Sixers in the playoffs.\nhttps://t.co/VinQcrIU2S",
    "1182": "@Raptors Obviously “the shot” https://t.co/ix0DLwEJo3",
    "1183": "@Raptors The dagger. Duh",
    "1184": "@Raptors Other than the obvious :) holding embiid scoreless and winning in Nov 2019 was pretty great",
    "1185": "@Raptors there is one single answer",
    "1186": "@NBATV @Raptors The North will reign once again 🏆",
    "1187": "@Raptors Kawhi’s dagger to win Game 4 vs sixers during 2019 playoffs!",
    "1188": "@Raptors When Kawhi made Embiid cry in that tunnel.",
    "1189": "NBA 2022: Matisse Thybulle vaccination, Philadelphia 76ers news, Canada, Toronto Raptors playoffs picture https://t.co/4jQsTjiyTA",
    "1190": "@Raptors This gem https://t.co/jlt09CiSEF",
    "1191": "@WeTheNorth11 @Raptors A tough one to be sure!",
    "1192": "@Raptors There's no way I'm making it all the way to Canada but is this really a question?? Of course kawhi shooting that last shot",
    "1193": "@Raptors Kawhi's shot has to be up there, but I do still have great memories of the back-and-forth big games between VC and AI in that series back in 2001!",
    "1194": "@Raptors Kawhi took the weights off my shoulders 😭 https://t.co/zZVJd50w6d",
    "1195": "Sixers swingman Matisse Thybulle ruled ineligible to play road game against the Toronto Raptors because he is unvaccinated.\nhttps://t.co/hnSsNvY8Fi via @PhillyInquirer",
    "1196": "I’ll say it again… this team has championship vibes❤️❤️🔥🔥🇨🇦@Raptors https://t.co/kyZdtUPOSK",
    "1197": "@Raptors Is there any other option? https://t.co/c22VeZHqz2",
    "1198": "@Yeetdabish @NorthernNobody_ @KawhiElite @NBAonTNT @Raptors The big weakness for the nets is perimeter D. After KD the next 5 scorers/playmaker are Kyrie, Seth Curry, Cam Thomas, Paddy Mills, and Dragic. All of those guys are 6'3\" and under and I believe only Kyrie/Cam are over 200lb. That's too small even in the modern nba. The Nets",
    "1199": "@pskills43 @hudsonsbay @Raptors This is awesome to see",
    "1200": "@Raptors Kawhi buzzer beater is legendary but Big Spain holding Joel to 0-11 the season after was a great time https://t.co/iQd8LdO8X6",
    "1201": "@Raptors Bounce.. bounce.. bounce.. bounce..",
    "1202": "@Raptors 2019 Game 4 Kawhi hitting that HUGE bucket 👏🏻",
    "1203": "@Raptors Obviously everyone is gonna say the Kawhi shot… but the one game I had the chance to go to was when Marc Gasol held Embiid to ZERO points. That game was insane. Showed how elite the Raptors were on defense and an underrated performance.",
    "1204": "@Raptors I can’t go with anything other than rim, rim, up, drop! The Klaw ending the process",
    "1205": "@Raptors There is no other answer. https://t.co/0vqBuVwTHr",
    "1206": "Sixers swingman Matisse Thybulle ruled ineligible to play road game against the Toronto Raptors https://t.co/xIeK8WrG5K via @phillyinquirer",
    "1207": "@TyJohnsonNews So right now the Sixers are projected to play the Raptors in round one. It’s a big deal. Toronto isn’t a gimme in a 7 game series.",
    "1208": "@Raptors That one shot that took 4 bounces before it went in",
    "1209": "@Raptors Kawhi's Game 7 buzzer beater of course!",
    "1210": "@Raptors The Kawhi Leonard Shot! https://t.co/QkkbdnM36H",
    "1211": "@Raptors Only one https://t.co/MLbAwvtyAD",
    "1212": "@Raptors Marc Gasol consoling Joel Embiid after the Raps 4 bounce win!",
    "1213": "@intangible_eth @DGreen_14 @Raptors @nbatopshot i can so make it! ts: maryjaneskeeper",
    "1214": "@Raptors Y’all already know 🗣🗣 https://t.co/I5c49545o3",
    "1215": "@Raptors \"It's off to Leaonard...\"",
    "1216": "@Raptors It was indeed the dagger 🗡 😊 https://t.co/2U7fXnLHbp",
    "1217": "@Raptors I know which one people love NOW. But, I mean… @mrvincecarter15 dropping 50 pts, game 3, conference semi-finals. LET’S GO!!!!",
    "1218": "@Raptors Lol like there is any other fav than the shot.",
    "1219": "@Raptors Why the questions 😂 https://t.co/fYSk3GffbF",
    "1220": "@Raptors Embiids tears were my favorite memory",
    "1221": "@Raptors Game 7!!!!!!! I have goosebumps when Kawhi nailed it and he was like YEAHHHHHHHH",
    "1222": "@Raptors Is this really a question ? https://t.co/ddSw1cdMav",
    "1223": "If the Sixers lose to the Raptors tomorrow and the Celtics beat the Bulls tonight, you're pretty close to locked into a 4/5 vs Toronto. Not ideal!",
    "1224": "@LeafsRapsBills @Raptors This and following it up with an Embiid 0 point game beginning of the next season.",
    "1225": "@Raptors First game ever, Halifax Metro Centre, had seats two rows from the concrete back of the place. Only game I got to go to with my dad.",
    "1226": "@Raptors “THE SHOT” followed by Embiid’s tears",
    "1227": "@Raptors There’s only one answer! https://t.co/LDvuimSsBm",
    "1228": "@Raptors I wonder what that memory is... 🤔 https://t.co/AWLIMCOtbO",
    "1229": "Daily News |  Sixers swingman Matisse Thybulle ruled ineligible to play road game against the Toronto Raptors https://t.co/q7z4klKna2",
    "1230": "@Raptors Easiest answer ever https://t.co/Pl7N9BNXOL",
    "1231": "@Raptors I think there was this one shot",
    "1232": "Sixers swingman Matisse Thybulle ruled ineligible to play road game against the Toronto Raptors https://t.co/VuYeDOea7N",
    "1233": "@Raptors If you remember those 4 bounces you remember",
    "1234": "@Raptors I think I speak for everyone 🥰 https://t.co/97IP69GbDk",
    "1235": "@Raptors is this the dagger?",
    "1236": "@Raptors making emfreethrow cry https://t.co/4WPL9lD4Sj",
    "1237": "Check out this listing I just added to my #Poshmark closet: Nike Toronto Raptors long sleeve Y2K. https://t.co/OqIMRXbGmr #shopmycloset @poshmarkapp",
    "1238": "@Raptors When kawhi hit that one shot that one time",
    "1239": "@Raptors Anytime we win",
    "1240": "Kind of curious… What’s your fav memory vs Philly?  \n\nReply below and you could win tickets to our final game of the regular season!\n\n📲: https://t.co/RKf7WXJMQV https://t.co/dBmReoPy7Q"
}