{
    "0": "Please win @nyknicks",
    "1": "@cjsarinas16 New York Knicks over the Lakers",
    "2": "Let’s work fellas!!! @nyknicks @KnicksTape #knicksnation",
    "3": "@NBA2K @RjBarrett6 @nyknicks I wouldn't know.  Your game will not let me play without kicking me off of the overtaxed servers.",
    "4": "#SACvsNYK 🔴 New York Knicks VS KINGS LIVE PLAY BY PLAY &amp; WATCH-ALONG KNICK Follow Party https://t.co/RqsdFb6PmN",
    "5": "New York Knicks-Sacramento Kings https://t.co/2k3Br909TL",
    "6": "New York Knicks vs Sacramento Kings\nLive On🔴 :: https://t.co/d7OgSFCi1y",
    "7": "Let’s go #KNICKS! ♥️🏀🗽🇺🇸\n#NYForever @nyknicks #NYC @TheGarden #BingBong https://t.co/LVn16IoPlG",
    "8": "Yoo If Da @nyknicks Lose Tonight!!! 🤬",
    "9": "@nyknicks Looks like he just found out he’s being traded",
    "10": "Any true @nyknicks fans out there and close to  Garden right now? Giving away my tix tonight for the game in 10 mins lol. Love to give it to someone who can't afford tix Section 1 2 tix. Cc: @KnicksFanTv crew. #Knicks #KnicksTape #90sknicks #bullyball #nyc",
    "11": "Depression is defined as watching New York Knicks basketball on purpose.",
    "12": "Come on @nyknicks Now’s the time to turn it around!!!\n#KnicksKnights https://t.co/bXNNdDOIXh",
    "13": "I’m watching MSG.  At about 7:30 ET, there’s NBA Basketball (Sacramento Kings at New York Knicks).",
    "14": "#SACvsNYK 🔴 New York Knicks VS KINGS LIVE PLAY BY PLAY &amp; WATCH-ALONG KNICK Follow ... @dyingbreed18  https://t.co/QizX2r5DhZ via @YouTube",
    "15": "@nyknicks START MILES MCBRIDE AND QUENTIN GRIMES. BENCH KEMBA AND FOURNIER.",
    "16": "@nyknicks let's go, Knicks! get this W. https://t.co/LxNQbAug9N",
    "17": "LETS TALK SPORTS - LETS TALK NEW YORK KNICKS EPISODE 13  CO HOSTED BY ISAIAH HANSEN https://t.co/uvSsziNjNB",
    "18": "@nyknicks play Cam Reddish! @camreddish 🏀",
    "19": "ALERT: New high roller bet posted!\nA bet has been placed for $9999.38 on New York Knicks - Sacramento Kings to win $19,416.64.\nTo view this bet or copy it https://t.co/p8ed2eUeUf https://t.co/WyNfspZ90p",
    "20": "@craigcartonlive Happy Birthday!\nMay the @nyknicks win today",
    "21": "@McNuttMonica @alanhahn @nyknicks @MSGNetworks Like PB and Jelly",
    "22": "I sent my parlay off very hopeful tonight @nyknicks don’t let me down",
    "23": "Updated Injury Report at New York Knicks - 1/31:\n\nDe’Aaron Fox (left ankle soreness) - OUT",
    "24": "@nyknicks I rather the mattress! Hands down",
    "25": "#Knicks #Kings Lets go @nyknicks maybe they will win on my birthday",
    "26": "Knicks vs Kings! Let’s go New York!!!!🏀🏀🏀🏀",
    "27": "@nyknicks Let’s see that Ultra Drip on the court.",
    "28": "Consensus Line Move:\n2022-01-31 Sacramento Kings at New York Knicks from 213.00 to 212.00\nUnder just a touch\n#NBA #espn #coder #bitcoins",
    "29": "@McNuttMonica @alanhahn @nyknicks @MSGNetworks How about an Evan Fournier trade to Washington for Dinwiddie! @alanhahn",
    "30": "First we start in the big apple with the New York Knicks\n#NBA75 | #NBA | #WhoAreThey | #NewYorkForever | #NYK | #Knicks | #NewYorkKnicks https://t.co/xFXmKxuGLQ",
    "31": "@FadeAsp @LeDrumstick1 Knicks might actually trade for him Bobby marks said he would if he was a GM and said it wouldn’t be a bad move for New York",
    "32": "@nyknicks play wit heart tonight for 48 min instead of 30-35 min 🟠🔵",
    "33": "@Saitamafam Lol it's not a Photoshop his mother's from Brooklyn her father is a die-hard Knicks fan. RJs father played college basketball in New York.",
    "34": "@McNuttMonica @alanhahn @nyknicks @MSGNetworks I ♥️ Your Energy Monica..#NewYorkForever",
    "35": "@nyknicks this is so cool haha.",
    "36": "Back in the building! Can you tell me &amp; @alanhahn get along? 😂 @nyknicks host Sacramento, pregame 7p on @MSGNetworks. https://t.co/YpkbPIV366",
    "37": "@nyknicks @J30_RANDLE It makes no sense to me at all why @camreddish is not getting any minute what. You trying to tell me he can’t get a minute on a horrible team what ! Not to mention we gave up a first rounder for bro. Leon Rose  and the crew y’all know what to do !",
    "38": "My ALL TIME FAVORITE @nyknicks! ALLEN HOUSTON! https://t.co/i8Jtd6c3g0",
    "39": "@Woodshed_1914 @Rick__War @Knickanators @queens_dude @eepdllc @0oty_Mac @Knickstape2005 @Markjoh91017488 @YankeesKnicks99 @TruePG718 @IanChisolm @acedghill @SellDaTeamDolan @StateNYKPOD @DonaldP47082631 @LukeHen73716015 @KnicksBig15 @_knicks1688 @mikenieve @Trace_AVP @Jaelin_Taylor @AJTheManChild @J1gg__ @LegionOfKnicks @RaphaelDiaz @Freekeith @DababyfannNYK @stalling_e @JeDiGoLLuM01 @BadBadLeroyBro7 @EdMemphisPimpin @M4tch3sMa70ne @fthevenin_a @tbarbeeESQ @AngelBeingAngel @eski225 @the_process101 @Chuck1one @rahmmagick @TMal761 @MikeFromQns7 @ArchangelReuel @victorlb03 @_IamTrueHate @KembasHome @MsMJsays @Sharonchik266 @SBADJ1 “And with the 8th overall pick, the New York Knicks select TyTy Washington from the University of Kentucky” https://t.co/Ln2UH3VUn2",
    "40": "@DanTheMan72117 @KnicksKaiSZN @nyknicks This right there is the reason James Dolan doesn’t need a winning team. MSG fills the luxury boxes and MSG Network sells the advertising slots regardless of how bad the Knicks are.",
    "41": "@hopefulmetsfan @nyknicks Kings, Grizzlies...I’m seeing a zero win homestand. Then it’s off to the West Coast, where they lose even more games.",
    "42": "@nyknicks Listen if Tibbs don’t start playing our young core I want him gone! I’m stick of this @J30_RANDLE  bs that he tolerates. No real head coach will let a dude that’s not close to being  a star calibers player get away with this. Tibs is going to find is self gone just like Randle.",
    "43": "New York Knicks, Chase Gift Bronx-Based Charter School With $100K https://t.co/Y7IvLZ3mt8",
    "44": "@nyknicks #NYK  #Knicks @TheGarden  Great night for some Knicks basketball 🏀 https://t.co/HSAmWFbyyt",
    "45": "@McNuttMonica @alanhahn @nyknicks @MSGNetworks Love it",
    "46": "Run em out of the gym man, @nyknicks",
    "47": "@nyknicks Unleash the youngsters. Toppin should be throwing a tantrum every time the pull him out 😂. OBI got a Ferrari engine the starters running on this thang https://t.co/s5ENRZC03q",
    "48": "@nyknicks Not really",
    "49": "@nyknicks Nice",
    "50": "🇺🇸NBA ML Picks 🔥\n\nMemphis Grizzlies ML (1.66)\nToronto Raptors ML (1.85)\nBoston Celtics ML (1.45)\nNew York Knicks ML (1.40)\nPortland Trail Blazers ML (1.62)\n#NBA #nbapicks #NBATwitter https://t.co/GQi2GGwiMW",
    "51": "Thibs should go with a young lineup. Nobody but Thibs wants to see Kemba...\n@nyknicks @NBAonTNT @NBA https://t.co/ZW9dQV0LuC",
    "52": "@JBlaze1225 @sportsTemplate @nyknicks @RjBarrett6 @J30_RANDLE @drose @IQ_GodSon @TajGibson @NY_KnicksPR @TheKnicksWall @BR_NBA @CBSSportsNBA @NBA @ESPNNBA @NBAonTNT appreciate it!! thank you :)",
    "53": "@hoopr2k @sportsTemplate @nyknicks @RjBarrett6 @J30_RANDLE @drose @IQ_GodSon @TajGibson @NY_KnicksPR @TheKnicksWall @BR_NBA @CBSSportsNBA @NBA @ESPNNBA @NBAonTNT Jersey design is 🔥🔥🔥 forgot to mention that",
    "54": "@sportsplug3russ @sixers @PelicansNBA @LAClippers @Pacers @ATLHawks @nyknicks @MiamiHEAT @warriors That good?",
    "55": "@TBrown_80 New York Knicks https://t.co/6EYrZKVwAU",
    "56": "This is a must win game for the New York Knickerbockers!!!\nLet’s go #Knicks",
    "57": "@nyknicks bring him home https://t.co/ixIhjwZNFZ",
    "58": "@nyknicks @TheGarden @MSGNetworks @BetMGM RJ going for 30 tonight",
    "59": "@nyknicks We’re 12-14 at home",
    "60": "@nyknicks Best drip in the league. That’s important stuff",
    "61": "@nyknicks Shut up",
    "62": "@nyknicks I would like to see Cam Reddish tonight",
    "63": "@nyknicks u guys stink",
    "64": "Good to be home. #ULTRADrip https://t.co/mCknQPeso5",
    "65": "New York Knicks",
    "66": "@NYCritix @nyknicks Would you pay him a supermax? https://t.co/S7LNT3om1f",
    "67": "@pal_shenanigans @nyknicks Facts. These boys need something tho. Lmao 🤣",
    "68": "@NBA @nyknicks #nbatraderumors THE ONLY PLAYERS THAT SHOULD BE AVAILABLE FOR TRADE SHOULD BE THE STARTING 4(except for RJ) IF YALL TRADE ANY OF THE YOUNG GUYS YOU’LL RUIN THE FRANCHISE",
    "69": "@GarryRedman @nyknicks Could laughably bad, or these could be build blocks.",
    "70": "@ba4hire I’ll start with the the New York Knicks. I was around 16 the last time they won a championship. I was around 12 for the Jets SB win. I’m 64 now.",
    "71": "@nyknicks RJ! What is best in life? \n\nTo crush your enemies in battle.\n\nTo see them driven before you. \n\nAnd to hear the lamentation of the women.",
    "72": "Interim Kings coach Alvin Gentry says De’Aaron Fox will be out again vs. the New York Knicks tonight after missing the past four games due to left ankle soreness. Fox has been out since Jan. 19.",
    "73": "Came to New York as a consolation prize, fans immediately aren't happy with him. Then he goes and has an incredible 2nd season, earns Most Improved Player award and gets second-team All-NBA. Knicks get #4 seed in playoffs.",
    "74": "New York can’t get an NBA free agent to even look they way bt it’s the go-to destination for top WNBA free agents this year 😂😂😂 maybe Knicks should call up the Liberty front office for some tips",
    "75": "That was one dumbass New York radio guy that the entirety of the Knicks fandom aggressively shat on for that very take. Don’t put that evil on us fam https://t.co/3K5LOyvGYW",
    "76": "@LFCEoin_ @nyknicks I mean anything is better than now so ok",
    "77": "@oldham_grant @nyknicks Ingram can play pf",
    "78": "@LFCEoin_ @nyknicks we could use a SF but need a PG first",
    "79": "@NBA_NewYork Bottom 5 in FG% in the paint is sad . I guarantee knicks have the most missed dunks this season. Another reason is randle barely scoring in the paint both his FG% &amp; the teams would be higher. Besides that RJ is ehh at the rim but getting better. Noel bad at the rim, we need 🌹.",
    "80": "@oldham_grant @nyknicks Why not",
    "81": "@sitefs4 @nyknicks need a PG instead",
    "82": "@LFCEoin_ @nyknicks hell no",
    "83": "@DaniloPR70 @nyknicks Nah bro it’s all about the go-gurts",
    "84": "The Dallas Mavericks have a Jalen Brunson dilemma. The New York Knicks need a true point guard. Might the two sides work out a deal before the Feb. 10 NBA trade deadline?\n\n#NewYorkForever | #MFFL | #NBATwitter | @getsMart_5  https://t.co/iLEJw9ZnDd",
    "85": "1-31-2022 ACTION⬇️\n\n•NBA•🏀\nNew York Knicks -6 (1U) \n#NewYorkForever",
    "86": "@LegionHoops @nyknicks  get him back replace Fournier",
    "87": "(Sports Predictions on 31 Jan 2022, 16:00)\n\nbasketball NBA 2022-01-31 19:30:00\nNew York Knicks – Sacramento Kings – Win: 1 (1.46)\n\nhttps://t.co/aFB2CB8R57",
    "88": "Happy 1️⃣6️⃣0️⃣ To Rhum #Barbancourt🎈 \n@nyknicks' own @NerlensNoel3 pour le 'Rhum Des Connoisseurs'\nhttps://t.co/EyiUdUovVX 🙏🏿 An'n Fe Sa...an alé! https://t.co/JwoFJPjXno",
    "89": "@Grusso2005 @nyknicks True He is faking it and is ghosting new Orleans now",
    "90": "@hhpthebook @TheEMillioEgBar @nyknicks if Leon gets rid of Randle, Thibs won't have a choice but to play Obi",
    "91": "Any bearcats live in New York, New York? I found a guy selling a Kenyon Knicks jersey, but he doesn’t ship 😒. I’ve been hunting one for my collection",
    "92": "@nyknicks I have a question regarding tickets can you please check DM? Thank you @nyknicks",
    "93": "@nyknicks we’re gonna lose this team is a disappointment and we suck. still love y’all tho",
    "94": "@nyknicks Got mucho work to do. Thibs needs to give the starters some Sunny D and maple bars before tip off. We need to be hella wired keep that energy level up. Can’t be getting in these 25 pts holes early in the game only to hustle back and fall short.",
    "95": "“Most teams expect the Trail Blazers to extend Lillard for another couple of seasons at roughly $100 million, but if that goes south, the New York Knicks may be his next destination over the Sixers.” 🤔 https://t.co/cBUHJvjviM",
    "96": "The total has gone “under” in the last 6/7 matchups between the Kings and Knicks. \n\nTonight, they matchup in New York. The total is 212.5. \n\nTrend Says: Under 212.5\n\n💎🚀🌕\n\n#GamblingTwitter https://t.co/2cBOjF7UlP",
    "97": "Maybe Patrick Graham will be the new Herb Williams? @Giants @nyknicks",
    "98": "The Sacramento Kings (+6.5) are up against the New York Knicks (-6.5) at 7:40 PM EST today.\n\n0% of Shark Pick users are taking SAC (+6.5, -110) and 100% are taking NYK (-6.5, -110).\n\nWho do you like?",
    "99": "@nyknicks @MattressFirm Dude i feel is forgotten overall. Really should be talked about more.",
    "100": ":Former GM Proposes LA Trading Russell Westbrook to the New York Knicks https://t.co/2DmylQjREY via @@eeulau",
    "101": "Tonight’s Knicks game against the Kings feels like the Mavs game before the Porzingis trade. I wonder how many Kings players will stay in New York…",
    "102": "The New York Knicks? https://t.co/1EQRdtDWKO",
    "103": "#OTD in (Recent) Sports History: The Dallas Mavericks acquired big man Kristaps Porzingis from the New York Knicks. (2019)\n\nIn three seasons, Porzingis is averaging 20 points and 8.8 rebounds per game. #MFFL\nhttps://t.co/WDVkuxajMv",
    "104": "Game day with the new @mitchellandness @nyknicks @therealoak34 #hwcswingmancollection \n#freeoak https://t.co/PE2KA1uzjr",
    "105": "The New York Knicks fan base have 0 idea on how to build a team and the FO is poor at executing what coach Tom Thibodeau needs.\n\nThe fan base is trying to replace bad defensive players with other bad defensive players.\n\nThibs wants defensive players but they keep chasing sieves.",
    "106": "The Jazz have had a 'DISASTROUS MONTH!' - Tim Bontemps on Utah's struggles | NBA Stock Report #NewYork #Knicks #NBA https://t.co/JNDyl4YpdP",
    "107": "@ForeverKnicks_ @nyknicks Lnao do what you got to do",
    "108": "New York Knicks: Report: No Mavs-Knicks active trade talks about Jalen Brunson https://t.co/oFZxWj2f2B",
    "109": "New York Knicks rc lot\nQuickley and Toppin\n$12bmwt\n@HobbyConnector @sports_sell https://t.co/wAycU2QTie",
    "110": "@knicks81 @nyknicks Do it yesterday",
    "111": "#NBA\n\n@nyknicks -6\n\n@Rich_Holmes22 \nOVER 18.5 Pts rebs\n\n@23savage____ \nOVER 17.5 Pts rebs",
    "112": "Tweet #2! Where are my @nyknicks fans at?! I need some followers! I will stay vocal and I will follow back! Let’s hear it Knicks fans! #NYKnicks #KnicksLife #NY4Life #KnicksTwitter #Knicks",
    "113": "@nyknicks Just want the tix",
    "114": "🚨New York #Knicks fans. I have an important QUESTION for YOU regarding Julius Randle &amp; the #NBA Trade Deadline...👀\n\n#NewYorkForever #KnicksTape \n📹https://t.co/n0Plwz3eVg https://t.co/tAdYejJcf4",
    "115": "The Sacramento Kings will look to avoid their seventh-straight loss when they face the New York Knicks at Madison Square Garden this afternoon 🗽 \n\nHere's what happened on Saturday in Philadelphia:\nhttps://t.co/P3sOPsbupx",
    "116": "\"My New York Knicks 'phamily'\" is exactly how I want them to be. https://t.co/DVr3GYlsT9",
    "117": "@hoopr2k @sportsTemplate @nyknicks @RjBarrett6 @J30_RANDLE @drose @IQ_GodSon @TajGibson @NY_KnicksPR @TheKnicksWall @BR_NBA @CBSSportsNBA @NBA @ESPNNBA @NBAonTNT The info on the left would’ve been a nice addition to the tag on the right",
    "118": "No skin in the game but I'm cheering for @Bengals. Burrow seems like a fun dude and as a @mets/@nyknicks fan, I know what it's like to have your teams routinely mocked",
    "119": "Bring me this type of joy again @nyknicks https://t.co/VcV2oormz8",
    "120": "@larrymallory520 @nyknicks Ain’t no way Utah takes that trade my man",
    "121": "Another incredible moment from our interview with @Herring_NBA, author of Blood in the Garden: The Flagrant History of the 1990s New York Knicks. Chris tells us about how meaningful it was to have Spike Lee’s support. Download today’s full episode now if you haven’t already! https://t.co/jOUc5ZcmPw",
    "122": "The @nyknicks can offer Fournier Burks And Kemba To the Utah Jazz For Donovan Mitchell I think we should Make this Trade Before Feb 10th",
    "123": "@23savage____ Then make your shots! Besides the @nyknicks as is now, are not going anywhere. Need trade asap.",
    "124": "Due to the postponement of our trip to New York we now need to sell some NBA tickets. We have 4 tickets for NY knicks v Brooklyn Nets (local derby) on 17th Feb at Maddison Square Garden. If anyone is going to NY or knows of anyone going please get in touch.",
    "125": "my @RjBarrett6 jersey just got here &amp; HOLY SHIT! Its so clean🥶🥶 see you in March @nyknicks 😤🔥",
    "126": "ALERT: New high roller bet posted!\nA bet has been placed for $8578.07 on New York Knicks - Sacramento Kings to win $8,981.43.\nTo view this bet or copy it https://t.co/qWtb9GEl5i https://t.co/uCtEYrCW2z",
    "127": "@keeferfer @knicks81 @nyknicks We should be in SELL mode &amp; move all our vets except DRose &amp; Taj.",
    "128": "@keeferfer @knicks81 @nyknicks I’m definitely on board with moving Kemba, Burks , Fournier &amp; Noel. However I think a contender could use Fournier. So I may hold onto him unless the price is right.",
    "129": "@dAvId53738733 @nyknicks your best player currently is Amir Coffey.",
    "130": "@nyknicks It's only a matter of time for RJ",
    "131": "@nyknicks so I can \"sleep on them\" even more... not funny now.",
    "132": "@keeferfer @knicks81 @nyknicks Harrison Barnes &amp; a pick Straight up for Randle may work. He’s on an expiring contract in 2022-23 season( about $20 MM ). It’ll free up cap space. And gives us flexibility. Not investing $30-$40 MM for another 4 years. We’re not win now. We can do better.",
    "133": "@nyknicks You ain’t doing shit , stop it",
    "134": "@AnthonyyFor3 @nyknicks Pop off 🗣",
    "135": "@hhpthebook @nyknicks Those aren't the players generating criticism though",
    "136": "Bought these @NYKnicks Custom #ChuckTaylor @Converse a few years ago and never wore them… Until tonight. Headed to @TheGarden to see the #Knicks take on the @SacramentoKings. The rest of the outfit is pictured as well. #NYK #MSG @NBA #basketball #hoops 🏀 💙 🧡 https://t.co/KA0MOFQTbI",
    "137": "@meleehardlol y is prog always wearing knicks colors too? thats so new york i love it",
    "138": "@nyknicks Locked*",
    "139": "New York Knicks Predictions and Preview for 1/31/2022 hosts Sacramento Kings.  Looking for betting action?  Find out if there is any value in our preview. #SportsBetting #Sportsbook https://t.co/dv0tkq0jsS",
    "140": "@Grusso2005 @nyknicks I’d rather boo Randle than watch Zion in street clothes",
    "141": "@knicks81 @badseedsteve @keeferfer @nyknicks Hell yea. But why would the kings do that.",
    "142": "@papa_gardner11 @nyknicks At this point I might take the mattress over the tickets with this team",
    "143": "@nyknicks Y’all selling mattresses now 😂😂😂",
    "144": "@nyknicks A fucking mattress 😭😭",
    "145": "New York Knicks Predictions and Preview for 1/31/2022 hosts Sacramento Kings.  Find out who we are taking in this matchup. #SportsBetting #Sportsbook https://t.co/dv0tkq0jsS",
    "146": "@nyknicks Just say tickets who tf gets enticed by a mattress",
    "147": "@nyknicks A mattress?",
    "148": "A chance for Knicks tickets, a mattress, and more.\n\nClick the link below for an opportunity to win big!",
    "149": "@RexChapman New York Knicks subway token logo https://t.co/WRAuABC29r",
    "150": "@gregarmstrong01 @Herring_NBA @nyknicks Ha thanks Greg !",
    "151": "@nyknicks First graphic in a long time without Knox it’s weird",
    "152": "Back NEW YORK KNICKS to BEAT Sacramento Kings tonight in the @NBA (Game Starts at 00.40 GMT) #NBA #Basketball",
    "153": "“A 1st-round exit for the Jazz could have Mitchell setting his sights on New York”\nWhen are you stupid ass media types gonna get it through your skull that no one wants to play for the Knicks anymore? There is no appeal there now, players can see The Garden in away games lmfaoo https://t.co/EmyXayfcGq",
    "154": "@coachjay_vee @BlessedAdam_ @SScream051 @michaelkasdan @hhpthebook @nyknicks if tyler herro had to take rjs role he would be terrible at it different situations but for herro to be on a team where all he asked to do is score definitely helps",
    "155": "@ForeverKnicks_ @nyknicks Haha that’s rough hope you go with the better decision 😂😂😬🙏",
    "156": "@ForeverKnicks_ Lmao seriously and it’s the kings too i like some of the players but yeah this must win for @nyknicks  need the garden to be jumping",
    "157": "@TBrandon84 @TooterMcGavin @JamesIhedigbo Imagine if the lions had a top market city, maybe like New York, and still haven’t won anything since the 80s? That would be the Knicks.",
    "158": "@Traticaster101’s Podcast is on YouTube now. Can’t wait to see what Ari has to say in this episode. Definitely subscribe to it!\n\nThe future of the New York Knicks w/ Ari from Manhattan https://t.co/p3FC2WeInf",
    "159": "@BlessedAdam_ @TonyDaniel03 @SScream051 @michaelkasdan @hhpthebook @nyknicks RJ better at finishing? Ur clouded. I can say i love the way RJ is playing. But he is not better than Herro. Did u see the last time we played Miami",
    "160": "The Kings will face the New York Knicks tonight without Marvin Bagley III (ankle) and Terence Davis (wrist).\n\nDe'Aaron Fox (ankle soreness) is questionable.\n\nInjury updates: https://t.co/0lcORjuYOf",
    "161": "📅GAME DAY📅\n\n🏒 @NJDevils at 7:30pm\n🏀 @nyknicks at 7:30pm\n\n#NJDevils #NewYorkForever",
    "162": "NBA Betting Preview: New York Knicks vs. Sacramento Kings - Monday, January 31, 2022 https://t.co/AK1j0Wpm8U",
    "163": "@nyknicks This goes so mf hard",
    "164": "Lakers: Former GM Proposes LA Trading Russell Westbrook to the New York Knicks 💥👩👩💥 #New_York https://t.co/wI0XpehVW5",
    "165": "@knicks81 @nyknicks Do we do this? @alanhahn",
    "166": "@ZachBetta_ That y’all want a PG but it’s not brunson, I’ll just copy text: “there are no active trade discussions between the Mavericks and the New York Knicks, for example, despite the Knicks' well-chronicled interest in luring Jalen Brunson”",
    "167": "@Knicks_SNOB @nyknicks Can I borrow that pic",
    "168": "@nyknicks i am thinkin about going 5-14 from the floor with the fellas later",
    "169": "@hopefulmetsfan @nyknicks He’s about the only one who is?",
    "170": "@badseedsteve @keeferfer @nyknicks Let me hear your trade suggestions then sir",
    "171": "@knicks81 @nyknicks Kings say hell no.",
    "172": "@nyknicks 2022-23 season.  Knicks starting five: Barrett, Grimes, Robinson, Reddish and Zion.  Bench: Rose, Quickley, Obi, Jericho and Fournier.  I had trouble figuring out the bench because of Our possible Brunson trade. Idk why I still have Fournier. Nobody wants him",
    "173": "@Richard35981948 You are trusting the New York Knicks to help you cash a parlay. That's the first mistake.",
    "174": "@dAvId53738733 @nyknicks Say a flipper fan https://t.co/VqYzRMznK9",
    "175": "@nyknicks 3-0 week just trust",
    "176": "ESPN’s Bobby Marks voiced that he believes the New York Knicks could offer a deal that sends Russell Westbrook to Madison Square Garden.\n\n#Knicks | #Lakers | @bgarciaivsports  https://t.co/8mGmOfeuCP",
    "177": "@nyknicks the Knicks starting five next season.  Brunson, grimes, Barrett, Robinson, and no other then Zion Williamson.  I would completely forget this season and Julius Randle if this were to happen.  Anybody else?",
    "178": "@nyknicks i truly believe the Knicks are preparing for a Zion Williamson deal after the season.  Honestly, i fell Zion is done in New Orleans anyway and he’s milking this BS over his weight because he wants out.  He will be back to form and on the Knicks next season.  Anybody ??",
    "179": "A team built around 25 year old R.J. Barrett will dominate the league for AT LEAST 5 years....\n\nBe patient.\n\n#NewYorkForever \n#NewYorkKnicks",
    "180": "@nyknicks Show some respect to the 👑 of New York. https://t.co/dqfTFCDwa4",
    "181": "Marc Stein reports that “there are no active trade discussions between the Mavericks and the New York Knicks, for example, despite the Knicks' well-chronicled interest in luring (Jalen) Brunson to Gotham.” https://t.co/ysryD7rzS0",
    "182": "@badseedsteve @knicks81 @nyknicks Who would you target knowing what assets we have available?",
    "183": "@knicks81 @nyknicks Easily",
    "184": "@knicks81 @nyknicks Maybe. Would like to not send that first though.",
    "185": "The #Knicks allowed 123 points to the #Bucks Friday but could be in line for a bounce back.\n\n#NewYorkForever is 12-2 ATS since 2/27/21 when they allowed 118+ points last game.\n\nIn 6 of the 7 active games this season, New York allowed no more than 96 points.\n\n#SDQL #NBA #Kings https://t.co/XXZzgWAPf5",
    "186": "@nyknicks More like \"game day... How we gonna mess this one up\" face.",
    "187": "@nyknicks Yea that’s why we have a losing record at home",
    "188": "@nyknicks Keep balling @23savage____ 💪🏾💙",
    "189": "@__Shank @nyknicks @J30_RANDLE and Tom Thibodeax",
    "190": "@TonyDaniel03 @ahowardh @nyknicks @MitchRobinson05 Not his fault. Blame Randle and Thibodeax",
    "191": "Trouble brewing, I've said it. He's #selfish and needs to go. @nyknicks pick up someone who wants to be here. #randlesucks #randle #juliusrandle #knicks #nyknicks @nypost #nyc #NBA https://t.co/L28KN1Ytsu",
    "192": "We got burks for you..hit the line @nyknicks https://t.co/Ksz4o3tdWJ",
    "193": "@sloprules Knicks kings , feels like a Mitchell robinson game to me John. +400 for a Mitch DD and New York to win.",
    "194": "@keeferfer @knicks81 @nyknicks He can ? He’s a bottom 10 player Defensively in the league. He’s shooting 24% from 3. He’s absolutely awful Off ball &amp; he’s due to make close to $40 MM annually. We can do better.",
    "195": "@BlessedAdam_ @TonyDaniel03 @SScream051 @michaelkasdan @hhpthebook @nyknicks You think RJ is better than Herro? At what? Tyler has made all rookie team. Had big playoff games and shooting 10pts higher from field.",
    "196": "@MikanFanClubCEO @nyknicks @OrlandoMagic @SacramentoKings @LAClippers Why would the Magic want him",
    "197": "@nyknicks trade them Burks this very minute plz @KnicksNation https://t.co/tzmx7l9RLq",
    "198": "@nyknicks Awesome! Let's go Knicks!!!",
    "199": "@nyknicks 3 losses incoming",
    "200": "Quickley/Cam/RJ/Obi/Robinson are such a solid young group of players to build around yet the @nyknicks are going to waste this too, trusting caveman Thibs to waste their years while they’re cheap. @stephenasmith @ESPNNBA",
    "201": "@nyknicks I am once again asking you to trade Julius Randle to China",
    "202": "@HonestTrumpster @nyknicks Why on earth would we trade grimes",
    "203": "@hhpthebook @nyknicks Your right, this draft the Knicks got such a steal with all there talented players. Especially Jericho Sims.",
    "204": "@nyknicks A celebration 🥳 🎉",
    "205": "@HonestTrumpster @nyknicks It’s simple. I see a stupid post. I ratio it.",
    "206": "@nyknicks Ratio, not a real country",
    "207": "Wishing everyone a Happy Year of the Tiger! #LunarNewYear\n\n新春贺岁 | 🎨: doh_ah_deer/IG https://t.co/AToiYuzwhE",
    "208": "The latest on @drose and what @nyknicks have to do to turn it around @KnicksMSGN with me @RebeccaHaarlow @McNuttMonica @alanhahn and @wallyball see u at 7 https://t.co/jeimFjODhU",
    "209": "Big Apple business leaders hail Adams’ ‘courageous’ anti-gun violence plan #NewYork #Knicks #NBA https://t.co/AtxXLdN43E",
    "210": "@nyknicks @TheGarden @MSGNetworks @BetMGM GAME DAY 😤🔥",
    "211": "@wojespn That sucks, now trade Donovan Mitchell to the @nyknicks  please.",
    "212": "@MikanFanClubCEO @nyknicks @OrlandoMagic @SacramentoKings @LAClippers I like this thread",
    "213": "@hhpthebook @ascrolove @nyknicks I didn't mean KD specifically. I just believe if you can land a star or very good player in the prime of their career, it would be worth it to me to trade a couple of the younger unproven guys for him. Potential is great, but players need to play regularly to reach that point.",
    "214": "@nyknicks Get this man some help please! 🙏🏽",
    "215": "#NewYork, listen up! Your #Knicks are favored by 5 over the Kings tonight, but can they cover? Our #NBA model is on an epic 62-32 roll. It's got a strong pick that hits over 60% of the time! 🏀🗑️💰\n\nGet #SportsPicks here!\nhttps://t.co/AmlUiznFHu",
    "216": "@nyknicks Who cares same lineup same result",
    "217": "@hhpthebook @nyknicks @MzSweetFeet On it. #PushLetsGo",
    "218": "@nyknicks Tank for Johnny Davis",
    "219": "Quentin Grimes plays basketball today🔥LFG! @nyknicks @qdotgrimes #NewYorkForever https://t.co/OoEWFQ6W4K",
    "220": "@hhpthebook @nyknicks Great Post Bro!",
    "221": "@MzSweetFeet @ascrolove @nyknicks KD always injured now",
    "222": "@diandraann Impossibility\n\nAt worse Utah Jazz, New York Knicks, Cleveland Cavs, Detroit Pistons and Boston Celtics fans were closet Jordan fans.  At worse",
    "223": "@ascrolove @MzSweetFeet @nyknicks Let's hope not",
    "224": "@hhpthebook @nyknicks Facts. I definitely feel like the roster is valid just the rotations is SUS...#lovemyknicks🧡",
    "225": "@GiIIyDaKid @nyknicks @Knickanators @KnicksMSGN @TheKnicksWall I’m getting to that point unfortunately… I’ve been watching college basketball more and more the last few weeks 😓",
    "226": "@CAPTAINPEARLNYK @Herring_NBA @nyknicks Nice!! Now that’s a good place to read a book!",
    "227": "@FanDuel New York Knicks",
    "228": "@queens_dude @jfromflorida1 @nyknicks Well I mean @ that time.. not necessarily now.. in hindsight NOLA shoulda took Ja..but @ that time the NBA was going to lose a star in a small market so let’s say NOLA woulda been 8th or so that team woulda been done and Memphis had been trending down, they had to get stars there",
    "229": "@johnnyjohnjon83 @jfromflorida1 @nyknicks Zion isn’t helping Nola now…he doesn’t want to be there",
    "230": "@knicks81 @nyknicks YES and I will pack their bags too.",
    "231": "@sitefs4 @nyknicks But with those older guys we could go and chase a true point guard",
    "232": "@ascrolove @hhpthebook @nyknicks Depends on the cost.. Having 9 young players with potential is great but they all can't play 30+minutes per game and there is no guarantee they all develop. So yes consoldating a few of them for a star like KD is something you have to consider doing.",
    "233": "@nyknicks Everyone grab your tickets for the depressed knicks space 😓",
    "234": "@sitefs4 @nyknicks Idk man Mitch should stay and we should pay him somewhere between 10-15 million a year, trade kemba fournier Noel for younger guys, \n\nQuickley\nRj\nCam\nIngram\nMitch \n\nIs a very good team",
    "235": "@JDSportsTalkNY @nyknicks @TheCohencidence @KnicksFilm @KnicksFanTv @KnickFilmSkool @JCMacriNBA Yes, it's the one that was posted today.\n\nhttps://t.co/wXopKGp9py",
    "236": "@queens_dude @jfromflorida1 @nyknicks Bad for us but to Silver good for NOLA and Memphis",
    "237": "@knicks81 @nyknicks Yes. You get a PG who can defend and push the pace. Bagley is expiring. Move off Kemba and Randle. Pick is protected.",
    "238": "Today's NBA Consensus (So Far):\n\nAtlanta Hawks 71%\nNew York Knicks 69%\nMemphis Grizzlies 65%\nGolden State Warriors 65%\nMiami Heat 62%\nCleveland Cavaliers 60%\nOklahoma City Thunder 54%\nLos Angeles Clippers 52%",
    "239": "If they could have fun together watching the 2021-22 New York Knicks, I think they’ll be ok https://t.co/TnXioaMCgw",
    "240": "@sitefs4 @nyknicks I love ant but I don’t think this helps us at all. Ingram for randle makes more sense to me",
    "241": "@nyknicks Nah im done 🚪🚶 https://t.co/LocbSSU2yI",
    "242": "@knicks81 @nyknicks Yes from me.",
    "243": "🏀Sacramento Kings vs New York Knicks🏀\n📝Richaun Holmes Under 11.5 points\nhttps://t.co/tMaT8nj80m\n@Oddseliten",
    "244": "When are we getting rid of Randle? @nyknicks",
    "245": "November 2010 through January of 2011*\n\nOh, and that team snapped their 12-game road losing streak... at Madison Square Garden against the New York Knicks.",
    "246": "@EUGENECSH @hhpthebook @nyknicks The trolls have arrived. If you seriously think Fourniers contract is unburdensome you are living on another planet. Kemba is broken down and can't play D against PG's. He's basically unplayable in a playoff series. You can ask the Celtics about that",
    "247": "@IVTheKnicksFan \"The New York Knicks play basketball today. Rejoice (or drink) accordingly\" .... pass me the bottle!",
    "248": "@jfromflorida1 @johnnyjohnjon83 @nyknicks Big facts!!!!   Silver let the NBA down—even the Knicks hating media—by gifting Zion to New Orleans instead of NYC.  I said it then that it was bad business",
    "249": "@CAPTAINPEARLNYK @Herring_NBA @nyknicks brilliant! i changed my porzingis jersey to say \"Not Porzingis\" but this is way more creative.",
    "250": "@hhpthebook @MzSweetFeet @nyknicks I love that post. High 5 to Leon Rose. But according to the history of the Knicks, They would tear that whole pic down for one used up super star player. Would you tear it down for KD? ….I wouldn’t…..But I’m sure Dolan would. He’d over step Leon 4 KD.",
    "251": "@hhpthebook @nyknicks it's been the coach. all the way. had the power to turn it around multiple times, lots of opportunities, but just stuck to the same ol, same ol = very measly plan of giving julius the ball. he's been a negative for the team this season",
    "252": "NEW 🏀NBA betting picks:\n\n🔒Los Angeles Clippers +4\n🔒Memphis Grizzlies ML\n🔒New York Knicks ML\n🔒Portland Trail Blazers ML\n🔒Cleveland Cavaliers -7\n🔒Golden State Warriors -9\n\n #NBAPicks #bettingtwitter https://t.co/dQ2UILZByn",
    "253": "@PhilRieth not a knicks fan???? does she live in new york even!!!",
    "254": "@dan_ny_b @Herring_NBA @nyknicks Thx bro",
    "255": "ANOTHER Brunson piece comes out today, this one by Marc Stein: \n\n\"League sources say there are no active trade discussions between the Mavericks and the New York Knicks, for example, despite the Knicks' well-chronicled interest in luring Brunson.\"\n\n(via https://t.co/YmNOmlcm1l) https://t.co/GtgHbaNgTb",
    "256": "@23savage____ #uncompetitive we all know yall don't give a kcuf . You see @J30_RANDLE @nyknicks are the only team in the world that \"puts forth effort\" and \"prepares\" with shiddy results.\nPeople back home don't get to not show up for work.\nAlso @KembaWalker is a bad human being doing that",
    "257": "@nyknicks GET WITH THE PROGRAM 🟠🔵🟠🔵 https://t.co/Xyil5UHgRD",
    "258": "@nyknicks Accordingly",
    "259": "@EUGENECSH @nyknicks @MzSweetFeet Just disagree and bring the info. I do agree that both contracts are tradeable",
    "260": "@CAPTAINPEARLNYK @Herring_NBA @nyknicks Enjoy it DP!",
    "261": "@NBA2K @RjBarrett6 @nyknicks Mans been going off lately. Mad respect",
    "262": "@rads619 @Herring_NBA @nyknicks Ha yea I don’t like to waste so if I can repurpose….  And thx - we are very lucky",
    "263": "BCAHA1L3\n\nHome\nAtlanta Hawks v Toronto Raptors\nWinner (incl. overtime) 2.03\n\n Home (10:0)\nHouston Rockets v Golden State Warriors\nHandicap 10:0\n1.97\n\n Home (0:6)\nNew York Knicks v Sacramento Kings\nHandicap 0:6\n1.94\n\n8.00 ODD",
    "264": "@nyknicks What home court?",
    "265": "【Stock information】NEW YORK KNICKS / CAP / https://t.co/SmFVYQ1GaO",
    "266": "@ahowardh @nyknicks @MitchRobinson05 he’s about the only one",
    "267": "To all my @nyknicks fans living in #NewYorkCity. @DKSportsbook is offering a 50% boost for a single game parlay for tonight’s #Knicks vs #Kings game. I’m taking #Knicks money line, Barret over 19.5 points, and Robinson over 6.5 rebounds. #DraftkingsLovesNY #bettingpicks #NBAPicks",
    "268": "@knicks81 @nyknicks I repeat i will drive them myself",
    "269": "✅yes ❎no talk to me nice @nyknicks fans 🤔 https://t.co/PbyVnsTsuq",
    "270": "@nyknicks Then protect home court: actions speak louder than words",
    "271": "@ahowardh @nyknicks @MitchRobinson05 Facts",
    "272": "@hhpthebook @nyknicks @MzSweetFeet her last tweet is nonsense both Dallas and Utah both are in need of starting 2 and both Evan and Kemba contracts are unburdensome and easily traded.",
    "273": "@knicks81 @nyknicks Get some 2nds back for Walt Perrin to work his magic",
    "274": "New York Knicks vs. Sacramento Kings: Betting odds, predictions https://t.co/dDSlC87otB",
    "275": "Last Night’s #Knicks Weekly show brought out the STRESS in New York Knicks fans. Woahhhhh Woahhhh!! \n🤣🤣👀🤭😤\n\n#FamilyShow #NewYorkForever https://t.co/wFCsSAFv8l",
    "276": "@OrlandoMagic @WashWizards @nyknicks @HoustonRockets @okcthunder @SacramentoKings @celtics @nuggets @trailblazers GO GET THISWIN ON WEDNESDAY GUYS!!!YES YOU GUYS CAN DO THIS!!!YES YOU GUYS CAN WIN AGAINST THISTEAM!!!!!!YESYOUCAN!YESYOUCAN!!YESYOUCANGUYS!!!!!GO OUT THERE ON THE,,,",
    "277": "@drmaryeb @nyknicks I wish I could go back a change some of these pics. But we can't. Got to go with what we have...but I agree could have gotten some great players. Although in hindsight",
    "278": "@nyknicks So fuckin play better @MitchRobinson05 and stop letting the fans down",
    "279": "@KnicksCentral It’s them New York knicks fans that’s delusional",
    "280": "@nyknicks Make it happen https://t.co/Kg4pWBsCS6",
    "281": "Hoy a la 01:30 h. New York Knicks vs Sacramento Kings.",
    "282": "BCAH9U41\n\nHome\nIndiana Pacers v LA Clippers\nWiner\n1.71\n\nOver 205.5\nBoston Celtics v Miami Heat\nOver/Under\n1.76\n\nHome\nNew York Knicks v Sacramento Kings\nWinner\n1.40\n\nHome (+15.5)\nHouston Rockets v Golden State Warriors\nHandicap 15.5\n1.51\n\n6.50 ODD\nNBA basketbal",
    "283": "@11Jayt @ProperMIDDLEMAN @nyknicks I got to go with you on this, you're right.",
    "284": "@nyknicks Best fans in the world for sure.. those hype videos outside the arena last season were the best. Not too late to turn things around tho.. let’s go Knicks",
    "285": "@nyknicks Then why haven't we been winning?",
    "286": "THE DEBUT OF THE BIG 3! NEW YORK KNICKS MYLEAGUE EPISODE 2 ON NBA 2K22 NEXT GEN IS LIVE!!\n\nhttps://t.co/FI099WdQTh\n\n@SGH_RTs @FatalRTs @Quickest_Rts @Big_Brudda_PURP @WalkOnWarriors @SmallStreamersC @SmallStreamersR @smallstreamerco @SmallStreamSup @small_united https://t.co/acHJVnYU81",
    "287": "@povertybucksfan @nyknicks I no a bucks fan  ain't talking about winning this season Lmao",
    "288": "@nyknicks 🙄🙄🙄 yall be down 13-3 in the first four minutes, stop it",
    "289": "I got lucky again @nyknicks https://t.co/ZSjPuSS20S",
    "290": "New York Knicks: The New York Knicks:  have a Julius Randle problem https://t.co/PoDX2AfS4d",
    "291": "new york knicks https://t.co/sC4IYpAv9a",
    "292": "@KevinOConnorNBA @Jason @BillSimmons @TheCousinSal - The New York Knicks story.",
    "293": "@nyknicks lets get it!",
    "294": "@nyknicks Got winning to do this week",
    "295": "Lakers: Former GM Proposes LA Trading Russell Westbrook to the New York Knicks https://t.co/T5zzeYd0FQ (Called it: Westbrook is talented. But before his Laker-Residency, I SHOUTED: \"@Dame_Lillard\" Who 'was' a viable option. @Lakers didn't try hard enough to get.) @Florenc39933400",
    "296": "@CryptoHoopers @RjBarrett6 @nyknicks Love it!! https://t.co/DvQZUfuuMg",
    "297": "@CAPTAINPEARLNYK @Herring_NBA @nyknicks the makeshift grimes onesie, the book, the beach - amazing",
    "298": "@nyknicks Yes, a big TRADE",
    "299": "We gonna see some trade action this week @nyknicks?? https://t.co/yX0ilKy86e",
    "300": "@CAPTAINPEARLNYK @Herring_NBA @nyknicks Terrific Pics!!",
    "301": "@hhpthebook @nyknicks This roster looks horrible!  \n\nYou just wasted your time with this collage of Scrubs fr rn.  \n\nWhat you should do, is look at all the players you missed behind these picks.  Knicks need a real talent scout, don't just blame the coach.  Knicks future bleak.",
    "302": "trade scenario 🚨🚨🚨🚨🚨\n3 way trade : \n@Lakers : bertans , dimwiddie , burks \n@nyknicks : westbrook and a 1st \n@WashWizards : THT , walker , fournier \n\nwho says no ?",
    "303": "@nyknicks Please Win and Trade Randle and his Ego 🙏",
    "304": "@hhpthebook @nyknicks Aren’t 5 of them are in the rotation?",
    "305": "@nyknicks Ja Morant and the Grizzlies are gonna embarass us",
    "306": "@BetMGM @nyknicks Would look great in Knicks gear as we continue to hammer the bing bong special https://t.co/9WChuO5vhl",
    "307": "@nyknicks Play Cam",
    "308": "@nyknicks Clutch up🙏🏽",
    "309": "@BetMGM @nyknicks I like the winning",
    "310": "newsone: New York Knicks, Chase Gift Bronx-Based Charter School With $100K\nhttps://t.co/hMFk0KOg7n",
    "311": "@nyknicks Trade the old guys and play the young guys",
    "312": "@nyknicks Time to tank for tyty or Ivey",
    "313": "@nyknicks Looks like 0-3 to me",
    "314": "@nyknicks yeah",
    "315": "@nyknicks The least ya can do is go 1-2 and beat the Kings tonight",
    "316": "TODAYS FREEPLAYS 1.31.22\n\n#CBB \nDUKE VS NOTRE DAME OVER 68 1H\n\n#NBA \nPORTLAND -3.5\nNEW YORK KNICKS -5.5\nGRIZZLIES -3 \n \nBONUS PLAY \nLA CLIPPERS +2.5\n\n#GamblingTwitter",
    "317": "@nyknicks RJ you are the man ! ! ! Go Knicks",
    "318": "@nyknicks If Randle starts out the way he’s been, please remove him. He’s destroying the team the way he’s been acting. #Knicks",
    "319": "@nyknicks poverty franchise trade all the veterans and get westbrook or dearron fox",
    "320": "@nyknicks We lose 🔥 thibbs n pls trade Randle after he let obi hanging",
    "321": "@nyknicks Yea a bunch of trades",
    "322": "@nyknicks Can’t get excited to watch this garbage no more",
    "323": "@nyknicks No shit",
    "324": "@nyknicks Start it off by trading Randle",
    "325": "@nyknicks Gotta win this week",
    "326": "@nyknicks All loses",
    "327": "Got work to do this week.",
    "328": "@hhpthebook @nyknicks And even tho the free agents signings haven't worked out, he was trying to make the team better.",
    "329": "@hhpthebook @nyknicks Say what you want but Leon Rose has been the best Knicks president we had in a long time, and unlike Tom Thibodeau he See's that there is a problem. Drafted great, made good to great trade.",
    "330": "@nyknicks @TheGarden @MSGNetworks @BetMGM Best of luck tonight @MsMalamed @gmoneytwothree",
    "331": "@IamIvanOmar @nyknicks @TheCohencidence @KnicksFilm @KnicksFanTv If @TheCohencidence went off, I must see it. Was it the podcast @KnickFilmSkool posted earlier today with @JCMacriNBA ?",
    "332": "@nyknicks GOAT OF THE TEAM",
    "333": "@nyknicks y'all know who the face of the franchise is.. keep this energy...",
    "334": "New York Knicks are in quicksand!\n\n@Traticaster101 &amp; @Jmeleka discuss the 3 game + (5 o/of 6) losing streak, trade deadline, &amp; should NYK front office address the fan/player tension?!\n@RealDealRaisi_K🎶\n🍎https://t.co/8SuK37h7RL\n✳️https://t.co/92frEkJqV8\n📺https://t.co/5L0Rzd7NXh https://t.co/NI8D5OCDX3",
    "335": "@josephkalaj1 @nyknicks If Burks has on a blue jersey.... Cam is probably playing",
    "336": "@Knicks_SNOB @nyknicks Yeah and that’s me being bullish about a 2-1 week..very sad",
    "337": "@nyknicks @TheGarden @MSGNetworks @BetMGM Trade Fournier and Kemba, play McBride and Reddish",
    "338": "New York Knicks, Chase Gift Bronx-Based Charter School With $100K\nhttps://t.co/fCwr7cPu8j",
    "339": "Consensus Line Move:\n2022-01-31 Sacramento Kings at New York Knicks from 214.50 to 212.50\nUnder hold the line\n#NBA #NBATwitter #ai #cash",
    "340": "@nyknicks make Spence our guard! He’d flourish with RJ 🤷🏾‍♂️I’ll take Spence dishing 10 assists a game https://t.co/fzY8ZOhsRH",
    "341": "Three years ago today the New York Knicks traded the Unicorn aka Kristaps Porzingis. That trade hasn't worked out for the Dallas Mavericks #MondayMotivation #NewYorkForever #nba #mondaythoughts https://t.co/S3yQHMUU2Q",
    "342": "About halfway through collecting all of the @nbatopshot Archive Moments.\n\nStarted with these two former @nyknicks today.\n\nVery little Collector Score incentive, but I’m a sucker for throwbacks https://t.co/dxEJfKvq6n",
    "343": "Kemba Walker’s New York homecoming has been less than auspicious, and it could soon be coming to an end between the Knicks and the once All-Star point guard.\n\n@ned7821 explains.\n\nhttps://t.co/CeyLWiG6zw",
    "344": "NBA:\nMEMPHIS - 3\nMEMPHIS/PHILADELPHIA UNDER 218 1/2\nNEW YORK KNICKS - 6\nBOSTON - 4\nATLANTA - 2\n\nCOLLEGE BASKETBALL:\nSIU EDWARDSVILLE + 2\n\nNHL:\nVANCOUVER",
    "345": "@nyknicks @TheGarden @MSGNetworks @BetMGM Get rid of this bum.\nHe's toxic.\n\nhttps://t.co/thgEO1mkWe",
    "346": "@coachthibz @nyknicks @TheGarden @MSGNetworks @BetMGM How bout u get ready to trade randle???",
    "347": "@hhpthebook @ProperMIDDLEMAN @nyknicks I feel u. But considering their relationship and Thibs’ NY ties we knew he was gonna be the guy. No one knows Thibs better than Leon. He knew what he was getting. I still think it was the right hire. But gotta see what the roster looks like after the deadline.",
    "348": "@nyknicks 3 of 3 Julius comes out of the game at 4 minute mark. Helps him keep fresh and gives Obi more minutes. Julius hasn’t said no to playing more but doesn’t mean his body has said yes.",
    "349": "@AaliyahNevaeh7 Hope they play hard, smart, and compete. Wishful thinking 😒 @nyknicks @NBA_NewYork @NBA",
    "350": "@nyknicks 2 of 3 Rose comes back, you alternate him and Kemba in the starting rotation. Helps them both w/load mgmt. Also adds wrinkles for opponents preparation.",
    "351": "@nyknicks 1 of 3 Minor changes I would make today. Put quick in the starting lineup until Rose comes back. Bring Kemba off the bench until then. Then you see what the group looks like with Quick.",
    "352": "@hhpthebook @nyknicks Can't forget Rokas Jokubaitis.",
    "353": "January 31, 1990: New York's Gerald Wilkins with a pair of \"one-hand, flying dunks\" in Boston Garden.\n\nCeltics 97, Knicks 91.\n📼 https://t.co/0FU2r8deVy https://t.co/junGGrciCT",
    "354": "@nyknicks More to the team the Julius Randles situation I get excited for the young guys even if we lost every game the future is bright and I trust Leon and know something big will happen!!!☺️",
    "355": "@Mistaruairi @nyknicks 😄 Yeah, just tell him to go to the other bench😁",
    "356": "@nyknicks @TheGarden @MSGNetworks @BetMGM Bench Randle And Fournier Please",
    "357": "asap rocky over the entire new york knicks organization",
    "358": "@nyknicks You look sooo mad. 😂",
    "359": "@nyknicks Time to take the reins, son.\n🧡RJTHEFRANCHISE💙",
    "360": "New York Knicks vs Sacramento Kings 1/31/22 NBA Picks, Predictions, Odds » Sports Chat Place https://t.co/QGbanDEiUZ\n\n#NBA #NBAPick #FreePick #FreePicks #SportsBetting #ExpertPick #NBATwitter  #ExpertBettingAdvice #BettingTipster #Handicapper #sacramentoproud #newyorkforever https://t.co/4YLs2v1Qwz",
    "361": "@nyknicks Pls win https://t.co/8yuqDDw0xU",
    "362": "@Ntilikina11Fan @nyknicks @TheGarden @MSGNetworks @BetMGM Watch Halliburton go for 40 against us",
    "363": "@nyknicks @TheGarden @MSGNetworks @BetMGM Don’t embarass yourselves like you did last week. This team is just a massive disappointment",
    "364": "@nyknicks How about you guys win",
    "365": "@coachthibz @nyknicks Yes we can 1 step closer to Jaden ivey if we lose",
    "366": "Good value on the MGM NBA Lion's Boost.\n\nSacramento Kings @ New York Knicks\nKings +5.5, over 214.5 total points boosted to +400\n\nZero vig line = ~357\nWin probability =~22%\n+EV = ~9.5%\nOptimal bet = 2.39 units\n\n#GamblingTwitter #Boost #BetMGM",
    "367": "@nyknicks @TheGarden @MSGNetworks @BetMGM don’t forget to send julius back on the plane with them",
    "368": "@coachthibz @nyknicks @TheGarden @MSGNetworks @BetMGM you been coaching ass all year og",
    "369": "Monday's #NBA75 #BettingPicks from \n@SpreadAstaire\n\n🏀Sacramento Kings vs New York Knicks: Banker at -110 (1.91)\n\n+Parlay at +265 (3.65)\n👇👇👇\nhttps://t.co/VOSOEDQbUW",
    "370": "@nyknicks Trade terrible randle",
    "371": "@nyknicks @TheGarden @MSGNetworks @BetMGM Dont Lose https://t.co/iBWZHIErck",
    "372": "Partidos de la semana de Los Angeles Lakers:\n\n2/2 🆚 Portland Trail Blazers\n3/2 🆚 Los Angeles Clippers\n5/2 🆚 New York Knicks\n\n📸 | @Lakers \n\n#LakeShow https://t.co/xNf2x5NEGF",
    "373": "@nyknicks @TheGarden @MSGNetworks @BetMGM Let's get this W 💪",
    "374": "@nyknicks @TheGarden @MSGNetworks @BetMGM LETS DO THIS THING BABY",
    "375": "@nyknicks @TheGarden @MSGNetworks @BetMGM Need this w my guys.. let’s get back on track",
    "376": "@nyknicks @TheGarden @MSGNetworks @BetMGM Introduce Randle Burks and Fournier to their new teammates",
    "377": "@nyknicks @TheGarden @MSGNetworks @BetMGM Free Cam",
    "378": "@nyknicks @TheGarden @MSGNetworks @BetMGM Idk what to expect anymore",
    "379": "Starting the week off back @TheGarden.\n\n🏀: vs. Kings\n🕢: 7:30 PM ET\n📺: @MSGNetworks | MSG GO\n#NewYorkForever x @BetMGM https://t.co/jwaf2a9sqI",
    "380": "@LWAY186 @nyknicks Don’t bother. Get him over the summer",
    "381": "@Knicks_SNOB @nyknicks Nope https://t.co/sx91uQrTUY",
    "382": "@anthonyk56 @KnicksFanTv @nyknicks @TheCohencidence @KnicksFilm @JDSportsTalkNY I completely agree with you. @TheCohencidence actually outlined the very thing you're saying - consolidating our current assets.\n\nAs for # 30, unless someone makes him accountable, he will continue to think he's Booker or DeRozan in the mid-range and the Splash Brothers on 3.",
    "383": "@IamIvanOmar @KnicksFanTv @nyknicks @TheCohencidence @KnicksFilm @JDSportsTalkNY Exactly. Knicks need to consolidate some of their depth to get an impact PG. Assets are there w intriguing young talent. Some would argue they're in good shape. Randle needs to focus on being an interior bruiser and would be fine",
    "384": "@nyknicks We trading Randle on the court tonight or what",
    "385": "@anthonyk56 @KnicksFanTv @nyknicks @TheCohencidence @KnicksFilm @JDSportsTalkNY Oh, I have. Unlike most of the Knicks fan on Twitter, I have seen the the team at their best in the 90's and at their worst during the IT and Phil days.",
    "386": "@IamIvanOmar @KnicksFanTv @nyknicks @TheCohencidence @KnicksFilm @JDSportsTalkNY Did any of you live through the Isiah Thomas years? Bad shape is relative",
    "387": "@nyknicks I think I’ll pass https://t.co/TnM4Ww8sV6",
    "388": "You know the @nyknicks are in bad shape when the usually analytical and mild-mannered @TheCohencidence of @KnicksFilm and @JDSportsTalkNY of @KnicksFanTv both go off!\n\n#NewYorkForever",
    "389": "@nyknicks Please win!!!",
    "390": "@coachthibz @nyknicks The kings are losing to themselves",
    "391": "@nyknicks If the result is a lost we gotta blow it up",
    "392": "@nyknicks Just win",
    "393": "@nyknicks FREE OBI TOPPIN",
    "394": "@coachthibz @nyknicks Change the starters",
    "395": "@nyknicks If we don’t beat the kings things must be changed",
    "396": "@nyknicks The face of the franchise: RJ Barrett",
    "397": "@hhpthebook @nyknicks Hard agree",
    "398": "@nyknicks You mean LOCK UP cause we don’t play defense like we did last year 😔",
    "399": "@nyknicks Don’t embarrass yourself tonight",
    "400": "@nyknicks Is anyone else just not even excited for game day anymore",
    "401": "@nyknicks we in the building leggo",
    "402": "Consensus Line Move:\n2022-01-31 Sacramento Kings at New York Knicks from -5.50 to -6.50\n#NewYorkForever snake in the weeds\n#NBA #NBATwitter #datascience #entrepreneurship",
    "403": "@nyknicks Win just win",
    "404": "@nyknicks Need a dub today",
    "405": "GAME DAY. LOCK IN. https://t.co/yjCYcyaBHh",
    "406": "@hhpthebook @nyknicks We need to get rid of Thibs. He did the same thing last year stubbornly kept @elfrid starting PG when everyone and their momma saw he was hurting us",
    "407": "Kings gameday live: De’Aaron Fox, Marvin Bagley III injury status vs. New York Knicks https://t.co/KDYlBCWJkL",
    "408": "all i want for my birthday today is for the knicks to win. @nyknicks can you please fulfill my wish?",
    "409": "@Knicks_SNOB @nyknicks Hints in that tweet",
    "410": "My @49ers lost but the future is bright.  Down for now. But hey at least the @nyknicks play tonight.",
    "411": "@Jason_Shetler 1998-99 New York Knicks.",
    "412": "@hhpthebook @nyknicks nice pieces but have to be realistic. If they went 100% youth movement, would probably lose a lot of games this year and next before starting to get serious. We don't have a @JaMorant or @TheTraeYoung. Would still need a true superstar or 2 to compete.",
    "413": "New York Knicks: Knicks Rumors: Thibodeau Having Trouble Getting Julius Randle to Play Selflessly https://t.co/nx37Bmpo5x",
    "414": "The @nyknicks should trade for Jalen Brunson. Thanks",
    "415": "@hhpthebook @nyknicks Truthfully I'm not blaming Leon. Even with Randle and his let down, the real issue is Thibbs might be the real issue and for consistency sake you cannot fire him bc too many coaches were fired in a short time. But after this season or middle of next he gotta go",
    "416": "@Knicks_SNOB @nyknicks 😂😂😂😂😂 cause they don’t want him either",
    "417": "@nyknicks Thibs Needs To Be Fired",
    "418": "@robriley2005 @EliteT23 @guavaxyzy @nyknicks Randle proved that he can't handle the pressure in the big apple it got to him mentally you can see it in his body language and game the dude is shakend he's passing up open shot's and mismatches",
    "419": "Whenever we hear Quentin Grimes name brought up in any trade rumors 😂 @nyknicks #NewYorkForever https://t.co/JbBVdYsxtU https://t.co/l79EmBod4E",
    "420": "I'm convinced with no changes to this team lineup, we'll win 11-12 games starting tonight vs. SAC. A 35-47 record. Disagree? \n#nyknicks #nyknicksbasketball #NewYorkForever #nyknickerbockers #knicks #knickerbockers #cityneversleeps #KnicksTape #nyc #NewYorkCity #NewYork \n@nyknicks https://t.co/YSkmW7CAXB",
    "421": "@Knicks_SNOB @nyknicks Because one of us actually works in the Knicks social media department.\n\ntruth…",
    "422": "I fucking NEED a New York Knicks Steve Novak jersey",
    "423": "Revenge Game: Emmanuel Mudiay plays New York tonight.  He played 81 games in his career for the Knicks.",
    "424": "@nyknicks Why tweet this image? This image created a new controversy for Jules and the Knicks. https://t.co/UkdxvhyAq0",
    "425": "@NBA_NewYork The normal Knicks fan reaction: utter panic, then despair, then rationalization, then fully talking myself into it (“he’s injury prone, we got off our worst contracts!”) \n\nthe rationalization actually turned out to be right for once",
    "426": "NBA Player Prop:\nJulius Randle Over 8.5 Rebounds -130 (New York Knicks)\n\nThere is a weird myth I see all the time that the Kings keep people off the glass. They have allowed the 12 most reb per in L15 to PF the Most to C. Randle missed this number L2 but hit this # 64% this year",
    "427": "@hhpthebook @nyknicks Thank you for the kind words Tony!",
    "428": "@11Jayt @ProperMIDDLEMAN @nyknicks Good take. But to be honest, I didn't want him... but even I didn't see this level of stubbornness coming. This is bad!",
    "429": "@NBA_NewYork I thought the Knicks finally got their superstar point guard. Dennis smith was supposed to be a legend…",
    "430": "She is fire on stats and information on the @nyknicks a must follow, if you already aren't  @MzSweetFeet https://t.co/IF6FqcZiRv",
    "431": "@hhpthebook @ProperMIDDLEMAN @nyknicks He hired the coach. How is he not at fault. 🤣🤣🤣",
    "432": "@Keithm8033 @MzSweetFeet @nyknicks Same here",
    "433": "@MzSweetFeet @Keithm8033 @nyknicks You are a wealth of knowledge",
    "434": "New York Knicks, Chase Gift Bronx-Based Charter School With $100K https://t.co/IBnLobDAO9 https://t.co/NfB1ZohYY5",
    "435": "Sacramento Kings vs  New York Knicks Prediction 1/31/22 - Free NBA Picks https://t.co/WRwk3kHFJR via @YouTube",
    "436": "@MzSweetFeet @hhpthebook @nyknicks I was pretty happy going into this year and then the beginning of the year. Since then something changed with this team.",
    "437": "Walt Fraizer 2021-22 NBA Hoops Ink Autographed Card #NBA75 #NBA #Knicks #NewYork #NBATwitter #sportscardsforsale\nhttps://t.co/VjkLxT8Lsj",
    "438": "On this day in 1984, Bernard King of the New York Knicks scored 50 points in a 117-113 win over the San Antonio Spurs. https://t.co/84FVd0Zgr2",
    "439": "He would help our bench for sure. @nyknicks https://t.co/SlHx4cEOKx",
    "440": "Stack off $10… I’m tryna flip it tonight @sixers ml @Pacers ml @PelicansNBA +8 @nyknicks ml @celtics ml @ATLHawks -1 @HoustonRockets +11 @okcthunder +5 @StephenCurry30 under 26 and under 5 3’s @22wiggins under 3 3’s",
    "441": "@brett_cards42 New York Knicks!",
    "442": "Walt Frazier is definitely a trailblazer, and a Man of many talents. @nyknicks @WaltFrazier ##legand #og https://t.co/PNlvmLAf2G",
    "443": "@Jason_Shetler New York Knicks 1999 #NBAFinals as 8 seed (lost 4-1 to Spurs)",
    "444": "@knicks_tape99 Giants writers are hysterical, expected odell to just be fine with not getting the ball and going 3-13 every year lmao - think of what that means that good players don’t want to be IN NEW YORK",
    "445": "@NBA_NewYork I felt the transaction Knicks undersold.. we should’ve gotten a lot more back.. higher caliber player.. more draft assets.. etc.. I thought DSJ would’ve made it exciting but it didn’t pan out",
    "446": "Report: Tom Thibodeau admits having trouble getting Julius Randle to play with selflessness #JuliusRandle #NewYorkKnicks #TomThibodeau https://t.co/HdRs4sJ2j6",
    "447": "@HeyHeyItsConrad New World Order\nNew Age Outlaws\nNew Jack\nNew York Knicks\nNew York\nNew Jers….oh went too far 😂 JK NJ!",
    "448": "@MzSweetFeet @hhpthebook @nyknicks Kind of surprised Knicks gave Noel three year deal. Not as injured last year though. What’s the word on Fox?",
    "449": "Knicks Rumors: Thibodeau Having Trouble Getting Julius Randle to Play Selflessly #NewYork #Knicks #NBA https://t.co/5CkqzcjOCc",
    "450": "New York Knicks: Julius Randle, The Knicks’ Cryptocurrency Paradox https://t.co/3XZzAPV0uJ",
    "451": "@nyknicks u know what to do tonight https://t.co/ghVxsi1sKC",
    "452": "@NBA_NewYork Knicks need a big move like this",
    "453": "@hhpthebook @nyknicks We have to free up space for these young guns to play man, move on from burks randle kemba Evan go out and get a pg and a real vet that’s a leader",
    "454": "Top 10 New York Knicks – Simily https://t.co/QXJNOFGcyy",
    "455": "@NBA_NewYork Depressed cause Kristaps at the time was our star and gave knicks fan some hope. Luckily the trade has worked out so far",
    "456": "Featured Art of the Day: \"New york knicks\". Buy it at: https://t.co/GuUnt20Rry https://t.co/EwlfYAsG1b",
    "457": "@hhpthebook @nyknicks @J_ac0_b  This for the remainder of the season.",
    "458": "@TonyDaniel03 @SScream051 @BlessedAdam_ @michaelkasdan @hhpthebook @nyknicks Or that kid in Miami 10 picks behind",
    "459": "@nyknicks He better not be picking off that Randle energy.",
    "460": "3 Trade Targets For New York Knicks To Keep Tabs On #NewYorkForever #NBA #NBATwitter #NBATwitterLive\n\nRead More- https://t.co/8ZW7kxngwL https://t.co/bLanMXkIuE",
    "461": "My favorite thing about the mid 90s New York knicks is some of them were only on the people because they could fuck people up.",
    "462": "@nyknicks I miss you.",
    "463": "@Keithm8033 @hhpthebook @nyknicks I agree with that. I like Noel too, but we need players we can count on to take the floor every day. Yes I think Detroit would rather have Noel then Burks anyway. They are loaded with wing players.",
    "464": "@SScream051 @BlessedAdam_ @michaelkasdan @hhpthebook @nyknicks i’m a huge rj fan but acting like the pick before him isn’t miles ahead of him and dominating is a lie",
    "465": "He didn’t say that, did he say that? when did he say that? Omg bro!!! The @nyknicks are a tax write off for Dolan this team is not supposed to work. There’s no other explanation for this. https://t.co/je6sfIFMEr",
    "466": "IF Y’ALL WONT THEN I’LL MAKE THE TWEET. THE KNICKS PLAY TONIGHT 😤 @nyknicks @KnicksMSGN 💙🧡 https://t.co/tLV1ANoKc2",
    "467": "@NBA_NewYork I had to dip out of class early to process my emotions. Took down my Knicks flag in my dorm room. Had a bon fire with all of our KP jerseys. I was sure I was boycotting the Knicks and in the hunt for a new NBA team. Almost settled on the Utah jazz.",
    "468": "@hhpthebook @nyknicks I wholeheartedly agree.",
    "469": "New York Knicks: Knicks Morning News (2022.01.31) https://t.co/DtFtMYRYNq",
    "470": "@MzSweetFeet @hhpthebook @nyknicks If Burke goes in that deal Noel included in the Grant deal. I like Noel, but he’s hurt all the time.",
    "471": "On this day in sports history January 31, the Dallas Mavericks traded Dennis Smith Jr., DeAndre Jordan, Wesley Matthews, a 2021 1st Round Pick, and a 2023 1st Round Pick to the New York Knicks for Kristaps Porzingis, Tim Hardaway Jr., Courtney Lee, and Trey Burke in 2019.",
    "472": "New York Knicks, Chase Gift Bronx-Based Charter School With $100K https://t.co/d2kj1XbjlM",
    "473": "On this day in sports history January 31, New York Knicks Small Forward Bernard King scored 50 Points in a 117-113 win against the San Antonio Spurs in 1984.",
    "474": "@nypost Get rid of Thibs @nyknicks",
    "475": "Check out New York Knicks vs. Sacramento Kings at Madison Square Garden in Manhattan tonight at 7:30PM.\n\n@NYKnicks #Knicks #NewYorkCity\nhttps://t.co/mVgSvi8stt",
    "476": "@hhpthebook @nyknicks KEeping Thibs is on him",
    "477": "@Keithm8033 @hhpthebook @nyknicks Sure Obi would be a tough loss, but you have to give up talent to get talent. Obi has potential, but he's not in Grant's league yet &amp; may not ever get there. \n\nI think Burks could be traded. Perhaps a salary dump kind of trade to the Kings for Tristan Thompson's expiring deal?",
    "478": "The New York Knicks play basketball today. Rejoice (or drink) accordingly 🙌🏾",
    "479": "@MzSweetFeet @hhpthebook @nyknicks I think overall I could get behind this. Obi still is the tough pill. And Burkes needs to go back to bench SG. Stresses of PG are messing him up bad.",
    "480": "@NBA_NewYork I was kind of souring on him already but I was annoyed at the Knicks for not being able to work things out with him. I know we are all fans but it goes to show how silly it is to evaluate trades in the moment.",
    "481": "New   York   Knicks,   Chase   Gift   Bronx-Base'   Charta   School   Wit   $100K https://t.co/UAKtW7T55v",
    "482": "If the @nyknicks are smart they will NOT pay Julius Randle a lot of money n they will get a bigger star",
    "483": "New York Knicks - Sacramento Kings İddaa Tahmini 01.02.22\nhttps://t.co/ohA6QCsfrL",
    "484": "🍎The Big Apple🍎 @diadoraofficial X @raekwon collab! These are super nice on foot!! #wutang #shutang #raekwon #diadora #sneakers #starter #comingtoamerica #newyork #mets #knicks https://t.co/kOmWgBBzLA",
    "485": "NBA Basketball Game Betting Picks Simulator: 7:40 PM ET - Sacramento Kings vs. New York Knicks - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/YGMrP3s2Y1 #nba #sportsbetting #freepicks #cappertek",
    "486": "Kings gameday live: De'Aaron Fox, Marvin Bagley III injury status vs. New York Knicks – NBA News https://t.co/WqXSuxENTJ",
    "487": "Check out 2019 Panini Absolute Cam Reddish Rookie Auto #/49 New York Knicks Card #RV-CRD!! https://t.co/4isohDkO91 @eBay",
    "488": "@nyknicks mood ❤🗽🏀.\n@B_emmanuelli @nyknicks @KnicksNationFr @Schweickert1 @MaryPatrux @SoFrenchProd @JMonclar https://t.co/VMoA2jRAyD",
    "489": "@NBA_NewYork Knicks fans don't boo effort. All of these things may be true but the fact remains Randle's effort has been inconsistent. If he was giving the effort like last season he would be getting a pass on his declining numbers.",
    "490": "@DRonESPN @HDumpty39 @RothenbergESPN @ESPNNY98_7FM Apple &amp; OBJ both ex Giants players are in the SuperBowl now. Are the Giants turning into the Knicks. Where all their ex players go win rings on other teams. So New York Now 🤦🏻‍♂️",
    "491": "New York Knicks, Chase Gift Bronx-Based Charter School With $100K https://t.co/tM7zHdCzjI",
    "492": "@Ballislife So wtf did they trade for him for!!! @nyknicks what are y’all doing this man can hoop.",
    "493": "Kicking off our series of #Louisville men’s basketball head coach candidate profiles, we have the now-presumptive frontrunner for the job: New York Knicks assistant and former Cardinal Kenny Payne.\nhttps://t.co/cpxoif6Ou8",
    "494": "Kicking off my series of #Louisville men’s basketball head coach candidate profiles, we have the now-presumptive frontrunner for the job: New York Knicks assistant and former Cardinal Kenny Payne.\nhttps://t.co/JVPGlsde5S",
    "495": "Live updates throughout the day on tonight’s NBA game between the Sacramento Kings and New York Knicks at Madison Square Garden.  https://t.co/yVxx9ACok1",
    "496": "Live updates throughout the day on tonight’s NBA game between the Sacramento Kings and New York Knicks at Madison Square Garden. https://t.co/qcUr8bmfvK",
    "497": "Live updates throughout the day on tonight’s NBA game between the Sacramento Kings and New York Knicks at Madison Square Garden. https://t.co/qwBLR8sP5B",
    "498": "@nyknicks Gameday! Let's Go!\n\n#NewYorkForever #Knicks #KnicksTape",
    "499": "@23savage____ Stop playing like a Mitch man you can literally average 6-8 blocks a game if you were more aggressive call @CoachEwing33 to put you up on game and learn from him 💯💯💯@NYKnicksPodcast @nyknicks",
    "500": "@nyknicks play tonight at the most famous arena. https://t.co/pziEgHskaw",
    "501": "Lakers: Former GM Proposes LA Trading Russell Westbrook to the New York Knicks https://t.co/OQzou5Zzdo",
    "502": "In one of the most gangsta moves\nin @NBA history\nPat Riley leaves the @nyknicks\nin the dust to become\npart owner and head coach of the @miamiheat.\n\n#retro #NewYorkForever #knickstape #HEATCulture\n#bloodinthegarden #1990s https://t.co/P94co7K8He",
    "503": "Los Angeles Clippers at New York Knicks NBA Live Scoreboard Play by Play / Interga https://t.co/SQAAze2RiB",
    "504": "New York Knicks, Chase Gift Bronx-Based Charter School With $100K https://t.co/ScnMZJf4b2 https://t.co/HvHpAcjENN",
    "505": "New York Knicks, Chase Gift Bronx-Based Charter School With $100K https://t.co/BoAXZIDsAD",
    "506": "@knicks81 @nyknicks Hell yea but don’t think they would accept this. Probably have to make it at least top 5 protected and add burks maybe and take Bagley back",
    "507": "New York Knicks Starters:\n\nKemba Walker\nEvan Fournier\nRJ Barrett\nJulius Randle\nMitchell Robinson\n\nPlayers out:\nNerlens Noel\nDerrick Rose\n#NewYorkForever #NBA #NBATwitter #NBA75",
    "508": "Basketball Predictions and Betting Trips through Tarot Reading – New York Knicks vs Sacramento Kings – NBA Basketball League on 1 February 2022 IST￼ https://t.co/5ONab6S5O1",
    "509": "VTG NBA PATRICK EWING New York Knicks SWEATSHIRT SIZE L MADE IN USA https://t.co/Gt3J8vtAPr eBay https://t.co/SrlYkG1WJG",
    "510": "@hhpthebook @TheEMillioEgBar @nyknicks At all! He's too stubborn! These kids will never develop under him! Rose has got to toss the friendship and move on from Thibs",
    "511": "@hhpthebook @nyknicks Big Facts! Let's move on from the veterans and the damn coach! I see what happened in Minnesota! He's crazy!",
    "512": "@nyknicks Work on fts",
    "513": "@knicks81 @nyknicks Wd be fine with any trade sending randle far away from my franchise 🤦🏾‍♂️🤷🏾‍♂️",
    "514": "@knicks81 @nyknicks I'd be fine wit that one tho",
    "515": "@JohnWall when you coming back? Hope you’re not going to @Lakers but if you are then I’ll be a fan and watch your game. But I’d rather see you rip it up with the @nyknicks youngins. See you soon.",
    "516": "@hhpthebook @nyknicks Seriously Jericho Sims and Toppin need more minutes… Mitch and Randle is cool… but they got some dogs if they play them",
    "517": "@AshleyisBrown @flowfollower7 @NBA_NewYork Lol. Man Vietnam was a different kind of war, please thank your dad for his service for me. Hopefully these Knicks get it together!",
    "518": "Today's NBA Picks: 7:40 PM ET - Sacramento Kings vs. New York Knicks - 1 PICK AVAILABLE: https://t.co/T6qGPodHdI #nba",
    "519": "@knicks81 @nyknicks Do it Now!... throw burks in that too!!",
    "520": "https://t.co/lRYs0fQFrO🏀😯 DOESN'T MAKE ANY SENSE NEW,YORK KNICKS TRADING TOPPIN 😯😯😯😯😯",
    "521": "@hhpthebook @nyknicks And Taj",
    "522": ".@williamfleitch spoke with author @Herring_NBA about his new book, \"Blood in the Garden,\" about the entertaining, dysfunctional, and brutally physical New York Knicks of the 1990s https://t.co/RbSJcoxLGR https://t.co/3NRZ7mHYki",
    "523": "New York Knicks: NBA Rumors: Knicks Could Offer Kemba Walker, Alec Burks &amp; Evan Fournier For Russell Westbrook, Says Former GM https://t.co/MrTOD8crsv",
    "524": "@nyknicks Look on both sides, show us that you practice... snapp the ball into protection, huge the five to the spot. Assist, until your stakes go up on Sportsbook.",
    "525": "@nyknicks Hands off the top of the ball, and let the body carry it to the destination and Barret will be a tough shooter. And he gotten better taking it to the hole. Just one thing. he doesn't make decision while he in pursuit. Rj, it doesn't matter if it goes in, you could've missed.",
    "526": "@hhpthebook @nyknicks Tim  thibodeau 👎🏾",
    "527": "@knicks81 @nyknicks Yes. But I don't know if the #Kings would do it",
    "528": "@oldnbatweetz @SulloReport @OnBallShai @chuckguarantees Knicks? I mean Bobby Marks did say he would do it if he were the GM of New York",
    "529": "The first African American to play in the NBA was Nat Clifton and he played for the @NYKNICKS!!! #BlackHistory #DOPE",
    "530": "@hhpthebook @nyknicks It’s a picture of Rob Manfred, who’s a clown for the mlb lockout, but wouldn’t expect you to know that.",
    "531": "Should the Lakers seek a trade with the Knicks for Julius Randle?\n\nhttps://t.co/Q07i5ayGym\n\n#nba @lakers #losangeles #lakers #lakeshow @knicks #neworkforever #knicks #newyork #NBAAllStar #NBA75 #NBATwitter #NBAPicks #NBAnaESPN #NBA2K22 #NBATopShotThis #dubnation #grindcity #mffl",
    "532": "@nyknicks Translation: I have to get back and carry these weak ass dudes.",
    "533": "1/30/01 - The Vancouver #Grizzlies agreed to a long-standing trade request, and shipped hard-working 27-year-old C Othella Harrington (10.9p/6.6r at the time) to the New York Knicks for G Erick Strickland, a 2001 1st (via LAL - Jamaal Tinsley), and 2001 2nd (Antonis Fotsis). https://t.co/4zLu1PXUE8",
    "534": "Lakers: Former GM Proposes LA Trading Russell Westbrook to the New York Knicks https://t.co/CTDamdm6M3 via @@eeulau",
    "535": "@NBA_NewYork @qdotgrimes If Thibs embraces development, he’ll be the Knicks coach for the next decade.",
    "536": "Fantasy not-so-fun fact:\n\nThe New York Knicks don't have a single player inside the top-100 on a per-game basis this year (9-cat).\n\nOver the past 2 months, they don't have a player inside the top-140.",
    "537": "New York Knicks: New York Liberty to sign Stefanie Dolson ... more moves to come? https://t.co/YmJMY2gwzV",
    "538": "@hhpthebook @nyknicks Let me rephrase that actually: people blaming Leon are who I’m calling out. @hhpthebook is 100% correct calling those people out",
    "539": "@hhpthebook @nyknicks No way people are blaming Leon. You’ve gotta be extra incompetent to say that.\n\nNot only does this tweet hit the nail on the head (his Rose drafting has been impressive in short amount of time), but it just proves people are bored and looking for someone new to complain about",
    "540": "New York Knicks, Chase Gift Bronx-Based Charter School With $100K - NewsOne you seen this one ⁦@Ninjagenius⁩ ? Basketball focus school 🤷‍♂️ sounds vaguely familiar in some ways  https://t.co/ovCC12WdvJ",
    "541": "@cjsarinas16 Probably @nyknicks  or the  @Bucks",
    "542": "@PrimeRJBarrett @nyknicks Kemba is washed randle sucks and the first would be in the 20s this is a perfect package for fox a pg we desperately wed to run the offense and unlock obi",
    "543": "@nyknicks Don't come back at all @drose , yall got zero heart.",
    "544": "@nyknicks @drose I wouldn't want to rush back to those losers either @RjBarrett6 @J30_RANDLE @23savage____ @KembaWalker @nyknicks @IanBegley @espn @ESPNChicago",
    "545": "NBA New York Knicks HOT Dog Plush Dog &amp; CAT Squeak Toy – Cutest HOT-Dog Snack Plush Toy for Dogs &amp; Cats with Inner Squeaker &amp; Beautiful Basketball Team Name/Logo https://t.co/FX8HPdwEYI",
    "546": "he is sad he plays on the New York  knicks",
    "547": "@nyknicks please trade Kemba, Fournier, and Burks at the deadline",
    "548": "@nyknicks Wish we would’ve got ja instead",
    "549": "@Keithm8033 @hhpthebook @nyknicks He plays both PF and C. He's not a great 3pt shooter but has a nice looking shot.. he hits enough that they have to respect him and keep a defender close. Yes he would help to open up the paint area",
    "550": "Thibs is messing this team up how you not playing cam . He keep talking about a rotating. The players in the rotation is not winning games so how you don’t change that @nyknicks",
    "551": "@MzSweetFeet @hhpthebook @nyknicks I know we have guys whose 3pt #s are decent but the eyeball test doesn’t justify. If he can shoot I’m good. He’s a C? That could open space too in the paint",
    "552": "@MzSweetFeet @hhpthebook @nyknicks I like that actually. If we can make a run Then we could be a sneaky team no one wants to play",
    "553": "@Keithm8033 @hhpthebook @nyknicks He’s nothing spectacular but he’s solid. Played lot bigger role in Detroit had planned for him because of injuries to Grant and Olynyk. He can shoot 3’s so if he plays C will help stretch the floor",
    "554": "@MzSweetFeet @hhpthebook @nyknicks Yea was thinking Fournier was guard. But barter could be that too. That’s not a bad starting 5. And I was thinking the other day Fournier would be good off bench.",
    "555": "@Keithm8033 @hhpthebook @nyknicks Fourniers. With grant being able to switch to the 4 when Randle sits Fournier would still get 25 minutes a night or so coming off the bench",
    "556": "@MzSweetFeet @hhpthebook @nyknicks I’m ok with Joseph as PG. Lyles don’t know much about.",
    "557": "@Keithm8033 @hhpthebook @nyknicks That’s why in my trade the next would get back Lyles &amp; Joseph. They both have played really well for Detroit and could fill roles here",
    "558": "@MzSweetFeet @hhpthebook @nyknicks That makes a lot of sense. Still tough on the Obi part. Also still only a playoff at best team. But who’s spot does he take?",
    "559": "@hhpthebook @Keithm8033 @nyknicks I’d imagine he starts at SF, then slides to PF when Randle sits (if Toppin were to be part of the trade). Fournier would come off the bench but should still get 25+ minutes",
    "560": "@hhpthebook @MzSweetFeet @nyknicks Needs some solid vets too though. Thought we had those too.",
    "561": "@MzSweetFeet @hhpthebook @nyknicks I hear you. I like Grant too. But also, where does he play. Or when?\nI just want character guys. I thought we had them then something happened",
    "562": "@hhpthebook @Keithm8033 @nyknicks I'm ok if we move one to bring in a guy like grant who can score, plays great defense, shoots 3's well and can play both the 3/4 well. We have extra #1 picks to restock any of the young talent we lose.",
    "563": "@GDawund @carver656 @PBSImpulse9 Sacramento kings, Minnesota timberwolves, Seattle mariners, New York knicks",
    "564": "Happy birthday to jalen rose of the Chicago bulls #jalenrose #jalenanthonyrose #denvernuggets #indianapacers #newyorkknicks #phoenixsuns https://t.co/5hJAuGXFzS",
    "565": "@Keithm8033 @hhpthebook @nyknicks I don't want to see Obi traded, but he can't contribute much playing 12-14 minutes per game, which will be all he does for as long as Randle is here. I personally don't see any team wanting the vets they're hoping to trade b4 the deadline (unless its in a deal for Wall or WB)",
    "566": "kemba for john wall @nyknicks",
    "567": "NBA Basketball Game Betting Picks Simulator: 1/31/2022 7:40 PM ET - Sacramento Kings vs. New York Knicks - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/YGMrP3s2Y1 #nba #sportsbetting #freepicks #cappertek",
    "568": "@MzSweetFeet @Keithm8033 @nyknicks I hope we keep out young pieces",
    "569": "@WFANEnjoyer @DonBolo79 @nyknicks You got to look at the other threads . I didn't say he pick them. Just that he accumulated all of this young talent and kept them together.",
    "570": "@PrimeRJBarrett @nyknicks Why not https://t.co/3kxdnjLXKb",
    "571": "@TermineRadio It's amazing how well the Lakers have capitalized on their location and also amazing how poorly the New York Knicks have capitalized on theirs.",
    "572": "@MzSweetFeet @hhpthebook @nyknicks I like Obi and Mitch too. And Obi does have a lot of Amare in him. Amare better handle though at this point. I do feel they are doing something. For the short and long term.",
    "573": "@hhpthebook @nyknicks Absolutely Horrible in Free Agency. Passed on Haliburton for Obi. Rose leaves a lot to be desired.",
    "574": "@knicks81 @nyknicks Fuck no",
    "575": "@hhpthebook @nyknicks Get rid of the coach .HE doesnt build well rounded teams and he not an offensive guy. Players get board with his style",
    "576": "It’s time for us to see what Obi can really do @nyknicks",
    "577": "@nyknicks fans to @J30_RANDLE \nSo the feeling is mutual…. https://t.co/sKfg1tPGUS",
    "578": "@hhpthebook @Keithm8033 @nyknicks It may not be either, it could be a #1 pick going instead. If its either player think it will be Obi. The Pistons GM loves him. \n\nThey need to do something &amp; i don't see any teams wanting to trade for Kemba/Noel/Burks/Fournier before the deadline.",
    "579": "@hhpthebook @nyknicks We all knew Thibs rarely plays young players. It’s why the hire was too safe of a pick. I got his logic, but it went against his long term vision",
    "580": "If You are a Knicks Fan Please Follow My Sons New Knicks Instagram Page! @nyknicks #Knicks https://t.co/onttfR1pT6",
    "581": "@hhpthebook @nyknicks Thibs says he won’t make room for cam cause the vets (are losing) &amp; he doesn’t want to change.\nHow many games/minutes have Deuce Jericho Obi etc played again? Not near enough for a 12tg seed trending down while Taj Kemba Randle Evan Burks &amp; soon Rose play like they’re the future.",
    "582": "@DonBolo79 @hhpthebook @nyknicks Giving Fournier 18 over multiple years? Also is Leon responsible for RJ, Mitch?",
    "583": "@MzSweetFeet @Keithm8033 @nyknicks I want to keep Obi and Mitch. I hate this trade.",
    "584": "@hhpthebook @nyknicks All Good Rose can't hit everything out da park but yeah he's bldg something",
    "585": "@nyknicks Its a lost year probably end up in play in and get killed in 1 round by either bucs or nets",
    "586": "Got my basketball nails done @nyknicks https://t.co/wZiqL9UGFC",
    "587": "Being a @49ers fan is stressful. What a great, weird, f'ed up, amazing and whatever else type of season. I am checking in to 9ner rehab tomorrow after I get off work. Bring on my @nyknicks https://t.co/hyuykRb2mL https://t.co/Gwh9OG2bwv",
    "588": "@hhpthebook @nyknicks Lillard?",
    "589": "New York Knicks: Sacramento Kings vs New York Knicks:  Live Stream, Score Updates and How to Watch NBA 2022 https://t.co/aAiVxBP3LZ",
    "590": "@MzSweetFeet @nyknicks Okay, I'm going to watch this closely.",
    "591": "Matthew Stafford and the Rams entered into a partnership and it paid off for both sides.  The ultimate  Win, Win. I pray my @nyknicks can find this same success.",
    "592": "@hhpthebook @nyknicks Haha yes he will. The reason Cam hasn't been playing is he will be one of the players going to Detroit.",
    "593": "@knicks81 @nyknicks Let’s goooooo",
    "594": "@MzSweetFeet @hhpthebook @nyknicks For who?",
    "595": "@MzSweetFeet @nyknicks It's so hard with Thibs as coach.  Will he play him?",
    "596": "Facts should have been randle #nyk #newyorkknicks #Julius #Knicks https://t.co/f8MRobxJd2",
    "597": "@jdenenberg0824 @knicks81 @nyknicks Lmao",
    "598": "@knicks81 @nyknicks I’d drive them myself",
    "599": "@hhpthebook @nyknicks Hot take - Jerami Grant will be a NY Knick by the trade deadline",
    "600": "@Troutprophet @nyknicks That's my only point. Free agent moves can work or may not...but drafting well is the ticket and we've done that.",
    "601": "@DababyfannNYK @DonBolo79 @nyknicks Excactly",
    "602": "@BoredOnToilet @nyknicks Not the one hiding my face behind a clown mask.",
    "603": "@DababyfannNYK @DonBolo79 @nyknicks Yeah, I was trying to make the point that between a combination of front office executives,  the one thing they all gave done well was commit to youth. And that got out of hand real fast🤣",
    "604": "✅yes ❎no    \n\n💙🧡knick fans let me know what you think 🤔 @nyknicks https://t.co/IkUInZGb9v",
    "605": "@hhpthebook @nyknicks You’re the clown who doesn’t know the definition of the word that you’re using or the moves the guy who you’re blowing made.\nYou’re hyping up that he traded Frank when he didn’t.  You’re hyping that he made moves for RJ and Mitch, and he didn’t.   \nThere’s a clown here alright. https://t.co/UuuIk7gp69",
    "606": "@BoredOnToilet @nyknicks I will do me, that's what I was doing till captain Ahole came along.  With a clown pic, that about says it all.",
    "607": "@hhpthebook @nyknicks He didn’t trade Frank, he let him walk for nothing.  So he “accumulated” nothing for a former 8th overall pick.  \nDamn, for a Knicks fan, you’re really slacking on knowledge about the team and moves they made.  But, you do you https://t.co/XsRGwqm7N8",
    "608": "@nyknicks These aren’t free throws",
    "609": "@alanatMCM @nyknicks Could have.",
    "610": "@hhpthebook @nyknicks He could have had DeMar Rozan for same/less $ instead of Fornier and Walker. Not great!",
    "611": "@BoredOnToilet @nyknicks Did he trade frank and Knox. He could have traded the others, he didn't.  His collection of youth is his, seeing as he controls it. It is his...dam you people kill me. Oh did I say kill, not literally kill...oh forget it.",
    "612": "@hhpthebook @nyknicks No, you just don’t know what you’re talking about.  \nHe’s done good getting the other assets but giving him credit for RJ and Mitch, might as well give him credit for the championships in the 70’s since he had as much to do with those too.",
    "613": "@BoredOnToilet @nyknicks Gather and accumulate.  I'll leave that there.  You people want to argue about anything.",
    "614": "@hhpthebook @nyknicks All jokes Boss Hog has done well",
    "615": "@hhpthebook @nyknicks I mean D League woo hoo",
    "616": "@PLRRealEstate @nyknicks Why not",
    "617": "@hhpthebook @nyknicks why is 99 in the pic",
    "618": "@MikeC1128 @SwordsLiquidity @nyknicks Excactly",
    "619": "@BoredOnToilet @nyknicks Dam, reading is fundamental.  Amassed not drafted. Did you read anywhere where I said Leon drafted them...Amassed young talent. By not trading Mitch and Quickley, trading gor a few more and drafting some.",
    "620": "New York Fans &amp; the media have always been like this.\n\nYet the Yankees have 27 Chips and the Knicks have 2.\n\nStop blaming the fans and blame ownership and team management, it's not the fans fault they put together bad teams and hire bad coaches. https://t.co/9ta6u7ctJU",
    "621": "@SuckMyKicks_18 LMAOO @nyknicks  WE BELIEVE",
    "622": "@nyjetsgirl25 @hhpthebook @nyknicks I disagree. The #Knicks rely too heavy on journeyman types like Morris, Bullock &amp; Burks. They should not be playing heavy minutes over lottery picks chosen at the same position. Knicks badly stunted Knox development and now Cam can't get on the floor. That's being shortsighted",
    "623": "@jfromflorida1 @nyknicks One is apples\nOther is Oranges\nTalent is for the Fans\nThe 💰is for them \nIt's been 50 years &amp; we still coming",
    "624": "@Shortz2186 @nyknicks Need help getting talent though",
    "625": "@jfromflorida1 @nyknicks Knicks don't need help getting that 💰 !",
    "626": "@johnnyjohnjon83 @nyknicks Facts smh",
    "627": "@SportsToonsPlus @hhpthebook @nyknicks I like Evan and Kemba a lot but I think they don’t fit. We got rid of Reggie who had good chemistry with the team and to me it was a mistake.",
    "628": "@nyjetsgirl25 @hhpthebook @nyknicks Maybe Evan was a lil' overpaid and shouldn't necessarily start, BUT he can shoot and is a good, useful player when he's aggressive. Sometimes it takes a minute to get accustomed to NY whether you're a vet or not.",
    "629": "Check out this listing I just added to my #Poshmark closet: New York Knicks basketball hoodie. https://t.co/ppEpJjQA4h #shopmycloset @poshmarkapp",
    "630": "@hhpthebook @nyknicks You had me until u said make rose the captain lol",
    "631": "@SwordsLiquidity @hhpthebook @nyknicks And the fact that they didn’t go for him because he wanted 4 years tells you everything. They added guys to help win while still being able to jump ship if things didn’t work out. They traded for cam, not a vet. That says a lot too. FO and coach are aware of what they are doing.",
    "632": "@hhpthebook @nyknicks Leon had nothing to do with RJ and Mitch",
    "633": "@jfromflorida1 @nyknicks Yea the fuck us over every year with the lottery how teams with better records get top picks lol.",
    "634": "#ad Blood in the Garden: The Flagrant History of the 1990s New York Knicks Hardcover for $19.57! (List Price: $28.99)\n\nhttps://t.co/XW8VmmIuKL https://t.co/FkINuoGZwa",
    "635": "@sancocho_papi @nyknicks @KnicksMSGN at what point do you play Thibs instead of the players?",
    "636": "Since @NBA League Pass is at a low price we chose to upgrade it now we have all the teams not just the @nyknicks I’m so excited I can watch games when there isn’t any on cable.",
    "637": "@BlessedAdam_ @michaelkasdan @hhpthebook @nyknicks Exactly the only other player to come in and dominate was bron 30 years ago lol.",
    "638": "@MikeC1128 @hhpthebook @nyknicks Great point. It seems expectations are high because last year we overachieved . Last year we were the youngest team (prior to Rose and taj acquisitions) and had the lowest payroll in the league. I just wish we signed Derozan instead of this bargain bin Garbage.",
    "639": "@hhpthebook @nyknicks The problem is Thibs #knicks",
    "640": "@hhpthebook @CatRP @nyknicks It’s just that classic situation.. they gave Fournier a 40 million dollar contract?.. well.. that doesn’t look too good if your Dolan.. might as well try to keep the rookies a secret. It looks terrible if you start a rookie over a big contract and high expectations..",
    "641": "@hhpthebook @nyknicks Thibs might be forced to play overpriced garbage over the rookies to increase trade value or to save his job in the event of him getting the blame. This Knicks team is a 1st round KO regardless.. Thibs is playing the off$eason signings to show loyalty t Rose’s decision making",
    "642": "@Barbershopspor2 @nyknicks Loading.... https://t.co/oWKaolisC9",
    "643": "I swear if I see the Bengals win a Super Bowl before I see the @nyknicks win an NBA title in my lifetime, imma flip out 😡",
    "644": "New York Knicks, Chase Gift Bronx-Based Charter School With $100K: The New York Knicks and Chase gifted a Bronx-based charter school with $100K. https://t.co/UjwbByt2n5 https://t.co/4WOdUSJ0HU",
    "645": "@cjsarinas16 New York Knicks (their first title)",
    "646": "New York Knicks, Chase Gift Bronx-Based Charter School With $100K https://t.co/feW7EgVqN3",
    "647": "@hhpthebook @nyknicks Guess you'd be happy with a 50 loss season. Maybe you'd prefer to have Fizdale back so he could coach this team?",
    "648": "@hhpthebook @nyknicks REDDISH IN THE MIDDLE ON PURPOSE 😤😤😤",
    "649": "@NBA_NewYork @Knicks_SNOB 💯!! STILL can’t shoot, He’s absolutely dreadful off ball, he’s not a good defender &amp; he’s overpaid, And we aren’t better with or without him. So Nah, we’re good.",
    "650": "@Knicksallday69 But he is not, and it looks like he is not mentally strong, and checked out, is there a chance for the lottery? @nyknicks #KnicksTape @NBA",
    "651": "@AbsCoverage I hope for a Patrick Ewing @nyknicks type of scam",
    "652": "The @NYRangers are second in their division and 4th in the conference. Can't say the same for you @nyknicks",
    "653": "@hhpthebook @nyknicks Couldn’t agree more…and just like Randle may be a bridge guy who no longer can/or chooses fit the build, Thibs may be the same. didn’t think it would be this quick, but these guys are going to need a teacher, a unifier, a leader who can develop a team from the ground up!",
    "654": "New York Knicks: Knicks-Kings could be showcase for potential trade https://t.co/IOrDDPooYc",
    "655": "@PhinsChris @Kold91 For what it's worth, this thing is full of misery for any New York fan. The Jets were awful, the Knicks were awful, the Mets and Yankees were full of unfounded optimism that crumbled soon after. Good times, my friend. Good times.",
    "656": "@hhpthebook @nyknicks How about don’t blame anybody? It’s called growing pains. They’re a rebuilding team also trying to make the playoffs. Those two things are not conducive to winning. Let the FO and coach work there way through it. The sky is not falling and no thibs does not hate obi. Good grief",
    "657": "@Not47Buddz @DonBolo79 @hhpthebook @nyknicks He also drafted Obi over Haliburton when Knicks desperately needed a PG.  We could do much better in front office than Rose and Perry.",
    "658": "@Not47Buddz @DonBolo79 @hhpthebook @nyknicks Scott Perry sucks.  Should have been fired with Steve Mills.  He drafted Knox over Alexander (PG).  He extended Randle.  He had the most cap space in NBA this offseason and look what he did with it.  Signed Fournier, Kemba, Noel and Burks and extended Randle.",
    "659": "@jfromflorida1 @nyknicks We should have taken Donovan and Bridges instead of Frank and Knox. That’s not Silver",
    "660": "@KnicksCentral What the hell makes u think the Celtics are trading Tatum for taj Gibson , D rose  and Bum ass Noel?I’m lost?\nAnd I’m a @nyknicks fan",
    "661": "This is coaching malpractice. The @nyknicks are 4 games below 500 and last in the East, and yet Thibs can't find room in the rotation for Cam Reddish? Has he not figured out yet that his current rotation is NOT working? https://t.co/oBDe4Bf2g3",
    "662": "@johnnyjohnjon83 @nyknicks No excuse dave stern saw the bigger picture with Chicago la nyc driving the league and the other teams following .. shoulda never put a franchise in Memphis and new orlenas",
    "663": "@Not47Buddz @hhpthebook @nyknicks Ur argument doesnt clarify anything beyond blaming Mills for everything.\n\nThey aren't real receipts if ur asking me who the Pobo is.\n\nA receipt is u showing me an article that said it was Solely Mills doing this or that.  All. speculative. U back to square 1",
    "664": "@jfromflorida1 @nyknicks I hate stern he did get us ewing tho silver worse",
    "665": "Ay @drose nickname should be \"The Captain\" because the way he lead the @nyknicks is crazy. 🔥👀 These guys look up to him fr. The heart of the team. #NewYorkForever https://t.co/ahQSqGM2C5",
    "666": "@hhpthebook @nyknicks He’s not signing players that builds on last years success. Now the season is in deep trouble.. It was a mistake. He can do a lot of good things and make mistakes too.",
    "667": "@tommy_sage @nyknicks Silver is corny mr anothe stern"
}