{
    "0": "Built By Black History https://t.co/cyGNLc3Ii4",
    "1": "Today's NBA Picks: 10:40 PM ET - Portland Trail Blazers vs. Los Angeles Lakers - 25 PICKS AVAILABLE: https://t.co/JQmj3moZ4A #nba",
    "2": "ALERT: New high roller bet posted!\nA bet has been placed for $6,000.00 on Los Angeles Lakers - Portland Trail Blazers to win $9,600.00.\nTo view this bet or copy it https://t.co/mLYHrdf7Id https://t.co/EZncYKflyH",
    "3": "So many folks caught up  in the Kardashians reality show not me my show is the Los Angeles Lakers 🤣🤣 they on right  now. Must watch TV",
    "4": "Okay. Onto Saturday night against the Lakers in Los Angeles. Have a good night #KnicksNation. ✌️🌙 #Knicks",
    "5": "🏀#NBA (Top-Rated)\n574) Trail Blazers vs Los Angeles Lakers \nPick: L.A Lakers ML (-165)\nRisk: 16.5/10.0 (10%)\n#Documented #Monitored #SportsBetting \n\n🍀Best of luck!\nExclusiveVipSports https://t.co/YCQlsaXRHt",
    "6": "Portland Trail Blazers vs Los Angeles Lakers | #NBALIVEBASKETBALL | 2/2... https://t.co/fSJ37OmYtW via @YouTube @GAMESMOVIESAND2",
    "7": "Portland Trail Blazers vs Los Angeles Lakers | NBA LIVE BASKETBALL | 2/2... https://t.co/gq42LJennm via @YouTube",
    "8": "Tonight's Five \n\n#SuitingUpTogether | @ToyotaSoCal https://t.co/Q91LzBI1Ho",
    "9": "Los Angeles Lakers Vs. Portland Trail Blazers Live Play By Play &amp; Reaction https://t.co/hEzzP5myl2",
    "10": "@BleacherNation A lot don’t make sense, especially after they move cities. To quote a great movie - “The Minneapolis Lakers moved to Los Angeles where there are no lakes. The Oilers moved to Tennessee where there is no oil. The Jazz moved to Salt Lake City where they don't allow music.”",
    "11": "Los Angeles Lakers Starting Lineup 2/2\n PG: Russell Westbrook\n SG: Avery Bradley\n SF: Malik Monk\n PF: Stanley Johnson\n C: Anthony Davis\nhttps://t.co/o75oZ8vnE8",
    "12": "@latimes @Lakers @RamsNFL @Dodgers @LAKings @LAClippers @KingJames fuck all of you and ur fake fandoms the city of La sucks and I feel bad for any one who was born there. Ur city is made of plastic and the only people who care about ur teams are the fakes fan celebrities fuck you",
    "13": "Los Angeles Lakers https://t.co/pGaVdHnCvX",
    "14": "@davidubben @NicoleAuerbach Ahh the Los Angeles Lakers?",
    "15": "@davidubben Los Angeles Lakers?",
    "16": "The Lakers moved from Minneapolis to LOS ANGELES and kept their name 😂 https://t.co/pwWBs5i843",
    "17": "“Soon it was commonplace for entire teams to change cities in search of greater profits. The Minneapolis Lakers moved to Los Angeles where there are no lakes. The Oilers moved to Tennessee where there is no oil. The Jazz moved to Salt Lake City where they don't allow music.” https://t.co/gmvV2zKtj5",
    "18": "#lakers #lakeshow  #lakersnation\n\n2 tix $75 ea $150 total way below face value of $364 each DM if interested thanks\n\n#Portland  #blazers @ Los Angeles Lakers VIP Premier 12 row 8 Wednesday 7:30pm 2/2/22\n\nspecial private section, in seat service, entrance to san manuel restaurant https://t.co/cSihvlSb54",
    "19": "Check out 2001-02 Fleer  Maximum  Floor Score #13  Kobe Bryant Team: Los Angeles Lakers  https://t.co/rysI3TFEze via @eBay",
    "20": "#JuliaRose JULIA ROSE Arrives at Lakers vs. Hawks Game in Los Angeles 01/07/2022 https://t.co/98hAsPS2zb...",
    "21": "Boston Celtics - Charlotte Hornets\nHouston Rockets - Cleveland Cavaliers\nDallas Mavericks - Oklahoma City Thunder\nSacramento Kings - Brooklyn Nets\nLos Angeles Lakers - Portland Trail Blazers\n\nBet slip link: https://t.co/iy0VrPBJw0 https://t.co/PqeQ7cZ59P",
    "22": "@ScottKacsmar Los Angeles 1988 1989 the Lakers did it twice in the Dodgers won is that the same thing or no?",
    "23": "NBA LIVE TODAY🔴 Portland Trail Blazers vs Los angeles Lakers - 2nd Febru... https://t.co/sTWqVWJnVe",
    "24": "Lakers: The Players Most Likely to Be Traded Away From Los Angeles - Sports Illustrated https://t.co/KbrJgTZ6hO",
    "25": "Jay Scrubb @jayscrubb (toe) out for Thu's matchup with the @Lakers , Law Murray of The Athletic reports!\n\nScrubb is dealing w/ turf toe on his foot and will miss the Los Angeles showdown\n\n#CreamGetsTheMoney #nbaDFS\n\nhttps://t.co/LFLWJ6yZLz https://t.co/x58DjFGUbG",
    "26": "Today's NBA Picks: 10:40 PM ET - Portland Trail Blazers vs. Los Angeles Lakers - 23 PICKS AVAILABLE: https://t.co/JQmj3moZ4A #nba",
    "27": "@BarstoolGermany @POD_Payton Wait til you hear about the Los Angeles Lakers/Clippers/Dodgers/Chargers.",
    "28": "@drzax Their promo budget is massive. Checkout the arena naming rights deal they did with the Los Angeles Lakers.",
    "29": "Consensus Line Move:\n2022-02-02 Portland Trail Blazers at Los Angeles Lakers from 223.00 to 224.00\nOver with respect\n#NBA #CryptoHoops #computerscience #realtor",
    "30": "LeBron James Autograph Nameplate Los Angeles Lakers Photo Ball Jersey UPDATED - https://t.co/bZ0Log4buV\n\n#lebron #lebronjames #lakers #nba \nhttps://t.co/w0BAhTFTgf",
    "31": "🏀Portland Trail Blazers vs. Los Angeles Lakers\n\n🕖February 3 | 11:30 am (PHL Time)\n📺NBA TV Philippines via Cignal TV\n📱 NBA League Pass | Smart GigaPlay App\n\n📝https://t.co/9POhyGYnRU\n\n#NBA75",
    "32": "Maybe we'll only lose by a few points. Thanks for the losing mentality, Russell \nHow to Watch Portland Trail Blazers at Los Angeles Lakers: Live Stream, TV Channel, Start Time https://t.co/CMmERuXRMi via @Kris_Habbas",
    "33": "Lakers rumors: Will Los Angeles land Paul Millsap in the buyout market? – Lakers News https://t.co/KCzirRyOSC",
    "34": "Nets still in free fall with Kevin Durant out of action #BrooklynNets #DenverNuggets #KevinDurant #LosAngelesLakers #SacramentoKings https://t.co/1KuhbUmVNT",
    "35": "Portland Trail Blazers at Los Angeles Lakers Live Stream: Watch Online, TV Channel, Start Time – How to Watch and Stream Major League &amp; College Sports https://t.co/mww174ZpC5",
    "36": "Los Angeles #Lakers vs Portland Trail Blazers 2/2/22 NBA Picks, Predictions, Odds » Sports ... https://t.co/12yGqDRl26",
    "37": "Portland Trail Blazers at Los Angeles #Lakers - 2/2/22 NBA Picks and Prediction - PickDawgz https://t.co/grBASVC5uG",
    "38": "Lakers rise &amp; get up Los Angeles pride. By the power of 5 point stars; spirit, fire, earth, air &amp; water. I bless you, be healed now those with injuries. More 🏆championship for you. As above so below. So mote it be... https://t.co/eD66m7TLQ5",
    "39": "🏀 Portland Trail Blazers(+3.5) @ Los Angeles Lakers(-3.5)\n\n⌚ 10:30 PM ET\n\nO/U: 222\n\n🔥 Over is 9-2 in Lakers last 11 games following a ATS loss.\n\nBet #BTC ➡️ https://t.co/spMiJIgrUb\n\n#NBABetting #NBAPicks #SportsBetting #BitcoinBetting https://t.co/RwewIoZaHC",
    "40": "The Los Angeles Lakers are back home to host the Portland Trail Blazers tonight at 7:30 PM on Spectrum SportsNet. 💜💛 https://t.co/gCBF6Ebobm",
    "41": "@SagED_UP Los Angeles Lakers",
    "42": "New artwork for sale! - \"Los Angeles Lakers NBA Basketball\" - https://t.co/jhwBhVjY2n @fineartamerica https://t.co/A7EkbSn6G4",
    "43": "Lakers: The Players Most Likely to Be Traded Away From Los Angeles\n\nhttps://t.co/eeucuIEoyi",
    "44": "NBA Basketball Game Betting Picks Simulator: 10:40 PM ET - Portland Trail Blazers vs. Los Angeles Lakers - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/yLqH98hjeq #nba #sportsbetting #freepicks #cappertek",
    "45": "Los Angeles Lakers guard Russell Westbrook says it’s 0-0 for every team once the playoffs commence.  https://t.co/nM7rvktw5s",
    "46": "Kiesha Nix has been named Vice President of Charitable affairs for the Los Angeles Lakers, making her the first Black woman to ever serve as VP for the basketball organization\nhttps://t.co/c0NDXBBscT",
    "47": "🤑🏀@BumpSports provides betting insights ahead of the Portland Trail Blazers at Los Angeles Lakers game in which both teams are fighting to stay relevant in the Western Conference playoff picture. Both teams have lost multiple games in a row.\n\n➡️https://t.co/vu31XRghe8",
    "48": "Los Angeles Lakers vs Portland Trail Blazers Basketball Live 2022 NBA | [Free Stream] : https://t.co/QMQHIsJ15O | 2-Jan-22 @ 22:30] NBA | Basketball | Portland Trail Blazers | Los Angeles Lakers [LIVE] 2022 NBA Basketball Portland Trail Blazers vs Los Angeles Lakers https://t.co/IH2nAVNCmI",
    "49": "Los Angeles Lakers vs Portland Trail Blazers Basketball Live 2022 NBA | [Free Stream] : https://t.co/X3G1uGDa57 | 2-Jan-22 @ 22:30] NBA | Basketball | Portland Trail Blazers | Los Angeles Lakers [LIVE] 2022 NBA Basketball Portland Trail Blazers vs Los Angeles Lakers https://t.co/JABHsMQfcC",
    "50": "Los Angeles LA Lakers - Edible Cake Topper OR Cupcake Topper, Decor https://t.co/2wU30w28dD",
    "51": "@sevysavage The Lakers just renamed the Staples center crypto arena lol if ppl think it’s a scam then I guess the Los Angeles Lakers are in on it 🙃",
    "52": "RARE Exclusive Two Tone LA Los Angeles Lakers Fitted Off White Hat Club Patch https://t.co/DZqs9oQ0Dr eBay https://t.co/cCXJwLpHYO",
    "53": "@RealGlenMacnow Well, Utah Jazz and Los Angeles Lakers come to mind. Two teams who kept names that were appropriate for their original homes.",
    "54": "On this day in (2009):Kobe Bryant broke the current Madison square garden record with (61) points,passing Michael Jordan’s opponent record of 55,and the Los Angeles lakers looked plenty potent without Andrew Bynum in a 126-117 victory over the knicks.From 2,2009",
    "55": "@FranchiseTagUK Major factor is location. Lots of rich people in Los Angeles that can pay big bucks for tickets without having to fly to another city. Many aren’t even football fans. Same situation with Lakers tickets. Lots of non-fans want to go just because. Makes ticket prices go up",
    "56": "Los Angeles Lakers guard Talen Horton-Tucker reportedly isn’t regarded highly as a trade asset around the NBA.  https://t.co/FpzVkQJytF",
    "57": "Back LOS ANGELES LAKERS to BEAT Portland Trail Blazers tonight in the @NBA (Game Starts at 03.40 GMT) #NBA #Basketball",
    "58": "The Clippers without Kawhi Leonard and Paul George are 2-point favorites tomorrow vs. the Los Angeles Lakers without Lebron James.",
    "59": "Check out this listing I just added to my #Poshmark closet: Nike Kobe Bryant Los Angeles Lakers Dryfit Tee. https://t.co/X4k6TpVnDG #shopmycloset @poshmarkapp",
    "60": "Play Lakers Pick 'Em for your chance to win tickets to the Lakers vs Jazz on February 16 🎟️",
    "61": "@e_c_cheesehead Oh, is that the Los Angeles Lakers zooming down a street? #LOLLakers",
    "62": "Battle of Los Angeles\nClippers vs Lakers\nThe saga between these two franchises just got spicier with the Jerry and Jeanie Buss drama. \n\nhttps://t.co/AZAFTdmlIC\n\"Pull up a seat, pull up a chair, pull up. Peace\" https://t.co/wCJ0XIqbCo",
    "63": "NBA Legend Jerry West Says His Former Team Los Angeles Lakers Treats Him Terribly, Regrets Playing For Them https://t.co/5tSOCMfZz9 https://t.co/fAaLHYfIzW",
    "64": "Sharp Pick: :zap::zap::zap: *- Moneyline* We have *Los Angeles Lakers* at *-168*, which is a *24* point difference from the current line.\n#bettingexpert",
    "65": "Los Angeles Lakers vs New York Knicks is on ESPN Radio. With commentary from Marc Kestecher.  For more details see https://t.co/qsuF75YOWw #LosAngelesLakers #NewYorkKnicks #ESPNRadio",
    "66": "@LeBronPRteam @espn_macmahon Memphis 3rd in the west 35-18\nLos Angeles Lakers 9th in the west 24-27 that’s all that needs to be said here",
    "67": "Los Angeles Clippers vs Los Angeles Lakers is on ESPN Radio. With commentary from Marc Kestecher.  For more details see https://t.co/zlOfvrOr3L #LosAngelesClippers #LosAngelesLakers #ESPNRadio",
    "68": "Sponsored by the Los Angeles Lakers https://t.co/WtAgHxpVwH",
    "69": "Portland Trail Blazers vs Los Angeles Lakers 2/2/2022 Picks Predictions Previews\n\nhttps://t.co/SBIuTHSrAp\n\n#basketballpicks #NBA #NBApicks #NBAparlay #NBAprediction #NBAbetting #NBAbettingpicks #handicapper #sportspicks #freepicks #expertpicks #odds #picks #TrailBlazers #Lakers https://t.co/bPoRhYMtUO",
    "70": "🏀 Portland @ Los Angeles\n\nNot much analysis needed for this game beyond LeBron is unlikely to play and his absence annihilates the Lakers offense. Their ORtg goes from 111.3 with him to 102.8 w/o.\n\nDon't trust POR enough to back them, but I like the under.\n\n🔒 Under 223",
    "71": "The #LakeShow Express\n\nBackstage Lakers takes us behind-the-scenes on the team's train trip tonight at 11 pm PT on @SpectrumSportsNet 🚂 https://t.co/Ma5pF7qiwC",
    "72": "The Los Angeles Lakers don’t have much of a shot this year at winning the NBA title, according to this metric.  https://t.co/9I5z7xKbNJ",
    "73": "Lakers: Former NBA All-Star Thinks LeBron James Will Leave Los Angeles #NewsBreak https://t.co/aeueBUgpyO",
    "74": "The Los Angeles Lakers Host The New York Knicks on NBA Saturday Primetime on ABC Series Presented by Meta Quest – Lakers News https://t.co/3d80KmWChn",
    "75": "The Los Angeles Lakers Host The New York Knicks on NBA Saturday Primetime on ABC Series Presented by Meta Quest – NBA News https://t.co/513d18Yrfy",
    "76": "Three Things to Know: Lakers vs Trail Blazers - 2/2/22 | Los Angele... (Los Angeles Lakers)\n\nThe Lakers (24-27) return home for the first time since mid-January as they welcome the Port...\n\nAdd your highlights:\nhttps://t.co/dLYYzqIq7D\n #LA_Lakers",
    "77": "Los Angeles Lakers\n\nthere are no natural lakes in LA https://t.co/vcCSU2iyku",
    "78": "If Westbrook explodes for 38 pts with an double or triple I’ll CashApp $500 to one lucky follower that like, comment #Cashappblessing , and RT/quote this tweet in 1.3 seconds and must be following @lebronfanjust \n\nPSA: the Los Angeles lakers gotta win with the Russell objective https://t.co/5nn0umLd2E",
    "79": "New York Knicks: The Los Angeles Lakers Host The New York Knicks:  on NBA Saturday Primetime on ABC Series Presented by Meta Quest https://t.co/SyrW6iW0FV",
    "80": "2000 Topps Gold Label Jam Artists NBA Los Angeles Lakers Kobe Bryant #JA8\n\nhttps://t.co/kdoUe0YWyv",
    "81": "The Los Angeles Lakers Host The New York Knicks on NBA Saturday Primetime on ABC Series Presented by Meta Quest https://t.co/Bt79xIcxRM",
    "82": "@JesseThorn \"Soon it was commonplace for entire teams to change cities in search of greater profits. The Minneapolis Lakers moved to Los Angeles where there are no lakes. The Oilers moved to Tennessee where there is no oil. The Jazz moved to Salt Lake City where they don't allow music.\"",
    "83": "Analyzing Wednesday’s Portland Trail Blazers at Los Angeles Lakers odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/LCvRzZwFiW",
    "84": "Portland Trail Blazers at Los Angeles Lakers odds, picks and predictions https://t.co/xcsKbkhWCM",
    "85": "Los Angeles Lakers Predictions and Preview for 2/2/2022 hosts Portland Trail Blazers.  Looking for betting action?  Find out if there is any value in our preview. #Picks #Punters https://t.co/mt7RXNOCLA",
    "86": "The Los Angeles Lakers are interested in trading Kent Bazemore. #Lakers https://t.co/xS16nk0fhg",
    "87": "#RussellWestbrook in last 5 games where #Lakers are 1-4 unfortunately:\n\n🏀 PTS: 23\n🏀 REB: 6\n🏀 AST: 6\n🏀 FG%: 55\n🏀 3P%: 37\n🏀 FT%: 70\n\nIt still all #Westbrook fault. Right \"experts\"?\n\n#NBA #NBA75 #NBAtwitter #NBAtwitterLive #LosAngelesLakers #LakersNation #LakeShow https://t.co/WFNtBl76cg",
    "88": "If Westbrook explodes for 38 pts with an double or triple I’ll give out an PS5 to one lucky follower that like, comment #ps5giveaway, and RT/quote this tweet in 1.3 seconds and must be following @RipMambaforever \n\nPSA: the Los Angeles lakers gotta win with the Russell objective https://t.co/m8Ugos8yPH",
    "89": "@frostybias I think he was talking about the Lakers not Los Angeles.",
    "90": "@dshif The Los Angeles Lakers.",
    "91": "Congratulations to misha_lemonwood who moved up 39 spots to take #21 on the Los Angeles Lakers team leaderboard.\n\nhttps://t.co/7jbi1baNWE",
    "92": "Thirteen years ago today, the late Kobe Bryant scored 61 points at Madison Square Garden to lead the Los Angeles Lakers to a 126-117 win over the New York Knicks. https://t.co/fxSY6CnsMP",
    "93": "Los Angeles Lakers vs. Blazers prediction, odds, TV channel for Feb. 2 - Lake Show Life https://t.co/t92eSAnpFo",
    "94": "The Los Angeles Lakers reportedly could be suitors for Paul Millsap while Kent Bazemore is being shopped.  https://t.co/IuQbn8J7z7",
    "95": "Portland Trail Blazers vs. Los Angeles Lakers - 2/2/22 Free Pick &amp; NBA Betting Prediction https://t.co/Zptx3tE51d\n.\n#Betting #FreePicks https://t.co/lSKRGsJ68E",
    "96": "I don't get why cheering for a team that's not the nearest sports team to you is a big deal.\n\nSigned, a southeast Kansan that cheers for the Los Angeles Lakers, Anaheim Ducks, Denver Broncos, and St. Louis Cardinals.",
    "97": "Portland Trail Blazers vs Los Angeles Lakers NBA Pick and Prediction NBA Betting Tips 2/2/2022 https://t.co/ACWWEIkjDh via @YouTube #NBA #NBAPick #NBAPredictions #NBAOdds #Lakers #TrailBlazers #LakeShow #RipCity #LakersVsTrailBlazers",
    "98": "GAMEDAY!📍\n-\nThe Los Angeles Lakers take on the Portland Trail Blazers at 7:00 PM PST in the https://t.co/8kT67grctA Arena tonight. 💜💛\n-\nWho do you think will win this game tonight? 🤔 \n- \n📸: (Kevin C. Cox &amp; @jeffhaynesmedia \n- \nFollow @lalakersquad for more! 🔥 https://t.co/ilr1T2zeVY",
    "99": "Lakers could go for Paul Millsap, per report #LosAngelesLakers #PaulMillsap https://t.co/gd89jbufvv",
    "100": "A former NBA great said LeBron James might have to leave the Los Angeles Lakers to win another title, and he boldly suggested LBJ would do just that.\n\n#LeBronJames | #LakeShow | #NBAAllStar | @getsMart_5  https://t.co/wCmLy6B6hO",
    "101": "Los Angeles Lakers are going to the nba finals and winning the championship",
    "102": "📰 Portland Trail Blazers at Los Angeles Lakers Predictions and Odds Feb 2!\n👉 https://t.co/H7G34aNNVp @wagertalk",
    "103": "Today's NBA Consensus (So Far):\n\nBrooklyn Nets 76%\nLos Angeles Lakers 75%\nCleveland Cavaliers 74%\nIndiana Pacers 72%\nMemphis Grizzlies 70%\nBoston Celtics 61%\nUtah Jazz 61%\nPhiladelphia 76ers 60%\nDallas Mavericks 59%",
    "104": "NBA Legend Jerry West Says His Former Team Los Angeles Lakers Treats Him Terribly, Regrets Playing For Them https://t.co/H0QL5K9upK",
    "105": "Washington Commandos makes 1,000% more sense than Los Angeles Lakers and Utah Jazz.\n\n@MrMichaelLee @JPFinlayNBCS",
    "106": "NBA Legend Jerry West Says His Former Team Los Angeles Lakers Treats Him Terribly, Regrets Playing For Them https://t.co/JOkHiCWux9 via @dailycaller Shame, shame, shame LA Lakers.",
    "107": "#NBA \n\nPor/LA\n\nTrail Blazers are 14-5 ATS in the last 19 meetings in Los Angeles\nTrail Blazers are 8-18 ATS in their last 26 road games\nLakers are 2-10 ATS in their last 12 games playing on 2 days rest\nLakers are 9-20 ATS in their last 29 games as a home favorite",
    "108": "2022-02-02\nLos Angeles Lakers -3½-110\nMemphis Grizzlies -4-110\nCharlotte Hornets +6-110\nIndiana Pacers -3½-110\nBrooklyn Nets -4-110\nCleveland Cavaliers -5-110\nChattanooga -7-110\nHouston -17-110\nFlorida -5½-110\nArkansas -10½-110\n\n#bettingsports",
    "109": "PARLAY (7 TEAMS)\n2022-02-02\nArkansas -10½-110\nKentucky -15-110\nMarquette +4½-110\nBrooklyn Nets -4-110\nCleveland Cavaliers -5-110\nMemphis Grizzlies -4-110\nLos Angeles Lakers -3½-110\n\n#bettingsports",
    "110": "PARLAY (9 TEAMS)\nPlaced: 2022-02-02\n\nPhiladelphia 76ers -10½-110\nIndiana Pacers -3½-110\nLos Angeles Lakers -3½-110\nBrooklyn Nets -4-110\nUtah Jazz -3-110\nOklahoma City Thunder +12-110\nCleveland Cavaliers -5-110\nMemphis Grizzlies -4-110\nBoston Celtics -6-110\n\n#bettingsports",
    "111": "Los Angeles Lakers &amp; Chicago Bulls Interested in Brooklyn Nets 4X All-Star https://t.co/Pjp6hL5W91",
    "112": "Los Angeles Lakers two-way player Mason Jones won the G League Player of the Month for January.  https://t.co/RZubzcmjqc",
    "113": "A season of dissension and a losing record have forced the panic button to be hit in Los Angeles. \n\nLooking at what tier every player on the Lakers' roster is in, based on availability on the market. https://t.co/MKl9DdsjAk",
    "114": "The Los Angeles Lakers play basketball today https://t.co/YZxAM6S61p",
    "115": "Game Night: Los Angeles Lakers vs The Portland Trail Blazers. Lakeshow 🏀 🏀 🏀 🏀 https://t.co/wnS5l7SRj7",
    "116": "Commanders is bad. Really bad. Now excuse me while I’ll check what time the Los Angeles Lakers and Utah Jazz play tonight",
    "117": "Portland Trail Blazers vs Los Angeles Lakers - NBA League 2022\n🎟️🎥Watch Now➠  https://t.co/QtpwKgfE5L\n📅 : 2/2/2022\n⏰ : 10:30 PM",
    "118": "Charles Oakley says “LeBron James will leave again” https://t.co/2Z4ypWCOTD #NBA #LosAngelesLakers",
    "119": "Flying into Los Angeles today to go to the Lakers game &amp; rep the @BoredApeYC merch close to court-side!",
    "120": "@jaynftbeliever 1) Indiana Pacers\n2) Philadelphia 76ers\n3) Charlotte Hornets \n4) Memphis Grizzlies\n5) Houston Rockets\n6) Dallas Mavericks\n7) Brooklyn Nets\n8) Denver Nuggets\n9) Los Angeles Lakers\n\nTS: StathisVog",
    "121": "@TL_Townsend72 @TaylorK03321638 @basketballfosho The Los Angeles Lakers won 11 out of 17 titles because of West. Go get warriors seats if you don’t respect our legend",
    "122": "Earning gift cards for selling my stuff on @Listia! Join me using code \"BBBGZP\" for an extra 250 PTS. I just listed this: Outerstuff Lebron James Los Angeles Lakers #23 Youth Vertical Player Name &amp; Number T-Shirt Black https://t.co/VIwUbw3fsZ",
    "123": "Lakers Nation, check out the upcoming schedule for this week’s Watch Parties 🎉 🏀🏆\n\nShare in the action with other Laker fans in real time in the Los Angeles Lakers Fan Club on @Clubhouse \n\nLink to become a member in bio! \n\n#Lakeshow    #LakersNationCH Hey https://t.co/lUoxy8rMGl",
    "124": "@new_orleansjazz Minneapolis Lakers to Los Angeles would’ve been another one.",
    "125": "🚨NOW AVAILABLE🚨\n🏷️Get 20% off with promo code ACCESS15\n\nLos Angeles Lakers New Era City Side Fitted Hat- https://t.co/kbguzd5KDd\n\nSplatter 59FIFTY Fitted- https://t.co/2ULlNVd30u\n\nMitchell &amp; Ness 50th Team Anniversary Hardwood Classics Dusty Fitted- https://t.co/Hu0rPiyUCV https://t.co/7YRzuq47w3",
    "126": "Check out this listing I just added to my #Poshmark closet: Los Angeles Lakers Beanie One Size. https://t.co/mEPu2xtG5R #shopmycloset @poshmarkapp",
    "127": "New post (Portland Trail Blazers vs Los Angeles Lakers NBA Pick – February 2) has been published on The Sports Geek - https://t.co/5jnqMbMihe https://t.co/HePDQnASe4",
    "128": "Check out this listing I just added to my #Poshmark closet: Los Angeles Lakers NBA Snapback Hat New Era. https://t.co/lsbeXkVlwZ #shopmycloset @poshmarkapp",
    "129": "Lakers looking to trade Kent Bazemore #KentBazemore #LosAngelesLakers https://t.co/cMnGJu5zB6",
    "130": "“The Logo” Jerry West says he doesn’t feel the love from his former team, the Los Angeles Lakers. \n\nhttps://t.co/yXGJblUAmp",
    "131": "LeBron James misses Los Angeles Lakers' loss to Philadelphia 76ers https://t.co/kNHUFF5zvB via @abc7",
    "132": "Los Angeles Lakers. https://t.co/QaGYI84mD2",
    "133": "@TL_Townsend72 @Lakerscenters @basketballfosho Change our name to the Los Angeles Logo’s and build that man a private presidential suite for all I care. Jeanie is just bitter because the Lakers are trash and she needs another person to blame besides herself. Jeanie is the one that needs her seat revoked.",
    "134": "NBA Legend Jerry West Says His Former Team Los Angeles Lakers Treats Him Terribly, Regrets Playing For Them ⁦@Lakers⁩  #JerryWest ⁦⁦@NBA⁩  https://t.co/JhnoR4EDrZ",
    "135": "NBA - I Los Angeles Lakers hanno revocato l'abbonamento \"a vita\" di Jerry West https://t.co/cZLgsgHcbq",
    "136": "According To League Sources, Houston Rockets Star John Wall Has Demanded To be Traded to the Los Angeles Lakers.",
    "137": "Lakers: Former NBA All-Star Thinks LeBron James Will Leave Los Angeles https://t.co/YFh9a76fFM To retire yeah. not to go to another team.  yeah, its time to retire. https://t.co/Ja8PRuwOs0",
    "138": "Revenge Game: Larry Nance Jr. plays Los Angeles tonight.  He played 168 games in his career for the Lakers.",
    "139": "@Cam_Is_Like The Lakers move to Los Angeles would have required a name change.",
    "140": "NBA Legend Jerry West Says His Former Team Los Angeles Lakers Treats Him Terribly, Regrets Playing For Them https://t.co/jZnZjuFUAy via @DailyCaller",
    "141": "@letshaveabeer17 @itsAntWright I’ve said it before, I will die on this hill. Why the hell they didn’t change the name when they moved from Minneapolis is sooo confusing. It makes zero sense being the Los Angeles Lakers.",
    "142": "@FoxxFiles I disagree about “Lakers” because no one really knows what the hell a “Laker” is and it ends up working with Los Angeles the same way Phillies goes with Philadelphia. You’d never be the wiser it comes from Minnesota. \n\nEverybody knows what “Jazz” is.",
    "143": "@ZPathletic The Minneapolis Lakers moved to Los Angeles where there are no lakes. The Houston Oilers moved to Tennessee where there is no oil. The New Orleans Jazz moved to Salt Lake City where they don't allow music.",
    "144": "Los Angeles Lakers LeBron James jersey lapel pin-Classic KING/GOAT Collectable - https://t.co/TM8GCd36zC\n\n#lebron #lebronjames #lakers #nba \nhttps://t.co/KJEFJCcWtt",
    "145": "Portland Trail Blazers vs. Los Angeles Lakers https://t.co/oECm4qNO4i",
    "146": "With 31 games left in the regular season. Will the 24-27 Los Angeles Lakers make it to the postseason? #Lakers https://t.co/wOicAim02u",
    "147": "I'm pretty SURE the NBA King LBJ will not do that! Juz the Haters thinks of that!\n\n\"Lakers: Former NBA All-Star Thinks LeBron James Will Leave Los Angeles | All Lakers | News, Rumors, Videos, Schedule, Roster, Salaries And More\" https://t.co/Mmd9y7HH1Z",
    "148": "Los Angeles Lakers guard Russell Westbrook says it’s 0-0 for every team once the playoffs commence.  https://t.co/H25DSvDK2p",
    "149": "Los Angeles Lakers star LeBron James could be out a few more games with a left knee issue.  https://t.co/v9u4mtgSyc",
    "150": "“The Lakers are searching to find Kent Bazemore a new home … .And while it's believed Paul Millsap would prefer to land in Chicago, … Los Angeles has been mentioned as a suitor for Millsap should he reach the buyout market.”\n\nhttps://t.co/egNPGCH5N1",
    "151": "Portland Trail Blazers vs  Los Angeles Lakers Prediction 2/2/22 -  Free ... https://t.co/SKgdexs4aJ via @YouTube \n\n#NBA #NBAPick #NBAPrediction #Basketball",
    "152": "Rick F0x - Los Angeles Lakers. 2002/2003 Season. \n\nBig basketball project. Hurry up to collect your favorite players.\n\nDiscord: https://t.co/qiILlXWFuP\n@opensea : https://t.co/pOeK7CSiMq\n\n#OpenSeaNFT #NFTartist #nft #nfts #NFTCommunity https://t.co/sfhZ42MqMM",
    "153": "Chris Paul can always draw fouls against the Los Angeles Lakers #LakeShow https://t.co/VOn2Z3Q0fO",
    "154": "Early leans for NBA\n\nBoston Celtics -4.5/ Over\nRockets / Cleveland Over \nLos Angeles Lakers 1H ML\nLuka Doncic TD/ Mavs Win\nKings / Nets Over",
    "155": "@TheNJF the alliteration of the Los Angeles Lakers is rolls off the tongue just like the Washington Red Wolves would have. Alliteration works",
    "156": "Finally home yet still not healthy, the Los Angeles Lakers feel a playoff run is within them, they just have to prove it. | @Reuters https://t.co/ifVCID6UrO",
    "157": "@PhoenixMilgrau Los Angeles Lakers: 💀",
    "158": "the los angeles lakers will win the championship this year 2022. I had a vision nigga",
    "159": "On this day in sports history February 2, Los Angeles Lakers Shooting Guard Kobe Bryant scored 61 Points in a 126-117 win against the New York Knicks in 2009.",
    "160": "Here is everything you need to know as the Los Angeles Lakers host the Portland Trail Blazers Wednesday.  https://t.co/28EWzmK0sf",
    "161": "¡HOY JUEGAN LOS BLAZERS (21-30)!\n\n🆚 Los Angeles Lakers (24-27)\n⌚️ 00:30 Argentina / 04:30 España / 19:30 Portland\n🏟️ Crypto•com Arena, Los Angeles, California\n🚑 Nurkic, Simons PROBABLES; Elleby, Watford CUESTIONABLES; Lillard, Little, Nance Jr., Zeller OUT\n📺 League Pass https://t.co/1XXsnNkNTm",
    "162": "Portland Trail #Blazers at Los Angeles #Lakers  |2/1/22 | NBA  Free Picks and Predictions | NBA Betting Tips  \n\nWatch: https://t.co/sJuqFzr0Uv\n\n#NBA #NBAPick #NBAPredictions #lakersvstrailblazers",
    "163": "On this day in sports history February 2, Los Angeles Lakers Center Wilt Chamberlain recorded 23 Points and 35 Rebounds against the San Francisco Warriors in 1969.",
    "164": "Los Angeles Lakers will face Portland Trail Blazers at https://t.co/20CRQX14e7 Arena tonight.\nMake your own fantasy team now!\n#basketball #fantasyapp #sportsfan #panda11 #punkpand https://t.co/Cfc17Yym5K",
    "165": "🚨 Lakers: Former NBA All-Star Thinks LeBron James Will Leave Los Angeles 🚨\n\nBy Brook Smith via All Lakers FN 📝\n#LakeShow 🟣🟡",
    "166": "Happy #blackhistorymonth and please use these #bitesizebios in your classrooms!\n\nToday's Person of the Day is Kobe Bryant. He had a 20 season career with the Los Angeles Lakers, where he won 5 NBA championships and was NBA All-Star 18 times. When he was 34, he became the /1 https://t.co/PONZkU3Bvc",
    "167": "NBA legend Jerry West on his relationship with the Lakers’ organization: “It’s horrible” #JerryWest #LosAngelesLakers https://t.co/KjmM9jFSuf",
    "168": "1996-1997 Upper Deck CC # LA2 KOBE BRYANT ROOKIE RC Los Angeles Lakers Sharp ! - https://t.co/4zfgnjdSoR\n\n#lebron #lebronjames #lakers #nba \nhttps://t.co/IdkvihIFu1",
    "169": "Malik Monk on not having LeBron James in the lineup for the Los Angeles Lakers.  https://t.co/BWv9MZvcfU",
    "170": "Basketball Los Angeles Lakers Vintage iPhone 13 / 13 Mini / 13 Pro / 13 Pro Max Case Cover https://t.co/dnRTumCkAU",
    "171": "Day 2 of #BlackHistoryMonth is dedicated to my cousin, Flynn Robinson, who is the first and only African American to be drafted into the #NBA from Murphysboro, Illinois. Flynn won the World Championship with the Los Angeles Lakers in 1972. https://t.co/x88ntywP2V",
    "172": "https://t.co/fwj3dwgEuU\n#LosAngelesLakers will face #PortlandTrailBlazers at the https://t.co/mAIA7PbGq2 Arena this Wednesday, February 2.\n#1xbit #bitcoin #LosAngeles #Lakers #PortlandTrail #Blazers https://t.co/l107i2My6Z",
    "173": "#NBA Best Odds!\n\n⏰ Thu, 6:30 a.m\n\n🏀 Los Angeles Lakers vs Portland Trail Blazers\n\n🟡 #Lakers have lost their last 3 games.\n \nCheza leo na M-Bet https://t.co/Mc5kaatr7A au Piga *798# https://t.co/xH85kcw12z",
    "174": "Lebron James Flair Hot Numbers Los Angeles Lakers Driving With One Touch Case - https://t.co/FRKO6rFj6L\n\n#lebron #lebronjames #lakers #nba \nhttps://t.co/ubVutq1As6",
    "175": "LeBron James will leave Lakers, says Charles Oakley #LeBronJames #LosAngelesLakers https://t.co/mfPSnfWASP",
    "176": "#BlackHistoryMonth 🖤Kobe Bean Bryant, (born 8/23/78, Philadelphia, PA—died 1/26/20, Calabasas, CA). He was an American professional basketball player, who helped lead the Los Angeles Lakers of the National Basketball Association (NBA) to five championships (2000–02 &amp; 2009–10). https://t.co/LEzXFJd57Y",
    "177": "@Spaceman186 @riger1984 Yea Stafford aside I absolutely hate Los Angeles, Lakers, Dodgers, the media the horrible fan base. And the media there is already taking shots at Detroit, that is what these fans playing pretend with Stafford don’t understand.",
    "178": "Sz L NBA Authentic #6 Lebron James Jersey 2022 Los Angeles Lakers HOME GOLD - https://t.co/8uNn8Tr7BS\n\n#lebron #lebronjames #lakers #nba \nhttps://t.co/4sbCC6y1Ed",
    "179": "NBA Los Angeles Lakers Lebron James Jersey #6 Purple And Yellow Sz Large New - https://t.co/qEfahOaO0Z\n\n#lebron #lebronjames #lakers #nba \nhttps://t.co/hZ5LLp4HeJ",
    "180": "#ValentinesDay2022 Special offer On Los Angeles #Legend Never Die Mamba Lakers Varsity Jacket.\n-----------------------------------\n►Shop Now Click on Link◄\nhttps://t.co/6o81tKjJwD https://t.co/KpB8IwYetm",
    "181": "4. The 2021-22 Los Angeles Lakers\n• (C) Dwight Howard, (F) Lebron James, (F) Carmello Anthony,\n(SG) Lt. Kobe Bryant, &amp; (PG) James \"J.O.\" Lynch\n\n                      (PG) James \"J.O.\" Lynch\nIn the midst of a 5-year $195.0 mill. contract worth \n@ $39.0 mill. Dollars per season.",
    "182": "Los Angeles Lakers two-way player Mason Jones won the G League Player of the Month for January.  https://t.co/Ffo5N0WrRl",
    "183": "1988 FLEER STICKER MAGIC JOHNSON #6 HOF LOS ANGELES LAKERS PSA 5 EX - https://t.co/w1OiSLal0d\n\n#michaeljordan #nba #bulls #cards\nhttps://t.co/Y7YJDW0HVO",
    "184": "NBA Basketball Game Betting Picks Simulator: 10:40 PM ET - Portland Trail Blazers vs. Los Angeles Lakers - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/yLqH98hjeq #nba #sportsbetting #freepicks #cappertek",
    "185": "1996-1997 Upper Deck CC # LA2 KOBE BRYANT ROOKIE RC Los Angeles Lakers Sharp ! - https://t.co/Ei2h0aSgdu\n\n#lebron #lebronjames #lakers #nba \nhttps://t.co/E78Ow7xkv3",
    "186": "Kevin Garnett explains why he chose the Boston #celtics over the Phoenix #Suns and Los Angeles #Lakers https://t.co/P6R6yzPaFT",
    "187": "Russell Westbrook reacts to Lakers’ record #LosAngelesLakers #RussellWestbrook https://t.co/ec7E96FwNq",
    "188": "Russell Westbrook on constantly changing Lakers’ lineup: “Nobody actually cares about that” #LosAngelesLakers #RussellWestbrook https://t.co/4POb2lqzmP",
    "189": "Desireé LeSassier’s phone wouldn’t stop chiming. She had landed in Minneapolis about an hour before, on the Los Angeles Lakers’ plane, and people needed things. She apologized as she returned text messages and emails. #londonposts #news #latestnews\n\nhttps://t.co/e8xW81RI3M https://t.co/dQ0Qs4FTpa",
    "190": "@JohnnyKF17 @LakersSBN let him dip got dam me.. this is not the LBJ Lakers.. it's the infamous Los Angeles Lakers! nggas got the brand fckd up",
    "191": "Just locked this play in for tomorrow! Feel like the line may move a bit here..\n\n#NBA 🏀\n\n• Los Angeles Lakers -3 (-110)\n\nRisk: 1.1u\nWin: 1u\n\n🍀🍀🍀\n\n#GamblingTwitter #FreePicks https://t.co/0TPwSbq4nX",
    "192": "@look_nba @SFsGOAT @MYMMHM From that viewpoint sure. From my viewpoint Magic represents the Lakers and Los Angeles like no other, also if we are using the \"saving\" argument then Magic and Bird quite literally saved the league. Kobe also was there the longest and is the most beloved within the franchise",
    "193": "NBA Authentic #6 Lebron James Jersey 2022 Los Angeles Lakers Purple Mens XL - https://t.co/7ORkTGPbYR\n\n#lebron #lebronjames #lakers #nba \nhttps://t.co/yPalf1FMQh",
    "194": "Lakers vs. Trail Blazers Preview: This sucks (Silver Screen and...)\n\nThe Los Angeles Lakers are not doing well right https://t.co/tpR5wiUiIe fact, &amp;quot;not doing well&amp;quot; is p...\n\nAdd your highlights:\nhttps://t.co/U0iYXNDIQE\n #LA_Lakers",
    "195": "Los Angeles Lakers star LeBron James could be out a few more games with a left knee issue.  https://t.co/MLzVWvO2n5",
    "196": "@Mrfjetter @LakeShowYo lake show = hype show. There have been amazing Lakers teams. There have been quite a few poorly constructed, big name teams that failed. Same with the dodgers. Los Angeles sports= hype",
    "197": "also recently signed a $700 million naming rights deal with the NBA’s Los Angeles Lakers — for whom James plays — for their home stadium; it was previously named the Staples Center, and is now called the  Arena. https://t.co/0bTAoCidVQ",
    "198": "Russell Westbrook's mentality regarding the Los Angeles Lakers' current record ‼️ https://t.co/ivK6A4mkyT",
    "199": "Lebron James Flair Hot Numbers Los Angeles Lakers Driving With One Touch Case - https://t.co/bBBgCa3IyI\n\n#lebron #lebronjames #lakers #nba \nhttps://t.co/OCOsyzh4Sr",
    "200": "Congratulations to Vancheto who moved up 6 spots to take #13 on the Los Angeles Lakers team leaderboard.\n\nhttps://t.co/7jbi1baNWE",
    "201": "Los Angeles Lakers will face Portland Trail Blazers at the https://t.co/gE2DycValc Arena. The two teams match up for the third time this season. The Lakers defeated the Trail Blazers in their last matchup. See more: https://t.co/zjxFxY7vca\n.\n.\n#PnxbetSports\n#NBA\n#Blazers\n#Lakers https://t.co/NjdT15nqFc",
    "202": "Magic Johnson Signed Los Angeles Lakers Jersey (Beckett COA) 5xNBA Champion https://t.co/EkwEDo840h eBay https://t.co/JGyeGwTGax",
    "203": "Frank Vogel weighs in on Malik Monk’s impact on Lakers #FrankVogel #LosAngelesLakers #MalikMonk https://t.co/6wP5btlVBv",
    "204": "Check out 2020 Lebron James Purple Clearly MY House #2 Los Angeles Lakers Pack Fresh!  https://t.co/WhCUsscEKn via @eBay",
    "205": "@jasonkersey And the Lakers have more followers than EVERY SPORTS FRANCHISE you guys have COMBINED!! But that's not important either. \n\nDON'T WORRY ABOUT LOS ANGELES! WE'RE GOOD! \n\nY'ALL NOT \"IMPORTANT\" ENOUGH TO SPEAK ON LOS ANGELES! ✌️ https://t.co/YySQC6uU9O",
    "206": "Warriors just beat Spurs without Curry, Klay, Dray, and Wiggins.\n\nLos Angeles Lakers should be ashamed that they use their injury problems as an excuse. They out here blowing 2 20+ point leads against the Thunder in the same week. \n\nHAVE SOME SHAME. @Lakers @KingJames @AntDavis23",
    "207": "@LegionHoops One of the greatest Lakers ever, and he can't come to their games unless he buys his own ticket?!\n\nStay classy, Los Angeles. 😒",
    "208": "Trail Blazers Game Notes: Portland Trail Blazers (21-30) vs. Los Angeles Lakers (24-27): PORTLAND TRAIL BLAZERS (21-30) AT LOS ANGELES LAKERS (24-27) https://t.co/b2txpq7Ch1 #RipCity https://t.co/fTbcgaysjf"
}