{
    "0": "@BrooklynNets Lend me a jersey I’m locking up everybody out their",
    "1": "@HardensBetta @BrooklynNets @Patty_Mills @KDTrey5 Free KD from having to carry that bum harcheeseburger",
    "2": "So they don't let @KyrieIrving play for @BrooklynNets because he's unvaccinated and \"a threat\" whatever you want to call it. But now this..... https://t.co/lICyAglCye",
    "3": "All 8 of Brooklyn Nets available players, might as well introduce all 8 players instead of just the starting 5 lol\n\n#NetsWorld https://t.co/AftXalH3yl",
    "4": "Let’s go @BrooklynNets #NetsWorld",
    "5": "@BrooklynNets Wtf is Harden bro?",
    "6": "@iamMarshh @dbearak @Jeannie2321 @BiggHall @Keith_McPherson @TheBKN3 @mgbushwick1 @Grady @sarahkustok @BrooklynNets Oh I will watch though I probably will fall asleep got to be up early for training and been getting to bed later lately, may switch back of forth from that to Devils, both my teams",
    "7": "Kyrie Irving hints at shock Brooklyn Nets return with social media post putting on basketball shoes https://t.co/9gE9H7pZt7",
    "8": "Welcome @Dev34Harris to our Nets on YES team! Devin will be with us all week. @YESNetwork @BrooklynNets",
    "9": "So with the @BrooklynNets covid outbreak I think it shows @KyrieIrving was right all along. The vaccine doesn’t protect you from not getting it and they are the healthiest pro athletes in the world. Let the man play!",
    "10": "Harden, Brown enter protocols; Nets' list now at 7 https://t.co/BGgsszLlbY #brilliantbelligerentidiots helping to move the virus along create new variants cause they know better Stand proud Idiots @NBA @ESPNNBA @espn @BrooklynNets",
    "11": "The @BrooklynNets have a forward named David Duke Jr.\nHe’s a Black guy.\nAs a person who has actually met the other David Duke, an avowed White supremacist, I find that hilarious.",
    "12": "Going with my older son to Celtics/Nets in 2/8 in Brooklyn if any NY homies wanna connect",
    "13": "Whenever someone ask how loyal a am I show them this @BrooklynNets 🔥🏀🏀 https://t.co/sryl1n3UVd https://t.co/KqkeoQIknP",
    "14": "Brooklyn Nets only got 7 available players and Raptors got 15 🌚👀🤔 that’s not fair , they should’ve just cancelled the game like Chicago and Pistons did #RaptorsVsBrooklyn #TORvsBKN",
    "15": "7 Brooklyn Nets players including James Harden who are all vaccinated have tested positive for COVID-19 and entered the NBA’s health and safety protocols https://t.co/sLuPjLa34M",
    "16": "New listing! \n\n2019-20 Illusions Caris LeVert Season Highlights Insert #3 Brooklyn Nets MINT \n\nCheck it out: https://t.co/al5JODSaJs\n\n#TradingCards #ForSale #eBay https://t.co/5GoQrq9cNa",
    "17": "@BrooklynNets Not 1 on 5 again… other guys better turn up like in the 4Q of that last game",
    "18": "Scottie Barnes and the @Raptors will go for 3 wins in a row as they visit the @BrooklynNets tonight! \n\n@Paul__Jones has the call coming up next! After the game, catch #Raptors Reaction with @william_lou. #WeTheNorth \n\nListen live 📻 https://t.co/kGILl37UoU https://t.co/j9q4AHiirz",
    "19": "David Duke Jr. in the starting lineup for the Brooklyn Nets tonight. \n\n@abc6 #pcbb #gofriars https://t.co/O3xj3xNpow",
    "20": "@BrooklynNets Harden ?",
    "21": "The @BrooklynNets got all these players out I just wanna know if Kyrie has had any close contact with Covid",
    "22": "Will reiterate I am available @BrooklynNets @wojespn https://t.co/o7ChiFgWlc https://t.co/Teogguikdg",
    "23": "@BrooklynNets Nets Legend  David Duke JR.",
    "24": "Toronto Raptors vs Brooklyn Nets Bet.\n\n0.5u -  Patty Mills over 3.5 threes + Patty Mills over 15.5 points + Patty Mills over 0.5 steals + Scottie Barnes over 1.5 steals and blocks + Kevin Durant over 8.5 assists (8.50) https://t.co/McjxxAlRsQ",
    "25": "@ChriatianTrans7 @BrooklynNets Covid",
    "26": "@BrooklynNets Rest the boy",
    "27": "LISTEN: @Cuse_MBB looks to get over a tough stretch, and the @BrooklynNets look to bolster their spot in the standings against an Eastern Conference foe. Plus, the @nyknicks host a titan of the West. It's Afternoon Sports with WAER's @benshulman7.\nhttps://t.co/xZXjniOTla",
    "28": "@BrooklynNets It’s time https://t.co/q86gpkBtgX",
    "29": "@BrooklynNets Holy shit",
    "30": "@BrooklynNets Put me in",
    "31": "@BrooklynNets Where's James Harden",
    "32": "@JuliaMagicNets @dbearak @Jeannie2321 @BiggHall @Keith_McPherson @TheBKN3 @mgbushwick1 @Grady @sarahkustok No, if you're a real fan, you bleed @BrooklynNets thru and thru. All 16 players deserve our love and support and our team needs us tonight more than ever before!!!!! #NetsWorld",
    "33": "ALERT: New high roller bet posted!\nA bet has been placed for $5678.59 on Brooklyn Nets - Toronto Raptors to win $5,918.84.\nTo view this bet or copy it https://t.co/upBixg6Ku6 https://t.co/BQXLAO6TZ6",
    "34": "James Harden is one of seven Nets players now in the NBA's health and safety protocols, leaving Brooklyn with the minimum eight players required to play tonight against Toronto. https://t.co/dyI26heE2u",
    "35": "@BrooklynNets first start david duke jr👏🏽👏🏽👏🏽👏🏽",
    "36": "Steve Nash Says He Hasn't Had Discussions About Kyrie Irving's Return Amid Rumors: Brooklyn Nets head coach Steve Nash had nothing new to reveal on the playing status of guard Kyrie Irving amid reports… https://t.co/kV4w2u2VPC #BNTNBA #BreakingNews #BrooklynNets #KyrieIrving https://t.co/7OwJwjkJ0G",
    "37": "@jimmmy_110 @ShakyWarriorAub @BrooklynNets My fault",
    "38": "[📺LIVE - 01H40] 🏀 #NBA \nToronto #Raptors @ Brooklyn #Nets en direct sur beIN SPORTS MAX 4\n#NBAextra",
    "39": "@NickFriedell The @chicagobulls or @BrooklynNets could sign Jesus to a 10 day contract and up the ante. 😄",
    "40": "Correction 7 Vaccinated Brooklyn Nets Players now have Covid.. but Kyrie can’t play lol. 🤡 🌍",
    "41": "Tonight Key Matchup @BrooklynNets vs #COVID19 https://t.co/lc4uV4cyAN",
    "42": "#NBA | ARE YOU READY? \nWe may witness history tonight!\nNew York Knicks vs Golden State Warriors\nAnd don't forget about:\nBrooklyn Nets vs Toronto Raptors\nBET HERE:\nhttps://t.co/0rTJpgSrdP https://t.co/NhojdraVna",
    "43": "@BrooklynNets hi baby. very very very very very good. thanks",
    "44": "Let me get a 10-day contract @BrooklynNets https://t.co/KChVy7r9Ky",
    "45": "And Toronto Raptors versus Brooklyn Nets. https://t.co/m4iznHq8kj",
    "46": "@BrooklynNets hi baby. very very very very very good. thanks",
    "47": "@BrooklynNets @Patty_Mills @KDTrey5 just play basketball like you have your entire life is all you need to do",
    "48": "@BrooklynNets hi baby. very very very very very good. thanks",
    "49": "@BrooklynNets Fair to say this could test our depth...",
    "50": "@ShakyWarriorAub @BrooklynNets Trade for TLC @BrooklynNets",
    "51": "@NBA it’s laughable that you’re allowing the @BrooklynNets to play tonight. Nice to see the league is looking out.",
    "52": "@BrooklynNets @Patty_Mills @KDTrey5 Olympic KD &amp; Bala about to cook, i'm sorry for you Toronto",
    "53": "@ChingKaiLok1 @BrooklynNets he's gonna bring some scoring from the bench",
    "54": "Brooklyn star James Harden among seven Nets players in COVID health and safety protocols https://t.co/CYmne42bMK",
    "55": "The @BrooklynNets starting Mills, Duke Jr., Durant, Griffin, Claxton on Tuesday. #BrooklynGrit #NBA",
    "56": "#NBA | ARE YOU READY? Great games ahead!\nNew York Knicks vs Golden State Warriors\n&amp;\nBrooklyn Nets vs Toronto Raptors\nhttps://t.co/IT7pYFdaVg https://t.co/6sbon83ULW",
    "57": "#NBA action is on #SiriusXM 167 at 7:30pmET! Don't miss #WeTheNorth as they visit the @BrooklynNets!\n\nGet the #SiriusXM app and listen FREE across Canada! Start here: https://t.co/c3z8b8Dh9D. https://t.co/l8bJNF0iSn",
    "58": "🏀 Brooklyn Nets vs Toronto Raptors\n🏆 NBA\n🗓 14/dic.\n⏰ 21:30\n📺 NBA LEAGUE PASS",
    "59": "@BrooklynNets Let's go @blakegriffin23",
    "60": "@call_me_pumpkin @BrooklynNets Nothing oo",
    "61": "@BrooklynNets @daviddukejr @KesslerEdwards hi baby. very very very very very good. thanks",
    "62": "@BrooklynNets @Patty_Mills @KDTrey5 I can wait to go to Brooklyn my first time ever I never been in NBA games",
    "63": "@BrooklynNets @Patty_Mills @KDTrey5 Olympic Patty and KD incoming",
    "64": "NBA Brooklyn Nets -2 -110 1H/ -4-105 FG",
    "65": "@BrooklynNets @Patty_Mills @KDTrey5 Ha ha yeah totally",
    "66": "@BrooklynNets @Patty_Mills @KDTrey5 If ya win I buy a cam thomas jersey",
    "67": "@BrooklynNets Yh raptors definitely gonna blow yall out.",
    "68": "@BrooklynNets @Patty_Mills @KDTrey5 This is gonna be wack",
    "69": "Focused and ready. https://t.co/cYbjpkW5z3",
    "70": "@SInow @BrooklynNets Golly I have NCAA PTSD.. I totally thought it was going to say the “transfer portal”",
    "71": "We're about a player away from being the Long Island Brooklyn Nets.",
    "72": "@Simp2020NN @BrooklynNets Are u dumb cam with the 2nd unit he gonna comes in when KD or somebody goes on the bench lawdd https://t.co/bYa4YpZjqV",
    "73": "@BrooklynNets Imagine beating the raptors with 8 players",
    "74": "I’m 10 minutes from Barclays right now and I just received my booster on Friday, y’all need an extra body? I can rebound and hit that corner three. DM me a 10 day and let’s work @BrooklynNets",
    "75": "@MrTangeles @whiteasian56 @BrooklynNets Man they got the 3rd stringers from the g league playing today besides KD all I know is that the under is looking real nice rn",
    "76": "@Fredapoku1 @BrooklynNets Lol why 😂",
    "77": "@Assong_A @BrooklynNets i hope they just keep him benched lol",
    "78": "@BrooklynNets @daviddukejr @KesslerEdwards Yall are 100% losing this game",
    "79": "@BrooklynNets Needs foul out Van fleet.",
    "80": "@24_camthomas 20 point game incoming. \n\n@BrooklynNets @nbatopshot #NBATopShotThis",
    "81": "@BrooklynNets hi baby. very very very very very good. thanks",
    "82": "@BrooklynNets Kyrie, Come out to playyyy... https://t.co/wLwoeXOOPV",
    "83": "@SOTO_ud @nikebasketball @Jumpman23 @NBAextra @NBA @ATLHawks @BrooklynNets @celtics @MELOD1P @KDTrey5 #bleedgreen i want it!",
    "84": "@BrooklynNets @daviddukejr @KesslerEdwards If it comes down to it consider signing back Mitch Creek—he could provide IF it came down to needing more guys!",
    "85": "@JeriTsaiNets @BrooklynNets Them 2 minutes of rest KD gonna get are gonna be crucial lol",
    "86": "@susan1234456789 @TheHoopCentral The Brooklyn Nets only have 8 active players tonight. 😳",
    "87": "Starting for the Brooklyn Nets:\n \nDavid Duke\n \n*confused applause*",
    "88": "@BrooklynNets Blake dropping 15+",
    "89": "@RoboStan3 @BrooklynNets oh i understand now",
    "90": "@BrooklynNets Where's cam ffs",
    "91": "@JustMik33350556 @codySWAVEYbanks @BrooklynNets @Raptors Didn't know about Harden. Covid?",
    "92": "It’s literally “where Brooklyn at” tonight for the Nets.",
    "93": "Raptors going with their regular starting lineup. \n\nNets are going with an altered lineup:\n-David Duke Jr.\n-Patty Mills\n-Kevin Durant\n-Blake Griffin\n-Nicolas Claxton\n\n3/5 starters are OUT for Brooklyn.",
    "94": "@BrooklynNets @KesslerEdwards @daviddukejr @24_camthomas No resting for them this matchup Nets should be canceled the Game.",
    "95": "@BrooklynNets Need Thomas off the bench for scoring I guess",
    "96": "@YESNetwork @BrooklynNets KD about to drop 62pts",
    "97": "Breaking: Brooklyn Nets guard James Harden and Bruce Brown have entered health and safety protocols. They’ll be out tonight vs. Raptors. (Per @ShamsCharania)",
    "98": "Brooklyn Nets gone be down bad tonight.",
    "99": "‼️‼️‼️ ANYONE IN BROOKLYN WITH A NETS JERSEY GET TO THE PRACTICE FACILITY RIGHT NOW ‼️‼️‼️",
    "100": "The @BrooklynNets have 7 players in cocos protocol…y’all need 1? I’m down to run!!!",
    "101": "I don’t understand how the Brooklyn Nets organization are going through all this and happy to have “not playing” Kyrie Irving on their roaster — what a liability.",
    "102": "@whiteasian56 @BrooklynNets Same lmao, need a KD miracle 😭😭",
    "103": "The @BrooklynNets getting decimated by Covid safety and health protocols. Meanwhile, in Kyrie's world...",
    "104": "@iStayWinning365 @codySWAVEYbanks @BrooklynNets @Raptors Harden is out no other top 10 player on that team. All of their key contributors except Patty Mills are also out. This is indeed a \"Wow\" situation.",
    "105": "@YungHerrer24 @BrooklynNets who leaked steve nash's play book SMH",
    "106": "@RoboStan3 @BrooklynNets he can’t be that bad right ?",
    "107": "@BrooklynNets I want died if we win it’s a miracle i am so devasted 😰😨",
    "108": "@BrooklynNets where is KYRIE",
    "109": "@BrooklynNets Let's fucking Goooooooooooo",
    "110": "@BrooklynNets RAPS 🔒🔒🔒🔒🔒🔒🔒🔒",
    "111": "@BrooklynNets we wouldnt have to play if KD took the night off",
    "112": "@NYXproms @BrooklynNets Scammer",
    "113": "@BrooklynNets Cam winning 6MOY confirmed",
    "114": "@whiteasian56 @BrooklynNets My tooo.... can this team beat raptors?",
    "115": "@tn_rob @BrooklynNets @daviddukejr @KesslerEdwards It was a joke lmao 🤣🤣🤣",
    "116": "@BrooklynNets Smart by Nash keeping Cam Thomas w. 2nd unit, we'll need offensive production if KD is off the floor.",
    "117": "@BrooklynNets @JHarden13 @Patty_Mills Harden just walked in the building after having Covid? I'm surprised other Nets didn't test positive",
    "118": "@MrTangeles @BrooklynNets Shit I hope",
    "119": "@BrooklynNets Oh what the hell is this",
    "120": "@BrooklynNets Adam silver costing us wins that bald demon",
    "121": "@BrooklynNets Durant go play today ?",
    "122": "@BrooklynNets if kd wins them this game give him mvp asap",
    "123": "@BrooklynNets Let me play bruh I got this 😂",
    "124": "@BrooklynNets Where's Cam???",
    "125": "@BrooklynNets @blakegriffin23 revenge game 🎮",
    "126": "@BrooklynNets If we win today, announce KD as MVP",
    "127": "@BrooklynNets i am willing to contribute to the roster https://t.co/N15w4VcqQ7",
    "128": "The @Raptors bring their much-improved defense to Brooklyn to face off against the East-leading @BrooklynNets, who may be without the services of KD and a few others. \n\nFind out if the Raps can keep things tight in @Covers_Caley's #NBA betting preview.\nhttps://t.co/P35l6b7roJ",
    "129": "@BrooklynNets Yo! get me a jersey I can at least foul some guys and delay the game!",
    "130": "@BrooklynNets DDJ starting lineup https://t.co/X9Wxa7i4x1",
    "131": "@BrooklynNets Let’s go",
    "132": "@collado04 @BrooklynNets @daviddukejr @KesslerEdwards You know that results in jail time lol",
    "133": "@BrooklynNets Start cam Thomas",
    "134": "@BrooklynNets if tlc beat the bucks, we can do this.",
    "135": "@BrooklynNets LET ME COME OFF THE BENCH G",
    "136": "@BrooklynNets MVP kd finna carry",
    "137": "@BrooklynNets Game time!",
    "138": "First on the floor tonight 5️⃣⤵️ https://t.co/AvzZvhSclG",
    "139": "The #Nets will start Patty Mills, David Duke Jr., Kevin Durant, Blake Griffin and Nic Claxton. It's Duke Jr.'s first-career start, and Brooklyn's 10th starting five of the season.",
    "140": "At Barclays center to see Brooklyn Nets. Have to get popcorn. Why? Ask ⁦@samodrole⁩ https://t.co/0KILUABWcz https://t.co/yQp9WoHVjV",
    "141": "Brooklyn Nets Facing Virus Outbreak After Five Players Enter Protocol https://t.co/NJ6adplTXJ",
    "142": "Trying to understand the pros of the Nets deciding to play Kevin Durant on a sore ankle in a game where the team is decimated with just 8 players and ruling him out would’ve postponed the game until a later date where Brooklyn was more whole.",
    "143": "Nets starting five against Raptors - Mills, Duke Jr., Durant, Griffin and Claxton.\n\nThis is Brooklyn's 10th starting five of the season.",
    "144": "@BrooklynNets Betting the house KD drops 50 again",
    "145": "@FDSportsbook @FDSBMeadowlands @FanDuel_Support Add Cam Thomas Brooklyn Nets props",
    "146": "@JustMik33350556 @codySWAVEYbanks @BrooklynNets @Raptors The team w/ the best record in the league is playing the best player in the world &amp; another top 10 player....Vs a team w/a losing record.... At home.... Not really a \"Wow\" type situation.",
    "147": "@PrinceMindset1 @BrooklynNets Seriously??🤣. Dude...I play DKs for a living and the minute they announced (an alert to my phone from DKs) that took me to a site, it said rest purposes. I see now it's covid19 crap but originally it didn't say that. All I'm saying man. I don't need to lie",
    "148": "NBA Live Game Thread: Brooklyn Nets vs. Toronto Raptors, 7:30PM EST https://t.co/FqzyICbxN0 https://t.co/N7bSBJkIzc",
    "149": "Did the @BrooklynNets know this was coming on Sunday? Did anyone else find it really odd that @SteveNash started wearing a mask again out of nowhere on Sunday in Detroit. There was no requirement by the NBA at the time. Almost like they knew what was about to happen. 🤔 🧐",
    "150": "@BrooklynNets @daviddukejr @KesslerEdwards Get me a jersey I can at least foul some Toronto player and delay the game so KD doesn’t have to play 48 minutes.",
    "151": "@IanBegley Kyrie not going anywhere. These rumors are just plain rumors. KD came to Brooklyn to play with Kyrie. Nets not trading him unless KD accepts which doesn't seem like he will.",
    "152": "@BrooklynNets Let's get it @KDTrey5!!!👊🏽👊🏽",
    "153": "i’m ready for my 10 day contract @BrooklynNets",
    "154": "@BrooklynNets Scoring 60 tonight",
    "155": "Consensus Line Move:\n2021-12-14 Toronto Raptors at Brooklyn Nets from -5.00 to -4.00\n#WeTheNorth what did I miss\n#NBA #espn #programming #forexlifestyle",
    "156": "I’m all stretched out if you guys need a body to hand out 6 hard fouls tonight @BrooklynNets",
    "157": "Obvious outbreak on the Nets. Barely have 8. Bulls had 9 and the league pulled the plug. Why is Brooklyn being forced to play? Did NYC not put pressure on them the same way Chicago put pressure on the Bulls?",
    "158": "@africaatl @BrooklynNets Oh yeah? Raptors had to play out of Tampa with no staters for almost 3 months. Suck it up buttercup.",
    "159": "“Several Brooklyn Nets players landed in the league’s health and safety protocols Tuesday morning, and the Los Angeles Lakers canceled practice ahead of their trip to Dallas.”\n\nIf only we had a vaccine.\n\nhttps://t.co/ThEJeF1V4k",
    "160": "I'm free tonight... 🤔 @BrooklynNets https://t.co/QPssJlh374",
    "161": "KD has arrived 😤 @BrooklynNets https://t.co/aKSY5zHdqF",
    "162": "Things To L👀k Out For In The Nets vs. Raptors Game:\n\n▪️Kevin Durant has averaged 27 PPG on 48% shooting against the Raptors in his career.\n▪️Pascal Siakam is grabbing down a career-best 8 RPG.\n▪️Nic Claxton has logged 19 MPG in Brooklyn’s last 4 games.",
    "163": "Everybody ready for another @KDTrey5 50+ game tonight? #BrooklynNets #bluecollarboys",
    "164": "@themovieguy23 @BrooklynNets U think this team can beat Raptors?",
    "165": "Brooklyn Nets  super star James Harden is out with COVID protocols. VIa @wojespn",
    "166": "@BrooklynNets Rest him 😔",
    "167": "@BrooklynNets @daviddukejr @KesslerEdwards Shouldn't the game be postponed when so many players are out?",
    "168": "@codySWAVEYbanks @BrooklynNets @Raptors That tells you how much the oddsmakers respect Kevin Durant.",
    "169": "@KingJosiah54 COVID came to Brooklyn nets like https://t.co/zN9ru9V4xz",
    "170": "@BrooklynNets listen if we need a point guard and another shooter, \n\n@sarahkustok &amp; @Rjeff24 are available. \n\nWe know Kustok put in work at DePaul, and RJ use to be a Net!!",
    "171": "@BrooklynNets 60 POINTS",
    "172": "@BrooklynNets @daviddukejr @KesslerEdwards Damn",
    "173": "@zolabeille24 @BrooklynNets Ah shit here we go the goat vs a whole other organization 🐐 60 pts tonight",
    "174": "@collado04 @BrooklynNets Why 1.4 odds for @BrooklynNets whitout Harden?? Raptor are in fire.",
    "175": "@Shainevercaps @BrooklynNets @daviddukejr @KesslerEdwards Yeah same. I hope he can play would be perfect for the nba",
    "176": "@rudosk @BrooklynNets @KyrieIrving Tell the NY state gov",
    "177": "@Kasperhedegaar @BrooklynNets Yeah he is. I don’t think he get the highest usage with his ankle issue.. But you Never know these teams are effing greedy and will have everyone play even with a broken leg.",
    "178": "@BrooklynNets Available, so they can play, but is HE starting?",
    "179": "@JCdeez @BrooklynNets Just say u were lying and move on",
    "180": "@BrooklynNets traveled the country and got the covid. ****!!",
    "181": "@unseensamy The Brooklyn Nets too right now ✋",
    "182": "The @Raptors make a quick stop on the road as they take on the @BrooklynNets tonight. \n\n#Raptors pre-game show with @Paul__Jones is coming up next! #WeTheNorth \n\nListen live 🎧 https://t.co/kGILl37UoU https://t.co/UVCvSVs4hn",
    "183": "@JCdeez @BrooklynNets Where did u read it at?",
    "184": "@BrooklynNets just say KD can't play and postpone this game.",
    "185": "@BrooklynNets Do the right thing and postpone the game @NBA",
    "186": "Can The Brooklyn Nets Keep The #1 Seed with half the team in Covid Protocols 😓😓 https://t.co/uBi05UKps0",
    "187": "@BrooklynNets No...This is so stupid...the NBA need to take a week break because it's too many players entering covid protocol",
    "188": "@BrooklynNets @daviddukejr @KesslerEdwards Kevin Durant's 105 points night",
    "189": "@NBA @BrooklynNets @KDTrey5 shut down the league, we only have 1 starter, Patty Mills and G league players. Make it fair if you postpone Bulls games postpone ours.",
    "190": "@BrooklynNets @daviddukejr @KesslerEdwards Step up Cam Thomas",
    "191": "I am glad @BrooklynNets got this out of the way before the Christmas Day game.",
    "192": "@BrooklynNets @daviddukejr @KesslerEdwards Well they have 8 people so yea next man up",
    "193": "@BrooklynNets @daviddukejr @KesslerEdwards Cam thomas dropping 50?",
    "194": "@BrooklynNets 7 of the main rotation out 🤦🏽‍♂️",
    "195": "@BrooklynNets @daviddukejr @KesslerEdwards rest KD and get the game cancelled!",
    "196": "@BobbyMarks42 It’s time for Brooklyn nets to sign Lance https://t.co/tQskAr4qh5",
    "197": "So the @BrooklynNets didn't want to let Kyrie play because he was unvaccinated, but now have 8 players with COVID. How is that vaccine working out for you?",
    "198": "Tonight, 3 lucky fans that show up in Brooklyn Nets jerseys for tonight’s matchup vs Toronto Raptors will get to play in the game. #NBAJerseyDay",
    "199": "@vicecity4life @BrooklynNets @daviddukejr @KesslerEdwards Me too I just wish they would just the league down for two weeks. So many contenders will start losing it's basically up to the teams that have no Covid will be winning. I think after Christmas break if Covid is still bad they would shut it down.",
    "200": "@JCdeez @BrooklynNets Source?",
    "201": "Let me get a jersey I’m ready @BrooklynNets https://t.co/kqowL05GRo",
    "202": "@ItBegins2012 @BrooklynNets My dream would be to face former 3 pt champion, Joey buckets, to a shootout.",
    "203": "@Hoodie7Melo @RatiodByJynx @BrooklynNets @daviddukejr @KesslerEdwards he can save us once or twice, but our schedule are going to kill us if the games are not going to be postponed",
    "204": "Nets should, however, have ruled KD out. Postpone the game. If Chicago can do it with no repercussions, Brooklyn should the same.",
    "205": "@BrooklynNets @daviddukejr @KesslerEdwards Play KD all 48",
    "206": "@Shainevercaps @BrooklynNets @daviddukejr @KesslerEdwards Can't wait for his return look at the league rn weird thing from nyc",
    "207": "@BrooklynNets @daviddukejr @KesslerEdwards SHARPE !?",
    "208": "@BrooklynNets @daviddukejr @KesslerEdwards @KyrieIrving doesnt have covid....",
    "209": "@BrooklynNets @daviddukejr @KesslerEdwards Call Kyrie and fake up a vaccination card",
    "210": "@BrooklynNets @daviddukejr @KesslerEdwards Cancel the game",
    "211": "@BrooklynNets @daviddukejr @KesslerEdwards It's bs just forfeit and take the extra rest",
    "212": "@Hoodie7Melo @BrooklynNets @daviddukejr @KesslerEdwards Stfu 😭",
    "213": "@BrooklynNets @daviddukejr @KesslerEdwards Lmaoooooo fuck this bro",
    "214": "@BobbyMarks42 Sign me to fill out the bench @BrooklynNets I’ve been tested weekly for my job in healthcare! Can’t make a jumper but I’ve got the intangibles!",
    "215": "@BrooklynNets @daviddukejr @KesslerEdwards You better win",
    "216": "@BrooklynNets @daviddukejr @KesslerEdwards There’s no next man up 😂 #safetyprotocol",
    "217": "@neuf4i @BrooklynNets @daviddukejr @KesslerEdwards Cant do that, somebody might get Covid..",
    "218": "@vicecity4life @BrooklynNets @daviddukejr @KesslerEdwards It's home, he can't play because of Brooklyn rules not Nets. Away its up to the Nets, and I think they will let him play his first game back Christmas game. It just makes too much sense to not too. We have 6 home then against the Lakers. With Harden out I am sure Kyrie will play.",
    "219": "@BrooklynNets @daviddukejr @KesslerEdwards YESSIR ROOKS",
    "220": "@BrooklynNets @daviddukejr @KesslerEdwards Fuck dat! Postpone that damn game",
    "221": "@JCdeez @BrooklynNets Harden is not resting Bruce and harden has to go through Covid protocol",
    "222": "@BrooklynNets Going to be like that episode of @alwayssunny when the Eagles had tryouts 😂",
    "223": "@BrooklynNets @daviddukejr @KesslerEdwards Need a cam thomas 30 piece tn",
    "224": "@BrooklynNets @daviddukejr @KesslerEdwards The covid super spreader game.",
    "225": "@BrooklynNets @daviddukejr @KesslerEdwards Why can't Kyrie play?",
    "226": "@BrooklynNets @daviddukejr @KesslerEdwards bring kyrie back",
    "227": "Kyrie is available, if you need him 🤡 @BrooklynNets @KyrieIrving https://t.co/Pf9xJsUK1H",
    "228": "@JCdeez @BrooklynNets Gotcha…I wasn’t sure how many players they still had available. Seen a bunch pop up as out, but guess the ones that are good to go can expect some heavy run tonight.",
    "229": "@BrooklynNets @daviddukejr @KesslerEdwards netspleasewin",
    "230": "@susan1234456789 @NBA @BrooklynNets @KDTrey5 Lmao",
    "231": "Next Man Up mentality 💪 https://t.co/7TmK4gmdYU",
    "232": "@Badandy538_ @BrooklynNets You gotta make a video sometime at the park, I need to see it",
    "233": "@SociosHoops @socios @BrooklynNets James harden #Sweepstakes",
    "234": "@OfficialJohnRod @BrooklynNets @NBA If they have at least 8 available players, they play.",
    "235": "@BrooklynNets Oh. Lmao who’s left",
    "236": "@BrooklynNets Toronto in trouble",
    "237": "It’s been a while but I am available @BrooklynNets",
    "238": "@ItBegins2012 @BrooklynNets I can shoot better than 32% from 3 for sure.",
    "239": "@Hargoat13 @BrooklynNets Im gonna kms",
    "240": "@NBA @BrooklynNets @KDTrey5 Not again man 💔 https://t.co/pEzAWJAK6H",
    "241": "@TinaLara29 @NBA @BrooklynNets @KDTrey5 I hate everybody rn lol",
    "242": "@Kaz_cbk @BrooklynNets He is playing according to fantasylabs👍",
    "243": "@BrooklynNets He dropping 60",
    "244": "@JCdeez @BrooklynNets They have to go through Covid protocol",
    "245": "@BrooklynNets i’m available https://t.co/ysMebzHKj6",
    "246": "@BrooklynNets Dude is built different",
    "247": "@BrooklynNets This mf never sleeps",
    "248": "@susan1234456789 @NBA @BrooklynNets @KDTrey5 Sis you were just saying you wanted Russ to play with KD😂😭",
    "249": "The @BrooklynNets will only have 8 active players tonight against the @Raptors and are still favored by 4 points.....WOW",
    "250": "No way we’re playing this stupid basketball game right? Lol @BrooklynNets @NBAOfficial",
    "251": "At what point does the @BrooklynNets /@Raptors get postponed. This is crazy.",
    "252": "If y’all need a center holla at me @BrooklynNets",
    "253": "@BrooklynNets Time to get... dirty https://t.co/lp5etVeOJt",
    "254": "@Badandy538_ @BrooklynNets Nahh chill I’m 15 min out &amp; I’ll match your ability with no hustle and slow speed on the court.",
    "255": "@NBA @BrooklynNets @KDTrey5 Soooo… they’re playing then?",
    "256": "I’m on my way @BrooklynNets https://t.co/M5J6PkhVWW",
    "257": "@NBA @BrooklynNets @KDTrey5 Nobody give af",
    "258": "@SociosHoops @socios @BrooklynNets Dang, I don't get a shout out...",
    "259": "@BrooklynNets CMONNNNNNM",
    "260": "@BrooklynNets wassup yah need one ?",
    "261": "@BrooklynNets my god",
    "262": "@NBA @BrooklynNets @KDTrey5 Overrated",
    "263": "@BrooklynNets @SeanMarksNetsGM I’m ready!! https://t.co/1jJn3csCaL",
    "264": "work invited me last minute to their private suite at the nets game at barclays ✌🏽 fitting last week in brooklyn",
    "265": "Coming off his @BrooklynNets career-high 51 points...look back at ALL of @KDTrey5's 50-point games!\n\n🏀: Nets/Raptors\n⏰: 7:30pm/et on League Pass\n➡️: https://t.co/tA5eQtgVqm https://t.co/X7H6D12lAZ",
    "266": "@SociosHoops @socios @BrooklynNets Clax always pulling off a fit!",
    "267": "Brooklyn Nets star James Harden and forward Bruce Brown have been added to the NBA’s COVID protocols just one hour before the team hosts the Toronto Raptors. \n\nhttps://t.co/2RfKlrB02c",
    "268": "#itsnotgoingaway #livewithit #vaccinesdontwork @BrooklynNets Harden, Brown enter NBA's COVID-19 protocols\nhttps://t.co/rQhk2pFy3h",
    "269": "@BrooklynNets Let that man rest!",
    "270": "@Badandy538_ @BrooklynNets So you’re a better version of Joe Harris in the playoffs",
    "271": "@Ddelliponti08 @BrooklynNets basicalLY the raptors are gonna get a free win",
    "272": "Bring in Tyler Johnson @BrooklynNets",
    "273": "I hope the Brooklyn Nets finish up their covid drama before playing in LA on Christmas / Dec 27. It’s been so long since I’ve seen KEVIN DURANT play basketball! 😩 It’s all I want for Christmas. Luckily he got those antibodies, I think. Stay healthy 🙏 @KDTrey5",
    "274": "The Brooklyn Nets announce James Harden and Bruce Brown have both entered health and safety protocols prior to tonight’s contest against the Toronto Raptors.",
    "275": "@BrooklynNets I can play !!!",
    "276": "Who infected every Brooklyn  net",
    "277": "@BrooklynNets Who the fuck are you going to surround KD with?",
    "278": "@BrooklynNets THE GOAT 1v15",
    "279": "If the Nets need me. I can get ready in 25 minutes. I can hit shots but don’t expect me to defend.  @BrooklynNets",
    "280": "@BrooklynNets Cancel the game pls",
    "281": "@BrooklynNets Kd and Blake tonight https://t.co/sGVqqwCGO7",
    "282": "James Harden and Bruce Brown Jr. are the latest Nets to enter league safety protocols. \n\nBrooklyn is down to the minimum eight eligible players for tonight:\nhttps://t.co/6ugfUD1zQx",
    "283": "Our top @NBA @FanDuel value play of the day is $4,200 @BrooklynNets SG Cam Thomas. The Nets have 8 active players. All their usage rates should sky rocket! 🚀 Get all the exposure on this Nets team vs the @Raptors. #FanDuel #NBA #NBA75 #NBATwitterLive #DFS https://t.co/kPSvFS2Osd",
    "284": "@kewonito @BrooklynNets Exacto",
    "285": "i’m ready @BrooklynNets https://t.co/Tol147Wo1F",
    "286": "Kevin Durant playing for the Brooklyn Nets tonight. https://t.co/cuiEx7toqa",
    "287": "@BrooklynNets Are we really playing tonight?",
    "288": "@BrooklynNets @Michael8easley You have 8 active players sign him",
    "289": "@BrooklynNets This there even a need to watch this game",
    "290": "@BrooklynNets Thank god",
    "291": "@SInow @BrooklynNets Oh shit",
    "292": "@BrooklynNets KD playing knowing if he didnt Nets would rest and have a chance to win this later is MVPesque",
    "293": "@BrooklynNets Just rest KD and let's give up this game please ,  we can't win with just 7 players",
    "294": "Need one tonight y’all? @BrooklynNets \n\nAveraging 28.5 PPG in my weekend Rec league, but I’ll just let KD shoot.. DM me",
    "295": "@BrooklynNets it's the Raptors, Let's get another 81, KD!",
    "296": "@JfromBk @BrooklynNets @MZegarowski1 Idk who he is but Js word is law sign him",
    "297": "Brooklyn Nets' COVID-19 protocols list grows to five as four more players get ruled out - via @ESPN App.  #NBA.  #Nets.   https://t.co/DAnSbr6lQa",
    "298": "@BrooklynNets This isn’t wise 😬",
    "299": "@BrooklynNets KD tonight https://t.co/GMJW5Mo7Qk",
    "300": "@BrooklynNets PTSD of last years injury reports",
    "301": "@BrooklynNets LMAOOO",
    "302": "@BrooklynNets @aceCourtBot render",
    "303": "@BrooklynNets This game still actually happening ??",
    "304": "@BrooklynNets Guess it don’t feel good",
    "305": "@BrooklynNets That’s my MVP🔥🔥🔥",
    "306": "@BrooklynNets Rest him",
    "307": "5 hardship exceptions will be available for Brooklyn\n\nEach contract would cost close to $500K toward the Nets luxury tax bill. https://t.co/nEz8yJvkIC",
    "308": "The Brooklyn Nets only have 8 active players tonight 🤯\n\n#NBA | #NetsWorld",
    "309": "@BrooklynNets JUST GIMME SOME DAY'RON SHARPE PIC'S FOR TODAY",
    "310": "@BrooklynNets The Kevin Durant Nets, it’s just him taking on team alone every fucking night",
    "311": "@KhashHater @BrooklynNets Not if I have sum to say about it",
    "312": "@BrooklynNets we runnin this one today https://t.co/7lOYNTYhBG",
    "313": "@BrooklynNets kyrie too😋😋😋😋",
    "314": "The Brooklyn Nets will have 8 available players tonight: \n\n• Kevin Durant\n• Patty Mills\n• Cam Thomas \n• Blake Griffin \n• Nic Claxton \n• Day'Ron Sharpe\n• David Duke Jr. \n• Kessler Edwards https://t.co/4opn1nZYd7",
    "315": "Update to tonight’s status report: https://t.co/JYCeTHaMZQ",
    "316": "@BrooklynNets Sit this shit out u weird nigga",
    "317": "@JeriTsaiNets @BrooklynNets It's gonna be a KD Cam show",
    "318": "@BrooklynNets How!? Half the team is in protocols 😢😢",
    "319": "@BrooklynNets Play him tonite, and win, then fake an injury so we can postpone our next week of games ... win win",
    "320": "@BrooklynNets MY GOAT LFG 😤",
    "321": "@BrooklynNets So Kyrie was right not to get the vaccine since Harden still caught Covid??",
    "322": "@BrooklynNets should’ve been out so we can postpone tbh",
    "323": "@BrooklynNets C'mon guys, do something... we can't have game, look at what's happening!!!",
    "324": "@_Kwame_Jnr @Richard_otis_ Brooklyn Nets still winning, don't cash out",
    "325": "@JJ_DeVuelta @BrooklynNets KD is AVAILABLE for tonight’s game",
    "326": "@BrooklynNets I was hoping for a Cam Thomas show, just relax and watch the greatness KD",
    "327": "Noooo. Please dont trade Joe Harris @BrooklynNets.",
    "328": "@BrooklynNets And that’s enough to whoop some asses😊",
    "329": "@TuckFitter3 @ashwnkok @auxxcordpapi @248_kq @BleacherReport @brkicks How many did you actually know what was going on? 😂😂 cuz ik no grown ass man is stalking bleacher report tweets to talk trash about the Brooklyn Nets 😂",
    "330": "@themovieguy23 @BrooklynNets no worries you’ll be fine hopefully you can join the bulls soon",
    "331": "@BrooklynNets WTF BRUH",
    "332": "@BrooklynNets They need to cancel the game",
    "333": "@BrooklynNets Honestly would’ve preferred him out so they can postpone but KD for going for 80 isn’t bad.",
    "334": "@BrooklynNets bring kyrie back motherfuck",
    "335": "ALERT: New high roller bet posted!\nA bet has been placed for $8011.59 on Brooklyn Nets - Toronto Raptors to win $17,625.49.\nTo view this bet or copy it https://t.co/4VeLSi9a3x https://t.co/uVN41njwqV",
    "336": "@BrooklynNets He’s going to need to drop 70 tonight, cheers",
    "337": "@BrooklynNets 💯💯best news",
    "338": "@BrooklynNets All you had to do was sit him and they game would have been postponed 🤦‍♂️",
    "339": "The Brooklyn Nets only have 8 active players tonight. 😳",
    "340": "@BrooklynNets We have 8 players my guy",
    "341": "@BrooklynNets Ngl that mandate has to go, this shit ain’t it",
    "342": "@BrooklynNets Really bad idea.",
    "343": "@BrooklynNets He’s gonna drop 59, remember this tweet",
    "344": "@BrooklynNets I hope he doesn't gets covid",
    "345": "@BrooklynNets Our savior",
    "346": "@BrooklynNets Cancel the game pls",
    "347": "I'm at @BarclaysCenter for @BrooklynNets vs @Raptors in Brooklyn, NY https://t.co/URW8tffIJZ",
    "348": "i’m available to play for the rookie minimum @BrooklynNets",
    "349": "@BrooklynNets he's gonna have all 5 raptors guarding him smh",
    "350": "@BrooklynNets No!!!! sit him!! Dont get him injured",
    "351": "@BrooklynNets this mf really married to the game",
    "352": "@BrooklynNets Tell me what the point of the mandates are again",
    "353": "@BrooklynNets KD tonight: https://t.co/PDWKciFwe3",
    "354": "@BrooklynNets The greatest player in the world",
    "355": "@BrooklynNets Yay eight people 😐",
    "356": "@BrooklynNets Idc cancel the game",
    "357": "@BrooklynNets hes breaking wilts record",
    "358": "@BrooklynNets this gonna be madddd interesting",
    "359": "@BrooklynNets We have 8 players",
    "360": "@BrooklynNets KD vs an entire country",
    "361": "Raptors-Nets games in Brooklyn are always weird https://t.co/NiZI65FlGA",
    "362": "@BrooklynNets that’s all we need",
    "363": "KD is AVAILABLE for tonight’s game https://t.co/0NH4VJCkNO",
    "364": "@BrooklynNets @JHarden13 @Patty_Mills Harden can't play no more. He's in health and safety protocols",
    "365": "@BrooklynNets 10 day me",
    "366": "I’m available @BrooklynNets https://t.co/45byZuVMsQ",
    "367": "BREAKING: James Harden &amp; Bruce Brown have entered Covid-19 protocols, lifting Brooklyn’s total to 7 players in the protocols. \n\nNets will play with just 8 players, including Kevin Durant, tonight vs. Toronto 😳 https://t.co/MGCrWlPOui",
    "368": "@SociosHoops @socios @BrooklynNets James Harden",
    "369": "Report:\n\nThe Brooklyn Nets have signed Me and @PlayboiClaxton to play for the Nets tonight. Expect big minutes from these two young superstars tonight.",
    "370": "NBA Games Today: 12/14/2021\nGolden State Warriors vs New York Knicks 🔥🔥🔥\nToronto Raptors vs Brooklyn Nets 🔥🔥🔥\nPortland Trail Blazers vs Phoenix Suns 🔥🔥🔥\nNOTE: All Rating Are Calculated By PCT",
    "371": "James Harden has entered the NBA’s health and safety protocols, per the @BrooklynNets https://t.co/EdixdDhYx3",
    "372": "The same shit happened last year when the Raptors played the Nets in Brooklyn with KD testing positive for Covid in the middle of the game",
    "373": "The Brooklyn Nets are such an unserious franchise",
    "374": "Cancel Nets games now @NBA @BrooklynNets",
    "375": "Brooklyn #Nets G James Harden has entered health and safety protocols. #NBA https://t.co/oUSc5E6sd9",
    "376": "“At shooting guard for your Brooklyn Nets, number 3, deGromsBurner” https://t.co/llvR5XW5rQ",
    "377": "Brooklyn Nets should just list KD OUT to get the game postponed",
    "378": "@SociosHoops @socios @BrooklynNets Claxton all the way #Sweepstakes https://t.co/9XwviRT5Xv",
    "379": "Brooklyn Nets are currently without:\nJames Harden\nBruce Brown\nPaul Millsap\nLaMarcus Aldridge\nJames Johnson\nDeAndre' Bembry\nJevon Carter\nhttps://t.co/bVWH4AMCA2",
    "380": "I haven’t played ball in years but I’m here if you need a facilitator @BrooklynNets https://t.co/2WB5YJIQoc",
    "381": "Looks like it’s time for Nash, Amare, and Korver to suit up for the @BrooklynNets tonight!",
    "382": "@SociosHoops @socios @BrooklynNets James Harden #Sweepstakes",
    "383": "@SociosHoops @socios @BrooklynNets Clax",
    "384": "James Harden has entered health and safety protocols, per the @BrooklynNets https://t.co/hbKgiLsruK",
    "385": "I'll suit up @BrooklynNets https://t.co/fbokwJOcuQ",
    "386": "Nets guards James Harden and Bruce Brown have entered health and safety protocols, the team just announced. Brooklyn now has seven players in protocols.",
    "387": "Stateside action tipping off this evening:\n\n🏀 Golden State Warriors @ New York Knicks\n🏀 Toronto Raptors @ Brooklyn Nets\n🏀 Phoenix Suns @ Portland Trail Blazers\n\n👇 Click below to view our latest markets.",
    "388": "Now seven Nets in health and safety protocols. Sixers are in Brooklyn on Thursday night. https://t.co/A5unKKHmLV",
    "389": "Yo is Kevin Durant play or not? @BrooklynNets",
    "390": "The Nets just announced James Harden and Bruce Brown have entered the health and safety protocols. That’s seven players in them for Brooklyn in the last 24 hours.",
    "391": "@SociosHoops @socios @BrooklynNets James harden #Sweepstakes",
    "392": "@SociosHoops @socios @BrooklynNets James harden",
    "393": "@SociosHoops @socios @BrooklynNets Harden! #Sweepstakes https://t.co/008r3aZYlu",
    "394": "@SociosHoops @socios @BrooklynNets James Harden #sweepstakes",
    "395": "@apbrinks @BrooklynNets @_claxton33 Suiting up for the New Jersey Nets",
    "396": "@BrooklynNets @_claxton33 Is kd playing?",
    "397": "@PrinceMaglaya2 @notjmorant @BrooklynNets @JHarden13 @Patty_Mills He’s questionable still",
    "398": "@BrooklynNets @KesslerEdwards @daviddukejr @24_camthomas Been seeing some nets wearing kds lately. He’s hooking up the team",
    "399": "@SociosHoops @socios @BrooklynNets Joe Harris #Sweepstakes",
    "400": "@jaynftbeliever 1. Brooklyn Nets\n2. Golden State Warriors\n3. Portland Trail Blazers\n\nTS: StathisVog",
    "401": "@SociosHoops @socios @BrooklynNets PATTY https://t.co/lMHHyfEUn9",
    "402": "@SociosHoops @socios @BrooklynNets You see it https://t.co/9FjtsG2E92",
    "403": "@TimBontemps @Kayla_Grey @NBA  please cancel @BrooklynNets vs @Raptors  we have PTSD from and TampaBay",
    "404": "#NetsWorld! It's the 14th day of @socios and we're giving away 2 tickets to the 76ers vs @BrooklynNets game on 12/30!\n\nRules to Enter: \n✅ Follow @SociosHoops \n✅ RT\n✅ Comment which Nets player is the most stylish + #sweepstakes\n\nOfficial T&amp;Cs: https://t.co/pnBeK7KPrq https://t.co/pcugu0tgd0",
    "405": "Get a preview of the Toronto Raptors vs. Brooklyn Nets basketball game. https://t.co/ZrkXhuhqf3\nvia @ESPN App https://t.co/nALCbLiXno",
    "406": "@BrooklynNets @_claxton33 wheres kyrie",
    "407": "Put Cam Thomas (Brooklyn Nets) player props up cowards @FDSportsbook @FanDuel_Support",
    "408": ".@WindhorstESPN on Kevin Durant carrying the Brooklyn Nets, the NBA’s COVID situation &amp; Steph Curry's chase for the all-time 3-pt record #NBA https://t.co/eXVugRF60p",
    "409": "Warriors vs. Knicks drinking game. \ntake 🥃 every time someone mentions: \n\n- Steph Curry wanting to be a Knick\n- Reggie Miller or Ray Allen \n- mentions NYK 4th seed last season \n- BING BONG \n- Kemba Walker \n- says ‘Knicks lack of defense’ \n- Nets or Brooklyn",
    "410": "@BrooklynNets 19-8 standing and with 9 to 10 players,no problemo! There's 2.37% chance that Irving will be vaccinated by a plant-based vaccine.",
    "411": "@BrooklynNets Rookie minutes let’s gooo 👏🏽",
    "412": "My favorite @BrooklynNets uniforms. \n\n#NBAJerseyDay https://t.co/xU2yqntBid",
    "413": "@BrooklynNets @KesslerEdwards @daviddukejr @24_camthomas Play Kessler 🙏🏾",
    "414": "@BrooklynNets @_claxton33 He better hit some 3s. Admin suit up in case they need another body",
    "415": "Brooklyn Nets' COVID-19 protocols list grows to five as four more players get ruled out - ESPN https://t.co/pH6BMvOvCM https://t.co/wblF4IWrJd",
    "416": "@BrooklynNets @_claxton33 Yessir 🦾☝🏼🔒",
    "417": "@BrooklynNets @_claxton33 House of Covid",
    "418": "@LaVinesBurner @BrooklynNets @_claxton33 It would’ve been announced",
    "419": "@BrooklynNets @_claxton33 SHARE SHARPEEEEE",
    "420": "@BrooklynNets @_claxton33 Is Kyrie playing today?",
    "421": "@BrooklynNets @_claxton33 Why he practicing shooting",
    "422": "Clax in the 🏠 https://t.co/9INQAYWf9X",
    "423": "@BrooklynNets @KesslerEdwards @daviddukejr @24_camthomas is KD playing?",
    "424": "I swear if I see 1 tweet that suggests the Brooklyn Nets should trade for Russell Westbrook.....",
    "425": "@BrooklynNets @KesslerEdwards @daviddukejr @24_camthomas Free dayron",
    "426": "@BrooklynNets @KesslerEdwards @daviddukejr @24_camthomas Cam Thomas breakout game",
    "427": "@BrooklynNets @JHarden13 @Patty_Mills Wheres KD",
    "428": "@EHCMBB @emoryandhenry @GoWasps @BrooklynNets @barclayscenter Have to ask  \nWho are they playing ?",
    "429": "@BrooklynNets @JHarden13 @Patty_Mills Patty Mills looking like he about to headline a rap concert",
    "430": "@BrooklynNets @KesslerEdwards @daviddukejr @24_camthomas Announce Kyrie",
    "431": "Nets Wire commemorates the record-breaking feat of Kevin Durant with an epic photo gallery of the Brooklyn Nets star’s performance.  https://t.co/ATeXLKC0hN",
    "432": "🏀 RAPTORS VS NETS! \n\nThe @Raptors are in Brooklyn to face the night @BrooklynNets tonight…\n\nCan they leave BK with a W? \n\n#MakeAPlay ➡️https://t.co/qUPBOzx6EM #WeTheNorth #NetsWorld https://t.co/sSPtaXMAbw",
    "433": "Who is a better investment?  #kevindurant #stephencurry #3pointgoat #brooklynnets #goldenstatewarriors",
    "434": "@notjmorant @BrooklynNets @JHarden13 @Patty_Mills My bro his out for tonight 😭",
    "435": "\"Majority\" of Nets in COVID protocols are asymptomatic, Steve Nash just says before Raptors-Brooklyn game\nJust waiting for test results on any others\n\"Be ready to audible\"",
    "436": "Cuz it's #NBAJerseyDay\nCOY💪 @BrooklynNets https://t.co/2JMKt8MGaQ",
    "437": "@JBenko95 @BrooklynNets @KesslerEdwards @daviddukejr @24_camthomas Lakers fan?",
    "438": "@BrooklynNets @JHarden13 @Patty_Mills Is kd out",
    "439": "@BrooklynNets @KesslerEdwards @daviddukejr @24_camthomas Kessler 👀👀👀",
    "440": "@BrooklynNets @JHarden13 @Patty_Mills Harden Goat",
    "441": "@Honestfann252 @BrooklynNets @JHarden13 @Patty_Mills Ya mutha runs New York",
    "442": "Congrats to NYCFC. You’re all this pathetic sports area has. @Giants @nyjets @Yankees @Mets @nyknicks @BrooklynNets",
    "443": "@BrooklynNets @JHarden13 @Patty_Mills WHERE IS SHARPEEEEE",
    "444": "@BrooklynNets @JHarden13 @Patty_Mills Kd playing?",
    "445": "@BrooklynNets @JHarden13 @Patty_Mills Post kd",
    "446": "Tonight’s #TSR and @Bill_1312 #NBA75 SGP paying +4167 …\n#WeTheNorth #BrooklynNets https://t.co/H1WZzmm07E",
    "447": "There’s no place like home https://t.co/9FQzG3xGIl",
    "448": "NBA Betting Preview: Toronto Raptors vs. Brooklyn Nets https://t.co/ObVaHTz1vC",
    "449": "Unbelievable experience!!! Also topped the day off with a WIN in the big apple 🍎 @EHCMBB @BrooklynNets https://t.co/ZfMIYVleGC",
    "450": "NBA free pick of the day 🏀\nBrooklyn Nets vs Toronto Raptors - under 215,5 points (1,85)\n\nWith the news of Durant not playing and Harden possibly out of the lineup, the Nets are facing the Raptors severely depleted and the points could be hard to come by.",
    "451": "Broke down today’s matchup between the Toronto Raptors and Brooklyn Nets.  Jump in and check out my analysis and best bet 👊🏼 https://t.co/0sb6bVq8ju",
    "452": "@BrooklynNets @KesslerEdwards @daviddukejr @24_camthomas WHERE IS SHARPE!?",
    "453": "It was a honor to be part of the ribbon cutting ceremony for the Joseph A. Taub School. Joe is a Paterson legend and was a great mentor. This state of the art facility is a deserving honor for Joe and his family. #Legend #Mentor @BrooklynNets @YESNetwork @Paterson_Public https://t.co/VOJi6DPh2K",
    "454": "It’s GAME DAY FOR @raptors As They Play The Brooklyn Nets https://t.co/EIGBBlFEyv",
    "455": "#Basketball,\n\n#NBA, #NBATwitter,\n\n#Raptors, #RTZ, #WeTheNorth,#TorontoRaptors, vs. #WeGoHard, #Nets, #BrooklynNets, Get your best odds - fast at https://t.co/Ohl03KWAVe https://t.co/DfHRu7ZzhV",
    "456": "@BrooklynNets @KesslerEdwards @daviddukejr @24_camthomas I'm here",
    "457": "@BrooklynNets @KesslerEdwards @daviddukejr @24_camthomas In cam we trust",
    "458": "@bballbby @stephenasmith @trailblazers @BrooklynNets @KDTrey5 @KyrieIrving 🤣 yeah I was wrong",
    "459": "TIP: Brooklyn Nets - Toronto Raptors, 2&amp;216.5-, 4.90 by #tipster Torbica95 (profit this month: +84.00)\n  #betting #Basketball #Brooklyn #Nets #Toronto #Raptors",
    "460": "@BrooklynNets @KesslerEdwards @daviddukejr @24_camthomas 👀👀 oh shit",
    "461": "Brooklyn #Nets 2nite (shorthanded) 🏀🏀 Group chat Must Look like Manalapan Rec Summer League @justinl222 @MatanZucker @alongzz2 @zcrockett11 😂😂 https://t.co/od3fkicJAd",
    "462": "In Brooklyn for the Nets vs. Raptors. #NBA https://t.co/7oNwBrShTt",
    "463": "@BrooklynNets @KesslerEdwards @daviddukejr @24_camthomas Soon: https://t.co/Jd79wJMTOF",
    "464": "NBA LIVE TODAY🔴 Toronto Raptors vs Brooklyn Nets - 14th December 2021 | ... https://t.co/YiFutVX3sy",
    "465": "@BrooklynNets @KesslerEdwards @daviddukejr @24_camthomas Sub-20 team 😎",
    "466": "@BrooklynNets @KesslerEdwards @daviddukejr @24_camthomas We want Kyrie Irving",
    "467": "@BrooklynNets @KesslerEdwards @daviddukejr @24_camthomas Don’t even play the starters this game",
    "468": "@BrooklynNets @KesslerEdwards @daviddukejr @24_camthomas What about day’Ron",
    "469": "@BrooklynNets @KesslerEdwards @daviddukejr @24_camthomas W ROOKS PLAYING TIME",
    "470": "Y’all know who I’m rocking with BROOOOKLYN!\n@BrooklynNets #NBAJerseyDay https://t.co/lwGYy2zeU2",
    "471": "@jaynftbeliever Brooklyn Nets New York Knicks Portland Blazers.",
    "472": "@KickCorridor @Raptors @BrooklynNets @YouTube Ahhh, damn!",
    "473": "Putting aside back-and-forth on whether Nets and Mavs talked about Porzingis, Nets and Porzingis had mutual interest. Nets were on his wish list and one reason Knicks dealt him to Dallas was to avoid him signing with Brooklyn.",
    "474": "The Mavs have contacted the Nets about Kyrie. Could u imagine kyrie &amp; Luka as the starting back court? My god. If Brooklyn actually is interested we might see Porzingis back in NY. But KD is literally Porzingis but wayy better. So I feel like the move would be pointless for nets",
    "475": "SLAM - Brooklyn Nets Are Facing A Outbreak After Five Players Enter Protocols https://t.co/iumnTQeQPi #NBA #BallisLife",
    "476": "@BrooklynNets If you guys would get rid of that stupid vax mandate you'd have a more viable roster.",
    "477": "The #NBA is LIVE on #SiriusXM 167 at 7:30pmET! Don't miss #WeTheNorth as they face @BrooklynNets!\n\nGet the #SiriusXM app and listen FREE across Canada! Start here: https://t.co/c3z8b8Dh9D. https://t.co/ohLPBEXCOa",
    "478": "@WinningBetsPod @Raptors @BrooklynNets @YouTube We're sleeping when the soccer's on mostly 😂",
    "479": "@KickCorridor @Raptors @BrooklynNets @YouTube Soccer was a sweep! Woooo lets complete the full sweep tonight!",
    "480": "@D_Rock_in_BKLYN @Keith_McPherson @TMKSESPN @RealMichaelKay @DonLagreca @BobGlauber @ESPNNY98_7FM @BrooklynNets @WFAN660 @CPTheFanchise @Bigboshogin Definitely both.",
    "481": "#NBA @Raptors vs @BrooklynNets  and soccer bets from @WinningBetsPod  \nhttps://t.co/MK03lYWOBX via @YouTube",
    "482": "@Keith_McPherson @BrooklynKidd5 @TMKSESPN @RealMichaelKay @DonLagreca @BobGlauber @ESPNNY98_7FM @BrooklynNets @WFAN660 @CPTheFanchise @Bigboshogin I can't knock the older guys on both sides of the microphone - I'm only 38 years old. They have a huge following.\n\nI liken this to politics: a station that leans heavily one way will use the opposite side to make points. The best back-and-forth are between those who disagree",
    "483": "1. Brooklyn Nets\n2. Kentucky basketball\n3. Baltimore Ravens\n4. Kentucky Football\n5. Cincinnati Reds https://t.co/XoLrHkguHg",
    "484": "@D_Rock_in_BKLYN @BrooklynKidd5 @TMKSESPN @RealMichaelKay @DonLagreca @BobGlauber @ESPNNY98_7FM @BrooklynNets @WFAN660 @CPTheFanchise @Bigboshogin Both - if ya ask me",
    "485": "@BrooklynKidd5 @Keith_McPherson @TMKSESPN @RealMichaelKay @DonLagreca @BobGlauber @ESPNNY98_7FM @BrooklynNets @WFAN660 @CPTheFanchise @Bigboshogin Do you mean more younger people behind the microphone or more younger people calling into the shows?",
    "486": "Tuesday Free Play:\n#WeTheNorth +5 vs #BrooklynNets \nRaptors have revenge here from losing by double-digits to the Nets last time and note that the Nets rested Harden last game against the Pistons so he will likely play today. Regardless we still like Toronto here #GetThatPaper",
    "487": "Consensus Line Move:\n2021-12-14 Toronto Raptors at Brooklyn Nets from 215.50 to 216.50\nOver with respect\n#NBA #espn #dataanalyst #daytrading",
    "488": "@PhillBrowne @KDTrey5 @BrooklynNets The sooner everyone gets it the better, it’s not going away. Breathe it in abd suck it up brownep",
    "489": "Report: Dallas Mavericks were among the teams to reach out to the Nets about a Kyrie Irving Trade;\n\n“And in those trade talks, sources say Kristaps Porzingis was brought up. \nIt's unknown if talks between Brooklyn and Dallas advanced past a preliminary stage.”\n\n(via @IanBegley) https://t.co/0GpWXwhZ8y",
    "490": "NBA  🏀 \n\nBrooklyn Nets\nGame UN 216 (1.90) \n\n2021: 167-147-11\n#SportsPicks #bettingtips #sportsbettingadvisor #GamblingTwitter",
    "491": "@thenameyme @KnicksFanTv I can go out on a limb and say you won’t be hearing Steph Curry MVP chants at the Garden tonight!  #BrooklynNets suck!",
    "492": "@BrooklynNets reaction @EvanRobertsWFAN https://t.co/7M9oZFIYmh https://t.co/jq98rdJxho",
    "493": "December 14th: Full card is posted\nhttps://t.co/F1tJRXzLzO\n\nFREE PLAY OF THE DAY:\nNBA: Brooklyn Nets -5 (7:40PM) EST",
    "494": "Fully Vaccinated Brooklyn Nets are riddled with Covid... https://t.co/dgzWrYwWyO via @CitizenFreePres",
    "495": "#Raptors @ #Nets Free NBA Betting Prediction, and Odds for Tonight. https://t.co/598IOqlKlW #Toronto is in #Brooklyn for an #AtlanticDivision contest. #KevinDurant #BarclaysCenter #FredVanVleet",
    "496": "🚨🚨Who Covers Tonight?? #NBA #NBATwitter #GamblingTwitter @BrooklynNets @Raptors #NetsWorld #WeTheNorth",
    "497": "@D_Rock_in_BKLYN @BrooklynKidd5 @TMKSESPN @RealMichaelKay @DonLagreca @BobGlauber @ESPNNY98_7FM @BrooklynNets @WFAN660 @CPTheFanchise @Bigboshogin Say dat. Thats facts. Being on before and after the Nets call has been a huge blessing for me. I take whatever calls my producer sends in but before and after the Nets play we've started to get heavy Nets callers and its ushered in a new era for us on New York radio. Only week 4!",
    "498": "@Keith_McPherson @BrooklynKidd5 @TMKSESPN @RealMichaelKay @DonLagreca @BobGlauber @ESPNNY98_7FM @BrooklynNets @WFAN660 @CPTheFanchise @Bigboshogin Here's my thing Keith: if I have a platform to talk NY basketball and 9/10 callers comment on the knix, I must conclude that most of my listeners are apart of the same makeup.\n\nTherefore, we must force our way into the equation or else we get divided from the product",
    "499": "@BrooklynKidd5 @D_Rock_in_BKLYN @TMKSESPN @RealMichaelKay @DonLagreca @BobGlauber @ESPNNY98_7FM @BrooklynNets @WFAN660 @CPTheFanchise @Bigboshogin Its all Knicks and when its Nets its w/ a Knicks perspective. I'll be sure to balance it out while im on. Heavy talk about a team who's lost 6 out of 7 and their world famous arena is being used for the Warriors and Steph to celebrate an all time record being broken tonight 😏👍🏿",
    "500": "Mavericks, Nets reportedly discussed potential trade for Kyrie Irving #BrooklynNets #DallasMavericks #KyrieIrving https://t.co/p7vYVKedLf",
    "501": "Brooklyn Nets now hold the record for fastest phone call decline in history https://t.co/HgACcA7AAj",
    "502": "Brooklyn Nets Are Facing A Outbreak After Five Players Enter Protocols https://t.co/2JhhjhSYA1",
    "503": "@Raptors / @BrooklynNets and @MapleLeafs / @EdmontonOilers vs grading.",
    "504": "Lakers want to trade Westbrook? He should go to Brooklyn Nets",
    "505": "Emory &amp; Henry Wasps men's basketball  defeated D'Youville College 83-60 at the Barclays Center, home of the NBA's Brooklyn Nets, on Tuesday afternoon. Gabe Brown (Ridgeview) led the Wasps with 19 points. @BHCSports https://t.co/dmZCtXP8DZ",
    "506": "Porzingis in brooklyn? As if I couldn’t hate the nets even more lol https://t.co/4giFrfJPZ9",
    "507": "Another NBA Team Hit: Five Players Now in Health and Safety Protocols (Sports Illustrated)\n\nNEW YORK (AP) - The Brooklyn Nets will be without five players, including starters LaMarcus ...\n\nAdd your highlights:\nhttps://t.co/mgiQqTjXDJ\n #Brooklyn_Nets",
    "508": "I think the Brooklyn Nets are doing pretty damn well good without Kyrie Irving if you ask me they don't need him in the first place cause they're good 🗣🗣",
    "509": "@D_Rock_in_BKLYN @TMKSESPN @RealMichaelKay @DonLagreca @BobGlauber @ESPNNY98_7FM @BrooklynNets @WFAN660 @Keith_McPherson @CPTheFanchise @Bigboshogin If the host of those shows actually care about the Nets I guarantee more fans would call the shows but everyone but 2 people on both stations are Nets fans",
    "510": "Dallas Mavericks contact Brooklyn Nets in regards over Kyrie Irving trade..... Kristap Prozingis came up in discussion\n\n#NBA https://t.co/J8FDlv13tR",
    "511": "@PhillBrowne @KDTrey5 @BrooklynNets Make sure you buy a Tesla",
    "512": "@VigilantFox Such as the Brooklyn Nets, fully vaccinated team, all have covid. Oh course, Kyrie not vaccinated is still unaffected.  🤣",
    "513": "@BrooklynKidd5 @TMKSESPN @RealMichaelKay @DonLagreca @BobGlauber @ESPNNY98_7FM @BrooklynNets @WFAN660 @Keith_McPherson @CPTheFanchise The only reason why I give WFAN a listen (when I'm awake after Nets' games) is because my brother @Bigboshogin, a big knix fan, told me about @Keith_McPherson. They're all over the place with their shows and it's unbearable.\n\nIf more Nets' fans call ESPN, they'll talk more Nets",
    "514": "@AlphaDogBets Brooklyn nets, easy",
    "515": "@BrooklynNets How’s MJ and KD among the greatest scorers of all time when Lebron James has mor points than either one of them, Kevin Durant will never catch Lebron James in points.",
    "516": "Check out 2020-21 CONTENDERS OPTIC RED PRIZM #73 KYRIE IRVING BROOKLYN NETS  https://t.co/ikGuk9eZLt via @eBay",
    "517": "According to @ShamsCharania, several teams have called the #Nets about star PG Kyrie Irving since October 12 but Brooklyn has not engaged.",
    "518": "Kristaps Porzingis included Brooklyn among his four preferred trade destinations, along with Toronto, the Clippers, and Miami when he wanted to get away from the Knicks.\n\nThe Nets once valued Porzingis highly. https://t.co/asdkD6AHAi",
    "519": "Only one game tickles my twine tonight. Read my breakdown on the @BrooklynNets @Raptors match up on @btvbets \n\n#WeTheNorth #NetsWorld #GamblingTwitter\n\nhttps://t.co/uQQCuajN0G",
    "520": "I seem to remember a former Net that's staying ready, in case he's needed...\n\n@JCrossover's per 36 as a Brooklyn Net:\n\n30 PPG\n18 AST https://t.co/r6LvKp8lUd",
    "521": "⚠️Blog Post⚠️\n\n@TheBTVGreek calls tonight \"one of the worst betting slates of the season\" but managed to find a pick he likes in the @Raptors and @BrooklynNets game. \n\nTo bet the game go to \nhttps://t.co/Wl8DlzWP0u\n\n#WeTheNorth #NetsWorld #NBA75 \n\nhttps://t.co/nQbVhc9HjT",
    "522": "@BrooklynNets What's the latest COVID update? Is KD playing?",
    "523": "Incredible showing from @KDTrey5 leading the @BrooklynNets to a 116-104 victory over the @DetroitPistons last evening. Dropping 51 points, 7 rebounds, 9 assists, and even 2 blocks. Where do you rank KD in your all time list @TimMowrer? #spm230 #NBA",
    "524": "PREVIEW\n\nToronto Raptors @ Brooklyn Nets\n\nhttps://t.co/63mGEQ1TAg",
    "525": "@BrooklynKidd5 @TMKSESPN @RealMichaelKay @DonLagreca @BobGlauber @ESPNNY98_7FM @BrooklynNets Those who made a better choice to live in #NetsWorld have to call up the show and make them talk Nets.\n\nWe can fuel the fire they start by calling and engaging. We allow knix fans to throw water on it by giving them the chance to call in and talk crap about their crappy team",
    "526": "@BrooklynNets I will gladly play if need be. #NetsWorld https://t.co/6Vq4oN2581",
    "527": "Fully Vaccinated Brooklyn Nets are riddled with Covid… – CITIZEN FREE PRESS https://t.co/nUvFkinB25",
    "528": "In 2012, I remember coming home from school and being so excited to see the Brooklyn Nets vs. Pistons. My parents sitting my brother and I down to talk about what happened in Newtown, CT. I was at shock that people would do such horrid things. Such a sad day I’ll never forget :(",
    "529": "Brooklyn Nets’ COVID-19 protocols list grows to five as four more players get ruled out https://t.co/3n2vvxqIU1 #sports",
    "530": "@BrooklynNets Them KD sneakers are nice🔥🔥👌",
    "531": "@nnadikempes brooklyn nets.",
    "532": "Sistema #NBA75  🏀\n\nToronto Raptors vs Brooklyn Nets\n6:40 P.M. \n\nNETS -5\n\nMomio: -110\n\n#NetsWorld              @BrooklynNets \n\n#BKNvsTOR \n\n#FreePick https://t.co/QTUn3c9t92",
    "533": "@PhillBrowne @KDTrey5 @BrooklynNets Where’s your mask! Carcinogenic’s will get ya if Covid doesn’t",
    "534": "@TBowdery27 @AddictedOnSport Jay-Z supports the Brooklyn Nets as well.",
    "535": "12/14 \n\nSingle:\n\nSuns ML -121 \n$15 wins $12.45 = $27.45 \n\nParlay: (-103)\n\nBrooklyn Nets ML -215\nWarriors @ Nicks Under 222.5 -278 \n$15 wins $14.99 = $29.99\n\nParlay: (+419)\n\nPenguins -1.5  -114\nTB Lightning ML -200\nFLA Panthers -1.5 -120 \n\n$10 wins $42.01 = $52.04\n\n#NBA75 #NHL",
    "536": "@BrooklynNets they need to sign @Goran_Dragic now!!!",
    "537": "Toronto Raptors visits Brooklyn Nets Predictions and Preview for 12/14/2021 today.  Who are we taking in this game?  Find out now. #Sportsbook #SportsBetting https://t.co/0KVTZAy1PV",
    "538": "@SOTO_ud @nikebasketball @Jumpman23 @NBAextra @NBA @ATLHawks @BrooklynNets @celtics @MELOD1P @KDTrey5 @RexChapman , what’s your favorite ? 🙏🏻🤩",
    "539": "@The7Line The next champions is the Brooklyn Nets",
    "540": "@BrooklynNets Go Brooklyn ❤",
    "541": "The #NBA is LIVE on #SiriusXM 167 at 7:30pmET! Don't miss #WeTheNorth as they visit the @BrooklynNets!\n\nListen FREE across Canada with the #SiriusXM app! Start here: https://t.co/c3z8b8DOZb. https://t.co/A5sewZ6h11",
    "542": "Fully Vaccinated Brooklyn Nets are riddled with Covid… https://t.co/1BLOJdh8Hj",
    "543": "The @BrooklynNets now have FIVE players out because of COVID-19 protocols for Tuesday night's game against the @Raptors. With superstar @KDTrey5 questionable w/ ankle soreness, this morning's opening line of Nets -8.5 will narrow hugely before game time.\n\n#NBA #basketball #Nets https://t.co/sRpAltijAU",
    "544": "Brooklyn Nets Predictions and Preview for 12/14/2021 hosts Toronto Raptors.  Find out who we are taking in this matchup. #Sportsbook #SportsBetting https://t.co/0KVTZAy1PV",
    "545": "@TMKSESPN @RealMichaelKay @DonLagreca @BobGlauber @ESPNNY98_7FM Are you guys allergic to talk #nets @BrooklynNets",
    "546": "Back BROOKLYN NETS to BEAT Toronto Raptors tonight in the @NBA (Game Starts at 00.40 GMT) #NBA #Basketball",
    "547": "teams to win a championship for the the mets\nBrooklyn Nets\nBuffalo Bills\nNY Yankees\nNY Liberty\nNYCFC\nNY Red Bull\nNY Knicks\nNY Islanders\nNY Rangers\n\nThey may beat the jets and giants https://t.co/20ndJqmEyI",
    "548": "@BrooklynNets Artist 🎨 kindly inbox for all kinda artworks such as loGos and mixtape covers",
    "549": "Is Kyrie Irving Returning to the Brooklyn Nets Soon? #NetsWorld \n\nVideo ⬇️\nhttps://t.co/D2y1M3sZG4 https://t.co/Et0bEVShXw",
    "550": "@BrooklynNets Blake comebackgame",
    "551": "@BrooklynNets Once again KI is right.Experimental gene therapy doesn't work, they can get virus and spread with not having any immunity. Adverse effects nobody count and there are so many.",
    "552": "@BrooklynNets ask the NBA to postpone our games",
    "553": "@BrooklynNets Announce Irving coming back",
    "554": "Sixers vs. Nets on Thursday in Brooklyn. 👀 https://t.co/gK3xa3tmwP",
    "555": "@BrooklynNets Kyrie coming back for xmas?",
    "556": "@BrooklynNets win streak time",
    "557": "@BrooklynNets 5 players in covid protocol, what a great time to have a loaded schedule.",
    "558": "5 games\n8 nights\n\nWhat to watch as our holiday homestand kicks off tonight 📝",
    "559": "Raptors Bet Sacramento 124-101 last night . Taking on Brooklyn nets tonight, time to clutch up . \n#WeTheNorth",
    "560": "🏀 Toronto (106.2) @ Brooklyn (105.2)\n\nThe Nets are dealing with an outbreak of players in Health and Safety protocols and Kevin Durant is now questionable with an ankle injury. This screams ugly Raptors win.\n\nValue: Under 215, Nets Team Total u110, Raptors +5",
    "561": "If I'm the Brooklyn Nets, I'd feel a certain type of way about Kyrie. If I was them, after this season, if it's possible, I'd leave the Nets.\n\nAnd leave his ass right there.",
    "562": "@brooklynfizz Brooklyn nets",
    "563": "@herbjonesmydawg @BigKnickVibez @TheAthletic @ShamsCharania @TheAthleticNBA @BrooklynNets @KDTrey5 @KyrieIrving Nah it’s just funny that Knicks fans find this as something to laugh at as if they don’t already have something to laugh at on MSG every time the Knicks play",
    "564": "@BrooklynNets Better to postponed that Game…😌",
    "565": "@BrooklynNets Postponed the Game 😢",
    "566": "Putting together my Christmas/B-day wish list and could use everyone's @BrooklynNets and @Mets apparel recs.\n\nExtra points for kids merch. Thanks!",
    "567": "#KevinDurant's Injury Status Uncertain As Brooklyn Nets COVID Crisis Worsens https://t.co/8H7kutIlVh",
    "568": "@UKNetsFans @BrooklynNets They used to follow me but recently unfollowed 🥺😢",
    "569": "Kyrie Irving drops possible Nets return hint on Instagram (New York Post)\n\nIs Kyrie Irving hinting at a return to the court?On Tuesday, the Nets guard shared a video t...\n\nAdd your highlights:\nhttps://t.co/TbBAZckBGd\n #Brooklyn_Nets",
    "570": "@CMilholenSB Agree, especially as the Bulls and Bucks just lost, leaving them both two games back of Brooklyn.\n\nAfter last year, I think Nets *really* want the first seed to avoid the 2/3 matchup. But, to manage loads, they’d prefer to win it by as few games as humanly possible.",
    "571": "#NBA\n\n🔒 Toronto are 16-4 SU in their last 20 games against Brooklyn.\n🔒 Brooklyn are 2-11 SU in their last 13 games when playing at home against Toronto.\n\n#Raptors +175\n#Nets -5\nO/U 215\n\nSign up now for a premium #perhead service and get 2 weeks free! 👉 https://t.co/jUA8LsIyOe https://t.co/Fh7r0fsbdl",
    "572": "@diamondhawkins_ @steviemctweets I got you! We are seeing Brooklyn Nets v. Toronto Raptors!",
    "573": "@jj_noliimit @Lakers @BrooklynNets Not een my team lil bro🥱 still can’t let that happen, he not finna ruin kd’s legacy",
    "574": "@warriors @BrooklynNets @trailblazers GO GET THISWIN TODAY GUYS!!!YES YOU GUYS CAN DO THIS!!!YES YOU GUYS CAN WIN AGAINST THISTEAM!!!!!!!YESYOUCAN!YESYOUCAN!!YESYOUCANGUYS!!!!!!!GO OUT THERE ON THE COURT,PLAY HARD,KEEP FOULS TO A MINIMUM&amp;GET THISWIN GUYS!!!!!!!!!GO GET THE WIN!!!",
    "575": "Team: Toronto #Raptors vs Brooklyn #Nets\nStart time: December 14, 2021, 19:30 ET\nNBA Free Stream - https://t.co/XI6FMzxTQ6\nVenue Name: Barclays Center\nVenue Location: Brooklyn, NY 11217, USA\nCompetition: Regular Season\nSport: #NBA https://t.co/UpSFisQXex",
    "576": "Under 215.5 @BrooklynNets  @Raptors. My simulation has 209.45 another strong play you guys should know about. It’ll be a play for me. 👍",
    "577": "Toronto Raptors Vs. Brooklyn Nets 12/14/21 BBA Free Pick, &amp; Prediction. https://t.co/Nn2MYc8FVj via @YouTube",
    "578": "Top 6 teams in the NBA by Net Rating:\n\n1. Golden State - 11.7 (SOS: 20th)\n2. Utah - 11.3 (SOS: 28th)\n3. Phoenix - 5.8 (SOS: 13th)\n4. Cleveland - 4.3 (SOS: 1st)\n5. Milwaukee - 3.5 (SOS: 30th)\n6. Brooklyn - 3.5 (SOS: 27th)",
    "579": "Would it be a mistake for the Brooklyn Nets to trade Joe Harris? #NBATwitter",
    "580": "NBA 12/14 Add \n\nUnder 216.5 (-130)\n(521) Toronto Raptors @ (522) Brooklyn Nets\n\nReverse Line Move , Support the Line U/215 \n\nFour Nets -LaMarcus Aldridge, DeAndre Bembry, Jevon Carter and James Johnson -- entered health and safety protocols and are listed out tonight vs. Toronto.",
    "581": "@BrooklynNets You don’t gotta be a professional basketball player to make millions boy",
    "582": "The #Brooklyn Nets will be without five players, including starters LaMarcus Aldridge and DeAndre’ Bembry, on Tuesday night because of the #NBA’s health and safety protocols. #NewsBreakLocal\n\nhttps://t.co/kxQvIhKWff",
    "583": "Please trade Joe Harris @BrooklynNets",
    "584": "I can see Nets, 76ers and LA doing a trade. Kyrie to LA, Simmons to Brooklyn and Russ with some type of picks back from Brooklyn to send him to Philly.",
    "585": "Five Nets players sidelined for health and safety protocol – The Brooklyn Game https://t.co/B7t6xO2Iji",
    "586": "@DROCARTIER @Lakers The best lack a big presence anyway @BrooklynNets y’all know what to do 🤞🏿",
    "587": "#latestnews GAME #28: TORONTO RAPTORS (13-14) @ Brooklyn Nets (19-8) - 7:30pm (EST) on SN/SN1 - https://t.co/3JfjjKB5M5 (POST_EXCERPT}",
    "588": "@EdiBeOnIt Not really…. If Philly play nets in playoffs if Kyrie don’t take the vaccine he can’t play in Brooklyn….",
    "589": "@JfromBk @BrooklynNets @MZegarowski1 Yes I can get fully behind this agenda..love this guy and his potential shooting",
    "590": "Why are the Nets optimistic Kyrie Irving will play this season desp... (Sportingnews)\n\nIt's still the biggest question hanging over the Nets: Will Kyrie Irving play this season?\n\nAdd your highlights:\nhttps://t.co/zpgDkZC9aI\n #Brooklyn_Nets",
    "591": "Kyrie Irving might be teasing a return to the Brooklyn Nets ... posting a video putting on his sneakers amid reports he could rejoin the team this season. https://t.co/kWTNcgHfHm",
    "592": "NBA Basketball Game Betting Picks Simulator: 7:40 PM ET - Toronto Raptors vs. Brooklyn Nets - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/VC2c5zMfTC #nba #sportsbetting #freepicks #cappertek",
    "593": "Five Nets players sidelined for health and safety protocol – The Brooklyn Game https://t.co/XFtkjyVG2O",
    "594": "Analyzing Tuesday’s Toronto Raptors at Brooklyn Nets odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/eTN48STeC7",
    "595": "Toronto Raptors at Brooklyn Nets odds, picks and prediction https://t.co/zVkeYKltmd",
    "596": "@betonthegame Picking up any Brooklyn Nets?",
    "597": "@DevaronPerry He’ll make it because then the national media can refer to him as former Brooklyn Nets player the entire game.",
    "598": "@Mountainside @bigvision_nyc ON MY WISHLIST IS TICKETS TO A @nyknicks OR @BrooklynNets GAME THIS SEASON",
    "599": "@KenKrizner @DevaronPerry Allen will probably be the @cavs rep because then they could talk about the @BrooklynNets when they talk about him.",
    "600": "@KenKrizner @DevaronPerry Sadly they will get one rep and Mobley will play in the rookie game, but be overshadowed by whoever the @nyknicks and @BrooklynNets rookies are because that’s who the media will focus on.",
    "601": "NBA Betting Picks: Toronto Raptors vs Brooklyn Nets preview, picks and prediction https://t.co/uiJPFy0yAg",
    "602": "@JfromBk @BrooklynNets @MZegarowski1 I'm not 100% sure, but I think if the Nets sign Zegarowski with the hardship exception and then subsequently waive him when they have to get back down to 15 players, they lose his draft rights.",
    "603": "@BrooklynNets OH GREAT HEAVENS",
    "604": "The Brooklyn Nets will be without five players, including starters LaMarcus Aldridge and DeAndre’ Bembry, vs Raptors because of the NBA’s health and safety protocols. https://t.co/f8tiVfEN2Z",
    "605": "We make our favorite player prop bets as the short-handed Brooklyn Nets host the Toronto Raptors Tuesday night courtesy of @bballgodsblog \n\nhttps://t.co/HphUs8dbJW",
    "606": "RAPTORS GAME PREVIEW\n\n🏀: @Raptors vs. @BrooklynNets \n📺: Sportsnet One\n🕢: 7:30 PM/ET\n\nhttps://t.co/0hif6KXHL3",
    "607": "PARLEY 14/12/2021 NBA\nToronto Raptors: +7.5 -102\nGolden State Warriors: -5.5 -103\nPhoenix Suns: -1.5 -105\nToronto Raptors / Brooklyn Net: B 216.5 -106\nGolden State Warriors / New York Knicks: B 211.5 -111\nPhoenix Suns / Portland Trail Blazers: B 219.5 -112",
    "608": "@BrooklynNets Hey Hey that's ok get it done any way",
    "609": "By the looks of it. It's Toronto Raptors @ Brooklyn Nets Reserves today. That +5.5 ATS looks grand.",
    "610": "Picture speaks for itself @BrooklynNets https://t.co/Q13hLaf5HR",
    "611": "@evan_williams_ @ScoopB @NetsDaily @BrooklynNets @joetsai1999 NJ died in 2012. Couldn’t even sell out back to back finals in 02-03. Worse TV ratings and worse attendance for years. They moved for the better. If they win the chip, the parade will be in downtown BK not NJ. Good day sir.",
    "612": "Literally, #NBA and #NFL  players from coast to coast are testing positive for #COVID19. Teams in the two biggest cities, the Los Angeles Lakers, New York Knicks and Brooklyn Nets all have players who are in health and safety protocols #LakeShow  #NewYorkForever #NBA75 https://t.co/Kb8YN2bGpo",
    "613": "Four more Nets enter COVID protocols with skeleton crew left for Ra... (New York Post)\n\nThe Nets have a COVID-19 problem on their hands.\n\nAdd your highlights:\nhttps://t.co/xSLLLcDrcG\n #Brooklyn_Nets",
    "614": "Opening Line: Toronto Raptors (216) vs. Brooklyn Nets(-8.5) - Linemoves Since: (3) #Raptors #Nets  Full odds at https://t.co/nUn5OcMhOI",
    "615": "Is Kyrie Irving finally about to make his return to the Brooklyn Nets?\nhttps://t.co/SEJA8GRf3A",
    "616": "@JR_Brooklyn718 @ScoopB @NetsDaily @BrooklynNets @joetsai1999 They will always be New Jersey’s team. Brooklyn is boring",
    "617": "If the @Lakers and @BrooklynNets trade @russwest44 and @KyrieIrving, the internet will implode. \n\nKyrie back with @KingJames? \nThe 2012 @okcthunder trio? \n\nI’m not saying I *want* it to happen, but I am saying I would spend an entire week on Twitter wading through the takes 😂",
    "618": "@DavidBr37616769 @AndrewSonephady @_JasonLT He IS A POINT GUARD =32 Triple-doubles. \nBrooklyn Nets Big-3 was not the Eastern Conference #1 Seed, that honor went to Ben Simmons's Philadelphia 76ers. They didn't have Lebron James. Simmons's defense against point guards = Top 3 NBA.",
    "619": "Now follows Brooklyn Nets in the NBA",
    "620": "@evan_williams_ @ScoopB @NetsDaily @BrooklynNets @joetsai1999 Deal with it. They’re in Brooklyn now &amp; never going back, enjoy tonight’s game chief lol.",
    "621": "@JR_Brooklyn718 @ScoopB @NetsDaily @BrooklynNets @joetsai1999 As a Nets fan in Jersey where the Nets should’ve never left, I don’t wanna see the Brooklyn crap",
    "622": "Let’s play fantasy world and assume this deal goes through, which reunion would you want to see more? #LakersNation #LakeShow #Lakers #NetsWorld #Brooklyn #Nets #NBA75 #NBATwitter #NBA \n\nWestbrook for Kyrie",
    "623": "Casey said the league is going to look at cameras to determine which Brooklyn Nets players in protocols were in close contact with Detroit.",
    "624": "@BrooklynNets Damn，have a good day.",
    "625": "@evan_williams_ @ScoopB @NetsDaily @BrooklynNets @joetsai1999 As a Nets fan born &amp; raised in ENY BK, i don’t wanna see those jerseys.",
    "626": "@BrooklynNets God hates the Nets too.",
    "627": "@JicJacJohnson Brooklyn Nets",
    "628": "@CageyFlow @chriswheeler02 @casualtakeking The thing is, there were no 'PG Packages\" out there, it was either Brooklyn or Philly. Philly's package revolved around a guy who gets crucified on this app daily for being a bum that hasn't developed, and the Nets was Harden's preferred destination.",
    "629": "@JR_Brooklyn718 @ScoopB @NetsDaily @BrooklynNets @joetsai1999 No one cares",
    "630": "@Shady7769 In the Atlantic Division, how will they get past the Brooklyn Nets if losing defense, and not acquiring defense in his stead? This is simple y’all.",
    "631": "@NBA @DamayaBlack2014 @DamayaBlack #11, I understand.. \nWaiting for your resurrection and rise. \nBrooklyn Nets. 2021 NBA CHAMPIONS",
    "632": "@BrooklynNets Do you know who doesnt have Covid? Kyrie Irving lol",
    "633": "WE REALLY ARE THE BROOKLYN NETS OF SOCCER! https://t.co/cEl1xOzomL",
    "634": "#GamblingTwitter #freepicks \nToronto Raptors @ Brooklyn Nets\nRaptors are 5-1 ATS in the last 6 meetings in Brooklyn.\nOver is 6-1 in Raptors last 7 road games.\nUnder is 5-1 in Nets last 6 overall.",
    "635": "@Sportsnet @NBA @KDTrey5 @BrooklynNets RAPSSSS",
    "636": "@BrooklynNets KD doesn't want to be MVP",
    "637": "The Only 3 Ways Kyrie Irving Can Play For The Brooklyn Nets This Season – NBA News https://t.co/ICBZqrBUNT",
    "638": "Five Nets enter COVID protocols (https://t.co/5AvbMDzwqY)\n\nAt least four Nets have joined Paul Millsap in the COVID protocols, the team says: Jevon Car...\n\nAdd your highlights:\nhttps://t.co/7aBZXKNmZj\n #Brooklyn_Nets",
    "639": "@BrooklynNets Sitting here patiently wait for this #Kyrie https://t.co/mLKNoyRPUO",
    "640": "🏀 Is the West harder than the East? With these stats, the @Lakers seemed to be doing better than the @BrooklynNets but their record doesn't show it🧐\n\n#NBA #Basketball #Lakers #Nets https://t.co/5cLe52COjd",
    "641": "@CMS6109 @BrooklynNets Damnit",
    "642": "@CMS6109 @BrooklynNets Next away game 🙌🏻",
    "643": "Brooklyn Nets Lose 5 Players to Covid Protocols\nRead More; https://t.co/LP41BrDsHJ",
    "644": "@itsvxrt @BrooklynNets He's back 🔜",
    "645": "@BrooklynNets The COVID trip",
    "646": "@BrooklynNets where is kyrie",
    "647": "@BrooklynNets bring kyrie back",
    "648": "🛫 Sights and sounds from the 3-1 road trip 🛬 https://t.co/Mrhv2ShYVQ",
    "649": "Scottie Barnes and the @Raptors are back on the road as they visit the @BrooklynNets. \n\n@Paul__Jones will have the pre-game show at 7 PM, tip-off at 7:30 PM. @william_lou has you covered with #Raptors Reaction right after the game! \n\n#WeTheNorth https://t.co/UiXX2rAEW0",
    "650": "I’m ready to suit up @BrooklynNets lol https://t.co/LWTdZriolJ",
    "651": "@PlayboiClaxton Me watching this masterpiece of highlights @BrooklynNets https://t.co/nHe9SJArg1",
    "652": "One of the @NBA's best. 🌟\n\n@KDTrey5 and the @BrooklynNets take on the Raptors tonight. Who ya got? 🤔 https://t.co/kfRBB14PVd",
    "653": "@PlayboiClaxton hope Brooklyn nets make it to the playoffs",
    "654": "@CMS6109 @BrooklynNets The whole team is out now lol",
    "655": "@JamesHa68787544 @BrooklynNets Harden better drop 50",
    "656": "Get your tickets now for Brooklyn Nets vs. Toronto Raptors at Barclays Center in Brooklyn tonight at 7:30PM.\n\n@BrooklynNets #Nets #NewYorkCity\nhttps://t.co/4PVTfHwKdC",
    "657": "@BrooklynNets Announce kyrie please",
    "658": "@BleacherReport @brkicks @BrooklynNets please get rid of Kyrie",
    "659": "@BrooklynNets Well we lost",
    "660": "Will the @BrooklynNets apologize to kyrie now and let him play?",
    "661": "#WeTheNorth NATION @TheTellieTube @Raptors Game Day vs @BrooklynNets and @KDTrey5 @KyrieIrving and Harden https://t.co/92WNwgGgcw",
    "662": "@Schultz_Report @BrooklynNets joe harris buddy hield swap🤝",
    "663": "\"Brooklyn Nets: #1 defense in Dec!!!\"\n\nhttps://t.co/jVBzwTSyn0\n\n[via r/gonets Dec 14, 2017 #Nets]",
    "664": "Nike NBA Toddlers (2T-4T) Brooklyn Nets Team Name T-Shirt\nhttps://t.co/DDbqO7wVxR",
    "665": "Brooklyn Nets' Covid protocols list grows  https://t.co/8BMgGHwewI",
    "666": "You stole my thoughts this morning, @getnickwright‼️ @KyrieIrving for @russwest44 .. 🤔 #WhyNot? 🤷🏾‍♂️ \n\n@FTFonFS1 @Lakers @BrooklynNets \n\nLet’s get the bands back together‼️",
    "667": "@BrooklynNets Damn Man.....😑😑😑",
    "668": "NBA 🏀 Temporada: 49-39\n\nMartes 14/12:\n\nToronto Raptors +5 (-110)\nToronto Raptors vs Brooklyn Nets O215 (-110)\nPhoenix Suns vs Portland Trail Blazers O219 (-110)",
    "669": "Five Nets players sidelined for health and safety protocol - The Br... (The Brooklyn Game)\n\nJerome Miron, USA TODAY Sports/ReutersSign up for our PoliticsNY newsletter for the latest c...\n\nAdd your highlights:\nhttps://t.co/86blhwMTqD\n #Brooklyn_Nets",
    "670": "Five Nets players sidelined for health and safety protocol - The Br... (The Brooklyn Game)\n\nJerome Miron, USA TODAY Sports/ReutersSign up for our PoliticsNY newsletter for the latest c...\n\nAdd your highlights:\nhttps://t.co/SYSbw1fa8U\n #brooklyn",
    "671": "Nets' protocols list grows to 5 as four ruled out (https://t.co/qWWHLmf0hc)\n\n11:26 AM ETOhm YoungmisukESPN Staff Writer Close Ohm Youngmisuk has covered the Giants, Jets...\n\nAdd your highlights:\nhttps://t.co/GAEWH0McVr\n #Brooklyn_Nets",
    "672": "Just Know I was on The Brooklyn Nets Kyrie Irving Away Game Train since the beginning of the season ….now everyone starting to join me after quickly shutting me down &amp; saying hell  no 😂😂",
    "673": "Nike NBA Toddlers (2T-4T) Brooklyn Nets Team Name T-Shirt\nhttps://t.co/xtnSgIE4E2",
    "674": "@BrooklynNets get this man lol https://t.co/y4yqSRSXqE",
    "675": "Don’t be fucking stupid unless the return is greater @BrooklynNets https://t.co/tjX5tylq1A",
    "676": "KD and Harden can score but what about the rest of the Nets? \n\nThe Raptors are playing good team basketball and have the necessary depth to cover the spread in Brooklyn. \n\nPreview the Nets vs Raptors with @TheAllStarSport \n\nhttps://t.co/g8FDsNEl5l",
    "677": "Them Brooklyn nets falling apart yo https://t.co/WCgT9ShyA1",
    "678": "@Finn_AFC What happened with the brooklyn nets team so because everyone of them are vaxxed but not waxxed",
    "679": "Nike NBA Toddlers (2T-4T) Brooklyn Nets Team Name T-Shirt\nhttps://t.co/enuLDwmrMJ",
    "680": "Brooklyn Nets Big 3 Poster Basketball Painting Hand Made Posters Canvas Print Kids Wall Art Home Man Cave Gift Decor (36\"x24\" Ready to Hang)\nhttps://t.co/hyQO43PeYF",
    "681": "Nike NBA Toddlers (2T-4T) Brooklyn Nets Team Name T-Shirt\nhttps://t.co/E9M8lBTi3L",
    "682": "Nike NBA Toddlers (2T-4T) Brooklyn Nets Team Name T-Shirt\nhttps://t.co/wVd58jhR5n",
    "683": "Man City - 1st \nMadrid - 1st\nSundowns - 1st \nBrooklyn Nets - 1st \nI can’t complain bout nothing this season no cap, things are looking wavy. 🤝",
    "684": "Consensus Line Move:\n2021-12-14 Toronto Raptors at Brooklyn Nets from 218.50 to 215.00\nUnder proceed with caution\n#NBA #betting #innovation #forextrader",
    "685": "Consensus Line Move:\n2021-12-14 Toronto Raptors at Brooklyn Nets from -7.00 to -5.00\n#WeTheNorth snake in the weeds\n#NBA #betting #programming #luxury",
    "686": "Brooklyn Nets Big 3 Poster Basketball Painting Hand Made Posters Canvas Print Kids Wall Art Home Man Cave Gift Decor (36\"x24\" Ready to Hang)\nhttps://t.co/XW8o4FsIe2",
    "687": "@BrooklynNets At this point, rest Harden and play the rookies",
    "688": "Nike NBA Toddlers (2T-4T) Brooklyn Nets Team Name T-Shirt\nhttps://t.co/VCf9tRrpDV",
    "689": "@BrooklynNets Wtf. james harden backpain, carry his teammates, lol",
    "690": "@BrooklynNets @TISSOT Dress up admin, you might be needed in the game",
    "691": "Brooklyn Nets Big 3 Poster Basketball Painting Hand Made Posters Canvas Print Kids Wall Art Home Man Cave Gift Decor (36\"x24\" Ready to Hang)\nhttps://t.co/9gtFuAFyL3",
    "692": "Brooklyn Nets Big 3 Poster Basketball Painting Hand Made Posters Canvas Print Kids Wall Art Home Man Cave Gift Decor (36\"x24\" Ready to Hang)\nhttps://t.co/F1CZIcVVak",
    "693": "@The7Line It’s actually the Brooklyn Nets but Mets will be after that. https://t.co/YyjoBwxhrd",
    "694": "Nike NBA Toddlers (2T-4T) Brooklyn Nets Team Name T-Shirt\nhttps://t.co/vx62UItKhh",
    "695": "Nike NBA Toddlers (2T-4T) Brooklyn Nets Team Name T-Shirt\nhttps://t.co/JnxCmqIVfW",
    "696": "Brooklyn Nets Big 3 Poster Basketball Painting Hand Made Posters Canvas Print Kids Wall Art Home Man Cave Gift Decor (36\"x24\" Ready to Hang)\nhttps://t.co/pBk6VjJS3s",
    "697": "Brooklyn Nets Big 3 Poster Basketball Painting Hand Made Posters Canvas Print Kids Wall Art Home Man Cave Gift Decor (36\"x24\" Ready to Hang)\nhttps://t.co/vyoTPAZz1T",
    "698": "@SBE_3E3 @BrooklynNets Bruh these are an hour apart lmaoooo. How tf did this happen?",
    "699": "Nike NBA Toddlers (2T-4T) Brooklyn Nets Team Name T-Shirt\nhttps://t.co/OHwC0XFKI6",
    "700": "@BrooklynNets Ain't no way... https://t.co/AGxfyyVhz8",
    "701": "@BrooklynNets We about to see a healthy dose of the young guns tonight. Love it.",
    "702": "Brooklyn Nets Big 3 Poster Basketball Painting Hand Made Posters Canvas Print Kids Wall Art Home Man Cave Gift Decor (36\"x24\" Ready to Hang)\nhttps://t.co/WW31hIkyvG",
    "703": "Brooklyn Nets Big 3 Poster Basketball Painting Hand Made Posters Canvas Print Kids Wall Art Home Man Cave Gift Decor (36\"x24\" Ready to Hang)\nhttps://t.co/9uW80Idfk7",
    "704": "Nike NBA Toddlers (2T-4T) Brooklyn Nets Team Name T-Shirt\nhttps://t.co/xQwrumakdt",
    "705": "Stan....the Brooklyn Nets are the only contenders ok bud https://t.co/ISd8Z2ieZW",
    "706": "Nike NBA Toddlers (2T-4T) Brooklyn Nets Team Name T-Shirt\nhttps://t.co/tIlChLrYqD",
    "707": "Brooklyn Nets Big 3 Poster Basketball Painting Hand Made Posters Canvas Print Kids Wall Art Home Man Cave Gift Decor (36\"x24\" Ready to Hang)\nhttps://t.co/szgDaG4cSx",
    "708": "Brooklyn Nets Big 3 Poster Basketball Painting Hand Made Posters Canvas Print Kids Wall Art Home Man Cave Gift Decor (36\"x24\" Ready to Hang)\nhttps://t.co/0MuNWyjxb7",
    "709": "Nets KYRIE IRVING May Be RETURNING to NBA! Viral Video LACING UP Sneaker... https://t.co/wt8H6X3k3p via @YouTube #kyrie #nba #kyrieirving #NBA75 #Brooklyn #Nets",
    "710": "my prayers for a healthy brooklyn nets team this season must go through man we need a complete roster (fingers crossed we get kyrie soon) so we'll reach the finals 🤞🏼😭",
    "711": "@tuckclarry @BrooklynNets FACTS",
    "712": "@BrooklynNets Rest kd don’t play around with his ankle",
    "713": "BROOKLYN as Home Favorites  8 Win -5 Lost  (PF) 106.92 -  ( PA) 105.54 #Nets  Full odds at https://t.co/nUn5OcMPEg",
    "714": "Nike NBA Toddlers (2T-4T) Brooklyn Nets Team Name T-Shirt\nhttps://t.co/h5Pw5KAXvd",
    "715": "Nike NBA Toddlers (2T-4T) Brooklyn Nets Team Name T-Shirt\nhttps://t.co/vh1nrWOgIr",
    "716": "@_BryceWarner @BrooklynNets I have six fouls to give!",
    "717": "Brooklyn Nets Big 3 Poster Basketball Painting Hand Made Posters Canvas Print Kids Wall Art Home Man Cave Gift Decor (36\"x24\" Ready to Hang)\nhttps://t.co/9JtOFtM3cP",
    "718": "Brooklyn Nets Big 3 Poster Basketball Painting Hand Made Posters Canvas Print Kids Wall Art Home Man Cave Gift Decor (36\"x24\" Ready to Hang)\nhttps://t.co/PxEZIyzY4C",
    "719": "The Brooklyn Nets now have five players out due to health and safety protocols for tonight and they’ve added Kevin Durant to the injury report as questionable due to right ankle soreness against Toronto https://t.co/oRTVo1kMH9",
    "720": "Sign them both to a 10-day contract rn @BrooklynNets",
    "721": "👀 RT @TMZ: Kyrie Irving might be teasing a return to the Brooklyn Nets ... posting a video putting on his sneakers amid reports he could rejoin the team this season. https://t.co/3HzbYIaEes",
    "722": ".@BrooklynNets call me up for a ten day. I’m good for 10 minutes off the bench https://t.co/HiXoMBT9N0",
    "723": "Nike NBA Toddlers (2T-4T) Brooklyn Nets Team Name T-Shirt\nhttps://t.co/k1QTOhO8mY",
    "724": "@BrooklynNets Well https://t.co/N95VGRqkPs",
    "725": "@Mike_Mora1 @BrooklynNets Please ...",
    "726": "Jake Fischer reports that the Brooklyn Nets have been open to trade discussions on both Kyrie Irving and Joe Harris. 👀\nhttps://t.co/IjyeJTOw1j",
    "727": "@BrooklynNets Hoping they’re all good but even more so for Aldridge.",
    "728": "@BrooklynNets Raptors by 3",
    "729": "@BrooklynNets Cancel season",
    "730": "Harden get 54 buckets. \n\nPlease @JHarden13 🙏🙏🙏🙏\n\n@BrooklynNets #NetsWorld https://t.co/BAJTicfiWe",
    "731": "The Brooklyn Nets will be without five players, including starters LaMarcus Aldridge and DeAndre’ Bembry, on Tuesday night because of the NBA’s health and safety protocols  https://t.co/1gVa6VNIHk",
    "732": "@BrooklynNets Jeez, two columns.",
    "733": "@BrooklynNets stop",
    "734": "@BrooklynNets LMFAOOOOO…. https://t.co/PfLs9haPuX",
    "735": "@BrooklynNets Hope all in health and safety are well, especially LMA",
    "736": "@BrooklynNets Good tactic now do it for 2 more to get the game cancelled",
    "737": "In other words 4 fully vaxxinated Brooklyn Nets players tested positive for the world’s most deadliest virus of all time. https://t.co/DOcdRnhL7m",
    "738": "@BrooklynNets no mames",
    "739": "@BrooklynNets Cancel the game",
    "740": "@BrooklynNets Welp",
    "741": "Update to tonight's status report: https://t.co/1tj853Ell3",
    "742": "@mattcohen @BrooklynNets You've literally never beat me tho sooooo..",
    "743": "Kyrie Irving Posts Teaser Video Hours After Reports Hint at His Pos... (Mediaite)\n\nKyrie Irving has yet to lace up his sneakers for the Brooklyn Nets this season after refusin...\n\nAdd your highlights:\nhttps://t.co/b4JBt1wV8g\n #Brooklyn_Nets",
    "744": "Nets' Kyrie Irving posts cryptic video lacing up sneakers as return... (amNewYork)\n\nWendell Cruz-USA TODAY SportsSign up for our PoliticsNY newsletter for the latest coverage a...\n\nAdd your highlights:\nhttps://t.co/IiyQzF1RhN\n #Brooklyn_Nets",
    "745": "LaMarcus Aldridge Among 5 Nets out vs. Raptors Due to Health and Sa... (Bleacher Report)\n\nLaMarcus Aldridge, DeAndre Bembry, Jevon Carter and James Johnson entered the NBA's health a...\n\nAdd your highlights:\nhttps://t.co/1U4x4IgaW2\n #Brooklyn_Nets",
    "746": "What did you expect Doug? These are the Brooklyn Nets we’re talking about here, the most talked about basketball organization in New York City! The other team is only relevant cause Steph is going to break the 3 pt record there tonight. https://t.co/5UNlYnI92F",
    "747": "@BrooklynNets Cancel the mandatory vax and bring back @KyrieIrving !!!",
    "748": "@BleacherReport @brkicks He better put those shoes on and walk into a clinic to get vaccinated #Brooklyn #Nets #NBA",
    "749": "LaMarcus Aldridge, 3 more Nets enter COVID-19 protocols #LaMarcusAldridge #NBA\n #BrooklynNets #BrooklynGrit  https://t.co/7HCQnKJQTr",
    "750": "Brooklyn Nets Big 3 Poster Basketball Painting Hand Made Posters Canvas Print Kids Wall Art Home Man Cave Gift Decor (36\"x24\" Ready to Hang)\nhttps://t.co/eqKldMF1Vd",
    "751": "@nasimk1 @BrooklynNets KD isn't playing",
    "752": "@BrooklynNets I am available to play",
    "753": "@BrooklynNets Cancel game plz",
    "754": "Nike NBA Toddlers (2T-4T) Brooklyn Nets Team Name T-Shirt\nhttps://t.co/gsQ6LxxpMB",
    "755": "@BrooklynNets this is bad... but hopefully Dayron gets minutes",
    "756": "@BrooklynNets Let Kyrie Irving play!",
    "757": "BEST BET ATS?💰\n\nToronto #Raptors vs Brooklyn #Nets -7\n\nBet now: https://t.co/DQefqy6fGR https://t.co/iiKUHQtxHH",
    "758": "LET ME GET A RUN @BrooklynNets https://t.co/Afuj4OujvO",
    "759": "Drawing of Kevin Durant ⁦@KDTrey5⁩ 🏀🚀\n\nIn celebration of him dropping 51 pts vs #detroitpistons for the #brooklynnets 👏\n\n#nbadrawing #nbaart #nbaillustration #nba #okcthunder #goldenstatewarriors #kevindurant https://t.co/ECWifTKNbd",
    "760": "Keeping Up With Baby Goat: Brooklyn Nets Performance\nhttps://t.co/2GBN85RUnz @YouTube \n#YoungDevyn #Rap #HipHop",
    "761": "Deja Vu. \n\nKevin @KDTrey5 Durant 11 months ago instructed to out from the court (after 16 minutes playin) because he's covid infected in game vs @Raptors \n\nNow 5 players @BrooklynNets \"entered protocol\".\n\nPlease @KyrieIrving get a vax💔💔\n#NetsWorld https://t.co/XZPcB0TqFJ",
    "762": "LaMarcus Aldridge and other Brooklyn Nets will enter the health protocols ahead of their matchup with the Philadelphia 76ers.  https://t.co/KCuHEuUMd6",
    "763": "@BrooklynNets @warriors please win tonight",
    "764": "@Sukkafish99 @GotTheHeat1 @ItsToySoldier @HolmesCadillac @11Kaire @prestoneli2 @TheAthletic @ShamsCharania @TheAthleticNBA @BrooklynNets @KDTrey5 @KyrieIrving U realize that one was shooting 50% from the field while the other is struggling to get it to 40% which is aweful not to mention that these are Harden current stats it’s either you compare them both for the whole season or for the same period of time but your thing make no sense",
    "765": "@BrooklynNets @TISSOT kyrie back or we riot",
    "766": "Dragic, Achiuwa, Birch, OG, Banton, Johnson all out tonight. 4 new nets players have joined Paul Millsap in H&amp;S Protocols and will be out today (Bembry, Aldridge, Carter, Johnson ). We take on Brooklyn @ 7:30 est.",
    "767": "Brooklyn Nets will not have 7 players in their disposition against the Raptors😱\nhttps://t.co/xmRFyOKL9W",
    "768": "@Mike_Mora1 @BrooklynNets I'm a sharp shooter. I'll knock down my 3s.",
    "769": "@Boness305 @BrooklynNets Plus your team already sucked before anyways it doesn't matter if they play or not",
    "770": "Consensus Line Move:\n2021-12-14 Toronto Raptors at Brooklyn Nets from 217.00 to 218.50\nOver business... man\n#NBA #sport #dataanalysis #realtor",
    "771": "Consensus Line Move:\n2021-12-14 Toronto Raptors at Brooklyn Nets from -8.00 to -7.00\n#WeTheNorth undervalued\n#NBA #vegas #deeplearning #success",
    "772": "Tonight the Brooklyn Nets (19-8) host the Toronto Raptors (13-14) at 7:30 🕢 @YESNetwork #Brooklyn #Nets #NBA #BrooklynTogether",
    "773": "The Brooklyn Nets have added four players to health and safety protocols ahead of Tuesday's game against the Toronto Raptors.\n\nhttps://t.co/jLNEed7gU1",
    "774": "@BrooklynNets Maybe James harhen is ready to play48 mins",
    "775": "@mattcohen @BrooklynNets Uhh.. bad idea.",
    "776": "@BrooklynNets @BrooklynNetcast Day’Ron and Kessler gotta get minutes tonight",
    "777": "@BrooklynNets I thought keeping unvaccinated people like Kyrie away from the team would stop these outbreaks from happening? What gives? 😂",
    "778": "@wojespn @malika_andrews How the Brooklyn Nets practicing today https://t.co/5n0PMglfCJ",
    "779": "Raptors in Brooklyn vs. Nets tonight. https://t.co/mwlz7hZnbS",
    "780": "@BrooklynNets shit",
    "781": "Four more Nets including starters  Aldridge and Bembry join Millsap in health and safety protocols. Raps are in Brooklyn to take on the depleted Nets tonight who are now at five on that list of COVID-affected players.",
    "782": "@BrooklynNets Raptors were pretty strong last night, these players missing? I hope we win this",
    "783": "@Boness305 @BrooklynNets We haven't had Kyrie Irving all season, Joe harris pretty much too. Yet again, good teams can win without injuries and the Nets will prove that yet again today. Bad teams without a good bench struggle.",
    "784": "@BrooklynNets Damn and they’ll be out for atleast a week smh",
    "785": "Nike NBA Toddlers (2T-4T) Brooklyn Nets Team Name T-Shirt\nhttps://t.co/ZuH0BI1Dwh",
    "786": "Nike NBA Toddlers (2T-4T) Brooklyn Nets Team Name T-Shirt\nhttps://t.co/G5HkQrir2h",
    "787": "@BrooklynNets Play harden KD for 40+ this week",
    "788": "Raptors in Brooklyn to face the Nets tonight. https://t.co/u0UdRf6o7U",
    "789": "Brooklyn Nets Big 3 Poster Basketball Painting Hand Made Posters Canvas Print Kids Wall Art Home Man Cave Gift Decor (36\"x24\" Ready to Hang)\nhttps://t.co/D1AF8mbED9",
    "790": "Brooklyn Nets Big 3 Poster Basketball Painting Hand Made Posters Canvas Print Kids Wall Art Home Man Cave Gift Decor (36\"x24\" Ready to Hang)\nhttps://t.co/CXCXc7kWgc",
    "791": "@BrooklynNets Shit this can't be real🤯",
    "792": "@BrooklynNets @Boness305 Don't ever complain about injuries again this is fuckign cruel",
    "793": "Let me get a run Gang @BrooklynNets I’m good for a few open jumpers 🤞🏾💪🏾",
    "794": "Nike NBA Toddlers (2T-4T) Brooklyn Nets Team Name T-Shirt\nhttps://t.co/Pf3D3giE0s",
    "795": "Nike NBA Toddlers (2T-4T) Brooklyn Nets Team Name T-Shirt\nhttps://t.co/xCyYwLzzAC",
    "796": "@PickDawgz Don Lou #291\n\nPick#1 Brooklyn Nets over 218.5\n\nPick#2 UC Santa Barbara -4.5\n\nPick#3 Santa Clara +7.5\n\n22-14 MTD",
    "797": "with 5 @BrooklynNets  #NetsWorld  players entered covid (incl Millsap), a lot fans \"too much histeria\" Kyrie will be in team (&amp; still refused to get a Vax). \n\nWrong. This is absolutely time to strictly again covid protocol @ camp, @SeanMarksNetsGM @joetsai1999 @SteveNashFdn https://t.co/omya90D5jm",
    "798": "@BrooklynNets Without James Johnson this team is washed",
    "799": "Brooklyn Nets Big 3 Poster Basketball Painting Hand Made Posters Canvas Print Kids Wall Art Home Man Cave Gift Decor (36\"x24\" Ready to Hang)\nhttps://t.co/yex9Mt2Uuy",
    "800": "Brooklyn Nets Big 3 Poster Basketball Painting Hand Made Posters Canvas Print Kids Wall Art Home Man Cave Gift Decor (36\"x24\" Ready to Hang)\nhttps://t.co/FcnFqpCCOh",
    "801": "@BrooklynNets Here we go",
    "802": "@BrooklynNets This is why Kyrie Irving shouldn’t return to the Nets unless he’s vaxxed.",
    "803": "@BrooklynNets Ok then",
    "804": "@nasimk1 @BrooklynNets And Cam and Bruce and Clax and Our rookies... And blake",
    "805": "Nike NBA Toddlers (2T-4T) Brooklyn Nets Team Name T-Shirt\nhttps://t.co/WWL5tlDnAN",
    "806": "Nike NBA Toddlers (2T-4T) Brooklyn Nets Team Name T-Shirt\nhttps://t.co/3NITp4an9j",
    "807": "Including both 2 Way players, Brooklyn has 10 available players for tonight’s game vs. Toronto.\n\nThe Nets could get hardship relief in the form of 2 additional players.\n\nThe Nets have one back-to-back game over the next 10 days.",
    "808": "The Nets have 10 active players tonight against the Raptors — KD, Harden, Mills, Thomas, Brown, Claxton, Griffin, Sharpe, Duke and Edwards.\n\nThe league requires a minimum of eight active players to avoid postponement, so Brooklyn is clear as long as no other players get listed.",
    "809": "Update to tonight's status report: https://t.co/mUrO1PcGFl",
    "810": "Brooklyn Nets Big 3 Poster Basketball Painting Hand Made Posters Canvas Print Kids Wall Art Home Man Cave Gift Decor (36\"x24\" Ready to Hang)\nhttps://t.co/JWr4N7FD2I",
    "811": "Brooklyn Nets Big 3 Poster Basketball Painting Hand Made Posters Canvas Print Kids Wall Art Home Man Cave Gift Decor (36\"x24\" Ready to Hang)\nhttps://t.co/wUoGLecMJm",
    "812": "On the heels of an outbreak with the Knicks, now the Brooklyn Nets add LaMarcus Aldridge, DeAndre Bembry, Jevon Carter, and James Johnson to Covid Health and Safety Protocols, joining Paul Millsap. If the spread continues, there will be more postponements and possibly worse! #NBA https://t.co/Kb8YN2bGpo",
    "813": "Nike NBA Toddlers (2T-4T) Brooklyn Nets Team Name T-Shirt\nhttps://t.co/KOhi8g23Em",
    "814": "#RT @ShamsCharania: Four new Nets players in protocols for a total of five, including Paul Millsap. Brooklyn is also down Kyrie Irving and Joe Harris tonight. https://t.co/oCUuhunWpA",
    "815": "Ayy @BrooklynNets you guys sure y’all don’t need Kyrie? 👀🤡 https://t.co/SDgSLJ7ToH",
    "816": "Sixers are home Wednesday to take on Miami then travel to Brooklyn to face the Nets at Barclays Center. https://t.co/2Kj4ypjDsN",
    "817": "Brooklyn #Nets’ LaMarcus Aldridge, Jevon Carter, James Johnson, and DeAndre’ Bembry have entered health and safety protocols. They join Paul Millsap for the team in protocols. #NBA https://t.co/ukI8IDA3st",
    "818": "Brooklyn Nets Big 3 Poster Basketball Painting Hand Made Posters Canvas Print Kids Wall Art Home Man Cave Gift Decor (36\"x24\" Ready to Hang)\nhttps://t.co/SOd8PMFzP8",
    "819": "Brooklyn Nets Big 3 Poster Basketball Painting Hand Made Posters Canvas Print Kids Wall Art Home Man Cave Gift Decor (36\"x24\" Ready to Hang)\nhttps://t.co/H0KuEajjzL",
    "820": "ALERT: New high roller bet posted!\nA bet has been placed for $9952.61 on Brooklyn Nets - Toronto Raptors to win $18,909.95.\nTo view this bet or copy it https://t.co/QZApUAdwbR https://t.co/BDU9KGHJKj",
    "821": "Well work will be interesting tonight! 🤦🏽‍♂️\nHope the guys are ok tho. @BrooklynNets https://t.co/K8d61zPctL",
    "822": "Just 10 players available for Brooklyn tonight against Toronto: Durant, Harden, Mills, Claxton, Griffin, Thomas, Brown, Duke Jr., Edwards, Sharpe.\n\nThe league requires at least 8. As long as no other Nets enter protocols before tonight’s game, the game should go on as planned. https://t.co/45aNuNeYKK",
    "823": "Brooklyn Nets Big 3 Poster Basketball Painting Hand Made Posters Canvas Print Kids Wall Art Home Man Cave Gift Decor (36\"x24\" Ready to Hang)\nhttps://t.co/LhUHNgMzDj",
    "824": "Brooklyn Nets Big 3 Poster Basketball Painting Hand Made Posters Canvas Print Kids Wall Art Home Man Cave Gift Decor (36\"x24\" Ready to Hang)\nhttps://t.co/q0JACyOEhn",
    "825": "@BrooklynNets @TISSOT When does Kyrie  return?",
    "826": "🇺🇸 Nets are adding LaMarcus Aldridge, Javonte Carter, James Johnson and DeAndre Bembry to the health and safety protocol that already include Paul Millsap \n\n🇮🇹 Brooklyn sale a 5 giocatori nel protocollo Covid: a Millsap si aggiungono Aldridge, Carter, Johnson e Bembry \n\n#NBA75",
    "827": "Brooklyn Nets become the latest NBA team dealing with COVID: Paul Millsap, Deandre Bembry, LaMarcus Aldridge, Jevon Carter and James Johnson all in protocol. Seems to be becoming an issue for North American sports leagues right now.",
    "828": "Brooklyn Nets Big 3 Poster Basketball Painting Hand Made Posters Canvas Print Kids Wall Art Home Man Cave Gift Decor (36\"x24\" Ready to Hang)\nhttps://t.co/xZgknaxC3R",
    "829": "Brooklyn Nets Big 3 Poster Basketball Painting Hand Made Posters Canvas Print Kids Wall Art Home Man Cave Gift Decor (36\"x24\" Ready to Hang)\nhttps://t.co/rDjLfNQltW",
    "830": "Four new Nets players in protocols for a total of five, including Paul Millsap. Brooklyn is also down Kyrie Irving and Joe Harris tonight. https://t.co/V7OnHzMSHQ",
    "831": "Per Brooklyn Nets PR, #Nets players Aldridge, Bembry, Carter and Johnson are all out due to health &amp; safety protocols",
    "832": "Brooklyn Nets Big 3 Poster Basketball Painting Hand Made Posters Canvas Print Kids Wall Art Home Man Cave Gift Decor (36\"x24\" Ready to Hang)\nhttps://t.co/iLZLCFNLPR",
    "833": "Brooklyn Nets Big 3 Poster Basketball Painting Hand Made Posters Canvas Print Kids Wall Art Home Man Cave Gift Decor (36\"x24\" Ready to Hang)\nhttps://t.co/v8ys68g9qy",
    "834": "Nets announce LaMarcus Aldridge, James Johnson, DeAndre’ Bembry and Jevon Carter are all out for tonight’s game against Toronto due to health and safety protocols. That puts Brooklyn down four players for 10 days if not more.",
    "835": "Brooklyn Nets - Toronto Raptors\n\nBet slip link: https://t.co/MYSZQM1XAd https://t.co/NwKkm7BABH",
    "836": "“Rival executives believe Nic Claxton could become available, as the Nets quietly gauged his value during the 2021 draft.”\n\nTeams believe he could be the outgoing player Brooklyn trades to take back a vet into the Jordan or Dinwiddie TPE. https://t.co/NeKnAAw36m",
    "837": "@BrooklynNets He Vaccinated I’m Just Saying 🤷🏽‍♂️ The OK3 Back Together Again Think About The Bigger Picture Here The World Would LOVE TO SEE IT!!! https://t.co/iHRIUBiCCl",
    "838": "@PhillBrowne @KDTrey5 @BrooklynNets I was sure you were a GSW fan 😂 are you o ur glory hunting lad?",
    "839": "“Brooklyn has expressed a surprising willingness to discuss sharpshooter Joe Harris… though he would surely require a pricey offer… his name keeps popping up.”\n\nHarris is the Nets’ only salary between $5.9M and $35M. Makes him the obvious starting point for any deal of note. https://t.co/NeKnAAw36m",
    "840": "Selling two tickets to the nets raptors game today in sec 16 #NetsWorld #nets #brooklyn",
    "841": "@MrWrightSENDCo @BrooklynNets @Raptors I’m interested",
    "842": "@TheAthletic @ShamsCharania @TheAthleticNBA @BrooklynNets @KDTrey5 @KyrieIrving Wishful thinking!💯",
    "843": "@BrooklynNets @TISSOT Kyrie back pls",
    "844": "@GoldStandard824 @TeddyGraham1487 @The7Line You’re telling me the New York Mets who can’t score more than two runs a game are going to win a championship before the Brooklyn Nets who have the best player in the world?",
    "845": "Top #NBA play today: Brooklyn Nets -8.0 (6.5 value)\n\nLike = tailing",
    "846": "@BrooklynNets @TISSOT Did Kyrie post this",
    "847": "@BrooklynNets @TISSOT Kyrie put on shoes this morning",
    "848": "NBA Basketball Game Betting Picks Simulator: 7:40 PM ET - Toronto Raptors vs. Brooklyn Nets - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/VC2c5zLI44 #nba #sportsbetting #freepicks #cappertek",
    "849": "@BrooklynNets @TISSOT where KI？",
    "850": "The Raptors are in Brooklyn to take on KD and the Nets on the second night of a back-to-back. Can they take down the Eastern Conference’s best? Preview!  https://t.co/wfGtDJoztJ",
    "851": "@BrooklynNets @TISSOT Please win",
    "852": "Great to be back, Brooklyn ⏱ @TISSOT https://t.co/9cxTBQW3CI",
    "853": "@BLCity5 @brooklynnets85 Haha only real question now is if he's in the Brooklyn Nets HSS  training center. That 60lb weight looks the same as Nets use &amp; those floors look awfully the same. 👁️ \n\nI knew from Claxton comments about guarding Kyrie that he's been practicing w. the team. This confirms it https://t.co/GGzr8jFkP1",
    "854": "Raptors Game Tonight: Raptors vs Nets Odds, Starting Lineup, Injury... (Raptors Rapture)\n\nThe Toronto Raptors were a Justin Champagnie tip-in at the buzzer away from winning five str...\n\nAdd your highlights:\nhttps://t.co/wOqQ8lYWJU\n #Brooklyn_Nets",
    "855": "@TeddyGraham1487 @The7Line It’s going to be the Brooklyn Nets not the New York Mets sorry",
    "856": "@CeroromoBragg Damn, your son is a future Brooklyn Net btw🙌",
    "857": "@ChanteGooden @BrooklynNets Obviously 🤣 what kinda question is that",
    "858": "The Brooklyn Nets will be the NBA champions if Kyrie comes back and stays healthy. I have no doubt",
    "859": "Kyrie Irving might be teasing a return to the Brooklyn Nets ... posting a video putting on his sneakers amid reports he could rejoin the team this season. https://t.co/nmj7w3t3XT",
    "860": "🦖 | DIA DE RAPTORS.\n\nBack to back no Brooklyn contra os Nets.\n\n⏰: 7:30 🇨🇦 | 21:30 🇧🇷 \n\n#WeTheNorth https://t.co/OAgIDuwkSu",
    "861": "@BrooklynNets @DukeMBB play tonight! Gonna be a good night.",
    "862": "NBA Picks Today: Toronto Raptors vs Brooklyn Nets https://t.co/XiXx2jo0lb",
    "863": "6/12/02 @Lakers 1(13)-(1)(07) by (6) (22)(0) total vs @BrooklynNets. 14th ring 9th title in la. @PhilJackson11 9-0 final record @NBA 56th sea on (11) year mark of 1st 6/12/91.1st of @Jumpman23 6.\n\n(44) days after (46) yr mark of (6) @RealBillRussell draft 4/30/(56) age 22.13 seas https://t.co/14H2M9mICN",
    "864": "@queenb3lle @ddpage369 @_JasonLT Again Trae hurt his ankle during mil series. In a new series vs nets. I’m assuming Trae isn’t missing games not baking that in. KD killing Atlanta does not mean the Brooklyn nets win the series lol. KD could average 40pgg and the team still lose lol.",
    "865": "Momma, we made it. ❤️\n\nIt doesn't take a lot, but when your team likes your tweets it can legit make your day. Thanks @BrooklynNets!\n\n*Resists urge to beg for a follow back* https://t.co/1kMe5onWZB",
    "866": "Tre kamper i NBA i natt 🏀😍\n\n01:30 🕜\nBrooklyn Nets - Toronto Raptors\nNew York Knicks - Golden State Warriors\n\n04:00 🕓\nPortland Trail Blazers - Phoenix Suns\n\nOdds 👉 https://t.co/ZHBkIig9SF",
    "867": "Consensus Line Move:\n2021-12-14 Toronto Raptors at Brooklyn Nets from 216.00 to 217.00\nOver up to the task\n#NBA #CryptoHoops #statistics #realestateagent",
    "868": "Tuesday 11amEST/8amPST #NothinButNet \n@dash_radio @Zaknoble and @RooshWilliams\n@Ballislife Noble &amp; Roosh Show W/ \n@robinlundberg &amp; @MattBrooksNBA\n- All Things @BrooklynNets\n- Biggest title Threats\n- @KDTrey5, Harden &amp; More…\n- Kyrie’s Future? Chance of a trade? https://t.co/WxaHbbKgVB",
    "869": "📅GAME DAY📅\n\n🏆 @NYCFC Championship Celebration at 12pm (Doors at 10am)\n🏒 @NJDevils at 7pm\n🏀 @BrooklynNets at 7:30pm\n🏒 @NYIslanders at 7:30pm\n🏀 @nyknicks at 7:30pm\n🏒 @NYRangers at 9pm\n\n#NYCFC #ForTheCity #NJDevils #NetsWorld #Isles #NewYorkForever #NYR",
    "870": "@J0in3z Ain’t know Backyard was performing. But you see the Nets been at the top of the East with essentially just KD. Kyrie come back and James can be the PG he wanna be again, I’m in Brooklyn in June on the float",
    "871": "@BrooklynNets @NYCMayor change the mandate.",
    "872": "You know what would be wild, if the Brooklyn Nets traded Kyrie for Russ. Now a more seasoned KD, Russ and Harden and compete together and possible win it all.",
    "873": "@caseymackay @Raptors @SacramentoKings @BrooklynNets @MapleLeafs @EdmontonOilers Sports crazy https://t.co/LNIpnmyUhq",
    "874": "#KyrieIrving \n\nPuts sneakers on in #InstagramStory \n#BrooklynNets #Ring #NBA #NBATopShotThis #NBA2K22 \n\nhttps://t.co/LAi53Uxun7",
    "875": "As vaccinated @KyrieIrving fan i had his back holding out. His choice. Then the @BrooklynNets went further &amp; banned him on the road. But if Kyrie Irving goes back to the Nets now for sake of basketball or the $$ than fuk em.",
    "876": "@TDChannel1 the @Raptors defeated the @SacramentoKings 124-101.  They’re back on the court in Brooklyn tonight against the @BrooklynNets.  Tip-off at 7:30 PM.\n\nThe @MapleLeafs are back on the ice tonight in Edmonton against the @EdmontonOilers…puck drop is at 9PM\n\n#TDCPressBox https://t.co/G7WfkVBxjE",
    "877": "Kyrie Irving posted a video of lacing up amidst rumours of his return! \n\nIs Kyrie coming back? 👀🤔\n\n🎥: @KyrieIrving | IG\n\n#kyrieirving #brooklynnets #nba https://t.co/unpydtDJYD",
    "878": "@baptiste718 @nbashania @BrooklynNets @HSpecialSurgery No sadly",
    "879": "@BrooklynNets @HSpecialSurgery Announce Kyrie back on Christmas",
    "880": "@PickDawgz @PickDawgz\n#pickdawgzcapperconest Jeff Johnson #219\nPick 1: NBA Brooklyn Nets -8\nPick 2: NBA Phoenix Suns -1.5",
    "881": "@KDurantSZN @BrooklynNets @HSpecialSurgery Kyrie was never reported as “out” on the injury report all season",
    "882": "Brooklyn is trying to upgrade the roster. Nets are listening to offers for Joe Harris and Nic Claxton (RFA end of the season). Nets could use the TPE from either Dinwiddie trade or DJ trade to trade for a vet. https://t.co/5FSMhfgLMG",
    "883": "@nbashania @BrooklynNets @HSpecialSurgery Also no kyrie in report we gonna get a early Xmas gift?",
    "884": "@BrooklynNets @HSpecialSurgery We gonna get this dub tonight let’s go",
    "885": "@BrooklynNets @HSpecialSurgery KYRIE?!?!?!?",
    "886": "@BrooklynNets @HSpecialSurgery Kd and king James masterpiece incoming",
    "887": "@BrooklynNets Welcome home",
    "888": "@BrooklynNets Will it be televised?",
    "889": "Nets @HSpecialSurgery Injury Report for tonight's game vs. the Raptors: https://t.co/WHw4YcxtqL",
    "890": "@ESPNNewYork Need this as an Alt uniform @BrooklynNets !",
    "891": "@BrooklynNets Is the beard playing tonight?",
    "892": "@BrooklynNets really going to be adding kai to a team thats already a 1 seed 🥳 https://t.co/Q6GyIAQMk8",
    "893": "Brooklyn Nets fans about to be annoying as hell all week 😅😂 https://t.co/JodtP9HYU1",
    "894": "Milwaukee Bucks, Phoenix Suns, Golden State Warriors &amp; Miami Heat\n\nThose are the teams I currently have as NBA Championship Quality. \n\nThe Brooklyn Nets Record against those Teams?\n\n0-4\n\nBeing the #1 Seed in the East and FEASTING on the Pistons, Hawks and Knicks means NOTHING!",
    "895": "𝐓𝐀𝐊𝐄 𝐍𝐎𝐓𝐄\n\n📉Toronto are 4-1 ATS in their last 5 games.\n📈Brooklyn are 0-5 ATS in their last 5 games at home.\n\nWhich side are you on?\n\nBet now: https://t.co/xCxoQKJpa0\n\n#NBA #Raptors #Nets https://t.co/57nQkG8rNh",
    "896": "Brooklyn nets dumb, they could’ve still had kyrie play road games. Those be yo toughest games depending on who you play",
    "897": "🏀Toronto Raptors #WeTheNorth vs Brooklyn Nets #NetsWorld⌚️7:30PM 🖥Yes Network #NBA75 #NBA https://t.co/IT8CMDqBkB",
    "898": "#Nets and Harden: Fischer essentially says Harden resigning is not a guarantee: \"Brooklyn appears eager to upgrade its roster ahead of the trade deadline and Harden’s impending free agency.\"\n\nHis \"impending free agency\" is irrelevant, if resigning is guaranteed.",
    "899": "Brooklyn Nets Big 3 Poster Basketball Painting Hand Made Posters Canvas Print Kids Wall Art Home Man Cave Gift Decor (36\"x24\" Ready to Hang)\nhttps://t.co/v7t28uERQa",
    "900": "@BrooklynNets Can we have an update on Kyrie please.",
    "901": "Brooklyn Nets' Kevin Durant drops NBA season-best 51 in win over Pistons - https://t.co/TQxJik5TwV\n#worldwidetweets https://t.co/Yyy10dNftw",
    "902": "📰 Brooklyn Nets vs Toronto Raptors Picks and Predictions Dec 14!\n👉 https://t.co/hAbuUPruMC @wagertalk",
    "903": "@BrooklynNets Win please",
    "904": "@Officialj0nn @BrooklynNets BREAKING: Brooklyn’s Point Guard is set to make a return to the NBA Christmas Day vs the lakers for his first game of the 2021-22 NBA season PER @ShamsCharania",
    "905": "@BrooklynNets announce kyrie return",
    "906": "@BrooklynNets Get this dub or I burn jevon cater jersey",
    "907": "@Officialj0nn @BrooklynNets He's leaving",
    "908": "@BrooklynNets Baby baby.",
    "909": "Feels good to be home, baby 🏠 https://t.co/cnj83zaNSu",
    "910": "If it's true, @BrooklynNets in 3 🤷‍♂️ #NBA #NetsWorld https://t.co/xM1Mo86q27",
    "911": "🏀Tonight the Brooklyn Nets will welcome the Toronto Raptors.\n🔮We are expecting an attractive basketball game tonight, with a dynamic pace and plenty of points. ⚡\n‼Visit https://t.co/a3hoUJ83ug for special offers, and for a full match preview, visit👉https://t.co/qpaQaYt5TD https://t.co/H43FtM854e",
    "912": "@BrooklynNets y'all need to play Kessler Edwards please he is a good defender in a shooter",
    "913": "TORONTO RAPTORS vs\nBROOKLYN NETS, 8:30PM.",
    "914": "@DP_three3 @IMALREADY_MULAA @Kusho__ @ForeverPops_ Lol I guess bro, you cant even explain how Brooklyn is chanting mvp for steph and cheering when he pulls from damn near half with KD on the court…..Brooklyn nets = gentrification",
    "915": "@BrooklynNets I know really the Rena is like not even 10 years old yet",
    "916": "@dbearak @BrooklynNets Appreciate you Doug. You at the game tonight?",
    "917": "Is any news is good news? We discuss the latest update on Kyrie Irving, if there is reason for optimism in Brooklyn, and why part-time play is a viable option for the Nets #NetsWorld \n\nYouTube:\nhttps://t.co/XH0yZOIwYs\n\niTunes:\nhttps://t.co/Waj8y4LFvo https://t.co/kyFZZXQJhJ",
    "918": "Looking for the perfect (and available right now) #gift? \n\nOur @Bookshop_Org gift cards support our work for kids, local bookstores, *and* the book lovers in your life - and email seamlessly - win win (just like the @BrooklynNets last two games)!  \n\nShop: https://t.co/Dfx616sbJh https://t.co/EA9asRONOe",
    "919": "until (one day) Kyrie Irving got covid, and regret (why he didnt) get vax earlier. like Joshua Kimmich (football/soccer player for \n@FCBayern\n ).\nat least 2 players in Nets get experience about covid. KD (11 months ago) &amp; Paul Millsap. \n\n#NetsWorld  \n@BrooklynNets https://t.co/UgNSAlywPz https://t.co/xhxBYGgDpj",
    "920": "@BrooklynNets if somehow the Nets win a chip; should Kyrie get a ring?",
    "921": "[Video] Are The Brooklyn Nets Under Pressure To Win The Finals In 2022 Like Lebron’s Heat Was In 2012  https://t.co/Hxy9meb896",
    "922": "Toronto Raptors vs. Brooklyn Nets Free NBA Picks 12/14/21 – Free Basketball Picks\n\nNBA Picks: https://t.co/6zs5bCs6Dn\n\nBet on Basketball: https://t.co/rAFjp0NQxx\n\n#Draftkings #Fanduel #Pointsbet #Basketballpicks #Sportsbook #NBAPicks #NBATwitter #GamblingTwitter https://t.co/QfP0Vd2iXY",
    "923": "Kyrie Irving And Kevin Durant Have Reportedly Increased Communicati... (Fadeaway World)\n\nSource: The Washington PostKyrie Irving has been away from the Brooklyn Nets for the entiret...\n\nAdd your highlights:\nhttps://t.co/6nrQv406sR\n #Brooklyn_Nets",
    "924": "Brooklyn Nets Big 3 Poster Basketball Painting Hand Made Posters Canvas Print Kids Wall Art Home Man Cave Gift Decor (36\"x24\" Ready to Hang)\nhttps://t.co/zYDK3OZjW0",
    "925": "Brooklyn Nets Big 3 Poster Basketball Painting Hand Made Posters Canvas Print Kids Wall Art Home Man Cave Gift Decor (36\"x24\" Ready to Hang)\nhttps://t.co/Y2Q9VgkaOr",
    "926": "Brooklyn Nets Big 3 Poster Basketball Painting Hand Made Posters Canvas Print Kids Wall Art Home Man Cave Gift Decor (36\"x24\" Ready to Hang)\nhttps://t.co/TlIzHZsirQ",
    "927": "Brooklyn Nets Big 3 Poster Basketball Painting Hand Made Posters Canvas Print Kids Wall Art Home Man Cave Gift Decor (36\"x24\" Ready to Hang)\nhttps://t.co/tSnkVwN5nt",
    "928": "@BrooklynNets Yeah bk bring it home",
    "929": "Brooklyn #Nets vs Toronto #Raptors  | Picks and Parlays |12/14/21 | NBA  Free Picks and Predictions | NBA Betting Tips   \n\nWatch: https://t.co/2yXyvBCOOh\n\n#NBA #NBAPick #NBAPredictions #Nets",
    "930": "Brooklyn Nets Big 3 Poster Basketball Painting Hand Made Posters Canvas Print Kids Wall Art Home Man Cave Gift Decor (36\"x24\" Ready to Hang)\nhttps://t.co/8FA1N4tIP8",
    "931": "Brooklyn Nets Big 3 Poster Basketball Painting Hand Made Posters Canvas Print Kids Wall Art Home Man Cave Gift Decor (36\"x24\" Ready to Hang)\nhttps://t.co/X2GLWas49i",
    "932": "Brooklyn Nets Big 3 Poster Basketball Painting Hand Made Posters Canvas Print Kids Wall Art Home Man Cave Gift Decor (36\"x24\" Ready to Hang)\nhttps://t.co/kwA4ethqXg",
    "933": "Brooklyn Nets Big 3 Poster Basketball Painting Hand Made Posters Canvas Print Kids Wall Art Home Man Cave Gift Decor (36\"x24\" Ready to Hang)\nhttps://t.co/6dwxBXUiNr",
    "934": "The @BrooklynNets' festive profile photo is elite.\n\nMerry Netsmas. https://t.co/mIfkHpR9Fs",
    "935": "Brooklyn Nets Big 3 Poster Basketball Painting Hand Made Posters Canvas Print Kids Wall Art Home Man Cave Gift Decor (36\"x24\" Ready to Hang)\nhttps://t.co/2N4SmTUTgf",
    "936": "Brooklyn Nets Big 3 Poster Basketball Painting Hand Made Posters Canvas Print Kids Wall Art Home Man Cave Gift Decor (36\"x24\" Ready to Hang)\nhttps://t.co/6QMyRVZtbx",
    "937": "Brooklyn Nets Big 3 Poster Basketball Painting Hand Made Posters Canvas Print Kids Wall Art Home Man Cave Gift Decor (36\"x24\" Ready to Hang)\nhttps://t.co/vf29RlD6pD",
    "938": "Brooklyn Nets Big 3 Poster Basketball Painting Hand Made Posters Canvas Print Kids Wall Art Home Man Cave Gift Decor (36\"x24\" Ready to Hang)\nhttps://t.co/AqrZmxRNZH",
    "939": "Brooklyn Nets Big 3 Poster Basketball Painting Hand Made Posters Canvas Print Kids Wall Art Home Man Cave Gift Decor (36\"x24\" Ready to Hang)\nhttps://t.co/ThxCnoR8BE",
    "940": "Brooklyn Nets Big 3 Poster Basketball Painting Hand Made Posters Canvas Print Kids Wall Art Home Man Cave Gift Decor (36\"x24\" Ready to Hang)\nhttps://t.co/ixcFQnks32",
    "941": "Over Brooklyn Nets 112.5 Team Total\n\n2 Units\n\n—————————-\nRecord: 15-6 (70%) +18 units\n\n#nbabets #sportsbettingpicks #SportsBettingTips",
    "942": "Brooklyn Nets Big 3 Poster Basketball Painting Hand Made Posters Canvas Print Kids Wall Art Home Man Cave Gift Decor (36\"x24\" Ready to Hang)\nhttps://t.co/LgkfRLl0B3",
    "943": "Brooklyn Nets Big 3 Poster Basketball Painting Hand Made Posters Canvas Print Kids Wall Art Home Man Cave Gift Decor (36\"x24\" Ready to Hang)\nhttps://t.co/6vBILqYWcg",
    "944": "Brooklyn Nets Big 3 Poster Basketball Painting Hand Made Posters Canvas Print Kids Wall Art Home Man Cave Gift Decor (36\"x24\" Ready to Hang)\nhttps://t.co/TCg4hbuPlo",
    "945": "Brooklyn Nets Big 3 Poster Basketball Painting Hand Made Posters Canvas Print Kids Wall Art Home Man Cave Gift Decor (36\"x24\" Ready to Hang)\nhttps://t.co/z4yK07Bj0v",
    "946": "@hunterw @BrooklynNets @KyrieIrving his Kyries merchandise is on sale in Taiwan,  because of his resistance or his hesitancy or his beliefs about vaccine.",
    "947": "Brooklyn Nets Big 3 Poster Basketball Painting Hand Made Posters Canvas Print Kids Wall Art Home Man Cave Gift Decor (36\"x24\" Ready to Hang)\nhttps://t.co/QZnb9eG7rp",
    "948": "Brooklyn Nets Big 3 Poster Basketball Painting Hand Made Posters Canvas Print Kids Wall Art Home Man Cave Gift Decor (36\"x24\" Ready to Hang)\nhttps://t.co/8Sv5cjFbvc",
    "949": "🏀 Toronto Raptors (@Raptors) #WeTheNorth\n🆚 Brooklyn Nets #NetsWorld #TORvsBKN\n✈️ N661DN | DAL8943 | B752\n🛫 YYZ - 10:59 pm ET\n🛬 JFK - 11:54 pm ET\n📡 Tracking: https://t.co/DEJtRWRgqC https://t.co/GcpjATevky",
    "950": "@EnesFreedom @BrooklynNets @joetsai1999 cool",
    "951": "#NetsWorld It's GAME back at The Clays!!! \n\nHold the house down!! Let's go @BrooklynNets",
    "952": "@hunterw @BrooklynNets @KyrieIrving You’re assuming he’s going to be willing to take a pill made by the same company which makes a vaccine.",
    "953": "This is incredible news for the @BrooklynNets and @KyrieIrving. The FDA must approve this for use in basketball immediately. https://t.co/P1JZXen3II",
    "954": "@NBA @NBASTORE @WNBA @nbagleague #NBAJerseyDay AND I'M ROCKING @NBASTORE WITH @chibbs_1 @BrooklynNets  #kennyanderson https://t.co/wgaZbKW4oC",
    "955": "Toronto Raptors @ Brooklyn Nets\nPick : Toronto Raptors.\nBasketball. NBA",
    "956": "Toronto visits Brooklyn after Durant's 51-point outing (https://t.co/iHmHAvVisP)\n\nToronto Raptors (13-14, 11th in the Eastern Conference) vs. Brooklyn Nets (19-8, first in th...\n\nAdd your highlights:\nhttps://t.co/okuiMGSpHL\n #Brooklyn_Nets",
    "957": "There is \"renewed optimism\" that All-NBA guard Kyrie Irving could rejoin the Brooklyn Nets in some capacity at some point this season, according to The Athletic's Shams Charania. Whatever that means.",
    "958": "@PRyanTexas Imma just go to the Nets game in Brooklyn for $100.00 &amp; watch Steph break the record on my phone. Those Knicks tickets prices are insane.",
    "959": "Brooklyn Nets are confident Irving will return this season https://t.co/3vdLbnEVlM",
    "960": "@BKGlueGuys  SHAMS: KYRIE MAY RETURN SOON!? ║ The Glue Guys Brooklyn Nets Podcast https://t.co/2TbI64jQH3 via @YouTube",
    "961": "⛹️‍♂️NBA --  Brooklyn Nets vs Toronto Raptors\n\n🏀Play Time: 12/14/2021 20:30 (GMT-4)\n\n📣Prediction: Brooklyn Nets -8.5\n\n👇Click here 2 view more\n\nhttps://t.co/OfZbOlZm2A\n\n#TORvsBKN #Nets #Raptors #NBA #NBA75 #NBAPicks #NBATwitter #ThatsGame #NBAECF #NBAWCF https://t.co/Zyy0TnV86H",
    "962": "Toronto Raptors (13-14, 11th in the Eastern Conference) vs. Brooklyn Nets (19-8, first in the Eastern Conference) https://t.co/pltVJKrHGR",
    "963": "so WHAT HE'S A LOP....\nKyrie Irving Preparing To Return To Brooklyn Nets https://t.co/qfQbA4zynB #SmartNews",
    "964": "@johnhancockcbc @JonnaBrewerCBC @CBCMoncton @infoamfred @JeanneCBC @mitchcormierCBC @Raptors play the @BrooklynNets tonight",
    "965": "Have The Brooklyn Nets Assembled The Greatest Team In NBA History?\nhttps://t.co/nBWKUQcOzY",
    "966": "@BrooklynNets The BEST Player in THE WORLD",
    "967": "@MJ_Fleet @LeGeneralJ can agree to this Brooklyn nets guaranteed 2022 ring.",
    "968": "Brooklyn Nets vs Detroit Pistons Full Game Highlights | December 12 | 20... https://t.co/Jf4wXadn9I @YouTube",
    "969": "@kendrel98 @paritosh_bhide @AndyKHLiu Nets moved to Brooklyn in 2012 lmaooo that’s 9 years ago. 2.6 million people and you can’t find a few thousand to fill up your arena to not cheer for a player that plays in California?? Trash argument.",
    "970": "Toronto visits Brooklyn after Durant's 51-point outing (Miami Herald)\n\nToronto Raptors (13-14, 11th in the Eastern Conference) vs. Brooklyn Nets (19-8, first in th...\n\nAdd your highlights:\nhttps://t.co/xx4sab4lXX\n #Brooklyn_Nets",
    "971": "@alexandroupoli8 @burntcebolla @TheAthletic @ShamsCharania @TheAthleticNBA @BrooklynNets @KDTrey5 @KyrieIrving He may got a vxxed",
    "972": "Toronto Raptors (13-14, 11th in the Eastern Conference) vs. Brooklyn Nets (19-8, first in the Eastern Conference) https://t.co/TfV4Y7Opbl",
    "973": "@paritosh_bhide Warriors fans started watchin ball in 15 so im not shocked yall are still perplexed by the nets fan base not being strong in Brooklyn when its fan base was left in New Jersey. shouts to @AndyKHLiu too.",
    "974": "@BrooklynNets Congrats my love",
    "975": "@BrooklynNets tyrone biggums lookin ass",
    "976": "New York Knicks vs Brooklyn Nets Full Game Highlights | November 30 | 2022 NBA Season https://t.co/iINCOMOR4A",
    "977": "@TheAthletic @ShamsCharania @TheAthleticNBA @BrooklynNets @KDTrey5 @KyrieIrving Brooklyn finally did it 😂 https://t.co/Yj7kj8bp2r",
    "978": "@TheAthletic @ShamsCharania @TheAthleticNBA @BrooklynNets @KDTrey5 @KyrieIrving That would be awesome",
    "979": "With Harden getting these numbers I also lean Harden 25+ Pts/Brooklyn To Win. TOR lost 6/7 last road games and Brooklyn is trying to string some wins together and stay top of the East. Except the Nets and Harden to look to handle business in Brooklyn",
    "980": "RT @freep: Detroit Pistons game score vs. Brooklyn Nets: Live scoring updates https://t.co/6Ab4IUtBq7",
    "981": "Oh yea I would take Brooklyn Nets “wire to wire”  (+114) Raptors are on a back to back &amp; harden should be playing, so do what you want with that information.",
    "982": "There is renewed optimism that star point guard Kyrie Irving could return to play for the Brooklyn Nets this season after all, The Athletic reported. | @Reuters https://t.co/yivISUtoE9",
    "983": "James Harden Gold /10 out of Mosaic Basketball pulled on IG by givemeabreaknyc 🥇 #BAAANG #thehobby #harden #brooklyn #nets https://t.co/T6pEB9N9mC",
    "984": "@mnonexistentt Catch a Nets game in Brooklyn 😎",
    "985": "The Brooklyn Nets have waived Domantas Sabonis and downgraded Bill Walton to the bench to sign Rick Barry and Robert Parish, via @DGOZ_ .\n\n#99LeagueSeason7 https://t.co/IRwzlXr8GH",
    "986": "NBA Basketball Game Betting Picks Simulator: 12/14/2021 7:40 PM ET - Toronto Raptors vs. Brooklyn Nets - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/VC2c5zLI44 #nba #sportsbetting #freepicks #cappertek",
    "987": "@NLootin @BrooklynBrigade @BrooklynNets Great stuff.  Have a fabulous trip",
    "988": ".@JHarden13 is racking up the numbers while helping BKN soar this season! 📊\n\nWatch the 2018 MVP in action when the @BrooklynNets host the @Raptors tomorrow at 8:30 AM on NBA TV Philippines via @CignalTV! 📺\n\n#NBA75 https://t.co/DIoXqj2gQn",
    "989": "Florida Panthers - Ottawa Senators\nPittsburgh Penguins - Montreal Canadiens\nBrooklyn Nets - Toronto Raptors\nNew York Knicks - Golden State Warriors\nPortland Trail Blazers - Phoenix Suns\n\nBet slip link: https://t.co/OBW1hp4s3g https://t.co/1MLLUEv05a",
    "990": "The Brooklyn Nets will need to make shots to beat the San Antonio Spurs this season #BrooklynTogether #GoSpursGo",
    "991": "We ballin’ #NetsWorld  @Patty_Mills @BrooklynNets https://t.co/vwLm7vuBtt",
    "992": "Kyrie Irving GREATEST Game EVER? EPIC 57 Points Highlights vs Spurs | Ma... https://t.co/HBuxevih4c via @YouTube #freekyrie #nets #Brooklyn #TheNBA #basketball",
    "993": "@NLootin @BrooklynBrigade @BrooklynNets Enjoy! Jealous that you’ll be at there, a Nets game in person is like no other. #NetsWorld",
    "994": "@GoatedAJK @cream_jt @GameTechSudios @JHarden13 @BrooklynNets @KDTrey5 What does his points have to do with his teamates? Lmao we also beat KD and Kyrie the next game. Nets are frauds and KD can’t win without superteams.",
    "995": "@cream_jt @GameTechSudios @34GFreak @JHarden13 @BrooklynNets @KDTrey5 KD was dropping 50 with Blake Griffin as his second best player in that whole series, don’t forget how they almost won by 50 when Kai played",
    "996": "Nets open homestand against improving Raptors https://t.co/3W4dtNm18M #NBA #BrooklynNets #TorontoRaptors",
    "997": "Nets open homestand against improving Raptors  #NBA\n #BrooklynNets #BrooklynGrit #Raptors #WeTheNorth #RTZ https://t.co/Xol1dVQjSP",
    "998": "@joersonzz @omegawud @joetny13 @jbrady58 @MikeyCee24 @Markvonzwehl @NYCFC Yea obviously theres more Knicks fans in brooklyn. Theres probably 20 knicks fans for every nets fan anywhere in the nyc area",
    "999": ".@SamiOnTap says the Brooklyn Nets are winning it all if Kyrie Irving comes back, it’s almost a guarantee! 🤷‍♂️ \n\nDo you agree? 🤔 \n\n📹: https://t.co/v8vsGY0ZU0 https://t.co/4rpilrSFfB",
    "1000": "@TheAthletic @ShamsCharania @TheAthleticNBA @BrooklynNets @KDTrey5 @KyrieIrving This won't move me",
    "1001": "@NBA @KDTrey5 @BrooklynNets I'm glad KD is no longer a @warrior. I like team basketball. KD running down court &amp; scoring over and over again is BORING.",
    "1002": "@jmsiv99 @omegawud @joetny13 @jbrady58 @MikeyCee24 @Markvonzwehl @NYCFC i mean considering that the nets arent even the most popular team in brooklyn thats irrelevant",
    "1003": "Brooklyn Nets Close Out With Dominant Defense On Road Trip | Brooklyn Nets https://t.co/l9yUOJWYpY",
    "1004": "@TopDawgShaun @tseweseer @NBA @KDTrey5 @BrooklynNets i would have them in 2018 with healthy cp3 but that was their only good year",
    "1005": "Tonight @Raptors vs @BrooklynNets #NBA75",
    "1006": "@NBA @KDTrey5 @BrooklynNets Should he be known as Sniper?",
    "1007": "@BrooklynNets can we have Jevon back ?????",
    "1008": "If any NBA teams need someone to fill in as the game DJ just let me know.  Especially The Nets (favorite team, I have hundreds of songs by Brooklyn artist) or The Bulls (I can be at the stadium with a few hours notice).  I'd be really good at it I promise.",
    "1009": "@BrooklynNets \"You guys know who I am. You know my name. I'm Kevin Durant. \nP.S. I'm a scoring champ; 2 time champ; 2 time Finals MVP, and about 2 B 2021 MVP!",
    "1010": "@Z2Kame @BrooklynNets Max contract now",
    "1011": "@TheAthletic @ShamsCharania @TheAthleticNBA @BrooklynNets @KDTrey5 @KyrieIrving But… is he gonna get vaccinated?",
    "1012": "If and when I get the notification saying Kyrie Irving will be playing basketball again for the Brooklyn Nets I will be so happy",
    "1013": "@ByKatieDavidson DLo had the leadership qualities since his Brooklyn days it's too bad the Nets decided to break up the \"From the Ground up\" squad just to bring in Kyrie and KD for win now. Not to discredit them tho cause they have been playing well but that 2019 Nets chemistry was off the charts",
    "1014": "A good player as in 1 good player ???!!! @BrooklynNets we might have to deal Cam thomas for this package Cam Thomas,Joe Harris, Bruce Brown, Bembry, Blake, Millsap &amp; Sharpe pick any 5 Kings their yours send Hield &amp; Bagley please lol https://t.co/3FrlD4foyR",
    "1015": "@OlDirtyDennis @barclayscenter @BrooklynNets @animalcrossing Better hope Boone don't move to town.",
    "1016": "I need court side seats to the Brooklyn Nets and Grizzlies game🤔",
    "1017": "Kevin Durant scores 51 points in the Brooklyn Nets #NetsWorld 116-104 victory over the Detroit Pistons.\nhttps://t.co/TDHLabrAzz",
    "1018": "This piece is dedicated to James Donzella. He is a 15 year old boy who was paralyzed from the neck down. James loves everything basketball and the Brooklyn Nets! My friend reached out to me and asked if I could paint something special with his two favorite basketball players! https://t.co/h4uTyZVnRQ",
    "1019": "Rams are the Brooklyn nets of the NFL",
    "1020": "@theemissharden Brooklyn nets playing tmrw &amp; you ain’t here lol",
    "1021": "Reports Monday morning have indicated that Brooklyn Nets star Kyrie Irving could be on his way back to the court. https://t.co/vFmIG3NKV2",
    "1022": "@OlDirtyDennis @barclayscenter @BrooklynNets @animalcrossing Yeah I’ve got some spots to weed but yes, we shall plan us an island visit time!",
    "1023": "@phxllnohoes @wolfgodrich @TheAthletic @ShamsCharania @TheAthleticNBA @BrooklynNets @KDTrey5 @KyrieIrving Don't doubt kyrie and kd skill they blew out the health bucs by themselves and giannis in my opinion is way tuffer to guard than curry",
    "1024": "I don't believe they can beat the @warriors or @BrooklynNets #nbafinals2022 @3peatwarriors01 @Thekingiscrown1 https://t.co/jPhiIL12ej",
    "1025": "@yungk0ala @barclayscenter @BrooklynNets @animalcrossing I’ll definitely be paying you a  Holiday visit. I gotta tidy mine up a bit more first lol",
    "1026": "Road warrior Nets have opportunity to start building home advantage (New York Post)\n\nThe Nets sit atop the Eastern Conference thanks to the best road record in the league.But to...\n\nAdd your highlights:\nhttps://t.co/ESQysNPRBB\n #Brooklyn_Nets",
    "1027": "you know what's wild, if (unvaccinated) Kyrie Irving was traded to another team, he and his new teammates could go into Brooklyn and play against the Nets or Knicks with no issues because opposing players are not subject to the NYC vax mandate...",
    "1028": "@OlDirtyDennis @barclayscenter @BrooklynNets @animalcrossing I’ve changed up my island since your last visit.. it’s more of a jungle theme now styled and decorated as a Christmas Island 😁",
    "1029": "@treyelectronica @barclayscenter @BrooklynNets @animalcrossing She can’t drive on her left. Once I isolate the right side, this game is as good as finished!! Lol",
    "1030": "Durant's 51 points lead Nets past Pistons 116-104! #NBA #NBA75 #NetsWorld  @BrooklynNets @DetroitPistons @NBA @WFAN660",
    "1031": "@yungk0ala @barclayscenter @BrooklynNets @animalcrossing Ooooh you finished it? Deal! Ill have to let you come check out my upgrades too lol",
    "1032": "Shams Charania Interview: Kyrie Irving's increased chances of a return to the Brooklyn Nets https://t.co/vTAEvtaKSM",
    "1033": "@OlDirtyDennis @barclayscenter @BrooklynNets @animalcrossing Lmao that's pretty sick.",
    "1034": "@wolfgodrich @Darius62368461 @TheAthletic @ShamsCharania @TheAthleticNBA @BrooklynNets @KDTrey5 @KyrieIrving nets in 6 or 7 tbh",
    "1035": "@OlDirtyDennis @barclayscenter @BrooklynNets @animalcrossing You’ll have to come see my Christmas Island when you get a chance!",
    "1036": "@sarahkustok @Grady @BrooklynNets @DetroitPistons @YESNetwork @NetsOnYES Sarah and Grady the dream team !",
    "1037": "@yungk0ala @barclayscenter @BrooklynNets @animalcrossing Lol yup! Made some minor upgrades. Adding a few new things around the island as we speak. The update had so much new stuff added that I couldn’t resist! lol",
    "1038": "@OlDirtyDennis @barclayscenter @BrooklynNets @animalcrossing Did you update the court? 👀",
    "1039": "a brooklyn net in a few months https://t.co/Wre6BcGBUo",
    "1040": "So many veteran free agents signed on in Brooklyn under the assumption the team would be title favorites WITH Kyrie Irving.\n\nAs long as the players okay it, Nets org. owes those players, among others, to give winning their best shot. That includes Kyrie in whatever capacity.",
    "1041": "@MessiahCranky @GlooManAbisai @TheHoopCentral @cavs Until y’all beat the jazz and bucks each twice and Brooklyn nets then stfu 🤫",
    "1042": "If The @BrooklynNets  Are Not That Good How They First In The East &amp; Got The 4th Best Record In The League",
    "1043": "@GTJxRaptors @BrooklynNets @Raptors do the same",
    "1044": "@myghty1 @WorldWideWob @BrooklynNets I don't think they wanted to, but it was the only way they could clear the cap space and get another 1st round pick to complete the Harden trade.",
    "1045": "@Oldglorycries @DottieDotson69 After NJ lost the Nets to jay-Z “Waddup Brooklyn” I lost all hope for this state’s sporting teams. Little pansies. Every team - New York. Is our state name that embarrassing to people ?",
    "1046": "The Brooklyn Nets partnered with Pfizer to feature Bruce Brown in a pro-vaccine commercial? Hahahahahahahhaha @KyrieIrving - that’s a message if I’ve ever seen one. #GetVaccinatedNow",
    "1047": "Kevin Durant drops NBA-high 51 points in Brooklyn Nets win over Detroit Pistons https://t.co/6rC2llNs0L",
    "1048": "Sources tell ABLRUMOURS that there have been trade talks between Brooklyn and Chicago to get Darius Rocky to Chicago after Darius has disclosed his unhappiness with the Nets organisation.",
    "1049": "@Raptors improve to 13-14 on the Season, Next up they got the @BrooklynNets tomorrow night, Rest up boys and Let’s do it again 🔥🔥🙏🙏 #WeTheNorth",
    "1050": "Brooklyn Nets vs Toronto Raptors is on Sportsnet One. Co-commentator is Amy Audibert.  For more details see https://t.co/Dwx1IYGie9 #BrooklynNets #TorontoRaptors #SportsnetOne",
    "1051": "the @BrooklynNets and  @KyrieIrving came up with the don't get the shot idea so that he could avoid injury... watch my boy come back close to playoffs time and cook every team pg 😂 @undisputed @stephenasmith @ShannonSharpe @RealSkipBayless",
    "1052": "@JassonDaMartian @TheAthletic @ShamsCharania @TheAthleticNBA @BrooklynNets @KDTrey5 @KyrieIrving Canada made plant based vaccines apparently. People think that kyrie is open to get a plant based one",
    "1053": "KD said he wants to know WHAT YOU THINK OF ME NOW? 🤯🏀👔⏳ @KDTrey5 @BrooklynNets 🗽📊🏆 #NetsWorld https://t.co/F0ww4BoNqv",
    "1054": "Lil' Man the Boy King of Privaized Brooklyn, New York City, New York 1979, with a potential American Professional Sports \nNet Worth of Legal Settlement and Earned Investment Capital of @ $3.0 bill. - $5.0 bill. USD in his lifetime... https://t.co/6uV4GiPyUS",
    "1055": "@shaqtin If you're not wearing a black jersey like the Brooklyn Nets, you'd have to be an idiot to think the ref is your teammate. 😄",
    "1056": "NETS IN 4! 27TH birthday 🎈 @BrooklynNets  @KDTrey5  rocking the best player in the world https://t.co/6HA2h0LgMO",
    "1057": "KD ERUPTION\n\nKevin Durant reinstated his claim to be part of the MVP race with a season-high 51 points with nine assists as the Brooklyn Nets defeated Detroit Pistons, 116-104.\n\n#NBA75 \n#YourSourceOfGoodNewsEveryday https://t.co/sISEx3UXKY",
    "1058": "@NBCNewYork I could see the @cavs as a third team to help make a trade happen. Maybe they get awing player or another SG. Much like they helped with the Harden deal to get him to the @BrooklynNets",
    "1059": "@LandonBuford @DetroitPistons @Candace_Parker @BrooklynNets @KDTrey5 @NBA KD had 4 players guarding him at times. It just didn’t work.",
    "1060": "4 ideal Dennis Schroder trade scenarios from the Boston Celtics https://t.co/mFz3ItOIzB #NBA #BostonCeltics #BrooklynNets",
    "1061": "ICYMI: The NBA fined Brooklyn Nets forward Kevin Durant $25,000 for directing obscene language toward a fan in Atlanta. https://t.co/Zj3Vn0MkIW",
    "1062": "There is 'renewed optimism' Kyrie Irving will rejoin Nets this seas... (Fox News)\n\nKyrie Irving could make his return to Brooklyn soon.\n\nAdd your highlights:\nhttps://t.co/fHlpDdVq3u\n #Brooklyn_Nets",
    "1063": "@wolfgodrich @TheAthletic @ShamsCharania @TheAthleticNBA @BrooklynNets @KDTrey5 @KyrieIrving See how they gonna play when they come back first",
    "1064": "@wolfgodrich @TheAthletic @ShamsCharania @TheAthleticNBA @BrooklynNets @KDTrey5 @KyrieIrving Hell yeah what the heck 😭 mvp KD dominate kyrie and whatever harden gonna be joe Harris claxton patty mills alrdige",
    "1065": "@BrooklynNets Feeling him",
    "1066": "@BrooklynNets I will say though Detroit as a team has probably the quickest hands I've seen in the league in a while",
    "1067": "@BrooklynNets I'm loving it the nets are playing great basketball on the defensive end the offensive end and of course my man sur dopeness.. 51 points he rocks the baby and the rim..mvp",
    "1068": "@Darius62368461 @TheAthletic @ShamsCharania @TheAthleticNBA @BrooklynNets @KDTrey5 @KyrieIrving So we got klay and wiseman at full health and still nets in 5?",
    "1069": "Thank you @BrooklynNets for Jarret Allen.",
    "1070": "love the @BrooklynNets @BioNTech_Group @pfizer ad.  get vaccinated.",
    "1071": "Thank You Brooklyn Nets",
    "1072": "@William57790761 @bakerkickflip @ozfootytalk @statmuse @KDTrey5 @BrooklynNets What’s the average FG% for nba players not counting big men?",
    "1073": "NEW YORK (AFP) — Kevin Durant used all the weapons in his arsenal on Sunday, exploding for a National Basketball Association (NBA) season-high 51 points and dishing out nine assists as the Brooklyn Nets clobbered the struggling Detroit Pistons, 116-104. https://t.co/UezHWfVhvY",
    "1074": "Make it 12 losses in a row for the struggling @DetroitPistons after falling to @BrooklynNets.\n#Pistons are on pace to finish 13-69 this season.\nThe @chicagobulls #COVID19 problems cancelled tomorrow night's game- so next chance to end the streak will be Thursday night at @Pacers. https://t.co/WpjZxuHU1y https://t.co/tVUJ52bOj5",
    "1075": "@nailuJ914 Not a Nets fan, but KD is playing some of the best basketball of his life in Brooklyn and is the reason why the Nets are top of the East. The Knicks would kill to have him on their roster.",
    "1076": "There are many “pea brain” amongst bus. One famous person is; Kyrie Irving an NBA star for the Brooklyn Nets..Not Vac, not playing. https://t.co/4xnaP9mxwS",
    "1077": "Nets veteran forward Paul Millsap enters Health and Safety protocols #BrooklynNets #PaulMillsap https://t.co/r3t9lN7hfQ",
    "1078": "@brandonmvick @chicagobulls @Bucks @NBA @celtics @Lakers @blazers @sixers @HoustonRockets @okcthunder @Pacers @dallasmavs @spurs @warriors @LAClippers @nuggets @SacramentoKings @Raptors @cavs @BrooklynNets @MiamiHEAT @hornets @ATLHawks Walking bucket alert ⚠️"
}