{
    "0": "@celtics Yass double bigs vs the bulls who play 4 guards",
    "1": "@TheNBACentral @AhnFireDigital Yeah he is. J RICH you and every other @Celtics player knows what’s up. Y’all better stop this cheap BS immediately. Shroeder already on my list, you wanna be on that list too Josh???",
    "2": "@mactojakobi @celtics Thanks I will",
    "3": "Girl after my heart 💚 I need therapy watching my @celtics #BleedGreen https://t.co/88tajJOvCH",
    "4": "@chicagobulls lineup against the @celtics. Ayo Dosumu gets his first NBA career start as the Bulls try to end their 2 game embarrassing skid. #BullsNation https://t.co/fupI4YxVHK",
    "5": "@DillonO_ @celtics LMAOOO bro💀💀 enjoy the game tho",
    "6": "@celtics The Bulls are probably going to go small and we're not going to post Al up. This is dumb.",
    "7": "@mactojakobi @celtics They just like me fr",
    "8": "@celtics I don't know these guys well enough. I need to see the numbers.",
    "9": "Chiacago Bulls: Chicago #Bulls vs. Boston #Celtics Odds &amp; Pick: Back Boston Over Zach LaVine-Less Chicago https://t.co/kzHxhYBxEo",
    "10": "@mactojakobi @celtics Everyone around me got the pats game on their phones lol https://t.co/0SM9VuFSDI",
    "11": "Norm Powell seems like an extremely obvious target for the Boston Celtics",
    "12": "@Pavel9792 @celtics We’re so over it",
    "13": "@yanzcrf Vence o Boston Celtics",
    "14": "How to Watch Boston Celtics vs. Chicago Bulls: Live Stream, TV Channel, Start Time https://t.co/h64ubGRwcd",
    "15": "@celtics be honest we all watching the pats rn",
    "16": "@celtics Ain't nobody care Pats are on",
    "17": "I’m ready for the @celtics to disappoint me.",
    "18": "The @Celtics starting Schroder, Brown, Tatum, Horford, Robert Williams on Saturday. #Celtics #NBA",
    "19": "@Erikd25 @NFL He has given up on the @ChicagoBears . At the @chicagobulls game at @celtics tonight.",
    "20": "@celtics Who asked",
    "21": "@celtics Go Boston Celtics!",
    "22": "Boston Celtics (-7) vs. Chicago Bulls! #BleedGreen #BullsNation #NBA #NBATwitter #NBA75",
    "23": "Boston Celtics Starters:\n\nDennis Schroder\nJaylen Brown\nJayson Tatum\nAl Horford\nRobert Williams\n\nPlayers out:\nMarcus Smart\n#BleedGreen #NBA #NBATwitter #NBA75",
    "24": "Boston Celtics News - @celtics starters for tonight's game with the Chicago Bulls. #bostonceltics #celtics #bostonathlete #NBA #boston #basketball #NBA75 #bostonsports #BleedGreen #goceltics #bostonathletemagazine https://t.co/nvPf5BkRVI",
    "25": "@celtics We are watching the patriots",
    "26": "@celtics Double bigs again 😢🤦‍♂️",
    "27": "@celtics GL but watching the Pats.",
    "28": "@celtics Pathetic. It’s so obvious that horford should be backing up rob…. There should never be a time where rob or al is not at the 5 in a game. If Udoka can’t figure that part out he should be fired",
    "29": "@celtics plz win",
    "30": "@celtics That’s insanity sticking with the same lineup over and over knowing it doesn’t work we should be starting grant over horford",
    "31": "@celtics we not watching😴😴",
    "32": "@celtics double big🤢",
    "33": "Bulls’s starting lineup vs. Boston Celtics \n#BullsNation #NBA75 https://t.co/jdvNPWtzNK",
    "34": "@celtics With all due respect we not watching tonight",
    "35": "@celtics doesn’t matter, not making playoffs",
    "36": "@celtics We do not care about Ltics the pats are playing",
    "37": "@celtics Watching Patriots not you",
    "38": "@celtics Sorry not watching lol",
    "39": "@celtics STOP WITH THE TWO BIG LINEUP",
    "40": "@celtics Don’t care pats playing",
    "41": "@celtics Good luck Celtics best of luck",
    "42": "@celtics Just post the final already this double big lineup needs to go",
    "43": "@celtics Please win🙏they don’t have Lonzo and Zach",
    "44": "@celtics Pats on",
    "45": "@celtics We watching football",
    "46": "@celtics Is it too much to ask for Richardson in the starting 5",
    "47": "@celtics My dream line up all season",
    "48": "@celtics Patriots on",
    "49": "@celtics Football on we do not care",
    "50": "@celtics Sorry gotta watch the pats",
    "51": "@celtics The patriots are playing",
    "52": "Tonight's starting 5 https://t.co/vaLyhDu0k0",
    "53": "@phillydrilz @snoopenthusiast @CatfishMiller @celtics I seriously cant imagine being a Philly fan, that shit sounds depressing af lmao.  I totally see why yall are the angriest fanbase in sports 😂😂",
    "54": "@snoopenthusiast @phillydrilz @CatfishMiller @celtics The Nets Wizards and Heat teams they beat were all below average.  At very best, they were just average, and thats being extemeley generous\n\nEvery year, all u sad Philly fans have is some games in December or January.  Shit must suck so much rooting for that poverty team 🤣",
    "55": "Spurs and over on Boston Celtics game https://t.co/LoBH6HdOPi",
    "56": "Please stop the Boston Celtics  MEDIOCRITY Basketball Team.   It's very hard to watch.  BLOW IT UP!",
    "57": "@celtics @FCHWPO Pain incoming",
    "58": "Boston Celtics: Potential #Celtics Trade for Kings Rising Star Hurt by Assets: Insider | https://t.co/7Uxzwwqt8B https://t.co/LbRVh594Fg",
    "59": "Joel Embiid again carried the load offensively for Philadelphia, scoring 25 points and grabbing 13 rebounds as the 76ers beat the Boston Celtics 111-99 for their eighth win in nine games. https://t.co/Rj2aR9B46w",
    "60": "@celtics @jaytatum0 doesnt deserve it this year",
    "61": "@celtics @FCHWPO Let's go, @Celtics and @Patriots!",
    "62": "@celtics Such an insight, mastermind! Lol.",
    "63": "Tonight's starting lineup for the Boston Celtics: Schroder, Brown, Tatum, Horford, Robert Williams https://t.co/bVWH4AMCA2",
    "64": "@celtics @FCHWPO Sadly no one cares right now. Patriots are on.",
    "65": "@celtics @FCHWPO This game shoulda been at 1",
    "66": "@celtics @FCHWPO Lmaooooooooo stop tweeting. I’m about to watch a real team play",
    "67": "@Owen3461 @celtics @FCHWPO With no Lavine, Caruso or Lonzo. I sure hope not lol",
    "68": "@celtics @FCHWPO You gotta earn my 🗳",
    "69": "NBA Live Scores: WAS v POR 55-64 1:05mins rem in 2Q (POR adds to their lead but work still to be done)... ATL v NYK 20-18 3:11mins rem in 1Q (ATL claws ahead)... Game open! Follow to get updates as BOS hosts CHI.  @celtics @chicagobulls #NBA",
    "70": "@celtics @FCHWPO Cares Mac Jones plays in 10 minutes",
    "71": "@celtics @FCHWPO Nobody watching",
    "72": "@celtics @FCHWPO Not watching",
    "73": "@celtics @FCHWPO We need to help Jaylen more!!Keep tweeting these!!",
    "74": "@celtics @FCHWPO not watching gladly",
    "75": "@celtics @FCHWPO You think we watching you over the Pats? 💀",
    "76": "These guys stayed READY for this incredible story that pics up from jump of season end. ❤..Ray Donovan the Movie..yo if u a fan...TOO good! @BostonGlobe @celtics",
    "77": "@celtics @FCHWPO Why tf do y’all have to play the same time as the pats",
    "78": "@celtics @FCHWPO Sorry not watching! Hood watching Patriots",
    "79": "@celtics @FCHWPO We’re going to lose",
    "80": "@2_libras @celtics @J_Rich1 @jaytatum0 @FCHWPO @paytonpritch3 Idk man that coat JRich got is tuff",
    "81": "30 minutes before game time ⌛️\n\nPlenty of time to get your votes in for @FCHWPO for #NBAAllStar 🔄⭐️ https://t.co/8og3kfebvO",
    "82": "Boston Celtics - Chicago Bulls\nDallas Mavericks - Orlando Magic\n\nBet slip link: https://t.co/wxpFTUp9am https://t.co/Hu9BHSBVtc",
    "83": "Boston Celtics: Boston #Celtics: Jayson Tatum and Jaylen Brown can't do it all on their own https://t.co/FM2OxSnH5w",
    "84": "@celtics Tell that to both JT and JB, both love to dribble and take the one on one route. None of both are  catch and shoot type of a player.",
    "85": "@ctsbulls @chicagobulls @celtics @670TheScore @Audacy It's a terrible location to call a game on radio! I'll understand if you're a step behind!",
    "86": "@celtics @J_Rich1 @jaytatum0 @FCHWPO @paytonpritch3 Why JT got his hand like this https://t.co/8A52ukQq6U",
    "87": "@celtics @J_Rich1 @jaytatum0 @FCHWPO @paytonpritch3 PP with the best performance once again...lol...",
    "88": "It's almost time for @chicagobulls at @celtics!\n\n⏰ 7:15 pregame\n🏀 7:30 tip-off\n🎙 @ctsbulls &amp; @34billy42\n📻 AM 670, FM 104.3 HD-2\n📱 @Audacy app\n🖥 https://t.co/6pC174BHJJ\n\nThe Score is your home for #BullsNation Basketball! https://t.co/UU9DBjtXOw",
    "89": "@celtics @J_Rich1 @jaytatum0 @FCHWPO @paytonpritch3 beautiful",
    "90": "It wasn't 1-on-1 during the 1986 Playoffs.\n\nLarry Bird was a member of one of the greatest teams of all time.\n\nOnly the 1987 Lakers and 1996 Bulls were on the same level as the 1986 Celtics.\n\nNo player or team today would win a playoff series against those Big 3 Boston Celtics. https://t.co/xUgj3dCMQb https://t.co/Td28BxWvXs",
    "91": "@NBATradeAlerts I’m pretty sure J. Rich can’t be traded until after the Feb 10. Deadline - he signed his extension on Aug 23 making Feb 23 the six month min requirement! @celtics",
    "92": "@celtics @jaytatum0 This year the Celtics deserve shit",
    "93": "@celtics @jaytatum0 Why? He’s not an all star",
    "94": "@celtics Tragic",
    "95": "@ChaseRiceMusic @fenwaypark @TheGarden @celtics @RedSox @NHLBruins @kanebrown @RestlessRoad All about the RICE❤️🌹",
    "96": "Report: Boston Celtics reached out to Suns’ to trade for Jalen Smith, with Dennis Schroder the likely offer https://t.co/SCx0SfPNJ6 via @Yahoo",
    "97": "@celtics y'all see this? https://t.co/CcZptH3dU8",
    "98": "@celtics This is expert level analysis…..",
    "99": "@CoachBryant5 @celtics Udoka knows nothing.",
    "100": "Boston Celtics: Chicago #Bulls vs. Boston #Celtics: Betting odds and prediction - Pippen Ain't Easy https://t.co/DRR2EfbsH3",
    "101": "@olson_davin @MayorWu @celtics Who cares? Are you on a ventilator, are you or your friend hurting our front line workers or endangering the lives of others. If NOT the vaxx worked!",
    "102": "@AshabMannan18 @big__ash22 @WillUmmmm4479 @celtics @jaytatum0 @FCHWPO jt will not be holder or JB?",
    "103": "Boston Celtics: Boston #Celtics: Jayson Tatum and Jaylen Brown can't do it all on their own https://t.co/mOg2c5WbE6",
    "104": "Boston Celtics: Chicago #Bulls at Boston #Celtics: Lineups, injury reports and broadcast info (1/15) - Yahoo! Sports https://t.co/ZzhePrMJXn",
    "105": "@BigFish51st @celtics @BBW_Candi @jaytatum0 so vote for him",
    "106": "@celtics @Patriots Thanks Boston Celtics, good luck  to you too, except when you play my Washington Wizards.",
    "107": "@celtics Easier said than done, Brad Stevens let the egos and the iso ball get so bad to the point where it’s become routine to our all star players to think more about their own game than making their teammates better.",
    "108": "@terryjt1 @celtics he is a good rebounder but that doesn’t matter because teams don’t miss against us😭😭",
    "109": "No Zach, Pat, Lonzo, JC, Javonte, Caruso or DJJ against Boston. Celtics by 50 tbh.",
    "110": "@terryjt1 @celtics ur really trying to defend enes, he does NOTHING for this team. He needs to suffer bc of how ass he is 💯 https://t.co/GviB8pPGHq",
    "111": "@celtics Hard to move the ball when smart ain’t there",
    "112": "@celtics @Patriots No lmao",
    "113": "@celtics Well Tatum is the antithesis of good ball movement",
    "114": "@CoachBryant5 @celtics Apparently organization is afraid to anger them, lest they  request a trade. Alienating the fanbase apparently not a similar concern.",
    "115": "FUCK YEAH MASSHOLES‼️ @Patriots @celtics @CalvinKattar🔥 …",
    "116": "@celtics JB is in the mode of Allstar chasing, a few chances the ball will move.",
    "117": "@terryjt1 @celtics he played 14 mins yesterday and got 1 rebound💪🏽💪🏽💪🏽💪🏽 and don’t get me started on his defense…",
    "118": "@terryjt1 @celtics yeah u definitely don’t watch the games😭😭😭",
    "119": "With @ZachLaVine out @celtics acting tuff spotting 6.5 Ball and @NikolaVucevic bout to eat #Parlay",
    "120": "@celtics I swear I could coach an NBA team. And I think we all could. Other than Popovich or Kerr, what is a coach really bringing?\n\nIt’s clearly not individual skill development. \n\nBall movement on offense! Quicker rotations on defense! \n\nLate game inbound play.\n\nDone.",
    "121": "@KeithSmithNBA And will still blow the @celtics out!!",
    "122": "@celtics Going to have to be man enough to bench Tatum and Brown if you want that ball to move!!! Smart to!! Want in one hand and you know! Be a coach not a buddy only.",
    "123": "@terryjt1 @celtics It is a two bigs thing because Al and Rob can’t space the floor together, and if we move Al to the bench Enes wouldn’t have to get any minutes.🤷🏽‍♂️",
    "124": "@celtics You are not doing anything to help them move the ball, we have zero offense plan other than double high screen for mismatch, its so predictable and bad",
    "125": "Consensus Line Move:\n2022-01-15 Chicago Bulls at Boston Celtics from -6.50 to -7.50\n#BleedGreen  almost there\n#NBA #gambling #ai #millionaire",
    "126": "@celtics Ya don’t say!!!",
    "127": "@terryjt1 @celtics Al has been a disappointment that’s why💯 we want him moved to the bench now.",
    "128": "@celtics Get buddy",
    "129": "@celtics Fire him please",
    "130": "@celtics Nah really? The coach wants the players to do better?",
    "131": "@celtics This guy is all talk as if he isn’t the COACH!",
    "132": "@celtics Maybe implement a lineup that can knock down shots then. If only we had a 40% 3 point shooter on our team...",
    "133": "@celtics give sam hauser a chance",
    "134": "🔴Live ~ Chicago Bulls vs. Boston Celtics - NBA League 2022 2022 💯\n📅 : 15 January, 2022📌\n⏰: 8:30 PM📌\n▼F̾oͦl̾l̾oͦw▼ 🔗Link 🌐 ⭆ https://t.co/uFggnj700s✅✅",
    "135": "@celtics much easier when we are playing less talented teams as well",
    "136": "@celtics play nesmith and romeo more",
    "137": "@celtics start pritchard",
    "138": "@celtics get rid of double bigs",
    "139": "Coach Udoka says he wants us to get back to moving the ball like we did Wednesday in Indiana: “When the ball moves, we’re a different team, much easier for our guys to get going.”",
    "140": "@celtics @Patriots Psalms91",
    "141": "Boston Celtics: Chicago #Bulls at Boston #Celtics odds, picks and prediction - USA TODAY Sportsbook Wire https://t.co/bpOyT8bDpo",
    "142": "@celtics @BBW_Candi @jaytatum0 Brown deserves it more imo",
    "143": "@celtics @celticsblog @jaytatum0 Wait don’t you need to use the hashtag??",
    "144": "@celtics @jaytatum0 He won't get my vote.",
    "145": "@celtics @elitejaylen @jaytatum0 STOP TAGGING THEM YOU NEED TO USE THE HASHTAG WITH THEIR NAME OR NONE OF THESE COUNT",
    "146": "@ctsbulls @chicagobulls @celtics @670TheScore @Audacy I still haven’t done a game in Boston, and it will be at least one more season.  I’ve heard about the visiting radio broadcast location but have never seen it until now!",
    "147": "@celtics @jaytatum0 Jaylen is better",
    "148": "@NHLBruins @Patriots @celtics too for the hat trick!",
    "149": "@PabloRiveraNc @celtics Him or Brown. Sad.",
    "150": "@AshabMannan18 @WillUmmmm4479 @celtics @jaytatum0 @FCHWPO Why not? Fans only vote 50%",
    "151": "@WillUmmmm4479 @celtics @jaytatum0 @FCHWPO bro its impossible that he makes it",
    "152": "@WillUmmmm4479 @celtics @jaytatum0 @FCHWPO it’s crazy",
    "153": "@celtics @jaytatum0 Don’t forget #JaylenBrown for #NBAAllStar",
    "154": "@celtics @jaytatum0 Damn no love for @FCHWPO ?? Lol",
    "155": "@celtics @jaytatum0 Imma be real none of our players should be all stars this year sadly",
    "156": "@celtics @jaytatum0 Do this for Jaylen Too",
    "157": "Boston Celtics: Chicago #Bulls at Boston #Celtics odds, picks and prediction - USA TODAY Sportsbook Wire https://t.co/H60yugktiF",
    "158": "@celtics @jaytatum0 No thanks. Doesn’t deserve it honestly",
    "159": "Only one week left to vote for @jaytatum0 ⭐️\n\nRT to cast your vote #NBAAllStar https://t.co/QSBuTAhQTX",
    "160": "@celtics can we have the patriots on the Jumbotron ALL NIGHT???? #daddymac",
    "161": "@Hoophall @ArtisGilmore53 @RealABAleague @NBA @chicagobulls @spurs @celtics Hey @JuliusErving, check out this podcast featuring @ArtisGilmore53 who shared a story about you.",
    "162": "Looking for a value bet?  See if the Chicago Bulls-Boston Celtics Predictions and Preview for 1/15/2022 is one in our preview.  No crazy hype just a prediction and preview. #Sportsbook #Picks https://t.co/ldlK6N23NH",
    "163": "@sammydabber @DanKelley66 Ok 😂 @celtics @NBCSCeltics they even know he stinks two teams got rid of him after Miami .",
    "164": "Balanced effort leads to a win streak: 10 Takeaways from Boston Celtics-Indiana Pacers\nhttps://t.co/tif9WI3mj4\nhttps://t.co/tif9WI3mj4",
    "165": "@celtics Tonite bulls. Only thing I hope play with some confidence and heart at least.",
    "166": "@Hoophall @ArtisGilmore53 @RealABAleague @NBA @chicagobulls @spurs @celtics Hey @DanIssel44, check out this podcast featuring your former teammate @ArtisGilmore53 who shared some stories of you.",
    "167": "@celtics @Patriots Don’t rub your bad luck on the Patriots please",
    "168": "@Hoophall @ArtisGilmore53 @RealABAleague @NBA @chicagobulls @spurs @celtics Hey @Rick24Barry, check out this podcast featuring @ArtisGilmore53 who shares a few stories about you.",
    "169": "Who will bounce back tonight? Don't miss @IamDrewNorton's preview of tonight's Chicago Bulls vs Boston Celtics matchup. https://t.co/9zTe5TKBEJ #NBA #BleedGreen #BullsNation",
    "170": "Boston Celtics Predictions and Preview for 1/15/2022 hosts Chicago Bulls.  Looking for betting action?  Find out if there is any value in our preview. #Sportsbook #Picks https://t.co/ldlK6N23NH",
    "171": "@celtics @chicagobulls @NBCSBoston @1057WROR @7ate9bakery Die hard Celtics fan, but nah not tonight! Not worth a watch even if Pat's weren't playing truthfully... fucking dumpster fire of a season https://t.co/5J5N2GLuuS",
    "172": "Boston Celtics: WATCH: What kind of trades should we expect from the Boston #Celtics at the trade deadline? https://t.co/PQFWy3WMEG",
    "173": "Chicago Bulls vs. Boston Celtics: Betting odds and prediction (Pippen Ain't Easy)\n\nIn the back end of back-to-back games, second-year head coach Billy Donovan and the Chicago ...\n\nAdd your highlights:\nhttps://t.co/PS0aUPjOio\n #ChicagoBulls #NBA",
    "174": "Back BOSTON CELTICS to BEAT Chicago Bulls tonight in the @NBA (Game Starts at 01.40 GMT) #NBA #Basketball",
    "175": "@YahooSportsNBA @celtics Nah Brandon Ingram's better 😂",
    "176": "Do you like @JtheBizDev trade? \n\n#hoopspaces #SoyouthinkYoureAGM #fanspo #bostonceltics #nbatwitter",
    "177": "@AndrewDoxy Hell yes @celtics, do it, do it NOW",
    "178": "Never say die attitude of Chicago Bulls is up against Boston Celtics to create magic on-screen in NBA season 21-22. Licensed teams’ merchandise including New Era Hats, Mitchell &amp; Ness jerseys, tank tops, hoodies and jackets belong to U @topsandbottoms.\n\n#chicagobulls #nbafinals https://t.co/oTTyWHKG43",
    "179": "@tdgarden @celtics My first Causeway Day, can’t wait for game 2! You guys should do ticket packs for these with Sports Museum tours between games or something. \n\nBut also you should probably actually enforce masks.",
    "180": "🔴Live ~ Chicago Bulls vs. Boston Celtics - NBA League 2022 2022 💯\n📅 : 15 January, 2022📌\n⏰: 8:30 PM📌\n▼F̾oͦl̾l̾oͦw▼ 🔗Link 🌐 ⭆ https://t.co/2AHFUrUsAu✅✅",
    "181": "@ChaseRiceMusic @fenwaypark @TheGarden @celtics @RedSox @NHLBruins @kanebrown @RestlessRoad So awesome Chase have fun be safe",
    "182": "The Philadelphia 76ers react to Matisse Thybulle taking a couple of flagrant fouls in the win over the Boston Celtics.  https://t.co/OwLp2HGmfk",
    "183": "@frostybias @joanneborzakian @finedayforabeer This one: Unfinished Business: On and Off the Court With the 1990-91 Boston Celtics https://t.co/rOi7R5xYWn",
    "184": "@tdgarden @celtics We will be there. 2 Australians who live in the middle east! Can't wait",
    "185": "🏒 ➡️ 🏀\n\nIt’s time for our favorite part of doubleheader days: the changeover! Lucky to have the best bullgang in the biz. See you soon, @celtics fans! \n\n#TDGarden | #BleedGreen https://t.co/MlOD8Z16AN",
    "186": "@SLAMonline @celtics Tobias is definitely work",
    "187": "Do you like @lelaker6 trade ? \n\n#hoopspaces #SoyouthinkYoureAGM #fanspo #bostonceltics #nbatwitter",
    "188": "@BasedJace_ @celtics @Patriots Facts",
    "189": "Do you like @TawkNyce trade ? \n\n#hoopspaces #SoyouthinkYoureAGM #fanspo #bostonceltics #nbatwitter \n\n@ReesRebel31 @carlam0nique @V3theJupitarian",
    "190": "@celtics @Patriots YESSIR",
    "191": "@tdgarden @kanebrown @ChaseRiceMusic @celtics @NHLBruins Worst survivor player ever Chase rice",
    "192": "@gswbrasil2022c1 @celtics @chicagobulls @NBCSBoston @1057WROR @7ate9bakery Dawg....",
    "193": "Report: Boston Celtics reached out to Suns’ to trade for Jalen Smith, with Dennis Schroder the likely offer https://t.co/nFYuCi7xtb #sports #feedly",
    "194": "@celtics @chicagobulls @NBCSBoston @1057WROR @7ate9bakery Ratio pats play",
    "195": "@BryanEscalera @nathans_637 @taylorcsnow @celtics He’s finally be blaming himself more as of late. Seen some quotes from him. Still believe he can be better with a more rounded roster also gotta give the man time since he a rookie coach. But definitely some blame gotta be on him right now",
    "196": "Do you like @mrmess trade ?\n\n#hoopspaces #SoyouthinkYoureAGM #fanspo #bostonceltics #nbatwitter \n@ReesRebel31 @carlam0nique @V3theJupitarian",
    "197": "@celtics @Patriots Focus on yourself guys",
    "198": "@rondo9534 @nathans_637 @taylorcsnow @celtics Ime is trash, plays the second slowest pace in the league, uses a slow big as a PF\n\nLogic dies with that man. He stoll believes its not him, its that they need more time",
    "199": "Boston Celtics: #Celtics Notebook: Boston's youth flashes talent against 76ers, zone defense and Payton ... https://t.co/GtwYTUBGhG",
    "200": "@ChaseRiceMusic @fenwaypark @TheGarden @celtics @RedSox @NHLBruins @kanebrown @RestlessRoad You must be proud of yourself, such a fantastic experience to play at the Garden, well done🔥",
    "201": "PLEASE @celtics GET THIS ONE 🙏🏻 https://t.co/y1VwrishxQ",
    "202": "@moha87261076 @celtics @chicagobulls @NBCSBoston @1057WROR @7ate9bakery No bro",
    "203": "@celtics @Patriots Welp, the bad luck is coming smh",
    "204": "Chicago Bulls at Boston Celtics  Game #44    1/15/22 https://t.co/kMFPnIHdpb https://t.co/t8QM0fU3Fm",
    "205": "@ChaseRiceMusic @fenwaypark @TheGarden @celtics @RedSox @NHLBruins @kanebrown @RestlessRoad AWESOME 🍀 CELTICS AND CHASE RICE ROCK 🔥",
    "206": "@Donnelly56D @ALXJOFU @celtics Sure I just don’t see it happening midseason. Probably the biggest move they make will be a Dennis trade",
    "207": "@celtics @Patriots OH YEAH!!",
    "208": "@nathans_637 @taylorcsnow @celtics Exactly. At this point why not just give him a try just to see what he can do. Need that shooting out there for this team",
    "209": "@rondo9534 @taylorcsnow @celtics Hits 9 threes but can’t sniff the court on a team that needs shooters 😂",
    "210": "@NickDePaula @jaytatum0 @celtics @ESPNNBA @boardroom @TheUndefeated @Jumpman23 The best",
    "211": "@celtics @Patriots Go bills",
    "212": "Can we get ride of Al hofford too he not worth the squeeze @celtics",
    "213": "@jaytatum0 Did you forget you had this video on YouTube still 🤣😂🤣. @celtics @FCHWPO @smart_MS3 @NBCSCeltics @rob_williamsIII  TIE A TIE https://t.co/dCTvJm6Oo6 via @YouTube",
    "214": "@celtics @chicagobulls @NBCSBoston @1057WROR @7ate9bakery Bulls by 64",
    "215": "@celtics @chicagobulls @NBCSBoston @1057WROR @7ate9bakery Bunch of bums..Salute to Rob Williams for allways playing HARD even if he does get hurt often. At least he plays with HEART unlike our star players",
    "216": "@taylorcsnow @celtics why tf don’t we try to actually play this guy man smh",
    "217": "@ChaseRiceMusic @fenwaypark @TheGarden @celtics @RedSox @NHLBruins @kanebrown @RestlessRoad Love it!!",
    "218": "Big night for New England sports. Let’s go @Patriots @celtics and @CalvinKattar ! #ForeverNE #BleedGreen #UFCVegas46 https://t.co/aZUlJktsBs",
    "219": "@espn_macmahon @wojespn @celtics let’s make it happen",
    "220": "Boston Celtics: Chicago #Bulls at Boston #Celtics: Lineups, injury reports and broadcast info (1/15) - #Celtics Wire https://t.co/KqW0TH96Vd",
    "221": "@celtics Yikes.",
    "222": ".@celtics learn. https://t.co/LkIH1cbBCQ",
    "223": "Consensus Line Move:\n2022-01-15 Chicago Bulls at Boston Celtics from 215.50 to 214.00\nUnder driving the market\n#NBA #bettingadvice #programmer #financialfreedom",
    "224": "Out there somewhere is a fan of Manchester United and Boston Celtics, we are struggling",
    "225": "@celtics @chicagobulls @NBCSBoston @1057WROR @7ate9bakery STATEMENT Saturday!!!",
    "226": "Do you like @ahmedalokailyy trade ? \n\n#hoopspaces #SoyouthinkYoureAGM #fanspo #bostonceltics #nbatwitter \n@ReesRebel31 @carlam0nique @V3theJupitarian",
    "227": "@celtics @chicagobulls @NBCSBoston @1057WROR @7ate9bakery Both my teams play at the same time tonight. Double pain?",
    "228": "@celtics @ogtacosauce @Patriots man y’all need it more than them",
    "229": "Joe Burrow and Ja'Marr Chase is what @celtics fans thought they were getting with Ron Mercer and Antoine Walker. #BleedGreen",
    "230": "If the Boston Celtics split up Jaylen Brown and Jayson Tatum that would be galatically stupid https://t.co/u76qk9JAUz",
    "231": "🔴[LIVE'STREAM] ~ Chicago Bulls vs. Boston Celtics - NBA Basketball 2022\n🔴Broadcast Link !! https://t.co/HOFB1AFGNB ✅\nDate : On Saturday. January 15 /2022\nTime : 8:30 PM",
    "232": "Do you like @Lyfe_Hoop trade ? \n\n#hoopspaces #SoyouthinkYoureAGM #fanspo #bostonceltics #nbatwitter  @ReesRebel31 @carlam0nique @V3theJupitarian",
    "233": "Do you like @mrmess trade ? \n\n#hoopspaces #SoyouthinkYoureAGM #fanspo #bostonceltics #nbatwitter  @ReesRebel31 @carlam0nique @V3theJupitarian",
    "234": "@celtics @chicagobulls @NBCSBoston @1057WROR @7ate9bakery Dont put Schroder on this",
    "235": "@celtics @Patriots Please put the game on the Jumbotron!",
    "236": "What's #Best today on https://t.co/VfZu3jgOen ?\nTyrese Maxey Teases Joel Embiid's 25 Pts not Enough In Win Over Celtics : Nba On Espn\nhttps://t.co/bFIi0xZ9OT\n#sports #bostonceltics",
    "237": "@celtics @Patriots We don’t say good luck 🍀 we say Good Hunting!! 🦬",
    "238": "Do you like @HoopSpaces trade ? \n\n#hoopspaces #SoyouthinkYoureAGM #fanspo #bostonceltics #nbatwitter \n@ReesRebel31 @carlam0nique @V3theJupitarian",
    "239": "Report: Boston Celtics reached out to Suns’ to trade for Jalen Smith, with Dennis Schroder the likely offer #Ya... https://t.co/JKrlZTuRcY",
    "240": "@celtics @chicagobulls @NBCSBoston @1057WROR @7ate9bakery Watching this team reminds me of the time I accidentally slammed my penis in my car door - extremely painful, makes me vomit and feels like some sort of punishment from God for having such a large member.  Can’t wait for Stevens, Tatum, Brown, Smart and Al to leave town.",
    "241": "Do you like @SpeakOnItRolo trade ? \n\n#hoopspaces #SoyouthinkYoureAGM #fanspo #bostonceltics #nbatwitter \n@ReesRebel31 @carlam0nique @V3theJupitarian",
    "242": "@celtics @elite_hockey72 @Patriots No Jayson Tatums team go giants! 😡😡😡",
    "243": "Boston Celtics Daily Links  1/15/22 https://t.co/JEAdO3DSTv https://t.co/mUggpwRCCB",
    "244": "@celtics @Patriots You got this pats just play the game and win mac don’t play like last game or we lose",
    "245": "Milwaukee Bucks - Toronto Raptors\nWashington Wizards - Portland Trail Blazers\nBoston Celtics - Chicago Bulls\n\nBet slip link: https://t.co/ITZXUjZxFl https://t.co/oKBr3WeQyr",
    "246": "Do you like @BronWick23 trade? \n\n#HoopSpaces #SoYouThinkYoureAGm #fanspo #nbatwitter  #BostonCeltics #twitterspaces @ReesRebel31 @carlam0nique @V3theJupitarian",
    "247": "@celtics @Patriots Boston strong 🍀🍀🍀",
    "248": "Women talking sports !! 🔥🔥  #SoyouthinkyoureaGM #HoopSpaces #BostonCeltics https://t.co/Hoflr21Ke0",
    "249": "@celtics @chicagobulls @NBCSBoston @1057WROR @7ate9bakery Nobody is watching Celtics tonight,  let's go Pats!",
    "250": "Boston Celtics lost..\nChelsea lost..\n\nOnly The Patriots can redeem my honour #ForeverNE",
    "251": "Chicago Bulls: Chicago #Bulls vs. Boston #Celtics Odds &amp; Pick: Back Boston Over Zach LaVine-Less Chicago https://t.co/2opzWxKwvW",
    "252": "Chicago Bulls: Boston #Celtics vs. Chicago #Bulls prediction, odds, TV channel - Hardwood Houdini https://t.co/T2eczugg4v",
    "253": "@celtics @Patriots Oh damn we def losing now",
    "254": "@celtics @Patriots thx means a lot hope y’all make playoffs too",
    "255": "@celtics @Patriots The pats don't need that unlucky luck Celtic.😏",
    "256": "Chicago Bulls: Chicago #Bulls vs Boston #Celtics 1/15/22: Starting Lineups, Matchup Preview, Betting Odds ... https://t.co/Cu2KllGDjD",
    "257": "Boston Celtics: Jaylen Brown Trade Rumors: #Celtics Aren't Considering Moving Star SF - Bleacher Report https://t.co/AL6JzW5xy7",
    "258": "Report: Boston Celtics reached out to Suns’ to trade for Jalen Smith, with Dennis Schroder the likely offer https://t.co/PKYFQJ2i6C",
    "259": "Joel Embiid led the Philadelphia 76ers past the Boston Celtics at home to bounce back from a bad loss.  https://t.co/bhyWOlcGAR",
    "260": "WATCH: Is there a market to trade for veteran Boston Celtics guard Dennis Schroder? #YahooSports #NBA https://t.co/qf6pv7g3X2",
    "261": "@celtics @Patriots wish yourselves some luck man",
    "262": "@celtics @Patriots From garbage team to garbage team with this message",
    "263": "@celtics @chicagobulls @NBCSBoston @1057WROR @7ate9bakery Please tell me who in New England / Boston is actually going to watch this game?!",
    "264": "@Melinda_paints @NHLBruins @celtics @Patriots Hallsy with the winner in OT!!!",
    "265": "@celtics @Patriots If they loose it’s because of this post",
    "266": "@STR8Homah @NHLBruins @celtics @Patriots My phone died in all the hullabaloo! 😮😆😆😆😆",
    "267": "🍀 Match 41 🍀 \n\n📈 : 27-13\n⛹️‍♂️ : Boston Celtics (21-22)\n🏟 : TD Garden\n⏰ : 02H30 🇫🇷 \n🏥 : Patrick Williams, JaVonte Green, Alex Caruso, Derrick Jones Jr, Tyler Cook, Lonzo Ball, Zach LaVine, Benny The Bull, Cuppy Coffee, Dashing Donut et Biggie Bagel.\n📺 : NBA League Pass https://t.co/zAg2pluao7",
    "268": "@celtics @Patriots Go Bills",
    "269": "@NHLBruins @celtics @Patriots 1st game done!!! #NHLBruins WIN!!!\nhttps://t.co/P0Of94sK8N",
    "270": "Okay now it’s your turn to win @Patriots @celtics",
    "271": "@badbengal12 I’m a Boston fan so cool that you retweeted the Boston Celtics",
    "272": "Boston Celtics: Joel Embiid's streak ends, but Sixers top #Celtics | Inquirer Sports https://t.co/a5OpuHRIJR",
    "273": "Lose tonight @celtics. I fucking dare you https://t.co/qnIYo2ZCPi",
    "274": "@elitejaylen @celtics @Patriots A phot that shows Autism ?",
    "275": "@angerboston @salimdagod @celtics Agreed, anyone still defending this team just plain doesn't know Hoops, problem is Tatum and Brown are grossly overrated, they just aren't as good as we think they are, We need to get rid of Smart and that Joke Max contract we gave him,  Smart most overrated player in NBA",
    "276": "@celtics @Patriots Sorry they don’t need your luck. Your luck can’t even bail out your own team",
    "277": "@facevesd @celtics @Patriots @soloarii We are going to roast the bills for dinner.",
    "278": "@celtics @Patriots Rare W",
    "279": "WATCH: Is there a market to trade for veteran Boston Celtics guard Dennis Schroder? https://t.co/2DapxFPb8h",
    "280": "@celtics @Patriots We got the luck of the Irish ☘️",
    "281": "@RipKoreem_ @celtics @Patriots Buddy,what are you a bills fan because I think there going to be cooked for dinner.",
    "282": "@celtics @Patriots LFG!\nBest of luck to us today🤞🤞🤞\n#BostonStrong",
    "283": "@celtics dc, we’re watching the Pats tonight🥱🥱",
    "284": "@celtics @Patriots Yall were supposed to be THE team in Boston after Brady left, but still can't pick up the slack. Patriots won 3 SBs since the last time yall won a chip. Now we're watching the Pats go for another one again. Cmon Celtics 🤦‍♂️",
    "285": "@celtics @Patriots Go Pats #ForeverNE https://t.co/cucr5RSiHB",
    "286": "@celtics @Patriots @soloarii lets go BillsMania",
    "287": "@dirtyaIbanian @celtics @Patriots LMAOO",
    "288": "@celtics @Patriots ratio",
    "289": "@celtics @Patriots Mac worse than Tatum tbh",
    "290": "@celtics @Patriots great now they’re gonna lose",
    "291": "@LeJobless6 @celtics @Patriots @dallascowboys Ratio me",
    "292": "@MrBeastBurner1 @celtics @Patriots @dallascowboys Ratio",
    "293": "@celtics @Patriots Let's go @dallascowboys",
    "294": "@celtics @Patriots They suck",
    "295": "@celtics @Patriots LETW GOOOOO 😈😈😈",
    "296": "@celtics @Patriots Only team to root for now",
    "297": "@sebastiansas04 A new York solo Boston Celtics",
    "298": "Let’s go @patriots 🏈☘️ https://t.co/g7wk0QacgX",
    "299": "Anytime now @BCCoachStevens @mikezarren @celtics https://t.co/lSFNDhuQbO",
    "300": "ALERT: New high roller bet posted!\nA bet has been placed for $6908.65 on Boston Celtics - Chicago Bulls to win $7,437.45.\nTo view this bet or copy it https://t.co/ro6WARIOaz https://t.co/pZaL3kehFY",
    "301": "@celtics @chicagobulls @NBCSBoston @1057WROR @7ate9bakery Not one soul in New England is watching this bore of a team over the Pats",
    "302": "Lonzo Ball is out vs the Boston Celtics tonight",
    "303": "@celtics you have no right to lose this match https://t.co/FUOt3sWUWj",
    "304": "This week on The Long Two, @bladner_ breaks down...\n\n1️⃣ Why a healthy Klay Thompson is a game-changer for the Warriors\n\n2️⃣ Why Boston Celtics are struggling so much on offense\n\nhttps://t.co/VLbUBU0NS3 https://t.co/NlrMvcP2U2",
    "305": "3 Best Destinations For De'Aaron Fox: Boston Celtics Are The Perfect Team For Him #SacramentoProud #BleedGreen #NBA #NBATwitter #NBATwitterLive #DeAaronFox\n\nRead More- https://t.co/xrJPiK1nBN https://t.co/S8MYCd79HU",
    "306": "@celtics @chicagobulls @NBCSBoston @1057WROR @7ate9bakery Another loss let's goooo",
    "307": "I am BEGGING YOU to move the ball @celtics y’all are killing me https://t.co/QA5h3NbMlc",
    "308": "@celtics @chicagobulls @NBCSBoston @1057WROR @7ate9bakery Ain’t even bothering tbh, gunna enjoy the remainder of my damn weekend! https://t.co/wN4YYnlaLo",
    "309": "@celtics @chicagobulls @NBCSBoston @1057WROR @7ate9bakery @EnesFreedom please play and win this",
    "310": "@ctsbulls @chicagobulls @celtics @670TheScore @Audacy Scrap a game plan for tonight &amp; see if these guys are playground players or AAU/Feeder players…👊🏽",
    "311": "@celtics @chicagobulls @NBCSBoston @1057WROR @7ate9bakery The Patriots are on. Idc. We’re gonna lost",
    "312": "Boston Celtics: Jayson Tatum and Jaylen Brown can't do it all on their own – NBA News https://t.co/1YwnvEwbHt",
    "313": "Ben Simmons lands with Boston Celtics in league-shifting LSL mock trade – NBA News https://t.co/EABwxIT5pd",
    "314": "Boston Celtics: Jayson Tatum and Jaylen Brown can't do it all on their own – https://t.co/xOd7lit4es",
    "315": "@celtics @chicagobulls @NBCSBoston @1057WROR @7ate9bakery You will beat The Bulls after they were embarrassed by The Warriors last night, after being embarrassed by The Nets before.\nBoston is so inconsistent, and Brad/Ime don't inspire confidence so we could expect better.\nPlaying mediocre players while others play better players = L.",
    "316": "Get your tickets to see the @celtics play the @PelicansNBA at home this Monday afternoon at 12:30! If you haven't made it to a game yet, we've got tickets starting at $10 including all fees. Check out the options we have at the link below.\n\nhttps://t.co/w7mPedAn02 https://t.co/6ROSEaGWIA",
    "317": "Man United then Boston Celtics back to back same day? https://t.co/3NyY7BVYBc",
    "318": "@ctsbulls @chicagobulls @celtics @670TheScore @Audacy Arrgh",
    "319": "@celtics @chicagobulls @NBCSBoston @1057WROR @7ate9bakery 25 point loss??",
    "320": "@celtics @chicagobulls @NBCSBoston @1057WROR @7ate9bakery Is this a threat?",
    "321": "@therealnedbrady @DanteOnDeck @celtics Right now they are asking the jays and particularly Tatum to do to much. He shouldn’t have to run the entire offense when he’s out there. He should be getting the ball in more advantageous areas where he can attack quickly or attack a rotating defense.",
    "322": "@ctsbulls @chicagobulls @celtics @670TheScore @Audacy Good grief",
    "323": "@celtics @chicagobulls @NBCSBoston @1057WROR @7ate9bakery Patriots play a playoff game",
    "324": "@celtics @chicagobulls @NBCSBoston @1057WROR @7ate9bakery why post",
    "325": "@celtics @chicagobulls @NBCSBoston @1057WROR @7ate9bakery We watching Patriots tonight I’m sorry 😞 too much pain",
    "326": "@celtics @chicagobulls @NBCSBoston @1057WROR @7ate9bakery A lot of people need to get two TVs 😂. It’s 2022!",
    "327": "@celtics @chicagobulls @NBCSBoston @1057WROR @7ate9bakery Patriots will be on. I would rather watch them down 50 then the Celtics winning.",
    "328": "@celtics @chicagobulls @NBCSBoston @1057WROR @7ate9bakery Pats on nobody cares",
    "329": "@celtics @chicagobulls @NBCSBoston @1057WROR @7ate9bakery I am watching behind the sofa 👀",
    "330": "@celtics @chicagobulls @NBCSBoston @1057WROR @7ate9bakery I can’t go through another pain like i did yesterday",
    "331": "@celtics @chicagobulls @NBCSBoston @1057WROR @7ate9bakery nobody in new england is watching this sorry 💀",
    "332": "@celtics @chicagobulls @NBCSBoston @1057WROR @7ate9bakery I think we all know what we will actually be watching tonight",
    "333": "@celtics @chicagobulls @NBCSBoston @1057WROR @7ate9bakery Reschedule or else we don’t care",
    "334": "@celtics @chicagobulls @NBCSBoston @1057WROR @7ate9bakery Pats on tonight",
    "335": "@celtics @chicagobulls @NBCSBoston @1057WROR @7ate9bakery I should wake up to a win👍🧿🧿",
    "336": "@celtics @chicagobulls @NBCSBoston @1057WROR @7ate9bakery Pats are on nobody cares",
    "337": "@celtics @chicagobulls @NBCSBoston @1057WROR @7ate9bakery win please https://t.co/d82JxPlTH1",
    "338": "@celtics @chicagobulls @NBCSBoston @1057WROR @7ate9bakery Win pls https://t.co/HxNJOWVdTW",
    "339": "@celtics @chicagobulls @NBCSBoston @1057WROR @7ate9bakery Who ready for this L",
    "340": "@celtics @chicagobulls @NBCSBoston @1057WROR @7ate9bakery Ready for pain",
    "341": "TONIGHT ☘️ Celtics vs @chicagobulls \n\n⏰ 8:30PM\n📺 @NBCSBoston\n🎙 @1057WROR \nSmall Business of the Game: @7ate9bakery \n\n#BleedGreen https://t.co/H8xd5oPHT4",
    "342": "@therealnedbrady @DanteOnDeck @celtics Barnes is definitely a good scorer. The issue is as much about trying to force Tatum and brown to be your primary initiators, something they haven’t been their entire lives. They would do much better in roles they’ve played in the past as scorers. Create more off secondary action",
    "343": "@Herrojuku @kirkgoldsberry @memgrizz @dallasmavs @Suns @MiamiHEAT @cavs @celtics wolves have had a lot of issues getting their lineup in. starting 5 best net in league, but bench scoring has fallen off. Hoping they’ll make some trades, gupta said they would be buyers at the deadline",
    "344": "The Celtics didn't do right by Tacko; he became the Fall guy for Boston's failures last season. #99 looked impressive tonight. @ChargeCLE @MaineCeltics @celtics #tackofall",
    "345": "@therechigoes waiting for woj’s “The Boston Celtics are finalizing a trade to acquire PJ Washington &amp; Cody Martin from the Charlotte Hornets” tweet to hit my notifications any day now",
    "346": "@ChicagoSportsFR @Celtics_Fra @celtics Welcome to the TD Garden ☘️ https://t.co/sx99bbQ1K5",
    "347": "@Sarge985 @celtics @tdgarden Help @GordonEdes",
    "348": "@bball4224 @TreshJason Every NBA team needs role players/different skill set guys. Look at the Boston Celtics. Having two stars doesn’t mean shit. The only thing that will fix it is if they trade one of them, then get… ROLE PLAYERS.",
    "349": "@celticspa @dsouza4717 @celtics @tdgarden BINGO!!! The voice of the C’s on the parquet knew!!",
    "350": "I have not watched a @celtics game in weeks!! They are one of the least fun teams to watch I can ever remember. I will only be watching @MarchMadnessMBB that is all. Buh-Bye @NBA https://t.co/L3aEemyxuN",
    "351": "Boston Celtics: #Celtics-76ers Takeaways: Turnovers, Brutal First Quarter Cost C's - NBC Boston https://t.co/vQQxhdy2AA",
    "352": "NBA mailbag: Should the Boston Celtics' stars be split up and other urgent trade decisions\n\nhttps://t.co/gFcXsBJDPJ\n\n@daver1819 @FRod401 @Mixmasterjay",
    "353": "Boston Celtics chart three former players on HoopsHype’s greatest international players of all time https://t.co/Ayafst1Lbh",
    "354": "@Sarge985 @dsouza4717 @celtics @tdgarden You are correct, sir!!!",
    "355": "2022-01-15\nBoston Celtics(-6.0) - Chicago Bulls(+6.0): \nBet on Boston Celtics -6.0\n\n#NBA #bettingpicks @celtics",
    "356": "Boston Celtics: Chicago #Bulls vs Boston #Celtics 1/15/22: Starting Lineups, Matchup Preview, Betting Odds ... https://t.co/6urYeVQBqn",
    "357": "Boston Celtics vs Philadelphia 76ers Full Game Highlights | January 14 |... https://t.co/gfIL6KwZq7 via @YouTube",
    "358": "@celtics We couldn’t get into flow of anything.",
    "359": "@smd5187 @EJforseen @celtics It appears they have changed their plans for him",
    "360": "WATCH: What kind of trades should we expect from the Boston Celtics at the trade deadline? https://t.co/pkmRWVK3nF",
    "361": "Chicago Bulls at Boston Celtics: Lineups, injury reports and broadcast info (1/15) https://t.co/mGD29zxn2u",
    "362": "@Vibrantankles @RyeGuy81 @tdgarden @NHLBruins @celtics Because I don’t use twitter as much as everyone else on the planet https://t.co/RgWr8qxsZh",
    "363": "@therealnedbrady @DanteOnDeck @celtics They need a lead guard that needs to be schemed for this allowing the jays to do what they do best, get to their spots , attack in transition and not be blitzed on every screen action. Barnes helps for sure in the scoring shooting aspect but for how much?",
    "364": "@wingchun521 @RyeGuy81 @tdgarden @NHLBruins @celtics There’s a reason you have only 2 followers in 8 years.",
    "365": "@wingchun521 @RyeGuy81 @tdgarden @NHLBruins @celtics You do realize that while you still can get it, the vax prevents serious illness. You are far less likely to be hospitalized, on a ventilator, or to die after being vaxed. You’re afraid of a needle but fine with this: https://t.co/XqXiIVa0bm",
    "366": "@therealnedbrady @DanteOnDeck @celtics He’s really not particularly long or athletic. Not much of a playmaker, post passer, he’s a versatile scorer, excellent shooter from the corners and a solid defender 2-4. The Celtics really need someone that can be a point of attack initiator to take the jays off the ball",
    "367": "Ghana, Boston Celtics and now this from Man U https://t.co/B0TrLl26dW",
    "368": "@SportsTacos @RKOHEELCENA @RyeGuy81 @tdgarden @NHLBruins @celtics The vaccine stops severe illness, and dying on a ventilator. If you’d rather die a torturous death because you’re afraid of a vaccine…🙄 https://t.co/5OBD7lPulW",
    "369": "Chicago Bulls vs. Boston Celtics - 1/15/22 Free Pick &amp; NBA Betting Prediction https://t.co/macgMgAcPS\n.\n#Betting #FreePicks https://t.co/o9b0UhPuc9",
    "370": "Air Jordan 1 Retro 2009 Boston Celtics High size 10 https://t.co/NfRWGbIYuU eBay https://t.co/mKlBQPxOjd",
    "371": "@sonsamadams @RyeGuy81 @tdgarden @NHLBruins @celtics Speaking of uninformed: it stops severe illness. But be like this guy. Ventilators and death are so sexy. #STUPID",
    "372": "#BullsNation Game Day!\n\n@chicagobulls vs. @celtics in Boston\n\n⏰ 7:15 pregame\n🏀 7:30 tip-off\n🎙 @ctsbulls &amp; @34billy42\n📻 AM 670, FM 104.3 HD-2\n📱 @Audacy app\n🖥 https://t.co/6pC174k6l9\n\nThe Score is your home for Bulls Basketball! https://t.co/jN5Fnxgz2m",
    "373": "@dmbseven41 @RyeGuy81 @tdgarden @NHLBruins @celtics No. You won’t be hospitalized, on a ventilator, or die. But sure, be like this guy. 🙄 https://t.co/yHGVnpZXjJ",
    "374": "The similarities between how I feel watching @ManUtd and @celtics is preposterous. Won’t feel true happiness until they win it all",
    "375": "#CelticsEspaña #CelticsNation @celtics Do your best when no one is looking. If you do that, then you can be successful in anything that you put your mind to. Bob Cousy 🍀🏀🍀",
    "376": "Being a fan of both the Boston #Celtics and #NUFC in a gif. https://t.co/ddvDKTLp6d https://t.co/TRUtnk2312",
    "377": "@celtics How was he sitting on the bench wednesday thigh contusion, and now covid, ridiculous, please tell your fans the truth.",
    "378": "@szarra27 @tdgarden @NHLBruins @celtics They are a private business. They can do whatever they want",
    "379": "Such an honor to have @Hoophall member @ArtisGilmore53 join us for Ep. 15 of \"In The Front Row\". The A-Train shares his story including 17 years of pro ball in the @RealABAleague &amp; @NBA. \n@chicagobulls\n@spurs\n@celtics\n\nVIDEO: https://t.co/CowxqbPJDP\nAUDIO: https://t.co/fqOQeCnuwO https://t.co/syDHaVGb9x",
    "380": "Boston Celtics: NBA mailbag - Should the Boston #Celtics' stars be split up and other urgent trade decisions - ESPN https://t.co/LbRVh594Fg",
    "381": "Analyzing Saturday’s Chicago Bulls at Boston Celtics and lines, with NBA expert picks, predictions and best bets.  https://t.co/W76szxtFVh",
    "382": "@therealnedbrady @DanteOnDeck @celtics And I said getting Beal is the most straightforward easy way to become a contender again. This team isn’t close as is. Your path (which is probably what they will be forced to do) is much more difficult and involves them winning 3 or more transactions to improve the roster.",
    "383": "Chicago Bulls at Boston Celtics odds, picks and prediction https://t.co/IFR773KjfM",
    "384": "Boston bound‼️ GOAT 🐐  @chicagobulls vs @celtics tonight 🏀 @ MA State line https://t.co/ICNzlowuM2",
    "385": "@therealnedbrady @DanteOnDeck @celtics Barnes is not exactly a bargain himself you know. He’s a 20 mil dollar cap hit and I’d assume his next deal will be at that much or more annually after next season",
    "386": "@ellsdown2012 @KySportsRadio He plays for the Boston Celtics. Pretty sure they are happy with him.",
    "387": "@therealnedbrady @DanteOnDeck @celtics June of 2024 precisely.",
    "388": "NBA Betting Preview and Free Play: Boston Celtics vs. Chicago Bulls https://t.co/Ea7ClgiTHN",
    "389": "@therealnedbrady @DanteOnDeck @celtics He’s a small ball 4 , he plays just as much 3 as he does 4. He’s best as a wing player. I’d prefer my 4 to be longer more athletic and a better defender than Barnes. But generally yeah he’s a small ball for. He’s not gonna give you anything you don’t have besides scoring/shooting",
    "390": "@DanteOnDeck @celtics Ill take either, but if i feel sorry for who goes to kings",
    "391": "4 takeaways from the Boston Celtics 111-99 loss to the Philadelphia 76ers\nhttps://t.co/SF7BY5lIVD",
    "392": "@Sarge985 @celtics @tdgarden Feel like Richard Johnson of the Sports Museum would know",
    "393": "@RealBobManning @boogiecousins to @celtics confirmed ;)",
    "394": "@Vibrantankles @RyeGuy81 @tdgarden @NHLBruins @celtics Can’t wait till you find out it doesn’t stop transmission.",
    "395": "WATCH: What kind of trades should we expect from the Boston Celtics at the trade deadline? https://t.co/0BJ23hI6fv",
    "396": "Currently watching the Maine Celtics they are so much fun than the Boston Celtics",
    "397": "@therealnedbrady @DanteOnDeck @celtics Brad Beal will be 31 years old in 2024",
    "398": "@Kn1ghtOfCydonia @celtics Nice one 👍",
    "399": "@CharliePye7 @celtics Yes I will be",
    "400": "Boston Celtics: BSJ Game Report: Philadelphia 76ers 111, Boston #Celtics 99 - Passive #Celtics turn the ball ... https://t.co/FM2OxSnH5w",
    "401": "#AlHorford this season for #BostonCeltics is:\n\n5⃣th in points (10,6)\n3⃣rd in rebounds (7,4)\n4⃣th in assists (3,7)\n2⃣nd in blocks (1,4)\n\n#Celics (21-22) are now 11th seed in the East and #Horford will get 27M$ for this season ...\n\n#NBAtwitter #NBAtwitterLive #NBA75 #NBAstats https://t.co/Ag6E3eAZIh",
    "402": "@dsouza4717 @celtics @tdgarden Ok. Hmmm may have to ask the great Jeff Twiss",
    "403": "@Sarge985 @celtics @tdgarden I was wondering that but in ‘69 they won in LA and in ‘08 they won at home and both are the non-solid",
    "404": "waiting for woj’s “The Boston Celtics are finalizing a trade to acquire Buddy Hield from the Sacramento Kings” tweet to hit my notifications any day now",
    "405": "@dsouza4717 @celtics @tdgarden I think but I could be wrong the solid signifies winning at home and the non solid is winning the title on the road. That’s what someone told me once but unconfirmed if that’s what it is.",
    "406": "Mission Hill and the Boston Celtics’ own Wayne Turner and the comeback Cats!  https://t.co/wO9WSkveEo https://t.co/XwsljGAvfq",
    "407": "@ctsbulls @chicagobulls @celtics @670TheScore @Audacy What time?",
    "408": "@celtics What the hell are you talking about? https://t.co/dAoRHolrLC",
    "409": "@KertyKerBear @GPDuckie @BCCoachStevens @celtics Go PATS!",
    "410": "@celtics so can I do the half court shots tonight to win season tickets?!",
    "411": "@GPDuckie @tracywine105 @BCCoachStevens @celtics Doesn’t help when them and the coach don’t seem to have the best basketball IQ, especially offensively.",
    "412": "I’m going to @ReesRebel31’s upcoming Space. Will you join too?\n#SoyouthinkyoureaGM #HoopSpaces #BostonCeltics\n\nhttps://t.co/6pc5IDo8Dy",
    "413": "Busy day/night @garden with #NHLBruins this afternoon and @Celtics #BleedGreen later tonight!",
    "414": "@celtics I'm surprised he hasn't blamed Tatum or Brown",
    "415": "Meaning @jaytatum0 and @FCHWPO @celtics don't play a Team style of basketball, even Stevie Wonder could guard them. Iso &amp; Turnovers.  They are predictable and Ime sucks as a coach. I hate that Brad Stevens isn't coaching this Team and I feel like he will give Ime time. Sigh https://t.co/Hagzr1J9OV",
    "416": "Boston Celtics: Player Observations Following Sixers' Dominant Win Over Boston - Sports Illustrated https://t.co/DRR2EfbsH3",
    "417": "@celtics Advantage Celtics",
    "418": "@tracywine105 @KertyKerBear He hasn’t been great, it happens! He’s got to work through it and he will. But in the mean time get them some freaking help @BCCoachStevens and @celtics you cheapskates😤",
    "419": "Chicago Bulls at Boston Celtics: Lineups, injury reports and broadcast info (1/15) https://t.co/5lKpGCJKmW",
    "420": "@celtics traspasen a Tatum https://t.co/vQeVI9BjI8",
    "421": "@nickbicycle @celtics Yup wide open because Tatum draws multiple defenders almost all the time  shame they don't build around him already",
    "422": "@celtics let's try some small ball tonight. More Langford and Nesmith. Al as backup 5. Pritchard some more minutes. Please.",
    "423": "Boston Celtics: #Celtics go down early and never come back in 111-99 loss to Sixers - 98.5 The Sports Hub https://t.co/mOg2c5WbE6",
    "424": "Boston Celtics: Chicago #Bulls vs Boston #Celtics 1/15/22: Starting Lineups, Matchup Preview, Betting Odds ... https://t.co/ZzhePrMJXn",
    "425": "@celtics Worst coach in the league",
    "426": "Todays a good day to win @celtics @Patriots @NHLBruins",
    "427": "Can't believe I'm saying this but go @celtics \n\n#HEATCulture #HeatTwitter https://t.co/jEmI6Rt3Fe",
    "428": "Hey @celtics @tdgarden why is the NBA logo in the Celtics banners different some years (57&amp;84 vs 64-68)??? https://t.co/4uzUmfysQ1",
    "429": "@celtics Trade Tatum",
    "430": "@celtics Please get a center (@KarlTowns preferably) and a point guard (@DejounteMurray), I can’t do another season like this. https://t.co/mOL7p2OfZI",
    "431": "@tdgarden @NHLBruins @celtics Double the stupid rules to attend 🤷‍♀️",
    "432": "@Kn1ghtOfCydonia Are you going to see @celtics as well☘️",
    "433": "@STR8Homah @NHLBruins @celtics @Patriots Well said my friend!",
    "434": "@cardboardicons @celtics @Patriots @RedSox @NHLBruins  every time",
    "435": "@celtics Gross",
    "436": "@celtics post a good luck tweet to the pats or your social media account is worse than the red sox",
    "437": ". @celtics this season https://t.co/OY7GVeKtEz",
    "438": "@bmotheprince @AnnaHorford In what way? I addressed you, not her. Philly lives rent free in her head for the rest of her life. Just like Joel is the new owner of the Boston Celtics. Facts are facts.",
    "439": "The Philadelphia 76ers praise Matisse Thybulle for his defense in a win over the Boston Celtics.  https://t.co/OSzl3nqarm",
    "440": "@celtics What Ime said means: time to tank!",
    "441": "@KrysYTOfficial @tdgarden @NHLBruins @celtics People that trust Big Pharma clearly don’t have a clue hundreds of thousands have died as a results of their drugs in the past 25 years. Sad so many uninformed.",
    "442": "@tdgarden @NHLBruins @kanebrown @ChaseRiceMusic @celtics Is this the #Bruins counter to Kodak Black?",
    "443": "@tdgarden @NHLBruins @celtics No Garden events for our friends and family. The jabs don’t stop the spread. It’s a scientific fact.",
    "444": "@RedSox @Patriots LET’S GO PATS!\n@NHLBruins @celtics join in the fun!",
    "445": "@philly248 @celtics You must be smoking the good stuff! 🤣",
    "446": "This how you know @celtics front office failing us https://t.co/m6vCHyI12C",
    "447": "@AProskauer @Donnelly56D @celtics So trade him. I still don’t see why that precludes them from moving Smart. Especially for a PG. They aren’t winning anything this year anyways.",
    "448": "🚨@NHLBruins @celtics &amp; @Patriots Play today🚨\nSports are a HUGE thing in our house. Brings us together with common goals. Have fun &amp; win. We ALWAYS have fun &amp; have done a LOT of winning. No matter what happens, I'm thankful for our sports.\n#ForeverNE #NHLBruins #BleedGreen https://t.co/aGkwVy4dbw",
    "449": "Boston Celtics: Boston #Celtics at Philadelphia 76ers: Stream, lineups, injury reports and broadcast info (1/14) https://t.co/bpOyT8bDpo",
    "450": "@DanteOnDeck @celtics bring 2 players from 10th place west team thinkn they gon help us . why is their team in 10th? buddy heild even play defense",
    "451": "@ALXJOFU @Donnelly56D @celtics They lose an asset by not trading him",
    "452": "Boston Celtics: Embiid has 25 points and 13 rebounds, 76ers beat #Celtics - Boston 25 News https://t.co/H60yugktiF",
    "453": "@AProskauer @Donnelly56D @celtics Why are they losing an asset by trading Dennis? They aren’t. Plenty of teams want him.",
    "454": "@Donnelly56D @celtics They just extended him, it’s not happening at least during the middle of this season. And given that they basically have to trade Dennis at the risk of losing an asset they aren’t gonna trade Smart too and end up with Pritchard as the only PG on the roster",
    "455": "@celtics Celts should be rested and ready to go tonight since they took the last game off.",
    "456": "Freeze VIP FULL CARD 1/15\nA lot of chalk!!\n\n3U Blackhawks ML -150\n3U Portland University +7.5 -140\n2U Bengals/Bills ML parlay +102\n2U Boston Celtics -4.5 -140\n2U Maryland ML -200\n1.5U Georgia Southern +10 -140\n1U Brandon Royval -170\n\nGo big today. Run this up and let’s cash $$$",
    "457": "Boston Celtics legend, Bill Russell sending a message to his producer in 1983.\n\nThis photo and scores of other classic NBA photos available here from Steve Lipofsky, the original photographer as prints, canvases and for editorial use. https://t.co/0ESgdgoeEo https://t.co/9Oz9uI7qNS",
    "458": "8. CANCEL season tickets to @RedSox @NHLBruins @celtics . DO NOT watch them on TV. @MayorWu has decided professional athletes are exempt from these mandates. Do not entertain their bread &amp; circuses. #BoycottBoston",
    "459": "@LeJobless6 @celtics the problem is… we cant keep a lead",
    "460": "From what I saw last night Jaylen Brown is obviously the problem with @celtics. And they should trade him to @sixers for an elite facilitator.",
    "461": "@therealnedbrady @DanteOnDeck @celtics I like Barnes, but all he does for you is takes us from a push over first round exit to a feisty first round exit. And if that’s for two firsts and a young wing I’m out",
    "462": "@Donnelly56D @lllLockzzlll @celtics Exactly! They are a sub 500 team.  Gotta make moves.",
    "463": "@celtics Derozan dropping 87 as revenge for boston taking out toronto",
    "464": "@celtics Good thing I’m watching the pats tn and don’t have to watch this",
    "465": "@celtics Play Pritchard,  what's the worse could happen",
    "466": "Boston Celtics: Player Observations Following Sixers' Dominant Win Over Boston - Sports Illustrated https://t.co/PQFWy3WMEG",
    "467": "@therealnedbrady @DanteOnDeck @celtics The only obvious path to building a contender is Beal choosing Boston and thus gets traded here for a reasonable return.",
    "468": "@0fficialKodak @celtics They don’t have LaVine and we showed that if we can keep a lead we can win",
    "469": "@Donnelly56D @celtics It’s not happening lol",
    "470": "@celtics Good thing we have the Pats tonight",
    "471": "@therealnedbrady @DanteOnDeck @celtics Depends what you have to give up. Barnes is a professional scorer for sure, he’s ok defensively, he’s not anymore of a playmaker than anyone we have and he’s not particularly well suited as a 4 in terms of versatility. He’s an upgrade but what’s the cost?",
    "472": "@celtics PAIN",
    "473": "\"[Forsberg] Celtics rookie Jayson Tatum on the court as practice opens in Waltham.\"\n\nhttps://t.co/nOa369joqJ\n\n[via r/bostonceltics Jan 15, 2018 #Celtics]",
    "474": "@Donnelly56D @celtics marcus is the heart of out team",
    "475": "@celtics Pain.",
    "476": "@celtics Pain please be back fast",
    "477": "@celtics should i buy tickets to this game or jus watch the pats game?",
    "478": "@Crandal16196062 @celtics You mean Turnover Tatum",
    "479": "@celtics We benching Tatum?",
    "480": "@celtics We SHOULD win all of these.",
    "481": "@celtics \"don't worry, we have Dennis!\" https://t.co/bo4WexWbGk",
    "482": "@celtics Who cares it’s playoffs tonight\n\n#Fuckjoshallen",
    "483": "@celtics Just win plz",
    "484": "@celtics this is gonna be a rough game",
    "485": "@celtics Lonzo going for 60",
    "486": "@celtics Take my immune system @smart_MS3",
    "487": "@celtics Pain",
    "488": "@celtics oh brother",
    "489": "#NEBHInjuryReport vs Chicago:\n\nMarcus Smart (Health &amp; Safety Protocols) - OUT",
    "490": "In a couple of hours I get to watch a couple of future college superstars and hopefully some future Boston Celtics and that is very exciting to me ‼️",
    "491": "For once, Embiid was right! Get out of here, Uduka。@celtics @celtics_stats https://t.co/55gp17Mjse",
    "492": "@tdgarden @NHLBruins @celtics Absolute bullshit.",
    "493": "@jaywanld @phillydrilz @CatfishMiller @celtics Sixers beat a solid Nets lead by Dlo in 2019, a shitty wizards team last year and a solid 2018 Heat team. However, your C’s got their backs blown out by a “sad” sixers team in your own words. You guys suck, hope the Pats play well this week 😭",
    "494": "@theCyberZon @JayDaThunderFan @celtics @sixers @NBCSBoston @985TheSportsHub Bro was right 😭",
    "495": "@DanteOnDeck @celtics Swing em both pronto",
    "496": "NBA mailbag: Should the Boston Celtics' stars be split up and other urgent trade decisions - via @ESPN App.  #NBA.  https://t.co/V1RrgM1kES",
    "497": "@TheTraeYoung COME PLAY AT BOSTON CELTICS PLEASE",
    "498": "Just over an hour until tip from the Portland Expo…and Tacko is in the house.  Tickets are still available.  @MaineCeltics vs @ChargeCLE at 1p on @NBCSBoston. @celtics @nbagleague @nba https://t.co/Nvf0JndrdA",
    "499": "Boston Celtics vs. Chicago Bulls prediction, odds, TV channel (Hardwood Houdini)\n\nThe Chicago Bulls will be coming in at far from full strength to the TD Garden tonight as th...\n\nAdd your highlights:\nhttps://t.co/g42edK4Dyr\n #ChicagoBulls #NBA",
    "500": "@Vibrantankles @Clangs52 @tdgarden @NHLBruins @celtics All night and morning and still no answer? SCiEncE",
    "501": "@BOLTEDBABY San Diego Padres, Boston Celtics, USC, Gonzaga and this season getting more into hockey and going for the Las Vegas Knights",
    "502": "@celtics your boy Schroeder is a fucking clown.",
    "503": "@therealnedbrady @DanteOnDeck @celtics Takes them from 9 seed to maybe a 7 seed. Doesn’t make them a contender by any means. The guards are as much of an issue as anything else. Like I said I’m all for bolstering the roster but I’d look for younger guys, distressed assets or low cost vets for this year",
    "504": "@celtics This team is mentally weak. Saying that Jaylen Brown is untradeable is a joke. Seen this movie over and over. Get rid of Brown.",
    "505": "@theCyberZon @celtics Asking for a lot there 🥴",
    "506": "@BrendanGlasheen @celtics courtesy like",
    "507": "Boston Celtics: Sixers Beat #Celtics to Take 2-1 Lead in Season Series | At The Buzzer https://t.co/GtwYTUBGhG",
    "508": "@tdgarden @NHLBruins @kanebrown @ChaseRiceMusic @celtics Wicked cool! #massholes",
    "509": "@TheyCallMeJL_94 @Nolan51266499 @celtics What year did the C's go to the ECF with Kyrie playing?\n\n#Never",
    "510": "2018-19 Status Jayson Tatum Pursuit SSP BGS 9.5 Gem Boston Celtics Pop 1 Of 1 https://t.co/26iM7yy2kc eBay https://t.co/2BD2vVInb8",
    "511": "Pritchard Brown Tatum #42 Williams. Decent. Do it @celtics @imeudoka",
    "512": "\"[Forsberg] Celtics rookie Jayson Tatum on the court as practice opens in Waltham.\"\n\nhttps://t.co/nOa369joqJ\n\n[via r/bostonceltics Jan 15, 2018 #Celtics]",
    "513": "@Nolan51266499 @TheyCallMeJL_94 @celtics Bubble doesn't count",
    "514": "\"Scott Souza on Twitter: #Celtics Jayson Tatum revealed his son was actually born more …\"\n\nhttps://t.co/ZnvWkOrGMs\n\n[via r/bostonceltics Jan 15, 2018 #Celtics]",
    "515": "[1/15]\n\n3. Chicago Blackhawks &amp; Boston Celtics (+144) 🏒🏀\n($100, 93.52% +EV*) #MaximBet\n\n#Promo: All Net\n\"Bet on any hockey + basketball parlay and get 100% of your wager back in Free Bet Credits up to $100.\"\n\n#GamblingTwitter #Blackhawks #BleedGreen #NBA #NHL #SportsBetting",
    "516": "#Lakers fans.. \n\nIf the opportunity was there, would y'all want the team to trade Anthony Davis and Taylor Horton-Tucker  to the Boston Celtics for Jayson Tatum?\n\n#NBA\n#BlockbusterTrade\n#LakeShow",
    "517": "@MaineCeltics Is he coming to the Boston Celtics to take Ime job?",
    "518": "@Patriots please win. My mental health is on the line. @celtics already done enough damage",
    "519": "@rainierdc @PBAinsider @celtics Also more spacing so yeah the coach.",
    "520": "@DHendersonCO @Nolan51266499 @celtics Have you seen Doc coach these 76ers games before saying that? I'd say he's a bit better than BB but not by much at all. Wouldn't say he's a great coach at all. He has cost them some wins.\n\nLook at Al's teammates in those ECF's. Embiid would've won with Kyrie, JT, JB as teammates.",
    "521": "Boston Celtics: Top scorers face off in Boston-Chicago matchup | The Kansas City Star https://t.co/KqW0TH96Vd",
    "522": "🚨 Line Change 🚨\n\nChicago Bulls @ Boston Celtics\nSat 8:40 PM EST\n\nFrom:\nBOS -5.0 -110\n\nTo:\nBOS -6.0 -110",
    "523": "Consensus Line Move:\n2022-01-15 Chicago Bulls at Boston Celtics from -5.00 to -6.00\n#BleedGreen  in trouble\n#NBA #gambling #analytics #lifestyle",
    "524": "If @celtics  could get a solid fuckin big and maybe 🤔 @JaMorant",
    "525": "@BrendanGlasheen @celtics As if BLs aren’t shitty enough, you had to drink a BL seltzer",
    "526": "@TheyCallMeJL_94 @Nolan51266499 @celtics So it had nothing to do with Coach Brett Brown?  \n\nI believe, and correct me if I'm wrong, Horford has been to ECF as a Celtic multiple times.  Then he goes to the Sixers with Joel/Ben/Brett and the Sixers still lose.\n\nWe can talk history forever.  Wanna talk rings next?",
    "527": "@tdgarden @NHLBruins @kanebrown @ChaseRiceMusic @celtics Meanwhile ole Dougie Ford says no more then 5 in a household here in Worst Case Ontario.",
    "528": "@_jacobfox @celtics Hear him out.",
    "529": "@Da_Real_CODE1 @bulls_nikki @chicagobulls Na the best team in the league the Boston Celtics",
    "530": "@DHendersonCO @Nolan51266499 @celtics No. 76ers were missing Milton, DG, and Simmons (who alone is a lot better than Smart) last night. \n\nC's likely still win the bubble series even if Ben was playing because of how bad now-Celtics JRich/Horford were for them. Notice how their former teams are better without them",
    "531": "@celtics I want \n\nJohn Collins \nGary Trent Jr. \nNorman Powell \nBruce Brown \nRichaun Holmes \nJosh Hart\nJarred Vanderbilt\n\nThanks https://t.co/VzY2B4svG9",
    "532": "Thank you @celtics https://t.co/TKXEqs8dBf",
    "533": "@TheyCallMeJL_94 @Nolan51266499 @celtics So let me use some Sixer Fan logic here to make sure I understand it.\n\nThe Celtics lost last night because Smart didn't play? \n\nLol",
    "534": "The Chicago Bulls will be signing Twitter user @DevinMchale_ to a 10-day contract to replace Vucevic in the game against the Boston Celtics. More information to follow.",
    "535": "@ptrbrsn @Vibrantankles @RyeGuy81 @tdgarden @NHLBruins @celtics Now your comparing apples and oranges. That has 0 relevance. Like..at all. Why would you compare the 2.. that’s the scary part of which now people think “it’s normal” that we need/follow all the shot mandates. It only gets worse from here",
    "536": "@DanteOnDeck @celtics Hield is exactly what this team needs. A player who can get offense when JT, JB or both are off the court and might help break up those 28-2 runs",
    "537": "@RKOHEELCENA @Vibrantankles @RyeGuy81 @tdgarden @NHLBruins @celtics i wear clothes all the time so i dont mind doing it either. but, i dont understand why i cant go nude in public like god intended me to be, almost as if theres some social contract you buy into.",
    "538": "A win-win: @inhomedesigncenter #repost Drawing for the these Celtics tickets was extended to TODAY 1/15. Buy tickets in the shop 11-5 today. Money goes to our local food pantry! Store info: https://t.co/fY7DoRNCu2\n\n#BostonCeltics #CelticsTickets #EssexMA #DineShopStayPlayEssexMA https://t.co/M0ZLyKtByd",
    "539": "DasHaus made a bet!\n\nEvent: Chicago Bulls vs Boston Celtics #NBA\nBet: Boston Celtics TO WIN -5.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "540": "@ptrbrsn @Vibrantankles @RyeGuy81 @tdgarden @NHLBruins @celtics I don’t mind shots at all I’m fully vaccinated. I just don’t see why it’s a requirement now to do normal things. It’s so a infringe on our rights",
    "541": "DasHaus made a bet!\n\nEvent: Chicago Bulls vs Boston Celtics #NBA\nBet: Chicago Bulls TO WIN +5.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "542": "Very cool that Juwan will be joining Jaysean Paige in the Maine Celtics, itself an affiliate of the Boston Celtics, where Joe Mazzulla coaches. https://t.co/PJPyfbbfeN",
    "543": "On this date in 1987, Boston Celtics forward Larry Bird is named Man of the Year by 'The Sporting News' and Athlete of the Year by 'Associated Press'; first time one athlete gains both distinctions. Woooooooooooo! https://t.co/2SJeTEiQZu",
    "544": "@BrotherAndrej @celtics u have every mutt except schroeder signed next year. Aside from williams pritchard and the jays your team is without assets. Nobody will want to take on a horford or a  smart contract. Big Free agents never choose Boston. You’re delusional no Real cs fan is happy on the team",
    "545": "@jayden88345444 @Nolan51266499 @TheyCallMeJL_94 @celtics Ratio",
    "546": "@antoniobernalm @celtics They were getting their numbers but really wasn't trying. I feel like they tanking the team. I really expected to see a good game but I couldn't enjoy it because of the lack of energy.",
    "547": "@DHendersonCO @Nolan51266499 @celtics The first series C’s should’ve won since C’s were in still in their title window while 76ers were young on Joel/Ben’s first playoff run. Bubble 76ers lost since Ben was hurt and Horford/JRich were bad for them. 76ers are better now because those 2 are off the team and in Boston",
    "548": "@RKOHEELCENA @Vibrantankles @RyeGuy81 @tdgarden @NHLBruins @celtics all I'm saying is that its just a shot, why are people so scared of shots",
    "549": "Congrats to Kara! Set to be inducted into the Virginia High School Hall of Fame in Feb. \n\n😈 ‘99 HS Player of the Year\n😈 3x NCAA Final Four\n😈 13-year WNBA career\n😈 Olympic Gold Medalist\n😈 17 yrs in Broadcasting\n😈 Stint w/ Boston Celtics\n\nClass includes JJ Redick as well! https://t.co/ivJcgAmuD3",
    "550": "@celtics are HORRIBLE",
    "551": "Philadelphia 76ers star Joel Embiid reacts to losing his 30+ points streak after the win over the Boston Celtics.  https://t.co/qX1aMjYeS9",
    "552": "Boston Celtics: #Celtics star Jayson Tatum plays the blame game in embarrassing loss to Sixers - ClutchPoints https://t.co/AL6JzW5xy7",
    "553": "Consensus Line Move:\n2022-01-15 Chicago Bulls at Boston Celtics from 218.50 to 216.50\nUnder money won\n#NBA #bettingonline #sabermetrics #binaryoptions",
    "554": "@celtics can we toss the pats game on the Jumbotron the entire game tonight? Much more important",
    "555": "@RKOHEELCENA @Vibrantankles @RyeGuy81 @tdgarden @NHLBruins @celtics there are long term effects we dont fully understand. i stopped being scared of shots when i was 8, what about you?",
    "556": "@TheyCallMeJL_94 @Nolan51266499 @celtics \"Losing in the conference finals is ultimately the same as losing in any other round,\" especially when you haven't made it out of the 2nd round like the Sixers.\n\nLook were taking head-to-head?  Head-to-head in the playoffs in the Joel era what's the score?\n\nDebate the facts.",
    "557": "@ptrbrsn @Vibrantankles @RyeGuy81 @tdgarden @NHLBruins @celtics And look where that got us… NO WHERE!! Everyone got fat, kids stopped going to school and learning how to socially interact with people and friends. That was the worst thing that could’ve happened. We shut down for a cold😩🥺😂",
    "558": "@ctsbulls @chicagobulls @celtics @670TheScore @Audacy Still back this team. We haven’t seen the best of them yet.",
    "559": "@DanteOnDeck @celtics Neither really does a ton for this team, I would just trade for whichever one is more easily attainable",
    "560": "@UtahJazzyman @GVUDM So you want to be what the Boston Celtics are now? 🤔",
    "561": "@kirkgoldsberry @memgrizz @dallasmavs @Suns @MiamiHEAT @cavs @celtics At least we ain't in the quadrant of woe! Honestly the last few games have me fairly optimistic. Beating the Nets with your 3 best players out is a good sign. Once they're healthy, Rip City will be rocking once more!",
    "562": "@PapaMingo12 @celtics At this point you could do a better job then Udoka",
    "563": "Boston Celtics: #Celtics-76ers takeaways: Turnovers, brutal first quarter cost C's - NBC Sports https://t.co/a5OpuHRIJR",
    "564": "@DHendersonCO @Nolan51266499 @celtics Does it matter? 76ers and Celtics both haven’t seen the NBA finals in the Joel era. Losing in the conference finals is ultimately the same as losing in any other round. \n\nI assume you think Larry Bird is still on the roster due to how much you’re living in the past right now",
    "565": "@celtics We came all the way from Dallas to see you tonight! We are so excited. Especially THIS guy! https://t.co/dNhwBv5Kms",
    "566": "@Im_Self_Paid23 @celtics Lol naw they don’t make me $ lol 😂 I’m jus starting to think it might be the coach lol",
    "567": "@PapaMingo12 @celtics At this point you let them get you mad lol",
    "568": "#BostonCeltics lose game 43 of the 2021-2022 Boston Celtics season 111-99 and are 21-22 on the season",
    "569": "NBA Basketball Game Betting Picks Simulator: 8:40 PM ET - Chicago Bulls vs. Boston Celtics - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/02DK1gbPB0 #nba #sportsbetting #freepicks #cappertek",
    "570": "Alright hear me out a professional basketball team should have a point guard @celtics",
    "571": "@ESPNBoston NO. @celtics need a point guard who can dish, shoot, and play defense. I love @smart_MS3 defense &amp; energy but he is not a PG.",
    "572": "@TheyCallMeJL_94 @Nolan51266499 @celtics How many times have the sixers made the ECF with Joel?  \n\nYou're currently a 5th place team? Dude you have nothing to talk about but reg and pre season victories.\n\n#weak #lame",
    "573": "New ESPN story: After beating the Boston Celtics to claim a ninth win in 11 games, 76ers superstar Joel Embiid declared there’s “no urgency to change anything” and “we got everything we need” with just under four weeks to go until the NBA’s trade deadline. https://t.co/gL8YaEj5mX",
    "574": "@celtics What about the other 38+ minutes?",
    "575": "@celtics The gap between us and the top teams is so large…….Disgraceful job by Ainge and Brad",
    "576": "@celtics bad bad bad",
    "577": "@985TheSportsHub @celtics @tdgarden @1057WROR @NBA Tough night for ratings",
    "578": "@AnnaHorford hey! Who won the @sixers vs @celtics game last evening? Can you PLMK? Tysm ❤️",
    "579": "@DHendersonCO @Nolan51266499 @celtics What have the Celtics done that was actually meaningful since Embiid has been playing? \n\nBoth teams have watched the NBA finals from their couches despite C’s should have been capable of going to at least one since they got Tatum. Now they just are wasting Tatum/JB prime years",
    "580": "@ChelseaFC lost, @celtics lost, talmbout a bad day for a supporter.",
    "581": "@TheyCallMeJL_94 @Nolan51266499 @celtics Are you bragging about reg season games? \n\nJust wait until your team accomplishes something meaningful against the C's.  How hard is that?\n\nThen you can talk smack.  Until then you are acting like a Sixer fan.",
    "582": "And it’s glorious. Fuck the Boston Celtics https://t.co/QYt42Djd8A",
    "583": "@Ramina1690 Ok. It's just the @celtics today. Let's end this skid",
    "584": "@DHendersonCO @Nolan51266499 @celtics Well, considering Al Horford and Josh Richardson were two of the biggest reasons the 76ers lost to the Celtics in the bubble and are now on the Celtics payroll, 76ers would do much better against them (see: them winning 5 of their last 6 games against Boston since the bubble)",
    "585": "#NBAAllStar #NBA Players then vs. players today. #smh #DevinBooker @Raptors @celtics #LarryBird @the_raptor https://t.co/u2Wp70HzX1",
    "586": "@TheyCallMeJL_94 @Nolan51266499 @celtics What is your playoff record against the Celtics in the Joel era?\n\nThe Celtics have not missed the playoffs yet, have they? Is the season over?  \n\nWhat part of complete joke do you not understand?\n\nWhen you do beat down the Celtics in the playoffs, then you can talk... until then",
    "587": "@celtics Maybe sometime This year he'll start at POINT?",
    "588": "@DHendersonCO @Nolan51266499 @celtics I do think it would be hard for the 76ers to beat you in the playoffs if you won’t even make the play-in tournament. Kind of hard to beat someone in the playoffs who isn’t there. https://t.co/4Ht8z8viXq",
    "589": "@celtics STOP STARTING AL HORFORD?!?!?!?!?!?!?!\n\nJesus christ Ime really is trying to lose his job #Celtics",
    "590": "January 15, 1987 Champion Boston Celtics NBA forward Larry Bird is named Man of the Year by 'The Sporting News' and Athlete of the Year by 'Associated Press'; first time one athlete gains both distinctions #Today #OnThisDate #People #History #Event #Now #PR https://t.co/7XXjSnhPK2",
    "591": "@Nolan51266499 @TheyCallMeJL_94 @celtics I love how Sixer fans get all giddy about pre and reg season victories.\n\nThe rivalry renews when the Sixers beat the Celtics in the playoffs. \n\nUntil then the Sixers remain a complete joke.",
    "592": "@celtics I hate this team so much🤦🏾‍♂️",
    "593": "@celtics Ppl still watch huh?",
    "594": "Boston Celtics: Top scorers face off in Boston-Chicago matchup | The Kansas City Star https://t.co/vQQxhdy2AA",
    "595": "@kirkgoldsberry @memgrizz @dallasmavs @Suns @MiamiHEAT @cavs @celtics “To Houston and Portland” 💀💀 just how far off the graphic are they? 😂",
    "596": "@TA1297 @bostonceltics \n\nI'd rather watch PP and Nesmith lose with passion, than watch the top five lose with indifference.\n\nTime for a reset. Clean house. Play the young players.",
    "597": "@985TheSportsHub @celtics @tdgarden @1057WROR @NBA Nobody cares team going absolutely no where",
    "598": "Boston Celtics: #Celtics go down early and never come back in 111-99 loss to Sixers - 98.5 The Sports Hub https://t.co/6urYeVQBqn",
    "599": "@Vibrantankles @RyeGuy81 @tdgarden @NHLBruins @celtics You do realize that even with the “vaccine” you can still get and transmit Covid,Delta,Omicron.",
    "600": "Sadly, the Boston CELTICS front office have shown that they obviously don't know how to build a winning team and I’m afraid they don't even have a clue what changes the team needs right now to make it a winning team.",
    "601": "@_MrStew @chelsea @celtics @thaiorchid Booty 😅",
    "602": "Coming to the #NHLBruins or #BostonCeltics games today? Stop by the ProShop powered by ‘47 and grab your limitied edition Willie O’Ree jersey retirement merch. \n\nIn January net proceeds will benefit the Boston Bruins Foundation and @scoreboshockey https://t.co/JSwmcHUxXl",
    "603": "Boston Celtics: De George: For Doc Rivers, #Celtics matchup more mystery than marquee - Delco Times https://t.co/LbRVh594Fg",
    "604": "@Realandyfallon @nbagleague @RGVVipers @PeterVsTheDark Need this man back on the @celtics ASAP",
    "605": "Never thought I would say this but @celtics please win tonight. I'm rooting for you guys.",
    "606": "Consensus Line Move:\n2022-01-15 Chicago Bulls at Boston Celtics from 219.50 to 218.50\nUnder steam engine\n#NBA #bet #ai #profit",
    "607": "@celtics tatum plays with the ego of a top 5 player in the league 🤦‍♂️",
    "608": "@FBeacon1024 @trellyh @celtics @jaytatum0 another don’t know basketball lookin ass 😪",
    "609": "@NickDePaula @jaytatum0 @celtics @ESPNNBA @boardroom @TheUndefeated @Jumpman23 Feel like he’s been wearing these for way to long.. he must have 1k color ways.. switch it up to some Penny’s or Kobe’s .. idk ..",
    "610": "@SIChrisMannix Thats why #Celtics are so maddening. To miss on that many mid rd picks destroyed any chance of being an elite team. It's amazing how many guys making an impact were available for the @celtics to draft over the last 5 years.",
    "611": "@trellyh @celtics @jaytatum0 don’t know basketball lookin ass 😪",
    "612": "Boston Celtics: #Celtics fall to 76ers, Embiid has 25 points and 13 rebounds - https://t.co/RzLshXVbWa https://t.co/FM2OxSnH5w",
    "613": "@celtics need to do a trade and also fire Udoka. This season is lost if we don't do something now.",
    "614": "I would like to call out that cheerleading owner wic @celtics , is he hibernating ??? This team is HORRENDOUS! All aspects offense defense they turn ball over left and right! Their coach doesn’t seem to be doing anything.!  How about wic doing something to change this garbage!",
    "615": "2007-08 SPx Gabe Pruitt Boston Celtics - #119 Rookie, jersey, autograph, 24/25 Seller:... - https://t.co/lAQickxz1g #nba #nbacards #ebay https://t.co/bBBk0GTgjp",
    "616": "#History #15January #Year1987\nSports History:\nChampion Boston Celtics NBA forward Larry Bird is named Man of the Year by 'The Sporting News' and Athlete of the Year by 'Associated Press'; first time one athlete gains both distinctions",
    "617": "Boston Celtics: Boston #Celtics at Philadelphia 76ers: Stream, lineups, injury reports and broadcast info (1/14) https://t.co/DRR2EfbsH3",
    "618": "Can @DeMar_DeRozan lead the @chicagobulls to a win vs the @celtics today? #BullsNation #NBAAllStar https://t.co/tUtdDzU8IU",
    "619": "@celtics @FCHWPO 11th place teams don’t get 2 all stars fellas https://t.co/uFolWA7YNm",
    "620": "Boston Celtics: What Stood Out in #Celtics' Loss vs. Sixers: Boston Not Ready for Measuring Stick Game ... https://t.co/mOg2c5WbE6",
    "621": "Boston Celtics: Boston #Celtics vs Philadelphia 76ers Full Game Highlights | January 14 | 2022 NBA Season ... https://t.co/ZzhePrMJXn",
    "622": "CHICAGO BULLS vs\nBOSTON CELTICS, 9:30PM.\n#BleedGreen",
    "623": "@985TheSportsHub @celtics @tdgarden @1057WROR @NBA only the NBA could be so stupid to plan a game of the night of the Wild Card Patriots game",
    "624": "January 15, 1957 7th NBA All-Star Game, Boston Garden: East beats West, 109-97; MVP: Bob Cousy, Boston Celtics, PG #Today #OnThisDate #People #History #Event #Now #PR https://t.co/qc2hFwaAbe",
    "625": "BOSTON CELTICS 99-111\nPHILLADELPHIA 76SIXERS, Final.",
    "626": "This is (also) the fault of the @nba refs. It should be not aloud to touch a player in the air when you have no chance to challenge him at the rim. @dennischroder17 should be ejected &amp; he should sit out at least 1 game @BostonCeltics ! 😡\n#Philadelphia \n#boston\n#sixers\n#Celtics https://t.co/4bRmStoR3w",
    "627": "@phillydrilz @CatfishMiller @celtics The Sixers havent beaten even an average team in the playoffs since 2012.\n\nRead that again.  Literally haven’t beaten an average team in a playoffs series in a decade. \n\nThat is so, so sad.  Yall have nothing, past present or future",
    "628": "The Philadelphia 76ers react to Matisse Thybulle taking a couple of flagrant fouls in the win over the Boston Celtics.  https://t.co/wNdLVw6ppO",
    "629": "A 3-step trade deadline plan for the Boston Celtics – NBA News https://t.co/KnLjJ2vGEw",
    "630": "Boston Celtics: #Celtics-76ers takeaways: Turnovers, brutal first quarter cost C's - NBC Sports https://t.co/bpOyT8bDpo",
    "631": "@tdgarden @NHLBruins @celtics Since we are concerned about everyone’s health are you still serving hot dogs (class 1 carcinogen) and alcohol?  Asking for my immune system.",
    "632": "@Jamarri6601 @celtics I would trade smart,Timelord and a pick for Sabonis.",
    "633": "@celtics Man the celtics were ugly to watch today. Im a Philly fan (so I know ugly basketball). The score actually makes it look closer than it actually was.",
    "634": "Check out BOSTON CELTICS JAE CROWDER ADIDAS SWINGMAN STITCHED JERSEY ADULT LARGE + 2 IN #adidas https://t.co/CcZR7qZ6PH via @eBay",
    "635": "All I’m saying is Payton Pritchard better start tonight over Dennis Schröder ☘️ @celtics",
    "636": "Boston Celtics: Embiid Posts 25 Points And 13 Rebounds In 76ers' 111-99 Win Over #Celtics - CBS Boston https://t.co/H60yugktiF",
    "637": "🔔 🔔 THE PROCESS &amp; T-MAX\n\n@JoelEmbiid (25 PTS &amp; 13 REB) e @TyreseMaxey (23 PTS &amp; 5 AST) trascinano i @sixers alla vittoria sui Boston Celtics!\n\n#NBA | #NBA75 https://t.co/YrfNWCT1yL",
    "638": "@celtics “Admirable level of competitiveness”. That is what this great franchise has been reduced to? Participation trophies and moral victories? Pathetic.",
    "639": "Boston Celtics: #Celtics fall to 76ers, Embiid has 25 points and 13 rebounds - https://t.co/VqDGYbk36X https://t.co/PQFWy3WMEG",
    "640": "@celtics Sick and tired of this bs https://t.co/7RC2Z4fSlk",
    "641": "Chicago Bulls (27-13, first in the Eastern Conference) vs. Boston Celtics (21-22, 11th in the Eastern Conference) https://t.co/xtcN0a98CU",
    "642": "@PlayoffJays_ @celtics Ikr. It’s like @celtics doesn’t know when to just stay quiet. \n\nThere were no - NO - bright spots in that dumpster fire of a game. NONE.",
    "643": "Finally, the Chicago #Bulls face the Boston #Celtics from #TDGarden tonight at 7:30pm on #NBCSportsChicago and #670TheScore. Tonight, is a great night to watch the @Chicago_Wolves, the Chicago #Blackhawks, and the Chicago #Bulls on TV.",
    "644": "Finally, the Chicago #Bulls face the Boston #Celtics tonight at 7:30pm on #NBCSportsChicago and #670TheScore. Tonight, is a great night to watch the @Chicago_Wolves, the Chicago #Blackhawks, and the Chicago #Bulls on TV.",
    "645": "@celtics Coach Dinka should push for defense, offense will  win!! Fire him….he sucks!!",
    "646": "@celtics With a new coach comes new ideas.\nBut this shit is worst than last year.\nNo signs of improvement.\nGo back to the park basketball courts coach.",
    "647": "@NBA @celtics Ma per favore",
    "648": "@lostbraincellz_ @celtics Where was it from the starters.\nToo many excuses for too many losses this year already.",
    "649": "@honestJBfan @celtics Help them to be more ball-hoggers?",
    "650": "@celtics Change the coach",
    "651": "@celtics You're only good at teams with losing records. You won't reach the playoffs.",
    "652": "Boston Celtics play basketball tonight \nRIP MY MENTAL HEALTH",
    "653": "@celtics Why not put them in when the starters gave up a 26-2 run? Clearly the starters didn’t show up. WTF Ime?",
    "654": "Boston Celtics vs Philadelphia 76ers Full Game Highlights | January 14 |... https://t.co/0J8dU90yuV @YouTube",
    "655": "Boston Celtics vs Philadelphia 76ers - Full Game Highlights | January 14... https://t.co/dEQFJAaOuT @YouTube",
    "656": "Boston Celtics: Boston #Celtics vs Philadelphia 76ers Jan 14, 2022 Game - Scores, Stats &amp; Highlights | https://t.co/Wb61ItWQBn https://t.co/GtwYTUBGhG",
    "657": "Fudge!!! This Stell donning the jersey of Boston Celtics' Jayson Tatum is taking my soul. 😭\n\nPaarbor naman ng jersey, @stellajero_ ! \n\nBAZINGA MAINSTAY BBHTS\n@SB19Official #SB19\n#SB19TopsBillboardHTS\n#Bazinga_SB19 is my hype song! https://t.co/idhatM3Vea",
    "658": "Boston Celtics vs. Philadelphia 76ers Full Game Highlights | January 14 ... https://t.co/MPZB1bN0uU @YouTube",
    "659": "@usecodeddk Boston\nCeltics",
    "660": "The Boston Celtics are Finished Ball hogging and selfish Isolation plays have doomed this team you have a soft noob coach a super soft baby liberal GM. You not winning anything Wyc needs to trade everyone for future picks and I mean EVERYONE. Including Tatum and brown and rebuild",
    "661": "@SamuelBell1991 @celtics 5 years (minimum) of the same formula &amp; issues.\nEven in losses we aren't building good habits- nothing we do will translate to good later in the season.\nCulture is \"blame\" not grow.\nDoesn't make sense contractually long term to stand pat.\nDoesn't make sense financially long term. https://t.co/YeRr6KCBhh",
    "662": "@Albarien @celtics AINGE KNEW! That’s why he left. He knew they team needs to be blown up and started over",
    "663": "@d3peeto @celtics Danny Ainge knew a rebuild was necessary that why he retired then went somewhere else",
    "664": "@celtics I can't believe what I'm reading! Admirable level of competitiveness! Red and all the legendary players and coaches of this once great franchise can be nothing but disgusted and disappointed with this group of so called \"Boston Celtics\"",
    "665": "@celtics I think it’s time the Celtics organisation acknowledged the fact that we’re not the 70’s, 80’s and late 2000’s Celtics. We are quite simply rebuilding and it’s high tide we acknowledge it and move on; I love Tatum and Brown but we need to be real. We are a bad team and need help.",
    "666": "Boston Celtics: #Celtics go down early and never come back in 111-99 loss to Sixers - 98.5 The Sports Hub https://t.co/KqW0TH96Vd",
    "667": "@celtics The game never really started for us. Time to admit there’s sthg wrong with this team",
    "668": "@celtics Yo , that pic shows an offensive foul on Embiid for extending his arm. But yea, refs somehow love to grant him fouls instead while Tatum rarely get them calls. Wtf is this type of fuckery",
    "669": "@DonnRunyan @celtics You're bad @ obeserving\n- we have a bridge year\n- Brad created tradeable contracts Ainge didn't have while\n- simultaniously SLIGHTLY upgrading the bench +\n- created financial flexibility\nHe also needs to clean up Ainge's mess\nYou fail to see this because you are mad, I understand",
    "670": "Joel Embiid *25-13-6* and the Philadelphia 76ers beat Jaylen Brown *21-2-1* and the Boston Celtics 111-99 (2022-01-14)",
    "671": "How can the front office at the Boston Celtics not see we have a lot of issues….!!We will be Lucky if we make the play in tournament at this rate… 😤 everything is disconnected, All pointing fingers at each other, rather than trying to resolve the situation together.. @celtics",
    "672": "Four takeaways as Boston Celtics fall to Philadelphia 76ers 111-99 after a disastrous first quarter run  https://t.co/1CPRa0kRrs",
    "673": "@celtics So sweet watching the Boston feed last night and listening to the crappy Celtic announcers whine and complain all night. Lmao Youve just got a crappy team, accept it. You guys don’t deserve to get in the playoffs. Go Sixers!",
    "674": "@celtics Couldn’t get in the flow? You guys suck! Lol a shell of the team we used to know is the Boston Celtics. Sixers rule! JoJo for MVP.",
    "675": "Chicago Bulls (27-13, first in the Eastern Conference) vs. Boston Celtics (21-22, 11th in the Eastern Conference) https://t.co/XXhhUUQEnQ",
    "676": "@tdgarden @NHLBruins @celtics Good move on the gardens part",
    "677": "@PBAinsider @celtics Trade tatum. Trade everyone starting with tatum and ime.",
    "678": "Boston Celtics: Embiid Posts 25 Points And 13 Rebounds In 76ers' 111-99 Win Over #Celtics - CBS Boston https://t.co/AL6JzW5xy7",
    "679": "The Boston Celtics President of Basketball Operations appeared on a radio show and made an interesting comment about Isaiah Thomas.  https://t.co/JhsqbMtm9Z",
    "680": "Boston Celtics: Boston at Philadelphia: #Celtics lay an egg vs. Sixers, fall 111 - 99 on the road - #Celtics Wire https://t.co/a5OpuHRIJR",
    "681": "@celtics Big 3 is much better than Duo.get one star player to form a big 3.tatum and brown is not enough add some one star player.",
    "682": "@JaviOnTheMix @tdgarden @NHLBruins @celtics yeah 1 dose is accepted until the 15th of february :)",
    "683": "@Nolan51266499 @TheyCallMeJL_94 @celtics Such a loser mentality 😂 imagine flaunting conference finals even though you lost both times. Means nothing",
    "684": "@celtics Ain't you tired of this shit of a team?",
    "685": "Boston Celtics vs Philadelphia 76ers Full Game Replay 2022 Jan 14 NBA Replay HD\nhttps://t.co/ymtAc1n2ZK https://t.co/NEHABzRBxo",
    "686": "@penarroyo @Burner06137507 @SoxPatsCsplswin @celtics Lmao💀",
    "687": "SLAM - REPORT: Boston Celtics Interested In a Jeff Green Reunion Via Trade https://t.co/lBISjW9HqJ #NBA #BallisLife",
    "688": "\"Boston has traded guards Jordan Crawford and Marshawn Brooks to Golden State, league …\"\n\nhttps://t.co/nobBiiPM5M\n\n[via r/bostonceltics Jan 15, 2014 #Celtics]",
    "689": "Furkan had 7pts, 3ribs, 2asts against Boston Celtics! \n\n@FurkanKorkmaz \n\n#istbasketagency 💪🏼 https://t.co/U3p6KgL9E9",
    "690": "@celtics just need the goat marcus smart number 36 to come back and average a measly 40 ppg and we will be fine",
    "691": "@celtics The last Celtics team that was actually watchable for a whole season was the 2016-2017 team. A bunch of scrappy players who gave their all every night. To watch this year’s team, with so much supposed talent, is unbearable. Individual talent doesn’t equate to team wins.",
    "692": "@celtics TERRIBLE!!! JT AND BROWN CANT PLAY TOGETHER , TRADE BROWN AND SMART FOR A STAR BIGMAN AND A POINT GUARD",
    "693": "🏀🐃🏀 GAMEDAY 🏀🐃🏀\n\n@chicagobulls travel to Boston to take on @celtics \n\nBoth teams lost last night,who bounces back?\n\n🔴 \nBulls 27-13\nCeltics 21-22\n\n⚫ Last time out \n  GSW 138-96 Bulls\n  Celtics 99-111 6ers\n\n🏀 Previous Meeting\n   Bulls 128-114 Celtics\n\n#UKBullsFB https://t.co/M1DbO10ecx",
    "694": "Boston Celtics at Philadelphia 76ers    Game #43    1/14/22 https://t.co/xBiGUE50YW",
    "695": "Boston Celtics Daily Links  1/14/22 https://t.co/OjAZM4g8zR",
    "696": "Trade season mailbag - post your Boston Celtics questions https://t.co/x9pQVuBtWk",
    "697": "Chicago Bulls @ Boston Celtics\nPick : Chicago Bulls.\nBasketball. NBA",
    "698": "@FredJB7_ There's a clear and distinctive difference between the guy that can score off of set offence called for him or off of broken play. Some can't do it some can. My player evaluation process sorts for this apparent intangible @celtics",
    "699": "@ThisWayArt @HoppNo @celtics Boston is run by the 3 stooges Smart, Brown &amp; Tatum because everyone else worth a damn left. So expect Boston to give catering to those three",
    "700": "@AProskauer @Nesmith_stan @celtics Lmaoooo",
    "701": "@K843_T @celtics “We need more shooting”\n\nIme: let me play Horford &amp; Robert Williams together. \n\nThis is what they get for talking so much shit before the season started. “Smart gonna be this, al gonna start, rob blah blah”",
    "702": "@PBAinsider @celtics That is foundational. If i were them i won't even mess with it; just bring in the necessary pieces.",
    "703": "Should the @celtics break up the Jayson Tatum - Jaylen Brown duo?",
    "704": "Boston Celtics: Former Boston #Celtics two way center Tacko Fall signs deal with Canton Charge - Yahoo! Sports https://t.co/vQQxhdy2AA",
    "705": "@yusufali277 @celtics bodieddd em",
    "706": "@celtics I am desperate",
    "707": "Boston Celtics: Embiid Posts 25 Points And 13 Rebounds In 76ers' 111-99 Win Over #Celtics - CBS Boston https://t.co/6urYeVQBqn",
    "708": "@illestmarcos_ @ArtCovUnion247 @Bawstan @DanteOnDeck @celtics I like Brown I just think Tatum is more talented and better upside. I honestly hope the Celtics keep them both and try to add a third piece. I think it is too early to give up on them. But if I was asked who would I rather give up in a trade it will be Brown over Tatum.",
    "709": "@timsheilsnba So what you're saying is the 2022 Boston Celtics are more likely to turn the ball over 20 times in a game (42.9%) than any of their players are to hit a 3 this season (Grant Williams, 41.7%)... 🙃",
    "710": "@celtics It's a shame what this once historic franchise has become! We're wasting Jayson Tatum's prime!",
    "711": "@K843_T @celtics We need a real Point Guard...",
    "712": "@celtics They made us look weak af.",
    "713": "\"Shavlik Randolph is back! Austin Rivers has been traded to the Clippers with Reggie …\"\n\nhttps://t.co/hKu6XGOmbU\n\n[via r/bostonceltics Jan 15, 2015 #Celtics]",
    "714": "🔴#NBA🏀🇺🇲\n⬇️#BostonCELTICS 99 (21-22)🔸\n⬆️#Philadelphia76ers 111 (24-17)\n🔶AL HORFORD🇩🇴\n(C/6'9\"/240Lbs)\n🔹5/Pts\n🔹2/Reb\n🔹2/Ast\n🔹0/Stl\n🔹1/Blk\n🔹1/TO\n🔹1/2T2\n🔹1/3T3 \n🔹0/TL\n🔹17:00/min:seg\n@Al_Horford\n#Celtics\n#RDenNBA\n#DominicanosEnNBA\n#MaTR®",
    "715": "@brian_cov87 @ArtCovUnion247 @Bawstan @DanteOnDeck @celtics That’s even worse",
    "716": "Boston Celtics: Boston at Philadelphia: #Celtics lay an egg vs. Sixers, fall 111 - 99 on the road - #Celtics Wire https://t.co/LbRVh594Fg",
    "717": "@celtics Trade freedom out of here",
    "718": "@celtics Must win tomorrow against the Bulls",
    "719": "@celtics I know the reason… it’s because our coach sucks",
    "720": "@celtics Anyway, try hard tomorrow, okay",
    "721": "Joel Embiid posted 25 points, 13 rebounds and six assists as the Philadelphia 76ers downed the visiting Boston Celtics 111-99 on Friday night for their eighth victory in nine games. https://t.co/ILsgkZXlSL",
    "722": "@celtics You are just a mediocre team. The Sixers now own you.",
    "723": "@celtics They're also a better team so that probably helped them",
    "724": "Guess what? The @celtics underperformed yet again. #blowitup",
    "725": "@celtics Shut up",
    "726": "@celtics Always close #CardiacCeltics",
    "727": "#History #15January #Year1957\nNBA All-Star Game:\n7th NBA All-Star Game, Boston Garden: East beats West, 109-97; MVP: Bob Cousy, Boston Celtics, PG https://t.co/JGuq1wuzwV",
    "728": "@celtics Instead of keeping your $30m a year All Stars in the game, even after Payton almost got you back in range. Why are we paying this dude to throw games away? He can be hard on the guys after the game.",
    "729": "@celtics Stop tweeting please",
    "730": "We couldn’t get into a flow offensively tonight in Philly, which allowed the Sixers to close out with a 111-99 win. https://t.co/Vm40rqU3ur",
    "731": "Boston Celtics: 76ers vs. #Celtics: How to Watch, Live Stream &amp; Odds for Friday Night - Sports Illustrated https://t.co/FM2OxSnH5w",
    "732": "@the21truth @jamaicanceltic @GwashburnGlobe @celtics Defense and no shooters",
    "733": "@Nolan51266499 @TheyCallMeJL_94 @celtics You heard it here first, heat will be in the eastern conference finals.",
    "734": "Boston Celtics: How to watch 76ers vs. #Celtics: Live stream, TV channel, start time for Friday's NBA game ... https://t.co/DRR2EfbsH3",
    "735": "@celtics Corny, Lame, booooooo, tomato tomato tomato I’m throwing tomatoes!",
    "736": "@celtics Poorer Celtic.. This is not Boston that I Now 😢😭",
    "737": "Boston Celtics: #Celtics guard Marcus Smart, who has a thigh injury, placed in COVID protocol - The Boston Globe https://t.co/mOg2c5WbE6",
    "738": "Boston Celtics: Embiid scores 25 as 76ers roll past #Celtics, 111-99 - Portland Press Herald https://t.co/ZzhePrMJXn",
    "739": "@Blade79652012 @celtics Of the Jays. Yes the Celtics suck but my whole tweet is that it isn't the Jays fault because this roster is not built around them properly",
    "740": "@Blade79652012 @celtics Miami also has Herro and Lowry lol. Both can create their own shot and Lowry can create for others. Celtics don't have any of that. Miami has good defenders in the paint with dedmon and tucker. and Lowry, Herro, and Robinson are 10x better shooters than anyone on Boston outside",
    "741": "Former Boston Celtics two way center Tacko Fall signs deal with Canton Charge https://t.co/2y6KCRMafG via @Yahoo",
    "742": "@celtics Time to fire this Guy",
    "743": "I can’t stand this Boston Celtics team. Coach Udoka is not the man for this job and it shows",
    "744": "@TheOnlyKingDevo @celtics Yeah but those Celtics weren’t consistently blowing plus 20 pt leads in the 4th. Brad was great at out if timeout plays. I haven’t even seen Udoka run anything outside of a high school play book.",
    "745": "hey @celtics yk\ni'm up for a 10 day contract if you need any help\njust dm me and i'll take the first flight to join you",
    "746": "Boston Celtics: Sixers ride dominant first quarter to 111-99 victory over #Celtics - Philadelphia Inquirer https://t.co/bpOyT8bDpo",
    "747": "how you feel @celtics? https://t.co/heqxIFKjbq https://t.co/RYLXdfGJJc",
    "748": "@celtics HAHAHAHAHAHAHAHAHAHAHAHA https://t.co/0EjArhnoxF",
    "749": "@celtics This quote is BS. He put them in cus he gave up at the 9 min mark. He didn’t expect a run at all. Trying to save face isn’t a good look Udoka",
    "750": "@celtics Probably much more like a team! Sick of two players playing iso. Getting points and being called all stars and LOSING!!!!",
    "751": "There's no team in the NBA which plays against itself like the Boston Celtics",
    "752": "@celtics Bum dennis caused me to miss out on a band for not grabbing another board",
    "753": "Boston Celtics: Embiid has 25 points and 13 rebounds, 76ers beat #Celtics - Westport News https://t.co/H60yugktiF",
    "754": "Instant observations: Sixers dominate Celtics with excellent defensive showing - https://t.co/GmoWeYEpKV https://t.co/f7Qy622K3f #Sixers #NBA #Philadelphia #BostonCeltics #JoelEmbiid https://t.co/nXCrUNVWJM",
    "755": "The Drain of the Game was the time I spent watching this frickin' charade, thank you very much, @celtics... 🤨 https://t.co/fkSvskLsgL",
    "756": "@Arciga24 @buddyhield @celtics @jaytatum0 @FCHWPO Ayi les cabe Westbrook a ustedes ya que los jays can’t pass",
    "757": "@Arciga24 @buddyhield @celtics @jaytatum0 @FCHWPO Ni madres we shipping out westbrick",
    "758": "@ElWhite559 @buddyhield @celtics @jaytatum0 @FCHWPO Screw the lakers go pickup Erik Gordon he's 33+ fits ur requirements",
    "759": "@celtics I agree with Scal -- the Cs gotta be more edgy .... but how can they do that when the coach is muzzled?  Just watch Doc and learn",
    "760": "@celtics This tweet is legitimately hilarious. \nFor real made me laugh out loud. Woke up my gf and everything.",
    "761": "@celtics You should put the picture of Pritchard in here, not some guy who can’t compete with 76ers.",
    "762": "The @celtics  need @shaiglalex",
    "763": "@Arciga24 @buddyhield @celtics @jaytatum0 @FCHWPO He still wanna be a laker tho might be still 👀",
    "764": "Bulls, Celtics square off after blowout losses  #NBA\n #celtics #BostonCeltics #chicagobulls #BullsNation https://t.co/dHcyEq6Jlu",
    "765": "@ElWhite559 @buddyhield @celtics @jaytatum0 @FCHWPO Y'all didnt pick him, instead got Westbrook https://t.co/PLAzehL491",
    "766": "@philliesplswin @celtics @sixers @NBCSBoston @985TheSportsHub Wtf weirdo how many Celtics post have u gone through get a life also eagles are first round exits",
    "767": "@celtics Enes is finally free of Embiid for the season freedom is a fuckin bum and should be out of the league just like half of your team #gosixers",
    "768": "@huskiesplswin @celtics Agreed he got bodied again by embiid. Idk ehy ime keeps putting him against embiid. Now onder embiid goes off everyt time we play him",
    "769": "@celtics I love the fact the Boston Celtics copied the Sixers logo.  Did an intern in Boston come up with this?  I will just change the 6 to a 5 and no one will notice! #HereTheyCome https://t.co/f1vVEglpOP",
    "770": "#Philadelphia76ers - #BostonCeltics 111:99\n#NBA\n🇺🇲🏀🇺🇲🏀🇺🇲🏀\n\nMore info: https://t.co/O8jULnJzR8 https://t.co/XmYG3SwdUS",
    "771": "@celtics Aren't you tired of the same old story?",
    "772": "NBA\n\nFT.\n\nCharlotte Hornets 109 - 116 Orlando magic\n\nDetroit Pistons 103 - 87 Toronto Raptors\n\nIndiana pacers 94 - 112 Phoenix Suns\n\nPhiladelphia 76ers 111 - 99 Boston Celtics\n\nChicago Bulls 96 - 138 GSW\n\nMiami Heat 124 - 118 Hawks\n\nSpurs 109 - 114 Cavs\n#TheGamePlan",
    "773": "@celtics Hate to say it but fire Udoka",
    "774": "@celtics Just more PT to those bench players especially the young guns!",
    "775": "@Pavel9792 @celtics A good day ended when we saw the end of the game",
    "776": "@Jack_8537 @celtics To be honest, it's sad to have to substitute with 10 minutes to go",
    "777": "Joel Embiid and the 76ers take down Jayson Tatum's Celtics, 111-99, in Eastern conference face-off! 🔥\n\n#joelembiid #jaysontatum #76ers #bostonceltics #nba https://t.co/AtN9Nw0uRi",
    "778": "Encerrado:\n\nPhiladelphia 76ers (24-17) 111 x 99 (21-22) Boston Celtics\n\nPHI 📊\nJoel Embiid: 25PTS/13REB/6AST/1STL/1BLK\nTyrese Maxey: 23PTS/5AST/1STL\n\nBOS 📊\nJaylen Brown: 21PTS/2REB/1AST\nJayson Tatum: 20PTS/11REB/5AST\n\n#NBA https://t.co/BkeqpLuTs8",
    "779": "Two blocks too! @sixers @ATLHawks @celtics  @DetroitPistons I guess in a three teamer https://t.co/fDP6FydeAy",
    "780": "@celtics Well I wd say your not doing a great job at it",
    "781": "@Shell_Ken @celtics Somebody said “bust his ass boay” 😂😂😂",
    "782": "The amount of wide open 3s you'd get if you played with the Jay's ☘️☘️ @buddyhield @celtics @jaytatum0 @FCHWPO",
    "783": "@celtics just trade your players and start rebuilding bozos",
    "784": "@AlecFall0n @celtics Classic sixers fan comment",
    "785": "@celtics wild tweet intern",
    "786": "Joel Embiid had 25 points and 13 rebounds and the Philadelphia 76ers used a dominating start to roll to a 111-99 victory over the Boston Celtics on Friday night.\nhttps://t.co/PzX05YBXcL",
    "787": "@Nolan51266499 @TheyCallMeJL_94 @celtics We’re in the present buddy",
    "788": "@celtics We used to own these guys. Now it's the opposite.",
    "789": "@celtics So this is a whole ass article about a loss to wut 😭😂",
    "790": "The Philadelphia 76ers praise Matisse Thybulle for his defense in a win over the Boston Celtics.  https://t.co/fppiTsjSrD",
    "791": "Boston Celtics: Former Boston #Celtics two way center Tacko Fall signs deal with Canton Charge - Yahoo! Sports https://t.co/GtwYTUBGhG",
    "792": "PHILADELPHIA — Joel Embiid had 25 points and 13 rebounds and the Philadelphia 76ers used a dominating start to roll to a 111-99 victory over the Boston Celtics on Friday night. https://t.co/ST0oNjNn5C",
    "793": "boston celtics",
    "794": "@Nolan51266499 @TheyCallMeJL_94 @celtics Doesn't matter you nuffies have done nothing in the playoffs after that anyway",
    "795": "@celtics Embid was there for half of it! Pritch is a true point guard! Smart never played PG in college or HS! It’s wasn’t good w/o Smarts D tonite and it stinks when Marcus plays PG and crazy scorer! Ime is an idiot tryin to be loyal to Smart for endorsing him to coach Celts! Too obvious",
    "796": "Joel Embiid posted 25 points, 13 rebounds and six assists as the Philadelphia 76ers downed the visiting Boston Celtics 111-99 on Friday night for their eighth victory in nine games.\n\nhttps://t.co/M0Hukmt8i3",
    "797": "@celtics It's good to see the C's continuing the tradition of playing at least 3 out of every 4 quarters.",
    "798": "Joel Embiid had 25 points and 13 rebounds and the Philadelphia 76ers used a dominating start to roll to a 111-99 victory over the Boston Celtics on Friday night.\nhttps://t.co/hrRh9ixI7j",
    "799": "Boston Celtics 2008-2010 https://t.co/zVY39Ht6fJ",
    "800": "@Med4th @DanteOnDeck @celtics I think Smart and Hernangomez + 1 FRP and 1 SRP",
    "801": "@celtics Holy shit you tweeted this",
    "802": "@celtics At least embiid didnt get 30 lmfao thats the only good thing about this game",
    "803": "@celtics I have a feeling this tweet is gonna be a top 5 from this terrible season.",
    "804": ".@BostonSportsBSJ:  BSJ Game Report: Philadelphia 76ers 111, Boston Celtics 99 - Passive Celtics turn the ball over, get rolled by Sixers https://t.co/DitJbmD0vU",
    "805": "A few of the NYC Hoop Legends from L to R - former CCNY standout Floyd Lane, NBA Legend Nate “Tiny” Archibald, &amp; NYU standout and former New York Knick analyst Cal Ramsey RIP. #nychoops #NBA #BostonCeltics #NYKnicks #NYU #ccny https://t.co/jGpIHRu3Cs",
    "806": "@celtics Lol at this shit",
    "807": "@celtics It’s inexcusable that he isn’t developing romeo and nesmith.",
    "808": "@celtics Wow that's not what I saw...",
    "809": "@pettymilfs @celtics Trash @EnesFreedom",
    "810": "@rob_thibeault @celtics Get his ass",
    "811": "@celtics What is Ime doing bro",
    "812": "Boston Celtics Head Coach Calls Out Team For “Lack of Mental Toughness”\nhttps://t.co/vq1raEw8IL",
    "813": "@celtics Not Enes.",
    "814": "@celtics Putting in Enes Freedom and “our youngsters” with 9:17 left in the game isn’t admirable",
    "815": "@celtics This propaganda would’ve made the Soviet Union blush. I’m saddened to see this once glorious franchise is now reduced to celebrating moral victories. Is there a banner for that? #ThisTeamSucks",
    "816": "@honestJBfan @celtics Miami did it without their 2 best players Jimmy and Bam.. Celtics just sucks.",
    "817": "@CelticsCLNS @betonline_ag @HireOnLinkedIn do you need @KendrickPerkins to call you guys out again so you guys start playing with passion day in and day out? @celtics are consistent in being inconsistent🙄",
    "818": "20 turnovers... versus 9... Weak... @celtics https://t.co/Yo86ZeqQBW",
    "819": "@celtics Translation: Udoka punted on the game at the 9:17 mark with a home game v Bulls on tap tomorrow",
    "820": "@Nolan51266499 @TheyCallMeJL_94 @celtics Celtics won't make the playoffs, you fans know this team is garbage 🤫",
    "821": "Philadelphia 76ers star Joel Embiid reacts to losing his 30+ points streak after the win over the Boston Celtics.  https://t.co/EZVgEDipvD",
    "822": "@celtics Bench showed heart!!",
    "823": "@celtics The Celtics whenever they reach .500 https://t.co/3LhIsFPRyI",
    "824": "@IT4sReturn @celtics We did then we fell apart",
    "825": "@celtics Is this actually a real tweet",
    "826": "@celtics Enes has 14 mins with 0 points, 1 rebound, and a -10 lmao",
    "827": "@celtics You also put in Freedom in the first quarter and blew the game",
    "828": "BSJ Game Report: Philadelphia 76ers 111, Boston Celtics 99 - Passive Celtics turn the ball over, get rolled by Sixers\nhttps://t.co/lcMQFGB2eW",
    "829": "@celtics Who gives a fuck we lost",
    "830": "@celtics Trade freedom away he is useless",
    "831": "@celtics Udoka should have new career as spin doctor",
    "832": "Our youngsters and Enes Freedom checked in with 9:17 to go in Philly and carried an admirable level of competitiveness with them for the remainder of the night. https://t.co/5PZ6wBLP5j",
    "833": "Joel Embiid had 25 points and 13 rebounds and the Philadelphia 76ers used a dominating start to roll to a 111-99 victory over the Boston Celtics on Friday night.\nhttps://t.co/Zf1hnh3zTm",
    "834": "Boston Celtics have the best wing duo in the NBA and are a game under .500. Hard to do.",
    "835": "@NBCSCeltics start with playing the kids more. stop sticking to ur 7 man rotation who dont have enough passion abt the game. they were blah from the get-go. @smart_MS3 is the only one who has @celtics pride left.",
    "836": "@celtics 'Never satisfied' remember that.... Then shards his pants next game.",
    "837": "@Nolan51266499 @TheyCallMeJL_94 @celtics No point in even arguing ur teams ass this year",
    "838": "Boston Celtics: 76ers vs. #Celtics: How to Watch, Live Stream &amp; Odds for Friday Night - Sports Illustrated https://t.co/KqW0TH96Vd",
    "839": "@tony_maraj @bigpalpi @kirkgoldsberry @memgrizz @dallasmavs @Suns @MiamiHEAT @cavs @celtics No it really doesn’t",
    "840": "@305_lester @jamaicanceltic @GwashburnGlobe @celtics Exactly squad is top heavy.",
    "841": "New #NBAonFire episode ft. @JoelEmbiid @KlayThompson @nyknicks @celtics @Raptors @suzy899 You know what to do! Watch it now! Yeah meeen!  https://t.co/1qNrZKCmBR",
    "842": "@TIsuoiroton @celtics I wish i knew who you were.  If anyone does, DM me.  See you in hell.",
    "843": "@phillyphilly267 @celtics Jrich really tried to talk shit then got clamped 😂",
    "844": "@the21truth @jamaicanceltic @GwashburnGlobe @celtics He made a roster with no shooters",
    "845": "Boston Celtics - Lakers✔️\nGolden state Warriors ✔️\nBrooklyn Nets ✔️\nMiami Heats ✔️\nNew York knicks ⏳️🔜 https://t.co/biQ8uuhzcB",
    "846": "@celtics At first i think the core was 32-76",
    "847": "Boston Celtics News - 76ers lead 32-14 over the @celtics at the end of the 1st Quarter. #bostonceltics #celtics #bostonathlete #boston #basketball #NBA #NBA75 #bostonsports #BleedGreen #goceltics #bostonathletemagazine https://t.co/yNOSj5t3CP",
    "848": "The Philadelphia 76ers react to Matisse Thybulle taking a couple of flagrant fouls in the win over the Boston Celtics.  https://t.co/PvL6rIyxG0",
    "849": "@mariastephanos @Station11onmax and chewy brownie. Go @Patriots... and also @celtics fan every single day!",
    "850": "@Akjohnmahaney @tdgarden @NHLBruins @celtics Yes unfortunately.",
    "851": "@ShielaMahaney @tdgarden @NHLBruins @celtics So I can’t show up with just a negative results???",
    "852": "@celtics 35 points in 1 half… Celtics on vacation",
    "853": "@hornets @celtics @Raptors from the bottom of my heart… thank you",
    "854": "January 14 and ESPN already pulls @celtics v. @sixers . What a dumpster fire Boston has become.",
    "855": "@OLD_KINGCOLE @SLAMonline @celtics Stop",
    "856": "@KeithSmithNBA Desmond Bane would look really nice in a @celtics jersey right now….",
    "857": "@celtics Embarrassing!",
    "858": "@celtics Fire Ime Udoka NOW.",
    "859": "@LordBrOFFICIAL @celtics That’s an insult to garbage.",
    "860": "@lwrncwds @celtics Because there was NO CHANCE",
    "861": "@celtics And it wasn’t anywhere near as close as the score. As Tommy Heinsohn would say about this years team: “These guys are ridiculous”.  They’re pathetic. Bring back Sidney Wicks &amp; Curtis Rowe.",
    "862": "@celtics Pathetic",
    "863": "@anthonypic_999 @celtics Did you watch the game? LOL",
    "864": "@DanteOnDeck @celtics If we can get a shooter like buddy I’d get so excited. Someone other than Jays that can actually hit open shots would be amazing",
    "865": "@jamaicanceltic @GwashburnGlobe @celtics Brad isn’t coming back. Players gotta step up and stop playing soft",
    "866": "☘☘☘☘☘☘☘☘☘☘☘☘☘☘☘☘@SHO_RayDonovan Mickey and the @celtics died tonight ☘☘☘☘☘☘☘☘☘☘☘☘☘☘☘☘",
    "867": "@tdgarden @NHLBruins @celtics Nice, I'm sure this will stop the spread of covid 19",
    "868": "@philly248 @celtics This will set the Celtics back 8 years fs",
    "869": "@celtics You guys sounds like you need a defensive three time all star who hasn’t misssed a single shot this season",
    "870": "@celtics @BCCoachStevens it is time to make the call to @isaiahthomas. Stop being complicated!",
    "871": "@NickDePaula @jaytatum0 @celtics @ESPNNBA @boardroom @TheUndefeated @Jumpman23 Those 36's 🔥 and it's so a shame that we'll never be able to get a pair of those 🍋🧊🥛 36's",
    "872": "Boston Celtics the 5th damn worse team in the East and under .500. I’m gone sleep well knowing this",
    "873": "@_NeinLives @celtics Somebody else might score. Can't have that!",
    "874": "Brad needs to do something at the deadline cuz he knows us @celtics fans going crazy with concern about this team and it’s future",
    "875": "Friday, January 14th: the Boston Celtics do not currently hold a playoff spot. 10 of 15 EC teams make the playoffs.",
    "876": "@kelly_rdc Dave Cowans, Boston Celtics.",
    "877": "My allegiance will always be to the Boston Celtics but here’s a new tradition. I give my heart to a team from each conference every January until i die",
    "878": "@NickDePaula @jaytatum0 @celtics @ESPNNBA @boardroom @TheUndefeated @Jumpman23 Love them all.",
    "879": "@philly248 @celtics Funny you think Celtics would give you tatum",
    "880": "Brad Stevens comments on possible Isaiah Thomas Boston Celtics return https://t.co/Yw8IwFU0f1",
    "881": "@kirkgoldsberry @memgrizz @dallasmavs @Suns @MiamiHEAT @cavs @celtics The sneaky good Raptors. \n\n I sure hate those guys but they play the right way. Respect.",
    "882": "@celtics This team so pathetic when Marcus don’t play",
    "883": "@celtics Bruh I’m done with this team",
    "884": "@celtics Celtics lose, the world wins",
    "885": "@casekeenum does this and you just bail on him. Like how the @celtics did @isaiahthomas. The Curse of Case lives on. #purplepurgatory https://t.co/5XREjOdQhC",
    "886": "@lwrncwds @celtics maybe IME from franch",
    "887": "Trade for Jaylen Brunson @celtics",
    "888": "@HoppNo @celtics Should have started the beginning of the season.",
    "889": "@celtics No adjustment after a VERY low scoring 1st Q😒",
    "890": "@celtics And how did this go tonight ?",
    "891": "PHILADELPHIA (AP) — Joel Embiid had 25 points and 13 rebounds and the Philadelphia 76ers used a dominating start to roll to a 111-99 victory over the Boston Celtics on Friday night. https://t.co/RgzY0l5AmY",
    "892": "@celtics Pillow soft team.",
    "893": "@hotpot820 @celtics Developing? Steven is better than him when it comes to developing.",
    "894": "@GwashburnGlobe He is not Head Coach material. Period. His Bball Coach IQ is so bad\n Bring back Brad @celtics",
    "895": "@celtics Fire your coach is the best thing to do, easily give up.",
    "896": "@ArtCovUnion247 @Bawstan @DanteOnDeck @celtics Smart and Brown yes Tatum no",
    "897": "@NiceSheehan I love when the Boston Celtics appoint a HC who has never been a HC at any level.\n\nWhat better place to learn the ropes and waste valuable years of young all stars. So great.\n\nGoing to look back and laugh in 3 years when Brown is in ATL and Tatum is in DAL or wherever.",
    "898": "I have mad respect for @warriors but this one really hurt. 😖 @chicagobulls Onward to @celtics https://t.co/odpqFdUfpu",
    "899": "@greenbean3742 @celtics I know it sucks we lost need to bounce back tomorrow vs Bulls",
    "900": "@celtics Fire Ime, guys a joke, no wonder why it took him so long to get a head coaching gig",
    "901": "Joel Embiid had 25 points and 13 rebounds as the Philadelphia 76ers used a dominating start to roll to a victory over the Boston Celtics.\n\nhttps://t.co/r2Flef3mf6",
    "902": "So we really got 2 people scoring only one point! @celtics and all the people in the comments thought I was smoking kush yea hell outta here stats speak for themselves!!!!!! https://t.co/YlHZeHFMnc",
    "903": "@celtics Why don’t you put them in when your starters give up a 26-2 run. WTF?",
    "904": "@thatricekid7 @celtics I agree. All he is doing is getting comfortable because he has two stars on hus roster. He is not a good coach.",
    "905": "@celtics Sad coach.",
    "906": "TIME TO SIGN IT4 @KeithSmithNBA @ByJayKing @Celtics5th @celticsblog @CelticsBNews @celtics @John_Karalis",
    "907": "Watching the @celtics is bad for my mental health🤦🏾‍♂️",
    "908": "@celtics Brad Stevens Rollin over in his grave rn",
    "909": "@celtics I think I will take the day off too",
    "910": "Indiana Pacers 94 (Justin Holiday 25 pts, Domantas Sabonis 14 pts, 14 rebs) Phoenix Suns 112 (Devin Booker 35 pts, DeAndre Ayton 27 pts, 12 rebs), Philadelphia 76ers 111 (Joel Embiid 25 pts, 13 rebs) Boston Celtics 99 (Jayson Tatum 20 pts, 11 rebs)",
    "911": "@celtics No you started well for the first 4 minutes. But then you began to settle for jumpers not even 10 seconds into the shotclock.",
    "912": "@celtics @wojespn Celtics get Simmons and a pic, Philly gets Lillard, Portland gets Smart, Schroeder, Horford, Tobias, and Seth Curry… make it happen. All TEAMS WIN",
    "913": "Boston Celtics: REPORT: Boston #Celtics Interested In a Jeff Green Reunion Via Trade | SLAM https://t.co/AL6JzW5xy7",
    "914": "NBA @celtics at @sixers, Friday, January 14, 2022 @NBA @NBAstats #gamecharts #dataviz #nft https://t.co/uC6muuQkbQ",
    "915": "@celtics Dang it!",
    "916": "@celtics Wow, we're keeping it closer than I predicted. https://t.co/jneRO0jDg3",
    "917": "@Burner06137507 @celtics I live inside your head",
    "918": "@liisamariie93 Yes cheer up we are number 1 we need to win tomorrow against the Boston Celtics. #SEERED #BullsNation #RunWithUs.",
    "919": "@celtics BS. Your job is to win games",
    "920": "@ArtCovUnion247 @celtics L pp did better than Dennis",
    "921": "@Burner06137507 @celtics think youre just over emotional bro. nothing wrong with this quote. I also liked the play the young guys brought at the end",
    "922": "@celtics Sixers fan here we feared ainge. But to bring in a Brett brown disciple and have ur former coach with no player personnel experience jump into ainges role was insane to me . Accountability is nonexistent but brad stevens surrounded the jays with 🗑 disjointed unable to shoot 🗑",
    "923": "@Jamarri6601 @celtics Pritchard!? Lol",
    "924": "@celtics Keep Richardson,Rob, Smart, and Jays. Go get Harrison Barnes and John Collons. Bring in Yam Mader.",
    "925": "@celtics Stfustfustfustfustfustfustfustfustfustfu",
    "926": "@SimmoTheBurner @verdugoredsox @celtics Thanks bruh u too have a good night bro.",
    "927": "@celtics Rest the starters and start tanking",
    "928": "@celtics Not watching this team has been a superb positive!",
    "929": "@celtics So…does the tweeting finally stop for pushing guys to the all star game? I know this….tonight was another all star disaster!!",
    "930": "@celtics Coaching staff dont pressure them enough",
    "931": "Fucking @Celtics, man.\n\nCan't keep that team together, as is.\n\nDamn.",
    "932": "@celtics Fuck",
    "933": "@celtics fire ime",
    "934": "@celtics What was that performance??",
    "935": "@celtics Drive to the basket.",
    "936": "@celtics Ratioooooooo",
    "937": "@celtics ratio",
    "938": "@celtics This team blows so hard. Is it the 90’s all over again?",
    "939": "We weren't able to bounce back after a cold start to tonight's game in Philly. https://t.co/lmGtA5eMdx",
    "940": "@MrBeastBurner1 @verdugoredsox @celtics Nah bruh u dropping 50 gl my guy have a good one",
    "941": "@LetsGoCeltics1 @celtics Regular season don’t count",
    "942": "@Burner06137507 @SoxPatsCsplswin @celtics They can’t contend that’s obvious",
    "943": "@AlexisR52911633 @verdugoredsox @celtics Ok 10th seed talk to me quiet little boi. https://t.co/VTEXPz6BCJ",
    "944": "@sixers @cryptocom 💥💥 damn that Boston Celtics pack is hitting hard https://t.co/QcX3YmaCkW",
    "945": "@celtics if he is a coach i'm a face towel",
    "946": "@celtics Don't save yourself, can't even make a play, and easily give up! Talkative, to much talk, can't prove anything.",
    "947": "See you next season @celtics ...",
    "948": "@celtics Screw that we need win now players",
    "949": "@celtics Pain",
    "950": "@celtics I’m sorry, I tried to like him. But Ime isn’t the guy. If he can’t lead the team and figure out how to fix some of the issues, he has to go.",
    "951": "@celtics Fire this coach!",
    "952": "@celtics 💥💥Damn that Boston Celtics pack is hitting hard https://t.co/5umcnuT8b6",
    "953": "@ChrisDreamer @celtics time for Tatum to come to the LakeShow",
    "954": "Philadelphia 76ers vs. Boston  #Celtics NBA betting odds, lines, trends https://t.co/kdQrySgX6D",
    "955": "The Philadelphia 76ers defeat the Boston Celtics 111-99 off of 25 points from Joel Embiid. #BOSatPHI https://t.co/OShb4cBurC",
    "956": "Doi ser torcedor do Boston Celtics",
    "957": "@celtics Coaching staff needs to go they're awful\n\nThis is the Celtics supposed to be hanging banners\n\nNot being embarrassed way this team is this season\n\nI don't understand why people don't see it's the coaching staff they need to go",
    "958": "On the season the Celts fall to 3-12 when Jason Tatum has at least 4 Turnovers. @jaytatum0 committed 7 turnovers on Friday night in the road loss @76ers. When Tatum has 3 or fewer turns @celtics are 16-8 this season. @bostonsportsinf",
    "959": "@celtics Rather see some of those guys out there more. They play together and compete. Better than that iso ball we have been seeing…",
    "960": "@celtics still pain",
    "961": "@celtics Don't care. Ime trash. LIME LUDOKA",
    "962": "@celtics He’s need to take responsibility for poor coaching choices and needs to be fired.",
    "963": "@celtics Meanwhile the “STARS” had more than half, 12 of our 20 turnovers. \n\nThat is horrible. And they keep having high TOV games.",
    "964": "@celtics Time to pull Schroder &amp; Richardson &amp; play Pritchard.",
    "965": "@celtics Thanks Ime! Love that he's developing players in the midst of two of the top NBA players primes! Awesome !",
    "966": "Joel Embiid's streak ends, but Sixers top Celtics  #NBA\n #sixers #MADEinPHILA #celtics #BostonCeltics https://t.co/XZLkcRW0yb",
    "967": "@Nesmith_stan @celtics lol Maine Celtics are dominating we need their coach",
    "968": "@celtics Play them more!!!",
    "969": "@ArtCovUnion247 @celtics Can I offer you a 6’10” AllStar?",
    "970": "Boston Celtics: Jayson Tatum, Jaylen Brown, and their dual 30-point performances - #CelticsBlog https://t.co/a5OpuHRIJR",
    "971": "@nina_alston 76ers  beat  the Boston Celtics  76ers  is moving  up the standing",
    "972": "@celtics Send Schroder to the sharks and start PP",
    "973": "@celtics We’ll play them more please",
    "974": "@celtics Only good thing about tonight LMAO make trades",
    "975": "@celtics Maine celtics could use a coach like Ime",
    "976": "@JBsGoat @celtics and JB",
    "977": "@Burner06137507 @celtics this dude really thinks Ime is typing this lmfao",
    "978": "@celtics Are we done lying to ourselves? Tatum needs to go.",
    "979": "@DidTheSixersWin @celtics cannot hear Jimi!",
    "980": "@celtics Need bench help, and shooters surrounding the Js",
    "981": "@BostonCeltics_7 @SportsSell2 @sports_sell K last two at auction did $250 and $350.",
    "982": "@celtics just trade everyone but tatum and brown, they dont even try anymore",
    "983": "Ime Udoka says that he loved the competitiveness that our young guys showcased during their extended 4Q minutes. He told them that those minutes are invaluable to their development, and he wanted to see what they could do over the last 9+ of the game.",
    "984": "@celtics Enes “defensive liability” freedom",
    "985": "@celtics Owie...focus on what to fix...then fix it...and beat the next one.",
    "986": "Game 41: Philadelphia 76ers Win vs Boston Celtics. Joel 25 pts. Tyrese Maxey 23 pts &amp; 5-7 from 3. Seth 17 pts &amp; 5-9 from 3. Tobias Harris 17 pts. Andre 9 pts. Matisse Thybulle 8 pts. #Sixers #PhilaUnite #MoreyToCome #BrandNewEra #SomeWhereHinkieSmiles\nRecord: 24-17 (9-9 @ Home)",
    "987": "Losses to @dallasmavs @BrooklynNets and now @warriors next up @celtics and hot @memgrizz ...really separates @chicagobulls and the good teams in the @NBA  #GSWvsCHI",
    "988": "Could’ve used max Strauss or Desmond bane @celtics",
    "989": "@celtics you guys are a god damn mess. Figure it the fuck out",
    "990": "@celtics Why is Tatum still on the team? Trade him tonight",
    "991": "Indiana Pacers Postgame Media Availability (vs Boston Celtics) | January 12, 2021\nhttps://t.co/nHXr64x3be\nhttps://t.co/nHXr64x3be",
    "992": "@celtics Enough is enough #FIREUDOKA NOW",
    "993": "@SimmoTheBurner @verdugoredsox @celtics And your team do shit in the plaoffs so think again buddy before you run your mouth.",
    "994": "@celtics Welcome back to reality. That’s what happens when you meet a true playoff team. Get to work Brad. We need to improve the team.",
    "995": "@celtics 0-2 vs 76ers since this... makes you think https://t.co/P3vqSl5g0b",
    "996": "@JKorpusinski @celtics Nah Celtics will definetly win",
    "997": "@SimmoTheBurner @verdugoredsox @celtics Mhm. Wish me luck with my irl basketball game too. Our team sucks lmao.",
    "998": "@CurbumsBestPal @celtics what is your first language",
    "999": "@celtics So the goal is a .500 season then",
    "1000": "The Boston Celtics aren’t fun",
    "1001": "@theCyberZon @celtics Bulls are getting hammered today.\nNot tomorrow they will flog us\n.",
    "1002": "@CurbumsBestPal @celtics No spacing + no other offensive help/creation = harder to make shots\n\ndoes that help",
    "1003": "@Burner06137507 @SoxPatsCsplswin @celtics Nope, we're not Lakers fans",
    "1004": "@CurbumsBestPal @celtics Not doing this have a good night 👍🏽",
    "1005": "Just sign @isaiahthomas @celtics",
    "1006": "76ERS WIN!\n\nA equipe de Philadelphia bateu o Boston Celtics por 111 a 99. \n\nEmbiid: 25PTS/13REB/6AST\nMaxey: 23PTS/5AST\nHarris: 17PTS/9REB\n\nTatum: 20PTS/11REB/5AST\nBrown: 21PTS\n\n📷 Jesse D. Garrabrant\n\n#HereTheyCome #NBA75 https://t.co/5x65frc3e9",
    "1007": "@celtics Fix it Fox Jt Jb or Beal JT JB",
    "1008": "Day 2,049,625 of yelling at the @celtics to bring back @isaiahthomas",
    "1009": "@Kinggmee @celtics Lol mannnnnnn‼️😭",
    "1010": "@celtics @Amanda_Pflugrad We have no one to cover the likes of Embid!  Grrrrrrr!!! 🍀🍀🍀🍀",
    "1011": "@huskiesplswin @K843_T @celtics He’s useless at about every aspect of the sport of basketball besides rebounding but he can’t move at all so he’s just a tree log standing there",
    "1012": "@celtics Trade Ben for Jaylen so you can stop being such a poverty ridden franchise. Thank you :)",
    "1013": "@celtics  @FCHWPO @jaytatum0 come on we been balling we can have games losin lik tht especially against teams tht think they better💯 but Gg unto the bulls bring a win home",
    "1014": "Poverty @celtics",
    "1015": "@GAssingli @celtics Messin wit that man parlays 😂",
    "1016": "@celtics Steven develop, RWilliams,nesmith,rozier,thomas,brown,tatum,pritchard and other player, but this Udoka knows nothing.",
    "1017": "Celtics really need passing and defense. I know a guy @celtics",
    "1018": "The @celtics and @chicagobulls got exposed and embarrassed again tonight. \n\nAnd I don’t want to hear about Zach being out. Warriors didn’t have Klay, Draymond or Wiseman. Just cause Zach is out, doesn’t mean you fold and lose by 30+ at home. https://t.co/q7NpRN3iRJ",
    "1019": "@celtics Sad just sad",
    "1020": "@buks_chitown @verdugoredsox @celtics The franchise record for most consecutive 30 point games",
    "1021": "@celtics Clueless coach, steven develop nesmith and pp, but this udoka doesn't know anything, Steven already develop a multiple good celtics draft picks. Udoka can't develop any player, he is not good, he needs to be fire, Steven is better than him.",
    "1022": "Keep Smart too but everybody else gotta gtf @celtics",
    "1023": "@celtics Y'all just ass huh?!🥴",
    "1024": "@celtics Owned https://t.co/u5OJMsl4Nv",
    "1025": "@celtics As Perkins said, the entire organization, from Tatum and Brown, to Ime, to Brad, to the ownership, is too comfortable. Celtics fans expect more.",
    "1026": "@KyleNeubeck Especially @AnnaHorford Making up excuses why the @celtics got stomped.",
    "1027": "@celtics Last six games in Philadelphia, 6 - 0 76ers. Congratulations! Boston strong, right?",
    "1028": "@celtics Simply call the surrender team",
    "1029": "@CurbumsBestPal @celtics \"Not reading\" - 🤓",
    "1030": "@AProskauer @celtics Get OWNED https://t.co/LBe5HRZWse",
    "1031": "@MrBeastBurner1 @verdugoredsox @celtics Mb bro i comitted some friendly fire. Gf mah boi gl with your squad",
    "1032": "@celtics Relax guys it's only the 43rd game!",
    "1033": "@SimmoTheBurner @verdugoredsox @celtics Wait what record?",
    "1034": "@celtics The Celtics are so efficiently inefficient!",
    "1035": "@SimmoTheBurner @verdugoredsox @celtics Nah I meant im gonna ratio him with u. We're both Ws bro. Celtics sadly an L",
    "1036": "@celtics You’ve been Charlie Brown’d https://t.co/86wURZKdhV",
    "1037": "@CurbumsBestPal @celtics I mean yeah they didn't shoot well but they arent provided any spacing or any offensive help except Pritchard. Its hard to play well when literally no one else can create anything",
    "1038": "@shivlikes76ers @celtics Eh he was here like 9 years ago same thing",
    "1039": "@celtics Why sit Tatum for most of the last when we were still a chance?!",
    "1040": "@CurbumsBestPal @celtics Stop, Curry has been good but his supporting cast is amazing. Also why are you comparing arguably the best team in the NBA to the Celtics?",
    "1041": "@newbieX13 @celtics That's why we're shit.\nHim and Ainge.\nHe said watching Boston will be fun.\nOnly more of the same rubbish, they have played for the last two seasons.\nWhen he was in charge.",
    "1042": "@celtics Shit #BleedGreen https://t.co/mN088qC46n",
    "1043": "@celtics Get shooting on the team dummies",
    "1044": "@celtics tell brad to make a trade",
    "1045": "@celtics this roster not make it nowhere unless Brad does something cause jaylen brown and jayson cant do it by themselves https://t.co/uKmxaSPlGY",
    "1046": "@celtics Fans are shortchanged with this lousy effort from so called professionals. You pay them millions and they play like grade schoolers.",
    "1047": "@CurbumsBestPal @honestJBfan @celtics first half was bad but 2nd half they tried their hardest to get us back into it while everyone else did nothing",
    "1048": "@verdugoredsox @celtics Doc didn’t let him get the record*",
    "1049": "@celtics After further review Jaylen Brown is not worth Ben simmons. You will now Trade Jaylen Brown for Tobias Harris and you will like it.",
    "1050": "@celtics Tyrese Maxey looked like Curry against your bum ass squad 😂😂😂😂😂😂😂😂😂😂😂 Sixers own you https://t.co/MLGNs1K83Y",
    "1051": "@celtics not that mad just beat the lavine and caruso less bulls tomorrow",
    "1052": "Philadelphia 76ers sizzles past Boston Celtics 111-99 Joel Embiid 25points 13rebounds 6assists.",
    "1053": "@MrBeastBurner1 @SimmoTheBurner @verdugoredsox @celtics cook him lol",
    "1054": "@celtics Young guys outperformed everybody",
    "1055": "@celtics Trade Dennis so pp can play more",
    "1056": "@celtics Lets go!!!!!",
    "1057": "@tdgarden @NHLBruins @celtics Following “science”. What a joke",
    "1058": "@matheusnogalha @celtics Need to be traded ASAP",
    "1059": "@CurbumsBestPal @celtics what",
    "1060": "@celtics Celtics not 🅿️",
    "1061": "@K843_T @celtics Grant also got blown right by to the basket like 4 possessions in a row. Literally trade everyone except JT, JB, and Rob",
    "1062": "@celtics Should’ve signed lonzo or rondo last offseason",
    "1063": "@celtics Love to see it",
    "1064": "@jrdpj9991 @celtics 😂😂 that boy got BODDIED all game long",
    "1065": "@HPbasketball no team in NBA history has ever needed a journeyman PG who can run offense and hit the occasional 3 more than this year's Boston Celtics",
    "1066": "@tdgarden @NHLBruins @celtics F’ your Vaccine Mandate",
    "1067": "@celtics Led early.\nThat was it.\nCant bt any decent team,with any heart.\nPea hearts.",
    "1068": "@celtics Ratioooo",
    "1069": "The Sixers defeated future Sixer Jaylen Brown &amp; his soon to be former team the Boston Celtics tonight, dropping them below .500 which is just lovely, gonna celebrate with Shirley Temple",
    "1070": "@celtics Why Jayson and Jaylen gotta be the only ones shooting",
    "1071": "@SimmoTheBurner @verdugoredsox @celtics I'll help this sixes fan with the ratio bro.",
    "1072": "Aaron Nesmith - Boston Celtics\n10 PTS\n1 RBD\n1 AST\n1 BK\n2 STL\n[FD(21.7) DK(19.25)]",
    "1073": "Payton Pritchard - Boston Celtics\n17 PTS\n3 RBD\n4 AST\n1 STL\n1 TO\n[FD(28.6) DK(29.75)]",
    "1074": "@K843_T @celtics Poverty",
    "1075": "@celtics Fire Udumass",
    "1076": "@celtics Played with 0 urgency while we were by double digits since the 1st quarter. Ime keeps talking about getting the “Identity back” but let Drummond eat in the paint all game, doesnt use his bench as often as he should. This team is garbage",
    "1077": "@SimmoTheBurner @celtics Well yeah they played bad so they didn’t come back",
    "1078": "@Judon4President @verdugoredsox @celtics Sixers record for most consecutive 30 point games",
    "1079": "@huskiesplswin @PlayoffJays_ @K843_T @celtics yes bc he was guarding his dad embiid",
    "1080": "@celtics Who is shocked anymore",
    "1081": "@SoxPatsCsplswin @celtics I bet you think this team can still contend don’t you 😂😂",
    "1082": "@celtics What a shit performance. Reason why we are a .500 team. You guys play like a g-league team when it comes to playing a big game",
    "1083": "@verdugoredsox @celtics Didnt let them? Our coach didnt let him. You guys didnt do shit but lose the game so think again buddy😭😭😂",
    "1084": "Banner 18!!!☘ @celtics \n\n📷GettyImages\nBGC: GoodFon\n\n#BostonCeltics #Celtics #CelticsPride #BleedGreen https://t.co/RI2EjZqTJS",
    "1085": "@celtics Game was over 6 mins in the first quarter what a joke 🤦🏾‍♂️ https://t.co/EsqvCHz7Yf",
    "1086": "@PlayoffJays_ @K843_T @celtics he does that all the time, was it just even worse this time?",
    "1087": "@tdgarden @NHLBruins @celtics But the players are exempt from this rule???",
    "1088": "@celtics I hate udoka..WHY DIDNT YOU PUT TATUM AND BROWN IN..Pain",
    "1089": "@celtics Tatum has got to go!",
    "1090": "@The_PhifthQ @katetscott @sixers @celtics Already 21 and the sixers beat Boston? Perfect birthday",
    "1091": "@celtics Can pp play a lot every game from now on pls",
    "1092": "@celtics Thanks for cashing the over at least https://t.co/H7C3vmcM2W",
    "1093": "@CelticsGRD @celtics After the 8 TOs in the 1Q, I knew we were in for a long night 🤦🏻‍♂️🤦🏻‍♂️🤦🏻‍♂️",
    "1094": "@verdugoredsox @celtics Record for what?",
    "1095": "@huskiesplswin @K843_T @celtics Suck at basketball",
    "1096": "@celtics Tyrese Maxey is your daddy https://t.co/8RVAB0bn9G",
    "1097": "@celtics Trade everyone but the jays, smart , Rob and Prichard",
    "1098": "@celtics Still can’t beat a team who’s go to song after a win is all about counting",
    "1099": "@celtics Not surprised",
    "1100": "@K843_T @celtics what did mr. freedom do now",
    "1101": "@celtics How do you have 2 All-Stars and a couple capable role players and are the 11 seed in the East?",
    "1102": "@celtics Ok I understand why this game got taken off ESPN https://t.co/Fyp1mBcokG",
    "1103": "@celtics You should have let Pritchard play the whole game over Schroeder",
    "1104": "Final result Philadelphia 76ers 111 Boston Celtics 99 what a game 🏀🏀🏀🏀🏀🏀",
    "1105": "@celtics Garbage, make trades. We desperately need a shake up.",
    "1106": "@celtics Help Tatum and Brown bro they can't do everything lol",
    "1107": "@celtics Sell the team",
    "1108": "@celtics POVERTY LMFAOOOO",
    "1109": "@celtics Don't care. Like this so I can win my game tomorrow.",
    "1110": "@celtics At least the Bruins win",
    "1111": "@celtics please man https://t.co/vFE9gRigqe",
    "1112": "@celtics For once please stop losing",
    "1113": "@celtics Can’t blow a lead if you don’t have one",
    "1114": "@celtics Ratio",
    "1115": "@celtics LMFAO YALL SUCK",
    "1116": "@celtics Damn, that was embarassing https://t.co/uHklTncxG8",
    "1117": "@celtics didn’t let em get the record good job",
    "1118": "@celtics wat a joke",
    "1119": "@celtics Make some trades",
    "1120": "@celtics trade for haliburton now please",
    "1121": "@celtics Ratiooooooo",
    "1122": "NBA Final Score: PHI (24-17) defeats BOS (21-21) at home, 111-99. Score diff by qtr  +18 +20 +17 +12 @sixers @celtics #nba #FINALSCORE\nWhere's the nearest beach? https://t.co/ylJdxv7zdu",
    "1123": "@celtics Joke of a franchise. Blow it up and start over because this team is closer to the bottom of the league than competing for a title",
    "1124": "@celtics Game was decided in the first 12 minutes. Team is just too reliant on Tatum and Brown doing everything for this team. Also doesn’t help when they don’t have space to operate. Double big lineup needs to end. Also Enes should never step foot on a basketball court again.",
    "1125": "Final https://t.co/AePIpRbFBD",
    "1126": "@JasonDarosa1 @celtics I told ya😔😭",
    "1127": "@celtics Was this worthy of a post?",
    "1128": "You couldn’t hurt me tonight @celtics https://t.co/9GQb5n46yY",
    "1129": "Man, I hate the Boston Celtics",
    "1130": "The @celtics lose yet another one tonight against the @sixers 111-99",
    "1131": "Joel Embiid led the Philadelphia 76ers past the Boston Celtics at home to bounce back from a bad loss.  https://t.co/9oCrGsBKTr",
    "1132": "Get these practice jerseys off our court and back to your city @celtics",
    "1133": "@fantasyFFFreak @salimdagod @angerboston @celtics They bet Golden State with him lol.",
    "1134": "@NekiasNBA Goddamnit @celtics",
    "1135": "@celtics sitting all your starters with 6+ minutes to go?? What gives smh",
    "1136": "@AProskauer @phillyphilly267 @celtics Amazing core. Onward and upward for these guys",
    "1137": "We keep Jaylen @celtics",
    "1138": "@celtics yall are a joke",
    "1139": "@connerhammers @AProskauer @celtics Yea I really hope they keep this core. They’re playing great!",
    "1140": "Had to rewind to make sure i counted right lol..this is just crazy that this dude could get away with this! Smh, the ref is right there while he was in the paint for damn near the whole shot clock 😂. @celtics @espn @NBA @NBCSBoston @NBCSCeltics @NBAonTNT @SHAQ @SportsCenter https://t.co/oPJKv5FDGU",
    "1141": "@AProskauer @phillyphilly267 @celtics I was talking about this game.  Wow…..ok. I take it back. You have an amazing defence!!!! Looked great in this game 👍",
    "1142": "@celtics y’all are bums especially schroder and horford!!!!",
    "1143": "@LetsGoCeltics1 @celtics With all that talent yall still ass",
    "1144": "I never watch any Boston Celtics game wey dem win... Na wa",
    "1145": "@Struzzy2401 @celtics 😂😂😂 I know more about basketball than you ever will. Have fun being a typical dumb Celtics fan who thinks this team can compete for a title.",
    "1146": "@celtics This coach has to go. He has no ability to coach this team. Pitiful.",
    "1147": "@LindaMcMaster18 @celtics Get yo weird ass off my tl bruh tf 😂",
    "1148": "Look at the eye test. Look at their stat lines. How in the hell is Dennis over Pritchard on the depth chart @celtics ???",
    "1149": "Wow! Nesmith takes a charge vs Embiid and survived. Makes a three the next possession. Unfortunately, Sixers starters are too much vs the Celtics bench. Game over. Looks like Sixers got the win. Hope the @tdgarden crowd helps boost the @Celtics vs Bulls tomorrow. #BOSvsPHI",
    "1150": "Bums @celtics",
    "1151": "@celtics This Celtics coach gives up on games way too early.. down 17 with 8 minutes left he throws in the towel. This is pro basketball! It’s not impossible to overcome that deficit and it’s not the first time he’s done it. Not good",
    "1152": "@celtics Sad as hell",
    "1153": "@celtics tell your fucking coach put his starters in the game tf !",
    "1154": "@AProskauer @connerhammers @celtics U have no room to talk ur getting destroyed and are under .500. Have fun missing the playoffs",
    "1155": "Lol at the @celtics pulling their starts with plenty of time life. Take that L",
    "1156": "Put Jaylen back in you cowards @celtics",
    "1157": "@celtics put Tatum on the floor 🤡s",
    "1158": "@DrewJenks25 @celtics That's what happens when you hire a coach solely based on skin color this mf set thos tm back to the twighlight zone",
    "1159": "@AProskauer @phillyphilly267 @celtics But I agree massive Prima Donna 😂😂😂😂😂",
    "1160": "@celtics too ass to let embiid get 30",
    "1161": "@connerhammers @AProskauer @celtics I’m a Philly fan if u think I’m a Boston fan lol",
    "1162": "The @Celtics stinking out loud is really quite enjoyable",
    "1163": "@AProskauer @phillyphilly267 @celtics Lols…you may have to take him bro. You team is shocking to watch. We are missing our second option and still pulling down your pants and giving you a spanking",
    "1164": "@Struzzy2401 @Burner06137507 @celtics Exactly",
    "1165": "Free @paytonpritch3 !!! @celtics",
    "1166": "Clean house! Everybody must go @celtics get a true PG, shooters and a real big man",
    "1167": "Y’all so mf weak @celtics",
    "1168": "@celtics get rid of ime and bring back brad i cant watch this horse shit anymore",
    "1169": "iight nvm fuck y’all @celtics https://t.co/duLkDZAugj",
    "1170": "Bruh why y’all so garbage @celtics",
    "1171": "@connerhammers @phillyphilly267 @celtics we dont want your coward prima donna who is scared to take open dunks 😂",
    "1172": "@BostonCeltics_7 @SportsSell2 @sports_sell I’d do $325 shipped",
    "1173": "If they name ain’t Tatum, Brown or Rob Will.. GET THEM NIGGAS TF OUTTA THERE!!!!! @celtics",
    "1174": "@celtics give me back Brad any day!! IME cannot motivate these guys at all. 9 min left and you take out your starters. Loser!!! While the sixes still churning",
    "1175": "@connerhammers @AProskauer @celtics I think brown and embiid could do great things together and bens defense would definitely help Boston",
    "1176": "@celtics 😰 Come on guys...let's go!!!!",
    "1177": "@Pavel9792 @celtics Or ‘knew this would happen’ and ‘wished we would win’ :)",
    "1178": "I look forward to Udokas post game presser where he talks about accountability and then blames the players. #FireUdoka @celtics",
    "1179": "@phillyphilly267 @AProskauer @celtics Agreed. Totally ineffective this game. But I’ll take him for Ben. Tatum and him can’t play on same team. They both want the ball too much. And also this Celtics defence was is bleeding points. No structure at all",
    "1180": "@realJasonHuang @celtics NFL playoffs tomorrow ain't nobody watching this shit",
    "1181": "@celtics stop shooting fucking 3s",
    "1182": "@queencityd @celtics I'm sure your just happy about all that then I know I'd be pissed",
    "1183": "@justyouknowhyyy @tdgarden @NHLBruins @celtics Stay home with your mask on if you’re scared Lndy",
    "1184": "Q3 Boston Celtics 66 - 83 Philadelphia",
    "1185": "@Thekid156 @celtics Clearly I should start betting NBA.  Celts are probably 30% in covering spreads",
    "1186": "@mikey_b1977 @celtics @umichbball @warriors @chicagobulls Celtics too! 👎🏽",
    "1187": "Wow! @paytonpritch3 #FastPP shooting well with 7 straight points for @Celtics to cut the deficit to 81-95 with about 7 minutes left in the 4th quarter. #BOSvsPHI",
    "1188": "@ZaeMcGuire @kirkgoldsberry @memgrizz @dallasmavs @Suns @MiamiHEAT @cavs @celtics @espn Just so you know, ESPN are basing that statement from this guy, so if anything we should blast this guy for the slander",
    "1189": "@celtics Cleared the bench with 8.5 left in game? Weird https://t.co/Zohgt7uLmt",
    "1190": "@celtics y’all ain’t 🅿️",
    "1191": "Celtics how many times must he show u over and over again? Payton Pritchard is clearly our best PG. just give the man the starting job and see what happens sheesh. @celtics",
    "1192": "@celtics Blow it up. 🧨",
    "1193": "The youngins are playing with that @celtics pride and passion!! dont sub them out Ime!!",
    "1194": "Ime didnt adjust. Doc is just outcoaching him. The sixers just keep punishing the @celtics for collapsing, double teaming and leaving sixers players on the side for open threes  @John_Karalis @Joe_Sway @Jimmy_Toscano",
    "1195": "@celtics Not even a comeback.\nOh it's to hard!.\nSoft team with no guts.",
    "1196": "@celtics Back on that bullshit",
    "1197": "Kinda looks like the @celtics are wearing practice uniforms tonight… https://t.co/d7pQHltD9u",
    "1198": "@celtics Look how Ime giveup, subbing out, hahahaha",
    "1199": "@coraliew @celtics @umichbball @warriors @chicagobulls More turnovers than a bakery",
    "1200": "Why is y’all getting blown out man wtf @celtics",
    "1201": "@mikey_b1977 @celtics @umichbball @warriors @chicagobulls Terrible!",
    "1202": "@nba_essays @kobehighlight Sasha Vujacic had a low iq flagrant foul on Dragic that swung all the momentum towards the Suns and Kobe single-handedly pushed the Lakers through that 4th quarter to get a rematch against the dreaded Boston Celtics.",
    "1203": "Why is @celtics coach Ime Udoka giving up with over 9 minutes remaining. I am sorry but that is Bullshit.",
    "1204": "9 minutes and u take out starters @celtics y’all fucking suck",
    "1205": "@ArtCovUnion247 @yummyceltics @celtics no way ur old ass is back. i ain’t even get banned for saying i went crazy with ur daughter too smhhhh",
    "1206": "Hey @rob_williamsIII why dont you sometimes try the Theis seal that Jayson thrived on when Daniel was still with the @celtics to keep Jayson attacking the rim",
    "1207": "@celtics Tatum trying to get aggressive late in the game for allstar game stats..",
    "1208": "@Astros01510 @celtics Hah I play once in a while but it goes too goddamn late if you do well",
    "1209": "@PJULI98 @StevieHanks @celtics Yes.\nOnly pay them for a win.\nThat would be great.",
    "1210": "@AnthonyLGargano @asalciunas975 Chop Chop @celtics 🪓 🐐 🪓 🏈 🦅",
    "1211": "@KeithSmithNBA How many more mediocre games like this are needed before @BCCoachStevens and the @celtics realize the biggest problem is the coaching staff",
    "1212": "@celtics Major comeback fall short ?",
    "1213": "Taking advantage of driving the lane with Embiid out, seems like the way to go for Boston\n\n#Celtics #76ers",
    "1214": "@celtics Go Boston Celtics!",
    "1215": "@celtics such a good team eh?",
    "1216": "We got the @celtics next so we are good",
    "1217": "@TBEProxi @celtics Bulls will flog them.",
    "1218": "@newbieX13 @celtics Stevens had his time.\nWon nothing.",
    "1219": "@celtics Lmao https://t.co/kqk49mHlm1",
    "1220": "@celtics We were at 500.\nThat won't last long.",
    "1221": "@celtics Straight up nutless team..No nuts no glory",
    "1222": "@celtics Oh no! PLEASE get the baskets and points to catch up to the 76ers! GO CELTICS!",
    "1223": "@celtics You know at ht when down by 20.\nBoston wont come back.\nSchroeder awful.",
    "1224": "The @Celtics had a good offensive 3rd quarter with 31 points but didn't make enough stops so Sixers scored 28 pts. Tatum, Brown and Rob Williams lead the way on offense. #BOSvsPHI",
    "1225": "@celtics The coaching staff https://t.co/ANzcJTbJOD",
    "1226": "@celtics They suck!",
    "1227": "@YahooSportsNBA @celtics Means NOTHING for Ws. He is an empty points scorer. Like a Granger for the Pacers back in the day",
    "1228": "@celtics Tatum has got to go",
    "1229": "@celtics ok, we suck",
    "1230": "@celtics 66 points in 3Q. Embarrassing. No Smart = ZERO structure on the defensive end. Rob and Pritchard are the only 2 playing well.",
    "1231": "@celtics I'm actually glad the Garden won't let me in unvaxxed.",
    "1232": "@ChuckKellypbp @RyeGuy81 @tdgarden @NHLBruins @celtics 800,00+ and counting have died of your “cold”. 🙄 https://t.co/uQRyjfz9be",
    "1233": "@bestirstrata23 @celtics Nobody needs that shit when Buffstreams exists...",
    "1234": "@celtics Did anyone other than Tatum or brown touch the ball in Q3?",
    "1235": "@celtics In a zone for most of the quarter. Ime doesnt mix it up.  Just hoping Sixers will miss wide open threes.  This guy is a joke",
    "1236": "@bamadebayoheat @celtics lmfao",
    "1237": "@celtics Just great.",
    "1238": "Warriors get it they went and picked up Iggy key piece to there title run @celtics traded all their key piece to their eastern conference finals appearance smh.   You got rid of Rozier IT Bradley etc guess who really want it.  Smh",
    "1239": "@celtics Game over.",
    "1240": "The @celtics have some great talent on the team. But watch one game and you’ll see it’s just great talent who don’t want to play together.",
    "1241": "@celtics please can we please bring in shooters and playmakers for our damn duo im not trying to watch nobody touch the ball but tatum for 3 possessions in a row",
    "1242": "@celtics celtics gonna win 103-101",
    "1243": "@celtics Please back https://t.co/sTDPPbXzaB",
    "1244": "@celtics Don’t bother wasting your time trying to comeback just be ready for tomorrow",
    "1245": "@celtics Put some Respek on his name💯😤☘️🏁 https://t.co/BAL7oCcyZl",
    "1246": "@celtics Great job",
    "1247": "@celtics Trade trade trade bench trash for better bench trash this team our side of the jays smart and rob is trash",
    "1248": "@celtics At least we can't blow the lead",
    "1249": "🚨 UPDATE: Robert Williams III - Boston Celtics has a Double Double\n 3rd\n12 PTS\n14 RBD\n1 AST\n1 BK\n[FD(32.3) DK(34)]",
    "1250": "@celtics They only managed to minus 3 pts in that 20 pt lead 🤣🤣🤣",
    "1251": "@JasonDarosa1 @celtics Never gonna happen😔",
    "1252": "@celtics Udoka should be released",
    "1253": "@celtics fake comeback 🔜",
    "1254": "@celtics Ratio",
    "1255": "@celtics ime a great coach and Celtics play with a lot of heart and passion !",
    "1256": "@celtics This roster and coaching combo ain’t it.",
    "1257": "@celtics Y'all can't even get it under 15 💀",
    "1258": "@celtics This is sad boys",
    "1259": "@celtics celtics basketball https://t.co/s3eL5gTqlI",
    "1260": "@celtics Stop tweeting mf",
    "1261": "@celtics Fake comeback incoming",
    "1262": "@celtics Fake comeback incoming…🥳🥳",
    "1263": "@celtics We on fireb🔥🔥",
    "1264": "@celtics stop tweeting",
    "1265": "@celtics We suck",
    "1266": "@celtics Embarrassing",
    "1267": "@celtics Better but still trash",
    "1268": "One more quarter to go.\n\n@sixers 83\n@celtics 66",
    "1269": "@AProskauer @celtics Ur team has 66 points in 3 quarters yes ur team is in shambles bro🤣",
    "1270": "@RobertS45311472 @jbauer1337 @Joe45837832 @tdgarden @NHLBruins @celtics There absolutely aren't smoking areas in the garden and eating bad food does not pose the immediate risk that covid cases overloading our hospitals does. What century do you live in?",
    "1271": "@YahooSportsNBA @celtics BI does this 5x per game btw in better efficiency while averaging 6 assists.",
    "1272": "@Blizz_TP @Pavel9792 @celtics It b like that 😭😭😭😂",
    "1273": "🔴 Live▶ Boston Celtics vs Philadelphia 76ers - NBA League 2022\n🔴Live Now➠ https://t.co/rdzUhLwKDV\n1/14/2022 @ 7:00 PM",
    "1274": "@BrendanRitchie_ @Pavel9792 @celtics Lmaooooooo u already know i favorited that 🤣 COMEDY",
    "1275": "@MalcolmWillie95 @celtics With or without Smart, this team is lousy.",
    "1276": "@CoachP508 @celtics Vegas probably knows but the betters still think the Celtics are good",
    "1277": "Wakey wakey @celtics let's freaking gooooo🔥",
    "1278": "The @celtics summer league jerseys they are wearing tonight are gross",
    "1279": "@BrendanGlasheen @celtics How’s the team?",
    "1280": "@fritzglc @celtics We developed him into this ya cant do that or aren't willing to",
    "1281": "@celtics Just throw the fucking season away at this point",
    "1282": "@celtics get a POINT GUARD!!!!!!!! A very good POINT GUARD https://t.co/pIsUe7LuYr",
    "1283": "@BCCoachStevens @celtics lets get g.WILLIAMS, Prichard, Naismith a new team grab a sold sf/pf plays D and can shoot like crowder. pick up Demarcus cousins from the 10 day if possible for second team. We're 3 second 3 players away from having  a deep playoff/championship run",
    "1284": "@celtics Fans are shortchanged with this lousy effort from so called professionals. You pay them millions and they play like grade schoolers.",
    "1285": "@KeithSmithNBA Well… this is Boston Celtics.",
    "1286": "@tdgarden @NHLBruins @celtics So I can be vaxxed and have Covid and get in but Unvaxxed and proof of not having it and can’t ok.",
    "1287": "@MalcolmWillie95 @celtics Not gunna lie I was one of them wanting Smart out. But shit I see your point. This team is embarrassing, last few seasons including this one have been a waste",
    "1288": "It's just really NEAT how trash the Boston Celtics are now.",
    "1289": "It’s amazing the @celtics are this bad. \n\nCC: @BCCoachStevens",
    "1290": "@KyleJayRoy @hulu @espn @celtics @sixers because ESPN wanna showcase Golden State like every week smh",
    "1291": "Dear @celtics,  take notice, good things happen with Pritchard on the court. @ByJayKing",
    "1292": "@MalcolmWillie95 @DylanHudson5 @celtics Can’t say he’s playing great when he wasn’t. He’s playing a hell of a lot better in this half",
    "1293": "@celtics Robert William is a toy for Embiid! HAHAH",
    "1294": "Pass the ball please @celtics https://t.co/oX5vmA4G3T",
    "1295": "@K3BHunna @celtics They have a chance every year though",
    "1296": "@ArtCovUnion247 @celtics Jaylen is better",
    "1297": "🚨 UPDATE: Jayson Tatum - Boston Celtics has a Double Double\n2:19 3rd\n13 PTS\n11 RBD\n4 AST\n[FD(26.2) DK(32.25)]",
    "1298": "@NickDePaula @jaytatum0 @celtics @ESPNNBA @boardroom @TheUndefeated @Jumpman23 The lemonade ones are dope.",
    "1299": "Wow! @FCHWPO is feeling it with 10 straight points for @Celtics! 🔥 #BOSvsPHI",
    "1300": "Boston Celtics: Watch 76ers vs. #Celtics: How to live stream, TV channel, start time for Friday's NBA game ... https://t.co/vQQxhdy2AA",
    "1301": "Being a @celtics fan is disappointing",
    "1302": "@PapaDaddy_ @celtics No heart",
    "1303": "@JosephTommasi @tdgarden @NHLBruins @celtics Almost everyone shows vaccination card to get in, why would attendance drop?",
    "1304": "@RyeGuy81 @Vibrantankles @tdgarden @NHLBruins @celtics THANK YOU!!!",
    "1305": "Trade @FCHWPO @celtics",
    "1306": "@JLatelleXx @celtics are Like Crabs In A Bucket 🦀🪣😭 #FreeJB",
    "1307": "@coraliew @celtics @umichbball @warriors @chicagobulls I’ve watched the game for 5 mins and can see why, 4 TO’s",
    "1308": "Boston Celtics Vs. Philadelphia 76ers - NBA League 2022\n📺📱Official Live➠  https://t.co/tcbqMpmicB\nFriday, January 14, 2022 @ 7:00 PM",
    "1309": "@celtics I was expecting Udoka to come in and say we have thoroughbreds we're going to run. But when you draft guys that can't pass, don't know angles you avg 25 turnovers.",
    "1310": "@mikey_b1977 @celtics @umichbball @warriors @chicagobulls Some crazy games tonight for sure!",
    "1311": "@Celtics really made the wrong decision to waive Strus. Ugh! He would've helped spread the floor and much needed scoring. https://t.co/iScPGMSlIR",
    "1312": "SIXERS VS CELTICS LIVE REACTIONS | PHILADELPHIA 76ERS VS BOSTON CELTICS ... https://t.co/OAOHa73kxu via @YouTube",
    "1313": "The boston celtics used to be about championships n winning playing hardnose gritty bb n now were da laughing stock of da league w 2 stars on our team who u cant depend on where the celtics pride been missing for a few years now",
    "1314": "@Vibrantankles @mmari712 @tdgarden @NHLBruins @celtics Wow !!!  Dumbest tweet of the week",
    "1315": "@weinerdog44 @Topps @NBA @celtics Nice card.",
    "1316": "@madnessofmarch @tdgarden @NHLBruins @celtics Your numbers are wrong but even using your numbers it's still a VERY low number ...\n\nContinue to be terrified though, take your jab every 3 months and wear a face diaper. \n\n🤡🤡🤡🤡🤡🤡🤡🤡🤡",
    "1317": "@celtics You are not good Ime Udoka, remember that everyday.",
    "1318": "@celtics pathetic",
    "1319": "@philly248 @celtics Dude the Sixers should want nothing to do with Brown. He’ll have one great game, then 2 or 3 like tonight. Not dependable at all",
    "1320": "@celtics Brown and Tatum are horrible",
    "1321": "@celtics a Motivational speaker, but lack of coaching ability, fire him, he is not good, and can't be good, brad steven kick his ass when he is a assistant coach of the 76ers.",
    "1322": "@celtics Looking like a 40 point loss!  Awesome!",
    "1323": "This Boston Celtics season 😭😭😭\n#BleedGreen https://t.co/DNFsdttQmR",
    "1324": "Not saying the @celtics win this game with Marcus Smart but it’s even harder to win this game without Marcus Smart. Let’s see if the @celtics win against a GOOD team without the winning plays of Smart @CelticsCLNS @CELTICSBLOG @NBCSCeltics @RealBobManning @Jimmy_Toscano",
    "1325": "@celtics showing no toughness throughout this game!",
    "1326": "Remember when Pritchard played great in 1st half….but yeah let’s player Schroeder all these minutes. #FireUdoka @celtics",
    "1327": "@AProskauer @celtics And u are literally .500 and haven’t made it past the first round since the bubble💀",
    "1328": "@philly248 @celtics I'll take that all fucking day long   please. Let's do this",
    "1329": "@TIsuoiroton @celtics This is a Trash Take, bud.",
    "1330": "Boston Celtics: #Celtics-76ers: Game Time, Odds, Schedule, TV Channel, Betting Odds, and Live Stream ... https://t.co/6urYeVQBqn",
    "1331": "@phillyphilly267 @celtics Y’all ain’t made it past the 2nd round since Iverson which team is in shambles 😂😂",
    "1332": "@BFoley82 @McDTwin2 @celtics Haha I’ve been trying really hard- I have lapsed a lot lately- but been trying to vent less on here.",
    "1333": "@McDTwin2 @celtics @McDTwin1 Of course I meant both of you….can’t type",
    "1334": "I detest the Boston Celtics.",
    "1335": "Big rivalry game tonight for the 76ers as the host the Boston Celtics. Hoping  Joel Embiid continues performing well and the 76ers pull out the win! #SPM230 #NBA #76ers",
    "1336": "@Vibrantankles @Clangs52 @tdgarden @NHLBruins @celtics Oh, just saw the CDC is now saying cloth masks don't work like they've been telling everyone for almost 2 years. Science",
    "1337": "@_NeinLives @celtics A few a those got picked directly out of the hands...",
    "1338": "@Thekid156 @celtics They were only getting like 3.5.  I don't understand why Vegas respects them as much as they do.  Every line is like 4 points off from where it should be",
    "1339": "@coraliew @celtics @umichbball @warriors @chicagobulls And the Bulls are getting Waxxed?? What is it Opposite Day????",
    "1340": "@AProskauer @celtics U must’ve won the finals that year, right? Dude has to bring up something from 5 years ago bc his team is in shambles now 💀",
    "1341": "Will this be their lowest scoring game of the year? @1201PM @Scalabrine @ChrisForsberg_ @tvabby  \n@celtics @John_Karalis",
    "1342": "@JessicaHamel19 @Vibrantankles @RKOHEELCENA @tdgarden @NHLBruins @celtics Ok Doctor lmao",
    "1343": "@philly248 @celtics @philly248 We don't want Kyrie Irving in Philadelphia we already got one knuckle head in Ben Simmons we don't need anymore distraction here in Philadelphia.",
    "1344": "@BrendanGlasheen @celtics One bite? How was the pizza?",
    "1345": "@celtics let me get this right, so pritchard scored 8pts n 8 min and Udoka has decided to not put him back in?",
    "1346": "@Vibrantankles @Clangs52 @tdgarden @NHLBruins @celtics It's ok bud. This question is where the vaccinazis always clam right up because they can't answer it"
}