{
    "0": "Beat The Number on a Monday?\nYOU bet!\n\nCheck our draft, make your pick using #IMWITH\n\nSettle in, Pistons vs. Kings, NEXT on Bally Sports Detroit 🛋️ https://t.co/HSAfDNGXUj",
    "1": "@DetroitPistons @Kia LETSSS GO",
    "2": "First 5 reppin' the D tonight 💥 \n\n@Kia | #Pistons https://t.co/JMbGXfISB9",
    "3": "Damn kinda sucks when The Rolling Stones are performing at Ford field and I’m just tryin to catch a Pistons Kings Monday night tilt, Detroit is boppin",
    "4": "Home sweet home 🏡\n\n#ULTRADrip | @MichelobULTRA",
    "5": "The @DetroitPistons starting Hayes, Cunningham, Bey, Grant, Stewart on Monday. #DetroitBasketball #NBA",
    "6": "Tonight's starting lineup for the Detroit Pistons: Hayes, Cunningham, Bey, Grant, Stewart https://t.co/bVWH4Av1bs",
    "7": "@AURavensMBB @HCACDIII @Mauriceknight_2 You know what to do @DetroitPistons",
    "8": "Y'all spoke! You think the Kings are BEATING the Detroit Pistons tonight! \n\nGo Kings! #SacramentoProud https://t.co/Dq7ZyhVqqg",
    "9": "Detroit Pistons - Sacramento Kings\nCleveland Cavaliers - Boston Celtics\nWashington Wizards - New Orleans Pelicans\nAtlanta Hawks - Orlando Magic\nSan Francisco 49ers - Los Angeles Rams\n\nBet slip link: https://t.co/VTI57ZxOeC https://t.co/UtxJlUO5n6",
    "10": "Detroit Piston , let's get anther win tonite motor city",
    "11": "@BrittMarye At first I thought that’s how she was revealing the baby.. didn’t know the shower would be a Detroit pistons themed baby shower 😂",
    "12": "Power Hour is in full swing tonight!\n\nPower Hour | @DiscountTire https://t.co/6qsZf3kDqZ",
    "13": "@DetroitPistons @HenryFordNews Bring bagley back with us after the game",
    "14": "A heads-up for anyone heading to downtown #Detroit for the Rolling Stones show at Ford Field or the #Pistons game at Little Caesars Arena: https://t.co/jb5DJPMJuP",
    "15": "@DetroitPistons Just give us the horse power logo",
    "16": "@GomezSource Good evening @GomezSource.😃 That is good about you are hanging out with your friends.😐 I have to finish my paperwork because I want to see my companions Selena.😐 I going to see Detroit Pistons tonight.😐 If you here about in the Little Census’s Arena Selena.😐 Goodbye.😃",
    "17": "@DetroitPistons @HenryFordNews 3 out of 4 wins. Could it be ?",
    "18": "@ShaylasWorld @DetroitPistons Thank youuuuu!",
    "19": "@_ms_izzy @DetroitPistons My sister lives in GRR, Higgins is awesome. We had a cabin on Pickerel, about 45 min N of Higgins. Best memories ever.",
    "20": "Detroit Pistons recall pair of players ahead of tonight’s game vs. Kings https://t.co/eTjjqOHE0w",
    "21": "@DetroitPistons @HenryFordNews Louis king pistons legend",
    "22": "@_ms_izzy @DetroitPistons I grew up in Saginaw.  Left when I joined the Army 36 years ago.... never left my heart though",
    "23": "Tonight's @HenryFordNews injury/status report against the visiting Sacramento Kings: https://t.co/EESuJevIaK",
    "24": "@_ms_izzy @DetroitPistons F....g eh right!!!!  except that other Mich state team ...unless they are playing OSU... https://t.co/MYRsnDWqp4",
    "25": "🏀 PISTONS GAMEDAY 🏀\n\nTonight Sacramento comes to town for a game with Isaiah Stewart and the Pistons. Can Detroit follow a strong performance in Toronto with another W?\n\n📺: Bally Sports Detroit\n🏀: 7 PM EST https://t.co/s3xpKKCH2G",
    "26": "@lozenp @WeAreSinclair @BallySportsDET @DetroitPistons @DetroitRedWings Sinclair likes to use their catch phrase “Sinclair cares” when in reality they most certainly do not. Well, unless it is money you are talking about. They will screw EVERYONE they can to get more money.",
    "27": "We asked our middle schoolers who participated in this summer's @detroitpistons Youth Community Giving Challenge why they thought charitable work is important. We love this answer from Maien! Read more reflections at https://t.co/PxHPPXlDO0 #SAYDetroit #NationalPhilanthropyDay https://t.co/XKup84pmJg",
    "28": "@_ms_izzy @DetroitPistons Is that the outfit too? Hmmm may have to get ticket and fly in for the show …. 😉lol",
    "29": "@_ms_izzy @DetroitPistons They need this win so bad too",
    "30": "@plofficial @DetroitPistons Congratulations",
    "31": "@_ms_izzy @DetroitPistons I don't do Instagram but I love my Pistons.",
    "32": "@_ms_izzy @DetroitPistons Go Zey!",
    "33": "🏀Representing Detroit Pistons VS Brooklyn Nets 🏀 James Harden @JHarden13 @NBA @DetroitPistons #basketball #nba #nike #Pistons https://t.co/v5P9kzJwAk",
    "34": "#Pistons have lost 8 straight home games when playing as underdogs. Detroit is the underdog given a 37% chance to beat #SacramentoProud \n\n#NBA #NBATwitter",
    "35": "🏀Representing Detroit Pistons VS Brooklyn Nets 🏀 Kevin Durant @NBA @DetroitPistons #basketball #nba #nike #Pistons https://t.co/mvVfsl7DCo",
    "36": "My #NBA Picks For 11/15/21:\n\nWashington #Wizards (-4.5) (-105)\nDetroit Pistons (+4) (-110)\n#Kings @ #Pistons - Over 215 (-105)\n#Bulls @ #Lakers - Under 216.5 (-105)\n\nMy Current ‘21-‘22 NBA Season Record: (16-5)\n\n#SportsBetting #GamblingTwitter #FreePicks #SportsBets",
    "37": "\"You know I've been feeling you since wayyyyy back\" 🎶\n\nMy love for Cade as a Piston dates back to his arrival at Oklahoma State, when possessions were the norm for him — and an absolute rarity for any Detroit Piston player for the entire previous decade https://t.co/f0ddNXxjRS",
    "38": "Downtown Detroit will be congested shortly. The @DetroitPistons are playing at @LCArena_Detroit and the @RollingStones will be at @fordfield at 7PM. #DetTraffic🚦🏀🎤 https://t.co/kFzsjcl4Aj",
    "39": "After much consideration, I have decided to root for the Detroit Pistons in tonight’s game against the Kings. This is a very difficult decision for me, but if it results in the departure of Luke Walton then I must for the long term success of the Sacramento Kings. https://t.co/BhkAqNneV9",
    "40": "From the 🎧 Podcast Player\n\nLOCKED ON RAPTORS\nToronto Raptors fall to Detroit Pistons 127-121, but Pascal Siakam and Dalano Banton steal the show\n\n🎙️ Sean Woodley\n⏲️ 37:44\n\n#Raptors #NBA\nhttps://t.co/Fa1CW8Yelj",
    "41": "Buddy I met in Canada while playing for the CFL just hit me with a Detroit Pistons Opportunity tonight! Ain’t heard from him in a while! But got in town &amp; hit me up for tonight’s events before the game! Good ppl know Good Ppl! Never Give Up 💪🏾",
    "42": "@bigboytrevvv @DetroitPistons Livers isn’t playing for a while, hasn’t even started in g league yet",
    "43": "🏀Representing Detroit Pistons VS Brooklyn Nets🏀 @NBA @DetroitPistons #basketball #nba #nike #Pistons https://t.co/vT6Vief7OU",
    "44": "@Perezidentialll @DetroitRedWings @DetroitPistons Lucas Raymond needs to score the first goal of the game 🐐",
    "45": "@DetroitPistons Cade sold out😭",
    "46": "Detroit Pistons recall pair of players ahead of tonight’s game vs. Kings https://t.co/1nMVC8wIMw",
    "47": "The Detroit #Pistons have recalled Saben Lee and Isaiah Livers from the Motor City #Cruise.",
    "48": "@DetroitPistons Can I ask why is no team dropping their city shorts.. suns,pistons, hornets,nuggets.. etc 🤔",
    "49": "@ditullio_alex @ATLHawks @sixers @DetroitPistons @Raptors I believe the longer the 76ers wait &amp; Simmons stays away, the lower his price tag becomes. Morey can talk all he wants about waiting until he gets the perfect offer, but it didn't come this summer before all the BS &amp; it sure as hell isnt going to come now that hes sitting at home",
    "50": "Unpopular opinion: I really liked the @DetroitPistons teal horse jerseys. https://t.co/vlgCgT9Ye6",
    "51": "Official ⁦@NBA⁩ City Edition Jersey anthem for the @DetroitPistons.  https://t.co/ogl2uEmGH2",
    "52": "@DetroitPistons Give us the shorts!",
    "53": "@BKuzan @DetroitPistons Much love, B!",
    "54": "@ditullio_alex @ATLHawks @sixers @DetroitPistons @Raptors I agree with Simmons is better then Grant, but his ass is at home &amp; likley not coming back to Philly. Grant would actually play basketball and help the Sixers win games. Ideally i would of included Danny Green instead of Curry but he cant be traded until 12/15.",
    "55": "@DetroitPistons we want the shortssssssss",
    "56": "@MotorCityHoops @ranijacobs Didn’t know that the Grinch was covering the Detroit Pistons this season",
    "57": "@TayeMarquis @DetroitPistons Hel yea",
    "58": "@plofficial @DetroitPistons I was waiting for this man!!!",
    "59": "@plofficial @DetroitPistons lets go P!",
    "60": "@AscKurosaki @DetroitPistons When Rip Shook his Mask Like that after they won that shit was LEGENDARY 🤦🏽‍♂️🔥 #Chills",
    "61": "@DetroitPistons Deliver to the UK pleaseeeee 😩😩",
    "62": "Extremely excited to musically cover the @DetroitPistons official 2021-22 Remix Edition collection! 🙏🏽 Available NOW! https://t.co/5lTCnzst8n",
    "63": "@DetroitPistons \"I'm talking dreaming so hard some nights it feels like draft day...But when you're getting fast money, slow down. Don't crash. With all the drive in the world, swear you still need gas. Look. Think about it. Close your eyes. Dream about it.\"🔥😤\nhttps://t.co/vXT7XQjmmv",
    "64": "@IAmHarleyJay @PointGreatness @30pjcoons30 LeBron got cocky for a good reason. He put Jae in his place and won the game for them. Game 3 has nothing to do with the rest of that series. Lakers lost cuz they weren’t as good. A 75% Bron and no ad??? We would’ve lost to the Detroit pistons lmao",
    "65": "Detroit Pistons TV Broadcast Schedule https://t.co/zAC0JgaR45",
    "66": "@DetroitPistons How u gon say full set and not drop the shorts 🤔🤔🤦🏽‍♂️",
    "67": "@DetroitPistons Y’all gonna release the shorts too??",
    "68": "Detroit Pistons Predictions and Preview for 11/15/2021 hosts Sacramento Kings.  Looking for betting action?  Find out if there is any value in our preview. #NBA #Basketball https://t.co/YsIoWC3q4J",
    "69": "🏆 Dropping our 2021-22 Remix Edition Collection 🏆\n\nFull set available now!\n\n🔥: https://t.co/1RpMACAzg3 https://t.co/9vrTAgjOhj",
    "70": "Sacramento Kings visits Detroit Pistons Predictions and Preview for 11/15/2021 today.  Who are we taking in this game?  Find out now. #NBA #Basketball https://t.co/YsIoWC3q4J",
    "71": "The Detroit Pistons have recalled Saben Lee and Isaiah Livers from the Motor City Cruise.",
    "72": "@DetroitPistons @Ticketmaster A dub incoming",
    "73": "The Detroit Pistons have recalled Saben Lee and Isaiah Livers from the Motor City Cruise, the team's G League affiliate.",
    "74": "@DetroitPistons @Ticketmaster Hey. Coming to the game friday with my nephew for his bday. Any chance to take him on the floor or get close to the players?  He is so excited.",
    "75": "#GrizzliesOTD in 2014: @MacBo50 set a single-game franchise record with a career-high 13 offensive rebounds in @memgrizz's 95-88 win over the Detroit Pistons.\n\nRandolph's 11 offensive boards in the second half stand as the most in any half by a Grizzlies player. https://t.co/C27nK04WDi",
    "76": "Back SACRAMENTO KINGS to BEAT Detroit Pistons tonight in the @NBA (Game Starts at 00.10 GMT) #NBA #Basketball",
    "77": "@DetroitPistons @Ticketmaster Lesssss goooooo!",
    "78": "#MondayMotivation coming at you in the form of our Celebrity Bartenders that will be at our Killer's Christmas event on December 2nd!! 🎄\n\nIntroducing Drew Lane of the Drew &amp; Mike Podcast, and Earl Cureton, former NBA player of the Detroit Pistons!!\n\n#KillersChristmas https://t.co/L4bIKlLe15",
    "79": "ON POINT: ICYMI Toronto Raptors struggles at home continue, lose 127-121 to Dwane Casey and the Pistons https://t.co/Fkd3l6TNhF By @OliveiraKyle #TorontoRaptors #Raptors #RTZ #DetroitPistons #Pistons #canball #NBA #onpoint",
    "80": "August Young\n\n4-Unit Play: Take #533 Over 215 -110 in Sacramento Kings @ Detroit Pistons (7:10p.m., Monday, November 15)\n4-Unit Play: Take #533 Over 222.5 in Phoenix Suns @ Minnesota Timberwolves (7:10p.m., Monday, November 15)",
    "81": "@Lionsbadboy @DetroitPistons @Ticketmaster I’ll take that",
    "82": "The squad is back in the city!\n\n4️⃣-game homestand. 🏡\n🎟: https://t.co/M7QJ9zLaZ6\n\n@Ticketmaster | #Pistons https://t.co/yBz3E7s0tL",
    "83": "Charlotte Hornets and Detroit Pistons are trading @GrantEnjoyer to the Boston Celtics in exchange of nothing, he told me. @GrantEnjoyer has said that he is excited to join the Celtics Community.",
    "84": "𝗚𝗔𝗠𝗘𝗗𝗔𝗬\n🏀 » Sacramento Kings at Detroit Pistons\n⏰ » 4:00 PM PST\n📺 » NBCS CA\n📍 » Little Caesars Arena https://t.co/GHPH4mQwR5",
    "85": "Prior to playing together, every session begins with reading! Last week we learned about the Resilience of Michael Jordan! \n\nOur partnership with the Detroit Pistons allows us to not only program, but to expose youth to reading &amp; learning through our #BooksBeforeBalls Initiative. https://t.co/toSH7YbcXp",
    "86": "@TheAthletic @sam_amick @ShamsCharania How ironic no one is talking about Detroit Pistons's coach?",
    "87": "🏀 #NBA\n\nSacramento Kings 🆚 Detroit Pistons\n📆 Mar 16 nov 01:10\n\n#Raspibets #FreePicks #FreeTips #StatBets #SportsBetting #BettingTipster #Kings #DetroitBasketball\n🆓🔎📈⬇ https://t.co/s8vnYRbWNW",
    "88": "TOP 10 RESUMIDO:\n\n1- Los Angeles Lakers\n2- Boston Celtics\n3- Golden State Warriors\n4- New York Knicks\n5- Chicago Bulls\n6- Philadelphia 76ers\n7- San Antonio Spurs\n8- Detroit Pistons\n9- Houston Rockets\n10- Milwaukee Bucks https://t.co/R7zRMV7rBO",
    "89": "Anybody with no plans tonight , scoop me i got floor seats for @DetroitPistons game.",
    "90": "@DetroitPistons I thought City Edition jerseys went on sale today? Gotta pick up a @CadeCunningham_",
    "91": "New Post on https://t.co/QRQjo8mVZW\n\nIs the Honeymoon in Detroit over for Troy Weaver?\n\nhttps://t.co/BQQVlEINyS\n\n#Pistons #DetroitPistons https://t.co/HQuqACoXZ4",
    "92": "@DetroitPistons when do those City editions come out 👀👀",
    "93": "the detroit pistons play tonight :)",
    "94": "@PukajloEvan I think there’s All Star potential from guys on our team, but I don’t sense superstar potential from anyone. \n\nLebron, Steph, Kawhi, Duncan, Dirk, Shaq, Kobe, Jordan.. these are the guys who own all the championships in the last 30 years.\n\nOnly outlier is 2004 Detroit Pistons.",
    "95": "This week we're giving away a gift card and a CASH prize. Click the link below to learn more! \n\n11/15 - $200 Cash Prize 💵 \n11/17 - $150 Gift Card (Pistons313Shop) 💳\n11/19 - $500 Cash Prize 💵 \n11/21 - $500 Cash Prize 💵 \n\n🔗: https://t.co/KqtXpSQh4t https://t.co/fnLtmxGkOo",
    "96": "Hey @DetroitPistons can you help me out? am i stupid or can i truly still not get a white Cade jersey anywhere?",
    "97": "@DetroitPistons writer @detnewsRodBeard joined the @NBAPANEL .. We discussed the @DetroitPistons &amp; other topics‼️ #NBA #NBA75 #Pistons #NBATwitter https://t.co/teOMjA9cR3",
    "98": "As the official team physicians of the @DetroitPistons, we are proud to keep our greatest athletes and their biggest fans at their best. Let’s go Pistons! Details: https://t.co/PuJNzUIPYa https://t.co/GhQlaCX5Ik",
    "99": "@LedgieNbaDet @ATLHawks @sixers @DetroitPistons @Raptors Thanks. Your Bagley trade idea won't be allowed until January 15th because of Diallo's trade restriction.",
    "100": "@nikebasketball Do you know when the @DetroitPistons @CadeCunningham_  will be available online ? #Pistons",
    "101": "As excited as I am to see my first @DetroitPistons game at @LCArena_Detroit , I'm as equally disappointed their online clothing stops at a 3XL and I can't buy any any gear to wear that isn't a hat.",
    "102": "@NBAMockTrades @ATLHawks @sixers @DetroitPistons @Raptors I really like this for all sides. Then just add in Sacramento and do Hami for Bagley 😂",
    "103": "Detroit Pistons: Does a trade for Marvin Bagley III make sense? (via @PolitoedHoops)\nhttps://t.co/BDg9u23v3V",
    "104": "@ClinkSlays On my way to Detroit rn then… can we go to a pistons game too??",
    "105": "Tap in with our @NewEraCap 1️⃣/4️⃣ Zip Jacket for tonight's Item of the Game! \n\n🔗: https://t.co/XlWlH5RdvP https://t.co/aQuYMAUVfV",
    "106": "@shamshammgod Are you a Detroit fan because if the kings win or lose don't have nothing to do with Detroit. Sounding like if the kings loose to the lowly pistons👀",
    "107": "@TheAthletic @sam_amick @ShamsCharania @DetroitPistons y’all better win.. and by 20",
    "108": "@DetroitPistons @SacramentoKings @BallySportsDET @WWJ950 @Shopify @LCArena_Detroit Pick up another W",
    "109": "SOMEBODY NEEDTO SIGN @StephensonLance \n@Lakers @LAClippers @hornets @Suns @BrooklynNets @nyknicks @Pacers @ATLHawks @SacramentoKings @MiamiHEAT @OrlandoMagic @Timberwolves @dallasmavs @warriors @PelicansNBA @okcthunder @DetroitPistons @trailblazers @chicagobulls @celtics @sixers",
    "110": "excited to announce i will be hosting the first ever episode of the podcast \"Suite Seats\" tomorrow! topics include: the pistons, the start of the nba season, nfl, and detroit tigers news regarding recent off-season happenings.",
    "111": "Dropping this report on the same day the Kings are in Detroit to play the Pistons... \n\nIf the team doesn't show up with Walton's job on the line against one of the worst teams in the NBA, it's probably time to pull the plug. https://t.co/qywhTS9fVw",
    "112": "So wait, @WeAreSinclair buys a crap-ton of RSNs (like @BallySportsDET) immediately rips them from ALL streaming services (Hulu, YouTube et al) AND Dish Network? And teams like the @DetroitPistons @DetroitRedWings re-up with Bally? Who can actually watch these games? What a joke https://t.co/QrfvWOlKNP",
    "113": "Let's go @DetroitPistons \n\nI've never asked you anything before. https://t.co/Jyi1XHZ4Pr",
    "114": "@TheAthletic @ShamsCharania @sam_amick C’mon @NicolasHenkel!!! Let’s go @DetroitPistons!!!!!!!!!!",
    "115": "@DetroitPistons @SacramentoKings @BallySportsDET @WWJ950 @Shopify @LCArena_Detroit Please beat us",
    "116": "#1 Detroit Pistons fan for the night https://t.co/8wxGsiDnRh",
    "117": "#sacramentoKings take on the #detroitpistons tonight in Detroit … Kings are -4.5 in Vegas … who wins? \n\n#SacramentoProud",
    "118": "put them out of their misery @DetroitPistons https://t.co/y7i6fsM3MR",
    "119": "the detroit pistons will win a game of basketball tonight",
    "120": "Pistons vs. Kings preview: Struggling Sacramento Kings travel to Detroit to face the improving Detroit Pistons https://t.co/CWvxt82dTL",
    "121": "Fun-fact that means absolutely nothing:\n\nThe Sacramento Kings &amp; Detroit Pistons have played 346 regular season matchups since the 1948-49 season.\n\nThe all-time head-to-head series is currently tied at 173-173 heading into tonight's matchup.",
    "122": "@IKBarberShop Wayne Ellington is starting to show why he shot 42.2 % for 3-pointers last season with Detroit Pistons off 6.0 attempts. 2nd Unit is perfect = won't be smothered by the Lakers Big-3 scoring attack.",
    "123": "Detroit Pistons Legend on Scottie Pippen and Michael Jordan: “Hate to See That Legacy Tainted” https://t.co/NmK7x2Xua1",
    "124": "EUA - NBA 🇺🇸🏀\n\n📺 Detroit Pistons x Sacramento Kings\n🏀 Sacramento Kings e Ambos marcam 100 Pontos \n⏰ 21:10\n💱 2.700\n💰 Stake 2⃣ https://t.co/QFLZ8EPzrA",
    "125": "This weekend… \n\nFriday: Pistons L, MSU Basketball W,\n\nSaturday: Pistons W, Red Wings W, MSU Football W, UM football W, UM Basketball W\n\nSunday: Lions Tie\n\nDetroit Sports 6-1-1 over the weekend!",
    "126": "@CultIncDetroit @DetroitPistons @SacramentoKings @BallySportsDET @WWJ950 @Shopify @LCArena_Detroit Good looks",
    "127": "@poppiey29 @DetroitPistons @SacramentoKings @BallySportsDET @WWJ950 @Shopify @LCArena_Detroit they're up on pistons313shop, apparently the social media team doesn't want us to give the team money",
    "128": "@CultIncDetroit @DetroitPistons @SacramentoKings @BallySportsDET @WWJ950 @Shopify @LCArena_Detroit Facts",
    "129": "@DetroitPistons @SacramentoKings @BallySportsDET @WWJ950 @Shopify @LCArena_Detroit Where is the city gear at my guy? 🤷🏾‍♂️",
    "130": "Join @SentheSportsLaw tomorrow at 5pm for the Sports Law Lecture Series with Jhonika Hawkins, Director of Executive Operations and Team Services @DetroitPistons.\n\nRegister: https://t.co/2w1Dol7s9T https://t.co/jNlDVoBfqt",
    "131": "@trichlw Possibly. THT has a bright future for sure! Did I tell you My sister and I got tickets for when Chicago comes to Detroit in March? Someone was selling tickets crazy cheap on Ticketmaster, and we're basically two rows behind the Pistons bench for like $90. I need a Caruso shirt",
    "132": "@DetroitPistons @SacramentoKings @BallySportsDET @WWJ950 @Shopify @LCArena_Detroit Somebody gotta have a free Marvin sign😂😂",
    "133": "Cleveland Cavaliers - Boston Celtics\nDetroit Pistons - Sacramento Kings\nNew York Knicks - Indiana Pacers\nOklahoma City Thunder - Miami Heat\nMinnesota Timberwolves - Phoenix Suns\nPortland Trail Blazers - Toronto Raptors\n\nBet slip link: https://t.co/p6S4LEXtkt https://t.co/xEX3HcOBuK",
    "134": "@AndrewBernal87 @DetroitPistons Just got my Cade from their",
    "135": "@DetroitPistons can we get the link tot the city edition jerseys/shorts?",
    "136": "@DetroitPistons @SacramentoKings @BallySportsDET @WWJ950 @Shopify @LCArena_Detroit Thought we could buy city jerseys today?",
    "137": "@NBASTORE when the shorts dropping for all the teams? I can't even get my detroit pistons shorts",
    "138": "@CaipiraTips Cleveland Cavaliers\nDetroit Pistons\nWashington Wizards\nAtlanta Hawks\nIndiana Pacers\nDenver Nuggets\nMemphis Grizzlies\nPhoenix Suns\nMiami Heat\nPortland Trailblazers\nLA Lakers",
    "139": "Monday's #NBA75 #BettingPicks by @SpreadAstaire \n\n🏀 Sacramento Kings vs Detroit Pistons: Banker at -110 (1.91)\n\n#NBATwitter  #NBAPicks\n+ 2-Team Parlay at +265 (3.65) \n👇👇👇\nhttps://t.co/s4MtHDQa1q",
    "140": "Sacramento Kings vs. Detroit Pistons - NBA (11/15/21) | How to Watch, Start Time https://t.co/6lEjq919oO",
    "141": "Sacramento Kings vs. Detroit Pistons - NBA (11/15/21) | How to Watch, Start Time https://t.co/WdMhCI6ZpJ",
    "142": "Kings Gameday Live: Marvin Bagley III trade rumors in Detroit going into game vs. Pistons. \n\nUpdates throughout the day with news, notes, injury reports, TV/radio listings, odds, stats and more for tonight's Sacramento Kings-Detroit Pistons game.\n\nhttps://t.co/jtv5c1KZmu",
    "143": "@MadDogRadio The Detroit Lions, Oh excuse me!I just woke up from that Lifelong Dream!But how bout Saturday,Michigan, Michigan St,Red Wings,Pistons All Win! Lions Did Not lose Sunday &amp; We Woke up to the Tigers Signing Edoardo Rodriguez!There is hope for us Poor, Poor Detroit Fans! @AdamSchein",
    "144": "@DetroitPistons where are they 😭😭",
    "145": "@MeredithMagin @DetroitPistons Maybe you should try and get a favorite NBA player that you like",
    "146": "Sacramento Kings vs Detroit Pistons 2021-22 NBA Season Picks, Preview and Predictions | SportsNus https://t.co/C5BTJdzDcd",
    "147": "@LeighEllis @Raptors are losers this weekend...can't let coach Casey and the @DetroitPistons steal one in Toronto!\n\nWhat a waste of the a nice floor and sick jerseys.",
    "148": "@DetroitPistons @SacramentoKings @BallySportsDET @WWJ950 @Shopify @LCArena_Detroit It's Cade time. Nope, it's Cojo time. 😂",
    "149": "@DetroitPistons @SacramentoKings @BallySportsDET @WWJ950 @Shopify @LCArena_Detroit Why we showing off CoJo like he’s not the most hated player on this team",
    "150": "@AustinKent Did you even watch his @DetroitPistons seasons?\nDefinitely did not give his all.",
    "151": "@DetroitPistons @Keith_Langlois Yeah Detroit had some growth and it was great to see. They knocked off the dust from Cleveland bad game and went to Toronto and handled their business",
    "152": "@DetroitPistons @SacramentoKings @BallySportsDET @WWJ950 @Shopify @LCArena_Detroit AtPistons, I’ll go if you follow or I can continue the Stan parody and I’m getting close to the person in the trunk line🤔😳🤨",
    "153": "@DerySpeaks @Ligers_Pistons @totallytigersbb No but you don't have to crap on everything Detroit teams do either.",
    "154": "@DetroitPistons any word on what time the Pistons 313 Shop will be selling the new City Edition jerseys today? https://t.co/gRnbyMz7N3",
    "155": "@DetroitPistons @SacramentoKings @BallySportsDET @WWJ950 @Shopify @LCArena_Detroit after the game, keep bagley in detroit",
    "156": "Sacramento Kings vs. Detroit Pistons - NBA (11/15/21) | How to Watch, Start Time https://t.co/lx5xyem73v",
    "157": "@DetroitPistons @SacramentoKings @BallySportsDET @WWJ950 @Shopify @LCArena_Detroit Get cojo out of there",
    "158": "@DetroitPistons @SacramentoKings @BallySportsDET @WWJ950 @Shopify @LCArena_Detroit Trade Diallo, a second, for Bagley",
    "159": "@DetroitPistons @SacramentoKings @BallySportsDET @WWJ950 @Shopify @LCArena_Detroit Bro get this nigga off the page",
    "160": "via @TheSteinLine: \"While in Detroit, I was advised to put the Pistons down as a team to watch as a trade suitor for the Kings' disgruntled Marvin Bagley III.\"\n\nhttps://t.co/eoTE0Kf2Rq",
    "161": "@DetroitPistons @SacramentoKings @BallySportsDET @WWJ950 @Shopify @LCArena_Detroit Trade CoJo for bagley before the game",
    "162": "5-game homestand starts tonight against the @SacramentoKings 👑 \n\n📺 @BallySportsDET \n📻 @WWJ950 \n💻 𝗡𝗕𝗔 𝗟𝗲𝗮𝗴𝘂𝗲 𝗣𝗮𝘀𝘀 | https://t.co/PV8hXiHMVQ\n🤝 @Shopify | 𝗕𝗮𝗼𝗯𝗮𝗯 𝗙𝗮𝗿𝗲\n📌 @LCArena_Detroit https://t.co/6wkj2XuNGU",
    "163": "@Ligers_Pistons @totallytigersbb Okay sorry. I’ll just be like the rest of the Detroit media here. Hold on:\n\nGREAT SIGNING! HERE COME THE TIGERS!!! HINCH IS A GOD!!!",
    "164": "The Detroit Pistons will take on the Sacramento Kings at home tonight at 7pm ET. https://t.co/10PNwJV542",
    "165": "Sacramento Kings vs Detroit Pistons 11/15/2021 Picks Predictions Previews\n\nhttps://t.co/l51lSwiw9v\n\n#freepick #freepicks #NBA #NBApicks #NBAprediction #NBAbetting #NBAparlay #basketballpicks #sportsbetting #odds #picks #sportspicks #expertpicks #handicapper #Kings #Pistons https://t.co/TkHeA4JhnN",
    "166": "Detroit Pistons vs. Sacramento Kings: TV channel, time, radio, game info https://t.co/ilPNdq6WGJ https://t.co/0stXzyWSoo",
    "167": "DETROIT PISTONS CITY EDITION 59FIFTY HATS now available from NEWERACAP\n\n#newdrop #neweracap #nba #detroitpistons #pistons #detroitbasketball #detroit #michigan #city #edition #59fifty #hats #hatcrawler #fitted #caplover #hataddict\n\nhttps://t.co/ujIllBV13I",
    "168": "DETROIT PISTONS CITY EDITION ALT 59FIFTY HATS now available from NEWERACAP\n\n#newdrop #neweracap #nba #detroitpistons #pistons #detroitbasketball #detroit #michigan #city #edition #alt #59fifty #hats #hatcrawler #fitted\n\nhttps://t.co/hGgklfOdGq",
    "169": "Detroit Pistons vs. Sacramento Kings: TV channel, time, radio, game info https://t.co/4F8J1gmTTn",
    "170": "Detroit Pistons - Sacramento Kings Prediction &amp; Odds\n\nhttps://t.co/HRWz2JDOtd https://t.co/34alCSww1l",
    "171": "@amacdonell they just lost to the detroit pistons",
    "172": "21:00 – 🏀NBA\nBoston Celtics x Cleveland Cavaliers\nNBA LEAGUE PASS\nSacramento Kings x Detroit Pistons\nNBA LEAGUE PASS\nNO Pelicans x Washington Wizards\nNBA LEAGUE PASS\n21:30 – Orlando Magic x Atlanta Hawks\nNBA LEAGUE PASS\nIndiana Pacers x NY Knicks\nNBA LEAGUE PASS\n\n(+)",
    "173": "New @lockedonraptors where I go solo to break down the loss to Detroit on Saturday. Losing to the Pistons was bad, but I really can't be compelled to care when Pascal Siakam played like that. Forest, trees, etc.\n\nApple: https://t.co/nSZyAVZwX9\n \nYouTube: https://t.co/66GwBzBdoy https://t.co/P1UTfspAkx",
    "174": "$AFRM $COIN $GLBE $MP $SOFI $UPST and my only otc $GVSI and the ethereum killer #Solana #SolanaAirdrop - and my favorite team of all teams #detroitpistons https://t.co/EVozVTGv4X",
    "175": "Troy Weaver is building his version of the OKC big three in Detroit. This draft will bring the Pistons the final piece.",
    "176": "Sacramento Kings @ Detroit Pistons\nPick : Detroit Pistons.\nBasketball. NBA",
    "177": "Game Day On My Birthday. @DetroitPistons Go Pistons🎉⛹🏾‍♂️ #DetroitBasketball #detroitup https://t.co/mnjrCvbgvD",
    "178": "@Bonner_AG @UMichFootball @DetroitRedWings @DetroitPistons @DetroitLionsPro Don’t forget @USMNT dos a cero victory!",
    "179": "I NBA Podcast Day\n\n11:00h 🎙️ @B2BSpain 🏀 @AlexPistonsB2B, prometemos no hablar mucho de los @DetroitPistons 🤭\n\n#NBA #NBATwitter #NBA75 #Pistons #NBAPodcastDay https://t.co/xViS4OnFaX",
    "180": "Great sports weekend! @UMichFootball and UM Hoops win, @DetroitRedWings and @DetroitPistons win and @DetroitLionsPro didn’t lose!",
    "181": "2004 @DetroitPistons run was the best because EVERYONE but Pistons fans didn’t believe they would win it! Played the right way and dominated https://t.co/ztQx3W0kW6",
    "182": "@DetroitPistons make it happen https://t.co/rKraHVIWYM",
    "183": "Live pregame, in-game and postgame updates on tonight’s NBA game between the Sacramento Kings and Detroit Pistons. https://t.co/d8Qif0xXgP",
    "184": "Live pregame, in-game and postgame updates on tonight’s NBA game between the Sacramento Kings and Detroit Pistons. https://t.co/BwIX6o0PH4",
    "185": "Live pregame, in-game and postgame updates on tonight’s NBA game between the Sacramento Kings and Detroit Pistons. https://t.co/2OyxfvbFUc",
    "186": "NBA Day 2️⃣8️⃣ 🏀🏀🏀\nBoston Celtics vs Cleveland Cavaliers\nSacramento Kings vs Detroit Pistons\nNew Orleans Pelicans vs Washington Wizards\nOrlando Magic vs Atlanta Hawks\nIndiana Pacers vs vs New York Knicks\nDenver Nuggets vs Dallas Mavericks\nPhoenix Suns vs Minnesota Twolves",
    "187": "@mwabilimwagodi Built very different. He cut his teeth in that infamous 'Bad Boy' Detroit Pistons with the likes of Isaiah Thomas, Bill Laimbeer and Joe Dumars. Guys bullied kina Jordan mbaya sana.",
    "188": "15) “Malice at the Palace” The most infamous brawl in NBA history that occurred on 11/19/2004 between the Detroit Pistons, Indiana Pacers, and their fans https://t.co/H8yYG5m2GD",
    "189": "Detroit Pistons and Zelle Partner to Elevate Financial Fitness in Local Community https://t.co/QyHzZVQtJX #fintech #financetechnology #technology  #finance #fintechnews @Zelle",
    "190": "@Glancer44 @smartmoneybro1 @NBA @DetroitPistons Yes very good🤩",
    "191": "Sacramento Kings @ Detroit Pistons\n\nPlayer Points Projections \n\nhttps://t.co/qs2fd8Zi1W",
    "192": "The latest edition of Sporting Narratives takes a closer look at @netflix's Untold Series, as Malace in the Palace recalls key accounts from a hostile night in Detroit. \n#NBA #IndianaPacers #DetroitPistons \n \nhttps://t.co/qCVx2oDdZl",
    "193": "Ben Simmons trade Idea\n\nBen Simmons to the @ATLHawks \n\nGrant &amp; Bogdonovich to the @Sixers \n\nReddish, Hunter, Reed &amp; Boucher to @DetroitPistons \n\nSeth Curry to the @Raptors\n\n#Forever404 #WeTheNorth #76ers #Sixers #Pistons https://t.co/9xRjaplKHe",
    "194": "@RalphyHeraldSun The Detroit pistons",
    "195": "🏀 𝗚𝗔𝗠𝗘𝗗𝗔𝗬 🏀\n\n👑 SACRAMENTO KINGS\n🔴 DETROIT PISTONS\n📍 Little Caesars Arena (Detroit)\n📺 NBA League Pass\n\n#SacramentoProud https://t.co/dq7mOdmeQU",
    "196": "@warriors @Bucks @Lakers @SacramentoKings @memgrizz @sixers @LAClippers @utahjazz @celtics @trailblazers @nuggets @BrooklynNets @MiamiHEAT @dallasmavs @nyknicks @Suns @OrlandoMagic @chicagobulls @HoustonRockets @WashWizards @Raptors @okcthunder @cavs @ATLHawks @spurs @Timberwolves @PelicansNBA @DetroitPistons @Pacers please follow back",
    "197": "two are college football 🏈 teams in michigan and two are pro teams one is a basketball team detroit pistons and the other team is a hockey 🏒 🥅 team detroit red wings. https://t.co/CqKji8S7Ca",
    "198": "The Detroit Pistons will need to make free throws to get past the Dallas Mavericks if they sign an amazing point guard like Bradley Beal #DetroitUp #MFFL https://t.co/SRzrmjQJkm",
    "199": "@Pistons__Talk Bagley would be a great fit in Detroit 👀",
    "200": "Check out Detroit Pistons NBA TX3 Warm Poly Fleece Pullover Hoodie Men's 2XL https://t.co/f5jXGBUchK @eBay",
    "201": "@shrimpdesigns @DetroitPistons Need the one with the rings",
    "202": "Joe Dumars and Richard Hamilton. Detroit Pistons. Hame used patches. $10 for both shipped PWE. https://t.co/UM3CPjd6IK",
    "203": "@LiversFrom3 @DetroitPistons I’m sure they’ll announce it in the morning, ima head to bed",
    "204": "@conradburry @nbaunitracker @UniWatch @sportslogosnet @PhilHecken @museumofjerseys @darrenrovell @camisasdanba @DefPenHoops @NBA @GoatJerseys where I can download the Detroit Pistons 313 court like this ?",
    "205": "Attention Detroit Pistons fans…until Casey gets fired…our team will look like trash…Mark Jackson  WE NEED YOU!!!",
    "206": "Check this out. There’s a lot riding on tomorrows game. @DetroitPistons @SacramentoKings https://t.co/X74LOTFoRh",
    "207": "@cburst I saw your pics of the Pistons/Raptors gm online in a Detroit Free Press article. Nice work 👍🏾",
    "208": "27. Houston: Texans, Rockets, Astros\n28. Minnesota: Vikings, Timberwolves, Twins\n29. Sacramento/LA: Raiders??, Kings, Angels\n30. Detroit: Lions, Pistons, Tigers",
    "209": "@Vibcx @DetroitPistons Thank you Michael! I really appreciate that",
    "210": "@patfinn45 I got this. \n\nFord Field is actually great and downtown Detroit has been cleaned up big time. Greektown and the MGM are awesome spots. The Pistons and Wings will be playing too and their new area, LCA, is awesome. Lots to do.",
    "211": "@summerbrennan I was on a flight from Detroit to Milwaukee with the 1988 Detroit Pistons. They were all nice and one of them gave me gum.",
    "212": "@shrimpdesigns @DetroitPistons Hey fam where can I get these fire wallpapers?",
    "213": "The Detroit pistons would gon on to defeat the los Angelo's Lakers in the 2003 finals and find the Chicago bulls struggling with the same team. Only to the Rashad Lewis RayAllen and Steve Kerr https://t.co/mtLXCKgdYq",
    "214": "@bayner @Raptors @DetroitPistons Awesome",
    "215": "@TheJasonKane @Idfcshutupbitch @EmberPlays Ya I doubt ole miss is on his radar. Not sure why it hit my time line. I follow a few bama fans on here as well as Michigan fans since I'm a Detroit lions and pistons fan. I'm sure it had to do with them",
    "216": "@tonydombrowski @DetroitPistons I’ve never screamed “BANG!” so hard in my life.",
    "217": "The Pistons game seems like it should be a walk in the park until you realize Sacramento is only 1.5 games ahead of Detroit in the standings.",
    "218": "@katdog96 I feel the same way about basketball, but it's a decent time to be a pistons fan so I think I'll just go full detroit and start rooting for them too",
    "219": "@Matt_Sabourin @DetroitPistons How was it? What sort of jobs did you see that a Sports Management professional would do? #sports #business",
    "220": "The Detroit Pistons https://t.co/tGk7bXndrX",
    "221": "He needs all those minutes that Corey Joseph is wasting. @DetroitPistons https://t.co/n4A5Vu4hww",
    "222": "@DetroitPistons @lions &amp; @DetroitRedWings all didn’t lose this week. So much for “That’s a Win”…. Don’t quit your day job. I mean… 😂 https://t.co/4W9Q53KFuP",
    "223": "@JT10K So did Andre Drummond, and that didn't stop the #Pistons fans from booing him when he came back to Detroit. I wouldn't look for logic in these things.",
    "224": "Detroit sports is sad, 2020 tigers had the #1 pick 2021 pistons had the #1 pick and more than likely 2022 the lions will have the #1 pick 😭",
    "225": "@Shai_Media Pistons need one!!! It’s been 17 years since our last one &amp; Detroit could definitely use some good luck in sports right now",
    "226": "@RealMikeWilbon  Happy Holidays Michael, it's Mason in Detroit IAM doing a audio book about my P.A. journey for the Pistons could you drop a audio clip I could use about what you thought of me during the Pistons Championship run it would mean the world to me if possible",
    "227": "#Vintage #VintageHats #DetroitPistons #DetroitBasketball #BadBoys #1989NBAChamps #NBA #NBACHAMPIONS #Grail this is a grail piece for any Detroit sports fan and especially vintage lovers this is Sports Specialties tag , adjustable snapback perfection . \n\nhttps://t.co/QXG4xJqO5h",
    "228": "@hamidoudiallo I'd take you over 5 other @DetroitPistons for damn sure.    Hope they don't read u for Bagley:(",
    "229": "@brentmusburger Brent it's Detroit Pistons arena announcer MASON IAM doing an audio book about my journey as an arena announcer YOU help put me there during the Pistons Championship run if you could be so kind as to drop a audio clip it would mean the world to me",
    "230": "@BlackKing0731 @Lakerscenters @CJTheAnalyst @LakeShowCP Wayne Ellington made 5 of his 7---3-pointers today against the San Antonio Spurs, getting back to his Detroit Pistons version = 42.2% for 3-pointers off 6 attempts per game last season.",
    "231": "Our young Detroit Pistons team has all of the ingredients to be special. https://t.co/XPiu6G9wWN",
    "232": "#ClevelandCavaliers Celebrate Win Over #DetroitPistons With #Eminem Meme https://t.co/BIwmApRn3r"
}