{
    "0": "#NBA #NBATwitter Today's Lineups\n\n#ClipperNation\nLos Angeles Clippers Starting 5:\nReggie Jackson\nEric Bledsoe\nPaul George\nNicolas Batum\nIvica Zubac\n\n#WBD \nNew Orleans Pelicans Starting 5:\nTomas Satoransky\nNickeil Alexander-Walker\nJosh Hart\nBrandon Ingram\nJonas Valanciunas",
    "1": "New Orleans Pelicans - Los Angeles Clippers\nOver 213.5 points (1.9)\nPinnacle/2 units",
    "2": "Los Angeles Clippers (-4.5) @ New Orleans Pelicans! #ClipperNation #WBD #NBA #NBATwitter #NBA75",
    "3": "Today's hot pick in the #CollectorsArena 2019-2020 Panini Zion Williamson New Orleans Pelicans  Get the app and start trading cards today for free. #Rethink #thehobby #sportscards https://t.co/cBRVc8kUIP",
    "4": "Tonight's starting lineup for the New Orleans Pelicans: Satoransky, Alexander-Walker, Hart, Ingram, Valanciunas https://t.co/bVWH4AMCA2",
    "5": "NBA ML. Date: 11-19\nLos Angeles Clippers vs New Orleans Pelicans. 0.29%\nKambi. Clippers @ -162\nFanDuel. Pelicans @ +164\n#arbitrage #bettingtwitter #bettingpicks #sportsbets #freepicks #freemoney #mlb",
    "6": "Back NEW ORLEANS PELICANS to BEAT Los Angeles Clippers tonight in the @NBA (Game Starts at 01.10 GMT) #NBA #Basketball",
    "7": "Alright, first @PelicansNBA’s game, then work for @bluntsnblondes. What a beautiful day in New Orleans.",
    "8": "NEW ORLEANS (AP) — New Orleans Pelicans reserve small forward Did Louzada has been suspended 25 games for violating the the NBA's performance enhancing drug rules. https://t.co/kvZ4bRTIry",
    "9": "Today's hot pick in the #CollectorsArena 2020 Panini Zion Williamson New Orleans pelicans  Get the app and start trading cards today for free. #Rethink #thehobby #sportscards https://t.co/sDNcRh6pRT",
    "10": "🏀 Los Angeles Clippers(-3.5) @ New Orleans Pelicans(+3.5)\n\n⌚ 8PM ET\n\nO/U: 215.5\n\n📋 Under is 9-2-1 in Pelicans last 12 home games.\n\nBet BTC ➡️ https://t.co/spMiJIy3iL\n\n#NBATwitter #NBAPicks #SportsBetting #GamblingTwitter https://t.co/IXeGwyLnJ0",
    "11": "For anybody who lives in LA like my good buddy Josh Langland (@TheHorrorGuru) who find the renaming of Staples Center to https://t.co/yefHxrEDxM Arena to be dumb, just remember that where our NBA team (Pelicans) play went from being the New Orleans Arena to Smoothie King Center.",
    "12": "**Premium #3**    11-19-21\n\nPick: New Orleans Pelicans +4.5 (-110) 5u\n\nLA Clippers on the back to back and only laying 4.5 points to a bad Pelicans team, that doesn't seem right. Pelicans 4-2 as a home dawg ATS.",
    "13": "Dia de Clippers! 🔥\n\n❌: New Orleans Pelicans (2-14)\n🏆: Regular Season\n🏟️: Smoothie King Center, New Orleans \n🕗: 22:00 (BRT)\n📺: League Pass\n\nVamos juntos até o fim! LET'S GO CLIPPERS!\n#ClipperNation #MannUP https://t.co/XzKUzqDBxr",
    "14": "Nicolas Batum (right Achilles soreness) will play in Friday’s game against the New Orleans Pelicans. For Fantasy Analysis Click Here: https://t.co/2S87kznFBe",
    "15": "@S2ENSE_ @LakersNation If Anthony Davis was the type you guys WISH HE WAS, A.D would still be the New Orleans Pelicans franchise player, he ran to hide behind daddy = Lebron James",
    "16": "boys be using the Pels as a warmup game. RT @ChrisBHaynes: Los Angeles Clippers forward Nicolas Batum will return tonight against the New Orleans Pelicans after missing last game with Achilles soreness, league sources tell @YahooSports.",
    "17": "Los Angeles Clippers forward Nicolas Batum will return tonight against the New Orleans Pelicans after missing last game with Achilles soreness, league sources tell @YahooSports.",
    "18": "New Orleans Pelicans",
    "19": "Zion Williamson Rumors: Pelicans 'Poured Resources' into Star's Health amid Injury #sports\n\nZion Williamson has yet to play this season as he continues to recover from a fractured foot, but it appears the New Orleans Pelicans have done everything in\n\nhttps://t.co/A81EMEWNhB",
    "20": "It’s been just more than two years to the day that Paul George made his Clippers debut in New Orleans by scoring 33 in 24 min. Ahead of tonight’s game vs. the Pelicans, here’s what I wrote that day, a story that started in a hotel gym in Santorini:\n\nhttps://t.co/rboShp6pMt",
    "21": "@Ter0me The worst thing to happen to Zion's career is being drafted on to the Pelicans\nNew Orleans food is too good",
    "22": "@S2ENSE_ @LakersNation You trying to make Anthony Davis carry the burden for this team like you don’t know the reason the New Orleans Pelicans never accomplished JACK. That means you don’t know basketball. 😀😀😀 A.D hides behind Lebron’s skirt.",
    "23": "🏀Friday NBA🏀\n\n15*\n\nIndiana Pacers +1\nGolden St Warriors -2\nBrooklyn Nets -9½\nNew Orleans Pelicans +4",
    "24": "And now didi louzada is suspended. #pelicans New Orleans teams just keep getting bad news",
    "25": "Today's NBA Picks: 8:10 PM ET - Los Angeles Clippers vs. New Orleans Pelicans - 16 PICKS AVAILABLE: https://t.co/9BhoeT2oiu #nba",
    "26": "New Orleans Pelicans guard Didi Louzada suspended 25 games for violating NBA/NBPA’s anti-drug program https://t.co/3djjhhRaV1",
    "27": "Pelicans Landing is now open in Disneylands New Orleans Square ✨⚓️👀 https://t.co/Rxr9JhU9eo",
    "28": "New Orleans Pelicans Predictions and Preview for 11/19/2021 hosts Los Angeles Clippers.  Find out who we are taking in this matchup. #NBA #SportsBetting https://t.co/n0ofA1EC4w",
    "29": "Pelicans' Louzada suspended 25 games by NBA: The NBA has suspended New Orleans Pelicans guard Didi Louzada 25 games without pay for violating the NBA/NBPA's anti-drug program. https://t.co/pbatumPUvg https://t.co/pzNmYUe3yf",
    "30": "New Orleans Pelicans Predictions and Preview for 11/19/2021 hosts Los Angeles Clippers.  Looking for betting action?  Find out if there is any value in our preview. #NBA #SportsBetting https://t.co/n0ofA1EC4w",
    "31": "The NBA has suspended New Orleans Pelicans guard Didi Louzada 25 games without pay for violating the NBA/NBPA's Anti-Drug program. \n#NBA #NBATwitter https://t.co/eVfXqiG05A",
    "32": "New Orleans Pelicans guard DiDi Louzada suspended 25 games by NBA: https://t.co/khYnecVtai",
    "33": "The New Orleans Pelicans roster scoffed at Stan Van Gundy when he wanted them to guard.\n\nAnd they still aren’t guarding.\n\nAnd if the personal can’t guard, who’s in charge of the personal?",
    "34": "Pelicans' DiDi Louzada Suspended 25 Games for Violating PED Policy: The NBA announced Friday that New Orleans Pelicans forward Didi Louzada was suspended 25... https://t.co/DICXbu8PY2 #BNTNBA #Basketball #BreakingNews #MarcosLouzadaSilva https://t.co/dxE9dzoQVX",
    "35": "Clippers list Nicolas Batum (right Achilles soreness) as Questionable for tonight's game against the New Orleans Pelicans. Marcus Morris Sr. (knee), Serge Ibaka (G-League) and Justise Winslow (personal) remain OUT.",
    "36": "Nico Batum is questionable to play tonight in New Orleans, per the team. Ty Lue said last night that Batum had a chance to face the Pelicans after his Achilles soreness.",
    "37": "6 plays for tonight. NBA will be 1 unit, NHL will be .5 unit\n\nNBA\nGolden State Warriors -1.5 -110\nBoston Celtics -140\nNew Orleans Pelicans +4 -110\nDenver Nuggets -1.5 -110\n\nNHL\nWinnipeg Jets -100\nSeattle Kraken +120\n\nBOL",
    "38": "After Didi Louzada has been out for five games, the Pelicans can transfer him to the Suspended List. New Orleans would then be able to sign a player to replace Louzada on the roster.",
    "39": "DiDi Louzada of the New Orleans Pelicans has been suspended without pay for twenty-five games for violating the terms of the NBA/NBPA Anti-Drug Program by testing positive for Drostanolone and Testosterone, per NBA #porvida #nba75 #nbatwitter",
    "40": "DiDi Louzada of the New Orleans Pelicans was suspended without pay for (25) games for violating the terms of NBA/NBPA Anti-Drug Program by testing positive for Drostanolone and Testosterone, said NBA in news release. 11/19",
    "41": "Pelicans-related league news ahead of tonight's Clippers-Pels game in New Orleans: https://t.co/m7iAUnNaEO",
    "42": "NBA has suspended Didi Louzada of the New Orleans Pelicans for 25 games for violating NBA’s Anti-Drug Program after testing positive for Drostanolone &amp; Testosterone.",
    "43": "DiDi Louzada of the New Orleans Pelicans has been suspended without pay for twenty-five games for violating the terms of the NBA/NBPA Anti-Drug Program by testing positive for Drostanolone and Testosterone, it was announced today by the NBA.",
    "44": "🇺🇸 Pelicans Didi Louzada suspended 25 games without pay for testing positive for Drostanolone and Testosterone. He’ll begin serving his suspension tonight \n\n🇮🇹 Didi Louzada di New Orleans sospeso 25 partite per essere risultato positivo a Drostanolone e Testosterone \n\n#NBA75",
    "45": "@YT_Solo @wojespn Marcos Henrique Louzada Silva (born 2 July 1999), commonly known as Didi Louzada, is a Brazilian professional basketball player for the Birmingham Squadron of the NBA G League, on assignment from the New Orleans Pelicans of the National Basketball Association (NBA). In 2019",
    "46": "New Orleans Pelicans, Didi Louzada tested positive for Drostanolone and Testosterone and has been suspended 25 games for violating the NBA’s drug policy. \n\n#WBD",
    "47": "Detroit Pistons - Golden State Warriors\nBoston Celtics - Los Angeles Lakers\nMilwaukee Bucks - Oklahoma City Thunder\nNew Orleans Pelicans - Los Angeles Clippers\nSeattle Kraken - Colorado Avalanche\nVancouver Canucks - Winnipeg Jets\n\nBet slip link: https://t.co/9y7FMgsaxk https://t.co/U0gd0g2elC",
    "48": "🚨GAME DAY!\n\n🏀 @PelicansNBA \n📍 New Orleans, LA\n🕔 01:00AM/GMT, 17:00PM/PT\n⚖️ 9-6\n📺🇬🇧 @NBATV \n\n#ClipperNation https://t.co/uqMdAXcg5B",
    "49": "@dadlook @BleacherReport Weren't the pelicans fortunate to have Anthony Davis, and then the fat guy zion?  Maybe you can use your high IQ (you wear glasses) to count the number of championships new Orleans has won since 2012.",
    "50": "Should The New Orleans Pelicans Pair Karl-Anthony Towns With Zion Williamson? #RaisedByWolves #WBD #NBA #NBATwitter #NBATwitterLive #KarlAnthonyTowns #ZionWilliamson\n\nRead More- https://t.co/NTpy3J0wSu https://t.co/CLhK5a0pqW",
    "51": "Los Angeles Clippers vs New Orleans Pelicans 11/19/2021 Picks Predictions Previews\n\nhttps://t.co/yrBUOBK05m\n\n#odds #picks #NBApicks #NBA #NBAprediction #NBAparlay #NBAbetting #sportsbetting #expertpicks #basketballpicks #sportspicks #freepick #freepicks #Clippers #Pelicans https://t.co/89uODXp3G0",
    "52": "Eric Bledsoe is back in New Orleans since his trade in the offseason. Will Pelicans fans give him a warm welcome? Take a look at the odds and my keys to tonight’s game in my latest Pelican Preview via @PelicanDebrief. \n#WBD\nhttps://t.co/DdVL7IiY4U",
    "53": "Back at it in New Orleans! \n\n🕔 5:00PM PT \n🆚 @PelicansNBA \n📺 @BallySportWest\n📻 @AM570LASports, @TuLigaRadio https://t.co/02xf7AQ8h9",
    "54": "Jogos De Hoje:\nCharlotte Hornets vs Indiana Pacers (00h00)\nDetroit Pistons vs Golden State Warriors (00h00)\nBoston Celtics vs LA Lakers (00h30)\nBrooklyn Nets vs Orlando Magic (00h30)\nMilwaukee Bucks vs Oklahoma City Thunder (1h00)\nNew Orleans Pelicans vs LA Clippers (1h00)",
    "55": "Match: New Orleans Pelicans - Los Angeles Clippers\n\nBet slip link: https://t.co/DPCVRXyv1E\n\n#NewOrleansPelicans #LosAngelesClippers #cardano #ada #nba https://t.co/nTIqO1Ln8l",
    "56": "Let's look at the Pelicans often criticized point guard acquisition Devonte' Graham. Same sentence.\n\n\"New Orleans is averaging about 112.1 points per 100 possessions with Graham, and 84.0 when he rests -- almost FOURTEEN points below the Houston Rockets' league-worst offense.\" https://t.co/FIt2JjQ9CX",
    "57": "The Clips are in town for a Friday night showdown! 🔥\n\n@PelicansNBA vs @LAClippers \n⏰ 6:30 pm\n📺 Bally Sports New Orleans\n📲 Bally Sports App\n#WBD https://t.co/V7L2JacLkt",
    "58": "LA Clippers @ New Orleans Pelicans\n\nPlayer Points Projections\n\nhttps://t.co/eSV7b6hXMj",
    "59": "New Orleans Pelicans’ Zion Williamson FAQ https://t.co/VCk4R8ivkb",
    "60": "DasHaus made a bet!\n\nEvent: Los Angeles Clippers vs New Orleans Pelicans #NBA\nBet: New Orleans Pelicans TO WIN +3.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "61": "DasHaus made a bet!\n\nEvent: Los Angeles Clippers vs New Orleans Pelicans #NBA\nBet: Los Angeles Clippers TO WIN -3.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "62": "@SonJawree Bro you could like the New Orleans Pelicans right now",
    "63": "The New Orleans Pelicans take on the LA Clippers tonight at the Smoothie King Center 7pm CST. \n\nLooking forward to seeing Herb Jones on Paul George who is having a great start to the season.\n\nIf anyone is interested in going to tonight’s game let us know.",
    "64": "Some matchup rankings headed into Clippers at New Orleans for Friday night. \n\nClippers are going from the second-worst defense in Memphis to the NBA's worst defense in the Pelicans as Eric Bledsoe returns to Louisiana.\n\nThe Clippers will be relieved to go from Morant to Graham. https://t.co/LWDCwfPhEh",
    "65": "Next week the Pelicans are going to be giving away free tickets to fans who sell a certain amount of chocolate bars.*\n\n*all proceeds will go to the New Orleans Pelicans. https://t.co/escIXWamBo https://t.co/TUZN6k56Kg",
    "66": "Chance went to New Orleans for a Pelicans game🙄",
    "67": "NBA Day 3️⃣2️⃣ 🏀🏀🏀\nGolden State Warriors vs Detroit Pistons\nIndiana Pacers vs Charlotte Hornets\nLos Angeles Lakers vs Boston Celtics\nOrlando Magic vs Brooklyn Nets\nLos Angeles Clippers vs New Orleans Pelicans\nOklahoma City Thunder vs Milwaukee Bucks",
    "68": "Charlotte Hornets - Indiana Pacers\nDetroit Pistons - Golden State Warriors\nBoston Celtics - Los Angeles Lakers\nNew Orleans Pelicans - Los Angeles Clippers\nSacramento Kings - Toronto Raptors\n\nBet slip link: https://t.co/NoklSXoJCi https://t.co/LjQQtWjszS",
    "69": "🏀🏀NBA Games!\n\n➡️ The Los Angeles🆚 New Orleans Pelicans\n\n➡️ The Oklahoma City will get to face the defending champion Milwaukee Bucks\n\n➡️ Indiana Pacers 🆚 Charlotte Hornets\n\n➡️ The Los Angeles Lakers 🆚 Boston Celtics\n\n#NBA #Betikang https://t.co/yc8TLbke3n",
    "70": "New Orleans poncho train bridge   #Water #Waterfront #Pier #Port #Dock #Bridge #Building #NewOrleans #Nola #South #Saints #Pelicans #Ponchutrain #Longest #Ever #28milesofwater https://t.co/RhhbFbnbbs",
    "71": "NBA Basketball Game Betting Picks Simulator: 8:10 PM ET - Los Angeles Clippers vs. New Orleans Pelicans - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/SrkpMx43if #nba #sportsbetting #freepicks #cappertek",
    "72": "Los Angeles Clippers (9-6, sixth in the Western Conference) vs. New Orleans Pelicans (2-14, 14th in the Western Conference) https://t.co/RfBVM4S8Kb",
    "73": "Los Angeles Clippers to beat New Orleans Pelicans @1.60",
    "74": "With LeBron out this lakers team with AD on the floor look like the New Orleans Pelicans. AD hasn’t been consistent and with 🤴 out her souls be the one barring them the wins but that’s a stretch.",
    "75": "If @elonmusk were to buy the New Orleans Pelicans 🏀 and move them to #ATX, what should he name the team? Some ideas:\n\nAustin Roadsters\nAustin Borings\nAustin Martians\nAustin Hyperloops\nAustin Greenbelts\nAustin Mics\nAustin Flamethrowers\nAustin Oaks\n\n#NBA #NBATwitter #energytwitter",
    "76": "Atlanta Falcons- 4 wins\nNew Orleans Pelicans- 2 wins\n\nIt's November 18th https://t.co/Zs6sEa6CwS",
    "77": "In a blockbuster deal the New Orleans Pelicans have acquired Kyrie Irving on a 2-year $11 million dollar contract. Per sources.",
    "78": "This happen to me too. I ordered a New Orleans Pelicans sweater and got a Lakers one. https://t.co/J9rKLWHK1e",
    "79": "Bad night for Clippers in Memphis. Short hop now to New Orleans to meet the vulnerable Pelicans Thursday night. It’s a chance to make it a 1-1 road trip.",
    "80": "#NBA (Temporada Regular) - Encerrados:\n\nCharlotte Hornets 97 x 87 Washington Wizards \nDetroit Pistons 97 x 89 Indiana Pacers \nAtlanta Hawks 110 x 99 Boston Celtics \nBrooklyn Nets 109 x 99 Cleveland Cavaliers \nMiami Heat 113 x 98 New Orleans Pelicans",
    "81": "you a reporter in New Orleans focus on the Pelicans and less on my team https://t.co/Z0S6xeNMiM",
    "82": "Bring the pelicans to Vegas. Nobody cares about them in New Orleans clearly https://t.co/k8Ls6dOJey",
    "83": "@uscpsycho Home of your New Orleans Pelicans ;)\n\nhttps://t.co/4Gao9B9QoG"
}