{
    "0": "New Orleans Pelicans vs Houston Rockets - Go Pelicans! https://t.co/9jy8B6Up4V",
    "1": "@_Andrew_Lopez Why “soon to be” and not just “New Orleans Pelicans Guard”?",
    "2": "The best thing about tonight’s game… is knowing that Eric Gordon is still not playing for the New Orleans Pelicans. https://t.co/7xYcf6ERiZ",
    "3": "Rockets facing the Pelicans in New Orleans tonight. ⚫️ https://t.co/KtwmuDzQ0n",
    "4": "The New Orleans Pelicans (21-32) are looking to win their fourth consecutive game Tuesday night at the Smoothie King Center against the Houston Rockets (15-38).  NBA Western Conference Player of the Week &amp; All-Star Brandon Ingram warms up twenty minutes before the game. https://t.co/zSbKpU4YvI",
    "5": "Podcast of Inside New Orleans 4-6pm on \n@NASHfm1061  https://t.co/KKtU8zOhc5 \nhttps://t.co/MOmnPYSKa9\nTopics: @Saints Dennis Allen @PelicansNBA Trade Crime in #NOLA &amp; more \nGuest @RossJacksonNOLA \nhttps://t.co/4TDSps5RbV",
    "6": "We're going to miss @trailblazers @CJMcCollum when he moves to New Orleans to play for the Pelicans. Thank you, CJ, for all of your support of SMART Reading. You are a great champion for literacy! https://t.co/w1bwZRTgDe",
    "7": "NBA Betting Trend: New Orleans Pelicans are 8 - 22 after a division game over the last three years\n#tipster\n#sportbetting",
    "8": "The New Orleans Pelicans will have a player featured in the 3-PT contest. https://t.co/w6rEBen3rh",
    "9": "The New Orleans Pelicans solidified the notion that they're making a push for the playoffs. With CJ McCollum and Brandon Ingram, they're in a position to make it happen. It could also mean a Zion Williamson return is on the horizon.\n\nLink in the replies 👇 https://t.co/TL8u3RAxdb",
    "10": "lmaoaoao y’all ain’t feeling the trade to the new orleans pelicans at alllll i see",
    "11": "Check that: \n\nCJ McCollum\nNew Orleans Pelicans https://t.co/dpVV1xSMz0",
    "12": "New Orleans Pelicans Starting Lineup 2/8\n PG: Devonte' Graham\n SG: Herbert Jones\n SF: Brandon Ingram\n PF: Jaxson Hayes\n C: Jonas Valanciunas\nhttps://t.co/o75oZ8vnE8",
    "13": "@NBAPR CJ NEW ORLEANS PELICANS",
    "14": "The New Orleans Pelicans have reportedly acquired guard C.J. McCollum from the Portland Trail Blazers as part of a seven-player trade.\nhttps://t.co/v8fO7VgL4B",
    "15": "New Orleans Pelicans (-9) vs. Houston Rockets! #Rockets #WBD #NBA #NBATwitter #NBA75",
    "16": "New Orleans Pelicans Starters:\n\nDevonte' Graham\nBrandon Ingram\nHerbert Jones\nJaxson Hayes\nJonas Valanciunas\n\nPlayers out:\nWilly Hernangomez\nCJ McCollum\nLarry Nance\nTony Snell\nZion Williamson\n#WBD #NBA #NBATwitter #NBA75",
    "17": "@NBAPR NEW ORLEANS PELICANS!!",
    "18": "Tonight's starting lineup for the New Orleans Pelicans: Graham, Jones, Ingram, Hayes, Valanciunas https://t.co/bVWH4Av1bs",
    "19": "Soon to be New Orleans Pelicans guard CJ McCollum will be in the three-point contest. https://t.co/TC8Z06orB5",
    "20": "That’s New Orleans Pelicans CJ McCollum to you https://t.co/6H8JupzoPE",
    "21": "@postbrees @PelicansNBA I would totally go if I were in New Orleans 😔",
    "22": "CJ McCollum\n*New Orleans Pelicans https://t.co/KVwADf36Ab",
    "23": "@NotoriousOHM CJ MCCOLLUM *NEW ORLEANS PELICANS*",
    "24": "you mean CJ McCollum - New Orleans Pelicans https://t.co/Q7qFbC4tAj",
    "25": "NEW ORLEANS PELICANS CJ MCCOLLUM https://t.co/MmuBp3vq0s",
    "26": "@NBAPR New Orleans Pelicans*",
    "27": "NEW ORLEANS — The New Orleans Pelicans have acquired guard C.J. McCollum from the Portland Trail Blazers as part of a seven-player trade, said two people familiar with the situation. https://t.co/AbJHkg36KD",
    "28": "NBA Betting Trend: New Orleans Pelicans are 8 - 22 after a division game ove\n#tipster\n#sportbetting",
    "29": "If the Hornets could rename to Pelicans to free up \"Hornets\" for Charlotte, you'd think that you could do other rationalizations: Lakers-&gt;MN, Timberwolves-&gt;Toronto, (Veloci)raptors-&gt;Utah, Jazz-&gt;New Orleans, Pelicans-&gt;Memphis(?), Grizzlies-&gt;Los Angeles.",
    "30": "TIP: New Orleans Pelicans - Houston Rockets, C.Wood 18,5 +, 1.85 by #tipster drose25 (profit this month: +84.08)\n  #betting #Basketball #New #Orleans #Pelicans #Houston #Rockets",
    "31": "@adaniels33 Who cares what Steven A Smith thinks or what others think.! No one nationally wants the new orleans pelicans to be relevant regardless as to who's on the team. They deliberately bad mouth the organization, the team,the city.! In there eyes.! We do nothing right.! It's a joke!",
    "32": "🏀The Houston Rockets and New Orleans Pelicans are finishing the second half of their home-and-home which saw the Pelicans come away with the win 120-107 in Houston two days ago. @teddy_covers gives his insights and analysis before the 8 PM EST tip.\n\n👉https://t.co/UfJNmG3ta4 https://t.co/yeNthZecZY",
    "33": "Rockets guard Eric Gordon is out tonight against the New Orleans Pelicans. #Rockets #LightTheFuse #Sarge",
    "34": "New Orleans Pelicans vs Houston Rockets Basketball Live | 2022 NBA[Stream HD] : https://t.co/rTQPXpPFtj | 8-Feb-22 | 20:00 | NBA | Basketball | Houston Rockets | New Orleans Pelicans | Live | 2022 Basketball NBA Houston Rockets vs New Orleans Pelicans | New Orleans Pelicans https://t.co/wWZ51ZQ0kj",
    "35": "It's the @HoustonRockets vs New Orleans Pelicans TONIGHT on AT&amp;T SportsNet\n\nHere are @CalvinMurphyHOF's Keys to the Game presented by @Toyota \n\nJoin Calvin &amp; @KevinEsch1 as they begin our coverage at 6:30PM on #Rockets Pregame\n\n#toyotausa\nhttps://t.co/HOouXfUpZq https://t.co/YZXGr3yV2d",
    "36": "CJ McCollum traspasado a los New Orleans Pelicans\n\nhttps://t.co/90ZUk7Zh8D",
    "37": "-CJ McCollum de Trail Blazers sería transferido a New Orleans Pelicans #UnivisionPDX\n-Report: Blazers guard CJ McCollum heading to New Orleans Pelicans  https://t.co/2yurlhywpB",
    "38": "Josh became my favorite player for the Pels because he bought into NOLA the minute he got here. He gave New Orleans everything he had and for that I'm forever grateful.\n\nYo @PelicansNBA - Can we make this happen? 🥲 \n\nIf not, it's going to be hanging from the rafters of my house https://t.co/Q0ACC5PoxJ https://t.co/Gw9JM2cvsC",
    "39": "The New Orleans Pelicans: No Defense, Just Vibes",
    "40": "Back NEW ORLEANS PELICANS to BEAT Houston Rockets tonight in the @NBA (Game Starts at 01.10 GMT) #NBA #Basketball",
    "41": "AP sources: Pelicans acquire C.J. McCollum in 7-player trade: The New Orleans Pelicans have acquired guard C.J. McCollum from the Portland Trail Blazers as part of a seven-player trade, said two people familiar with the situation. https://t.co/XeOCWF1PQY #RipCity https://t.co/LCB13vJjL3",
    "42": "dukes is petrified of the new orleans pelicans",
    "43": "New Orleans Pelicans Predictions and Preview for 2/8/2022 hosts Houston Rockets.  Find out who we are taking in this matchup. #NBATwitter #NBA https://t.co/dWQXWTJp6Z",
    "44": "New Orleans #Pelicans Trade for CJ McCollum https://t.co/iDybfrfHrz via @YouTube #WBD #neworleanspelicans",
    "45": "Trail Blazers guard CJ McCollum could be heading to the New Orleans Pelicans after eight seasons in Portland, according to reports.\nhttps://t.co/5QtVqFxnHL",
    "46": "A HOUSE DIVIDED \nNew Orleans Pelicans / Chicago Sky https://t.co/YvGxQRK8Qs",
    "47": "RUSH STREET INTERACTIVE'S BETRIVERS SPORTSBOOK IS THE OFFICIAL PARTNER OF THE NBA'S NEW ORLEANS PELICANS https://t.co/fSguKHAXIU",
    "48": "Delgado is a Proud Partner of the New Orleans Pelicans! The Pelicans are playing at home for the next two weeks. Enjoy the fast pace and excitement of #NBA basketball! All Pelicans games are live on ESPN 100.3 FM and WBOK 1230 AM. https://t.co/1R86R61mrg\n#BeInThatNumber #Pelicans https://t.co/4fkmqtOrmk",
    "49": "4 leg NBA Multi/Parlay\n\n4u @ $2.10/+110\nBoston Celtics\nAtlanta Hawks\nNew Orleans Pelicans\nDenver Nuggets\n\n#GamblingTwitter #NBAPicks #bettingpicks #NBATwitter",
    "50": "@Banjolee3 @ScooterMagruder The Pelicans might be trying to make the playoffs but literally have 0 chance this season. CJ is kinda looked as right now as not living up to his contract. Portland needed to move on and New Orleans has been taking on salary dumps for a while now in trades. So IMO Portland won.",
    "51": "Colin Cowherd on the Blazers trading CJ McCullum: This feels like a big mess I THE HERD: Colin Cowherd talks the Portland Trailblazers trade of guard CJ McCollum to the New Orleans Pelicans. This is the Blazers second trade in the weeks leading up the… https://t.co/MVfMrjDjyx https://t.co/YTNPKOq31o",
    "52": "C.J Mccollum Got Traded To New Orleans Pelicans. New Orleans Is Sending Guards Josh Hart,Thomas Satoransky,Nickeil Alexander-Walker And Didi Louzada And TWO First Round Picks To Portland",
    "53": "NBA: Per ESPN: Portland Trail Blazers sending CJ McCollum to New Orleans Pelicans as part of trade ... https://t.co/f1v6IItv2E",
    "54": "Interesting moves for New Orleans and Sacramento pushing to be a top 10 seed while Blazers pulling out. It’s unlikely that both Kings and Pelicans make play-in tournament. Would fans be happier with a higher pick or be a top 10 seed?",
    "55": "New Orleans Saints and Pelicans owner Gayle Benson is suing her neighbors over an attack that killed one of her pets, according to a new lawsuit filed in New Orleans Civil District Court. \n\nhttps://t.co/8AWajjDdeJ",
    "56": "@BleacherReport @ShamsCharania Zion still in New Orleans @PelicansNBA ??",
    "57": "Need more New Orleans Pelicans spaces #WBD",
    "58": "CJ McCollum looks good on paper, but how much will he actually help the New Orleans Pelicans?\n\n#NBATradeDeadline | #WBD | @BigTimeTimJim  https://t.co/TkvPyBmVGp",
    "59": "4 Pick Parlay: 1.00U at: +119\n- Boston Celtics - Money Line\n- New Orleans Pelicans - Money Line\n- Dallas Mavericks - Money Line\n- Denver Nuggets - Money Line",
    "60": "2 Pick Parlay: 1.00U at: +100\n- New Orleans Pelicans - Money Line\n- Jonas Valanciunas Under 22.5 Points",
    "61": "1/2 Your New Orleans Pelicans won 1 of their first 10 games, have a 1st time head coach at the helm, have been without their superstar player for the entire season, and are now active buyers at the trade deadline in a bid to secure a spot in the play-in tournament. It’s a much",
    "62": "Pelicans shootaround update: New Orleans will try to take advantage of ‘home cooking’ during six-game stret... - https://t.co/Dq7UwguqFT\n\n#Rockets\nhttps://t.co/GKQXiShNLN",
    "63": "Pelicans shootaround update: New Orleans will try to take advantage of ‘home cooking’ during six-game stret... - https://t.co/Dq7UwguqFT\n\nhttps://t.co/t6iv0EQEOw",
    "64": "The New Orleans Pelicans: Where players careers go to die and drown in poverty. RIP CJ McCollum 🙏 https://t.co/FfMrixpt6w",
    "65": "Pelicans shootaround update: New Orleans will try to take advantage of ‘home cooking’ during six-game stret... - https://t.co/Dq7UwguqFT\n\n#Rockets\nhttps://t.co/t6iv0EQEOw",
    "66": "NBA:\nBrooklyn Nets +8.5 -110 [1]\nNew York Knicks +9.5 -110 [1]\nNew York Knicks Alta 219.5 -110 [3]MAX \nNew Orleans Pelicans 9.5 -110 [3] MAX\nMilwaukee Bucks Baja 234 -110 [1].         #apuestasdeportivas",
    "67": "Pelicans shootaround update: New Orleans will try to take advantage of ‘home cooking’ during six-game stret... - https://t.co/Dq7UwguqFT\n\nhttps://t.co/PWRRP2BXSm",
    "68": "Pelicans shootaround update: New Orleans will try to take advantage of ‘home cooking’ during six-game stret... - https://t.co/Dq7UwguqFT\n\n#Rockets\nhttps://t.co/PWRRP2BXSm",
    "69": "‼️No Way‼️\nCj: Portland to New Orleans Pelicans\nTyrese: Sacramento to Indiana \nDamantas: Indiana to Sacramento \n@CJMcCollum @TyHaliburton22 https://t.co/GldXO2DaQ8",
    "70": "It's a great day to be a pels fan\n\nNBA News: CJ McCollum traded to the New Orleans Pelicans https://t.co/OJvJrhOXIx https://t.co/drj2fviSp9",
    "71": "NBA trade grades: Who wins the New Orleans Pelicans-Portland Trail Blazers deal for CJ McCollum? - via @ESPN App. #NBA.  https://t.co/SnEbwRTssK",
    "72": "- The Pick NOLA gave up:\n1-4 goes to Pelicans\n5-14 goes to Blazers\n15-30 goes to Hornets\n\nRight now, the pick is #9, which is good. But, New Orleans will likely get better... so we'll see how that pick conveys",
    "73": "ESPN- “The Pelicans need to surround Zion with talent”\n\nAlso ESPN- “I’m disgusted for CJ to have to play in New Orleans”\n\nWhich is it, you clowns?",
    "74": "New Orleans Pelicans stockpiling mid",
    "75": "Blockbuster trade between the New Orleans Pelicans and the Portland Trail Blazers has star shooting guard CJ McCollum landing in #NOLA. It's an end of the dynamic Lillard &amp; McCollum backcourt in #RipCity. Guard Josh Hart heads to Portland.\n#NBA #tradedeadline #RTBNNews https://t.co/GqDmQPihav",
    "76": "The Portland Trail Blazers have agreed to trade CJ McCollum, Larry Nance and Tony Snell to the New Orleans Pelicans.\n\nDomantas Sabonis has been traded to the Kings! Plenty of trade action overnight.\n\nREAD📝:  https://t.co/SOhhErirGV https://t.co/4hcr68lINn",
    "77": "@JonoBarnes 100.3 FM the sports hangover best radio sports show in town Gus talks all New Orleans sports an deep into the Pelicans",
    "78": "WTH ???? 😂 Im not mad at @PelicansNBA. they def will win more games. they are in 10th place , might be 8th now RT @wojespn: New Orleans gets the significant veteran guard it’s wanted: @CJMcCollum https://t.co/bwHfzPTzDc",
    "79": "New Orleans Pelicans https://t.co/RgFekFkxE0",
    "80": "@joshhart Josh, New Orleans and its fans will never forget how you gave 200% to this franchise. As a lifelong Pelicans/Hornets fan, thank you for being one of the few bright spots in our team's history. I'm team Hart for life!",
    "81": "#NBA Houston vs. New Orleans #FreePick from Covers Expert Power Sports.\nPower Sports likes the Rockets to cover the big spread tonight against the Pelicans. - https://t.co/bauRv8m6yT https://t.co/YLeE1wiGDj",
    "82": "Andy Vermaut shares:Pelicans acquire C.J. McCollum in 7-player trade: The New Orleans Pelicans have acquired guard C.J. McCollum from the Portland Trail Blazers as part of a… https://t.co/HOQ8otH34Q Thank you. #ThankYouJournalistsForTheNewsWeGetFromYou #AndyVermautThanksYou https://t.co/ubt9TGTf6w",
    "83": "New Orleans Saints and Pelicans owner Gayle Benson is suing her neighbors, whose dogs killed one of her Yorkies and badly injured the other earlier this year. \n\nShe has pledged to donate any winnings to animal welfare charities. | https://t.co/amME3Glpfa",
    "84": "Social media reacts to Trail Blazers trading CJ McCollum to New Orleans Pelicans: ‘This trade is so disrespec - https://t.co/BmXNnBLnnY\nSocial media reacts to Trail Blazers trading CJ McCollum to New Orleans Pelicans: ‘This …\n#SocialMedia #SocialMediaNews\nhttps://t.co/eGHPzOXMzP",
    "85": "Live look at David Griffin and the New Orleans Pelicans after trading for CJ McCollum https://t.co/f8F6sBQEa5",
    "86": "The New Orleans Pelicans? https://t.co/3ABdRQkMmx",
    "87": "CJ McCollum has also been dealt to the New Orleans Pelicans. #NBATradeDeadline",
    "88": "NBA trade grades – Who wins the New Orleans Pelicans-Portland Trail Blazers deal for CJ McCollum? https://t.co/0RDgGnC3kd",
    "89": "CJ McCollum is headed to the New Orleans Pelicans. So, how many years remain on his current contract?\n\n#NBATradeDeadline | #Pelicans | #CJMcCollum | @DavidWysong_  https://t.co/GHBybuNTB9",
    "90": "CJ McCollum traded to New Orleans Pelicans; Four players and draft assets go to Portland Trail Blazers | NBA News https://t.co/UOrUhZNiw2",
    "91": "NBA trade grades – Who wins the New Orleans Pelicans-Portland Trail Blazers deal for CJ McCollum? https://t.co/jrPhW88kDc",
    "92": "@TheBayBR TROCA NA NBA\n\nO New Orleans Pelicans recebe:\n\nCJ McCollum\nLarry Nance\nTony Snell\n\nO Portland Trail Blazers recebe:\n\nJosh Hart\nNickeil Alexander-Walker\nDidi Louzada\n1 Pick de Draft de 1 ° rodada (Protegida) \n2 Picks de 2° rodada",
    "93": "@StevieStacks84 Northwestern (ML) \nIllinois +5 \nPhoenix Suns +1.5\nNew Orleans Pelicans -9.5 \nIndiana Pacers +12.5",
    "94": "https://t.co/NlhZpKoCqy CJ McCollum - Welcome to New Orleans Pelicans ! #RwOT #Rwanda #Sports",
    "95": "BREAKING: CJ McCollum has been traded to the New Orleans Pelicans\n\nEnd of an era in Portland… https://t.co/7PY755bKA2",
    "96": "NEW ORLEANS (AP) — The New Orleans Pelicans have acquired guard C.J. McCollum from the Portland Trail Blazers as part of a seven-player trade, said two people familiar with the situation. https://t.co/Y7SLdx94eL",
    "97": "With the 6th pick in the nba draft the new Orleans pelicans select... https://t.co/oECuJ63u8C",
    "98": "The New Orleans Pelicans have me emotional at 1:37 on a Tuesday. Not sure if this is rock bottom or new heights for me",
    "99": "CJ McCollum traded from Portland Trail Blazers to New Orleans Pelicans https://t.co/ooGMxbDkS5",
    "100": "Zion has been en fuego this year 🔥🔥 really coming into his own as a budding star player for a storied franchise like the New Orleans Pelicans. glad BR included him in this graphic. https://t.co/bfAXIjA7W3",
    "101": "@FayaLinden even people from New Orleans don't watch the Pelicans 😂",
    "102": "Watch the Portland Trail Blazers blow it up and still make the NBA playoffs over the New Orleans Pelicans and Sacramento Kings https://t.co/PYDV7E4z6J",
    "103": "Today's NBA Consensus (So Far):\n\nMinnesota Timberwolves 78%\nPortland Trail Blazers 73%\nMilwaukee Bucks 73%\nDenver Nuggets 71%\nDallas Mavericks 71%\nMemphis Grizzlies 69%\nNew Orleans Pelicans 62%\nBoston Celtics 57%\nPhoenix Suns 53%\nAtlanta Hawks 53%",
    "104": "Skip Bayless reacts to the Blazers reportedly trading CJ McCollum to the Pelicans I UNDISPUTED: The Portland Trail Blazers are reportedly trading CJ McCollum to the New Orleans Pelicans in exchange for Josh Hart, Nickeil Walker-Alexander, Did Louzada,… https://t.co/M3gaVeS0kc https://t.co/HJjb7gcSnI",
    "105": "Cant wait to see Cj McCollum in New Orleans.. do you think they have a shot to make noise in the playoffs ?  #nba #nbatradedeadline #Pelicans",
    "106": "Can we talk about how ridiculous it is to have a team in New Orleans called the damn Pelicans when the Jazz play in Utah",
    "107": "LATEST | From ESPN: The New Orleans Pelicans have acquired guard CJ McCollum from the Portland Trail Blazers.",
    "108": "News: BetRivers Sportsbook becomes official partner of New Orleans Pelicans https://t.co/PJTqVe3Kzk",
    "109": "Twitter account @ImSupaFreshh is looking to sign with the New Orleans Pelicans as his new team sources tell, ESPN",
    "110": "#FRESHSPORTS CJ McCollum to New Orleans:\nPortland: A- | Pelicans: C+ \n\nLeVert to Cleveland\nPacers: A- | Cavs: ? \n\nSabonis-Haliburton trade\nPacers: ??? | Kings: ?? \n\nTrade deadline grades: https://t.co/IqC2vOKrRl https://t.co/JtOUq64tA9 #SineadFresh",
    "111": "I will forever have a soft spot for the entertainment that the Sacramento Kings, Houston Texans, Washington Commanders, New York Jets, New Orleans Pelicans, Pittsburgh Pirates, and similar dysfunctional franchises bring me. Keep up the good work boys!",
    "112": "( $RSI) – RSI’s BetRivers Sportsbook Becomes Official Partner Of New Orleans Pelicans https://t.co/pwYnR7V6Tp",
    "113": "End of an era in Portland 👀\n\nCJ McCollum gets traded to the New Orleans Pelicans for Josh Hart, Nickeil Alexander-Walker, Tomas Satoransky, and draft picks 🏀\n\n#NBA #NBATwitter #RipCity #WontBowDown https://t.co/WBIdTaBJRC",
    "114": "Pelicans/Blazers trade details with @AnilGognaNBA of @NoTrade_Clause \n\nNOP - adds McCollum, who will be the best offensive guard Ingram and Zion have played with in New Orleans\n\nPOR - adds young wing talent (Hart/NAW) and is now one of the few teams with significant '22 cap space https://t.co/5NV2oTa3Kx",
    "115": "It hurts like hell but I'll never forget what you did for the @trailblazers  @CJMcCollum . I wish you all the best in New Orleans Pelicans.\n\n#CJ #Pelicans #NotOnHerb #Neworleans #Blazers #trade #nbatrade #NBA75 #aom #basketballart #nbaart https://t.co/arX0s1amNV",
    "116": "Mane, I’m from Louisiana, an I’ll say I hope da Pelicans leave.   New Orleans not a FA destination, front office ain’t got a clue, our franchise player would rather be at a buffet than be at a game.   Get these nigggaz OUTTA HEA https://t.co/MacfCnN6b4",
    "117": "And reporters said the Pelicans should move out of New Orleans and move to Seattle🤦🏻‍♂️🤦🏻‍♂️\n\nIt should be the Kings!",
    "118": "The Portland Trail Blazers are trading guard CJ McCollum to the New Orleans Pelicans for multiple players and draft compensation, multiple outlets reported Tuesday. https://t.co/a9tb8c3aqe",
    "119": "RSI's BetRivers Sportsbook Becomes Official Partner Of New Orleans Pelicans $RSI https://t.co/Jbmptpnc4B",
    "120": "The New Orleans Pelicans landed CJ McCollum in a trade. Our Mac Smith @macsmith215 looks at the full trade and the implications this has on both teams. #NBA #NBA75\n\nhttps://t.co/i0ZIpQfskz",
    "121": "@TotalProSports @B1ackSchefter \"New Orleans Pelicans running back\" c'mon. DO BETTER",
    "122": "New big 3 in New Orleans. \n\nBrandon Ingram, C.J. McCollum, and Zion Williamson. #Pelicans @BleacherReport https://t.co/7n6B3fXc7E",
    "123": "CJ McCollum to New Orleans:\nPortland: A- | Pelicans: C+ \n\nLeVert to Cleveland\nPacers: A- | Cavs: ? \n\nSabonis-Haliburton trade\nPacers: ??? | Kings: ?? \n\nTrade deadline grades: https://t.co/RkwNsOMk7B https://t.co/nE0Kcok3Ua",
    "124": "🔴Basketball Live ~ New Orleans Pelicans vs Houston Rockets - NBA | 2022 💯\n🔗 🔴Watch Live Fullᴴᴰ 👉 : https://t.co/i1vkJW9Lz0 ✅\n📆 :On Tuesday. February 08 /2022\n⏰ 02:00 GMT\nDONT FORGET TO RETWEET AND FOLLOW FOR MORE INFO AND UPDATE.",
    "125": "Basically the most disrespectful thing you can do to a man is trade him to the New Orleans Pelicans",
    "126": "I had no idea that we had so many New Orleans Pelicans fans out in the Twitterverse! Loving it!",
    "127": "NEW ORLEANS — The New Orleans Pelicans have acquired guard C.J. McCollum from the Portland Trail Blazers as part of a seven-player trade, according to two people familiar with the situation. https://t.co/Ml2n1RA7Da",
    "128": "Former Portland SG CJ McCollum is headed to New Orleans after a trade involving 6 players and 3 draft picks. Can NOLA build a playoff team with CJ, Zion and Ingram, and where does the move leave Damian Lillard’s future with the Trailblazers?\n#CJ #Portland #NOLA #Pelicans #Blazers",
    "129": "Yahoo! Sports:  New Orleans Pelicans acquire CJ McCollum in trade with Portland Trail Blazers https://t.co/3tw7DhYp1C",
    "130": "Pete Nance's brother Larry is on the move today, traded to the New Orleans Pelicans with CJ McCollum.",
    "131": "News: BetRivers Sportsbook becomes official partner of New Orleans Pelicans https://t.co/IjyaPiKeHG @g_insider",
    "132": "@TotalProSports \"New Orleans Pelicans running back..\"\n\nLMAO buncha fuckin amateurs",
    "133": "In other news, C.J. McCollum has been traded to the New Orleans Pelicans for their second best player and a draft pick. Well it seems Portland is in for its first rebuild in a while. Going young and looking in a different direction.",
    "134": "The New Orleans Pelicans have acquired guard C.J. McCollum from the Portland Trail Blazers as part of a seven-player trade, according to two people familiar with the situation. https://t.co/rngjfxiz4g",
    "135": "Pelicans got Nance in the deal too. I don't exactly love it, but I get it. New Orleans feels like they can make a push into the play-in and CJ is better *right now* than NAW, Satoransky and Hart. Hopefully Zion gets healthy and back on the court.",
    "136": "The Portland Trail Blazers will trade guard CJ McCollum to the New Orleans Pelicans. https://t.co/2xaSWRd86u",
    "137": "The @PelicansNBA are reportedly acquiring CJ McCollum from the Portland Trail Blazers, per @ShamsCharania and @wojespn.\n\nCan the veteran guard help New Orleans' playoff push?\n\n#WBD https://t.co/fraGrt1p7B",
    "138": "Wrong. The Pelicans can not play defense. No one fears over of the worst not only organizations in all of professional sports. New Orleans media is a public relations wing of the two local Benson owned franchises. https://t.co/Pt9ZkPiqEN",
    "139": "TIP: New Orleans Pelicans - Houston Rockets, Christian Wood 18.5 Vise, 1.85 by #tipster Aleks1234 (profit this month: +96.26)\n  #betting #Basketball #New #Orleans #Pelicans #Houston #Rockets",
    "140": "NEW ORLEANS (AP) — The New Orleans Pelicans have acquired guard C.J. McCollum from the Portland Trail Blazers as part of a seven-player trade, according to two people familiar with the situation. https://t.co/Br3iSsGzeF",
    "141": "New Orleans' first rounder (#9) now headed to Portland on the site, after the CJ McCollum trade.\n\nPelicans keep it if it is top 4\nBlazers get it 5-14\nHornets get it 15-30 (from Devonte' Graham deal)\n\nhttps://t.co/7M67xX5AG6",
    "142": "NBA - Sources: Portland Trail Blazers sending CJ McCollum to New Orleans Pelicans as part of trade https://t.co/10WnfS0MOn",
    "143": "I will miss you on the new orleans pelicans josh! https://t.co/WY7MEs24JR",
    "144": "#Pelicans shootaround update ahead of 7 p.m. home game vs. Rockets (New Orleans players pleased to enter two-week stretch of six straight home games prior to #NBA All-Star break; Houston scouting report; lineup notes + keys): https://t.co/tVaqBgXevg https://t.co/8pzNGI0a9u",
    "145": "News: BetRivers Sportsbook becomes official partner of New Orleans Pelicans https://t.co/PJTqVe3cJM",
    "146": "New Orleans Pelicans acquire CJ McCollum in trade with Portland Trail Blazers https://t.co/inp9zEpTEQ",
    "147": "[Charania] The New Orleans Pelicans are finalizing a deal to acquire Portland Trail Blazers guard CJ McCollum for a package around Josh Hart and draft compensation, sources tell @TheAthletic @Stadium. https://t.co/piSLI10lCh",
    "148": "Pelicans Shootaround Update: The New Orleans All-Star will try to take advantage of ‘home cooking’ during the six-game stretch before the break. New Orleans Pelicans https://t.co/AymTP81je9",
    "149": "AP sources: The New Orleans Pelicans have acquired guard C.J. McCollum from the Portland Trail Blazers as part of a seven-player trade.\n\nby @brettmartel \n https://t.co/diIQNsMo8x",
    "150": "The New Orleans Pelicans have acquired guard C.J. McCollum from the Portland Trail Blazers as part of a seven-player trade, according to two people familiar with the situation. https://t.co/pwmN2WYN4h",
    "151": "New Orleans Pelicans acquire CJ McCollum in trade with Portland Trail Blazers #YahooSports #NBA https://t.co/5b3tndys64",
    "152": "The New Orleans Pelicans have acquired guard C.J. McCollum from the Portland Trail Blazers as part of a seven-player trade, according to two people familiar with the situation\n\nhttps://t.co/zeCd9GllRx",
    "153": "Trail Blazers trade CJ McCollum to New Orleans Pelicans, reports say https://t.co/IEHOxP9WDW",
    "154": "CJ McCollum is going to the New Orleans Pelicans 🏀\n\nDo the Pelicans have the new big 3 with CJ, Ingram, &amp; Zion? https://t.co/rZ5hiUhgbb",
    "155": "Cj McCollum has been traded to the New Orleans Pelicans",
    "156": "In the last 3 seasons no roster has changed more than the New Orleans Pelicans.",
    "157": "[Charania] The New Orleans Pelicans are finalizing a deal to acquire Portland Trail Blazers guard CJ McCollum for a package around Josh Hart and draft compensation, sources tell TheAthletic Stadium.",
    "158": "@RyanBerger my man, I’m mad about a lot of thigns in the world I”m mnot mad about the new orleans pelicans, have a good one",
    "159": "Sources - Portland Trail Blazers sending CJ McCollum to New Orleans Pelicans as part of trade - ESPN https://t.co/upeIRmWueK",
    "160": "What a day for New Orleans. #Pelicans make a huge trade and the #Saints are expected to introduce Dennis Allen as the new head coach. Stick with us on @WWLTV for complete coverage 💃🏼",
    "161": "Portland Trail Blazers sending CJ McCollum to New Orleans Pelicans as part of trade https://t.co/gnpcLipHzZ",
    "162": "Sources - Portland Trail Blazers sending CJ McCollum to New Orleans Pelicans as part of trade - ESPN https://t.co/LVFzv428Nq",
    "163": "New Orleans Pelicans adquirieron a CJ McCollum https://t.co/C3a52ABxdv",
    "164": "Former UNM Lobo Tony Snell and former Wyoming Cowboy Larry Nance part of the big NBA trade toady, both heading from Portland to the New Orleans Pelicans. https://t.co/JJXYB8cBUf",
    "165": "Sources - Portland Trail Blazers sending CJ McCollum to New Orleans Pelicans as part of trade - ESPN https://t.co/kWrTSx7HHK via @GoogleNews",
    "166": "Will CJ McCollum help the Pelicans much? Doubtful without Zion but New Orleans ain't have to give up much to get him",
    "167": "Cj McCollum To The Pelicans!! | New Orleans Pelicans NBA 2k22 https://t.co/BPn9i5yFyQ via @YouTube",
    "168": "@joshhart Josh man we love you out here in New Orleans you really put on for our city and represented us to the fullest as a pelicans fans thats all I wanted from our players. Thank you so much for your dedication #DoitBig in Portland and trust the city didn't wanna see you go",
    "169": "Breaking: The Portland Trail Blazers have agreed to trade CJ McCollum, Larry Nance and Tony Snell to the New Orleans Pelicans.\n\nPortland will receive Josh Hart, Tomas Satoransky, Nickel Alexander-Walker, Didi Louzada, a future first-round pick two future second-round picks, https://t.co/QdpStm7PVM",
    "170": "@CocoJr @BillSimmons damn you’re right. better just keep josh hart at $12M so the pelicans can finish 10 games under .500 and watch zion walk on them. would really hate to break that up.\n\nbut better save that money for the big time free agent that will sign with new orleans lol",
    "171": "CJ to New Orleans Pelicans... I don't like it",
    "172": "New Orleans Pelicans starting 5 &amp; bench, while healthy, after the CJ McCollum trade: \n\nPG: Devonte’ Graham \nSG: CJ McCollum \nSF: Brandon Ingram \nPF: Zion Williamson \nC: Jonas Valanciunas \n\nBench: Jones, Nance, Snell, Alvarado, Hayes, Hernangomez, Lewis, Marshall, Murphy https://t.co/YUCQzsWgKu",
    "173": "Josh Hart will be GREATLY missed. He was key in not only helping this Pelicans team turn their season around but of also laying the foundation of a good growing culture inside Willie Green's locker room.\n\nWhatever New Orleans becomes, Hart's positive stamp will forever remain. https://t.co/nIDmbSv1Am",
    "174": "With the addition of CJ McCollum to Brandon Ingram, and the possible return of Zion Williamson, do the New Orleans Pelicans now have a nucleus to compete in the West??? https://t.co/l6OqUqsC7v",
    "175": "Pelicans should have the full MLE available next summer. 4 years, $41M+. I hope Josh wants it. Fully guarantee all of it this time New Orleans. https://t.co/8QlDSmnfo2",
    "176": "The New Orleans Pelicans are a legit NBA team again. Let's get it",
    "177": "Best of luck to @CJMcCollum in New Orleans! The @PelicansNBA got some new fans - #LehighNation 🤝\n\n@LehighU @LehighAlumni https://t.co/4VizArlTr1",
    "178": "The New Orleans Pelicans are now better than the Portland Trailblazers lol 😂 #FreeDame",
    "179": "Portland Trail Blazers sending CJ McCollum to New Orleans Pelicans as part of trade https://t.co/LDawHmCeta",
    "180": "Portland Trail Blazers sending CJ McCollum to New Orleans Pelicans as part of trade https://t.co/CdQHvOy6Cf",
    "181": "The Rockets come to town for a Tuesday showdown 🚀\n\n@PelicansNBA vs @HoustonRockets \n⏰ 6:30 pm\n📺 Bally Sports New Orleans\n📲 Bally Sports App\n#WBD https://t.co/iqudvZIg2n",
    "182": "Portland Trail Blazers sending CJ McCollum to New Orleans Pelicans as part of trade https://t.co/4Qkm5uzwve",
    "183": "The New Orleans Pelicans just traded for another dude that doesn't wanna play there",
    "184": "Portland Trail Blazers sending CJ McCollum to New Orleans Pelicans as part of trade https://t.co/tlGcgfmeEJ",
    "185": "Portland Trail Blazers sending CJ McCollum to New Orleans Pelicans as part of trade https://t.co/GsroX2dkvF",
    "186": "I don’t think I’ve ever thought about CJ McCollum and the New Orleans Pelicans in the same thought before",
    "187": "NBA Trade Grades: Blazers offload CJ McCollum to New Orleans Pelicans https://t.co/DSvqytwLtW",
    "188": "Sources: Blazers sending McCollum to Pelicans: Portland is trading CJ McCollum to New Orleans along with Larry Nance Jr. and Tony Snell, sources told ESPN's Adrian Wojnarowski. https://t.co/snMM7g6rIX https://t.co/u3gGDkpLoc",
    "189": "Portland Trail Blazers sending CJ McCollum to New Orleans Pelicans as part of trade https://t.co/LRwU8Y9JW5",
    "190": "Portland Trail Blazers sending CJ McCollum to New Orleans Pelicans as part of trade https://t.co/6RR2i4gkag",
    "191": "Consensus Line Move:\n2022-02-08 Houston Rockets at New Orleans Pelicans from 227.00 to 225.50\nUnder fortune knocks\n#NBA #handicapper #deeplearning #bitcoinmining",
    "192": "@joshhart Had so much fun watching you in new Orleans, best of luck in Portland. There were some wild pelicans comeback wins that I won't forget. Thanks for everything",
    "193": "What can the New Orleans Pelicans package some of the picks below plus Brandon Ingram and Devonte Graham for? https://t.co/2ENEWuCewa",
    "194": "The New Orleans #Pelicans trade for CJ McCollum. What this means for the Pelicans and what this means for the #Trailblazers remains to be seen. But this is big. #NBA75 https://t.co/LluoqmsVLk",
    "195": "@BleacherReport @ShamsCharania Omg @CJMcCollum 😬 well loves New Orleans but the #Pelicans isn't going nowhere #NBA75 @BleacherReport . https://t.co/atsxJ0HoAn",
    "196": "Can we get rid of the New Orleans Pelicans as a franchise? All they do is waste good players prime years…",
    "197": "Reports say the Portland @trailblazers are trading CJ McCollum to the New Orleans Pelicans. @PelicansNBA get McCollum, Larry Nance Jr., and Tony Snell. Blazers get Josh Hart, Tomas Satoransky, Nickeil Alexander-Walker, Didi Louzada, 2022 1st-round pick, 2 future 2nd-round picks. https://t.co/AFcPAyckht",
    "198": "New Orleans Pelicans New Starting Lineup: \n\n(If All are Healthy)\n\nPG: Devonte'Graham\nSG: CJ McCollum\nSF: Brandon Ingram\nPF: Zion Williamson\n  C: Jonas Valanciunas\n\n#NBA75 https://t.co/IPKB602kNz",
    "199": "The Solid: The Pelicans are setting themselves up with a weak third star in CJ McCollum. A 20+ point scorer who can lift New Orleans' floor even higher. Larry Nance will also help as will just not playing NAW anymore. Pelicans get a lot better.",
    "200": "Sources - Portland Trail Blazers sending CJ McCollum to New Orleans Pelicans as part of trade - ESPN https://t.co/CiLului2sQ",
    "201": "\"Shoutout to you New Orleans. You did a good thing\" \n\n@BryanFonsecaNY is a fan of the CJ McCollum trade for the @PelicansNBA 📈 https://t.co/SR4QPkD1zp",
    "202": "Sources - Portland Trail Blazers sending CJ McCollum to New Orleans Pelicans as part of trade.\nhttps://t.co/tk6CEuRX7f\n\nvia @GoogleNews",
    "203": "after the cj trade, new orleans pelicans three best players are all terrible defenders. let's hope they can score 180 points a night!",
    "204": "SPEAK INTO EXISTENCE!!!! I knew Portland was gonna do something! CJ on the move to New Orleans baby! I love that for the Pelicans! Energy is so real! https://t.co/jsl4EyEMEm",
    "205": "The New Orleans Pelicans just got significantly better by adding a standout guard to their backcourt.  https://t.co/qKv0V34CDb",
    "206": "The New Orleans Pelicans just got significantly better by adding a standout guard to their backcourt.  https://t.co/LWdKOOZIxS",
    "207": "The New Orleans Pelicans just got significantly better by adding a standout guard to their backcourt.  https://t.co/kcsqJn1xTu",
    "208": "The New Orleans Pelicans just got significantly better by adding a standout guard to their backcourt.  https://t.co/nAhREHx4ZX",
    "209": "The New Orleans Pelicans just got significantly better by adding a standout guard to their backcourt.  https://t.co/PiU43ZMS9W",
    "210": "C.J. McCollum will be heading to New Orleans to join Brandon Ingram and Zion in a huge trade package that included Larry Nance and Josh Hart. #Trailblazers #Pelicans https://t.co/GcMB6RJXII",
    "211": "@BillSimmons Contract the Pelicans. New Orleans cares about 1. Saints football 2. LSU football 3. Other NFL football 4. SEC football 5. Tulane football 6. LSU baseball…and then they get to the Pelicans",
    "212": "CJ McCollum Traded to New Orleans Pelicans - Upside Sports Network https://t.co/2ROAPeN3KD",
    "213": "Sources: Portland Trail Blazers sending CJ McCollum to New Orleans Pelicans as part of trade Sources: Portland Trail Blazers sending CJ McCollum to New Orleans Pelicans as part of trade\nhttps://t.co/fToshzr9ck\nvia @ESPN Fantasy App\nhttps://t.co/M6AZNQnH7Z",
    "214": "CJ McCollum Traded to New Orleans Pelicans - Upside Sports Network\nhttps://t.co/UgWj9VyoK2",
    "215": "Portland Trail Blazers sending CJ McCollum to New Orleans Pelicans as part of trade https://t.co/7GgbSmt4LR",
    "216": "Los New Orleans Pelicans reciben: C.J. McCollum, Larry Nance y Tony Snell.\n\nLos Portland Trail Blazers reciben: Josh Hart, Nickeil Alexander-Walker, Tomas Satoransky y compensaciones por draft. https://t.co/IfajSaJ0K7",
    "217": "McCollum to new orleans #nba #tradedeadline #trailblazers #nbatrades #pelicans  https://t.co/NQEiVwodHv https://t.co/lj1Qj9peIH",
    "218": "\"Siri, where can I find CJ McCollum New Orleans Pelicans Shirt In New Orleans Saints Colors\" @CJMcCollum",
    "219": "New Orleans' 2022 first-round pick: \n\n1-4: Goes to the Pelicans\n5-14: Goes to the Blazers \n15-30: Goes to the Hornets \n\n- Blazers get a future first-round pick if it doesn't convey\n- Hornets get future second-round picks if it doesn't convey",
    "220": "I’m not too sure which side really has a benefit in this deal. Clearly the Pelicans got the best player in the deal but their protection as of now will be useless. Nevertheless it’s a good deal for New Orleans imo https://t.co/ILO2ucNUJj",
    "221": "Will always root for @joshhart ❤️💛💙 and New Orleans is going to miss you. Very excited to land @CJMcCollum and @Larrydn22. @PelicansNBA how soon we gonna be able to get those jerseys?",
    "222": "@joshhart embraced the Pelicans &amp; New Orleans, played hard every night, had some funny moments, and was a great teammate.  He is the anti-EG (iykyk).  I truly enjoyed pulling for him and will continue to do so.  You will be missed, but never forgotten. #highfive",
    "223": "McCollum to New Orleans in a multiplayer trade is official. Pelicans who are 10th in the West right now must believe Zion is good to go for the long haul https://t.co/wUihChEWpJ",
    "224": "The New Orleans Pelicans https://t.co/moBVQiOJpk",
    "225": "Send him to the pelicans , when RJ contract up he’ll up in New Orleans with Zion https://t.co/sLycRmTI7C",
    "226": "Trail Blazers Trade CJ McCollum to Pelicans for Josh Hart, Picks: Steve Dykes-USA TODAY Sports  \n\nAfter years of speculation, the nine-year veteran finds a new home. \n\nCJ McCollum has been traded to the New Orleans Pelicans for forward Josh Hart… https://t.co/yP8tJUzsET #RipCity https://t.co/pkasL7hd3s",
    "227": "Pelicans’ organization is also showing to Zion that they’re committed to building a quality team around him.\n\nMcCollum &amp; Nance Jr. will fit well in New Orleans. https://t.co/8JSNuSMng9",
    "228": "The new CURRENT starting five for the New Orleans Pelicans:\nPG: Devonte Graham\nSG: CJ McCollum\nSF: Brandon Ingram\nPF: Herbert Jones\nC: Jonas Valanciunas \n\n*Definitely not a title contender, but a very interesting team if Zion Williamson ever comes back healthy\n\n#NBATwitter",
    "229": "The New Orleans Pelicans are finalizing a deal to acquire Portland Trail Blazers guard CJ McCollum for a package around Josh Hart and draft compensation, sources tell @Vengeance_NN",
    "230": "@joshhart I really loved the way you embraced New Orleans and the Pelicans when you were first traded. You became a favorite of mine and you will continue to be. Sorry you’re leaving but I wish you much success and happiness in your future. Good luck to you and your family!!!",
    "231": "The New Orleans Pelicans are an unserious franchise",
    "232": "🚨 Big trade alert 🚨 \n\nNew Orleans Pelicans get CJ McCollum, Larry Nance Jr, Tony Snell and a second-round pick.\n\nThe TrailBlazers get Josh Hart, Tomas Satoransky, Nickeil Walker-Alexander, Didi Louzada, a 2022 first-round pick, and two second-round picks.",
    "233": "@BillSimmons On today’s episode of Bill Simmons hates all things New Orleans, watch Bill call a former Pelicans player a winner while simultaneously exclaiming that the franchise sucks at everything.  Make it make sense!  “Oh nvm they got Larry Nance, good trade.”  🙄",
    "234": "Houston Rockets At New Orleans Pelicans Feb.8 2022 Free NBA Play and Predictions #johnnyhahnwins \n\nhttps://t.co/OKsUBO6Weg",
    "235": "@AustinKent Some unlikely guys are getting one in New Orleans. Assuming you're saving a spot for Zion as well. Any particular reason why Pelicans have no MGLE yet, but Hornets are all done?",
    "236": "The Pelicans have landed a shooter + versatile big!\n\nNeeding to shore up the guard position &amp; roster depth, New Orleans acquires CJ McCollum &amp; Larry Nance Jr. from the Trail Blazers.\n\nTrading Josh Hart hurts, but Nola fills several holes in one fell swoop. https://t.co/UyfV3PGQmH https://t.co/9plfCrW1gp",
    "237": "The Portland Trail Blazers are sending CJ McCollum, Larry Nance Jr. and Tony Snell to the New Orleans Pelicans, and will receive Josh Hart, Nickeil Alexander-Walker, Tomas Satoransky, Didi Louzada, a first-round pick and two second-round picks. https://t.co/KYaEAdoh2o",
    "238": "The Portland Trail Blazers are sending CJ McCollum, Larry Nance Jr. and Tony Snell to the New Orleans Pelicans, and will receive Josh Hart, Nickeil Alexander-Walker, Tomas Satoransky, Didi Louzada, a first-round pick and two second-round picks. https://t.co/OgRj1qVrFR",
    "239": "New Orleans is about to be a basketball city now! @PelicansNBA @dg_riff",
    "240": "@joshhart bro thanks you for being a part of the pelicans and the city of new orleans",
    "241": "God bless this Woj Bomb and the New Orleans Basketball Playing Pelicans https://t.co/XIlv0W5cCF",
    "242": "Breaking News \nBlazers and Pelicans agree on deal, with CJ McCollum, Larry Nance and Tony Snell on the way to New Orleans - Woj  https://t.co/wfvbirrvv7",
    "243": "The New Orleans Pelicans are acquiring CJ McCollum for Josh Hart and draft compensation. The Pelicans will also receive Tony Snell and Larry Nance Jr.",
    "244": "Great day for the Pelicans and fan base. They deserve to be excited and happy. This is what they’ve been waiting for. Team is playing better and holding the 10 seed and now adding some much needed fire power. Exciting times in New Orleans.",
    "245": "@joshhart @_Andrew_Lopez As a @PelicansNBA fans, I really hate to see you go. You’ve been a great ambassador for the city of New Orleans and one heck of an entertaining player to watch. Nothing but we’ll wishes from this fan base for you!!",
    "246": "for Taurean Prince and a 2021 2nd round draft pick (Marcus Zegarowski was later selected).\n\nThe very next day he was traded by the #Hawks with Jaxson Hayes, Marcos Louzada Silva and a 2020 1st round draft pick to the New Orleans Pelicans for Jordan Bone, Solomon Hill,",
    "247": "a 2023 1st round draft pick and a 2024 1st round draft pick to the #Pelicans; the #Lakers traded Isaac Bonga, Jemerrio Jones, Moritz Wagner and a 2022 2nd round draft pick to the #Wizards; the New Orleans #Pelicans traded Anthony Davis to the #Lakers",
    "248": "Breaking news CJ McCollum has been traded to New Orleans Pelicans\n\nBlazers: Josh Hart, Tomas Satoransky, Nickeil Walker-Alexander, Didi Louzada, 2022 protected first-round pick, two second-round picks. \nPelicans: CJ McCollum, Larry Nance, Tony Snell.",
    "249": "@EllTeycer The New Orleans Pelicans are finalizing a deal to acquire Portland Trail Blazers guard CJ McCollum for a package around Josh Hart and draft compensation, sources tell @TheAthletic @Stadium.",
    "250": "URGENTE\n\nTROCA NA NBA\n\nO New Orleans Pelicans recebe:\n\nCJ McCollum\nLarry Nance\nTony Snell\n\nO Portland Trail Blazers recebe:\n\nJosh Hart\nNickeil Alexander-Walker\nDidi Louzada\n1 Pick de Draft de 1 ° rodada (Protegida) \n2 Picks de 2° rodada https://t.co/mzoh7unbOx",
    "251": "The Detroit Pistons are finalizing a deal that would send forward Jerami Grant to the New Orleans Pelicans in exchange for 2019 1st overall pick forward Zion Williamson and draft compensation, sources tell @TheAthletic @Stadium.",
    "252": "@GanstaGastino @concertgoer80 @kendontmiss Chris Paul didn’t leave cause he didn’t want to play in New Orleans same with Davis it’s cause they wanted to contend and the Pelicans will do that soon",
    "253": "As a fellow Wildcat in New Orleans, will miss ya, @joshhart, but wish you the best of luck out west! #WBD #Pelicans #attitude #NovaNation #RipCity",
    "254": "New Orleans pelicans are going be 🔥 i am excited to CJ McCollum",
    "255": "CJ McCollum is headed to New Orleans! 🎨\n\n@CJMcCollum @PelicansNBA @ComplexSports @SportsCenter  #NBATwitter #NBATwitterLive #jerseyswap #smsports #NBA75 https://t.co/TzeC4yM5Zc",
    "256": "Trade Alert 🚨 \n\nThe Portland Trailblazers have agreed to send G CJ McCollum to the New Orleans Pelicans in exchange for Josh Hart, Nickel Alexander-Walker &amp; their 2022 First Round Pick (Protected) \n\nVia (@wojespn) https://t.co/3UmaTzZVnU",
    "257": "\"RT @wojespn: The Portland Trail Blazers and New Orleans Pelicans are in serious discussions on a trade centered on guard CJ McCollum, sources tell ESPN. Talks are ongoing today.\"",
    "258": "Second meeting with the Pelicans in three days for the #Rockets tonight. \n\nNew Orleans will be down a few players ⬇️ https://t.co/UqUmmsrhuk",
    "259": "The 🐐 Larry Nance Jr. has been traded to the New Orleans Pelicans.",
    "260": "TRADE DETAILS:\n\nNew Orleans Pelicans Recieve: CJ McCollum, Larry Nance &amp; Tony Snell #RipCity  \n\nPortland Trail Blazers Receive: Josh Hart, Nickeil Alexander-Walker, Tomas Satoransky &amp; Draft Compensation #WBD",
    "261": "🚨The Trailer Blazers and the New Orleans Pelicans agree on a deal with CJ McCollum, Larry Nance, and Tony Snell on the way to New Orleans!!🚨 #NBATradeDeadline",
    "262": "#RT @AdamSchefter: RT @wojespn: The Portland Trail Blazers and New Orleans Pelicans are in serious discussions on a trade centered on guard CJ McCollum, sources tell ESPN. Talks are ongoing today.",
    "263": "The Portland Trailblazers are trading G CJ McCollum and G Damian Lillard to the New Orleans Pelicans for G Tomáš Satoranský, per sources. That's the whole deal.",
    "264": "Blazers and Pelicans agree on deal, with CJ McCollum, Larry Nance and Tony Snell on the way to New Orleans - Woj  https://t.co/wDZi2b683U",
    "265": "🚨TRADE ALERT🚨\n\nPortland Trail Blazers Receive:\nJosh Hart\nNickeil Alexander-Walker\nTomas Satoransky \nFuture 1st RD Pick\nFuture 2nd RD Pick\n\nNew Orleans Pelicans Receive:\nCJ McCollum\nLarry Nance Jr\nTony Snell\n\nGrade this trade?! #NBATwitter https://t.co/vhh3Q4Z6lY",
    "266": "With CJ in New Orleans now the Pelicans should be able to hold onto their 10th seed spot this year but next season they'll make some noise in the West",
    "267": "Oh Man, New Orleans Pelicans I see you!! Zion, CJ, BI, Herb Jones, Jaxson Hayes, Jonas, Devonte Graham! That’s a squad!! 🏀🏀🏀🏀🏀🏀🏀 🦅 🦅🦅🦅",
    "268": "That’s a really nice deal for New Orleans. Didn’t give up anything major to get CJ and Nance. Pelicans needed a guard and there probably wasn’t a better one available on the market better than CJ. Nance is a nice add-on as well to shore up the bench a bit.",
    "269": "Five things to know about Pelicans on February 8, 2022 | New Orleans Pelicans https://t.co/bf1XnIPvfy",
    "270": "Tony Snell traded to New Orleans?\n\nGuess I’m a pelicans fan now",
    "271": "Now I've swung back in New Orleans favor. Larry Nance is nice!\n\nPelicans rotation (when healthy): Graham, CJ, Ingram, Zion, Jonas, Herb Jones, Nance, Hayes\n\nNeed a lot more guard depth but not terrible...",
    "272": "🚨TRADE ALERT🚨\n\nIt's an end of an era, as CJ McCollum is being traded to the New Orleans Pelicans. Join @ToreyJonesYT and @hoopsjock as the discuss the Blazers latest deal.\n\nhttps://t.co/PbOTRTHEZY",
    "273": "Pelicans not in any better shape the front office is a mess and Zion is out of shape and reportedly wants out New Orleans. But good for McCollum playing after his health issue. https://t.co/FqHOPhYjXS",
    "274": "#NBA C.J. McCollum New Orleans Pelicans’ta\nhttps://t.co/i5GYdyoMIl",
    "275": "Portland Trail Blazers to send C.J. McCollum, Larry Nance Jr. and Tony Snell to the New Orleans Pelicans for Josh Hart, Nickeil Alexander-Walker, Tomas Satoransky and draft compensation, per sources. https://t.co/sKK3G88kUc",
    "276": "The CJ McCollum to the Pelicans trade on paper has implications for an Eric Gordon trade, but let’s be honest: EG was not going back to New Orleans, and I’m not sure that city was ready to accept him back either 😂",
    "277": "The New Orleans Pelicans are finalizing a deal for CJ McColl-\n\nMe: https://t.co/10Guh8LfZT",
    "278": "Consensus Line Move:\n2022-02-08 Houston Rockets at New Orleans Pelicans from 228.50 to 227.00\nUnder has books scared\n#NBA #betting #pythonprogramming #wealth",
    "279": "Nance involved too? Good get for New Orleans. As I've been saying, this isn't the same Pelicans team that was in the basement for the first month #WBD",
    "280": "@TrashTalk_fr « The New Orleans Pelicans won the Anthony Davis trade »",
    "281": "Portland and New Orleans have agreed upon a trade --- CJ McCollum, Larry Nance and Tony Snell are on the way to the Pelicans, sources tell ESPN. https://t.co/Hy4oxNNTiM",
    "282": "BREAKING NEWS : CJ MCCOLLUM HEADING TO THE NEW ORLEANS PELICANS https://t.co/HpY80uatWy via @YouTube NEW VIDEO ALERT 🚨 https://t.co/kF4nQgTeN9",
    "283": "The Portland Trail Blazers and New Orleans Pelicans are in serious discussions on a trade centered on guard CJ McCollum, sources tell ESPN. Talks are ongoing today.5... #mobilsocial https://t.co/uMwLk9HTkm",
    "284": "Nah Lonzo woulda been a perfect fit on this Pelicans team lmao New Orleans is ass",
    "285": "@NickeilAW bro… thank you for everything you’ve done for New Orleans, and Pelicans nation! You’re a baller and gonna kill it in Portland! ALWAYS A PELICAN!! Best of luck to you bro!",
    "286": "If the Pelicans make the NBA finals I will never slander a team from New Orleans again",
    "287": "CJ McCollum will be traded yo the New Orleans pelicans for Josh Hart and trade pieces. per @BleacherReport",
    "288": "If the New Orleans pelicans can get CJ McCollum for Josh Hart anything is possible from my Lakers https://t.co/3c9iYj9xAA",
    "289": "Wow, CJ McCollum no New Orleans Pelicans. https://t.co/QLtaboyKyf",
    "290": "Trade in progress as per @wojespn \n\nThe Portland Trail Blazers and New Orleans Pelicans are in serious discussions on a trade centered on guard CJ McCollum, sources tell ESPN. Talks are ongoing today. https://t.co/ahlJlwAIUZ",
    "291": "#RT @ShamsCharania: The New Orleans Pelicans are finalizing a deal to acquire Portland Trail Blazers guard CJ McCollum for a package around Josh Hart and draft compensation, sources tell @TheAthletic @Stadium.",
    "292": "Wait wait wait wait... I need Zion to get healthy and ready to play. The New Orleans Pelicans just got a TAD bit better with CJ. https://t.co/Nr2avGHndJ",
    "293": "Just like getting New Orleans in a box break and then pulling all the wrong Pelicans. https://t.co/Y283wmsT8P",
    "294": "BREAKING TRADE: CJ MCCOLLUM TO NEW ORLEANS! \n\nPelicans receive: CJ McCollum \nBlazers receive: Josh Hart, Nickeil Alexander-Walker, Tomas Satoransky, Future Draft Picks \n\nWho won the deal? 🤔\n\nMORE DETAILS TO COME &amp; THIS POST WILL BE UPDATED ‼️ https://t.co/WzPwYKiWOV",
    "295": "CJ McCollum traded to the New Orleans Pelicans\n\nhttps://t.co/AMkJ6dDfWR https://t.co/DzTNgfYIEX",
    "296": "CJ McCollum has been traded to the New Orleans Pelicans.\n\nTRADE DETAILS:\n\n- Pelicans: CJ McCollum \n\n- Blazers: Josh Hart, Nickeil Alexander-Walker, Tomas Satoransky, Draft Compensation",
    "297": "The Portland Trail Blazers are finalizing a deal to send  #CJMcCollum to the New Orleans #Pelicans for a package centered around  #JoshHart and draft compensation, according to The Athletic's Shams Charania.  🏀 #NBATwitter #NBA #RIPCity  https://t.co/C6OIlAxzZc",
    "298": "CJ McCollum is on his way to New Orleans:\n\nTrail Blazers get: Josh Hart, Nickeil Alexander-Walker, Tomas Satoransky, and draft compensation\n\nPelicans get: CJ McCollum \n\nVia @ShamsCharania",
    "299": "The New Orleans Pelicans are finalizing a deal to acquire Portland Trail Blazers guard CJ McCollum for a package around Josh Hart and draft compensation, sources tell _TheAthletic _Stad0... #mobilsocial https://t.co/8S677MSl3Z",
    "300": "Mane just send da Pelicans to Seattle an call it a day.   New Orleans is not a NBA city bruh.",
    "301": "The New Orleans Pelicans are finalizing a deal to acquire Portland Trail Blazers star CJ McCollum in exchange for Josh Hart and draft picks. https://t.co/y08hTHT9KG",
    "302": "The New Orleans #Pelicans are acquiring guard CJ McCollum from Portland in a package centered around Josh Hart and draft picks, per @ShamsCharania.",
    "303": "O Portland Trail Blazers vai mandar CJ McCollum para o New Orleans Pelicans e receber de volta Josh Hart + picks (via @ShamsCharania e @wojespn)\n\n👀👀👀",
    "304": "it’s crazy that the georgia bulldogs and the new orleans pelicans are going to win championships in the same season",
    "305": "New Orleans Pelicans are a failed experiment. Move them to Seattle.",
    "306": "The #Pelicans trading for CJ McCoullum very much feels like it’s do or die time for the New Orleans. Make the playoffs and you buy yourself more time. \n\nZion needs to be back on the court as soon as possible.",
    "307": "Potential New Orleans Pelicans starting five:\n\nJonas Valanciunas\nZion Williamson\nBrandon Ingram\nDevonte Graham\nCJ McCollum\n\nNow that team is a problem. West ain't ready for it🔥\n\n#NBATwitter #Pelicans",
    "308": "🏀🏀🏀\n2022-2023 New Orleans Pelicans starters:\n\n⭐️Devonte' Graham (meh)\n⭐️CJ McCollum\n⭐️Brandon Ingram\n⭐️Zion Williamson\n⭐️Jonas Valanciunas\n\nBench: Hayes, Temple, NAW. Herb Jones. \n\nI LIKE it. Just need a potential PG upgrade\n\n#NBA #NBATradeDeadline #Pelicans #NewOrleans",
    "309": "I would presume that if the New Orleans Pelicans are confident in trading for CJ McCollum, they are also confident that Zion will return sooner rather than later.",
    "310": "Revenge Game: Eric Gordon plays New Orleans tonight.  He played 221 games in his career for the Pelicans.",
    "311": "So Josh hart to Portland and Cj to New Orleans … what is Portland have up there sleeve for the future because ? I’m personally not seeing this team being a playoff team for the next 2 years… Kopy🎙\n\n#nba #Portland #Pelicans #NBATwitter",
    "312": "Report: Portland Trail Blazers sending C.J. McCollum to New Orleans Pelicans https://t.co/g4pqGq2Ww3",
    "313": "Somehow the Pelicans are going to struggle to make the playoffs with CJ McCollum, Zion Williamson and Brandon Ingram. Just because that's who New Orleans is as a franchise.",
    "314": "🚨🚨BREAKING #NBA NEWS!🚨🚨\n\nThe New Orleans @PelicansNBA have just traded Josh Hart to the Portland @trailblazers in exchange for G CJ McCollum!!🔥🔥\n\nWhat is YOUR take??\n#NBA75 #CJMcCollum",
    "315": "Whoa. Shams is reporting that New Orleans is finalizing a deal to acquire Portland's CJ McCollum for Josh Hart &amp; multiple draft picks. Huge score for the Pelicans, who have won three in a row &amp; are 4-0 ATS in their last four contests.",
    "316": "As things stand right now, the Lakers would potentially have to play a play in game against the Pelicans who might have a starting 5 of Graham/McCollum/Ingram/Zion/Valanciunas. New Orleans would be favored to win that game.",
    "317": "McCollum must be so excited to finally get out of that situation in Portland and then head to the New Orleans Pelicans. https://t.co/MrcAPZmhd1",
    "318": "The New Orleans Pelicans are acquiring CJ McCollum from Portland via @ShamsCharania https://t.co/u3cMQidD0i",
    "319": "New Orleans Pelicans isn’t a great situation lol https://t.co/jqduCreBLo",
    "320": "Pelicans are on verge of bolstering their backcourt line.\n\nPortland Trail Blazers and New Orleans club are in serious trade talks for CJ McCollum💪\nhttps://t.co/6iXdHSqJpt",
    "321": "McCollum to the Pelicans! New Orleans finally found their shooting guard. \n\nMcCollum is a major upgrade over Hart. They’ll contend soon in a year or two, provided Zion Williamson stays healthy. #Pelicans #NBA",
    "322": "The Portland Trail Blazers are sending guard CJ McCollum to the New Orleans Pelicans for a package built around guard Josh Hart and draft compensation. (Per @ShamsCharania)",
    "323": "Whoa #cjmccollum #pelicans #zion \n\n🚨 CJ McCollum Traded to Pels: New Orleans is finalizing a deal to acquire Blazers guard in exchange for Josh Hart, draft compensation (Shams) https://t.co/xOpwB6bEWq",
    "324": "Future looks great for New Orleans Pelicans…. Got Ingram, CJ, and key role players\n\nGet Zion fully healthy and they could Have something cooking in New Orleans",
    "325": "The Pelicans are 13-11 in their last 24 games. After adding CJ McCollum, they are clear favorites to be in the West's top 10 for the postseason. POR, SAS, SAC, OKC and HOU -- I can't see any of them passing New Orleans. Spurs may be the only team trying to.",
    "326": "New Orleans Pelicans are finalizing a deal to acquire Portland Trail Blazers guard CJ McCollum for a package around Josh Hart and draft compensation per @ShamsCharania",
    "327": "According the Woj &amp; Shams, a CJ McCollum trade is being finalized with the New Orleans Pelicans. CJ embodied everything it meant to be a Trailblazer. One of the franchises best. Show the NBA what you’re made of and take those Pelicans to the playoffs. End of an era.🖤❤️ #RipCity https://t.co/kgMvzsoNDT",
    "328": "The New Orleans Pelicans are finalizing a deal to acquire Portland Trail Blazers guard CJ McCollum for a package around Josh Hart and draft compensation, sources tell @TheAthletic @Stadium.",
    "329": "The Portland Trail Blazers have traded CJ McCollum to the New Orleans Pelicans for Josh Hart &amp; draft compensation https://t.co/eKoRxkPnkd",
    "330": "NBA TRADE ALERT 🚨:\nThe Portland #Blazers are trading SG CJ McCollum to the New Orleans #Pelicans for Josh Hart and a future draft compensation. #CJMcCollum #JoshHart #NBA https://t.co/CnqrEbiuXB",
    "331": "Good move from New Orleans — not because they’ll actually win anything now, but because of the message this sends to guys like BI &amp; Zion. Star players have to know that their organization wants to win, or else they’ll inevitably leave. #Pelicans #WBD https://t.co/8bPmnpuddT",
    "332": "|🏀| Destination les New Orleans Pelicans pour CJ McCollum.\nJosh Hart devrait faire le chemin inverse. (@ShamsCharania) https://t.co/Neo9EwCDE6",
    "333": "The New Orleans Pelicans are finalizing a deal to acquire Portland Trail Blazers guard CJ McCollum for a package around Josh Hart and draft compensation, sources tell @TheAthletic @Stadium. https://t.co/XcyoloHkmU",
    "334": "GAMEDAY 🚀Tonight We will be Taking on the New Orleans Pelicans at 7:00 PM Central \n\n📺 AT&amp;T SportsNet Southwest, NBA, NBA League Pass #NBA75 #Rockets @ATTSportsNetSW https://t.co/SGmf6kU53T",
    "335": "I just want to thank @joshhart for everything he’s done and meant to the New Orleans Pelicans franchise. Us fans will miss his leadership, value to the team &amp; him as a person. He bought in the moment he came over from the Lakers and created a lifetime worth of memories in NOLA.",
    "336": "The New Orleans Pelicans are finalizing a deal to acquire Portland Trailblazers guard CJ McCollum for a package around Josh Hart and Draft Compensation. https://t.co/LNxvKvIQPW",
    "337": "New Orleans Pelicans acquiring CJ McCollum from the Blazers https://t.co/kS43ekZc6H",
    "338": "I'm really going to miss @joshhart in New Orleans. He bought into the franchise and city in a way that many players traded here do not. \n\nI hope he also develops a taste for Oregon Pinot Noir. I know he's a big Bordeaux guy #pelicans",
    "339": "After this trade, are the New Orleans Pelicans contenders next season? Talk to me.",
    "340": "The New Orleans Pelicans are finalizing a deal to acquire Portland Trail Blazers guard CJ McCollum for a package around Josh Hart and draft compensation.",
    "341": "And btw. Dame and Josh Hart back court?! Lmao. Simons better step it up RT @ShamsCharania: The New Orleans Pelicans are finalizing a deal to acquire Portland Trail Blazers guard CJ McCollum for a package around Josh Hart and draft compensation, sources tell @TheAthletic @Stadium.",
    "342": "The New Orleans Pelicans are finalizing a deal to acquire Portland Trail Blazers guard CJ McCollum for a package around Josh Hart. #Pels #Blazers",
    "343": "The New Orleans Midrange Pelicans 🔥",
    "344": "CJ McCollum has been traded to the New Orleans Pelicans for a package of Josh Hart, draft compensation, and cap savings.\n\n#RipCity https://t.co/yV5oBA7cJr",
    "345": "BREAKING: CJ McCollum traded to New Orleans Pelicans 😳 https://t.co/yre6HVyOgV",
    "346": "The New Orleans Pelicans are acquiring guard CJ McCollum in a trade package that sends Josh Hart and draft compensation to the Blazers, sources tell @ShamsCharania. https://t.co/dkjduGJduQ",
    "347": "CJ McCollum Traded to ⁦@PelicansNBA⁩ : New Orleans is finalizing a deal to acquire ⁦@trailblazers⁩ guard in exchange for Josh Hart, draft compensation #NBA #NBATrade #Pelicans #Blazers #McCollum #JoshHart",
    "348": "Shams Charania (@ShamsCharania) Tweeted:\nThe New Orleans Pelicans are finalizing a deal to acquire Portland Trail Blazers guard CJ McCollum for a package around Josh Hart and draft compensation, sources tell @TheAthletic @Stadium. https://t.co/Nl0iXW3XCg",
    "349": "OUUUU THE NEW ORLEANS PELICANS GETTING NASTYYYY ALL THEY NEED NOW IS A BIG",
    "350": "CJ on the pelicans is actually a really good trade for New Orleans",
    "351": "A good situation? The New Orleans Pelicans? https://t.co/C1iu42ZilY",
    "352": "🚨🚨🚨BREAKING TRADE🚨🚨🚨\n\nBREAKING: The Blazers and Pelicans are finalizing a deal that will send C.J. McCollum to New Orleans. \n\nJosh Hart and draft compensation goes to Portland.\n\nHere we go. 🔥\n\n-AJHEAT February 08, 2022 at 03:26PM https://t.co/XuFnkYbVPr https://t.co/q4RAE5RhB9",
    "353": "🇺🇸 Pelicans are about to land CJ McCollum with Josh Hart and a package of picks headed to Portland, per multiple reports \n\n🇮🇹 New Orleans sta per prendere CJ McCollum da Portland per Josh Hart e una serie di scelte al Draft \n\n#NBA75",
    "354": "The New Orleans #Pelicans are finalizing a deal to acquire Portland Trail #Blazers guard CJ McCollum for a package around Josh Hart and draft compensation - per @ShamsCharania 🔥🔥 https://t.co/S6HyUyICyC",
    "355": "@brianvsthebooks 🚨 TRADE: The Blazers are trading G CJ McCollum to the New Orleans Pelicans in exchange for Josh Hart and draft compensation, per @ShamsCharania",
    "356": "BREAKING: CJ McCollum is being traded to the New Orleans Pelicans for Josh Hart and draft compensation, per our @ShamsCharania. https://t.co/dBDruFFSlr",
    "357": "New Orleans Pelicans really got CJ Lordd 👀",
    "358": "@ShamsCharania “A good situation” mf is getting sent to New Orleans Pelicans,there’s nothing good about that 😂",
    "359": "🚨 TRADE: The Blazers are trading G CJ McCollum to the New Orleans Pelicans in exchange for Josh Hart and draft compensation, per @ShamsCharania https://t.co/OrSIiz84l4",
    "360": "The New Orleans “Good Situation” Pelicans https://t.co/WTRpiybObJ",
    "361": "@ShamsCharania Pelicans doing anything to make sure Zion stays in New Orleans",
    "362": "@BleacherReport @ShamsCharania Pelicans doing anything to make sure Zion stays in New Orleans",
    "363": "BREAKING: The New Orleans #Pelicans are finalizing the acquisition of CJ McCollum for a trade package centered on Josh Hart and draft compensation per the Athletic from the Portland Trail Blazers. David Griffin fires big. #NBA https://t.co/pWep4SM0c8",
    "364": "@wojespn New Orleans Pelicans finessed the Portland Trail Blazers. Dame Lillard wants to leave the Blazers now",
    "365": "New Orleans Pelicans are finalizing a deal to acquire Portland Trail Blazers guard CJ McCollum for a package around Josh Hart and draft compensation. \n\n#WBD #RipCity #NBATwitter \n\n(@ShamsCharania)",
    "366": "Thank you for your time in New Orleans. Pelicans fans are loyal and we will always be rooting for you! @joshhart",
    "367": "Houston Rockets vs  New Orleans Pelicans Prediction 2/8/22 -  Free NBA P... https://t.co/HmnlnJQGEK via @YouTube \n\n#NBA #NBAPick #NBAPrediction #Basketball #Rockets #Pelicans",
    "368": "BREAKING: The Pelicans and Trail Blazers are close on a deal which would send CJ McCollum to New Orleans. Josh Hart and draft picks are reportedly going to Portland in the deal, per @wojespn and @ShamsCharania",
    "369": "@TheHoopCentral @ShamsCharania Pelicans doing anything to make sure Zion stays in New Orleans",
    "370": "The New Orleans Pelicans are finalizing a deal to acquire Portland Trailblazer guard, CJ McCollum. Package thought to include Josh Hart and draft compensation.",
    "371": "BREAKING:\n\nCJ McCollum ai New Orleans Pelicans.\nI dettagli della trade tra poco. https://t.co/r7Y6r73t2H",
    "372": "@WashedLouis @ShamsCharania @TheAthletic @Stadium The New Orleans Pelicans are finalizing a deal to acquire Portland Trail Blazers guard CJ McCollum for a package around Josh Hart and draft compensation, sources tell @TheAthletic @Stadium.",
    "373": "@ShamsCharania @TheAthletic @Stadium New Orleans Pelicans finessed the Portland Trail Blazers. Dame Lillard wants to leave the Blazers now",
    "374": "@ShamsCharania @TheAthletic @Stadium The New Orleans Pelicans are finalizing a deal to acquire Portland MID guard MID for a package around MID and draft compensation, sources tell @MID @MID.",
    "375": "The New Orleans Pelicans are finalizing a deal to acquire Portland Trail Blazers guard CJ McCollum for a package around Josh Hart and draft compensation, \n#NBATradedeadline \nTHIS IS GREAT LET GET DAME!!! #Sixers",
    "376": "CJ McCollum is traded to the New Orleans Pelicans.\n\nWow.\n\n#NBA75 #NBAAllStar #NBATwitter",
    "377": "@ShamsCharania @TheAthletic @Stadium The New Orleans Pelicans are finalizing a deal to acquire Mid for a package around Mid and draft compensation, sources tell",
    "378": "The New Orleans Pelicans are finalizing a deal to acquire Portland Trail Blazers guard CJ McCollum for a package around Josh Hart and draft compensation @TheAthletic",
    "379": "@New_Tape_City The New Orleans Pelicans are finalizing a deal to acquire Portland Trail Blazers guard CJ McCollum for a package around Josh Hart and draft compensation, sources tell @TheAthletic @Stadium.",
    "380": "The New Orleans Pelicans have acquired Portland Trailblazers guard CJ McCollum, per @ShamsCharania",
    "381": "Portland Trail Blazers and New Orleans Pelicans are in serious discussions on a trade centered on guard CJ McCollum, sources tell ESPN. Talks are ongoing today. \n\nPer @wojespn https://t.co/JezLEOytYX",
    "382": "#Sources — he New Orleans Pelicans are finalizing a deal to acquire Portland Trail Blazers guard CJ McCollum for a package around Josh Hart and draft compensation. #NBA",
    "383": "@ShamsCharania @TheAthletic @Stadium People may not remember, the entire Play In Tournament gimmick was created for the Pelicans, and more importantly, Zion, to get into the Playoffs. They have failed to get in both seasons it existed, so New Orleans is obligated by NBA to get in.",
    "384": "The New Orleans Pelicans are finalizing a deal to acquire Portland Trail Blazers guard CJ McCollum for a package around Josh Hart and draft compensation, sources tell @TheAthletic @Stadium.",
    "385": "@ColeyMick The Portland Trail Blazers and New Orleans Pelicans are in serious discussions on a trade centered on guard CJ McCollum, sources tell ESPN. Talks are ongoing today.",
    "386": "DasHaus made a bet!\n\nEvent: Houston Rockets vs New Orleans Pelicans #NBA\nBet: New Orleans Pelicans TO WIN -8.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "387": "The 21-32 New Orleans Pelicans are understandably trying capture some of the brilliance that has made the Portland Trail Blazers go 21-33",
    "388": "DasHaus made a bet!\n\nEvent: Houston Rockets vs New Orleans Pelicans #NBA\nBet: Houston Rockets TO WIN +8.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "389": "The New Orleans #Pelicans and Portland Trail Blazers are in serious trade talks surrounding G CJ McCollum. Pelicans are the favorite in the clubhouse to land the veteran guard if he is dealt. Reportedly the deal does not include Zion Williamson, Brandon Ingram, Jonas Valanciunas, https://t.co/rrD8FgzBgm",
    "390": "Portland Trail Blazers and New Orleans Pelicans are in serious discussions on a trade centered on guard CJ McCollum\n\nPer @wojespn \n\n#RipCity https://t.co/sOFcuvzlmR",
    "391": "@wojespn W for the pelicans, what do y'all think New Orleans is sending",
    "392": "@KnicksFanTv Adrian Wojnarowski\n@wojespn\n·\n1m\nThe Portland Trail Blazers and New Orleans Pelicans are in serious discussions on a trade centered on guard CJ McCollum, sources tell ESPN. Talks are ongoing today.",
    "393": "It’s that season. RT @wojespn: The Portland Trail Blazers and New Orleans Pelicans are in serious discussions on a trade centered on guard CJ McCollum, sources tell ESPN. Talks are ongoing today.",
    "394": "#Sources — The Portland Trail Blazers and New Orleans Pelicans are in serious discussions on a trade centered on guard CJ McCollum. #NBA",
    "395": "The Portland Trail Blazers and New Orleans Pelicans are in serious discussions on a trade centered on guard CJ McCollum, sources tell ESPN. Talks are ongoing today.",
    "396": "Who's your #Pelicans Player of the Week for #NBA Week 16 and why? New Orleans games were at Cle, at Det, at Den, at Hou, winning the last three. All statistics below were team highs for the week. #PelsPOTWPoll open until pregame begins at 6:30 on @BallySportsNO and @ESPNRadioNOLA",
    "397": "Who's your #Pelicans Player of the Week for #NBA Week 16 and why? New Orleans games were at Cle, at Det, at Den, at Hou, winning the last three. All statistics below were team highs for the week. #PelsPOTWPoll open until pregame begins at 6:30 on @BallySportsNO and @ESPNRadioNOLA",
    "398": "Consensus Line Move:\n2022-02-08 Houston Rockets at New Orleans Pelicans from -8.50 to -9.50\n#WBD track it\n#NBA #bettingadvice #coder #millionaire",
    "399": "Given its name, BetRivers should actually punch well above its weight in New Orleans &amp; Louisiana. $RSI seems to have identified this also.\n\n#WBD | #Pelicans | $KAMBI\n\nhttps://t.co/YiyKqWRqhI",
    "400": "NBA Basketball Game Betting Picks Simulator: 8:10 PM ET - Houston Rockets vs. New Orleans Pelicans - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/tCVjf39odh #nba #sportsbetting #freepicks #cappertek",
    "401": "BetRivers has announced it is an official sports betting partner of the New Orleans Pelicans. BetRivers signage appears throughout the Smoothie King Center and the former Chairman's Club has been rebranded as teh BetRivers Chairman Lounge.",
    "402": "$ALSN Volvo’s Heavy-Duty VNL Day Cab Trucks Now Available with Allison’s Award Winning 3414 Regional Haul Series™ Transmission\n\n $RSI: RUSH STREET INTERACTIVE'S BETRIVERS SPORTSBOOK IS THE OFFICIAL PARTNER OF THE NBA'S NEW ORLEANS PELICANS",
    "403": "Rush Street's BetRivers Sportsbook is official partner of New Orleans Pelicans\n$RSI",
    "404": "$RSI RUSH STREET INTERACTIVE'S BETRIVERS SPORTSBOOK IS THE OFFICIAL PARTNER OF THE NBA'S NEW ORLEANS PELICANS\nhttps://t.co/QrzUXiroyS",
    "405": "$RSI RUSH STREET INTERACTIVE'S BETRIVERS SPORTSBOOK IS THE OFFICIAL PARTNER OF THE NBA'S NEW ORLEANS PELICANS\nhttps://t.co/W9YsNn2EHL",
    "406": "RUSH STREET INTERACTIVE'S BETRIVERS SPORTSBOOK IS THE OFFICIAL PARTNER OF THE NBA'S NEW ORLEANS PELICANS https://t.co/26ma4OY4tv",
    "407": "$RSI RUSH STREET INTERACTIVE'S BETRIVERS SPORTSBOOK IS THE OFFICIAL PARTNER OF THE NBA'S NEW ORLEANS PELICANS\n \nhttps://t.co/ZzEZ7flsv5",
    "408": "Garrison Mathews with a block vs the New Orleans Pelicans\nhttps://t.co/mNUFrWh083\nhttps://t.co/mNUFrWh083",
    "409": "Josh Christopher with a 2-pointer vs the New Orleans Pelicans\nhttps://t.co/6W8O31rmLj\nhttps://t.co/6W8O31rmLj",
    "410": "New Orleans Pelicans vs Houston Rockets - Full Game Highlights | February 6, 2022 NBA Season\nhttps://t.co/Vpv1SnckZP\nhttps://t.co/Vpv1SnckZP",
    "411": "The New Orleans Pelicans are almost in the same situation with Zion as a former Knick. The Knicks were at odds with KP in 2019. So any day now Zion you can march into the office and make some demands before the deadline.",
    "412": "NBA 09/02/22\n\n07:00 Philadelphia 76ers*Over-216.5\n08:00 New Orleans Pelicans*Over-226.5 \n08:00 Memphis Grizzlies*Over-228",
    "413": "NBA Lottery prospect @BennMathurin of @ArizonaMBB goes for 18 points last night in the blow out win vs. ASU\n\nThe 6’5 Montreal product has been a scoring machine, only 3 games not in double digits.\n\n@NBAdraftRoom has Mathurin currently being drafted #8 to the New Orleans Pelicans. https://t.co/DWXyqqoA69",
    "414": "Houston Rockets vs. New Orleans Pelicans game preview\n\nPhoto by Carmen Mandato/Getty Images\n\nIt does appear that Eric Gordon has played his last game for the Houston Rockets.\n\nOut with heel soreness on Sunday night, the Rockets will likely hold out the m… https://t.co/cp5ZE8NrYh",
    "415": "🚨 Line Change 🚨\n\nHouston Rockets @ New Orleans Pelicans\nTue 8:10 PM EST\n\nFrom:\nNO -7.0 -110\n\nTo:\nNO -8.5 -110",
    "416": "🏀 Today's free pick HOU @ NOP New Orleans Pelicans 1st Half Points Over 58.5\n\nFind more about it on telegram channel: https://t.co/Su9BEO9CKS\n\n#bets #bettingtips #bettingtipster #nbabets #tipster #FreePicks #GamblingTwitter",
    "417": "NBA Basketball Game Betting Picks Simulator: 8:00 PM ET - Houston Rockets vs. New Orleans Pelicans - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/tCVjf39odh #nba #sportsbetting #freepicks #cappertek",
    "418": "ALERT: New high roller bet posted!\nA bet has been placed for $8570.82 on New Orleans Pelicans - Houston Rockets to win $15,856.02.\nTo view this bet or copy it https://t.co/hRoVpaktff https://t.co/t8Dhidy04i",
    "419": "New Orleans Pelicans - Houston Rockets\n\nBet slip link: https://t.co/sksXPwAaQ8 https://t.co/88dIaFgyrl",
    "420": "🏀#NBA ‼️\n1.Philadelphia 76ers Vs Phoenix Suns\n2.Atlanta Hawks Vs Indiana Pacers\n3.Brooklyn Nets Vs Boston Celtics\n4.Memphis Grizzlies Vs Los Angeles Clippers\n5. New Orleans Pelicans Vs Houston Rockets ...\n-------\n⭐️Free #livescore &amp; #livestream 👉https://t.co/z8cdc9BY9Y 😉 https://t.co/GX5POs68gY",
    "421": "Houston Rockets vs. New Orleans Pelicans game preview, in which Eric Gordon might get booed one last time by fans of his former team (but will probably sit this one out). https://t.co/j6v57e29DP",
    "422": "Houston Rockets vs. New Orleans Pelicans game preview, in which Eric Gordon might get booed one last time by fans of his former team (but will probably sit this one out) https://t.co/lJcvEYOeFn",
    "423": "NBA Trade season has started: Are the New Orleans Pelicans being left out?\n\nhttps://t.co/WeNJD9gXPI https://t.co/qGSYCtzgmR",
    "424": "@BobbyMarks42 @NateDuncanNBA  is this even legal? as \"\"The 2022 first-round pick from the Lakers only transfer to the Pelicans if it were Top 10. Otherwise it would go to the Memphis Grizzlies. It’s unclear what the back-up plan would be should New Orleans not receive the pick.\" https://t.co/paec6eQzkJ",
    "425": "Philadelphia 76ers - Phoenix Suns\nNew Orleans Pelicans - Houston Rockets\nDenver Nuggets - New York Knicks\nSacramento Kings - Minnesota Timberwolves\nLos Angeles Lakers - Milwaukee Bucks\n\nBet slip link: https://t.co/gEo2fok2Bz https://t.co/pLgkgJJKTb",
    "426": "2023-24 will be the final season for the New Orleans Pelicans.\n\n2024-25 will be the first season of the new Seattle Supersonics.\n\nTake it to the bank.",
    "427": "New Orleans Pelicans Looking At Trading Players For the ‘Right Upgrade’ https://t.co/sxQbxJVw5F",
    "428": "Local sports media in New Orleans are wretched covering the @PelicansNBA and just as bad with the @Saints. They may as well be their public relations wings. Trash.",
    "429": "\"...the current Pelicans. Where is this fear that without C.J. McCollum would fall out of the play-in.\"\n\n\"I think the answer is fairly clear. The people in New Orleans would like to remain employed and the more games they win the more likely they remain employed.\"",
    "430": "So, now I'm listening to @ZachLowe_NBA and @TimBontemps talk.\n\n\"Can you explain to me, the C.J. McCollum, New Orleans Pelicans rumors.... They're in the play-in.... What is this fear, and by the way Zion is supposedly coming back at some point to bolster...\"",
    "431": "@DocStewie57 @UMGRIZZLIES Brandon Ingram Former college star and Lakers forward currently with the New Orleans Pelicans is having another successful season producing in a tough league Covid-19 or not Doc!",
    "432": "@PelsNationCP Breaking news : 76ers star ben just traded to the new Orleans pelicans for Brandon ingram and a 1st round pick, per Awoj.",
    "433": "New Orleans Pelicans have a defensive rating of 110.4 (14th) since this tweet:\n\nRespect https://t.co/g3Gey7w7UL",
    "434": "The Heat have two days off before making their final stop of their road trip in the Big Easy against the New Orleans Pelicans. Game starts Thursday at 7:30pm on NBA League Pass and Bally Sports Sun.",
    "435": "@FIizop Which one? The Atlanta Hawks or The New Orleans Pelicans?",
    "436": "@CardPurchaser New Orleans Pelicans/New England Patriots"
}