{
    "0": "🔴Portland Trail Blazers Vs San Antonio Spurs | Live Play-By-Play &amp; React... https://t.co/gETEOYa0nP via @YouTube \n#TheAJShow #PORvsSA #SAvsPOR #trailblazers #nba #portland #portlandtrailblazers #damianlillard #basketball #blazers #ripcity #dametime #lillard #nbaplayoffs #dame",
    "1": "Portland Trail Blazers Vs. San Antonio Spurs | at 08:30 PM\n🔴 Please Watch Live Here 👉 https://t.co/AhnZAk35Ni\nVENUE: AT&amp;T Center (San Antonio) =&gt; Please LIKE and SHARE !! https://t.co/OLGrm2PSqo",
    "2": "San Antonio Spurs starting 5 https://t.co/KwJ62WRCZF",
    "3": "San Antonio Spurs (-15) vs. Portland Trail Blazers! #RipCity #PorVida #NBA #NBATwitter #NBA75",
    "4": "San Antonio Spurs Starters:\n\nTre Jones\nJoshua Primo\nDevin Vassell\nKeldon Johnson\nJakob Poeltl\n\nPlayers out:\nRomeo Langford\nDoug McDermott\nDejounte Murray\n#PorVida #NBA #NBATwitter #NBA75",
    "5": "@rosshenryhair Lets go my 2nd team clippers beat bucks lets get wins. My 3rd team san Antonio spurs beat Portland lets get wins.",
    "6": "Tonight's starting lineup for the San Antonio Spurs: Jones, Primo, Vassell, Johnson, Poeltl\nhttps://t.co/bVWH4AMCA2",
    "7": "It’s time for Basketball: San Antonio Spurs vs Portland Trail Blazers https://t.co/zGOQlpUGto https://t.co/EnMj6ldGV6",
    "8": "Uniforms for Portland Trailblazers vs San Antonio Spurs at 5:30 PM. \n\n#RipCity #PorVida https://t.co/W3u7rdkrRu",
    "9": "Thank you James Allen: I know my basketball because I played with David Roberson retired veteran of the San Antonio Spurs and a Veteran of the United States Navy and I am a Veteran of the United States Marine Corps around 1981-1987",
    "10": "🏀 The lowly Trail Blazers head to San Antonio to face the Spurs in which @SkeeProfit provides some prop betting analysis and trends on #WagerTalkToday. See his insights on this game as Portland has lost nine of their past ten games.\n\n#sportsbetting\n\n➡️ https://t.co/rcVpq4yiBh https://t.co/mkubGuMRww",
    "11": "NBA Basketball Game Betting Picks Simulator: 8:30 PM ET - Portland Trail Blazers vs. San Antonio Spurs - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/yDpwvZe0JT #nba #sportsbetting #freepicks #cappertek",
    "12": "@rosshenryhair Lets get wins clippers my 2nd team beat bucks tonight. My 3rd team san Antonio spurs beat Portland tonight lets get wins lets go clippers spurs get wins lets go!!!!!!!!!#",
    "13": "@johnvarlas San Antonio Spurs started that when Duncan, Ginobili and Parker days and now it’s gotten out of hand. Those guys actually needed load management they were at end of their careers. The Grizzlies second youngest team in NBA resting guys I don’t get it.",
    "14": "Today's NBA Picks: 8:30 PM ET - Portland Trail Blazers vs. San Antonio Spurs - 22 PICKS AVAILABLE: https://t.co/glcXaQ4gFN #nba",
    "15": "San Antonio Spurs: A look at the Spurs’ struggles in high-leverage possessions https://t.co/MKl1uR9zOx",
    "16": "San Antonio's Keldon Johnson developing as Spurs' 3-point specialist https://t.co/ZsY72NDw7S",
    "17": "San Antonio's Keldon Johnson developing as Spurs' 3-point specialist https://t.co/unbVSzbZ7C",
    "18": "San Antonio Spurs First Reaction to Dejounte Murray's Bobblehead\nhttps://t.co/2s01cK4Ajn",
    "19": "🏀 GAME ANALYSIS 🏀\n\n🏟 Portland Trail Blazers vs San Antonio Spurs 🏟\n\n▶️ BET THE NBA ▶️ https://t.co/odroCYfQFJ\n\n#NBA #GamblingTwitter \n\nhttps://t.co/Xfl10PY3TR",
    "20": "Portland Trail Blazers vs San Antonio Spurs 4/1/2022 Picks Predictions Previews\n\nhttps://t.co/cUHfQVYGOu\n\n#NBAbetting #NBAbettingpicks #NBApicks #freepicks #NBAprediction #NBAparlay #odds #picks #basketballpicks #sportspicks #handicapper #expertpicks #TrailBlazers #Spurs https://t.co/ZEpZSv2zIU",
    "21": "San Antonio Spurs: #Spurs, Blazers make desperate last push for playoffs | National Post https://t.co/KOGeNrTWSL",
    "22": "NBA Rumors: Proposed Lakers-Spurs Trade Sends Russell Westbrook To San Antonio For Three Players – Lakers News https://t.co/JH3FOwKYV0",
    "23": "I recently spoke w/ Lonnie Walker about how much HOF'er Manu Ginobili has helped him 👇👇👇👇\n\n'Manu has really helped me' | Spurs' Lonnie Walker IV overjoyed he's learning from Manu Ginobili https://t.co/qAZmhAtfsJ #nba75 #porvida #nbatwitter #SanAntonio",
    "24": "@XavierLoredo @TrevorWrites @tom_orsborn @JMcDonald_SAEN Well if you’re in San Antonio, the Spurs are blacked out on NBA TV, anyway.",
    "25": "San Antonio Spurs: NBA Rumors: Proposed Lakers-Spurs Trade Sends Russell Westbrook To San Antonio For Three Players https://t.co/sb1Ek7E0fD",
    "26": "San Antonio Spurs players play favorites when it comes to draft prospects https://t.co/AKg0cXKYYY",
    "27": "San Antonio Spurs players play favorites when it comes to draft prospects https://t.co/kB6VhRhiYv",
    "28": "NBA Rumors: Proposed Lakers-Spurs Trade Sends Russell Westbrook To San Antonio For Three Players\nhttps://t.co/QLDxnMrWnS",
    "29": "San Antonio Spurs: Trail Blazers Game Notes: Portland Trail Blazers (27-49) vs. San Antonio #Spurs (31-45) - https://t.co/bEJw1O5trm https://t.co/EnetvDBFBE",
    "30": "San Antonio Spurs legend Manu Ginobili heads to NBA Hall of Fame https://t.co/7VHfOgAzNT",
    "31": "San Antonio Spurs player ARRESTED ? Who is it? What you need to know. https://t.co/Q8AkUPUg9l",
    "32": "What's #Best on https://t.co/DVTf2jd2ZR ?\nHighlights: Lonnie Walker's 6 Pts 3 Ast Vs. Memphis : 2021-22 San Antonio Spurs Season\nhttps://t.co/ej2mcG598o\n#sports https://t.co/kKZfq0toWB",
    "33": "#Best of the day on https://t.co/MqmlMsmdvk\nHighlights: Lonnie Walker's 6 Pts 3 Ast Vs. Memphis : 2021-22 San Antonio Spurs Season\nhttps://t.co/rMmjsz1Q9B\n#sports",
    "34": "What's #Best on https://t.co/VfZu3jgOen ?\nHighlights: Lonnie Walker's 6 Pts 3 Ast Vs. Memphis : 2021-22 San Antonio Spurs Season\nhttps://t.co/XPq8sJXKEC\n#sports",
    "35": "@EDemirNBA @Square__Jordan @ram_dub @geola388 @JamesPiercey11 @NBATradeGuy @bola_ao_ar @corbannba @tankathon @HoopsNerd_ With the 42nd pick in the 2022 NBA Draft, the San Antonio Spurs selects Orlando Robinson. Robinson is a 7'0 centre who has the skills and IQ to create plays for himself within the paint and has a very high amount of offensive knowledge for a big man. I see his upside as Vucevic. https://t.co/BZx22onob4",
    "36": "Portland Trail Blazers at San Antonio Spurs: Game preview, time, TV channel, how to watch free live stream online https://t.co/dzDUaaHWmQ",
    "37": "It has been a pretty profitable week for our NBA player prop bets. But one of our misses came on backing San Antonio Spurs guard Dejounte Murray to record a triple-double against the Houston Rockets back on March 28th. \n\nLet’s back Murray one more time to get that triple-double. https://t.co/9f9wxIYO3F",
    "38": "Kobe Bryant vs the San Antonio Spurs in the clutch (2002 WCSF)\n\nKobe Bryant:\n▸ 21 points | 66.7% FG (8/12)\n\nSpurs:\n▸ 17 points | 24% FG (6/25) https://t.co/fld62iGECh",
    "39": "@MaddySkye @FiestaSA @spurs @ANightInOldSA Perfect country &amp; western song must have:\n- mama\n- trains\n- trucks\n- prison\n- getting drunk\n\nPerfect San Antonio tweet must have:\n- @spurs\n- @FiestaSA \n- @ANightInOldSA\n- #GoSpursGo",
    "40": "RT @SpursGive: Wishing the best of luck to the San Antonio ParaSport Spurs as they compete in the 2022 @NWBA Tournament this weekend! 👏🔥\n\n#GoSpursGo #FlashbackFriday https://t.co/krXdCSh4uj #actnearn #sct",
    "41": "@Blainer93 i was so sure we were gonna win g7 too\n\nlmfao i was at the travis show the night houston got eliminated from the playoffs by kawhi-less spurs and the entire crowd chanted san antonio spurs as travis came two hours late after being courtside",
    "42": "💰NBA Free Bet💰\n\n🚀 San Antonio Spurs -13.5",
    "43": "The four-time NBA champion will be joined by former Spurs player and coach George Karl, according to reports. #SanAntonio #SATX #SanAntonio #Spurs #NBA #HallOfFame #manuginobili\n\nhttps://t.co/N4j595ttFY",
    "44": "BOUNCE BACK FOR THE FREEBIE GANG !!!!!!\n\nUNDER 230.5 SAN ANTONIO SPURS /// 1 UNIT \n\nLETS GET LOTS OF BRICKS TODAY SNOOZE FEST LOL 😆 \n\nLETS GO CASH GANG MAKE SOME NOISE AND PASS ON THE ENERGY @PicksCity\n\n#GamblingTwitter #FreePlays #freeplay #FREE #FreePick #TeamPicksCity #MONEY https://t.co/TPAHcsJsjG",
    "45": "San Antonio Spurs: Blazers Can Guarantee a 2022 NBA Lottery Pick with a Loss Tonight https://t.co/EjrolBcvBB",
    "46": "Seeing everyone downtown with Spurs stuff on, sometimes with brooms, was my favorite San Antonio mood. The energy was unmatched. 🥲 https://t.co/g9yVTbmbN1",
    "47": "SAS\nSan Antonio Spurs or Stephen A Smith",
    "48": "Wishing the best of luck to the San Antonio ParaSport Spurs as they compete in the 2022 @NWBA Tournament this weekend! 👏🔥\n\n#GoSpursGo #FlashbackFriday https://t.co/croY8QLf5V",
    "49": "@PositivityMuse the san antonio spurs",
    "50": "#Portland Trail Blazers: Spending the weekend in San Antonio. \n\n ##RipCity   vs @spurs \n  ... \n \nhttps://t.co/f8FwS0UMVq\n \n#Basketball #NationalBasketballAssociation #NBA #NBAWesternConference #NBAWesternConferenceNorthwestDivision #Oregon #PortlandTrailBlazers #TrailBlazers https://t.co/jN1HahPsts",
    "51": "The Shootaround – 4/1/2022 \nCarolina Teague joins R&amp;R in the Morning to preview Spurs vs Blazers as San Antonio is back in the 10th spot in the West @carolinateague_ @RobThompsonESPN @RudyJay_star @IamPledger \nhttps://t.co/8t3qspm5wD",
    "52": "I recently spoke w/ Lonnie Walker about how much HOF'er Manu Ginobili has helped him 👇👇👇👇\n\n'Manu has really helped me' | Spurs' Lonnie Walker IV overjoyed he's learning from Manu Ginobili https://t.co/qAZmhAKQRj #nba75 #porvida #nbatwitter #SanAntonio",
    "53": "@Dawson63406656 @LilJaMorant @PositivityMuse How many playoff series/championships did the san antonio spurs win before 99",
    "54": "After an illustrious career with the San Antonio Spurs that included four NBA championships, Manu Ginobili will reportedly join his legendary peers in the Naismith Memorial Basketball Hall of Fame. https://t.co/IsMWW0wQ1K",
    "55": "On this episode of Locked On Spurs, host Jeff Garcia welcomes San Antonio Sports Star's Jack Thompson to preview the Spurs-Blazers game as well as take a look at some college prospects the Spurs should target in the NBA Draft.  https://t.co/bEivJBK6e7",
    "56": "@report_court @cparkernba @TheCrossover0 @NBATradeGuy @tankathon @PauloAlvesNBA @Itamar_17_10 @codyreeves14 @NiMoTX @OffTheBallPod @the_NBAgell 4. San Antonio - Jabari Smith Jr\n\nThe Spurs are set at the guard spot but they really lack a shot making forward like Jabari. I don’t think Jabari is a #1 scorer who you ask to run a team which is why I like him on a team that’s already pretty good and has pieces in place. https://t.co/Ys9kJuXPR2",
    "57": "money_talks65 CKeeley1021 WildIndian5 Trevor_Lane Magic Johnson tried to complete a trade for San Antonio Spurs… https://t.co/c5rLE5WWCi",
    "58": "Absolutely well deserved. The one team I'm still an actual fan of are the Spurs and this dude meant so much to the city of San Antonio and that franchise https://t.co/itN4ezhtOg",
    "59": "San Antonio FC Sales Representative - San Antonio Spurs (San Antonio · TX) https://t.co/1wQgItQRW1",
    "60": "Spurs: How to Watch Portland Trail Blazers vs. San Antonio #Spurs Game Live Online on April 1, 2022 https://t.co/F6XTLARq6P",
    "61": "Can’t wait to head back home to San Antonio in a few hours for a weekend with the family and a Spurs game!",
    "62": "Spurs fans remember Manu Ginobili's Hall of Fame-worthy moments in San Antonio https://t.co/ovDvCLYK3V",
    "63": "¡HOY JUEGAN LOS BLAZERS (27-49)!\n\n🆚 San Antonio Spurs (31-45)\n⌚️ 21:30 Argentina / 01:30 España / 17:30 Portland\n🏟️ AT&amp;T Center, San Antonio, Texas\n🚑 Dame Lillard, Ant Simons, Josh Hart, Nassir Little, Jusuf Nurkic, Trendon Watford, Joe Ingles, Eric Bledsoe OUT\n📺 League Pass https://t.co/KgPh4tmxMF",
    "64": "San Antonio Spurs: Spurs fans emotional over Manu Ginobili's Hall of Fame news https://t.co/dyxEjLhcea",
    "65": "out, plus they traded away McCollum, Powell and Covington.  The San Antonio Spurs are battling with the Los Angeles Lakers for the final playoff spot in the Western Conference.  They have come up clutch down the stretch in going 4-1 SU &amp; 4-1 ATS in their last five games overall.",
    "66": "Friday's Free Pick: San Antonio Spurs -14.5\n\nThe Portland Trail Blazers are openly tanking.  They are 2-15 SU &amp; 5-12 ATS in their last 17 games overall with eight losses by 30 points or more and 11 losses by 14 points or more.  They have nine players on the injury report that are",
    "67": "Magic number: 6\n\nAny combination of six Spurs wins and Lakers losses will clinch the 10 seed for San Antonio. https://t.co/GaIAT8q6WX",
    "68": "Spurs fans remember Manu Ginobili's Hall of Fame-worthy moments in San Antonio https://t.co/ihOAq8WOuH",
    "69": "Fansided gave me an opportunity back in 2015 to cover the San Antonio Spurs with Air Alamo and I've never looked back. Thank you @FanSided @AirAlamo @AllUCanHeat1 @HiddenRemote and @HoopsHabit for allowing me to craft my writing skills and have a voice in sports and entertainment https://t.co/WQgkqrlWRG",
    "70": "SQUIRES BASKETBALL EST 1987. Pictured in Lime/White shirt: San Antonio Spurs current player Keldon Johnson!! ALWAYS HAS BEEN FULL OF CONFIDENCE!! #aau #nbabasketball https://t.co/MEkuZ6Rxzg",
    "71": "Spurs: How to Watch Portland Trail Blazers vs. San Antonio #Spurs Game Live Online on April 1, 2022 https://t.co/AiM1vW1vBk",
    "72": "San Antonio #Spurs vs Portland Trail Blazers - Preview, Tips and Odds - Sportingpedia https://t.co/grBASVC5uG",
    "73": "San Antonio Spurs: Hall of Fame Reportedly Makes Decision On Manu Ginobili - The Spun https://t.co/KOGeNrTWSL",
    "74": "San Antonio Spurs are seeking a Talent Academy Coordinator - more details here! https://t.co/7MCIlRby3s",
    "75": "From The Historic Squires Basketball Archives Est 1987! Lime/White shirt: Keldon Johnson of the San Antonio Spurs! https://t.co/49HgglyRxp",
    "76": "Spurs:  How to Watch Portland Trail Blazers vs. San Antonio #Spurs Game Live Online on April 1, 2022 https://t.co/Qf0onNieI9",
    "77": "San Antonio Spurs: Blazers vs. #Spurs: Start time, where to watch, what's the latest - Yahoo! Sports https://t.co/EnetvDk4K6",
    "78": "OTD in 2006: ⏱\n\nI imagine no chill Gil wasn’t chill after a 106-99 loss to the San Antonio Spurs.\n\nThe Spurs were led by Tony Parker who razzled and dazzled his way to:\n28p, 6r, 6a 🪄\n\nThe Wizards were led by Gilbert Arenas who had:\n31p, 8a, 2s 😤\n\nA PG battle for the ages 🔥 https://t.co/17BBOsefjH",
    "79": "Portland Trail Blazers vs  San Antonio Spurs Prediction 4/1/22 -  Free N... https://t.co/PqJyRvalV5 via @YouTube",
    "80": "@SamuelMurdvee @B_Fernandes8 San Antonio Spurs. I like DeRozan!",
    "81": "The New Orleans Pelicans should bench Andrew Wiggins against the San Antonio Spurs #WBD #GoSpursGo",
    "82": "The San Antonio Spurs sees trophies everyday. Because of Timothy Duncan https://t.co/yURmsCjtQJ",
    "83": "🎙️🎙️🎙️ Predicting the San Antonio Spurs' record in their final six regular-season games\n\nYouTube: https://t.co/NDyitiFPpU\nApple https://t.co/oGOT9n4XJQ\n. @KENS5 link: https://t.co/Yady92jeKz\nSpotify https://t.co/85HsgGqPm8 #nba75  #porvida",
    "84": "San Antonio #Spurs vs Portland #Trailblazers | 4/1/22  | Free NBA Pick and Prediction | Free NBA Betting Tips \n\nWatch: https://t.co/k4IDCSKVth\n\n#NBA #NBAPick #NBAPredictions #spursvstrailblazers",
    "85": "In the most recent meeting, the Spurs built a 43 point lead.\n\nThat was in Portland. Tonight the game is in San Antonio. https://t.co/HFBWx8koHB",
    "86": "Game Preview: San Antonio Spurs vs Portland Trail Blazers https://t.co/5p3JjLokpy",
    "87": "Game Preview: San Antonio Spurs vs. Portland Trail Blazers https://t.co/Ogy9AaA085",
    "88": "San Antonio Spurs: Remembering the time Manu Ginobili caught a live bat during a game https://t.co/MFsaCLGP3W",
    "89": "Portland Trail Blazers at San Antonio #Spurs - 4/1/22 NBA Picks and Prediction - PickDawgz https://t.co/12yGqDRl26",
    "90": "³³\n\nStephen Curry celebrating after Andrew Wiggins converted both free throws in loss to San Antonio Spurs. https://t.co/PH58jiSege",
    "91": "How to Watch Portland Trail #Blazers vs. San Antonio #Spurs Game Live Online on April 1, 2022: Streaming/TV... https://t.co/3XSUzaYN8B",
    "92": "welcome to the San Antonio Spurs https://t.co/9VcLgcdiVx",
    "93": "Today's NBA Picks: 8:30 PM ET - Portland Trail Blazers vs. San Antonio Spurs - 1 PICK AVAILABLE: https://t.co/glcXaQ4gFN #nba",
    "94": "6.Houston Rockets Vs Sacramento Kings\n7.Memphis Grizzlies Vs Phoenix Suns\n8.San Antonio Spurs Vs Portland Trail Blazers\n9.Denver Nuggets Vs Minnesota Timberwolves\n10.Los Angeles Lakers Vs New Orleans Pelicans https://t.co/n2EdOClQ4o",
    "95": "San Antonio Spurs icon Manu Ginobili will be a first-ballot induction into the Naismith Memorial Basketball Hall of Fame…",
    "96": "San Antonio Spurs: What we learned from the #Spurs loss to the Grizzlies - Pounding The Rock https://t.co/KOGeNrTWSL",
    "97": "NBA Basketball Game Betting Picks Simulator: 8:30 PM ET - Portland Trail Blazers vs. San Antonio Spurs - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/yDpwvZe0JT #nba #sportsbetting #freepicks #cappertek",
    "98": "“Mastery requires patience. The San Antonio Spurs, one of the most successful teams in NBA history, have a quote from social reformer Jacob Riis hanging in their locker room: “When nothing seems to help, I go and look at a stonecutter hammering away at his rock,",
    "99": "San Antonio Spurs: Western Conference Standings: #Spurs narrowly lose to Grizzlies, #Lakers move back into ... https://t.co/EnetvDBFBE",
    "100": "San Antonio Spurs icon Manu Ginobili is set to be unducted into the Naismith Memorial Basketball Hall of Fame as part of the Class of 2022, according to Shams Charania of The Athletic. #ManuGinobili \nhttps://t.co/PaBBqvoN7u",
    "101": "￼Buy Cheap San Antonio Spurs NBA Tickets Online with Promo Code for Lower-Level Seats, Mid Court Seats, and Club Seats https://t.co/8TZdC2ervC #cheapsanantoniospurstickets #spursbasketballticketsonline",
    "102": "Golden State Warriors coach Steve Kerr ejected against the Memphis Grizzlies, Los Angeles Lakers play-off hopes take huge hit, San Antonio Spurs beat Houston Rockets, wrap, all scores, results https://t.co/C7hguox3tE",
    "103": "Trail Blazers Game Notes: Portland Trail Blazers (27-49) vs. San Antonio Spurs (31-45) https://t.co/Ixals3H51l https://t.co/DqEu87qWXu",
    "104": "How to Watch Portland Trail Blazers vs. San Antonio #Spurs: Live Stream, TV Channel, Start Time https://t.co/chqTGzYn12",
    "105": "Easy 💰💰💰💰💰💰💰💰\nLast time these teams met a few weeks back in San Antonio, @spurs BLEW THEM OUT by over 40 pts and have been ON FIRE lately!  This game will ABSOLUTELY be a repeat BLOWOUT as the Blazers have ALL their players OUT again \n#GamblingTwitter #nba #easyMoney https://t.co/uOF5Qnhm8F",
    "106": "@brad_altman That definitely emboldened my confidence. Plus it’s in San Antonio and the Spurs are even more motivated? My confidence borders on arrogance about this blowout.",
    "107": "San Antonio Spurs: Trail Blazers Game Notes: Portland Trail Blazers (27-49) vs. San Antonio Spurs:  (31-45) https://t.co/uxxjtib6za",
    "108": "The Lakers' lose and fall behind the Spurs in the standings.\n\n6 games left for both teams, and the Lakers must win more games than San Antonio to make the play-in.\nhttps://t.co/bszv2PwnnR",
    "109": "The Blazers (4-6 ATS last ten) are +14.5 underdogs is San Antonio tomorrow against the Spurs (5-5 ATS last ten), per @DKSportsbook.\n\nWhat do you think the outcome of the game will be?\n\n#PWEBets",
    "110": "Spurs: Trail Blazers Game Notes: Portland Trail Blazers (27-49) vs. San Antonio #Spurs (31-45) - https://t.co/PBzBvF2Ojy https://t.co/F6XTLARq6P",
    "111": "The San Antonio Spurs are currently in the play in https://t.co/L6IryxFYFy https://t.co/tulRNg8tid",
    "112": "The San Antonio Spurs regain the 10th seed and a Play In spot.",
    "113": "San Antonio Spurs cheering now for Utah Jazz.",
    "114": "Trail Blazers Game Notes: Portland Trail Blazers (27-49) vs. San Antonio Spurs (31-45)\n\n#JalenFam\nhttps://t.co/SyxTIj6ma4",
    "115": "San Antonio #Spurs: Happy first day of @fiestasa! \n\n##VivaFiesta | ##PorVida... \n \nhttps://t.co/qAzk5FR81U\n \n#Basketball #NationalBasketballAssociation #NBA #NBAWesternConference #NBAWesternConferenceSouthwestDivision #SanAntonio #SanAntonioSpurs #Texas https://t.co/bMXiHr4Il5",
    "116": "@IrishCoachIvey I wish him nothing but the best.\nI know that he will be a star in the NBA. \nI pray that he plays for either the Miami Heat or San Antonio Spurs.\nTo great NBA Franchises that will further develop his skills.\n\nGood luck!!!",
    "117": "[Charania] San Antonio #Spurs icon Manu Ginobili will be a first-ballot induction into the Naismith Memorial Basketball Hall of Fame Class of 2022, sources tell The Athletic . 🏀\nhttps://t.co/bJzzV7p7tF",
    "118": "🏀 March 31, 2014: Tony Parker scores 22, and the West's best San Antonio Spurs beat the East's best Pacers, 103-77, for an 18th straight win. \n📋 Box score: https://t.co/Z4jNa14awd https://t.co/ZZ2jjopt02",
    "119": "🏀 March 31, 2014: Tony Parker scores 22, and the West's best San Antonio Spurs beat the East's best Pacers, 103-77, for an 18th straight win. #GoSpursGo\n📋 Box score: https://t.co/rCbfC23BDT https://t.co/3okmCbAQYv",
    "120": "Spurs: #Spurs' Dejounte Murray shooting long balls with 'confidence' - San Antonio Express-News https://t.co/AiM1vW1vBk",
    "121": "San Antonio Spurs: Grizzlies edge #Spurs 112-111, clinch No. 2 seed in West | Star Tribune https://t.co/KOGeNrTWSL",
    "122": "Birmingham Squadron NBA affiliate New Orleans Pelicans now playing the San Antonio Spurs on NBA TV channel.",
    "123": "Check out this listing I just added to my #Poshmark closet: 2007 San Antonio Spurs NBA Champions strapback hat. https://t.co/0tuy2Znpmo #shopmycloset @poshmarkapp",
    "124": "NBA Basketball Game Betting Picks Simulator: 4/1/2022 8:30 PM ET - Portland Trail Blazers vs. San Antonio Spurs - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/yDpwvZe0JT #nba #sportsbetting #freepicks #cappertek",
    "125": "5 time champion with the San Antonio Spurs https://t.co/Jdzy0QwPgt",
    "126": "Congratulations George.  I’m very happy you were part of the Spurs and San Antonio! Well deserved! https://t.co/wIfIgltHPs",
    "127": "Check out how Game tempo and Pick &amp; Roll Offense Clinic Notes from the San Antonio Spurs Assistant Coach | Basketball Coaching Clinic Notes\nhttps://t.co/3a3id48H2y",
    "128": "Spurs:  Former San Antonio #Spurs basketball star Tony… | HoopsHype https://t.co/Qf0onNzhK9",
    "129": "San Antonio Spurs: Grizzlies edge #Spurs 112-111, clinch No. 2 seed in West | Star Tribune https://t.co/EnetvDBFBE",
    "130": "San Antonio Spurs: Manu Ginobili Set To Become First-Ballot Hall of Famer https://t.co/doVw0CGtcR",
    "131": "https://t.co/IAtiGZi1JA\nSan Antonio #Spurs vs. Portland Trail #Blazers #NBA #Betting Tips and Best Bets\n#2021 #2022 #basketball #betting #BettingPicks #BettingTips #blazers #Clippers ... https://t.co/zYt4l9AKA9",
    "132": "@WhitneyCummings In San Antonio, lay off our Spurs, and our Riverwalk, and you'll be fine.  See you Sunday.",
    "133": "San Antonio Spurs: Manu Ginobili Reportedly Headlines 2022 Basketball Hall Of Fame Class https://t.co/9qZ3Pb3k4D",
    "134": "@ClutchPointsApp @TheTyJager @Stadium Gotta list it all ...\n\n4× NBA champion (2003, 2005, 2007, 2014\n\n2× NBA All-Star (2005, 2011)\n\n2× All-NBA Third Team (2008, 2011)\n\nNBA Sixth Man of the Year (2008)\n\nNBA All-Rookie Second Team (2003)\n\nArgentina's No. 5 retired by the CABB[1]\n\nNo. 20 retired by San Antonio Spurs\n...",
    "135": "🎙️🎙️🎙️ Predicting the San Antonio Spurs' record in their final six regular-season games w/ guest @twoshotspodcast \n\n. @KENS5 link: https://t.co/Yady921DlZ\nYouTube: https://t.co/NDyitioe1k\nApple https://t.co/oGOT9mNmlg\nSpotify https://t.co/85HsgGIqdG #nba75  #porvida https://t.co/jYQHH6F3i7"
}