{
    "0": "#LetsGoNets last game of the regular season! Let's go into the play in with a Win! @BrooklynNets #BrooklynNetsLife 💯💪🏾🏀",
    "1": "This is great for Brooklyn! No excuses for the Nets if they don't win a title this year. https://t.co/2OQiviRCL9",
    "2": "@MJTorres1230 @sdotcurry @BrooklynNets @YESNetwork @KDTrey5 @Keith_McPherson It is 🔥🔥🔥🔥",
    "3": "Ben Simmons likely to make his Brooklyn Nets debut in the first round of the playoffs, we wonnnnnnnn.",
    "4": "@chase19136 @TheNBACentral @BrooklynNets @AhnFireDigital Simmons is a better fit for us than harden was. I could care less what happens to Philly now cause all their fans do is lie to themselves all season and then play the blame game.",
    "5": "@BrooklynNets I knew KD would get literally get all of Kai’s brand hoodies lmao",
    "6": "@stephenasmith WHAT medication are YOU on thinking the Brooklyn Nets are going ANYWHERE especially with Benny Simmons still sitting out claiming he hurt!!??  ALL I know is the Nets cant stop ANYBODY and you know it!!  Keep dreaming because thats all it is just a DREAM ahahahahaha",
    "7": "BREAKING: Ben Simmons could make his Brooklyn Nets debut during the first round of the playoffs 👀\n\n(via Shams Charania) https://t.co/mZTpO0MUkC",
    "8": "the Brooklyn nets organization rly counting on a rusty ben simmons to preform for the first time this season in the playoffs 💀 changed my mind nobody won that damn trade. not this year",
    "9": "@Keith_McPherson @sdotcurry @BrooklynNets @YESNetwork @KDTrey5 Love to see this. They better resign this man.",
    "10": "Haven’t been to an NBA game since Covid. Decided to call up former Cardozo great Royal Ivey now a Brooklyn Nets assistant coach and here I am! https://t.co/a8QE6odv4M",
    "11": "@Ben4DPOY @KawhiIight @TheNBACentral @BrooklynNets @AhnFireDigital I'm pretty sure i have a video just like that on my timeline somewhere. Nobody denies the crazy talent, but he's scared of big moments and disappears when you need him in the playoffs.",
    "12": "@BrooklynNets @KesslerEdwards @blakegriffin23 Please play Blake!",
    "13": "BREAKING: Ben Simmons could make his Brooklyn Nets debut in round 1 of the playoffs.",
    "14": "@MJTorres1230 @sdotcurry @BrooklynNets @YESNetwork @KDTrey5 @Keith_McPherson It’s a @kith hoodie",
    "15": "And on the final day of the regular season, @BorgataAC takes a $100,000 play on Brooklyn to win the Eastern Conference at +340 ... If they win today, the Nets will be the 7-seed and host a play-in game. They're laying 16.5 to Indiana today.",
    "16": "@ShamsCharania focus on making it out the Play-In Tournament first bozo’s🤣🤣🤣 @BrooklynNets",
    "17": "The Brooklyn Nets are not a serious organization https://t.co/xoyViro9Ap",
    "18": "@TheWarriorsTalk @OnBallSteph embarrassing the nets in brooklyn",
    "19": "@heyhalima @kevkage_ I honestly doubt that inserting a version of Simmons who hasn't played in a year (with his current team or otherwise) into the Nets' starting lineup, in the first round of the playoffs - where he will immediately be subjected to the hack-a-Ben again - will be helpful for Brooklyn",
    "20": "@ashwnkok @Geiveer @TheNotoriousJH1 @BrooklynNets Thinking the Nets aren’t making 1st round = delusional",
    "21": "Bout to catch this @BrooklynNets game playoffs start this week it’s litt",
    "22": "Last Day Of Regular Season for my @BrooklynNets today",
    "23": "@BrooklynNets @BruceBrown11 @KDTrey5 My dream",
    "24": "Coming up on @yesnetwork @themichaelgrady @sgkustok Ian Eagle @brooklynnets @barclayscenter Regular season ends today. Playoff bound. Go Nets 🖤🤍 💎 🏀 @ Barclays Center https://t.co/Kamq2YGvUA",
    "25": "Is there any chance that the @Pacers can beat the @BrooklynNets and help the Cavs (and potentially themselves) out? Anything is possible, but the Nets should easily lock up the #7 seed and a home play-in game. Best bets and #NBAProps picks here: https://t.co/uD2a1XFcop",
    "26": "@BrooklynNets Love this team 🤩",
    "27": "Brooklyn #Nets’ Ben Simmons has been ramping up his conditioning and restrengthening program for his back and legs and if this progresses at the current pace, Simmons could debut for the team during the first round of the playoffs per the Athletic. #NBA https://t.co/cZg8lmdaXL",
    "28": "@TheNBACentral @BrooklynNets @AhnFireDigital Man this ain’t a good clip. He’s rattling both those in. It’s like they don’t even want to go in themselves",
    "29": "@BrooklynNets @BruceBrown11 @KDTrey5 Steve nash is a coach of the year cap artist",
    "30": "@yankeesgoddess @sdotcurry @BrooklynNets @YESNetwork @KDTrey5 @Keith_McPherson That’s def the one 🙏🏽🙏🏽🙏🏽",
    "31": "@BrooklynNets @BruceBrown11 @KDTrey5 W players",
    "32": "Spending time with #NetsWorld https://t.co/zpD854uP9e",
    "33": "@TheNBACentral @BrooklynNets @AhnFireDigital A Ben Wallace",
    "34": "After a season marked by highs and lows, game 82 is finally here for the #Nets. A win today clinches the 7 seed for Brooklyn, sealing a home play-in game. \n\nThey match up against Indiana at 3:30, losers of their last 9 games. Seth Curry ruled OUT (ankle soreness).\n\n@wfuvsports https://t.co/EOLsATZBYZ",
    "35": "@BrooklynNets No need for Curry to not rest his ankle for the pacers",
    "36": "@TheNBACentral @BrooklynNets @AhnFireDigital No way",
    "37": "Indiana Pacers vs. Brooklyn Nets 3:30 on ESPN (If Brooklyn wins today, they'll clinch the 7 seed in the East. If they lose &amp; Cleveland beats Milwaukee, the Cavs will get the 7 seed &amp; Brooklyn falls to the 8 seed) https://t.co/3TX6W0udMJ",
    "38": "@NetsHive @BrooklynNets No Ross got one more year at 11.5 million he fits the tpe he can shoot and play defense and got bounce and 6’6",
    "39": "Brooklyn Nets - Indiana Pacers\n\nBet slip link: https://t.co/A8xkXbRiMV https://t.co/HzjlOX0gPB",
    "40": "ALERT: New high roller bet posted!\nA bet has been placed for $10,495.66 on Brooklyn Nets - Indiana Pacers to win $11,020.44.\nTo view this bet or copy it https://t.co/41IymSx3SG https://t.co/NDbOWCj6s2",
    "41": "Indiana Pacers (+17) @ Brooklyn Nets #NetsWorld #GoldBlooded #NBA #NBATwitter #NBA75",
    "42": "Got my hands on the Brooklyn nets Warren Lotas collab",
    "43": "@stephenasmith just to be clear the Brooklyn Nets may have enough talent to go to the finals but they're MORE likely to lose in the first round....... they can't stop ANYBODY on defense and that's a FACT Jack",
    "44": "The @Bucks sitting @Giannis_An34 to try and avoid the 2 seed because they want no part of @BrooklynNets is the softest $#!t I’ve ever seen.",
    "45": "@MarkGre84321817 @BrooklynNets Don’t think he’ll do it today. It’s afternoon in the US right? So he hasn’t eaten",
    "46": "Some people will clown Milwaukee for ducking Brooklyn.  I’m not gonna do that.  Or say that last year’s title is still fraudulent. Or say that a fully healthy Nets team beats Milwaukee in five both last year and this year.  I’m not gonna say any of it.  Just gonna see it play out",
    "47": "@NetsHive @BrooklynNets Okay who do you want and no it’s being reported 5 to 10 million for monk we have the mle but who do you want Ross is another wing he 6’6 and will make 11.5mill that fits into the tpe",
    "48": "@BrooklynNets Im intrigued",
    "49": "@Therealjay__y @BrooklynNets Roco will stay with the clippers I think, Monk will likely get a bag somewhere, Derrick Jones Jr probably stays with Chicago I reckon",
    "50": "@NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital About what Simmons hiding in the corner on offense or is it being a horrible free throw shooter or or is it just being an all around horrible human being.  Harden is far from perfect but he has made this team better.",
    "51": "@BrooklynNets Play ben",
    "52": "@TheNBACentral @BrooklynNets @AhnFireDigital We been seeing clips like this for the last 5 years, Nets fans really think he boutta be doing this during games? Lmaooo delusional",
    "53": "@BrooklynNets I like the rookie in this spot",
    "54": "@MJTorres1230 @sdotcurry @BrooklynNets @YESNetwork @KDTrey5 @Keith_McPherson I hope that's it! Sure does look like it. You're welcome 😊",
    "55": "@JergoatWest @BrooklynNets Nobody cares",
    "56": "@BrooklynNets @JfromBk WE MADE IT!",
    "57": "Next @BrooklynNets retired number? 25 B.Melchionni, 32 @JuliusErving, 23 John Williamson, 3 Drazen Petrovic, 52 Buck Williams, 5 @RealJasonKidd. My Choice - 24 @Rjeff24",
    "58": "@NetsHive @BrooklynNets Bet  I see a lot of people down on melo cause of defense but he definitely can shoot but Covington monk Derrick Jones jr are Also some other wings",
    "59": "@BrooklynNets lock in for i tweak out",
    "60": "@BrooklynNets Time for Kyrie to step it up. Get that lid off the rim.",
    "61": "@BrooklynNets Why is Blake not getting minutes?",
    "62": "@BrooklynNets Had him om my bet builders and cant cash em out, nice man",
    "63": "@BrooklynNets w lineup",
    "64": "@BrooklynNets beat bucks in 4 🐐🐐🐐🐐",
    "65": "damn..here we go again - Ye @BrooklynNets https://t.co/val9WVOdwZ",
    "66": "@Geiveer @TheNotoriousJH1 @BrooklynNets at least theyre making the first round",
    "67": "@BrooklynNets let’s go get da 7th seed !!! ✊🏽🙌🏽",
    "68": "@BrooklynNets None of them would survive in a tough defensive era like the 1960s",
    "69": "@BrooklynNets Yesssssirrrrrrr Kessler Ewards the rookie from Pepperdine",
    "70": "What’s the one positive I’m taking away from this season (and I’m hoping for a lot more games)? Nets fandom has evolved and proven itself. Multiple sellout and record crowds, the Brooklyn Brigade giving team competitive advantage (home AND away.) And an esprit de corps! Finally!",
    "71": "@BrooklynNets Find minutes for Cam, Blake, &amp; Duke today.",
    "72": "@BrooklynNets That’s fine, time for Kyrie to step it up. Get that lid off the rim.",
    "73": "@BrooklynNets Looking for Ben’s number",
    "74": "@BrooklynNets NASSSSHHHH IS DOING RIGHT YESSSSSSSSSSS",
    "75": "@yankeesgoddess @sdotcurry @BrooklynNets @YESNetwork @KDTrey5 @Keith_McPherson You found it!!!!! 🤩🤩🤩 Thank you!",
    "76": "Today's starting lineup for the Brooklyn Nets: Irving, Edwards, Brown, Durant, Drummond \nhttps://t.co/bVWH4AMCA2",
    "77": "@BrooklynNets Nash finally learned patty cannot start ever",
    "78": "Personally I hope we win tonight. The @Bucks would make short work of the @BrooklynNets …. That is if Brooklyn even wins the first game of the play in which they very well might not",
    "79": "Brooklyn Nets Starters:\n\nKyrie Irving\nPatty Mills\nBruce Brown\nKevin Durant\nAndre Drummond\n\nPlayers out:\nSeth Curry\nGoran Dragic\nBen Simmons\n#NetsWorld #NBA #NBATwitter #NBA75",
    "80": "@BrooklynNets That’s pretty good",
    "81": "One last dance in the regular season from Kevin Durant and the Brooklyn Nets",
    "82": "@BrooklynNets GOTTA FINISH STRONG BOIS",
    "83": "@BrooklynNets no curry 🙃",
    "84": "@TheNBACentral @BrooklynNets @AhnFireDigital Traveled",
    "85": "@BrooklynNets Curry?",
    "86": "@BrooklynNets We lookin good",
    "87": "Brooklyn Nets Starting Lineup 4/10\n PG: Kyrie Irving\n SG: Kessler Edwards\n SF: Bruce Brown\n PF: Kevin Durant\n C: Andre Drummond\nhttps://t.co/o75oZ8vnE8",
    "88": "🚨 Line Change 🚨\n\nIndiana Pacers @ Brooklyn Nets\nSun 3:40 PM EST\n\nFrom:\nBKN -16.0 -110\n\nTo:\nBKN -17.0 -110",
    "89": "👍 or 👎  \n\nWill the @BrooklynNets make it out of the play-in tournament? https://t.co/mWXpNeU6E5",
    "90": "@BrooklynNets YESSSSS. KESSSSS EXPRESS",
    "91": "@BrooklynNets Please do everything you can to sweep bucks first round",
    "92": "@BrooklynNets Perfect",
    "93": "@BrooklynNets EDWARDSSSSS!!!",
    "94": "@BrooklynNets W no patty",
    "95": "@BrooklynNets Let’s finish strong",
    "96": "@BrooklynNets Easy W",
    "97": "First 🖐️ https://t.co/wcaUx3Wrqx",
    "98": "Consensus Line Move:\n2022-04-10 Indiana Pacers at Brooklyn Nets from -16.00 to -17.00\n#NetsWorld here we go\n#NBA #bettingonline #innovation #investing",
    "99": "Uniforms for Indiana Pacers vs Brooklyn Nets at 12:30 PM on ESPN. \n\n#GoldBlooded #NetsWorld https://t.co/93Qz4bVyVy",
    "100": "@Philknowsball7 @BrooklynNets @KDTrey5 @Patty_Mills @daviddukejr I think that means if the Hornets wins, they would have the 8th seed, Nets the 9th",
    "101": "@adam_thebowery @BrooklynNets Hahaha phew 😅",
    "102": "@ChelseaFC0708 @BrooklynNets Errrr just recorded a video for jumbotron with some really fit cheerleaders this worries me slightly! \n👀 😅😂😂😂",
    "103": "But just played last game . @BrooklynNets y’all so full of shit ! https://t.co/8amdKrfK9B",
    "104": "Brooklyn Nets guard Seth Curry (left ankle) is out vs. the Pacers (3:30 PM ET, ESPN), sources tell ESPN.",
    "105": "@BrooklynNets @qatarairways @BruceBrown11 FAX TWINN! 😭",
    "106": "@BrooklynNets lets clinch the 7th seed right no messing around",
    "107": "@BrooklynNets Keep the guy healthy come playoff",
    "108": "Pacers (+16) visit Nets Today 🏀\n\nIn the final day of The NBA regular season the Nets &amp; Pacers face off in Brooklyn \n\nIf the Nets win they clinch the 7 seed &amp; home court advantage in their play in game #NetsWorld #GoldBlooded \n\nFind All NBA Odds Here ⬇️\nhttps://t.co/LMjKLA7b2J https://t.co/O7JCu7ZJ7H",
    "109": "@BrooklynNets @KDTrey5 @Patty_Mills @daviddukejr @bansky that you in the back?😂 https://t.co/1T9aDE04ZJ",
    "110": "@umfadoblake Gigante o Brooklyn Nets",
    "111": "@BrooklynNets Good rest him for cavs",
    "112": "@BrooklynNetcast Enjoy these videos @BrooklynNets that’s all you’ll get. Won’t ever pull that in a game bahahaha",
    "113": "@RoitmanAdam @BrooklynNets Congrats my boi",
    "114": "One bettor in New Jersey believes in the Brooklyn Nets.\n\nBig wager just came in at @BorgataSports:\n\n$100,000 on Nets to win the Eastern Conference at +340 odds",
    "115": "@BrooklynNets Crying",
    "116": "Since Game 2 of the Eastern Conference semi-finals, the Milwaukee #Bucks are 6-2 against the Brooklyn #Nets.\n\nI feel like people have wondered about that.",
    "117": "@The_U93 I'll never accept the Brooklyn Nets being seen as a successor to the New Jersey Nets.  Dr. J has nothing to do with Brooklyn whatsoever",
    "118": "@flatbushfinest3 @HardenFinalsMVP @TheNBACentral @BrooklynNets @AhnFireDigital Harden is playing, something Simmons hasnt done in almost a year now",
    "119": "https://t.co/3ydddZvpkU.......... Anthem for KD and the Brooklyn Nets",
    "120": "@NBABrasil @ESPNBrasil @BrooklynNets Craque",
    "121": "VAI  BROOKLYN NETS !!! https://t.co/jnsgVYDFf9",
    "122": "@Gemma_Manns @BrooklynNets Awesome.  Enjoy!!🤘",
    "123": "Hey @BrooklynNets enjoy these gym videos.  You guys are getting cat fished, just a heads up. https://t.co/lOHrRelOcK",
    "124": "@BrooklynNets Go! Go! Brooklyn Nets!💯🔥 \n\n#NetsWorld",
    "125": "@Mxstre @JimOwczarski @Bucks @BrooklynNets But we BARELY beat them last time we played. It was OT. That’s nerve wracking",
    "126": "@wilborn_lane47 @PsAndQss @ValtGang @wojespn Bucks and grizzlies resting starters today so Celtics would probably be the 2 seed and rn Brooklyn is 7 so they would play in playoffs. A Nets loss drops them potentially to 9 which means they mathematically couldnt be the 7 seed and therefore cant play Celtics in playoffs",
    "127": "@TheNBACentral @BrooklynNets @AhnFireDigital He forgot to dribble.  You can’t just run and shoot 🤦🏽‍♂️",
    "128": "One last spotting event of the day. Let's go @BrooklynNets https://t.co/vAEmXDACcI",
    "129": "@Gemma_Manns @BrooklynNets A team we can actually be on the same side for! Haha",
    "130": "@NETSCHIPSZN2022 @BlackMoses32 @AyoItsKMO @TheNBACentral @BrooklynNets @AhnFireDigital Hack a Ben incoming. Getting excited about workout vids. I remember doin that",
    "131": "Nets vs Pacers- HOW is Brooklyn going to lose this game? Pacers are tanking. Brooklyn NEEDS the insurance of a 7/8 seed. \n\nRockets vs Hawks- Hawks will feast on the worst team in the NBA. \n\nCavs vs Bucks- Giannis sitting. Advantage Cavs\n\n#Hornets looking at a likely 10 seed.",
    "132": "@BrooklynNets I’m stressed… but rest him.",
    "133": "@TheNBACentral @BrooklynNets @AhnFireDigital Walk",
    "134": "🏀NBA🏀\nCleveland Cavaliers vs Milwaukee Bucks\n\nIn the last game, Cleveland lost to the Brooklyn Nets 118-107. Cleveland has lost 3 games in a row.📉\n\nMilwaukee finished the season in 2nd place in the Eastern Conference. Milwaukee won 3 games in a row.🔥 https://t.co/3a8RCaqgqY",
    "135": "@BrooklynNets Love you guys forever❤\nNets for life💯",
    "136": "Andy Vermaut shares:Nets sign Kessler Edwards to standard NBA contract before playoffs: The Brooklyn Nets signed Kessler Edwards to a standard NBA contract Sunday, making him… https://t.co/AkOgFEb4mL Thank you. #ThankYouJournalistsForTheNewsWeGetFromYou #AndyVermautThanksYou https://t.co/Dt4H5IaRzQ",
    "137": "@dcwriter360 @JimOwczarski @Bucks @BrooklynNets Both, I truly believe that the bucks could take out the nets much easier than last year, they have no defense and their offense consists of 2 great players (KD and Kyrie) and 1 shooter (Seth curry), those 3 can't beat the bucks with how they've been playing.",
    "138": "@BrooklynNets nice",
    "139": "@BrooklynNets give @NetsRepublic media credentials next szn pls https://t.co/Y1LeBP7PrQ",
    "140": "@nets_dolphins @ESPNNBA Funny if you think Brooklyn is making it to the Finals",
    "141": "@BrooklynNets Cant to be 🥺",
    "142": "@GucciLightyear @AnthonyDittmar_ @sixers @memgrizz @cavs @BrooklynNets We need Memphis to lose....",
    "143": "@NETSCHIPSZN2022 @BlackMoses32 @TheNBACentral @BrooklynNets @AhnFireDigital Standing.",
    "144": "@BrooklynNets Doesn’t need to play at all glad he resting",
    "145": "@BrooklynNets @AndreDrummond @BruceBrown11 @JetBlue Love this guys",
    "146": "Update to the Status Report for today’s game vs. Indiana:\n\nCurry (left ankle soreness) - OUT",
    "147": "@Mxstre @JimOwczarski @Bucks @BrooklynNets I understand that but would you rather watch the @Bucks play the @BrooklynNets again for some sort of symbolic rematch and to prove a point? Or would you rather see the @Bucks in another championship?",
    "148": "@BrooklynNets @AndreDrummond @BruceBrown11 @JetBlue Niceeeeeeeeeeeeeee!!!!!!!!!!!",
    "149": "Brooklyn Nets guard Seth Curry (left ankle) is out vs. the Pacers (3:30 PM ET, ESPN), sources tell ESPN.",
    "150": "@dcwriter360 @JimOwczarski @Bucks @BrooklynNets The thing is that I'd love to watch a bucks nets series again 😂",
    "151": "@ChrisDenari @Pacers @NBA @BrooklynNets @BallySportsIN Thanks for bringing your enthusiasm and professionalism every game, even in a season like this one.",
    "152": "@Mxstre @JimOwczarski I don't think either approach is wrong. That is, @Bucks could adopt a \"championship mentality\" and say \"bring it on,\" or they could be strategic and recognize @BrooklynNets not only have a vendetta against us but the artillery to carry it out. Neither way is surefire.",
    "153": "Heat ⏩ 4\nCeltics ⏩ 6\nBucks ⏩ 5\nSixers ⏩ 6\n\nBtw can’t wait for sweet revenge when we face Lyrie Lirving and the lame ass Brooklyn Nets. https://t.co/9Amfw9XGCy",
    "154": "Teams in the East today tryna duck the Brooklyn Nets https://t.co/aT8dUptF7t",
    "155": "@BovadaOfficial games are about to start and no player props for Brooklyn Nets are up. are they coming soon ?",
    "156": "#Nets guard Ben Simmons putting shots up pregame ahead of the final regular season matchup vs. the Pacers. He still hasn't been cleared to return, but seeing him on the court is encouraging for Brooklyn. https://t.co/MdFfJyGKMM",
    "157": "@RomeovilleKid @BrooklynNets @barclayscenter It can't end soon enough. #goldblooded",
    "158": "Okay Brooklyn Nets over to you",
    "159": "Go Big or go home 😅… \nGoooooo Nets 😬🤷🏼‍♀️\n@BrooklynNets #NBA #BrooklynNets \nGet me to the ball game 🏀 ⛹🏾‍♂️😝 https://t.co/3MQabZo0Rt",
    "160": "@KimJonesSports @WFAN660 @MarcMalusis @BrooklynNets When you listen to your air check make a point to note how many times you repeat phrases … a crutch and as annoying when someone says “you know” a million times in an interview",
    "161": "@celticsgal2 Just because we'd rather play the bulls instead of the Nets it doesnt mean we're avoiding them, you lose tonight and we're playing brooklyn so the celtics can choose they re path unlike us",
    "162": "@chis_back @ManuelManny0 @BrooklynNets @HSpecialSurgery If He’s Out , Hopefully One Of The Role Players Step Up !",
    "163": "@BrooklynNets @AndreDrummond @BruceBrown11 @JetBlue Two very important pieces in the playoffs",
    "164": "Olha, com as notícias recentes, acho que teremos a seguinte ordem final no Leste:\n\n1. Miami Heat\n2. Boston Celtics\n3. Milwaukee Bucks\n4. Philadelphia 76ers\n5. Toronto Raptors\n6. Chicago Bulls\n7. Brooklyn Nets \n8. Cleveland Cavaliers\n9. Atlanta Hawks\n10. Charlotte Hornets",
    "165": "Brooklyn Nets Ben Simmons pregame Workout via @Krisplashed #NetsWorld https://t.co/6ul1vJEYD3",
    "166": "@BrooklynNets @KDTrey5 @Patty_Mills @daviddukejr Get a W stay consistent. Let's Go KD DROP 50 MAN 💧👍🏿",
    "167": "@MJTorres1230 @sdotcurry @BrooklynNets @YESNetwork @KDTrey5 @Keith_McPherson Didnt see yesterday's responses im embarrassed 🤣🤣🤣. Moral of story so fire im gettin",
    "168": "@BrooklynNets @KDTrey5 @Patty_Mills @daviddukejr None of those players would survive in the 1960s",
    "169": "@KeithSmithNBA Ideal path for what the 2nd seed &amp; the Brooklyn Nets? I think not. They’re not trying to do that. Neither is Milwaukee. They’re already starting to maneuver and call in sick to secure the 3rd seed to avoid Brooklyn. It’s a big difference between playing Bklyn or playing Chicago.",
    "170": "The Nets would need Kyrie and KD to score 60-70+ points every game in a series against the Celtics which isnt as easy as it seems w/ Cs defense. It's going to be hard for Brooklyn to win without home court advantage. Celtics have been juggernauts in the 2nd half of the season. ☘️",
    "171": "@BrooklynNets @KDTrey5 @Patty_Mills @daviddukejr Look at Kd wearing Kyrie’s brand love to see it",
    "172": "@BrooklynNets @KDTrey5 @Patty_Mills @daviddukejr Yessir big fan of KD",
    "173": "@BrooklynNets @KDTrey5 @Patty_Mills @daviddukejr plz win",
    "174": "Final fits of the regular season 💧 https://t.co/g2gB3Ok2MH",
    "175": "@MJTorres1230 @sdotcurry @BrooklynNets @YESNetwork @KDTrey5 @Keith_McPherson Chenille**",
    "176": "@MJTorres1230 @sdotcurry @BrooklynNets @YESNetwork @KDTrey5 @Keith_McPherson Kith chanell collection pimp. So fire i need too",
    "177": "@BrooklynNets Let's Seth rest today. Let him rest up for the playoffs",
    "178": "@ByJayKing Let the nets take out MKE then have a home series with Rob against Brooklyn",
    "179": "@BrooklynNets @HSpecialSurgery Let Seth have a rest day. Rest him rest up for the playoffs",
    "180": "@BrooklynNets @AndreDrummond @BruceBrown11 @JetBlue Extend both of them to a max",
    "181": "@mtplug_grinder The Brooklyn nets probably won’t rest",
    "182": "@TheNBACentral @James_HamNBA Don’t worry the Brooklyn nets will still sign you …",
    "183": "Let’s dance @BrooklynNets https://t.co/Ch44sIVct3",
    "184": "@BrooklynNets Let him rest today",
    "185": "@BrooklynNets We can face off vs the hawks",
    "186": "@KimJonesSports @WFAN660 @MarcMalusis @BrooklynNets First 3 min listening to you and agree with your #Cashman assessment but your voice/cadence is way to annoying …. I’m out",
    "187": "Brooklyn nets fans . https://t.co/XoT8gOdnJ2",
    "188": "The All-Mighty Milwaukee Bucks with the so called \"best player in the league\" is sitting out to duck the Brooklyn Nets in the 1st round this can't be real life 😭",
    "189": "@BrooklynNets Play 🏀",
    "190": "@Ben4DPOY @TheNBACentral @BrooklynNets @AhnFireDigital The problem with Ben is he cannot shoot off the dribble, hence the reason he traveled here to take the shot. His play style demands he dribble the ball but he keeps his dribble so low that there is no smooth transition into a shot for him.",
    "191": "@bladed_01 The choice is clear. They should want to play Brooklyn. The Nets are battling for their lives to beat the Knicks backups.",
    "192": "@BrooklynNets Yes rest him",
    "193": "logiciel ; Brooklyn Nets\n\nAtlanta Hawks\n\nToronto Raptors\n\nCharlotte Hornets\n\nOrlando Magic\n\nDetroit Pistons\n\nOklahoma City Thunder\n\nMinnesota Timberwolves\n\nPhoenix Suns\n\nDenver Nuggets\n\nUtah Jazz\n\nCleveland Cavaliers\n\nBoston Celtics\n\nGolden State Warriors\n\nDallas Mavericks",
    "194": "@BrooklynNets Rest him fot play offs",
    "195": "@BrooklynNets Let him rest",
    "196": "The Brooklyn Nets have downgraded Seth Curry from probable to questionable for this afternoon's game.",
    "197": "@BrooklynNets LET'S GO NETS LES'TGO NETS Win Win Defense y rebound Win game.ok",
    "198": "@BrooklynNets He was limping around last game, give him rest",
    "199": "@BrooklynNets @KesslerEdwards What @BrooklynNets fans should know is that in addition to his basketball talents, @KesslerEdwards is also a good guy from a good family.",
    "200": "@BrooklynNets @KeithSmithNBA @KesslerEdwards Why they got this man on a child’s couch",
    "201": "@yoshithesnake @BklynNetBlock @shoelessjp @BrooklynNets Im sure the sixers had Kyrie Irving and Kevin Durant",
    "202": "Update to the Status Report for today’s game vs. Indiana:\n\nCurry (left ankle soreness) - QUESTIONABLE",
    "203": "Brooklyn Nets player grades: Kevin Durant drops 38 on Trail Blazers https://t.co/it9sLJSqWC",
    "204": "@ShenkKyle @PaulReedWrld @BrooklynNets Ok Jerry.",
    "205": "April 10, 2019: Miami #Heat SG Dwyane Wade recorded a triple-double (25 PTS, 11 REB, 10 AST) during his final career NBA game in a loss to the Brooklyn Nets with close friends LeBron James, Carmelo Anthony, &amp; Chris Paul watchng in the stands https://t.co/wmpR1Teoni",
    "206": "Brooklyn Nets coach Steve Nash on Ben Simmons: “He’s doing a little bit of movement, still 1-on-0 stuff. He’s still got a lot of milestones to reach, but it’s positive.” https://t.co/Bq19FS1IK7",
    "207": "@bracketXNFT According to the #NBA expert in our household:\n@celtics @Suns @BrooklynNets @warriors",
    "208": "Consensus Line Move:\n2022-04-10 Indiana Pacers at Brooklyn Nets from 243.50 to 244.50\nOver adjust quickly\n#NBA #bettingpicks #ml #realtor",
    "209": "Concluding the @NBA regular season today with several games on the board including a top pick between @Pacers and @BrooklynNets in this link: https://t.co/lq8E5f2Hmv",
    "210": "👏 @BrooklynNets launched a state-of-the-art video system that has already been used to deliver all of the action of the team’s last game against the New Orleans Pelicans in 3D VR.\nhttps://t.co/o8A8BefRZm\n@themetapolis #Metaverse #Metapolis $zil @mponnada @sandra_tlibe #DAO #VR https://t.co/l9AtxQxZwI",
    "211": "@MJTorres1230 @sdotcurry @BrooklynNets @YESNetwork @KDTrey5 @Keith_McPherson That is 🔥🔥🔥.  Take my $$$ now lol",
    "212": "Swish Live #2:  NBA Awards, Brooklyn Nets, Lamelo and Lonzo Ball's Future https://t.co/b1KnhZeSny",
    "213": "@MJTorres1230 @sdotcurry @BrooklynNets @YESNetwork @KDTrey5 @Keith_McPherson It's fire\nhttps://t.co/Zy9JBDi206",
    "214": "Shooters MF shoot! More to come so stay close! \n\nHouston 1Q TT ⬆️28.5\n\nMemphis 1Q TT ⬆️27 \n\nOrlando 1Q TT ⬆️26.5\n\nMinnesota 1Q TT ⬆️29 \n\nBrooklyn 1Q TT ⬆️34\n\nPacers/Nets 1H ⬆️124.5 https://t.co/soLzcT0PTT",
    "215": "Watching my friend @GavinHouston on his episode of Rizzoli And Isle’s , while waiting on the @BrooklynNets game ! #Sunday",
    "216": "@TheNBACentral @BrooklynNets @AhnFireDigital @MattFrancis_ bro ben is gonna be a better shooter than steph",
    "217": "@TheScottyMoose @Babchik @BrooklynNets @EvCoRadio @willcolon66 Peep the Ja’Marr Chase poster in the corner! https://t.co/fawmMV4Qmo",
    "218": "Also very excited I got to see my first basketball game @BrooklynNets and first ice hockey game @NYRangers, as well as the @Yankees on their opening day against @RedSox https://t.co/NgrqlKkLPt",
    "219": "NBA Notebook : Brooklyn Nets Lined Notebook Gift Ideas\nhttps://t.co/UQFsTG4PXx",
    "220": "@BrooklynNets Too bad the yall gotta see him in the round https://t.co/lp2mNeEKDL",
    "221": "@MJTorres1230 @sdotcurry @BrooklynNets @YESNetwork @KDTrey5 @Keith_McPherson Someone help this man",
    "222": "@Therealjay__y @BrooklynNets Otto - yes \nMelo - no \nMcLemore - YES(!)\nForbes - undecided",
    "223": "@dtfromnj @sdotcurry @BrooklynNets @YESNetwork @KDTrey5 @Keith_McPherson Sweater/Terry cloth/Hoodie 🤯🤯",
    "224": "@aohughes @PaulReedWrld @BrooklynNets I don't wish he was still here. He'll actually succeed and win in Brooklyn and I'm happy for him. This team is gonna have to rebuild in 2 years once Joel forces his way out. Ben is gonna be great in the Nets fast-paced offense",
    "225": "@MJTorres1230 @sdotcurry @BrooklynNets @YESNetwork @KDTrey5 @Keith_McPherson that looks like a sweater hoodie...\n\ngood luck, it is very nice",
    "226": "@Dloaded07 @BrooklynNets Need to see more a 60 year old man can do that",
    "227": "@ShenkKyle @PaulReedWrld @BrooklynNets I admire your dedication to the bit. You are literally the only person other then Jerry that wishes he was still here, lol.",
    "228": "@anthonykatusa1 @BrooklynNets You will go bro they winning fasho 🙏🏽",
    "229": "▪︎#NBA75 \nRegular season (last games)\n\n@Pacers ⚔ @BrooklynNets\n@WashWizards ⚔ @hornets\n@Bucks ⚔ @cavs\n@ATLHawks ⚔ @HoustonRockets\n@celtics ⚔ @memgrizz\n@DetroitPistons ⚔ @sixers ... https://t.co/9AVU3Jnido",
    "230": "@BrooklynNets Thank you @BrooklynNets !!!! https://t.co/qPv33INhoq",
    "231": "@BrooklynNets Thank you too Guys... Make us dream",
    "232": "@TheNBACentral @BrooklynNets @AhnFireDigital Walk",
    "233": "@aohughes @PaulReedWrld @BrooklynNets He's a black hole on offense, can't shoot over 50%, and is incapable of creating for his teammates. There's no ball movement or flow to the offense. I wish Colangelo was still here bc he understood that. We'll never get past the second round with Joel and I guarantee it",
    "234": "at the traditional brooklyn nets tailgate (brunch)",
    "235": "@rnotch421 @sdotcurry @BrooklynNets @YESNetwork @KDTrey5 @Keith_McPherson Great. I will custom pay someone to make me one…. But where?",
    "236": "Classic @Babchik. Joey Babs killing it with the @BrooklynNets on 2K. Zoom in for score\n\n@EvCoRadio @willcolon66 https://t.co/B0UeRKfaN2",
    "237": "KD said he’s ready to GO OFF! 🏎🔥🏀🍿 @KDTrey5 @BrooklynNets 🗽📊🏆 #NetsWorld https://t.co/tQCHwlJgws",
    "238": "@MJTorres1230 @sdotcurry @BrooklynNets @YESNetwork @KDTrey5 @Keith_McPherson This is 100% custom made",
    "239": "@Rainn_LoverBoy @dou_mcgrady @BrooklynNets Can’t if we lose we’re 10th seed can’t take any chances.",
    "240": "I need to find (and buy) this 🥵🥵🥵 literally been searching since Yes tweeted it Friday. No one is the city had it. 😭😭😭\n\n@sdotcurry @BrooklynNets @YESNetwork @KDTrey5  @Keith_McPherson https://t.co/OXrlx02x6F",
    "241": "Just a reminder, the Brooklyn Nets opponent in the play in tournament are going to be trying to win too.",
    "242": "@ShenkKyle @PaulReedWrld @BrooklynNets Lol, is that you, Jerry? Give you wife back the phone and enjoy your retirement. This MFer really thinks Jo is the problem. Ha!",
    "243": "@hornets My favorite moment this year was on March 27 is when we Beat Brooklyn Nets 119 to 110 &amp; we was underdog Brooklyn was -7 what a amazing game that was",
    "244": "@BrooklynNets @Grady @KesslerEdwards Need to work on that catch and shoot 3, congratulations nonetheless",
    "245": "The IDEAL situation for the Cavs this year is facing Brooklyn in that Play-In Tournament. \n\nCavs knocking out BKYLN would give this team that next level confidence. \n\nAlso losing to the Nets and losing the other games to retain our draft pick doesn't seem bad either.\n\n#LetEmKnow",
    "246": "@Stephen38135252 If the Cavs and Hornets both win, and the Nets lose, Brooklyn drops to 9.",
    "247": "What the Sixers need to do. Lose tonight to get the 4 seed. The Nets to win out and get the 7 seed. If we win round 1 we face Miami in round 2 instead of Boston Milwaukee Brooklyn.",
    "248": "@KingWarren3rd @BrooklynNets You do not have the personnel for that",
    "249": "@BrooklynNets Pls pls review how the raptors 2019 and Miami defense 2021 did to Giannis https://t.co/ZcMpmPyAEJ",
    "250": "@mkay12_ @BrooklynNets Not if it’s the playoffs, Joey Buckets, non existence",
    "251": "Being the last game of the regular season it concludes my first full year as a real season ticket holder. Met a lot of the #Netsworld family this year from Twitter to in person. Love this family and team. Renew already for the next season. It’s our world. @BrooklynNets 🏀🔥🙏🏾💯 https://t.co/xb7v2Dlg3P https://t.co/LtCmYUUORX",
    "252": "@aohughes @PaulReedWrld @BrooklynNets whatever helps you sleep at night man. you'll see eventually",
    "253": "i hope the brooklyn nets don’t get the 8th seed",
    "254": "@PaulReedWrld @aohughes @BrooklynNets Yea, he didn't shoot. We know. But he played lockdown D on Trae, facilitated the offense, and rebounded, which we suck at this year. The same thing that happened to him is slowly happening to Tobi and Harden. They're too focused on getting Jo the ball and can't score themselves",
    "255": "Looking ahead to today’s game — The Nets have won the past six games against the Pacers going into today’s game. A win today would officially set Brooklyn as the 7-seed in the Play-In. \n\nIt’ll be interesting to see how 2-4 East seeds play out today as well.",
    "256": "@TheNBACentral @BrooklynNets @AhnFireDigital We do this every year",
    "257": "Get that W today 🏀🙏🏻🤍🖤 @BrooklynNets @KyrieIrving @KDTrey5 @BruceBrown11 @_claxton33 @KesslerEdwards @blakegriffin23 @sdotcurry @AndreDrummond @aldridge_12",
    "258": "@aohughes @PaulReedWrld @BrooklynNets How is that casual? I just gave you clesr stats. You've probably never even been to a Sixers playoff game before lol. I even went down to Georgia last year for the Atlanta series",
    "259": "@Eternity9 @BrooklynNets Just let the young teams Cavs, Hawks and Hornets attempt to get in the playoffs they weren't expected to contend for a championship this season. If they lose to Milwaukee the defending champions or top seed Miami those teams rep won't look bad as the Nets losing in the 1st round.",
    "260": "@ShenkKyle @PaulReedWrld @BrooklynNets You are such a casual, I can’t even.",
    "261": "@NetsOnYES @Grady @BrooklynNets @NBA @ChrisShearnYES @TheFrankIsola @sarahkustok @YESNetwork And this was the exact viewing of this year,showed some champions esk performances away &amp; some absolute stinking bottom of the league performances at home.",
    "262": "@ShenkKyle @PaulReedWrld @BrooklynNets Well Ben has always been consistent in the playoffs. Consistently bad. He ain’t playing.",
    "263": "@Eternity9 @BrooklynNets Not to my knowledge the Nets with their season been a major disappointment they should be the team that just say screw it not worrying about making the playoffs this season where they will get beat in the first round. They are supposed to be championship contenders this year.",
    "264": "@TheNBACentral @BrooklynNets @AhnFireDigital Any normal hooper can do that lol",
    "265": "@BrooklynNets Much love @BrooklynNets @KyrieIrving",
    "266": "@minakimes @BrooklynNets You know Dabo never said he was against players using the free market to make money. https://t.co/Fn1b29rees",
    "267": "If the Cavaliers win today, The Cavaliers will face the Brooklyn Nets in the 7 vs. 8 Play in game. it will air at 7pm on April, 12 on TNT. At Brooklyn.",
    "268": "@BrooklynNets @TISSOT KD needs to go 5/8 from three to become \n50/40/90 with 30 points a game this year",
    "269": "@bklynnets1 @NetsOnYES @BrooklynNets @NBA @ChrisShearnYES @TheFrankIsola @sarahkustok @YESNetwork We’ve got the first round, and then we’ll do Pre and Post beyond that 💯💯",
    "270": "@BrooklynNets WE LOVE YOU",
    "271": "I'm officially saying I want the Nets. \n\nIf we're scared of Brooklyn we don't deserve to make it deep anyway",
    "272": "I cast for my teams to be @BrooklynNets and The Phoenix Suns. https://t.co/E8aTLdNwTm",
    "273": "@APOOCH @NetsOnYES @Grady @BrooklynNets @NBA @ChrisShearnYES @TheFrankIsola @sarahkustok @YESNetwork A weird stat on par with a weird season",
    "274": "So bad basically the @cavs have to beat the @BrooklynNets or @ATLHawks to make the NBA playoffs. https://t.co/sPYod5FDYG",
    "275": "@NetsOnYES @Grady @BrooklynNets @NBA @ChrisShearnYES @TheFrankIsola @sarahkustok @YESNetwork Definitely did not know that",
    "276": "@TheNBACentral @BrooklynNets @AhnFireDigital Not impressed",
    "277": "@TheNBACentral @KEEPITG216 @BrooklynNets @AhnFireDigital Wow! You traveled and made a shot. 2nd graders around the world want to share their juice boxes with you.",
    "278": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "279": "@antjams @BrooklynNets Are the @BrooklynNets resting KD, etc.?",
    "280": "Back to 2013 the CD Clayton want to meet me because he saw this @BrooklynNets hat all over the ship https://t.co/ttgmbmkfTR",
    "281": "@TheNBACentral @BrooklynNets @AhnFireDigital Why does this matter if he is afraid to shoot them in real games?",
    "282": "@chibbs_1 @BrooklynNets @GeorgiaTech Lmao I know I was just saying looks like caris 😂",
    "283": "@TheNBACentral @BrooklynNets @AhnFireDigital Walk!",
    "284": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "285": "@BrooklynNets @AndreDrummond @BruceBrown11 @JetBlue This was fun and you should do it with more people",
    "286": "Go @BrooklynNets @KDTrey5 is my favorite Net. #NetsWorld https://t.co/bWmM1CTxBS",
    "287": "@Barksdale235 @BrooklynNets @AndreDrummond @BruceBrown11 @JetBlue nobody wants tobias",
    "288": "@Keith_McPherson happy Sunday..HAPPY BROOKLYN NETS AND HAPPY NEW YORK YANKEES FANBASE...BBBRROOOKKKLLLYYNN..later enjoy the rest of your sports weekend...",
    "289": "I need to get better at reading spreadsheets. Brooklyn can fall to #9 today with a Nets loss, Cavs win, and Hornets win. \n\nCavs and Hornets each have favorable matchups, so the onus is on the Nets to beat Indiana.",
    "290": "@Pavlov362 @AngelusHector @BrooklynNets @HSpecialSurgery basketball player sitting out = not a basketball player??",
    "291": "@TheHoopCentral The @BrooklynNets are a FORCE!",
    "292": "@KAscuasiati @alecmjackson @NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital Not sure what this is supposed to mean? Nothing has happened yet and the off season hasn’t started. When we get to that point then we can talk about it.",
    "293": "@michaelhen999 @BrooklynNets They actually posted that lmao",
    "294": "@KimJonesSports @WFAN660 @MarcMalusis @BrooklynNets And one more thing  has the Yankee fan I haven't liked the look of this team for a long time cash and randy maybe should go",
    "295": "@TheNBACentral @BrooklynNets @AhnFireDigital This is actually really dumb",
    "296": "@1CE_TRAE It would be Hawks like for them to win only to have the Nets lose, CLE &amp; CHAR win &amp; the Hawks fall to 10th &amp; play Brooklyn who would be 9th",
    "297": "@TheNBACentral @BrooklynNets @AhnFireDigital @KDTrey5 @KyrieIrving and a Ben Simmons that can shoot, equals a #Dynasty not 1, 2, 3, 4, 5, 6, 7, oh wait, that didn't work out for @KingJames 🤣🤣",
    "298": "@NETSCHIPSZN2022 @GamerDieXX @TheNBACentral @BrooklynNets @AhnFireDigital If you only look at fg% lol. He is worse than both by far at the 3 &amp; ft line",
    "299": "@NetsOnYES @Grady @BrooklynNets @NBA @ChrisShearnYES @TheFrankIsola @sarahkustok @YESNetwork Is this the last game on YES . No playoffs correct?",
    "300": "@BrooklynNets Bruce Brown looks like just woke up from his nap 😆",
    "301": "NBA Regular Season Finale: Indiana Pacers vs. Brooklyn Nets | Hoop Streams #Brooklyn #Nets #NBA Video: https://t.co/IKOFu5Opz8",
    "302": "NBA Regular Season Finale: Indiana Pacers vs. Brooklyn Nets | Hoop Streams #Indiana #Pacers #NBA Video: https://t.co/5S6gBc7Ac3",
    "303": "@TheNBACentral @BrooklynNets @AhnFireDigital Lmaoooo like we don’t get off-season vids of him draining jumpers in practice every single year",
    "304": "Last game of the regular season… let’s get this W!!! LET’S GO NETS!!! #NetsWorld #BROOOOOKLYN #WRGOHARD  \nIndiana Pacers  at  Brooklyn Nets\n3:30pm EST/ 2:30pm CST\non the YES Network https://t.co/EEuAmzv261",
    "305": "@BlackMoses32 @GamerDieXX @TheNBACentral @BrooklynNets @AhnFireDigital Simmons is more efficient than both lmao",
    "306": "@BlackMoses32 @AyoItsKMO @TheNBACentral @BrooklynNets @AhnFireDigital Let me reiterate. Harden when he tries is good at picking passing lanes and defending the post. Other than that, he’s a hole on defense",
    "307": "@hornets Going to Brooklyn and beating KD and the Nets twice as well as beating the Knicks twice, making us 4-0 in New York this season 👍",
    "308": "@Eternity9 @BrooklynNets Well with KD been so injury prone it would make sense he rest if Giannis going to be out. Kyrie should rest too letting their role players play the Bucks role players.",
    "309": "@BlackMoses32 @AyoItsKMO @TheNBACentral @BrooklynNets @AhnFireDigital Cool show me his defense on ball",
    "310": "2) @BrooklynNets @hornets @cavs @ATLHawks are battling for Play-ins position. These are must-win games, and we have an early preview of the play-ins. https://t.co/s8MJk6aRsy",
    "311": "@NETSCHIPSZN2022 @GamerDieXX @TheNBACentral @BrooklynNets @AhnFireDigital Atleast they aren’t Simmons like",
    "312": "@NETSCHIPSZN2022 @AyoItsKMO @TheNBACentral @BrooklynNets @AhnFireDigital He used to avg 2 stls a game…always has avg a stl or more a game. Is that enough stats?",
    "313": "@BrooklynNets @AndreDrummond @BruceBrown11 @JetBlue Neither of them would survive in the 60s",
    "314": "@CFC_MQ @cmacisback16 @BrooklynNets Projection much?",
    "315": "#Brooklyn #Nets: Andre  Bruce \n\nHad to get these two together for Know Your #Nets, presented by @j... \n \nhttps://t.co/73BgVunjqV\n \n#Basketball #BrooklynNets #NationalBasketballAssociation #NBA #NBAEasternConference #NBAEasternConferenceAtlanticDivision #NewYork #NewYorkCity https://t.co/4xlTjfugRA",
    "316": "@TheHoopCentral @BrooklynNets @KDTrey5 if Ben Simmons develops his shooting, wow, the #Nets could have a run like the 90's Bulls! I would love to see that! @TermineRadio",
    "317": "@BrooklynNets @AndreDrummond @BruceBrown11 @JetBlue Andre is so God damn likeable.",
    "318": "@TheNBACentral @BrooklynNets @AhnFireDigital He’s pretty good against air!",
    "319": "@flatbushfinest3 @HardenFinalsMVP @TheNBACentral @BrooklynNets @AhnFireDigital Damn 💀💀",
    "320": "Nets look to lock up seventh seed in final regular season game: Gam... (The Brooklyn Game)\n\n7:30 p.m. ET on YES Network, ESPN and WFAN 101.9 FM / 660 AM.Pacers vs. Nets Odds, Lines, More\n\nAdd your highlights:\nhttps://t.co/dJjLtSLuPk\n #Brooklyn_Nets",
    "321": "Nets' Edwards playoff-eligible with standard deal (https://t.co/qWWHLlWR34)\n\nNEW YORK -- The Brooklyn Nets signed Kessler Edwards to a standard NBA contract Sunday, maki...\n\nAdd your highlights:\nhttps://t.co/KEaiBvr2mZ\n #Brooklyn_Nets",
    "322": "@TheNBACentral @BrooklynNets @AhnFireDigital Sixers fans been seeing these videos of him shooting for 3 years.  But never in a game that mattered.",
    "323": "@BrooklynNets @AndreDrummond @BruceBrown11 @JetBlue teammate chemistry: +10%",
    "324": "@BrooklynNets Let's go.",
    "325": "@BrooklynNets @AndreDrummond @BruceBrown11 @JetBlue Neeeed one with Kai and Kd",
    "326": "@BrooklynNets @AndreDrummond @BruceBrown11 @JetBlue Sign both",
    "327": "@TheNBACentral @BrooklynNets @AhnFireDigital Guy shoots the lights out at practice, let me tell you, never seen him do this in a game tho…I’m sure he is gonna pull up for jumpers all the time now in the regular season.  Oh wait it ends today and he is ‘hurt’",
    "328": "@BrooklynNets @AndreDrummond @BruceBrown11 @JetBlue sadly andre leaving and coming back to philly",
    "329": "So we have the avoid Toronto Vaccinated plot and the avoid Brooklyn Nets plot in first round !!!",
    "330": ".@AndreDrummond 🤝 @BruceBrown11\n\nHad to get these two together for Know Your Nets, presented by @JetBlue! https://t.co/mpP2ryrGN3",
    "331": "@TheNBACentral @BrooklynNets @AhnFireDigital It’s one shot stop making this irrelevant news worthy. You and I can do the same thing. Where’s our click bait",
    "332": "Another one for the collection @BrooklynNets #NetsWorld https://t.co/hfKPBgzhk9",
    "333": "@DickCage69 @Narutostan456 @StoolGreenie So you think our best chance for Celtics to get to NBA Finals is Brooklyn Nets with Kyrie / KD healthy and playing every game in Rd 1 instead of Toronto Raptors???",
    "334": "@HoopSpaces @mikeysoslimey Lebron James wanted to match the Brooklyn Nets Big-3, ironically both failed. Lebron appoints himself point guard for all 4th Quarters =“Winning Time.” Westbrook off the ball now , 91 million dollars flushed down the toilet. https://t.co/5Fijyo6JCE",
    "335": "Fucking amazing dude. Love being a @BrooklynNets fan all my life https://t.co/5cVKQah3OM",
    "336": "@TheNBACentral @BrooklynNets @AhnFireDigital Fucking travel",
    "337": "@BrooklynNets @KesslerEdwards Congratulations @KesslerEdwards !! Always onward and forward. So proud of you! #youearnedthat",
    "338": "@TheNBACentral @BrooklynNets @AhnFireDigital Are you guys really going to fall for this?",
    "339": "@BrooklynNets @KesslerEdwards You love to see it..",
    "340": "@shoelessjp @BrooklynNets I think you should be worrying about James Harden freezing up in the playoffs like an ice cycle 👌🏾",
    "341": "ICYMI -- 'We are rolling with the punches': Cleveland Cavaliers look ahead to Milwaukee Bucks after loss to Brooklyn Nets\n\nFinal game of the regular season today ... Cavs host Bucks at 3:30 p.m.\n https://t.co/wTwxYjJbeD via @beaconjournal",
    "342": "@NBALatam Brooklyn Nets",
    "343": "#e_RadioUS NBA Regular Season Finale: Indiana Pacers vs. Brooklyn Nets | Hoop Streams https://t.co/mqcQxftaTw https://t.co/f01Hg3jhJs",
    "344": "@TheNBACentral @BrooklynNets @AhnFireDigital I think these vids are hurting his brand",
    "345": "Me to @BrooklynNets https://t.co/6gYh9EJKUo",
    "346": "@BrooklynNets @KesslerEdwards proud of my rook",
    "347": "Indiana Pacers vs Brooklyn Nets: Injury Reports, Starting 5s, Betting Odds, Tips &amp; Spreads - April 10th, 2022 | NBA Season 2021-22 https://t.co/3WF3K3pA6G #NBA #Basketball",
    "348": "@KimJonesSports @WFAN660 @MarcMalusis @BrooklynNets Billy crystal has biggest movie city slickers which was done how many decades ago and he wore a Mets hat in it Billy crystal's a hack🍻",
    "349": "@Ben4DPOY @TheNBACentral @BrooklynNets @AhnFireDigital RELAX https://t.co/yDZJB7WmY4",
    "350": "@Eternity9 @BrooklynNets I'm glad they giving that L to the Heat. Firmly believe the Nets can handle that 1 v 8 series",
    "351": "@BrooklynNets Why Drummond acting like YouTuber 😭",
    "352": "@TheNBACentral @BrooklynNets @AhnFireDigital @BrooklynNets fans are about to fall the same tricks as @sixers fans did with this workout videos https://t.co/hv5ksUgHD5",
    "353": "@BrooklynNets Love from South Carolina!! Let’s go!!!",
    "354": "@BrooklynNets let's go nets, this season put me in stress zone. but I hope  April 2022 will be nets month. ❤️",
    "355": "@BklynNetBlock @shoelessjp @BrooklynNets Aww sweetie, you sound like every Sixers fan for the last like 4 years",
    "356": "@BrooklynNets As a Sixers fan this makes me SO happy knowing how this goes EVERY. FUCKING. TIME....",
    "357": "DasHaus made a bet!\n\nEvent: Indiana Pacers vs Brooklyn Nets #NBA\nBet: Brooklyn Nets TO WIN -16\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "358": "DasHaus made a bet!\n\nEvent: Indiana Pacers vs Brooklyn Nets #NBA\nBet: Indiana Pacers TO WIN +16\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "359": "Charlotte Hornets - Washington Wizards\nHouston Rockets - Atlanta Hawks\nBrooklyn Nets - Indiana Pacers\n\nBet slip link: https://t.co/pzyVHaDfvR https://t.co/4WbXeXAo7U",
    "360": "@TheNBACentral @BrooklynNets @AhnFireDigital This guy hits one three with no one on him in practice and it becomes post worthy????",
    "361": "We ♥️ Brooklyn Nets. #NetsWorld",
    "362": "Introducing my new podcast, #JerseyMade where I interview notable sports names who call NJ home!  I had the chance to interview @ChrisShearnYES, pre and postgame host for the New York Yankees and Brooklyn Nets on the YES Network! https://t.co/GSIFj2K9uz",
    "363": "@BrooklynNets i was not expecting Mt. Vernon Drum to sound like that lol",
    "364": "@BrooklynNets Love y'all guys 💕💕💕💕💕💕💕💕",
    "365": "@BrooklynNets Drummonds nose ring kinda sexy 😜",
    "366": "@NBA @KDTrey5 @BrooklynNets OMG, That defense is weaker than the one you face in shooting practice.",
    "367": "@BknNetsin4 @niceIol @Mr4thQuarter__ @loverofJesus12 @biasedkyriefan @betadaysrcoming @BrooklynNets in the first 1/5 of a millisecond",
    "368": "@aohughes @PaulReedWrld @BrooklynNets It's more of a basketball knowledge thing. We'll be lucky to make it to the second round without Ben. We have no defense, no ball movement, and Jo is extremely inconsistent in the playoffs. Nets are 100% making it farther than us, with or without Ben",
    "369": "@BrooklynNets out of context but claxton is beautiful",
    "370": "@Ben4DPOY @TheNBACentral @BrooklynNets @AhnFireDigital He’s been posting videos like this every off-season for 5 years",
    "371": "@TheNBACentral @BrooklynNets @AhnFireDigital Seen this feature film before",
    "372": "@UKNetsFans If Harden continues on this trajectory and the Nets get 25 year old  Ben Simmons back next year healthy this could actually go down as a steal for Brooklyn.",
    "373": "@BrooklynNets @KesslerEdwards just makes it even worse on Steve for benching him the final 15 minutes vs Atlanta lmao",
    "374": "@TheNBACentral @BrooklynNets @AhnFireDigital TRAVEL",
    "375": "@GreekGodSzn @domenic821 @nylewinston @OoJson @KsportstalkD @SoraX24 @DrGuru_ For sure gonna have to do the classy agree to disagree 😂😂😂. I hope y’all play the Nets first. Then again I won’t be mad if Cleveland loses today and somehow the Hawks beat the nets and take 7 and Brooklyn get 8 or eliminated. Lots of scenarios. But I’d rather play just y’all",
    "376": "@BrooklynNets What’s up Bruce you look tired",
    "377": "@TheNBACentral @BrooklynNets @AhnFireDigital Oooohhhhh a professional basketball player making a jump shot. Incredible",
    "378": "Consensus Line Move:\n2022-04-10 Indiana Pacers at Brooklyn Nets from 241.50 to 243.50\nOver feeling frisky\n#NBA #sports #datascientist #investingtips",
    "379": "@TheNBACentral @BrooklynNets @AhnFireDigital Same narrative every year, post how good the jump shot he was in practice.\nProve it on the court in a game, otherwise no one cares.",
    "380": "@BrooklynNets One of many reasons why I love this team❤️",
    "381": "@BrooklynNets Man, I love that Drummond's energy 💯",
    "382": "Today is the Indiana Pacers final game of the season. They take in the Nets in Brooklyn at 3:30pm \n\nThe Pacers will close out this year with either 26-56 or 25-57 record (5th or 6th worst in the NBA)",
    "383": "@TheNBACentral @BrooklynNets @AhnFireDigital Nigga we know he can shoot in practice already 💀😭",
    "384": "@Kay75628472 @BrooklynNets Unfortunately",
    "385": "@JergoatWest @BrooklynNets Thank god this isn’t the 1960s",
    "386": "@AyoItsKMO @BlackMoses32 @TheNBACentral @BrooklynNets @AhnFireDigital Yes lmao. That’s why Philly only has two players that are actually recognized as defenders. Embiid and Thybulle. Putting Harden in that conversation is just stupid.",
    "387": "@TheNBACentral @BrooklynNets @AhnFireDigital you don’t got the balls to do this in game tho  😴 @BenSimmons25 &amp; that’s a travel hoe!",
    "388": "@BrooklynNets @SplashModeKD Kyrie sounds SO fake😂",
    "389": "@KDTrey5 kd will u retire as a Brooklyn net",
    "390": "@nickiswashed @BrooklynNets I entered my GF’s info and got 2 tickets LFG lol",
    "391": "@NETSCHIPSZN2022 @BlackMoses32 @TheNBACentral @BrooklynNets @AhnFireDigital Awards and statistical evidence? I could give you steals numbers but they don’t determine how well somebody plays on ball defense. And now you need awards to show whether or not you PLAY defense 😂. Have a good day.",
    "392": "@niceIol @Mr4thQuarter__ @loverofJesus12 @biasedkyriefan @betadaysrcoming @BrooklynNets In the first second",
    "393": "@SON_OF_JOR_EL @BrooklynNets Yeah, from what I’ve just tickets won lol",
    "394": "@BLCity5 @BrooklynNets Congratulations!! Has anyone else gotten something besides the Grand Entry?? #NetsWorld",
    "395": "@TeeLowLoreman @BrooklynNets Yea thats what most people get i got lucky won 4 tickets",
    "396": "@BrooklynNets Gaddamn getting one would make my whole week !",
    "397": "@durantmuse @BrooklynNets My dad won tickets too",
    "398": "@TheNBACentral @BrooklynNets @AhnFireDigital A.I. said it best.. https://t.co/IyThXJAhoI",
    "399": "@BrooklynNets None of them would survive a second in the 1960s",
    "400": "@Endxier @Tuneechiiiiiii @BrooklynNets @KesslerEdwards He’s gone but Nash still wasn’t really making that adjustment when he was here. He was still getting his consistent minutes unless he absolutely needed to be taken out but in the next game he was back to getting regular minutes. Sean marks forced his hand.",
    "401": "@nickiswashed @BrooklynNets Wtf does this mean? Entered in a raffle for tickets? https://t.co/lYxYMbZzYl",
    "402": "@KimJonesSports @MarcMalusis @WFAN660 @BrooklynNets KILL IT AS ALWAYS AN D GIVE MARC A BIG WET KISS FROM ME. 💋 LOVE YOU.",
    "403": "@AyoItsKMO @BlackMoses32 @TheNBACentral @BrooklynNets @AhnFireDigital Ok then you have no proof, statistical evidence, or awards to show me that Harden can play defense.",
    "404": "Wow thank you @BrooklynNets for this Fan appreciation moment!! We hear you @KDTrey5 !! We hear you @KyrieIrving !! We are going to be even LOUDER and More ENERGETIC than ever!! #NetsWorld @BrooklynBrigade got your back! https://t.co/DZHLTKaU5M",
    "405": "ITS GAME DAY !!!!!! #brooklyn @BrooklynNets https://t.co/K97TO6o7Mn",
    "406": "@BlackMoses32 @GamerDieXX @TheNBACentral @BrooklynNets @AhnFireDigital Efficiency is Westbrook like. Averages don’t matter",
    "407": "@BrooklynNets My guy @mgbushwick1 ‼️",
    "408": "@Gymrat197 @NetsKingdomAJ @BrooklynNets Bet y’all wasn’t calling him trash when Sixers fans was rioting cause he got snubbed for DPOY",
    "409": "@JfromBk @rfardon @BrooklynNets That gif be having me dead",
    "410": "@BrooklynNets @KesslerEdwards LETS GOO https://t.co/wSpynihFG1",
    "411": "@BrooklynNets DrumGod would make a good YouTuber",
    "412": "Photo dump with family #soho #chinatown #littleitaly #nyc #centralpark #Brooklyn #brooklynnets #houstonrockets #ghostbustersfirehouse @ Leander, Texas https://t.co/BGSZ4FbZdv",
    "413": "Photo dumps insane for this season as I look through my Nets 2021-22 photos , season been a roller coaster and far from over but NetsWorld been lit all year ! Definitely a memorable one , thank u @BrooklynBrigade and @BrooklynNets 🙏🏽 #NetsWorld https://t.co/aGpEVhwmMA",
    "414": "@KimJonesSports @MarcMalusis @WFAN660 @BrooklynNets I’m all ears Kim 🤙🙃⚾️🏈🎤🎧⛳️",
    "415": "@KAscuasiati @alecmjackson @NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital Seth Curry &amp; Drummond &lt; Harden. 2 pick’s don’t matter all too much because they can always be a bust. Simmons hasn’t played and will be detrimental when it matters (spacing and ft%)",
    "416": "@TheNBACentral @BrooklynNets @AhnFireDigital Once the NBA makes dribbling optional its scary hours for the league with this guy",
    "417": "You kept your eyes on the prize - Well Done, my Brother! @KesslerEdwards @BrooklynNets https://t.co/25gdqNAIET",
    "418": "Nobody emails me more than the Brooklyn Nets https://t.co/5eQEE0yphP",
    "419": "@BrooklynNets 🖤🤍lets win the chip and KD will be no debate the goat",
    "420": "@BrooklynNets Lets go get the chip Nets!",
    "421": "@NETSCHIPSZN2022 @BlackMoses32 @TheNBACentral @BrooklynNets @AhnFireDigital It’s ok. You have to actually watch games to be able to see things.",
    "422": "@NETSCHIPSZN2022 @GamerDieXX @TheNBACentral @BrooklynNets @AhnFireDigital 21/7/10… better than 90% of the league 🤣",
    "423": "@NETSCHIPSZN2022 @ImDomColon @bleedgreen1981 @TheNBACentral @BrooklynNets @AhnFireDigital Harden won’t be taking that many shots 🤣. There is no way you have been paying attention to the 76ers or Harden since the trade",
    "424": "@GamerDieXX @BlackMoses32 @TheNBACentral @BrooklynNets @AhnFireDigital He might as well not play. Injury clearly took a toll. You’re being really delusional right now",
    "425": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "426": "@TheNBACentral @BrooklynNets @AhnFireDigital Lmao, okay what? Shooting a non contested jumper in shoot around and it rattles in. BIG 👀 👀… 😑",
    "427": "@BrooklynNets love yall so much!!! let's goooo ❤❤❤❤",
    "428": "@BrooklynNets @HSpecialSurgery I’m pretty sure for Ben Simmons it has to be either reconditioning or back soreness. Can’t be both",
    "429": "@BrooklynNets @KesslerEdwards This nobody would be a ball boy in the 60s",
    "430": "@BrooklynNets This dudes 😀",
    "431": "@BrooklynNets Is this legit??? https://t.co/I7EJj9jXYp",
    "432": "@Ben4DPOY @TheNBACentral @BrooklynNets @AhnFireDigital Lol. Nets fans must be new to Ben Simmons. Same shit, different team. Nets going to deal Ben in the off season. No way KD deals with Bens BS.",
    "433": "@BrooklynNets @Newfazegregpaul back to the future IV",
    "434": "@BitSler @Bitsler_Indo @Bitsler_Brasil Brooklyn Nets - Cleveland Cavaliers",
    "435": "@TheSlimReaper36 @BrooklynNets @KesslerEdwards FR we gotta enough",
    "436": "@TheNBACentral @BrooklynNets @AhnFireDigital This is akin to photo shopped pictures on tinder, he does not look like that in real life. Trust me I fell for it for YEARS. He does these videos all the time nets fans. Don't fall for it.",
    "437": "@BrooklynNets Nobody cares.",
    "438": "@BrooklynNets @KesslerEdwards Congrats Kess you deserve it homie",
    "439": "@BrooklynNets LFG TICKETS",
    "440": "@BigJohn2 @WFAN660 @MarcMalusis @BrooklynNets If so, only briefly",
    "441": "@BrooklynNets Hood rocking with Philly now you fell off",
    "442": "@GamerDieXX @BlackMoses32 @TheNBACentral @BrooklynNets @AhnFireDigital Nope doesn’t work like that",
    "443": "Sunday 🧾 \n\nAthletics Phillies over 9 -111\nChicago White Sox ML -129\nMariners Twins under 8.5 -105\nIndians Royals under 9 -112\nChicago Cubs ML +110\nBoston Red Sox ML +125 \n\nBrooklyn Nets 1H -9.5 -120 \n\nBoston Bruins ML -123\nPredators Penguins over 6.5 -105",
    "444": "Will forever be my favorite slasher to ever play the game back on when the nets was in jersey not Brooklyn https://t.co/YdShfCVC02",
    "445": "@ImDomColon @bleedgreen1981 @BlackMoses32 @TheNBACentral @BrooklynNets @AhnFireDigital And Harden gas sucked all year. You just won’t have the chance to be upset until it’s a win or go home game and harden shoots 2/25",
    "446": "Hard to see Indy beating Brooklyn with what’s left of their roster, the Nets are very likely to host the play-in. But even then, two swings (and the opportunity to see Kyrie/KD play a do-or-die game) is super valuable.",
    "447": "Fan Appreciation at @BrooklynNets game!! Hit the link for your chance to win! https://t.co/sh2WSb18zc https://t.co/iOXGYCDz2J",
    "448": "@bkIynets sou brooklyn nets sim senhor",
    "449": "@BrooklynNets Of course Simmons air balled it 😹",
    "450": "@JohnChaump @BlackMoses32 @TheNBACentral @BrooklynNets @AhnFireDigital What’s the difference with harden",
    "451": "@BrooklynNets Nets world @KDTrey5",
    "452": "@AyoItsKMO @BlackMoses32 @TheNBACentral @BrooklynNets @AhnFireDigital Can’t show me any proof that harden plays defense",
    "453": "@kranepool @BrooklynNets @nyknicks Fair",
    "454": "@BrooklynNets Best team🖤🤍💯",
    "455": "@BrooklynNets Love team🤍🖤",
    "456": "Brooklyn Nets sign Kessler Edwards to standard NBA contract before playoffs https://t.co/3uNEWXjvZl",
    "457": "@BrooklynNets lol, was pretty obvious KD would be the last",
    "458": "@BrooklynNets We love our squad.\n#LetsGoNets",
    "459": "@BlackMoses32 @GamerDieXX @TheNBACentral @BrooklynNets @AhnFireDigital If Harden can play Defense, Ben w can shoot. I don’t care about the stats",
    "460": "@BrooklynNets Lmao, why Clax sound like that 🤣🤣",
    "461": "@TheNBACentral @BrooklynNets @AhnFireDigital no shot anyone is actually falling for this",
    "462": "Cleveland Cavaliers rookie Evan Mobley returned from 5-game absence in loss to Brooklyn Nets - https://t.co/zCR9QHyIjb\n#worldwidetweets https://t.co/ze3ix8CFXV",
    "463": "@TheNBACentral @BrooklynNets @AhnFireDigital He forgot how to dribble.",
    "464": "@BrooklynNets One u too",
    "465": "@BrooklynNets LET'S GET IT! ❤️❤️",
    "466": "@TheNBACentral @BrooklynNets @AhnFireDigital About to block this account",
    "467": "@loverofJesus12 @biasedkyriefan @betadaysrcoming @BrooklynNets In the first 5 minutes",
    "468": "@TheNBACentral @BrooklynNets @AhnFireDigital He trying to cheat us again...don't trip boy can't shoot 3's 🤪",
    "469": "@LimitedVery @BrooklynNets Nice one didn't realize that",
    "470": "@WeabooIv @shoelessjp @BrooklynNets And if he does that we are well on our way to wining it all 🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾",
    "471": "@BrooklynNets GO BKN~\nThanks for every player's effort!",
    "472": "Indiana Pacers vs Brooklyn Nets NBA Pick and Prediction NBA Betting Tips... https://t.co/FUD38hnSRe via @YouTube",
    "473": "@Flockwitme123 @BrooklynNets “Little to none” https://t.co/YMkUzykqHQ",
    "474": "@BrooklynNets @KesslerEdwards best decision😍🤍🖤",
    "475": "@TheNBACentral @BrooklynNets @AhnFireDigital Every year we see these videos of Ben shooting 3 pointers. Then when the season hits nothing",
    "476": "🚨B.Brown to score 1x 3pt 🔥 Nets vs pacers #NBA @BrooklynNets  #nba #bets #nets #money #basketball @BruceBrown11",
    "477": "@SDot150 @BrooklynNets At all!",
    "478": "@BrooklynNets @KesslerEdwards Is Kessler a lefty?",
    "479": "@BrooklynNets Thanks brooklynnets 🤍🖤",
    "480": "@biasedkyriefan @betadaysrcoming @BrooklynNets In the first quarter *",
    "481": "@KimJonesSports @WFAN660 @MarcMalusis @BrooklynNets Will there be any squirrel talk this morning Kim?",
    "482": "@TheNBACentral @BrooklynNets @AhnFireDigital Nets fans your gonna fall in love",
    "483": "The Brooklyn Nets have officially signed two-way forward Kessler Edwards to a standard NBA contract after releasing James Johnson\n\nEdwards is averaging 5.8 ppg and 3.6 rpg",
    "484": "@TheNBACentral @BrooklynNets @AhnFireDigital Ahh the old jump shot in an empty gym vs no defenders ...Bens back!",
    "485": "@BrooklynNets All Love to you guys. Go get the Chip. #NetsWorld",
    "486": "@BrooklynNets drummond always so happy",
    "487": "@TheNBACentral @BrooklynNets @AhnFireDigital How many years the sixers seen these clips 🤦🏽‍♂️",
    "488": "@TheNBACentral @BrooklynNets @AhnFireDigital 4 steps into a jumper?!?",
    "489": "@BrooklynNets Niggas checking in like YouTube vloggers https://t.co/nkRx2S87wF",
    "490": "@BrooklynNets Need you to dunk on Cleveland, then Heat",
    "491": "@TheNBACentral @BrooklynNets @AhnFireDigital here we go again",
    "492": "@BrooklynNets Sending energy from China🏀🏀🏀",
    "493": "Nets rookie Kessler Edwards official signed to standard NBA contrac... (The Brooklyn Game)\n\nCary Edmondson-USA TODAY SportsIt was the move everyone had expected to take place after Jam...\n\nAdd your highlights:\nhttps://t.co/3Uvadna1PP\n #Brooklyn_Nets",
    "494": "@BrooklynNets It's our world",
    "495": "@BrooklynNets We want a parade on Flatbush. https://t.co/CtokuPRtF5",
    "496": "@SBondyNYDN Difference is the @BrooklynNets tiny table signings are for talented players where the @nyknicks tiny table is for signing big disappointments",
    "497": "@Keith_McPherson @BrooklynNets Wow you a cheeseball. WFAN get a Knicks fan to host ur morning show! This dude need to be hosting a Nets show for hipster kids on the Yes Network.",
    "498": "@TheNBACentral @BrooklynNets @AhnFireDigital Lmfao y’all been playing these open gym videos of Simmons for 3 seasons only to watch him shoot 50% from the charity stripe come winning time",
    "499": "@Yb_HardenGoat @BrooklynNets At least Simmons of Ben not obese.",
    "500": "@BrooklynNets I did not expect Drummond to sound like that ☠️",
    "501": "@BrooklynNets We move !",
    "502": "@Ben4DPOY @TheNBACentral @BrooklynNets @AhnFireDigital It’s just 1 shot",
    "503": "@TheBKN3 @BrooklynNets @KesslerEdwards So happy for this man!",
    "504": "@BrooklynNets Drummond sounds like a YouTuber😂",
    "505": "@BrooklynNets Wow. This was a hell of a season. WE GO HARD #NetsWorld https://t.co/hoIrJ0G3wi",
    "506": "@BrooklynNets @CoreyBCantor Wholesome. All love from Georgia.",
    "507": "@BrooklynNets KD triple-double today\n41\n11\n10",
    "508": "@BrooklynNets We move!",
    "509": "@shoelessjp @BklynNetBlock @BrooklynNets Tbf, the nets fit him a lot better, he’s got some of the top 3 point shooters around him, Seth, Harris, KD, Irving, Mills plus they’ve already got 2 elite scorers, all Ben needs to do is average around 15 and play defence",
    "510": "@NetsHive @BrooklynNets Facts bring back Bruce Clax Drummond and pickup shooters like Otto melo Ben mclemore Forbes",
    "511": "@BrooklynNets MOOD for the Playoffs 💯💯🔥 what a season 😵‍💫 https://t.co/QDup0WGvgA",
    "512": "@BrooklynNets Nets going to the finals after dog on the Cavs in the Play-In",
    "513": "Let’s go baby! Thank you @BrooklynNets 🙌🏽🙌🏽🙌🏽 https://t.co/GxjoGvnGRP",
    "514": "@Yb_HardenGoat @BrooklynNets Tell harden to start owning a gym membership.",
    "515": "@BrooklynNets Will bring the same energy that y'all bring on defense! For those who haven't been following that's little to none! Time to put on your big boy pants Nets.",
    "516": "@pRiinciiCaRter @BrooklynNets @GeorgiaTech Lol! Thats kenny Anderson",
    "517": "@TheNBACentral @BrooklynNets @AhnFireDigital Walk",
    "518": "4.10.22\nIndiana #Pacers vs Brooklyn #Nets\nWashington #Wizards vs Charlotte #Hornets\nMilwaukee #Bucks vs Cleveland #Cavaliers\n\nToday's #NBAPredictions: https://t.co/hltNwEZVnD\nBet on NBA:  https://t.co/ArbfnziqHj\n#Draftkings #Fanduel #sportsbook #BetMGM #WilliamHillUS https://t.co/9Fn9YpEaTO",
    "519": "@BrooklynNets the energy of letting cry baby millionaire control your franchise?",
    "520": "@TheHoopCentral @BrooklynNets Hahaha. Get ready for these all summer. And zero in a game when it matters.🤣🤣 https://t.co/MzQiPoeXHp",
    "521": "@BrooklynNets NetsWorld babyyy",
    "522": "@BrooklynNets Everyone besides KD needs to be resigned / extended this offseason btw",
    "523": "@TheNBACentral @BrooklynNets @AhnFireDigital As a Sixers fan, we seen this before 🤣🤣🤣",
    "524": "@BrooklynNets I need yall to get right with us at #YOURFAVORITEJUICEBAR",
    "525": "@BrooklynNets Bruce Goat",
    "526": "@BrooklynNets @KesslerEdwards Only thing he lacks is confidence💯 #believeinurself 🙌🏽",
    "527": "@BrooklynNets Kai dropping 32 7 6 today book it",
    "528": "@BrooklynNets we NEED to COLLABORATE! Our Nets players need the best nutrient, vitamins and mineral based protein smoothies in brooklyn to fuel us to the finals! #SEAMOSS Smoothies are essential for athletes!🏁Link Up! @VeggiesNJB #yourfavoritejuicebar #HOMEOFTHEBESTEVERYTHING",
    "529": "Thanks for rocking with us all season, #NetsWorld \n\nKeep bringing that energy! https://t.co/HonBh1AOJj",
    "530": "@CrainCompany @JakeCrain_ @Blain_Crain @davidadamcone \n\n#BoosterClub\n\nIf picks count for streak today, I'm taking Brooklyn Nets ML. \nThey're battling for a better seed.",
    "531": "@alecmjackson @NETSCHIPSZN2022 @BlackMoses32 @TheNBACentral @BrooklynNets @AhnFireDigital Ben Simmons, Seth curry, Drummond, 2 picks &gt;harden",
    "532": "@RealPeterBalla @cmacisback16 @BrooklynNets Good luck having a social life and a partner",
    "533": "Helllloooo from @WFAN660…. I’m following my buddy @MarcMalusis today. I’ll be on from noon-3:20 when @BrooklynNets pregame begins. Talk soon. ⚾️🏈⚾️\n☎️: 877-337-6666",
    "534": "@TheNBACentral @James_HamNBA Future Brooklyn net",
    "535": "Consensus Line Move:\n2022-04-10 Indiana Pacers at Brooklyn Nets from 240.50 to 241.50\nOver nervous?\n#NBA #sport #datascience #trading",
    "536": "@TheNBACentral @BrooklynNets @AhnFireDigital 😂😂😂😂😂 no just no",
    "537": "@BrooklynNets @KesslerEdwards Look like Ben from RDCworld",
    "538": "@BrooklynNets This team bout to be scary when Ben starts playing.",
    "539": "INDIANA PACERS vs\nBROOKLYN NETS, 3:30PM.",
    "540": "@TheNBACentral @BrooklynNets @AhnFireDigital Oh my gosh they are already in year 3. Wow.",
    "541": "Nets sign F Kessler Edwards to standard contract #KesslerEdwards #NBA\n #BrooklynNets #BrooklynGrit  https://t.co/txdQae1S0t",
    "542": "@BrooklynNets Biggest troll in the league Lmaoo",
    "543": "I just played the Brooklyn Nets instant win game. Play now for a chance to win exciting prizes!\n\n#NetsWorld https://t.co/PLe16RNrAT",
    "544": "@Eternity9 @BrooklynNets Wooow 😂😂😂 they don’t want that early first round exit!",
    "545": "Thanks @BrooklynNets !!! https://t.co/zuYlHG4ANx",
    "546": "@ShenkKyle @PaulReedWrld @BrooklynNets Simmons stans’ opinions are worthless.",
    "547": "LeBron making wildcard entry from the Brooklyn nets for the playoffs https://t.co/TcvsWnpvlH",
    "548": "@casualkyriefan @BrooklynNets Yeah, it’s real. I got a bunch of grand entries. But, the tickets are exciting. I wonder if anyone has won anything else",
    "549": "@Gaza_FrE5h @itzjxhnnn04 @NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital Clunky? WWHHHAATTTT???!’n 🤣🤣🤣🤣🤣🤣🤣",
    "550": "@BLCity5 @BrooklynNets This real? I thought it was just rigged for everyone to get enter into the raffle",
    "551": "@TheNBACentral @BrooklynNets @AhnFireDigital Don’t let him fool you again lmao",
    "552": "Nets' Andre Drummond says final two regular-season outings are 'must-win games' for Brooklyn – ESPN https://t.co/IytSwvG4Rq",
    "553": "@made2follow @BrooklynNets No clue!",
    "554": "@BLCity5 @BrooklynNets Congrats that’s awesome, any idea where the tickets are for in the arena?",
    "555": "@BrooklynNets Let’s go @BenSimmons25. You got this!",
    "556": "@BrooklynNets Ben simmons play for god",
    "557": "@JonGottti89 @itzjxhnnn04 @NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital The roster around him was clunky bro don’t do that , in todays NBA he has to be small ball 5 in the 4th with other shooters on the floor but he couldn’t play like that because you can’t bench embiid that would be stupid I’ve never thought those two were ever a good fit",
    "558": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel!",
    "559": "I just played the Brooklyn Nets instant win game. Play now for a chance to win exciting prizes! https://t.co/UvhSRIonHl",
    "560": "The Brooklyn Nets have signed Kessler Edwards to a standard NBA contract, making him eligible to play in the postseason. The second-round pick from Pepperdine had been on a two-way contract, which meant he couldn’t play beginning next week. But… https://t.co/dRhlbKKSWS",
    "561": "@BrooklynNets Has Simmons tweaked his shooting action? Looks like left hand behind the ball now",
    "562": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "563": "@AustinKurtz062 @BrooklynNets not Giants or Jets LOL",
    "564": "@TheNBACentral @BrooklynNets @AhnFireDigital Holy travel",
    "565": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "566": "Charlotte Hornets - Washington Wizards\nBrooklyn Nets - Indiana Pacers\nMemphis Grizzlies - Boston Celtics\n\nBet slip link: https://t.co/1SP9NrMRL8 https://t.co/hC5dOxp3LV",
    "567": "@Ben4DPOY @babacuck @TheNBACentral @BrooklynNets @AhnFireDigital I want whatever you’re on",
    "568": "@TheNBACentral @BrooklynNets @AhnFireDigital foh seen this summer time for years",
    "569": "@BrooklynNets @KesslerEdwards Proof that being a hard-working young man with great character pays off! Congratulations @KesslerEdwards! So well deserved!",
    "570": "@JfromBk @rfardon @BrooklynNets Perfect gif. (And movie)",
    "571": "@Johnsonfasho @TheNBACentral @BrooklynNets @AhnFireDigital 😂😂😂 you already know how it’s going to go. the ONLY thing that’s going to help his that Kyrie probably won’t let him shoot",
    "572": "@Gaza_FrE5h @itzjxhnnn04 @NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital No denying Simmons skill.. but when you can’t one of your best players on the court in the 4th quarter that’s an issue",
    "573": "@BLCity5 @BrooklynNets Awesome",
    "574": "@Gaza_FrE5h @itzjxhnnn04 @NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital My point was: Ben Simmons is the same player he was 5 years ago while maxey has developed in less time my guy. Maxey is 5th in 3 point percentage.",
    "575": "@BLCity5 @BrooklynNets Congrats.",
    "576": "@TheNBACentral @BrooklynNets @AhnFireDigital No one questions he can knock them down in practice.",
    "577": "@BrooklynNets Let’s go can’t wait https://t.co/mcEydMbZ3h",
    "578": "@BrooklynNets @KesslerEdwards Tell him all he gotta do is lock 🔒 up and knock down open shots he will get",
    "579": "@JonGottti89 @itzjxhnnn04 @NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital Because maxey can hit a few shots doesn’t make him an overall better player than ben Simmons wtf 😳 Jason Kidd came into the NBA with no jump shot that came over time every player progresses different from the next ben Simmons is elite at every thing else which made him an all ⭐️",
    "580": "@KAscuasiati @NETSCHIPSZN2022 @BlackMoses32 @TheNBACentral @BrooklynNets @AhnFireDigital Let’s not act like this harden we’re seeing isn’t better than Ben has ever been",
    "581": "@TheNBACentral @BrooklynNets @AhnFireDigital he traveled",
    "582": "@AustinKurtz062 @BrooklynNets yessir!",
    "583": "@BrooklynNets @KesslerEdwards I like the guy. However I seriously think he needs to play with more confidence. Furthermore better shot selection. As a roll player know your roll. We need championship caliber players. We need a championship.",
    "584": "@BrooklynNets @KesslerEdwards Much deserved 👏",
    "585": ". @BrooklynNets @ATLHawks please win I want to watch trae vs kd IRL",
    "586": "@eric_nehm I have no problem with this, mostly because the Nets will take a lot of energy out of whoever they play in round one. Would rather sweep the Bulls - not worried at ALL about the Celtics having home court in round two IF they beat Brooklyn.",
    "587": "@JfromBk @rfardon @BrooklynNets My favorite gif you use",
    "588": "@BrooklynNets Ayeee Grand Prize Entry! 🤞🏾🤞🏾🤞🏾🤞🏾🙏🏾🙌🏾 @BrooklynNets https://t.co/tuJtukjSvY",
    "589": "JJ says “LETS GO BROOKLYN!” 🖤 @BrooklynNets",
    "590": "@durantmuse @BrooklynNets @KesslerEdwards BTB chips? 😳",
    "591": "What seed do you think the Brooklyn Nets will be for the play-in tournament??",
    "592": "@BrooklynNets LETS GOOO, DIOS MIO GRACIAS! BIG W 🙏🏽 see y’all in the netaverse 🤩 https://t.co/CSPLJHVWPK",
    "593": "@BrooklynNets @HSpecialSurgery start edwards instead of curry",
    "594": "@BrooklynNets @dbearak @KesslerEdwards Nice well deserved",
    "595": "@TheNBACentral @BrooklynNets @AhnFireDigital We've seen this before. Hes capable of hitting shots, he just won't take them during games.",
    "596": "@TheNBACentral @BrooklynNets @AhnFireDigital hahahahahahahahahahahahahahah hahahahahahhahahahahahahahahah hahahahahahahah",
    "597": "@BrooklynNets Absolutely loved this all season 💯🖤🤍🖤",
    "598": "#Nets: Brooklyn Nets Sign Kessler Edwards https://t.co/l7IyEJU63h https://t.co/77c8d5gKPo",
    "599": "@BrooklynNets @KesslerEdwards Well deserved 👏🏽 Let’s go",
    "600": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "601": "@BrooklynNets Would be good if Australia good spin the wheel 🖤🤍🖤",
    "602": "@Yb_HardenGoat @BrooklynNets @HSpecialSurgery Where deez nuts",
    "603": "@BrooklynNets @BrooklynNets Always Keeping the fans first !!! Thank you 😊",
    "604": "Looks like I will for sure be coming back to Brooklyn next season! Thank you, @BrooklynNets. https://t.co/YCAkf9CHa5",
    "605": "@TheNBACentral @Pvark1 @BrooklynNets @AhnFireDigital We are happy a dude is putting the ball in the hoop when that’s the name of the game? 🤦🏻",
    "606": "@TheNBACentral @BrooklynNets @AhnFireDigital Here we go again😂",
    "607": "@MaxJordan718 @BrooklynNets Same this is so sick",
    "608": "@NbaBubble1 @BrooklynNets Yup! Check your email and it should be there as well. Congrats!",
    "609": "@lilt82 @Lakers Chose Westbrook because Lebron was thirsty for any BIG NAME PLAYER they could find to compare with the Brooklyn Nets Big-3 lineup. Didn’t care that Westbrook is a poor off the ball scorer when 4th Quarter comes.",
    "610": "@BrooklynNets I won 2 tickets to a game next season! Thanks for doing this!!!",
    "611": "@BrooklynNets Is this legit? https://t.co/KMPabsLT1K",
    "612": "@Rxtro_00 @Lele49777223 @jiajiaj43572446 @BrooklynNets @KesslerEdwards the bucks are resting their starters",
    "613": "@aohughes @PaulReedWrld @BrooklynNets ?? Just do me a favor and stay out of sports you don't understand. Wait till football season rolls back around",
    "614": "@JeriTsaiNets @BrooklynNets @HSpecialSurgery I’m hoping that he could be back for the play in game",
    "615": "@BrooklynNets Yessir https://t.co/QBwvmMLNPy",
    "616": "@BrooklynNets @KesslerEdwards HELL NAW , KEEP UR ASS OFF 3PT LINE THEN ITS GUCCI",
    "617": "@TheNBACentral @BrooklynNets @AhnFireDigital Fake that’s a midrange shot.",
    "618": "@ShenkKyle @PaulReedWrld @BrooklynNets Broooooooklyn!",
    "619": "@BrooklynNets Yes I got 2 free tickets!",
    "620": "Today the Brooklyn Nets (43-38) host the Indiana Pacers (25-56) at 3:30 🕞 @YESNetwork @Nba0nEspn #Brooklyn #Nets #NBA #NetsWorld #BrooklynTogether",
    "621": "@alecmjackson @NETSCHIPSZN2022 @BlackMoses32 @TheNBACentral @BrooklynNets @AhnFireDigital Ben is not harden.. but Ben is not going to get a max deal next season like harden a player that is not 50% of what he used to be \n\nhttps://t.co/w0flZ1GTZY",
    "622": "@BrooklynNets @KesslerEdwards W. Also he’s a lefty?",
    "623": "I just played the Brooklyn Nets instant win game. Play now for a chance to win exciting prizes! https://t.co/8NLT6a4NRS",
    "624": "@orlandoupnext @BrooklynNets ratio",
    "625": "They don’t want to play the @BrooklynNets 😂 Like I said, they KNOW they’d lose in a 7 game series against them now. Very, very interesting! https://t.co/zHxg5kGFJ7",
    "626": "@BrooklynNets Is this for Europe too or just US?",
    "627": "Today is all about you, #NetsWorld! \n\nCelebrate Fan Appreciation Day by spinning the wheel for a chance to win some special prizes 🎁\n\n👉 https://t.co/K6DzipWTIC https://t.co/Xb4zfuS3xi",
    "628": "@_victorfds @BrooklynNets Yessir",
    "629": "@BrooklynNets @KesslerEdwards Well earned and deserved! 👏🏽",
    "630": "@BrooklynNets @KesslerEdwards Writes left and shoots with his right hand. Dope. Like Bron and Russ",
    "631": "The Brooklyn Nets can lock up the 7th seed today with: \n\n➙ Win vs. IND\nOR\n➙ CLE loss vs. MIL\n\n(92.8%)\n\nGain 8th seed with: \n\n➙ Loss vs. IND\n➙ CLE win vs. MIL\n➙ ATL win in HOU\n➙ WAS win in CHA\n\n(1.2%)\n\nGain 9th seed with: \n\n➙ Loss vs. IND \n➙ ATL, CHA, CLE all win\n\n(4.8%) https://t.co/TaOs1FPwry",
    "632": "@BrooklynNets @KesslerEdwards To ride the bench?",
    "633": "@BrooklynNets @KesslerEdwards What I would do to see this kid develop a more constant 3pt shooting! He shoot 44% in college. Time to get back close to that but more so develop your mid-range and close to the hoop game! That way you don't have to rely on the 3 all the time! #itsgotime",
    "634": "@TheNBACentral @BrooklynNets @AhnFireDigital is it already that period?",
    "635": "@KDTrey5 @KyrieIrving &amp; @BrooklynNets not making it out the 1st round of the @NBAPlayoffs2022",
    "636": "Consensus Line Move:\n2022-04-10 Indiana Pacers at Brooklyn Nets from 241.50 to 240.50\nUnder adjust quickly\n#NBA #bettingadvice #pythonprogramming #bitcoin",
    "637": "📅GAME DAY📅\n\n⚽️ @NYCFCYouth \n⚾️ @Mets \n🏉 @NewYorkRugby \n🏒 @AHLIslanders \n🏀 @BrooklynNets \n🏐 @TeamFreedomVBC \n🏀 @nyknicks \n🏉 @rugbynewyork \n⚾️ @Yankees \n\n#NYC #NYCFCII #LGM #NYRC #BRIsles #NetsWorld #TeamFreedom #NewYorkForever #BuiltforNewYork #RepBX https://t.co/dviBsCVp8L",
    "638": "@midvault @johnnyoctober13 @SiakamFan @Twentylmao @TheNBACentral @BrooklynNets @AhnFireDigital Long term? Seth and Drummond both signing somewhere else this summer lol",
    "639": "@BrooklynNets @KesslerEdwards Let's go 🖤🤍",
    "640": "Happy duck the Brooklyn Nets day to anyone celebrating (seems to be a growing holiday)",
    "641": "@KAscuasiati @BlackMoses32 @lenhan0925 @NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital Curry being off the team only opens up more minutes for maxey",
    "642": "@TheNBACentral @BrooklynNets @AhnFireDigital Walk",
    "643": "@Mac71234692 @cmacisback16 @BrooklynNets Took you a while to find a grip, didn’t ya? Emojis bailed you out tho. \nGood luck trying to buy a championship next year.",
    "644": "@NETSCHIPSZN2022 @BlackMoses32 @TheNBACentral @BrooklynNets @AhnFireDigital Ben Simmons is not the facilitator that harden is lol",
    "645": "@BrooklynNets He deserves it. But Blake griffin needs more minutes",
    "646": "@BrooklynNets THANK YOU SOOO MUCH https://t.co/Q86kwWIjfM",
    "647": "@NetsOnYES @NetsDaily @Grady @BrooklynNets @NBA @ChrisShearnYES @TheFrankIsola @sarahkustok @YESNetwork Grady with the call against his former team",
    "648": "@Ben4DPOY @TheNBACentral @BrooklynNets @AhnFireDigital We are talking about how bad Simmons is. I agree the Sixers aren’t winning this year. Neither are the 7th place Nets. 😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭",
    "649": "One last time.\n\n🆚️ Brooklyn Nets\n🕣 20:30\n\n#Pacers #GoldBlooded https://t.co/CAjRVHRdyJ",
    "650": "@robloxfortnitem @cmacisback16 @BrooklynNets How old was Jordan when won 6th ring? \nExactly. \nIt’s y’all’s problem that not all no1 picks are good enough for you. That’s why I’m suggesting y’all keep stacking them up, and by the time you collected all 13, you might just have a shot at the title. \nFfs.",
    "651": "@TheNBACentral @BrooklynNets @AhnFireDigital LOL…practice jumpers. Are we talking about practice?!?!",
    "652": "Brooklyn Nets Sign Kessler Edwards | Brooklyn Nets (Brooklyn Nets)\n\nBROOKLYN - The Brooklyn Nets have signed two-way forward Kessler Edwards to a standard NBA c...\n\nAdd your highlights:\nhttps://t.co/V1zTskQjJR\n #Brooklyn_Nets",
    "653": "@robloxfortnitem @cmacisback16 @BrooklynNets Again. Y’all need 5 top 2 picks twice, in case of injuries? So maybe y’all make playoff?",
    "654": "@TheNBACentral @BrooklynNets @AhnFireDigital Man gtf",
    "655": "@Mac71234692 @cmacisback16 @BrooklynNets You’re saying y’all need more than 4, coz of poss injuries. What’s the magic number then? 3 no1 and 2 no2, plus all that again for substitute?",
    "656": "Last game of the season. Business trip fellas! @BrooklynNets",
    "657": "@TheNBACentral @BrooklynNets @AhnFireDigital Alright, whos gonna tell them?",
    "658": "@TheNBACentral @BrooklynNets @AhnFireDigital I think that’s a travel.",
    "659": "@daniok7_ @KD_SZN7 @BrooklynNets Lemickey has the most expensive super team and can’t even make the play ins 😂😂😂",
    "660": "@BrooklynNets @KesslerEdwards Kessyyyyy",
    "661": "@BrooklynNets @anishpFS  Simmons spotting",
    "662": "@Mac71234692 @cmacisback16 @BrooklynNets So griffin isn’t no1?",
    "663": "@TheNBACentral @BrooklynNets @AhnFireDigital People still falling for this????😂😂😂",
    "664": "@RealPeterBalla @cmacisback16 @BrooklynNets Durant is 2nd and Blake doesn’t play",
    "665": "@Pacers vs. @BrooklynNets \n@WashWizards vs. @hornets \n@Bucks vs. @cavs \n@ATLHawks vs. @HoustonRockets \n@celtics vs. @memgrizz \n@Raptors vs. @nyknicks \n@MiamiHEAT vs. @OrlandoMagic \n@DetroitPistons vs. @sixers \n@chicagobulls vs. @Timberwolves \n@spurs vs. @dallasmavs",
    "666": "@ManuelManny0 @Momo_Undefined @BrooklynNets @HSpecialSurgery he already said it’s not gonna be right until he gets to rest it in the off-season",
    "667": "@dodoinmypants @AngelusHector @BrooklynNets @HSpecialSurgery Guessing the last time you checked was over a year ago?",
    "668": "@minakimes @BrooklynNets What was with all that one in a million talk?",
    "669": "Houston Rockets - Atlanta Hawks\nCleveland Cavaliers - Milwaukee Bucks\nBrooklyn Nets - Indiana Pacers\nCharlotte Hornets - Washington Wizards\n\nBet slip link: https://t.co/NEiPlhJ5gl https://t.co/IlXynqDA3h",
    "670": "@BrooklynNets Yo y’all broke ass hell if u making us pay to watch 80% of ur games I swear I’ve watched more rockets game on live television then Nets games",
    "671": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "672": "@JeriTsaiNets @BrooklynNets @HSpecialSurgery What you mean? He in protocols.  Nash said he is back in town.  Hopefully cleared for Tuesday",
    "673": "@BrooklynNets @KesslerEdwards @ConorMc72997890  good signing?",
    "674": "Are the Brooklyn Nets Legitimate NBA Title Contenders? † Bleacher Report https://t.co/5TkWx5yTOy",
    "675": "@BrooklynNets @KesslerEdwards Let's go!",
    "676": "Nets rookie Kessler Edwards official signed to standard NBA contract – The Brooklyn Game https://t.co/7f6H0sf1El",
    "677": "@All_EyezOn_Quis @TheNBACentral @BrooklynNets @AhnFireDigital Lmfao",
    "678": "@AyoItsKMO @NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital He already admitted he doesn’t watch ball. His references for the 76ers is when they PLAYED BKN a month ago lol",
    "679": "This is counter to how the Nets announced the transaction, but this is exactly what Brooklyn should have done. Good work here. https://t.co/PwOcj8YsuX",
    "680": "The Brooklyn Nets have officially signed two-way forward Kessler Edwards to a standard NBA contract, per team.",
    "681": "Nets vs Brooklyn in finals",
    "682": "@TheNBACentral @BrooklynNets @AhnFireDigital He traveled. No bucket",
    "683": "@ImperialLunch @BrooklynNets @KesslerEdwards Idk why we don’t just live and die wit em and just play him regular mins he at the least would give us what JJ except more scoring and rebounds wit better defense",
    "684": "@BrooklynNets @KesslerEdwards Nash now that he doesn't have James Johnson to take his minutes https://t.co/7xUiaP1tyo",
    "685": "Did you know @Grady ? The regular season ends today with @BrooklynNets being 1st team in @NBA history to be over .500 overall despite being under .500 at home. @ChrisShearnYES @TheFrankIsola start our coverage at 3 pm 🦅 @sarahkustok &amp; Michael have the call at 3:30 @YESNetwork",
    "686": "@flatbushfinest3 @HardenFinalsMVP @TheNBACentral @BrooklynNets @AhnFireDigital He’s running to the fridge to grab a coke before the next round of C.O.D. starts",
    "687": "@BrooklynNets @KesslerEdwards Deserved",
    "688": "@BrooklynNets @KesslerEdwards Congrats!!",
    "689": "@TheNBACentral @BrooklynNets @AhnFireDigital Lmao can’t wait for the next practice video later this summer!",
    "690": "@NETSCHIPSZN2022 @BlackMoses32 @TheNBACentral @BrooklynNets @AhnFireDigital When you make comments like this, it’s clear you don’t watch basketball and you only get knowledge from social media.",
    "691": "@NetsDaily @nypmetro This is not about the Brooklyn Nets, stop pushing your personal opinions. We come to your feed for Brooklyn Nets news and insight",
    "692": "Do it @BrooklynNets \n\nWalker KESSLER Edwards",
    "693": "@Ben4DPOY @TheNBACentral @BrooklynNets @AhnFireDigital Lmao it was only a matter of time y’all started to get excited from workout videos. He’s been posting this stuff his entire career.",
    "694": "@TheNBACentral @BrooklynNets @AhnFireDigital People see a different video of him shooting every offseason lol",
    "695": "The Brooklyn Nets signed forward Kessler Edwards to a two-year deal, which includes a team option for next season, league sources told @hoopshype. https://t.co/5iENif0KbO",
    "696": "@cmacisback16 @BrooklynNets Also, Aldridge is no2, so there’s that.",
    "697": "@cmacisback16 @BrooklynNets Wow. Ok. Durant, Simmons, Irwing, Griffin.",
    "698": "@KAscuasiati @NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital Harden is avg 21/7/10/1. That is better than 90% of the league 🤣",
    "699": "@Gaza_FrE5h @itzjxhnnn04 @NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital He was our freaking point guard man. Not a forward. He was our point god. A position he considers himself to be. And your point guard doesn’t shoot the damn ball? Your point guard can’t do a basic basketball move? Man y’all capping",
    "700": "@BrooklynNets Let’s go pacers",
    "701": "@BrooklynNets @KesslerEdwards Deserved https://t.co/4a9M4kg6bL",
    "702": "@Gaza_FrE5h @itzjxhnnn04 @NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital Well he was a first overall pick and dubbed “a generational talent” we didn’t need him to be Lebron we just need him to shoot man!!! he never developed. Maxey got better in one freaking year man",
    "703": "@aohughes @PaulReedWrld @BrooklynNets Bro I've been a Sixers fan for 19 years, watched every game of our 10-72 season, and was literally at the Sixers and Phillies games yesterday. You're most likely an Eagles fan who started watching the Sixers once they got good, just like the rest of our shitty fanbase",
    "704": "@Im_the_Badman @ishi_310 @NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital See now all those assists lose their efficiency when on every other possession he just throwing up bricks 🤷🏽‍♂️🤷🏽‍♂️… See rondo / Simmons knew they couldn’t shoot so they didn’t throw up 20 bricks a game with their 12+ assists !!! https://t.co/AmL9j0AfbL",
    "705": "The Brooklyn Nets signing Kessler Edwards to a standard NBA contract is a great news heading into the postseason . https://t.co/qXIMgM7jAY",
    "706": "@cmpsu_ @BrooklynNets So u the one",
    "707": "@Lele49777223 @jiajiaj43572446 @BrooklynNets @KesslerEdwards And + they play the bucks so…..",
    "708": "@BrooklynNets Nobody want dat shit",
    "709": "@Lele49777223 @jiajiaj43572446 @BrooklynNets @KesslerEdwards If we win we have 7th seed doesn’t matter if the cavs win/lose",
    "710": "@BrooklynNets @KesslerEdwards Deserved",
    "711": "@Tuneechiiiiiii @BrooklynNets @KesslerEdwards JJ is gone",
    "712": "@BrooklynNets @KesslerEdwards Congrats Kess, Well deserved 🥳",
    "713": "@BrooklynNets Yes sir",
    "714": "@Yb_HardenGoat @Mac71234692 @BrooklynNets @HSpecialSurgery Wdym he hasn’t missed",
    "715": "#Nets announce the team has signed have signed two-way forward Kessler Edwards to a standard NBA contract.\n\nEdwards was selected 44th overall in the 2021 NBA Draft—in 47 games for Brooklyn this season, Edwards has averaged 5.8 pts and 3.6 rebs in 20.2 mins per game…",
    "716": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "717": "Milwaukee and Boston both match up really well against the Nets. \n\nThe bigger benefit of the 3 seed would be if they played Chicago, not so much avoiding Brooklyn.",
    "718": "#Brooklyn #Nets: Earned his spot. ...\n \nhttps://t.co/OXgi1tRP9O\n \n#Atlantic #AtlanticDivision #BrooklynNets #BrooklynNets #EasternConference #EasternConferenceAtlantic #EasternConferenceAtlanticDivision #NBAAtlantic #NBAAtlanticDivision #NBAEastern #NBAEasternConference https://t.co/oGg4UcFVZX",
    "719": "@BrooklynNets @KesslerEdwards Much deserved",
    "720": "@BrooklynNets @TISSOT The final game of the regular season!🗣💪",
    "721": "@TheNBACentral @BrooklynNets @AhnFireDigital Bwahahaha nets fans never seen his off season workouts before apparently. Dude looks like a sniper when it’s not an actual game 🤦🏽‍♂️",
    "722": "@TheNBACentral @BrooklynNets @AhnFireDigital Not falling for this shit anymore",
    "723": "@BrooklynNets @KesslerEdwards Finally, the boy earned it!",
    "724": "@BrooklynNets @Grady @KesslerEdwards Well deserved Kess👊🏾",
    "725": "@itzjxhnnn04 @JonGottti89 @NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital That part😂😂😂 this team doesn’t need him to shoot kd and kyrie and others can for him so he can just be the best version of himself that got him to be an all star ⭐️ philly needed him to be lebron Lmfaoooo",
    "726": "@TheNBACentral @BrooklynNets @AhnFireDigital Traveling",
    "727": "@nocontextKD7 @BrooklynNets We’ve seen this before…",
    "728": "@TheNBACentral @BrooklynNets @AhnFireDigital Hahahahahahahahaha!!!! And now its Brooklyn's turn to be duped by videos of him in empty gyms being defended by coaches and beer league players.",
    "729": "@BrooklynNets @KesslerEdwards Congrats Kess!",
    "730": "@BrooklynNets @Grady @KesslerEdwards KESS EXPRESSS",
    "731": "@BrooklynNets @KesslerEdwards Absolutly deserved. Congrats @KesslerEdwards",
    "732": "@TheNBACentral @BrooklynNets @AhnFireDigital Same thing every year",
    "733": "Episode 3 Part 1 Interview with Aegon Hoops  \n\nThis all we talking about\n-Predicted Winning on Meralco-Ginebra\n-Thoughts on Converge in PBA Next Season \n-Brooklyn nets can win NBA this Season?\n-How he started in vlogger in youtube\nAnd etc\n\nhttps://t.co/4vlCZHQIXM",
    "734": "@im_tteu @BrooklynGuy2021 @BrooklynNets @KesslerEdwards Cam great but kess ceiling is higher",
    "735": "@BrooklynNets @KesslerEdwards Well deserved.",
    "736": "Last regular game of the season. It's Game Day!! Let's go @BrooklynNets #TeamHype https://t.co/uhse1o7U0K",
    "737": "@TheNBACentral @BrooklynNets @AhnFireDigital You know he has posted summer workouts of him draining 3’s since he entered the league right? Fools gold",
    "738": "@Ben4DPOY @TheNBACentral @BrooklynNets @AhnFireDigital You know he has posted summer workouts of him draining 3’s since he entered the league right?",
    "739": "Its official!!!! Congratulations  @KesslerEdwards Brooklyn Nets Mobile: Brooklyn Nets Sign Kessler Edwards https://t.co/keFxYIU7cp https://t.co/QQM0yImv5L",
    "740": "@BrooklynNets @KesslerEdwards Nash was giving him 3-5 minutes and playing JJ 30+ minutes. The next thing nets front office needs to do is to fire Nash.",
    "741": "@BrooklynNets Please pick me 🤞🤞🤞",
    "742": "@BrooklynNets @KesslerEdwards Congrats Kess!",
    "743": "@BrooklynNets When renew Ben Simmons’ contract next time, put in a clause stating he has to make jump shots during the game, not just practice 😂 🤣",
    "744": "@BrooklynNets @KesslerEdwards Yo me and the gang been watching you!! Congrats man you deserve it 🔥🔥🔥 love from Bama",
    "745": "@TheNBACentral @BrooklynNets @AhnFireDigital Pretty sure that he traveled....",
    "746": "@BrooklynNets @KesslerEdwards Deserved",
    "747": "@jiajiaj43572446 @BrooklynNets @KesslerEdwards If we win, if we lose cavs have to lose too.",
    "748": "@BrooklynNets @KesslerEdwards Congrats Kess! Very well deserved👏",
    "749": "@BrooklynNets Basically showed everyone in the highlights aren't playing",
    "750": "Today is one of those days where you just stick to your TV and watch @NBA all day\n\nKey match ups:\n\n@celtics/@memgrizz\n@Bucks / @cavs\n@sixers / @DetroitPistons\n@BrooklynNets / @Pacers\n@ATLHawks / @HoustonRockets\n@Lakers / @nuggets\n@warriors / @PelicansNBA\n@utahjazz / @trailblazers",
    "751": "@ManuelManny0 @Momo_Undefined @BrooklynNets @HSpecialSurgery All y’all got valid points but kd dropping 32 5,5 we can rest Steph today ☠️",
    "752": "@BrooklynNets @KesslerEdwards @IamJJ16 hold",
    "753": "@BrooklynNets @KesslerEdwards Our best rookie 🎉",
    "754": "@BrooklynNets @KesslerEdwards Congrats kess….earned and deserved",
    "755": "@TheNBACentral @BrooklynNets @AhnFireDigital This. This is the year. https://t.co/n429jxuO8W",
    "756": "@BrooklynNets @KesslerEdwards W now let's win the chip I believe we can do it Let's go NETS 😁",
    "757": "Brooklyn Nets sign Kessler Edwards, who had been on a two-way deal, to a standard NBA contract: https://t.co/II5QuE09bh",
    "758": "@Rainn_LoverBoy @BrooklynNets Curry is",
    "759": "Congrats to our former two-way player, @KesslerEdwards! The Brooklyn Nets have signed Kess to a standard NBA contract 📝 https://t.co/DF5XiPxtuz",
    "760": "@TheNBACentral @BrooklynNets @AhnFireDigital Travelled",
    "761": "@BrooklynNets @KesslerEdwards The day we've been waiting for. Congratulations, Kess!",
    "762": "@BrooklynNets @KesslerEdwards another W for sean marks",
    "763": "@BrooklynNets @KesslerEdwards huge W",
    "764": "@BrooklynNets @KesslerEdwards EARNED 💪💪",
    "765": "@BrooklynNets @KesslerEdwards Lets go",
    "766": "@BrooklynNets @KesslerEdwards Finals MVP 🔜",
    "767": "@BrooklynNets @KesslerEdwards LETSSSS GO!",
    "768": "Brooklyn Nets Sign Kessler Edwards - https://t.co/I1ZJ9MnwWh #Nets",
    "769": "Earned his spot. \n\nThe Nets have exercised the Standard NBA Contract Conversion Option on two-way forward @KesslerEdwards' contract.",
    "770": "@TheNBACentral @BrooklynNets @AhnFireDigital Now dribble and do it 😂😂😂",
    "771": "@ShenkKyle @PaulReedWrld @BrooklynNets You are a brooklyn fan now. Get that we out your mouth.",
    "772": "Consensus Line Move:\n2022-04-10 Indiana Pacers at Brooklyn Nets from 238.50 to 241.50\nOver Lets Go!\n#NBA #sport #python #lifestyle",
    "773": "@TheNBACentral @BrooklynNets @AhnFireDigital Not doing this. Just stop",
    "774": "@TheNBACentral @BrooklynNets @AhnFireDigital That’s a walk",
    "775": "@NETSCHIPSZN2022 @GamerDieXX @TheNBACentral @BrooklynNets @AhnFireDigital You really defending someone who was so lazy he got hurt by not playing/practicing lol",
    "776": "@JeriTsaiNets @BrooklynNets @HSpecialSurgery That’s Nash pick. He’ll definitely be back",
    "777": "@Pat_brownie @ishi_310 @NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital Man I’m a Celts fan and even I can see Hardens changing his game to help the team, since his offense has regressed. M just hurt he gave up on his squad, but most of those assists were for you so.. https://t.co/GyYgupT89v",
    "778": "@NETSCHIPSZN2022 @GamerDieXX @TheNBACentral @BrooklynNets @AhnFireDigital 14.7% from 3 &amp; 56% from the ft is someone who can shoot? Harden must be a sniper then",
    "779": "@flatbushfinest3 @HardenFinalsMVP @TheNBACentral @BrooklynNets @AhnFireDigital Just worry about making it out of the play in first buddy 😂",
    "780": "@NETSCHIPSZN2022 @jjtsports25 @TheNBACentral @BrooklynNets @AhnFireDigital You think that until he cannot space the floor, he doesn’t cut to the basket, and he is a horrible ft shooter. Hack-a-ben aint going anywhere lol",
    "781": "@shoelessjp @BrooklynNets We don't care we just want Ben to play ball and have fun. KD and Kyrie will worry about shooting jumpers.",
    "782": "@TheNBACentral @BrooklynNets @AhnFireDigital Every year",
    "783": "@SLAMonline @BrooklynNets Dirk Nowitzki Scorer.. K.D learning to get Open and shoot.. one leg in traffic.",
    "784": "Check out Brooklyn Nets vs. Indiana Pacers at Barclays Center in Brooklyn today at 3:30PM.\n\n@BrooklynNets #Nets #NewYorkCity\nhttps://t.co/uNiN8nfRSj",
    "785": "@xyqar @BrooklynNets @TISSOT It's Sunday",
    "786": "@BrooklynNets Kai is Ridiculous ❤\nAm in Africa how can I get mine 😎",
    "787": "@BrooklynNets @TISSOT Let's go nets!",
    "788": "@BrooklynNets @TISSOT why so early",
    "789": "@BrooklynNets Bro I need this so bad.",
    "790": "@BrooklynNets @TISSOT let’s go Nets",
    "791": "🔜 Sunday matinee in Brooklyn \n\n@TISSOT https://t.co/wQuBFhjXRp",
    "792": "@ladderboy_29 @TheNBACentral @BrooklynNets @AhnFireDigital That’s what I was thinking 🤣 So basically he’s only learned how to walk with the ball since leaving Philly 🤷🏾‍♂️",
    "793": "@flatbushfinest3 @HardenFinalsMVP @TheNBACentral @BrooklynNets @AhnFireDigital We don’t need him to score 30 a game and he knows it. He’s running the offense. Obviously you don’t watch basketball",
    "794": "@BrooklynNets Kyrie's my favorite so I'm hoping this giveaway hasn't ended yet.",
    "795": "Brooklyn Beckham net worth: David Beckham's son marries billionaire's daughter https://t.co/NtwxalpvHf #SmartNews\ni hope u kno your bullshit w me is why im targeting palm beaches destruction. particularly if i split.\nim taking everything and throwing it in the ocean",
    "796": "WAKE UP!!! The Brooklyn Nets look to clinch the 7th seed in the play-in tournament TODAY https://t.co/7GpnGZg3Z2",
    "797": "@TheNBACentral @BrooklynNets @AhnFireDigital He walked .",
    "798": "@Momo_Undefined @BrooklynNets @HSpecialSurgery Definitely need him but we need him to be healthy cuz that ankle is bothering him",
    "799": "@KAscuasiati @HardenFinalsMVP @TheNBACentral @BrooklynNets @AhnFireDigital Where did you get this exclusive information from? 🤦🏻‍♂️😂",
    "800": "Game 1 - Brooklyn Nets vs. Indiana Pacers\nSpread: BKN -16.5\n\nInjuries:\n- Hawks - \nOut: John Collins,\nDoubtful: Lou Williams\nProbable: Bogdan Bogdanovic\n- Rockets -\nOut: John Wall, Eric Gordon, Christian Wood, Dennis Schroder, \nQuestionable: Jalen Green",
    "801": "@BrooklynNets Kd should play less than 28 minutes",
    "802": "@BrooklynNets Hopefully with a W to keep that 7th seed!",
    "803": "@BrooklynNets @HSpecialSurgery Rest Seth",
    "804": "@ManuelManny0 @BrooklynNets @HSpecialSurgery Nope , Need Seth!",
    "805": "@BrooklynNets Big deal",
    "806": "@BrooklynNets @HSpecialSurgery rest seth",
    "807": "@aohughes @PaulReedWrld @BrooklynNets 0 turnovers doesnt sound that bad to me. you're also forgetting that we gave up Seth and Drummond, both of which we needed if we wanted a chance to make a deep playoff run",
    "808": "@AngelusHector @BrooklynNets @HSpecialSurgery last time i checked he is",
    "809": "@Yb_HardenGoat @BrooklynNets @HSpecialSurgery Hasn’t taken one",
    "810": "@BrooklynNets It’s my birthday!!!",
    "811": "@TheNBACentral @BrooklynNets @AhnFireDigital That’s a 5 step travel 😂",
    "812": "@Ben4DPOY @TheNBACentral @BrooklynNets @AhnFireDigital hilarious he stilll can’t shoot and won’t also has zero touch at the rim basically can only defend at a high level and run out in transition (doesn’t matter in playoffs) also can’t shoot free throws",
    "813": "@ItBegins2012 @JeriTsaiNets @BrooklynNets @HSpecialSurgery Hopefully it’s more day to day than week to week..",
    "814": "@TheNBACentral @BrooklynNets @AhnFireDigital Ben Simmons catfishing the world once again by making uncontested jumpers",
    "815": "The Pacers (25-56) play their final game of the season Sunday, April 10 at the Brooklyn Nets (43-38).\nhttps://t.co/Ru1HnOGX00",
    "816": "@Yb_HardenGoat @BrooklynNets @HSpecialSurgery Hasn’t missed a shot this season",
    "817": "@BrooklynNets @HSpecialSurgery We should rest Seth since it’s just the pacers",
    "818": "@NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital ben is a joke",
    "819": "@BrooklynNets @HSpecialSurgery Nets management needs to all be fired. Why in the world would you ever sign Ben? He’s not a basketball player anymore.",
    "820": "@JeriTsaiNets @BrooklynNets @HSpecialSurgery We haven’t even started the ramp up phase yet",
    "821": "@BrooklynNets @HSpecialSurgery Rest curry",
    "822": "@TheNBACentral @BrooklynNets @AhnFireDigital Dude loves making practice videos, if that was a real game he would of started to cry and then pass it",
    "823": "@BrooklynNets @HSpecialSurgery Sometimes I just forget Ben Simmons is on the nets",
    "824": "@BrooklynNets @HSpecialSurgery Goran Dragic returning to the nets or nah?",
    "825": "@Yb_HardenGoat @BrooklynNets @HSpecialSurgery How’s harfatass going?",
    "826": "@BrooklynNets Biggest game of the season",
    "827": "@BrooklynNets @DeemedAsPrince @KDTrey5 @BenSimmons25 @24_camthomas @BruceBrown11 Get used to seeing Ben on the injured list. He has no intention of playing again. Lol.",
    "828": "@ShenkKyle @PaulReedWrld @BrooklynNets Bro, Ben has 0 turnovers and 0 made shots this year. Not the right time to talk shit.",
    "829": "@BrooklynNets @DeemedAsPrince @Patty_Mills @BenSimmons25 Patty mills is lying. Ben is avoiding playing. The entire league knows it by now. Ben wants to get paid 30 million a year to post social media of his shooting at practice. Ben never posts videos of game action because he is scared of the pressure of winning. Ben is a wuss.",
    "830": "@BrooklynNets Let's go Nets. We need Kyrie to help KD well. https://t.co/0haHu2aKxQ",
    "831": "@BrooklynNets @HSpecialSurgery Come on Ben 😔😔😔😔",
    "832": "@TheNBACentral @BrooklynNets @AhnFireDigital 🧢 same old BS",
    "833": "@BrooklynNets End on a win #NetsWorld",
    "834": "Brooklyn Beckham net worth: David Beckham’s son marries billionaire’s daughter https://t.co/c8ix0dLPq6",
    "835": "Nets @HSpecialSurgery Status Report for today's game vs. Indiana https://t.co/qI4LqpMhQM",
    "836": "@TheNBACentral @BrooklynNets @AhnFireDigital 4 steps and it rattles around the rim on a open practice shot? 🤦‍♂️😅",
    "837": "@TheNBACentral @BrooklynNets @AhnFireDigital Traveling violation",
    "838": "@BrooklynNets Blowout W plz",
    "839": "@BrooklynNets Let’s go nets",
    "840": "@BrooklynNets see you there #NetsWorld",
    "841": "@BrooklynNets You are finished",
    "842": "@BrooklynNets LETS GET ITTT",
    "843": "Wrapping up the regular season at home! https://t.co/lbky1k3c6D",
    "844": "🔴LIVE ~ Indiana Pacers vs. Brooklyn Nets - NBA League Pass\n🔴Watch Now➠ https://t.co/aXxYcemFJc\n📅 : Sunday, April 10, 2022\n⏰ : 3:30 PM",
    "845": "🔴LIVE ~ Indiana Pacers vs. Brooklyn Nets - NBA League 2022\n🔴Live Here➠ https://t.co/mVPOqMiLar\n📅 : Sunday, April 10, 2022\n⏰ : 3:30 PM",
    "846": "@tanweiyong1511 the brooklyn nets of ucl",
    "847": "@espn @NBA yall really televised the @BrooklynNets game over the @Bucks game?! 🤣🤣",
    "848": "@BrooklynNets Omg the look scary",
    "849": "@Ben4DPOY @TheNBACentral @BrooklynNets @AhnFireDigital This y’all problem the man always could shoot HE WAS JUST FUCKING SCARED",
    "850": "@igorcavalari @miticojovem brooklyn nets",
    "851": "@JonGottti89 @NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital Lol when did I say ur mad, but ofc u wanna keep up on his updates awww🥹",
    "852": "Brooklyn Beckham net worth: David Beckham's son marries billionaire's daughter https://t.co/s3L0y2hcqg",
    "853": "@TheNBACentral @BrooklynNets @AhnFireDigital Already seen this video for three offseasons in a row. https://t.co/zUsZJh9qbH",
    "854": "@BrooklynNets *rattles in a wide open  12 footer in practice* I’m back baby !!",
    "855": "@NETSCHIPSZN2022 @BlackMoses32 @TheNBACentral @BrooklynNets @AhnFireDigital Ben is sitting around on defense all year.",
    "856": "@TheNBACentral @BrooklynNets @AhnFireDigital 👀👀 and professional basketball player shot a basketball and made it into the hoop?!?! You don’t say. Show me the previous 10",
    "857": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "858": "@TheNBACentral @BrooklynNets @AhnFireDigital If I have learned something watching basketball over the years is that even those players that cannot shoot in game conditions, seem like they can shoot in practice.",
    "859": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "860": "Brooklyn Beckham net worth: David Beckham's son marries billionaire's daughter\n\n#BrooklynBeckham\n#NicolaPeltz\n\nhttps://t.co/MuD2MBZusx https://t.co/1N5yZBRd8b",
    "861": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel @tonyfromhouston",
    "862": "Brooklyn Nets -15.5\n\nNets still fighting for play in seeding. Rested I think they go off today. Line functionality working in their favor. Pacers have nothing but pride to play for, and on a B2B. Motivated Nets team is what I’m seeing here. 20+ point win #NetsWorld \n\n#NBA75",
    "863": "Let’s go @BrooklynNets 🤙\n#loserclub https://t.co/eG9nRrQ55e",
    "864": "Here’s all you need to know ahead of the Brooklyn Nets’ regular-season finale against the Pacers.  https://t.co/WmQTzNQB5w",
    "865": "@TheNBACentral @BrooklynNets @AhnFireDigital He traveled",
    "866": "@itzjxhnnn04 @NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital “Love boy” you think I’m mad Simmons is gone? 🤣🤣🤣🤣🤣 https://t.co/9urkFIDQDd",
    "867": "@BrooklynNets Beautiful win ! Now let’s close it out! Salute Big Dog style",
    "868": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "869": "🚨 Line Change 🚨\n\nIndiana Pacers @ Brooklyn Nets\nSun 3:40 PM EST\n\nFrom:\nBKN -15.5 -110\n\nTo:\nBKN -16.5 -110",
    "870": "@BrooklynNets Ben Simmons can’t guard KD",
    "871": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "872": "@BrooklynNets Casual fans just don’t get it. Ben will bring elite level passing and defense from a guy that’s Giannis size. He can score zero ppg and will have a huge impact on the team on both ends. Wait til we start playing inside out with Ben with all those shooters around him..",
    "873": "Today's NBA action: \n\nIndiana Pacers @ Brooklyn Nets today at 3:30pm ET on ESPN. \n\nBoston Celtics @ Memphis Grizzlies tonight at 7pm ET on TNT. \n\nGolden State Warriors @ New Orleans Pelicans tonight at 9:30pm ET on TNT. https://t.co/A723qgAP6m",
    "874": "@Tayx2times @BrooklynNets It's a lot at stake here so i see why nash had him benched.  he has plenty of time and opportunities to prove himself. It doesn't start on the game floor but he might play today",
    "875": "@TheNBACentral @BrooklynNets @AhnFireDigital He’s always been able to shoot wide open shots in practice tho??? Plus.. it’s pretty standard I hope for a fucking nba player",
    "876": "| ￣￣￣￣￣￣￣￣￣￣￣￣|\n|   Brooklyn Nets will be Nba🏆 \n                2022 Champions \n|＿＿＿＿＿＿＿＿＿＿＿＿|\n                    \\ (•◡•) / \n                      \\      / \n                       ——\n                       |     |\n                       |_   |_",
    "877": "@NetsKingdomAJ @BrooklynNets Brooklyn rules New York",
    "878": "@BrooklynNets Brooklyn Nets rules New York",
    "879": "@BrooklynNets ei, whats the music used on this clip?",
    "880": "@TheNBACentral @BrooklynNets @AhnFireDigital There’s always next year #crybaby",
    "881": "Shame on the @BrooklynNets media manager for posting those Ben10 clips. You knew we couldn’t handle it",
    "882": "@TheNBACentral @BrooklynNets @AhnFireDigital NIGGA PLAY",
    "883": "@TheNBACentral @BrooklynNets @AhnFireDigital That's a travel playa 🤣🤣🤣",
    "884": "@TheNBACentral @BrooklynNets @AhnFireDigital But is he gone shoot in a game tho 😂😂😂 https://t.co/T8Bqk6smiG",
    "885": "@TheNBACentral @BrooklynNets @AhnFireDigital Don’t start this again",
    "886": "@Kkizz_ @TheNBACentral @BrooklynNets @AhnFireDigital One of my favourite players but he always does this 🤣",
    "887": "Sun, 10th Apr: #BrooklynNets vs #IndianaPacers - ODD @ 1.97\nMore details on: https://t.co/49m1my3WHz\n#baskettips #basketprediction #basketballbets #nba #usabasket",
    "888": "@daniok7_ @KD_SZN7 @BrooklynNets Nice try all-star love was there, imagine having an all-star and still being on the only team KD SWEPT in the finals 😹😹😹😹😹😹",
    "889": "All white jerseys today @BrooklynNets 🙏🏾",
    "890": "@daniok7_ @KD_SZN7 @BrooklynNets That dogshit can't even make the play ins with the most stacked superteam in sports history don't even disrespect the GOAT SF by mentioning his name with that bum 😹😹😹😹😹 https://t.co/GAqlC8tw2d",
    "891": "@BrooklynNets I’ve watched this vid a million times now https://t.co/50QBfDo3Y5",
    "892": "@daniok7_ @KD_SZN7 @BrooklynNets Why did you put KD's head on L3-6ronze's body? 🤭",
    "893": "@shoelessjp @BrooklynNets 6ers fans,  I'm begging you go worry about Jimmy Soften and Glenn Anton Rivers.",
    "894": "@Gymrat197 @NetsKingdomAJ @BrooklynNets Worry about Jimmy Soften,  phillybitch.",
    "895": "@TheNBACentral @BrooklynNets @AhnFireDigital Do it in a game Ben",
    "896": "@HardenFinalsMVP @TheNBACentral @BrooklynNets @AhnFireDigital Probably harden just hide behind embiid this playoffs xdxd",
    "897": "@TheNBACentral @BrooklynNets @AhnFireDigital Man we see this shit every year",
    "898": "@BrooklynNets Can somebody in here tell me why would the stupid nets pick up Simmons when they knew he was injured what a joke",
    "899": "3 of 3\n\nNOTE:  We do NOT believe the @bucks fear a first round matchup with either @ATLHawks or @BrooklynNets – the two squads that have the best chance of claiming the @NBA Eastern Conference seventh seed.\n\nCC:  @jphanned\nCC:  @Underdog__NBA",
    "900": "@JasonWi36091891 @BrooklynNets Thank you bro",
    "901": "@BrooklynNets Aint his back suppose to be hurting tho https://t.co/5LpVDTPcJi",
    "902": "@shoelessjp @BrooklynNets Wouldn’t say that, i know his had troubles with his game but playing with KD/Ky is different man. He is never going to get that pressure as the second guy, his the third guy on this team and apparently we need his defense and play making which is his trade.",
    "903": "@TheNBACentral @BrooklynNets @AhnFireDigital Scary Hours 👀",
    "904": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel !",
    "905": "@BrooklynNets But Durant's a bully 😂😂😂 Cam can't stop him 😂",
    "906": "@BrooklynNets Ben, nba finals game7, short clock 1.2....hit a jumper and it goes in net win 122-118",
    "907": "@TheNBACentral @BrooklynNets @AhnFireDigital He been doing this but never when its game time tho",
    "908": "@phillydrilz @SiakamFan @TheNBACentral @BrooklynNets @AhnFireDigital He's 12 or something LMAO",
    "909": "@iamBandanaJr Bingwa, Phoenix Suns au Brooklyn Nets",
    "910": "@TheNBACentral @BrooklynNets @AhnFireDigital He ain’t doing this in the actual game. We’ve seen so many vids like this and he still sucks",
    "911": "NBA Basketball Game Betting Picks Simulator: 3:30 PM ET - Indiana Pacers vs. Brooklyn Nets - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/Ks7NhUAktp #nba #sportsbetting #freepicks #cappertek",
    "912": "@BrooklynNets 🙏🏼🙏🏼 nets all day",
    "913": "@BrooklynNets I can’t stop watching Ben Simmons",
    "914": "@Presidentismo @JacquesD10_ @AleFacciaa @BrooklynNets hornets life",
    "915": "@mariuscojocaruu @AleFacciaa @BrooklynNets hahah",
    "916": "@AleFacciaa @JacquesD10_ @BrooklynNets quindi brooklyn on milan off",
    "917": "@flatbushfinest3 @HardenFinalsMVP @TheNBACentral @BrooklynNets @AhnFireDigital Yeah but which one has been on the court",
    "918": "DO NOT EMBARRASS ME TODAY. @BrooklynNets",
    "919": "KEVIN DURANT Rookie RARE 2007 SI for Kids Card Texas Brooklyn Nets NBA #147 - https://t.co/W1oIKE0haG\n\n#lebron #lebronjames #lakers #nba \nhttps://t.co/zyWE5AnwXf",
    "920": "FREE #livestream here👉https://t.co/2c6Ltz5wlw 😉\n——\nApr.10, Sun.\n🏀#NBA ‼️\n1.Brooklyn Nets Vs Indiana Pacers\n2.Houston Rockets Vs Atlanta Hawks\n3.Charlotte Hornets Vs Washington Wizards\n4.Cleveland Cavaliers Vs Milwaukee Bucks\n5. New York Knicks Vs Toronto Raptors",
    "921": "@TheNBACentral @BrooklynNets @AhnFireDigital We see these videos every year. He’s not gonna shoot those in a game ever. 🤦‍♂️🤷‍♂️",
    "922": "@mwanamooze @BrooklynNets He'll never shoot 70% from the line, he doesn't care about getting better (and never has). I did these same mental gymnastics for years. Please don't make the same mistake I did. Ben just doesn't care about improving.",
    "923": "@BklynNetBlock @BrooklynNets Told myself this for years, kept making excuse after excuse for Ben, telling myself I thought he was better playing to his strengths... he just doesn't care about basketball, man. He doesn't care about getting better. I was doing these very same mental gymnastics for years.",
    "924": "@shoelessjp @BrooklynNets Don’t need his shooting per se. Just need his defense and ball movement abilities. He does both very well and occasional shooting is just icing on the cake",
    "925": "@BrooklynNets Well done guys! You’ve got how many no1 picks playing for you now? 4? Sure that’s enough?",
    "926": "@bleedgreen1981 @BlackMoses32 @NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital He hasn’t had the chance to be upset with Simmons yet he’s just spiteful about James Haden. Projecting anger into some argument as if we all haven’t been watching Ben play at the exact same level, for years.",
    "927": "@TheNBACentral @BrooklynNets @AhnFireDigital What a joke!!! https://t.co/OUKqTfFQn3",
    "928": "@TheNBACentral @BrooklynNets @AhnFireDigital Wow a professional nba player can shoot. Amazing",
    "929": "@BrooklynNets Aldridge defense is wack",
    "930": "@FakeMAGAcover @ps9teacher @RexRyanBurnerNY @SeanGrandePBP 5-6 games yo beat Brooklyn your team struggling against nets in playoffs 🤣🤣🤣 https://t.co/jwumQ4KsFH",
    "931": "🏀NBA🏀 #NBA \n🏀Saison régulière🏀\n\nBrooklyn Nets - Indiana Pacers\nCharlotte Hornets - Washington Wizards\nCleveland Cavaliers - Milwaukee Bucks\nDallas Mavericks - San Antonio Spurs\nDenver Nuggets - Los Angeles Lakers\nHouston Rockets- Atlanta Hawks",
    "932": "@NBA @KDTrey5 @BrooklynNets If the Nets get far in the playoffs, good teams will start losing on purpose and playin just so they can rest players through the regular season. \n\nHome court advantage may not be as beneficial anymore.",
    "933": "@TheNBACentral @BrooklynNets @AhnFireDigital wow，ben Simons canshoot😂",
    "934": "@shoelessjp @BrooklynNets If he can shoot more than 70% on foul line plus his all nba defense his good to go. Free throws are the most important thing in his game, no body wants him shooting every time. Most important rn is to get back on court coz Nets want him so bad.",
    "935": "Kyrie Irving, Pemain #NBA Muslim Ternama Amerika Berbuka Puasa di Sela Pertandingan Brooklyn Nets Vs Atlatna Hawks.\n- - - - \nMuslim American #basketball player eats Iftar on the bench at an NBA game. https://t.co/nHdrt8OswD",
    "936": "A new Brooklyn Nets team practice video has sparked rumors of Ben Simmons possibly nearing his return.\nhttps://t.co/yNOuHG07Z3",
    "937": "@TheNBACentral @BrooklynNets @AhnFireDigital My nan can do that alone on the practice arena 🙄",
    "938": "@mwanamooze @BrooklynNets I thought the same thing for a long time, but I was wrong. If Ben is ever going to be better than a \"good\" player he needs to develop a jumpshot (not even mentioning his playoffs in the half-court game). And he won't, because he's stubborn and doesn't want to work on his game.",
    "939": "@PatriotsKid @PatriotsKid #giannis  ring don't have high value either because if the Brooklyn nets were healthy in that playoffs he wouldn't have one 💁",
    "940": "@Dloaded07 @BrooklynNets Yeah not really.",
    "941": "@TheNBACentral @BrooklynNets @AhnFireDigital Drop this facade man",
    "942": "@TheNBACentral @BrooklynNets @AhnFireDigital He traveled",
    "943": "@BrooklynNets JB is KAI biggest fan in the flat world 👌",
    "944": "Top story: ShowBiz @BrooklynNets: 'Working on the weekend. ' https://t.co/q5coymO0M8, see more https://t.co/2QM4gOArNM",
    "945": "@TheHoopCentral get ready @BrooklynNets he does this shit every off season then won’t do any of them move in game 😂🤦🏿‍♂️",
    "946": "@TheNBACentral @BrooklynNets @AhnFireDigital Deep down y’all hearts pumping so fast, y’all know him getting into the lineup is dam scary for every opposing team.",
    "947": "@BrooklynNets Please",
    "948": "Outerstuff Youth Brooklyn Nets Pajama Pant Boys Sleep Bottoms\nhttps://t.co/2K5UQk3Vip",
    "949": "@TheNBACentral @BrooklynNets @AhnFireDigital Omg he made a jumper vs air he is just too good",
    "950": "@TheNBACentral @BrooklynNets @AhnFireDigital Seen this before",
    "951": "@TheNBACentral @BrooklynNets @AhnFireDigital Did he even dribble",
    "952": "@TheNBACentral @BrooklynNets @AhnFireDigital So whats the big deal? The traveling in practice ? 😀",
    "953": "@BrooklynNets Show some love to your UK fans 💪🏽 #NetsWorld",
    "954": "@TheNBACentral @BrooklynNets @AhnFireDigital It’s amazing how this fraud Ben Simmons can do this with a mysterious back injury but can’t seem to get play a actual NBA game. https://t.co/RtJR8tDSmf",
    "955": "@TheNBACentral @BrooklynNets @AhnFireDigital @TheTurin27 you like yeah",
    "956": "@TheNBACentral @BrooklynNets @AhnFireDigital Not this again",
    "957": "@BrooklynNets Blake &amp; Ben: Go to football schools for college, get drafted #1, miss rookie year, wreck nba following year, play for Doc, get blamed for team’s playoff failures, get shipped off",
    "958": "@shoelessjp @BrooklynNets We don’t need his shooting.",
    "959": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel first clip smh lol",
    "960": "@BrooklynNets Playoff vibes!",
    "961": "@TheNBACentral @BrooklynNets @AhnFireDigital I hope he can shoot without travelling when the game starts.",
    "962": "@TheNBACentral @BrooklynNets @AhnFireDigital Fake",
    "963": "@TheNBACentral @BrooklynNets @AhnFireDigital Why’d y’all tweet this?",
    "964": "@BrooklynNets Where is uncle drew",
    "965": "Since the Lakers and the Knicks are out of the playoffs I will be rooting for the Brooklyn Nets until the end of june",
    "966": "@BrooklynNets KD said that so that Bruce push more...",
    "967": "@BrooklynNets I can tell from Australia that Ben is a right handed shooter- what is he even doing??",
    "968": "Brooklyn vs Phoenix. Nets in 6.",
    "969": "Check out 2021-22 Panini Sticker &amp; Card Collection Keven Durant Card #1 Brooklyn Nets https://t.co/T8ehNd5KJG #eBay via @eBay",
    "970": "@TheNBACentral @BrooklynNets @AhnFireDigital Travelling meme",
    "971": "@4PFnerry @FanMahome @BrooklynNets I see that you “1st round exit” people often. Is this a hobby of yours?",
    "972": "@ishi_310 @NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital Uhhh been a horrible on offense efficiency wise … can’t make a 3 or get by a legit defender /.. Sixers better pray they don’t get Raptors 1st round cause if they do Raptors in 5 !!!",
    "973": "@TheNBACentral @BrooklynNets @AhnFireDigital The admin is easily amazed at everything",
    "974": "@BrooklynNets that's tight",
    "975": "@BrooklynNets Ben Simmons 👀",
    "976": "@BrooklynNets Man I want this championship ring so bad it's not even funny",
    "977": "@TheNBACentral @BrooklynNets @AhnFireDigital Stop with the videos man",
    "978": "@TheNBACentral @BrooklynNets @AhnFireDigital Dude can’t play, but he has time to shoot threes he will never take in a game…",
    "979": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "980": "@TheNBACentral @BrooklynNets @AhnFireDigital Lol hits a wide open practice 3 going 75% speed wow amazing",
    "981": "@BrooklynNets @JfromBk tell me he’s coming back soon please 👀",
    "982": "@TheNBACentral @BrooklynNets @AhnFireDigital Stop.",
    "983": "@TheNBACentral @BrooklynNets @AhnFireDigital Ben Simmons workouts don't equal Ben Simmons NBA in-game tendencies! Don't be fooled. Wait and see.",
    "984": "@ikiknotme Inchallah my gloryhunting better be good after i got busted with Brooklyn nets last yr...",
    "985": "@TheNBACentral @BrooklynNets @AhnFireDigital He try to fooled us again &amp; again",
    "986": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel 😂😂😂😂",
    "987": "@TheNBACentral @BrooklynNets @AhnFireDigital That literally looks like most people at the local YMCA…",
    "988": "@TheNBACentral @BrooklynNets @AhnFireDigital These videos mean NOTHING",
    "989": "@BrooklynNets kd dont fucking mess aroundd",
    "990": "@TheNBACentral @BrooklynNets @AhnFireDigital Aint never seen anybody miss in the highlights before.",
    "991": "@BrooklynNets Nets fans, I'm begging you: don't fall for the gym shooting videos from Ben Simmons. I'm a Sixers fan, we suffered through years of this. Just accept that he's never going to shoot outside of right around the basket, it's better for your mental health that way.",
    "992": "@BrooklynNets ben simmons always belonged in nets :)",
    "993": "@TheNBACentral @BrooklynNets @AhnFireDigital NBA  players  are amongst  the spoilest, riches young ppl in 🇺🇸",
    "994": "@TheNBACentral @BrooklynNets @AhnFireDigital The rest of the video: https://t.co/Wo4TnJYDco",
    "995": "@TheNBACentral @BrooklynNets @AhnFireDigital He won’t be ready for the first round",
    "996": "@TheNBACentral @BrooklynNets @AhnFireDigital lol we still taking ben simmons practice serious in 2022???",
    "997": "@BrooklynNets i like it but I'm in China how can i get it",
    "998": "@Ithanhudsonn1 @BrooklynNets how can i get it I'm in China",
    "999": "@TheNBACentral @BrooklynNets @AhnFireDigital also hella travel lol",
    "1000": "avoid Brooklyn? Nets cooked https://t.co/8RRPrTQD2r",
    "1001": "@TheNBACentral @BrooklynNets @AhnFireDigital We've seen this movie before",
    "1002": "@daniok7_ @KD_SZN7 @BrooklynNets How are you as a LeBron fan going to say KD’s rings don’t count because he has a superteam",
    "1003": "@TheNBACentral @BrooklynNets @AhnFireDigital How are we gonna let Ben get away with a 5 step pull up ... cringe",
    "1004": "Top story: @BrooklynNets: 'Working on the weekend. ' https://t.co/Kxs4bUA0Kn, see more https://t.co/zzBv2oN2Nv",
    "1005": "@BrooklynNets Brooklyn Mayor let Kyrie play… its now Brooklyn Nets organization let Ben play in the playoffs!!! 😠",
    "1006": "@TheNBACentral @BrooklynNets @AhnFireDigital Really..",
    "1007": "@TheNBACentral @BrooklynNets @AhnFireDigital This is one three pointer. Are you joking?",
    "1008": "@TheHoopCentral If my Sixers just so happen to meet the Brooklyn Nets in the Playoffs, I hope we beat the brakes off y'all.",
    "1009": "@TheNBACentral @BrooklynNets @AhnFireDigital I’ll bet ANYONE $20 that he’ll never shoot that in a game.",
    "1010": "@BGWill265 @TheNBACentral @BrooklynNets @AhnFireDigital They took this video 20 times",
    "1011": "@TheNBACentral @BrooklynNets @AhnFireDigital That shit still broke lol stop it",
    "1012": "@TheNBACentral @BrooklynNets @AhnFireDigital He is working with Kyle Korver last time I heard",
    "1013": "@ramirtorres1 @TheNBACentral @BrooklynNets @AhnFireDigital Harden is basically invisible😭",
    "1014": "If the @ATLHawks, @cavs, and the @BrooklynNets all lose tomorrow, and the @hornets win, what will the East play-in seeding look like?? It's an impossible math problem! @BillSimmons\n@TheAthleticNBA #NBAPlayoffs2022",
    "1015": "@BrooklynNets lets go ben",
    "1016": "@chase19136 @TheNBACentral @BrooklynNets @AhnFireDigital These Sixers fans will find out lol",
    "1017": "@daniok7_ @KD_SZN7 @BrooklynNets Nigga you a LeBron fan you can’t be serious 🤣",
    "1018": "@NBA The Brooklyn Nets are gonna been relocate Back in New Jersey when the future NBA Champions sweep them in the first round. https://t.co/1W0angqOOG",
    "1019": "@NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital These Nets fans will find out lol",
    "1020": "@itzjxhnnn04 @JonGottti89 @NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital He’s not playing the rest of the year they already said it",
    "1021": "@NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital Still better then the zero games Ben has played and I have a sneaky suspicion he will weasel his way out of playing for the Nets..because that’s what he is a weasel..you will find out soon enough.",
    "1022": "@Vizzy_rayven Can’t find Brooklyn Nets Handicap 11+ I’m seeing only -11",
    "1023": "@BrooklynNets I love Kai, his my favourite player",
    "1024": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1025": "@TheNBACentral @BrooklynNets @AhnFireDigital Elbow out",
    "1026": "@BrooklynNets Kd shot that too easy 🤣",
    "1027": "@TheNBACentral @BrooklynNets @AhnFireDigital Y’all really pushin that narrative again lol",
    "1028": "@BrooklynNets Sixers fans have seen dozens of these... Have fun!",
    "1029": "The @BrooklynNets got fleeced lmao https://t.co/ZtT7CLdwh8",
    "1030": "@GamerDieXX @BlackMoses32 @TheNBACentral @BrooklynNets @AhnFireDigital And Ben Simmons can shoot",
    "1031": "@TheNBACentral @BrooklynNets @AhnFireDigital Traveling?🤔",
    "1032": "@Ben4DPOY @TheNBACentral @BrooklynNets @AhnFireDigital ur also forgetting the 20 other videos of him hitting 3's in the gym 🤡🤡🤡",
    "1033": "@TheNBACentral @BrooklynNets @AhnFireDigital Yay a jump shot. Ok back to carrying on with my life.",
    "1034": "@TheNBACentral @BrooklynNets @AhnFireDigital This is bait.",
    "1035": "@BrooklynNets Like usual",
    "1036": "@jaegerist2022 if milwaukee plays brooklyn, what percent do you give the nets of winning? I'd say 25-35%",
    "1037": "#BrooklynNets NFT Ape just dropped! \n\nListed for .08 each. If one person buys them both then they can get the alternate jersey ape for free! \n\nHome: https://t.co/mKydXJs3b0\n\nAway: https://t.co/F9mVZ7eNiz https://t.co/wet9LGdptt",
    "1038": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1039": "@TheNBACentral @BrooklynNets @AhnFireDigital A Ben Simmons workout in a gym video? Remember when he faked mental Illness?",
    "1040": "@BrooklynNetcast Just play a F****ng game bro I mean Nets could have win more games that they have since you arrive in Brooklyn I don’t care if you don’t score at all in the game the team needs that tight defense and passing to the shooters 🙏",
    "1041": "@TheNBACentral @BrooklynNets @AhnFireDigital Looks like he traveled 😂",
    "1042": "It’s April 10 and I have no idea what the Brooklyn Nets are. We’ll be finding out the answers over the next two weeks",
    "1043": "@alexjmartes1 @TheNBACentral @BrooklynNets @AhnFireDigital Bros running like it hurts😭😭",
    "1044": "@TheNBACentral @BrooklynNets @AhnFireDigital Play a game.",
    "1045": "@TheNBACentral @BrooklynNets @AhnFireDigital Ben's practice video, familiar.",
    "1046": "@TheNBACentral @BrooklynNets @AhnFireDigital You can’t be serious with this post…",
    "1047": "@TheNBACentral @BrooklynNets @AhnFireDigital Instill this man with confidence KD.  Y’all would be nasty",
    "1048": "@TheNBACentral @BrooklynNets @AhnFireDigital A single three pointer made - someday, maybe someday soon, you can say that about Ben Simmons' career playoff totals. But not this day.",
    "1049": "@BrooklynNets If Ben is making a comeback for the playoffs, he should be guarding KD nonstop pretend he’s Giannis to be fully prepared!",
    "1050": "On this day in sports history April 10, Miami Heat Shooting Guard Dwyane Wade played in his final career NBA game, recording 25 Points, 11 Rebounds, and 10 Assists against the Brooklyn Nets in 2019.",
    "1051": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1052": "@TheNBACentral @BrooklynNets @AhnFireDigital well that's because he didn't have Tre Young in between",
    "1053": "@TheNBACentral @BrooklynNets @AhnFireDigital lol yeah lets see it in a game.",
    "1054": "@DMikesworld @TheNBACentral @BrooklynNets @AhnFireDigital I second this comment",
    "1055": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1056": "@TheNBACentral @BrooklynNets @AhnFireDigital Omg not this again",
    "1057": "@TheNBACentral @BrooklynNets @AhnFireDigital We’ve seen this before lol",
    "1058": "@cthebeast21 @TheNBACentral @BrooklynNets @AhnFireDigital Watch him start splashing 3’s 😂",
    "1059": "@TheNBACentral @BrooklynNets @AhnFireDigital We do this every summer. Every. Summer. https://t.co/mFpCnbj7TI",
    "1060": "@TheNBACentral @BrooklynNets @AhnFireDigital He made an uncontested three during practice? Jesus the bar is low.",
    "1061": "@SLAMonline @BrooklynNets Easy money sniper...🔥🔥🔥",
    "1062": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1063": "@TheNBACentral @BrooklynNets @AhnFireDigital Damn near traveled",
    "1064": "@TheNBACentral @BrooklynNets @AhnFireDigital That don’t count, Trae Young wasn’t there",
    "1065": "@BlackMoses32 @NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital You can't argue with this dude. He obviously doesn't watch simmons or he's just trolling",
    "1066": "@TheNBACentral @BrooklynNets @AhnFireDigital Lmao",
    "1067": "@TheNBACentral @BrooklynNets @AhnFireDigital With nobody guarding him",
    "1068": "@TheNBACentral @BrooklynNets @AhnFireDigital Y’all not about to do me like this again. Nope I’m not falling for it",
    "1069": "@TheNBACentral @BrooklynNets @AhnFireDigital Try dribbling next time",
    "1070": "@BrooklynNets Lmfaooo Bench Simmons hasn’t worked all year",
    "1071": "@TheNBACentral @BrooklynNets @AhnFireDigital I'm not being tricked by this again, do it in game.",
    "1072": "lollll i can hit those shots too sign me @BrooklynNets you dumb ass franchise 😂😂😂🤣🤣🤣 https://t.co/rMonOv4PK2",
    "1073": "@76Iggles @TheNBACentral @BrooklynNets @AhnFireDigital Walk",
    "1074": "@TheNBACentral @BrooklynNets @AhnFireDigital Bro made one shot",
    "1075": "@BrooklynNets @CanonUSA Let's go Nets",
    "1076": "@Christi91883608 @ByJayKing Brooklyn Nets NBA championships: https://t.co/UZxQpMvgNU",
    "1077": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1078": "Take it from Sixers fans @BrooklynNets, don’t get too caught up in these videos. As much as you’ll want him to, he’s not gonna shoot the ball in a game. He’s all yours though! https://t.co/0JP5E7s3um",
    "1079": "@TheNBACentral @BrooklynNets @AhnFireDigital 2 months later, a .04 second video. His security is tighter than the White House.",
    "1080": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1081": "@TheNBACentral @BrooklynNets @AhnFireDigital Do we really have to do this every year?",
    "1082": "@Christi91883608 @ByJayKing won the same thing Brooklyn's won.\n\nNOTHING.\n\nBoston's been to the Eastern Conference Finals, more than I can say about the Nets.",
    "1083": "@NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital If you understood what you were watching you would see that Harden has been getting Embiid some of the best looks he’s gotten in his entire career. I’m not saying he’s been great but his vision and timing on passes has been pretty damn elite.",
    "1084": "@TheNBACentral @BrooklynNets @AhnFireDigital He really needs to be working on dem free throws because the minute dude hits the floor the fouls gonna be coming.  You can bet your azz on that. https://t.co/GU35z3sMX2",
    "1085": "@TheNBACentral @BrooklynNets @AhnFireDigital that ball spinning sideways i am not a believer",
    "1086": "@BrooklynNets Put Ben Simmons right under the rim and he won’t look like that",
    "1087": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1088": "@TheNBACentral @BrooklynNets @AhnFireDigital Excited to see him in 2025",
    "1089": "@TheNBACentral @BrooklynNets @AhnFireDigital We’re celebrating a professional basketball player making an uncontested jumper after the traveled taking 4 steps? SMH lol",
    "1090": "@GamerDieXX @BlackMoses32 @TheNBACentral @BrooklynNets @AhnFireDigital I’ll take the guy who can play defense",
    "1091": "@TheNBACentral @BrooklynNets @AhnFireDigital Bro just took 4 steps",
    "1092": "@TheNBACentral @BrooklynNets @AhnFireDigital Get ready to see it in game …",
    "1093": "@TheNBACentral @BrooklynNets @AhnFireDigital Wow one shot",
    "1094": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel?",
    "1095": "@TheNBACentral @BrooklynNets @AhnFireDigital I’m tired of seeing this shit it’s been 4 years now. Grant Williams who missed his first 25 3s developed a J before Simmons.",
    "1096": "@BrooklynNets Chip next szn loading",
    "1097": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1098": "I asked my friends who will win the NBA Championship.\n1. Milwaukee Bucks (15.3%)\n2. Philadelphia 76ers(10.6%)\n3. Phoenix Suns(9.7%)\n4. Utah Jazz(8.6%)\n5. Brooklyn Nets(8.1%)\n6. Memphis Grizzlies (7.3%)\n7. Miami Heat(6.9%)\n8. Golden State Warriors(5.4%)\n9. Boston Celtics(4.1%) https://t.co/w3iJlNZI6V",
    "1099": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1100": "@TheNBACentral @BrooklynNets @AhnFireDigital Here he goes fooling all y’all again",
    "1101": "@TheNBACentral @BrooklynNets @AhnFireDigital Bro we get one of these EVERY YEAR",
    "1102": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel.",
    "1103": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1104": "@TheNBACentral @BrooklynNets @AhnFireDigital Greatest Shooter of All Time coming back",
    "1105": "@TheNBACentral @BrooklynNets @AhnFireDigital do it for the nets",
    "1106": "@TheNBACentral @BrooklynNets @AhnFireDigital So it’s begun.",
    "1107": "@DeanScorpion_ @NJtoBKLYN @TheNBACentral @BrooklynNets @AhnFireDigital The hatred is crazy",
    "1108": "@TheNBACentral @BrooklynNets @AhnFireDigital Wow one jump shot",
    "1109": "@TheNBACentral @BrooklynNets @AhnFireDigital He walked",
    "1110": "@levert_szn @BrooklynNets Lol why is his feet so close together on his shot",
    "1111": "@NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital For sure.. Just don’t criticize him. You know how he his about that. KD and Him should work out perfectly. Two of the most fragile all stars all time in terms of critique",
    "1112": "@TheNBACentral @BrooklynNets @AhnFireDigital Wait wait so the 6’10 point guard is getting praised for making a 3 pointer this nigga ass",
    "1113": "@JustinStitz00 @TheNBACentral @BrooklynNets @AhnFireDigital Better than Harden",
    "1114": "@BrooklynNets @zakyychan Ben Simmons jump shop looking money 👀🥲 https://t.co/ZktGvqF8gK",
    "1115": "@NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital How’s Simmons Playing",
    "1116": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1117": "@TheNBACentral @BrooklynNets @AhnFireDigital We literally do this every year",
    "1118": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1119": "@Ben4DPOY @TheNBACentral @BrooklynNets @AhnFireDigital They been posting videos for 5 years where you been",
    "1120": "@KawhiIight @Ben4DPOY @TheNBACentral @BrooklynNets @AhnFireDigital Lol we seen this before, I guess cuz he in NY that’s gone make a difference 😭 plus he traveled anyway 😂😂😂",
    "1121": "@TheNBACentral @BrooklynNets @AhnFireDigital Stop hyping him up. The dude hasn’t improved in 4 years. Nothings changing now",
    "1122": "@JustinStitz00 @TheNBACentral @BrooklynNets @AhnFireDigital Horrible",
    "1123": "@TheNBACentral @BrooklynNets @AhnFireDigital They teach traveling? I guess if it aint called, make it part of your game.",
    "1124": "@BlackMoses32 @jjtsports25 @TheNBACentral @BrooklynNets @AhnFireDigital Doesn’t have to be. He’s a better fit for the nets win than Harden was",
    "1125": "@TheNBACentral @BrooklynNets @AhnFireDigital Unguarded Ben Simmons is the best shooter in NBA history",
    "1126": "@TheNBACentral @BrooklynNets @AhnFireDigital Lol Philly is use to this",
    "1127": "@TheNBACentral @BrooklynNets @AhnFireDigital How low is the bar bro🤣",
    "1128": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel?",
    "1129": "@BrooklynNets That’s cute https://t.co/tfHrrxvh2y",
    "1130": "@TheNBACentral @BrooklynNets @AhnFireDigital Lmao I remember seeing these as a sixer fan. Won't ever see him shoot more than 1 in a game 😂",
    "1131": "@TheNBACentral @BrooklynNets @AhnFireDigital Catch, 1-2-3-4 steps, shoots uncontested practice half speed. Okay Ben 😴",
    "1132": "@TheNBACentral @BrooklynNets @AhnFireDigital Every single Sixers fan is thinking the exact same thing right now. And if you're a Sixers fan you already know what it is.",
    "1133": "@TheNBACentral @BrooklynNets @AhnFireDigital Herniated disc huh?",
    "1134": "@TheNBACentral @BrooklynNets @AhnFireDigital he was doing this in practice when he was in Philly 😂",
    "1135": "@NETSCHIPSZN2022 @jjtsports25 @TheNBACentral @BrooklynNets @AhnFireDigital Ben will never be better than Harden 🤣",
    "1136": "@TheNBACentral @BrooklynNets @AhnFireDigital Theory: Ben is perfectly fine. He just wants time to perfect a jumpshot shot he can show the world when he comes back and to stop the clowning.",
    "1137": "@NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital 21 10 7 with a 15-8 record. Not entirely terrible. Once again I say. He’s playing",
    "1138": "@TheNBACentral @BrooklynNets @AhnFireDigital walk",
    "1139": "@BrooklynNets Ben's looking good 👀",
    "1140": "@TheNBACentral @BrooklynNets @AhnFireDigital If Ben make a playoff appearance https://t.co/DF4R3sH1g3",
    "1141": "@Ben4DPOY @TheNBACentral @BrooklynNets @AhnFireDigital 5 years of clowning him for these and now he’s in your city you think it’s gonna happen?",
    "1142": "@Danizeh @TheNBACentral @BrooklynNets @AhnFireDigital This shit is yearly post at this point",
    "1143": "@TheNBACentral @BrooklynNets @AhnFireDigital Walk",
    "1144": "@BrooklynNets Love how they like each other without fucking harden there",
    "1145": "@TheNBACentral @BrooklynNets @AhnFireDigital We are still doing this huh? https://t.co/eYXLgXmmDJ",
    "1146": "@TheNBACentral @BrooklynNets @AhnFireDigital Shout out to the one shot that rattled in",
    "1147": "@TheNBACentral @BrooklynNets @AhnFireDigital Y'all so hyped Abt an NBA player making Threes \nLike is their job and practice ≠ game",
    "1148": "@UnknownSavagery @TheNBACentral @BrooklynNets @AhnFireDigital Traveled to Australia with that tho",
    "1149": "@TheNBACentral @BrooklynNets @AhnFireDigital Big Ben hitting one in a row 😂",
    "1150": "@TheNBACentral @BrooklynNets @AhnFireDigital Ben just travelled to mars",
    "1151": "@TheNBACentral @BrooklynNets @AhnFireDigital Walked",
    "1152": "@RealCodyMallory Man Cody, you are on it.. are the Nets hooking you up? @BrooklynNets Get this guy a jersey..",
    "1153": "@TheNBACentral @BrooklynNets @AhnFireDigital He traveled",
    "1154": "@ishi_310 @NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital Playoffs coming i wonder why he’s on a cold streak 😂😂😂",
    "1155": "@TheNBACentral @BrooklynNets @AhnFireDigital What y’all were expecting when you post Simmons making 1 wide open three in practice https://t.co/cIVcEOYCio",
    "1156": "@TheNBACentral @BrooklynNets @AhnFireDigital Not Nets Fans falling for the empty gym videos. Us sixers fans know the drill by know",
    "1157": "@TheNBACentral @BrooklynNets @AhnFireDigital Stop with this garbage.",
    "1158": "@jjtsports25 @BlackMoses32 @TheNBACentral @BrooklynNets @AhnFireDigital Ben off the floor is better than Harden on the floor",
    "1159": "This is just a friendly reminder that no one gives a crap about the Brooklyn Nets, this is a Rangers town https://t.co/smns4o2qwF",
    "1160": "@TheNBACentral @BrooklynNets @AhnFireDigital Even thru all the drama I'm still a ben Simmons fan I just wanna see him succeed",
    "1161": "@JustinStitz00 @TheNBACentral @BrooklynNets @AhnFireDigital Horrible",
    "1162": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1163": "@TheNBACentral @BrooklynNets @AhnFireDigital An NBA player hitting one three! Damn!",
    "1164": "@shh27643 @Anthony09673430 @NETSCHIPSZN2022 @ishi_310 @TheNBACentral @BrooklynNets @AhnFireDigital Shaq said it best bro if he can’t score consistently while creating it ain’t gonna help them but I see what you mean",
    "1165": "@BrooklynNetcast @TSO_Sage Nobody is going to be in shambles over a Brooklyn Nets fan account 🤣",
    "1166": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1167": "@TheNBACentral @BrooklynNets @AhnFireDigital Then he bricked the next 99.😏",
    "1168": "@Ben4DPOY @KawhiIight @TheNBACentral @BrooklynNets @AhnFireDigital As a Sixers fan I'm just warning you from experience to not get excited about this. 🙂🙄",
    "1169": "@BallifyNBA @TheFlyingBembry @TheNBACentral @BrooklynNets @AhnFireDigital Yes but what’s the work if you don’t show it… You shoot 3s in practice that’s great. But he never shoots. So it goes to waste. It’s like it never happened",
    "1170": "@TheNBACentral @BrooklynNets @AhnFireDigital Nah but imagine if this man has been actually shooting like 300 3s a day since the end of thelast season and comes out and shooting like 33% next season or whenever he comes back",
    "1171": "#Brooklyn #Nets: Working on the weekend.... \n \nhttps://t.co/Kt1GCGUXDj\n \n#Basketball #BrooklynNets #NationalBasketballAssociation #NBA #NBAEasternConference #NBAEasternConferenceAtlanticDivision #NewYork #NewYorkCity https://t.co/gFOY7IqDfM",
    "1172": "@TheNBACentral @BrooklynNets @AhnFireDigital 1 out of how many though?",
    "1173": "@JustinStitz00 @midvault @SiakamFan @Twentylmao @TheNBACentral @BrooklynNets @AhnFireDigital Facts like he has his flaws",
    "1174": "@TheNBACentral @BrooklynNets @AhnFireDigital Hahahah I’m so glad I don’t have to get hype over practice shots anymore",
    "1175": "@TheNBACentral @BrooklynNets @AhnFireDigital Sits out all season….lol.  This dude is a fraud.",
    "1176": "@TheNBACentral @BrooklynNets @AhnFireDigital we see this every offseason",
    "1177": "@NETSCHIPSZN2022 @BlackMoses32 @TheNBACentral @BrooklynNets @AhnFireDigital Ben Simmons has yet to play a game yet this season and wont",
    "1178": "@benangerosa @Anthony09673430 @NETSCHIPSZN2022 @ishi_310 @TheNBACentral @BrooklynNets @AhnFireDigital He said creator not scorer",
    "1179": "@johnnyoctober13 @midvault @SiakamFan @Twentylmao @TheNBACentral @BrooklynNets @AhnFireDigital We signed Drummond for the Vet minimum. But apparently he’s now Prime Shaq…",
    "1180": "@NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital James is playing…",
    "1181": "@TheNBACentral @BrooklynNets @AhnFireDigital Walk",
    "1182": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1183": "@Anthony09673430 @NETSCHIPSZN2022 @ishi_310 @TheNBACentral @BrooklynNets @AhnFireDigital Last 5 he’s had as many turnovers as field goals made 😂😂😂",
    "1184": "@TheNBACentral @BrooklynNets @AhnFireDigital He In the nba, he suppose to be able to do that smh",
    "1185": "@TheNBACentral @BrooklynNets @AhnFireDigital Travelled tho",
    "1186": "@TheNBACentral @BrooklynNets @AhnFireDigital Ok Ben for traveling?",
    "1187": "@TheNBACentral @BrooklynNets @AhnFireDigital He’s making a lot of money and should be able to do this",
    "1188": "@TheNBACentral @BrooklynNets @AhnFireDigital he traveled btw",
    "1189": "@Ben4DPOY @TheNBACentral @BrooklynNets @AhnFireDigital Yeah we’ve never seen footage of Cowardly Ben drilling shots in an empty gym before 🤔🙄",
    "1190": "@TheNBACentral @BrooklynNets @AhnFireDigital Here we go again",
    "1191": "@TheNBACentral @BrooklynNets @AhnFireDigital And as is tradition the Simmons gym clips start dropping and people start getting excited because he shoots a 3 in it. Like clock work..",
    "1192": "@TheNBACentral @BrooklynNets @AhnFireDigital Took him a year of offseason practice and video edits for this to finally surface",
    "1193": "@BrooklynNets Give KD a sandwich 🥪",
    "1194": "@drgradinjan @Bucks Agreed bucks got blessed last year winning game 7 at Brooklyn on the road their better off getting the 2 seed and take Brooklyn to a battle win that series to host the Celtics or Philly in round 2 then going in the road if the nets loses or don’t get the 7th seed",
    "1195": "@BallifyNBA @TheNBACentral @BrooklynNets @AhnFireDigital He’s shown us this every season since he been in the league",
    "1196": "@TheNBACentral @BrooklynNets @AhnFireDigital For one shot?!?!? https://t.co/J5RtANaLS8",
    "1197": "@TheNBACentral @BrooklynNets @AhnFireDigital the bro traveled on on them pull up jumpers,\nhow many steps was that👀",
    "1198": "@ChrisDenari @Pacers @NBA @BrooklynNets @BallySportsIN You and QB are always the absolute best. Thanks for another great season!",
    "1199": "@TheNBACentral @BrooklynNets @AhnFireDigital Lol how many times we’ve seen this",
    "1200": "@JelSne2 @BrooklynNets Boul nellaw🔥🔥🔥",
    "1201": "@JelSne2 @BrooklynNets That’s my booooy",
    "1202": "@ChrisDenari @Pacers @NBA @BrooklynNets @BallySportsIN Saw you on my way into game last sunday thank you for your hard work all season ❤❤❤",
    "1203": "@TheNBACentral @BrooklynNets @AhnFireDigital Walk",
    "1204": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel…",
    "1205": "@TheNBACentral @BrooklynNets @AhnFireDigital Traveling.",
    "1206": "@TheFlyingBembry @BallifyNBA @TheNBACentral @BrooklynNets @AhnFireDigital And he traveled before the shot…",
    "1207": "@TheNBACentral @BrooklynNets @AhnFireDigital @MrA0DR shooting better than Giannis😂",
    "1208": "@TheNBACentral @BrooklynNets @AhnFireDigital 😂😂😂😂😂😂😂😂😂😂 here we go",
    "1209": "@ChrisDenari @Pacers @NBA @BrooklynNets @BallySportsIN Thanks for all your hard work enhancing the watching experience once again!",
    "1210": "@TheNBACentral @BrooklynNets @AhnFireDigital FINALLY I DONT HAVE TO DEFEND THIS ANYMORE",
    "1211": "@TheNBACentral @BrooklynNets @AhnFireDigital Not bad getting paid doing nothing at all, not bad indeed https://t.co/pKqhjhcCSe",
    "1212": "@BenSimmons25 This is Nasty Ben This is Benny Buckets This is Ben 10 not 9 This is Benjamin Bucket   Start of a NEW ERA begins now!!  @BrooklynBrigade @BrooklynNets #NetsWorld #WeBenlieve https://t.co/q258gd3uj4",
    "1213": "@TheNBACentral @BrooklynNets @AhnFireDigital Broken clock right twice a day, #CarryOn",
    "1214": "@TheNBACentral @BrooklynNets @AhnFireDigital He traveled",
    "1215": "@TheNBACentral @BrooklynNets @AhnFireDigital W8 what? @ocap4_ 👀",
    "1216": "@TheNBACentral @BrooklynNets @AhnFireDigital This nigga literally traveled. Or am I trippin?",
    "1217": "@TheNBACentral @BrooklynNets @AhnFireDigital Nigga travel and still haven’t played a game",
    "1218": "@chibbs_1 @BrooklynNets @GeorgiaTech Knick jersey would’ve been bananas!! If only",
    "1219": "@Hedshoot1 @DeanScorpion_ @TheNBACentral @BrooklynNets @AhnFireDigital He'll shoot better than Palah",
    "1220": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1221": "@NinjaBands @TheNBACentral @BrooklynNets @AhnFireDigital Those famous gym videos",
    "1222": "@TheNBACentral @BrooklynNets @AhnFireDigital @dylanhultgren_ @realsburner how dumb is this post - 1 isolated shot that rattled in haha",
    "1223": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1224": "@TheNBACentral @BrooklynNets @AhnFireDigital First of all, travel. Second, too scared in a real game🤷‍♂️",
    "1225": "@TheNBACentral @BrooklynNets @AhnFireDigital That’s the only clip you have?",
    "1226": "@KawhiIight @Ben4DPOY @TheNBACentral @BrooklynNets @AhnFireDigital They're so cute when they're still innocent, aren't they? 😂",
    "1227": "@BrooklynNets Please  I need that 😹",
    "1228": "@TheNBACentral @BrooklynNets @AhnFireDigital *makes one three*…….*posts it*",
    "1229": "@TheNBACentral @BrooklynNets @AhnFireDigital I think we’ve seen this every year he’s been in the league and he never does it in game",
    "1230": "@TheNBACentral @BrooklynNets @AhnFireDigital Literally anyone can do this",
    "1231": "@PearsonSeamus @TheNBACentral @BrooklynNets @AhnFireDigital I mean he is clearly capable. His high school jumper was pretty nice. Just needs to work it into his game.",
    "1232": "@DeanScorpion_ @TheNBACentral @BrooklynNets @AhnFireDigital Y’all were excited for this man every day until a few months ago tbf",
    "1233": "@TheNBACentral @BrooklynNets @AhnFireDigital 😂 😂 he walked with the ball. Not one dribble.",
    "1234": "@TheNBACentral @BrooklynNets @AhnFireDigital Finally got one on tape",
    "1235": "#kyrie #kd #brooklyn @nba @BrooklynNets\n#nets #netsfans @NetsFans\nBest duo ever\nhttps://t.co/L7ymUOjOsX",
    "1236": "@NETSCHIPSZN2022 @BlackMoses32 @TheNBACentral @BrooklynNets @AhnFireDigital Just let Nets fans wait for him to play.  He stinks  so does Harden.  They swapped problems",
    "1237": "@TheNBACentral @BrooklynNets @AhnFireDigital Don’t be happy till you see him hit these in game, we’ve all seen clips in the past where he can hit them in practice but never in a game it’s not impressive",
    "1238": "@NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital Well   Harden has the balls to go out and play",
    "1239": "@bish4684 @BrooklynNets That’s awesome",
    "1240": "@TheNBACentral @BrooklynNets @AhnFireDigital They usually show vids when they hit 6or more in a row. Cameraman got tired of waiting for 2 in a row. https://t.co/sfmpF4ThPI",
    "1241": "@TheNBACentral @BrooklynNets @AhnFireDigital Walk",
    "1242": "@TheNBACentral @BrooklynNets @AhnFireDigital dog meat",
    "1243": "@TheNBACentral @BrooklynNets @AhnFireDigital That’s a confident shot",
    "1244": "@TheNBACentral @BrooklynNets @AhnFireDigital An nba player making a wide open middy in shooting practice is news? 1 middy tho",
    "1245": "@JonGottti89 @NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital But yea keep Ben Simmons in your bio, lover boy",
    "1246": "@ILoveLukaMagic @BrooklynNets If you watched Ben move during time outs a couple weeks ago he was moving like a dude with back pain wouldn't even touch the ball.... the last couple games he's be doing dribble moves and moving much better... I have seats on the 200 level with a great view of the nets bench lol",
    "1247": "@TheNBACentral @BrooklynNets @AhnFireDigital Ben always shoots in open gyms guys come on this is the same shit. Atleast he putting in the work",
    "1248": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1249": "@TheNBACentral @BrooklynNets @AhnFireDigital Bro took 94 steps before the shot lmao",
    "1250": "@TheNBACentral @BrooklynNets @AhnFireDigital ahh i remember when i used to get excited over videos of Ben Simmons hitting uncontested 3s in practice",
    "1251": "@TheNBACentral @BrooklynNets @AhnFireDigital Anybody can a hit a shot in a open gym but can u hit the shot in the playoffs when the game on line is the question??????",
    "1252": "@TheNBACentral @BrooklynNets @AhnFireDigital This a replay of the previous years?",
    "1253": "@TheNBACentral @BrooklynNets @AhnFireDigital LMFAAAOOOO.",
    "1254": "@TheNBACentral @BrooklynNets @AhnFireDigital he traveled tho",
    "1255": "@TheNBACentral @BrooklynNets @AhnFireDigital Back looking loose 😮‍💨",
    "1256": "@TheNBACentral @BrooklynNets @AhnFireDigital Traveling hasn't been a thing for a while, has it?",
    "1257": "@PaulTweetz2Much They had nets playing in Brooklyn, then at Portland the next night 😂😂😂",
    "1258": "@flatbushfinest3 @HardenFinalsMVP @TheNBACentral @BrooklynNets @AhnFireDigital How many minutes has Ben played",
    "1259": "@TheNBACentral @BrooklynNets @AhnFireDigital Traveling",
    "1260": "@TheNBACentral @BrooklynNets @AhnFireDigital Here we go again 😂",
    "1261": "@TheNBACentral @BrooklynNets @AhnFireDigital From one shot? Lol",
    "1262": "@TheNBACentral @BrooklynNets @AhnFireDigital I would sure hope a former nba #1 overall pick can hit a jump shot in practice with no one guarding him.",
    "1263": "@NinjaBands @TheNBACentral @BrooklynNets @AhnFireDigital I, too, have once made a three",
    "1264": "@TheNBACentral @BrooklynNets @AhnFireDigital Traveling",
    "1265": "@TheNBACentral @BrooklynNets @AhnFireDigital He’s a shooter now!!! Again…",
    "1266": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1267": "@TheNBACentral @BrooklynNets @AhnFireDigital He’s been doing that in practice for 5 years https://t.co/2kQOTadkJe",
    "1268": "@TheNBACentral @BrooklynNets @AhnFireDigital Thought he couldn’t play because his back was hurt?",
    "1269": "@cranekicker @TheNBACentral @BrooklynNets @AhnFireDigital Nobody makes unguarded threes in cell phone practice videos like Ben Simmons",
    "1270": "@NETSCHIPSZN2022 @ishi_310 @TheNBACentral @BrooklynNets @AhnFireDigital Have you been watching..?",
    "1271": "@NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital James is getting his slander though and he’s at least he’s shooting",
    "1272": "@TheNBACentral @BrooklynNets @AhnFireDigital Oh man. How many times fellas?",
    "1273": "@midvault @SiakamFan @Twentylmao @TheNBACentral @BrooklynNets @AhnFireDigital Our window is only like 3 years max so I’ll take that",
    "1274": "@BrooklynNets @j3yoda you still have time to get your Simmons jersey back from the dry cleaners.",
    "1275": "@TheNBACentral @BrooklynNets @AhnFireDigital We doing this again?",
    "1276": "@TheNBACentral @BrooklynNets @AhnFireDigital Bro just traveled and is shooting against air. This is not impressive.",
    "1277": "@TheNBACentral @BrooklynNets @AhnFireDigital We’ve seen this before. Stop playing into it. https://t.co/dULaUVaZRz",
    "1278": "@flatbushfinest3 @HardenFinalsMVP @TheNBACentral @BrooklynNets @AhnFireDigital Holy shit a braindead take. Look who has the most minutes played in the last 10 years.",
    "1279": "@TheNBACentral @BrooklynNets @AhnFireDigital Been showing these clips of him for 3 years.",
    "1280": "@TheNBACentral @BrooklynNets @AhnFireDigital Mf made one basket",
    "1281": "@KeNnyNYJ24 @aka49_ @TheNBACentral @BrooklynNets @AhnFireDigital He’s a bum, and he got sand in his clit … defensively Brooklyn can use him but offensively he’s a joke",
    "1282": "@TheNBACentral @BrooklynNets @AhnFireDigital Won’t be fooled",
    "1283": "@TheNBACentral @BrooklynNets @AhnFireDigital Lmfao Nets getting the full Ben Experience",
    "1284": "@TheNBACentral @BrooklynNets @AhnFireDigital not this shit again",
    "1285": "@TheNBACentral @BrooklynNets @AhnFireDigital Why are we infatuated with NBA players hitting practice jump shots?",
    "1286": "@TheNBACentral @BrooklynNets @AhnFireDigital What travel? 🤷🏾‍♂️",
    "1287": "Off to see the @BrooklynNets tomorrow. Travelled from the UK to see @KDTrey5 🏀 #excited #nets",
    "1288": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1289": "@BlackMoses32 @KAscuasiati @lenhan0925 @TheNBACentral @BrooklynNets @AhnFireDigital He will never be Ben til he can play some defense",
    "1290": "@TheNBACentral @BrooklynNets @AhnFireDigital It only hit the rim 3 times before going in too!",
    "1291": "@TheNBACentral @BrooklynNets @AhnFireDigital We ignoring that he traveled?",
    "1292": "@TheNBACentral @BrooklynNets @AhnFireDigital He made a jump shot!!!",
    "1293": "@TheNBACentral @BrooklynNets @AhnFireDigital Stop with the propaganda",
    "1294": "@BrooklynNets @_Talkin_NBA To stay in the play in!!",
    "1295": "@TheNBACentral @BrooklynNets @AhnFireDigital nice travel",
    "1296": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1297": "@ishi_310 @NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital Nah bro he’s been on this “streak” for whole season he’s only played good in games that don’t rly matter",
    "1298": "@TheNBACentral @BrooklynNets @AhnFireDigital Not a game. We talking about practice",
    "1299": "@TheNBACentral @BrooklynNets @AhnFireDigital That’s a walk",
    "1300": "@TheNBACentral @BrooklynNets @AhnFireDigital We’ve seen him hit open 3’s, we know he can drop em in gym.  I’d be more impressed seeing him sink FT’s 🤣😂",
    "1301": "@TheNBACentral @BrooklynNets @AhnFireDigital Bro how many times y’all gone fall for it?",
    "1302": "@TheNBACentral @BrooklynNets @AhnFireDigital Ik he just working out but TRAVEL REF !",
    "1303": "@KAscuasiati @NETSCHIPSZN2022 @lenhan0925 @TheNBACentral @BrooklynNets @AhnFireDigital He will never be harden until he can make 3’s and ft’s",
    "1304": "@TheNBACentral @BrooklynNets @AhnFireDigital Get BACKKKKK",
    "1305": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1306": "@johnnyoctober13 @SiakamFan @Twentylmao @TheNBACentral @BrooklynNets @AhnFireDigital short term yes but long term the nets win the trade most likely",
    "1307": "@TheNBACentral @BrooklynNets @AhnFireDigital I’ve never seen this before 😂😂😂",
    "1308": "@TheNBACentral @BrooklynNets @AhnFireDigital Hahahahah",
    "1309": "@TheNBACentral @BrooklynNets @AhnFireDigital That’s a travel… Carry on",
    "1310": "@BrooklynNets Ben knock down a threee🔥🔥🔥🔥",
    "1311": "@TheNBACentral @BrooklynNets @AhnFireDigital We seen this shit before 😂😂😂😂😂",
    "1312": "@TheNBACentral @BrooklynNets @AhnFireDigital We’re not still falling for this are we??",
    "1313": "@TheNBACentral @BrooklynNets @AhnFireDigital Lmao not again bro",
    "1314": "@chibbs_1 @BrooklynNets I miss the days of you DC and Petro!",
    "1315": "@TheFlyingBembry @TheNBACentral @BrooklynNets @AhnFireDigital Ok so he does work on his game",
    "1316": "@lmatt726 @FinnVegetables @notorioustei @BrooklynNets idk i mean hes absolutely devastated by that hamstring injury honestly i kind of wish we deactivated him during the playoffs just for more rest time",
    "1317": "@BallifyNBA @TheNBACentral @BrooklynNets @AhnFireDigital This man been practicing since he was in high school jit",
    "1318": "@TheNBACentral @BrooklynNets @AhnFireDigital What’s with the 9 steps into the pull up.",
    "1319": "@TheNBACentral @BrooklynNets @AhnFireDigital Giant eyes for a professional basketball player making a jumper that 95% of people at lifetime fitness would make…",
    "1320": "@TheNBACentral @BrooklynNets @AhnFireDigital Am I the only one who saw the travel? https://t.co/01CIK1eTcu",
    "1321": "@TheNBACentral @BrooklynNets @AhnFireDigital He traveled …",
    "1322": "@TheNBACentral @BrooklynNets @AhnFireDigital good luck nets fan",
    "1323": "@TheNBACentral @BrooklynNets @AhnFireDigital Lmao they doing this again?",
    "1324": "@TheNBACentral @BrooklynNets @AhnFireDigital Traveled.",
    "1325": "Ben Simmons SHOOTING LIGHTS OUT In Brooklyn Nets Practice And Is Looking NBA Playoff Ready\nWATCH FULL VIDEO HERE: https://t.co/KmtIbVz0ww\n\nEmbiid Jokic Luka Doncic Giannis LeBron Kevin Durant Kyrie Irving James Harden Stephen Curry UFC 273 Chimaev Khamzat Burns Volkanovski Yan KD",
    "1326": "@TheNBACentral @BrooklynNets @AhnFireDigital Walk",
    "1327": "@BrooklynNets I miss the Ben Simmons shooting videos... The good ole days.",
    "1328": "@TheNBACentral @BrooklynNets @AhnFireDigital We’ve seen this movie.. now just do it in game and your solid",
    "1329": "@TheNBACentral @BrooklynNets @AhnFireDigital We do this every year https://t.co/vzQTW3CRph",
    "1330": "@TheNBACentral @BrooklynNets @AhnFireDigital Same shit every year. Probably think he winning rookie of the year this year too 🤡🤡🤡",
    "1331": "@TheFlyingBembry @TheNBACentral @BrooklynNets @AhnFireDigital I'm not saying that he's gonna do this in a game, but I think we all should atleast be content that he is practicing it right? Step in the right direction",
    "1332": "@TheNBACentral @BrooklynNets @AhnFireDigital can we fucking not",
    "1333": "@TheNBACentral @BrooklynNets @AhnFireDigital We not falling for this shit again",
    "1334": "@ChrisDenari @Pacers @NBA @BrooklynNets @BallySportsIN I hope to see this team be turned around sometime soon because it’s been hard to watch in last 3-5 years",
    "1335": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1336": "@TheNBACentral @BrooklynNets @AhnFireDigital Wait.. just one shot. One hit wonder video.",
    "1337": "@TheNBACentral @BrooklynNets @AhnFireDigital Walk",
    "1338": "@TheNBACentral @BrooklynNets @AhnFireDigital Lol, this nigga can shoot now?",
    "1339": "@BallifyNBA @TheNBACentral @BrooklynNets @AhnFireDigital If the man starts taking and making threes in game that’s dope but I’ve seen this too many times to be fooled.",
    "1340": "@TheNBACentral @BrooklynNets @AhnFireDigital You know it’s been bad when we’re celebrating an nba player hitting practice jumpers",
    "1341": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1342": "@TheNBACentral @BrooklynNets @AhnFireDigital He does this and doesn’t shoot in games why are people suppose to care about practice if he doesn’t even use what he practices… https://t.co/heKkJ26bCZ",
    "1343": "@TheNBACentral @BrooklynNets @AhnFireDigital Bro made one uncontested shot relax 😂",
    "1344": "@TheNBACentral @BrooklynNets @AhnFireDigital A tradition unlike any other. I Can’t wait till next year when people predict he will start shooting when he hits some  april jumpers in empty gyms.",
    "1345": "@TheNBACentral @BrooklynNets @AhnFireDigital not impressed https://t.co/hkUYTS4EnZ",
    "1346": "@ChrisDenari @Pacers @NBA @BrooklynNets @BallySportsIN I'm a big fan of your water systems",
    "1347": "@TheNBACentral @BrooklynNets @AhnFireDigital Lmfao not this shit again",
    "1348": "@cranekicker @TheNBACentral @BrooklynNets @AhnFireDigital Travel.",
    "1349": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel 🧳",
    "1350": "@TheFlyingBembry @TheNBACentral @BrooklynNets @AhnFireDigital But if he wasn't practing 3s, it would be \"he never works on his game",
    "1351": "@KamguiaS @BrooklynNets Very very very very very good pic",
    "1352": "@TheNBACentral @BrooklynNets @AhnFireDigital We Ben through this before. Lmao",
    "1353": "@BigGritKP @TheNBACentral @BrooklynNets @AhnFireDigital Mf took more steps in that clip then I took my hole life 😂😂😂😂😂",
    "1354": "@TheNBACentral @BrooklynNets @AhnFireDigital Not falling for it",
    "1355": "@TheNBACentral @BrooklynNets @AhnFireDigital We ain’t falling for this again",
    "1356": "@OnlyPhanatics @TheNBACentral @BrooklynNets @AhnFireDigital Travel.",
    "1357": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1358": "@BallifyNBA @TheNBACentral @BrooklynNets @AhnFireDigital Idk if this is improvement.. this man has been shooting and making open threes in open gyms his whole career…",
    "1359": "@notdionlewis @ybnfazeasapkang @TheNBACentral @BrooklynNets @AhnFireDigital This is so true and so fun 😅",
    "1360": "@hoglord69 @TheNBACentral @BrooklynNets @AhnFireDigital this is the year",
    "1361": "@TheNBACentral @BrooklynNets @AhnFireDigital Steps",
    "1362": "@NetsKingdomAJ @BrooklynNets Lets Go",
    "1363": "@TheNBACentral @BrooklynNets @AhnFireDigital My nephew can do that.",
    "1364": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel 🤷🏽‍♂️",
    "1365": "@BrooklynNets where is claxton?",
    "1366": "@TheNBACentral @BrooklynNets @AhnFireDigital He took 4 steps lol",
    "1367": "@TheNBACentral @BrooklynNets @AhnFireDigital Yall ask for improvement and then when he shows us you slander him",
    "1368": "@BrooklynNets BLAKE AT THE END AND RANDOMLY IN THE BACKGROUND LET'S GOOOOOOOOOOO",
    "1369": "@TheNBACentral @BrooklynNets @AhnFireDigital Don't fall for it we've been seeing vids like this since the Romney administration",
    "1370": "@TheNBACentral @BrooklynNets @AhnFireDigital Now show the other 38",
    "1371": "@TheNBACentral @JakeNFLNBA @BrooklynNets @AhnFireDigital Travel🙄",
    "1372": "@JoshReynolds24 @TheNBACentral @BrooklynNets @AhnFireDigital Please",
    "1373": "@TheNBACentral @BrooklynNets @AhnFireDigital Talk to me when he does it in a game",
    "1374": "@CookCarter @BrooklynBrigade @BrooklynNets @NBA @TheBKBlock @barclayscenter Thats my GM ! https://t.co/1QjnotLWiC",
    "1375": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1376": "@BlackMoses32 @NETSCHIPSZN2022 @lenhan0925 @TheNBACentral @BrooklynNets @AhnFireDigital Ben Simmons would basically end up playing like harden by next season without but with defense.  Ben is 25 harden going to ask for a max deal next season that would be a huge mistake",
    "1377": "@TheNBACentral @BrooklynNets @AhnFireDigital stop",
    "1378": "@TheNBACentral @BrooklynNets @AhnFireDigital Has this guy been injured? Totally forgot he went to the nets lol",
    "1379": "@BlackMoses32 @TheNBACentral @BrooklynNets @AhnFireDigital Does it really matter? You told me his stats already. He’s shooting horrible",
    "1380": "@BlackMoses32 @TheNBACentral @BrooklynNets @AhnFireDigital Okay but if Harden starts regressing even worse than now, players will start helpline off of him. Harden is shooting similar percentages to Westbrook. Teams are gonna realize this soon.",
    "1381": "@TheNBACentral @BrooklynNets @AhnFireDigital That’s a travel, bucket doesn’t count",
    "1382": "@TheNBACentral @BrooklynNets @AhnFireDigital Here we go again lmao",
    "1383": "@BrooklynNets I'm Japanese and my name is Hisanobu👤\n\nI hope the Brooklyn Nets will win👑\n\nI love Kylie Irving the most！！",
    "1384": "@TheNBACentral @BrooklynNets @AhnFireDigital Man ben still cant shoot",
    "1385": "@NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital Oh you only watch nets games, I can’t converse with you anymore",
    "1386": "@TheNBACentral @BrooklynNets @AhnFireDigital 1 shot?",
    "1387": "@TheNBACentral @BrooklynNets @AhnFireDigital So it’s a highlight?? Like we getting excited when a player who signed a 170 million dollar contact, been an all-star, catches  the ball, travels, &amp; hits a 3 by himself at practice????!!!! https://t.co/KJe0zpROw1",
    "1388": "@boolerrain @NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital If you don’t care about 3pt% and ft% 🤣",
    "1389": "@TheNBACentral @BrooklynNets @AhnFireDigital Didn’t Ben just travel?",
    "1390": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1391": "Shook of the @BrooklynNets lol https://t.co/hUIUTUs1Hp",
    "1392": "@BrooklynNets travel by Ben",
    "1393": "*SCARY* Ben Simmons Can’t Miss From Three! Trainer Warns The NBA:\nhttps://t.co/PcoQ1EU3N4 \n\n#bensimmons #brooklynnets #NBATwitter #LakeShow #NetsWorld #WillSmith #NBAPlayoffs2022 #LeBron #TrendingNow",
    "1394": "@NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital He will, Maxey will become the teams second option w/o a question. If you pay attention to the team then you would know that.",
    "1395": "@01sleinadR @TheNBACentral @BrooklynNets @AhnFireDigital 5/10?? that dude goes bout 90% in practice lol",
    "1396": "@IbsxLopez @JoshReynolds24 @TheNBACentral @BrooklynNets @AhnFireDigital That sound just like him smh",
    "1397": "@BrooklynNets First clip they show of Ben is him traveling 😂",
    "1398": "@BlackMoses32 @NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital If you don’t care about fg% 😂",
    "1399": "@BlackMoses32 @TheNBACentral @BrooklynNets @AhnFireDigital I watched the game against the nets and from what I’m hearing, he isn’t playing that much different from how he played that game",
    "1400": "@JoshReynolds24 @TheNBACentral @BrooklynNets @AhnFireDigital Bruh, some of us sixer fans said he better not decide to start shooting 3s. He better have that same energy he had the past 10+ years when he started \"shooting\".",
    "1401": "@NETSCHIPSZN2022 @KAscuasiati @lenhan0925 @TheNBACentral @BrooklynNets @AhnFireDigital Ben hasn’t improved since he entered the league lol",
    "1402": "@chibbs_1 @BrooklynNets This is nonsense! You’ll always be a Celtic to me! Worst thing we did was trade you after that playoff run, loved watching you play sir!",
    "1403": "@TheNBACentral @BrooklynNets @AhnFireDigital if practice ben was actual game ben he’d be top 3 in the league",
    "1404": "@BlackMoses32 @TheNBACentral @BrooklynNets @AhnFireDigital Stop it lmao.",
    "1405": "@NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital Definitely not watching the games",
    "1406": "@TheNBACentral @BrooklynNets @AhnFireDigital Ben really right handed",
    "1407": "@NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital He will be the 3rd, maybe even 4th next season so we are not worried",
    "1408": "@TheNBACentral @BrooklynNets @AhnFireDigital we see this every couple of months and he still can’t shoot in game💀",
    "1409": "@BlackMoses32 @KAscuasiati @lenhan0925 @NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital Seth and Drummond alone for Harden was worth it.",
    "1410": "@TheNBACentral @BrooklynNets @AhnFireDigital OH BROTHER…",
    "1411": "@TheNBACentral @BrooklynNets @AhnFireDigital Bro made one three IM CRYING YALL DO THIS EVERY YEAR LMAOOOO",
    "1412": "@BrooklynNets GM Sean Marks visits the @BrooklynBrigade to give us genuine love and affirmations for our dedication to being the Loudest and Proudest fans in the @NBA This was our draft day !!! #1 pick best fans in the @NBA @BrooklynBrigade @TheBKBlock #NetsWorld @barclayscenter https://t.co/rBzdcYD33T",
    "1413": "@TheNBACentral @BrooklynNets @AhnFireDigital We’ve seen this many times tho",
    "1414": "@BlackMoses32 @TheNBACentral @BrooklynNets @AhnFireDigital Harden playing doesn’t make a difference. He doesn’t contribute much.",
    "1415": "@BlackMoses32 @lenhan0925 @NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital Oh man you’re gonna love the playoffs this year. Good thing Harden didn’t sign his extension before your trash fans run him out of town after the second round.",
    "1416": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1417": "@TheNBACentral @BrooklynNets @AhnFireDigital Crazy how my mental image of Ben Simmons is this and not in a jersey.",
    "1418": "@BrooklynNets Ben simmons shooting form looks even better than Cam Thomas's.. all he need is some confidence in himself under pressure",
    "1419": "@TheNBACentral @BrooklynNets @AhnFireDigital Sheeesh travel! But rooting for ben!",
    "1420": "@BlackMoses32 @KAscuasiati @lenhan0925 @TheNBACentral @BrooklynNets @AhnFireDigital Don’t matter. He’s in his 20s. Everyone on the team is still in their prime except Blake and Aldridge. Harden is gonna be even worse next season",
    "1421": "@TheNBACentral @BrooklynNets @AhnFireDigital “Ok Ben now without traveling”",
    "1422": "@BrooklynNets Damn! I really love that little smile. Love @KDTrey5",
    "1423": "@TheNBACentral @BrooklynNets @AhnFireDigital Took 6 steps and made a klanky jump shot with no defenders. I could literally do that",
    "1424": "@TheNBACentral @BrooklynNets @AhnFireDigital Ran half a mile before he took the shot",
    "1425": "@TheNBACentral @BrooklynNets @AhnFireDigital Now avoid the travel and do it in a game🤷🏻‍♂️",
    "1426": "@BrooklynNets Don't fall for it yall i promise yall dont fall for it you WILL be disappointed",
    "1427": "@TheNBACentral @BrooklynNets @AhnFireDigital I can travel and hit jumpers too",
    "1428": "@TheNBACentral @BrooklynNets @AhnFireDigital Travels and makes an uncontested three in practice and it’s something? Should see my Jr High driveway tape.",
    "1429": "@BlackMoses32 @lenhan0925 @TheNBACentral @BrooklynNets @AhnFireDigital Efficiency plus win or go home games were terrible",
    "1430": "@NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital I would rather have the player willing to be on the court rather than miss an entire season for no reason at all 🤣",
    "1431": "@BlackMoses32 @TheNBACentral @BrooklynNets @AhnFireDigital The guy that averages 21 is the second option while my guy most likely is the 4th lmao",
    "1432": "@BrooklynNets This a easy decision Brooklyn Nets… https://t.co/AZZPhSWxBi",
    "1433": "@TheNBACentral @BrooklynNets @AhnFireDigital Pleaseeeeee we’ve all seen this before. Don’t get your hopes up @BrooklynNets",
    "1434": "@TheNBACentral @BrooklynNets @AhnFireDigital One clip of him shooting a three should not be posted with the eyes emoji",
    "1435": "@BrooklynNets Everyone worried bout ben but kd still schooling cam 🤣",
    "1436": "@notorioustei @BrooklynNets You are about to be let down my friend",
    "1437": "@TheNBACentral @BrooklynNets @AhnFireDigital We’re not doing this again",
    "1438": "@TheNBACentral @BrooklynNets @AhnFireDigital Bruh does everything bedsides play in actual games smh",
    "1439": "@KAscuasiati @lenhan0925 @NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital Yeah but in that case Nets dont even get the main player on the court until next season at best so it’s still an L",
    "1440": "@TheNBACentral @BrooklynNets @AhnFireDigital aint doing that in game tho",
    "1441": "@TheNBACentral @BrooklynNets @AhnFireDigital You want to film me in a gym for 5min? I'll probably knock a jumper down",
    "1442": "@TheNBACentral @BrooklynNets @AhnFireDigital What, not gonna show him going two for his last ten before that?",
    "1443": "@BlackMoses32 @TheNBACentral @BrooklynNets @AhnFireDigital Cool and I’d rather have the guy that made all nba first defensive team than the guy that stands around on defense",
    "1444": "@HardenFinalsMVP @TheNBACentral @BrooklynNets @AhnFireDigital Facts, that's why harden is out of shape..  not practicing at all 🤣",
    "1445": "Nets all day my people @BrooklynNets https://t.co/yXn7wmqylY",
    "1446": "@TheNBACentral @BrooklynNets @AhnFireDigital That’s a walk",
    "1447": "@TheNBACentral @BrooklynNets @AhnFireDigital He will LITERALLY never take that shot in a game 😂",
    "1448": "@TheNBACentral @BrooklynNets @AhnFireDigital It’s 1 shot. Settle down people",
    "1449": "@NETSCHIPSZN2022 @lenhan0925 @TheNBACentral @BrooklynNets @AhnFireDigital Harden avg 28 for Houston in the playoffs",
    "1450": "@TheNBACentral @BrooklynNets @AhnFireDigital they better setup the skills challenge for that man idk why im seeing a jumper rn",
    "1451": "@SiakamFan @Twentylmao @TheNBACentral @BrooklynNets @AhnFireDigital 15-8 after the trade for us. 11-12 for nets. Yeah I think the trade is fine…",
    "1452": "@IbsxLopez @JoshReynolds24 @TheNBACentral @BrooklynNets @AhnFireDigital Nets won the trade 🙌",
    "1453": "@NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital I would rather have 21/7/10/1 on 40/33/89 vs 16/8/8/2/1 on 56/15/60",
    "1454": "@KamguiaS @BrooklynNets The perfect pic for when we win the play in/ first round",
    "1455": "@TheNBACentral @BrooklynNets @AhnFireDigital 6 steps before jumper though?",
    "1456": "@TheNBACentral @BrooklynNets @AhnFireDigital stop this nonsense,  99% players can do that, wait until he does in real game",
    "1457": "@TheNBACentral @BrooklynNets @AhnFireDigital 😭😭😭😭😭😭😭 another one of these off-season/practice shoot arounds that try to make it seem like he’s the second coming of Stephen Curry 😂😂😂 relax my boy you ain’t foolin no one out here!!!",
    "1458": "@BlackMoses32 @lenhan0925 @TheNBACentral @BrooklynNets @AhnFireDigital Nope Harden sunk more because he was a way better scorer than Ben back then. It’s not like Ben averaged 36 in the regular season.",
    "1459": "@TheNBACentral @BrooklynNets @AhnFireDigital Bro this shit has been going on for years, nets fans please get hype over this. You’re gonna get let down",
    "1460": "@TheNBACentral @BrooklynNets @AhnFireDigital Empty gym",
    "1461": "@thenamesbdwy @ybnfazeasapkang @TheNBACentral @BrooklynNets @AhnFireDigital I’m literally addicted to Downloading rosters from past years and restarting…basically like the 2k equivalent of marvel ‘what if’",
    "1462": "@BlackMoses32 @lenhan0925 @NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital Did curry played well? Because he was part of the trade",
    "1463": "@TheNBACentral @BrooklynNets @AhnFireDigital Been seeing this same damn video for years.",
    "1464": "@TheNBACentral @BrooklynNets @AhnFireDigital I'm going to lose my mind. Just because a player is doing good practicing doesn't mean they will do good. This dude is notorious for sucking 😳 . He has nobody actually guarding him and there is no pressure. Nets fans getting excited over this is crazy.",
    "1465": "@s_harvey21_007 @TheNBACentral @BrooklynNets @AhnFireDigital Fr tho lol",
    "1466": "@TheNBACentral @BrooklynNets @AhnFireDigital Mother father ran with the ball before he’s shot that shit 😂",
    "1467": "@BlackMoses32 @NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital Only problem is that nets got curry Drummond and 2 picks... That's a lot for the way harden is playing",
    "1468": "@TheNBACentral @BrooklynNets @AhnFireDigital Anyone can look great in practice . Do it in a game",
    "1469": "@TheNBACentral @BrooklynNets @AhnFireDigital We not falling for that anymore https://t.co/45TbKzB9rm",
    "1470": "@TheNBACentral @BrooklynNets @AhnFireDigital Catches and takes 3 steps.. nice… you can tell he’s uncomfortable has hell",
    "1471": "@BrooklynNets Congrats, keep it going",
    "1472": "@thenamesbdwy @ybnfazeasapkang @TheNBACentral @BrooklynNets @AhnFireDigital I only play my league bro idk what that is",
    "1473": "@TheNBACentral @BrooklynNets @AhnFireDigital That’s one shot",
    "1474": "@TheNBACentral @BrooklynNets @AhnFireDigital Not falling for it",
    "1475": "@TheNBACentral @BrooklynNets @AhnFireDigital No exaggeration, I’ve seen more Simmons highlights from the the gym than the actual game",
    "1476": "@TheNBACentral @BrooklynNets @AhnFireDigital He not shooting these in game https://t.co/KcfbyCamDf",
    "1477": "@lenhan0925 @NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital Nobody sunk more than Simmons on the big stage. 4 straight 4th quarters with 0 fga while shooting all-time lows from the ft line as well.",
    "1478": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel ☠️",
    "1479": "My people I love my nets @BrooklynNets @GeorgiaTech https://t.co/fKO4Imc9bR",
    "1480": "@TheNBACentral @BrooklynNets @AhnFireDigital We’ve seen him shoot jumpers before in practice or a pickup game.",
    "1481": "@TheNBACentral @BrooklynNets @AhnFireDigital The handles 👀",
    "1482": "@Twentylmao @TheNBACentral @BrooklynNets @AhnFireDigital even without ben, seth and drummond alone r better than harbum on the sixers, sixers bumass lost",
    "1483": "@BrooklynNets BENJAMIN SIMMONS!!",
    "1484": "@TheNBACentral @BrooklynNets @AhnFireDigital Why do y’all do this shit. Open gym shooting translates 0% to in game shooting.",
    "1485": "The King of NY 👑 @KDTrey5 @BrooklynNets https://t.co/Gl5SDUWzSD",
    "1486": "@TheNBACentral @BrooklynNets @AhnFireDigital I Take Practice Simmons over Devin Fraud Booker.",
    "1487": "@TheNBACentral @BrooklynNets @AhnFireDigital NO WAY! ONE IN A ROW?!",
    "1488": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1489": "@TheNBACentral @BrooklynNets @AhnFireDigital Not this again",
    "1490": "@TheNBACentral @BrooklynNets @AhnFireDigital I do that everyday",
    "1491": "@NETSCHIPSZN2022 @BlackMoses32 @TheNBACentral @BrooklynNets @AhnFireDigital Philly fans about to see how harden sinks on the big stage 🤣",
    "1492": "@DeanScorpion_ @TheNBACentral @BrooklynNets @AhnFireDigital Our luck he becomes a sniper",
    "1493": "@NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital I’d say around this time of year they both get slandered cus they both don’t know how to act in the playoffs 🤷🏾‍♂️",
    "1494": "@TheNBACentral @BrooklynNets @AhnFireDigital Y’all falling for this again?",
    "1495": "@TheNBACentral @BrooklynNets @AhnFireDigital You gotta dribble my guy!!",
    "1496": "@TheNBACentral @BrooklynNets @AhnFireDigital League in trouuuuuubblllleeeee",
    "1497": "@TheNBACentral @BrooklynNets @AhnFireDigital Oh brother",
    "1498": "@TheNBACentral @BrooklynNets @AhnFireDigital He travelled",
    "1499": "@BrooklynNets Ben’s looking good",
    "1500": "@TheNBACentral @BrooklynNets @AhnFireDigital Ain’t shit wrong with him make his ass play",
    "1501": "@TheNBACentral @BrooklynNets @AhnFireDigital The way he just traveled",
    "1502": "@KeNnyNYJ24 @TheNBACentral @BrooklynNets @AhnFireDigital Hope he just come back next year don’t even care if he don’t play until then",
    "1503": "@NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital He’s actually playing not ducking games like ben",
    "1504": "@BrooklynNets Ben walked",
    "1505": "@BehemothBaller @zachzeaman @TheNBACentral @BrooklynNets @AhnFireDigital If you say so💀💀",
    "1506": "@BrooklynNets Did I see Joey buckets there too?",
    "1507": "@TheNBACentral @BrooklynNets @AhnFireDigital We doing this again???",
    "1508": "@TheNBACentral @BeWokes @BrooklynNets @AhnFireDigital Lmaoooo",
    "1509": "@TheNBACentral @BrooklynNets @AhnFireDigital Does he have his phone in his pocket?",
    "1510": "@BrooklynNets Ben Simmons will hit jumpers in practice and miss them all in a real game 🤦🏿‍♂️",
    "1511": "@NETSRUNEASTT @TheNBACentral @BrooklynNets @AhnFireDigital Nobody balls harder than summertime Ben😤",
    "1512": "@BrooklynNets Men at work!?🏃🏃",
    "1513": "@TheNBACentral @BrooklynNets @AhnFireDigital Who’s gonna tell em??",
    "1514": "@TheNBACentral @BrooklynNets @AhnFireDigital Man took 5 steps, enjoy the workout videos🤣🤣🤣",
    "1515": "@ChrisDenari @Pacers @NBA @BrooklynNets @BallySportsIN *road",
    "1516": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1517": "@TheNBACentral @BrooklynNets @AhnFireDigital What are we doing here honestly …",
    "1518": "@Dejohnte_p @Jari2Fly @TheNBACentral @BrooklynNets @AhnFireDigital Lol I don’t know why Philadelphia gave him that contract.  He never deserved it.  That’s what happens when you pay on potential.",
    "1519": "@ishi_310 @TheNBACentral @BrooklynNets @AhnFireDigital Nope he’s a horrible creator this season. Please watch basketball.",
    "1520": "@JoshReynolds24 @TheNBACentral @BrooklynNets @AhnFireDigital Yeah I think you’ll be fine lol",
    "1521": "@SiakamFan @TheNBACentral @BrooklynNets @AhnFireDigital Yeah he made one open 3 at practice. Everyone is terrified.",
    "1522": "@TheNBACentral @BrooklynNets @AhnFireDigital Sixers fans saw these videos for 4 years. Next.",
    "1523": "@TheNBACentral @BrooklynNets @AhnFireDigital Gotta travel to hit a jumper? Lol",
    "1524": "@TheNBACentral @BrooklynNets @AhnFireDigital He’s always showing out in practice but in the real game….. https://t.co/qNCgjM05X9",
    "1525": "The star-studded Brooklyn Nets won’t win the NBA championship and Andrew Bogut can’t see Ben Simmons making a difference if he returns from his back injury. Read his column now. \n\nhttps://t.co/tzguOagxzZ",
    "1526": "@BlackMoses32 @TheNBACentral @BrooklynNets @AhnFireDigital Ben Simmons averages like 4 less points while being leagues ahead of Harden defensively and just as good of a passer. And he’s way more efficient",
    "1527": "@TheNBACentral @BrooklynNets @AhnFireDigital Nice he made one",
    "1528": "@Dejohnte_p @Jari2Fly @TheNBACentral @BrooklynNets @AhnFireDigital He posts a video of him shooting almost every year lmao",
    "1529": "@TheNBACentral @BrooklynNets @AhnFireDigital He traveled",
    "1530": "@notdionlewis @ybnfazeasapkang @TheNBACentral @BrooklynNets @AhnFireDigital I need a dark matter hoodie melo in 2k",
    "1531": "@TheNBACentral @BrooklynNets @AhnFireDigital people getting excited for this 😭😭 he does this everyyear and doesn't do shit in the REAL games 😭",
    "1532": "@TheNBACentral @BrooklynNets @AhnFireDigital Not the practice videos again",
    "1533": "@TheNBACentral @BrooklynNets @AhnFireDigital We do this every year. Just stop it",
    "1534": "@TheNBACentral @BrooklynNets @AhnFireDigital We see this every offseason and when the season starts buddy  never shoots",
    "1535": "@ybnfazeasapkang @TheNBACentral @BrooklynNets @AhnFireDigital Can’t forget hoodie Melo the street free agent legend",
    "1536": "@BrooklynNets Working on the weekend like usual",
    "1537": "@Gymrat197 @NetsKingdomAJ @BrooklynNets Ride on partner https://t.co/YMEqcfLsLI",
    "1538": "@TheNBACentral @BrooklynNets @AhnFireDigital Seen this summertime Simmons before https://t.co/Eam1NyfqLr",
    "1539": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel unfortunately",
    "1540": "@zachzeaman @TheNBACentral @BrooklynNets @AhnFireDigital Sixers fans looking at Harden’s shooting numbers https://t.co/GGpKyfK3QZ",
    "1541": "@butterbeetch @KingTechnical08 @DeanScorpion_ @TheNBACentral @BrooklynNets @AhnFireDigital Cloging the paint he draws doubles floor spacer is standing on the 3pt line",
    "1542": "@WillMackey9 @TheNBACentral @BrooklynNets @AhnFireDigital I doubt very much he's been in the gym much if any during that period.",
    "1543": "@TheNBACentral @BrooklynNets @AhnFireDigital I could have 8-10 vodka sodas and beat Ben Simmons in a shooting contest FOH",
    "1544": "@TheNBACentral @BrooklynNets @AhnFireDigital he made 1 shot and it rolled around the rim lmaooo chill out",
    "1545": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1546": "@BehemothBaller @zachzeaman @TheNBACentral @BrooklynNets @AhnFireDigital Yeah hes been ass lately but atleast he is playing unlike ben",
    "1547": "@TheNBACentral @BrooklynNets @AhnFireDigital that's a travel",
    "1548": "@BrooklynNets Ben jumper is just another marketing strategy",
    "1549": "@TheNBACentral @BrooklynNets @AhnFireDigital That’s a travel all day long",
    "1550": "@TheNBACentral @BrooklynNets @AhnFireDigital I can do this",
    "1551": "@TheNBACentral @BrooklynNets @AhnFireDigital Finest five step jump shooting I've ever seen.",
    "1552": "@Shookrr11 @TheNBACentral @BrooklynNets @AhnFireDigital Lol thinking he actually shoots it in the first place.",
    "1553": "@TheNBACentral @BrooklynNets @AhnFireDigital bro we aint falling for this for the 9th time",
    "1554": "@TheNBACentral @BrooklynNets @AhnFireDigital this man is the goat of pick up YMCA ball",
    "1555": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1556": "@TheNBACentral @BrooklynNets @AhnFireDigital Lolololol",
    "1557": "@TheNBACentral @BrooklynNets @AhnFireDigital luck",
    "1558": "@NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital He’s on a cold shooting streak but he’s been playing fine. Still one of the best creators in the league and getting Embiid and the rest of the team great looks.",
    "1559": "@TheNBACentral @BrooklynNets @AhnFireDigital Mf dies this every offseason.😂 He ain't doing in a real game !",
    "1560": "@jayshotta21 @TyreseMaxeySZN @CopticRewind @heyltsmio @TheNBACentral @BrooklynNets @AhnFireDigital You do make good points tho. But it’s Kyrie and KD, they don’t need the paint to score",
    "1561": "@BrooklynNets Ahh the empty gym jumps shots, trip down memory lane for any Sixer fan…..",
    "1562": "@Creeisraw @TheNBACentral @BrooklynNets @AhnFireDigital It is for a dude who doesn’t shoot the ball",
    "1563": "@ChrisDenari @Pacers @NBA @BrooklynNets @BallySportsIN Have you been still doing roars games remotely?",
    "1564": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel!",
    "1565": "@Mustafa22__ @TheNBACentral @BrooklynNets @AhnFireDigital Show me. &amp; then I’ll show you bens https://t.co/tFP2HjQpRo",
    "1566": "@ACE_PAID_N_FULL @TheNBACentral @BrooklynNets @AhnFireDigital Second of all… he’s moving pretty well for someone who wasn’t running a week ago 🤷🏽‍♂️",
    "1567": "@TheNBACentral @BrooklynNets @AhnFireDigital This is top tier clickbait",
    "1568": "@TheNBACentral @BrooklynNets @AhnFireDigital Anyone notice he took like 5 steps before the first shot 😂",
    "1569": "@itzjxhnnn04 @NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital Bro…5 years and he hasn’t shot. You actually have confidence he will now?",
    "1570": "@NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital Harden has better avgs in Philly then simmons has had his whole career",
    "1571": "@TheNBACentral @BrooklynNets @AhnFireDigital How many did he miss before this? Let's see that video",
    "1572": "@BrandooN3xtup @TheNBACentral @BrooklynNets @AhnFireDigital soon https://t.co/AHXG2iMnm3",
    "1573": "@TheNBACentral @BrooklynNets @AhnFireDigital Traveling in practice",
    "1574": "@BrooklynNets OH SHIT BEN SIMMONS!!!!",
    "1575": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1576": "@ClappedSeann @TheNBACentral @BrooklynNets @AhnFireDigital troll",
    "1577": "@TheNBACentral @BrooklynNets @AhnFireDigital stop",
    "1578": "@TheNBACentral @BrooklynNets @AhnFireDigital So he’s added shooting and deleted dribbling.",
    "1579": "@TheNBACentral @BrooklynNets @AhnFireDigital Traveling",
    "1580": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1581": "@s_harvey21_007 @TheNBACentral @BrooklynNets @AhnFireDigital Like wtf 😂",
    "1582": "@BehemothBaller @zachzeaman @TheNBACentral @BrooklynNets @AhnFireDigital This definitely happens all the time https://t.co/O7bgNCIkpE",
    "1583": "@TheNBACentral @BrooklynNets @AhnFireDigital How are we still doing this?",
    "1584": "@TheNBACentral @BrooklynNets @AhnFireDigital Scary hours 🌈🌈",
    "1585": "@TheNBACentral @BrooklynNets @AhnFireDigital Nobody noticed the travel? Lmaoo",
    "1586": "@TheNBACentral @BrooklynNets @AhnFireDigital Only took 67 takes to get this 3 second clip. Give ‘em an Oscar.",
    "1587": "Aye @BrooklynNets  don’t post another Ben Simmons workout video. If he’s not doing it in the game, don’t show us no Ben Simmons jump shots. He was brought in to play defense. https://t.co/cPzwgGdQzA",
    "1588": "@TheNBACentral @BrooklynNets @AhnFireDigital Is that not a travel tho?",
    "1589": "@TheNBACentral @BrooklynNets @AhnFireDigital The fact that no one commented about his four steps before he shoots shows me how little on this app know hoops",
    "1590": "@TheNBACentral @BrooklynNets @AhnFireDigital travel.",
    "1591": "@ACE_PAID_N_FULL @TheNBACentral @BrooklynNets @AhnFireDigital 😂😂😂😂😂 no 🧢 we gonna start there",
    "1592": "@TheNBACentral @BrooklynNets @AhnFireDigital Do it in a game",
    "1593": "@TheNBACentral @BrooklynNets @AhnFireDigital This is just a clip of a dude who gets paid millions of dollars to shoot basketballs in a hoop, shooting a basketball in a hoop",
    "1594": "@jayshotta21 @TyreseMaxeySZN @CopticRewind @heyltsmio @TheNBACentral @BrooklynNets @AhnFireDigital Boston is great. Idk if you’re a Philly fan or just Harden. But if Philly then uk Ben makes Tatum life hard, and actually outplayed him the past 2 years. Philly got swept by them in the bubble because Ben wasn’t there\n\nI’m not saying he’s gonna be a SS but BKN needs defense",
    "1595": "@TheNBACentral @BrooklynNets @AhnFireDigital I could go into the gym and make this exact clip",
    "1596": "@TheNBACentral @BrooklynNets @AhnFireDigital new team same shit",
    "1597": "@TheNBACentral @BrooklynNets @AhnFireDigital He so worried about the shot he forgot to dribble smh",
    "1598": "@TheNBACentral @BrooklynNets @AhnFireDigital Until this is done in a game it’s all show",
    "1599": "@sprdsheet @JfromBk @BrooklynNets 😂 as they always do",
    "1600": "@TheNBACentral @BrooklynNets @AhnFireDigital R yall fuckin for real rn?",
    "1601": "@BehemothBaller @Fcorrin_enjoyer @zachzeaman @TheNBACentral @BrooklynNets @AhnFireDigital They coping with the fact that Harden’s playing like shit 🤣🤣🤣",
    "1602": "@TheNBACentral @BrooklynNets @AhnFireDigital Travels twice before he shoots it",
    "1603": "@TheNBACentral @BrooklynNets @AhnFireDigital Traveling",
    "1604": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1605": "@TheNBACentral @BrooklynNets @AhnFireDigital Meanest travel and hold a T, dat way https://t.co/7HTYN81EB6",
    "1606": "@phillydrilz @TheNBACentral @BrooklynNets @AhnFireDigital idc tbh i just wanna clown phillys poverty franchise",
    "1607": "@TheNBACentral @BrooklynNets @AhnFireDigital Wow I would say 7.9 billion people on the planet could do that",
    "1608": "@TheNBACentral @BrooklynNets @AhnFireDigital i thought his back was herniated? lmfao this dude is just an excuse factory.  dude just wants to collect checks, play warzone all day and do nothing. https://t.co/JDLY0tZGa7",
    "1609": "@TheNBACentral @BrooklynNets @AhnFireDigital Lmfaooooo",
    "1610": "@TheNBACentral @BrooklynNets @AhnFireDigital Running starts always help.",
    "1611": "@JonGottti89 @NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital Don’t care if we can get him in the playoffs if we make the play in and if he actually shoots in game we have something to be happy about, shooter or nonshooter",
    "1612": "@TheNBACentral @BrooklynNets @AhnFireDigital Still shooting with the wrong hand",
    "1613": "@BrooklynNets Ben Simmons running jumping and shooting https://t.co/1UVocR1qOh",
    "1614": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel much?",
    "1615": "@TheNBACentral @BrooklynNets @AhnFireDigital OMG A PROFESSIONAL NBA PLAYER MADE A THREE POST IT EVERYWHERE!!!",
    "1616": "@TheNBACentral @BrooklynNets @AhnFireDigital Bro, literally one shot lol IN PRACTICE",
    "1617": "@01sleinadR @TheNBACentral @BrooklynNets @AhnFireDigital 5/10 wide open in practice is not good",
    "1618": "@TheNBACentral @BrooklynNets @AhnFireDigital LMAO",
    "1619": "@TheNBACentral @BrooklynNets @AhnFireDigital Dude made 1 jump shot and it barely went in 🤣",
    "1620": "@TheNBACentral @BrooklynNets @AhnFireDigital Bruh is ready to shoot just in time for the off season 😤😤😤",
    "1621": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel?",
    "1622": "@TheNBACentral @BrooklynNets @AhnFireDigital Barley went in 💀 but still good for being injured",
    "1623": "@lmatt726 @FinnVegetables @notorioustei @BrooklynNets its rough",
    "1624": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1625": "@Johan_Boss01 @BrooklynNets It’s just about seeing him actually practice for us man… baby steps",
    "1626": "@TheNBACentral @BrooklynNets @AhnFireDigital We’ve been seeing these videos for awhile now. I’d love to see him in a jersey on the floor again doing that",
    "1627": "@mmmmdatdat @TheNBACentral @BrooklynNets @AhnFireDigital Ain’t there no more. Like hardens fat suit, that shit gone !",
    "1628": "@TheNBACentral @BrooklynNets @AhnFireDigital Nets won the trade",
    "1629": "@TheNBACentral @BrooklynNets @AhnFireDigital Hahahah",
    "1630": "@TheNBACentral @BrooklynNets @AhnFireDigital stop",
    "1631": "@TheNBACentral @BrooklynNets @AhnFireDigital Congratulations on being a professional basketball player that can make a mid range jump shot",
    "1632": "@TheNBACentral @BrooklynNets @AhnFireDigital Seen this time and time again. Just make it back to the court already. Defend. Pass. Make at least 70% of your free throws.",
    "1633": "@KD_SZN7 @TheNBACentral @BrooklynNets @AhnFireDigital Likely .",
    "1634": "@TheNBACentral @BrooklynNets @AhnFireDigital How many damn times we gonna see Ben Simmons making 3s in practice 😭",
    "1635": "@Dejohnte_p @Jari2Fly @TheNBACentral @BrooklynNets @AhnFireDigital I’d like him to play for the Nets but he is so fucking greedy that he wants 20 million for Philadelphia for doing nothing.",
    "1636": "@ChrisDenari @Pacers @NBA @BrooklynNets @BallySportsIN Best in the business! Congrats on year 16!",
    "1637": "@BrooklynNets Just post Simmons making jumpers everyday and break Twitter",
    "1638": "@Sixers_Matt @TheNBACentral @BrooklynNets @AhnFireDigital We seen this song and dance 100 times",
    "1639": "@BrooklynNets @NetsDaily does this count as 1 on 0? Asking for a friend(s)…..",
    "1640": "@TheNBACentral @BrooklynNets @AhnFireDigital Don’t y’all start. Always doing this",
    "1641": "@jayshotta21 @TyreseMaxeySZN @CopticRewind @heyltsmio @TheNBACentral @BrooklynNets @AhnFireDigital It’s not about the team but the defense. No matter the team they will either switch or double and rotate. Which means a shooter will he left open. \n\nAnd who had created the most 3s since being drafted? Ben",
    "1642": "@TheNBACentral @BrooklynNets @AhnFireDigital seen this script before",
    "1643": "@TheNBACentral @BrooklynNets @AhnFireDigital I’m just here to watch Philly Fans Sweat. Gym getting hot",
    "1644": "@TheNBACentral @BrooklynNets @AhnFireDigital We seen this before 😂",
    "1645": "@TheNBACentral @BrooklynNets @AhnFireDigital Not this again",
    "1646": "@TheNBACentral @BrooklynNets @AhnFireDigital Nigga posted one clip I’m dead",
    "1647": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1648": "@TyreseMaxeySZN @jayshotta21 @CopticRewind @heyltsmio @TheNBACentral @BrooklynNets @AhnFireDigital Still doesn’t explain the all NBA and all defense?\nHe hasn’t improved but defense was a weakness on draft night",
    "1649": "@BrooklynNets I finna know how Sixer fans feel when we see Ben knocking down 3s at practice 😭😭",
    "1650": "@TheNBACentral @BrooklynNets @AhnFireDigital Travels to get in rhythm then rattles it in. Haha cmon",
    "1651": "@TheNBACentral @BrooklynNets @AhnFireDigital and yet he is hurt ok nba",
    "1652": "@ybnfazeasapkang @TheNBACentral @BrooklynNets @AhnFireDigital Funny",
    "1653": "@TheNBACentral @BrooklynNets @AhnFireDigital No way y’all are falling for this again",
    "1654": "@TheNBACentral @BrooklynNets @AhnFireDigital Okay ben 🧱 https://t.co/loLEORih3O",
    "1655": "@TheNBACentral @BrooklynNets @AhnFireDigital 1st of all, that’s too many steps 😂🤦🏾💀",
    "1656": "@TheNBACentral @BrooklynNets @AhnFireDigital Biggest travel I ever seen",
    "1657": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1658": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1659": "@TheNBACentral @BrooklynNets @AhnFireDigital That travel crazy 😂",
    "1660": "@2Daunte2 @heitoso_ @levert_szn @BrooklynNets Good luck",
    "1661": "@NETSRUNEASTT @TheNBACentral @BrooklynNets @AhnFireDigital Lol y'all tweaking",
    "1662": "@ChrisDenari @Pacers @NBA @BrooklynNets @BallySportsIN Thanks for another great year of tv broadcasting. \n\nAppreciate your hard work and preparation!",
    "1663": "@ChrisDenari @Pacers @NBA @BrooklynNets @BallySportsIN Always the best Chris.  Enjoy the off season.  Fairways and Greens!",
    "1664": "@TheNBACentral @BrooklynNets @AhnFireDigital The catch &amp; 6 step jumper. Shit is money",
    "1665": "@TheNBACentral @BrooklynNets @AhnFireDigital Meanwhile in actual games https://t.co/xlIjcBz6F9",
    "1666": "@TheNBACentral @BrooklynNets @AhnFireDigital Ben Simmons, the best shooter wearing sweats in an empty gym, social media has ever seen.",
    "1667": "@Dejohnte_p @Jari2Fly @TheNBACentral @BrooklynNets @AhnFireDigital U barely find out about Ben Simmons?",
    "1668": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1669": "@TheNBACentral @BrooklynNets @AhnFireDigital Whole nba world hating lol, weird",
    "1670": "@TheNBACentral @BrooklynNets @AhnFireDigital We’ve seen him do this in an empty gym.",
    "1671": "@TheNBACentral @BrooklynNets @AhnFireDigital Never seen anything like it!",
    "1672": "@Kevthatniggaa @jayshotta21 @CopticRewind @heyltsmio @TheNBACentral @BrooklynNets @AhnFireDigital Yeah must be why it hasn’t happened in over a decade😂",
    "1673": "@mmmmdatdat @TheNBACentral @BrooklynNets @AhnFireDigital You feel me?!?!",
    "1674": "@TheNBACentral @BrooklynNets @AhnFireDigital traveled his way into a three and yall posted this",
    "1675": "@TheNBACentral @BrooklynNets @AhnFireDigital You’re kidding, this is what he does, releases videos of him shooting,uncovered, in the gym.",
    "1676": "@Dejohnte_p @Jari2Fly @TheNBACentral @BrooklynNets @AhnFireDigital I’ve seen dozens of videos of him lacing threes in warmups. This is irrelevant",
    "1677": "@TheNBACentral @BrooklynNets @AhnFireDigital He’s not doing that in game Ngl 💀",
    "1678": "@TheNBACentral @BrooklynNets @AhnFireDigital Seen it too many times",
    "1679": "@TheNBACentral @BrooklynNets @AhnFireDigital Ain’t gonna even look at the rim yet he practicing those",
    "1680": "@DeanScorpion_ @TheNBACentral @BrooklynNets @AhnFireDigital Hes going to shoot better than russ",
    "1681": "@TheNBACentral @BrooklynNets @AhnFireDigital Are we pretending that's not a travel?",
    "1682": "@TheNBACentral @BrooklynNets @AhnFireDigital Lmaooooooooo",
    "1683": "@TheNBACentral @BrooklynNets @AhnFireDigital An nba player ratttling in a jumper. IMPRESSIVE !",
    "1684": "@BrooklynNets Y’all When cameras are off 😹😹 https://t.co/5vwhpQli9b",
    "1685": "No matter the year, always hard to believe when @Pacers season comes to a close. For 83rd time (counting 2 pre-season telecasts), prepping and watching @NBA League Pass as I complete my 16th season. Final telecast of season tomorrow at 3 pm @BrooklynNets on @BallySportsIN. https://t.co/ge1ln47TgC",
    "1686": "@TheNBACentral @BrooklynNets @AhnFireDigital Not another Ben Simmons shooting vid",
    "1687": "@jayshotta21 @TyreseMaxeySZN @CopticRewind @heyltsmio @TheNBACentral @BrooklynNets @AhnFireDigital He doesn’t go to the corner on the PNR he will go to the goal. Difference is Ben can either finish or hit the next man when they rotate. \nLast time Ben played in that role was vs BKN when they had Allen. He shit on them",
    "1688": "@TheNBACentral @BrooklynNets @AhnFireDigital Looks like a LA Fitness. Tbh",
    "1689": "Looking forward to \"calling\" Pacers-Nets tomorrow afternoon at 3:30 p.m. ET. Brooklyn with a win can clinch #7 seed in the East. Plus, I get my first look at Tyrese Haliburton (first game of his that I will ever \"call\", I believe) and the Pacers.\n\nRegular-season finale day.",
    "1690": "@TheNBACentral @BrooklynNets @AhnFireDigital Here we go again....",
    "1691": "@TheNBACentral @BrooklynNets @AhnFireDigital Fuckin 5 steps lmfao",
    "1692": "@Dejohnte_p @Jari2Fly @TheNBACentral @BrooklynNets @AhnFireDigital He been making this vids for 5 years",
    "1693": "@TyreseMaxeySZN @jayshotta21 @CopticRewind @heyltsmio @TheNBACentral @BrooklynNets @AhnFireDigital It was actually Gordan, but plenty of people have made it as a rookie?",
    "1694": "@BrooklynNets Simmons one of the worst players in the nba",
    "1695": "@TheNBACentral @BrooklynNets @AhnFireDigital How many time y’all gonna fall for this?",
    "1696": "@TheNBACentral @BrooklynNets @AhnFireDigital We see this every year.",
    "1697": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1698": "@TheNBACentral @BrooklynNets @AhnFireDigital WOW, SHOCKER, A VIDEO OF BEN SIMMONS HITTING 3S IN PRACTICE THAT NEVER TRANSLATES TO THE ACTUAL GAME. IM SO SURPRISED RIGHT NOW.",
    "1699": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1700": "@HardenFinalsMVP @TheNBACentral @BrooklynNets @AhnFireDigital I did when he was in Philly hitting 3s at practice and in summer ball I’ll let them have this",
    "1701": "@TheNBACentral @BrooklynNets @AhnFireDigital Simmons incredible shooter vs 👻",
    "1702": "@TheNBACentral @BrooklynNets @AhnFireDigital i can do this",
    "1703": "@NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital Lol not true",
    "1704": "@Dj10833227 @JfromBk @BrooklynNets 😂 the media gassed us up.",
    "1705": "@BrooklynNets Showing Ben Simmons footage like if he actually gonna be doing any of this in a real game😂😂😂",
    "1706": "@TwoWayRatio @TheNBACentral @BrooklynNets @AhnFireDigital We doing this again 😐",
    "1707": "@TheNBACentral @BrooklynNets @AhnFireDigital Nah man we not doing this. I saw steven adams hitting corner threes. Do this in real Match",
    "1708": "@TheNBACentral @BrooklynNets @AhnFireDigital We still doing this 😂🤦🏻‍♂️? No one cares about gym clips for him anymore bruh lol. We’ve all seen the clips of him looking like Curry in off season gym workouts already only to do his usual brick laying during szn lol",
    "1709": "@TheNBACentral @BrooklynNets @AhnFireDigital Traveled",
    "1710": "@TyreseMaxeySZN @jayshotta21 @CopticRewind @heyltsmio @TheNBACentral @BrooklynNets @AhnFireDigital A screen and Philly played drop coverage, I literally said that’s what they do 😂",
    "1711": "@2Daunte2 @levert_szn @BrooklynNets yeah there's a lot of vids that show he can shoot but he just don't do it",
    "1712": "@TheNBACentral @BrooklynNets @AhnFireDigital This is every damn year. Same workout vids. But no development",
    "1713": "@jayshotta21 @TyreseMaxeySZN @CopticRewind @heyltsmio @TheNBACentral @BrooklynNets @AhnFireDigital Man said cutting…. You can go to the nba rn and cut. And ok a floater. I’ll give him that, but I’ve seen them use Bruce in the PNR as the roll man  no way you think he is better in that role than Ben",
    "1714": "@NETSCHIPSZN2022 @TheNBACentral @BrooklynNets @AhnFireDigital It’s not slandering if we’ve seen Ben Simmons for 5 years and he is still the exact same player he was in his rookie year. We’ve literally seen oy",
    "1715": "@Ben4DPOY @TheNBACentral @BrooklynNets @AhnFireDigital You’re actually getting excited 😭😭",
    "1716": "@BrooklynNets Everyone freaking out about Ben.. but is that Joey Buckets I see practicing?? 🧔🏻‍♂️",
    "1717": "@TheNBACentral @BrooklynNets @AhnFireDigital Come on man..he fools us with this every year",
    "1718": "@KD_SZN7 @TheNBACentral @BrooklynNets @AhnFireDigital Not likely",
    "1719": "@BrooklynNets “Like usual”",
    "1720": "@TheNBACentral @BrooklynNets @AhnFireDigital Ok be- https://t.co/7YzGr8Y2XU",
    "1721": "@TheNBACentral @BrooklynNets @AhnFireDigital Ben simmons being recorded in a practice gym is a better player than prime jordan",
    "1722": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1723": "@jayshotta21 @TyreseMaxeySZN @CopticRewind @heyltsmio @TheNBACentral @BrooklynNets @AhnFireDigital “Go to move” so you just mean scoring?\nNot defense, or the fact his assist was the same with a way lower usage rating. Did you take into account 3 players on that team last year had career years? So of course someone numbers would drop and it dropped by a point💀",
    "1724": "@BrooklynNets When I win the shirt won’t be worn, so I where can I buy an unsigned version? None on Nike or Nets Shop",
    "1725": "Ben 10!!!\n\nGreat news with Ben, awesome news for the Nets!!\n#progress @BenSimmons25 @BrooklynNets #NetsWorld https://t.co/H3cZtLLL7n",
    "1726": "@TheNBACentral @BrooklynNets @AhnFireDigital Where have I seen this before 🤨",
    "1727": "@TheNBACentral @BrooklynNets @AhnFireDigital How long did it take to film this",
    "1728": "Brooklyn Nets Fans tonight  watching that Ben Simmons footage on repeat ..I’m already on my 10th watch🤦🏾‍♂️ #Netsworld https://t.co/SViFdQDNrq",
    "1729": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1730": "@TheNBACentral @BrooklynNets @AhnFireDigital Swear to all the almighties…I could hit that same bash against the rim, corner free throw shit shot right now. 10 outta 10 times.",
    "1731": "@Kevthatniggaa @jayshotta21 @CopticRewind @heyltsmio @TheNBACentral @BrooklynNets @AhnFireDigital Watch the clip bud🤣 https://t.co/apEpqtXBtn",
    "1732": "@TheNBACentral @BrooklynNets @AhnFireDigital I thought these videos came around august mot april",
    "1733": "@TheNBACentral @BrooklynNets @AhnFireDigital we all know Ben can shoot a 3 for the gram…but we all also know he can’t do shit on the big stage.",
    "1734": "@JfromBk @BrooklynNets Nash can downplay this all he wants tomorrow, we see it lol\n\n\"Guys its just some light shooting I have no update there's nothing going on here\"",
    "1735": "@TheNBACentral @BrooklynNets @AhnFireDigital 😂😂 I saw this shit for 5 years. It’s the best it gets",
    "1736": "@TyreseMaxeySZN @jayshotta21 @CopticRewind @heyltsmio @TheNBACentral @BrooklynNets @AhnFireDigital Again, statemuse shows the whole team not just his numbers on Ben…..what aren’t you getting",
    "1737": "@BrooklynNets Net ain’t shit",
    "1738": "@TheNBACentral @BrooklynNets @AhnFireDigital Nice travel.",
    "1739": "@TheNBACentral @BrooklynNets @AhnFireDigital Lmao he does it in practice but won’t in a game we’ve seen this for years",
    "1740": "@BrooklynNets the revenge post finna feel sweet https://t.co/ikd6HoiDq5",
    "1741": "@TheNBACentral @CholoG1119 @BrooklynNets @AhnFireDigital don’t",
    "1742": "@TheNBACentral @BrooklynNets @AhnFireDigital I think we’ve seen this before.. when he actually does this in a game lmk 🤣🤣🤣",
    "1743": "@TyreseMaxeySZN @jayshotta21 @CopticRewind @heyltsmio @TheNBACentral @BrooklynNets @AhnFireDigital You just went from defense to stats…sad\nHe became an all star and all nba after his rookie season. Which means he played better no?",
    "1744": "@TheNBACentral @BrooklynNets @AhnFireDigital No basket.. https://t.co/E31tsFAf9I",
    "1745": "@TheNBACentral @BrooklynNets @AhnFireDigital wait, it's ben-makes-a-jumper-in-practice season already?",
    "1746": "@TheNBACentral @BrooklynNets @AhnFireDigital Can he play in a game tho?",
    "1747": "@TheNBACentral @BrooklynNets @AhnFireDigital @ryenarussillo early start for the summer shooting videos",
    "1748": "@TheNBACentral @BrooklynNets @AhnFireDigital This account knows exactly what it’s doing. Impressions galore 😂",
    "1749": "@TheNBACentral @BrooklynNets @AhnFireDigital Who cares",
    "1750": "@JAZZMANTYLER @TheNBACentral @BrooklynNets @AhnFireDigital Barely rattled 1 in 😂",
    "1751": "@BrooklynNets at the end simmons and blake sharing stories? 😂",
    "1752": "@TheNBACentral @BrooklynNets @AhnFireDigital Tell me more about his “injury”",
    "1753": "@BrooklynNets Inject that Ben Simmons mid range J into my heart",
    "1754": "@KD_SZN7 @BrooklynNets send me this🤣",
    "1755": "@TheNBACentral @BrooklynNets @AhnFireDigital This nigga traveled",
    "1756": "@TheNBACentral @BrooklynNets @AhnFireDigital The same people slandering Ben Simmons have nothing to say about the way James Harden has been stinking it up in Philly",
    "1757": "@TheNBACentral @BrooklynNets @AhnFireDigital The Ben gym videos are out a little earlier this year https://t.co/SyIAoX7GHh",
    "1758": "@TheNBACentral @BrooklynNets @AhnFireDigital This video could be from any year.",
    "1759": "@jayshotta21 @CoolBroNiceFlex @CopticRewind @heyltsmio @TheNBACentral @BrooklynNets @AhnFireDigital You’re not getting on me child. You don’t understand basketball beyond stats. Actually watch the game, and I don’t mean just Philly",
    "1760": "@BrooklynNets I like how we snuck Ben in there 😂🔥",
    "1761": "@TheNBACentral @BrooklynNets @AhnFireDigital Walk",
    "1762": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1763": "@Kevthatniggaa @jayshotta21 @CopticRewind @heyltsmio @TheNBACentral @BrooklynNets @AhnFireDigital He’s literally gotten worse since his rookie season in every single statistical category😂",
    "1764": "@TheNBACentral @BrooklynNets @AhnFireDigital One jump shot rattled in",
    "1765": "@BrooklynNets Is this a head fake for teams on top 4 before tomorrow’s games?",
    "1766": "@JoshReynolds24 @TheNBACentral @BrooklynNets @AhnFireDigital He’ll shoot one and make it but then never shoot another one again 😂 seen this too many times",
    "1767": "@TyreseMaxeySZN @jayshotta21 @CopticRewind @heyltsmio @TheNBACentral @BrooklynNets @AhnFireDigital Ohhhhh so you really don’t watch basketball? No way you used vs the team and not actually show the stats with him on him\nAlso I’ve watched both players call for screens to get Ben off them and cook whoever cuz Philly plays drop coverage",
    "1768": "@TheNBACentral @BrooklynNets @AhnFireDigital Do this in a game",
    "1769": "@GucciLightyear @TheNBACentral @BrooklynNets @AhnFireDigital I’d be mind blown just since we’ve seen this so many times",
    "1770": "@01sleinadR @TheNBACentral @BrooklynNets @AhnFireDigital Cope harder",
    "1771": "@TheNBACentral @BrooklynNets @AhnFireDigital That's a travel",
    "1772": "@Go_Sixers_Go @TheNBACentral @BrooklynNets @AhnFireDigital Yessir",
    "1773": "@TheNBACentral @BrooklynNets @AhnFireDigital Nope we aren’t doing this",
    "1774": "@TheNBACentral @BrooklynNets @AhnFireDigital Literally no point of showing us this",
    "1775": "@TheNBACentral @BrooklynNets @AhnFireDigital One jump shot",
    "1776": "@TheNBACentral @BrooklynNets @AhnFireDigital Lol, we have all seen this in practice before.",
    "1777": "@TheNBACentral @BrooklynNets @AhnFireDigital Ratio @jacklombardo16 ratio him to please this is fake vid we see this every offseason",
    "1778": "@TheNBACentral @BrooklynNets @AhnFireDigital Does he know he has to dribble?",
    "1779": "@TheNBACentral @BrooklynNets @AhnFireDigital i can do this with my eyes closed",
    "1780": "@jayshotta21 @TyreseMaxeySZN @CopticRewind @heyltsmio @TheNBACentral @BrooklynNets @AhnFireDigital Who said he doesn’t need to score?!!! I just said Bruce has been avg 14 which Ben can and has done.\nBruce has been making 1-2 3s a game as of late. If you’re implying Freak wouldn’t help off him then you’re mistaken",
    "1781": "@TheNBACentral @BrooklynNets @AhnFireDigital Oh gawd, more 3pt training drills 😂",
    "1782": "@ILoveLukaMagic @BrooklynNets Settlement done lil bro https://t.co/6UyePyfYVI",
    "1783": "@TheNBACentral @BrooklynNets @AhnFireDigital Are you serious?",
    "1784": "@TheNBACentral @BrooklynNets @AhnFireDigital Ben redemption arc incoming",
    "1785": "@BrooklynNets i need",
    "1786": "@TheNBACentral @BrooklynNets @AhnFireDigital He makes one mid range shot. Let's not overreact. Shit gets so damn annoying. No one is gonna care until he actually gets on the court in a game. We shall see if any part of his game has improved.",
    "1787": "@cashvuitton_ @TheNBACentral @BrooklynNets @AhnFireDigital No doubt.",
    "1788": "@Kevthatniggaa @jayshotta21 @CopticRewind @heyltsmio @TheNBACentral @BrooklynNets @AhnFireDigital Yeah whatever you say bucko😂 https://t.co/J4A3EsXjUv",
    "1789": "@TheNBACentral @BrooklynNets @AhnFireDigital U mfs acting like these type of videos haven’t existed since he was in the NBA",
    "1790": "@TheNBACentral @BrooklynNets @AhnFireDigital Wait til it comes time for the off season videos.",
    "1791": "@TheNBACentral @BrooklynNets @AhnFireDigital What year is this from?",
    "1792": "@TheNBACentral @BrooklynNets @AhnFireDigital fake",
    "1793": "@TheNBACentral @BrooklynNets @AhnFireDigital we have 4 years of training videos https://t.co/AmoHYiTK03",
    "1794": "@NetsKingdomAJ @BrooklynNets 🗑 Simmons😂",
    "1795": "@DeanScorpion_ @TheNBACentral @BrooklynNets @AhnFireDigital Even if ben doesn't come back nets still won the trade by getting rid of that washed locker room cancer",
    "1796": "@BrooklynNets Oh yeah Ben?",
    "1797": "@BrooklynNets @BurgerHarden The only guy on the team who hasn't sold his soul\nI haven't watched basketball since  LeBron tweeted #aCcoUntAbiLiTy\nto stain a cop who saved another woman's life. That woman was black for the ppl who actually care about skin color and pronouns.\nI don't mix propaganda w my sports",
    "1798": "@TheNBACentral @BrooklynNets @AhnFireDigital I’m here for the comments either saying, “now do that in game.” Or “not this again😒”",
    "1799": "@TheNBACentral @BrooklynNets @AhnFireDigital We’re still falling for these videos",
    "1800": "@TheNBACentral @BrooklynNets @AhnFireDigital Show me all the footage on the cutting room floor.",
    "1801": "@BrooklynNets @RobbyWerth “and then I told Kendall the next star she should see is Andre” -griffin to Drummond",
    "1802": "@jayshotta21 @fIagrant2 @CopticRewind @heyltsmio @TheNBACentral @BrooklynNets @AhnFireDigital KD and Kyrie are 2 of the best iso scores ever. “Spacing” you must forget some of the lineups KD has played with hell this year alone 😂",
    "1803": "@JfromBk @BrooklynNets Time to redeem some receipts 👀👀😂😂",
    "1804": "@Hogiecheeks @TheNBACentral @BrooklynNets @AhnFireDigital Walk https://t.co/59m6UcbrBG",
    "1805": "@TheNBACentral @BrooklynNets @AhnFireDigital It's literally the same shit every year",
    "1806": "@jayshotta21 @CopticRewind @heyltsmio @TheNBACentral @BrooklynNets @AhnFireDigital When simmons was healthy he was a God tier defender, watch basketball plz",
    "1807": "@DenScorpioFTW @TheNBACentral @BrooklynNets @AhnFireDigital It’s the same thing every season💀 it’s a cycle",
    "1808": "@TheNBACentral @BrooklynNets @AhnFireDigital Ahh the yearly ben swishing practice threes cycle",
    "1809": "@BrooklynNets Omg are you guys stupid I’m saying he isn’t injured and the nets are just being careful. I’m a nets fans I  happen to like Luka",
    "1810": "@TheNBACentral @BrooklynNets @AhnFireDigital again you are acting like we havent seen this ever lmao its just for show until he actually does something in a real game",
    "1811": "@TheNBACentral @BrooklynNets @AhnFireDigital 4 or 5 steps?",
    "1812": "@jayshotta21 @CoolBroNiceFlex @CopticRewind @heyltsmio @TheNBACentral @BrooklynNets @AhnFireDigital I’m not a nets fans, y’all just dumb and it hurts to see. Philly got there guy no? So worrying about the nets is stupid",
    "1813": "@TheNBACentral @BrooklynNets @AhnFireDigital Lmao",
    "1814": "@PaulReedWrld @BrooklynNets Bro Harden had more turnovers (16) than made shot (15) in his last 4 games. Not the right time to talk shit",
    "1815": "@TheNBACentral @BrooklynNets @AhnFireDigital Literally nobody cares",
    "1816": "@TheNBACentral @BrooklynNets @AhnFireDigital Big time travel",
    "1817": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1818": "@TheNBACentral @BrooklynNets @AhnFireDigital And people fall for this every summer https://t.co/vL75ILnGnX",
    "1819": "@TheNBACentral @BrooklynNets @AhnFireDigital This just sad, dawg.",
    "1820": "@TheNBACentral @BrooklynNets @AhnFireDigital Stop",
    "1821": "@TheNBACentral @BrooklynNets @AhnFireDigital Y’all really hype any random shit up…",
    "1822": "@TheNBACentral @BrooklynNets @AhnFireDigital Idc. He’s not gonna do it in a live real game",
    "1823": "@TheNBACentral @BrooklynNets @AhnFireDigital The league is in trouble Nets world takeover is beginning",
    "1824": "@daniok7_ @BrooklynNets Nice comeback 🤡",
    "1825": "@BrooklynNets Cam a can Shoot",
    "1826": "@levert_szn @BrooklynNets its fine bro hes left handed. right foot need to be back a little more and his arm is at too much of an angle",
    "1827": "@TheNBACentral @CantGuardBook1 @BrooklynNets @AhnFireDigital Not doing this again… he traveled too.",
    "1828": "@TyreseMaxeySZN @jayshotta21 @CopticRewind @heyltsmio @TheNBACentral @BrooklynNets @AhnFireDigital Oh you don’t understand basketball 😂\nUk other people on that team get the ball right? My God use your brain",
    "1829": "@BolWrld @TheNBACentral @BrooklynNets @AhnFireDigital You stole @MustyHandles tweet",
    "1830": "@BrooklynNets Ben is literally practicing, why do I hear no reports?",
    "1831": "@TheNBACentral @BrooklynNets @AhnFireDigital Fake",
    "1832": "@TheNBACentral @BrooklynNets @AhnFireDigital We’ve seen this mutiple times, we know what the actual result is",
    "1833": "@TheNBACentral @BrooklynNets @AhnFireDigital I could find you a video of him shooting like 5/10 from three ….. wide open in a workout when he was in Philly.",
    "1834": "@TheNBACentral @BrooklynNets @AhnFireDigital \"Who's that coming off the pick &amp; rollllll\" 🤣🤣",
    "1835": "@BrooklynNets OKAY BEN",
    "1836": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1837": "@TheNBACentral @BrooklynNets @AhnFireDigital Not this again lmao",
    "1838": "@TheNBACentral @BrooklynNets @AhnFireDigital Scam likely",
    "1839": "@TheNBACentral @BrooklynNets @AhnFireDigital LFGGG HES BACK EMBIID IS SHAKING",
    "1840": "@TheNBACentral @BrooklynNets @AhnFireDigital Now it’s in season workout videos??? I though the off-season was enough for y’all 😂😂",
    "1841": "@TheNBACentral @BrooklynNets @AhnFireDigital Lol here we go",
    "1842": "@DeanScorpion_ @KD_SZN7 @KD_SZNNN @TheNBACentral @BrooklynNets @AhnFireDigital They don’t know ball",
    "1843": "@TheNBACentral @BrooklynNets @AhnFireDigital we've seen this a bunch of times LOL",
    "1844": "@TheNBACentral @BrooklynNets @AhnFireDigital Ben Simmons when he has to do this in a game https://t.co/wAp9Zd8O1n",
    "1845": "@TheNBACentral @BrooklynNets @AhnFireDigital we not doing this again 😭",
    "1846": "@TheNBACentral @BrooklynNets @AhnFireDigital Not this again 🙋🏽‍♂️",
    "1847": "@BrooklynNets Ben getting better!",
    "1848": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1849": "@mccrystal_alex @TheNBACentral @BrooklynNets @AhnFireDigital As someone who has been in middle school b4 I can confirm",
    "1850": "@TheNBACentral @BrooklynNets @AhnFireDigital I remember those days",
    "1851": "@TheNBACentral @BrooklynNets @AhnFireDigital That's called a travel. I've seen Ben Do shit like this 1000 times. Shit's funny!!!",
    "1852": "@Kevthatniggaa @jayshotta21 @CopticRewind @heyltsmio @TheNBACentral @BrooklynNets @AhnFireDigital Yeah taking the ball out of Kyrie and KD’s hands while getting cooked by Trae Young on defense you should use your brain more😂",
    "1853": "@TheNBACentral @BrooklynNets @AhnFireDigital Nigga this is a TRAVEL! 🤣",
    "1854": "@BrooklynNets BEN 10 SOON ??? 👀👀👀",
    "1855": "@BrooklynNets The star of a thousand workout videos.  (Nick yawns)",
    "1856": "@TheNBACentral @BrooklynNets @AhnFireDigital I did that 27 times today… not impressed",
    "1857": "@TheNBACentral @BrooklynNets @AhnFireDigital He’ll never do it in a game.",
    "1858": "@TheNBACentral @BrooklynNets @AhnFireDigital Bro doing all this to have bad efficiency and barely any points in game 😭",
    "1859": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1860": "@DeanScorpion_ @TheNBACentral @BrooklynNets @AhnFireDigital you gotta page dedicated to Lebron you got no room to talk lol .",
    "1861": "@TheNBACentral @BrooklynNets @AhnFireDigital not falling for it",
    "1862": "@TheNBACentral @BrooklynNets @AhnFireDigital Travels and drains a high school three 👀",
    "1863": "@BrooklynNets You're really killing us with Ben Simmons content",
    "1864": "@jayshotta21 @CopticRewind @heyltsmio @TheNBACentral @BrooklynNets @AhnFireDigital He gonna play the draymond role",
    "1865": "@BrooklynNets LOLOLOLOL",
    "1866": "@BrooklynNets Imagine ben come back 🌧 threes...sixers fans will be so sick 🤣",
    "1867": "@TheNBACentral @BrooklynNets @AhnFireDigital Bro it’s not even the off-season yet",
    "1868": "@BrooklynNets What happened to Ben's back? I hope he is back the team needs it. https://t.co/ToCHGXOUHr",
    "1869": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1870": "@TheNBACentral @BrooklynNets @AhnFireDigital Bum Simmons finally happy enough to play?",
    "1871": "@TheNBACentral @BrooklynNets @AhnFireDigital Ben Simmons everytime he steps into a practice gym https://t.co/N2rUUpT7GI",
    "1872": "@Kevthatniggaa @jayshotta21 @CopticRewind @heyltsmio @TheNBACentral @BrooklynNets @AhnFireDigital You think a guy who hasn’t played on actual game in over a year dealing with back injuries is going to be an instant impact?\n\n“Plz use your brain plz”",
    "1873": "@TheNBACentral @BrooklynNets @AhnFireDigital What an awful post",
    "1874": "@TheNBACentral @BrooklynNets @AhnFireDigital Ok Ben good Travel 👀",
    "1875": "@TheNBACentral @BrooklynNets @AhnFireDigital I love when ppl are impressed by him making a jump shot like he’s a 5 year old.",
    "1876": "@TheNBACentral @BrooklynNets @AhnFireDigital Another gym video. Yay",
    "1877": "I made this from a @BrooklynNets IG post. https://t.co/KBCdc9X1sy",
    "1878": "@TheNBACentral @BrooklynNets @AhnFireDigital Crazy he hit a jump shot",
    "1879": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1880": "@heyltsmio @TheNBACentral @BrooklynNets @AhnFireDigital Someone mad nets won the trade 😭",
    "1881": "@TheNBACentral @BrooklynNets @AhnFireDigital 3 years of these and no improvement 😹",
    "1882": "@minakimes @BrooklynNets CHANCE !!!!!!!!!",
    "1883": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel.",
    "1884": "@TheNBACentral @BrooklynNets @AhnFireDigital This a year round thing 💀",
    "1885": "@TheNBACentral @BrooklynNets @AhnFireDigital Championship 🏆 🔜",
    "1886": "@TheNBACentral @BrooklynNets @AhnFireDigital We do not care",
    "1887": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel to south madagascar",
    "1888": "@HardenFinalsMVP @TheNBACentral @BrooklynNets @AhnFireDigital You applaud harden for shooting over 35%",
    "1889": "@TheNBACentral @BrooklynNets @AhnFireDigital Practice Ben at its finest 👌",
    "1890": "@TheNBACentral @BrooklynNets @AhnFireDigital AND SO IT BEGINS 😭😭😭😭😭😭😭😭",
    "1891": "@daniok7_ @BrooklynNets “Washed” 🤡 https://t.co/BlMfhK4kNb",
    "1892": "@TheNBACentral @BrooklynNets @AhnFireDigital travel",
    "1893": "@TheNBACentral @BrooklynNets @AhnFireDigital He really made two jumpers on the video the Nets posted 🤣🤣🤣",
    "1894": "@BamericaSZN @TheNBACentral @BrooklynNets @AhnFireDigital Watch the video the Nets posted",
    "1895": "@TheNBACentral @BrooklynNets @AhnFireDigital Nigga made an OPEN jump shot lmao",
    "1896": "@JeffHardyStan @TheNBACentral @BrooklynNets @AhnFireDigital neither am i it’s just 1 three then he probably missed the rest 😭",
    "1897": "@jayshotta21 @CopticRewind @heyltsmio @TheNBACentral @BrooklynNets @AhnFireDigital Bruce been avg 14 as of late…..\nBen can do that while: getting more assist, rebounding more and defending better\n\nPlz use your brain plz",
    "1898": "@TheNBACentral @BrooklynNets @AhnFireDigital Oh my fucking god enough of this 😂😂",
    "1899": "@TheNBACentral @BrooklynNets @AhnFireDigital we've been there a few times before and I ain't falling for this 😭",
    "1900": "@TheNBACentral @BrooklynNets @AhnFireDigital No fucking way 👀😰🤭",
    "1901": "@BrooklynNets Why are you getting our hopes high with Ben Simmons?\n\nCome on man.",
    "1902": "@2Daunte2 @TheNBACentral @BrooklynNets @AhnFireDigital Real scary hours",
    "1903": "@TheNBACentral @BrooklynNets @AhnFireDigital It’s that time of the year",
    "1904": "@TheNBACentral @BrooklynNets @AhnFireDigital Lmaooooo the ANNUAL LA FITNESS BEN SIMMONS JUMPSHOTS!!! 😂😂😂😂😂",
    "1905": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1906": "@TheNBACentral @BrooklynNets @AhnFireDigital I swear we’ve seen this and videos of Ben knocking down a jumper in practice so many times. JUST KNOCK THEM DOWN IN A GAME FOR ONCE!",
    "1907": "@TheNBACentral @BrooklynNets @AhnFireDigital BIG BEN DEMON TIME SOOON LFG, PHILLY GONNA CRY OVER THIS NETS ROBBERY FOR YEARS TO COME",
    "1908": "@TavernWISports @TheNBACentral @BrooklynNets @AhnFireDigital I love when the best highlights they ever have of him includes a rattle home jumper",
    "1909": "@TheNBACentral @BrooklynNets @AhnFireDigital oh man this feels so good to be on the opposite of the crowd",
    "1910": "@TheNBACentral @BrooklynNets @AhnFireDigital Weather's getting warm - that can only mean one thing. Time for gym videos of Ben Simmons shooting shots he doesn't shoot in actual basketball games. In no way does this get old.",
    "1911": "@HunterCeltics @heyltsmio @TheNBACentral @BrooklynNets @AhnFireDigital Wasn’t doing it 2 weeks ago",
    "1912": "@TheNBACentral @BrooklynNets @AhnFireDigital Oh not this gag again",
    "1913": "@TheNBACentral @BrooklynNets @AhnFireDigital Yawn",
    "1914": "@BrooklynNets Low key need this been a fan since Vince",
    "1915": "@BrooklynNets KD doesn’t even jump and gets it over the top 😂",
    "1916": "@TheNBACentral @BrooklynNets @AhnFireDigital Nets fans reading the comments https://t.co/Ss1WdjJzCM",
    "1917": "@minakimes @BrooklynNets The funniest part is an ad for Golf Galaxy playing right before the video starts. Very mixed messages",
    "1918": "@TheNBACentral @BrooklynNets @AhnFireDigital Bro took 25 steps",
    "1919": "@TheNBACentral @BrooklynNets @AhnFireDigital Bens A Bum!\nPhilly Never Forgets! https://t.co/F4s9XbiVuA",
    "1920": "@TheNBACentral @BrooklynNets @AhnFireDigital Nope nope, it's a trick lol",
    "1921": "@KD_SZN7 @KD_SZNNN @TheNBACentral @BrooklynNets @AhnFireDigital yeah man he owned me!! i look like a human being 😱",
    "1922": "@TheNBACentral @BrooklynNets @AhnFireDigital I mean we all know Ben Simmons is peak Stephen Curry in an open gym",
    "1923": "@TheNBACentral @BrooklynNets @AhnFireDigital This doesn’t move me anymore",
    "1924": "@TheNBACentral @BrooklynNets @AhnFireDigital I mean he’s been in the gym for two years, I’d hope he could make a 3 after all that",
    "1925": "@TheNBACentral @BrooklynNets @AhnFireDigital Traveled like a mf too 😭",
    "1926": "@TheNBACentral @BrooklynNets @AhnFireDigital We applauding NBA players practicing now?",
    "1927": "@TheNBACentral @BrooklynNets @AhnFireDigital Dudes and NBA player, not to mention #1 pick, and we getting excited over a made jump shot? GTFOH",
    "1928": "@NJtoBKLYN @TheNBACentral @BrooklynNets @AhnFireDigital actual nets fans don’t exist so this makes sense",
    "1929": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1930": "@TheNBACentral @BrooklynNets @AhnFireDigital Cool.\nNow do this in an actual game.",
    "1931": "@KD_SZNNN @DeanScorpion_ @TheNBACentral @BrooklynNets @AhnFireDigital Own that freak",
    "1932": "@TheNBACentral @BrooklynNets @AhnFireDigital @TheNBACentral you’re better than this",
    "1933": "@TheNBACentral @BrooklynNets @AhnFireDigital Doesn’t matter anyway, the Bucks are eliminating them before he even plays a minute",
    "1934": "@CopticRewind @heyltsmio @TheNBACentral @BrooklynNets @AhnFireDigital It’s literally just him doing individual work",
    "1935": "@TheNBACentral @BrooklynNets @AhnFireDigital We seen this so many times",
    "1936": "@TheNBACentral @BrooklynNets @AhnFireDigital This again 💀 https://t.co/m742kIzheW",
    "1937": "@TheNBACentral @BrooklynNets @AhnFireDigital Y’all overreact. The worst player in any 24 can make a three while just shooting around  all casual like😂😂😂",
    "1938": "@DeanScorpion_ @TheNBACentral @BrooklynNets @AhnFireDigital Already surpassed Harden this season btw",
    "1939": "@TheNBACentral @BrooklynNets @AhnFireDigital Bro i coulda did this 💀. and im ass so this vid would be similar",
    "1940": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel + literally anyone who play basketball can make that shot💀😭😭",
    "1941": "@KingTechnical08 @DeanScorpion_ @TheNBACentral @BrooklynNets @AhnFireDigital LMAO embiid draws the most double teams i the league",
    "1942": "@TheNBACentral @BrooklynNets @AhnFireDigital Imagine his first nba shot back he does this and refs like TRAVEL!!!",
    "1943": "@TheNBACentral @BrooklynNets @AhnFireDigital NO ONE IS FALLING FOR THIS SHIT AGAIN",
    "1944": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1945": "@TheNBACentral @BrooklynNets @AhnFireDigital Ok Ben what?🤣🤣🤣",
    "1946": "@TheNBACentral @BrooklynNets @AhnFireDigital Are we serious right now",
    "1947": "@NetsKingdomAJ @BrooklynNets yessir",
    "1948": "@TheNBACentral @BrooklynNets @AhnFireDigital Not the annual Ben Simmons training vids 💀💀",
    "1949": "@TheNBACentral @BrooklynNets @AhnFireDigital An nba player making a three doesn’t deserve a post",
    "1950": "@TheNBACentral @BrooklynNets @AhnFireDigital He WOULD NOT survive in the 60s. Hes lucky this era is as soft as he is",
    "1951": "@TheNBACentral @JakeNFLNBA @BrooklynNets @AhnFireDigital not again….",
    "1952": "@heyltsmio @TheNBACentral @BrooklynNets @AhnFireDigital Simmons &gt; Harden I fear",
    "1953": "@DeanScorpion_ @TheNBACentral @BrooklynNets @AhnFireDigital Not a single nets fan in the comments and u meat riding LMFAO",
    "1954": "@TheNBACentral @BrooklynNets @AhnFireDigital Doesn't matter it's practice",
    "1955": "@TheNBACentral @BrooklynNets @AhnFireDigital not moved",
    "1956": "@TheNBACentral @BrooklynNets @AhnFireDigital For only one shot? https://t.co/WTcgNL7AG5",
    "1957": "@BrooklynNets Ben Simmons https://t.co/zyOu7suDRY",
    "1958": "@heyltsmio @TheNBACentral @BrooklynNets @AhnFireDigital Simmons is better than harden",
    "1959": "@TheNBACentral @BrooklynNets @AhnFireDigital Y’all really gotta stop posting this shit",
    "1960": "@TheNBACentral @BrooklynNets @AhnFireDigital We’re not starting with this again please… nope",
    "1961": "@mel_pesos @TheNBACentral @BrooklynNets @AhnFireDigital Maybe in Cancun 😹😹",
    "1962": "@TheNBACentral @BrooklynNets @AhnFireDigital Seen this episode before... not fooling anybody.",
    "1963": "@TyHxndo @TheNBACentral @BrooklynNets @AhnFireDigital Mhmm",
    "1964": "@TheNBACentral @BrooklynNets @AhnFireDigital League should be worried if Ben Simmons improves his shot",
    "1965": "@TheNBACentral @BrooklynNets @AhnFireDigital He drops a video of him taking jump shots every year lol",
    "1966": "@TheNBACentral @BrooklynNets @AhnFireDigital Clunky ass bucket",
    "1967": "@DeanScorpion_ @TheNBACentral @BrooklynNets @AhnFireDigital he's gonna thrive now that he's playing with actual floor spacers fatty",
    "1968": "is Ben hitting jumpers off the run &amp; catch? and hit a dribble pull-up? most importantly... HE IS DOING FULL SPEED MOVES 😩\n\ngo tune into @BrooklynNets IG to see their latest post 😎",
    "1969": "@TheNBACentral @BrooklynNets @AhnFireDigital Do it in the game",
    "1970": "@TheNBACentral @BrooklynNets @AhnFireDigital i’ve been numbed to this 3 summers ago",
    "1971": "@DBball12 @TheNBACentral @BrooklynNets @AhnFireDigital I hope so too",
    "1972": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel 🧳",
    "1973": "@TheNBACentral @BrooklynNets @AhnFireDigital This has to be a joke right? A middle schooler can do this shit.",
    "1974": "@TheNBACentral @BrooklynNets @AhnFireDigital Its the same shit every year",
    "1975": "@TheNBACentral @BrooklynNets @AhnFireDigital please stop posting this",
    "1976": "Needs to see it a game to believe it my boy 🤦🏾‍♂️ RT @TheNBACentral: Ok Ben 👀\n\n(Via @BrooklynNets| h/t @AhnFireDigital)  https://t.co/wEW37HVTJY",
    "1977": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1978": "@TheNBACentral @BrooklynNets @AhnFireDigital lol ok",
    "1979": "@TheNBACentral @BrooklynNets @AhnFireDigital he’s been practicing threes in shootarounds for years lmao",
    "1980": "@TheNBACentral @BrooklynNets @AhnFireDigital Here we go again",
    "1981": "@JakkMane @BrooklynNets You acting like it's intentional. . You gotta look at it this way.. he has 4 or 5 guards ahead of him with 2 being superstars... so I mean of course he gotta do something b4 he's taken out... the guy been on the bench for a bit now. . He's gonna get cold 🥶",
    "1982": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1983": "@TheNBACentral @BrooklynNets @AhnFireDigital Don’t start 😭😭😭",
    "1984": "@illestReborn @TheNBACentral @BrooklynNets @AhnFireDigital Hopefully you're wrong",
    "1985": "@TheNBACentral @BrooklynNets @AhnFireDigital No one is falling for this lil bro…..",
    "1986": "@TheNBACentral @BrooklynNets @AhnFireDigital LeBron traveled",
    "1987": "@TheNBACentral @BrooklynNets @AhnFireDigital We’ve seen this before, don’t worry he’ll be airballing free throws by next season",
    "1988": "@TheNBACentral @BrooklynNets @AhnFireDigital Is that’s a new jumpshot?",
    "1989": "@TheNBACentral @BrooklynNets @AhnFireDigital Omg an nba player made a practice 3. He’s been in the league too long for this shit",
    "1990": "@TheNBACentral @BrooklynNets @AhnFireDigital we do this every year",
    "1991": "@TheNBACentral @BrooklynNets @AhnFireDigital Not this shit again",
    "1992": "@TheNBACentral @BrooklynNets @AhnFireDigital pls stop",
    "1993": "@TheNBACentral @BrooklynNets @AhnFireDigital Dont fall for it",
    "1994": "@TheNBACentral @BrooklynNets @AhnFireDigital Nah this ain’t enough",
    "1995": "@TheNBACentral @BrooklynNets @AhnFireDigital An NBA player is making shots in a practice facility?? Woah 🤯",
    "1996": "@TheNBACentral @BrooklynNets @AhnFireDigital I’m nice like that",
    "1997": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "1998": "@TheNBACentral @BrooklynNets @AhnFireDigital no way y’all doing this again",
    "1999": "@TheNBACentral @BrooklynNets @AhnFireDigital League in trouble...",
    "2000": "@TheNBACentral @BrooklynNets @AhnFireDigital Not again 😂",
    "2001": "@TheNBACentral @BrooklynNets @AhnFireDigital They tried to record that 100x before he made it",
    "2002": "@TheNBACentral @BrooklynNets @AhnFireDigital he doesn’t do this in games, why even hype him up",
    "2003": "@TheNBACentral @BrooklynNets @AhnFireDigital He traveled. Doesnt count",
    "2004": "@TheNBACentral @BrooklynNets @AhnFireDigital Are we supposed to be impressed???",
    "2005": "@TheNBACentral @BrooklynNets @AhnFireDigital Why da vid so short💀",
    "2006": "@EricStokesSzn6 @TheNBACentral @BrooklynNets @AhnFireDigital How is playing the Suns lucky",
    "2007": "@TheNBACentral @BrooklynNets @AhnFireDigital We really gonna hype this mf up for this? DUDE HAS BEEN DOING THIS SHIT FOR YEARS NO ONE CARES ANYMORE",
    "2008": "@TheNBACentral @BrooklynNets @AhnFireDigital this happens every single year",
    "2009": "@TheNBACentral @BrooklynNets @AhnFireDigital Yeaaaaaa we don’t care",
    "2010": "@TheNBACentral @BrooklynNets @AhnFireDigital Triple double first gane I’m calling it",
    "2011": "@heyltsmio @TheNBACentral @BrooklynNets @AhnFireDigital No one cares about his shooting anymore. It’s just the fact he’s back practicing",
    "2012": "@TheNBACentral @BrooklynNets @AhnFireDigital One made jumper gets a post 😭",
    "2013": "@TheNBACentral @BrooklynNets @AhnFireDigital Ben Simmons in practice https://t.co/owu3bNgdmU",
    "2014": "@TheNBACentral @BrooklynNets @AhnFireDigital My goat",
    "2015": "@TheNBACentral @BrooklynNets @AhnFireDigital travel btw",
    "2016": "@TheNBACentral @BrooklynNets @AhnFireDigital oh wow, a guy that makes literally 30 mill a year hit ONE THREE IN PRACTICE😭😭😭😭😭",
    "2017": "@TheNBACentral @BrooklynNets @AhnFireDigital His first game back https://t.co/fXtujE2HGX",
    "2018": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel",
    "2019": "@TheNBACentral @BrooklynNets @AhnFireDigital one three pointer deserves a post? for real?",
    "2020": "@TheNBACentral @BrooklynNets @AhnFireDigital These never mean anything, let's see him in a game.",
    "2021": "@TheNBACentral @BrooklynNets @AhnFireDigital This took 300 takes.",
    "2022": "@TheNBACentral @BrooklynNets @AhnFireDigital We’ve seen this 100x",
    "2023": "@TheNBACentral @BrooklynNets @AhnFireDigital Anyone can fuckin do this bro",
    "2024": "@TheNBACentral @BrooklynNets @AhnFireDigital Travel?🤣",
    "2025": "@TheNBACentral @BrooklynNets @AhnFireDigital lmaaao no way y’all posted this",
    "2026": "@TheNBACentral @BrooklynNets @AhnFireDigital one shot?? i was expecting more",
    "2027": "@TheNBACentral @BrooklynNets @AhnFireDigital Ok he made a practice three so what? 😭😭",
    "2028": "@TheNBACentral @BrooklynNets @AhnFireDigital are we really still doing this?",
    "2029": "@TheNBACentral @BrooklynNets @AhnFireDigital I see y’all still getting fooled by his practice clips",
    "2030": "@TheNBACentral @BrooklynNets @AhnFireDigital We’ve seen this movie before",
    "2031": "@TheNBACentral @BrooklynNets @AhnFireDigital Not moved",
    "2032": "@TheNBACentral @BrooklynNets @AhnFireDigital now play",
    "2033": "@TheNBACentral @BrooklynNets @AhnFireDigital Seen this before",
    "2034": "@TheNBACentral @BrooklynNets @AhnFireDigital Why we falling for this again",
    "2035": "@TheNBACentral @BrooklynNets @AhnFireDigital We’ve seen these videos for the past 4 years…..",
    "2036": "@TheNBACentral @BrooklynNets @AhnFireDigital He made a three….. Wow so cool💀",
    "2037": "@TheNBACentral @BrooklynNets @AhnFireDigital How many tries?",
    "2038": "@TheNBACentral @BrooklynNets @AhnFireDigital we not doing this again",
    "2039": "@TheNBACentral @BrooklynNets @AhnFireDigital From a sixers fan don’t get excited",
    "2040": "@TheNBACentral @BrooklynNets @AhnFireDigital He’s not even gonna shoot in a real game why are we even watching this",
    "2041": "@TheNBACentral @BrooklynNets @AhnFireDigital I can do that. Lmao",
    "2042": "@TheNBACentral @BrooklynNets @AhnFireDigital LMAOO NETS FANS GETTING EXCITED OVER THIS IS PURE COMEDY 😂😂😂",
    "2043": "@TheNBACentral @BrooklynNets @AhnFireDigital bruh we see this every year I ain’t that surprising",
    "2044": "@TheNBACentral @BrooklynNets @AhnFireDigital Oh brother",
    "2045": "@TheNBACentral @BrooklynNets @AhnFireDigital Ok and?? This ain’t no damn scary hours",
    "2046": "@TheNBACentral @BrooklynNets @AhnFireDigital You’re falling for it again",
    "2047": "@TheNBACentral @BrooklynNets @AhnFireDigital here we go again",
    "2048": "@TheNBACentral @BrooklynNets @AhnFireDigital We seen these before😭😭😭",
    "2049": "@TheNBACentral @BrooklynNets @AhnFireDigital Mf that’s one three",
    "2050": "@TheNBACentral @BrooklynNets @AhnFireDigital oh no we philly fans know all about this",
    "2051": "@TheNBACentral @BrooklynNets @AhnFireDigital Stop posting this shit every year",
    "2052": "@TheNBACentral @BrooklynNets @AhnFireDigital That’s 1 three💀",
    "2053": "@TheNBACentral @BrooklynNets @AhnFireDigital Ain’t no way y’all posted that",
    "2054": "@TheNBACentral @BrooklynNets @AhnFireDigital He does this every summer",
    "2055": "@TheNBACentral @BrooklynNets @AhnFireDigital Damn he made 1 3 omg !",
    "2056": "@TheNBACentral @BrooklynNets @AhnFireDigital SHAMELESS",
    "2057": "@TheNBACentral @BrooklynNets @AhnFireDigital he tricks y’all every time",
    "2058": "@TheNBACentral @BrooklynNets @AhnFireDigital we not doing this again lmfao",
    "2059": "@TheNBACentral @BrooklynNets @AhnFireDigital stop",
    "2060": "@TheNBACentral @BrooklynNets @AhnFireDigital Smoke screen",
    "2061": "@TheNBACentral @BrooklynNets @AhnFireDigital not falling for this",
    "2062": "@TheNBACentral @BrooklynNets @AhnFireDigital We don’t care",
    "2063": "@TheNBACentral @BrooklynNets @AhnFireDigital Demon time",
    "2064": "@TheNBACentral @BrooklynNets @AhnFireDigital MY GOAT 🐐",
    "2065": "@TheNBACentral @BrooklynNets @AhnFireDigital Goats back",
    "2066": "The #Mets right now are a good reminder that in about 50 years, the @BrooklynNets will have a semi-respectable fanbase. https://t.co/JcVeUIgzcs",
    "2067": "@BrooklynNets Ben the sharpshooter 🎯",
    "2068": "@BrooklynNets Ben10 soon come 👀",
    "2069": "@ILoveLukaMagic @BrooklynNets If you really think Ben is injured u must be stupid",
    "2070": "@FinnVegetables @notorioustei @BrooklynNets as a sixers fan im just automatically attracted to ben simmons practice shooting videos what can i say",
    "2071": "@BrooklynNets Scary hours 😈😈",
    "2072": "@JfromBk @BrooklynNets Where are the people at who said he won’t practicing yet 😂😂😂👀👀😎",
    "2073": "@BrooklynNets Please",
    "2074": "@2Daunte2 @levert_szn @BrooklynNets that form ass",
    "2075": "@2Daunte2 @BrooklynNets ik, im just curious when he’s coming back",
    "2076": "@BrooklynNets Ben just hit a catch and shoot 3???",
    "2077": "@BehemothBaller @BrooklynNets is he almost ready is my main point, but the shooting is getting me excited lol",
    "2078": "@BrooklynNets Ben is ready for PO😍😍",
    "2079": "@BrooklynNets If Ben really has developed his jumper - even to a small extent...watch out. Who's gonna stop this team when Ben is dropping dimes to Irving, KD, Brown, Curry, and occasionally pulling up when open? Simmons gotta hit the floor soon dawg.",
    "2080": "@Moody504___ @BrooklynNets i wanna know when he’s coming back",
    "2081": "@BrooklynNets Yes nets fans, fall for the videos",
    "2082": "@Cartier94555490 @BrooklynNets I think he definitely worked on his shot / form over the summer and while sat out for sixers",
    "2083": "@BrooklynNets Wtf his back looks fine this some bs",
    "2084": "@BrooklynNets Ben Simmons sightingsss",
    "2085": "@Tayx2times @BrooklynNets Yea but you dont gain mins by taking bad shots",
    "2086": "@BrooklynNets Ben after he hits a turnaround jumper on air https://t.co/Od8swIPFaZ",
    "2087": "@BrooklynNets BEN SIMMONS ACTUALLY DOING SOMETHING ??? the chip is ours",
    "2088": "@BrooklynNets kyle korver is the real savior of the nets",
    "2089": "@BrooklynNets Ben simmons shooting and not missing i used to pray for times like this https://t.co/J78EssEteE",
    "2090": "@BrooklynNets BEN SIMONS CAN SHOOT!",
    "2091": "@BrooklynNets Soon come 🔥🔥🔥💯🙏🏾 https://t.co/IlCTFo1HNZ",
    "2092": "@ArchieMcMurphy @BrooklynNets true story",
    "2093": "@BrooklynNets ben simmons the type of dude to shoot like curry in PRACTICE but cant make a fuckin three throw to save ukraine",
    "2094": "@BrooklynNets WHAT?",
    "2095": "@BrooklynNets Ok simmons I see u 👀",
    "2096": "@BrooklynNets Ben running 👀👀👀",
    "2097": "@CopticRewind @BrooklynNets I fully agree 🤝",
    "2098": "@BrooklynNets Ben looking like KD 🤣 https://t.co/1IREaGXwc2",
    "2099": "@BrooklynNets Don’t give false hope on Ben. Please tell us that he will be ready in not so distance future.",
    "2100": "@BrooklynMer1 @BrooklynNets We just want him on the court",
    "2101": "@BrooklynNets I see Ben10 👀",
    "2102": "@BrooklynNets Thank you for posting Ben finally",
    "2103": "@BrooklynNets BEN JUMPER SIGHTING EAST IS COOKED",
    "2104": "@BrooklynNets Dont post these Ben shooting vids when we all know he not gone do this in Game ..",
    "2105": "@BrooklynNets Like usual 🤷",
    "2106": "@BrooklynNets Where is that fake Ben Simmons back pain",
    "2107": "@BrooklynNets Ik Ben won’t shoot in games but he’s jumper actually looks much smoother",
    "2108": "@BrooklynNets BEN GET BACK ON THE DAMN COURT",
    "2109": "@BrooklynNets LETS GET IT BEN",
    "2110": "@BrooklynNets BEN 10 SOON",
    "2111": "@BrooklynNets Future first round exits 🔥🔥🔥",
    "2112": "Brooklyn Nets Ben Simmons Spotted at Weekend Practice 👀👀 Ben 10 🔥🔥 #NetsWorld https://t.co/kqSHypc5MV",
    "2113": "Brooklyn Nets and @KDTrey5 with all due respect https://t.co/nPFpcf3V3m",
    "2114": "@BrooklynNets Ben running?",
    "2115": "@BrooklynNets so is ben playing?",
    "2116": "Working on the weekend. https://t.co/VSOY7Ivf0e",
    "2117": "@NBA as a Nets fan and a HUGE Kevin Durant fan I love it when Brooklyn is on national television.\n\nWith that said, why on earth is Pacers vs Nets the 3:30 PM game featured on @espn and not Bucks vs Cavs which has equally HUGE playoff implications on the line for both teams??????",
    "2118": "Sooo…this is trouble for the #Celtics if they want to avoid #Nets. \n\nI’m fine with Brooklyn-Boston, but as I wrote today in @BostonSportsBSJ, the reeling #Bulls are the far easier path: https://t.co/GN0U3Lhm5J https://t.co/GV0hoT2uJK",
    "2119": "@BrooklynNets Please make sure that we lock up Bruce so that will play for this Nets for the next 5 seasons 🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾",
    "2120": "@MarkJonesESPN @TyHaliburton22 @ESPNNBA @Pacers @BrooklynNets good flicks, mark ! 😁",
    "2121": "🏀 Indiana Pacers (@Pacers) #GoldBlooded\n🆚 L @ Philadelphia 76ers #Sixers #INDvsPHI\n⏭️ Brooklyn Nets #NetsWorld #INDvsBKN\n✈️ N649DL | DAL8927 | B752\n🛫 PHL - 5:39 pm ET\n🛬 EWR - 6:11 pm ET\n📡 Tracking: https://t.co/q2jiUT2TaX https://t.co/qKgxbi151u",
    "2122": "@BrooklynNets I want it in Extra Large please 😀",
    "2123": "If that was an empty net that puck woulda went to Brooklyn",
    "2124": "After 81 games, the Brooklyn Nets can control their own playoff position Sunday afternoon, even if it is not necessarily where they were projected to be when the marathon regular season began in October.\n\nhttps://t.co/yKtQnYzmEE https://t.co/0GyXwFH4xF",
    "2125": "@NetsRepublic @BrooklynNets Net is my team",
    "2126": "@BrooklynNets @ImperialLunch My son is a huge fan. He just bought your jersey! He would absolutely be over the moon!",
    "2127": "@BrooklynNets Pick me pick me\nPlease Please Please \n🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾\n\nI want one please. I’ll be sitting in the BK Block with the squad, Section 1, row 23, seat 5\n\nPlease stop by and drop off my shirt 🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾",
    "2128": "@MarkJonesESPN @TyHaliburton22 @ESPNNBA @Pacers @BrooklynNets Yessir! My guy Ty! Ain’t had one of his games since Iowa St!",
    "2129": "@sherlockirvingx @BrooklynNets “I don’t care if it’s the regular season that motherfucker felt like a playoff game”",
    "2130": "@MarkJonesESPN @TyHaliburton22 @ESPNNBA @Pacers @BrooklynNets Love him so much",
    "2131": "If we play the nets I’ll find a way to get there in Brooklyn and meet you there . https://t.co/xWJN94e9IN",
    "2132": "@BrooklynNets damn give me",
    "2133": "@BrooklynNets NEED IT",
    "2134": "@abdz24 Partially, and Brooklyn’s defense is pretty porous I think. \n\nEven without Time-Lord, Boston is still a ridiculously good defensive unit and I’m not sure I’m sold on the Nets’ ancillary pieces around Kyrie/KD",
    "2135": "@BrooklynNets Sounding like a hata!! He's having a good time joking around and you can't take it. Would of been nice though!!",
    "2136": "Someone in Nets spaces yesterday said the only two teams that can score a ton of points quickly in the league were Brooklyn and Golden State. Memphis would like a word.",
    "2137": "@BrooklynNets yall forced kai into this",
    "2138": "@BrooklynNets Bruce is only fuckin around 😂",
    "2139": "@James_Blairx @NBA @KDTrey5 @BrooklynNets Best player in the league is Lucas doncic but he white.problem.",
    "2140": "@BrooklynNets Got it at the game last night. LETS GO!!! #NetsWorld https://t.co/KPQ41NUTFx",
    "2141": "@jennynoir @BrooklynNets 😂😂😂😂 and I’m serious.",
    "2142": "@loIjets If nets get the bucks then it’s up for Brooklyn but if they play the heat it’s not so 💀",
    "2143": "I want the @Bucks in the first round! Let’s go @KDTrey5 @KyrieIrving @BrooklynNets",
    "2144": "@ThesingingKG @BrooklynNets Literally was asking myself that",
    "2145": "@Ithanhudsonn1 @BrooklynNets Legit??",
    "2146": "Play-In Picture: @BrooklynNets rise to 7th ahead of finale\nhttps://t.co/2JLLtk61g2",
    "2147": "@BrooklynNets I’ll do anything",
    "2148": "#BrooklynNets vs Cleveland Cavaliers Full Game Highlights | 2021-22 NBA Season\n🏀https://t.co/K9vaDAE22o\n\nMore: https://t.co/zeNMXgH1iR\n\n@BrooklynNets  #NBA #basketball https://t.co/7R5CE2Wp3x",
    "2149": "@biancarhoads27 @kaiishome @BrooklynNets Amazing!! Thank you.. Just 2 ordered💯",
    "2150": "@biancarhoads27 @DanielA93676249 @BrooklynNets Amazing!! Thank you.. Just 2 ordered💯",
    "2151": "@biancarhoads27 @slurpxed @BrooklynNets Amazing!! Thank you.. Just 2 ordered💯",
    "2152": "@biancarhoads27 @itzjxhnnn04 @BrooklynNets Amazing!! Thank you.. Just 2 ordered💯",
    "2153": "@biancarhoads27 @JaredKempner @BrooklynNets @Jason__Schwartz @KyrieIrving Amazing!! Thank you.. Just 2 ordered💯",
    "2154": "@biancarhoads27 @BehemothBaller @BrooklynNets Amazing!! Thank you.. Just 2 ordered💯",
    "2155": "@BrooklynNets Love this shirt",
    "2156": "@biancarhoads27 @WorldKyrie @BrooklynNets Amazing!! Thank you.. Just 2 ordered💯",
    "2157": "@biancarhoads27 @Philknowsball7 @BrooklynNets Amazing!! Thank you.. Just 2 ordered💯",
    "2158": "@biancarhoads27 @NetsDepiction @BrooklynNets Amazing!! Thank you.. Just 2 ordered💯",
    "2159": "@mcten No more Big-3 sightings on the court is a good thing. 👍 The Brooklyn Nets Big-3 experiment was a failure and the Lakers Big-3 experiment was a failure, needed a SHARPSHOOTER included in the Lakers Big-3.",
    "2160": "@biancarhoads27 @NetsViewer @BrooklynNets Amazing!! Thank you.. Just 2 ordered💯",
    "2161": "@biancarhoads27 @NosleepAaaa @BrooklynNets Amazing!! Thank you.. Just 2 ordered💯",
    "2162": "@biancarhoads27 @NetsWrld11 @BrooklynNets Amazing!! Thank you.. Just 2 ordered💯",
    "2163": "Let’s see…\nOption A: Play Nets 1st round \nOption B: Play Bulls 1st round and the winner of a definitely grueling series between BOS/PHI vs Brooklyn. https://t.co/xLwPCXGRQv",
    "2164": "If Milwaukee bucks vs Brooklyn Nets happen at the east first rounf playoffs. Who do you got ? KD or Giannis ? \n#NBA #Playoffs #BrooklynNets #Milwaukee #bucks",
    "2165": "@BrooklynNets We need an explanation https://t.co/tstRJS87Id",
    "2166": "@BrooklynNets I want it,please!!",
    "2167": "@chibigo72 The Chicago 🐻 , NY Yankees , Brooklyn Nets!!",
    "2168": "@BrooklynNets It would be an honor to get a signed shirt from the best point guard in the league!",
    "2169": "Thank you #teampixel for having me at the @BrooklynNets vs @cavs game last night! I had a blast! #giftfromgoogle #pixel6pro https://t.co/hKny4kOlMl",
    "2170": "@Emmellene That would be extra lit tho. We could use @MetLifeStadium stadium for a @nyknicks game and(or) @BrooklynNets",
    "2171": "@berrywtw @BrooklynNets whole team tho?",
    "2172": "Meet Brooklyn Beckham's billionaire in-laws Nelson and Claudia Peltz with epic net worth - Mirror Online | @scoopit https://t.co/tIYJ8Ol6Mj",
    "2173": "For 54 years, Herb Turetzky was the official scorer of the Brooklyn Nets franchise. He charted field goals, assists and rebounds as the team moved from the A.B.A. to the N.B.A. and played in eight local arenas. He has died at 76. https://t.co/APrrzDSRmA",
    "2174": "@BrooklynNets This would be great to have! Thanks for the opportunity to win this! 🙌🤞⚫️⚪️",
    "2175": "The star-studded Brooklyn Nets won’t win the NBA championship and Andrew Bogut can’t see Ben Simmons making a difference if he returns from his back injury. Read his column now. \n\nhttps://t.co/qoKqIJ94KY",
    "2176": "The 76ers will travel back to Philly in hopes to eliminate the Brooklyn Nets. The series is currently 3-1.",
    "2177": "@robinlundberg Even though they didn't I still believe the @BrooklynNets  with KD can beat the Bucks and any other team in the Eastern and Western Conferences. People gotta stop saying not the Bucks in round 1. Stop running from the challenge and embrace it. Fear no man or team! ✌️😐",
    "2178": "In thinking about the increasing likelihood of facing Brooklyn in round one, I will say this: The only sustainable formula for beating the Celtics these past 3 months is playing elite lockdown defense and taking it to another level in crunchtime.\nThat… does not describe the Nets",
    "2179": "For me:\n\n1) Miami Heat\n2) Brooklyn Nets\n3) Boston Celtics\n4) Milwaukee Bucke\n5) Philadephia 76ers\n6) Cleveland Cavaliers\n7) Toronto Raptors\n8) Chicago Bulls\n\nAnd I think all 8 teams would have close records",
    "2180": "@Larry_924 @UFANYC @KyrieIrving @BrooklynNets @nyknicks @Yankees @Mets @NYRangers @NYCFC @SenSchumer @RepYvetteClarke @NydiaVelazquez What percentage are you paying?\n\nDont you pay your own?\n\nThat's the deal\n\nYou work you pay \n\nYou dont work you live off a system and ultimately may become unemployed on welfare or homeless\n\nPeople that work have self esteem and make good choices",
    "2181": "Nets face Pacers trying to secure East's seventh seed  #NBA\n #BrooklynNets #BrooklynGrit #Pacers #GoPacers https://t.co/ItHFlmLEaV",
    "2182": "@NetsRepublic @BrooklynNets Ha! It probably will not happen but would it not be just deserts if Kyrie infected KD or other teammates? Then they would be brothers in protocol.",
    "2183": "@BrooklynNets Die hard brooklyn fan and so is my son https://t.co/CUoSmEGwFY",
    "2184": "@BrooklynNets ME PLEASE I'M BEGGING",
    "2185": "@balldontstop @BrooklynNets What? You can go to some highschools and gyms and see those shots performed. You do not need to be 7 feet to shoot a one leg runner. Research earlier players, Elgin Baylor, Jerry West etc etc.",
    "2186": "@BrooklynNets He wanted Brown to focus on getting the win rather than chasing stat",
    "2187": "The Blockbuster Trade Idea: LeBron James To The Brooklyn Nets For 5 Players And A First-Round Pick\nhttps://t.co/GmjWc4jSTf",
    "2188": "Celtics are going to get the 2 seed and face Brooklyn round 1, and man that is unfortunate for the Nets.",
    "2189": "Fuck it..rematch me hoe @BrooklynNets",
    "2190": "@BrooklynNets I need it badly @BrooklynNets",
    "2191": "@gabeisepic1 Did he own them in the wildcard game last year ?? Brooklyn nets suck",
    "2192": "Bucks don’t want the Nets. Boston takes the 2 see cause the 6ers are ass. Boston and Brooklyn first round. C’s in 6. LFG. https://t.co/bW3K74rTk5",
    "2193": "@BrooklynNets @KDTrey5 Jesus! He has the dimensions of a crackhead! Amazing his stability and gracefulness on the court. He just may be the best basketball player in the world built like Pookie on New Jack City.",
    "2194": "@deathrowdj Bucks won 2 on the road vs Miami in the 1st round to win the series\n\nBeat the nets @ Brooklyn in game 7 to win the series \n\nBeat the hawks in Atlanta in game 6 to win the series \n\nBeat suns game 5 in Phoenix. \n\nI 100% doubt they care about home court advantage.",
    "2195": "@KyrieIrving been a Brooklyn Nets \nFan since the Jason Kidd trade been a fan of yours since the rookie sophomore all star game. Is New Haven CT too far for tickets ?",
    "2196": "Brooklyn!!!! KD a DMV baby running NYC 2!!! #brooklyn #nets #brooklynnets #kd #kevindurant #dmv #nba @ Brooklyn Nets https://t.co/gpixRiwP5T",
    "2197": "@BrooklynNets Me and @Jason__Schwartz are @KyrieIrving biggest fans we need this shirt!!!",
    "2198": "“Ya not getting it tonight” says Kevin Durant about Bruce Brown’s triple double last night against the Cleveland Cavaliers… 😂!!! #kevindurant #brucebrown #brooklynnets #netsnation #toofunny https://t.co/k7PIOwzEEq",
    "2199": "@BrooklynNets \n\nBruce Brown Is Good",
    "2200": "@BrooklynNets Indonesian fans here🥺",
    "2201": "@MyBaeVillegas @BrooklynNets I alr have one but I’d like an actual signed one by kyrie",
    "2202": "The regular season is wrapping up, I want to give a huge thank you to all of you for making this such an amazing season to cover the Brooklyn Nets, all improvement from here on out! \n\nPlayoffs 🔜",
    "2203": "@NateIsHere_ Same but now our chances rise a ton like tomorrow we should win like I think we will if we bring that same energy we had against Brooklyn we didn’t play bad against the nets but Durant does dursnt things. Then in the play in we get two games to just win one and Allen back prob",
    "2204": "@BrooklynNets Cold 😂😂😂",
    "2205": "MyFitteds Exclusive New Era “Love Bed Stuy” Brooklyn Nets Corduroy Brim 7 1/8 https://t.co/CGBqEBx3Sm eBay https://t.co/j7b0swNSab",
    "2206": "@BrooklynNets mavs will give u sterling brown for KD straight up take it or leave it",
    "2207": "@BrooklynNets Net fans why is it Kai instead of Ky?",
    "2208": "@BrooklynNets Woo! Nice",
    "2209": "Good win last night against the Cleveland Cavaliers… the  Indiana Pacers are up next. The last game of the regular season… LET’S GO NETS!!! I don’t own the rights to this song. #netsworld #brooklynnets #noexcuses #wegohard #BROOOOOKLYN  https://t.co/lohqoDOnlb",
    "2210": "The brooklyn nets entering the #Metaverse is fire!!! A new way to enjoy the game on the court . Kind of wild actually",
    "2211": "@BrooklynNets Need this BADLY",
    "2212": "@durantmuse @BrooklynNets Ain't no way u got a signed kd jersey...",
    "2213": "@RichBoyNation @BrooklynNets OMMMGGG THANKK YOU 😮‍💨🐐",
    "2214": "@BrooklynNets @JaredKempner this would be so cool!!!",
    "2215": "@BrooklynNets Kai with the hook up 🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽",
    "2216": "Last night at the Brooklyn Nets game. …  for the Record I’m a Knick fan but my little brother is a Brooklyn Nets fan so I accompanied him !!. Great win for the Nets https://t.co/skNhIkpKdp",
    "2217": "@BrooklynNets He missed around and almost got a triple double. That’s what we need from him in the playoffs. Play harder and do the dirty work. Those four blocks and those rebounds were more important than the assists and points. Those were just a bonus. Great job Bruce. Keep it up. GO NETS!!!",
    "2218": "@BrooklynNets Still can’t believe 10,000 ppl came before me for last night’s game 😂",
    "2219": "@BrooklynNets Thats big time! Lets go Nets! 😄 https://t.co/iTzxAca8Az",
    "2220": "@BellsKay @BrooklynNets @IamJJ16 😂😂😂 I know man 😂",
    "2221": "@BrooklynNets Plssss a big Kai fan !! Need this",
    "2222": "@BrooklynNets I saw KD play in Fayetteville AR in 2004-2005ish... Still dominating the same way as in AAU haha stay up!",
    "2223": "I've never seen anyone continually play a player that make the team so much WORSE than SteveNash and BrooklynNets do playing James Johnson",
    "2224": "Brooklyn Nets Russian oligarch and former NBA team owner immigrates to Israel https://t.co/yvz8Ake9vh",
    "2225": "@BrooklynNets Send that",
    "2226": "@_liladelilah @BrooklynNets @KDTrey5 Super stoked!",
    "2227": "@BrooklynNets Swing that this way",
    "2228": "@MyBaeVillegas @BrooklynNets Come on I only had the energy to tell one scam bot to lick my balls. Now you're both getting reported🗿",
    "2229": "@BrooklynNets anticipate double team and passes to young legs= bucket....",
    "2230": "@RichBoyNation @BrooklynNets Hey lick my balls Taylor https://t.co/IvZ7OYbDK0",
    "2231": "@BrooklynNets I needs!!",
    "2232": "@BrooklynNets Wow that 🔥",
    "2233": "@BrooklynNets I will retweet this but just know I'm waiting on another Blake giveaway",
    "2234": "@BrooklynNets @DarrellNeloms That shirt wrinkle 😅🤣",
    "2235": "@Ithanhudsonn1 @BrooklynNets Love thes",
    "2236": "@Ithanhudsonn1 @BrooklynNets Nice",
    "2237": "@BrooklynNets @BrooklynNets  please !",
    "2238": "@Keith_McPherson at least Brooklyn NETS got that 7 seed...yes I know it's YANKEES time now..still a long way to go in this game though",
    "2239": "@MVprobs @BrooklynNets Need",
    "2240": "@MVprobs @BrooklynNets Nice",
    "2241": "BROOKLYN NETS \"LOVE BED STUY\" now available from MYFITTEDS\n\n#newdrop #myfitteds #nba #brooklynnets #nets #wegohard #brooklyn #newyork #love #bed #stuy #hatcrawler #fitted #thecaptheproswear #wearwhattheproswear #hataddict #fittedcaps\n\nhttps://t.co/ixUhu9kOW7",
    "2242": "Congratulations to gb629 (@geneb629) who moved up 15 spots to take #25 on the Brooklyn Nets team leaderboard.\n\nhttps://t.co/8yzss9CSSP",
    "2243": "@MVprobs @BrooklynNets I went to the game and got one, Im takjking bout the signed one",
    "2244": "@MichaelRyanRuiz I'm scared how much that was I paid $40 for 2 cans at the Brooklyn Nets 😆",
    "2245": "@BrooklynNets kai with 7 cap!!! much love from overseas BK fans",
    "2246": "@BrooklynNets I want it",
    "2247": "@BrooklynNets W let me get one",
    "2248": "@BrooklynNets Lemme get one!",
    "2249": "@BrooklynNets I NEED THIS",
    "2250": "@BrooklynNets plss I  would love oneee",
    "2251": "@BrooklynNets Definitely not gon be available to attend the game so I’d love it if y’all send me one",
    "2252": "@BrooklynNets Damn i really need it",
    "2253": "@BrooklynNets Bro why can i do this at the same rhythm and with both hands but still got terrible handles 😭",
    "2254": "@BrooklynNets Good &amp; awesome result. Let it continue throughout the playoffs. Am happy for the Nets.",
    "2255": "@cleabbz @BrooklynNets vouch",
    "2256": "@Brucebrownfan1 @BrooklynNets They don’t want another Westbrook 😂",
    "2257": "@BrooklynNets Need it 🙏",
    "2258": "@BrooklynNets oh my god",
    "2259": "@BrooklynNets PLEASE I NEED",
    "2260": "@BrooklynNets Look at my twitter name !!! I need this shirt !!!",
    "2261": "@BrooklynNets would love this",
    "2262": "@BrooklynNets Need love these player shirts",
    "2263": "Where Brooklyn at??? #NetsWorld @BrooklynNets  @KyrieIrving #NewProfilePic https://t.co/eA8oqOjWqz",
    "2264": "@BrooklynNets I beg",
    "2265": "@BrooklynNets this would literally make my entire life Kai is my favorite player ever",
    "2266": "@BrooklynNets Done hope to get this",
    "2267": "@BrooklynNets @Philknowsball7 Give me it. I was a fan since y’all came to Brooklyn",
    "2268": "@BrooklynNets Pleaseeee I neeed this I’m one of kyries biggest fans loved him since 3rd grade",
    "2269": "@BrooklynNets I retweeted come on guys 🙏",
    "2270": "Tomorrow is Fan Appreciation Day, but we wanted to show some extra love to #NetsWorld today...\n\nWe've got 2 signed KAI t-shirts to give away, RT this for a chance to win one! https://t.co/euCvFiM3mo",
    "2271": "@BrooklynNetcast @BrooklynNets agreed",
    "2272": "@KyrieIrving we left on slightly bad terms w/ @celtics but now we find ourselves on the same team @loserclubreborn all is forgotten nothing but ❤️… good luck @BrooklynNets",
    "2273": "@EliManning are you a @Yankees @nyknicks or a @Mets @BrooklynNets fan?",
    "2274": "I know the Knicks season disappointed big time, but can you fucking believe the Brooklyn Nets are going to finish the season under .500 on their home court?!",
    "2275": "Got a chance to meet @kerry_kittles30 at @barclayscenter #brooklynnets #villanova #barclaycenter #nba @ Barclays Center https://t.co/HvdKi1xb3S",
    "2276": "@MoCDTex Right! Thank you @BrooklynNets for setting up the @HoustonRockets",
    "2277": "@BrooklynNets improve BB's contract",
    "2278": "Brooklyn Nets Nba Kit\n\nKappa construction\n\nPhone/WhatsApp:08039562419\nTelegram:https://t.co/aa7W48b3ZK\n​Pls Send DM/ nationwide delivery https://t.co/kGRwZIucDN"
}