{
    "0": "Straight 🔥🔥🔥! \n\n@WesGotRange gets us fired up on a Monday night! \n\n#AllFly | @hornets https://t.co/9VFImMnTAt",
    "1": "Birthday Energy for Sky Miles ⚡️\n\nLet’s go!\n\n📍 - 🏠\n🆚 - @PelicansNBA \n⏰ - 7PM EST\n📺 - @HornetsOnBally \n📻 - @WFNZ 610 AM/92.7 FM https://t.co/8gtq3b0n3c",
    "2": "When you gotta rep the @Kcannonballers at the @hornets game tonight.... https://t.co/AMAHdsSh4J",
    "3": "Out here watching my guys. Let’s get a dub. @MELOD1P @MilesBridges @hornets #AllFly https://t.co/GwOv5Vkors",
    "4": "All I want for my birthday today is a win from the @hornets and maybe a shout-out and/or follow from our girl @ashahahmadi :-)",
    "5": "@HornetsOnBally @ashahahmadi @WesGotRange @MELOD1P @hornets We back baby!",
    "6": "At the @hornets game!\n#AllFly https://t.co/ou6qyCZM3p",
    "7": "1️⃣1️⃣ games left in the regular season! The playoff push is on! \n\n#AllFly | @hornets https://t.co/TRpkZGRQrx",
    "8": "@FKNTORO @hornets Please check your DM",
    "9": "TAP IN TONIGHT FAMILY! LETS GEAUX PELS🤝💪⚜️ #Pelicans #WBD #Pels12 #PelicansFlyTogether \n\nNew Orleans Pelicans Vs Charlotte Hornets | Live Streaming Scoreboard an... https://t.co/j3UM4paZmh via @YouTube https://t.co/duImPGzFFe",
    "10": "\"He controls the tempo. Things start with LaMelo.\"\n\n@ashahahmadi and @WesGotRange discuss the importance of @MELOD1P taking care of the ball and being a pace setter for the @hornets.\n\n#AllFly https://t.co/sOHfO6qUhJ",
    "11": "Game day drip💧\n\n#ULTRADrip | @MichelobULTRA https://t.co/3pamTcUDqR",
    "12": "@hornets @CrumblCookies 5 game win streak please",
    "13": "@iso_kekalee @hornets @CrumblCookies Trolling?",
    "14": "Charlotte Hornets (-6) vs. New Orleans Pelicans! #AllFly #WBD #NBA #NBATwitter #NBA75",
    "15": "@PJWashington Doing better than the.....Charlotte Hornets !",
    "16": "About 15 minutes till the @hornets host the New Orleans Pelicans. \n#BuzzCity going for what would be a season high tying 5 game win streak. \nCatch all the action starting at 7 on @wfnz the Hornets Mobile App and the Hornets Radio Network! https://t.co/zJeo3yvrt5",
    "17": "Tonight's starting lineup for the Charlotte Hornets: Ball, Rozier, Bridges, Washington, Plumlee https://t.co/bVWH4AMCA2",
    "18": "@hornets @CrumblCookies Why is melo starting over IT?",
    "19": "Monday Night Basketball! \n\n@hornets back at the Hive to take on the @PelicansNBA! \n\n@ashahahmadi and @WesGotRange are taking you up to tipoff right now on Bally Sports Southeast! \n\n#AllFly https://t.co/O8ndcvdzZc",
    "20": "First 🖐️ on the floor! \n\nhttps://t.co/ogyvkEMqyP | @CrumblCookies https://t.co/Df1EB7ZUMT",
    "21": "Devonte Graham back from R hip soreness, in the @PelicansNBA starting lineup tonight vs the Hornets. The Raleigh, NC native is playing in Charlotte for the first time as a visitor after growing up in the Tar Heel State! @Devonte4Graham https://t.co/yzFvqCuNmR",
    "22": "#LakeShow please win tonight &amp; @hornets please beat the Pelicans 😩💜💛✝️🙏🏼",
    "23": "@erau24 @hornets Winner!!!!!!! DM me!!!!!",
    "24": "@sportsguyshows @hornets Winner!!!! Can you make it to the game? D m me!",
    "25": "@PelicansNBA take on the @hornets tonight. \n\nCatch Pelicans live on Bally Sports New Orleans 📺 | #WBD https://t.co/DGE0DXGFYa",
    "26": "Court side🏀 &gt; Pool side🏊‍♂️ Charlotte Hornets vs New Orleans Pelicans #SpectrumCenter https://t.co/gmMH7GoEYN",
    "27": "3-21-2022 ACTION⬇️\n\n•NBA Parlay•🏀(1U)\nCharlotte Hornets ML -220\n#AllFly \nMiami Heat ML -340\n#HeatCulture \nChicago Bulls ML -170\n#BullsNation \n\n#GamblingTwitter #NBA75",
    "28": "@hornets @NovantHealth Congratulations to all the Hornets employees of the month!",
    "29": "@V0XY4 @hornets @LendingTree Then what was the point of drafting bouknight",
    "30": "@hornets @GEICO Can’t get into a rhythm when soon as they heat up he sit em down.. Dude is trash",
    "31": "Uniforms for New Orleans Pelicans vs Charlotte Hornets at 4:00 PM.\n\n#WBD #Allfly https://t.co/cAh3FlhhVD",
    "32": "WHALE PLAY HAMMERS:\n\nCharlotte Hornets -5.5🔐\n\nCharlotte Hornets Team Total Over 120.5🔐\n\nMiami Heat -5.5🔐\n\nLebron James Over 30.5 Points🔐\n\nParlay (-110):\nMiami Heat ML🔐\nCharlotte Hornets ML 🔐\n\nLET’S SWEEP 5-0 TONIGHT🔥",
    "33": "@FKNTORO @hornets Right here!!!!! I been to a game before tho",
    "34": "@OhmaTokita45 @hornets @NovantHealth i mean i guess he can stay, i’d give him 10 min a game, maybe less. i’d play bouknight his minutes",
    "35": "@hornets @MilesBridges Happy birthday Miles enjoy your day bro I hope you get a really nice contact extension you deserve it I luke the way yall been playing out there and what yall are building you're a huge part of that in buzz city Keep doing your thing homie",
    "36": "Great way to start the night!! We def gonna get that win now!!! #AllFly 🏀 #BuzzCity @hornets @Lowes https://t.co/ML4IYIeDnA",
    "37": "@charles2323 Always a pleasure fam! 👀 at her smile!!!!!! GO @hornets !!!!!! https://t.co/AjHCJRYhmu",
    "38": "While the Hornets wear purple on the court tonight, you can wear purple in the stands! \n\nStop by the Hornets Fan Shop or order via the Hornets Fan Shop Express to pick up tonight's item of the game! 🔥 \n\n#AllFly | @hornets https://t.co/j8SWBbZZWs",
    "39": "@hornets @NovantHealth CUT MARTIN, CUT HAYWARD, PLAY BOUKNIGHT OVER MARTIN. FIRE BORREGO IT IS THIS SIMPLE",
    "40": "If Mitch sign I.T just know bouknight’s career at charlotte is completely over and one thing I know fosho is signing I.T will not change anything the hornets will still be the same sorry ass 9th/10th seed team in the nba",
    "41": "Looking good if you're heading to the @hornets game tonight! Full forecast live on @wsoctv  ! https://t.co/QXoVG8isKK",
    "42": "@Megawatts55 Back when the Hornets moved to New Orleans, and Charlotte got an expansion team, I brought up a three team trade of mascots\n\nNew Orleans sends Hornets back to Charlotte\nCharlotte sends Bobcats to Utah\nUtah sends Jazz back to New Orleans\n\nAnd then all would be right in the league",
    "43": "@FKNTORO @hornets Gotta wish the man a happy birthday https://t.co/lpPPBKrKw7",
    "44": "@hornets @NovantHealth He should retire",
    "45": "@hornets @NovantHealth Bouknight?",
    "46": "@hornets @NovantHealth Easy W",
    "47": "@hornets @NovantHealth Hopefully he’s traded in the off season",
    "48": "@hornets @NovantHealth Prayers",
    "49": "INJURY REPORT vs NOP\n\nGordon Hayward (L Ankle) is out.\n\n#AllFly | @NovantHealth https://t.co/SPhQH3xoCo",
    "50": "Isaiah Thomas has found a home in Charlotte. \n\nThe young, talented Hornets have relied upon Thomas for a leadership role, being a player who’s seen it all and been in every circumstance.\n\nFull Inside Pass with @ShamsCharania ⤵️\nhttps://t.co/6h6tzbU02k https://t.co/YtkCOW9VsH",
    "51": "CHARLOTTE HORNETS VS NEW ORLEANS PELICANS WATCH LIVE NOW!! https://t.co/txdDZFTWEV via @YouTube we live take your shoes off hit the like https://t.co/8enCRFdJUX",
    "52": "@hornets Oh no JB praising melo, don't let twitter see this",
    "53": "🏀 The Charlotte Hornets are riding high on a 4-game winning streak as they welcome in the New Orleans Pelicans into the Spectrum Center who have won 2 games in a row themselves. @teddy_covers gives his Big Game Breakdown covering this matchup!\n\n👉 https://t.co/LbKADzv7ff https://t.co/OkW0HzlKkT",
    "54": "It's gameday y'all! LET'S GO BUZZ CITY! #AllFly @hornets https://t.co/OGqIxRDvIi",
    "55": "CHARLOTTE as Home Favorites  11 Win -6 Lost  (PF) 115.35 -  ( PA) 109.71 #Hornets  Full odds at https://t.co/nUn5OcMhOI",
    "56": "#NBA75 \nNew Orleans Pelicans @ Charlotte Hornets\nCJ McCollum: Mais (25.5) pontos",
    "57": "Cleveland Cavaliers - Los Angeles Lakers\nCharlotte Hornets - New Orleans Pelicans\n\nBet slip link: https://t.co/3wKykyPHBr https://t.co/ffZHdZ8YDA",
    "58": "🏀 Both Charlotte and New Orleans are sitting 9th in their respective conferences which would put them each in the NBA Playoffs play-in games if the season ended today. @1stladyofvegas breaks down the Hornets vs Pelicans game before the 7 PM ET tip!\n\n👉 https://t.co/sbsq6Sxp3Q https://t.co/TXJrXCl9vB",
    "59": "NBA:  heat -2.5 (buy down), Utah jazz -1 and Charlotte hornets-6 ! Let start the week off right! #bettingpicks #GamblingTwitter #miamiheat #Hornets #UtahJazz",
    "60": "@FKNTORO @hornets I only been to just one Hornets game this season. I would love to go the game tonight.",
    "61": "@hornets Out please",
    "62": "🚨 🚨 TICKET GIVEAWAY 🚨 🚨 @hornets fans only!!! If you have not been to a Hornets game, hit me up, today may be your lucky day! I have a pair of tickets for the hornets game tonight against the pelicans. Come and help us cheer on the Hornets. Reply with a GIF winner at 6pm https://t.co/lFLC2ZcU0l",
    "63": "Coach JB is LIVE from the Hive! 🎙 #NOPvsCHA https://t.co/OgQ2tutowW",
    "64": "TIP: Charlotte Hornets - New Orleans Pelicans, H2(+5.5), 1.92 by #tipster Bombica131 (profit this month: +143.34)\n  #betting #Basketball #Charlotte #Hornets #New #Orleans #Pelicans",
    "65": "The contract Isaiah Thomas has signed with the Charlotte Hornets is paying off.  https://t.co/yGvg40i46l",
    "66": "3/21/90 – Eddie Johnson (15p) missed a 16-footer w/2sec remaining as the #Suns fell for the first time to the expansion Charlotte Hornets, 115-114 in OT. Charlotte moved to 3-32 on the road. KJ: 26p/20a. Tom Chambers: 36p. Dell Curry: 28p and Muggsy Bogues: 17p/17a. #ValleyProud https://t.co/ZQ7ZA2fM5A",
    "67": "@s24taofeek @hornets I would say Melo and Bouknight would be the All Stars they just have a super star energy that will make them a great unstoppable tag team with a good 7 footer inside to pass to. Miles is love by Hornets fans but he got to get that superstar energy to go with his great talent.",
    "68": "@s24taofeek @hornets That is why I said so many people have become so docile I never seen people so focused on sports and entertainment as well as the lives of celebrities in a time of great crisis. Pre 2021 there would been mass uprisings.",
    "69": "@s24taofeek @hornets We as lower and middle class people have more bigger concerns once again the extreme high food, essential goods and gasoline. As well as the government blown money on other countries instead of their own people suffering. We can't sit around worrying about multi millionaires.",
    "70": "@s24taofeek @hornets Monk is a multi millionaire like Bouknight is I doubt this is truly bothering them like that they are trying to enjoy the good life that their money are allowing F Borrego and Mitch they small potatoes to them. Those two are going be stars in the NBA regardless.",
    "71": "#Pelicans road trip continues in #charlotte as they face the #hornets\n\nJV should eat in this one; Herb has been playing on a different planet so I see value in his #defensive #props\n\n#PelsProps brought to you by @RoyalHondaNOLA \n\n@ProPelsTalk @BootKreweMedia @takingtheover \n\n#NBA https://t.co/PHbkXkIKGg",
    "72": "@s24taofeek @hornets We thought what happened to Monk was going to be the worst rookie treatment but what they are doing to Bouknight is disastrous. Bouknight is actually a top 5 draft level player not just a low lottery pick. Bouknight actually have the ability to be a second All Star for the team.",
    "73": "New Orleans Pelicans vs Charlotte Hornets | NBA Live stream\n\nLive link Game🔴⏸️https://t.co/p2saq8G0k0",
    "74": "@s24taofeek @hornets I am saying Monk was treated bad too I am saying it is on the extreme level with Bouknight. Mitch and Borrego need to move on Jordan need to sell the team",
    "75": "@s24taofeek @hornets No Monk had it better than Bouknight he just wasn't elevated to starter like he was supposed to be. He was supposed to be Melo starting shooting guard last season with Monk been 6'3 and a must better shooter than Rozier/Graham.",
    "76": "New Orleans Pelicans visits Charlotte Hornets Predictions and Preview for 3/21/2022 today.  Who are we taking in this game?  Find out now. #Picks #Sportsbook https://t.co/ZBFgRdZzZ3",
    "77": "@s24taofeek @hornets In all the years of the Hornets I never seen a lottery pick treated this bad. Monk at least got 10 minutes every game his rookie year never sent to the G league or sat out of games. Only when he suffered a injury he sat out. Bouknight is going through Hell.",
    "78": "@s24taofeek @hornets Bouknight is getting treated worst than Monk. Bouknight actually was passed over as a top 5-7 pick so he is more a top 5 pick than just 11 like Monk, PJ and Miles. Monk still had more playing time his rookie year the problem was Kemba needed him as a starting shooting guard.",
    "79": "Didn't watch this one but it seems wild and also like super long. Kid has a cool Charlotte Hornets shirt.\n\nhttps://t.co/RREcogLKoC https://t.co/b0YVHE0DCL",
    "80": "@NoahNCopeland @SpaceLiminalBot Charlotte hornets cup",
    "81": "Charlotte Hornets Predictions and Preview for 3/21/2022 hosts New Orleans Pelicans.  Find out who we are taking in this matchup. #Picks #Sportsbook https://t.co/ZBFgRdZ29v",
    "82": "2u - Charlotte Hornets -6.0 vs New Orleans Pelicans\nHornets red hot, won past 4 by average margin of +17.8.\nCharlotte 2nd in off. efficiency, 3rd in 3PT%, 4th in eFG% over last 3 games.\nHornets 20-14-1 ATS at home. #NBATwitter #bettingtwitter #SportsPicks #GamblingTwitter",
    "83": "@hornets @GEICO Get him gone",
    "84": "@Thegoat93433133 @DomDolla22 Charlotte Hornets gave up on Malik Monk because of his trash perimeter defense. 😂😂😂 They knew he was an above-average offensive player.\nCharlotte Hornets head coach is from the San Antonio Spurs coaching tree = Defense wins Championships.",
    "85": "The second game preview coming up is the Pels headed to Charlotte for the back end of a back to back. The Hornets hung up 142 on them when they played recently, can this game be any different? https://t.co/v7e9R508BZ",
    "86": "Don't forget to check out today's Hornets Hive Cast!\n\n@WesleyXRobinson and I preview tonight's @hornets game against the Pelicans and look around the league at the other games that could influence #BuzzCity in the standings.\n\n#AllFly \n\nhttps://t.co/OqDLGfQBZi",
    "87": "Charlotte Hornets - New Orleans Pelicans\nDallas Mavericks - Minnesota Timberwolves\n\nBet slip link: https://t.co/MV1fTbgml7 https://t.co/gw1CUMv00a",
    "88": "NBA Betting Preview: Charlotte Hornets vs. New Orleans Pelicans - Monday, March 21, 2022 https://t.co/XpwqLQWEpo",
    "89": "@hornets @LendingTree Sign IT to a 1 year pls",
    "90": "@hornets @FoodLion I’m dunking with Miles Bridges in 2K. You better add those",
    "91": "The count is up to 58 dunks so far this month! 🤯 \n\nHelp us &amp; @FoodLion continue to Dunk Hunger and enter for a chance to win a pair of tickets to a Hornets game here: https://t.co/ydFjMZaJhQ\n \n*No purchase required. See terms &amp; conditions. https://t.co/4oPytTcCKt",
    "92": "@jkubatko @hornets Dwight on the Hornets be like... https://t.co/G9mHZ3BCcu",
    "93": "NEW ORLEANS PELICANS vs\nCHARLOTTE HORNETS, 7:00PM.",
    "94": "@NBA @MilesBridges @hornets Happy birthday King 🤴🏾",
    "95": "Charlotte Hornets ML \nChicago Bulls ML\n\n#nba #nbapicks #NBA75 #NBATwitter #GamblingTwitter https://t.co/kb89qm5Shc",
    "96": "📅 On this day in 2018, the @hornets Dwight Howard had 32 points and 30 rebounds in a 111-105 win over the Nets.\n\nThe only player in NBA history to record at least 30p/30r in a game at an older age than Howard (32 years, 103 days) is Wilt Chamberlain (3x). https://t.co/r27KKj5Y3g",
    "97": "Consensus Line Move:\n2022-03-21 New Orleans Pelicans at Charlotte Hornets from 233.50 to 234.50\nOver adjust quickly\n#NBA #vegas #machinelearning #wallstreet",
    "98": "Today's NBA Consensus (So Far):\n\nCharlotte Hornets 71%\nChicago Bulls 66%\nCleveland Cavaliers 60%\nOklahoma City Thunder 58%\nDetroit Pistons 57%\nPhiladelphia 76ers 56%\nHouston Rockets 54%\nDallas Mavericks 54%\nBrooklyn Nets 53%",
    "99": "Happy birthday to miles bridges of the Charlotte hornets #milesbridges #charlottehornets #milesemmanuelbridges #charlottehornets https://t.co/IQhGABa34I",
    "100": "@KingFuseLit Hornets don’t play rookies because they are a winning franchise lmaooo 😭😭 man I want him to play in Charlotte so bad but free bouknight and free melo",
    "101": "It’s @hornets game day🙌🏼 1st of 3 home games this week🎉 but the only one I can attend 😭😭 another foot surgery Wednesday, so I’ll be home cheering our guys on!!! #AllFly",
    "102": "@hornets @LendingTree we definitely watching for cody martin and trey murphy🔥🔥",
    "103": "@NBA @FosterLoyer @MilesBridges @hornets Happy birthday!",
    "104": "Let's start the week off right. 💯\n\n#AllFly | @LendingTree https://t.co/DFXKNUL5W6",
    "105": "@WhatsYaWager @BovadaOfficial Good afternoon guys Happy Monday!  I'd like to request a bet please.  #WhatsYaWager Tony Snell of the Pelicans to record 0 points, 0 rebounds and 0 assists against the Charlotte Hornets.  Please and thank you.",
    "106": "76ers ML, Charlotte Hornets -6, and Lakers ML are the plays today lads. GL if you tail #GamblingTwitter",
    "107": "@hornets @GEICO Speaking of rhythm, let's not substitute people when they actually start getting hot on the court. It's happened SO many times this season. Lol",
    "108": "Next Monday! The annual Hornets Pride Night is hosted at the Spectrum Center as Buzz City takes on the Denver Nuggets! Tickets now on sale, with a portion of proceeds benefiting the Charlotte Pride Scholarship Program for LGBTQ students. https://t.co/CO2SKkexv9 https://t.co/BBjoQu2qYR",
    "109": "@sakatierney45 The #Hornets are not convinced that Lamelo is long for Charlotte. This franchise won’t give him the freedom to be himself or show his true caliber until they believe he’s truly committed and that’s regardless of the contracts for Terry and Gordon",
    "110": "It makes no sense for James Bouknight to not be getting playing time.\n\n1. He should be coming off of the bench for Terry and take ALL of Cody’s minutes.\n\n2. If the Charlotte Hornets feel that it’s too late in the season to integrate him into the lineup, send him to Greensboro",
    "111": "@hornets @MilesBridges HAPPY BIRTHDAY 🎂 🥳 🎉 🎈 🎁 #AllFly",
    "112": "@hornets @MilesBridges Happy birthday Mikals little brother",
    "113": "Dionne has an #NBA #freewinner in the #NewOrleansPelicans #CharlotteHornets matchup. Go to https://t.co/nV1Lfd4R9n and get her 100% NBA LADY LUCK WINNER for just $9. @SM_Free_Plays @sportsmemo @WagerTalk #bettingtwitter #bettingtips #bettingsports #BetterTogether #bettingexpert https://t.co/PevxZywxLE",
    "114": "Dear Charlotte Hornets never sign with Bally Sports again unless it’s available to everyone. It’s only viewable on obscure apps that require payments and even then it’s not available WITHIN THE CITY THEY PLAY IN. Either get Bally Sports on basic TV coverages or leave.",
    "115": "🔮 NBA Score Predictions for March 21\n@celtics 103, @okcthunder 95\n@BrooklynNets 109, @utahjazz 108\n@hornets 106, @PelicansNBA 105\n https://t.co/hdBNwQ5It8",
    "116": "2 tickets for tonight’s @hornets game, section 116. Make an offer!",
    "117": "@MattUCrzy @Jdcostin910 Yeah thats true. But this isnt the Warriors or a contender. And even those contenders play their rookies!!! This is CHARLOTTE HORNETS bro. They have to play the young guys, the lottery pick over those guys.",
    "118": "NEW ORLEANS vs. CHARLOTTE - Totals Prediction = 41.67% going UNDER #Pelican #Hornets  Full odds at https://t.co/nUn5OcMhOI",
    "119": "7:00pm ET; Mon, Mar 21\n\nNew Orleans Pelicans\nCharlotte Hornets\n\n📺: Bally Sports SE-CHA, \nBally Sports NO\n\n#LEGENDofthemiamiHEAT  #NBA75",
    "120": "@hornets @GEICO Did MJ write that for you to say? (Blink twice for yes).",
    "121": "CHARLOTTE  PVI Rating on winning their next game: 21.74% #Hornets  Full odds at https://t.co/nUn5OcMhOI",
    "122": "@Zionwilliamson to @hornets …. CAMPAIGNING NOW.. and you bearded it here first… I’m Campaign manager!! Lol.. the account can’t like this tweet.. but I know it popped in the mentions!! #ZionToCharlotte",
    "123": "@hornets @GEICO This is the last mf to talk about rhythm",
    "124": "It's all about that rhythm.\n\n#AllFly | @GEICO https://t.co/cmdsqrmoA3",
    "125": "Mon, 21st Mar: #CharlotteHornets vs #NewOrleansPelicans - ODD @ 1.97\nMore details on: https://t.co/YvDSi5Djpj\n#baskettips #basketprediction #basketballbets #nba #usabasket",
    "126": "🚨POTD🚨 44-14🔜45-14\n\nMiddle Tennessee St ML/Charlotte Hornets ML/+112\n\nGoing for 10 straight weeks of profit starting today. Let’s start if off right.🚂🚂🚂🚂",
    "127": "@TheSteinLine @hornets @isaiahthomas do it https://t.co/83hmqyVdF8",
    "128": "NBA play for tonight - Hornets (-5.5) for 1u vs the Pelicans. Charlotte has been hot lately winning 4 straight and going 4-0 ATS in that span. New Orleans is just 1-4 ATS in their last 5 games as an underdog #GamblingTwitter https://t.co/s1SyQaZV7x",
    "129": "The @hornets host their third straight game tonight at the Spectrum Center!\n\nWith New Orleans coming to town, the #Swarm are looking for their 5th straight win.\n\nHere's the full preview!⬇️⬇️⬇️\nhttps://t.co/BjmgcaFjcb",
    "130": "*ADDED PLAY*\n💰CJ McCollum o24.5 points vs Charlotte\n-CJ has gone over in 3 of his L5\n-In L7 games, Charlotte has given up 2nd most PPG to PG's\n-Went over in 2 of L3 vs Hornets (despite being on a different team)\n-Graham now questionable\n-Charlotte 3rd fastest pace in NBA https://t.co/TBBbhDjGR8",
    "131": "@hornets @MilesBridges Happy Birthday Miles!",
    "132": "@NBA @MilesBridges @hornets As a Pels fan, I think it’s a great idea to give him the night off…",
    "133": "@macwfnz Very cool as @FKNTORO is that guy!! We all 💜💜 him at the @hornets games too!! He is truly passionate about Charlotte sports!!",
    "134": "@hornets @MilesBridges Hey it’s my birthday too !",
    "135": "First @hornets game last Wednesday, great game and great win over the Hawks. Had to pick up a @HugoTheHornet for my boys   #AllFly https://t.co/LsOlEF6k71",
    "136": "Behind the Numbers preview for Monday's 6 p.m. road game at Charlotte (#Pelicans lead #NBA in steals since All-Star break after below-average rate early in 2021-22; clutch turnaround for NOLA; rebounding edge vs. Hornets; lineup notes + keys): https://t.co/dTLQux09SY https://t.co/U8y55Est8d",
    "137": "@imSriram03 @hornets I F’n hate crooks! Sorry to hear this Sriram. Like you said, lesson learnt.",
    "138": "10 best scorers in Charlotte hornets history \n\n https://t.co/uUaniFCImq",
    "139": "@hornets do whatever it takes https://t.co/yZhRD9NOGQ",
    "140": "@hornets do ur job tonight beat the Pelicans to help out my #LakeShow ✝️🙏🏼",
    "141": "Analyzing Monday’s New Orleans Pelicans at Charlotte Hornets and lines, with NBA expert picks, predictions and best bets.  https://t.co/QsMlzZlwBU",
    "142": "New Orleans Pelicans at Charlotte Hornets odds, picks and predictions https://t.co/DZ7Vm4mRwu",
    "143": "New Orleans Pelicans vs. Charlotte Hornets - 3/21/22 Free Pick &amp; NBA Betting Prediction https://t.co/nYcWUoDLlp\n.\n#Betting #FreePicks https://t.co/Pout0JrUjQ",
    "144": "The law of averages is bound to catch up with the @hornets and their Statement edition jerseys ….. right?? #AllFly",
    "145": "On today's @PodcastPelicans, Charlotte Hornets radio announcer @SamFarberLive joins @dsallerson and @Jim_Eichenhofer to preview tonight’s game between the Pelicans and the Hornets. \n\nFull episode: https://t.co/tsjimZsWlX\n\n#Pelicans | @SeatGeek https://t.co/BCXko5qTVQ",
    "146": "Lamelo and the Charlotte Hornets car collection goes crazy 🏎💨 https://t.co/nP9QPTcz94",
    "147": "@davyc3 @TopShotKingdom @ChewieWoolf @nbatopshot @Jayne @roham @alexxserenaa @SQxBR @Martin23kings @leet3_ @_PuzzlePieceDad Wow, that's awesome.  I feel like the only person in the arena who knows what TS is at @Hornets games.",
    "148": "Had a great time with the @hornets on Saturday Night! https://t.co/J2cMvCufOM",
    "149": "@AhmadMonk You should definitely know that the true fans of the Charlotte Hornets always wanted you here and were truly sad to see you go. Hate that your time here went the way it did.",
    "150": "@hornets @MilesBridges @MilesBridges Happy birthday from🇭🇰~\nWe share the same birthday date lol ~",
    "151": "@DavidKyle @hornets @Barings You're definitely not wrong. Prices are way too high on Ticketmaster. That's always been the case. Sadly, the ticket office hasn't adapted.",
    "152": "Keep these two together @hornets https://t.co/3CkSTDFVHd",
    "153": "@nba1k @hornets @Barings talking about retail, not secondary.",
    "154": "🏀 Free NBA Pick loaded from Teddy Covers on (525) New Orleans Pelicans at (526) Charlotte Hornets! @wagertalk https://t.co/2G4kEdXInv",
    "155": "It's game day in Charlotte!\n\n@PelicansNBA vs @hornets \n⏰ 5:30 pm\n📺 Bally Sports Orleans\n📲 Bally Sports App\n#WBD https://t.co/zVnYmVeUh5",
    "156": "DasHaus made a bet!\n\nEvent: New Orleans Pelicans vs Charlotte Hornets #NBA\nBet: New Orleans Pelicans TO WIN +6\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "157": ".@macwfnz and @TBoneWFNZ discuss the job that the Panthers have done so far in free agency, talk about the big wins on Saturday for both the Hornets and Charlotte FC and tell you how the Tar Heels were able to survive the furious Baylor rally.\n\nLISTEN:\nhttps://t.co/BDJGFy7UUO",
    "158": "@hornets @Barings I will be there over by the tunnel",
    "159": "Although no one on the Hornets had insane numbers,\n\nThe Charlotte Hornets had a 3-0 week and I think they should get rewarded for that with a Player Of The Week.",
    "160": "LaMelo Ball 2020-21 Mosaic National Pride Blue Reactive \nTag a @Hornets fan!\nhttps://t.co/ViMmDWX70T\n#thehobby #charlotte #hornets #nba #basketball #basketballcard #LaMeloBall #collect",
    "161": "Revenge Game: Willy Hernangomez plays Charlotte tonight.  He played 111 games in his career for the Hornets.",
    "162": "Revenge Game: Devonte' Graham plays Charlotte tonight.  He played 109 games in his career for the Hornets.",
    "163": "🎂 Miles Bridges - Charlotte Hornets has a birthday today",
    "164": "@DavidKyle @hornets @Barings I paid $5 for a ticket to tonight's game.",
    "165": "Monday's play's!\n\nNBA:\nDallas Mavericks -3.5 (-110)\nCharlotte Hornets/New Orleans Pelicans O234.5 (-110)\n\nNHL:\nGolden Knights / Wild O6.5 (-122)\nPredators / Ducks O6 (-106)\n\n@bulljourdan \n@bran16devi \n@HEATRsports \n\n#gamblingtwitter #sportsbets #NBA #NHL",
    "166": "Today on the Hornets Hive Cast:\n\nWe preview tonight's @hornets matchup against the Pelicans, review the latest episode of Reel Access and look at the other NBA matchups of interest for #buzzcity with @WesleyXRobinson \n\nhttps://t.co/OqDLGfQBZi",
    "167": "@Helzy8 @itsdilli @NBA @MilesBridges @hornets Stop it",
    "168": "@hornets @Barings ticket prices are too high for a Monday night game.  You need to lower that floor.",
    "169": "LaMelo Ball 2021-22 Hoops Purple \nTag a @Hornets fan!\nhttps://t.co/fVS42cBGlA\n#thehobby #charlotte #hornets #nab #basketball #basketballcard #LaMeloBall #collect",
    "170": "Only #NBA play I like right now is:\n\nCharlotte Hornets -6\n\nPelicans on a brutal B2B and 3rd in 4 nights. Won’t be able to keep up with pace of CHA with fresh legs \n\nGood luck 🍀 \n\n#GamblingTwitter",
    "171": "@hornets @MilesBridges Happy Birthday 🎂 Bro 🎊🎉🎉🎊",
    "172": "The best Mondays are GAMEDAYS! 🙌\n\n#AllFly | @Barings https://t.co/D0wW0CjWmg",
    "173": "Thank you so much @hornets for everything! Words can't even describe how grateful I am. https://t.co/52lmLvsuiK",
    "174": "@hornets @MELOD1P @PJWashington Trade him",
    "175": "📰 Charlotte Hornets vs New Orleans Pelicans Predictions and Betting Odds 3/21/22!\n👉 https://t.co/kidDgtjU3X @wagertalk",
    "176": "@hornets @MilesBridges Happy birthday Miles!!! 🥳",
    "177": "@NBA @MilesBridges @hornets Happy birthday @MilesBridges",
    "178": "@NBA @MilesBridges @hornets Happy bday Miles!! @MilesBridges",
    "179": "@hornets @MilesBridges Happy birthday 🥳",
    "180": "NBA Basketball Game Betting Picks Simulator: 7:00 PM ET - New Orleans Pelicans vs. Charlotte Hornets - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/XXYKsbOODM #nba #sportsbetting #freepicks #cappertek",
    "181": "Consensus Line Move:\n2022-03-21 New Orleans Pelicans at Charlotte Hornets from 234.50 to 233.50\nUnder steam engine\n#NBA #bettingtips #artificialintelligence #forextrading",
    "182": "Consensus Line Move:\n2022-03-21 New Orleans Pelicans at Charlotte Hornets from -7.00 to -6.00\n#WBD undervalued\n#NBA #soccer #programmer #wallstreet",
    "183": "@NBA @MilesBridges @hornets Happy Birthday to the 🐐",
    "184": "\"UGH I CAN'T STAND BULLS FANS WHO TELL THE TRUTH ABOUT THIS TEAM\" yes because living in a fairy tale world where other fans respect your team for beating the Charlotte Hornets is better",
    "185": "#Basketball\n#Nba (Usa)\nCharlotte Hornets - New Orleans Pelicans\n#1xbet\ninfo: https://t.co/zJZBQcdsAU https://t.co/u4XioA02LF",
    "186": "MONDAY, MARCH 21, 2022\nhttps://t.co/eNu5i2pjH3\n\n6a WCSL &amp; WOHS - Carolina’s Morning Cruise\n8a WAGY - Pat Nanney\n9a WCSL - Down Home Morning Swap Shop\n10a WOHS - Pat Gwinn\n3p WOHS - Randy Davis &amp; Terri Gore Sea Cruise\n7p WOHS &amp; WCSL - New Orleans @ Charlotte Hornets https://t.co/MOWmGRy5pE",
    "187": "Phoenix #Suns should trade for Charlotte #Hornets Miles Bridges. So that they can have two young tough forwards - Mikal and Miles.",
    "188": "Miles Bridges knows the Hornets are in a familiar spot. He’s driven for a different r | The Charlotte Observer https://t.co/qTjpTdDGY5",
    "189": "@hornets @MilesBridges Getting paid this offseason",
    "190": "🚨 Line Change 🚨\n\nNew Orleans Pelicans @ Charlotte Hornets\nMon 7:00 PM EST\n\nFrom:\nCHA -7.0 -110\n\nTo:\nCHA -6.0 -110",
    "191": "@hornets @MilesBridges Happy Birthday @MilesBridges",
    "192": "New Orleans Pelicans vs  Charlotte Hornets Prediction 3/21/22 -  Free NB... https://t.co/AY8Nd2IQpr via @YouTube",
    "193": "@NBA @MilesBridges @hornets Happy birthday 🥳🎉",
    "194": "Yep, this is your one and only @hornets reference for today. https://t.co/g5gkbj3yzE",
    "195": "Just like a hornet, wind shear stings. #Charlotte is dealing with some northerly shear as of snow &amp; convection is curling somewhat despite this a bit in the mid-lvls. Charlotte has a chance to see C3 (Oz scale) strength soon. #Tropics https://t.co/47bJ6NAWLe",
    "196": "@NBA @MilesBridges @hornets best rapper in the league",
    "197": "New post (New Orleans Pelicans vs. Charlotte Hornets Pick - NBA March 21, 2022) has been published on The Sports Geek - https://t.co/rEJYvZMn3C https://t.co/HMMtAam6oj",
    "198": "🏀New Orleans Pelicans #WBD vs Charlotte Hornets #AllFly⌚️7PM 🖥Bally Sports SouthEast #NBA75 #NBA https://t.co/nXTHPZkvJu",
    "199": "@hornets @MilesBridges Happy Birthday 🎊🎉",
    "200": "On this day in sports history March 21, Phoenix Suns Point Guard Kevin Johnson recorded 26 Points, 4 Rebounds, 20 Assists, and 2 Steals against the Charlotte Hornets in 1990.",
    "201": "@hornets @MilesBridges Happy birthday!",
    "202": "@hornets @MilesBridges Happy birthday Miles!!",
    "203": "@hornets @MilesBridges It’s my birthday today toooo and my daughter got me this https://t.co/RYAgoNq42R",
    "204": "@hornets @MilesBridges Pay this man 💵",
    "205": "@hornets @MilesBridges @MilesBridges congratulations man you’ve been one of the best hornets for a while",
    "206": "@hornets @MilesBridges Happy birthday 🤍",
    "207": "@hornets @MilesBridges Happy Birthday 🎂🎉 @MilesBridges",
    "208": "𝙄𝙏'𝙎 𝙏𝘼𝙆𝙀𝙊𝙁𝙁 𝙏𝙄𝙈𝙀! 🛫 \n\nHAPPY BIRTHDAY @MilesBridges! ✈️🎂🥳 https://t.co/leezMLFm0f",
    "209": "Charlotte #Hornets vs New Orleans #Pelicans | 3/21/22  | NBA Free PicksPredictions | NBA Betting tips.\n\nWatch: https://t.co/ULTGGv1Rg9\n\n #NBA #NBAPick #NBAPredictions #Hornetsvspelicans",
    "210": "@itsdilli @NBA @MilesBridges @hornets Dame Dolla!???",
    "211": "@xXkoreanbbq69 @HornetsPR @hornets Also there is always the possibility that Hayward will get hurt ... again.",
    "212": "@NBA @MilesBridges @hornets How does this affect LeBrons legacy",
    "213": "@NBA @MilesBridges @hornets @BolWrld better than?",
    "214": "@xXkoreanbbq69 @HornetsPR @hornets The starting five should remain the way it is until the time comes when a change needs to be made.  Washington needs to remain at power forward where he belongs.",
    "215": "@NBA @MilesBridges @hornets Happy Birthday Miles",
    "216": "@NBA @MilesBridges @hornets Best rapper and in game dunker in the league",
    "217": "@LiversFor3 @NBA @MilesBridges @hornets fortunately we’re resigning Him this off-season",
    "218": "@GofferAaron @NBA @MilesBridges @hornets Omg greatest day ever",
    "219": "@Ronald36092171 @hornets This must’ve been hype",
    "220": "Gameday! 24 hour rule in effect as the Pels make one last stop on this road trip in Charlotte to take on the Hornets. The team is playing like they are fully aware of whats in front of them and are going for it. \n\nMeaningful games in March are so exciting!\n\nTip @ 6 PM CT!",
    "221": "@NBA @MilesBridges @hornets happy birthday to the best rapper in the NBA, Miles Bridges https://t.co/7TFVKbLhwt",
    "222": "Bow Tie Club took over Charlotte this weekend as the Hornets obliterated the Mavericks ❗️❗️❗️❗️Pro sports in Dallas has been going through it lately 🤣🤣 #ReachAndTeach #BowTie #MentoringWorks ⚡️⚡️⚡️⚡️ @GriffinBowTie @JRGreenK12 @TeamFairfieldSC https://t.co/U8ed8oFXAG",
    "223": "@NBA @MilesBridges @hornets RTB MB!!!",
    "224": "@NBA @MilesBridges @hornets Happy birthday, future Piston!!!",
    "225": "Listen to the most recent episode of my podcast: The Monday Show: Panthers free agency and Deshaun Watson, Charlotte FC's First Win, &amp; The Hornets roll on. https://t.co/xuULjlVKEt",
    "226": "@NBA @MilesBridges @hornets Better than Jaylen Brown",
    "227": "@NBA @MilesBridges @hornets 2 Balls? You good enough to handle one?",
    "228": "@NBA @MilesBridges @hornets Happy birthday 😄",
    "229": "@NBA @MilesBridges @hornets Happy Birthday Bro",
    "230": "@NBA @MilesBridges @hornets Post yall favorite song by him",
    "231": "@NBA @MilesBridges @hornets Triple double day on his bday",
    "232": "@NBA @MilesBridges @hornets Happy birthday ... Millllllessssss Brrriddddgggggeessss 😄",
    "233": "🚨 Line Change 🚨\n\nNew Orleans Pelicans @ Charlotte Hornets\nMon 7:00 PM EST\n\nFrom:\nCHA -6.0 -110\n\nTo:\nCHA -7.0 -110",
    "234": "Join us in wishing @MilesBridges of the @hornets a HAPPY 24th BIRTHDAY! #NBABDAY https://t.co/WytSVyDEQg",
    "235": "Consensus Line Move:\n2022-03-21 New Orleans Pelicans at Charlotte Hornets from -6.00 to -7.00\n#AllFly pouring in\n#NBA #NBATwitter #computerscience #investingtips",
    "236": "This is a flat out giddy show today.  Celebrating UNC, Duke, Hornets and Char FC wins.  Plus,  the Panthers had a big weekend of free agency.   Tune in for some actual happy Charlotte sports talk.",
    "237": "This account is a fraud account. Unfortunately it was too late before I realized it. Please beware. I am normally diligent about such things but they got me yesterday. \n\nLesson learnt. Unfortunately I may not be able to take my daughter and her friends for the @hornets game https://t.co/buR7aYAKQt",
    "238": "Day 48 tweeting the @hornets to #BringBackTheCats court and uni combo for one night. Starting to run out of time for a bobcat night this year https://t.co/XdVMBB1Uae",
    "239": "/r/CharlotteHornets: Game Thread: New Orleans Pelicans (30-41) at Charlotte Hornets (36-35) Mar 21 2022 7:00 PM #AllFly https://t.co/7K7IlOBihg",
    "240": "@SbuTheGooner_ 💀💀💀 I got the Charlotte hornets waiting in the final... I'm Gona sweep em.",
    "241": "I'm one game away from the NBA final... 😂😂 Charlotte hornets slapped the Cavs... I can't bottle this one.",
    "242": "@_jphwang @NBA @cavs @hornets @Mavs_FFL @MiamiHEAT @Lakers I’ve battled the same when I’ve pulled together similar views. The side-by-side 2s and 3s never looks right so think you’ve cracked it with this view. Great data insights inside a single chart.",
    "243": "LaMelo Ball 2020-21 Panini Mosaic NBA Rookie RC #202 Hornets Charlotte - https://t.co/N6NvcDXsI2\n\n#lebron #lebronjames #lakers #nba \nhttps://t.co/QhTAO6Nevr",
    "244": "NBA : New Orleans Pelicans vs Charlotte Hornets - Picks, Best Bets &amp; Odds\nhttps://t.co/LZOjeiOqUY",
    "245": "@_jphwang @NBA @cavs @hornets @Mavs_FFL @MiamiHEAT @Lakers Really great way to handle the corner 3s when visualising shot distance",
    "246": "WHALE PLAY HAMMERS:\n\nCharlotte Hornets -5.5🔐\n\nCharlotte Hornets Team Total Over 120.5🔐",
    "247": "NBA Basketball Game Betting Picks Simulator: 7:00 PM ET - New Orleans Pelicans vs. Charlotte Hornets - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/XXYKsc6pvk #nba #sportsbetting #freepicks #cappertek",
    "248": "Congratulations to 361tree who moved up 112 spots to take #80 on the Charlotte Hornets team leaderboard.\n\nhttps://t.co/dYEEwV7pFm",
    "249": "NBA Basketball Game Betting Picks Simulator: 7:00 PM ET - New Orleans Pelicans vs. Charlotte Hornets - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/XXYKsbOODM #nba #sportsbetting #freepicks #cappertek",
    "250": "@Sean_OConnell @hornets The number of people who drown in their swimming pools every year correlates to the number of #NicolasCage film released that year. Coincidence doesn’t make correlation. And it certainly doesn’t support bigoted opinions on black peoples hair 🤦🏽‍♂️",
    "251": "New Orleans Pelicans (30-41, ninth in the Western Conference) vs. Charlotte Hornets (36-35, ninth in the Eastern Conference) https://t.co/vlWUd2D956",
    "252": "@NBA @Timberwolves @hornets @cavs @WashWizards good",
    "253": "@LakersLead No, I don’t see him. Probably because he’s the owner of the Charlotte Hornets.",
    "254": "LaMelo Ball answers Charlotte Hornets Coach’s questions like he’s at sch... https://t.co/QMPeEZECqA via @YouTube",
    "255": "@SharksNSports @punt_school here is my concern hornets just blew out the pelicans the pelicans have big revenge and charlotte coming off beating dallas",
    "256": "Check out 2021 Panini  Honors Rookie LaMelo Ball #581   Charlotte Hornets #CharlotteHornets https://t.co/Y55ByxIwQk via @eBay",
    "257": "Sounds like the Hornets star has plans to remain in Charlotte for the foreseeable future.  https://t.co/NlQn3n91A4",
    "258": "@RustyBUCKETS321 Why the @hornets are the next big Eastern Conference power !",
    "259": "I think its fair to say the @hornets may have the best tv announcers in the NBA.",
    "260": "@hornets props on getting Trez I say it how I see it",
    "261": "@WilliePStyle @hornets @CharlotteFC If there is a city that deserves a professional sports championship, it's Charlotte.",
    "262": "Been Part time Charlotte Hornets fan🔥\n\nThese 2 the 🐐 https://t.co/AqzPgkKQDH",
    "263": "NBA Basketball Game Betting Picks Simulator: 3/21/2022 7:00 PM ET - New Orleans Pelicans vs. Charlotte Hornets - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/XXYKsbOODM #nba #sportsbetting #freepicks #cappertek",
    "264": "@HugoTheHornet Look what I found at my parents house in SC @hornets #AllFly https://t.co/KcRqziVvmh",
    "265": "Hit me up @hornets please comment on my page please. https://t.co/OP8Y4Em2hd",
    "266": "@NotoriousVIC007 They got those 10 year seniors out there...they older than the Charlotte Hornets lol",
    "267": "🏀 New Orleans Pelicans (@PelicansNBA) #WBD\n🆚 W @ Atlanta Hawks #TrueToAtlanta #NOPvsATL\n⏭️ Charlotte Hornets #AllFly #NOPvsCHA\n✈️ N6714Q | DAL8934 | B752\n🛫 ATL - 10:30 pm ET\n🛬 CLT - 11:09 pm ET\n📡 Tracking: https://t.co/x7p4AZH9sP https://t.co/y41Fxvy30k",
    "268": "@bobszy @hornets Been meaning to get there forever! You are too kind, Bob! Hopefully in the near future.",
    "269": "@NBATV @hornets Cool",
    "270": "The Charlotte Hornets are 36-0 in games where they’ve outscored their opponents the league should be on watch https://t.co/T2Z5O1UvPo",
    "271": "Sign this man in the offseason, @hornets https://t.co/YPMRgZYzGV",
    "272": "@hornets @ArrowExt MAX HIM",
    "273": "Bring back this court full-time! 😍 It’s gorgeous.\n\n@hornets https://t.co/kmifIgpyEp",
    "274": "@tsuchpirate @hornets @WalkerMehl @DougBransonLOH @NataTheScribe @daviDBWalker Five or six, realistically. If they get hot, we could legitimately hop Brooklyn for the 8, but the stars would have to align.",
    "275": "@ALW_18 Strange way of spelling the Charlotte hornets that",
    "276": "Duke. UNC. Charlotte FC. Hornets. Everyone’s a winner. Including you if you post at DMZ in the morning. @f3aquafresh has the Q. Come get better tomorrow.  SYITG. @F3Metro @F3Area51",
    "277": "/r/CharlotteHornets: Long shot question: anybody have an Eric and Dell bobble head from yesterdays game they’re willing to part with? #AllFly https://t.co/9cvVov3vc8",
    "278": "PELICANS at HAWKS | FULL GAME HIGHLIGHTS | March 20, 2022 #Charlotte #Hornets #NBA Video: https://t.co/7HwxMg2vCP",
    "279": "Is That Really Melo...I know he has a car like that and it Was after the Win...@hornets @GMA @tjholmes https://t.co/4oLqbKaxTN",
    "280": "@iohandles I don’t know what’s worse the way Lamelo stans think the city of Charlotte is against him or the delusional love some hornets fans have for a empty stats role player who has never averaged 40% from the field",
    "281": "TITAN PITTTTTT ⚡️WE GOT THE BIGGEST GAME IN WALLINGFORD HISTORY TOMORROW ‼️WEBER CHAMPIONSHIP‼️@ 7:00 THE PHILADELPHIA 76ERS 😈VS THE CHARLOTTE HORNETS 🐝  ATTENDANCE IS NOT OPTIONAL 🚨 PACK THE PARK AND REC AND GET ROWD 📣 LFGGGG 😈😈😈 CHIRPS ARE EXPECTED 🚨‼️ https://t.co/S9n27Agulu",
    "282": "NBA Tips: Pronostico New Orleans Pelicans vs Charlotte Hornets 22-03-22 https://t.co/hq9DFuSDkM",
    "283": "@Meloleague He may need to brush up on @hornets history of fast cars on public roads like David Wesley and Bobby Phills… do better.",
    "284": "@RooshWilliams Keeping an eye on the Charlotte/Nets records.  You think Hornets and leap frog so that pick ends up in the lottery?",
    "285": "For The Hornets,\n\nThe Best Part About This Game Is That The Hawks Lose, So They Don’t Leapfrog You,\n\nBut The Hawks Stayed Competitive And Made The Pelicans Work Which Is Great Because Going Into Charlotte,\nThe Pelicans Will Be On The 2nd Night Of A Back-To-Back",
    "286": "Thank you, Pelicans. Good win over the Hawks. Apologies in advance for tomorrow’s beat down by our @hornets. Road to the playoffs!",
    "287": "Hello AGAIN Charlotte ♡ @Queen_City_News @hornets we need a sponsor for another Wall of Love https://t.co/Oqx5a6ef2v",
    "288": "Play-In Picture: @hornets jump over @ATLHawks\nhttps://t.co/2JLLtk61g2",
    "289": "@DianaluvsD12 @sugamama316 @ChantalLisette @v_friedman1223 @BubbaAlmony @JohnLukeNYC @BornaisDawn Here!!! @Hornets win @CharlotteFC win @RockHill_Soccer win I’m happy!!! https://t.co/50WCHyRwfp",
    "290": "@hornets                                            You should make a commercial for Geico Insurance. Like Ratt, Angry Birds, Aunts, and Animal. Should be Hornets in the yard",
    "291": "Lmfaooo the Hawks are doing a halftime dunk contest between the Braves, College Park Skyhawks, Georgia Tech, Miami Heat, Falcons, Charlotte Hornets, &amp; NO Pelicans mascots. &amp; Harry The Hawk is judging 😂. Give a raise to whoever’s idea that was",
    "292": "Resultados NBA\nCharlotte Hornets 129-108 Dallas Mavericks\nCleveland Cavaliers 113-109 Detroit Pistons \nWashington Wizards 127-119 Los Ángeles Lakers\nHouston Rockets 98-122 Grizzlies\nIndiana Pacers 129-98 Portland Trail Blazzers",
    "293": "The boys had a fun weekend in Charlotte! @treehouse_hobie became a temporary @hornets fan as they withstood some @luka7doncic magic for the win. We’re live-come talk to us about it! https://t.co/gsPz2N7xay #allfly https://t.co/1P1zicKYsq"
}