{
    "0": "New Orleans Pelicans Starters:\n\nCJ McCollum\nBrandon Ingram\nHerbert Jones\nJaxson Hayes\nJonas Valanciunas\n\nPlayers out:\nLarry Nance\nZion Williamson\n#WBD #NBA #NBATwitter #NBA75",
    "1": "New Orleans Pelicans Starting Lineup 3/4\n PG: CJ McCollum\n SG: Herbert Jones\n SF: Brandon Ingram\n PF: Jaxson Hayes\n C: Jonas Valanciunas\nhttps://t.co/o75oZ8vnE8",
    "2": "Tonight's starting lineup for the New Orleans Pelicans: McCollum, Jones, Ingram, Hayes, Valanciunas https://t.co/bVWH4AMCA2",
    "3": "Get a preview of the Utah Jazz vs. New Orleans Pelicans basketball game. https://t.co/FrriN5w1Fh\nvia @ESPN App https://t.co/nALCbLiXno",
    "4": "New Orleans Pelicans Ov 109.5 -110...3 unit play and take the 4.5 pts for 1 unit",
    "5": "Zion Williamson Questions Linger in New Orleans Despite Positive News - Sports Illustrated Pelicans Scoop News, Analysis ⁦@PelicanScoop⁩  https://t.co/RSWhFu04hL",
    "6": "Uniforms for Utah Jazz vs New Orleans Pelicans at 5:00 PM. \n\n#TakeNote #WBD https://t.co/VAN7IBn5eb",
    "7": "Zion Williamson Questions Linger in New Orleans Despite Positive News - Sports Illustrated Pelicans Scoop News, Analysis and More https://t.co/zVVK0Fg8FD",
    "8": "Podcast of Inside New Orleans William Grant Distillers Friday Extravaganza 4-6pm @NASHfm1061\nhttps://t.co/KKtU8zwGkx https://t.co/MOmnPYB9iB\nTopics: @Saints @PelicansNBA @LSU @Tulane @UNOPrivateers @LoyolaWolfPack \nGuests: @MichaelFazende @DoingItDodson \nhttps://t.co/Xza0P5ILjf",
    "9": "@dntcaresorrrry @DruProductions Mental how? Pelicans fans act like the scorn ex. Anthony Davis barely even acknowledged that he ever lived in New Orleans and y’all are always stalking him and the lakers. Making up some fake rivalry that doesn’t exist. It’s like comparing the Yankees to the Rockies",
    "10": "Crazy draft situation: The Lakers pick goes to New Orleans this year if it's 1-10. It goes to Memphis if it's 11-30. Current estimate for that pick is #11 -- the Pelicans are exactly one game behind them. Very high incentive for NOP to pass LAL and beat them in the play-in.",
    "11": "🏀 The Jazz and Pelicans are each on three game winning streaks as they meet in New Orleans for their match up at 8 PM EST tonight. @SteveMerril provides data and insights surrounding the over/under for this game currently listed at 222.5.\n\n👉 https://t.co/j3AxHWoXTp https://t.co/TDitx5Tlfy",
    "12": "I wouldn't be so quick to think that. It's more so a city of New Orleans thing than it was a Sean Payton thing (look how they treat the Pelicans) although the SP hate didn't help any. https://t.co/VWC6CMIkaH",
    "13": "Parlay a few, play some straight\n#gamblingTwittter\n\nNew York rangers/New Jersey Devils NHL - rangers moneyline\n\nNew Orleans pelicans +6 on the spread\n\nBucks/Bulls under 243 game total\n\nTimberwolves/Thunder under 233 game total\n\nI think the raptors Timberwolves &amp;  pacers gone win",
    "14": "Adeus New Orleans Pelicans https://t.co/Q7CPJIFMB6",
    "15": "NBA Game Analysis: The New Orleans Pelicans have a forecast 54% chance to win against The Utah Jazz with a spread of -3.5/3.5 and an over/under of 248.5. The New Orleans Pelicans are 1 - 2 against The Utah Jazz in the 2021-22 Season.\n#sharpbets\n#sportbetting",
    "16": "If I stayed in New Orleans I’d be at Pelicans games on the regular. Thinking bout goin to see us whoop on the Lakers later this month.",
    "17": "🏀 GAME ANALYSIS 🏀\n\n🏟 Utah Jazz vs New Orleans Pelicans\n\n▶️ BET THE NBA ▶️ https://t.co/odroCYfQFJ\n\n#NBA #GamblingTwitter\n\nhttps://t.co/MGig3Hdu23",
    "18": "Anthony Davis has decided to give LA a try, signing a 4 year, $26.17m offer sheet from the Lakers.\nThe New Orleans Pelicans have the opportunity to match this deal, as he is a Restricted Free Agent.\n(Who could've seen this coming? I didn't think AD even LIKED Los Angeles...)",
    "19": "Here in New Orleans watching Willy Hernagomez shoot some corner 3s. Jazz-Pelicans tonight should be a good one. https://t.co/XAr5fgzsDT",
    "20": "The New Orleans Pelicans have scored 6,639 points overall as a team with 2,810 rebounds, 1,536 assists, 473 steals, 261 blocks for a total of 14,930 minutes in 62 games. CJ McCollum averages 26.6 points per game.",
    "21": "Tonight's Picks 💰🏀🗑️\n\n- Donovan Mitchell Over 31.5.                -122\n- New Orleans Pelicans +4.5.                  -110\n- Philadelphia 76ers -5.5.                         -140\n- Bryn Forbes 12+ Pts/Denver To Win.  +126\n\n#NBA #sportsbettingpicks #bettingtips  - Steven 😈",
    "22": "If pelicans have issues filling up the arena....New Orleans not loving basketball is last.",
    "23": "Back NEW ORLEANS PELICANS to BEAT Utah Jazz tonight in the @NBA (Game Starts at 01.10 GMT) #NBA #Basketball",
    "24": "Philadelphia 76ers - Cleveland Cavaliers\nChicago Bulls - Milwaukee Bucks\nNew Orleans Pelicans - Utah Jazz\nPhoenix Suns - New York Knicks\n\nBet slip link: https://t.co/6o5F7zUJrk https://t.co/RCzd4dusqM",
    "25": "Check out NEW ORLEANS PELICANS 2020-21/2021-22 Basketball 8 Box Case Break Mixer Immac #NBA https://t.co/ljQxLcvXxx via @eBay",
    "26": "Back-to-back nights with Mike talking NFL Combine and New Orleans #Saints. \n\nAlso back-to-back with @NOLAJake as he talks Pelicans! https://t.co/3nqiqxh2yS",
    "27": "With newly-acquired CJ McCollum, the Pelicans are starting to make some noise in the West. How will New Orleans fare against Utah tonight? Join Joe, Tony, Andy and Steve for the NBA Tip-Off Show. https://t.co/WACLEMroDv",
    "28": "Congratulations to tqp who moved up 1 spot to take #8 on the New Orleans Pelicans team leaderboard.\n\nhttps://t.co/GpM0g45jmR",
    "29": "#NBA75\n\n💎 Mortal @26,03 : Philadelphie OT x Indiana OT x Milwaukee  OT x New Orleans Pelicans OT x New York OT ( 0,2% )\n\n♻️/❤️ si tu tentes ! 🔥\n\n#TeamParieur",
    "30": "New Orleans Pelicans Predictions and Preview for 3/4/2022 hosts Utah Jazz.  Find out who we are taking in this matchup. #Basketball #Sportsbook https://t.co/qbkldDEMRI",
    "31": "New Orleans Pelicans Predictions and Preview for 3/4/2022 hosts Utah Jazz.  Looking for betting action?  Find out if there is any value in our preview. #Basketball #Sportsbook https://t.co/qbkldDWogi",
    "32": "The @PelicansNBA are 10 games below .500, but they're going to give the @utahjazz a tough test tonight in New Orleans. \n\n#TakeNote \n\nhttps://t.co/PynojdrcOK",
    "33": "Every time somebody ask @CJMcCollum  about being in New Orleans 😂 #WBD  #Pelicans @PelicansNBA ... We’re Happy and Grateful to have you bro !!!! https://t.co/lHj0EMw6p8",
    "34": "Top 5 en defensas desde el 31 de enero:\n\n1. Boston Celtics\n2. Miami Heat\n3. Phoenix Suns\n4. New Orleans Pelicans\n5. Oklahoma City Thunder\n\n👉🏻 @CrainNBA https://t.co/9NxyPVPMuU",
    "35": "Jaxson Hayes on seeing NAW again | New Orleans Pelicans #NewOrleans #Pelicans #NBA Video: https://t.co/NPlUTJ9gHG",
    "36": "A little bit of Jazz in the Big Easy 🎶\n\nPelicans Live begins tonight at 6:30PM on Bally Sports New Orleans!\n\n@PelicansNBA | #WBD https://t.co/iIuouVQyV7",
    "37": "The city of New Orleans is proud of our Pelicans! Don’t let some bum who has more success on tv than a  basketball court tell you otherwise. #wbd",
    "38": "#NBA \n\nUtah/NO\n\nJazz are 12-4-1 ATS in the last 17 meetings in New Orleans\nJazz are 1-4 ATS in their last 5 road games\nPelicans are 9-4 ATS in their last 13 games\nPelicans are 1-5 ATS in their last 6 games as a home underdog",
    "39": "NBA Basketball Game Betting Picks Simulator: 8:10 PM ET - Utah Jazz vs. New Orleans Pelicans - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/8SpJtbBnAg #nba #sportsbetting #freepicks #cappertek",
    "40": "Pelicans Shootaround Update: New Orleans, Jackson Hayes Making Big Progress on Defense | New Orleans Pelicans https://t.co/fpOcEyTL2N",
    "41": "Analyzing Friday’s Utah Jazz at New Orleans Pelicans odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/SJeIVPYwsN",
    "42": "#Pelicans shootaround update for 7 p.m. home game vs. Jazz (New Orleans leads #NBA in defense since All-Star break; Jaxson Hayes making strides on defense and in his new role at starting power forward; Utah scouting report; lineup notes/keys): https://t.co/T9Akd0yIgW https://t.co/TLcZn85D8q",
    "43": "5W-3L.. New Orleans Pelicans +4 over Utah Jazz https://t.co/AGWynndkNl",
    "44": "Utah Jazz at New Orleans Pelicans odds, picks and predictions https://t.co/qp1ZVHDb0k",
    "45": "“Why the Zion-less Pelicans Have Reason to Be Optimistic”\n\nMore facts supporting the notion that there’s something special brewing in New Orleans. Bravo @MichaelVPina https://t.co/AOYe2wbJB7",
    "46": "Quite honestly, I think there is a better chance of the Sacramento Kings catching the Los Angeles Lakers for the final play-in spot than them catching the New Orleans Pelicans. Who would have thought that back in October?",
    "47": "The Utah Jazz face the New Orleans Pelicans in Friday's NBA Basketball Action. Get Trending Rabbit's NBA Basketball Pick and Prediction for this game.\n\n#NBA #NBAPick #NBAPredictions #NBAOdds #JazzVsPelicans https://t.co/8xseXMU4TS via @YouTube",
    "48": "@the1nonlycoop The Pelicans have the Utah Jazz tonight. Let's what Brandon Ingram, CJ McCollum, and Jonas Valanciunas can do. New Orleans has been playing really well as of late. Beating Utah tonight would be huge.",
    "49": "@Garrick_Rattler Obviously Jazz fits New Orleans better than Utah, but it's too far gone now. Pelicans FL",
    "50": "On this day in sports history March 4, Luka Dončić recorded his 22nd career triple-double (30 Points, 17 Rebounds, and 10 Assists) in a 127-123 win against the New Orleans Pelicans, passing Jason Kidd for most triple-doubles in Dallas Mavericks franchise history, in 2020.",
    "51": "The Utah Jazz take on the New Orleans Pelicans tonight from the Smoothie King Center. Brandon Ingram vs Donovan Mitchell is a must watch! \n\nBoth teams come in with a three game winning streak so who keeps it going? New preview for @TWSN___\n\n#TakeNote #WBD\n\nhttps://t.co/EwH1yPRFsd",
    "52": "New post (Utah Jazz vs New Orleans Pelicans NBA Pick – March 4) has been published on The Sports Geek - https://t.co/Mn1em868GO https://t.co/jyQbvSvD3E",
    "53": "Consensus Line Move:\n2022-03-04 Utah Jazz at New Orleans Pelicans from 224.00 to 222.50\nUnder never wait\n#NBA #sport #programming #realestateagent",
    "54": "🚨 Paging all #knicks fans. Now that the season has taken a turn for the worst, let’s start thinking about the offseason. Would you do this trade? Would the Pelicans do this trade? Cast your votes! Remember, Zion could tell New Orleans he’s out after next season… https://t.co/1Tn8ScwC2q",
    "55": "If Zion Williamson were healthy, the @PelicansNBA  would have a big three in him, CJ McCollum and Brandon Ingram that is very formidable. I think the New Orleans Pelicans will have found a nucleus of a very good team.",
    "56": "Early picks for today. @OnTapBets \n\nLongwood -3.5 1H\nNew Orleans Pelicans +4\nMichigan ML (baseball)\n\n2-leg parlay \nLongwood ML \n&amp;\nNorth Carolina (baseball) ML \n(+111)",
    "57": "Utah Jazz vs. New Orleans Pelicans - 3/4/22 Free Pick &amp; NBA Betting Prediction https://t.co/ZVAvxrpp3E\n.\n#Betting #FreePicks https://t.co/VNiKBjuk2w",
    "58": "The New Orleans Pelicans??? Playing defense??? 🤩 https://t.co/0WeF7lw8Xf",
    "59": "@JrepsLA Because management has given up completely.  The winner in this whole deal is the New Orleans Pelicans who have our un protected first round pick this season.",
    "60": "NBA Picks 3/4/22 Utah Jazz vs New Orleans Pelicans https://t.co/en1ZFpmO7G via @YouTube",
    "61": "Utah Jazz vs New Orleans Pelicans Odds\nhttps://t.co/bezlpnY8uF\nhttps://t.co/bezlpnY8uF",
    "62": "Good morning to the New Orleans Pelicans, who are only one game away from taking the 9 seed from the Lakers.",
    "63": "965 New Orleans Pelicans https://t.co/fVunRyESL7",
    "64": "Five things to know about Pelicans on March 4, 2022 | New Orleans Pelicans https://t.co/0EPQAZGces",
    "65": "Consensus Line Move:\n2022-03-04 Utah Jazz at New Orleans Pelicans from 226.50 to 224.00\nUnder who saw that coming?\n#NBA #sportspicks #pythonprogramming #bitcoinmining",
    "66": "Consensus Line Move:\n2022-03-04 Utah Jazz at New Orleans Pelicans from 3.50 to 4.50\n#TakeNote what ya gonna do?\n#NBA #bettingsports #analytics #blockchain",
    "67": "@YoNewChi Very true. It's fun talking shit about New Orleans missing out on Ja, but I'd really like to see Zion get himself healthy and the Pelicans get themselves on track. Memphis and NOLA should absolutely be a huge rivalry.",
    "68": "The Memphis Grizzlies need to make free throws to get past the New Orleans Pelicans in the conference finals #GrindCity #WBD",
    "69": "Consensus Line Move:\n2022-03-04 Utah Jazz at New Orleans Pelicans from 228.00 to 226.50\nUnder for real?\n#NBA #bet #developer #btc",
    "70": "Utah Jazz vs  New Orleans Pelicans Prediction 3/4/22 - Free NBA Picks https://t.co/7upZfw1sAW via @YouTube",
    "71": "@Lakers Might not make the playoffs or playin tournaments if you keep playing like this. New Orleans pelicans and Portland TrailBlazers are playing much better and not far behind.",
    "72": "Zion Williamson: Is His Exit from New Orleans Inevitable? @NGSCSports @NBA @Zionwilliamson @PelicansNBA \n\nhttps://t.co/wzSZlC3lu9",
    "73": "The New Orleans Pelicans wore yellow socks during Wednesday's game to show solidarity with the Ukrainian people https://t.co/E7IzOkABQ2",
    "74": "NBA Basketball Game Betting Picks Simulator: 8:10 PM ET - Utah Jazz vs. New Orleans Pelicans - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/8SpJtbBnAg #nba #sportsbetting #freepicks #cappertek",
    "75": "2 lower bowl Tickets Phoenix Suns@ New Orleans Pelicans 1/4/22 New Orleans, LA #eBay🇺🇸 #Tickets #Sports #SportsTickets https://t.co/dWmp4sU3VC",
    "76": "It’s so funny that New Orleans has a basketball team. “Pelicans” lol it doesn’t even sound real",
    "77": "@WlsonWms2 @_JasonLT Got spanked by #8 Seed Clippers and the 10th Seed New Orleans Pelicans.\nShould have kept last season’s #1 Defense ranked roster.",
    "78": "@shiblinski @Sedano The pelicans traded this to the Thunder but it’s protected pick if it lands 1-8 First round: Owned by New Orleans Pelicans (No. 1-8 protected, unprotected in 2022)",
    "79": "The lakers are 1 game ahead of new orleans and 2 games ahead of portland\n\nTheir next 10 games aren’t that insane but the 10 games after that is the death stretch:\n\nSixers\nPelicans\nMavericks\nJazz\nPelicans\nNuggets\nSuns\nWarriors\nThunder\nNuggets\n\nThey are not making the play in",
    "80": "@ScottDKushner @CorkPels Also alot of people at are saints game isn't from just new Orleans I live across the state and go to both but when we're loosing it's hard to justify driving 4 hours to watch a game of the pelicans even if tickets are 8 dollars",
    "81": "With the LA Clippers prevailing 132-111, the New Orleans Pelicans are within ONE GAME of the Lakers for 9th in the West.\n\nSure feels like the question isn't whether the Pels pass the Lakers in the standings but rather can L.A. hold onto 10th and squeeze into Play-In Tournament!",
    "82": "Detroit Lions &amp; the New Orleans Pelicans https://t.co/YYjTC1fZMx",
    "83": "New Orleans Pelicans future looking bright with all these Lakers picks https://t.co/q7ex9NcJCU",
    "84": "NBA Basketball Game Betting Picks Simulator: 3/4/2022 8:10 PM ET - Utah Jazz vs. New Orleans Pelicans - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/8SpJtbBnAg #nba #sportsbetting #freepicks #cappertek",
    "85": "Longview's local dance team to perform at a Pelicans basketball game in New Orleans. https://t.co/OH91q6pRAt",
    "86": "@loganmmurdock: New Orleans shouldn't have an NBA team. Pelicans should relocate. \n\nMe: https://t.co/zTWLSfiqvW",
    "87": "@superduck130 @AlexKennedyNBA Unfortunately (for the pelicans), this doesnt translate to game attendance. Watching from tv does not benefit new orleans pelicans.",
    "88": "@KyleWhitmoree You come smack me , you a pelicans fan or hawks fan? You from New Orleans or Kansas ? 😂😂",
    "89": "@ScottDKushner The ownership. The pelicans are an afterthought. New Orleans is all about the Saints. It’s sad that the pelicans don’t get much love.",
    "90": "Check out NEW ORLEANS PELICANS 2020-21/2021-22 Basketball 8 Box Case Break Mixer Immac #NBA https://t.co/ljQxLcvpHZ via @eBay",
    "91": "It’s getting so annoying seeing people who don’t follow or interact with anyone from New Orleans or even the state of Louisiana act like people don’t care about the pelicans.",
    "92": "@mystalkerisadik They were in Oklahoma City for a while,  but they went back to New Orleans. Then New Orleans became the Pelicans, Oklahoma City got the Thunder, and the Hornets went to Charlotte.",
    "93": "Boston Celtics &amp; Dallas Mavericks are the two teams that have gotten a lot better since the beginning of the season. Toronto Raptors &amp; New Orleans Pelicans are behind those two teams.",
    "94": "New Orleans pelicans just sent me an email asking if I'd join the team in place of Zion Williamson 😳",
    "95": "@loganmmurdock @JomiAdeniran Next episode needs to be an apology to the New Orleans Pelicans",
    "96": "YES OR NO ⁉️ Will Donovan Mitchell score 32+ points vs the New Orleans Pelicans tomorrow? ⬅️➡️⁠\n⁠\nComment below \"Yes” to back and \"No” to challenge this take! 💬 https://t.co/QjQ2AT0WWj",
    "97": "“If you’re the Pelicans, put Zion Williamson’s face on the marketing and promotional materials” - Jalen Rose tells the New Orleans Pelicans to give Zion Williamson a blank check\nhttps://t.co/aO1R3GBKKX",
    "98": "@J_Michaels25 New Orleans Pelicans/Hornets",
    "99": "The New Orleans Pelicans wore yellow socks during Wednesday's game to show solidarity with the Ukrainian people https://t.co/NeA3MckDQj",
    "100": "YESSIR!! Here's what I would suggest: \n\nSince both Seattle &amp; Las Vegas belong on the West Coast, I think it's appropriate that they get to replace 2 West teams: \n\nSacramento Kings ➡️ Seattle #BringBackTheSonics\nNew Orleans Pelicans ➡️ Las Vegas\n\n🏀💯 https://t.co/oiamZcImp6",
    "101": "@Super70sSports New Orleans Pelicans",
    "102": "@macwebb @alta_kkennon @vishant_mittal @GameInjuryDoc I said no more talk about THE OLD LEBRON, meaning from the Cleveland Cavs and Miami Heat days. 😂😂😂\nThat version of Lebro James would not have gotten humiliated by the New Orleans Pelicans.",
    "103": "Naji Marshall - New Orleans Pelicans\n17 PTS\n3 RBD\n1 AST\n[FD(22.1) DK(23.25)]",
    "104": "Herbert Jones - New Orleans Pelicans\n14 PTS\n6 RBD\n3 BK\n2 STL\n2 TO\n[FD(34.2) DK(31.5)]",
    "105": "Jaxson Hayes - New Orleans Pelicans\n13 PTS\n7 RBD\n4 AST\n1 BK\n2 TO\n[FD(28.4) DK(28.75)]",
    "106": "Brandon Ingram - New Orleans Pelicans\n33 PTS\n5 RBD\n6 AST\n3 TO\n[FD(45) DK(47.75)]",
    "107": "@blazersforreal 2018 New Orleans Pelicans"
}