{
    "0": "@sansports4 @money_talks65 Rondo was Anthony Davis’s brains of the operations guy when they were teammates for the New Orleans Pelicans eliminating Damian Lillard in the 1st Round of the Playoffs = 4-0 sweep. Will find a conservative pure point guard.",
    "1": "Handcaps: \nDallas Mavericks -3.5\nMemphis Grizzlies -6.5\nToronto Raptors -3.5\nGolden State Warriors -5.5\nBrooklyn Nets +3.5\nNew Orleans Pelicans +6.5\nMilwaukee Bucks +6.5",
    "2": "The Pelicans are excited about what trade additions to a team that is already playing winning basketball. New Orleans Pelicans https://t.co/dke02pwEJD",
    "3": "👻: You wanted the Pelicans to be great didn’t you?\n\nMe: Yes\n\n👻: What did it cost you?\n\nMe: The New Orleans Saints https://t.co/EyXdiNhQsx",
    "4": "New Orleans Pelicans (+4) vs. Miami Heat #HeatCulture #WBD #NBA #NBATwitter #NBA75",
    "5": "Detroit Pistons - Memphis Grizzlies\nNew Orleans Pelicans - Miami Heat\nHouston Rockets - Toronto Raptors\nDallas Mavericks - Los Angeles Clippers\nPhoenix Suns - Milwaukee Bucks\n\nBet slip link: https://t.co/3iKE6I03ek https://t.co/sShR1ULbro",
    "6": "Indian Cowboy\nNBA\n\n4 - Toronto Raptors -8.5 over Houston\n4 - New Orleans Pelicans +4.5 over Miami",
    "7": "@cclark_13 @kimmyann1111 Hey, New Orleans @PelicansNBA \nYou got one of the best. Treat @CJMcCollum well, because dude is nails on the court and his career post-playing days is gonna be even bigger.\nRip City will be rooting for ya, (except when we play 🤪)",
    "8": "New Orleans Pelicans Starters:\n\nDevonte' Graham\nCJ McCollum\nBrandon Ingram\nHerbert Jones\nJonas Valanciunas\n\nPlayers out:\nWilly Hernangomez\nLarry Nance\nZion Williamson\n#WBD #NBA #NBATwitter #NBA75",
    "9": "Tonight's starting lineup for the New Orleans Pelicans: Graham, McCollum, Ingram, Jones, Valanciunas https://t.co/bVWH4AMCA2",
    "10": "ML PARLAY\nWashington Wizards -105\nNew Orleans Pelicans +158\nHouston Rockets +274\nLos Angeles Clippers +222\n\n Pays 60 to 1",
    "11": "Come out this Saturday for a night with the New Orleans Pelicans. Students must pay $20 to CSI Office by 12 PM on Friday. Your ticket and a New Orleans Pelicans Quarter Zip Jacket is included in the price! @XABoard https://t.co/nh8UDjnof9",
    "12": "((LIVE)) NBA Basketball New Orleans Pelicans vs Miami Heat | [Stream Now] : https://t.co/rRoByLv2jm | 10-Feb-22 | 19:30 | NBA | Basketball | New Orleans Pelicans | vs | Miami Heat https://t.co/r5RvfouGdp",
    "13": "@DruProductions Pelicans fans are like that annoying ex you don’t acknowledge but they’re always talking about you. AD barely even acknowledges that he actually lived in New Orleans and these dudes get on Twitter everyday talking about him lol",
    "14": "ATS Stats Streak Monitor -NEW ORLEANS 5 ATS WIN #Pelicans  Full odds at https://t.co/nUn5OcMhOI",
    "15": "NBA Basketball Game Betting Picks Simulator: 7:40 PM ET - Miami Heat vs. New Orleans Pelicans - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/txo2lYOnnH #nba #sportsbetting #freepicks #cappertek",
    "16": "I just got asked to go to the Pelicans game tonight in New Orleans and I had to decline cause it’s no way I can be ready or there in time 🤦🏾‍♀️🤦🏾‍♀️",
    "17": "@AyeThatsCash @MikeLJ3699 @FanDuel I love when people think whoever got the better player always wins the trade. Only team I think of who did is Pelicans getting McCollum. \n\nNew Orleans just making playoffs is a win for them 😅",
    "18": "Pelicans fans, if the Pels decided to get completely new jerseys, would you prefer they keep the current color scheme (blue, red, white, gold) based on the New Orleans flag, or would you want to see them change the colors? Perhaps a permanent purple, green, and gold color scheme?",
    "19": "📌 Apuesta baloncesto – NBA 21/22 – NEW ORLEANS PELICANS vs MIAMI HEAT\n🔗 https://t.co/uUDlwkFFCt https://t.co/tedRlPFYzM",
    "20": "📌 Apuesta baloncesto – NBA 21/22 – NEW ORLEANS PELICANS vs MIAMI HEAT\n🔗 https://t.co/CU0fOoLkR4 https://t.co/kICEGAT7zG",
    "21": "@pels_mchl @deeharris1213 @PelicansNBA Well something happen almost every second in new orleans so you much hear a lot of sirens mate",
    "22": "Hey @PelicansNBA we the fans would love if you guys would give @SaintsSoulja some serious thoughts about getting SKC more packed and changing the environment!!! New Orleans is always a party and basketball nights should be the same!!!",
    "23": "NBA Play:🏀✨\n\n1️⃣Heat -4 (-120) \n\n-Miami is 7-1 ATS in their last 8 games against New Orleans.\n\nCJ McCollum makes his Pelicans debut today…. but I Still Trust you Heat https://t.co/yyOP3z3lPj",
    "24": "@deeharris1213 @PelicansNBA You surprised it's new orleans",
    "25": "Another t-shirt from my collection. New Orleans Pelicans. https://t.co/tML5cpdoZf",
    "26": "🏀 New Orleans Pelicans - Miami Heat\n\n⭐️ New Orleans vainqueur (2.55)\n⭐️ CJ McCollum +27.5 PRP (1.86) https://t.co/bezYwLEK7Z",
    "27": "@PelicansNBA Take care of our boy New Orleans. He's a legend here in Milwaukee.",
    "28": "🔴Live ~ Miami Heat vs. New Orleans Pelicans - NBA League | 2022 💯\n🔗 🔴Watch Live Fullᴴᴰ 👉 : https://t.co/5NtA0S6WeF ✅\n📆 :On Thursday. February 10 /2022\n⏰ 7:30 PM\nDONT FORGET TO RE-TWEET AND FOLLOW FOR MORE INFO AND UPDATE.",
    "29": "Detroit Pistons - Memphis Grizzlies\nNew Orleans Pelicans - Miami Heat\nHouston Rockets - Toronto Raptors\nGolden State Warriors - New York Knicks\n\nBet slip link: https://t.co/8C1RO0snBc https://t.co/nia4seOBgU",
    "30": "New Orleans Pelicans",
    "31": "*Pelicans put CJ McCollum, Brandon Ingram and Valanciunas surrounding Zion.*\n\nNational Media: Trade Zion to NY, New Orleans failed him! It’s AD situation all over again\n\n*Mavs put Jalen Brunson, Tim Hardaway Jr and Spencer Dinwiddie surrounding Luka*\n\nNational Media: 😴💤🛏🥱🛌",
    "32": "@emi_f1sher Support the pelicans!!! We’re not quite middle of the pack but we do have some potentially exciting young people like Zion Williamson… also it’s the team of New Orleans!!",
    "33": "CJ McCollum had some say in trade to New Orleans Pelicans, ‘excited’ for opportunity https://t.co/swwfPf7oqo",
    "34": "CJ McCollum has arrived, and he lets us know what he thinks of joining the New Orleans Pelicans. https://t.co/Wdbhk4Sj5s",
    "35": "CJ McCollum has arrived, and he lets us know what he thinks of joining the New Orleans Pelicans. https://t.co/8mkcqDXDSl",
    "36": "CJ McCollum has arrived, and he lets us know what he thinks of joining the New Orleans Pelicans. https://t.co/wxeTKySjKm",
    "37": "CJ McCollum had some say in trade to New Orleans Pelicans, 'excited' for opportunity\nhttps://t.co/B0HJavSwsY\nhttps://t.co/B0HJavSwsY",
    "38": "@HickoryHigh New Orleans Pelicans\n\nOut: N. Alexander-Walker, T. Satoransky, D. Louzada, 1st-rd. pick, 2 2nd-rd. Picks\n\n\nIn: C. McCollum, L. Nance, T. Snell\n\nGrade: https://t.co/hj14Xc3vro",
    "39": "Miami Heat vs New Orleans Pelicans NBA Pick and Prediction NBA Betting Tips 2/10/2022 https://t.co/iM9fYhmAQ6 via @YouTube #NBA #NBAPick #NBAPredictions #NBAOdds #Pelicans #Heat #HeatCulture #WBD #PelicansVsHeat",
    "40": "Sources says #Pelicans will announce PF Zion Williamson to return to basketball activities on 2/11 &amp; “hopeful” team can get him back into lineup after ASB. Huge news out of New Orleans.",
    "41": "@PelicansNBA Great acquisition for the young New Orleans Pelicans a stabilizing force for many years to come.",
    "42": "Locked on Pelicans is live!\n\n🏀 Another trade coming for the Pelicans?\n\n🏀 CJ McCollum makes his debut. What will the starting lineup be?\n\n🏀 There is a culture in New Orleans\n\n🎧 https://t.co/BETlDzTh35\n\nWatch on YouTube!\n\n📺 https://t.co/4DBESaga40 https://t.co/rJ9Ft96ODy",
    "43": "@KeithSmithNBA Jose Alvarado - New Orleans Pelicans",
    "44": "CJ McCollum, Tony Snell arrive in New Orleans! 🏀\n\nPhotos 📸: https://t.co/tvadYVztes https://t.co/OydVE6lsdq",
    "45": "Cardless Launches New Orleans Pelicans Card https://t.co/z1YFu6m7bX via @milestomemories https://t.co/Qgc14isXsd",
    "46": "Cardless Launches New Orleans Pelicans Card https://t.co/vcwTWGg2u8 https://t.co/OssuwywHgA",
    "47": "@DaEntertainah85 Atleast my Pelicans got CJ McCollum, and No, Knicks fans, Zion is never leaving New Orleans.",
    "48": "CJ McCollum on coming to New Orleans | Pelicans Shootaround 2-10-22 https://t.co/YaksM2CWYD via @YouTube … CJ already a pels legend, see what he says at the end “WHEN we make the playoffs”",
    "49": "CJ McCollum had some say in trade to New Orleans Pelicans, 'excited' for opportunity \nhttps://t.co/6lpjoz8LbE",
    "50": "The New Orleans Pelicans won the trade deadline btw",
    "51": "#PelicansMobile #GoPelicans: Pelicans shootaround update: CJ McCollum calls New Orleans ‘a great place for me to evolve’…⁦@CJMcCollum⁩ IF YOU LOVE NOLA, IT’LL LOVE YOU BACK…WELCOME TO NOLA (#PelsNation) #WBD  https://t.co/iGlwGaIkyF",
    "52": "#Sports #TopStories CJ McCollum Moves To New Orleans Pelicans From Portland: End Of The Trail Blazers Era: An era ended as CJ McCollum parted ways with the Portland Trail Blazers. The latter struck a deal to trade their veteran guard to the New Orleans… https://t.co/Etq9gsLyrq",
    "53": "Pelicans Shootaround Update: CJ McCallum Calls New Orleans ‘A Great Place for Me to Grow’ New Orleans Pelicans https://t.co/QduRSZaz9B",
    "54": "@stephenasmith Are you recanting what you said about the pelicans and nobody wants to play in New Orleans?",
    "55": "2/19/15 he was traded by the #Thunder with Latavious Williams, cash and a 2015 2nd round draft pick to the New Orleans Pelicans for a 2016 2nd round draft pick.",
    "56": "BREAKING: \n\nBulls trade Patrick Williams, coby white , Derrick Jones Jr, and a future first round pick to the New Orleans Pelicans for Zion Williamson and Brandon Ingram \n\nPer(@BradenRisser) UNREAL🤯#nba #BullsNation #Pelicans",
    "57": "@PelicansNBA Thankful that he was involved in the decision at least from what he said. I would feel really bad for him if they sent him to new orleans without telling him. I think if he chose this spot then he did so out of a want to help lead a team of young guys to grow/have playoff success",
    "58": "I really don’t get what kinda fetish it is/turn on that New Orleans locals, who don’t support the pelicans, get out of shitting on the Pelicans. Like you really just look goofy and dumb.",
    "59": "my boss is at a conference in new orleans this week and she just texted me that she got tickets to the Pelicans vs Heat game tonight. I’m SOOOO jealous! #HEATCulture",
    "60": "New Orleans Pelicans 2023 NBA Champions https://t.co/nCKI3czdhz",
    "61": "@ProJerseyNBA @HeataoMil_grau Miami Heat 112 - 107 New Orleans Pelicans",
    "62": "It crazy the New Orleans Pelicans can go on a 20 game winning streak and media will still found a way to bash us 🤣🤣",
    "63": "Tony Snell on watching #Pelicans from afar lately and coming to New Orleans: \"I’ve been paying attention. They’ve been playing really well. I’m very excited to bring my skills to the team. (Brandon Ingram) has been playing phenomenal.” https://t.co/1XYWN6rvNM",
    "64": "#Pelicans shootaround update ahead of 6:30 p.m. home game vs. Heat (CJ McCollum says coming to New Orleans \"is a great situation for me... a great place for me to evolve\"; East-leading Miami scouting report; lineup notes + keys): https://t.co/rx5jQCJ2BY https://t.co/fRrSvULsDA",
    "65": "Detroit Pistons - Memphis Grizzlies\nNew Orleans Pelicans - Miami Heat\n\nBet slip link: https://t.co/lu4vV64lih https://t.co/AVXdk7jeDK",
    "66": "As a pelicans fan I can’t wait to see cj on the court tonight. Watched his interview and the fact he wanted to come to New Orleans is amazing. Welcome to the pelicans @CJMcCollum glad to have you",
    "67": "Vitals for Heat at Pelicans tonight in New Orleans \n\n⁦@ShandelRich⁩ #miamiheat \n\n#LEGENDoftheMiamiHEAT #NBA75 https://t.co/v144CgKNUy",
    "68": "#MIAvsNOP \n\nTonight, We’re in New Orleans. \n\nThe (22-32) Pelicans take on \n\nThe visiting (35-20) HEAT. \n\nTip off set for after 7:30 pm.\n\n@MiamiHEAT @PelicansNBA \n\n#LEGENDoftheMiamiHEAT #NBA75",
    "69": "NBA Betting Trend: New Orleans Pelicans are 19 - 7 when playing against a good team (Win Pct. 60% to 70%) while at home over the last three years\n#sports\n#sportbetting",
    "70": "Analyzing Thursday’s Miami Heat at New Orleans Pelicans odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/UsIqOjmgY6",
    "71": "Miami Heat at New Orleans Pelicans odds, picks and predictions https://t.co/yaGqynJf3R",
    "72": "According to @MattMooreTAN, #Pelicans star SF Brandon Ingram shares a strong relationship and affinity for #NBAKings #Kings interim head coach Alvin Gentry from their time in New Orleans but Ingram has not and most likely will not request a trade.",
    "73": "@PelicansNBA Zion is getting on a plane back to New Orleans soon though right?",
    "74": "CJ McCollum on why he's excited to join the #Pelicans:\n \n🏀 Young Talent\n\n🏀 \"Have you seen B.I. play lately?\" 😀\n\n🏀 He spoke with Chris Paul, JJ Redick and others about Willie Green and coming to New Orleans\n\n🏀 Zion 💪\n\n#WBD https://t.co/uKmCMfw8ed",
    "75": "Locked on Pelicans is live!\n\n🏀 Another trade coming for the Pelicans?\n\n🏀 CJ McCollum makes his debut. What will the starting lineup be?\n\n🏀 There is a culture in New Orleans\n\n🎧 https://t.co/BETlDzTh35\n\nWatch on YouTube!\n\n📺 https://t.co/4DBESaga40 https://t.co/OI9WzLD3H6",
    "76": "@jailblazin @mikeacker Same dude that blew 3 15 point leads against the Warriors in the WCF? Same dude that got swept by the New Orleans pelicans? Same dude who couldn’t beat an injury depleted Nuggets team last year in the playoffs?",
    "77": "@MaiorDoBrasil9 @devinhodo @PelsPress I know that but pelicans nor woj or like shams made a report on Zion being back so why would the pelicans gear team take his practice jerseys out if he wasn’t in New Orleans hmmmm?!",
    "78": "Christian James McCollum, the president of the NBA players association, is changing the narrative about the New Orleans Pelicans",
    "79": "@JTCowan Lol signing Russ has got to be an all time bad move. Biggest beneficiary: New Orleans Pelicans. The situation where all the picks they sent out for AD are in the lottery. Absolutely hilarious.",
    "80": "First look at CJ McCollum (&amp; Tony Snell) in their New Orleans Pelicans gear! \n\nBoth practiced with the team for the first time today! \n\nHow will McCollum fit in NOLA? 🤔 https://t.co/kKLBvB0lEB",
    "81": "CJ McCollum says he was involved in the process in his move from Portland. Said the young talent in New Orleans and playing with Brandon Ingram made the Pelicans a situation he was interested in.",
    "82": "🏀CBB Best Bets 2/10:\n\nMiddle Tenn. St. -5 (-110)\nVMI -3.5 (-110)\nCleveland St. -9.5 (-110)\nDuke -6 (-110)\nNew Orleans -2 (-115)\nUtah Valley ML (-122)\nStephen F. Austin -12 (-120)\nMurray St. -14.5 (-110)\n\n🏀NBA Best Bets 2/10: \n\nPelicans +4.5 (-110)\nKnicks/Warriors o217.5 (-110)",
    "83": "It's #PelicansGameDay New Orleans! 🏀\n\n#Pelicans | #WBD https://t.co/raNgMbzKAl",
    "84": "Reports out of Dallas are surfacing that the team is making a push to trade star forward Kristaps Porzingis and multiple first round picks to the New Orleans Pelicans for Jonas Valanciunas.",
    "85": "Consensus Line Move:\n2022-02-10 Miami Heat at New Orleans Pelicans from 215.50 to 218.00\nOver did I do that?\n#NBA #bettingpicks #datascientist #financialliteracy",
    "86": "@BrianLehrer So disappointed with The New Orleans Pelicans... they should've been The New Orleans BRASS",
    "87": "@PelicansNBA @CJMcCollum The #Pelicans have not been to the playoffs in the past 3 seasons , but this year they have a decent shot at the 8 seed. New Orleans actually might be turning things around .. #NBA75 #NBATradeDeadline https://t.co/ptg9CbELh0",
    "88": "@money_talks65 @WhyNotBr0die2 @Lakers Anthony Davis is not the leader, he is Lebron James’s little brother. 😭😭😭\nLebron James has to show leadership and DEMAND MORE FROM A.D.\nRondo did that to A.D as teammates with the New Orleans Pelicans. A.D must be led, he is not self-motivated.",
    "89": "Will the New Orleans Pelicans make another trade?\nhttps://t.co/LqwNA3TCof\nhttps://t.co/LqwNA3TCof",
    "90": "CJ McCollum makes his Pelicans debut tonight 👀\n\n@PelicansNBA vs @MiamiHEAT \n⏰ 6:00 pm\n📺 Bally Sports New Orleans\n📲 Bally Sports App\n#WBD https://t.co/ZfJ9nufyAq",
    "91": "Locked on Pelicans is live!\n\n🏀 Another trade coming for the Pelicans?\n\n🏀 CJ McCollum makes his debut. What will the starting lineup be?\n\n🏀 There is a culture in New Orleans\n\n🎧 https://t.co/BETlDzBFEv\n\nWatch on YouTube!\n\n📺 https://t.co/4DBES9YyFq https://t.co/mJMKpsrqi7",
    "92": "@SpelingExpirt2 @PelicansNBA @BSSportsbook We are lucky to have an NBA team in New Orleans &amp; I will always try to support them.",
    "93": "@dannydealguru The New Orleans Pelicans card is restaurant and gas only, not supermarkets, or am I wrong?",
    "94": "Miami Heat at New Orleans Pelicans Feb.10 2022 Free Play NBA and Picks #johnnyhahnwins #nba\n\nhttps://t.co/d6rCKRDYem",
    "95": "Consensus Line Move:\n2022-02-10 Miami Heat at New Orleans Pelicans from 216.50 to 215.50\nUnder what ya gonna do?\n#NBA #gambling #python #binary",
    "96": "NBA Game Preview: The Miami Heat have a forecast 54% chance to win against The New Orleans Pelicans with a spread of -4.5/4.5 and an over/under of 225.5. The Miami Heat are 1 - 0 against The New Orleans Pelicans in the 2021-22 Season.\n #bettingtips\n#sportbetting",
    "97": "It’s NBA trade deadline day, and our writers have the latest intel and news.\n\n@johnhollinger has an update from the Pelicans-Blazers trade that sent CJ McCollum to New Orleans.\n\nMore: https://t.co/YfVk6rCnsC https://t.co/C10thP32JG",
    "98": "CJ playing for the New Orleans @PelicansNBA tonight. It’s a beautiful day outside. \n\nI’m not even upset there’s pulp in my orange juice",
    "99": "#MIAvsNOP \n\nMiami Heat 🆚 \n\nNew Orleans Pelicans, Tonight 7:30 \n\n@MiamiHEAT @PelicansNBA \n\n#LEGENDoftheMiamiHEAT #NBA75 https://t.co/Ocx9ArYvVg",
    "100": "Pelicans tip 30 minutes earlier tonight. Smoothie King Center should be packed for the debut of CJ McCullom against the Heat. Miami currently 5.5-point favorites over New Orleans. https://t.co/NvZwELrhT2",
    "101": "Five things to know about Pelicans on February 10, 2022 | New Orleans Pelicans https://t.co/AqDWgn8YGZ",
    "102": "The Kings earned their first win since making a 6 player trade with Indiana. As the Kings make a push for the postseason. #SACvsMIN \n\nSacramento sits 2 games out from the 10th seeded New Orleans Pelicans. https://t.co/kPoIJS8nTI",
    "103": "Miami Heat vs  New Orleans Pelicans Prediction 2/10/22 -  Free NBA Picks https://t.co/ZtIU4xiuqx via @YouTube \n\n#NBA #NBAPick #NBAPrediction #basketball",
    "104": "DasHaus made a bet!\n\nEvent: Miami Heat vs New Orleans Pelicans #NBA\nBet: New Orleans Pelicans TO WIN +5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "105": "Five things (Two #Pelicans trade additions expected to be available Thursday for 6:30 p.m. home game vs. Heat; \"Pelicans Weekly\" radio show with David Griffin on trade; @PodcastPelicans guest is @adaniels33; deal addresses multiple needs for New Orleans): https://t.co/UBpO33H2hK",
    "106": "Early NBA Leans :\n\nDallas Mavericks -7 \nNew Orleans Pelicans +4\n Memphis Grizzles -12 \nToronto Raptors -8 \nGolden State -9.5",
    "107": "Miami Heat At New Orleans Pelicans Preview https://t.co/cOKb7nchmR",
    "108": "PSA: CJ McCollum plays basketball for New Orleans Pelicans tonight! T’s &amp; P’s for the rest of the West https://t.co/1bQoMywosU",
    "109": "Fresh off of Tuesday’s blockbuster trade, the New Orleans Pelicans say that C.J. McCollum and Tony Snell will make their debuts Thursday night in the Smoothie King Center against the visiting Miami Heat.  https://t.co/zFAE2q1GB1",
    "110": "Good morning Pelicans fans. Zion is back in New Orleans.",
    "111": "Miami Heat (35-20) vs. New Orleans Pelicans (22-32)\nFebruary 10, 2022 7:30 pm EDT\nFree Pick: Over 216\nOdds: 1.80",
    "112": "Locked on Pelicans is live!\n\n🏀 Another trade coming for the Pelicans?\n\n🏀 CJ McCollum makes his debut. What will the starting lineup be?\n\n🏀 There is a culture in New Orleans\n\n🎧 https://t.co/BETlDzTh35\n\nWatch on YouTube!\n\n📺 https://t.co/4DBESaga40 https://t.co/TxoOHLNQbr",
    "113": "TIP: New Orleans Pelicans - Miami Heat, P.J.Tucker 7.5 minus, 1.7 by #tipster Sale187 (profit this month: +78.32)\n  #betting #Basketball #New #Orleans #Pelicans #Miami #Heat",
    "114": "🔴 LIVE➠ Miami Heat vs. New Orleans Pelicans - NBA League 2022\n🎟️🎥Live Broadcast➠  https://t.co/NFLkWaxsSy\n📅 : Thursday, February 10, 2022\n⏰ : 7:30 PM",
    "115": "New Orleans Pelicans  \nMost likely to be traded?\n\n#tradedeadline #NBATradeDeadline #NBAFantasy #fantasybasketball #fantasynba",
    "116": "Three-point shootout 👇🏾\n• Desmond Bane - Memphis Grizzlies\n• Luke Kennard - LA Clippers\n• Zach LaVine - Chicago Bulls\n• CJ McCollum - New Orleans Pelicans\n\n#NBAAllStar \n@hooptalk918",
    "117": "Vitals for Heat at Pelicans tonight in New Orleans #miamiheat https://t.co/BtSf6js3cz",
    "118": "The Utah Jazz have signed New Orleans Pelicans guard Nickeil Alexander-Walker in a 3-way trade deal in which the Western Conference side will trade injured veteran forward Joe Ingles to Portland Trailblazers, the team has confirmed.\n#utajazz #nickeil\n https://t.co/tFXd8p9xpH",
    "119": "🏀 NBA\n\nNew Orleans Pelicans - Miami Heat\nHeat -4.5\n\n@ 1.90 (bet365)\n\n#Betting #Basketball #NBA #NBA75  #Inplay #GamblingTwitter https://t.co/Ha97NdxLbJ",
    "120": "New Orleans Pelicans - Miami Heat\nHouston Rockets - Toronto Raptors\nDallas Mavericks - Los Angeles Clippers\n\nBet slip link: https://t.co/MBrjiXvZK9 https://t.co/5xqNURrgAE",
    "121": "@dydsportscom @PelicansNBA New orleans sidekicks",
    "122": "I really hope that the New Orleans Pelicans will be athletic if they get LaMarcus Aldridge #WBD",
    "123": "So are we going to see Zion Williams come back to the NBA or does the New Orleans Pelicans just want to sabotage a young man's career?",
    "124": "Who Will The New Orleans Pelicans Draft? https://t.co/zcWAhzWgLQ",
    "125": "NBA Basketball Game Betting Picks Simulator: 7:40 PM ET - Miami Heat vs. New Orleans Pelicans - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/txo2lYOnnH #nba #sportsbetting #freepicks #cappertek",
    "126": "🏀#NBA ‼️\n1.Detroit Pistons Vs Memphis Grizzlies\n2.Washington Wizards Vs Brooklyn Nets\n3. New Orleans Pelicans Vs Miami Heat\n4.Houston Rockets Vs Toronto Raptors\n5.Dallas Mavericks Vs Los Angeles Clippers ...\n-------\nWatch FREE #livestream here👉https://t.co/z8cdc9kniq 😉 https://t.co/fkmJbXTyq9",
    "127": "New Orleans Pelicans unveil first official branded credit card powered by Cardless | February 9, 2022The New Orleans Pelicans have teamed up with Cardless, a financial technology f #branding\n\nhttps://t.co/99kfAd6Ins",
    "128": "When my team @PelicansNBA wins multiple titles with Zion in small New Orleans Louisiana a place where let national media tell it a place where no basketball player wants to play I'm gonna be like @getnickwright when his Chiefs won the SB but I'm gonna be 100 million times worst.",
    "129": "Pelicans beating the Lakers in that 9-10 play-in game and then the Lakers winning the draft lottery only for that pick to go to New Orleans might be the perfect capper on this shitstorm of a Lakers season.",
    "130": "Detroit Pistons - Memphis Grizzlies\nNew Orleans Pelicans - Miami Heat\nHouston Rockets - Toronto Raptors\nDallas Mavericks - Los Angeles Clippers\n\nBet slip link: https://t.co/okVDjZJLG5 https://t.co/SuWZuzGZsb",
    "131": "Larry Nance Jr., recently traded to New Orleans Pelicans, expected to miss up to 6 weeks after knee surgery\nhttps://t.co/2qs0q4y09a\nhttps://t.co/2qs0q4y09a",
    "132": "CJ McCollum | New Orleans Pelicans\n(Swap made for @rival_bets \n-\n-\n@CJMcCollum \n@Juke_ https://t.co/EGAeAAfUoq",
    "133": "The New Orleans Pelicans have acquired @mirandabbycakes from the Los Angeles Clippers in exchange for dish soap.",
    "134": "Cardless New Orleans Pelicans Card, $300 Bonus and 4X on Dining https://t.co/1aG3VTTnfT",
    "135": "The NBA trade deadline is one day away (3 p.m. ET Thursday), and several significant transactions have already occurred, including the Sacramento Kings acquiring two-time All-Star forward Domantas Sabonis and the New Orleans Pelicans getting guard CJ McCollum.",
    "136": "NBA Basketball Game Betting Picks Simulator: 2/10/2022 7:30 PM ET - Miami Heat vs. New Orleans Pelicans - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/txo2lYOnnH #nba #sportsbetting #freepicks #cappertek",
    "137": "New Orleans getting CJ was a sneaky good pick up. I’ve been thinking it but felt like typing it to the twitterverse. But pelicans still ain’t ish but will be good competition",
    "138": "@nd0rian @PelicansNBA Literally any footage of CJ in New Orleans",
    "139": "Check out this listing I just added to my #Poshmark closet: Zion Williamson Rookie Card Néw Orleans Pelicans. https://t.co/nwnarjUtYJ #shopmycloset @poshmarkapp",
    "140": "Willie Hernangomez remains out for Thursday’s game vs. Heat. New Orleans Pelicans https://t.co/qLWvzlFlBm",
    "141": "New post: Loyalty360 Reads: February 9: New Orleans Pelicans Debut Branded Credit Card, AMC Theatres’ Offers M https://t.co/HeogU2snCf",
    "142": "https://t.co/boDFv6wiIr AND NEW ORLEANS PELICANS ANNOUNCE MULTI-PLATFORM MARKETING PARTNERSHIP. #nfts",
    "143": "Come out this Saturday for a night with the New Orleans Pelicans. Students must pay $20 to CSI Office by 3 PM on Friday. Your ticket and a New Orleans Pelicans Quarter Zip Jacket is included in the price! https://t.co/ymeQFJWHPg",
    "144": "@CJMcCollum see you soon and welcome to New Orleans! @PelicansNBA #WBD",
    "145": "Will Guillory and David Griffin on Pelicans Weekly – February 9, 2022 | New Orleans Pelicans https://t.co/GFBfEmssUQ"
}