{
    "0": "@nyknicks @J30_RANDLE @23savage____ no braids ju? we lost",
    "1": "@nyknicks Grimes masterclass",
    "2": "@nyknicks @J30_RANDLE @23savage____ Play McBride",
    "3": "@nyknicks @J30_RANDLE @23savage____ *LETS LOSE* ‼️😮‍💨",
    "4": "@nyknicks @J30_RANDLE @23savage____ Post Grimes",
    "5": "@nyknicks @J30_RANDLE @23savage____ oh god jules dont got braids in",
    "6": "@FromNYtoLA1 @rmw024 @Jake4nier97 @nyknicks Thibs doesn’t know better than the fans at this stage",
    "7": "🍿 New York Knicks VS OKC THUNDER LIVE PLAY BY PLAY &amp; WATCH-ALONG KNICK Follow Party #OKCvsNYK #ThunderUp vs #NewYorkForever https://t.co/qXDQ6a6jMO",
    "8": "Let's work. https://t.co/3kKs61FntN",
    "9": "The New York Knicks are a 10point favorite tonight??",
    "10": "@nyknicks @IQ_GodSon B r i c k",
    "11": "🚨🚨Here a play I really like in the NBA today ...👇👇👇 *5 UNIT PLAY!!!!\nTOTAL UNDER 105-110 (1H OKLAHOMA CITY THUNDER vrs 1H NEW YORK KNICKS)",
    "12": "@livelikelefty @nyknicks 1969 NBA Championship",
    "13": "@nyknicks Im so done with thibs rn",
    "14": "@TiredBerto Divorce leads kids to watching the New York Knicks",
    "15": "@IamJulito @nyknicks The person looking over your shoulder… https://t.co/YQtrj90TlE",
    "16": "@Prodigalshun @PlayoffBoundNYK @Kennyduhballern @KnicksMemes @nyknicks You right, I’m hating, IQ has been great in 2022! My bad. https://t.co/fXys6dKRXO",
    "17": "@nyknicks @MichelobULTRA @KembaWalker @qdotgrimes The hoodie is fire, anyone got a link?",
    "18": "@KnicksMemes @nyknicks Thibs would rather get his junk chopped off then do that",
    "19": "@nyknicks Knicks in 4 https://t.co/R3oKRe3Gyd",
    "20": "The @NYKnicks starting Walker, Grimes, Fournier, Randle, Robinson on Monday. #Knicks #NBA",
    "21": "Spending this v-day with my fav person @SucioSmash at @nyknicks game 🥰\n#nykmsg https://t.co/9PXwSUWwzO",
    "22": "🇦🇺  @joshgiddey makes his debut on the MSG stage today as the @okcthunder travel to New York. What has the Wizard of OZ got in store for the Knicks?  \n\n#ThunderUp #NBA75 \n\n⏰ 11:30am AEDT\n📲💻 LIVE on League Pass: https://t.co/7kdyNBOB84 https://t.co/ajcAloq4LM",
    "23": "@nyknicks Please don’t blow a 25 point lead again to a g league team plz and thank you",
    "24": "@PlayoffBoundNYK @Kennyduhballern @KnicksMemes @nyknicks Not when the reason you losing both scenarios is because of IQ 😭😂",
    "25": "@livelikelefty @nyknicks I rep New York in everything I do.",
    "26": "@Jake4nier97 @nyknicks I’d rather have Reddish start at the 3🤷🏻‍♂️",
    "27": "New York Knicks Starting Lineup 2/14\n PG: Kemba Walker\n SG: Quentin Grimes\n SF: Evan Fournier\n PF: Julius Randle\n C: Mitchell Robinson\nhttps://t.co/o75oZ8vnE8",
    "28": "@nyknicks Oh great, I was so scared we were going to change the line-up that doesn’t work. It’s gonna be great when Burks comes in for Kemba and runs the point! So exciting!",
    "29": "@rmw024 @nyknicks Grimes is definitely undersized at the 3 at 6'5 but his defense is good enough to guard most 3s. Hes replacing Rj so its only temporary",
    "30": "@nyknicks @Maraena4 we in there. Let's go Knicks!",
    "31": "@nyknicks I miss you Rj",
    "32": "@Kennyduhballern @KnicksMemes @nyknicks Losing with IQ starting&gt;Losing with Kemba starting",
    "33": "@livelikelefty @nyknicks That run  during the 98-99 season I believe. 8th seed and made it to finals just to lose to the spurs in 5. Sigh….miss better days. Now I’m a die hard and hope to see a chip before I die.",
    "34": "@nyknicks He’s really not going to start Cam, a real SF?",
    "35": "Let’s work fellas! @nyknicks @KnicksTape #knicksnation",
    "36": "@nyknicks @IQ_GodSon No way he made that shot",
    "37": "@rmw024 @nyknicks Maybe when he's no longer employed at Penn Plaza",
    "38": "@nyknicks I swear u better win tonight",
    "39": "@nyknicks @alanhahn @McNuttMonica complimenting, coordinating pink.",
    "40": "@nyknicks Ratio",
    "41": "@nyknicks my ratio",
    "42": "New York Knicks Starters:\n\nKemba Walker\nQuentin Grimes\nEvan Fournier\nJulius Randle\nMitchell Robinson\n\nPlayers out:\nRJ Barrett\nNerlens Noel\nDerrick Rose\n#NewYorkForever #NBA #NBATwitter #NBA75",
    "43": "@nyknicks “Thibs we need to have some production at the 1 spot why do you keep starting Kemba?”\n\nThibs: https://t.co/Fv2Htl788m",
    "44": "@livelikelefty @nyknicks The 69 Knicks.. specifically Clyde and DeBusschere",
    "45": "@nyknicks Y’all announcing the relocation to Shanghai?",
    "46": "Just under a half hour till a Valentine’s Day tip-off here at the Mecca! Tonight the hometown New York Knicks (25-32) will battle it out with the Oklahoma CityThunder  (17-39). I’ll have updates all night long! for @wfuvsports  \n\n#Thunderup #NewYorkForever https://t.co/KuTulZjmuu",
    "47": "@nyknicks No Drose No party",
    "48": "D-Rose 🌹\n\n#NewYorkForever | @nyknicks \n\nOKC/NYK | 01H30 sur beIN SPORTS https://t.co/Lab7QU8Q6r",
    "49": "@avlev124 @nyknicks Sure",
    "50": "@KnicksMemes @nyknicks Definitely not iq",
    "51": "@nyknicks Wonder when Thibs will understand Grimes isn’t a 3 and Kemba is washed.",
    "52": "Tonight's starting lineup for the New York Knicks: Walker, Grimes, Fournier, Randle, Robinson https://t.co/bVWH4AMCA2",
    "53": "@qdotgrimes is STARTING TONIGHT PEOPLE!!!!!!!!!!!!! Love this fucking kid @nyknicks #BabyStarks",
    "54": "@nyknicks Just win. Pls win https://t.co/x2Ps8dxxiS",
    "55": "@nyknicks Make take Kemba out this line up! My god",
    "56": "@nyknicks might just walk into oncoming traffic.",
    "57": "@nyknicks Shocker",
    "58": "Our five. https://t.co/MzpDELOVkZ",
    "59": "@Wopkonjorge @nyknicks @SimuLiu Problem was he wasn’t eligible for full Bird Rights, and the offer Houston made was designed to have a poison pill, that $15M salary in 3rd year. If Rockets had kept his salary at just $5M, Knicks could’ve matched.",
    "60": "#Knicks #Thunder Let's go @nyknicks",
    "61": "Let’s go #Knicks. Have a great game @nyknicks &amp; @KnicksMSGN.",
    "62": "New York Knicks Lunar New Year Auction | Shop Madison Square Garden.  #NBA.  #NYK.  #Knicks.  https://t.co/Q9KPPRkwET",
    "63": "@livelikelefty @nyknicks Patrick Ewing",
    "64": "@nyknicks @TheGarden Traditional Chinese is 10 times better and more beautiful than Crippled Chinese smh... But I guess those Chinese donor money is more beautiful and delicious. L NYK : (",
    "65": "Tonight’s gonna be a rollercoaster @nyknicks",
    "66": "New York Knicks NBA Mitchell &amp; Ness SnapBack #Newyork #knicks #NBA #MitchellandNess #myhatstop⁠ https://t.co/hJ8nwRlwJ7",
    "67": "Consensus Line Move:\n2022-02-14 Oklahoma City Thunder at New York Knicks from 208.00 to 206.50\nUnder with respect\n#NBA #bettingpicks #pythonprogramming #money",
    "68": "@Knicks_Chatter @nyknicks @TermineRadio @Jumpshot8 @SiriusXMNBA @CPTheFanchise Right?? Smh",
    "69": "@nyknicks Yes indeed❤️❤️❤️❤️❤️❤️💪🏾💪🏾💪🏾💪🏾💪🏾",
    "70": "@FuckRandle @nyknicks They’ll still have fewer losses in a row than the Nets, and they’ll still be out of the playoffs seeding.😔😔",
    "71": "@nyknicks @TheGarden Sign Jeremy Lin",
    "72": "@NBAHistory @nyknicks This dude had an out of body experience as an elite NBA player for a random stretch.",
    "73": "At my 2nd home. @nyknicks https://t.co/njrCsVAHeD",
    "74": "@nyknicks @SimuLiu I would take Jeremy Lin back anytime.  He is the man in my eyes.  One of my favorite Knicks and I’m a 35 year fan of this awful organization but players like Lin are priceless",
    "75": "@bermin_reyes @KingsmanJay312 @nyknicks He is in the g league",
    "76": "@nyknicks @IQ_GodSon IQ cant shoot stop! https://t.co/w8N40okIN8",
    "77": "I have a date with my chipotle bowl &amp; the new york knicks on my television tonight. living the mf life",
    "78": "@livelikelefty @nyknicks Brooklyn born and raised a NYKnicks fan!! Going to the garden with my pops in the 80s started my lifelong love affair with this team....till death do us part ❤",
    "79": "@livelikelefty @nyknicks 90’s Defence",
    "80": "@NYKnicksReddit @nyknicks @IQ_GodSon No need for that",
    "81": "@nyknicks *COUGH COUGH* https://t.co/ZLcg3btlWd",
    "82": "@nyknicks @IQ_GodSon Why does everybody like this kid?  He isn’t good at all and I don’t think he will have a bright future especially playing for this bum organization",
    "83": "@nyknicks @IQ_GodSon Hasn't been a whole lot of that this year for him....",
    "84": "@nyknicks @TheGarden Better play griddy gang tonight https://t.co/69ugPWKag6",
    "85": "@livelikelefty @nyknicks 73 earl the pearl and Frazier win the chip",
    "86": "@nyknicks @IQ_GodSon Quickley is a dumpster fire",
    "87": "@nyknicks ok fan let’s get ready for another awful loss. I already bet 100 against them giving 10 points to the Thunder.  Chances of them winning any game by ten is a long shot. Unless the other team has a squad of midgets then the Knicks have a chance",
    "88": "@nyknicks @TheGarden WE RUN NY 🗣",
    "89": "@livelikelefty @nyknicks Born and raised in New York City. I was born into it",
    "90": "Lunar New Year @TheGarden vibes. https://t.co/SbOfnIsqpr",
    "91": "@nyknicks who ever pays to watch the Knicks play live has to be either bored, super rich or just have no life.  My eyes burn when I watch a Knicks game. My chest tightens and I usually have to use the bathroom because I get sick to the stomach. People pay big money for this crap",
    "92": "New York Knicks: 2021-22 Game Thread: Knicks vs. Thunder, AKA “Soon to be Six Under. Don’t Call It a Comeback!” https://t.co/RiLFVfDzQ5",
    "93": "@Knicks4lyfe1 @livelikelefty @nyknicks I was 15 at the time and that team just had so much energy, I loved watching them every night",
    "94": "@nyknicks @IQ_GodSon Please win",
    "95": "@ZackaveIi_ @livelikelefty @nyknicks Same",
    "96": "@nyknicks @IQ_GodSon swish I wish!!",
    "97": "@livelikelefty @nyknicks The 2012 Knicks. I was interested in basketball before that but watching that team was amazing. Loved them ever since",
    "98": "@livelikelefty @nyknicks (Tho I enjoyed 92-93 Knicks too until Charles Smith's misadventure at the rim broke my 13-year-old heart)",
    "99": "@jack58402979 @nyknicks Just like DRose said: I Q is 🤣🤣😂 Whose the daddy of the little cutie 😇👶, don't tell me it's Deuce's. That should be the focus of the knickerbockers organization, the development and future of it's young core. That is the only way you're gonna build a champnshp caliber team🤔",
    "100": "@bobzeenyo @nyknicks @IQ_GodSon then i better see thibs gone in the morning",
    "101": "@nyknicks @IQ_GodSon He probably doesnt even pass to cam in shootaround LOL",
    "102": "@nyknicks @IQ_GodSon Not really",
    "103": "@nyknicks @IQ_GodSon I swear if OKC wins...",
    "104": "@Sitefs333 @nyknicks @IQ_GodSon Too real😭",
    "105": "@nyknicks @IQ_GodSon b r i c k*",
    "106": "@cameron_mclay @TheGarden @nyknicks @okcthunder Awesome- the Worlds most famous arena !!! say hello to Ben Stiller, Chris Rock and any other celeb",
    "107": "@livelikelefty @nyknicks John Starks and the 1993-1994 Knicks.",
    "108": "@nyknicks @IQ_GodSon Tell him Tik Tok on the bench",
    "109": "@nyknicks @IQ_GodSon yall better win today",
    "110": "@livelikelefty @nyknicks Patrick the first time and Melo the second.",
    "111": "@nyknicks @IQ_GodSon Crazy how they run NY 🗣",
    "112": "@nyknicks Source?",
    "113": "@nyknicks @IQ_GodSon That must be an archive clip",
    "114": "s w i s h https://t.co/nNneujnF3w",
    "115": "@livelikelefty @nyknicks I can't imagine any other answer besides Extreme Massochism",
    "116": "@nyknicks It was really amazing how accommodating and accepting and supporting Melo was of Linsanity.... Not",
    "117": "🏀 The Thunder travel to New York for the only time this season to take on the Knicks who are 2-8 in their last ten. Oklahoma City hasn't been much better losing five straight. Something has to give here as @SteveMerril gives his betting insights!\n\n➡️ https://t.co/OyKI2B0Dlv https://t.co/DyQtbvxNdx",
    "118": "@livelikelefty @nyknicks The 2012 season when we were the second seed in the East. I watched every game",
    "119": "@MrChuckD @nyknicks @TermineRadio @Jumpshot8 @SiriusXMNBA @CPTheFanchise TBH he wanted to play with luca maybe after getting no interest for a first. The raps just send him to team knowing he would be bought out. That way they get under the tax and get a  good player in Young.",
    "120": "The New York Knicks!!! -10\n\n10 unit play!!! \n\nFade? Ride? Let’s see how we do day 1 back !\n\n#GamblingTwitter #bioya #lockitin #knicks #SportsPicks #fade #ride #FDT",
    "121": "New York Nico Teams Up With Knicks and 1800 Tequila for Exclusive Varsity Jacket https://t.co/8San0sFiaX",
    "122": "@livelikelefty @nyknicks The 99 playoff run is when I officially became an all out Knicks fan. Before that I was actually a bulls fan lol. In my defense though I was like 10 at the time so I didn’t know any better",
    "123": "Hoping some @NYRangers will be at tonight’s @nyknicks game 😅",
    "124": "@nyknicks whoever Thinks the Knicks are favorite by ten like gambling apps do they are wrong. We all know the Knicks can’t beat anybody by 10 or even win games so I’m betting 200 dollars on the Thunder. Get me some funds out of the bum Knicks",
    "125": "@livelikelefty @nyknicks The blue and pink seats they used to have",
    "126": "The New York Knicks are a marquee NBA franchise. Still, they missed out on a few \"What Could Have Been\" opportunities. @RomulusDarrion breaks them all down here #NewYorkForever \n\nhttps://t.co/PhtkRs3mok https://t.co/YnWC0a3LkC",
    "127": "@livelikelefty @nyknicks My first memory was 1970, I was 9 years old, and they won the championship. But the 1973 team I really was all in and never missed a game.",
    "128": "@nyknicks let’s take a vote! Who wins tonight? Knicks? Thunder? I think thunder for sure",
    "129": "@livelikelefty @nyknicks 92-93 season , my uncle Andre would pick me up to watch me but would just take me to the bar under the train station of the old yankee stadium, I would sit and watch the games while he bet , got drunk and sniffed coke… good times",
    "130": "@nyknicks I am am certain the Knicks will lose tonight.  If u want to make money bet the house on the Thunder.  They have players who can ball but they are young.  They will run the bum Knicks out of the gym.  We need the Knicks to lose all the rest to get rid of France and Thibs",
    "131": "@livelikelefty @nyknicks Watching the MSG playoff games last year . Im from Nebraska .",
    "132": "@livelikelefty @nyknicks I was born into a family of Knick fans. Orange and Blue is in my marrow.",
    "133": "February 14, 1968: The renovated Madison Square Garden that fans are familiar with today hosted its very 1st NBA game as the New York #Knicks defeated the San Diego Rockets https://t.co/0Ove9z5uxk",
    "134": "@nyknicks @MichelobULTRA @KembaWalker @qdotgrimes Kemba look better than he play, that’s still my guy tho",
    "135": "@livelikelefty @nyknicks I became a Knicks fan as a teen in the 90s, when the team was tough, gritty, resilient, and didn’t take shit from anybody.",
    "136": "@Biggestnyfan @livelikelefty @nyknicks That shot specifically",
    "137": "@livelikelefty @nyknicks I was a fan because they are the NY team, my Pops was a fan, and Ray Williams was from the hometown.  I loved them because of Bernard.  PE sealed the deal for me. Too bad those 2 never got to play together",
    "138": "@nyknicks Knicks about to lose another one tonight. Same starting five. It’s a nightmare. Fournier still wearing a NBA jersey as bad as he is.  I got banned from Twitter and lost all my followers and those who I followed",
    "139": "@nyknicks if y'all lose tonight...",
    "140": "@nyknicks @MichelobULTRA @KembaWalker @qdotgrimes Where are the wins??",
    "141": "@livelikelefty @nyknicks Step 1: born in NYC in 1994\nStep 2: fell in love with basketball\n\nthe rest, as the say, is history (albeit a mostly sad one 😂)",
    "142": "@nyknicks @MichelobULTRA @KembaWalker @qdotgrimes Don’t even think about losing today",
    "143": "…What are the New York Knicks doing?\n\n@Traticaster101 &amp; @Jmeleka REACT!\n-NYK meltdown to the Portland Trailblazers\n-Upcoming OKC + Nets 🏀\n-&amp; WOULD YOU RATHER: Play-in game or draft lottery?!\n#NewYorkForever\n@RealDealRaisi_K🎶\n🍎https://t.co/pAQIMCP7xh\n✳️https://t.co/v0UzZ4RyvG",
    "144": "@livelikelefty @nyknicks Games at the Garden",
    "145": "Back home!\n\n#UltraDrip | #NewYorkForever https://t.co/W6jOSxA05Z",
    "146": "@SBondyNYDN @Knicks_Chatter He can definitely  omega try to recover his career with @nyknicks",
    "147": "@livelikelefty @nyknicks A quality PG!",
    "148": "@FredKatz Noel is a backup and has missed 35 games this year. How does Mr. Earn Your Minutes Thibs\" allow Noel to stay in the rotation everytime he comes back? Thibs is a lying fraud! @nyknicks",
    "149": "@wojespn Ayeeeee @nyknicks cmon now go get my boy!! We need a good guard with some handles and rim pressure agility @TyrekeEvans @CPTheFanchise @JDSportsTalkNY @IamJulito @Traticaster101",
    "150": "@nyknicks can we do this to the whole Knick roster as well? https://t.co/mrdEjFp5F2",
    "151": "@livelikelefty @nyknicks Knick fan before birth. I was born into it.",
    "152": "@livelikelefty @nyknicks Since I moved up here in New York I became a fan of the Knicks gotta show love to my home team!",
    "153": "@livelikelefty @nyknicks Patrick Ewing #33",
    "154": "I drove for a reason….@nyknicks @KnicksMSGN @MSGNetworks https://t.co/v7fLrvhJYl",
    "155": "@sellthedolan @NBA_NewYork 🤣🤣🤣🤣🤣  Am I allowed to be a Knicks fan because I voted for trump ?",
    "156": "@livelikelefty @nyknicks Ewing, Starks, Oakley, Mason.",
    "157": "@livelikelefty @nyknicks Playing pick up and organized hoops learning the game as a young kid during the 90s and 00s. Plus Sprewell was my guy. https://t.co/qS3OLeAY8N",
    "158": "@livelikelefty @nyknicks I’m addicted to toxicity",
    "159": "THE#VALENTINES#DAY#MASSACRE#NEW#YORK#KNICKS#VS#OKLAMOMA#CITY#THUNDER https://t.co/jkxn6snxJO",
    "160": "@livelikelefty @nyknicks 89 90 season was my start patrick mark jackson and then when starla came along that's when i was really engaged and in love with the team",
    "161": "@livelikelefty @nyknicks I'm from NYC.. word...das it..",
    "162": "Hoy a la 01:30 h. New York Knicks vs Oklahoma City Thunder.",
    "163": "@livelikelefty @nyknicks John Starks headbutt",
    "164": "@livelikelefty @nyknicks My uncle played the 93 bulls championship video and they made the Knicks sound totally badass in it.  They Epitomized toughness back then",
    "165": "@MrChuckD @nyknicks @TermineRadio @Jumpshot8 @SiriusXMNBA @CPTheFanchise is like when those suc**ng 76ers were trading away his best players for no reason",
    "166": "#DailyPick \nThunder +10 @ Knicks \nShould the @nyknicks be 10 point favorites over anyone??\n\n@eatFFUPs #EatFFUPs #NBA \nOverall: 205-167-5",
    "167": "@livelikelefty @nyknicks When Amare Stoudemire Joined the NY Knicks I was getting into basketball revived the season",
    "168": "@MrChuckD @nyknicks @TermineRadio @Jumpshot8 @SiriusXMNBA @CPTheFanchise We're just lost right now. Gotta get solid direction of what we really want to do.",
    "169": "@livelikelefty @nyknicks Already a fan but true love… https://t.co/p7SvP6Yiyd",
    "170": "@JeffMcGrath2 @nyknicks @TermineRadio @Jumpshot8 @SiriusXMNBA @CPTheFanchise I’m even More confused how this young man couldn’t be inserted. And @wcknicks keep showing his stats and highlights from G League… thats like a baseball team with no pitching showing no hitter clips from their best young arm. I don’t understand at all",
    "171": "@livelikelefty @nyknicks Anthony Mason, Kenny \"Sky\" Walker, Mark Jackson, Rod Strickland &amp; the hard hat mentality that they played with in the 80's &amp; 90's.",
    "172": "hey @nyknicks get this tweet to Thibs https://t.co/b69VRLbOoA",
    "173": "@livelikelefty @nyknicks Ewing",
    "174": "@livelikelefty @nyknicks It was always on in my house and then the Amare stretch happend and I went to my first game at MSG and I was hooked..",
    "175": "@rads619 @nyknicks pass on the damn message!!!!",
    "176": "@livelikelefty @nyknicks their toughness/defense in the 90s/2000",
    "177": "@MrChuckD @nyknicks @TermineRadio @Jumpshot8 @SiriusXMNBA @CPTheFanchise Chuck, what about Deuce McBride? Thibs got to pay him.",
    "178": "@livelikelefty @nyknicks I’m a masochist",
    "179": "Damn how can a @nyknicks team with no PG who needed somebody lol in 11 pr 4th Portland Quarter NOT be in the Dragic running? I’m perplexed totally.. @TermineRadio @Jumpshot8 @SiriusXMNBA @CPTheFanchise",
    "180": "@livelikelefty @nyknicks Never forget turning the free tv channels and finding the New York Knicks on channel 9 WOR with the small guy from Queens moving that rock and a tall kid from Jamaica destroying the rim.  Was hooked immediately.",
    "181": "@nyknicks TRASH!!!!",
    "182": "thibs take notes @nyknicks https://t.co/xY5nrcAxPj",
    "183": "@livelikelefty @nyknicks My oldest memory is being like 6, watching with my dad… and i saw how much he loved them and thought it was law",
    "184": "@UDers_1 @nyknicks Yoooo did you make that up just now? You a real soulful dude ders",
    "185": "@livelikelefty @nyknicks Clyde and Earl the Pearl the championship years 🏆🏆✊🏾",
    "186": "NBA 2k21; #ValentineDay episode; New York Knicks vs Houston Rockets | #N... https://t.co/v60yxopohh via @YouTube https://t.co/0MuhZcCW5t",
    "187": "@SportsHeartland has made a pick for @nyknicks vs. @okcthunder\n\nPerformance:\nOKC Games: 89-58-3 (61%) \nOverall: 130-83-3 (61%) \n\n#NewYorkKnicks | #OklahomaCityThunder\n    \nhttps://t.co/5C1Jwo6OJr",
    "188": "@nyknicks im just saying 🤷‍♂️ https://t.co/CwGsNMsMMI",
    "189": "@nyknicks we need a point guard 🤷🏾‍♂️ https://t.co/M8DoF9q5J7",
    "190": "had to get the classic @RjBarrett6 knicks jersey 😍 @nyknicks #Knicks #NBA75 #NewYorkForever #Nike https://t.co/gW2aHQDScX",
    "191": "Hey @nyknicks go see if Tyreke Evans still got it",
    "192": "@nyknicks what’s the lineups tonight",
    "193": "@nyknicks go get that! https://t.co/F6pX0duPAO",
    "194": "Day 3 of 7. \nBest of Luck to everyone 🤝\nStarting Bankroll $1,000\nCurrent Bankroll $1,200\n⬇️⬇️ Daily Free Pick ⬇️⬇️\nMoneyline 🅿️arlay \nToronto MapleLeafs ML🏀\n&amp;\nNew York Knicks ML🏀\nBet $143 to win $100 (1 unit) \n#GamblingTwitter\n#RT #like #Bankroll https://t.co/TP6YDHfFOb",
    "195": "@umoktamir @wojespn @nyknicks For thibs to not play him lol?",
    "196": "@SmSmith94 @NBAHistory @nyknicks LMFAO omg I still remember where we were when this happened -__-",
    "197": "2/14/03 – Stephon Marbury tied his season-high in scoring (43p/9a/4s), but missed a running floated at the buzzer as the Phoenix #Suns lost to the New York Knicks 116-115, their 2nd-consecutive 1pt loss. Marion: 26p/3r. Stoudemire: 25p/14r. Allan Houston: 26p/6a. #ValleyProud https://t.co/VumbSbtD7s",
    "198": "Thibs should be doing this @nyknicks https://t.co/Q2NbyNHGeQ",
    "199": "@christyna_brads @moyi685 @livelikelefty @nyknicks Ok this is weird. You have suns tickets AND Knicks tickets? This is definitely suspicious",
    "200": "@christyna_brads @samaguilar08 @RangersYankees3 @nyknicks Scammer",
    "201": "@moyi685 @christyna_brads @livelikelefty @nyknicks Good call. It’s a scammer",
    "202": "@christyna_brads @moyi685 @livelikelefty @nyknicks Ur a scammer",
    "203": "New York Knicks: OKC Thunder down multiple starters vs New York Knicks:  on Valentine’s Day https://t.co/bBhgvFNdgl",
    "204": "@nyknicks Griddy gang 😈😈😈 https://t.co/QWLQcsnU0n",
    "205": "@TheStrickland @qdotgrimes @deucemcb11 @camreddish @nyknicks “I’ll never leave you for a younger one”\nthibs.jpeg",
    "206": "New York Knicks vs Oklahoma City Thunder Live Stream&gt;&gt;&gt;&gt;https://t.co/BgJBww7fns",
    "207": "@nyknicks Yet you play grandpa ass Gibson over him",
    "208": "Do this too @nyknicks https://t.co/nLSe8NQKpy",
    "209": "Let’s ride @nuggets @spurs @DetroitPistons @nyknicks @utahjazz @warriors @Raptors @SacramentoKings https://t.co/qrMp3vp849",
    "210": "@KendraRandle_ @J30_RANDLE one of the best couples in New York city I love you guys always let's go Knicks we here 💙 💙 https://t.co/jr3bHudGIZ",
    "211": "@nyknicks Fire Thibs!!!",
    "212": "@nyknicks Win some games",
    "213": "@nyknicks Maybe try playing Sims. We’re in 12th place and running out a 36 year old Taj every night. What’s the point?",
    "214": "@nyknicks Finally a Jericho post, y’all show him no love",
    "215": "@livelikelefty @nyknicks Bernard King.",
    "216": "@nyknicks Joke btw",
    "217": "@nyknicks New York Knicks starting lineup ‼️‼️\n- Julius “overpaid” Randle🤓🤓\n- RJ “star” Barrett🙏🏽🙏🏽\n-Kemba “washed” walker 🤡\n- Evan “only shoots 3’s” Fournier😤😤\n- Mitchell “52% FT shooter” Robinson🥵🥵\nSCARY HOURS😈😈",
    "218": "@nyknicks please do everyone a favor and play the young guys with julius",
    "219": "@craighofeld has made a pick for @nyknicks vs. @okcthunder\n\n#NewYorkKnicks | #OklahomaCityThunder\n    \nhttps://t.co/JMfAQYi73X",
    "220": "@ZacharyLowNBA has made a pick for @nyknicks vs. @okcthunder\n\nPerformance:\nOKC Games: 85-66-2 (56%) \nOverall: 137-115-3 (54%) \n\n#NewYorkKnicks | #OklahomaCityThunder\n    \nhttps://t.co/oWnfLumsTN",
    "221": "Stay solid. https://t.co/CsJO9K3NxJ",
    "222": "@TylerIAm New York about to hose a parade for the 2011 Giants, 86 Mets and 73 Knicks I guess",
    "223": "@TheNBACentral @nyknicks bring him back",
    "224": "NBA:\nNEW YORK KNICKS - 9\nBROOKLYN + 3\nPORTLAND + 12 1/2\nPORTLAND/MILWAUKEE UNDER 226\nTORONTO/NEW ORLEANS UNDER 222 1/2\nSAN ANTONIO + 4\nUTAH - 14 1/2\nUTAH/HOUSTON OVER 231\nGOLDEN STATE/LA CLIPPERS UNDER 219 1/2\n\nNHL:\nDETROIT/MINNESOTA OVER 6 GOALS\nEDMONTON/SAN JOSE OVER 6 GOALS",
    "225": "@NBAHistory @nyknicks Love Jose, but he was bad defender.  I remember watching this live and was shit get Jose off Linsanity",
    "226": "@nyknicks I Was ACTUALLY At This Game",
    "227": "@peterkohan @livelikelefty @nyknicks Same bro.",
    "228": "@nyknicks There were times when I thought that he was the greatest PG to ever put on a Knicks jersey",
    "229": "@livelikelefty @nyknicks My dad lived in Nassau County and was a Knick fan &amp; my mom took me from NYC back to her hometown when I was young so I learned everything about the Knicks so when he would call me we could talk about sports. I also became a Giants and Yankee fan too but he was a Jet and Mets fan",
    "230": "@livelikelefty @nyknicks Knicks fans were the first to chant ‘Dee-fense’ because they loved all parts of the game.",
    "231": "@livelikelefty @nyknicks My dad told me stories about Frazier, Willis, Bradley. How they really shared the ball, how they were smart and great and represented New York because they were classy but down to earth like New Yorkers. He said New York fans are the best bc they know the fine points. He said…",
    "232": "@fortworthchris The New York Knicks",
    "233": "The Mets, Knicks, and Giants should do a parade for New York where they're like \"we kind of suck and make you miserable but come on, are you seriously going to walk away?\" https://t.co/ufJ7o5MRsC",
    "234": "At 7:30 Eastern time I will be going live for the Thunder vs Knicks lets go knicks\nNBA Live Stream: Oklahoma City Thunder vs New York Knicks https://t.co/RJOwzZHb96 via @YouTube",
    "235": "@LindorHOF @BleacherReport @JHarden13 @JoelEmbiid @sixers New York Knicks starting lineup ‼️‼️\n- Julius “overpaid” Randle🤓🤓\n- RJ “boosted by Zion” Barrett🙏🏽🙏🏽\n-Alec “nobody” Burks🤡🤡\n- Evan “only shoots 3’s” Fournier😤😤\n- Mitchell “52% FT shooter” Robinson🥵🥵\nSCARY HOURS😈😈",
    "236": "@iiiitsandrea @ErewhonMarket @nyknicks Love this branding!",
    "237": "@christyna_brads @RangersYankees3 @nyknicks how much",
    "238": "@nyknicks 2 players injured cause of Thibs and one who doesn’t play cause of Thibs nice promotion guys",
    "239": "New Episode OUT NOW!!! We talk about the deadline, what we think the Knicks should do next, and Julius Randle's hot February!!! TAP IN!!\nhttps://t.co/OJoGL6evbl\n#NewYorkForever \n#NewYork \n#Knicks",
    "240": "@christyna_brads @livelikelefty @nyknicks I don’t trust twitter for android users. Sorry",
    "241": "February 14, 2012: “Linsanity” reached its peak when New York #Knicks PG Jeremy Lin drained a game-winning 3 over the Toronto Raptors https://t.co/xzE4dHhYkn",
    "242": "Two things can happen tonight for the @nyknicks …\n\n1. Team is extremely disappointed from Saturday the worst loss of the season &amp; they decide to let their anger out on OKC at home. They come together as a team &amp; put the loss behind them getting a nice win. Need to focus! \n\nOr…",
    "243": "@nyknicks The chills lol, imagine being at another arena cheering you on as if it was a home game, this is WILD!!",
    "244": "Oklahoma City Thunder visits New York Knicks Predictions and Preview for 2/14/2022 today.  Who are we taking in this game?  Find out now. #SportsBetting #GamblingTwitter https://t.co/E5m14PU8AA",
    "245": "@livelikelefty @nyknicks Houston ducks underrr......GOT IT!!! with eigth tenths left. \n\nIykyk",
    "246": "@dubs4win @NBAHistory @nyknicks From the Nets game up until this game winner, Lin was 4-18 from the three pt line. Nobody's guarding against the three when he was rolling to the hoop most of the time.",
    "247": "@nyknicks Seriously the deal with Reddish I'm up junior college basketball coach I See a player deserves to be playing bust his ass on defense plays hard can score all different ways. I just don't f****** get it. There has to be something that we don't know about nothing else makes sense?",
    "248": "@nyknicks @SimuLiu Seriously the deal with Reddish I'm up junior college basketball coach I See a player deserves to be playing bust his ass on defense plays hard can score all different ways. I just don't f****** get it. There has to be something that we don't know about nothing else makes sense?",
    "249": "Selling 5 NBA New York Knicks vs Brooklyn Nets tickets for Wednesday 16th February in Madison Square Gardens. Please get in touch if you’re interested! Tickets for sale #newyorkknicks #brooklynnets #newyork #NBA",
    "250": "@livelikelefty @nyknicks I was bamboozled. My Dad used to go watch the classic Red Holtzmann Knicks. He was at the Willis Reed game (I was born a week before that game). I used to hear about Frazier and DeBusschere and Cazzie Russell. I got sold a bill of goods! 😄",
    "251": "@iiiitsandrea @narendra @ErewhonMarket @nyknicks Yay! Love that more cool people are finding out about the epicness of @drink_barcode 💦🍉\n\nBacked by more than just Erewhon amirite @narendra 😉",
    "252": "❄️ &amp; 🍕 on Super Bowl Sunday in NYC…followed by Thunder at Knicks on Valentines Day ❤️🏀\n#basketballneverstops \n#thunderup @ Hudson Yards New York https://t.co/wJ2qJphN9H",
    "253": "@PreZnyc621 @NY_KnicksPR @nyknicks Thibs is 64yrs old. He’s not thinking about young players. It’s time to move on from him.  Can’t watch Burks dribbling and not passing.",
    "254": "@livelikelefty @nyknicks I dad had a 78 of Marv Albert intro when Willis came hobbled onto the court vs Lakers, described it as if you were watching it…play by play of him leaving locker room to the shoot around…Willis from 12 YES and it counts",
    "255": "@Mitros0126 @NY_KnicksPR @nyknicks actually imagine Thibs coaching them…not allowed to bench them for one mistake.",
    "256": "@PreZnyc621 @NY_KnicksPR @nyknicks Only if Thibs is gone.",
    "257": "@nyknicks @SimuLiu Believe me, he set my heart on fire too❤️",
    "258": "@livelikelefty @nyknicks 93-94 season. Jordan gone. I’m 8 going on 9 and now I’m really watching basketball. I’m like fuck it I’ll cheer for the Knicks for real since I’m in BK dorchester and 21st. Ever since that season it’s been a love affair. And I ain’t going nowhere b",
    "259": "@livelikelefty @nyknicks Born a Knicks Fan!  My Dad took me to 1 of the Finals games as a kid When NY beat LA Fell in Love with the Knicks in the 80s Fighting White Boy Celtics fans in the Garden Then when my Boy Patrick came to NY Even though I got family/friends on other teams! Cha/GS/Bk/Pho!!!!",
    "260": "Enter to win 2 FREE New York Knicks vs Sacramento Kings, NBA Tickets. Lower level seats for MON. MAR. 7 at 7:30PM in Golden 1 Center, Sacramento. No purchase necessary. Winner selected at random. Giveaway ends SAT. MAR 5 at noon.\nEnter:  👉  https://t.co/6DAZFtKNRW https://t.co/NMEO0Cb9in",
    "261": "Re: functional unwinding 👁\nBarcode raises $2M ($3M total) \nto expand adaptogenic sports drink\n\nBacked by @ErewhonMarket \nFounded by Mubarak Malik (former head of performance for @nyknicks) https://t.co/zlo0wfK9Sb",
    "262": "Consensus Line Move:\n2022-02-14 Oklahoma City Thunder at New York Knicks from 207.00 to 208.00\nOver pouring in\n#NBA #bettingpicks #dataanalysis #investors",
    "263": "📅GAME DAY📅\n\n🏀 @LongIslandNets at 7pm\n🏀 @BrooklynNets at 7:30pm\n🏀 @nyknicks at 7:30pm\n\n#CatchUsFromTheJump #NetsWorld #NewYorkForever https://t.co/fb8TBimMKf",
    "264": "@nyknicks I've been sending these every hour and suffice to say......she was so confused 😂. Loving these though",
    "265": "@__kristinf34 @Prodigalshun @PlayoffBoundNYK @nyknicks This you? https://t.co/Q7pOFnF0nA",
    "266": "@nyknicks @SimuLiu The fact that my team needs a couple of good weeks some time ago an ongoing historic highlight says everything. \nIt aint easy to support the Knicks",
    "267": "@__kristinf34 @nyknicks Serious question, why are you constantly in the Knicks related posts?",
    "268": "New York Knicks: Game Preview: Knicks vs. Thunder- 02/14/22 https://t.co/Kb484NELn1",
    "269": "@NBAHistory @nyknicks @yotonyshu still not over this smh 🤦🏾‍♂️",
    "270": "@nyknicks Happy Valentines Day New York Knicks! \n💙🧡",
    "271": "@nyknicks Y’all bet not break my ❤️ today!!! \n\nLove y’all 🌹 #HappyValentinesDay",
    "272": "@livelikelefty @nyknicks Oakley, Mason, Starks, Spree, LJ, Coach Riley, Coach Van Gundy, the rivalries with the Bulls, Indiana &amp; Miami!!",
    "273": ".@nyknicks need a point guard @TheFrankIsola @SBondyNYDN @stephenasmith https://t.co/C4MHq098Yr",
    "274": "@islandbreaks1 @nyknicks @IQ_GodSon Glad they arrived! Not a bad way to start adding up some Knicks 🙌🏻",
    "275": "@livelikelefty @nyknicks Im from ny. They’re nycs team",
    "276": "@Shainevercaps @Bucks Knicks RUN New York",
    "277": "Fun fact for tonight: The Thunder has a seven-game winning streak in the state of New York (Knicks and Nets)",
    "278": "Rose, RJ, Cam, Randle, Mitch. McBride, Grimes and Obi off bench. Please give me this @NY_KnicksPR @nyknicks",
    "279": "I dug up this jersey from the bottom of my dresser for the occasion thank you @JLin7 for everything you’ve done for the city of New York you will never be forgotten as a Knicks legend along with the memories you created",
    "280": "@nyknicks @SimuLiu Jeremy Lin should of never left the Knicks unless D'Antoni left than leave to follow him.",
    "281": "Beware @TheGarden is incompetent the website that still exists and is still live https://t.co/AGInK5xlMk is NOT accurate children under 16 must SUBMIT as well, do not he deceived by the mistake @NYRangers @nyknicks #msg",
    "282": "@nyknicks @SimuLiu I remember that game I was home from a school night and I just standing up hoping he hit that shot and BAM I woke up the whole house",
    "283": "@livelikelefty @nyknicks my pops",
    "284": "@livelikelefty @nyknicks Just had to be. I love basketball and that’s my home team.",
    "285": "Mailday from @ASOpullers \nBuilding my @nyknicks collection up https://t.co/dCnj7BofiT",
    "286": "@nyknicks @SimuLiu @SimuLiu - Im telling you dog, we should be homies",
    "287": "@nyknicks @SimuLiu Would y’all be posting this repetitive nonsense had there been any competence too to bottom????",
    "288": "@nyknicks @SimuLiu better, simpler times",
    "289": "The New York Knickerbockers have a record of 25 - 32 #Knicks https://t.co/qBDhzjJnO0",
    "290": "Looking back at the magic of Linsanity, it hits different for @SimuLiu ❤️ https://t.co/P3KXRNMtjg",
    "291": "@livelikelefty @nyknicks Rod Strickland turned me on to the Knicks once he left my beloved DePaul Blue Demons. Every Knicks game was must see tv for me and when they trade him it wasn’t until DRose was trade to the Knicks that I even gave them an ounce of my time. Same goes for when they traded him.",
    "292": "@livelikelefty @nyknicks Mark Jackson. Then of course they broke my heart by trading him. But I was already hooked by then.",
    "293": "@livelikelefty @nyknicks All those prospects who didn’t quite pan out",
    "294": "Time to reset, with remaining games left, to reach above 500., by basically competing in basketball basics..., tip-off, then run. Tonight's matchup going to be the beginning of what was seen in the last ten games of the @nyknicks. Shoot, run, defend, rebound, run, and then score.",
    "295": "That being said, time for the NBA Season, second half of the season as teams lock and pursue for the postseason. As the All-Star weekend approach, tonight matchup against @okcthunder vs @nyknicks at 7:30pm. As the @nyknicks placed 5th and the Atlantic Division. #Compete #Transit",
    "296": "@NBA_NewYork I wish Kemba, could one day work for da Knicks organization in some fashion.  A coach in their G league or a scout.. something it's like he's a class act and a guy you would love to represent your brand.",
    "297": "@livelikelefty @nyknicks When they pulled off the upset against Boston in the 1989-1990 playoffs.",
    "298": "@nyknicks all we want is for @deucemcb11 to get in this rotation can we please make that happen.\n\nthank you, from a loyal fan !",
    "299": "@livelikelefty @nyknicks 1984 Bernard King",
    "300": "@DeadPresPicks New York Knicks",
    "301": "@livelikelefty @nyknicks Pat Ewing 🇯🇲",
    "302": "@NBA_NewYork We should smile that two of the Knicks lost talented players get 8 minutes a game while Taj gets 30…Id say it’s more of a laugh situation then a smile",
    "303": "@livelikelefty @nyknicks Walt the Clyde Frazier",
    "304": "⚡️HOJE TEM THUNDER⚡️\n\n🆚 New York Knicks (25-32)\n🏟 Madison Square Garden \n🌎 New York, NY\n⏰ 21:30 🇧🇷 \n \n#ThunderUp https://t.co/ysJPxnMjqe",
    "305": "@livelikelefty @nyknicks Was always a fan bc they r the hometown team but Amare made me a diehard",
    "306": "Oklahoma City Thunder vs New York Knicks - NBA League 2022\n🔴Live Now📺📱:  https://t.co/O7q1zdPUKD\nDate : 2/14/2022 - Time : 7:30 PM",
    "307": "@livelikelefty @nyknicks Mom got cable in 1988, started watching Knicks games on msg. Then I’d go play double dribble, pick New York and pretend I was Rod Strickland and Gerald Wilkins lol Been trying to will the team to a chip ever since",
    "308": "@JacquesMontes3 @anstahh_ @TheNBACentral @NYPost_Berman Y’all bums boy 😂😂 12th in the east is bum worthy 😂😂 and knicks own the bulls? Why don’t you check the records against eachother, New York stays whack",
    "309": "@livelikelefty @nyknicks Being a Jew on Christmas Day with nothing better to do… it was love at first sight",
    "310": "OKC Thunder vs. New York Knicks- 2/14/22 Free Pick &amp; NBA Betting Prediction https://t.co/oTAz0ywlVc\n.\n#Betting #FreePicks https://t.co/WZmrbr3qEy",
    "311": "@livelikelefty @nyknicks Patrick Ewing",
    "312": "Was the last time there was any buzz around @TheGarden for the @nyknicks. Your did a lot for #NYC basketball @JLin7! https://t.co/Yc1HYdOcWW",
    "313": "@livelikelefty @nyknicks Each and every single games made me fall in love with the Knicks. That's the tweet. 💙🧡",
    "314": "@livelikelefty @nyknicks My dad took me to games since 92’ till I grew up and could do the same for my kids … guess it’s inherited",
    "315": "@livelikelefty @nyknicks Patrick Ewing",
    "316": "Jogos de segunda feira (14/02) \n\n21h00 Detroit Pistons X Washington Wizards \n21h30 Sacramento Kings X Brooklyn Nets \n21h30 Oklahoma City Thunder X New York Knicks \n22h00 San Antonio Spurs X Chicago Bulls \n22h00 Portland Trail Blazers X Milwaukee Bucks",
    "317": "@NBA_NewYork Great to see they actually hang out!\nThey all gotta be in the @nyknicks rotation. We watchin' u Thibs!👀🤬",
    "318": "@livelikelefty @nyknicks This day. https://t.co/FmsIaXo2x9",
    "319": "Per reports, the #Bulls were interested in New York Knicks big man Mitchell Robinson at the #NBA Trade Deadline. (via @BuzzOnTap) \n\n@BullsOnTap | #BullsNation \nhttps://t.co/4AGmx2C3JH",
    "320": "@livelikelefty @nyknicks We’re all Masochists!",
    "321": "@livelikelefty @nyknicks Channel 9, WOR. That's where we played on TV.",
    "322": "@livelikelefty @nyknicks Bernard and Rory Sparrow 😍",
    "323": "@livelikelefty @nyknicks Stupidity",
    "324": "@KingsmanJay312 @nyknicks I Wonder what happend to him🤔\nWhy he left Knicks and now I don't even know if is playing🤔",
    "325": "@juice33nyc @livelikelefty @nyknicks funny me too",
    "326": "@keep_wolin @livelikelefty @nyknicks I cant shake em🤣",
    "327": "@VoidFiji @livelikelefty @nyknicks The rest of that sentence is “unfortunately”\n\n🤣🤣🤣",
    "328": "@BenRitholtzNBA @FredKatz Some NBA teams don't know what SET PLAY they want to use in late 4th Quarter games, at least the New York Knicks have a clear cut choice. 😄😄😄 Now upgrade the point guard position to a better shooter that will take the shot himself.",
    "329": "@livelikelefty @nyknicks A kid from Coney Island https://t.co/FGvfdZVVfO",
    "330": "@Kennyduhballern @NyThris_ @nyknicks @DKSportsbook Who does he play for",
    "331": "@livelikelefty @nyknicks Bernard King",
    "332": "@DirtyFittedHat @nyknicks @DKSportsbook hard to accept that after the season last year.",
    "333": "@keep_wolin @livelikelefty @nyknicks Likewise",
    "334": "@jakefinw3 @NyThris_ @nyknicks @DKSportsbook Ivey",
    "335": "@WhatSeperatesU @nyknicks @DKSportsbook Tank, the season over with might as well get a high draft pick",
    "336": "@livelikelefty @nyknicks PATRICK FCKN EWING",
    "337": "Kristaps Porzingis New York Knicks 2015-16 Panini Complete S\n#sportsCards\nSource: Fanatics Checker\nReason: In Stock\n\n12:55:20.2640 PM EST #Ad\n\nhttps://t.co/2BF3SG7Xgm",
    "338": "Kristaps Porzingis New York Knicks 2015-16 Panini Complete S\n#sportsCards\nSource: Fanatics Checker\nReason: In Stock\n\n12:55:20.2640 PM EST #Ad\n\nhttps://t.co/QhNtOySWK1",
    "339": "@nyknicks @DKSportsbook we gotta make the play in",
    "340": "#NYC Daily Roundup 02/14: Cash incentive returns for COVID-19 shots, @nyknicks return to MSG after Saturday loss &amp; more news https://t.co/av5AQrYsLB\n\n#NewsBreak",
    "341": "@livelikelefty @nyknicks Born into fandom",
    "342": "@NyThris_ @nyknicks @DKSportsbook For who",
    "343": "@NBA_NewYork Knicks fans wanna see you guys play big minutes.yall are the future. Let's go knicks",
    "344": "@livelikelefty @nyknicks Love-99 playoff run. https://t.co/gMRioMm3Xv",
    "345": "@nyknicks @DKSportsbook Show the tale of the meltdown tape vs blazers 4th quarter masterclass.",
    "346": "@nyknicks This was so damn corny 🤣🤣🤣 but i’ll allow",
    "347": "@N_Papadojannis @DimKaramanis “Tales from the 1969-1970 New York Knicks” ?",
    "348": "@nyknicks @DKSportsbook If we don’t win this next two games going into the breaks The season is officially over. Rn we on our last legs. Need to start winning again https://t.co/QyYYC9WqwG",
    "349": "NBA Betting Trend – New York Knicks are 31 - 15 in the second half of the season over the last two years\n#sportshandicapper \n#sportbetting",
    "350": "@nyknicks @DKSportsbook Tank please",
    "351": "Valentines Day Knicks Question. \n\nWhat made you fall in love with the @nyknicks ???",
    "352": "@nyknicks @DKSportsbook maybe win the game",
    "353": "@theScore @nyknicks No one cheered for raptors that game. Toronto is a mutitcutltural city and Lin got all the love that night",
    "354": "Tale of the tape 📊\n\n@DKSportsbook | #NewYorkForever",
    "355": "New York Knicks: Special Offer for Knicks Fans: Bet $10, Win $200 Guaranteed on Knicks vs Thunder https://t.co/BZ49bTvVEG",
    "356": "@DStewart267 @nyknicks Crazy thing was I woulda been hooping overseas around this time, God chose to keep me in Harlem tho",
    "357": "@JCMacriNBA Definitely a position of need. 😄😄😄\nI give the New York Knicks management team for addressing the correct position. https://t.co/ucBzwO2jtn",
    "358": "February 14, 1993: Orlando rookie Shaquille O'Neal \"with the power move\" against New York in the 2nd quarter.\n\nShaq scored just 8 PTS in regulation on 3-16 FG/2-6 FT, but finished with 19 REB &amp; 9 BLK to go along with 21 PTS in a triple-overtime win.\n\nMagic 102, Knicks 100 (3OT). https://t.co/3K7OtlSfzP https://t.co/AAZet5iyDn",
    "359": "Congratulations to PerfectCereal (@Perfect_Cereal) who moved up 51 spots to take #34 on the New York Knicks team leaderboard.\n\nhttps://t.co/KTWpkR4EiB",
    "360": "You’re in trouble @Timberwolves @nyknicks",
    "361": "@NBA_NewYork New York Knicks management team doesn't see Obi the same way as their fanbase. 😄😄😄 They are looking for perimeter players to take the lead, but haven't found the right one yet.",
    "362": "He will not play in the All Star Game as well and the earliest James Harden could make debut is Friday, February 25 at Minnesota or Sunday, February 27 at the New York Knicks",
    "363": "@nyknicks Fuck y’all https://t.co/HcErnFlOJY",
    "364": "Earliest James Harden could make Sixers debut is Friday, February 25 at Minnesota or Sunday, February 27 at the New York Knicks https://t.co/IFHfAkkKoO",
    "365": "@NBAHistory @nyknicks C'mon the Raptors call??",
    "366": "@nyknicks So why didn't we keep him?",
    "367": "@theScore @nyknicks Broke hearts? A lot of us were cheering for the magic that was #Linsanity",
    "368": "imagine having a franchise based in New York and completely neglect the point guard position lol only our Knicks",
    "369": "@CJWritesNThangs When he came to New York... whew. The ultra rare Knicks trade rumor that actually came true.\n\n(And contrary to public opinion at the time, he was far from a problem here.)",
    "370": "NBA Betting Trend – New York Knicks are 31 - 15 in the second half of the season over the last two years\n#winning\n#sportbetting",
    "371": "@theScore @nyknicks I was there 😎",
    "372": "@BarDown @Senators @nyknicks @AtlantaFalcons \n\nSo much pain, but so much love",
    "373": "@NBA_NewYork If nothing else. We are an extremely resilient fanbase. Not much can hinder the passion of a real Knicks fan.",
    "374": "@TheStrickland @qdotgrimes @deucemcb11 @camreddish @nyknicks “I’d give up a Top 15 protected first round pick that might convert into two 2nds” just doesn’t elicit enough romance?",
    "375": "Oklahoma City Thunder vs New York Knicks NBA Pick and Prediction NBA Betting Tips 2/14/2022 https://t.co/1771gKKqW5 via @YouTube #NBA #NBAPick #NBAPredictions #NBAOdds #Knicks #NewYorkForever #Thunder #ThunderUp #KnicksVsThunder",
    "376": "#KOTD New York Knicks Dunk low 75th anniversary https://t.co/x6dLyMSd4L",
    "377": "@nyknicks I was just thinking about this before I seen it.",
    "378": "Happy Valentine’s Day from the New York Knicks’ kids. 💙😉🧡 https://t.co/XpRhK5rlF6",
    "379": "OTD: 10 years ago, Jeremy Lin broke hearts in Toronto after he knocked down the game winner vs. the Raptors! 🔥\n\n(🎥: @nyknicks) \n\nhttps://t.co/DvZtWkE8OI",
    "380": "Thank you New York Knicks Look forward to performance",
    "381": "@nyknicks It's sad the knicks have to post things from ten yrs ago when we actually had good players. Like Lin and Melo and Stat.",
    "382": "🔶🔷 GAMEDAY🔶🔷\n\n🏀: Oklahoma City Thunder \n        (17-39)\n\n       @\n\n       New York Knicks \n        (25-32)\n\n⏰: 1:30 AM (german time) \n\n 📍: Madison Square Garden https://t.co/cIHEHanjgL",
    "383": "@nyknicks are you a layup? bc I missed you https://t.co/wQGsjcYnIY",
    "384": "Luguentz Dort @luthebeast will not play in Mon vs  the @nyknicks  due to a strained \nleft shoulder!\n\n#CreamGetsTheMoney #nbaDFS\n\nhttps://t.co/LFLWJ6yZLz https://t.co/GeBXvMoMVd",
    "385": "@nyknicks WE NEED HIM!",
    "386": "@MichaelKeithDa2 Zero excuse for the @nyknicks to be 12th. Everything was a bonus last yr. They made 4th so build on it. With largest cap room in nba, DeRozan and PGs available, lots of assets yet chose to roll it back- bad call. Ok pivot, either improve or clear cap for nxt yr. Did neither-awful",
    "387": "🚨 Line Change 🚨\n\nOklahoma City Thunder @ New York Knicks\nMon 7:40 PM EST\n\nFrom:\nNY -7.5 -115\n\nTo:\nNY -10.0 -110",
    "388": "@nyknicks I was convinced at that moment that Lin was going to be the greatest pg to ever put on a Knicks jersey",
    "389": "Consensus Line Move:\n2022-02-14 Oklahoma City Thunder at New York Knicks from -8.00 to -10.00\n#NewYorkForever check those props\n#NBA #bettingexpert #coding #investor",
    "390": "10 years ago today. VaLINtine's Day in Toronto. https://t.co/u6WTiIwHoS",
    "391": "#NBA \n\nOKC/NY\n\nThunder are 4-1 ATS in the last 5 meetings in New York\nThunder are 3-1-2 ATS in their last 6 games playing on 1 days rest.\nThunder are 19-7 ATS in their last 26 games as a road underdog\nKnicks are 9-24 ATS in their last 33 games playing on 1 days rest",
    "392": "@nyknicks @MSGNetworks @BetMGM Celebrate Lunar New Year by playing Deuce",
    "393": "NBA Game Preview - The New York Knicks have a forecast 60% chance to win against The Oklahoma City Thunder with a spread of -2.5/2.5 and an over/under of 225. The New York Knicks are 0 - 1 against The Oklahoma City Thunder in the 2021-22 Season.\n#winner\n#sportbetting",
    "394": "@MassiveBall @nyknicks Mucho amor",
    "395": "Big 🍎 for a Valentine's Day date with the Knicks 💙\n\n@okcthunder vs @nyknicks \n⏰ 6:00 pm\n📺 Bally Sports Oklahoma\n📲 Bally Sports App\n#ThunderUp https://t.co/dDtQUJhiR3",
    "396": "@NBAHistory @nyknicks Linsanity was such a fun little time. It's a shame it came and went so quickly",
    "397": "@Prodigalshun @PlayoffBoundNYK @nyknicks Clearly if you’re trying to call someone a racist I must truly trigger you. Get some help.",
    "398": "@Prodigalshun @PlayoffBoundNYK @nyknicks I’m not racist though. So…wrong again.",
    "399": "@nyknicks This team is soft.  No one knows how to close out a game w/ the lead. Starting w/ our HC to our supposedly #1 option.",
    "400": "Leonard Truck Robinson 2020-21 Obsidian Galaxy Orange Auto /50 \nTag a @nyknicks fan!\nhttps://t.co/IhgxAZJFND\n#thehobby #newyork #knicks #nyknicks #nba #basketball #basketballcard #autograph #collect",
    "401": "@dubs4win @NBAHistory @nyknicks Absolutely none",
    "402": "@NBAHistory @nyknicks I still think he should be in the league.",
    "403": "Why Am I A New York Knicks Fan SMH LOL https://t.co/CoRuW86ltN via @YouTube\n\n#nba #basketball #bball #sports #knicks #nyknicks #espn #podcast #youtube #YouTubers",
    "404": "On this day in 2012... Jeremy Lin stepped into this game-winner for the @nyknicks vs. Toronto! #NBA75 https://t.co/oBfgzrxcHW",
    "405": "Leonard Truck Robinson 2020-21 Obsidian Galaxy Auto /149\nTag a @nyknicks fan!\nhttps://t.co/9OratNFscH\n#thehobby #newyork #knicks #nyknicks #nba #basketball #basketballcard #autograph #collect",
    "406": "@Prodigalshun @PlayoffBoundNYK @nyknicks I’m not concerned and you’re still triggered so 🤷🏻‍♀️",
    "407": "OKC Thunder | Game #57 Preview: New York Knicks https://t.co/JLlA3xDGGc",
    "408": "@nyknicks Nets",
    "409": "@nyknicks Looks like light at the end of the tunnel for the Mets",
    "410": "@nyknicks Good luck on your upcoming game guys!  Your fan will be watching, and praying!",
    "411": "@PrimeRJBarrett @nyknicks Lol 😂 u have no idea what ur talking about burks is ass",
    "412": "@NY_KnicksPR @nyknicks It’s about time Adam silver + Owners look into the draft process. Knicks have needed a guard for decades and you have to hope your bad enough or balls pop in your favor. Lottery teams should be able to bid on the position they need!",
    "413": "@aaronfarrarNews @nyknicks ABSOLUTELY. https://t.co/CttwsHujP7",
    "414": "February 14, 1993: New York's Charles Oakley with a rebound and over-the-shoulder assist to Patrick Ewing.\n\nEwing scored 34 PTS and Oakley had 18 REB, but the Magic beat the Knicks in triple overtime, 102-100.\n\n📼 https://t.co/GzO5d93mAX https://t.co/TD1Mdwhl0Z",
    "415": "@nyknicks So? The same rotation will be used so there will be the same results…",
    "416": "@PrimeRJBarrett @nyknicks Man how old r u like 15 or something",
    "417": "@PrimeRJBarrett @nyknicks So ur ok with him playing burks at pg and his template substitution patterns",
    "418": "@nyknicks Can we get their minutes UP!",
    "419": "@nyknicks Today is my birthday 🎂 #ValentinesDay2022",
    "420": "New York Knicks vs Oklahoma City Thunder: Best Bets &amp; Predictions https://t.co/rBweJ2xqVS",
    "421": "@PrimeRJBarrett @nyknicks No fans bubble basketball shit was very different",
    "422": "@knicks81 @nyknicks Bro what. Wym pandemic season.",
    "423": "@PrimeRJBarrett @nyknicks He was that last year during a pandemic season which shot was very different. You can’t hold on to that you have to evaluate what he’s doing for the knicks this season.",
    "424": "@nyknicks Beat the nets and I’ll be happy",
    "425": "@nyknicks Awful https://t.co/hpRpaWb3TD",
    "426": "@nyknicks Try not to piss all over yourselves for once please",
    "427": "@knicks81 @nyknicks At the end he’s the COTY",
    "428": "@nyknicks trash team",
    "429": "@knicks81 @nyknicks I mean until rose comes back it should be fine.",
    "430": "@nyknicks U run NYC",
    "431": "@nyknicks Please win don’t play quickly or alec burks play grimes and deuce please",
    "432": "@nyknicks Just beat the Nets, that’s all that matters",
    "433": "@nyknicks Fuck it TANK BEGINS NOW",
    "434": "@nyknicks Please win",
    "435": "@nicco16039646 If you enjoy it, it’s not a waste of time but in moderation. I’m a New York Knicks fan (unfortunately), I’ll watch when I can but usually have a few other things take priority. Those 10 min highlights on YouTube are gold!",
    "436": "Back home before the All-Star break.",
    "437": "#NBA #NBA75  #GAMEDAY  \n\n🏀 Oklahoma City #Thunder 🆚 New York #Knicks \n\n🕢 7:30pm 🇺🇸 (CT)\n7:30pm 🇲🇽🇨🇴🇪🇨🇵🇪 \n8:30pm 🇵🇾🇻🇪🇧🇴🇩🇴🇵🇷 \n9:30pm 🇦🇷🇺🇾🇨🇱🇧🇷\n1:30am 🇪🇸\n\n🏟 Madison Square Garden, #Newyo\n\n#ThunderUp https://t.co/SKNa2p32CS",
    "438": "@PrimeRJBarrett @nyknicks Thibbs got us back to respectability last year but he can only take us so far. He is very close minded and doesn’t trust young players he doesn’t know how to maximize his players talents and the players tune him out",
    "439": "Consensus Line Move:\n2022-02-14 Oklahoma City Thunder at New York Knicks from 205.50 to 207.50\nOver almost there\n#NBA #sportsbets #ml #marketing",
    "440": "@nyknicks @MSGNetworks @BetMGM God damn it I’m not even excited",
    "441": "@PlayoffBoundNYK @nyknicks Your Kyrie insults don’t hurt me. I can’t stand him. Still worth everything having KD here",
    "442": "@nyknicks These are the best ones I’ve seen today 👏🏻",
    "443": "@nyknicks Happy Valentine’s Day New York Knicks! 🧡💙",
    "444": "@nyknicks The only Valentines gift we want from you is for you to #FireThibs",
    "445": "@__kristinf34 @nyknicks Getting our players vaccinated.\nKeeping our left handed star wing happy in NY.",
    "446": "@nyknicks @MSGNetworks @BetMGM I actually may take the Knicks ML tonight, but I know if I do, they'll lose.",
    "447": "@realnbaquotesig Are you the New York Knicks, because when I saw you my D Rose Quickly",
    "448": "@nyknicks Stop merely posting about Deuce, play the man!",
    "449": "@nyknicks RJ was a stretch 🤣",
    "450": "@nyknicks Roses are red violets are blue this seasons been a let down, the Twitter account too.",
    "451": "@nyknicks These are awful. You’re literally not better than the nets at anything",
    "452": "@nyknicks Even nets content creators are better 😭",
    "453": "@nyknicks Me trying not to say something bitter under the Valentines tweet challenge: https://t.co/CHVLU3HvUW",
    "454": "@nyknicks @MSGNetworks @BetMGM Y’all have been such a disappointment to NY basketball",
    "455": "@AboutToRatioU @nyknicks D rose",
    "456": "@nyknicks I hope we lose out the rest of the season because of this tweet",
    "457": "HOY JUEGA EL THUNDER!\n\n🆚 New York Knicks 👖\n⏰ 21:30hs 🇦🇷🇺🇾\n👕 Statment Edition 🟠\n🏟️ Madison Sqaure Garden 👖\n📺 NBA League Pass\n\n#ThunderUp https://t.co/WYJLm6WaJn",
    "458": "Happy Valentine’s Day! 🧡💙 #NewYorkForever https://t.co/yHMreb9z8g",
    "459": "@nycfcjake @nyknicks @MSGNetworks @BetMGM Probably won't see him until after the break. It's getting harder &amp; harder for people to defend Thibs' coaching.",
    "460": "#Knicks must watch #Celtics game film. \n☘️Comeback win yesterday has team on 8-game win streak.\n\nMain reason is ability to close out games. Losing close games haunted C's for months this season.\n\n#NYK inability to finish chief reason for 25-32 record! \n#NewYorkForever @nyknicks https://t.co/nHksHzTftw",
    "461": "The teams with the most Kentucky Wildcats in the NBA:\n\n4: Knicks\n\n2: Kings, Thunder, Hornets, Timberwolves, Mavericks, Sixers, Clippers, Lakers and Heat\n\n1: Hawks, Suns, Pistons, Pacers, Blazers, Cavs, Spurs, Magic and Nuggets.\n\nNew York loves Kentucky.\nWho'll be next?",
    "462": "@NY_KnicksPR @nyknicks Ok I think you’ve signed him 3 times in the last 2 months and I have never even seen him dress , why tell us until he dresses , don’t care",
    "463": "@Iukeswanson @nyknicks @MSGNetworks @BetMGM The Knicks owe you a TV!",
    "464": "@nyknicks @MSGNetworks @BetMGM Is RJ back or is he still recovering from being left out on the court during a blowout? Knick fans should boo the front office tonight or stop showing up until we see some progress.",
    "465": "@knicks81 @nyknicks He’s the COTY he knows what he’s doing. Leon Rose brought in the vets he’s gonna wanna play them",
    "466": "No no NO, buyout Kemba, then play McBride, DRose and Quickley at PG, end story! #knicks @nyknicks \n\nBuyout Candidates for the Knicks to Replace Kemba Walker https://t.co/4Xn1WNXHmY",
    "467": "@TyTroII @nyknicks @MSGNetworks @BetMGM Especially since this is the 10 year anniversary of the Jeremy Lin game winner against the Raptors.",
    "468": "@nyknicks @MSGNetworks @BetMGM It’s ok guys we signed Ryan Arcidiacono, we’re good.",
    "469": "@nyknicks @MSGNetworks @BetMGM Don’t fail the Asians today",
    "470": "Why New York Knicks coach Tom Thibodeau is on the hot seat https://t.co/HjAQjYr2Em",
    "471": "@nyknicks @MSGNetworks @BetMGM If we lose to Thunder fire Thibs immediately",
    "472": "Celebrating Lunar New Year tonight!\n\n🏀: vs. Thunder\n🕢: 7:30 PM ET\n📺: @MSGNetworks | MSG GO\n#NewYorkForever x @BetMGM https://t.co/7UA22JL0Lz",
    "473": "DasHaus made a bet!\n\nEvent: Oklahoma City Thunder vs New York Knicks #NBA\nBet: New York Knicks TO WIN -8\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "474": "The Oklahoma City Thunder play the New York Knicks on Monday, and if you’re looking to do some last-minute betting research, you’re in luck! We’ll give you the latest point spread, money line odds …  https://t.co/S2M3JiHP8B",
    "475": "@nyknicks @MSGNetworks @BetMGM We better blow these kids out the water!\n* SERIOUSLY * #NYK",
    "476": "DasHaus made a bet!\n\nEvent: Oklahoma City Thunder vs New York Knicks #NBA\nBet: Oklahoma City Thunder TO WIN +8\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "477": "@nyknicks @MSGNetworks @BetMGM Get Burks and Noel far away from this team",
    "478": "@nyknicks @MSGNetworks @BetMGM Don’t choke this again",
    "479": "@nyknicks @MSGNetworks @BetMGM Just tank.",
    "480": "@nyknicks @MSGNetworks @BetMGM y’all goin to hell",
    "481": "Check out New York Knicks vs. Oklahoma City Thunder at Madison Square Garden in Manhattan tonight at 7:30PM.\n\n@NYKnicks #Knicks #NewYorkCity\nhttps://t.co/nndz8dmF91",
    "482": "The New York Knicks play basketball today. Rejoice (or drink) accordingly 🙌🏾",
    "483": "New York Knicks: Trio of Westchester Knicks score 20-plus points en route to 41-point win over Cleveland Charge https://t.co/5Wnd54CV5T",
    "484": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/UCYkpGVctx",
    "485": "🏀📬KFS Newsletter Alert📬🏀\n\nIn our free Monday edition, I went back to the debacle in Portland and explored how all of New York’s issues this season reared their ugly heads in the Knicks’s worst loss of the year. Plus, Bill Cartwright on the #NYK75: https://t.co/VAudyWTb6z",
    "486": "Oklahoma City Thunder vs  New York Knicks Prediction 2/14/22-  Free NBA ... https://t.co/DvhWAdVxbv via @YouTube \n\n#NBA #NBAPick #NBAPrediction #Basketball #NBATwitter #Knicks #Thunderup",
    "487": "Would literally give up anyone else on the Knicks than him, re-sign this man .@nyknicks https://t.co/U326HqR9gK",
    "488": "New York Knicks - Oklahoma City Thunder İddaa Tahmini 15.02.22\nhttps://t.co/uSD5u8xXmw",
    "489": "@WorldWideWob @nyknicks f'd this one up bad",
    "490": "@KinG_Easy @nyknicks Randle telling Thibs he might smack the shit out of him if he don't order wings for a halftime snack.",
    "491": "Thunder will travel to Madison Square Garden to take on the New York Knicks\nThunder hopes to end a five-game losing streak and own the second-worst record in the Western Conference this time, will they be successful?\nMake your own fantasy team now!\n#basketball #panda11 #punkpanda https://t.co/TJgrKt5fsp",
    "492": "@ShamsCharania @TheAthletic @Stadium Apparently, this is Leon Rose's move to guarantee the playoffs. Meanwhile, two proven commodities in Deuce and Cam idle for the @nyknicks.",
    "493": "This guy is a @nyknicks fan 🤣🤣🤣 need I say more? https://t.co/CIbIIeH8qR",
    "494": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/Mln0YS8hvv",
    "495": "The Chicago Bulls were interested in trading for New York Knicks center Mitchell Robinson at the trade deadline and are expected to show interest in him again when he becomes a free agent this offseason, per @NYPost_Berman.",
    "496": "@TheNBACentral @NYPost_Berman @nyknicks y’all better give @23savage____ the money he deserves",
    "497": "@KinG_Easy @nyknicks This guys a clown lol",
    "498": "On this day in sports history February 14, “Linsanity” reached its peak, as New York Knicks Point Guard Jeremy Lin recorded 27 Points and 11 Assists, including hitting a game-winning 3-pointer in a 90-87 win against the Toronto Raptors in 2012.",
    "499": "@sny_knicks Had New York Going Crazy.",
    "500": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/4PnW25YZxR",
    "501": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/JgHBbF4yLA",
    "502": "On this day in sports history February 14, the New York Knicks played their 1st game at Madison Square Garden, defeating the San Diego Rockets 114-102 in 1968.",
    "503": "On this day in sports history February 14, Cincinnati Royals Point Guard Oscar Robertson recorded 29 Points, 11 Rebounds, and 21 Assists in a 126-114 win against the New York Knicks in 1964.",
    "504": "On this day in sports history February 14, New York Knicks Shooting Guard Richie Guerin recorded 51 Points, 10 Rebounds, and 6 Assists in a 125-112 win against the Boston Celtics in 1962.",
    "505": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/PFUd6OzGb5",
    "506": "Why New York Knicks coach Tom Thibodeau is on the hot seat https://t.co/AUI4JPOCHS \n#NyKnicks",
    "507": "@PrimeRJBarrett @nyknicks We need a coach who knows how to maximize the roster and not just play vets. His rotations sare terrible and his offensive sets are awful as well.",
    "508": "The Knicks rotation ranks 10th in age (26.9 y/o).\n\nFrom all teams in the top 15, only the New York Knicks and Sacramento Kings are outside play-in spots.\n\nKnicks have 8 players who are 23 or younger, but still rank high in the age category.. I wonder why? 🤔",
    "509": "@nyknicks Game Night!!   We need a win tonight. #NewYorkForever https://t.co/S3MT9JdAtG",
    "510": "Congratulations to JoeCandy who moved up 1 spot to take #7 on the New York Knicks team leaderboard.\n\nhttps://t.co/KTWpkR4EiB",
    "511": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/b0NItZYq6E",
    "512": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/i0gaHEjhX7",
    "513": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/3qtWt8drW2",
    "514": "The New York Knicks play basketball today. https://t.co/7ly5PtNLhM",
    "515": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/A1ZAvZMUuu",
    "516": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/BJJYDuWekr",
    "517": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/piGzpMTHtF",
    "518": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/qPmMZyRvuP",
    "519": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/bWlGv7CdPs",
    "520": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/QQJSL7p8Nb",
    "521": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/zdOlx8mdhx",
    "522": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/aa8yDTsJaH",
    "523": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/VKPWFm9Yk4",
    "524": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/lohKxgPYyI",
    "525": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/2vb6l7pha8",
    "526": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/eFHdf66Yym",
    "527": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/C8yOS4jKby",
    "528": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/0JuxtTWFtc",
    "529": "Consensus Line Move:\n2022-02-14 Oklahoma City Thunder at New York Knicks from 206.50 to 205.50\nUnder mousetrap\n#NBA #sports #python #bitcoin",
    "530": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/fZiyvXeUzF",
    "531": "@JackoXFburner @JayDlegend I've been seeing melo since 07 and NBA Wise yes he is Kidd and it dead accurate we all saw potential for all time great on 09 and Kidd on Sabbody we thought the knicks and heat would be rivals for ages after melo join New York but alas promise wasn't delivered like current Kidd",
    "532": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/ylNSBK9VHj",
    "533": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/OA2hqzsFFc",
    "534": "New York Knicks: Today in history: Feb. 14 https://t.co/N8AVjjb03a",
    "535": "New tumblr post: \"### NBA2K22 New York Knicks vs Houston Rockets MyLeague PS4...\" https://t.co/iU941X2ptl ifttt, youtube",
    "536": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/UjhBJGKjMn",
    "537": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/GUIUgydOUv",
    "538": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/JlIPPZe4kH",
    "539": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/yVsnCgkJod",
    "540": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/z5Yp41Byjh",
    "541": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/meCPrzFndf",
    "542": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/AnvJUrm9r3",
    "543": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/SppwZEXbCr",
    "544": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/bZ9WgT9iLc",
    "545": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/DwVROIM6qR",
    "546": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/aqI0cscNGP",
    "547": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/8jtZxZ7Dtv",
    "548": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/c7hB3QzEsK",
    "549": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/f6odsOXSG8",
    "550": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/ipojHNPR77",
    "551": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/bA2c9VamZr",
    "552": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/b2Ym3g2uUm",
    "553": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/h4EEwXsk2y",
    "554": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/PlUZmbd5LU",
    "555": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/XqInbazMT0",
    "556": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/5Ah7Swrh5f",
    "557": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/IMfs7KqEag",
    "558": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/UBumUX9gOM",
    "559": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/rNKB0SLKlU",
    "560": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/Q7YZVl0H00",
    "561": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/y9Vm29BIeG",
    "562": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/tZi76BCp7j",
    "563": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/a00EzJ23AY",
    "564": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/GSchBmsUCN",
    "565": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/gU9LRQtgy9",
    "566": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/7ZXRuO8sez",
    "567": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/B1Hh8wxLkV",
    "568": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/t91BEeUGMU",
    "569": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/cPOioNyO9h",
    "570": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/mIfC1jELT9",
    "571": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/qNKuY5wFcu",
    "572": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/j7yggTaIZa",
    "573": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/jZ5ambD2Uw",
    "574": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/U5JtS5Qzu1",
    "575": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/oxjoqFqQn0",
    "576": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/ysWK8EiiMi",
    "577": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/VUPsBM5L2B",
    "578": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/8QWqZh8yNc",
    "579": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/sxiuWOAQPP",
    "580": "REPORT: New York Knicks Have Interest In Dallas Guard Jalen Brunson https://t.co/FcSkH7C4pM",
    "581": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/zrrAUONsRA",
    "582": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/EEi3VCe6J1",
    "583": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/tIxv40qbim",
    "584": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/QU3PaIUyhb",
    "585": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/jxdNN6sVSl",
    "586": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/gBdNKRl6l9",
    "587": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/wX3ApIKy9Z",
    "588": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/PdPTsKksDL",
    "589": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/REgvhKAdLV",
    "590": "“Linsanity” continued as Knicks sensation Jeremy Lin made a tiebreaking 3-pointer with less than a second to play and New York rallied to beat the Raptors 90-87, extending a winning streak to six games. https://t.co/dy7MlKXGDG",
    "591": "@nyknicks @IQ_GodSon Work on that shooting slump..",
    "592": "@graham_grumpy @AlywardBrittany TS:Brittanyjayy New York @nyknicks \n@BigJCanada TS: BigJCanada420 Boston @celtics \nThanks for the opportunity",
    "593": "@NBA_NewYork Knicks I’m not losing purposely they just don’t know how to close games it’s the coaching",
    "594": "#Portland Trail Blazers erased a 23-point, third-quarter deficit to beat the #NewYork Knicks 112-103 on Saturday (2/12). Anfernee Simons scored 30 points &amp; eight assists, while the newly acquired guard #JoshHart, one of several players new to Portland's roster. #SEAToday https://t.co/HB5WkCek9Q",
    "595": "@nyknicks Gameday! Let's Go!\n\n#NewYorkForever #Knicks #KnicksTape",
    "596": "New York Knicks play today!",
    "597": "Free New York Knicks!!!",
    "598": "The New York Knicks play basketball tonight 🔥 https://t.co/GwGgb0R6vs",
    "599": "@joinrepublic \"So in New York anyone can now bet their life savings on a Knicks game but can't invest in private companies? 🤨\"\n\n\"Congress can trade stocks and any investments but middle class can’t invest in private companies Lmao what BS\"",
    "600": "Charles Oakley Says Patrick Ewing Didn't Help The New York Knicks Win: “You Get The Shots, The Glory, But The Team… – NBA News https://t.co/dqMDULfPLi",
    "601": "👑 New York Knicks VS Oklahoma City Thunder\n\n🏆 Des analyses tous les jours, dans tous les sports!\n\n➡️ Foot, NBA, Hockey, NFL, Boxe, Auto-Moto, MMA, ...\n\nhttps://t.co/eQBFsMM3aZ\n\n#TeamParieur",
    "602": "New York Knicks: Charles Oakley Says Patrick Ewing Didn’t Help The New York Knicks:  Win: “You Get The Shots, The Glory, But The Team\u0085 https://t.co/EIzlNGQafV",
    "603": "Tinashe Arrives at San Antonio Spurs v New York Knicks Basketball Game at Madison Square Garden in New York 01/10/2022 https://t.co/htXrMPVv00",
    "604": "people think Westbrook gets slandered too much as an NBA player now , imagine if he played up here in new york with the Knicks or the Nets . Media would absolutely destroy Him .",
    "605": "NBA Basketball Game Betting Picks Simulator: 7:40 PM ET - Oklahoma City Thunder vs. New York Knicks - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/KVKd9YyEtN #nba #sportsbetting #freepicks #cappertek",
    "606": "@knixknation @nyknicks Wtf? I'm half polish and half czech",
    "607": "@nyknicks Can we even just at least get to the play-in 🤦🏻‍♂️",
    "608": "@nyknicks This season is done. Just focus on young guys and then make a splash in the offseason. Get a championship veteran or get Dame!",
    "609": "⭐️Watch FREE #livestream here👉https://t.co/2c6Ltz5wlw 😉\n——\n🏀#NBA ‼️\n1. Washington Wizards Vs Detroit Pistons\n2. New York Knicks Vs Oklahoma City Thunder\n3.Brooklyn Nets Vs Sacramento Kings\n4.Milwaukee Bucks Vs Portland Trail Blazers\n5. New Orleans Pelicans Vs Toronto Raptors https://t.co/zUwApo3ZTl",
    "610": "@travbryanmusic The problem was always the point guard position. 😂😂😂\nNew York Knicks should have went all-in for Fred VanVleet.",
    "611": "They think Cali goes crazy, Philly, LA, Tampa, they think all these cities and states going crazy cause they won, wait until the day the Knicks win the nba championship, New York will be so loud New Jersey hears us NFS! Can’t wait for that day! #knicks",
    "612": "@ShamsCharania @TheAthletic @Stadium I like it, NBA journeyman for years, he ought to be hungry.\nThe New York Knicks point guard position is hurting.",
    "613": "The first African American to play in the NBA was Nat Clifton and he played for the @NYKNICKS!!! #BlackHistory #DOPE",
    "614": "new york knicks carmelo anthony https://t.co/719KRRO0CX",
    "615": "@socialiststeve6 It was the Boston Red Sox versus the New York Knicks. Come on, man, pay attention!",
    "616": "he is weird he plays on the New York  knicks",
    "617": "NBA:\nThe New York Knicks are signing Ryan Arcidiaceno for the remainer of the season.\nFollow @swish_mag \n#NBAAllStar #NBATradeDeadline #NBA #NBA75 #NBATwitter #Traders #SuperBowl #Knicks #NewYorkCity",
    "618": "Had to grab this low serial numbered @nbatopshot of my guy @qdotgrimes. Dude is having a hell of a rookie campaign so far on the @nyknicks!\n\n#NBATopShot #NewYorkForever https://t.co/FkznC3cwNz",
    "619": "@MrChuckD @nyknicks @NBA @nothinbutknicks Oh I already did lol....they know me 😬",
    "620": "@KnicksNation Despondent but not out! I am flummoxed at what took place. Was this loss solely Thib’s fault or the players who failed to deliver. Either way, it seems the @nyknicks lack that killer instinct to finish close games. They always flounder when teams make it close in the 4th",
    "621": "@OrangeNBlue4Evr @nyknicks Could have sworn Fizdale was gonna be great  too",
    "622": "@sirknicksalot @nyknicks Easily top 3, between him and Derek Fisher for #1 imo",
    "623": "@OrangeNBlue4Evr @nyknicks Top 5 Knicks coach ever",
    "624": "@NBA_NewYork Looks like the Knicks will be in all-out tank mode by the end of this…",
    "625": "@nyknicks this right here is leadership.  Fired the best coach we’ve had since Pat Riley smh 🤡 https://t.co/FbsPUNwStL",
    "626": "@Yankees @nyjets @NYIslanders @nyknicks @NYRangers @BrooklynNets @Giants @Mets How about we figure this shit out so we can go back to talking legitimate shit like these other cities?",
    "627": "@MrChuckD @nyknicks @NBA @KnicksFanTv @CPTheFanchise Done!",
    "628": "@nyknicks all Knicks fans need to make a campaign to get thibs fired . He too old school and stuck in his ways",
    "629": "A HOUSE DIVIDED \nNebraska Cornhuskers / New York Knicks https://t.co/TMwqjz05ov",
    "630": "@SpecificNY @nyknicks knicks arent making it all good lil bro",
    "631": "@KevvyKev1718 @nbaraw @NBA_NewYork Knicks fans are bi-polar. Worse than Philly. Our 2 time NBA Coach of the Year suddenly sucks.  After a 20 yr stinkfest of impulsive moves and one overachieving season, it's now unacceptable to patiently rebuild.",
    "632": "@SpecificNY @nyknicks They never making the finals bro it’s okay",
    "633": "@ImStevenMoney @SpecificNY @nyknicks There is no scenario in this universe where Fournier would play in an nba finals let alone for the Knicks",
    "634": "@NadiaKNM1 @Yankees @nyknicks @Giants Nadia pls 🤣🤣🤣🤣🤣",
    "635": "@SpecificNY @nyknicks I can't imagine the things you'd tweet about Evan Fournier in Game 7 of the NBA Finals",
    "636": "@SpecificNY @nyknicks That’s how I feel about if Westbrook ever goes to the finals again, good thing I ain’t got nothing to worry about!",
    "637": "@SpecificNY @nyknicks *love",
    "638": "Please never make the Finals because if we get there just to lose I might actually **** myself @nyknicks",
    "639": "@VVMMXXs Teams relocating seems to be the norm in the USA but there are iconic clubs like the New York Rangers who will never move and will always play at Madison Square Garden. There are many others too like the Knicks and the Yankees.",
    "640": "Luckily we still got @nyknicks and @NYRangers to entertain us for a while",
    "641": "Do you see this @Yankees @nyknicks @Giants stop being useless https://t.co/AdiXIcWIN2",
    "642": "@Pavel9792 @nyknicks Your short term memory loss is funny though. Pavel…sounds like a hockey name. Go try the Bruins.",
    "643": "Tomorrow, New York Knicks will take on Houston Rockets in YouTube! https://t.co/2Yqgmtwc6N",
    "644": "In Game 57 of the 2021-2022 #NewYork #Knicks #NationalBasketballAssociation Season, played on #February 12, 2022, The New York Knicks lost to The #Portland #Trailblazers; The New York Knicks record is now: 25-32 https://t.co/U5ZvfOjnRT",
    "645": "@NBA_NewYork Knicks dont use cutters too busy dribbling.",
    "646": "@_Beezo__ @nyknicks Oh naw we don’t watch NBA bro",
    "647": "Full focus to you bum ass @nyknicks .. https://t.co/hxdXWCA1xI",
    "648": "SB cool and all, but nothing will top the day the New York Knicks win the NBA Finals",
    "649": "@NY_KnicksPR @nyknicks Legit thought the kids name was \"Archie Diacono\" pretty much the whole time he was at Nova",
    "650": "@nyknicks @NBA @NBASTORE It’s been months. Can the store stock Jersey’s of people who play now ? #nyknicks #knicks #NBA75 #nbaallstargame https://t.co/TqS7bFbCHS",
    "651": "@shwinnypooh Attn: @nyknicks",
    "652": "@NBA_NewYork No comparison tbh and im a knicks fan, kuminga motor on d is diff",
    "653": "@Golfballl @dmstadler1 @nyknicks True",
    "654": "Boston Celtics            33-25\nLos Angeles Lakers    26-31 \nNew York Knicks         25-32\n\nIt was all bad just 3.5 weeks ago…",
    "655": "@_SierraBreeze_ @victorsin1_2_3 @Cubs vs @nyknicks, right? 🤔",
    "656": "Quentin Grimes on Instagram: \n\n“It’s times like these where you see who gon fold when it gets a lil tough\n\n#KEEPGOING”\n\nneed him in a New York Knicks uniform for the rest of time 🤝\n\n(via @qdotgrimes on IG) https://t.co/6M6VKqU1ps",
    "657": "New York Knicks: Knicks pulling back on trading soon-to-be free agent was telling https://t.co/LAbRwgBHDe",
    "658": "@MrChuckD @nyknicks @NBA @KnicksFanTv @CPTheFanchise Done 😊",
    "659": "THE#VALENTINES#DAY#MASSACRE#NEW#YORK#KNICKS#VS#OKLAMOMA#CITY#THUNDER https://t.co/J0PP6RAjaa via @YouTube \n#KNICKS#REAL#TALK#CHANNEL https://t.co/OaMONBgm3q",
    "660": "@VeeJayNYC @hopefulmetsfan @NBA_NewYork Thats what I meant. This seasons knicks team doesnt deserve the garden,they have not played like the New York Knicks, no effort,no passion, no aggression. It'd be a shame to even consider calling what theyve been playing \"basketball\"",
    "661": "@KnicksNation Fine, I’m used to it @nyknicks @NBA",
    "662": "@hhpthebook @dmstadler1 @nyknicks We have the only offense that tells players not to move without the ball. Lucky if u see 1 cutter during the game.",
    "663": "@cradby7 @TheNBACentral @GeraldBourguet You betta’ ask somebody…\n\nWon 2 NBA 🏆 🏆 with the New York Knicks.  \nNamed one of the 50 Greatest Players in NBA History in 1996.\n\n*Knicks' all-time leader in scoring (14,617 points), assists (4,791) and often led the league in steals… https://t.co/ChtmADNpTy",
    "664": "The PG we needed @nyknicks https://t.co/mOzwbuMp6m",
    "665": "@NY_KnicksPR @nyknicks Why just let deuce play man",
    "666": "And the @nyknicks passed on him 🤬 https://t.co/2jcRM7EbyV",
    "667": "Jews please give these gifts to my beautiful princess wife Maria isabel) I really like the new York Knicks team ...I'm excited to see Willis reed hoop with the classics he big dog stephon marbury  are all under contract and have no choice but to do with the coach orders https://t.co/CcAyDUGdge",
    "668": "@757el_wormy @nyknicks I read that."
}