{
    "0": "Utah Jazz vs Los Angeles Lakers LIVE NBA Play By Play/Commentary https://t.co/dCIWiHdgyd via @YouTube\n\nHit that like button and Subscribe!\n\nStay Smart….Stay UNeducated",
    "1": "Game Time https://t.co/5F1LQ6KOo6",
    "2": "Los Angeles Lakers vs Utah Jazz Live Stream HD\nʟɪᴠᴇ ᴅɪʀᴇᴄᴛ ᴛᴠ ᴏɴ ᴅᴇᴍᴀɴᴅ ⏩ https://t.co/R3NPIQCUV1",
    "3": "Golden State Warriors - Denver Nuggets\nLos Angeles Lakers - Utah Jazz\n\nBet slip link: https://t.co/LRwQxCfANl https://t.co/0gg1wScWpE",
    "4": "Golden State Warriors - Denver Nuggets\nLos Angeles Lakers - Utah Jazz\n\nBet slip link: https://t.co/NvUedpNSsw https://t.co/SsigqQwqKz",
    "5": "LeBron James loves general managers for Los Angeles-based sports teams who are willing to trade their draft picks to win now. This past week, that was very much NOT Lakers executive Rob Pelinka.  @LakersSBN https://t.co/Gxczgj1Gr4",
    "6": "Check out this listing I just added to my #Poshmark closet: Los Angeles LA Lakers Camouflage Baseball Hat Ball Cap One Sz Adjustable NEW NWT. https://t.co/telh8spq3N #shopmycloset @poshmarkapp",
    "7": "I’m letting y’all know now Ramona knows just as much as me and you when it comes to the Los Angeles lakers lol https://t.co/ulkvNEDPMK",
    "8": "Check out this listing I just added to my #Poshmark closet: Los Angeles LA Lakers Camouflage Baseball Hat Ball Cap One Sz Adjustable NEW NWT. https://t.co/u62FH2kVrh #shopmycloset @poshmarkapp",
    "9": "@noahgittell I can't believe there are TWO Los Angeles Lakers of the 1980s series.",
    "10": "Calgary Flames - Anaheim Ducks\nLos Angeles Lakers - Utah Jazz\nGolden State Warriors - Denver Nuggets\n\nBet slip link: https://t.co/ATCBJCOXaf https://t.co/OgZbh6zyCj",
    "11": "Los Angeles Lakers Starting Lineup 2/16\n PG: Russell Westbrook\n SG: Malik Monk\n SF: Stanley Johnson\n PF: LeBron James\n C: Anthony Davis\nhttps://t.co/o75oZ8vnE8",
    "12": "First five on the floor. \n\n#SuitingUpTogether | @ToyotaSoCal https://t.co/2kOWkbbePt",
    "13": "Boston Celtics: The Only Thing Stopping Me From Captaining The Los Angeles #Lakers Is My Brave Support ... https://t.co/AL6JzW5xy7",
    "14": "Boston Celtics: The Only Thing Stopping Me From Captaining The Los Angeles #Lakers Is My Brave Support ... https://t.co/vQQxhdy2AA",
    "15": "A Lakers, Dodgers, Rams championship parade is exactly what Los Angeles needs to ease that Kobe &amp; Nipsey pain.. https://t.co/WdUdF8qwdk",
    "16": "@BaldTrae @nbatopshot Ts: winstonhby Los Angeles Lakers!",
    "17": "#TakeNote visiting #LakeShow into the night. Here are some trends to help you out!\n\n🎺 - Jazz are 5-0 ATS in their last 5 games overall.\n🎷 - Lakers are 7-2 ATS in their last 9 games following a straight up loss.\n🎵 - Jazz are 1-5 ATS in the last 6 meetings in Los Angeles. https://t.co/t71tXJmOBg",
    "18": "She loves the Lakers more than the city of Los Angeles. #Junt https://t.co/EH6TyjOztL",
    "19": "Lakers making the playoffs or nah? \n\n#nba #nbamemes #lakers #lakernation #losangeleslakers #lebronjames #lebron #russellwestbrook #anthonydavis https://t.co/SNBhbf9skR",
    "20": "@ABC7 @RamsNFL Nice look for the 🐏 super bowl victory who’s house 🐏  house! Los Angeles city of champions ! Hopefully one day soon the Los Angeles Lakers and Dodgers can get a parade also they deserve it",
    "21": "According to my instagram it has been only 70 weeks since I was in downtown Los Angeles celebrating the Lakers championship, screaming from the top of my lungs completely out of my mind. I really miss my 2019-2020 Lakers",
    "22": "Wednesday Work https://t.co/EXQklMz0Xf",
    "23": "🏀 Utah Jazz(-5.5) @ Los Angeles Lakers(+5.5)\n\n⌚ 10 PM ET\n\nO/U: 226\n\n🔥 Jazz are 5-0 ATS in their last 5 games overall.\n.\nBet #BTC ➡️ https://t.co/spMiJIy3iL\n\n#NBABetting #NBAPicks #SportsBetting #BitcoinBetting https://t.co/PlTUrHyucA",
    "24": "Los Angeles Lakers Vs. Utah Jazz Live Play By Play &amp; Reaction https://t.co/zIO1F1rYHt",
    "25": "OTD 2/16/1963 Wilt Chamberlain scores 56 points \n56 Points\n21 Rebounds\n58 Minutes \n13/20 fg 6/13 ft\n1 of 664 career 20/20 games\n1 of 73 career 55+ points games\nSan Francisco Warriors 122\nLos Angeles Lakers 118\nat Los Angeles Memorial Sports Arena\n#NBA #Warriors #WiltChamberlain",
    "26": "Los Angeles Lakers: 4 potential buyout targets to avoid at all costs – Lakers News https://t.co/3H081205j8",
    "27": "@JadaMontemarano THERE ARE NO RAMS FANS🤣 that is just a fact. Los Angeles only cares about the Lakers and Dodgers. New York is a different story! #TogetherBlue",
    "28": "The skidding Los Angeles Lakers are tipped as the underdogs in tonight's clash with the Utah Jazz at the https://t.co/u4ql0Ra51r Arena 👀 \n\n#NBA #LakeShow #TakeNote\nhttps://t.co/Xnl6CjX0cE",
    "29": "Can the Jazz extend their win streak to 7 games? @IamDrewNorton gives us his preview of their matchup against the 9th place Los Angeles Lakers. https://t.co/zG2y0Z3HC5 #NBA #LakeShow #TakeNote",
    "30": "@latimes Nice to see the Lakers and Dodger fans jump on the bandwagon🥴",
    "31": "ALERT: New high roller bet posted!\nA bet has been placed for $11,279.92 on Los Angeles Lakers - Utah Jazz to win $17,483.88.\nTo view this bet or copy it https://t.co/ncAn9NiqnK https://t.co/vM9nh8GgAx",
    "32": "RAMS VICTORY PARADE: Today the LA Rams held the first championship victory parade in the city of Los Angeles since 2014, after the pandemic forced the LA Lakers and Dodgers to cancel parades in 2020. https://t.co/oMt2TY3FdH",
    "33": "Los Angeles Lakers",
    "34": "2019-20 Panini Mosaic Basketball Lebron James PSA 10 Gem Mint Los Angeles Lakers - https://t.co/16e01r3aDe\n\n#lebron #lebronjames #lakers #nba \nhttps://t.co/T5ABWOvngT",
    "35": "Los Angeles is Kobe’s Town!!!!!!!! Lakers are Kobe’s team!!!!!! Legendary is his Name!!!!!!! https://t.co/Ucu6IMwBzH",
    "36": "NBA Betting Preview: Los Angeles Lakers vs. Utah Jazz - Wednesday, Feb. 16, 2022 https://t.co/Da4AUWWZnx",
    "37": "@s24taofeek Yes the Lakers were good back before Magic they were more just a local Los Angeles supported team. Magic been a fan favorite of BLK people all over the country while at Michigan State U had new Blk fans from around the country becoming Lakers fans that have lasted to today.",
    "38": "@ib2_real @latimes Great day for L.A.. Dodger, Lakers, &amp; now Rams bring us a championship! Since the first two lacked a parade, I had to play a little hookie today. https://t.co/a7s6jEKX7b",
    "39": "GAMEDAY!📍\n-\nThe Los Angeles Lakers will take on the Utah Jazz tonight at 7:00 PM PST in the https://t.co/8kT67grctA Arena. 💜💛\n-\nWho do you think will win this game tonight? 🤔 \n- \nFollow @lalakersquad for more! 🔥 https://t.co/xuBFnwlk8a",
    "40": "Keep an eye on Tristan Thompson for the Los Angeles Lakers should he hit the buyout market.  https://t.co/JdrLsYbc0c",
    "41": "The #LosAngelesLakers are a team to keep an eye on, if #TristanThompson secures a buyout with the #IndianaPacers, Michael Scotto of HoopsHype.\n\n#VNdesign https://t.co/bSMlVwM3pV",
    "42": "WHY? It’s THE RAMS DAY! Not the losing Lakers or the didn’t win the WS Dodgers. IT’S THE LOS ANGELES RAMS DAY! LET THEM ENJOY THIS!",
    "43": "@latimes Lakers too.  😂😂🤡",
    "44": "3 TEAM DREAM⭐️\n\nAtlanta Hawks -6 \nIndiana Pacers ML\nLos Angeles Lakers ML\n\na parlay put together by myself &amp; @nappykoolaid 🥤🐮 https://t.co/kRgO3fxivc",
    "45": "LeBron James wants Rams' parade to be for Lakers and Dodgers too https://t.co/KNVk4jq7Gz",
    "46": "We're LIVE on YouTube with @VinceGoodwill who thinks LeBron James regrets bringing Russell Westbrook to the Los Angeles Lakers  #TheRightTime - https://t.co/N1QCiSd1BD",
    "47": "The Only Thing Stopping Me From Captaining The Los Angeles Lakers Is My Brave Support Of Human Rights https://t.co/G2eky2Gycr",
    "48": "We're LIVE with a new episode of #TheRightTime with @bomani_jones with @VinceGoodwill, who thinks LeBron James regrets bringing Russell Westbrook to the Los Angeles Lakers - @YouTube https://t.co/HxjcNlYd2G and on @Spotify - https://t.co/zkFcUrca8k",
    "49": "[📺LIVE - 04H00] 🏀#NBA \nUtah #Jazz @ Los Angeles #Lakers en direct sur beIN SPORTS 1\n#NBAextra",
    "50": "The small number of Rams fans at their championship parade is not surprising. Other Los Angeles teams have been able to build up equity and support for much longer. My list of LA teams by fan support \n1) Lakers\n2) Dodgers\n3) USC Football\n4) Rams\n5) Kings\n6) UCLA\n7) Clippers",
    "51": "@brianmwise @latimes @BillPlaschke Lakers and Dodgers didn’t have parades because of COVID, which is why the idea of sharing was brought up. But I agree let the Rams have their parade, dodgers and lakers was 2 seasons ago.",
    "52": "With the trade deadline in the rearview, the Los Angeles Lakers have their sights set on a few interesting buyout candidates.\n\n#LakeShow | #NBATwitter | @BigTimeTimJim  https://t.co/rlog4owwX2",
    "53": "@ddpage369 @money_talks65 @Lakerscenters @GuruLakers The past. Talk about NOW. One more time; What can the Los Angeles Lakers do about this bad trade RIGHT NOW? Not last season in the playoffs which already happened, BUT RIGHT NOW...HINT AGAIN: I gave you the answers TWICE. https://t.co/OMSRxH1NXQ",
    "54": "@ATGanias Los Angeles doesn’t care about any teams besides the Dodgers and Lakers. Teams can get the city/county to chip in for a new stadium and boost their net worth (RE: Kroenke/Inglewood) but they just won’t catch on. Too much to do in the city already.",
    "55": "#NBA 🏀\nThe Utah #Jazz are searching for the 7th consecutive win when they visit the Los Angeles #Lakers\n\n#Jazz(72%) -4.5 vs #Lakers +4.5 O/U 226.0\n\nOdds 📲 https://t.co/8Pum1dYCRo https://t.co/51RodRixCj",
    "56": "@VeniceMase It’s no clear path in the city of Inglewood that is why the Los Angeles Lakers had their parade downtown LA",
    "57": "Check out Los Angeles Lakers New Era 2020 NBA Champions Locker Room 9FIFTY Adj Strapback https://t.co/1zHMRAkbpg @eBay #NBA75 #LakeShow",
    "58": "Iggy Azalea is reportedly dating Los Angeles Lakers’ Malik Monk https://t.co/aYFhidffdV",
    "59": "@latimes @BillPlaschke The day after the Lakers and Dodgers won chips 7 day avg case numbers were the following: 3,177 &amp; 4,647. The day after the Rams won the 7 day avg case number was 25,143. Deaths are higher now 2.  Someone please explain why it was safe to have a parade today but not back then.",
    "60": "Utah Jazz vs Los Angeles Lakers - NBA League | 2022 💯\n🔗 🔴Watch Live Fullᴴᴰ 👉 : https://t.co/eqZGNv7LAo ✅\n📆 :On Wednesday. February 16 /2022\n⏰ 10:00 PM",
    "61": "The Los Angeles Clippers and the Los Angeles Lakers face off next Saturday at the @cryptocomarena! 🏀\n\nBuy your tickets today: https://t.co/pyAA4ZSLHr https://t.co/lwvkUn9Dfq",
    "62": "#Utah #jazz @ Los Angeles Lakers tonight Wednesday 7pm 2/16/22\n\nVIP Premier 13 2nd row aisle center view\n\n4 tickets $160 each $640 total. way below face value of $364 each DM if serious buyer thanks\n\nspecial private section, in seat service\n\n#lakers #lakeshow #lakersnation https://t.co/BZg3NVerUY",
    "63": "LA I'm comin for you in a week or so. Trynna do some snowboarding and maybe watch my Los Angeles \"Retirement home\" Lakers play a game at the \"cryp center\". Damn that feels weird to say. And Korean bbq. And prolly my taxes. Fuck",
    "64": "The Only Thing Stopping Me From Captaining The Los Angeles Lakers Is My Brave Support Of Human Rights – NBA News https://t.co/S7qqiQ4RQE",
    "65": "LA Lakers: Lebron James: Los Angeles Rams' Super Bowl victory parade should feature #Lakers and Dodgers https://t.co/PDdFM9AHMC",
    "66": "Houston Rockets: Los Angeles Lakers Could Land John Wall In The Offseason https://t.co/H83MNJYIbA",
    "67": "The Only Thing Stopping Me From Captaining The Los Angeles Lakers Is My Brave Support Of Human Rights – Lakers News https://t.co/0NyWHLgZtF",
    "68": "Los Angeles Lakers Could Land John Wall In The Offseason – Lakers News https://t.co/1r9MyVQHBB",
    "69": "The only thing stopping me from captaining the Los Angeles Lakers is my brave support of human rights: https://t.co/wX5ubjhXBC",
    "70": "Consider this: the Los Angeles Lakers are old, slow, horrible defensively, lack shooting, have an inconsistent bench, and usually fail to meet expectations.\n\nBut they still have LeBron James and Anthony Davis... do teams want to play them in the first round of the playoffs?",
    "71": "@latimes @BillPlaschke Rose parade City of Champions float! #rams #Dodgers #Lakers #kings #cityofchampions",
    "72": "Analyzing Wednesday’s Utah Jazz at Los Angeles Lakers odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/P7l7rHGOT1",
    "73": "Utah Jazz at Los Angeles Lakers odds, picks and predictions https://t.co/kBOyMJk4lX",
    "74": "They are the New York Yankees/Los Angeles Lakers of Sunday nights https://t.co/nYoTNhgiwb",
    "75": "People shitting on the poor turnout for the parade aka people not from Los Angeles don’t understand that if this was the Dodgers or Lakers the city would be shut down. Props to the Rams but a lot of us didn’t grow up with them. Doesn’t mean im not happy nor proud for LA.",
    "76": "Check out Matt Kemp Magic Johnson Los Angeles Lakers Dodgers Sports Illustrated Magazine  https://t.co/i7DvUvHHrX via @eBay #NBA #NBA75 #NBAAllStar #NBAonTNT #WNBA #NBATwitter #thehobby #Olympics",
    "77": "2019-20 Donruss Clearly LeBron James SP Acetate #20 Los Angeles Lakers Cavs Heat - https://t.co/BZTax87qXk\n\n#lebron #lebronjames #lakers #nba \nhttps://t.co/3540wfDHRa",
    "78": "With the first pick of the 2022 NBA Draft The Los Angeles Lakers select…. 🙉🙉 https://t.co/XMYPz8gc4O",
    "79": "Now can Los Angeles, California have a parade rally for @Lakers &amp; @Dodgers  shoutout to the @RamsNFL .",
    "80": "See where the Los Angeles Lakers rank in the latest edition of Rookie Wire’s NBA power rankings.  https://t.co/2oXESYxq8d",
    "81": "Which basketball team has attended the most NBA grand finals?\n\nAnswer: Los Angeles Lakers",
    "82": "Los Angeles Lakers Kobe Bryant jersey purple size L adult NBA - https://t.co/qc0AVaTDxH\n\n#lebron #lebronjames #lakers #nba \nhttps://t.co/ORyMXuoydH",
    "83": "Did the Lakers make the right move in keeping Russell Westbrook? #LosAngelesLakers #RussellWestbrook https://t.co/zmSdYHstgk",
    "84": "@stephenasmith For this year, The Los Angeles Rams are 2021 NFL Champions, and the previous year, both The Los Angeles Dodgers and The Los Angeles Lakers were World Champions in 2020. All three sports have a championship for Los Angeles in this decade. GO LOS ANGELES!",
    "85": "The Utah Jazz will be taking on the Los Angeles Lakers tonight, February 16 at the https://t.co/LDv6GK7Yb0 Arena in Los Angeles, California.\n\nSpread picks and previews ➡️ https://t.co/dcJNqvC9rm\n\n#NBA #NBA75 #betnowEU #NBA2K22 #nbatopshot #NBAAllStar #NBAAllStarVote #NBATopShot https://t.co/wdibKmaisj",
    "86": "BAG EM ALL OR BREAK EM UP\nBAG EM &amp; SAVE!\nLebron James 2019-20 Panini Mosaic Base Card #8 (Lot of 5)\nLos Angeles Lakers\n#TradingCards @sportscards @CardboardEchoes @Sportscards4U @Hobby_Connector @yourcardxchange https://t.co/rRqzvWQmgz",
    "87": "For this year, The Los Angeles Rams are 2021 NFL Champions, and the previous year, both The Los Angeles Dodgers and The Los Angeles Lakers were World Champions in 2020. All three sports have a championship for Los Angeles in this decade. GO LOS ANGELES!",
    "88": "@latimes @BillPlaschke No BUT the Dodgers and Lakers deserve their parade",
    "89": "THEY DONT HAVE FANS. It’s fucking LOS ANGELES, and they’re not the Lakers. https://t.co/xtBuhGHOJQ",
    "90": "The Los Angeles Dodgers and Los Angeles Lakers Parade would’ve been 20 times bigger than this one. As a salty Chargers Fan, thanks for bringing the Lombardi back to LA",
    "91": "See you tonight. #LakeShow https://t.co/0dPN9UKzhK",
    "92": "LEBRON JAMES Los Angeles Lakers 4x NBA Champion Bobblehead #'d/504 Sold Out 🔥 https://t.co/vuyW1nP3Gc eBay https://t.co/2bidU0SzFV",
    "93": "The Lakers and Dodgers 2020 championships deserved a damn parade in Los Angeles. #LakeShow",
    "94": "@latimes @BillPlaschke I mean, did the Lakers and the Dodgers share their World Series and NBA Championship parades with the Rams? \n\nThanks mom, but no.",
    "95": "Los Angeles Lakers Predictions and Preview for 2/16/2022 hosts Utah Jazz.  Find out who we are taking in this matchup. #NBA #SportsBetting https://t.co/KoO3tpv1mt",
    "96": "Should the Rams have shared their parade with the #Dodgers and #Lakers? @BillPlaschke weighed in\n \nhttps://t.co/rm1ahKHTCk",
    "97": "@sm1thjord4n @chrislewisASU @AndrewLeezus @StatsBySTATS 1970-71 Milwaukee Bucks and 1999-2000 Los Angeles Lakers are the only teams with 3 double-digit win streaks in a season that ended in a championship.\nThe other 4 teams didn't even make it to the Finals.",
    "98": "@SportsVanessa Los Angeles is a Dodgers and Lakers town. They didn't care about the Rams before they moved to St. Louis. They still don't. Still not sure why the NFL wants two teams in LA. They need to find a way to move the Chargers back to San Diego.",
    "99": "One more before the break.\n\n⏰: 7:00 p.m. PT\n📺: @SpectrumSN &amp; ESPN\n📻: ESPN LA 710 &amp; 1330 KWKW\n\n#LakeShow x @SociosUSA \nhttps://t.co/ChONZ4hfHN",
    "100": "Tonight, the red-hot Utah Jazz face off against the struggling Los Angeles Lakers.\n\n#TakeNote \n#LakeShow \n📊 Game Total\n\n(Odds presented by @betonline_ag) https://t.co/UGztkey6sg",
    "101": "#NBA75- #NBA: #LosAngelesLakers/#UtahJazz; Who U got-#Lakers/#Jazz?\n@Lakers \n@utahjazz \n@ESPNNBA \n@NBA",
    "102": "Oof, Garcetti. 😆 This is not the #LARams' city yet. Los Angeles belongs to the Lakers and is now even close. \n#LakeShow",
    "103": "I just added “Utah Jazz vs Los Angeles Lakers Prediction 2/16/22 - Free NBA Picks” to Free NBA Picks on #Vimeo: https://t.co/8pHkJPZZfS",
    "104": "Congratulations to AntonioKey and www_nba who moved up to take #19 and #51 on the Los Angeles Lakers team leaderboard.\n\nhttps://t.co/7jbi1baNWE",
    "105": "2 for 1 drinks in Los Angeles for St. Patricks Day and one of the hottest up and coming acts in town at the Viper Room!  https://t.co/Ukwt4AXUSm  #LosAngeles #losangelesart #losangelesfashion #losangeleslakers #losangelesmusic #LosAngelesModel",
    "106": "Which basketball team has attended the most NBA grand finals?\n\nA: Boston Celtics\nB: Golden State Warriors\nC: Philadelphia 76ers\nD: Los Angeles Lakers",
    "107": "After Kobe Bryant died everyone in Los Angeles chanted, “Let’s do it for Kobe!” Since then, the Lakers won the NBA Championship, Dodgers won the World Series &amp; Rams just won the Super Bowl.",
    "108": "Hey Los Angeles! Our purple and gold are taking on Utah TONIGHT at HOME at 7 PM. Double-tap if you're excited! 💜 💛  \n\n#LakerNation #Lakers #GameDay #GoLakers https://t.co/KbfBYKK2Mr",
    "109": "NBA Basketball Game Betting Picks Simulator: 10:10 PM ET - Utah Jazz vs. Los Angeles Lakers - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/AtwCNuMBr6 #nba #sportsbetting #freepicks #cappertek",
    "110": "@ThePettiestLA Rams don't exactly have the fan base the Lakers and Dodgers have as well. I know it's Los Angeles, but people gotta realize, they're not the Lakers or Dodgers.",
    "111": "2022-02-16 : #NBA #Basketball : #UtahJazz @ #LosAngelesLakers Basketball Match Pick Link: https://t.co/M6ofcldX14",
    "112": "Check out Lebron James Los Angeles Lakers NBA Auto Holographic 11”x14” Photo Matted https://t.co/su0EMOWKF3 @eBay",
    "113": "Check out Kobe Bryant Los Angeles Lakers NBA Holographic 11\"x14\" Engraved Matted Frame https://t.co/Nk47ddFaua @eBay",
    "114": "Lol LA is a Laker and Dodger town. Football wise Los Angeles only loved the Raiders and the USC Trojans. Raider left. USC sunk after Carroll left.\n🏀⚾️\n#LosAngeles #lakers #dodgers #rams #RamsHouse #hollywood https://t.co/0qyHtcMdFm",
    "115": "@JimmySpencer I was in the Bay for the 2010, 2012, 2014 Giants and the 2015 Warriors.\n\nI have been in Los Angeles for the 2020 Lakers*, 2020 Dodgers* and now 2021 Rams.\n\nI am not saying it’s about me, but what do you guys think?\n\n*Covid-shortened fake seasons\n\nFixed that for you.",
    "116": "@PeteAbe Los Angeles is a Lakers town first. Dodgers second. People will bandwagon the Clippers when they're occasionally winning. Kings have a small but very dedicated fan base. Rams haven't even approached that level yet. And the Chargers might as well still play in San Diego.",
    "117": "L.A. Rams celebrate at their first Super Bowl parade (Los Angeles Times)\n\nRams fans got do something the Lakers and Dodgers could only dream about - celebrate with a ...\n\nAdd your highlights:\nhttps://t.co/cFZd0yEyUB\n #LA #LosAngeles",
    "118": "The Lakers should do whatever they have to do to get him in Los Angeles next year. https://t.co/WEuzRZKCHr",
    "119": "@LakeShowYo I can't believe the Los Angeles Lakers took 5 of Milwaukee's championships and claimed them \nas their own! 😂 Who does that?",
    "120": "I just uploaded “Utah Jazz vs Los Angeles Lakers Prediction 2 16 22 - Free NBA Picks” to #Vimeo: https://t.co/iWJp7L8EKh",
    "121": "@LakeShowYo Maybe the Lakers should consider changing \ntheir name to the Los Angeles Generals  😂☘️",
    "122": "Check out this listing I just added to my #Poshmark closet: 3D LA Lakers Mug Coffee Tea Cup NBA Lakers Basketball Yellow Vintage Los Angeles. https://t.co/sNso4sbnPP #shopmycloset @poshmarkapp",
    "123": "Check out this listing I just found on #Poshmark: Ethika Los Angeles Lakers Purple/Gold Classic Leggings Size Medium NWT. https://t.co/uBzaw2stfK #shopmycloset @poshmarkapp",
    "124": "@NFL @CooperKupp After Kobe Bryant died everyone in Los Angeles chanted, “Let’s do it for Kobe!” Since then, the Lakers won the NBA Championship, Dodgers won the World Series &amp; Rams just won the Super Bowl.",
    "125": "Usually, selling hot dogs is just a side gig on the weekends. \n\nBut during special events, Victoria Zapata is always out there. Apart from the #Rams parade, she has also sold at a Lakers parade, she said. \n\nhttps://t.co/6kv30ubO2s",
    "126": "Skip Bayless called Russell Westbrook \"psychologically damaging\" to the Los Angeles Lakers. \n\nhttps://t.co/FDr41njced",
    "127": "#NBA \n\nUtah/LA\n\nJazz are 1-5 ATS in the L6 meetings in Los Angeles\nJazz are 3-8-1 ATS in their L12 games playing on 1 days rest\nJazz are 2-6-1 ATS in their L9 road games\nLakers are 7-2 ATS in their L9 games following a loss\nLakers are 1-4 ATS in their L5 games as a home dog",
    "128": "Los Angeles will always be a Lakers and Dodgers city. All other teams are borderline irrelevant",
    "129": "The Los Angeles Lakers play host to the Utah jazz at the https://t.co/pqO1kKv0Nv Arena on Wednesday night.The Utah Jazz have been building nicely as they’ve won six in a row and they will be looking to stay hot after making light work of the lowly Rockets in a 135-101 home win on https://t.co/cz0HPnbchz",
    "130": "The Los Angeles Lakers play host to the Utah jazz at the https://t.co/aWIfjM0wYR Arena on Wednesday night.The Utah Jazz have been building nicely as they’ve won six in a row and they will be looking to stay hot after making light work of the lowly Rockets in a 135-101 home win on https://t.co/bRAImaSzeF",
    "131": "Los Angeles. 🌴 \n\nHome of the @Lakers. 🏀 \n\nHome of the @Dodgers. ⚾️ \n\nHome of @TheGrizzlyPod. 🎙 \n\nAnd Home of the \n2022 Super Bowl Champions. 🏈 \n \nCongratulations  to \nthe Los Angeles @RamsNFL 🐏 \nfor their Super Bowl 56 win! 🏆 \n \nIt’s LA All DAY, Baby! ☀️ \n\n#LosAngelesRams https://t.co/mjHHo7CtU8",
    "132": "Today in 2003: Allan Houston of the New York Knicks dropped his career-high of 53 points in a 117-110 win over the Los Angeles Lakers.\n\nKobe Bryant scored 40 in the loss. According to @Stathead, Bryant lost 43 games (regular + postseason) when he scored 40+ (3rd most all-time). https://t.co/9IKUjpgoEq",
    "133": "@Kade0510 @AustinFC The los angeles Lakers have traded the rights to a player playing in europe that isn't with the team for future cash considerations.",
    "134": "Today's NBA Picks: 10:10 PM ET - Utah Jazz vs. Los Angeles Lakers - 8 PICKS AVAILABLE: https://t.co/4aDRDV99TS #nba",
    "135": "trigger warning los angeles lakers",
    "136": "Los Angeles Rams finalize title parade, won't include Lakers or Dodgers despite LeBron James's… – Lakers News https://t.co/M9TUMHcUpu",
    "137": "January 5, 2020, the Los Angeles Lakers C rotation ended with a total of 19 blocks.\n\nAnthony Davis: 8 BLK\nJavale McGee: 6 BLK\nDwight Howard: 5 BLK\n\nother than that they combined for 23 rebounds.  💯\n\nthis trio was unstoppable, we must repeat the formula next year. 🔒 https://t.co/z9kOUJfeli",
    "138": "Joe D has a free #NBA winner in the #UtahJazz #LosAngelesLakers matchup. Go to https://t.co/Huavewb55C for all his premium winners @sportsmemo &amp; get 3 days for $39. Use code:BET39. @WagerTalk @SM_Free_Plays @JoeDamicoWins #gamblingtwitter #gambling #bet #bettingexpert #winners https://t.co/jl10Ajue7m",
    "139": "@LakersReporter @Lakers The Los Angeles Lakers me to play like a basketball team play together Play Strong defense trapping defense ant trap the ball handler which is the point guard get out of the comfort zone and play man-to-man",
    "140": "Consensus Line Move:\n2022-02-16 Utah Jazz at Los Angeles Lakers from 5.50 to 4.50\n#LakeShow who saw that coming?\n#NBA #bettingtips #data #investor",
    "141": "LA Lakers: Shameless LeBron tries to steal spotlight from Los Angeles Rams - Deadspin https://t.co/FweJIN5GM3",
    "142": "New post (Utah Jazz vs Los Angeles Lakers NBA Pick – February 16) has been published on The Sports Geek - https://t.co/4z8tJeatU7 https://t.co/DgoXfk5SQj",
    "143": "Actualizadas las cuotas al campeón de la #NBA:\n\nPhoenix Suns - 5.25\nGolden State Warriors - 5.50\nBrooklyn Nets - 6.00\nMilwaukee Bucks - 7.00\nPhiladelphia 76ers - 8.50\nMiami Heat - 11.00\nUtah Jazz - 15.00\nMemphis Grizzlies - 21.00\nChicago Bulls - 26.00\nLos Angeles Lakers - 26.00",
    "144": "2019-20 Donruss Clearly LeBron James SP Acetate #20 Los Angeles Lakers Cavs Heat - https://t.co/rAC4Xu587W\n\n#lebron #lebronjames #lakers #nba \nhttps://t.co/9CnG2A1tpd",
    "145": "THE THROWBACK RAFFLE III is now completely SOLD OUT! 👀\n.\nThank you to EVERYONE who has got involved in the 3 raffles and made them a success🙌\n.\nThe winner of this Kobe Bryant Los Angeles Lakers Jersey will be announced on IG LIVE this Saturday 19th February at 7pm (UK time)👊 https://t.co/n5Ft6VO0dY",
    "146": "Revenge Game: Jordan Clarkson plays Los Angeles tonight.  He played 273 games in his career for the Lakers.",
    "147": "Joc Pederson: Dodgers &amp; Fans Deserve World Series Parade (Dodger Blue)\n\nThe Los Angeles Dodgers and L.A. Lakers delighted their fans and city in 2020 when they each...\n\nAdd your highlights:\nhttps://t.co/btr5Q7sgFk\n #LA_Dodgers",
    "148": "Ppl! Stop talking about the “Clown Show” known as the Los Angeles Lakers. This team is an embarrassment to the NBA. I predict those old men will be watching the playoffs in their rocking chairs. This is the worst Laker team I’ve had ever seen. Enjoy the Clown Show while it last. https://t.co/ekyCSePJYl",
    "149": "🚨 Line Change 🚨\n\nUtah Jazz @ Los Angeles Lakers\nWed 10:10 PM EST\n\nFrom:\nLAL 5.5 -110\n\nTo:\nLAL 4.5 -110",
    "150": "The Los Angeles Lakers had an offer from the Houston Rockets of John Wall for Russell Westbrook that would not have included their 2027 first round pick. The Lakers reportedly were not ready to give up on the idea of the team figuring out to play with Westbrook.",
    "151": "Congratulations to Wilt100 (@TopShotWilt) and nowbrewing who moved up to take #25 and #98 on the Los Angeles Lakers team leaderboard.\n\nhttps://t.co/7jbi1baNWE",
    "152": "The Los Angeles Lakers won the Championship inside of a Bubble.\n\nWith this being the case, it would only be fair for their Championship Parade to also be inside of a Bubble. \n\n#NBA @KingJames #Bubble @Lakers #LA #AdamSilver\n\nhttps://t.co/yphxe0ybGy https://t.co/PEJKllKbt5",
    "153": "GAMEDAY.\n\n🏀 LOS ANGELES LAKERS 🆚 Utah Jazz.\n\n🏟️: Cryptocom Arena.\n\n⏱️ 00:00 (🇦🇷/🇧🇷/🇺🇾/🇨🇱/🇵🇾)\n⏱️ 23:00 (🇧🇴/🇻🇪/ 🇩🇴/🇵🇷)\n⏱️ 22:00 (🇨🇴/🇵🇪/🇪🇨/🇵🇦/🇨🇺)\n⏱️ 21:00 (🇲🇽)\n⏱️ 04:00  (🇪🇸)\n\n📺: ESPN.\n💻/📱 NBA League Pass. https://t.co/vfwIBFfZz2",
    "154": "LOCKED ON JAZZ - Utah Jazz fans got distracted, is this they hey day of the NBA, the top 10 players in the NBA (who you leaving off) why the Los Angeles Lakers are bad - https://t.co/ogn6Fo1dpe",
    "155": "Through games on Feb. 15, which members of the Los Angeles Lakers have done the most (or least) with their minutes during the 2021-22 NBA season, per TPA? \n\nFull data on @SportsMathNet: https://t.co/ktinOKZ7ii https://t.co/60YBDRN9tI",
    "156": "DasHaus made a bet!\n\nEvent: Utah Jazz vs Los Angeles Lakers #NBA\nBet: Los Angeles Lakers TO WIN +5.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "157": "DasHaus made a bet!\n\nEvent: Utah Jazz vs Los Angeles Lakers #NBA\nBet: Utah Jazz TO WIN -5.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "158": "Bomber Los Angeles #Lakers Jacket.\n-----------------------------------\n►Shop Now Click on Link◄\nhttps://t.co/rtn3k43FOa https://t.co/Txd825M4qw",
    "159": "Los Angeles lakers \nChicago bulls\nSince the day I seen my first basketbal game",
    "160": "Early NBA Leans : \n\nHawks -6\nBulls  ML\nBrooklyn Nets ML\nBrooklyn / Knicks Under \nBoston Celtics -13 \nMemphis -11 ( Ja Plays ) \nMemphis / Portland Over \nOKC / Spurs  Over \nLos Angeles Lakers ML",
    "161": "On this date in 1992, the Los Angeles Lakers retire Magic Johnson's #32. Also, Larry Bird. \n\n https://t.co/4aR3kS0UiY",
    "162": "Way too many people saying the Los Angeles Lakers will not be in the playoffs because of a 26-31 record. Are the same fanboys who like Lebron James but why count out the “best player” in the league?",
    "163": "Live edition of LOCKED ON JAZZ starts in moments on @YouTube - https://t.co/uNEvvdAZxR\n\n*  Utah Jazz fans have gotten distracted from what matters\n*  Is this they hey day of the NBA right now\n*  Why are the Los Angeles Lakers bad\n\nPlus your questions and an active chat room",
    "164": "Utah Jazz vs  Los Angeles Lakers Prediction 2/16/22 -  Free NBA Picks https://t.co/ZRFiDUst0y via @YouTube \n\n#NBA #NBAPick #NBAPrediction #basketball",
    "165": "Check out 2019 Panini Chronicles Lebron James Los Angeles Lakers Basketball Card #86 PSA 9 https://t.co/k6LIxeyxER @eBay",
    "166": "Wednesday’s parade in downtown Los Angeles provides an opportunity for the Rams to align themselves with the Lakers and Dodgers, the two most popular teams in the city. Will they take advantage of it? https://t.co/nJmcxhEK4F",
    "167": "Tonight's NBA Wednesday double-header: \n\nBrooklyn Nets @ New York Knicks tonight at 7:30pm ET on ESPN. \n\nUtah Jazz @ Los Angeles Lakers tonight at 10pm ET on ESPN. https://t.co/7yWY7FGvjy",
    "168": "Los Angeles Lakers. I fucking hate that team https://t.co/6j5w0vuryD",
    "169": "Kobe Bryant of the Los Angeles Lakers scored 40 Points in that game.",
    "170": "On this day in sports history February 16, New York Knicks Shooting Guard Allan Houston scored 53 Points in a 117-110 win against the Los Angeles Lakers in 2003.",
    "171": "Los angeles lakers play basketball today",
    "172": "@AyeAyeRon710 @NBA Los Angeles Lakers favorite athlete Kobe Bryant",
    "173": "On this day in sports history February 16, Magic Johnson’s #32 jersey was retired by the Los Angeles Lakers in 1992.",
    "174": "On this day in sports history February 16, San Francisco Warriors Center Wilt Chamberlain recorded 56 Points and 21 Rebounds in a 122-118 Double OT win against the Los Angeles Lakers in 1963.",
    "175": "On this day in sports history February 16, Los Angeles Lakers Small Forward Elgin Baylor recorded 57 Points and 26 Rebounds in a 129-106 win against the Detroit Pistons in 1961.",
    "176": "🏀NBA VALUEBET🏀\n\n🇺🇸NBA\n🏀Los Angeles Lakers - Utah Jazz\n\nMarket: Full Time Result 2\nOdd: 1.7\nAverage Odd: 1.62\nValue: 4.78%\n\nVisit our website if you want to know which bookmaker offers the highest odd.\n\nhttps://t.co/mCZaitC4er\n\n#sportsbetting #bettingtwitter #valuebets #nbatips https://t.co/u7Flak6NGy",
    "177": "#OTD Feb 16, 1972: Wilt Chamberlain scores his 30,000th point in a basketball game between the Los Angeles Lakers and the Phoenix Suns. He is the 1st player to score 30,000 points. \n#History #NBA https://t.co/5717vv3FgU",
    "178": "Consensus Line Move:\n2022-02-16 Utah Jazz at Los Angeles Lakers from 4.50 to 5.50\n#TakeNote market flood\n#NBA #parlay #tech #forex",
    "179": "Utah #Jazz vs Los Angeles #Lakers  | 2|16|22 | NBA  Free Picks and Predictions | NBA Betting tips. \n\nWatch: https://t.co/kgoXJdTnoO\n\n#NBA #NBAPick #NBAPredictions #jazzvslakers",
    "180": "🚨 Line Change 🚨\n\nUtah Jazz @ Los Angeles Lakers\nWed 10:10 PM EST\n\nFrom:\nLAL 4.5 -110\n\nTo:\nLAL 5.5 -110",
    "181": "Shameless LeBron tries to steal spotlight from Los Angeles Rams.  Shameless???? It was just à proposal not a must. I do not understand why the Lakers and Dodgers cannot organize their own . What are their owners doing . They deserved it  https://t.co/IhRQzGtd6J",
    "182": "Twitter user @Z2Kame of the Los Angeles Lakers has something to say about @WashedTraruso's signing the extension: \"Ok\".",
    "183": "carmelo anthony to los angeles lakers espn first take  https://t.co/719KRS69R5",
    "184": "🏀🏀Lebron James PSA 9 MINT 2019 Mosaic #8 LA Los Angeles Lakers Basketball Card - https://t.co/k7lhBzHAJJ\n\n#lebron #lebronjames #lakers #nba \nhttps://t.co/u8fdg7sOLI",
    "185": ".@Sothebys will accept crypto payment for sports memorabilia #NFT sale for the first time. The item in question is a shooting shirt from Los Angeles Lakers basketball player Kobe Bryant.\n\nhttps://t.co/hPJCTuTYE3",
    "186": "Sotheby's Auctions Kobe Bryant's Los Angeles Lakers Shooting Shirt From Legendary 81-Point Game - #naijaforum #naijablog #naijamusic - https://t.co/xZEhXWSPmG https://t.co/hu1Hcd4xSB",
    "187": "See where the Los Angeles Lakers rank in the latest edition of Rookie Wire’s NBA power rankings.  https://t.co/11RrrWyv2y",
    "188": "Unused 5-man lineups the Los Angeles Lakers should experiment with https://t.co/kPI92CU5Fc Howard,AD,Lebron,Monk and Westbrook is the best 5 man line up. They need Center for rebound and second or third chance points when they are in the offensive end.",
    "189": "#OTD in 1972.\n\nWilt Chamberlain of the Los Angeles Lakers becomes the first player in NBA history to reach the career 30,000 point mark during a 110-109 loss to the Phoenix Suns.\n\n@Lakers \n\n🏀",
    "190": "LA Lakers: Utah Jazz vs Los Angeles #Lakers 2/16/22: Starting Lineups, Matchup Preview, Betting Odds ... https://t.co/FweJIN5GM3",
    "191": "Utah Jazz @ Los Angeles Lakers: Spread Betting for Utah Jazz from -5.0 to -4.5",
    "192": "Los Angeles Lakers basketball player Kobe Bryant's shooting jersey will sell for a starting price of $200,000, Sotheby's said Tuesday.  Sotheby's will accept final payment of ETH, BTC, USDC and fiat currency",
    "193": "the los angeles lakers franchise without free agents and the LA glamour: https://t.co/DrN96OwLtD",
    "194": "via HYPEBEAST: \n\"Sotheby's Auctions Kobe Bryant's Los Angeles Lakers Shooting Shirt From Legendary 81-Point Game\" \nLink: https://t.co/33OJypf2og",
    "195": "Sotheby's Auctions Kobe Bryant's Los Angeles Lakers Shooting Shirt From Legendary 81-Point Game – Lakers News https://t.co/sZVJNuoTly",
    "196": "Sotheby's Auctions Kobe Bryant's Los Angeles Lakers Shooting Shirt From Legendary 81-Point Game – NBA News https://t.co/CBMbmAn2J6",
    "197": "IGS 7-7.5 Los Angeles Lakers - 2002 NBA Finals 3 peat Kobe Shaq sports VHS   https://t.co/XKj9mR3s2T   🎞️ https://t.co/jA7wnjoi8m",
    "198": "🏀Today's (Feb 16) NBA Prediction\n\nNew York Knicks vs Brooklyn Nets\n\nLos Angeles Lakers vs Utah Jazz\n\nGolden State Warriors vs Denver Nuggets\n\nand other games...\n\nClick here 2 get what you want:\n\nhttps://t.co/QXDZTQBxMy\n\n #NBA #NBA75 #NBAPicks #Warriors #Lakers #Nets #Nuggets https://t.co/FmqMXUvqT3",
    "199": "Golden State Warriors vs Los Angeles Lakers was on DAZN Schweiz [$] (geo/R). With commentary from Flo Pertsch.  For more details see https://t.co/SqVoTgO2vR #GoldenStateWarriors #LosAngelesLakers #DAZNSchweizgeoR",
    "200": "Lebron James Los Angeles Lakers Purple Jersey Shirt #23 Stars - https://t.co/ReO2QtIux4\n\n#lebron #lebronjames #lakers #nba \nhttps://t.co/DV14uADhYT",
    "201": "Tim Bontemps: “The Lakers’ season looks lost” #LosAngelesLakers https://t.co/EwY52c6nrK",
    "202": "Orlando Magic - Atlanta Hawks\nBoston Celtics - Detroit Pistons\nMemphis Grizzlies - Portland Trail Blazers\nChicago Bulls - Sacramento Kings\nPhoenix Suns - Houston Rockets\nLos Angeles Lakers - Utah Jazz\n\nBet slip link: https://t.co/RsqQIjpoAG https://t.co/pYaHYDndz9",
    "203": "#Today #16February #Year1972\nNBA Record:\nWilt Chamberlain of the Los Angeles Lakers becomes first player in NBA history to reach the career 30,000 point mark during a 110-109 loss to the Phoenix Suns\nKnow more at : https://t.co/D0ze9H6VC2 https://t.co/18KygSBSbv",
    "204": "- 1991 Saturday: Tonya Harding wins the U.S. Female Skating Championship on this date.\n- 1992 Sunday: The Los Angeles Lakers retire Magic Johnson’s #32 jersey.\n- 1994 Wednesday: More than 200 people lost their lives when a powerful earthquake shook Indonesia’s Sumatra Island.",
    "205": "With a 26-31 record right now (.456), will the Los Angeles Lakers get over .500 again this 2021-22 season?",
    "206": "I love my #Dodgers and #Lakers but some of their fans are bandwagon fans for outsiders like the #Cowboys #49ers and #Raiders. I really don’t want those fans at our Los Angeles Rams Super Bowl championship parade.",
    "207": "Here’s why Lakers are struggling in defense #LosAngelesLakers https://t.co/nGpxwnUm7h",
    "208": "Golden State Warriors - Denver Nuggets\nLos Angeles Lakers - Utah Jazz\n\nBet slip link: https://t.co/bDUnJkanvj https://t.co/hxHwSTKJ3P",
    "209": "@seanmarksburn3r sources say harden has been looking out multiple teams such as the miami heat, los angeles lakers, should everything not go his way 💀😂😂😂😂😂",
    "210": "Frank Vogel on Lakers’ starting lineup going forward #FrankVogel #LosAngelesLakers https://t.co/ISgDp9ylpw",
    "211": "February 16, 1972 Wilt Chamberlain of the Los Angeles Lakers becomes first player in NBA history to reach the career 30,000 point mark during a 110-109 loss to the Phoenix Suns #Today #OnThisDate #People #History #Event #Now #PR https://t.co/sFwYvxUAKq",
    "212": "3 reasons why the Los Angeles Lakers should sign Tyreke Evans https://t.co/LOfCToF10n",
    "213": "@WolvesGotNext There has been analysts that believe the Minnesota Tiberwolves would beat the Los Angeles Lakers in the play in tournament, sources tell ESPN.",
    "214": "Los Angeles Lakers have the second worst record in last 10 games at the moment. Rockets are worst than them with 1-9.",
    "215": "Congratulations to Galactus (@GalactusNBA) and sea_slug4180 who moved up to take #4 and #55 on the Los Angeles Lakers team leaderboard.\n\nhttps://t.co/7jbi1baNWE",
    "216": "Los Angeles Lakers Kobe Bryant jersey purple size L adult NBA - https://t.co/HrPeqjaQEZ\n\n#lebron #lebronjames #lakers #nba \nhttps://t.co/353PZiuhe4",
    "217": "Out of the 191 meetings that took place between the Lakers and the Jazz; the Los Angeles Lakers have put up a total of 19,106 points overall. What will happen tomorrow night against Utah? Will the Lakers prevail again and stop their losing streak? Or, will this game snowball?",
    "218": "@mikkyjwright Eh? They moved to Montecito, which is 1 hour 30 min away from Los Angeles. Two different cities. Besides, these teams have won championship because of their REVENUE. The Dodgers, La Lakers and Rams are on the top teams with most revenue. Quit the nonsense 🤡 https://t.co/TzaE82xVgM",
    "219": "Stop spreading false internet rumors. This is why the left makes fun of us and I don't blame them: \n“Rittenhouse has not filed a defamation suit against the Los Angeles Lakers star or anyone else, his spokesperson told The Associated Press”\nhttps://t.co/o56yEribVS https://t.co/8yDLguiGtQ",
    "220": "@KAT24xi1 FLASE: \nRittenhouse has not filed a defamation suit against the Los Angeles Lakers star or anyone else, his spokesperson told The Associated Press.\n\nhttps://t.co/o56yEribVS",
    "221": "@HunterdonMan @f_rymur FALSE: Rittenhouse has not filed a defamation suit against the Los Angeles Lakers star or anyone else, his spokesperson told The Associated Press.\nhttps://t.co/o56yEribVS",
    "222": "Los Angeles Lakers Tribute Mix 2020 || HD || https://t.co/Hg6B94c2CO via @YouTube",
    "223": "@wojespn No one wants to join the Los Angeles Lakers. They're not getting anyone significant from the buyout market. This season is a wash and any Laker fan that thinks differently is delusional. We made  our bed for the season....🤮🤮🤮🤮🤮 #LakeShow  #Lakers #LakerNation #NBA75",
    "224": "No one wants to join the Los Angeles Lakers. They're not getting anyone significant from the buyout market. This season is a wash and any Laker fan that thinks differently is delusional. We made  our bed for the season....🤮🤮🤮🤮🤮 #LakeShow #Lakers #LakerNation #NBA75 https://t.co/Vw0kgKXdRs",
    "225": "NBA Los Angeles Lakers Lebron James Jersey #6 Purple And Yellow Sz Large New - https://t.co/KQnvaNaLot\n\n#lebron #lebronjames #lakers #nba \nhttps://t.co/ItFRdZy6zJ",
    "226": "LA Lakers: #Lakers: Anthony Davis Shoulders the Blame With Los Angeles' Free Throw Issues - Sports Illustrated https://t.co/PDdFM9AHMC",
    "227": "Boston Celtics              34-25\nLos Angeles Lakers      26-31 \nNew York Knicks           25-33\n\n28 days later..."
}