{
    "0": "@russ48239 @PistonsThoughts Trust me, if the #Pistons build the right way, a lot more superstars will join them in FA and many more disgruntled superstars will green-light a trade to Detroit.\n\nThey're still too early in the process to make a move, after all. The best way is to wait until Cade's prime years.",
    "1": "@officialpollss @DetroitPistons @Kia He plays great defense.  Not many guys are able or wiling to do that.  \n\nI'd give him a couple years to see if he can figure it out.  Having a defense first PG makes sense as a partner to Cade (a college PG moved to NBA combo guard).",
    "2": "Poor Pistons fans already have the worst team in the league and now they can’t even watch Steph Curry play in the Warriors one road game in Detroit this season because he’s being load managed.",
    "3": "@officialpollss @DetroitPistons @Kia Never",
    "4": "#NBA #NBATwitter Today's Lineups\n\n#DubNation\nGolden State Warriors Starting 5:\nGary Payton II\nJordan Poole\nAndrew Wiggins \nJuan Toscano-Anderson\nKevon Looney\n\n#Pistons \nDetroit Pistons Starting 5:\nKillian Hayes\nCade Cunningham\nSaddiq Bey\nJerami Grant\nIsaiah Stewart",
    "5": "Bird locks are back! Detroit Pistons ML +105 🔒🤑 #Pistons #betmgm",
    "6": "This why I enjoy @nbagleague games them boys go ball, spend $500 for the @warriors @DetroitPistons game all the back ups playing.",
    "7": "@DetroitPistons @Kia Holy W",
    "8": "@DetroitPistons @Kia LETSSS GOOOO",
    "9": "Friday Night Five 🌟 \n\n@Kia | #Pistons https://t.co/Fu1Zxv7Yzo",
    "10": "Orlando Magic +9.5\nDetroit Pistons  +2  11/19",
    "11": "The @DetroitPistons starting Hayes, Cunningham, Bey, Grant, Stewart on Friday. #DetroitBasketball #NBA",
    "12": "Golden State Warriors (-1.5) @ Detroit Pistons! #Pistons #DubNation #NBA #NBATwitter #NBA75",
    "13": "Part 1 of tour of Detroit’s Little Caesars Arena. An exterior shot including banners of current Pistons and Wings and murals of 5 motor city legends concluding with a look at the beginning of the south atrium https://t.co/ASTNq43dZO",
    "14": "@CadePistons @DetroitPistons @HenryFordNews Warriors still no joke. I am looking forward to the game!",
    "15": "Shoutout to all the @DetroitPistons fans who overpaid to see Steph tonight and he’s not playing #beenthere @nba failing us once again",
    "16": "Despite being without Steph, Draymond, and Iggy, the Warriors are still favored on the road(-2 at Detroit). Anybody willing to take the Pistons tonight? https://t.co/EJZfLugpAm",
    "17": "My hearts gone cold I'm wondering why I came out to Detroit Basketball\nThe morning I wonder will it be the day @DetroitPistons follow, prob not at all\nPut your framed memorabilia on my wall\nIt reminds me, that it's not so bad\nIt's not so bad\n#PistonsStan https://t.co/wgl8snXbTo",
    "18": "Warriors' game against Detroit tonight is huge. No Steph, Draymond, Iggy, or Porter. Klay and Wiseman still out. Pistons almost full healthy and won 2/3 past games. If Warriors look competent without the core i.e. can they run the system at all w/o Steph and Draymond, it's HUGE.",
    "19": "@docmasse @DetroitPistons I get it",
    "20": "Up in the Suites for tonight’s game, The D vs. The Bay! Cade vs. Steph! Let’s go @DetroitPistons #DetroitPistons #Pistons https://t.co/obiUElTAGQ",
    "21": "#NBA | Detroit Pistons vs Golden State Warriors is about to begin!\nBET NOW:\nhttps://t.co/IT7pYFdaVg https://t.co/wodVP4Sopg",
    "22": "@emarion00339281 @DetroitPistons @HenryFordNews True",
    "23": "#NBA | HEEEEY! Ready for another NBA night?\nDetroit Pistons vs Golden State Warriors is about to begin!\nBET NOW:\nhttps://t.co/0rTJpgSrdP https://t.co/RolPcfDF9T",
    "24": "Randolph Childress was acquired from Detroit in '95; he avg'd 2 pts/1 asst in 1+ seasons with Portland before returning to the Pistons in a '97 trade! Childress is now an asst coach for his alma mater, Wake Forest!\n\nBidding starts at $5 for this '95-96 Franz card!\n\n#RipCity https://t.co/EIG0sf3gcM",
    "25": "Golden State Warriors Vs Detroit Pistons | Live Reactions And Play By Play https://t.co/pbU1Yyv8wm via @YouTube",
    "26": "@honestsportz @DetroitPistons @DiscountTire @PistonsDancers All them damn random ass teams pick a city",
    "27": "You kidding me?!!\n\nCame to the @DetroitPistons game tonight to find out the entire reason I came isn’t even going to play. \n\n@StephenCurry30 and the @warriors think the pistons are so easy that he doesn’t need to play…but what about the fans from #michigan who came to see u?",
    "28": "GP2 has to hit a 3 pointer tonight against the Detroit Pistons. Warriors without Steph and Draymond opens up the floor.",
    "29": "@DetroitPistons @DiscountTire @PistonsDancers Who tf actually goes to pistons games",
    "30": "The 360° photo booth is out tonight at Power Hour! \n\n@DiscountTire | @PistonsDancers https://t.co/kV778YoX08",
    "31": "So..... We have all these fans and excitement tonight to see the Pistons play the Warriors without Curry and Draymond? 😵‍💫😵 A lot of fans will be mad! #DetTraffic🚦 @LCArena_Detroit @DetroitPistons @warriors https://t.co/x02EgeSSrH",
    "32": "🏀 PISTONS GAMEDAY 🏀\n\nSaddiq Bey and the Pistons have a prime opportunity tonight as the Warriors visit LCA with a good chunk of their lineup sitting out, including Steph Curry. \n\nCan Detroit pick up a second win in a row?\n\n#Pistons \n\n📺: Bally Sports Detroit\n🏀: 7 PM EST https://t.co/qV5rKS51um",
    "33": "@DetroitPistons @HenryFordNews So we have a chance!!",
    "34": "Some Detroit team has to have a crazy contract at some point huh? Pistons bout to shake Blake's contract and boom tigers 300M https://t.co/i11yCpmn5k",
    "35": "Extra drip in Detroit tonight 🔥\n\n#ULTRADrip | @MichelobULTRA",
    "36": "After Tonights Game They Going To Fire The Head Coach Of The #DetroitPistons 🤣🤣 #Warriors #WarriorsGround #DubNation #NBA",
    "37": "@DetroitPistons @HenryFordNews You know the pistons jacked up the price for this game, now fans get to see the warriors B team",
    "38": "1U Detroit Pistons H2H\n1U Los Angeles Lakers H2H (predicting Lebron plays)\n1U Milwaukee Bucks -12.5\n#NBA",
    "39": "@boyle_trevor @DetroitPistons @HenryFordNews wiggins&gt;&gt;poole",
    "40": "Men's Detroit #Pistons Nike Blue 75th Anniversary Performance Showtime Full-Zip Hoodie Jacket #NBA75 \nhttps://t.co/lx208sXlUA",
    "41": "Detroit Pistons are constricted in trade flexibility and it may cost them for years https://t.co/5qNJorsqLG",
    "42": "Detroit Pistons are constricted in trade flexibility and it may cost them for years https://t.co/uMh3clqjlV https://t.co/lRJFUOA34o",
    "43": "@DetroitPistons can I get a little California Love? One of my faves! #PistonsPlaylist",
    "44": "@DetroitPistons Omg I want one!!!! Please!",
    "45": "@CadePistons @DetroitPistons @HenryFordNews Poole going off",
    "46": "@DetroitPistons @HenryFordNews Curry dodging Cory Joseph",
    "47": "@DetroitPistons fans should be thoroughly pissed-off. When the @NBA schedule was announce umpteen months ago, ppl rushed to buy tickets for tonight's Dub game. Guess what? The one-time Steph Curry's in town he ain't playing. NBA marketing works ppl. #Pistons",
    "48": "@Devoted2DET -Wings/Avs was fun but distant memory at this point.\n-Tigers/Yankees seems like I care more than the clubs do. Really think the Tigers/White Sox could get heated as Detroit gets competitive.\n-Pistons/Pacers was what was. Bad Boys predates my viewership \n-Lions/Themselves",
    "49": "@DetroitPistons @HenryFordNews Cade Cunningham you've got a chance to own the the Golden state warriors tonight!😹",
    "50": "Haven't seen Cass at Temple like this for @DetroitPistons @LCArena_Detroit before the doors open at 6:00 PM. #DetTraffic🚦 https://t.co/smUzhGii5l",
    "51": "@DetroitPistons @HenryFordNews I would feel ripped off if i paid for a ticket to this game. That’s not the Warriors fans want to see.",
    "52": "11/19 #NBA picks 🔥\n\nLaMelo Ball O6.5 rebs (-119)\nChicago Bulls ML (-105)\nDetroit Pistons +2 (-110)\n\n#GamblingTwitter #FreePicks https://t.co/OiP7TGW3Z7",
    "53": "@fatumael99 @DetroitPistons Those are slick!",
    "54": "Im feelin an upset tonight from the @DetroitPistons",
    "55": "@Th3Hum4nTorch @DetroitPistons @HenryFordNews I hope not",
    "56": "@NBA  #nba75 #complexcon #NBATwitterLive  THIS WAS AMAZING AT @ComplexCon  CANNOT WAIT FOR NEXT YEAR - watching #HWC #larrybird #detroitpistons https://t.co/8ONlqnd6eY",
    "57": "@KingMichael86 @DetroitPistons @HenryFordNews @warriors @MSU_Basketball @Money23Green @TomGores Also, they’re not gonna see your tag bruh lol",
    "58": "@KingMichael86 @DetroitPistons @HenryFordNews @warriors @MSU_Basketball @Money23Green @TomGores Lol what the hell is Tom Gores gonna do about it?",
    "59": "@DetroitPistons @HenryFordNews Need Livers back expeditiously",
    "60": "@DetroitPistons @HenryFordNews They really rested basically every good rotational player besides Jordan poole",
    "61": "@DetroitPistons @HenryFordNews Free win for Pistons",
    "62": "@DetroitPistons @HenryFordNews Lol warriors are just resting from their back to back",
    "63": "🔴 Ben Simmons Heading to Detroit Pistons? https://t.co/PUFMdELmot",
    "64": "Tonight's @HenryFordNews injury/status report against the visiting Golden State Warriors: https://t.co/wwBSm9UtkH",
    "65": "@wulfalos @DetroitPistons @warriors @BallySportsDET @971theticketxyt @Shopify @LCArena_Detroit He isnt",
    "66": "Troy Weaver protected the Detroit Pistons’ future first-round draft picks.\n\nYet by doing so, any trade where a team may want a future first from the Pistons - say, the Philadelphia 76ers for Ben Simmons - is literally impossible right now:\n\nhttps://t.co/fRptxxjEFt",
    "67": "@DetroitPistons Curry sitting out tonight cause he trying to keep his PPG avg up. Pistons defense 🔥",
    "68": "The roofers jacked up my satellite, so now I can't watch the @DetroitPistons 😢",
    "69": "Dear @StephenCurry30. I like your BAYC. Also, I’m hurt that you’re sitting tonight against the @DetroitPistons. Can I get a jersey? - a sad Detroit fan",
    "70": "@StephenCurry30 fam, you knew and the rest of y’all knew the fucking @DetroitPistons game was gonna be sold out tonight for YOU ! And the fact you never play here is fucked up. I’m still a loyal fan but how many times you played in Cleveland? #RestAtHomeGames @Money23Green u 2 mf",
    "71": "Basketball \nNBA \nDetroit Pistons - Golden State Warriors 1 (+2,5) @ 1,80 (365) 5 units 80%",
    "72": "Per @zacfren @DetroitPistons ML +115\nWarriors coming off back to back road games &amp; resting Steph, Draymond, &amp; Andre \n\n@patJ14 @jigga_genius @agentx_420 @SeanRy44 @BirtyMalone",
    "73": "Saturday on The Sports Project Radio Show 94.9 99.5 1530AM 98.9/980— @SportsDrEddie,  @mlyons85 @MSU_Football , @MickMcCabe1 High school football playoffs, @detnewsRodBeard @DetroitPistons , and  coach JIM MCALWAIN @CMU_Football — tune in 10am-high noon — Smart(er) Sports Talk.",
    "74": "@DetroitPistons @meijer @MLive Let me guess. Meijers in Howell? Troy? Birmingham?",
    "75": "Curry, Green, Iguodala and Porter Jr. OUT for tonight’s game against the Detroit Pistons. I guess it’ll be:\n\nPG: Poole\nSG: Lee\nSF: Wiggins\nPF: Bjelica\nC: Looney https://t.co/7Q3yoUUu6C",
    "76": "Detroit Pistons vs. Golden State Warriors: Stephen Curry, Draymond Green out (rest) https://t.co/k0FTziDaAj",
    "77": "@niranjangfx @DetroitGotNext @DetroitPistons Pls do Lyles",
    "78": "@NBA so can I get a refund for the tickets I purchased to watch @StephenCurry30 @Money23Green and @andre play tonight vs Detroit pistons? I thought there was a rule about sitting out players due to non injury.  Can't the @warriors get fined for that? 800 dollars tickets smh 🤦🏾‍♂️",
    "79": "@niranjangfx @DetroitPistons get me one😥",
    "80": "Whatup doe #Pistons fans! \n\nWe're giving away FREE COASTERS (COURTsters) at the doors for tonight's game. \n\n🚪 Doors open at 5:30pm 🚪 https://t.co/hPQKel4hAS",
    "81": "@nakamura__kenta @wulfalos @DetroitPistons @warriors @BallySportsDET @971theticketxyt @Shopify @LCArena_Detroit Glad I didn't go to this game as I planned to",
    "82": "Golden State Warriors @ Detroit Pistons\nPick : Golden State Warriors.\nBasketball. NBA",
    "83": "Yahoo! Sports:  Detroit Pistons are constricted in trade flexibility and it may cost them for years https://t.co/ok5or3YsIY",
    "84": "Detroit, ya boy is back.  \n2 Pistons games, @ChrisSmokes pop up at @neimanmarcus and a @nas show. Let’s go! I love it here. https://t.co/Aw58cZg50n",
    "85": "@ABColee I still don’t think Simmons’s skill overrides him being a drama queen. Grant, Bey, Cade and most of the Pistons seem to be unselfish and want to play in Detroit. They don’t need toxicity in the locker room right now.",
    "86": "Golden State Warriors v Detroit Pistons. Kindly book another win for Golden State",
    "87": "So we don’t like winning? @DetroitPistons  😒😒 https://t.co/y4Ubzjmu9E",
    "88": "@spencetagradio @DetroitPistons I want no parts of him",
    "89": "@GSWReddit @juanonjuan10 @DetroitPistons I’m ready as well. I’ve been waiting all season to see him in the game more.!7 love that he was out there when they took the game back over.",
    "90": "@DetroitPistons @meijer @MLive You love to see it 👏",
    "91": "I’m going to the Pistons game tonight. If you wanna get your ass kicked come down to the restaurant formerly know as “Kid Rock’s Made in Detroit”.",
    "92": "@DetroitPistons hell NO do NOT trade for Ben Simmons why would you even do that ? 😡😡",
    "93": "@sman1720 @DetroitPistons @warriors Spring 2016 I believe",
    "94": "@blaineconti123 @SethM70 @DetroitPistons @Pistons__Talk @Pistons_PR Stop crying man. Cade is clearly the future, even when he was getting 2pts in a game, clearly had the tools ready to go. Killian was a reach. He's good at what he's good at and that list is not long.",
    "95": "@sirchrisdaniels @SethM70 Lol Same people that called Killian a bus to the ones that called Cade a bust shake my head @DetroitPistons @Pistons__Talk @Pistons_PR sad when I see fans that haven’t actually watched the games someone ratio this man",
    "96": "Steph curry will continue his hot streak against the lonely Detroit pistons tonight… #Kine1400",
    "97": "@DetroitPistons @sixers that's it.  Nothing more. https://t.co/Pq8nehMrnN",
    "98": "@R_Potta @DetroitPistons @warriors Glad that didn’t happen when we went to see them…man what year was that now? 16 maybe?",
    "99": "@GQSports @dennisrodman @chicagobulls Detroit Pistons @DetroitPistons &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;\nchicago bulls\n\nRespect #PistonsFirst 💖💞",
    "100": "@GQMagazine @dennisrodman bad boy for LIFE\n#BadBoysofDetroit #DetroitPistons #DennisRodman",
    "101": "Curry: Out\nGreen: Out\nIguodala: Out\n\n#DubNation is still a 2.5-point favorite at the Detroit Pistons tonight.\n\n#GamblingTwitter https://t.co/Gb19kpHKaB",
    "102": "@mjkara35 @DetroitPistons Now you’ve got me looking at my jersey funny like “when are you going to betray me?” Hahaha",
    "103": "@ZtF4star @noiserawker @anthonyVslater They aren't. They're paying to see the Detroit Pistons play the Golden State Warriors which will happen at 7:00 PM EST",
    "104": "💥Ben Wallace 4x Defensive Player Of The Year Detroit Pistons Vintage Shirt💥 @NeniomClothing https://t.co/11PqajDivv",
    "105": "Golden State Warriors vs. Detroit Pistons Preview, Prediction, and Picks https://t.co/sHUsfXbgV2",
    "106": "@philpapi_ @DetroitPistons My hate for the pistons got me feeling real Lamarish",
    "107": "@PapiCiz @DetroitPistons LMFAO!!!",
    "108": "G League scoring leader Saben Lee (34.0 PPG, 7.8 APG) is absolutely RELENTLESS at attacking the rim. \n\nHis ability to finish through contact and generate free throws is going to help him earn minutes with the @DetroitPistons. https://t.co/UgYJVxMSD7",
    "109": "The biggest disappointment of Steph missing this @DetroitPistons game…\n\nUnfortunately, he’s now on track for a measly 462 made threes this season 😕 #DubNation",
    "110": "@NotAffiliated71 @anthonyVslater They owe Pistons fans an apology? Are you serious? The Warriors are not the home team. It’s not their fault of Detroit’s own fans want to watch them more than their own team 😂",
    "111": "Damn I’d be super bummed if I had bought tickets to the @DetroitPistons game tonight against @warriors and found out Steph was sitting.  \n\nI guess it’s a good thing I’m 500+ miles away",
    "112": "@RTNBA On behalf of @detroitpistons ticket holders, 🤬.",
    "113": "Looking for a value bet?  See if the Golden State Warriors-Detroit Pistons Predictions and Preview for 11/19/2021 is one in our preview.  No crazy hype just a prediction and preview. #GamblingTwitter #Picks https://t.co/nEbsd2LtzA",
    "114": "Aye what y’all waiting on? @DetroitPistons",
    "115": "Just heard @StephenCurry30 was gonna rest tonight against the @DetroitPistons. Well deserved. \n\nBack to watching highlights.",
    "116": "@GSWReddit @juanonjuan10 @DetroitPistons I’m ready for your W big steppin post",
    "117": "@DetroitPistons are bitches",
    "118": "Dear @StephenCurry30. I like your BAYC. Also, I’m hurt that you’re sitting tonight against the @DetroitPistons. Can I get a jersey? - a sad Detroit fan",
    "119": "November 19 in Sports History:\n\n2004 - During a Detroit Pistons and Indian Pacers game a fight broke out involving fans and players. Several players were suspended and all involved were later charged with assault and battery. https://t.co/CpLkhtg8Jz",
    "120": "@pistonsville @DetroitPistons @warriors @BallySportsDET @971theticketxyt @Shopify @LCArena_Detroit Curry and crew is out. That would suck if pistons fans paid pricy ticket to watch Gs",
    "121": "Report: 76ers, Pistons talked bringing Jerami Grant back to Philly in Simmons trade\n\nThrow in Josh Jackson and Philly is better. Olynyk wouldn't be added because he was recently signed. Detroit doesn't wanna part with Bey. \nhttps://t.co/KXlVR45tLf",
    "122": "Lest us not forgot our brave soldiers.  Big fuck u to @DetroitPistons https://t.co/PH0Hi40SZi",
    "123": "Detroit Pistons Predictions and Preview for 11/19/2021 hosts Golden State Warriors.  Looking for betting action?  Find out if there is any value in our preview. #GamblingTwitter #Picks https://t.co/nEbsd2LtzA",
    "124": "Hell of a matchup tonight. Detroit Pistons vs. Santa Cruz Warriors https://t.co/f7o8XK6AtZ",
    "125": "On the @971theticketxyt &amp; @WWJ950 sports desk from 4-7p:\n\n-@Warriors shorthanded against @DetroitPistons tonite on 971\n-It's #TimBoyleTime for the @Lions; Taylor Decker returns to practice\n-@umichbball looks to bounce back tonite on WWJ\n\nDownload the @Audacy app to listen to both",
    "126": "@GSWReddit @juanonjuan10 @DetroitPistons One of my favorite Warrior 💪🏽",
    "127": "R/Detroitpistons really talking about steph was scared that's why he's takin night off https://t.co/o48KWZ2Jmf",
    "128": "The #Pistons are coming off a 97-89 win vs the #Pacers but their chances for another W against the #Warriors tonight are not great.\n\nDetroit is 0-12 and 0-12 ATS since March following a 5+ point win.\n\nThey have lost all 12 games by 10+ points!\n\n#SDQL #NBA #NBATwitter #DubNation https://t.co/mKZVzdAHIs",
    "129": "These Detroit Pistons fans speaking out against acquiring Ben Simmons are certifiably NUTS‼\n\nIt's hard to find better fits for Ben Simmons than:\n\nGolden State Warriors \nAtlanta Hawks\n\n👇🏿\n\nCade Cunningham 🔥\n\nThe time frame of a Simmons &amp; Cunningham rebuild could rival the Hawks",
    "130": "Detroit Pistons vs. Golden State Warriors: Stephen Curry, Draymond Green out (rest) https://t.co/GGH86jSzg2",
    "131": "@GSWReddit @juanonjuan10 @DetroitPistons Kuminga first 30 minutes game will be for the ages",
    "132": "Imagine being an NBA fan in Detroit who wouldn’t pay 10 bucks to see the Pistons play, but you shelled out $300 to watch Steph &amp; the Warriors when they come to Detroit to play the Pistons…and then find out Steph is going to miss the game, along w/Draymond&amp;Iggy. https://t.co/FYE1l0282s",
    "133": "@DetroitPistons no curry tonight you know you need to refund them people money!!! 😤😭😭 @Money23Green",
    "134": "Prédictions #NBA du 19/11!🏀\n\nHornets - Pacers ➡️ Charlotte +16\nPistons - Warriors ➡️ Detroit +17\nCeltics - Lakers ➡️ BOS +6\nNets - Magic ➡️ Brooklyn +3\nBucks - Thunder➡️ MIL +5\nPels - Clippers ➡️ LA +19\nNuggets - Bulls ➡️ CHI +15\nSuns - Mavs➡️ DAL +6\nKings - Raptors ➡️ Sac +10",
    "135": "Where should I go to watch the Pistons get smacked by the warriors tonight....Detroit??",
    "136": "@GSWReddit @juanonjuan10 @DetroitPistons At least it’s a weekend the time difference be killing me 🤦🏾‍♂️",
    "137": "@LegionHoops @PompeyOnSixers @DetroitPistons don’t make this mistake…leave #bensimmons where he at 🙏🏾🙏🏾😂😂😂",
    "138": "@ArsenalGinger @JoshYunker @warriors @DetroitPistons @Pacers @hornets @Lakers @celtics @OrlandoMagic @BrooklynNets And the Pistons have been scoring more in last 5",
    "139": "@GSWReddit @juanonjuan10 @DetroitPistons Looking forward to seeing JTA, GP2, JK, Moody and Cunningham play tonight.",
    "140": "@GSWReddit @juanonjuan10 @DetroitPistons Weird way to spell @JonathanKuming6",
    "141": "Ben's fit is bad, but he's a lot better than Jerami. Let's not romanticize Grant wanting to be in Detroit and let it keep us from acknowledging his obvious limitations. \n\nIf he's around when the Pistons are good, it'll be as the 3rd or 4th best player — like he was with Denver. https://t.co/Vu0aSMpMyH",
    "142": "BREAKING: Dwane Casey reveals true reason why Corey Joseph has played over Saben Lee this season. \n\n#Pistons  #NBA #DetroitPistons https://t.co/RhP3tK5JcG",
    "143": "I am so pissed. Unlike you, this schmuck paid money to go see Curry, Draymond and my UA favorite Iguodala. I am disgusted. This has been going on for the past four years @LCArena_Detroit. Opposing teams figure the Pistons are an ideal rest game. https://t.co/DIrBMblMM5",
    "144": "Let it be known: @juanonjuan10 plays basketball tonight, and I am here for it. Tip off against the @DetroitPistons at 4;00pm PST https://t.co/mF4A6dwNIT",
    "145": "Paid over $400 to take my 3 kids to see @StephenCurry30 and @Money23Green play @DetroitPistons  vs @warriors  tonight and they’re not playing.  So disappointing.  Can’t we do better, @NBAOfficial?",
    "146": "On this day in US history:\n1863: President Lincoln delivers the #GettysburgAddress.\n1988: @88PKane is born.\n2004: The Malice at the Palace: @Pacers vs. @DetroitPistons.\n2021: We play @OYHA_Official PB2.\n📍 Orono Ice Arena\n🕧 6:15PM\n#GoPirates🏴‍☠️\n@YouthHockeyHub @NHLBlackhawks",
    "147": "@tekmunnee @warriors @DetroitPistons @Pacers @hornets @Lakers @celtics @OrlandoMagic @BrooklynNets yeesssssss PURPLE TAPE BACK BOOM 🏀🔥",
    "148": "It’s almost like the Detroit Pistons want me to hate them #Pistons #nba https://t.co/Mi0fUpXbGX",
    "149": "The Golden State Warriors will be without guard Stephen Curry, Draymond Green, Andre Iguodala and Otto Porter, Jr. Friday night against the Detroit Pistons. \n#NBA #NBATwitter https://t.co/5ezHK7hX8f",
    "150": "The Detroit Pistons are a rehab center they just revive dudes careers Josh Jackson for example MAKE THE SIMMONS TRADE HES APART OF CLUTCH WHICH WILL BRING FREE AGENTS TO DETROIT",
    "151": "The Golden State Warriors will lose tonight in a blowout against the Detroit Pistons. Sadly, of course.",
    "152": "@BallySportsDET @DetroitPistons @TMobile A lot of dish network people would love to see this game.",
    "153": "Ben Simmons to the ‘Stons would turn us into something a lot of people have counted out… @DetroitPistons",
    "154": "@DetroitPistons why would we give up 3 shooters for a brick???😭",
    "155": "Warriors: Detroit Pistons vs. Golden State #Warriors: Odds, predictions and best bets - PistonPowered https://t.co/S4EyxSXHRd",
    "156": "I need a refund!! @DetroitPistons",
    "157": "@tekmunnee @warriors @DetroitPistons @Pacers @hornets @Lakers @celtics @OrlandoMagic @BrooklynNets Steph, Iggy, &amp; Draymond all supposed to sit for rest tonight.",
    "158": "@anthonyVslater Feel really bad for the @DetroitPistons fans. Lots of disappointed kids @warriors",
    "159": "@DetroitPistons make that trade happen",
    "160": "@DetroitPistons if we were better steph would've played 💔💔💔",
    "161": "#NBA #NBATwitter #NBAPicks \nFriday November 19\n\nStats &amp; Trends 🏀\nPart 1 (Part 2 out shortly)\n@warriors v @DetroitPistons\n@Pacers v @hornets\n@Lakers v @celtics\n@OrlandoMagic v @BrooklynNets\n\n(#NHL 🏒 out shortly)\n#sports #sportsbettingpicks #sportsbets #freepicks #GamblingTwitter https://t.co/RqAaWzi0po",
    "162": "Detroit is so bad that Golden State is resting half their team and the Pistons are still 1.5 dogs at home. #NBA",
    "163": "@Matt_AllAboutU @Suns @DetroitPistons Tonight they win by 15+",
    "164": "@RobbySilv @Suns @DetroitPistons Still thinking about it. Donkic is doubtful to play. Nervous about the 8.5 though.",
    "165": "The #Pistons host the Warriors tonight in Detroit.\n\nRemember, you can stream the @DetroitPistons all season long on the Bally Sports app, presented by @TMobile https://t.co/7krJpe1LEe",
    "166": "@anthonyVslater Totally understand, but that's lousy luck for @DetroitPistons fans who bought tix to see Steph",
    "167": "@Matt_AllAboutU @Suns @DetroitPistons I told you before and I’ll tell you again, @Suns will roll tonight. They have their legs under them, starting shooting like normal at end of game. The Jet Lag has worn off. #ThankMeLater",
    "168": "@RobbySilv @Suns @DetroitPistons 1.5 now. Staying away from Nets too. No Durant tonight. Took the Bulls with points against Denver. Jokic may not play.",
    "169": "@SociosHoops @Pacers @hornets @warriors @DetroitPistons @Lakers @celtics @OrlandoMagic @BrooklynNets @okcthunder @Bucks Hornets\nPistons\nLakers\nNets\nBucks",
    "170": "Back GOLDEN STATE WARRIORS to BEAT Detroit Pistons tonight in the @NBA (Game Starts at 00.10 GMT) #NBA #Basketball",
    "171": "5 NBA games on the slate tonight between #socios team partners:\n\n@Pacers vs @hornets \n@warriors vs @DetroitPistons \n@Lakers vs @celtics \n@OrlandoMagic vs @BrooklynNets \n@okcthunder vs @Bucks \n\nWho are your picks to win these match ups?",
    "172": "@Matt_AllAboutU @Suns Overnight Line was 9.5 , think it went down to 6.5 , we’ll see if @DetroitPistons can take advantage.",
    "173": "@DetroitPistons @Ticketmaster Man this some bs",
    "174": "@DetroitPistons get better immediately so teams can't blatantly disrespect you like this",
    "175": "@DetroitPistons @NBA I bought tickets tonight to see Steph Curry play and we paid a premium price for them. Is there anyway we could get some sort of refund since the product is not going to end up being what we paid for?",
    "176": "@JLEdwardsIII as a season ticket holder this sucks @DetroitPistons @warriors @NBA",
    "177": "17 years ago today we had some #MaliceatThePalace @Pacers @DetroitPistons #RonArtest 🏀 #basketbrawl @NBA https://t.co/KkUcSZNc84",
    "178": "First up: The #Warriors head to Detroit to take on the #Pistons. The Dubs have won their last two and are 5-1 on the road BUT they’ll be without Steph Curry (hip). What do you like?",
    "179": "A win is a win. Doesn’t matter if Curry and Green are out. Handle business against the Dubs @DetroitPistons https://t.co/B5pNhH06Jg",
    "180": "BREAKING NEWS: Per Marc Stein, Stephen Curry (left hip contusion) Draymond Green (right thigh contusion) and Andre Iguodala (right knee soreness) will sit out tonight's game against the Detroit Pistons tonight. @WillardAndDibs are reacting now.\n\nLISTEN: https://t.co/XmfLlR6a0r https://t.co/kMqwtTVhGr",
    "181": "@EverythingxKing No, Hell No!!! Run away fast @DetroitPistons",
    "182": "@docmasse @DetroitPistons I was actually saying why cuz the Grant fit in Philly is weird. Simmons would help Detroit. Just all the drama.",
    "183": "@wulfalos @Opinionated_MJ @DetroitPistons @warriors @BallySportsDET @971theticketxyt @Shopify @LCArena_Detroit Steph, Dray And Iggy are out FYI",
    "184": "The #Warriors say Stephen Curry (hip), Draymond Green (thigh contusion) and Andre Iguodala (right knee soreness) will all sit out tonight's game in Detroit. #Pistons",
    "185": "In it for our City. \n\nLast night the #Pistons kicked off Season of Giving presented by @meijer with the “2021 Pistons Give Back at Thanksgiving” Event. \n\nVisit @mlive to read more\n🗞: https://t.co/JdqEq0rDZm https://t.co/Q3aCvJOaB8",
    "186": "🏀NEW DATES join me\nLive - December 6th 🔥\n🚨@detroitpistons \n📍@littlecaesarsarena \n\n#SalsaDetroit #BachataNights #DetroitVsEverybody #detroit #littleceasarsarena #fyp #tigers #pistons @ Little Caesars Arena https://t.co/9ce23JpxPx",
    "187": "@Bleacherdave @TheFrankIsola @Scalabrine @badboyhorn44 You’ll have to ask @badboyhorn44 about that as it relates to the Pistons. The city of Detroit has its own vibe/culture that is universally bitten by everyone, from “whatupdoe”(Oakland jacked this), clothes/style, DetroitVS. Imitation is the sincerest form of flattery. 😀",
    "188": "@LegionHoops @PompeyOnSixers Are the @DetroitPistons going to make a big move?!??",
    "189": "Why would pistons ever do this? Like in what world is this a good or even just fair trade for detroit lmao https://t.co/1S0Iz9xOS2",
    "190": "Detroit Pistons - Golden State Warriors\nBoston Celtics - Los Angeles Lakers\nMilwaukee Bucks - Oklahoma City Thunder\nNew Orleans Pelicans - Los Angeles Clippers\nSeattle Kraken - Colorado Avalanche\nVancouver Canucks - Winnipeg Jets\n\nBet slip link: https://t.co/9y7FMgsaxk https://t.co/U0gd0g2elC",
    "191": "#OnThisDay in 2004 – During a NBA game between the Indiana Pacers and the Detroit Pistons, a brawl between players spilled into the crowd when Ron Artest attacked a fan who had thrown a drink at him. https://t.co/CIzw5H2AmN",
    "192": "Hey @DetroitPistons do you have 2 extra tickets for tonight’s game? I’d love to spend my night in a good mood after this work week 😭🙏🏻 https://t.co/vp4wfzKQd2",
    "193": "@PistonFanInIndy @DetroitPistons I stg why this on my feed smh",
    "194": "Don’t let 30 get hot tonight @DetroitPistons 🤫",
    "195": "Philadelphia 76ers have discussed trading Ben Simmons to the Detroit Pistons in exchange for a package featuring forward Jerami Grant,",
    "196": "The Golden State Warriors play basketball today against the Detroit Pistons!",
    "197": "@alderalmo @DetroitPistons @NBA2K Best ever!",
    "198": "Jerami Grant? Send it in @DetroitPistons https://t.co/Oe71Jz4w6e",
    "199": "I would LOVE to see Ben Simmons screw himself over so bad that he gets sent to the @DetroitPistons .  The @sixers should do it just to show him what he gets for messing around.\n\nYou don’t want us, okay, well here you go.  (Pack a coat, it gets 🥶). https://t.co/UgeLoDIqzs",
    "200": "@Fatty_Fadeaway @NBA @theparleh @warriors @DetroitPistons @Lakers @celtics Thanks my dude!",
    "201": "@EricRosales77 @NBA @theparleh @warriors @DetroitPistons @Lakers @celtics Nice!",
    "202": "Need Killians jacket\n\nCc: @DetroitPistons https://t.co/aqNov6NGcH",
    "203": "This day in 2004. The malice at the palace the Pistons Pacers brawl that they say was the worst in NBA history happened. I'm sure the world was shocked to see certain people behaving badly in Detroit a city know for it's peace and tranquility. https://t.co/KWqsoHo9x9",
    "204": "Saturday's Faces of Fall: Payton Harwood of @BrcatPrincipal boys' golf ...\n\nFavorite athlete: John Daly\nFavorite team: Detroit Pistons\nSporting event he'd attend: Masters\nFavorite sport besides golf: Baseball\n\nhttps://t.co/gYKDzY52qQ #NGMedia https://t.co/UtdcYQTlGh",
    "205": "Jogos De Hoje:\nCharlotte Hornets vs Indiana Pacers (00h00)\nDetroit Pistons vs Golden State Warriors (00h00)\nBoston Celtics vs LA Lakers (00h30)\nBrooklyn Nets vs Orlando Magic (00h30)\nMilwaukee Bucks vs Oklahoma City Thunder (1h00)\nNew Orleans Pelicans vs LA Clippers (1h00)",
    "206": "Steph bout to light the Pistons up tonight lol catch me in the Motor City Club @LCArena_Detroit tonight",
    "207": "Happy Anniversary @DetroitPistons and @Pacers https://t.co/chMezlRUUa",
    "208": "@theScore @DetroitPistons Please no!",
    "209": "Golden State Warriors vs Detroit Pistons 11/19/2021 Picks Predictions Previews\n\nhttps://t.co/47CGRaVEOW\n\n#NBAparlay #NBA #NBApicks #NBAprediction #NBAbetting #expertpicks #handicapper #freepick #freepicks #sportspick #sportsbetting #odds #picks #basketballpicks #Warriors #Pistons https://t.co/aJ1Fw4tQ6C",
    "210": "Detroit Pistons may avoid facing scorching Stephen Curry in Golden State Warriors visit https://t.co/CCCGQoHFUa https://t.co/FE9FzbDu1d",
    "211": "Your newest Friday night plans 🤝 \n🏀 Golden State Warriors vs Detroit Pistons @ 4:00 pm\n🏒Winnipeg Jets vs Vancouver Canucks @ 7:00 pm\n⛳The RSM Classic - PGA Tour @ TBD\n#socloseyoucanfeelit #SB https://t.co/V2E6LNkIx1",
    "212": "Check out what @TopShotGiftGoat &amp; @girldadNFT are doing! \nBecause of what @TomGores &amp; the @DetroitPistons do to support Toys for Tots, I decided to donate a Killian Hayes rookie moment! And for GirlDad some WNBA love, with a @moniquebillings moment! https://t.co/FMP4amMT7K https://t.co/KeVfsZ3Xjp",
    "213": "@DetroitPistons I don’t know if I’d mess with denim but that design is solid😳",
    "214": "Philadelphia 76ers have list of 30 players they’d want in Ben Simmons trade https://t.co/1bNr8djbkH #NBA #BrooklynNets #DetroitPistons",
    "215": "🚨🏀hoopers!🏀🚨\n\nHappy to present my inaugural @nba Friday Shootaround with @theparleh!\n\nCovering @warriors vs @DetroitPistons &amp; @Lakers vs @celtics \n\nHappy betting! \n\n#nba #NBATwitter #GamblingTwitter https://t.co/7kLfwgQdwI",
    "216": "People that want Simmons in Detroit act as if he wouldn't throw a tantrum for being traded to the #Pistons",
    "217": "Detroit Pistons vs. Golden State Warriors: Cade Cunningham meets Stephen Curry — maybe https://t.co/D3OrGSUAM1",
    "218": "@nave_noxid @DetroitPistons I’m over it! Thank god for the warriors 😏",
    "219": "@nave_noxid @DetroitPistons Dudes haven’t been relevant since 08. Why does that not piss them off and make them want to be better? It’s like that enjoy being hot garbage year after year",
    "220": "It's the NBA Friday Shootaround. Who you got?\n\nPicks ⤵️\n- Golden State -7.5 OVER Detroit Pistons\n- Los Angeles Lakers +2 OVER Boston Celtics\n\n🎥 - @EricRosales77 \n\n#NBA #SportsBetting https://t.co/uO9Jwgqxwo",
    "221": "Are you in it for your city? \n\n🔥 Save $15 and grab our unisex \"IN IT FOR MY CITY\" Denim Jacket today! 🔥\n\n🔗: https://t.co/bVQo5HOrYd https://t.co/hiKAql8O3J",
    "222": "@DetroitPistons le epic loss i am depressed",
    "223": "@mcuban So awesome Mark! You’re a head of the game and I can’t wait till my @DetroitPistons take note ❤️",
    "224": "FRIDAY FUN FACT: It is physically impossible for pigs to look up into the sky. \nTHIS DAY IN HISTORY: 2004 - In one of the worst brawls in U.S. sports history, Ron Artest and Stephen Jackson of the Indiana Pacers go into the stands and fight with Detroit Pistons fans.",
    "225": "Bro @DetroitPistons don’t get rid of @JeramiGrant at alll we can get players not Ben Simmons but others to help contribut in big ways",
    "226": "@NBAMockTrades @sixers @ATLHawks @SacramentoKings @DetroitPistons Moving Josh and Jerami\n\nGetting Bagley, Hunter, Jalen J, 2 2022 FRPs \n\nsign me up 📈",
    "227": "@tonydombrowski @DetroitPistons @CadeCunningham_ Please stop trying to represent Pistons Twitter.",
    "228": "@DetroitPistons @sixers just exchange Ben for jerami and killian don’t make it harder on y’all selves",
    "229": "@DetroitPistons @warriors @BallySportsDET @971theticketxyt @Shopify @LCArena_Detroit I’ll be there! #Pistons",
    "230": "Call me crazy but if I’m #Detroit I don’t want Ben Simmons anywhere near Cade Cunningham. How does Detroit win with this trade? #pistons https://t.co/7mYem3gSzP",
    "231": "Invaluable info from @AnthonyP_PMI everyday inside the app.\n\nWhy are certain lines moving the way they are? What side are the sharps on and at what line?\n\n#Detroitpistons\n#GoldenStateWarriors https://t.co/tywi6Eqkqc",
    "232": "@nave_noxid @DetroitPistons They’ve been absolute dog shit for YEARS. They get the number 1 pick who is getting more comfortable and clearly has the talent and maturity to lead, they have potential. Why throw it away. Bunch of idiots. Grant is our number 1 producer right now. Do not get rid of him",
    "233": "The infamous ‘Malice at the Palace’ was on this day 17 years ago. 😬\n\n#malaceatthepalace #detroitpistons #indianapacers #nbaflashback #throwback #nbahistory https://t.co/zwyoDzNC9K",
    "234": "The Detroit Pistons have recalled Saben Lee from the Motor City Cruise.",
    "235": "@nave_noxid @DetroitPistons I just don’t understand the mindset of the front office. Why trade away the only players who are putting up any type of numbers for a bum who can’t shoot? It’s not like the pistons are already stacked and he will add value. He adds nothing to the already shitty pistons",
    "236": "This is not a pistons account but I am a fan, this trade would be so fitting of Detroit. Just a terrible trade, if they actually go through with this. https://t.co/sqyL4ORzJ2",
    "237": "I’ve been to one NBA game in my life. February 1st, 2014. Detroit Pistons Vs. the Philadelphia 76ers. Quite possibly the worst collection of talent to ever play in a single game. These are the starters https://t.co/olOfXsYQH9",
    "238": "@nave_noxid @DetroitPistons Mannnnn I can’t even believe this is a rumor!",
    "239": "Why even start the rebuild if you’re gonna blow it up right away? Please do not do this bullshit ass trade @DetroitPistons https://t.co/UsoxoDoawl",
    "240": "Happy anniversary to the Malice at the Palace! @DetroitPistons @Pacers @MettaWorld37 https://t.co/0szSPYUBcG",
    "241": "Saddiq Bey just tied the NBA record for the 3rd fewest games to reach 200 3pm bro i PROMISE you the Detroit Pistons aren't trading him.",
    "242": "@PrinzStylz @DetroitPistons @warriors @BallySportsDET @971theticketxyt @Shopify @LCArena_Detroit My team is gonna do all the defenses",
    "243": "Detroit at home and had a day off I might take over 209 but -7 warriors Steph be going crazy… but pistons win or cover on damn near every good team",
    "244": "Detroit Pistons may avoid facing scorching Stephen Curry in Golden State Warriors visit https://t.co/0mfkCFygtt",
    "245": "Golden State Warriors vs. Detroit Pistons Preview, Prediction, and Picks https://t.co/HEGiFdSuFX",
    "246": "India - New Zealand\nDetroit Pistons - Golden State Warriors\nBrooklyn Nets - Orlando Magic\n\nBet slip link: https://t.co/VXu3yjBGZZ https://t.co/mFVQSuoqNW",
    "247": "If the #Pistons are going to trade Grant, I prefer Detroit makes a trade like this, instead of swapping Jerami, youth, &amp; picks for Ben Simmons. https://t.co/LsbX1BS9tt",
    "248": "@warriors (13-2)-@DetroitPistons (4-10)\n📺NBA LEAGUE PASS📺\n#DubNation https://t.co/wyL6HRtWId",
    "249": "@DetroitPistons we WANT BEN ‼️‼️",
    "250": "@DetroitPistons I miss wynn Wednesday spin the wheels I won too much bring it back",
    "251": "💵 Don't miss out on a chance to WIN $500 CASH! 💵 \n\nClick the 🔗 below to learn more about #Pistons picks\n\n🔗: https://t.co/KqtXpSQh4t https://t.co/6tinRLtrJR",
    "252": "NBA Mock Trade of the Day\n\nSimmons to ATL, Grant/Hield/Pick to 76ers,  Bagley/Hunter/picks to DET, Galinari/Curry to Kings\n\nhttps://t.co/UNtgpkQ8Ew #Fanspo \n\n@sixers  @ATLHawks @SacramentoKings @DetroitPistons",
    "253": "Detroit Pistons may avoid facing scorching Stephen Curry in Golden State Warriors visit #YahooSports #NBA https://t.co/RvKFGEbcAx",
    "254": "Thanksgiving is only a week away. But, thanks to our friends, the @DetroitPistons, the holiday came a little earlier. Yesterday, 800 families received food, hygiene essentials, and more to help support those less fortunate this year. \nhttps://t.co/0vZ472UTPi #NoHungerHolidays",
    "255": "@ElrondUs @Andr3iRey @erd1Phantom @Pytyser @100trillionUSD @Witaalis @Elrondirr @Mr_Yaphets407 @erd1sn0w @Ueghio1 @DetroitPistons @ESDTGems That Looks like a London Bus",
    "256": "@DetroitPistons @warriors @BallySportsDET @971theticketxyt @Shopify @LCArena_Detroit We bout to get clapped lol hopefully they learn something from them",
    "257": "Golden State Warriors vs. Detroit Pistons Preview, Prediction, and Picks | SportsNus https://t.co/8ZJzCEErrc",
    "258": "Sounds like he’s ready to watch a Detroit Pistons game https://t.co/ZDDslkvGzl",
    "259": "🏀NBA\nWarriors (13 - 2) @ Pistons (4 - 10)\n🚨Buzzer Moment Watch\n⏰7:00 pm EST\n📱Buzzer⚡️, NBA League Pass\nSpread: GS: -8 (-110) | DET: +8 (-110)\n\nThe Dubs head to Detroit for the final game of their east-coast trip. Expect Cade Cunningham to measure himself against Stephen Curry",
    "260": "HAPPY ANNEVERZARY 2 DA MALICE AT THA PALACE!!! https://t.co/kCGn8ka4tJ @DetroitPistons @Pacers #Pistons #Pacers",
    "261": "DasHaus made a bet!\n\nEvent: Golden State Warriors vs Detroit Pistons #NBA\nBet: Detroit Pistons TO WIN +7\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "262": "DasHaus made a bet!\n\nEvent: Golden State Warriors vs Detroit Pistons #NBA\nBet: Golden State Warriors TO WIN -7\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "263": "@DetroitPistons @warriors @BallySportsDET @971theticketxyt @Shopify @LCArena_Detroit Killian masterclass v Curry incoming 🤪",
    "264": "17 years ago today, The Malice at the Palace takes place in Detroit as @Pacers players Ron Artest and Stephen Jackson charge into the stands to fight Pistons fans after Artest was hit with items thrown at him.\n\n#Pistons | #Pacers | #NBA | #MaliceAtThePalace | #GoldBlooded https://t.co/bngxv12Pvi",
    "265": "Kash Doll Celebrates Detroit Pistons-Themed Baby Shower In A Stunning Gold Gown https://t.co/1Kk3vHcgno",
    "266": "@DetroitPistons please do not get Ben Simmons! Dude cannot handle the nba and cannot shoot.. keep him the fuck away from the team.",
    "267": "On this day in 2004, the Indiana Pacers and Detroit Pistons brawled in the worst melee in NBA history. https://t.co/Pbb0i4omxN",
    "268": "**AMAZING** turnout at yesterdays turkey giveaway with @DetroitPAL and @DetroitPistons ‼️ \n\nMark your calendars for the NEXT turkey giveaway on November 22 at 4:30pm! It will be located at 7718 Westwood!! 🦃🍗 \n\n#turkeytime #thankyou #DetroitPolice #Thanksgiving https://t.co/9DqNhpnqJO",
    "269": "NBA ML. Date: 11-19\nGolden State Warriors vs Detroit Pistons. 5.88%\nBetMGM. Warriors @ -200\nDraftKings. Pistons @ +260\n#arbitrage #bettingtwitter #bettingpicks #sportsbets #freepicks #freemoney #mlb",
    "270": "Was gonna try to hit the Warriors-Pistons game tonight but if Steph Curry is “resting” then Imma chill. I admit I might be REACHING here but it feels like the “stars” are always OUT or “resting” these days when it’s a game in Detroit.",
    "271": "Our #Pistons back tonight with the best team in the NBA #DubNation in Detroit? Cade Cunningham has been playing well?! Can the #Pistons make it two in a row?! Who can stop the Splash Nephew Jordan Poole?! https://t.co/XUwkWnG5fg",
    "272": "@ElrondUs @Andr3iRey @erd1Phantom @Pytyser @100trillionUSD @Witaalis @Elrondirr @Mr_Yaphets407 @erd1sn0w @Ueghio1 @DetroitPistons @ESDTGems I think that your community should look on our last #LimitedEdition 😁🇺🇸",
    "273": "@StephenCurry30 you playing tonight against @DetroitPistons ? Not buying a ticket unless you are. Heard on @espn you might sit tonight.",
    "274": "Pistons fans not wanting Ben Simmons is interesting.\n\nOn the one hand, they just drafted a “point guard” first overall and are still very far away from a playoff berth.\n\nOn the other hand, Simmons would arguably be the best player to play for Detroit since Grant Hill.",
    "275": "NBA legend Dennis Rodman says visiting gay clubs and 'bringing drag queens to games ...: The 60-year-old won a whopping five NBA titles, with two coming during his time at the Detroit Pistons, while he won three in a row with the Chicago ... https://t.co/2eIqfLs7XF",
    "276": "@DetroitPistons if y’all trade for Simmons you take a whole 500 mile leap step back do not do that",
    "277": "@DetroitPistons @warriors @BallySportsDET @971theticketxyt @Shopify @LCArena_Detroit Buckle up Detroit\n\nWe've got a chance to stop this Steph warpath.\n\nCade vs Steph 🔥🔥🔥🔥🔥",
    "278": "@DetroitPistons @warriors @BallySportsDET @971theticketxyt @Shopify @LCArena_Detroit Saturday morning in Australia 👌",
    "279": "@DetroitPistons @warriors @BallySportsDET @971theticketxyt @Shopify @LCArena_Detroit Morning Pistons 🌞",
    "280": "Detroit Pistons have recalled Saben Lee from the Motor City Cruise, the team's G League affiliate @BallySports has learned.",
    "281": "The Detroit Pistons have recalled Saben Lee from the Motor City Cruise, the team's G League affiliate.",
    "282": "Homestand continues tonight against the Warriors 🏡 \n\n🆚 » @warriors \n📺 » @BallySportsDET \n📻 » @971theticketxyt \n💻 » 𝗡𝗕𝗔 𝗟𝗲𝗮𝗴𝘂𝗲 𝗣𝗮𝘀𝘀 | https://t.co/PV8hXiHMVQ\n🤝 » @Shopify | 𝗔𝗻𝗴𝗲𝗹𝘄𝗲𝗮𝗿 𝗦𝗰𝗿𝘂𝗯𝘀\n 📍 » @LCArena_Detroit https://t.co/FaMPpKczoa",
    "283": "Detroit Pistons - Golden State Warriors Predictions &amp; Odds\n\nhttps://t.co/B7HS7dz4Hx\n\n#NBA #NBATwitter #bettingtips #bettingpicks #bettingtipster #bettingsports #sportsbets #basketball #bettingtwitter https://t.co/fpDK4CVXI6",
    "284": "The Detroit Pistons will take on the Golden State Warriors at home tonight at 7pm ET. https://t.co/DfNI9RZgRW",
    "285": "One year ago today, I had the pleasure of capturing @iam_killian’s arrival to #Detroit after being selected by the @DetroitPistons in the @NBADraft with the 7th overall pick.\n\nCheck out this short recap ‼️🏀✈️ https://t.co/KtSoiurnIg",
    "286": "It should be a packed house for the #Pistons game tonight at @LCArena_Detroit \n\nPistons vs. Warriors 🤘\n\n6:30 p.m. on Bally Sports Detroit. https://t.co/EXtCFTMMvu",
    "287": "Detroit I’m on the way… Pistons - Warriors",
    "288": "For the Pistons, and for @TimForkinNBA, Cade Cunningham's arrival in Detroit represents the end of years' worth of heartbreak and complacency. https://t.co/GLlzT1AC3z",
    "289": "Troy Weaver has something in his hands that fans WANT to cheer for. All while not feeling the pressure to \"hurry up and win\". He will undo ALL of that by trading ANYBODY for Ben Simmons let alone @JeramiGrant.  @DetroitPistons don't let these \"rumors\" have merit.",
    "290": "November 19, 2004 — Indiana Pacers vs Detroit Pistons in The Malice at the Palace https://t.co/dTBf9ZERtu",
    "291": "Detroit Pistons icon, Ben Wallace, looks like a professor that won’t give anyone a grade higher than a B+. https://t.co/91NMfGaQKb",
    "292": "On this day in 2004, the Indiana Pacers and Detroit Pistons brawled in the worst melee in NBA history. https://t.co/Jlcdnh47ry",
    "293": "Analyzing Friday’s Golden State Warriors at Detroit Pistons odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/MASn3i0iV9",
    "294": "@PistonPowered @DetroitPistons I know, right? Ordered from official NBA store. I’m like, third time’s a charm, maybe? But then I’m like, just send me an official player-worn type sewn-on version and be done with the back and forth iron-on Swingman issues. It’s exhausting…",
    "295": "Jesus Christ it’s just a fucking game. But people get worked up over silly games, and during a November 19, 2004 basketball game between the Indiana Pacers and Detroit Pistons, a brawl broke out, and not just between players. The crowd got in on it too.\n\nhttps://t.co/ayL8vDkqmh",
    "296": "I swear if the @DetroitPistons trade for a culture cancer like Ben Simmons they will be bad for another decade. The one free agent who WANTED to play in Detroit is being talked about in trades for a guy who couldn't care less about ball.",
    "297": "Source: @talkbasket Philadelphia 76ers reportedly engaged in talks with Detroit Pistons for Ben Simmons https://t.co/ffNXdhM7o1",
    "298": "@DetroitPistons don’t overthink it, bey Stewart and Garza are a no go. Two 1st rounders are acceptable, but not if they are looking for another young piece. Let’s get ben here",
    "299": "TONIGHT!! THE DETROIT PISTONS FACE THE RED HOT GOLDEN STATE WARRIORS AT LCA!! CADE VS THE KUM BUCKET!! LETS GOOOO https://t.co/z3EUrrjufh",
    "300": "@DetroitPistons @Ticketmaster Speaking of memorable moments, I have some “suite” NBA TopShot moments I’d be willing to trade for 4 seats to tonight’s game…just sayin’. Would LOVE to be in the house for tonight’s big matchup! Have any NFTs yet? If not, you should! Let’s make a deal! Go Pistons!",
    "301": "New tumblr post: \"#NBA2K22 Detroit Pistons vs Cleveland Cavaliers MyLeague PS4...\" https://t.co/JYym0lU7VW ifttt, youtube",
    "302": "Detroit Pistons may avoid battle with revived Steph Curry when Golden State visits Friday https://t.co/uJwleRHWxe",
    "303": "NBA Day 3️⃣2️⃣ 🏀🏀🏀\nGolden State Warriors vs Detroit Pistons\nIndiana Pacers vs Charlotte Hornets\nLos Angeles Lakers vs Boston Celtics\nOrlando Magic vs Brooklyn Nets\nLos Angeles Clippers vs New Orleans Pelicans\nOklahoma City Thunder vs Milwaukee Bucks",
    "304": "Charlotte Hornets - Indiana Pacers\nDetroit Pistons - Golden State Warriors\nBoston Celtics - Los Angeles Lakers\nNew Orleans Pelicans - Los Angeles Clippers\nSacramento Kings - Toronto Raptors\n\nBet slip link: https://t.co/NoklSXoJCi https://t.co/LjQQtWjszS",
    "305": "NBA legend Dennis Rodman says visiting gay clubs and 'bringing drag queens to games ...: The 60-year-old won a whopping five NBA titles, with two coming during his time at the Detroit Pistons, while he won three in a row with the Chicago ... https://t.co/nDrmSlDf95",
    "306": "Detroit Pistons may avoid battle with revived Steph Curry when Golden State visits Friday https://t.co/3qlSnNC0bg",
    "307": "#OTDH In 2004, John Green threw a beer at Ron Artest - who along with Stephen Jackson of the Indiana @Pacers - fought back @DetroitPistons fans in the Malice at the Palace. Officials ended the game with 45.9 seconds left. Pacers won 97-82. https://t.co/LTBOFlPciw",
    "308": "Philadelphia 76ers reportedly engaged in talks with Detroit Pistons for Ben Simmons https://t.co/srHcBIU5y2",
    "309": "Jerami Grant is who he is — is that good enough for the Detroit Pistons now or in the future? Grant is a gifted scorer, quality defender and great guy. But the Pistons need to decide if he makes sense for the future https://t.co/rXoEFCbBOa",
    "310": "The Philadelphia 76ers are showing interest in acquiring Detroit Pistons forward Jerami Grant.  https://t.co/VPnAtNDO3j",
    "311": "Philadelphia 76ers reportedly engaged in talks with Detroit Pistons for Ben Simmons #BenSimmons #JeramiGrant #Philadelphia76ers https://t.co/u5ewbcjwyV",
    "312": "My 4th grade ass knew then what I know now...\nNOBODY WANT SMOKE FROM BEN WALLACE! @ripcityhamilton @DetroitPistons https://t.co/w1MeAKivqq",
    "313": "Got 2 tickets for sale for The Knicks vs Detroit Pistons on 12/21/21 🏀🏀 @nyknicks @NY_KnicksPR @DetroitPistons @NYIslanders @BrooklynNets @NYRangers @NewYorkRedBulls #Newyork #sports #basketball #ticket #Ticketmaster #vividseats #Maddisonsquaregarden",
    "314": "Golden State Warriors @ Detroit Pistons\n\nPlayer Points Projections\n\nhttps://t.co/nJ4qkMcLiC",
    "315": "#NBA75  Bet Of The Day \n\n🇺🇲 Detroit Pistons - GS Warriors\n🏀 Click on the link (1.83)\n\n🇺🇸 Denver Nuggets - Chicago Bulls\n🏀Under 212 (1.85)\n\n🇺🇸 Sacramento Kings - Toronto Raptors\n🏀 Over 217.5 (1.85)\n\nSeason: 17-0-18, -3.32 units\n#NBATwitter \nhttps://t.co/0WsGq44Rfv",
    "316": "NBA ML. Date: 11-19\nGolden State Warriors vs Detroit Pistons. 83.54%\nPointsBet. Warriors @ +255\nFanDuel. Pistons @ +280\n#arbitrage #bettingtwitter #bettingpicks #sportsbets #freepicks #freemoney #mlb",
    "317": "@DetroitPistons don't need Ben Simmons, he would slow down the development of cade and Killian and the 76ers want entirely too much",
    "318": "\"The team has engaged in ongoing discussions with the Detroit Pistons to acquire Grant, another forward, a young player, and a draft pick in exchange for Simmons, league sources said.\"\n(Per @PompeyOnSixers )",
    "319": "This would be a fine way to stunt the @DetroitPistons   progress by 3-5 years. https://t.co/73WlIC2bqS",
    "320": "Golden State Warriors (13-2, first in the Western Conference) vs. Detroit Pistons (4-10, 14th in the Eastern Conference) https://t.co/R48F5kAUPd",
    "321": "@DetroitPistons do it https://t.co/7Ku7T2nDzg",
    "322": "In case y’all didn’t know….this is Supreme Leader of #NorthKorea Kim Jong-un’s best friend #DennisRodman #basketball #GQ #SanAntonioSpurs #LosAngelesLakers #DallasMavericks #Dictatorship #China #Juche #sportsnews #Socialiststate  #ChicagoBulls #DetroitPistons #sports https://t.co/ROnCraUP5W https://t.co/AH0kt0eHS1",
    "323": "With roughly 45.9 seconds left and Indiana ahead, 97-82, the Pacers' Ron Artest fouled Ben Wallace of the Detroit Pistons, who shoved Artest, leading players and coaches from both teams to confront each other on the court. https://t.co/7GqMYmiBUc",
    "324": "ON THIS DAY - Things have gotten much haywire in the NBA on November 19, 2004, when an ugly brawl broke out near the end of a game between the Indiana Pacers and the Detroit Pistons.\n\n#NBA   #Pistons   #Pacers https://t.co/3KMreak2JA",
    "325": "@EvanKopitz @BellDavidC @MotorCityCruise @DetroitPistons Grand Rapids had the Griffins (Red Wings) &amp; Whitecaps (Tigers) since the 90’s, so having a G-League affiliate for the Pistons in GR isn’t impractical. However, as a GR native &amp; Pistons fan, I don’t feel right rooting for a Nuggets affiliate in my hometown, so let’s go Cruise!!!",
    "326": "Detroit Pistons reportedly discussed trade for Ben Simmons https://t.co/i5hq8WzoKn",
    "327": "the only 8 teams he has not hit 9 3s against:\n\nMilwaukee Bucks\nMiami Heat\nUtah Jazz\nIndiana Pacers\nDetroit Pistons\nHouston Rockets\nSan Antonio Spurs \nGolden State Warriors https://t.co/fyxn33MVbn",
    "328": "Pistons prepare local Detroit families for Thanksgiving https://t.co/nEl70iCjTB",
    "329": "Pistons prepare local Detroit families for Thanksgiving https://t.co/IgQ4zNoiSM",
    "330": "Pistons prepare local Detroit families for Thanksgiving https://t.co/lLK3iUwvQ8",
    "331": "Pistons prepare local Detroit families for Thanksgiving https://t.co/0NzWzZ6Bqu",
    "332": "@mjkara35 @DetroitPistons What?!? That sucks. Looks like the ones I used to see at the Taiwanese night market. What a bummer.",
    "333": "Pistons prepare local Detroit families for Thanksgiving https://t.co/7efR7rKc1G",
    "334": "Pistons prepare local Detroit families for Thanksgiving https://t.co/BSyWy3uLmX",
    "335": "Pistons prepare local Detroit families for Thanksgiving https://t.co/VGGq50ExNY",
    "336": "Pistons prepare local Detroit families for Thanksgiving https://t.co/HWz1DmcA9g",
    "337": "Pistons prepare local Detroit families for Thanksgiving https://t.co/E8Xjbo7JHL",
    "338": "Pistons prepare local Detroit families for Thanksgiving https://t.co/FEVnOkvGRe",
    "339": "Pistons prepare local Detroit families for Thanksgiving https://t.co/walhpAanEn",
    "340": "NBA ML. Date: 11-19\nGolden State Warriors vs Detroit Pistons. 0.46%\nPointsBet. Warriors @ -341\nBetMGM. Pistons @ +350\n#arbitrage #bettingtwitter #bettingpicks #sportsbets #freepicks #freemoney #mlb",
    "341": "Ben Simmons isn't worth trading for, a PG who have no perimeter or 3 pt.shooting will not fit the Detroit Pistons ! Let's give the young core-Cade,Sadiq,Killian,Saben and include Jeremy Grant,enough time to jell ! NO NEED TO RUSH !",
    "342": "Absolutely not @DetroitPistons https://t.co/zBWJZVZqiM",
    "343": "Ah I missed this today but the Simmons to Detroit rumours are back?\n\nSimmons is better than anyone on the Pistons, that's a no brainer.\n\nBUT, idk if I'd be comfortable giving up Grant PLUS a young guy and pick or whatever Morey's inflated asking price is for him.",
    "344": "@warriors See yall tomorrow against the Detroit pistons",
    "345": "Check out the latest posts at https://t.co/hSLWPTqFgg\n\nShould the #Pistons  consider trading Jerami Grant?\n\nTwo ways to trade for Marvin Bagley now\n\nIs the honeymoon over in Detroit for Troy Weaver?\n\nHow do the Pistons replace Kelly Olynyk\n\nTroy Weavers Trade History",
    "346": "Yo @TomGores @DetroitPistons WE DON'T WANT Ben Simmons, he's shook. We have a young team, build through the draft and player development, don't try to jump start this team by taking the bait on a name. When Daryl Morey calls... https://t.co/1lpq0CxrUz https://t.co/LMuEQfvHOm",
    "347": "@DetroitPistons do not pick up Ben Simmons. https://t.co/dR9e4ifxi8",
    "348": "Saturday Fight Live Tigers blog: Detroit Pistons Vs. Australia confirms Sherlock Holmes 3 shooting at dietary change in Attawapiskat",
    "349": "@DetroitPistons do not even have this conversation https://t.co/cBWeYSMOqO",
    "350": "No wonder the Detroit Pistons made the Jordan Rules\nhttps://t.co/vfXg0WGQIG",
    "351": "🏀 David takes on Goliath as the Pistons of Detroit face the red hot Warriors.\n\nOld foes, the Lakers and Celtics, do battle for the first time this season.\n\nAnd MVP Nikola Jokic hosts the raging Bulls.\n\nAll your tips, analysis &amp; previews - right here!🏀 \n\nhttps://t.co/cnJEuCfV9N",
    "352": "REPORT: The 76ers and Pistons have discussed a trade that would send Ben Simmons to Detroit and Jerami Grant, a young player, filler, and a pick to Philadelphia, via @PompeyOnSixers. https://t.co/kM91Pp4JCE",
    "353": "@DrewSherlock93 I didn't watch the doc but yeah, Indiana definitely bore the brunt of the suspensions. I'm referring to the painting with a broad brush of the city of Detroit and Pistons fans because of the actions of a few morons, idiocy I don't condone.",
    "354": "@ScArisen @notrazpberry Ben Simmons is the opposite of the “Goin to Work” culture we as Detroit Piston fans want to see. Grant may have some faults but he fits the culture of the team. He wants to improve and do well for us. Ben is just happy to be who he is and doesn’t seem to want more",
    "355": "@sixers y’all can keep Ben Simmons we don’t want him @DetroitPistons please don’t consider this trade",
    "356": "Man hell nah @DetroitPistons https://t.co/KM6aT9J1yE",
    "357": "@DetroitPistons wtf y’all doin? https://t.co/tCSBDVSp9k",
    "358": "The Detroit Pistons only have 150 made threes as a team this season, while Steph Curry has 85 on his own. https://t.co/nn6ASYLHtV",
    "359": "@DetroitPistons YALL BET NOT GIVE UP CADE FOR BEN SIMMONS I KNOW THAT!!!",
    "360": "Hinch: Carlos look…Detroit is home of Eminem, it’s the motor city and home of lions, the pistons and they have hockey…\nCarlos: uhhh Eminem lives in LA, and haven’t most of the plants moved out? And don’t the Lions suck along with the Pistons? Doesn’t seem like a title town… https://t.co/MhGCNfDwlv",
    "361": "NBA ML. Date: 11-19\nGolden State Warriors vs Detroit Pistons. 4.45%\nFanDuel. Warriors @ -295\nFOX Bet. Pistons @ +375\n#arbitrage #bettingtwitter #bettingpicks #sportsbets #freepicks #freemoney #mlb",
    "362": "@ClutchPointsApp @NBAMemes @PompeyOnSixers @DetroitPistons compete both now and in the future by keeping a core, a frontcourt duo. There’s a ton of talent in current roster. The current face of the Piston’s future is Cade. Jerami is a great guy to pair with Cade.",
    "363": "Dam r.i.p @Moe3 moe3\nhttps://t.co/CsPLHAGewU \nThis guy make good music  family  fuck I wish you well  @DannyAlwaysWin \n@StellarOrg \n@PistonPowered \n@DetroitPistons \n@CarlPickett10 \n@CadeCunningham_",
    "364": "@LegionHoops @PompeyOnSixers @DetroitPistons please don't do this trade.",
    "365": "@Jbbintrappin not dissing the city of Detroit it's more so in regards to the current state of the Pistons and Ben Simmons' desire to play for a contender",
    "366": "@DetroitPistons please trade for @BolBol the Nuggets are wasting his time and talent and we could use him!",
    "367": "@DetroitPistons Please no Ben Simmons trade. There's clowns in the fanbase suggesting we blow up the rebuild, trade for Ben and crawl into a play-in spot. These people are not true representations of the fan base. In Cade we trust.",
    "368": "@NHLtoHouston Not sure what “National Jai-Alai Association” is even after trying to look it up?\n\nThe Suns lost the NAS (Northern Arizona Suns) G-League team to Detroit Pistons last year, now Motor City Cruise.\n\nThis “new professional team” is most likely the new G-League team they need.",
    "369": "Detroit Pistons get big boost from backup PG Cory Joseph in 97-89 win over Indiana Pacers - Detroit Free Press\nhttps://t.co/vzc9NIkSgS",
    "370": "The @warriors just held a professional NBA team to 8 POINTS in a quarter. \n\nThat’s some ‘04 Detroit Pistons defensive greatness.",
    "371": "Fuck no @DetroitPistons do not do this dumbass shit https://t.co/roG3eYyvf3",
    "372": "@DetroitPistons this Ben Simmons talk gotta stop! He is not a Detroit player! This dude is not a team player, he is known to not work hard, and on top of all that he can’t shoot AT ALL!!! I am a #pistonsone member but if this is the kind of player we are bringing in? I’m out.",
    "373": "@spencetagradio Please no @DetroitPistons you have put through enough torture. Don’t do this",
    "374": "I'm not against having Ben Simmons in Detroit. I am against it for JG, Kelly O and Saddiq #Pistons https://t.co/gEd0JseuK9",
    "375": "Aye..@dmorey ..please trade ben simmons! I love this team so much without him. send him to @DetroitPistons ..let his career die there and let's ball with Grant..leggoo",
    "376": "@BigDaddyDett @DetroitPistons now that is fair",
    "377": "@MisterCiv @DetroitPistons Except he prob didn’t hate playing basketball for money too lol",
    "378": "@BigDaddyDett @DetroitPistons i remember another time we signed a big name who couldn't shoot https://t.co/r7eg6qQER7",
    "379": "@BigDaddyDett @DetroitPistons u talkin bout simmons ?",
    "380": "@DetroitPistons please don’t do that",
    "381": "REPORT: The #76ers and #Pistons have discussed a trade that would send Ben Simmons to Detroit and Jerami Grant, a young player, filler, and a pick to Philadelphia.\n\n(via @PompeyOnSixers)\n\n#NBA75 | #NBATwitter https://t.co/xhzwjSlC09",
    "382": "#NBA (Temporada Regular) - Encerrados:\n\nCharlotte Hornets 97 x 87 Washington Wizards \nDetroit Pistons 97 x 89 Indiana Pacers \nAtlanta Hawks 110 x 99 Boston Celtics \nBrooklyn Nets 109 x 99 Cleveland Cavaliers \nMiami Heat 113 x 98 New Orleans Pelicans",
    "383": "➡️ A $5M gift for @DetOperaHouse from @WDavidsonFDN -- named for past CEO of @GuardianIndust automotive glass manufacturer who owned @DetroitPistons + @TBLightning. The @UMich + @waynestate alum died in 2009.\n\nhttps://t.co/qOqfr9P94m via @freep @Philanthropy @CityofDetroit",
    "384": "@warriors Next up the Detroit pistons",
    "385": "Pistons trade doesn't make sense... and Harden would never go to Detroit.  Can the media come up with some what realistic scenarios?  If you need assistance, I'm available. https://t.co/OcqABmwhku",
    "386": "@LegionHoops @PompeyOnSixers Started from James Harden now to Grant...\n\nAnyways i am indeed excited to see Ben simmons in Detroit Pistons jersey. Lets see if that place can cure Ben simmons mental health problem 😂😂😂😂",
    "387": "@theScore @DetroitPistons  DONT do it pls",
    "388": "@PompeyOnSixers @PhillyInquirer @DetroitPistons  don't want Simmons..\nSorry",
    "389": "@RaymondJoka @DetroitPistons Yes do it",
    "390": "Same People Against Ben Simmons coming to Detroit Pistons Loved Andre Drummond Killian Hayes Blake Griffin n Washed Players Detroit Sports Been Trading For Last 50 yrs 🤣🤣🤣",
    "391": "Do NOT DO THIS TRADE PLEASE @DetroitPistons https://t.co/05nRn0VBaP",
    "392": "The Philadelphia 76ers and Detroit Pistons are having ongoing discussions on a Ben Simmons trade, per @PompeyOnSixers.\n\nSimmons would head to Detroit while Jerami Grant, a young player, and a pick would head to the Sixers. https://t.co/JdqfhmkwbU",
    "393": "Ben Simmons’ contract is enough for me to not like any trade to Detroit. There will be better young guys in the future the Pistons could trade for.",
    "394": "Plz plz plz plz plz don’t trade for Ben Simmons, wont fit with Cade @DetroitPistons @PistonsThoughts",
    "395": "@detroit_chill @DetroitPistons Aye it was bound to happen",
    "396": "If Ben gets traded to Detroit, then my Christmas gift to myself will be a Ben Simmons Pistons jersey, Cade Cunningham Pistons jersey, and a Tyrese Maxey Sixers jersey. If Ben ends up with the Pistons, that means Maxey is officially the franchise PG.",
    "397": "Let’s make it happen @DetroitPistons ✊🏾 https://t.co/n63CtfKzTQ",
    "398": "The @DetroitPistons received the Detroit Public Safety Foundation Public Safety Partner Award tonight for their work with first responders! Happy to receive the award on behalf of the organization from the great Dave Bing! https://t.co/AYe9t46Oh6",
    "399": "@IsaacCastor @DetroitPistons Unfortunately the Pistons have been cheeks the last several years I didn’t wanna break the streak. But I did for this game against Orlando on Halloween",
    "400": "@DetroitPistons You're cool I bet.",
    "401": "Crying and throwing up at even the thought of this. Dont even dare @DetroitPistons https://t.co/4dJuNbsnVW",
    "402": "@DetroitPistons time to put warriors to bed and then send the lakers on their way to the lake no offence to anybody offended @DetroitPistons 🙌🏼 thats my team right their our pistons goats https://t.co/Rkd0ZlL870",
    "403": "🙏🏾🙏🏾🙏🏾🙏🏾 RT @LegionHoops: REPORT: The 76ers and Pistons have discussed a trade that would send Ben Simmons to Detroit and Jerami Grant, a young player, filler, and a pick to Philadelphia, via @PompeyOnSixers.",
    "404": "DONT TOUCH THE YOUNG CORE PLAYERS PLEASEEEEE @TomGores @DetroitPistons https://t.co/bnKblI8hhh",
    "405": "@huugs_m @Jack_Nicholsona @NotKevJayMalone Pistons did that in Detroit. Did not work out well",
    "406": "The Detroit #Pistons are in a discussion with the Philidelphia #76ers about a deal that could send Ben Simmons, to the Motor City. Reportedly the deal would include Jerami Grant, a young player and draft pick(s). \n\n Source: @LegionHoops https://t.co/j1cF722CoY",
    "407": "@LegionHoops @PompeyOnSixers Please no @DetroitPistons https://t.co/ZywuHunXgF",
    "408": "The team has engaged in ongoing discussions with the Detroit Pistons to acquire Grant, another forward, a young player, and a draft pick in exchange for Simmons, league sources said.",
    "409": "According to Keith Pompey of the Philly Inquirer, the Sixers are in discussions with the Detroit Pistons for a Simmons trade. The key player in Detroit’s package is Jerami Grant, but the team is expected to attach at least two more players and a draft pick to make the deal happen",
    "410": "The best is the Detroit sports fans that don’t watch the Pistons show interest suddenly cause of Ben Simmons news",
    "411": "So, I've seen a mix of #Pistons fans with different opinion on this. With the Detroit discussing a trade for Ben Simmons, do you want them to get him. The deal would feature Grant, a young player and draft pick(s).",
    "412": "@TimothyTheFirst Ben Simmons has no real fit with the current Detroit Pistons roster.\n\nAnd the rumors are swirling around Jerami Grant no less... Trade him and the Pistons won't average more than 80 PPG.😑",
    "413": "76ers &amp; Pistons have discussed a TRADE! \n\n76ers receive: Jerami Grant, “a young player,” filler \nPistons receive: Ben Simmons, pick \n\nThoughts? Who should that “young player” be from Detroit? 🤔\n\nVia. @PompeyOnSixers - Philadelphia Inquirer https://t.co/zFibHNritR",
    "414": "It blows my mind that teams like @SacramentoKings  @cavs  @DetroitPistons    Dont sign @MarkJackson13  this game deserve a opportunity in the league",
    "415": "@ChuckBaskin @DetroitPistons Fuck no",
    "416": "@PistonsHooper @DetroitPistons @PriorityHealth Looking good Hooper! I love the jeans!",
    "417": "Never. Don’t do it @DetroitPistons https://t.co/e5VPuJ1ttS",
    "418": "My latest Film Don’t Lie at ⁦@detroitbadboys⁩ dives into something I talk a lot about during #Pistons games, momentum swings \n\nCheck it out🔥\n\nFilm Don’t Lie: Momentum swings can turn a game around or turn a deficit into a blow out - Detroit Bad Boys https://t.co/fZ9tr7lEO5",
    "419": "REPORT: The 76ers and Pistons have discussed a trade that would send Ben Simmons to Detroit and Jerami Grant, a young player, filler, and a pick to Philadelphia.",
    "420": "@DetroitPistons if you trade Jerami and young assists for Ben Simmons I will end it all I hope you know my life is in your hands",
    "421": "Figure it out @DetroitPistons 🙏🏾 https://t.co/FuqZUQTCU0",
    "422": "The Philadelphia 76ers are showing interest in acquiring Detroit Pistons forward Jerami Grant.  https://t.co/GUoUaJSbZN",
    "423": "Go get Ben Simmons @DetroitPistons",
    "424": "don’t you fucking dare @DetroitPistons https://t.co/j81mkFU3Mh",
    "425": "@LegionHoops @PompeyOnSixers Bruh the Detroit Pistons ranked last in the Offensive end and they want a dude that afraid to take a wide open layup lmao😭😭",
    "426": "The 76ers and Pistons have discussed a trade that would send Ben Simmons to Detroit and Jerami Grant, a young player, filler, and a pick to Philadelphia 👀\n\n(via @PompeyOnSixers)",
    "427": "Warriors are on the second half of a East coast road trip back-to-back in Detroit tomorrow night. \n\nI think the pistons have a shot to catch the best team in the league at home 🤷‍♂️",
    "428": "please dont do this @DetroitPistons https://t.co/t9HUtrHdGd",
    "429": "Detroit Pistons January 2022 Starting Lineup\n\nPG Cade Cunningham\nSG Killian Hayes\nSF Saddiq Bey\nPF Ben Simmons\nC Isaiah Stewart",
    "430": "REPORT: The 76ers and Pistons have discussed a trade that would send Ben Simmons to Detroit and Jerami Grant, a young player, filler, and a pick to Philadelphia, via @PompeyOnSixers.",
    "431": "“League sources have said the team is having ongoing discussions with the Detroit Pistons to acquire Grant, another forward, a young player, and a draft pick in exchange for Simmons” \n\n@PompeyOnSixers \n\nThoughts⁉️\n\n#sixers",
    "432": "@nizcomix @statmuse @CadeCunningham_ @DetroitPistons Keep lying to yourself",
    "433": "@BlackFlint80 @DetroitPistons Eh, seems like preorder only",
    "434": "@jgrendel1 @DetroitPistons Already did. Been out for 3 days now.",
    "435": "Have the @DetroitPistons done a Martin themed city edition jersey yet?",
    "436": "@ProPistons @DetroitPistons Ahhh as long as the Jameson is flowing I don’t care what the door says.",
    "437": "@Konop8 @DetroitPistons @Ticketmaster For michigam residents only!\n\nWe got hosed",
    "438": "@BSchoch12 @DetroitPistons Naw, let's go next door to your bro's spot next door. My wife thinks I have a \"stan\" working at the mixing board (lol).",
    "439": "@tweettweetman21 @DetroitPistons @Ticketmaster One shining memorable moment!!",
    "440": "@ProPistons @DetroitPistons I’m down",
    "441": "@BSchoch12 @DetroitPistons Post game drinks at the mixing board. Maybe earlier if it's a blowout (lol). https://t.co/NiG1rlVGCb",
    "442": "Are enough #pistons @DetroitPistons Twitter folks going to the game tomorrow to have a meet up?",
    "443": "@MIPLonzoSZN @statmuse @CadeCunningham_ @DetroitPistons Busting a nut in yo mama",
    "444": "@DetroitPistons I get to go to my first ever @NBA game and watch y’all play the warriors tomorrow! Let’s gooooo!!",
    "445": "@mtnpeek on today’s @warriors vs @cavs game: Both teams are “too friendly. @KingJames and @Money23Green are very close friends. @Lakers and @celtics hated each other in the 80s as well as @DetroitPistons and @chicagobulls in the 90s.”"
}