{
    "0": "Oh @wojespn the correct tweet is:\nThe Utah Jazz were hosting the 2023 NBA All-Star game. https://t.co/7lrsn5aRrY",
    "1": "\"The rebounding's gotta be there.\"\n\nHead Coach James Borrego talks with Eric Collins about a tough matchup tonight against the Utah Jazz.\n\n#AllFly | @hornets https://t.co/ClpH5oOyZF",
    "2": "@utahjazz get well soon dok 💙",
    "3": "Utah Jazz will host 2023 NBA All-Star Game.",
    "4": "First five 5️⃣\n\n#StartingLineup | @ZionsBank https://t.co/ZVVBglv5pz",
    "5": "@big_business_ Watered down version of the Utah jazz",
    "6": "@wojespn Move the all-star game.  Utah has forfeited it.  @NBA @utahjazz",
    "7": "Utah Jazz Starters:\n\nMike Conley\nDonovan Mitchell\nRoyce O'Neale\nJuancho Hernangomez\nRudy Gobert\n\nPlayers out:\nBojan Bogdanovic\nDanuel House\nHassan Whiteside\n#TakeNote #NBA #NBATwitter #NBA75",
    "8": "Tonight's starting lineup for the Utah Jazz: Mike Conley, Donovan Mitchell, Royce O’Neale, Juancho Hernangómez and Rudy Gobert https://t.co/bVWH4AMCA2",
    "9": "GAME TIME!\n\n📍 - HOME\nVS - @utahjazz \n⏰ - 7PM EST\n📺 - @HornetsOnBally\n📻 - @WFNZ 610 AM/92.7 FM",
    "10": "I think it might be safe to say the Utah Jazz *were* hosting the 2023 All-Star game https://t.co/64VOsBfdoO",
    "11": "It’s always fuck the Utah Jazz https://t.co/6j462bhL3B",
    "12": "G🟢 TIME!\n\n📍 - 🏠\n🆚 - @utahjazz \n⏰ - 7PM EST\n📺 - @HornetsOnBally\n📻 - @WFNZ 610 AM/92.7 FM https://t.co/cchIE3Ur9r",
    "13": "LET'S GO!!!  #utahjazz #TakeNote",
    "14": "BREAKING: Utah Jazz will host 2023 NBA All-Star weekend. \n\nThoughts? 🤔 https://t.co/OAJYatNJTq",
    "15": "Tonight has a chance to be ultra embarrassing for the Utah Jazz.",
    "16": "What is this about Terry Scott's traveling with the Utah Jazz? There are more rumors about this team everyday....",
    "17": "The Utah Jazz are hosting the 2023 NBA All-Star game.",
    "18": "@wojespn What joke @utahjazz are.  Why do you disrespect women’s sports?  Do you not believe women deserve a fair and level playing field?",
    "19": "The same Utah Jazz that included J*rd*n P*t*rs*n in their fan pass this month? https://t.co/Y8nLubcpHK https://t.co/3bR65g7K2E",
    "20": "The Utah Jazz will host the 2023 NBA All-Star game.\n\nThoughts?",
    "21": "@wojespn The Utah Jazz are the Meg Griffin of the NBA",
    "22": "@paradoxsmiles @bootylickingman @runner_girl34 @AlistairKimball @andyblarsen Transgender females do have advantage. The woman sports are ruined because of it. The Utah Jazz take money from China. The killed Christians and Muslims. I think the NBA is very hypocritical on human right issues .",
    "23": "[📺LIVE - 00H10] 🏀 #NBA \nUtah #Jazz @ Charlotte #Hornets en direct sur beIN SPORTS MAX 4\n#NBAextra",
    "24": "The Utah Jazz are hosting the 2023 NBA All-Star game. https://t.co/n2g1QCjbv7",
    "25": "Friday Night Hoops! \n\n@hornets at the Hive to take on the @utahjazz! \n\n@ashahahmadi and @WesGotRange are taking you up to tipoff right now only on Bally Sports Southeast! \n\n#AllFly https://t.co/nWLTSorqdW",
    "26": "@NBASarah Why are religious zealots always the most ignorant and intolerant ?\nWhy is religion always so far behind social progress ?\n\nAs a huge basketball fan and Jazz fan I hope the NBA pulls the all star game. Damn bigots in Utah \n#HB11 @utahjazz #Utah #TransRightsAreHumanRights",
    "27": "Drove to Charlotte from Charleston to watch our guys! Let's get this W! #lesolsonit #whereyouwatching @utahjazz https://t.co/E1irAr8Eke",
    "28": "Utah Jazz statement opposing HB11 that will prevent transgender girls from competing in high school sports in the state of Utah.\n\nhttps://t.co/bZsPhYYw9m\n\n@utahjazz #TakeNote https://t.co/CyCAeKxeCd",
    "29": "The woke @utahjazz should focus on winning games, instead of discriminating against naturally born women.  The Jazz organizations turned into a joke and a hoax.",
    "30": "Uniforms for Utah Jazz vs Charlotte Hornets at 4:00 PM.\n\n#TakeNote #AllFly https://t.co/00Xn9hffSl",
    "31": "Okay, Utah Jazz, I think we've been stung enough the last couple games! In honor of John Stockton's birthday tomorrow, let's swat the Hornets tonight and get a win! #GoJazz #FlyTheNote #TakeNote https://t.co/4BioRGGPQI",
    "32": "ALL CLASS!!! \n\nHe and John Stockton deserved to be NBA Champions \n\n@utahjazz @NBA https://t.co/qImvFGnxgj",
    "33": "@NBASarah Preach. Thank you Utah jazz. Music to my ears.",
    "34": "@utahjazz need to do this. My kids were with me in New York and died laughing every time. @RyanQualtrics https://t.co/JdEikIup2g",
    "35": "The #Utah Jazz stand up for Utah’s transgender community and in opposition of Utah lawmakers ban on transgender youth in sports. https://t.co/h82EJhbpS9",
    "36": "The Utah Jazz issued a statement condemning the passage of the HB11 bill that will prevent transgender girls from competing in high school sports in the state of Utah. @kslsports \nhttps://t.co/VYO9DfUXPH",
    "37": "The @utahjazz announced that second-year center Udoka Azubuike has undergone season-ending ankle surgery. \n\n#TakeNote \n\nhttps://t.co/dZF6PPei8c",
    "38": "💥🔥 Fri Mar 25🏀NBA💥🔥\n\n                  🔥LFG GUYS🔥\n\n                  💰Best of luck💰\n\n1. Utah Jazz @ Charlotte Hornets\n\nCharlotte Hornets +4.0\n\n2. New York Knicks @ Miami Heat\n\nNew York Knicks +8.0",
    "39": "We have 9 games to go! Single digits!\n\nTune in to the Jazz Pregame Show at 4:30 PM MT on @ATTSportsNetRM 📺 https://t.co/xoEPh8iYiT",
    "40": "@KSL5TV @utahjazz @kslsports Jazz are just worried they’ll lose the all-star game next year.  Money motivates…",
    "41": "@KSL5TV @utahjazz @kslsports But genocide in Communist China is alright.",
    "42": "The @utahjazz have issued a statement condemning override of veto on HB11 today. #TakeNote \n\n\"The Utah Jazz oppose discriminatory legislation.\"\n\nMORE via @kslsports https://t.co/VYO9DfDmr7",
    "43": "Hey @utahjazz to little too late on the trans bill. Shameful really.",
    "44": "🏀LIVE ~ Utah Jazz vs Charlotte Hornets - NBA League 2022 🇺🇸\n📆 : On Friday. March 25 /2022 ⏰ : 6:00 PM\n🔴🎥𝑳𝒊𝒗𝒆 𝒔𝒕𝒓𝒆𝒂𝒎 𝒉𝒆𝒓𝒆 ➡️ https://t.co/SH7jHOYulv ✅",
    "45": "After suffering an ankle injury on assignment in the G League earlier this month, Utah Jazz center Udoka Azubuike had a surgical procedure done Friday to repair multiple ligaments and to stabilize a joint, and will miss the remainder of the season. https://t.co/WthqYm0XKQ",
    "46": "Jazz center Udoka Azubuike will miss the rest of the 2021-22 season after undergoing surgery on Friday to repair multiple ankle and foot ligaments in his right foot to stabilize the Subtalar joint. Azubuike averaged 4.7 points and 4.2 rebounds per game this year.  #utahjazz #NBA",
    "47": "@KellyAuCoin77 @utahjazz @spidadmitchell Good guy, too. This town is lucky to have him here.",
    "48": "@ryanwmcdonald @adonsports Where is the rest of it @utahjazz?",
    "49": "March 25, 2012: Atlanta #Hawks defeated the Utah Jazz in the very 1st 4OT game since Phoenix-Portland in 1997 with Joe Johnson scoring a game-high 37 PTS fueled by clutch shots down the stretch\n https://t.co/ICGmglWcYp",
    "50": "@utahjazz Poor guy hope he gets feeling better soon",
    "51": "Udoka Azubuike underwent successful surgery today to repair multiple ankle and foot ligaments in his right foot to stabilize the Subtalar joint. Azubuike will be out for the remainder of the 2021-22 season. \n\nhttps://t.co/CG3G3LUAJR",
    "52": "With hosting duties for next year's All-Star Game hanging in the balance, the @utahjazz respond to the legislature's veto override of the transgender sports bill https://t.co/ENV92QeFCK",
    "53": "@utahjazz Because they should.",
    "54": "The @utahjazz issued a statement opposing the passage of HB11, a bill that will prevent transgender girls from competing in high school sports. \n\n#TakeNote \n\nhttps://t.co/XGyqvBVaWn",
    "55": "This just in. Donovan Mitchell is good at basketball.\n\n@utahjazz \n@spidadmitchell https://t.co/qf81VP1Kd0",
    "56": "@utahjazz I’m on my way! Rooting on my team in Charlotte tonight! #TakeNote",
    "57": "@utahjazz Are the Jazz tanking for the 6th seed?",
    "58": "🚨POTD🚨 46-16🔜47-16\n\nKansas ML/Utah Jazz ML/ +112🔒\n\nLet’s cash another one tonight. Starts in 1 hour. LFG🚂🚂🚂🚂🚂",
    "59": "The Utah Jazz condemned the Utah State Legislature overriding the HB11 veto, calling it discriminatory legislation. \n\nHere is the team's full statement: \n\n#utahjazz #NBA https://t.co/GXAgvi2RL1",
    "60": "Im glad I stopped following the Utah Jazz when I did. This is far from discriminatory legislation it’s actually anti-discriminatory legislation by protecting girls sports. https://t.co/GwE0kCqhhe",
    "61": "The @utahjazz need to bounce back after 2 hard loses. Can they do it tonight against the @hornets  or they looking at 3 game losing street? \n\nJazz at Hornets \nPregame begins at 4pm with @JakeScottZone @tlacomb \n\nTipoff at 5pm with @DLocke09 \n\nListen at @ZoneSportsNet @kslsports https://t.co/rqeOu0SLOE",
    "62": "Utah Jazz statement #transgender veto override.\n\n“The Utah Jazz oppose discriminatory legislation. We are committed to our values of inclusivity, mutual respect, and fair play. Beyond basketball, we hope for an equitable solution that shows love and compassion for all our youth.”",
    "63": "In response to the Utah Legislature’s override of Gov. Spencer Cox’s veto of HB11, the @utahjazz released the statement below. #TakeNote https://t.co/jXnBkiVtlQ",
    "64": "NOW: The @utahjazz has issued this statement on the #utleg's veto override, saying the Jazz \"oppose discriminatory legislation.\" #utpol #utleg \n\n\"Beyond basketball, we hope for an equitable\nsolution that shows love and compassion for all our youth.” https://t.co/qyEz3c0f4O",
    "65": "Utah Jazz at Charlotte Hornets odds, picks and predictions https://t.co/oPOFIkbXDy",
    "66": ".@utahjazz transgender sports bill override \"Utah Jazz oppose discriminatory legislation. We are committed to our values of inclusivity, mutual respect, and fair play. Beyond basketball, we hope for an equitable solution that shows love and compassion for all our youth.”  #utleg",
    "67": "The Utah Jazz released the following statement on the #utleg's override of Gov. Spencer Cox's veto of HB11, which bans transgender girls from participating in HS sports. \n\nhttps://t.co/XneCF5BwH2 https://t.co/yZoCrY5Kqr",
    "68": "Are the Utah Jazz ready for the NBA Playoffs? https://t.co/V1MHrSxitB via @slcdunk",
    "69": "@cam_utah You don’t think “The Utah Jazz oppose discriminatory legislation” makes a statement?",
    "70": "Utah Jazz response to today’s events https://t.co/v2IgSXocpC",
    "71": "The @utahjazz just issued a press release on HB11, saying they \"oppose discriminatory legislation. ... We hope for an equitable solution that shows love and compassion for all our youth.\" #utpol #utleg #TakeNote https://t.co/UUL9NrvWYm",
    "72": "The Utah Jazz statement regarding the Utah legislature overriding Gov. Cox's veto of HB11: “The Utah Jazz oppose discriminatory legislation. We are committed to our values of inclusivity, mutual respect, and fair play...",
    "73": "Utah Jazz statement on the HB11 veto override: \n\"The Utah Jazz oppose discriminatory legislation. We are committed to our values of inclusivity, mutual respect, and fair play. Beyond basketball, we hope for an equitable solution that shows love and compassion for all our youth.”",
    "74": "@utahjazz Please tell me Pascall is going to see backup center minutes",
    "75": "The Utah Jazz have released a statement opposing the state legislature’s override of Gov. Cox’s veto of the anti-transgender sports HB11, calling it “discriminatory legislation.” https://t.co/EtMxJ2WxnD",
    "76": "Update:\n\nHassan is out. https://t.co/FKw7VRjL6r",
    "77": "NEW: @utahjazz release statement on HB11.\n\n“The Utah Jazz oppose discriminatory legislation. We are committed to our values of inclusivity, mutual respect, and fair play. Beyond basketball, we hope for an equitable solution that shows love and compassion for all our youth.”",
    "78": "Are the Utah Jazz ready for the NBA Playoffs? #takenote https://t.co/vWZU8i37cZ",
    "79": "From @utahjazz in regards to HB11:\n\n“The Utah Jazz oppose discriminatory legislation. We are committed to our values of inclusivity, mutual respect, and fair play. Beyond basketball, we hope for an equitable solution that shows love and compassion for all our youth.”\n\n@abc4utah",
    "80": "Utah Jazz statement on HB11 override: \n\n“The Utah Jazz oppose discriminatory legislation. We are committed to our values of inclusivity, mutual respect, and fair play. Beyond basketball, we hope for an equitable solution that shows love and compassion for all our youth.”",
    "81": "I thought Jerry Sloan died, but here he is today at Mac Haik Chevrolet. Man, I hate the Utah Jazz. @VernonMaxwell11 https://t.co/fHn9OL0wsD",
    "82": "Are the Utah Jazz ready for the NBA Playoffs? https://t.co/AiUJm9yBKK",
    "83": "@utjazzmuse @utahjazz From what I've been told we're all just missing context. They've had injuries and they've had to do very difficult stuff like play basketball games. You know... stuff every team has to go through. So we should ignore it. 🙄",
    "84": "He can’t walk, he can’t talk, but he can cheer for the @utahjazz 😎 #TakeNote https://t.co/jDey5xfcKO",
    "85": "@Dom_2k Utah jazz without Rudy gobert",
    "86": "@utjazzmuse @utahjazz Tough to include January as an indicator on this team. They are better than their record showed that month. Can’t fault them for Covid/injuries.",
    "87": "@utjazzmuse @utahjazz My bad I thought this was stat muse lol",
    "88": "Don't forget to check out today's Hornets Hive Cast!\n\n@wzaldridge of @WCCBCharlotte helps preview tonight's @hornets game against the Utah Jazz!\n\n@MELOD1P and @PJWashington our players to watch for this homestand finale!\n\n#AllFly \n\nhttps://t.co/OqDLGg8cQQ",
    "89": "I'd just like everyone to know that if Donovan Mitchell scores at least 8 points tonight, he'll pass Gordon Hayward for 8th place on the Utah Jazz all-time scoring list. \nIt took Hayward 516 games to score that many points. \nIt took Mitchell 339.",
    "90": "@WesGolfer23 @utahjazz My Lakers? What",
    "91": "The @UtahJazz will look to snap their two-game losing streak tonight in a crucial game against the @Hornets. \n\n#TakeNote \n\nhttps://t.co/Qzefp7fgmm",
    "92": "It’s better for my bank account that I’m just now realizing Charlotte is only a six hour drive from here. #utahjazz #vagabondfans @utahjazz #northernvajazzfans",
    "93": "Thinking about betting on Utah Jazz vs Charlotte Hornets (NBA)?  Find out what pick Pine member @7up3r locked in for the game.\n\nhttps://t.co/yeCP36i4EB",
    "94": "@Aza_Analyzer @utjazzmuse @utahjazz Yeah it's a good thing that I am not a Jazz fan and only got into watching them because of Mitchell. Would have loved for him to stay in Utah but it's not looking good as of now",
    "95": "@utjazzmuse @utahjazz Good thing that’s not the place we were on all season.  Like ur lakers!!",
    "96": "@ashleylynch @KuntaJay It's #Uah! What do you expect?! Go #University of #Utah! Go #UtahJazz! xoxo",
    "97": "@utjazzmuse @utahjazz Kinahan laughed &amp; scoffed mightily on air at this Tweet in response to DJ asking how the Jazz would finish (after the ASG). They are now 9-6 &amp; I can see at least 5 more likely losses in the remaining 9. Maybe 13-11 rather than 11-13. Not exactly peaking.\nhttps://t.co/GywzNW4db2",
    "98": "On the latest \"How 'Bout This Jazz\" podcast episode, @tribjazz &amp; @XoelCardenas talk about reports saying Utah Jazz coach Quin Snyder is a candidate for possible future head coach openings with the Lakers and Spurs.\n\nListen to the full episode here. ➡️ https://t.co/R32KTfW63H https://t.co/Vf1bOsSUse",
    "99": "Carsen Edwards (@Cboogie_3) tough 🔥🔥 34 pts, 6 3PM &amp; 2 stls last night. 🎥: @ashtenjewell @slcstars #nbagleague #utahjazz https://t.co/vH5nSuhf8H",
    "100": "@utjazzmuse @utahjazz Well the team got covid late compare to other teams. Than injury to Bojan and Rudy few games.",
    "101": "@JohnRandak @BensHoops @utahjazz @hornets Smooth as silk",
    "102": "@JamesMy17561684 @BensHoops @utahjazz @hornets I haven't had time but I can assure you it's pure ✊🏼",
    "103": "@RaeAck13 @BensHoops @utahjazz @hornets Did you work on that corner 3?",
    "104": "@utahjazz I have information about Rudy Gobert that you will want to know",
    "105": "The Sharetix community loves cheering on the Jazz. Thank you Utah Jazz for the great tickets to the game. It was a tough loss to the Rockets, but a late rally in the fourth quarter was pretty exciting. https://t.co/lqbmvqeBgQ",
    "106": "@RonSzoke @TristNFL @BradBiggs Then they can have pick up basketball or football games with the Utah Jazz",
    "107": "Last chance to dance: Tonight's @hornets game vs @utahjazz is the last Hive 75 drop of the season. \nCollect &amp; hold ALL 8 commemorative #NFTs by April 1 to earn 2 suite tickets with other fans for the season finale against the Wizards on Apr 10. #utility\nhttps://t.co/LlR5jHp5vC https://t.co/FwQsUg0KqP",
    "108": "Today's NBA Consensus (So Far):\n\nDetroit Pistons 73%\nMiami Heat 71%\nMinnesota Timberwolves 70%\nPhiladelphia 76ers 66%\nUtah Jazz 64%\nPortland Trail Blazers 61%\nAtlanta Hawks 57%",
    "109": "NBA Betting Preview: Charlotte Hornets vs. Utah Jazz - Friday, March 25, 2022 https://t.co/S13VxDnEsq",
    "110": "if u black and a utah jazz fan then ik u like yt women",
    "111": "@utjazzmuse @utahjazz Yeah I think we aren't going anywhere in the playoffs",
    "112": "The last time the LA Clippers had a Friday night home game before tonight:\n\nGame 6 va the Utah Jazz https://t.co/484XDYFFDT",
    "113": "I absolutely believe the @utahjazz will win today. Fight me. #TakeNote https://t.co/XnFkpmlmuq",
    "114": "@utahjazz @UofUHealth Keep it up @spidadmitchell",
    "115": "March 25, 2012: Atlanta #Hawks defeated the Utah Jazz in the very 1st 4OT game since Phoenix-Portland in 1997 with Joe Johnson scoring a game-high 37 points fueled by clutch shots down the stretch https://t.co/4VHTag2REN",
    "116": "Utah Jazz star Rudy Gobert's quest for his fourth DPOY\nhttps://t.co/2mrxyQ7i2J",
    "117": "New post: \"Cappers Picks • PITBULL BARKING NBA\" Utah Jazz vs Charlotte Hornets UNDER 230.5 -110 (7:10 PM)\nDetroit Pistons -4.5 -110 Washington Wizards (7:10 PM)\n\nStatistics: Posted by pitbull6 — Fri Mar 25, 2022 1:33 pm\n\npitbull6 https://t.co/kfNftnjjla",
    "118": "The Jazz take on the Hornets today at 4:30pm!\n\n@utahjazz | #TakeNote https://t.co/whJDRkYZTP",
    "119": "@CJsSayingIt @spidadmitchell @Joeingles7 @utahjazz @realsaltlake @UtahGrizzlies @WNBA @UtahRoyalsFC @SLCountyDems @girlscouts @mormonweg @SchottHappens @betterutah @slcschools @GraniteSchools @MurraySchoolsUT @CC_Utah @GEM_Stories @NateForUtah @beckyforutah @EvanMcMullin #TeamWeston stands with transgender youth. HB11 is cruel and wrong. We were proud to join the rally last night at the State Capitol and urge the #utleg to let @GovCox’s veto stand. #utpol #TransRightsAreHumanRights https://t.co/xRrqZXMW60",
    "120": "With all the talk regarding transgender kids in Utah, I keep coming back to the thought that one (and the highest profile) of the Utah Jazz owners has a trans daughter. I can only imagine how these things make him feel as a parent and athlete.",
    "121": "@KGsGOAT Because its the Utah Jazz. Hard to take anything seriously.",
    "122": "I'm a @utahjazz fan and was excited when the @NBA All Star game was announced for SLC. But I fully agree, it should be pulled. https://t.co/Y4aE5sCzLK",
    "123": "@ByTheNumbers_fr @MiamiHeat_Fra @MiamiHeatFR @UtahJazz_France @SunsFR @BucksFR @Akumpo34france Tkt pas de soucis 🙂\nBridges pour moi 🔒",
    "124": "@kimbojorque I hope the @NBA and @utahjazz are ready. Do not play the all star game in slc.",
    "125": "Obviously NetRtg is effected by defense w/ and w/o Draymond but EOD 110 points/poss ranks BELOW league avg (111.6) .....\n\nand 119.1 would rank higher than best O in Nba (117.5 UTah Jazz).  \n\nPer @cleantheglass",
    "126": "@Based_Dan @FSNBA_ @kobebryant Yo that Utah jazz team was solid. DWill was a monster.",
    "127": ".@utahjazz fans, if it feels like things have been rough lately, it's because it has.\n17-18 in the last 35 games. A ~38 win pace. That would be 8th in the west. https://t.co/ApGWXa6kIY",
    "128": "@pvrisrex Utah Jazz right there, but then again… Washington Football Team🥴",
    "129": "NBA Bets for Friday, 3/25\n\n• DET PISTONS -4.5 \n• UTAH JAZZ -3.5 \n• GS WARRIORS +2.5 \n• DAL MAVERICKS +3.5 \n• CLIPPERS +5.5 \n\n7-6 this week \n96-72 in 2022 on @BetSlippin @SportsBookWire vs @tipico odds https://t.co/HIk4ONLXwZ",
    "130": "After last year's playoffs, you need to reevaluate your life, if you bet on the Utah Jazz 😂",
    "131": "*favorites in camera roll* 📸\n\nCheck out more of the best photos from this week ⤵️",
    "132": "I’ve said it countless times… Gonzaga is the NCAA version of the Utah Jazz.💀 https://t.co/FTerbHjTMg",
    "133": "7:00pm ET; Fri, Mar 25\n\nUtah Jazz\nCharlotte Hornets\n\n📺: Bally Sports SE-CHA, ATTSN-RM\n\n#LEGENDoftheMiamiHEAT #NBA75",
    "134": "Earning gift cards for selling my stuff on @Listia! Join me using code \"DHHQGN\" for an extra 250 PTS. I just listed this: (4ct.) Utah Jazz Stickers https://t.co/ROa02aH3ci",
    "135": "@WyntersStorm add them 3 to yo parlay today and Utah jazz https://t.co/qt4qmHFHfK",
    "136": "@utahjazz @ATTSportsNetRM @ZoneSportsNet The Disappointment begins at 5pm",
    "137": "Hey \n@utahjazz\n@spidadmitchell \n@rudygobert27 \n We are ready to come see you on April 8th against phoniex sun \n\nLET GO @utahjazz https://t.co/BoQIVlT6pS",
    "138": "Was atrocious yesterday. Let’s try to get some get back.. \n\nPurdue -12.5 \nSouth Carolina/NC under 118\nUtah Jazz -4",
    "139": "Just saw the @utahjazz players walking into my hotel here in Charlotte because they are playing the @hornets tonight. \n\nLet's just say, they didn't look super pumped--might be bc my @celtics just blew them out in their last game. I'm also rockin’ a celtics hat &amp; iPhone case 😂",
    "140": "Only 15% of you got this one right—Big T is SIXTH all-time in blocked shots behind Karl Malone 🥽",
    "141": "Analyzing Friday’s Utah Jazz at Charlotte Hornets and lines, with NBA expert picks, predictions and best bets.  https://t.co/MFyTb1H1nt",
    "142": "Utah Jazz at Charlotte Hornets odds, picks and predictions https://t.co/eac0Gz2ycE",
    "143": "@jodiecongirl @TopherTBrennan wasn't kidding, though I did google it after tweeting. This is the first time I've ever heard of the Utah Jazz",
    "144": "And even @Deseret wants you to consider the potential fallout, @UtahGOP. Do you really want to lose the @NBA all-star game or make the @utahjazz owners look elsewhere?\n\nhttps://t.co/DVlEeuFrJO",
    "145": "Stop #4 📍\n\n⏰ 5 PM MT\n📺 @ATTSportsNetRM \n📻 @zonesportsnet\n\n#TakeNote",
    "146": "On Wednesday (3/22), members of RCC's Brotherhood enjoyed watching the @celtics defeat the Utah Jazz! The Brotherhood helps RCC students prepare for success while engaging in cultural, rapport-building, and professional development activities. https://t.co/5xzbVakUNE",
    "147": "Utah Jazz vs Charlotte Hornets NBA Pick and Prediction NBA Betting Tips ... https://t.co/hI09tIURb5 via @YouTube",
    "148": "@LegionHoops @statmuse Suns will go down in history as a good regular season time like the Utah jazz congrats phoenix!",
    "149": "@TheRealPres10 Got my season tickets for the Utah jazz. Stooooked ❤️‍🔥❤️‍🔥",
    "150": "@RaeAck13 @BensHoops @utahjazz @hornets How is your corner 3?",
    "151": "🔴Live▶ Utah Jazz vs. Charlotte Hornets - NBA League 2022\n🔴Sign up here📺📱➠ https://t.co/gllnivI6Wm\n📅 : Friday, March 25, 2022\n⏰ : 7:00 PM",
    "152": "Is Utah Jazz coach Quin Snyder really a candidate for other NBA jobs? https://t.co/FwVBRP8IXD",
    "153": "Is Utah Jazz coach Quin Snyder really a candidate for other NBA jobs? Plus, previewing the Jazz’s game against the Mavericks — a possible first-round playoff matchup.\nhttps://t.co/SIiHLnb7NW",
    "154": "Check out Bryon Russel Card Mint #190 Utah Jazz Basketball 1996-97 Topps + FREE SHIPPING https://t.co/zJsE8zzMpD @eBay",
    "155": "The ‘Overlooked’ Utah Jazz https://t.co/gIhuZYEpVn",
    "156": "Ja Morant last playoffs:\n\n30.2 PPG\n8.2 APG\n4.8 RPG\n49% FG\n32% 3PT\n\nHe averaged the 5th most points by any 21 year old in Playoff History.\n\nThis was done against the reigning DPOY in Rudy Gobert and the 1 seeded Utah Jazz. https://t.co/WhPOYLbG3T",
    "157": "@Chris_Broussard More like the best regular season team in the NBA. The Spurs comparison is inaccurate. The 2014 Spurs were one defensive stop from winning title number 5. Phoenix never got a 3rd win in the Finals and their big 3 has not won anything. They more like the 1998 Utah Jazz to me.",
    "158": "@FTFonFS1 @Chris_Broussard More like the best regular season team in the NBA. The Spurs comparison is inaccurate. The 2014 Spurs were one defensive stop from winning title number 5. Phoenix never got a 3rd win in the Finals and their big 3 has not won anything. They more like the 1998 Utah Jazz to me.",
    "159": "The #Hornets are back in action tonight against the Utah Jazz. \n\nCharlotte has not beaten Utah since 1/12/2018, their second-longest drought against any team.\n\nThe longest drought is against the Clippers, who Charlotte last beat on 11/18/2017. https://t.co/e6A4jXtumh",
    "160": "Bales (@BalesSJustin) breaks down his favorite bet involving Miles Bridges vs the Utah Jazz. Check it out below! \n\nhttps://t.co/OZjaNZB2To\n\nNBA Props Comparison Tool: https://t.co/AGfgyEOIth\n\n#GamblingTwitter #BettingTwitter",
    "161": "Someone really said that the Utah Jazz are the Gonzaga of the NBA and I can’t unsee it now💀💀",
    "162": "how do utah jazz fans exist",
    "163": "GAMEDAY!!\n\n🆚 Utah Jazz \n🕑 20:00\n🏟️ Spectlum Center \n📺 NBA League Pass \n\n#AllFly https://t.co/EStpnflJ9J",
    "164": "Gonzaga is essentially the Utah Jazz, and the Green Bay Packers https://t.co/YJQOCzyUNY",
    "165": "@PJULI98 @GennaroSavast17 @mangu4life1 @Xavier101178 @utahjazz I’m here to talk",
    "166": "3/25/19 – Devin Booker shot 19-34 from the field (5-8 from 3) on his way to the 3rd-highest scoring game in franch.-hist., 59p (w/4r/4a) in a 125-92 loss at the Utah Jazz. Book had a chance at 60+ in the waning min., but Jimmer Fredette (1-10) wouldn't pass the ball. #ValleyProud https://t.co/7KdbVH0owr",
    "167": "Congratulations to c_ombeNFT who moved up 20 spots to take #18 on the Utah Jazz team leaderboard.\n\nhttps://t.co/CDr6eP2Ai1",
    "168": "Take the Super Bowl every time. Not trying to relive watching the 90's Utah Jazz.",
    "169": "Check out this listing I just added to my #Poshmark closet: Vintage Utah Jazz Hat  90s Drew Pearson Snapback Cap  Purple Gold. https://t.co/FS811IU55J #shopmycloset @poshmarkapp",
    "170": "The @hornets final game of this five-game home stand is against the @utahjazz tonight.\n\nWith 2 of the league's highest scoring offenses, it should be a good one!\n\nHere's the full preview!⬇️⬇️⬇️\n\nhttps://t.co/KEFKc663zE",
    "171": "Your Daily NBA Tip is Here!\nMiles Bridges - Under 18.5 against the Utah Jazz #nbabets #nbabetting https://t.co/FJIGQwPWXd",
    "172": "Despite the ups and downs, I’m EXTREMELY pumped to go see the @utahjazz in person tonight. #takenote",
    "173": "@utahjazz @RyanQualtrics Jazz fan of 37 years here. No criticism, but are we keeping some of the classic Jazz uniforms?\n\nI have 6 jerseys already, and 4 are no longer used, including the first city edition, now replaced with Dark mode...\n\nWhy do we need new branding??",
    "174": "Utah Jazz fans Donovan Mitchell no longer in the same tier as Devin Booker 🤷🏻‍♂️ argue a wall",
    "175": "@AChangeOfTune @hornets @utahjazz If you aren’t using I’ll take one 😀",
    "176": "Ziti sports \n\nCOLLEGE HOOPS\nIowa State vs. Miami (FL) OVER 133 -110 \n3/26\nDuke -4 -110 Arkansas (12:00 PM)\n\nNBA\nUtah Jazz vs Charlotte Hornets UNDER 230.5 -110 \nDetroit Pistons -4.5 -110 Washington Wizards \n\nNHL\nColumbus Blue Jackets vs Winnipeg Jets OVER 6.5 -110 (8:05 PM)",
    "177": "@i_am_lorgue Doesn’t work like that Lmaoo . Same way last season utah jazz mitchell was top last season doesn’t make him best player .",
    "178": "@JazzDoingGood @utahjazz @AFCU @ywcautah @nbacares Not a fan of these colors  not enough depth. Flat",
    "179": "NBA Basketball Game Betting Picks Simulator: 8:10 PM ET - Utah Jazz vs. Charlotte Hornets - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/5MwTm97BdZ #nba #sportsbetting #freepicks #cappertek",
    "180": "@Mackie_Velli I don’t hate them they just not a championship team to me right now Lmao they giving me Utah jazz vibes",
    "181": "@JazzDoingGood @utahjazz @AFCU @ywcautah @nbacares Pretty cool mural!! We gotta be committed to this color way for the LONG HAUL cause I see this and my mind says, “This isn’t the Utah Jazz!”",
    "182": "On this day in sports history March 25, Phoenix Suns Shooting Guard Devin Booker scored 59 Points against the Utah Jazz in 2019.",
    "183": "@TheMavsReport @hornets @utahjazz Hoping the @hornets get the win too, trust me lol",
    "184": "Check out 2017 Donovan Mitchell Optic Silver Prizm Rookie Kings Utah Jazz #13 Pack Fresh!  https://t.co/W1NldmLxS5 via @eBay",
    "185": "Check out 2017 Donovan Mitchell Optic Silver Prizm Rookie Kings Utah Jazz #13 Pack Fresh!  https://t.co/cCvuWq3Xrw via @eBay",
    "186": "Utah Jazz Star Rudy Gobert Considers Joel Embiid His Toughest Matchup – NBA News https://t.co/bfxItsGTVD",
    "187": "'How 'Bout This Jazz' podcast: Is Utah Jazz coach Quin Snyder really a candidate for other NBA… – NBA News https://t.co/RqmL9CVN4s",
    "188": "NBA lay (take at your own risk) +611\n\nHeat -6.5 (heat are due and against a very weak NYK team this should be -10)\n\nDetroit -4.5 (pistons look good of recent and Wiz on B2B)\n\nUtah Jazz -4 (hornets have regressed big time I like the low spread)\n\n#710Picks #gamblingtwitter #NBA https://t.co/7VGQRMbWbd",
    "189": "@mxwzy May the basketball gods bless your .@hornets today against the .@utahjazz #MFFL 🙏#allfly",
    "190": "March 24th, 2011: Emeka Okafor (@BigMek50) hits this circus 1-legged shot to force OT for the New Orleans Hornets against the Utah Jazz\n\nThat's now 2 insane #UConn buzzer beating shots this week!! https://t.co/X2I7VZtmfd",
    "191": "MY UTAH JAZZ VINTAGE 🧢 COLLECTION 💜🙇🏻‍♂️ https://t.co/oR41Zz9fdu",
    "192": "‘How ‘Bout This Jazz’ podcast: Is Utah Jazz coach Quin Snyder really a candidate for other NBA jobs?\nhttps://t.co/QYzRZRrxRO",
    "193": "Utah Jazz vs  Charlotte Hornets Prediction 3/25/22 - Free NBA Picks https://t.co/SOOxZrnR6n via @YouTube",
    "194": "#Hornets gameday 🐝\n\n🏀 vs. Utah Jazz \n📍- Spectrum Center \n⏰- 7:00 PM\n\n#allfly https://t.co/gNgNMtvkRL",
    "195": "March 25 edition of DJ &amp; PK in the Morning\n\n- @DLocke09 makes his weekly visit talking @utahjazz \n- @AlphaRecruits15 talking recruiting\n- @BGeltzNBA talking #NBA hoops\n- An old friend, @sluhm, stops by as well\n\n📻 97.5-FM/1280-AM\n📱 The @ZoneSportsNet App\n🗣 @PKKinahan\n\n#TakeNote https://t.co/MEa97WiTnv",
    "196": "Also missed that the Utah Jazz is partially owned by @DwyaneWade, who has a transgender daughter. Salt Lake City is slated to host the 2023 NBA All-Star Game.",
    "197": "Consensus Line Move:\n2022-03-25 Utah Jazz at Charlotte Hornets from 230.50 to 227.50\nUnder pouring in\n#NBA #handicapper #artificialintelligence #invest",
    "198": "@authorjla @FletcherMR Except he has risen to prominence AFTER Karl Malone of the Utah Jazz.",
    "199": "Hey @utahjazz I’m just a 27 year fan from West Virginia that finally gets to go to a game tonight in Charlotte! I’m so excited! #takenote",
    "200": "Barnett Frank, Director of Performance Science / Assistant Athletic Trainer for @utahjazz, has been a member since 2018. Barnett makes sure the relationships come first and that they are a two way street!\n\n#nbata #natm2022 #nata #athletictraining #provid… https://t.co/AustL2IdgF https://t.co/OqZkUjaaOJ",
    "201": "Barnett Frank, Director of Performance Science / Assistant Athletic Trainer for @utahjazz, has been a member since 2018. Barnett makes sure the relationships come first and that they are a two way street!\n\n#nbata #natm2022 #nata #athletictraining #provid… https://t.co/AustL2IdgF",
    "202": "The Utah Jazz are in Charlotte to take on #AllFly ...is this a must win for #TakeNote? Can the Utah Jazz beat #MFFL on Sunday in Dallas? Are #ValleyProud the best team in the #NBA75? Will you subscribe to #Apple for iPhones? Jake has a fascinating take on #Anonymous!",
    "203": "Barnett Frank, Director of Performance Science / Assistant Athletic Trainer for @utahjazz, has been a member since 2018. Barnett makes sure the relationships come first and that they are a two way street!\n\n#nbata #natm2022 #nata #athletictraining #provid… https://t.co/AustL2IdgF https://t.co/V7xggChWFi",
    "204": "▶️▶️https://t.co/U1lgtQSBz4◀️◀️\nUpcoming #NBA live streams today:\n#CharlotteHornets vs #UtahJazz\nand more https://t.co/T06Xgwb0aA",
    "205": "Friday lineup on The Zone:\n\n6-10 am: DJ &amp; PK in the Morning\n\n10 am-12 pm: Jake &amp; Ben at @WarehouseSLC\n\n12-3 pm: Hans &amp; Scotty G at Wasatch Front Kia\n\n3-4 pm: Unrivaled\n\n4 pm: @utahjazz vs. @hornets\n\n5 pm: #MarchMadness coverage on 1280-AM\n\n📻 97.5-FM/1280-AM\n📱 Download our app https://t.co/CC0gDBcvXc",
    "206": "@Zephyros21 @PriddysC @packers @RaysBaseball @CowboyFB @utahjazz @StLouisBlues @ManUtd @WhitecapsFC @GothamFC @BlackYellow Willems a blue fellas sorry💙",
    "207": "@utahjazz So, passes",
    "208": "I don’t want to hear about Utah jazz highlights I’m perfectly fine with the nba showcasing the top 8 teams every week on TV games https://t.co/Lr63KG22Dd",
    "209": "@BlackFyre_NFT @polarbearsnft @celtics @spurs @chicagobulls @Raptors @cavs @DetroitPistons @MiamiHEAT @OrlandoMagic @utahjazz @Lakers @dallasmavs @SacramentoKings @HoustonRockets N’ice to see you here Coach 😀 Wen my transfer? Wen, wen 👀 https://t.co/qLMISytLgm",
    "210": "Charlotte Hornets - Utah Jazz\nMiami Heat - New York Knicks\nLos Angeles Clippers - Philadelphia 76ers\n\nBet slip link: https://t.co/Bv4iSoN42z https://t.co/KK6Fkyjeo7",
    "211": "/r/CharlotteHornets: Game Thread: Utah Jazz (45-28) at Charlotte Hornets (37-36) Mar 25 2022 7:00 PM #AllFly https://t.co/likq3T8Jl0",
    "212": "@jabo_vancouver @MissingmyMind Luka Doncic did something like this 2 weeks ago against the Utah Jazz.  Nothing happened.  On a yellow card MAK should have known better.",
    "213": "@utahjazz 97-125 Celtics\n@Socceroos 0-2 Japan\n@Azzurri 0-1 North Macedonia\n@SydneyFC 0-2 Jets at HT\n@sydneyroosters 6-12 Souffs at HT\nSolid 24ish hours.\n\nCome on lads. At least one reverse let's goooo!",
    "214": "Charlotte Hornets - Utah Jazz\nLos Angeles Clippers - Philadelphia 76ers\n\nBet slip link: https://t.co/nUsGKxOHpN https://t.co/FLdzotrNUu",
    "215": "Earning gift cards for selling my stuff on @Listia! Join me using code \"BBLPBQ\" for an extra 250 PTS. I just listed this: 2017-18 Panini Prizm #117 Donovan Mitchell Utah Jazz Rookie PSA 9 https://t.co/pZMmljAHGB",
    "216": "NBA : Utah Jazz vs Charlotte Hornets - Picks, Best Bets &amp; Odds\nhttps://t.co/949GcrGNqF",
    "217": "@topshotblazers @rudygobert27 @utahjazz @nbatopshot TS: Valentime_rigl",
    "218": "NBA Basketball Game Betting Picks Simulator: 7:10 PM ET - Utah Jazz vs. Charlotte Hornets - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/5MwTm97BdZ #nba #sportsbetting #freepicks #cappertek",
    "219": "@RealJayWilliams I'm old school so I'll put my money on Karl Malone and John Stockton. The Utah Jazz were a joy to watch , even as a Bulls fan",
    "220": "Charlotte Hornets - Utah Jazz\nMinnesota Timberwolves - Dallas Mavericks\nUCLA Bruins - North Carolina Tar Heels\nMiami-Florida Hurricanes - Iowa State Cyclones\n\nBet slip link: https://t.co/QzJUW6SvOJ https://t.co/7akHy0kwQf",
    "221": "@utahjazz @mconley11 Awesome player love to watch his skills!!",
    "222": "Fri, 25th Mar: #CharlotteHornets vs #UtahJazz - ODD @ 1.98\nMore details on: https://t.co/n7hLTSDXtn\n#baskettips #basketprediction #basketballbets #nba #usabasket",
    "223": "@topshotblazers @rudygobert27 @utahjazz @nbatopshot Let's go mate\nTS RAIKAN007\n@Thiasha\nLFG",
    "224": "@RaeAck13 @BensHoops @utahjazz @hornets Someone’s gotta make up for Bogey’s 3’s, right? Rae on a 10 day??🤞🏼🤞🏼",
    "225": "NBA Basketball Game Betting Picks Simulator: 3/25/2022 7:10 PM ET - Utah Jazz vs. Charlotte Hornets - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/5MwTm97BdZ #nba #sportsbetting #freepicks #cappertek",
    "226": "Gonzaga is the Utah Jazz of College Basketball.\n\nThis team has won over 60% of their games in their school's existence and they have zero titles. They choke in the tournament every year. I don't know why you still pick them.",
    "227": "@Aggiesalltheway Who are you sports allegiances? \n\nNCAA - Utah State Aggies\n.\n.\n.\n.\nNBA - Utah Jazz\nMLS -  Real Salt Lake\n.\n.\nMLB -  SF Giants\n.\n.\nNFL - Team(s) with Aggies (Formerly SF 49er’s)\nTeam USA (90%ish of the time anyway- haha)",
    "228": "gonzaga is the utah jazz of college basketball and the fact that stockton played for both is fucking insane lmfao",
    "229": "Utah Jazz big man Rudy Gobert mentions Philadelphia 76ers star Joel Embiid as his toughest matchup.  https://t.co/HbQCyv0Rra",
    "230": "@RaeAck13 @utahjazz @hornets Rooting for you",
    "231": "@BensHoops @utahjazz @hornets But I'll be there sooooo think I'll get some minutes?",
    "232": "#TakeNote Better be a big win for the @UtahJazz tomorrow night. #UTAvsCHA Need to start a winning streak. Let’s Go! 👊🏀",
    "233": "@RampratGJT @kaievans300 Remind me to tell you my Utah Jazz/Gordon Hayward bowling story",
    "234": "Now I can turn my attention to a team who surely won’t disappoint me: the Utah Jazz",
    "235": "Ive figured it out...  @Arbys hit it up @RyanQualtrics and @utahjazz and let em know they were giving away way too many roast beef sandwhiches and to \"tone it down a bit on the scoring\"  this is the only thing that makes logical sense.",
    "236": "@utahjazz The golden years, before we had a worry in the world..",
    "237": "@Mat_Bark @rgiss11 ROYCE ONEAL RUINS PHOTO\n\nASKED TO LEAVE UTAH JAZZ",
    "238": "Build Your Bundle at the @jazzteamstore by selecting a shirt, hat and socks and using promo code BYBSale for $65 🤑\n\nhttps://t.co/fU992LZxk0 https://t.co/TevoDtHdxj",
    "239": "@CBBSuperFan @AauCritic @soulpole415 @Mike_Schmitz Gonzaga always loses. They're the Utah Jazz of the NCAA.",
    "240": "NFL: Cincinnati Bengals\nNHL: St. Louis Blues\nMLB: Seattle Mariners\nNCAA: Washington Huskies and LSU Tigers\nNBA: Utah Jazz (former Seattle Supersonics)\nPremier League: Manchester City\nMLS: Seattle Sounders FC\nGolf: Tiger Woods\nNASCAR: #5 Kyle Larson\nIndycar: #9 Scott Dixon https://t.co/RXXwR4QeIS https://t.co/wlHrKT8hXC",
    "241": "Gonzaga really the Utah jazz of college basketball",
    "242": "@JazzDoingGood @utahjazz @AFCU @ywcautah @nbacares Sell merch with these on them and donate to YWCA. They’d sell like crazy!",
    "243": "@utahjazz call this man up https://t.co/KmAJgULArq",
    "244": "@gorill_Jas That's what I thought. The game itself had significantly changed especially when the 3 point shot became the norm. No more well designed inside the paint play like the Utah Jazz's pick and play of Malone and Stockton and, of course, the Chicago Bull's triangle offense.",
    "245": "Consensus Line Move:\n2022-03-25 Utah Jazz at Charlotte Hornets from 232.50 to 231.50\nUnder its a trap!\n#NBA #bettingpicks #programmer #stock",
    "246": "Brown, Tatum lead Celtics past Jazz 125-97! #Celtics #UtahJazz #CelticsWin #NBA75 @BostonCeltics @utahjazz @NBCSportsBoston @celtics",
    "247": "@Angel_81_Angel @Joeingles7 @utahjazz I love this take!",
    "248": "Utah Jazz\nLos Angeles Dodgers\nDallas Cowboys\nGonzaga Bulldogs\nOhio State Buckeyes \n\nRegular season frauds",
    "249": "@chicagobulls are a first round team@the the eastern conference @utahjazz",
    "250": "YUHHHHHHHHHHHH!!! ARKANSAS LFGGGGGG!! GONZAGA IS THE UTAH JAZZ OF MENS COLLEGE BASKETBALL! https://t.co/BNNqYQZVjn",
    "251": "Utah Jazz: Could Salt Lake City 2023 All-Star Game be in jeopardy? https://t.co/WJKxCz9qTb",
    "252": "They are the Utah Jazz of CBB https://t.co/IfzTvOYzLX",
    "253": "#NowPlaying   John Stockton STANDS FIRM On Vaccines, Masks   Utah Jazz Legend Talks Faith   Abortion by   Fearless with Jason Whitlock \n    US Sports Radio  https://t.co/kwgJFYvLHZ  https://t.co/oTZrHSVAzi  https://t.co/ePsjFLkEMc  48:11 https://t.co/oiA7Ff5Lcb",
    "254": "@WestGoat the utah jazz of the nba, a team who gets the first seed then chokes in the playoffs",
    "255": "Gonzaga the Utah Jazz of College basketball",
    "256": "Gonzaga is the NCAA version of the Utah Jazz but like double the amount of white players. Bonafide regular season animals.  #NCAATournament #MarchMadness",
    "257": "@Jessica_Haas @utahjazz @rudygobert27 @NBA @espn It was so amazing seeing you do this live, Great Job Jessica!",
    "258": "@CuffsTheLegend Forget about the Utah jazz",
    "259": "If Gonzaga was an NBA Team they’d be the Utah Jazz, right or wrong ?",
    "260": "The Utah Jazz of College basketball: https://t.co/p47711M9Il",
    "261": "@TCool369 Literally the Utah jazz of the NCAA lol",
    "262": "@cantlyelliott The Utah Jazz of college basketball",
    "263": "@NBAKrell Utah Jazz of college ball.",
    "264": "@utahjazz When is Bojan coming back? It’s getting too long",
    "265": "Gonzaga is the Utah Jazz of college basketball",
    "266": "Said the other night they was the utah Jazz 😂😂 https://t.co/clodYxGydJ",
    "267": "Gonzaga the college version of the Utah jazz",
    "268": "@WestGoat Utah Jazz, but instead of a superstar player in Dmitch, they have 2 busts in Drew Timme and Chet Homgrlen😹",
    "269": "@WestGoat Literally the Utah Jazz but just slightly better in the playoffs. Always have stellar regular season but they can just never get it done",
    "270": "Who are you sports allegiances? \n\nNFL - Don’t have one follow Ute players \nMLB - Oakland A’s\nNCAA - Utah Utes \nNBA - Utah Jazz\nNHL -  Don’t care \nPremier League - Don’t have one \nMLS - Real Salt Lake \nPGA -\nNASCAR -  Boring https://t.co/cLyZS9yRMl",
    "271": "Gonzaga is the Utah Jazz of college basketball #MarchMadness",
    "272": "I told ppl that Gonzaga was the Utah Jazz when it came to the tournament weeks ago 🤷🏾‍♂️",
    "273": "Gonzaga the Utah jazz of college basketball",
    "274": "@topshotblazers @rudygobert27 @utahjazz @nbatopshot TS Fabolous305",
    "275": "Happy puppy day!! #TakeNote  @utahjazz @JazzNationNews https://t.co/4KGwYFT42n",
    "276": "Gonzaga is the Utah Jazz of college basketball",
    "277": "Gonzaga like the Utah jazz of college ball",
    "278": "@3YearLetterman @BurnerLJohnson Gonzaga is the Utah Jazz of college basketball",
    "279": "zags the utah jazz of college basketball",
    "280": "@utahjazz It was called 2 girls 1 cup",
    "281": "@utahjazz Do you guys remember that porno of 2 girls shitting into 1 cup and then doing terrible things after???",
    "282": "Gonzaga are overrated af every year!\n\nThe Utah Jazz of the NCAA!",
    "283": "College basketball Utah Jazz lol https://t.co/SRkUngwOvp",
    "284": "Timme about to get drafted by the Utah Jazz in the first round",
    "285": "@drunkspecialist They're the Utah Jazz of the NCAA",
    "286": "Utah Jazz of college basketball https://t.co/J40Bctzgdt",
    "287": "It has been 14 years, 1 month, 1 week and 4 days since a Utah Jazz player last recorded a triple-double in a regular season game. #takenote   #jazztripledoublewatch",
    "288": "Gonzaga is the Utah Jazz of college basketball",
    "289": "He has Utah Jazz written all over him https://t.co/gj6EfUqieK",
    "290": "@davidycus2 That mustache will be a Utah Jazz bench player for the next decade. Write that down!",
    "291": "Gonzaga doing what they do oh yeah i forgot they get praised for being the utah jazz of college bball https://t.co/aIAzEyutYB",
    "292": "@TommyKnow303 After reading this, I’m moving on to wondering who Tim Connelly will be drafting for the Utah Jazz this year……",
    "293": "Thurl Bailey is on a LOT of Utah Jazz franchise top 10 lists. In which metric is he NOT top 5 for the Jazz ⤵️\n\n#TakeNote | @socios",
    "294": "Session complete with the legendary Dan Roberts, voice of the Utah Jazz! #missioncontrolproductions #paannouncers https://t.co/HSvcGPI59c",
    "295": "Who are you sports allegiances?\n\nNFL - Niners \nMLB - A’s/Giants\nNCAA - #BYU Cougs\nNBA - Utah Jazz\nNHL - San Jose Sharks\nPremier - Chelsea \nMLS -  #RSL  \nPGA - 🐅 / Tony Finau\nF1 - Danny Ricc and George Russell https://t.co/VAzb9raasv",
    "296": "“Social media must be so damaging to your generation with all the fake bodies you constantly see on Instagram” My Aunt says before I have to explain to her that in fact I follow the Utah Jazz and Kanye West not the entire Love Island cast",
    "297": "Who are you sports allegiances?\n\nNFL - Denver Broncos \nMLB - 🤷‍♂️\nNCAA - Arkansas 🐗\nNBA - Utah Jazz\nNHL - Seattle Kraken\nPremier - Manchester is always Red👹 \nMLS -  #RSL \nPGA - 🐅 / Cam Smith\nF1 - Red Bull",
    "298": "@3FitzSLC Who are you sports allegiances?\n\nNFL - Denver Broncos \nMLB - Colorado Rockies\nNCAA - Indiana Hoosiers \nNBA - Utah Jazz\nNHL - Colorado Avalanche \nPremier - Man City \nMLS - Real Salt Lake &amp; Vancouver Whitecaps \nPGA - Tony Finau\nF1 - Mercedes",
    "299": "@5kl @Joeingles7 @trailblazers Seriously, the Portland #trailblazers fan base is literally the only fan base I feel sorry for in the NBA, all the rest of them can go eat a moldy biscuit. And also their hatred for @utahjazz  is always fun for me to add to the drama of the game. #JustSayin",
    "300": "@jappleby @snark_tank - the Utah Jazz is crushing it",
    "301": "@Callystarr you nailed it man the play of the utah jazz is predictable all isolation plays for mitchell or clarkson less ball movement",
    "302": "@Dobbys_ghost95 Well, I’m hoping my Utah Jazz.",
    "303": "To discriminate against one girl, Utah Republicans feel it is worth the risk of millions in lost revenue.  Perhaps it’s time for the @utahjazz look to move to Vegas in order to recruit/retain players. #utpol #utleg #TakeNote",
    "304": "Who are your sports allegiances? Definitely more of a players fan in most leagues now, but if I had to\n\nNFL - Philadelphia Eagles\nMLB - New York Yankees\nNCAA - Utah State Aggies\nNBA - Utah Jazz\nNHL - eh\nPremiere League - Don't care\nMLS - Don't care\nPGA - Brooks Koepka\nNASCAR - eh https://t.co/wVUIpMvp3h",
    "305": "@chicagobulls @utahjazz let’s work https://t.co/HlYxuhw6LV",
    "306": "@JazzUniTracker As both black and yellow are in your avi lol aka Utah jazz colors. Y’all are literally a rainbow of colors every year",
    "307": "@lynziekate BREAKING: One of the bad drivers has been identified as Utah Jazz C Rudy Gobert, per sources. Rudy was said to not understand switching and denied doing anything illegal. Witnesses claimed he was crying when he got called out for this act. Very sad.",
    "308": "@topshotblazers @rudygobert27 @utahjazz @nbatopshot Thanks @topshotblazers  for the giveaway ♥️\nTs: ElPayaso",
    "309": "https://t.co/ap9kHpec6h\n\n@utahjazz vs @hornets Preview &amp; Prediction. Find out why I like the @utahjazz -3.5, @utahjazz on the ML, and over 233.5 Total Points Scored. #TakeNote #BuzzCity #GamblingTwitter",
    "310": "Who are your sports allegiances?\n\nNFL - Green Bay Packers\nMLB - Los Angeles Dodgers\nNCAA - Utah State Aggies\nNBA - Utah Jazz/Boston Celtics (don't follow NBA anymore)\nNHL - Pittsburgh Penguins\nPremiere League - Don't care\nMLS - Don't care\nPGA - Phil\nNASCAR - No thanks! https://t.co/NFMCZQ6utA",
    "311": "@PJULI98 @rlars06 @2022_ute_jazz @Pavel9792 @utahjazz I’m here to talk",
    "312": "@nbatopshot @utahjazz Bulls was highest so far?"
}