{
    "0": "@30reacts @ColbsPM @sunsbestteam @The_JackHanson @Jumpshot8 @Suns I attended a game in Phoenix in which we beat you without Booker, and the sample size we are talking is 3 games so who gives a shit? That was months ago when the Celtics were dogshit and Steph was MVP.\n\nAnd no, you’re not better, by virtually any metric. You know this.",
    "1": "@Suns @mikal_bridges @SociosUSA He scored 19 points https://t.co/nCVnjHYXeQ",
    "2": "@redriverboat2 The Matrix is a staple of Phoenix Suns basketball and is beloved by this city.",
    "3": "@30reacts @sunsbestteam @The_JackHanson @Jumpshot8 @Suns By Giannis actually 😵‍💫 By Giannis…",
    "4": "@devinbookair Yes because he will have done what no other Sun could do. \n\nThink about how Packers fans treat their championship heroes. They name streets &amp; community centers after them. Phoenix will do the same. \n\nLoop 101 will be renamed the “CP3” and Camelback Mountain will become “Mt. Book”",
    "5": "Phoenix Suns vs. Minnesota T'Wolves! #NBAPicks\nhttps://t.co/bsIrpkFeBP",
    "6": "@30reacts @ColbsPM @sunsbestteam @The_JackHanson @Jumpshot8 @Suns Correct. Why does that matter in the discussion of this season? Sounds like you’ve already waved the white flag, and recognize that we’re the better team. Yikes. That blows. Better luck next season. Maybe you and your lakers fan friends can buy property in The Past, ur fav place.",
    "7": "@Suns Aaron &gt; Elf pls",
    "8": "@KnicksMSGN I keep saying it, Obi should be used like Phoenix suns Shawn Marion.",
    "9": "@devinbookair Book bringing a chip to Phoenix puts him in elite status that only members of the 2001 Dbacks know. Seeing Gonzo in public and old ladies crying and thanking him for something that happened 20 years ago is wild. Book 100% would be the Suns 🐐 if he does that.",
    "10": "I’m so sick of laker games being on TV but not the @Suns",
    "11": "@SShacquon @Suns you're mad+nobody likes you+shower you stink",
    "12": "@30reacts @sunsbestteam @The_JackHanson @Jumpshot8 @Suns You lost in the play in that same season bro log off 😂😂 you lost two games in a row in the play-in like what are you talking about 😂😂",
    "13": "The disrespect the Phoenix Suns get in this league is wild, they’re not the best team in the league by coincidence 💯 this is a great team led by a first ballot HOF &amp; a future HOF #Suns #NBA https://t.co/75e0nsXk5o",
    "14": "@EricStokesSzn6 @Suns @DevinBook Nobody cares About you",
    "15": "@thenameisjoeyy @30reacts @sunsbestteam @The_JackHanson @Jumpshot8 @Suns I probably should’ve said “championships aren’t the only way to measure success!”",
    "16": "@ColbsPM @30reacts @sunsbestteam @The_JackHanson @Jumpshot8 @Suns I mean they do measure success, but “anything less than a title is losing” is a lakers fan argument, and this guy absolutely didn’t watch basketball before 2014",
    "17": "Pregame angles. 📸 https://t.co/2RbgffDWpb",
    "18": "@Suns Oh thank god, I can’t handle another Payton minute",
    "19": "@Gambo987 that failed trade between Phoenix and Memphis was one of the best things to happen to both teams. Memphis kept a key piece in Dillon Brooks and Suns ended up with Kelly Oubre. Without Oubre there might have never been a Paul trade. Best failed trade ever?",
    "20": "@Dakodas_Dad @Suns @Timberwolves Every video, every bad news for the .....\nBrings so much joy and makes my face crack from such a huge smile.\nThank you guys",
    "21": "@NeeNeeSr15 @Thugnotes2 @IsiahThomas @DevinBook @Suns @NBA Booker is the best shooting guard in the league this year dog.",
    "22": "@30reacts @sunsbestteam @The_JackHanson @Jumpshot8 @Suns No I didn’t. What excuse? You said AD was injured in a series where the suns won, in an attempt to invalidate it, and I said it evens out bc of CP3, so the injury narrative is dumb. You really are not literate. Although, ignoring CP3 injuries is a warriors past time &lt;3",
    "23": "@30reacts @thenameisjoeyy @sunsbestteam @The_JackHanson @Jumpshot8 @Suns Championships don’t measure success… you probably have been a warriors fan for the last 7 years only… the only years they’ve been relevant",
    "24": "@Suns Could you guys follow me please",
    "25": "Massive matchup in the NBA’s Western Conference between the Minnesota Timberwolves and Phoenix Suns tonight. Follow along for social media coverage, it should be a good one in Minneapolis #introsports22 @DOrlandoLED",
    "26": "@Suns @mikal_bridges @SociosUSA He had 19 points 4 boards and 1 assist in 36 minutes",
    "27": "@suns_tutu_fan @Suns Beautiful ❤️🥰",
    "28": "@30reacts @sunsbestteam @The_JackHanson @Jumpshot8 @Suns Once again, winning and losing aren’t the same thing.\n\nThe suns overcame injuries to CP3, the warriors in your examples didn’t.\n\nYou are losing with every single argument you’re making, you need to log off.",
    "29": "@30reacts @thenameisjoeyy @sunsbestteam @The_JackHanson @Jumpshot8 @Suns Half a century? Try a decade! The Suns still have a better winning % as a franchise than the Warriors… 7th best win % all time…",
    "30": "@Suns @mikal_bridges @SociosUSA 10points  3reb and 2 ast",
    "31": "@30reacts @sunsbestteam @The_JackHanson @Jumpshot8 @Suns And warriors fans talking about winning bc of injuries LMFAO!!!!!!!!",
    "32": "@30reacts @The_JackHanson @Jumpshot8 @Suns And u lose to very bad teams by the way",
    "33": "@30reacts @The_JackHanson @Jumpshot8 @Suns No it didnt go do some research bozo. In the Bucks game we were without our two stars, if the same were true for the warriors yall would be a high school team 😂",
    "34": "📅: GAMEDAY @ 8:00 PM\nPhoenix Suns Vs. Minnesota Timberwolves - NBA League 2022\n🎟️🎥: https://t.co/nhP1FLUYMH\nOnly Available For Registered Users. Create a FREE account to get access",
    "35": "@30reacts @sunsbestteam @The_JackHanson @Jumpshot8 @Suns CP3 played one healthy quarter in that series and the suns are the favorites to go to the finals. You’re so mad it’s so funny. Keep bringing up the past if you want, go hang with the lakers fans, they do that too &lt;3",
    "36": "@Suns LETS GET THAT FIRST SEED",
    "37": "@suns_tutu_fan @Suns z here we come 😈",
    "38": "The Miami Dolphins From Last Season Remind me of The Phoenix Suns when they was in the Bubble.....\n\n^",
    "39": "Still my favorite retro @suns shirt. Soon we'll be able to celebrate another one.....again 😈 https://t.co/La1vyUNKKG",
    "40": "@paullydoughnuts @ripheatcards little Phoenix Suns vs wolves tonight me and @PeytonN79168963 at the game https://t.co/bzlMMuH5HL",
    "41": "@30reacts @sunsbestteam @The_JackHanson @Jumpshot8 @Suns It’s a shame they didn’t give the same pep talk before the play-in last year 💀",
    "42": "Minnesota Timberwolves (+1) vs. Phoenix Suns #RaisedByWolves #ValleyProud #NBA #NBATwitter #NBA75",
    "43": "@30reacts @sunsbestteam @The_JackHanson @Jumpshot8 @Suns the warriors are a .500 team over their last 25 games, so their loss is unfortunately reflective of the team sliding over a long period of time, so your argument is really, really, really bad.\n\nAlso, winning and losing are actually not the same thing. Hope this helps.",
    "44": "@30reacts @The_JackHanson @Jumpshot8 @Suns We’ve barely missed a beat and widened our gap against the rest of the league since then pipe down",
    "45": "The phoenix awoke to find the sun gone, the morning indefinitely delayed. Fortunately, somehow, she knew what must have happened. \n\nSing When The Sun Is Gone - https://t.co/A9pJSRCHFx",
    "46": "And when the Suns smoke them and he gets called out on his take, he’ll just say: “Okay, so? That’s what Phoenix is supposed to do, they’re the 1 seed.” https://t.co/qsDpPhtuHe",
    "47": "@30reacts @The_JackHanson @Jumpshot8 @Suns Warriors first round exits",
    "48": "Check out this story from AZ Central: Buckeye police seeks help to find attempted murder suspect\n\nPolice said they believe the suspect fled the scene in a 2015 black Dodge Charger SXT with Arizona Phoenix Suns license plate number PX3432.\n\nhttps://t.co/sH1aJ0EEy4",
    "49": "@30reacts @The_JackHanson @thenameisjoeyy @Jumpshot8 @Suns Ur team is “soft” and scared of every team according to draymond green. Worry about winning games because kerr said you cant rn",
    "50": "@neilruby @DarthVoita @Suns @matrix31 lol ok… cuz you know me right?",
    "51": "Phoenix Suns Starting Lineup 3/23\n PG: Cameron Payne\n SG: Devin Booker\n SF: Mikal Bridges\n PF: Jae Crowder\n C: Deandre Ayton\nhttps://t.co/o75oZ8vnE8",
    "52": "@danduarte1 @DarthVoita @Suns @matrix31 Said somebody who doesn’t respect elite levels of nba basketball across all levels of the damn game (except perimeter shooting)",
    "53": "Tonight's starting lineup for the Phoenix Suns:  Payne, Booker, Bridges, Crowder, Ayton https://t.co/bVWH4AMCA2",
    "54": "@Suns @mikal_bridges @SociosUSA I think I'll go with 19 points 🤔",
    "55": "@Sunsupnext @CHRISPL79266739 @Suns And you have yet to win the title like they did in 2018",
    "56": "Phoenix Suns Starters:\n\nCameron Payne\nDevin Booker\nMikal Bridges\nJae Crowder\nDeandre Ayton\n\nPlayers out:\nCameron Johnson\nFrank Kaminsky\nGabriel Lundberg\nChris Paul\nDario Saric\n#ValleyProud #NBA #NBATwitter #NBA75",
    "57": "@Suns Let's Go Boys!! https://t.co/4tBuhnZCUo",
    "58": "@Suns Free jersey?",
    "59": "Devin Booker and the Phoenix Suns look to teach Karl Anthony Towns and the Timberwolves a lesson https://t.co/s6PtvXfq5i",
    "60": "@Suns There are only 5 players in the team, admin!",
    "61": "Open Thread: @Suns (58-14) @ @Timberwolves (42-31) https://t.co/LEt8iwK4Ld https://t.co/4ZWOfFc6Bp",
    "62": "Uniforms for Phoenix Suns vs Minnesota Timberwolves at 5:00 PM.\n\n#ValleyProud #RaisedByWolves https://t.co/R5pPIXGP6e",
    "63": "15 back in the starting lineup. https://t.co/fL73czZw6v",
    "64": "@Suns @BannerHealth All these are right-sided injuries 🧐",
    "65": "@The_JackHanson @thenameisjoeyy @sunsbestteam @30reacts @Jumpshot8 @Suns You’ll lose in 6 ngl",
    "66": "Aye @BrooklynNets @sixers @celtics @HoustonRockets @Suns Need y'all to win https://t.co/7p9wFMPRDz",
    "67": "This week on “Who Wants To Disrespect The Phoenix Suns”\n@SHAQ doubles down on a terrible take…I’m keeping my receipts big fella https://t.co/aX4U96NQ0j",
    "68": "@Suns @mikal_bridges @SociosUSA 19! I love bonus points.",
    "69": "@sunsbestteam @30reacts @The_JackHanson @Jumpshot8 @Suns I like how the suns are 58-14 and continuing to win through injuries, and are so fucking good that this dude’s best shit talk is to point out that they “barely” won a game in which they went into OT without CP3, Payne, Johnson, McGee, Booker, and Ayton. 😂😂😂😂😂😂😂😂😂😂😂😵‍💫",
    "70": "Phoenix Suns May Be America’s Most TOXIC Workplace https://t.co/c5w8BRdYIr via @YouTube. @NBA @NBAPlayersUnion #Sarvarsucks #Yankhimout I’m so sorry for everyone who is or ever has had to work with him. But, when you let the big kids bully the little ones, what do you expect?",
    "71": "@devinbookerphx1 @Suns @BannerHealth ye my bad 😅",
    "72": "@poopooslimjim @GreekFreek34_ @TheHoopCentral @_Andrew_Lopez Nah I’m pretty sure all pro courts have stuff under them that gives extra cushion to the court, training facility or not. I’ve played ball on the Phoenix suns main court and the floor is bouncier. Feels way better to play on compared to a normal gym. It’s Better for the athletes",
    "73": "@Suns Let's goooooo",
    "74": "@Suns Shaq said Lakers beating us in the first round. What we got to say to that?",
    "75": "@WildKathyAZ @Suns I love this squad",
    "76": "Robert Sarvar's Phoenix Suns May Be America’s Most TOXIC Workplace #SACKSARVAR\n#PhoenixSuns @Suns whoa #RobertSarvar #WorkPlaceWellness #WorkPlaceHarassment\nhttps://t.co/eVDMXsdD8M via @TheYoungTurks",
    "77": "@dysothy @Suns @BannerHealth When you said CP I thought Chris Paul was back and I just misread the thing 😭",
    "78": "@Suns @BannerHealth bring cp3 back tomorrow its fantasy finals bruh",
    "79": "@OrlandoMagic @Suns S/O to the magic keep doing yall thang @warriors be ready for that fade Worriers",
    "80": "Won’t be surprised if the Phoenix Suns wins the NBA finals this year.. the league is sleeping on this team!",
    "81": "Great news! LFG @Suns!!! https://t.co/e23GTplnqH",
    "82": "@Jumpshot8 @Suns @Suns thoughts EJ??? https://t.co/uTxOouTk0W",
    "83": "@Dakodas_Dad @Suns @Timberwolves Love it! Go Suns - let’s do a Dakoda’s score prediction every game all the way until they win the title!",
    "84": "@Suns @BannerHealth Free jersey?",
    "85": "@Suns @mikal_bridges @SociosUSA he scored 19 points:)",
    "86": "@30reacts @The_JackHanson @Jumpshot8 @Suns Yeah its true ur team is even worse than a g-league team without steph",
    "87": "@Suns @BannerHealth What up Cam Johnson. Thought he would be back by now",
    "88": "@Suns @BannerHealth @FSKPart3 WHERE U AT MAN?!!",
    "89": "@Sunsupnext @NotMahMaximus @Suns Losing to Orlando Magic is just downright humiliating 💀 &amp; we’re “supposed” to be better than the Suns gtfoh. Warriors are coming off the colossal 2019 loss too so that’s prolly where all this is coming from, context matters. My bad for putting that energy towards y’all",
    "90": "@30reacts @The_JackHanson @Jumpshot8 @Suns Losing every game is taking a toll on ur mental health",
    "91": "🏀Phoenix vs Minnesota\n\nTOP 4 KEY STATS/TRENDS:\n-#Suns is 5-0 SU in last 5 games\n-Suns is 5-0 SU in last 5 games away\n-#Minnesota is 5-0 ATS in last 5 games at home\n-Minnesota is 5-0 SU in last 5 games at home\n\nSo who wins Suns vs. Minnesota?\n#GamblingTwitter #bettingtips #NBA https://t.co/n2dIlyrMkX",
    "92": "@30reacts @The_JackHanson @Jumpshot8 @Suns Absolute concerning bottom of the barrel scrape fight death loss to the worst team in the east now that’s embarrassing",
    "93": "It's a big one at the Target Center as the Wolves take on the league-leading Phoenix Suns. Wolves Live starts at 6:30 p.m. on Bally Sports North. @KatieStorm #WolvesWarmup https://t.co/KJhtmYz33j",
    "94": "Plenty of #NBA action to get around today, with ELEVEN games for punters to get behind!\n\nOur NBA expert @MattAbrahams1 previews three huge match ups below 👇\n\n🏀 @utahjazz vs @celtics \n🏀 @BrooklynNets vs @memgrizz \n🏀 @Suns vs @Timberwolves \n\n📝Preview: https://t.co/BliKUsSn1P https://t.co/XWEofb3oXo",
    "95": "@Suns @BannerHealth Glad Jae didn’t get significantly hurt.",
    "96": "The @Timberwolves are 10-2 ATS in their last 12 games 😎\n\nCheck out the odds and best bet to place as they take on the @Suns today 🔗 https://t.co/TcnjEuPNNA https://t.co/eKfXE6QZa7",
    "97": "@Suns @BannerHealth Yay jaes back",
    "98": "We partnered with the @Suns to provide an Arizona Hispanic-owned business a $5,000 prize, and we have a winner!\nCentral Phoenix Animal Hospital is the winner of our Los Sun Small Business MVP contest! https://t.co/o89KfAXvf7",
    "99": "Tonight's @BannerHealth Health update: https://t.co/ppm6lOynWe",
    "100": "@NeeNeeSr15 @DevinEsser @IsiahThomas @DevinBook @Suns @NBA Unless you make that decision, you're just another fan with an opinion.",
    "101": "@30reacts @The_JackHanson @Jumpshot8 @Suns Scored 90 against the 15th seed",
    "102": "@30reacts @The_JackHanson @Jumpshot8 @Suns We still win unlike ur g league team",
    "103": "@mikedonnelly555 @Suns @landryshamet @campayne @TargetCenterMN A house dividend.. https://t.co/Cyi3SkctV1",
    "104": "@30reacts @The_JackHanson @Jumpshot8 @Suns Steph less g-league warriors are worse than the magic",
    "105": "Phoenix Suns vs Minnesota Timberwolves Picks and Predictions 3/23/2022 https://t.co/0CfFygnGS3",
    "106": "@JayDiIla @PJTUCK3R_ @Suns you’d be doing him a favor.",
    "107": "@Suns @mikal_bridges @SociosUSA Do my nails get me an extra entry? https://t.co/lKxkXzF99y",
    "108": "@30reacts @The_JackHanson @Jumpshot8 @Suns Better than losing to both the pelicans and magic 🤣🤣🤣",
    "109": "@vml_xo @Suns Gosuns",
    "110": "Phoenix Suns",
    "111": "@NeeNeeSr15 @IamEthanG @IsiahThomas @DevinBook @Suns @NBA What's the excuse? Devin booker is the top sg in the league this year and deserves to be a first team all pro. I'll take the word of IT a hall of fame player before I ever take your opinion serious.",
    "112": "@30reacts @The_JackHanson @Jumpshot8 @Suns That was a 73-9 super team of course that team is gonna win with kd bozo",
    "113": "@30reacts @The_JackHanson @Jumpshot8 @Suns U should know how it is to choke on L’s yall losing to g league teams",
    "114": "Phoenix Suns legend Robert Horry",
    "115": "@Suns @mikal_bridges @SociosUSA 19 points!! Milkal is a beast!",
    "116": "@30reacts @The_JackHanson @Jumpshot8 @Suns Who carried ur team to their last two rings? Oh yeah it was KD the beat player on those teams",
    "117": "Back to back!! #WeAreTheValley #TheValley @Suns https://t.co/F9I3BTGF1D",
    "118": "On the latest 'The Inferno: A Phoenix Suns Podcast', @djautomatic joins @iam_DanaScott and @PHXMRORNG to talk about the experience of spinning at Suns games, what goes into getting a record deal &amp; more!\n\n🎧: https://t.co/nDVyGV3ia3 https://t.co/CXjyoK7svP",
    "119": "@30reacts @The_JackHanson @Jumpshot8 @Suns U guys havent had success since he’s left",
    "120": "@30reacts @The_JackHanson @Jumpshot8 @Suns *Kd carried yall to the ring (2x finals mvp)",
    "121": "Opening Line: Phoenix Suns (-1.5) vs. Minnesota Timberwolves(238.5) - Linemoves Since: (10) #Suns #Timberwolves  Full odds at https://t.co/nUn5OcMhOI",
    "122": "@NeeNeeSr15 @TheRealJoeGonzo @VariVlone @IsiahThomas @DevinBook @Suns @NBA Should be over 1st over Ja n Steph",
    "123": "Man I dont want to see that coward @patbev21 face! But I hope @DevinBook busts his ass like he usually does! Go @Suns #ValleyProud",
    "124": "@Suns Love that they give a lil fashion show before each game 💃 werkkk",
    "125": "@30reacts @The_JackHanson @Jumpshot8 @Suns Tell me where’s the lie?",
    "126": "Los Angeles Lakers' LeBron James needs to be traded to Phoenix Suns, Charles Oakley says. trust me we don't want his ass https://t.co/0HW7zNetE9 #SmartNews",
    "127": "@NeeNeeSr15 @IsiahThomas @DevinBook @Suns @NBA That’s the point. Now his performance is tied to team winning Vs his performance before was not. Lakers is loaded, Warriors have been loaded then why talk about lebron, or steph? Why give it to them before? he should be 1st, no matter how you look at it.",
    "128": "The Suns will be putting a five-game winning streak on the line when they take on a Minnesota Timberwolves team that is similarly hot right now. \n\nWill Minnesota make a statement by earning a massive Western Conference victory over Phoenix?\n\nhttps://t.co/Pdy6EMGjmA",
    "129": "@joshieU1G @CHRISPL79266739 @saltyburner44 @Suns Then why u making that statement 💀",
    "130": "🏀 A Western Conference clash goes down tonight between the T'Wolves and Suns in which Phoenix looks to keep its large 1st place lead. The Timberwolves sit in the 7th spot as they sit one game behind Denver for 6th. @FinnatWagerTalk gives his analysis.\n\n👉 https://t.co/C0Jup2t5EI https://t.co/6KOg21LVyA",
    "131": "@Suns DA deserves the max",
    "132": "The Phoenix Suns clinched their second consecutive Pacific Division on Tuesday. With 10 games remaining in the regular season, Chris Paul might return early... @kobeblackwell_ has the story 🏀\n\nhttps://t.co/y3nn15GUA9",
    "133": "Chill vibes 🥶 https://t.co/XX7wvUt62N",
    "134": "@justinreyesv @NotMahMaximus @Suns You aren't complaining but they're several warriors fans blaming everything because of injuries when every team has gone through the same thing",
    "135": "@Suns Free jersey?",
    "136": "@justinreyesv @CHRISPL79266739 @saltyburner44 @Suns Finals jokes from last year are old, they made me laugh at first but now they're repetitive and dumb",
    "137": "Today's NBA Picks: 8:00 PM ET - Phoenix Suns vs. Minnesota Timberwolves - 18 PICKS AVAILABLE: https://t.co/hvBNnFup9o #nba",
    "138": "@Sunsupnext @NotMahMaximus @Suns I’m not complaining warriors fucked up that still doesn’t change any facts today",
    "139": "🏀 GAME ANALYSIS 🏀\n\n🏟 Phoenix Suns vs Minnesota Timberwolves 🏟\n\n▶️ BET THE NBA ▶️ https://t.co/odroCYgovh\n\n#NBA #GamblingTwitter \n\nhttps://t.co/WjedSBdghy",
    "140": "@Suns I want a championship shirt, that's all I want. Please let's do it this year.",
    "141": "@Suns @mikal_bridges @SociosUSA 19 points",
    "142": "@CHRISPL79266739 @justinreyesv @saltyburner44 @Suns I mean yeah it won't change my mind, but if it was from someone reasonable then maybe",
    "143": "Shaq just because you came to Phoenix and lost doesn’t mean you have to hate the Suns forever. You were washed that’s why we lost to the Spurs. Let it go. https://t.co/WtvZmRcKMG",
    "144": "#agreed TIM THOMAS had a stretch for Phoenix Suns that was UNDERRATED AND SHOULD BE MENTINOED MORE tho💪😎🤔✊ #ohyup https://t.co/N4hFEvDRI8",
    "145": "@joshieU1G @CHRISPL79266739 @saltyburner44 @Suns 3-1 jokes are old considering what happened",
    "146": "@joshieU1G @justinreyesv @saltyburner44 @Suns If u watched you would’ve known it was rigged but nothing I say will change your mind so go ahead",
    "147": "@asvpbilli @Suns Bro liked his own tweet.... Couldn't be me. https://t.co/xmm8ND12MX",
    "148": "@justinreyesv @NotMahMaximus @Suns Every team has a injury lmfao. Chris and Book weren't playing vs the magic and nobody complained because we can actually beat them",
    "149": "@justinreyesv @CHRISPL79266739 @saltyburner44 @Suns Blowing a 3-1 lead is worse, one win away and you blew it 💀",
    "150": "@alexontweeter99 @CHRISPL79266739 @Suns No shit I did who has won the pacific division in the last 2 years?",
    "151": "@asvpbilli @Fruit_Tuesday @Suns Counter",
    "152": "@joshieU1G @CHRISPL79266739 @saltyburner44 @Suns Don’t care, still ringless 💀 u act like people are not suppose to be clowning y’all for fucking up a 2-0 lead last year.",
    "153": "@Leonard43070236 @matrix31 @Suns That may indeed be the hold up. And it sucks. But not just in Phoenix, around the NBA he was unappreciated then and now. Just baffles my mind. He is a huge reason why size don’t matter in front court as much now.",
    "154": "#iNeedThat 🧡💜RT @Suns: It's official❕\n\nGet your Pacific Division Champions merch now: https://t.co/I34u81wbgv https://t.co/SOsEaeMEOE",
    "155": "@Suns FIRST SEED IS OURS BABYYYY",
    "156": "@SalenaNiemann @Suns LOVE this",
    "157": "@Suns No one cares about division. It's about conference and Finals.",
    "158": "@its_khaleel @matrix31 @Suns I honestly don’t think they can. Not with Sarver as the owner.",
    "159": "@Fruit_Tuesday @Suns Ratio",
    "160": "What’s On this weekend thanks to @skycityadl \n\n🏈 Port vs Hawthorn Sat 7:10pm @ Adelaide Oval\n🏀 Adelaide 36ers vs SEM Phoenix Sun 12:30pm @ Entertainment Centre\n🏀 Adelaide Lightning Semi-Final series against Melbourne Boomers. Game 2 Sat 4:30pm @ Lightsview\n🏏 Redbacks v NSW",
    "161": "@Suns Job not finished. Let’s win it all.",
    "162": "@Suns I think I'll wait this time.",
    "163": "@Suns Suns are poverty",
    "164": "@RustyBUCKETS321 phoenix suns will choke the in the second round under the pressure of being a 1 seed and coming off nba finals appearance last season.",
    "165": "@Leonard43070236 @matrix31 @Suns Yeah, I don’t like Kerr. Love Marion. No matter why, they need to fix it.",
    "166": "@Suns Just give us valley jerseys pls",
    "167": "@BurnsAndGambo @Suns @Gambo987 @Steve_Zins The opportunity to have the best NBA fans of the nation stand behind them and make so much noise we bust Stephen A’s eardrums. 👍🏼",
    "168": "It's official❕\n\nGet your Pacific Division Champions merch now: https://t.co/ea2Ezt8I34 https://t.co/8SjgAnVkQB",
    "169": "@its_khaleel @matrix31 @Suns Wasn’t their a lot of drama with a contract renegotiation? Plus it was during the Kerr years. I H8 Kerr for how he destroyed the Suns. FYI",
    "170": "@Suns @mikal_bridges @SociosUSA 19 pts from The Warden",
    "171": "What would homecourt advantage in the playoffs mean for the @Suns? \n\n@Gambo987 and @Steve_Zins talk to Suns President and CEO Jason Rowley at 3:30!\n\n 📻: https://t.co/etIQn7skNo https://t.co/TqgYdekzSz",
    "172": "@YHLQMDLG69 @Suns Yes indeed!",
    "173": "Jalen Smith (horse play) ruled out Wednesday.\n\n#CREAMgetsTheMONEY at\nhttps://t.co/Nn0iNg7L2I\n\n@thejalen_smith #Valleyproud @Suns #NBADFS #DFS\n\nhttps://t.co/uXZW9KdA02",
    "174": "Phoenix the No. 1 offensive efficiency in the Association L/2 wks &amp; without Chris Paul. The Suns landed in Minny with 5-0 straight up mark last five games, also 4-1 against the number. The Suns OE is 129.1 pts per 100 possessions across L/5 gms. BUT, they have nothing to play for https://t.co/5lwLphP5RU",
    "175": "@CHRISPL79266739 @justinreyesv @saltyburner44 @Suns Don’t care, still applies",
    "176": "The Brooklyn Nets are +650 to win the NBA Championship after this news, trailing only the Phoenix Suns at +330 https://t.co/nUOQs9E3Eq",
    "177": "Man, @matrix31 is really one of the most underrated players of all time. Should be in @Suns Ring of Honor and Hall of Fame. I don’t understand the lack of recognition. I really don’t.",
    "178": "@DevinBook I’m gonna fall on the sword for our entire beloved city and blame it on the overall disrespect Phoenix gets. 🤷🏻‍♀️ we (waves hands at all @Suns fans) know you are THE MVP! #BookerMVP",
    "179": "Today's NBA Picks: 8:00 PM ET - Phoenix Suns vs. Minnesota Timberwolves - 17 PICKS AVAILABLE: https://t.co/hvBNnFup9o #nba",
    "180": "@Suns @mikal_bridges @SociosUSA 19 big ones",
    "181": "@Suns @mikal_bridges @SociosUSA 19 points in the championship game.",
    "182": "@DimmadomeHat You tell the phoenix suns to k*ll themselves one time and boom banned for 12 hours",
    "183": "In three years, the Phoenix Suns have gone from a laughing stock to the best team in the NBA. Are the Detroit Pistons the next team to follow in their footsteps?\n\n#Suns | #Pistons | @BigTimeTimJim  https://t.co/BrXZGlrJcK",
    "184": "Phoenix Suns -1 -110\n\nTexas A&amp;M -2 -115\n\n#NBA75\n#NIT",
    "185": "@Suns @mikal_bridges @SociosUSA Bridges scored 19 in the 2018 NC game",
    "186": "@Suns @mikal_bridges @SociosUSA 19 points with his second NCAA championship",
    "187": "NBA Game Analysis: The Minnesota Timberwolves have a forecast 58% chance to win against The Phoenix Suns with a spread of -9/9 and an over/under of 228. The Minnesota Timberwolves are 0 - 2 against The Phoenix Suns in the 2021-22 Season.\n#sportsbet \n#sportbetting",
    "188": "#SackSarver - Phoenix Suns owner needs to go! Get rid of him!!! @NBA @ESPNNBA",
    "189": "Not only are we still holding strong in 1st, we are now 9 games out instead of the 7 or 8 we were at when CP went out. 9 GAMES!!!!!!!!! NINE!!!!!! @Suns",
    "190": "@Suns @mikal_bridges @SociosUSA 19 points 🔥",
    "191": "@NeeNeeSr15 @IsiahThomas @DevinBook @Suns @NBA Lakers are 10 games below .500. Speaking from the bottom of the standings. Hush up",
    "192": "@SalenaNiemann @Suns Crazy progression 👏👏",
    "193": "3/23/01 – Philadelphia was w/out Allen Iverson, so led by Jason Kidd's 38th career triple-double (7th of '00-01; 12p/10r/14a), the Phoenix #Suns shut down the 76ers, 84-71, holding them to 17p and 11p in the 3rd and 4Q's. Robinson: 22p (4-7 from 3). Big Jake: 12p/8r. #ValleyProud https://t.co/osGpKLSU7E",
    "194": "The @Suns have a chance to clinch to top seed in the Western Conference with a win in Minnesota tonight! \n\nTo discuss the best team in the NBA, the fantastic @Vincemarotta will join @Gambo987 and @Steve_Zins at 3 for our weekly Roundball Roundtable!\n\n📻: https://t.co/etIQn7aJoO https://t.co/TcVunlPKJt",
    "195": "@NeeNeeSr15 @dmglanville @IsiahThomas @DevinBook @Suns @NBA Take your pick",
    "196": "@Suns_Armband @Suns Reporting in from PA",
    "197": "@izY6Gi2h0t83L9C @Suns @mikal_bridges @SociosUSA @DevinBook That's nice of you.",
    "198": "@Suns @mikal_bridges @SociosUSA 19 points of glory! https://t.co/MXyq2Prb8C",
    "199": "@Suns @mikal_bridges @SociosUSA 19 points!",
    "200": "@Gsus_2 @Suns He's adorable!! I'm so glad he's on our team!!!!!❤️",
    "201": "@Suns What’s more funny is the main people hating about this are all warriors fans. Bro nobody sent for y’all. Relax we got the west",
    "202": "@Suns @mikal_bridges @SociosUSA 19 points V's up",
    "203": "Phoenix Suns were 48-10 with Chris Paul with the best net rating in the NBA and both the 3rd best offensive rating and the 3rd best defensive rating. Since Paul’s injury they are 10-4 with the 3rd best net rating, 3rd best offense and 6th best defense.",
    "204": "Yes because F the @Suns https://t.co/NXN2NIeGvR",
    "205": "@NeeNeeSr15 @Henroooooo @Thugnotes2 @IsiahThomas @DevinBook @Suns @NBA And still winning without CP3",
    "206": "@NeeNeeSr15 @Henroooooo @Thugnotes2 @IsiahThomas @DevinBook @Suns @NBA He should win 1st team All NBA. He’s the leading scorer on the number one team in the league by 10 games. He is one of there top defensive players on a top 5 defensive team. Not to mention his assists are way up this year and his rebounding is good for a second season. LA sucks.",
    "207": "@NeeNeeSr15 @IsiahThomas @DevinBook @Suns @NBA Not at all just don’t think it’s as nailed as you claim. That cool?",
    "208": "@Suns_Armband @Suns Waiting to see these three on the court again https://t.co/uSWp2vCmc7",
    "209": "We are TRULY excited that our #Phoenix @Suns clinched the Pacific Division Title for the 2nd straight season and are closing in on home court advantage throughout the playoffs! #RallyTheValley #Partner https://t.co/fYIBNGRtPI",
    "210": "@Suns @mikal_bridges @SociosUSA 19 points. 🙏🙏🙏 I’d love this miss y’all so much and would love to get to a game. 🥺💜🧡🔥🤞",
    "211": "@30reacts @The_JackHanson @Jumpshot8 @Suns And ur team has peaked already no more championships KD not on the team anymore",
    "212": "@30reacts @The_JackHanson @Jumpshot8 @Suns But you guys keep racking up L’s 🤣🤣🤣 https://t.co/HYIJN1Sgqn",
    "213": "@Suns @mikal_bridges @SociosUSA 2 nattys, 19 pts.",
    "214": "@Suns @mikal_bridges @SociosUSA Mikal Bridges scored 19 points in the win.",
    "215": "@Suns @mikal_bridges @SociosUSA Mikal with 19",
    "216": "@CurryxCole @Suns @celtics So hopefully utah clutch that 3rd seed🤞",
    "217": "@30reacts @The_JackHanson @Jumpshot8 @Suns Ur team lost to a G league team with your young core",
    "218": "@Suns @mikal_bridges @SociosUSA 19 points scored by Mikal.",
    "219": "@Suns @mikal_bridges @SociosUSA 19 points",
    "220": "@30reacts @The_JackHanson @Jumpshot8 @Suns We’re literally proving we can win without paul are u slow?",
    "221": "@Suns @mikal_bridges @SociosUSA 19 points",
    "222": "@CurryxCole @Suns @celtics You don’t want to face Jokic while you playing bad, dallas in a series is a lot easier than Denver, you can boost your confidence against mid dallas then go crazy the rest of the playoffs",
    "223": "@Suns @mikal_bridges @SociosUSA 19 points, 2 chips 🐐",
    "224": "@Dakodas_Dad @Suns @Timberwolves What’s the score tonight Dakoda!?",
    "225": "If the Grizzlies (Morant out) lose to the Nets tonight and the Suns beat the Wolves, Phoenix will clinch the best record in the NBA with 9 games to go.",
    "226": "@Suns_Armband @Suns New Mexico! Lets Goooo!",
    "227": "@30reacts @The_JackHanson @Jumpshot8 @Suns Suns got a bright future unlike the warriors",
    "228": "Detroit Pistons - Atlanta Hawks\nIndiana Pacers - Sacramento Kings\nBoston Celtics - Utah Jazz\nMemphis Grizzlies - Brooklyn Nets\nMinnesota Timberwolves - Phoenix Suns\n\nBet slip link: https://t.co/9CRPX9M5sc https://t.co/Yfgi6OQzbd",
    "229": "@theReelRyan @IsiahThomas @DevinBook @Suns @NBA I'm not salty. You seem to take  this personal. 🤔 \nBooker will not make 1st Team All NBA over Steph, Luka, and Morant as a guard.",
    "230": "@CurryxCole @Suns @celtics Bro it’s good for y’all if utah takes the 3rd seed",
    "231": "@NeeNeeSr15 @IamEthanG @IsiahThomas @DevinBook @Suns @NBA Makes as much sense as someone thinking the best player on best team isn’t 1st all NBA and MVP candidate.",
    "232": "@Suns @mikal_bridges @SociosUSA 19 points! https://t.co/ly8ZVUmLbN",
    "233": "@Suns @mikal_bridges @SociosUSA The Warden scored 19💜🧡 https://t.co/zxjxuGajQb",
    "234": "@OrlandoMagic @Suns Thanks friend! I believe in #Magic .",
    "235": "@SinglServngFrnd @IamEthanG @IsiahThomas @DevinBook @Suns @NBA 😂😂😂🤣🤣😅\nOk jealous Laker fans. That's where ya going with this?\nStop it dude.",
    "236": "3/23/89 – The Phoenix #Suns crushed the Golden State Warriors 154-124, scoring 46-41-27-40 by Q. Their 46 1Qpts tied the then-club rec., &amp; 89 first half pts set the franchise-record. PHX led by 28p in the 3Q. Chambers: 33p. KJ: 26p/11a. Majerle: 25p. Mullin: 37p/9r. #ValleyProud https://t.co/TAcnfI5C1C",
    "237": "@Suns @mikal_bridges @SociosUSA A total of 19pts",
    "238": "@SUNBRERO_602 @Suns I feel ya!",
    "239": "@Suns_Armband @Suns Sleeping 😴 🤣",
    "240": "@30reacts @The_JackHanson @Jumpshot8 @Suns U guys are getting old this is ur last year to do anything. Dray and Klay turning 33, Steph turning 35. Ur window of opportunity is closing 🤷🏽‍♂️",
    "241": "@Suns @mikal_bridges @SociosUSA 19 points and of course he was on the court for 90% of the game!",
    "242": "@Suns @mikal_bridges @SociosUSA 19 points",
    "243": "@Suns @mikal_bridges @SociosUSA 19 points",
    "244": "And yet the @suns still get no respect! Dam https://t.co/3HgYTYQAVY",
    "245": "@Suns @mikal_bridges @SociosUSA 19 points for the twin",
    "246": "@OrlandoMagic @Suns 😂the nerve",
    "247": "@sarahmc24 @Suns They also already have a GM 😂",
    "248": "@NeeNeeSr15 @IsiahThomas @DevinBook @Suns @NBA When you own up to why you’re being a salty hater let me know.",
    "249": "@Suns @mikal_bridges @SociosUSA 19 points. Too ez",
    "250": "@_KeepItONdaDL__ @IsiahThomas @DevinBook @Suns @NBA Just saying",
    "251": "@SalenaNiemann @Suns I was wondering who’s been doing the graphics! Absolutely amazing job. Thank you for the side-by-side! Keep up the work",
    "252": "@DevinBook Phoenix fans get to see what this guy is doing every night and appreciate it… In the end his legacy will be right there with Steve Nash and Sir Charles. If he delivers a championship he will go down as the greatest sun/IT has spoken! Booker deserves MVP love!!",
    "253": "@IsiahThomas @Suns @NBA @DevinBook You can argue his viability as an MVP candidate, but Book wants a ring or two. That’s his goal and you can tell by how he plays on both ends of the floor.",
    "254": "@NeeNeeSr15 @IsiahThomas @DevinBook @Suns @NBA Hmm…second team? Maybe third. I don’t think he’s first team.",
    "255": "@habt_12 @IsiahThomas @DevinBook @Suns @NBA Wow. Excuses. He should stand out sir. Just saying. Stop with the Excuses",
    "256": "@Suns_Armband @Suns Repping the Westside for @Suns! Specifically Peoria",
    "257": "@Suns @mikal_bridges @SociosUSA 19 points",
    "258": "@DaSunsFan @IsiahThomas @DevinBook @Suns @NBA Lmao...So is he 1st Team All NBA?",
    "259": "@nickheald66 @IamEthanG @IsiahThomas @DevinBook @Suns @NBA Stop with the excuses. You can't be the mvp if you are not even selected as a top 5 player for that year.",
    "260": "@Suns_Armband @Suns Ahwatukee! Ready to beat MN!",
    "261": "@tweet2satishnow @IsiahThomas @DevinBook @Suns @NBA But winning is team oriented. That team is loaded. It's not just Booker. If it was, he would stand out. So is he 1st Team All NBA?",
    "262": "@30reacts @The_JackHanson @Jumpshot8 @Suns Its not really",
    "263": "@Suns @mikal_bridges @SociosUSA 19 points baby",
    "264": "@NotRenz223 @IsiahThomas @DevinBook @Suns @NBA Suns player trying to make Booker the MVP of the LEAGUE is laughable. Make a 1st Team All NBA first, then talk.",
    "265": "@OrlandoMagic @Suns They did it themselves, you weren’t needed 🤝",
    "266": "@privatechico @TheRealJoeGonzo @VariVlone @IsiahThomas @DevinBook @Suns @NBA 1st Team over who?",
    "267": "@Henroooooo @Thugnotes2 @IsiahThomas @DevinBook @Suns @NBA That's a bad excuse. If he is 1st Team All NBA, he would stand out.",
    "268": "@Suns @mikal_bridges @SociosUSA 19 good sir and ma’am! I’d happily fly out from Illinois to see my first Suns game.",
    "269": "@Suns @mikal_bridges @SociosUSA 19 points 🏀",
    "270": "@dmglanville @_KeepItONdaDL__ @IsiahThomas @DevinBook @Suns @NBA 1st Team over who??",
    "271": "Today's NBA Consensus (So Far):\n\nCharlotte Hornets 69%\nIndiana Pacers 67%\nPhoenix Suns 63%\nDallas Mavericks 63%\nOklahoma City Thunder 62%\nMiami Heat 59%\nSan Antonio Spurs 54%\nDetroit Pistons 53%\nPhiladelphia 76ers 53%\nBrooklyn Nets 51%\nBoston Celtics 51%\n\nUpsets will happen 🤷🤷",
    "272": "@jdap222 @IsiahThomas @DevinBook @Suns @NBA That's your excuse. He either is or isn't. You ain't the MVP if you ain't 1st Team All NBA sir.",
    "273": "@cploera10 @IsiahThomas @DevinBook @Suns @NBA Is he 1st Team All NBA? 🤔 You know the answer.",
    "274": "@Slaughter369 @DevinEsser @IsiahThomas @DevinBook @Suns @NBA But he won't. Case Close.",
    "275": "Ayton isn’t a Phoenix sun https://t.co/YOcPmK19bb",
    "276": "AUTHENTIC NEW Nike Phoenix Suns Devin Booker City Edition Jersey The Valley MENS https://t.co/VSF9a1CHZ7\n\n$164.95  \n\nBuy It Now for only: $164.95\nBuy It Now\n\n#shopping #deals",
    "277": "@sarahmc24 @Suns 💯\n\nDon't need no LBJ here",
    "278": "@RealJuanCordero @Suns I used to live right there!",
    "279": "What's with Jamba Juice being so good! They need a Phoenix Suns smoothie. \n\n@JambaJuice",
    "280": "He wanna be a Phoenix Sun so bad.. https://t.co/pRmTMyp0rl",
    "281": "@Suns_Armband @Suns Central and McDowell",
    "282": "@Kenneth63372372 @Suns @sofiasunss @ValleySunna @icarus_boy @Uknowmes1 @MatthewLissy @DarthVoita @evxz17 @sstoner612 @Emack5inAz @OhImAlex @Patsnation87 @angelinams112 @toeknee216 @Suns_Armband @TuffPlayz @jsandiegoo Just a few more hours till game time!",
    "283": "@Suns @mikal_bridges @SociosUSA 19 points",
    "284": "@OCalzaretta @Suns @DevinBook @fourpeaksbrew Zion probably next on the list next to Bron and KD",
    "285": "Go Suns 🔥\n#ValleyProud\n#phoenixsuns https://t.co/jRh1BOhmnR",
    "286": "Why is the Odds on Phoenix Suns 🏀 that high? \n\nKarl Towns doesn’t appear to be fit for this one Abi?",
    "287": "@ape_nba Im MVP with @Bucks , @Suns and @HoustonRockets 😎🔥",
    "288": "Do u think Edgeworth ever drives Phoenix somewhere and like has to wear sunglasses bc sun go brrrr but he’s still in his full suit so Phoenix is just like “you look like a jackass”\n\nEdgeworth gets transition lenses the next day",
    "289": "@Suns_Armband @Suns Checking in here in Gilbert @Suns  #ValleyProud https://t.co/SnfdaC31D3",
    "290": "@Suns @mikal_bridges @SociosUSA 19 points for the warden💪🏼",
    "291": "Win this @Suns jersey autographed by @DevinBook and help grant wishes for Arizona kids with critical illnesses! Bid on this and many other auction items available at https://t.co/zs59iLMwfz. 100% of proceeds benefits Make-A-Wish Arizona! 🏀 https://t.co/S7ZQuqNMsf",
    "292": "@suns_tutu_fan @Suns @sofiasunss @ValleySunna @icarus_boy @Uknowmes1 @MatthewLissy @DarthVoita @evxz17 @sstoner612 @Emack5inAz @OhImAlex @Patsnation87 @angelinams112 @toeknee216 @Suns_Armband @TuffPlayz @jsandiegoo Let’s go Veronica!! 🙌🏾🙌🏾",
    "293": "@Suns @mikal_bridges @SociosUSA He scored 19 points",
    "294": "@arodriguez52g @Suns @mikal_bridges @SociosUSA @DevinBook I second this",
    "295": "@Suns @mikal_bridges @SociosUSA 19 points",
    "296": "@Suns @mikal_bridges @SociosUSA 19 points! 👌🏼",
    "297": "@Suns @mikal_bridges @SociosUSA 19 points",
    "298": "NBA Basketball Game Betting Picks Simulator: 8:00 PM ET - Phoenix Suns vs. Minnesota Timberwolves - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/SNz7b0eI4L #nba #sportsbetting #freepicks #cappertek",
    "299": "Listen to @PHXMRORNG's and my podcast The Inferno Ep. 4 feat. @djautomatic about him spinning underground rap classics during @Suns home games, co-hosting @DanaCortez Show on Phoenix's 98.3FM, Suns' current five-game win streak and more. via @BleavNetwork  https://t.co/5NE7lCUgaz",
    "300": "Everyone’s path is different, believe in yourself and work hard. Great things will happen! Paris Bass recently made his NBA debut for the Phoenix Suns and is currently with the South Bay Lakers! Episode out now! https://t.co/GbF9jc06IU",
    "301": "@Suns @mikal_bridges @SociosUSA 19 points!",
    "302": "@ape_nba Yo soy MVP, @memgrizz @PhoenixSunsArg @Suns @celtics @cavs",
    "303": "@Suns @Brunson4NPOY @mikal_bridges @SociosUSA 19 points",
    "304": "03/23/2022 POTD: 20-5\n\nToday’s pick: NBA 👀🔥\n\nGame: Phoenix Suns vs Minnesota Timberwolves\n\nPick: Suns ML (-116) 2u\n\n2 unit play. It’s going to be a close game, and a hard fought one... that being said, I think Suns win by 3-4. Take the ML. #NBAPicks #POTD #FreePicks #NBATwitter",
    "305": "Part-Time Security Officers : Sportsbook - Phoenix Suns (Phoenix · AZ) https://t.co/0jUcTtDRa1",
    "306": "@Suns @mikal_bridges @SociosUSA 19 points!",
    "307": "@Suns @mikal_bridges @SociosUSA 19 points",
    "308": "@Wuinn_L His excuses include, loss to CJ McCollum and Dame, Bubble run that ended in a lost to the lakers in 5, playoff run with mpj concluding a loss to the Phoenix suns in 4, and upcoming loss probably to the Mavericks or T wolves",
    "309": "@Suns @mikal_bridges @SociosUSA 2 and 19p pts",
    "310": "@Suns_Armband @Suns Suns play today, today will be a good day.",
    "311": "@Suns @mikal_bridges @SociosUSA 19 points https://t.co/DjhmI1Melh",
    "312": "@Suns @mikal_bridges @SociosUSA Mika Bridges scored 19 points in 2018 championship game https://t.co/D2KA2OzPvJ",
    "313": "@suns_army @Suns @mikal_bridges @SociosUSA I’m pretty sure he dropped 19 on Michigan",
    "314": "@Suns_Armband @Suns Everyone getting ready for the playoffs to start like: https://t.co/eWMgSMLllo",
    "315": "@Suns @mikal_bridges @SociosUSA 19 babyyy",
    "316": "The Phoenix Suns have the 2nd best half court offense in the NBA and the 2nd best half court defense in the NBA.\n\nThey couldn’t possibly be better prepared for when the game slows down in the playoffs.",
    "317": "The Phoenix Suns don’t believe in rest. The Nuggets are cooked, I fear. https://t.co/eDdTslhGYv",
    "318": "@Suns @mikal_bridges @SociosUSA He scored 19 points",
    "319": "@barak2223 @NurdinKhalid10 I mean Marco is a phoenix, So is Nika the Sun god rubber in mythology or sum?",
    "320": "@Suns @mikal_bridges @SociosUSA 19 points",
    "321": "@Suns @mikal_bridges @SociosUSA 19 points",
    "322": "The Phoenix Suns have won 80% of their basketball games this season. Are they good?",
    "323": "@Suns @mikal_bridges @SociosUSA He had 19 points",
    "324": "We how CP3 been out since February the @Suns still the number 1 team but @DevinBook not even being mentioned for MVP i guess if ur steph or giannis or if Harden is doing something historic running against you, record matters 🤷🏽‍♂️",
    "325": "@Suns_Armband @Suns Fountain Hills checking in!🧡💜 https://t.co/7amcSo9lqd",
    "326": "@Suns_Armband @Suns Right hurrrrrr https://t.co/NtLzYGKlmM",
    "327": "Dame will be a Phoenix Sun.",
    "328": "The thing I like the most about the Phoenix Suns is that they beat bad teams like they’re bad teams\n\nThey get straight to business from the jump lmao\n\nThat’s what separates them from the rest of the contenders… At least, that’s how I see it",
    "329": "NBA Phoenix Suns vs Denver Nuggets Betting Analysis &amp; Pick https://t.co/EAhA9nJUmk Hop on board or get out of the way with white hot Stevie Vincent  #freepicks #vegasodds #sportsgambling",
    "330": "@Suns @mikal_bridges @SociosUSA 57,549 points",
    "331": "@arodriguez52g @Suns @mikal_bridges @SociosUSA @DevinBook You can buy your tickets here bro \n\nhttps://t.co/nrnXImVKC0",
    "332": "@Suns @mikal_bridges @SociosUSA 19 points",
    "333": "@Suns @mikal_bridges @SociosUSA 19 points! https://t.co/XUVmZVU0tM",
    "334": "@Suns @mikal_bridges @SociosUSA 19 points",
    "335": "The @Suns already have a coach https://t.co/1fTRBQJ3mr",
    "336": "@SalenaNiemann @Suns I like both designs 🤷‍♀️",
    "337": "@moc_dude He is absolutely right! Those @Suns team’s were the Steph/Klay Warriors before the Steph/Klay warriors. I’m a Celtics fan and I bought an #NBAPass every season, just so that I could watch every single game of theirs! I was a huge fan of theirs.",
    "338": "@Suns @mikal_bridges @SociosUSA 19 points. Love the game of Mikal and the Yellow sneakers.",
    "339": "@SunsSquad86 @Suns_Armband @Suns Omg so weird!",
    "340": "@Suns_Armband @suns_tutu_fan @Suns Man I don’t know!!! I can’t see GIfs in Egypt apparently",
    "341": "@Suns @mikal_bridges @SociosUSA 19 points and won 2 chips during his time at Villanova",
    "342": "@World_of_Sport Miami Heat \n\n76ERS\n\nPhoenix Suns\n\n#WorldOfSport \n#NBA",
    "343": "@ChrisBossert9 @Gambo987 @danbickley I would no longer be a Phoenix Suns fan. LeBron James has single-handedly tried to destroy the NBA🖕🏻",
    "344": "@Suns @mikal_bridges @SociosUSA 19 points scored",
    "345": "@AzSportsGirl63 @Suns @landryshamet @campayne @TargetCenterMN Love the Suns but go Wolves!",
    "346": "🏆 NBA CONFERENCE CHAMPIONS RAB! 🏆\n\nThis is 16/1 with SkyBet! ✅\n\n🟠 Phoenix Suns To Win NBA Western Conference 2022\n🟢 Boston Celtics To Win NBA Eastern Conference 2022\n\n📲 Link: https://t.co/nahw3jmGGF\n\n18+ | T&amp;Cs Apply | https://t.co/7ZhTEgyPAj | Always Gamble Responsibly https://t.co/EObc8HsNNh",
    "347": "@Suns @mikal_bridges @SociosUSA 19 cups of lemonade",
    "348": "@Suns_Armband @Suns We are at Fry’s buying Devin’s new drink!! 😜😜💜🧡",
    "349": "@Suns_Armband @suns_tutu_fan @Suns Lmao I don’t know, Egypt apparently blocks GIFs on Twitter. I haven’t seen an espn replay or gif this whole time",
    "350": "@SunsSquad86 @suns_tutu_fan @Suns Like this? https://t.co/4ce5Ulei4S",
    "351": "@Suns @mikal_bridges @SociosUSA 19 baby! Great game!",
    "352": "The Phoenix Suns are goated",
    "353": "@Suns_Armband @suns_tutu_fan @Suns I’m watching white people dance. It’s awful.",
    "354": "@Suns @mikal_bridges @SociosUSA 19 points",
    "355": "Today's NBA Consensus (So Far):\n\nCharlotte Hornets 69%\nIndiana Pacers 67%\nPhoenix Suns 63%\nDallas Mavericks 63%\nOklahoma City Thunder 62%\nMiami Heat 59%\nSan Antonio Spurs 54%\nDetroit Pistons 53%\nPhiladelphia 76ers 53%\nBrooklyn Nets 51%\nBoston Celtics 51%",
    "356": "@Suns @mikal_bridges @SociosUSA 19 points",
    "357": "@suns_tutu_fan @Suns Hope your having a good trip! 😊",
    "358": "@Suns @mikal_bridges @SociosUSA 23pts 8 rbs",
    "359": "@GBerta07 @Real_KyleJames @Suns @mikal_bridges @SociosUSA It is. Copied directly from the Wikipedia article on the game",
    "360": "@Suns @mikal_bridges @SociosUSA 19. Him and DiVincenzo were the only two players to score double digits.",
    "361": "@Kenneth63372372 @Suns @sofiasunss @ValleySunna @icarus_boy @Uknowmes1 @MatthewLissy @DarthVoita @evxz17 @sstoner612 @Emack5inAz @OhImAlex @Patsnation87 @toeknee216 @Suns_Armband @suns_tutu_fan @TuffPlayz @jsandiegoo Let’s gettt ittt😎",
    "362": "@Emack5inAz @Suns YOU KNOW IT!",
    "363": "@E_R_J1 San Siro\nFootprint arena (Phoenix Suns)\nNewlands Cape Town",
    "364": "@NeeNeeSr15 @DevinEsser @IsiahThomas @DevinBook @Suns @NBA He should make 1st team all NBA.",
    "365": "@Suns @mikal_bridges @SociosUSA 2 and 19. I had to watch that as a Michigan fan",
    "366": "NBA Betting Trend: We have Phoenix Suns at -200, which is an 80 point difference from the current line.\n#bettingpicks\n#sportbetting",
    "367": "@Suns Iets go biggest suns fan !!!!!!!!!!!!!!!",
    "368": "@suns_tutu_fan @Suns_Armband @Suns Yeah for sure…..",
    "369": "@DarthVoita @Suns @matrix31 Ring of honor yes…. Number retired? Come on now",
    "370": "@Suns_Armband @Suns Getting that Z ready for tonight 😈",
    "371": "@MWhiteASU07 @Emack5inAz @Suns @Timberwolves It was a gift from one of his followers.",
    "372": "@Suns_Armband @Suns Bored Kevin? Lol",
    "373": "@Suns @mikal_bridges @SociosUSA 19 points!",
    "374": "Let it be know, where all the @Suns fans @?!?\nHMU. 👇❤️✋👁️👁️\n#ValleyProud #RallyTheValley",
    "375": "We gotta end cetacean captivity. Heinous greed monsters killed 4 dolphins help captive Phoenix desert heat hot sun! Hello it's 110 to 120 much of summer. Protest marched for weeks. They shipped the last 2 sick out and shuttered tg. https://t.co/EbbDjFyQpg",
    "376": "@Suns @mikal_bridges @SociosUSA 19 points",
    "377": "@Suns @mikal_bridges @SociosUSA 19 points 💪🏽",
    "378": "TIP: Minnesota Timberwolves - Phoenix Suns, 2, 1.82 by #tipster wrmm (profit this month: +64.88)\n  #betting #Basketball #Minnesota #Timberwolves #Phoenix #Suns",
    "379": "@Suns @mikal_bridges @SociosUSA 19 points",
    "380": "@Suns @mikal_bridges @SociosUSA 19 I was there",
    "381": "Random Thoughts by John: The @Suns not having @matrix31's jersey retired would be like the Cowboys not having retired Emmitt Smith's. \n\nGive some respect to the junk yard dog of your big three.",
    "382": "@peakoko @DuaneRankin They were calling everything for the Timberwolves &amp; that's the only reason the @Suns had to get that WIN out the trenches by 3 points! Regardless of all of that, that had to be my favorite game so far of the season because @DevinBook &amp; @CP3 were just CLUTCH in the 4th.",
    "383": "@Suns @mikal_bridges @SociosUSA 2 championships and 19 points!",
    "384": "@The_JackHanson @30reacts @Jumpshot8 @Suns Yeah like i respect the warriors but when it comes to an arrogant fan like him whose disrespectful as shit to every other fanbase i had to match his energy. He’s the worst type of person",
    "385": "@peakoko @DuaneRankin If you remember the last time we played there, &amp; they had to fix the rim ONLY because @DevinBook &amp; @CP3 realized it wasn't aligned correctly, I can only speculate that the @Suns would have lost that game if that correction was never made. Plus, the REFS weren't on our side either",
    "386": "@Suns @mikal_bridges @SociosUSA 19 points https://t.co/hvU9gjDgYI",
    "387": "in my latest for @brightsidesun i wrote about my favorite phoenix sun and volume dials: https://t.co/YvnM2wk2mh",
    "388": "@Suns @mikal_bridges @SociosUSA Mikal won 2 championships while at Villanova and dropped 19 points on Michigan in 2018 👀 \n\nGo Suns!",
    "389": "@Suns @mikal_bridges @SociosUSA He scored 19pts",
    "390": "@Suns @mikal_bridges @SociosUSA The man himself got 19 buckets",
    "391": "@Suns @mikal_bridges @SociosUSA 23 points",
    "392": "@Suns @mikal_bridges @SociosUSA He had 19 points on 7-12 fg’s, and went 3-7 from 3",
    "393": "@Suns @mikal_bridges @SociosUSA 19 pts, 4 reb., and 1 assist in 36 minutes if we are being specific 🧐",
    "394": "@AngxlRodriquez @Suns @mikal_bridges @SociosUSA 19 points",
    "395": "@Suns @mikal_bridges @SociosUSA 19 points",
    "396": "@Suns @mikal_bridges @SociosUSA 19! With an incredibly smooth stroke and while playing championship level defense!",
    "397": "@unidentifi21ajh @VictorJTF2001 @Sixers_YB @jacob_pretzman @Suns I hope y’all win your first ring I’m not even a suns hater at this point",
    "398": "@Suns @mikal_bridges @SociosUSA Big 19 y’all heard",
    "399": "@Suns @mikal_bridges @SociosUSA He scored 19!",
    "400": "@Suns @mikal_bridges @SociosUSA 19 points https://t.co/nQ4kQU7NVf",
    "401": "@Suns @mikal_bridges @SociosUSA 19 points https://t.co/W8kiVtxn5T",
    "402": "How Tyreek Hill trade changes the NFL + best bets for the Phoenix Suns and the rest of the NBA https://t.co/yCchZG0VOx",
    "403": "@Suns @mikal_bridges @SociosUSA 206 probably. +/- 5 points.",
    "404": "@thrillathechase @Suns Ur gonna be adding an L patch to this jacket after tonight, buddy. Wolves gonna kick your teams ass tbh.",
    "405": "@Suns @efirstbank Nice move 👏 👌",
    "406": "@ESPNAshley @ArizonaCoyotes Who'd they pkay again? Whoever they did my Fantasy players on that team did perf last night.  Thanks to you and your team Ashley.  You got the @Suns so stop complainin loke I got @Spurs since my @MapleLeafs strugglin to win Cups lol And sorry for trading your top scorer for Hall",
    "407": "@Suns @mikal_bridges @SociosUSA 19 points scored.",
    "408": "I like to give a special shout-out to the     @OrlandoMagic. If it wasn't for your Valiant effort on beating the @warriors, we would never be Pacific CHAMPS on our day Off! @Suns\n\n#VALLEYPROUD #RALLYTHEVALLEY #NBA75",
    "409": "Who are your sports allegiances? \n\nNFL - Cardinals (pain)\nMLB - Dbacks (more pain)\nNCAA - ASU (also pain)\nNBA - Suns\nNHL - Coyotes (dear God)\nMLS - I’ll pretend this says USL so Phoenix Rising\nPGA - Yawn\nF1 - Yawn",
    "410": "@VictorJTF2001 @unidentifi21ajh @Sixers_YB @jacob_pretzman @Suns God has been good to me https://t.co/1JxYebRxsq",
    "411": "@Suns @mikal_bridges @SociosUSA He had 19!",
    "412": "@Suns @mikal_bridges @SociosUSA 19 points",
    "413": "Yeah!!! U really throught I wasn’t going to cop @DevinBook Coco5 drink.. PSSSHHH Y’all are foolish @Suns https://t.co/HXUAjKXcXx",
    "414": "@ASAP__Sports @cenkuygur @YouTube @NBA @Suns Big brother Cenk 🧐 it has no place in Holy Trinity",
    "415": "NBA Betting Trend: We have Phoenix Suns at -200, which is an 80 point difference from the current line.\n#sharpbets\n#sportbetting",
    "416": "The #Suns are a 1.5-point favorite over the #Timberwolves in Wednesday's game, but several sites like Minnesota's chances to beat Phoenix ... #ValleyProud https://t.co/lwH0W7hzBG",
    "417": "@TanaHughes @Suns oh thank you bb 🖤🖤🖤",
    "418": "Tune in to @RocAndManuch LIVE from @VeneziasPizza  in Gilbert on @foxsports910.\n\nWill the @Suns be at Full Strength tonight.\nAlso, @cheetah to the @MiamiDolphins.\n\nListen Live: https://t.co/chJXVWdJvp\n@SportsRadioRoc @screspin02. https://t.co/eIzKeLvh6W",
    "419": "@jackenzler @Suns thank you so much!",
    "420": "Los Angeles Lakers' LeBron James needs to be traded to Phoenix Suns, Charles Oakley says ⁦@Gambo987⁩ ⁦@danbickley⁩ can we squash this nonsense? https://t.co/zxxffQpRXz",
    "421": "@Suns @mikal_bridges @SociosUSA 19 pointssss",
    "422": "@hereforsuns @Suns agreed. thank you!",
    "423": "The Charlotte Hornets are on a 5 game win streak. They are currently tied with the Phoenix Suns for the longest active win streak in the NBA.\n\nThey are top 5 this season in points, assists and threes per game.\n\n#MuseTakeover https://t.co/DozSxXxQAD",
    "424": "Chicago Sky &amp; Bulls v.s Phoenix Mercury &amp; Suns. https://t.co/eNjpvqLemm",
    "425": "@Suns @mikal_bridges @SociosUSA 25 points",
    "426": "@Suns @mikal_bridges @SociosUSA Bridges scored 19 points in the Championship Game.",
    "427": "@Suns @mikal_bridges @SociosUSA 19 points",
    "428": "@AlanPaedowitz @IsiahThomas @DevinBook @Suns @NBA If Sarver is guilty, I hope the league does drop him, but placing this in this discussion thread surely makes you a fan of one of \"those other\" MVP candidates.  Pathetic.",
    "429": "@MainEventVoice @Timberwolves @TargetCenterMN @Suns @WashWizards Need a fill in?? I got a booming voice!!",
    "430": "@elliotlperry @Suns So proud of this exceptional young man - on the court and, most importantly, off the court. Ya’ll just don’t know how special he is. I’m not even related to him, but I secretly consider myself his Grandma!",
    "431": "@Suns @mikal_bridges @SociosUSA He scored 19 points",
    "432": "@Suns @mikal_bridges @SociosUSA All of them! https://t.co/Nk1y6X8yoC",
    "433": "@SalenaNiemann @Suns Incredible! Keep up the great work.",
    "434": "Exclusive footage of how teams have been trying to defend the @Suns this year\n\nHoping @DaneMooreNBA can break this down for us\n\n#RaisedByWolves https://t.co/ZY4GSMElaq",
    "435": "@Suns @mikal_bridges @SociosUSA 19 points",
    "436": "@Suns @mikal_bridges @SociosUSA 19 points",
    "437": "@urboymfresh @IsiahThomas @DevinBook @Suns @NBA Bruh, you're a fan of one of \"those\" guys, no doubt.  LMFAO",
    "438": "@archinectjobs San Luis Obispo, Long Beach, Santa Barbara, Portland, Wailea, Phoenix, Sun Valley, Frisco, Waimea, Braintree, Atlanta, Denver, Billings, New Paltz, Annapolis, Fayetteville, Bridgehampton, Irvine, New Orleans, White Plains, Orange...",
    "439": "Memphis Grizzlies vs. Phoenix Suns \nWestern Conference Finals 2022\n\nCalling it now.",
    "440": "@Suns @mikal_bridges @SociosUSA 19 points with 3 or 4 threes as I remember.",
    "441": "@Suns @mikal_bridges @SociosUSA 19 7/12 from the field, 4 boards, an assist and a steal! Typical Mikal Bridges stat line 💪🏽",
    "442": "@NBA it’s not only absolutely ridiculous that you have an owner in the league that has been Donald Sterling levels of racist, but also extremely telling of your values that employees of the @Suns have faced mental anguish based alone on their workplace. Get better #SackSarver",
    "443": "@Suns @mikal_bridges @SociosUSA Our city’s future DPOY scored 19 points in Villanova’s win over Alabama in the 2018 championship game! Yeehaw!🤠",
    "444": "@Suns @mikal_bridges @SociosUSA 19 points baybeh",
    "445": "@lisco_2000 @Suns Awww this is so sweet of Dario. Happy Birthday and Enjoy.",
    "446": "@Suns @mikal_bridges @SociosUSA 19 points https://t.co/jAkCL8nDxO",
    "447": "@Suns @mikal_bridges @SociosUSA He scored 19!",
    "448": "@lewdbutter @IsiahThomas @DevinBook @Suns @NBA Maybe the media has been looking under the hashtag \"#cryteria\"",
    "449": "@Suns @mikal_bridges @SociosUSA 19 POINTS!",
    "450": "@Suns @mikal_bridges @SociosUSA He scored 19!",
    "451": "@Timberwolves nation! I will not physically be in @TargetCenterMN for tonight’s game vs @Suns, but I will be there in spirit. I’m out of town on personal business but I will see you all on April 5th vs @WashWizards.\n#RaisedByWolves",
    "452": "@Suns @mikal_bridges @SociosUSA two titles, 19 points 😬",
    "453": "@Suns @mikal_bridges @SociosUSA 19 points https://t.co/6OiIbHV71N",
    "454": "@Suns @mikal_bridges @SociosUSA 28 points",
    "455": "@CANDYMANCHENK @IsiahThomas @DevinBook @Suns @NBA You sound like NBA pundits.  Who cares about that lineup.  It will never exist.",
    "456": "@thabigamigo23 @IsiahThomas @DevinBook @Suns @NBA They still talk about the Warriors (and Lakers).  They talk the big woe is me about their injuries.",
    "457": "@Suns @mikal_bridges @SociosUSA 19 points",
    "458": "@Suns @mikal_bridges @SociosUSA He scored 19 points  in that 2018 game",
    "459": "@Suns @mikal_bridges @SociosUSA Thanks for the opportunity though.",
    "460": "@Suns @mikal_bridges @SociosUSA I was wrong! 😭",
    "461": "@Suns @mikal_bridges @SociosUSA 19 points",
    "462": "@Suns @mikal_bridges @SociosUSA He scored 19 pts! One of the best trades Suns made during the 2018 NBA Draft #ValleyProud  #RallyTheValley",
    "463": "Hate has NO HOME is America’s sports.\n\nNO EXCUSES.\n\nJoin leading Civil Rights and community leaders to call on the @NBA to remove Robert Sarver from ownership of the @Suns. \n\nSign the letter today to #SackSarver: https://t.co/j2l6jYQ1KE https://t.co/JjFcQIiNrP",
    "464": "@Ace_saidit @IsiahThomas @DevinBook @Suns @NBA That MVP got his behind handed to him in the playoffs last year to the Suns, and all he could do was bitch slap Cam Payne while his brothers looked threateningly at Booker who defended his teammate.",
    "465": "@Suns @mikal_bridges @SociosUSA 28 points in the Title game.",
    "466": "@Suns @mikal_bridges @SociosUSA 19 points!!",
    "467": "@Suns @mikal_bridges @SociosUSA 2 &amp; 19 points",
    "468": "@Suns @mikal_bridges @SociosUSA Raja Bell points",
    "469": "@Suns @mikal_bridges @SociosUSA 19 points",
    "470": "@Suns @mikal_bridges @SociosUSA 19 points! #RallyTheValley",
    "471": "@Suns @mikal_bridges @SociosUSA Solid 19",
    "472": "@SalenaNiemann @Suns Cleary her improvement is due to chris pauls leadership abilities",
    "473": "@Suns @mikal_bridges @SociosUSA 19 points",
    "474": "@Suns @mikal_bridges @SociosUSA Easy question now may I please get some 76ers vs @Suns tickets for me and my daughter as a birthday gift for her 9th birthday will be in town and would love to add to our memories we have created as @Suns fans. She met @DevinBook when she was 3yrs old. https://t.co/LrjBzuIZET",
    "475": "@Suns @mikal_bridges @SociosUSA 19 points",
    "476": "@Suns @mikal_bridges @SociosUSA 2 titles, 19 points in the championship game, but you can't leave out his priceless worth on defense",
    "477": "@Suns @mikal_bridges @SociosUSA 2 championships, and he score 18 points",
    "478": "@Suns @mikal_bridges @SociosUSA 19 points 🏀",
    "479": "@Suns @mikal_bridges @SociosUSA 18 points",
    "480": "@thrillathechase @Suns Thanks! I’ll look on Sunday! 💜🧡",
    "481": "@NeeNeeSr15 @IsiahThomas @DevinBook @Suns @NBA All NBA are \"considered\" better player awards, but in the end, it's still a popularity contest that the media debate to try to convince each other all year long.  If the media got the awards taken away from them they wouldn't even debate them because they wouldn't have a stake.",
    "482": "@Suns @mikal_bridges @SociosUSA 19 points",
    "483": "Phoenix Suns May Be America’s Most TOXIC Workplace https://t.co/Ii3Hy7djyA via @YouTube It's amazing what people in power can get away with. @NBA needs to have much, much better accountability. #SackSarver",
    "484": "@VUSportsdotcom @Suns @mikal_bridges @SociosUSA Should have been 3…Omari",
    "485": "DEVIN RATED ROOKIE AUCTION ENDS TONIGHT AT 9:56PM ET! \n2015-16 Donruss Devin Booker Rated Rookie RC #223\n https://t.co/VM65urLdnD\n#devinbooker #Suns #PhoenixSuns #RatedRookie #whodoyoucollect #basketballcards @collectorfix",
    "486": "@Suns @mikal_bridges @SociosUSA 19 points!",
    "487": "@Suns @mikal_bridges @SociosUSA 19 points",
    "488": "@Suns @mikal_bridges @SociosUSA 19 and rocking my bridges gear today https://t.co/KoXUbWBG4E",
    "489": "@Suns @mikal_bridges @SociosUSA 19 for the mikal jail",
    "490": "@Suns @mikal_bridges @SociosUSA He scored 19 pts that year to win it",
    "491": "@Suns @mikal_bridges @SociosUSA 19 points against Michigan",
    "492": "@Real_KyleJames @Suns @mikal_bridges @SociosUSA I suspect it's crtl c + crtl v",
    "493": "@Suns @mikal_bridges @SociosUSA 19 points vs Michigan",
    "494": "@Suns @mikal_bridges @SociosUSA 19 points!!",
    "495": "Resort-style Paradise Valley home has ties to Phoenix Suns; on sale for $9.5 million: https://t.co/LCoNuVv4F0 https://t.co/y9zEKXoYds",
    "496": "@Suns @mikal_bridges @SociosUSA 19 points",
    "497": "@Suns @mikal_bridges @SociosUSA 19 points. #RallyTheValley",
    "498": "@ButtCrackSports @Lakers @AntDavis23 @MiamiHEAT AD should perhaps focus more on getting back on the court and helping short handed Lakers rather than posting bulletin boards that unnecessarily inflame teams aka Phoenix Suns and now Miami Heat!",
    "499": "NBA Betting Preview: Phoenix Suns vs. Minnesota Timberwolves - Wednesday, March 23, 2022 https://t.co/gdXdfVoa33",
    "500": "@Robert__Beaver @IsiahThomas @DevinBook @Suns @NBA You think Booker on the court doesn't also make CP3 that much better.  Let me finish w/this. If Murray had played all year with Denver and Suns still had a better record that Jokic would still be your MVP?  How many games has Denver lost that Jokic deserved the MVP in those games",
    "501": "@Suns @mikal_bridges @SociosUSA 19 points",
    "502": "@Suns @mikal_bridges @SociosUSA 19 baby!!!!",
    "503": "@Suns @mikal_bridges @SociosUSA 19 for the win!",
    "504": "@Suns @mikal_bridges @SociosUSA Got 19 in the 2018 Championship with 2 Titles on Villanova",
    "505": "@Suns @mikal_bridges @SociosUSA 19 (93 over the whole tournament)",
    "506": "@Suns @mikal_bridges @SociosUSA 19 points!",
    "507": "@Suns @mikal_bridges @SociosUSA 19 for the man of steel",
    "508": "@Suns @mikal_bridges @SociosUSA That’d be 19 for Mikal “Mikal Bridges” Bridges https://t.co/sxQW8xiE5p",
    "509": "@Suns @mikal_bridges @SociosUSA 19 points",
    "510": "@Suns @mikal_bridges @SociosUSA 19 points in 2018 national championship",
    "511": "@Suns @mikal_bridges @SociosUSA He scored 19 points to win it all",
    "512": "@WusijiEx the worst thing I can think of (since you asked to get roasted) is the Phoenix Suns.",
    "513": "@Suns @mikal_bridges @SociosUSA 19 points",
    "514": "@Suns @mikal_bridges @SociosUSA 19 points",
    "515": "@Suns @mikal_bridges @SociosUSA 2 Chips - 19 pts in 2018",
    "516": "@Suns @mikal_bridges @SociosUSA Free jersey?",
    "517": "@Suns @mikal_bridges @SociosUSA I was first",
    "518": "@Suns @mikal_bridges @SociosUSA 19 points",
    "519": "@Suns @mikal_bridges @SociosUSA 2 titles, 19 points",
    "520": "@Suns @mikal_bridges @SociosUSA Mikal \"the only NBA player\" Bridges scored 117 points and grabbed 63 rebounds along with 33 assists in the 2018 NCAA National Championship game.",
    "521": "@Suns @mikal_bridges @SociosUSA 19 points",
    "522": "@Suns @mikal_bridges @SociosUSA 19 points.",
    "523": "@VictorJTF2001 @unidentifi21ajh @Sixers_YB @jacob_pretzman @Suns Could give af about clout at this point in my life 😂  raise a multi-million dollar brand before u come to talk to me",
    "524": "@solelybrbdoo @EighthRule @IsiahThomas @DevinBook @Suns @NBA They need the MVP award to be shared with coaches and players so their vote doesn't matter as much.",
    "525": "@Suns @mikal_bridges @SociosUSA 19 for the Warden 😤",
    "526": "@Suns @mikal_bridges @SociosUSA 19 points!!!",
    "527": "@Suns @mikal_bridges @SociosUSA 19 points!",
    "528": "@Suns @mikal_bridges @SociosUSA 19 points",
    "529": "@Suns @mikal_bridges @SociosUSA 2 championships while dropping 19 in 2018 🔥",
    "530": "@Suns @mikal_bridges @SociosUSA 19 innit?",
    "531": "@Suns @mikal_bridges @SociosUSA 2, 19 points!",
    "532": "@Suns @mikal_bridges @SociosUSA HE HAD 19",
    "533": "@Leopold77271209 @IsiahThomas @DevinBook @Suns @NBA They have their noses so far up you know where they can't see straight.",
    "534": "@VictorJTF2001 @unidentifi21ajh @Sixers_YB @jacob_pretzman @Suns U think I’m doing this for clout 💀",
    "535": "How many national titles did @mikal_bridges win during his three years at Villanova?\n \nBONUS: Respond below how many points he scored in the 2018 Championship game for your chance to win a gameday elite package!\n \n@SociosUSA | #RallyTheValley",
    "536": "@brenandpeyton @Suns There's a lil set up right outside the Dos Equis beer garden in the arena.",
    "537": "@IsiahThomas @DevinBook @Suns @NBA Also, so many in the media pegged Book from the beginning whereas, as in Embiid's case, for example, he was hurt a lot early in career, the Sixers still haven't won a title w/him, and they begged Harden to come over to \"fix\" that.  That doesn't necessarily make him more valuable",
    "538": "@thrillathechase @Suns Did you get the Mikal and point god patches at the pro shop?",
    "539": "@IsiahThomas @DevinBook @Suns @NBA I think the process does suck.  It's a media only award and they talk about it all year trying to convince their fellow media members who it should be.  That kind of discourse is why this shouldn't be a media only award.",
    "540": "@IsiahThomas @DevinBook @Suns @NBA Also, I'm no speaking for Book, but he may not be so much talking about himself THIS year, but a little about CP3 last year.",
    "541": "@NeeNeeSr15 @IsiahThomas @DevinBook @Suns @NBA most valuable player, not best player.  maybe you think lebron and mj or whoever should get all of those awards they didn't get back in the day.  Seems like above average Philly and slightly above average Denver should be better if Embiid and Jokic were truly more valuable",
    "542": "@NeeNeeSr15 @_KeepItONdaDL__ @IsiahThomas @DevinBook @Suns @NBA Yes. He is first team all-nba. Great offensive numbers, has turned into a well- above average defender (lowest defensive rating for a SG), lead his team to an amazing record even without CP3 and other injuries, best player on the best team. Sounds like first team all-nba!",
    "543": "@NeeNeeSr15 @Thugnotes2 @IsiahThomas @DevinBook @Suns @NBA More so**, not rather than.",
    "544": "@NeeNeeSr15 @Thugnotes2 @IsiahThomas @DevinBook @Suns @NBA No he wasn’t. Largely due to not being on a big market team. That’s the point here. These nominations, awards, etc are cherry picked to name popularity and recognition rather than actual merit.",
    "545": "@OrlandoMagic @Suns Magic goated.",
    "546": "@NeeNeeSr15 @Thugnotes2 @IsiahThomas @DevinBook @Suns @NBA he’s clearly a 1st team all nba player. best 2 guard in the league",
    "547": "Game Preview: @Suns battle against hungry a @Timberwolves\n\n(via @DarthVoita) https://t.co/f2AexHhMHa https://t.co/sIMRCcVnwm",
    "548": "The BANDIT AGENDA\n\nPhoenix Suns 🗑\nChicago Bulls 🗑\nPhiladelphia 76ers 🗑\nAtlanta Hawks 🗑\nNew York Knicks 🗑",
    "549": "NBA Phoenix Suns vs Denver Nuggets Betting Analysis &amp; Pick https://t.co/uuzZw4h22K",
    "550": "@SalenaNiemann @Suns Improvement is a beautiful thing 🔥",
    "551": "Derrotas dos Bulls: \n\nPhoenix Suns: 0-2\nMemphis Grizzlies: 0-2\nMiami Heat: 0-3\nGolden State Warriors: 0-2\nMilwaukee Bucks: 0-3\nPhiladelphia 76ers: 0-4 https://t.co/qSI0wmlkyx",
    "552": "@GeraldBourguet @PHNX_Suns Always such solid work. Was wondering if you had anything to say about @suns winning the division &amp; the only mention I could find was in a story on espn about the @warriors losing to the @OrlandoMagic",
    "553": "Phoenix Suns vs. Minnesota Timberwolves picks, predictions: Who wins NBA game Wednesday?\nhttps://t.co/UvvlQ39Awl",
    "554": "@IsiahThomas @DevinBook @Suns @NBA This is applicable when u look at some ppl trying to put Embiid above Jokic for mvp ...no way! Embiid missed numerous games, sit out recently; Jokic been playing MVP BB SINCE START OF SEASON! And been consistently turning it up! Nikola Jokic IS NBA MVP 2022!",
    "555": "@Sixers_YB @jacob_pretzman @Suns And the Raptors and Hawks still own you",
    "556": "Phoenix Suns vs. Minnesota Timberwolves picks, predictions: Who wins NBA game Wednesday? https://t.co/5fvb0bywgO",
    "557": "@lisco_2000 @Suns This is so precious https://t.co/U8nNBnP0aq",
    "558": "Just saw @DevinBook at @FrysFoodStores. #Suns #Frys #DevinBooker #Kroger #PhoenixSuns #Display. In Ahwatukee on Chandler Boulevard. https://t.co/3rsVu0K35G",
    "559": "My nephew loves wearing his @Suns gear to school 🤩 https://t.co/9B7i91J9YA",
    "560": "@EighthRule @solelybrbdoo @IsiahThomas @DevinBook @Suns @NBA You make no sense",
    "561": "The Valley Jacket is coming along nicely 👀 love that the @Suns did this. Looking forward to a championship patch. https://t.co/AJa0cz241J",
    "562": "NBA 🏀 Temporada: 94-96\n\nMiércoles 23/3: \n\nBrooklyn Nets -1.5 (-110)\nBrooklyn Nets vs Memphis Grizzlies U 238 (-110)\nPhoenix Suns vs Minnesota Timberwolves U238 (-110)\nOrlando Magic vs OKC Thunder U221.5 (-110)\nPhiladelphia 76ers vs LA Lakers U230.5 (-110)",
    "563": "@Melchisio NFL - boring\nMLB - baseball is for the old and bitter\nNCAA - what is that?\nNBA - Phoenix Suns\nNHL - who tf is watching ice hockey\nSerie A - Juventus\nMLS - no.\nPGA - is this golf?\nF1 - My father always loved Ferrari so I would also take Ferrari if I had too",
    "564": "@SalenaNiemann @Suns amazing piece of work",
    "565": "🏆 NBA CONFERENCE CHAMPIONS RAB! 🏆\n\nThis is 16/1 with SkyBet! ✅\n\n🟠 Phoenix Suns To Win NBA Western Conference 2022\n🟢 Boston Celtics To Win NBA Eastern Conference 2022\n\n📲 Link: https://t.co/nahw3jmGGF\n\n18+ | T&amp;Cs Apply | https://t.co/7ZhTEgyPAj | Always Gamble Responsibly https://t.co/Mi5qAGQ0Fl",
    "566": "@EighthRule @IsiahThomas @DevinBook @Suns @NBA Your saying because you don’t consider him a superstar then he shouldn’t get the MVP",
    "567": "@IsiahThomas @DevinBook @Suns @NBA Why not Chris Paul?",
    "568": "@ScottUrich @IsiahThomas @DevinBook @Suns @NBA Not what I’m saying at all. And I cld care less who gets MVP. Its like nobody actually read what I said. Smh",
    "569": "@redleader_ewok @in4_warriors @CantGuardBook1 @OrlandoMagic @Suns Me too, I am hoping CP3, Jae, De Aron, &amp; Cam Payne are healthy by then 🙏🏻",
    "570": "📰 Phoenix Suns vs Minnesota Timberwolves Prop Bets and Parlay Odds March 23!\n👉 https://t.co/0KfGAXq01E @wagertalk",
    "571": "The Phoenix Suns took the next step in their continued ascendance from NBA cellar-dweller to title contender this week. And the Suns are favored tonight against Minnesota.\n\nhttps://t.co/Dx04Vfv2Ej",
    "572": "The Phoenix Suns face the Minnesota Timberwolves in Wednesday's NBA Basketball Action. Get Trending Rabbit's NBA Basketball Pick.\n\n#NBA #NBAPick #NBAPredictions #NBAOdds #Timberwolves #Suns #ValleyProud #RaisedByWolves #SunsVsTimberwolves https://t.co/b7N0UevBRQ via @YouTube",
    "573": "@NeeNeeSr15 @Slaughter369 @IsiahThomas @DevinBook @Suns @NBA You're getting ratiod left and right and you're the one telling others to stop it? How about accept that you made a stupid comment and move on... https://t.co/dAbVPkaiW7",
    "574": "@NeeNeeSr15 @SinglServngFrnd @IsiahThomas @DevinBook @Suns @NBA Makes sense, you’re a “Lakers fan”. I’m sorry Book hurt your feelings last year but he’s undoubtedly 1st team All-NBA this year.",
    "575": "@SalenaNiemann @Suns Ohhhh she snapped 🔥🔥🔥",
    "576": "@SalenaNiemann @azballer23 @Suns They keep you busy winning all of these accolades! Looks awesome!",
    "577": "@redleader_ewok @in4_warriors @CantGuardBook1 @OrlandoMagic @Suns I’m not imagining anything, we’ll just have to wait til we get there but it’s not looking good for warriors with Steph out 😐",
    "578": "Dates for Small Farm Summer Open Houses are available: \n\n✅ Sun, May 15 - Phoenix Farm, IC\n✅ Sun, June 5 - Grade A Gardens, Earlham,\n✅ Sun, July 10 - Jupiter Ridge LLC, Garber\n✅ Sun, Aug 21 - Bee Haven Farm, Solon\n✅ Tues, Sept 20 - Red Fern Farm, Wapello",
    "579": "Isiah Thomas: Let it be known @DevinBook @Suns @nba league #MVP conversation best record leading scorer has always been part of the #criteria. Devin Booker: Appreciate that IT but the “#criteria” changes depending on players name.Source:\n\nhttps://t.co/Gn77hWBaCA https://t.co/Ct4jTDq2XS",
    "580": "Chris Paul's leadership style isn't for everybody, but Matt Barnes and JJ Redick can attest the #Suns point guard makes teams better.\n\nBoth were Paul's teammates with #ClipperNation .\n\nPhoenix being 109-35 since Paul arrived via trade is proof of that.\nhttps://t.co/wRKgcpHJzo",
    "581": "Today's matchup is live:\n☀️ Phoenix Suns @ 🐺 Minnesota Timberwolves (PHX -1.5)\nMake your pick before 8:00 PM EDT!\nhttps://t.co/vk5NH6RGTR",
    "582": "@justinreyesv @in4_warriors @CantGuardBook1 @OrlandoMagic @Suns Yeah but what are we imagining? I don’t get what you’re saying.",
    "583": "The Phoenix Suns took the next step in their continued ascendance from NBA cellar-dweller to title contender this week, becoming the No. 1 team on multiple sites in the state. \n\nWrote about the team's chances for @BetArizona here: \n\nhttps://t.co/CvxrY43dHV",
    "584": "2021 NBA Season Phoenix Suns Vs Portland Trail Blazers NBA 2k22 Simulation NFT. Purchasing this NFT will give you access to our limited edition release. Visit our YouTube channel here: https://t.co/SequwO1Fsp for more information. #nft https://t.co/S60oZc5vyt",
    "585": "2021 NBA Season Phoenix Suns Vs Portland Trail Blazers NBA 2k22 Simulation NFT. Purchasing this NFT will give you access to our limited edition release. Visit our YouTube channel here: https://t.co/SequwO1Fsp for more information. #nft https://t.co/SrjfNXWitK",
    "586": "@SalenaNiemann @Suns I commented it on the Suns page but that graphic is awesome! Great work",
    "587": "@lisco_2000 @Suns YES what an amazing gift!!!!",
    "588": "@rolandsmartin He is a former NBA exec in the Phoenix Suns. He was an NBA analysis for ESPN and now with Dan Le Batard's Meadowlark Media.",
    "589": "Analyzing Wednesday’s Phoenix Suns at Minnesota Timberwolves odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/xWWLNKJ7zg",
    "590": "@redleader_ewok @in4_warriors @CantGuardBook1 @OrlandoMagic @Suns March 30 https://t.co/3NT7dTVfMX",
    "591": "Consensus Line Move:\n2022-03-23 Phoenix Suns at Minnesota Timberwolves from 237.00 to 238.00\nOver certainly\n#NBA #betting #machinelearning #forextrader",
    "592": "Phoenix Suns at Minnesota Timberwolves odds, picks and predictions https://t.co/ByMUBVyX7V",
    "593": "@justinreyesv @in4_warriors @CantGuardBook1 @OrlandoMagic @Suns What?",
    "594": "@EighthRule @IsiahThomas @DevinBook @Suns @NBA By that logic go ahead and just give it to Lebron every year.  That’s what your saying right?",
    "595": "Teams that are top 11 in both offense and Defense.\n1) Utah Jazz\n2) Phoenix Suns\n3) Memphis Grizzlies\n4) Boston Celtics\n5) Miami Heat\n\nEvery team that has won a title since 2004 has been top 11 in offense and defense. So I guess these are the top contenders",
    "596": "@NeeNeeSr15 @IsiahThomas @DevinBook @Suns @NBA Laker fan talking on Suns basketball is laughable. Have fun in that play-in game",
    "597": "@NeeNeeSr15 @IsiahThomas @DevinBook @Suns @NBA Ofcourse winning counts and should only count. What are your skills then used for? If your skills is translating to winning for the team, then it is most valuable. You have no clue.",
    "598": "@in4_warriors @CantGuardBook1 @OrlandoMagic @Suns And 400million more dollars too huh",
    "599": "@kalebivy_FF @YevgeniyKogosov @IsiahThomas @DevinBook @Suns @NBA Sensitive from every other team's fans and supposedly analysts discounting the Suns run last yr and discounting them as a team this yr because of said run. Straight out lies can make you sensitive to having to hear it again.",
    "600": "@garrettdanielss @SalenaNiemann @Suns i think its hard to judge. theyre in totally different styles, so i think its about what style people like more, not how \"good\" the skill of the designer is",
    "601": "It’s basketball season anyway. We up. @Suns",
    "602": "@SalenaNiemann @Suns nicee!",
    "603": "@CantGuardBook1 @OrlandoMagic @Suns how u gonna say that when no one on the suns team has one either. Terrible comeback",
    "604": "@NeeNeeSr15 @IamEthanG @IsiahThomas @DevinBook @Suns @NBA He should be first team all NBA. He won't be because the goal post moves for people like Devin Booker. You asking if he will be is part of the problem. No he won't be but he absolutely should be.",
    "605": "Chris Paul 'an acquired taste' with leadership, says former Clippers teammates Matt Barnes, JJ Redick #Phoenix #Suns #NBA https://t.co/AP2SBOmDnO",
    "606": "@NeeNeeSr15 @IsiahThomas @DevinBook @Suns @NBA It’s “player of the year”. \n\nAlways has been.",
    "607": ".@matrix31's isn't lying.\nHis all-time @Suns ranks:\nMinutes played: 2\nPoints: 4\nFG: 3\n3-PT FG: 5\nRB: 2\nDef RB: 1\nSteals: 2\nBlocks: 3\nWin shares: 1\nWin share per 48 minutes: 5\nValue over replacement: 1 https://t.co/9Ji4yqL1g9",
    "608": "☝🏽😲\n“Who got the #1 winning percentage in Phoenix Suns history??   \n\nN•IGGA, ME!”\n\n~ Shawn Marion https://t.co/1yXOh28Q3L",
    "609": "The fastest-growing #NBA Social Media Presences over the past month:\n\n1 - @memgrizz \n2 - @sixers \n3 - @BrooklynNets \n4 - @chicagobulls \n5 - @hornets  \n6 - @warriors \n7 -  @Bucks \n8 - @Suns \n\n#StatsTwitter #MachineLearning #SocialMediaAnalytics #DataScience #NBATwitter https://t.co/xTnafGahIb",
    "610": "Chris Paul 'an acquired taste' with leadership, says former Clippers teammates Matt Barnes, JJ Redick https://t.co/C5aK7EM0ww via @azcentral @DuaneRankin @OldManAndThree @Suns @LAClippers",
    "611": "somebody at the bar tried to tell me the miami heat had a better record than my phoenix suns so i cut him off.",
    "612": "Of the 13 teams to win 67+ games in an NBA season (the pace the Phoenix Suns are on) 10 won MVP.\n\nThe 3 that didn’t:\n1997 Bulls (69-13) Karl Malone won\n2016 Spurs (67-15) Steph Curry won\n2017 Warriors (67-15) Russell Westbrook won",
    "613": "Charlotte Hornets - New York Knicks\nMemphis Grizzlies - Brooklyn Nets\nMinnesota Timberwolves - Phoenix Suns\nPortland Trail Blazers - San Antonio Spurs\n\nBet slip link: https://t.co/s4DJBQxqEQ https://t.co/Wr90s0fRa5",
    "614": "@Suns @Timberwolves @BALLYSPORTSAZ @az_mejor rest the starters, avoid more injuries",
    "615": "Check out 2020-21 Panini Mosaic National Pride Chris Paul #251 Phoenix Suns https://t.co/eu1XCQmj3Z @eBay",
    "616": "3/23/00 – Nearly two-years after he last played, and one day after Jason Kidd broke his left ankle vs Sacramento, the Phoenix #Suns officially called 34-year-old Kevin Johnson out of retirement for the final 15 games of the regular season, plus the playoffs. #ValleyProud https://t.co/oXUK8755uV",
    "617": "With a Suns win and a Grizzlies loss tonight, Phoenix would clinch the NBA's best record. #RallyTheValley https://t.co/pyfrsjOApu",
    "618": "@lisco_2000 @Suns Dario is awesome. One of my favorite players, and seems like a great guy",
    "619": "The fastest-growing #NBA Social Media Presences over the past week:\n\n1 - @memgrizz \n2 - @BrooklynNets \n3 - @warriors \n4 - @Suns \n5 - @sixers \n6 - @chicagobulls \n7 - @hornets \n8 - @Bucks \n\n#StatsTwitter #MachineLearning #SocialMediaAnalytics #DataScience #NBATwitter https://t.co/TgwYc7RIv0",
    "620": "Join us at the Phoenix Suns vs. Lakers game! We will be featured as the non-profit of the evening! Visit our table at the stadium and keep an eye out for our PSA running during the game. \nBUY TICKETS HERE: https://t.co/AGKqUflsuT https://t.co/3zNm2uYKMb",
    "621": "@NeeNeeSr15 @Thugnotes2 @IsiahThomas @DevinBook @Suns @NBA Thank god you’re here to tell us the rules of the world",
    "622": "@OrlandoMagic @Suns I love the Magic Twitter now",
    "623": "@elliotlperry @Suns \"Confidence is the Key\"",
    "624": "Wednesday's #NBA75 #BettingPicks from \n@SpreadAstaire\n\n🏀Phoenix Suns vs Minnesota Timberwolves: Banker at -110 (1.91)\n\n+Parlay at +265 (3.65)\n👇👇👇\nhttps://t.co/gJqURWKfSr",
    "625": "@ScottUrich @IsiahThomas @DevinBook @Suns @NBA And you wld be wrong. A dude can be a great ball player and not be a superstar. Nba is filled with them, and Booker is one.",
    "626": "@ThomasHoops87 @az_mommacg @XinNBA Its mind boggling how a team that has been so good for two years - still doesn't get the \"re--uhhh-spect\" - are you talking to me Zach Lowe!!!!!   Re-uh-spect - the Phoenix Suns   Re-uh-spect the best in the West!!!",
    "627": "Thanks for sharing this. It was gratifying working my way up from the CBA and such an honor playing for @Suns organization 🙏🏾🙏🏾 https://t.co/BiVg5kW4zQ",
    "628": "@NeeNeeSr15 @IsiahThomas @DevinBook @Suns @NBA He isn’t because of strange mediatic decisions, but his stats show he should be.",
    "629": "@Suns @Timberwolves @BALLYSPORTSAZ @az_mejor Free jersey?",
    "630": "@Suns  @DevinBook  got fans ever where you guys go https://t.co/hEJXwETkog",
    "631": "@EighthRule @IsiahThomas @DevinBook @Suns @NBA I’m going to safely go with; you don’t watch any games.",
    "632": "@IsiahThomas @DevinBook @Suns @NBA Just change the award to the Most popular player award because let’s be honest it’s a popularity contest, the minute Andrew Wiggins became an all star starter made everyone and anyone who votes on anything retarted.",
    "633": "Yo. Why is the Phoenix Suns mascot a primate? Like frfr why?",
    "634": "@Dakodas_Dad @Suns @Timberwolves You got a little snicker from Dakoda—Love all his Suns gear!",
    "635": "@NeeNeeSr15 @IsiahThomas @DevinBook @Suns @NBA Spelling is a little bit of a struggle for you huh? We know you down bad watching these Lakers get clapped on a nightly basis, its ok big dog.",
    "636": "@NeeNeeSr15 @IsiahThomas @DevinBook @Suns @NBA I mean I can but I don’t vote for it or anything. It’s double standards and “names” for it. But it’s all good",
    "637": "@Suns CP3 gonna need to be replaced here soon https://t.co/LLi5IkzXfT",
    "638": "@Suns @Timberwolves @BALLYSPORTSAZ @az_mejor Let’s keep going y’all and get this W 🙏🏻",
    "639": "@Suns Hear me out let the Timberwolves beat you, then you beat the Nuggets...",
    "640": "@Emack5inAz @Dakodas_Dad @Suns @Timberwolves Agree that shirt is fire! Was thinking about asking where he got it.",
    "641": "@ASAPSmitty It’s an average though so probably did have hell of double doubles. The man had 427 career double doubles. He also top 5 in majority all time Phoenix Suns stats. All I’m saying is he’s not lying he speaking the facts.",
    "642": "Phoenix Suns 🏀🏆 https://t.co/24swVlqoBt",
    "643": "@NeeNeeSr15 @IamEthanG @IsiahThomas @DevinBook @Suns @NBA I answered it multiple times.  Yes he is 1st team    I don’t question if he is.   People who know basketball like HOFer  point guard who won multiple titles thinks he is.   It’s only jealous Lakers fans who need a play in to even be in playoffs who like to think he isn’t",
    "644": "The home was originally custom built for a #Phoenix Suns player, who never got a chance to live in it.  https://t.co/8LOacl2b4f",
    "645": "@Suns @Timberwolves @BALLYSPORTSAZ @az_mejor Could clinch that 1 seed today 👀",
    "646": "@DevinEsser @IamEthanG @IsiahThomas @DevinBook @Suns @NBA Btw, the Suns won without Booker. That's a lame point.\n\nIs Booker 1st Team All NBA?  Yes or no. There should be no hesitation.",
    "647": "Western Conference battle. \n\n🆚 @Timberwolves \n🕔 5:00PM\n📺 @BALLYSPORTSAZ\n📻 ESPN 620 | @az_mejor https://t.co/0DDnNfX9g1",
    "648": "You could be off to Phoenix Arizona with the Eugene F. Kranz Toledo Express Airport!  Get in to win our Fun In The Sun Flyaway at 12:30!   https://t.co/QrC48Rzp19",
    "649": "@1dreezmatic @DevinEsser @IamEthanG @IsiahThomas @DevinBook @Suns @NBA 1st Team All NBA....",
    "650": "@NeeNeeSr15 @IamEthanG @IsiahThomas @DevinBook @Suns @NBA Yes he is 1st team and should be on MVP conversation.   You know he is… case closed",
    "651": "@CHRISPL79266739 @Suns Stay salty",
    "652": "@TaylorKirkham @DevinEsser @IamEthanG @IsiahThomas @DevinBook @Suns @NBA Is Booker 1st Team All NBA? 🤔🤔 You know the answer.",
    "653": "@nickheald66 @IamEthanG @IsiahThomas @DevinBook @Suns @NBA Is Booker 1st Team All NBA?  Yes or No. Is he? You know the answer. Enjoy your day.",
    "654": "@SinglServngFrnd @IamEthanG @IsiahThomas @DevinBook @Suns @NBA You sound like you in your feelings. So I'll ask you this question again. Is Booker a 1st Team All NBA? 🤔 If you even have to question it, the he isn't the League MVP. \n\nEnjoy your day sir.",
    "655": "Fanatics needs to stop adding gorgeous Phoenix suns jackets and sweatshirts as it’s starting to become summer.  Sucks buying all of these and then waiting until next season to wear them!",
    "656": "@lisco_2000 @Suns Dario is the best cinnamon roll🥹. We love you Dario💜🧡 happy Happy Belated bday girl",
    "657": "@SinglServngFrnd @IamEthanG @IsiahThomas @DevinBook @Suns @NBA Is he 1st Team All Nba? 🤔 Is he? You know the answer. Then he ain't the MVP. Case Close.",
    "658": "@dane_vandy @NeeNeeSr15 @DevinEsser @B500003 @IsiahThomas @DevinBook @Suns @NBA Lol Lebron on a 31 win team this guy is smoking crack..",
    "659": "@EvelioT01 @IamEthanG @IsiahThomas @DevinBook @Suns @NBA Is he 1st Team All NBA?  You know that answer. Case close.",
    "660": "The @Suns might have America’s most racist/sexist work environment. Owner Robert Sarver has said, when considering hiring an African American coach, “These n-words need a n-word”, according to a former executive. Many other examples @espn #sacksarver \n\nhttps://t.co/Bl6aDC4j3a",
    "661": "Suns playing today?\n\nWell isn’t it a MF good day baby! \n\n@Suns | #ValleyProud",
    "662": "Suns (58-14) @ Timberwolves (42-31)\n🚨Buzzer Moment Watch\n⏰8:00 pm EST\n📱Buzzer⚡️, NBA LP\nSpread: PHO: -1.5 (@FDSportsbook) \n\nPhoenix enters this matchup having won five in a row",
    "663": "@habt_12 @IsiahThomas @DevinBook @Suns @NBA 😂😂😂🤣🤣🤣😅😅😆\nYou mad because you don't want to answer the question. Is Booker 1st Team All NBA?  🤔 👀 😳 Is he? If he isn't, then he isn't the MVP. Period!!!",
    "664": "🏆 NBA CONFERENCE CHAMPIONS RAB! 🏆\n\nThis is 16/1 with SkyBet! ✅\n\n🟠 Phoenix Suns To Win NBA Western Conference 2022\n🟢 Boston Celtics To Win NBA Eastern Conference 2022\n\n📲 Link: https://t.co/nahw3jmGGF\n\n18+ | T&amp;Cs Apply | https://t.co/7ZhTEgyPAj | Always Gamble Responsibly https://t.co/vbnANoGAq8",
    "665": "The Phoenix Suns take on the Minnesota Timberwolves tonight at 8 PM EST!\n\nThe Phoenix Suns are currently on a 5 game win streak, and the Timberwolves are coming off of a tough, 2-point loss against the Mavericks. #Suns #TumberWolves https://t.co/WqlMX5xjAE",
    "666": "Phoenix Suns vs. Minnesota Timberwolves picks, predictions: Who wins NBA game Wednesday? https://t.co/UraZJcqXwh",
    "667": "@NeeNeeSr15 @IsiahThomas @DevinBook @Suns @NBA I can’t answer that because I don’t know the bias in the voters.   If it is being voted in fairly without bias.  Yes he is first team all NBA.   Of course when humans vote bias is always part of the equation.",
    "668": "My two NBA picks tonight\n\nKings ML +200\nSuns ML -118\n\nDoes anyone know why the suns are only -118?? They’re far and away the best team in the league so the value is great imo \n\n#sportsbettingpicks #NBATwitter #PhoenixSuns #SacramentoProud #GamblingTwitter",
    "669": "@NeeNeeSr15 @IsiahThomas @DevinBook @Suns @NBA Looking only at numbers for points, assists…etc., is an overly simplistic way of viewing a players value.\n\nBooker (or Paul) could put up better individual numbers…guaranteed. But it likely wouldn’t translate to as many W’s. His value is that he’s great without being selfish.",
    "670": "@mellkk @Suns That would work for my cats! 🧡💜🐈",
    "671": "@Desert_Dad1 @IamEthanG @IsiahThomas @DevinBook @Suns @NBA The Suns won without Booker too. So your point? That team is loaded.\n\nBut answer this, does Booker make the All NBA 1st Team?  Yes or No. You know that answer. There shouldn't even be a hesitation sir. He ain't the mvp.",
    "672": "@USAproudd @NeeNeeSr15 @rfpcrawford @IsiahThomas @DevinBook @Suns @NBA he definitely does watch the suns play. especially in game 6 where he torched his lakers for 47",
    "673": "3/23/16 – Kobe Bryant played his final game at and against (#87) the Phoenix #Suns, a 119-107 PHX win (PHX: 20-51; LAL: 15-56). Following the game, Kobe gave Devin Booker Kobe's name-brand shoes with the inscription \"Be Legendary\". Kobe: 17p/3r/2a. Booker: 28p/3r/7a. #ValleyProud https://t.co/bjIkFFjYCo",
    "674": "Among elite perimeter defenders, @Suns F Mikal Bridges fouls opponents at the lowest rate per 48 minutes (2.7). And sure, that seems simplistic.\n\nBut @matissa15 explains why it's part of a greater story; one that shows he's deserving of far more praise than he receives ⬇",
    "675": "【Stock information】CHAMPION \"PHOENIX SUNS 34 BARKLEY\" BASKET TANK / PURPLE / https://t.co/KYm8hdjO0G",
    "676": "@NeeNeeSr15 @IsiahThomas @DevinBook @Suns @NBA A “statistical standpoint” needs to include his wins/losses. He’s not out there playing selfish ball. He’s out there as a top defender at his position, and an offensive weapon who is looking to make the entire squad great around him - value/effectiveness measured in wins/losses.",
    "677": "@_KeepItONdaDL__ @IsiahThomas @DevinBook @Suns @NBA I have been waiting for someone to unequivocally tell me that Booker will make the All NBA 1st Team. No one can. If you are the MVP, there is not one hesitation about making the 1st Team.",
    "678": "Our guy! \n\n@mikal_bridges is one of the most consistent and charismatic individuals we know. \n\nHe is a tremendous example of being BETTER &amp; DIFFERENT. \n\nBest of luck with the rest of the season &amp; into the playoffs!\n\n📸 - @Suns https://t.co/fh0fYwTuxo",
    "679": "@SinglServngFrnd @IsiahThomas @DevinBook @Suns @NBA Sir you said Deserve. You guys are saying in the conversation. 😂😂😂😅Stop it. Is he going to make 1st Team All NBA? Yes or No.",
    "680": "Phoenix Suns vs. Minnesota Timberwolves picks, predictions: Who wins NBA game Wednesday? #Phoenix #Suns #NBA https://t.co/4yOfshyGRk",
    "681": "Back 2 Pacific Division Champs!!!\n@Suns VS @Timberwolves is #BadNews for Minnesota. #DakodaKnows #ValleyProud #1seed #lockitup #NBA75 https://t.co/jyf0PVQw7t",
    "682": "Phoenix Suns May Be America’s Most TOXIC Workplace https://t.co/oZfIaWYMjL via @YouTube #SackSarver",
    "683": "@OrlandoMagic @Suns Thank you Orlando",
    "684": "@Leopold77271209 @IsiahThomas @DevinBook @Suns @NBA Win a real, y’all ain’t learned this from Steve nash teams ? Win all these games and lose in the playoffs",
    "685": "@NekiasNBA No. The Phoenix Suns are close to trading Devin Booker to the Orlando Magic",
    "686": "Get a preview of the Phoenix Suns vs. Minnesota Timberwolves basketball game. https://t.co/tFkTzJA6h8\nvia @ESPN App https://t.co/CmyJAIIdo3",
    "687": "@theReelRyan @IsiahThomas @DevinBook @Suns @NBA Home just really mad, because he can't give a reason how Booker can make 1st Team All NBA. 😂😂😂🤣😅😅😆\n\nLike dude, you ain't the MVP if ain't on the All NBA 1st Team.  You just ain't.",
    "688": "@redleader_ewok @in4_warriors @CantGuardBook1 @OrlandoMagic @Suns We don’t really have to imagine tbh, there’s a game on March 30 just like there was last Christmas and December 3",
    "689": "@Thugnotes2 @IsiahThomas @DevinBook @Suns @NBA Dude Stop it. You comparing Booker to Steph?? 🤔\n\nIs Booker a 1st Team All NBA?  Yes or No. If he isn't, then hes not an MVP! Case Close.",
    "690": "@DevinBook nailed it though in his reply to IT… MVP criteria changes. How is Ja in the talks but Book isn’t. @espn you’ve gotta do better. @Suns keep grinding and to hell with the 🤡 analysts who aren’t being better at their jobs!",
    "691": "Both are small market teams so don’t try that angle. I guess having someone like @KendrickPerkins screaming about the 🐻 for months is what it takes. Maybe the @Suns need an insider at @espn.  @DevinBook was right about the disrespect he gets for not being in the MVP convo",
    "692": "The @Suns should really be feeling disrespected at this point. I’m not even a Suns fan but they have CRAZY talented players and team! Damn near the best record all season &amp; get no recognition.  But yet @ESPNNBA @espn all trying to choke us with jamming Memphis down our throats.",
    "693": "@MannyChokuba Its okay Cs taking East Suns in the West Phoenix Boston Finals",
    "694": "GAME DAY for the #Timberwolves!! \n🆚 Phoenix Suns\n⏰ 7:00PM CST\n📍 Target Center https://t.co/nzSQXUX02i",
    "695": "@ProcessPhilly @lisco_2000 @Suns oh yeah!! the one with the triangular head who looked like phineas https://t.co/R81NyGA1Ju",
    "696": "#sacksarver Phoenix Suns May Be America’s Most TOXIC Workplace https://t.co/974hgQZu3R via @YouTube",
    "697": "DasHaus made a bet!\n\nEvent: Phoenix Suns vs Minnesota Timberwolves #NBA\nBet: Minnesota Timberwolves TO WIN +1.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "698": "The @Suns starting line up https://t.co/rXhrDmVuQS",
    "699": "DasHaus made a bet!\n\nEvent: Phoenix Suns vs Minnesota Timberwolves #NBA\nBet: Phoenix Suns TO WIN -1.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "700": "The Phoenix Suns will face off against the Denver Nuggets. Who will win?",
    "701": "Phoenix Suns vs. Minnesota Timberwolves picks, predictions: Who wins NBA game Wednesday? https://t.co/0WIj4GuIft",
    "702": "@in4_warriors @CantGuardBook1 @OrlandoMagic @Suns Warriors fans are always so salty. It’s okay that another team is better than yours",
    "703": "@NotMahMaximus @Suns Lol Steph wasn’t even playing in the magics game idk what ur smoking at this point",
    "704": "@kray1voice @DevinBook @Suns Devin Booker -second to none",
    "705": "@lennyyhesse @CantGuardBook1 @in4_warriors @OrlandoMagic @Suns @rice_labs U were saying?",
    "706": "Phoenix is the only today team in the NBA slate with +EV and favored by the bookies line movement. Then I asked to myself, what kind of motivation can have the Suns?. Here is the answer \"Phoenix (58-14) can clinch the top spot in the conference if it beats Minnesota\"🚨",
    "707": "Hello my friends, PLEASE, PLEASE, PLEASE, watch this video and pass it on. This guy needs to go. #sacksarver \n#Phoenix Suns May Be America’s Most TOXIC Workplace https://t.co/sGijBARGV1 via @YouTube",
    "708": "@justinreyesv @Suns The fact you even came to our page shows you're upset about it.\n\nIt's okay bud, I know you miss your dynasty days.",
    "709": "@lisco_2000 @AlwaysAbel421 @Suns He kinda looks like that guy who used to play for the sixers",
    "710": "Elfrid Payton embraces role with Suns during his second stint with team #Phoenix #Suns #NBA https://t.co/dn9sFoKhDR",
    "711": "@justinreyesv @GIANNIIS34MVP @Suns I got your mama",
    "712": "ITS GAMEDAY \n\nTHE WOLVES LOOK TO INCH THEIR WAY BACK TO THE 6 SEED AS THEY TAKE ON THE PHOENIX SUNS AT TARGET CENTER AT 7 PM CENTRAL https://t.co/ZuG56APd4p",
    "713": "@lisco_2000 @Suns That is so amazing! I knew I always loved Dario. Unbelievable! He has a great heart! Happy Belated Bday! 😀",
    "714": "@alexontweeter99 @Sunsupnext @CHRISPL79266739 @Suns They also won the title that year something u guys have yet to do https://t.co/AJKro4SgL6",
    "715": "@Kenneth63372372 @Suns @sofiasunss @ValleySunna @icarus_boy @Uknowmes1 @MatthewLissy @DarthVoita @evxz17 @sstoner612 @Emack5inAz @OhImAlex @Patsnation87 @angelinams112 @toeknee216 @Suns_Armband @TuffPlayz @jsandiegoo Morning Kenny! Happy game day!",
    "716": "3/23/93 – The Phoenix #Suns proved they were Tough Enough when they &amp; the NY Knicks got in one of the biggest fights in #NBA history. It started w/words between KJ and Doc Rivers right at half, and ended with a bench clearing brawl &amp; 6 ejections. The Suns won 121-92. #ValleyProud https://t.co/P6ByEUhLeT",
    "717": "Hall of Famer Isiah Thomas and Phoenix Suns guard Devin Booker had a brief but fascinating Twitter back-and-forth on Tuesday.\n\n#Suns | #NBA | @getsMart_5  https://t.co/dOLimga9p7",
    "718": "@NeeNeeSr15 @IsiahThomas @DevinBook @Suns @NBA You hate yourself don’t you? Like you just hate everything and everyone. That’s your vibe my guy",
    "719": "@DonDavious @GIANNIIS34MVP @Suns Like u got 1 💀",
    "720": "Devin Booker taking shots at the MVP narrative after Isiah Thomas rooted for him! 👀\n\nWhere does DBook stand in your MVP rankings?\n\n#devinbooker #phoenixsuns #nba https://t.co/cmAsY5JnJp",
    "721": "@justkeepitP @Suns yeah, i also use to be able to run like a gazelle in hs doesnt help my fat ass now 😂",
    "722": "Are international players taking over the NBA? | Swagu &amp; Perk #Phoenix #Suns #NBA Video: https://t.co/7MPvXhaFwa",
    "723": "Greatest Phoenix Suns player? I voted for Shawn Marion. https://t.co/EeYtNQ2NoT",
    "724": "@Lmnop2daj Lmao you always have me 💀💀 with your sports takes. My favorite was when you said the Phoenix Suns House 😂😂😂😂",
    "725": "@Suns Yeahhh..let go suns",
    "726": "@OrlandoMagic @Suns HAHAHAHA MAGIC TWITTER ELITE FOR THIS ONE",
    "727": "@ArizonaCoyotes @FSKPart3 @Suns Frank 😍🥵",
    "728": "@WillTheDubsWin @Raptors @Suns Yep, it is what it is though. I’m happy for them",
    "729": "@Sunsupnext @CHRISPL79266739 @Suns Pathetic that you're bringing this shit up from 4 years ago 🤡",
    "730": "@whatupitsean @Suns Cause it still happened tf 😂so just because it was a couple months ago means I’m supposed to forget it 😂",
    "731": "#1 @DevinBook has been a #RealOne since Day 1! Hope all you @suns fans Truly appreciate and respect how he's conducted himself and the True love he has for Phoenix! Man of his Word. #Leadership #WD&gt;WS https://t.co/KbX5QxHmTO",
    "732": "@Jumpshot8 @Suns Each game they play heading into the playoffs, this team continues to prepare for that tough road ahead. I believe, that this team believes they can get to the end, no matter what roadblocks they encounter. Go Suns!",
    "733": "Reminder: @DevinBook is better then your favorite player right now &amp; more clutch. @JaValeMcGee elevates every team he’s on is a 3X @NBA champ &amp; gold medalist @CP3 is a hall of famer &amp; your favorite players favorite player. @Suns best record by at least 9 games but y’all keep 😴",
    "734": "@justinreyesv @Raptors @Suns Raptors wouldn't even have a ring if KD and Klay were fully healthy even",
    "735": "Congratulations to Jeffdw20 who moved up 1 spot to take #5 on the Phoenix Suns team leaderboard.\n\nhttps://t.co/Bx4NtnCjMT",
    "736": "I keep getting emails from the @suns when they win, 65% off! But all their merch sucks, and they don’t have the Valley jerseys on sale lol I don’t want those subpar overpriced items https://t.co/tDMeY2xyW0",
    "737": "When the Phoenix Suns get an NBA feature on ESPN, they better debate whether or not the Grand Canyon is the greatest wonder of the world or not. 😤",
    "738": "@DonDavious @GIANNIIS34MVP @Suns 0 rings idc",
    "739": "It’s honestly pathetic that the @Raptors team has 1 more ring than the entire @Suns franchise to this day",
    "740": "@ArizonaCoyotes @FSKPart3 @Suns Relocate your team to Wisconsin and we’ll sell out the arena for you.",
    "741": "Allegations of racism and misogyny within the Phoenix Suns: Inside Robert Sarver's 17-year tenure as owner https://t.co/6s5XmGNlgZ",
    "742": "@DonDavious @GIANNIIS34MVP @Suns Lol idc imma keep clowning them for the fact that they’re still ringless until they get one",
    "743": "research into the phoenix suns owner he is donald sterling 2.0 he needs to go asap",
    "744": "If you want to hear about the latest #HRtechnology and automation solutions and soak up a little sun, join us at #EmpowerHRTech Americas in Phoenix in May. https://t.co/fMLhgkFeEG https://t.co/dnHZIvOKx4",
    "745": "@justkeepitP @Suns talking about the past? what does that have to do with now?",
    "746": "I'm leaning #Timberwolves tonight against the blazing #PhoenixSuns. Wolves lost 1st 2 matchups and I like the Wolves to bounce back from a tough loss and show out tonight. Wolves haven't won at home against the Suns in over 3yrs. Wolves are elite and want to prove it. #Wolves W!",
    "747": "@Suns When’s the banner going up?",
    "748": "@NeeNeeSr15 @IsiahThomas @DevinBook @Suns @NBA Who fuckin care about MVP . He will be FINAL MVP",
    "749": "@NamedBurt @dastardlyhorny1 @CamAlexander22 @moc_dude run tmc did it first with Don Nelson in the early 90s with Tim Hardaway Chris Mullin &amp; Mitch Richmond. up tempo &amp; had snipers. but the late 80s/early90s Nuggets moreso. highest scoring team. no d. like suns. orlando wasn't anything special with threes bro, nor was Phoenix",
    "750": "How good are the Phoenix Suns?\n\nSince starting last season 8-8, they've gone 101-27 (.789) in their last 128 regular season games.",
    "751": "@NotMahMaximus @Suns Y’all celebrating like y’all did last year when I guys we’re 2-0 up 😐 didn’t even finish the job yet",
    "752": "@DonDavious @GIANNIIS34MVP @Suns Bruh that’s still 17 more rings than them idc",
    "753": "I've got 3 more of my NBA best bets this Wednesday evening. 🏀💎\n\n-Boston Celtics vs Utah Jazz\n-Minnesota Timberwolves vs Phoenix Suns\n-OKC Thunder vs Orlando Magic\n\nLet me know what you think!\n\n#NBA #NBAbets #NBApicks #NBAtips \nhttps://t.co/KVXDer9ezr",
    "754": "@justinreyesv @GIANNIIS34MVP @Suns ??? Do you think a single suns fan or NBA fan care about 1957?😂😂😂",
    "755": "Phoenix Suns vs. Minnesota Timberwolves - 3/23/2022 Free Pick &amp; NBA Betting Prediction https://t.co/n7tzg6gCkm\n.\n#Betting #FreePicks https://t.co/4B26MCqdAH",
    "756": "@whatupitsean @Suns Ok, they owned y’all in the finals 😂",
    "757": "@mellkk @Suns I don’t have a tiny dog but this is adorable!",
    "758": "@justinreyesv @GIANNIIS34MVP @Suns Who tf cares about 2015 in 2022😂😂😂",
    "759": "@B500003 @NeeNeeSr15 @IsiahThomas @DevinBook @Suns @NBA Looks good to me",
    "760": "@EdmondE24605080 @IsiahThomas @Suns @NBA @DevinBook ratio https://t.co/FAd86Q5j9s",
    "761": "Saw a comment that DBook isn't the MVP of the @Suns.\n\nToo funny😆",
    "762": "@NeeNeeSr15 @IsiahThomas @DevinBook @Suns @NBA Says an obvious LeBron fan.....",
    "763": "@YevgeniyKogosov @SteveHoller @IsiahThomas @DevinBook @Suns @NBA Sensitive from last year when the suns won 3 playoff series and were 2 wins away from a world title? That made them a  fluke in your eyes? SMH. Not the Jazz getting beat by the Kawhi-less clips. Or the Nuggets getting stomped on. Or the Mavs losing to the team that got stomped?",
    "764": "@NeeNeeSr15 @rfpcrawford @IsiahThomas @DevinBook @Suns @NBA Man you must not watch the suns  play … bookers numbers would be higher if the Suns team wasn’t so balanced. He could score 30 a game easy but instead he chooses to win",
    "765": "Vintage Phoenix Suns Looney Tune Shirt https://t.co/hqxwRII5ot",
    "766": "Busy time at the moment - working with Gophers, Flying Pigs, Goats, a Phoenix or two and a Sun (and a few projects that are very secret) \n\nCannot wait to share some pretty interesting designs with you soon",
    "767": "@EdmondE24605080 @IsiahThomas @Suns @NBA @DevinBook he owns jorgamble, the 102th greatest player of all time",
    "768": "Wednesday’s 6-pack 🍻 \n\nOdds to win the NBA championship:\n\n4-1— Phoenix Suns\n11-2— Golden State, Brooklyn\n6-1— Milwaukee\n13-2— Philadelphia\n10-1— Miami\n18-1— Utah, Boston https://t.co/99WZTlFS6F",
    "769": "Devin Booker and the Phoenix Suns take on Karl Anthony Towns and the Minnesota Timberwolves on Wednesday. Take a look at our preview: https://t.co/VoDEcq9mPM",
    "770": "March 23 1984 - @trailblazers coach #JackRamsay gets his 697th win in #Blazers 124-98 victory vs @Suns, becoming 2nd winnigest coach in @NBAHistory. \n\nAt the time, Ramsay trailed only @celtics coach #RedAurebach with 938 wins.\n\n#RipCity #thisdateBlazersHistory https://t.co/jZOqKJz5FT",
    "771": "@justinreyesv @CantGuardBook1 @in4_warriors @OrlandoMagic @Suns Stay on you teams page first Dub fans",
    "772": "Hey Monty and @DevinBook , @EmilyLovette4 is coming to see you tonight! Having @PatLovette drive her from Omaha,NE for one night to see the @Suns seems like a perfect way for her to say Happy Birthday Dad! #roadtrip #girldad #happybirthday",
    "773": "@NeeNeeSr15 @IsiahThomas @DevinBook @Suns @NBA I don’t have to question it……",
    "774": "@Sageof6turtles @Gsus_2 You haven't watched @Suns games. If you have then you either don't know shit about basketball or you're just a troll.",
    "775": "@NeeNeeSr15 @IsiahThomas @DevinBook @Suns @NBA No offense? Ok buddy",
    "776": "Woke up like… @Suns GameDay! 💪🏾🏀🔥 https://t.co/GXoPZqowAe",
    "777": "@NeeNeeSr15 @IsiahThomas @DevinBook @Suns @NBA Don’t argue with him/her. Just an angry Lakers fan that has been owned by Booker every game they played this season",
    "778": "Today's guests on @AZSports:\n\n7:45 - @WindhorstESPN \n\n8:30 - @Suns radio voice Al McCoy\n\nhttps://t.co/PTZg9Y5qVQ",
    "779": "@Sageof6turtles You're the fucking casual! I love it when fools who don't watch more than a handful of @Suns games per year try to put down Book. He's one of the top three shooting guards in the league offensively and probably the best defensively. Make no mistake, he is that guy.",
    "780": "Key Youth Worker | Phoenix Youth Programs  | Full time  | Apply by: Sun, 3 Apr - https://t.co/89hSlN3S4V",
    "781": "Check out what our expert #picks, #predictions, and #odds have to say as the Phoenix #Suns visit Target Center to play against the Minnesota #Timberwolves edging as 1.5 favorites in Free Betting Reviews #NBA Predictions Series.  — March 23, 2022.\nhttps://t.co/vRVKcB0xeG...",
    "782": "@30reacts @sunsbestteam @Jumpshot8 @Suns No CP3\nNo Cams\nCrowder hurt in the 3rd\nDA fouled out\nMcGee fouled out\nDBook fouled out",
    "783": "WATCH: @TheYoungTurks’ @cenkuygur and @AnaKasparian discuss Robert Sarver’s notorious record of abusive, racist and misogynistic behavior and the growing calls for the @NBA to #SackSarver from the Phoenix @Suns. https://t.co/FvW0A7nuGL",
    "784": "Y’all said they needed draymond back now the warriors getting pulled without Steph haven’t heard that narrative yet smh and the @Suns still can’t get no love in the media🤯🤯 https://t.co/dh7yPIKOEI",
    "785": "@IsiahThomas @DevinBook @Suns @NBA Book should be MVP. Best player in the League.",
    "786": "@NeeNeeSr15 @IamEthanG @IsiahThomas @DevinBook @Suns @NBA He is focused on that.   He doesn’t talk about the MVP.   Fans do because they know he deserves the support.   I guess you know more about ball though then a hall of fame point guard with multiple rings.  Lol.",
    "787": "@NeeNeeSr15 @IamEthanG @IsiahThomas @DevinBook @Suns @NBA Best record since all star break.  Numbers have gone up without CP3 and oh yeah and just a week ago they beat the lakers by almost 30.   Without CP3.  I guess nobody is worried about LeBron then.",
    "788": "all i know is that the @Suns are winning. i think I've found my team. https://t.co/LeXHfemvQa",
    "789": "@NeeNeeSr15 @IsiahThomas @DevinBook @Suns @NBA Rofl…. So when he wasn’t winning and putting up statistical monsters people said well he isn’t winning.    It’s crazy to think they don’t have the best record because of their best player.   Ridiculous.  He deserves to be in conversation and 1st team all NBA.",
    "790": "@lisco_2000 @Suns OMG GIRL !!!!!! this is so awesome i’m so happy for u",
    "791": "Phoenix Suns May Be America’s Most TOXIC Workplace https://t.co/dpxY6izI6S via @YouTube #sacksarver",
    "792": "@SpursCoyote @clutchthebear @TexansTORO1 @OrbitAstros @Suns @spurs Never change this profile picture",
    "793": "@JarJarjinkys Laughs in the Phoenix Suns and Memphis Grizzlies. Also last year the Lakers maintained a .500 record w/o their best 2 players. You don’t know what you’re talking about.",
    "794": "@lisco_2000 @Suns Damn!! U awesome!! \nHappy birthday again!! I hope u had a blasted!! https://t.co/MDzDpEldUg",
    "795": "@lisco_2000 @Suns Hint: Extremely neat. https://t.co/2w3FpHTcJI",
    "796": "📰 Minnesota Timberwolves vs Phoenix Suns Predictions and Betting Odds 3/23/22!\n👉 https://t.co/JmcJsVEwsY @wagertalk",
    "797": "Phoenix Suns vs  Minnesota Timberwolves Prediction 3/23/22 -  Free NBA P... https://t.co/aNEGoc5sCR via @YouTube \n\n#NBA #NBAPick #NBAPrediction #Basketball #Sportsbetting",
    "798": "Phoenix Suns: 2022 Pacific Division Champions\n\n(via @DarthVoita) https://t.co/ySxrsPKoff",
    "799": "@lisco_2000 @Suns This post https://t.co/79tBdcYWGu",
    "800": "@IsiahThomas @DevinBook @Suns @NBA tell ‘m! 🤝",
    "801": "@lisco_2000 @Suns Wow. This feels like the close to the Sharky era (though it couldn’t have been that long ago) happy birthday or Belated birthday I suppose! Haven’t seen you on the TL in ages so it’s good to see you’re well!",
    "802": "@justinreyesv @CantGuardBook1 @in4_warriors @OrlandoMagic @Suns get a job first",
    "803": "The Timberwolves are home to face of the phoenix suns tune in",
    "804": "Phoenix Suns Black Framed Team L #autographed #ad https://t.co/t8Jn6ePgwh",
    "805": "@NeeNeeSr15 @DevinEsser @IamEthanG @IsiahThomas @DevinBook @Suns @NBA Lol y’all gotta actually watch basketball",
    "806": "@justinreyesv @Suns Why you so mad tf? 😭",
    "807": "@Blkbeutee @PincayChris @jj_redick @Suns Phoenix already ran through Miami IN Miami by 21 points at that",
    "808": "Phoenix Suns 🏆🏆",
    "809": "Consensus Line Move:\n2022-03-23 Phoenix Suns at Minnesota Timberwolves from 236.00 to 237.00\nOver there's a pulse\n#NBA #bettingsports #statistics #forextrading",
    "810": "Phoenix #Suns vs Minnesota #Timberwolves | 3/23/22  | NBA Free Picks and Props | NBA Betting tips.         \n\nWatch: https://t.co/7EIOXVSSEm\n\n#NBA #NBAPick #NBAPredictions #sunsvstimberwolves",
    "811": "We are are about at that point in the season where it is time for playoff clinching scenarios!\n\nThe Phoenix Suns will clinch the 1-seed in the Western Conference tonight with a win over the Minnesota Timberwolves AND a loss by the Memphis Grizzlies to the Brooklyn Nets.",
    "812": "Phoenix Suns 🏀🏀🏀🏀🏀🏀🏀🏀🏀🏀",
    "813": "@Blkbeutee @PincayChris @jj_redick @Suns They already did https://t.co/TtOCUD7Gv2",
    "814": "Los Angeles Lakers' LeBron James needs to be traded to Phoenix Suns, Charles Oakley says https://t.co/A6p8fkPv9h via @YahooNews  Charles Oakley must be in the Basement sharing the same sippy cup with Joe Biden. The Suns Do Not need Lebron. Phil 76ers Do Not need Lebron. Let it be",
    "815": "Phoenix Suns 🏆",
    "816": "Shawn Marion ranting about the disrespect towards him in his Phoenix Suns tenure. https://t.co/F7FOIe5jEm",
    "817": "@Suns @CP3 @NBA @Stathead @TCraig_23 So glad we got Torrey back!!💜🧡💜🧡",
    "818": "@NeeNeeSr15 @IsiahThomas @DevinBook @Suns @NBA Thank you",
    "819": "@Jrocka67 @NeeNeeSr15 @DevinEsser @IamEthanG @IsiahThomas @DevinBook @Suns @NBA suns are below .500 without booker since acquiring chris paul",
    "820": "Phoenix Suns",
    "821": "Phoenix Suns 💜🧡",
    "822": "🏆 NBA CONFERENCE CHAMPIONS RAB! 🏆\n\nThis is 16/1 with SkyBet! ✅\n\n🟠 Phoenix Suns To Win NBA Western Conference 2022\n🟢 Boston Celtics To Win NBA Eastern Conference 2022\n\n📲 Link: https://t.co/ww1naDxrvD\n\n18+ | T&amp;Cs Apply | https://t.co/7ZhTEgQqYT | Always Gamble Responsibly https://t.co/A4H9fnWNvQ",
    "823": "Liste de pendientes de continuar:\nRisen 3\nKingdom hearts 1\nCeleste\nYakuza 0\nZelda the minish cap\nPhoenix Wright: Ace Attorney: Justice for All\nGolden Sun 2",
    "824": "@TheRealJoeGonzo @BrownOfJaylen @mikaIbetta @Suns I did",
    "825": "@Suns y’all have a disgusting owner!",
    "826": "Los Angeles Lakers’ LeBron James needs to be traded to Phoenix Suns, Charles Oakley says https://t.co/wl5lveZiam",
    "827": "@NeeNeeSr15 @IsiahThomas @DevinBook @Suns @NBA Homie just mad Book been taking his Lakers to the deep waters every time they link up. Simple as that. No need to listen to his rhetoric. How much you want to bet if Lebron had the same numbers and the Lakers had the same record as the Suns, who would be the front runner for MVP?",
    "828": "@Sosie2 Valencia \nZalgiris\nTenerife\nOlympiacos\nGalatasaray\nCharlotte Hornets\nBoston Celtics\nPhoenix Suns\nDallas Mavericks",
    "829": "@GeeThree @IsiahThomas @DevinBook @Suns Doesn’t get enough credit for that",
    "830": "@Suns Please get this disgusting video off my timeline.",
    "831": "I’m Top 5…in Phoenix Suns history lol https://t.co/9wxaPaMxAr",
    "832": "@CHRISPL79266739 @Suns Y’all celebrated it.",
    "833": "@NeeNeeSr15 @IsiahThomas @DevinBook @Suns @NBA Just say booker hurt your feelings in the playoffs last year and move on.",
    "834": "@Suns Congratulations guys! We have unfinished business. Go Suns!!!!",
    "835": "@da_vargas0 @NeeNeeSr15 @DevinEsser @B500003 @IsiahThomas @DevinBook @Suns @NBA Notice how he won't reply? Dude hates booker because booker made him cry last year",
    "836": "@IsiahThomas @Suns @NBA @DevinBook Ho Hum",
    "837": "@TRWNL1 Ugliest jumpshot I've ever seen but was the model of consistency offensively and could guard 1-4. The heart and soul of that Phoenix Suns team",
    "838": "Why is the @nba taking so long long investigating the @Suns workplace? Sarver needs to be removed as an owner, just like Daniel Sterling was with the @LAClippers. This is so pathetic and embarrassing.\n\n#sacksarver #NBA #wednesdaythought #SpringStatement",
    "839": "Allegations of racism and misogyny within the Phoenix Suns: Inside Robert Sarver's 17-year tenure as owner https://t.co/Dq7dW39uNU",
    "840": "@NeeNeeSr15 @IamEthanG @IsiahThomas @DevinBook @Suns @NBA Yall weren't worried when book dropped 47 to send yall packing in the playoffs?",
    "841": "@lisco_2000 @Suns This is one of the greatest moments in internet history",
    "842": "@mjlogan87 @Suns What do you look like? I'll look for you on league pass😭",
    "843": "LMFAOO aye he not lying about that top 5 stat in Suns history. \n\n@matrix31 Phoenix rankings:\n\n1st in defensive rebounds \n2nd in steals, minutes, offensive and total rebounds \n3rd in blocks, FGs made &amp; attempted\n4th in points https://t.co/HllWxUf92j",
    "844": "@Suns Real franchises don’t care about division championships",
    "845": "#sacksarver (Phoenix Suns owner has to go! 70 former and employees have made claims about his constant use of the n—— word!  He ask someone” do I own you?”",
    "846": "@that1mexicano @IsiahThomas @DevinBook @Suns @NBA The case for Lebron was that his team couldn't win jack when he wasn't on the floor.",
    "847": "@jusblaze_513 @IsiahThomas @DevinBook @Suns The Suns have shown they can win without CP3 AND Booker",
    "848": "@CTrevorNelson @azcentral @Suns Oakley is on record that Antetekumpo is not good, also isn’t LeBron the defacto GM of the team?",
    "849": "11:15 #HappyValley\n\n1st 7 Jade Phoenix 25/1\n2nd 11 Sun Of Makfi 5/1\n3rd 4 Baby 6/1\n\n12 Ran. NRs 13, 14\nForecast: 0.00 HKD",
    "850": "@NeeNeeSr15 @IsiahThomas @DevinBook @Suns @NBA Steph Curry in his first MVP Season averaged about the same numbers as Book does now. \n\nLeBron, KD, and Harden all had better numbers,. It Steph won because he was the best player on the best team. Where's that energy now that Booker is in the same position?",
    "851": "@Suns Can I get a ticket, flown in from melb australia, accommodated? Wouldn’t even mind a view from the way back of the stands. Much appreciated. Thanks.",
    "852": "@NeeNeeSr15 @IsiahThomas @DevinBook @Suns @NBA I swear some of you just watch highlights and nothing else.",
    "853": "@Suns @landryshamet @campayne Yessss. I’ll be the one cheering loudest for @Suns @TargetCenterMN ..\nMy MN fiancé @mikedonnelly555 may not approve. \n\n#ValleyProud \n\nLet’s go fellas.",
    "854": "@NeeNeeSr15 @DevinEsser @B500003 @IsiahThomas @DevinBook @Suns @NBA Book deserves it more than Demar, LeBron, KD, Curry, Tatum, and CP3",
    "855": "@IsiahThomas @Suns @NBA @DevinBook This mf and “let it be known”",
    "856": "On a March evening in 2011, Kobe Bryant and the streaking Lakers battled the Phoenix Suns in a triple-overtime thriller at Staples Center.  https://t.co/iWNeJAWeYz",
    "857": "@Robert__Beaver @IsiahThomas @DevinBook @Suns @NBA Book doesn't care. He wants a title. I don't even know who the mvp was 2 seasons ago? I just care about how my team is doing. I hate getting suckered into the MVP convos and the GOAT debates. All are just a waste of time. I'd rather cut the grass",
    "858": "Phoenix Suns Acrylic Team Logo C #autographed #ad https://t.co/lp0rsJ0sht",
    "859": "@EarlyJulius @IsiahThomas @DevinBook @Suns @NBA Booker does less when CP is on the floor because he doesn't have to do everything. Booker is a fantastic player, but no way he should be considered an MVP candidate over Chris Paul.",
    "860": "Phoenix Suns May Be America’s Most TOXIC Workplace https://t.co/Mxv2ZV6T3i via @YouTube \n\n #SACKSARVAR",
    "861": "Who will the @Suns face in the 1st Round? #NBA | #NBAPlayoffs",
    "862": "@rajkumaraparna1 -Phoenix Suns May Be America’s Most TOXIC Workplace \n@PathakRidhima",
    "863": "@KeyJayandMax The Phoenix Suns still the best team in the NBA all the while without CP3, Booker being MVP and Mikal Bridges DPOY",
    "864": "BPD needs your help locating attempted murder suspect Jose Esteban Mendoza (33). He is driving a 2015 black Dodge Charger SXT with AZ Phoenix Suns license plate # PX3432. If you have info, please call the tip line at (623) 349-6411.   MORE INFO https://t.co/pYt98oc9OS https://t.co/pf09559GJF",
    "865": "@dylanstrouf53 @Sixers_YB @jacob_pretzman @Suns not the case today with Harden ☺️ https://t.co/q0Ck3jl2S8",
    "866": "@Robert__Beaver @IsiahThomas @DevinBook @Suns @NBA What was Booker doing in those games with CP3? Just riding the pines and punching the time clock? No, he was out there dealing. In the bubble, that's when he and the Suns came alive. 117 wins versus 35 losses since the bubble! Super young team is amazing",
    "867": "@KeyJayandMax the PHOENIX SUNS broadcasters think THEY won the NBA championship vs. Milwaukee, also!! I've heard them on 3 separate occasions. Twice when they played the Bucks and the first game of the season.",
    "868": "@that1mexicano @IsiahThomas @DevinBook @Suns @NBA Suns and Booker don't have big time FA's walking through the door to sign with them. He doesn't play 'buddy ball' like the so-called superstars that always act like they need more help. It's a no brainer",
    "869": "@unidentifi21ajh @Sixers_YB @jacob_pretzman @Suns Lol that literally doesn’t change anything about the fact that y’all are still Ringless",
    "870": "🏀GAME DAY🏀 ✈️\n\n🆚 @Timberwolves\n🕛 12:00am 🇬🇧\n🎽 ⚪\n\n📊 Record\nSuns: 58-14\nWolves: 42-31\n\n⚔️ Season Series\nSuns 2-0 Wolves\n\nWho's winning tonight?\nComment your predictions 👇\n\n#Suns #SunsUK #RallyTheValley #ValleyProud\n@Suns #NBA75 #NBA #RaisedByWolves",
    "871": "@Suns my boysssss",
    "872": "@labuchagne_ @gswrevengeszn @Jonsmbo9990 @KlayForTrey @Suns Ahh right gets ended and brings up history 👍🏻",
    "873": "@Suns That's great! Hope you guys can get the championship this season . https://t.co/48MkJYBR8E",
    "874": "@DukePizzle @YKRvader @AfroLariatoSZN @APB_CPA_MBA @Suns Doesn’t change the fact that y’all still ringless to this day 💀",
    "875": "@lisco_2000 @Suns No frickin way!! Happy belated birthday!",
    "876": "@OrlandoMagic @Suns Haha, great work Magic!",
    "877": "@lisco_2000 @Suns dario for mvp",
    "878": "#Suns (58-14) @ #Timberwolves (42-31)\n\n⏰ - 7:00 PM CT\n🏟 - Target Center\n📺 - Bally Sports North\n\nThe red hot Phoenix Suns blaze into Target Center tonight in what will be a sold out - playoff like atmosphere. No CP3 for the Suns, should be a fun one in TG!🐺 https://t.co/7GaMYriuvf",
    "879": "NBA : Phoenix Suns vs Minnesota Timberwolves - Picks, Best Bets &amp; Odds\nhttps://t.co/OZKPnO3I5k",
    "880": "@OrlandoMagic @Suns Suns🤝magic\n   Respect 🙏🏻 https://t.co/f7ZirxB6lh",
    "881": "I need 3 things tomorrow\n- Kyrie and KD Masterclass for the Brooklyn Win\n- [Insert Suns Player] Masterclass for the Phoenix Win\n- Pat Bev getting slapped out of Target Center\n\nTemporary Nets Fan https://t.co/umsU43ERnb",
    "882": "@Im_Kyrito11 The guy that doesn't watch the Suns on a basis knows more about the Phoenix Suns than the guy that does. You realize that makes no sense. Right?",
    "883": "hey @Suns its my birthday today!😁",
    "884": "@1011ap4 @gswrevengeszn @Jonsmbo9990 @KlayForTrey @Suns Suns haven’t won anything significant. Come back to me when that happens",
    "885": "@JXRPJ @phoenix_fi @koviebarger Maybe I am a 🤡, but my bag doesn´t melt like snow in the sun actually and I am not rekt🤣.\nInvest in real project instead...but only the good know...😏",
    "886": "@saltyburner44 @CHRISPL79266739 @Suns Lost to Raptors in 2022 + they got 3 rings already 😂 y’all still fighting for one 💀",
    "887": "Phoenix Suns May Be America’s Most TOXIC Workplace https://t.co/rhNptvplZe via @YouTube WOW NBA Owner",
    "888": "@Suns The Only championship yall gonna get lol",
    "889": "@Suns  been collecting for years not a bandwagon collector hope next season we get some bobblehead giveaways https://t.co/OxlsTDZU5S",
    "890": "@birdgangsfinest @DevinBook @Suns Yeah. The dude sounds like he works for ESPN",
    "891": "@Suns How is the Robert Sarver still a owner. Allegedly he said he has to higher a black Coach But use the N word. \"I have to hire N word for my N words\". one of the most toxic places to work even his human resources  department said It's dangerous to get ahold of them.",
    "892": "@NeeNeeSr15 @IsiahThomas @DevinBook @Suns @NBA Who’s questioning that?",
    "893": "@IsiahThomas @DevinBook @Suns @NBA Let Go SunS 🧡💜💯🙏",
    "894": "@Suns  @DevinBook  the many jerseys of Devin Booker this season I look forward to adding the nba finals mvp bobblehead from @FOCOusa https://t.co/Hk4k5Iu6oA",
    "895": "@suns @sunsgorilla  best mascot in the nba https://t.co/E3ndtphrmh",
    "896": "@AndrewLeezus Just thinking about how the Phoenix Suns will win the NBA Championship",
    "897": "@1011ap4 @gswrevengeszn @Jonsmbo9990 @KlayForTrey @Suns Suns fans only be caring about regular season.",
    "898": "@amolinadesigns @Suns Nah. I hope y’all get the ring y’all want this year cuz otherwise this season is a fluke",
    "899": "@labuchagne_ @gswrevengeszn @Jonsmbo9990 @KlayForTrey @Suns Cry about it",
    "900": "Josh Jackson Signed Phoenix Suns Custom Jersey (PSA COA)#4 Overall Pk 2017 Draft https://t.co/KDe87EFu7R eBay",
    "901": "@TaylorKirkham @TheRealJoeGonzo @VariVlone @IsiahThomas @DevinBook @Suns @NBA And your point? Will he make 1st Team All NBA? 🤔 NO!\nSo no MVP then.",
    "902": "@amolinadesigns @Suns Which player is this？",
    "903": "@TaylorKirkham @DevinEsser @IamEthanG @IsiahThomas @DevinBook @Suns @NBA Will Booker make 1st Team All NBA?  You know the answer to that. Therefore, no MVP..Case Close",
    "904": "@justkeepitP @Suns Bucks the 5th best team in the east",
    "905": "@privatechico @Slaughter369 @DevinEsser @IsiahThomas @DevinBook @Suns @NBA Sir, will Booker make 1st Team All NBA? You know the answer to that. Case close!!",
    "906": "@amolinadesigns @Suns No lmao still ringless to this day 😐",
    "907": "@derrickjonesjr_ @LerwickLogan @JoshEberley This is the dumbest shit I’ve ever heard lmao \nAll NBA teams have more to do with personal achievements than team success. \nLebron has been statistically better than every single member of that phoenix suns roster.",
    "908": "Should I get a @Suns tat cuz that chip is ours 🔥🙏🏽🔥 https://t.co/L2kEUxUR7y",
    "909": "@ThomasHoops87 @Sageof6turtles Phoenix Suns record by year:\nYear 1: 23-59\n2: 24-58\n3: 21-61\n4: 19-63 (James Jones hired)\n5: 34-39 (Monty Williams hired)\n6: 51-21\n7: 58-14\n\nYou see how they got worse and worse until James and Monty got there? Funny how that works.",
    "910": "Canotta Steve Nash di Phoenix Suns di #13 Nero City Edition 2020-21 https://t.co/RWV5Qn41A8",
    "911": "@Suns Bucks own y’all forever",
    "912": "@JRHoopsNBA You use an opinionated “Giannis and brook carried” to completely discredit an entire stat as if that alone makes it bad. Book is a plus defender, AT WORST, a good play maker and an elite of the elite shot maker. That is genuinely what you get from watching the Phoenix suns",
    "913": "@CantGuardBook1 @OrlandoMagic @Suns Suns still ringless btw 😂",
    "914": "@BallsackSports That’s what I like to call “not wrong. But you’re not on the @Suns so it doesn’t make a difference”",
    "915": "Maillot Phoenix Suns de Charles Barkley #34 Blanc Soul Swingman https://t.co/rpmtoVO9Sp",
    "916": "New listing! \n\nSteve Nash RC 1996-97 Skybox Premium #227 Rookie Phoenix Suns MINT \n\nCheck it out: https://t.co/bwmqoJdutU\n\n#TradingCards #ForSale #eBay https://t.co/yFskILJ4Dn",
    "917": "@IsiahThomas @NeemAzim @DevinBook @Suns @NBA 11 missed games is being held against him as well as how good his team is, despite the 80% winning record. Problem is that mainstream nba media don't care cause it doesn't fit there company narrative for clicks and traffic which is pathetic in itself",
    "918": "@GIANNIIS34MVP @Suns 3 rings &lt; 1 sit the fuck down 😹",
    "919": "Love seeing former @Suns players continue to play well. Until we play against them. https://t.co/eZuhzsfqwH",
    "920": "@NeeNeeSr15 @TheRealJoeGonzo @VariVlone @IsiahThomas @DevinBook @Suns @NBA Book has similar stats to ja n steph but those two players are in the convo n whom are considered locks for 1st team. Grizz 14-2 w/o Ja n book is 11-4 w/o CP. make your case.Steph literally stole an mvp from Harden, Drose from Bron.",
    "921": "Phoenix Suns vs Minnesota Timberwolves: Match Prediction, Injuries... - Media Referee https://t.co/JD0QU1SCvy https://t.co/TKq9JXdCSN",
    "922": "@Suns Congratulations",
    "923": "@PaulGiblinFSOE @gongplanet @exeter_phoenix @phonicfm @ExeterLiving @Knifeworld The Universe's Greatest Band and yes....it is out there orbiting the Sun. Thanks Kavus. Emil",
    "924": "@CantGuardBook1 @in4_warriors @OrlandoMagic @Suns Who cares lmfaooo worthless ass finals mvp go get a ring first",
    "925": "Good thing the @Suns aren’t as soft as the California teams.",
    "926": "@Mcv03851 @longjohnslvr85 @IsiahThomas @DevinBook @Suns @NBA you too",
    "927": "@SportsknowitalI @IsiahThomas @Suns @NBA @DevinBook DeMar, DeMar I say it the less I like it.",
    "928": "@Slaughter369 @DevinEsser @IsiahThomas @DevinBook @Suns @NBA Just saying man. I'm not a MPJ guy either. He stole money. That being said, your guy Booker is not going to make 1st Team All NBA. There goes your MVP case right there.",
    "929": "@NeeNeeSr15 @longjohnslvr85 @IsiahThomas @DevinBook @Suns @NBA Ok whatever you say I'll pray that you have a blessed night",
    "930": "@IsiahThomas @DevinBook @Suns @NBA Suns play team basketball and they have a winning record without him and Cp3",
    "931": "@NotMahMaximus @Suns Lmaoo now that I think about it Warriors really have 2015, 2017, 2018 rings, Cavs have the historic 2016 ring, Raptors have the 2019 ring, Lakers have the 2020 ring  and Bucks captured the ring ya’ll we’re going for last year. Finish the job",
    "932": "@TheRealJoeGonzo @VariVlone @IsiahThomas @DevinBook @Suns @NBA Lmao...How?.He won't make 1st Team All NBA.",
    "933": "@Mcv03851 @longjohnslvr85 @IsiahThomas @DevinBook @Suns @NBA 😂😂😂😂🤣🤣😅😆😆😆😆Got'em!!\n\nHe's Not making 1st Team All NBA for reason.",
    "934": "@lisco_2000 @Suns He was a starter with Philly now weird he would have die hard fans",
    "935": "@Veto_Roan @duragdonic @Suns About what 🥴 Raptors, Warriors, &amp; Lakers all have rings 😹 Suns need to finish the job at this point",
    "936": "@NeeNeeSr15 @longjohnslvr85 @IsiahThomas @DevinBook @Suns @NBA And that all nba teams are all media based lol just like all star starters are fan based just say you don't watch the suns booker is the best rated defensive sg and avg 26 6 and 6 but you have a good night",
    "937": "I see Shawn Marion is trending so imma self-plug my Phoenix Suns all-time starting 5 story because you best believe @matrix31 is on that team and for good reason. https://t.co/yCCXp0oZB7 https://t.co/F4o4jjBvDZ",
    "938": "@joshieU1G @CHRISPL79266739 @Suns 2016 Warriors did",
    "939": "@SportsknowitalI @IsiahThomas @Suns @NBA @DevinBook DeRozan???? 😂 😂 When tf has he beaten a top team?? Or even the Suns?? Booker always torches him",
    "940": "Phoenix Suns",
    "941": "So now it’s my beloved #PhoenixSuns , fanboying my shows (WE, SG, Million Little Things,) music, movies and shitty pop culture takes.  I’ll still retweet about the things I care about but that’s it.  3)",
    "942": "@NeeNeeSr15 @DevinEsser @B500003 @IsiahThomas @DevinBook @Suns @NBA Since you trying so hard to discredit him in these replies https://t.co/rCtxbeFE7X",
    "943": "#SackSarver\nWatch \"Phoenix Suns May Be America’s Most TOXIC Workplace\" on YouTube - https://t.co/LxyI9aA5Yd",
    "944": "Can I just say that I love @matrix31. Named my oldest after him. He’s the reason I became a real @Suns fan. First jersey I ever bought. Put some respect in his name. #thematrix #sunsfavoritesun",
    "945": "@Mcv03851 @longjohnslvr85 @IsiahThomas @DevinBook @Suns @NBA Do realize that Booker won't make 1st Team All NBA? Mayne 2nd Team. Maybe. \n\nNo way you the mvp there is even a hesitation about making 1st team all nba. \n\nNice try tho sir.",
    "946": "Phoenix Suns antis are fucking weird",
    "947": "@Phxsunsszn @SportsknowitalI @IsiahThomas @Suns @NBA @DevinBook Don’t forget that 38 ball in Windy City",
    "948": "@NeeNeeSr15 @DevinEsser @IsiahThomas @DevinBook @Suns @NBA MPJ is overpaid trash. Murray would have made a 1 or 2 game difference but the suns were still beating the nuggets",
    "949": "Draymond Green @Money23Green after the @Warriors 94-90 loss at the @OrlandoMagic Golden State’s 3rd straight loss allowed the @Suns to clinch the Pacific Division. @CBSNBayArea @KPIXtv 👇🏾 https://t.co/0U8fRq6PE2",
    "950": "ALERT: New high roller bet posted!\nA bet has been placed for $12855.78 on Minnesota Timberwolves - Phoenix Suns to win $23,654.64.\nTo view this bet or copy it https://t.co/YtUrnDG1Ni https://t.co/V3njUXF3M9",
    "951": "@Mcv03851 @NeeNeeSr15 @longjohnslvr85 @IsiahThomas @DevinBook @Suns @NBA Shhhhhhhhh to much facts",
    "952": "@RustyBUCKETS321 Huge disappointment: the Phoenix Suns are by far the best team in the league and the media only wants to talk about the Lakers and Nets",
    "953": "Minnesota Timberwolves - Phoenix Suns\n\nBet slip link: https://t.co/VDwQTkonIw https://t.co/Q9t1XyhvVj",
    "954": "@IsiahThomas @DevinBook @Suns @NBA Will Booker make 1st Team All NBA?? If you even have to think or question it, then there's your answer. He ain't the League MVP!!!",
    "955": "@NeeNeeSr15 @longjohnslvr85 @IsiahThomas @DevinBook @Suns @NBA You realize the suns are 22-4 without cp3 in the last 2 years and 13-13 without booker right?",
    "956": "@1011ap4 @KlayForTrey @Suns Ig that's what happens when you lose games. Just drop down in the standings like we did lol.",
    "957": "@lisco_2000 @Suns This is amazing 🤩🔥☀️ What a wonderful man",
    "958": "Allegations of racism and misogyny within the Phoenix Suns: Inside Robert Sarver's 17-year tenure as owner #SackSarver  https://t.co/TftZ5zoVXE",
    "959": "@DevinEsser @B500003 @IsiahThomas @DevinBook @Suns @NBA In your DREAMS! 😂😂🤣😅😂😂😂😂",
    "960": "@IamEthanG @IsiahThomas @DevinBook @Suns @NBA Yup, win the chip..That's most important anyway. He should focus on that because no way is he winning MVP.",
    "961": "Bulls vs Phoenix Suns who would win?",
    "962": "@1011ap4 @gswrevengeszn @Jonsmbo9990 @KlayForTrey @Suns Damm warriors really live in your head rent free. Kinda sad",
    "963": "@lisco_2000 @Suns This is incredible!!!! Happy birthday! Hope you had a good one!",
    "964": "@AndrewLeezus Re: \"this is the team we used to watch. We deserve the 2021/22 Phoenix Suns\"\n\nYes, we do.",
    "965": "@lisco_2000 @Suns DARIOOOO! this is the best thing I’ve seen in a while!",
    "966": "@lisco_2000 @XinNBA @Suns Man I love this TEAM/FAMILY!!!!",
    "967": "Shawn ‘The Matrix’ Marion was a critical part of the 2005-06 Phoenix Suns. A truly underrated star. \n\n21.8 PPG\n11.8 RPG\n2.0 SPG\n\n🏆 NBA All Star\n🏆 All NBA 3rd Team https://t.co/NcGR9GYSVN",
    "968": "@NeeNeeSr15 @IsiahThomas @DevinBook @Suns @NBA If it ain’t his time, it ain’t his time. Fine. Just win the chip.",
    "969": "@warriors And you should be a contender? @Suns without @CP3 are dominating the league anyway. You lost with the worst at East.",
    "970": "All I know is that the @Suns OWN the @chicagobulls 🤝 https://t.co/Fc1dSbmW7X",
    "971": "Wow! Phoenix Suns center @bismackbiyombo will be donating his entire $13 million salary from the 2021-2022 basketball season to build a hospital in Congo and pay tribute to his late father.\n\n https://t.co/QCKiRhZqWg",
    "972": "Check out this listing I just added to my #Poshmark closet: Vintage phoenix suns Steve Nash jersey. https://t.co/9Cfjko7xia #shopmycloset @poshmarkapp",
    "973": "@CantGuardBook1 @OrlandoMagic @Suns me, u cp0 and devin booker got the same amount of rings combined",
    "974": "This GSW loss has clinched the Pacific division for Phoenix Suns😷",
    "975": "@lisco_2000 @Suns That is so awesome",
    "976": "@lisco_2000 @Suns keep replaying the part where he says “hi lili this is dario 👨🏻”",
    "977": "3/  Well, @JaValeMcGee🏅of the Phoenix Suns picked it up off OS 🙏 . The point: ain't nobody got time to be listing on and scouring all the marketplaces.",
    "978": "@lisco_2000 @Suns oh. my. god.",
    "979": "@OrlandoMagic @Suns Thank you Magic! 🤝🤝🤙🤙😜😜🧡🧡💜💜",
    "980": "@lisco_2000 @XinNBA @Suns Dario big hug🥰",
    "981": "NBA Basketball Game Betting Picks Simulator: 3/23/2022 8:00 PM ET - Phoenix Suns vs. Minnesota Timberwolves - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/SNz7b0eI4L #nba #sportsbetting #freepicks #cappertek",
    "982": "@lisco_2000 @Suns this is so sweet aaaaaaaaaa https://t.co/V9N4ht7MYO",
    "983": "Great investigation by ESPN. I think the Phoenix @Suns GM hated the owner so much he traded for Chris Paul knowing his boss deserved the Donald Sterling treatment. #ValleyProud #SackSarver https://t.co/Qehx2bZYgE",
    "984": "@lisco_2000 @Suns This is awesome",
    "985": "Phoenix Suns May Be America’s Most TOXIC Workplace https://t.co/Uo2VAR6TX6",
    "986": "@OrlandoMagic @Suns lmao",
    "987": "NBA Defensive GOAT?! Phoenix Suns May Be America’s Most TOXIC Workplace https://t.co/OhMzHCF92A https://t.co/xi7MsffwYo",
    "988": "@KlayForTrey @Suns So cold up here 😂😂",
    "989": "@CurryFIurry @KlayForTrey @Suns SHOULD I UPDATE 😂",
    "990": "@Bitw_13 @KlayForTrey @Suns DO YOU WANNA CHECK THAT UPDATE 😂😂😂",
    "991": "Allegations of racism and misogyny within the Phoenix Suns: Inside Robert Sarver's 17-year tenure as owner https://t.co/8mq8pyDvNL",
    "992": "@ArizonaCoyotes @FSKPart3 @Suns It was nice to see don flaminco tonight! Being rich and pro basketball player is amazing! You should have seen the chic he had with him. Totally with him for reasons listed!! https://t.co/M5PiDIs5KM",
    "993": "The Matrix was my faaaave! #PhoenixSuns #TheMatrix https://t.co/kYGAC5vK3P",
    "994": "@IamEthanG @IsiahThomas @DevinBook @Suns @NBA Sir, clutch? What's that suppose to mean? You folks are so stuck on MJ. Sorry sir, but Booker is not going to win the League MVP. He ain't that guy. Not this year. But it's a good hype dream tho.",
    "995": "@Sun_Maid @Phoenix_137 Raisins do kinda be sucking doe",
    "996": "@Suns Is Chris Paul playing?",
    "997": "@DevinEsser @IamEthanG @IsiahThomas @DevinBook @Suns @NBA The Suns are good man. They were winning without Booker as well. What kind of Point is that?",
    "998": "@moc_dude 💯 dude was awesome. Worst thing the suns did was trade him for Shaq. All but ended SSOL for Phoenix",
    "999": "@lisco_2000 @Suns 🥲 this gives me hope for the future. I’m so happy for you. 😭 what I’d give for a moment like this in life",
    "1000": "@Suns @DevinBook @fourpeaksbrew Book is a G",
    "1001": "I love how people who don’t live in Phoenix and likely have never been here wanna talk about how Phoenix supports/doesn’t support the Suns lmaooo https://t.co/3hfROhoRih",
    "1002": "@lisco_2000 @Suns I cry, so happy for you, dario is so nice",
    "1003": "@DevinEsser @B500003 @IsiahThomas @DevinBook @Suns @NBA That's FLUMMADIDDLE. That's a hype dream. Ain't no way Booker wins mvp. No way. Not over, Jokic,Giannis, Embiid,DeMarr, Lebron, Durant, Curry, Tatum, Cp3, Luka. It just ain't happening. But it's a nice dream tho. 😂😂😂🤣🤣😆😆",
    "1004": "I've never seen such a dominant sports team get so little attention than the Phoenix Suns are right now. If D Book played for the Lakers with this record he'd be the clear cut MVP. #NBA75 #ESPN #NBAonTNT",
    "1005": "@suns_tutu_fan @lisco_2000 @Suns Tweets blowing up too. 😍",
    "1006": "@DevinEsser @Slaughter369 @IsiahThomas @DevinBook @Suns @NBA First off, let's get something straight, unlike Bron, Curry, Giannis, Durant and so forth, you can't add HE to Booker. Sorry, he hasn't done shit. Further more Cp3 gets more credit. Lastly, the Nuggets didn't have Porter Jr and Murray. But ok sir.",
    "1007": "@lisco_2000 @Suns You holding onto this video message. Oh my days i didn’t think he’d actually do it https://t.co/j6sedb3p85",
    "1008": "Last time the Phoenix Suns won back to back division titles was 2005-'06/2006-'07 which somehow feels like just yesterday and now I just feel old again",
    "1009": "@DevinEsser @ToddJCefaratti @IsiahThomas @DevinBook @Suns @NBA So u saying that Booker is the League mvp? Really?",
    "1010": "@Sixers_YB @moc_dude @Suns @LoveAdrxxn Talk to a female",
    "1011": "@DevinEsser @IamEthanG @IsiahThomas @DevinBook @Suns @NBA Please tell me how Booker of all people I the league mvp.",
    "1012": "📢 The Young Turks #BreakingNews: Phoenix Suns May Be America’s Most TOXIC Workplace | March 23, 2022 at 05:00AM #TYTLive #CenkUygur #AnaKasparian 🔗 https://t.co/rGr3EPlkih https://t.co/8v4KRrYfam",
    "1013": "Allegations of racism and misogyny within the Phoenix Suns: Inside Robert Sarver's 17-year tenure as owner https://t.co/VdP0w3lyJB",
    "1014": "@Thraxxx_Montana Mans said top 5 in every Phoenix Suns category 👀. He was fasho a large part of their success and style of play",
    "1015": "@lisco_2000 @Suns This is huge!!! So happy for you + Happy Birthday 🎂🎉",
    "1016": "@lisco_2000 @Suns So happy for you :)",
    "1017": "@23_lbj23 @Jumpshot8 @Suns Wolves told me they are beating Memphis",
    "1018": "@30reacts @Jumpshot8 @Suns Warriors would’ve been HUMILIATED wihout KD on those teams. Go tell ur dad and all ur other warrior family that",
    "1019": "That’s what happens when you’re a Phoenix Sun and not a Laker or a Warrior or a Celtic lmao https://t.co/S6bsM21tl5",
    "1020": "@lisco_2000 @Suns Amazing",
    "1021": "@lisco_2000 @Suns This is super cool",
    "1022": "@DarthVoita @Suns John man my guy this reminds me of when LeBron carried a puzzle piece of the title and with each win they would finish the puzzle. Keep it up man. Let's speak it into existence. Tomorrow let's get that #1 locked in. I enjoy watching your post-game show",
    "1023": "@lisco_2000 @Suns Biggest W to the biggest Dario Stan ❤️",
    "1024": "@Suns Another banner to the rafters 👌",
    "1025": "Nuggets now a game ahead of Minnesota and game and a half behind Dallas. Minnesota has Phoenix tomorrow night before the Nuggets get the Suns Thursday on the 2nd night of a back to back for them.",
    "1026": "@lisco_2000 @Suns GIRL YOU GOT A HUG!!!!",
    "1027": "@CHRISPL79266739 @Suns Who said that?",
    "1028": "@NeeNeeSr15 @IsiahThomas @DevinBook @Suns @NBA MVP and best player in the game are two different categories. Then you really tried to say ppl would be more worried about cp3 when they play the suns…no disrespect to cp3 but book carried the team during the finals and they still have a good record this season without him",
    "1029": "@30reacts @Jumpshot8 @Suns At least I understand basketball unlike u. Without kd Lebron literally owns ur wack ass team tell ur dad that",
    "1030": "@CHRISPL79266739 @Suns lost to the magic + ratio",
    "1031": "@lisco_2000 @Suns Happy birthday! ❤️🎉🥳",
    "1032": "@YevgeniyKogosov @IsiahThomas @DevinBook @Suns @NBA Suns won the division tonight. The only mention I can find on the entire internet is in an article about the Warriors loss to the Magic.",
    "1033": "So bad Chris not mf playing today 😭@Suns",
    "1034": "The @Suns have a stable full of kindness! You rock @dariosaric! https://t.co/kKOkF8oJYP",
    "1035": "@lisco_2000 @Suns Bring Dario back plz I beg",
    "1036": "@30reacts @Jumpshot8 @Suns Warriors would have been embarrassed without kd on those teams 🤣🤣🤡. U should give ur life to him",
    "1037": "Just made my first fan art for a project...ever! @Tripsters and @JaysonW84 inspired me to put in the extra effort for the community. This is me as a Tripster. I love this project! Go @Suns! #NFT #TripstersWorldDomination https://t.co/ovs0OR9968",
    "1038": "The Phoenix Suns are so much better than everyone else right now and it’s not even close. S/O @2crack_14 and @mybuddyjustinwhodoesnthaveatwitterIdontthink",
    "1039": "@lisco_2000 @Suns Holy shit no way that’s awesome lol happy birthday",
    "1040": "@DurMickey @CantGuardBook1 @Navtreaks @LegionHoops When did booker buy the phoenix suns?",
    "1041": "@30reacts @Jumpshot8 @Suns Kd is literally the only reason yall swept gtfo 😂",
    "1042": "@lisco_2000 @Suns This is totally awesome of Dario and the Suns!",
    "1043": "@lisco_2000 @Suns Happy birthday hope today was amazing !! So crazy how far you and him have come😭",
    "1044": "@lisco_2000 @Suns Wow this is amazing.  Haha.  Happy b day.",
    "1045": "@Errrrthangdope @Suns Yes sir",
    "1046": "@EighthRule @THEvacationJJ @solelybrbdoo @IsiahThomas @DevinBook @Suns @NBA But they built around book…how is he not a superstar?",
    "1047": "@30reacts @Jumpshot8 @Suns Our team could would easily win with kd",
    "1048": "@30reacts @Jumpshot8 @Suns Any team could win the chip with kd sit down",
    "1049": "@lisco_2000 @Suns This is lit asf🔥🔥💯 \nHappy Birthday btw🥰",
    "1050": "@EighthRule @solelybrbdoo @IsiahThomas @DevinBook @Suns @NBA Look at his stats without Chris Paul…book is a the super star of Phoenix.",
    "1051": "@Suns @Fresh__Slim Champions? Of a Division? https://t.co/bp4vEPTu88",
    "1052": "@lisco_2000 @Suns im so jealous 😭😭😭",
    "1053": "@lisco_2000 @Suns HOLY FUCKING SHIT IT HAPPENED I CANNOT BELIEVE IT",
    "1054": "@dannyg1313 @lisco_2000 @Suns This video is one of my favorites! 😂😂😂",
    "1055": "@lisco_2000 @Suns Aaaaaamazing. Congrats and happy bday",
    "1056": "@lisco_2000 @Suns Happy birthday! https://t.co/RyvUY5Cbis",
    "1057": "@duragdonic @Veto_Roan @Suns Counter then",
    "1058": "@lisco_2000 @Suns This is so awesome!",
    "1059": "@PipeSpeaks @Suns I DIDN’T CHOOSE TO BE NEURODIVERGENT BUT IN THIS HOUSE WE TAKE WHAT WE CAN GET AND WE MAKE THE BEST OF IT!!!!! thank you so much!!! 🫡🫡🫡",
    "1060": "@lisco_2000 @Suns Happy Birthday! And thank you for giving Dario so much love",
    "1061": "@lisco_2000 @Suns IM NOT LYING WHEN I SAY I TEARED UP FOR YOU😭\ni just barely found your acc but i’m so damn happy for you, you deserve it! happy birthday &lt;333",
    "1062": "@lisco_2000 @Suns Happy bday and this is awesome 🙌!",
    "1063": "@nbalma00 @Suns WHEN HE SAID HE’S SENDING ME A HUG AT THE END https://t.co/1VWAYUMINr",
    "1064": "@lisco_2000 @Suns stop i love this so much😭\nthe way he was like “i wish you a lot of love, good health” THATS SO SWEET????",
    "1065": "@lisco_2000 @Suns This is so cool!! Happy Birthday",
    "1066": "@lisco_2000 @Suns That’s incredible",
    "1067": "@joshieU1G @Suns I thought rev season didn’t matter?",
    "1068": "NBA Division Update - 3/23/2022 🏀\nThe Phoenix Suns win the NBA, Western Conference, Pacific Division. The Phoenix Suns are your 2022 NBA Western Conference, Pacific Division Champions. https://t.co/gBbfPG77NN",
    "1069": "@lisco_2000 @Suns You rn https://t.co/sHB35GdZqz",
    "1070": "@30reacts @Jumpshot8 @Suns Pelicans beat u too stop the fatherless activity",
    "1071": "@YevgeniyKogosov @IsiahThomas @DevinBook @Suns @NBA I feel like this too. Im just now realizing they got the best record in the league",
    "1072": "Coyotes in arena announcer asked fans to welcome some player for the Phoenix Suns. I went, “Who??? Oh wait, is that @ESPNAshley with him?” So did I recognize Ashley over a Suns player? 😂",
    "1073": "@Suns you're welcome 🤝",
    "1074": "@30reacts @Jumpshot8 @Suns Spurs and the magic own u wack ass team",
    "1075": "@lisco_2000 @Suns I am so happy for you!! You deserve this.\n\nCome home, Dario.",
    "1076": "@lisco_2000 @sunsgeek @Suns Well done @dariosaric !!!",
    "1077": "@lisco_2000 @Suns This is so cute I’m so obsessed &amp; thrilled for u",
    "1078": "@lisco_2000 @Suns This is so awesome - nobody deserves it more! First class @suns 👏🏽",
    "1079": "@lisco_2000 @Suns That’s so fucking cool",
    "1080": "Hey everyone… there is a Phoenix suns vs Seattle supersonic playoff game from 1993 on NBA TV right now… if you can watch…. Go ahead and watch\n\nIf you feel the same about 90s basketball being more physical or hands down better than today you’re delusional 🤣🤣",
    "1081": "@ArizonaCoyotes @FSKPart3 @Suns Hanging with Walshy during intermission 😎 https://t.co/sqAKj25UnY",
    "1082": "@keags818 @Suns Thank you!!!!! I am screaming crying and sobbing rn LMAO",
    "1083": "@lisco_2000 @Suns this is crazy 😂 happy birthday 🎊",
    "1084": "@CHRISPL79266739 @Suns We’re the best team in the Pacific, that’s a cause for celebration",
    "1085": "@lisco_2000 @Suns this is insane!! Happy birthday :)❤️",
    "1086": "@1dreezmatic @NeeNeeSr15 @IamEthanG @IsiahThomas @DevinBook @Suns @NBA Right? There is nothing he hasn’t improved on and not to mention the obsurd clutch time stats when I hear valuable I think clutch and that’s book",
    "1087": "@lisco_2000 @Suns That's dope",
    "1088": "@lisco_2000 @Suns Yasssssss!!!  Happy  birthday!!!",
    "1089": "Can the @Suns @dariosaric also do this for @davezamborsky bday?!?! #Sully https://t.co/wIjmxCQAxa",
    "1090": "@Suns Fan of 40 yrs....I fkn love this team.  Let's go get that jewelry! https://t.co/zKwrphfpIL",
    "1091": "@lisco_2000 @Suns THATS SO COOL",
    "1092": "never ever trade this man @Suns https://t.co/17WPVtGw2Q",
    "1093": "@lisco_2000 @Suns congrats",
    "1094": "@ArizonaCoyotes @FSKPart3 @Suns We need em both back! https://t.co/C8AZAlxH4o",
    "1095": "@lisco_2000 @Suns Awesome stuff!!! Happy b’day",
    "1096": "@lisco_2000 @Suns extreme W.",
    "1097": "@lisco_2000 @Suns “Sending you a big hug” STOP THIS IS SO CUTE AND YOU DESERVED EVERY MOMENT OF THIS IM SO HAPPY FOR YOU BBY🥺💜",
    "1098": "@Leopold77271209 @IsiahThomas @DevinBook @Suns @NBA Pretty sure the bias is other guys just being better, as great as Booker’s been. Not a slight at him, not hating, not a media narrative. He has great teammates and a great coach who share the spotlight too. No one hates Phoenix",
    "1099": "@lisco_2000 @Suns Amazing 🤩 I'm so happy for you",
    "1100": "LFG @Suns Fans!!🔥🔥🔥 https://t.co/A8AGN9XQ2r",
    "1101": "@lisco_2000 @Suns The Homie came through! Beautiful greeting",
    "1102": "@ArizonaCoyotes @FSKPart3 @Suns FRANK THE TANK!!! 🦡",
    "1103": "@bobCousyBurner @co_dhunt @PaulPfeiff @YevgeniyKogosov @IsiahThomas @DevinBook @Suns @NBA Well, Bob Cousy would stan himself fosho",
    "1104": "Let’s get this trending 🙌🙏 #bookermvp @DevinBook @CP3 @DeandreAyton @Suns @espn #RallyTheValley",
    "1105": "@rolandsmartin Worked at ESPN, Phoenix  Suns &amp; host a show on NBA SiriusXM.",
    "1106": "@lisco_2000 @Suns This is so damn cool!! I'm so happy for you",
    "1107": "@lisco_2000 @Suns Alright this is crazy I’m so happy for you",
    "1108": "@lisco_2000 @Suns That’s fye happy bday",
    "1109": "@DevinEsser @NeeNeeSr15 @IamEthanG @IsiahThomas @DevinBook @Suns @NBA Also has the lowest defensive rating amongst shooting guards. What else do they want that he hasn't done?",
    "1110": "@lisco_2000 @Suns no you don’t understand i’m OBSESSED happy bday lili &lt;3",
    "1111": "@lisco_2000 @Suns this is so sick",
    "1112": "@KiernanDaley @Suns LOL it'll be CHI in the first round!",
    "1113": "Booker slander you say? 1st place Phoenix Suns 58-14. 9 games above 2nd best Grizzlies. 11 games above the East best Heat. 27 games above the Lakers. https://t.co/heju32DSXG",
    "1114": "@Suns CP3 is still one of the most impactful players in this league.",
    "1115": "thank you so much @Suns for the wonderful birthday shoutout from Dario!!! 💗✨ this means the world to me and literally made my entire year 🥹🥰 https://t.co/D94R3yoe7L",
    "1116": "Hey @NBA, what happened with the @Suns today? #ValleyProud",
    "1117": "Leave it to #XFinity to make the most egregious of NBA faux pas- the 1993 hardwood classic is the Phoenix Suns against the Seattle SuperSonics not OKC\n#sonicsGate #sonics \n\n 🤮 https://t.co/h9AxuBem3L",
    "1118": "@IsiahThomas @DevinBook @Suns @NBA What about Landry Shamet? No mvp talk for him?",
    "1119": "@EighthRule @IsiahThomas @DevinBook @Suns @NBA Hey that's great\n\nMoving on",
    "1120": "@DarthVoita @Suns That's right step on complete but we are just getting started and we won't stop until we win the championship and bring it home to AZ baby",
    "1121": "@nyknicks When you see young Team such as @memgrizz @chicagobulls @celtics @utahjazz @MiamiHEAT @Suns at the Playoff...\nWhat's wrong with my Knicks?!\n#FireThib https://t.co/5iPF9OIOCS",
    "1122": "@Suns Dope",
    "1123": "@Suns Fun season. Finish it🏆",
    "1124": "@ArizonaCoyotes @FSKPart3 @Suns FRANK THE TANK https://t.co/RCLTpKcHAk",
    "1125": "@ArizonaCoyotes @FSKPart3 @Suns Frank the taaaaank",
    "1126": "@ArizonaCoyotes @FSKPart3 @Suns Frank the Tank!!!",
    "1127": "@prembry @EighthRule @IsiahThomas @DevinBook @Suns @NBA Just use one acct",
    "1128": "Thanks for coming out tonight, @FSKPart3! 😎\n\n@Suns | #AllAZ https://t.co/Jf13ufAwkS",
    "1129": "@IsiahThomas @DevinBook @Suns @NBA Not on the @Suns. He needs to get out of AZ to get his shine",
    "1130": "*Stat full of Suns players*\n\nStatMuse: Let’s highlight the one guy who isn’t on the Phoenix Suns!\n\n*Turns off replies* https://t.co/pRSNNgnp5e",
    "1131": "Steph had to save us in the 4th, so what will we do without him? Grizzlies knows how to beat us, without Steph out there, we might get blown off. Then the #1 team in the West, the Phoenix Suns, which has been winning without their point guard, same thing can't be said to us..",
    "1132": "@anthonyVslater @KellanOlson Wait I thought Draymonts greatness (2 points and 7 rebounds) was supposed to put Warriors on top, catching the suns etc …. ? ESPN all said GS with Draymont better than Phoenix and Memphis… lol … the team is a combination of too old and too young with overrated role players..",
    "1133": "@Cryptoniteezy @solelybrbdoo @IsiahThomas @DevinBook @Suns @NBA Nah. I know plenty of ppl that have never heard his name.",
    "1134": "@Jumpshot8 @VIVNPAZ @Suns I don’t think it will be tough until the WCF. Dallas round 2 might get a game from you guys or Utah might. Phoenix is great. Now if my Lakers are the 8th seed we will hear “do they have a chance”🤣🤣. Saw it 2 times this morning. Undisputed would talk the Lakers not the Suns🤦‍♂️🤦‍♂️",
    "1135": "@Steve_Irvin @CTrevorNelson @azcentral @Suns It's way more fun to just beat him\n\n#bringonthelakers",
    "1136": "@NeeNeeSr15 @ToddJCefaratti @IsiahThomas @DevinBook @Suns @NBA Best player best team which shockingly efficient stats",
    "1137": "@NeeNeeSr15 @Slaughter369 @IsiahThomas @DevinBook @Suns @NBA He is actually it’s funny how he swept jokic in the playoffs",
    "1138": "@NeeNeeSr15 @B500003 @IsiahThomas @DevinBook @Suns @NBA Yes he means Booker bud",
    "1139": "@Suns Gosh I’m so proud to have been a fan of this team for 43 years!! The players and the coaches continue to inspire me everyday to be the best leader and person that I can be!! Keep it up and Go Suns!!!!",
    "1140": "@NeeNeeSr15 @B500003 @IsiahThomas @DevinBook @Suns @NBA Yes yes he is",
    "1141": "@NeeNeeSr15 @IamEthanG @IsiahThomas @DevinBook @Suns @NBA Then explain why the suns are still winning without CP3 u clearly don’t watch suns basketball also ur stammer about book not having good stats is just false",
    "1142": "@Jumpshot8 @Suns The Warriors won’t be at your party. Memphis is going to take care of them round 2 and hopefully beat 50% Kyrie tomorrow night. Phoenix/Memphis and Milwaukee/ Brooklyn, Philadelphia or Miami depending upon the other side of the bracket. As a fan so disappointed Kyrie is 50% https://t.co/550o8uWMw2",
    "1143": "@CTrevorNelson @azcentral @Suns Get us @luka7doncic or @JoelEmbiid instead!",
    "1144": "I’ve experienced seeing a @Suns player lift the MVP trophy three times, all three seasons ended in huge disappointment. Do I want @DevinBook in the conversation? Of course! But honestly, ok with the snub, there is a bigger trophy I hope to experience one day",
    "1145": "Phoenix Suns are frauds",
    "1146": "@Suns Gratz fellas. Carry on",
    "1147": "@CTrevorNelson @azcentral @Suns Nope, nope, nope.  Just go win a championship without him, ok?",
    "1148": "@azcentral Nah… we good… hard pass please @Suns",
    "1149": "Phoenix Suns Golden Classic Team #autographed #ad https://t.co/DsOXT7ZZDW",
    "1150": "The Phoenix Suns are the best team in the NBA!💯 https://t.co/BIyH7jjNa6",
    "1151": "The Dookie Booker Gurgle Poppers aka as the @Suns #LakersIn6 #JigHovering🚁 https://t.co/Zn63csdA4R",
    "1152": "Play ball! ⚾️🏟 Well, the South Siders took down our Crew but it was so great to be out in the AZ sun! 💙☀️ #thisismycrew #springbaseball #brewcrew @ American Family Fields of Phoenix https://t.co/YxHW7TDEhc",
    "1153": "@Suns this graphic is so hard",
    "1154": "@DarthVoita @Suns Jobs not finished",
    "1155": "Congratulations to Shazaaaaam (@ShazaaaaamNFT) who moved up 1 spot to take #7 on the Phoenix Suns team leaderboard.\n\nhttps://t.co/Bx4NtnCjMT",
    "1156": "@Suns See you tomorrow in Minneapolis. I'll be in the section behind PHX bench!",
    "1157": "Congrats, @Suns! \n\n✅ Pacific Division champs\n⬛️ Win WC First Round\n⬛️ Win WC Semifinals\n⬛️ Western Conference champs\n⬛️ World Champions https://t.co/hTtcKVBnOy",
    "1158": "@VIVNPAZ @Suns One series at a time.  It’s gonna be a tough road bro.  That’s a fact.",
    "1159": "@Suns By a mile 🎉🎉🎉",
    "1160": "https://t.co/0BqVd2ifj8\n\n@Suns vs @Timberwolves Preview and Prediction. How should you bet this one to get paid. Watch and see how. #WeArePHX #Timberwolves #GamblingTwitter",
    "1161": "@Suns clinched top 2 seed, another win and a grizzlies loss should secure the 1seed with 10 games left",
    "1162": "Consensus Line Move:\n2022-03-23 Phoenix Suns at Minnesota Timberwolves from 234.50 to 235.50\nOver business... man\n#NBA #espn #python #blockchain",
    "1163": "@SunsJAM @Suns @NBA @DarthVoita can we please talk about this? :chefs-kiss:",
    "1164": "@Suns That is what we do.",
    "1165": "Having @Suns seasons tickets &gt;&gt;&gt;",
    "1166": "@Jumpshot8 @Suns Maybe getting ahead of things… but how about a Finals rematch vs the defending champs? That would be an epic Finals for Suns first Championship 🏆",
    "1167": "The Phoenix Suns have clinched first seed in the pacific, and it's looking like they'll be first in the western conference.\n\nAre these your WCF champs? 🏆 https://t.co/Lq3cZAwWiv",
    "1168": "@Suns Bruh who even celebrates that lmao. Celebrate a championship first",
    "1169": "Phoenix Suns.\nDay off. Pacific Champs.\n\n#ValleyProud\n@Suns",
    "1170": "@MrLitterstRocks @Bucks @Suns @Suns @Suns @Suns @Suns @Suns \n\nFixing the algorithm for yah",
    "1171": "@EighthRule @solelybrbdoo @IsiahThomas @DevinBook @Suns @NBA Haha trust me....... EVERYBODY KNOWS HIM",
    "1172": "@Suns We win on our day off. https://t.co/2t7sxRACYT",
    "1173": "The @Suns are freaking amazing this year!   If you aren’t watching, why the hell not?  #phoenixsuns",
    "1174": "@rolandsmartin  he is very knowledgeable Suns Phoenix https://t.co/fSqqQ5JiN6",
    "1175": "Let me buy the hoodie please @Suns https://t.co/lSX0ybe0cR",
    "1176": "@Suns At least don't plan for parade routes or get advice on it til the deal is done🤚",
    "1177": "Clinched Pacific ✅\n\n@Suns",
    "1178": "@rolandsmartin He was the Asst Dir of Basketball Ops for the  Phoenix Suns. He worked at ESPN before being fired.  He now is a cohost on the NBA channel on Sirius XM.",
    "1179": "@Suns The champ is here !!! https://t.co/Le8oPtmDS0",
    "1180": "@IsiahThomas @DevinBook @Suns @NBA Well, unfortunately @DevinBook will have the same result at the end of the season. 😡😡 #butIwasntselected https://t.co/3ABWcGzBIm",
    "1181": "With the Warriors' loss, the NBA-leading Phoenix Suns clinch first place in the Pacific Division\nhttps://t.co/flmYKlmGdo",
    "1182": "@TonySunsin4 @30reacts @Jumpshot8 @Suns Those are kd’s rings they havent won since 2015",
    "1183": "@30reacts @Jumpshot8 @Suns Yall lost ur matchups against the wolves, nuggets, mavs and grizzlies foh. And the series against the 11th seed spurs too🤣🤣🤣",
    "1184": "@Suns Yeah but yall win the chip otherwise your season is a fluke",
    "1185": "@rolandsmartin Amin was part of ESPN the NBA Jump. Also former GM of the Phoenix Suns",
    "1186": "@30reacts @sunsbestteam @Jumpshot8 @Suns Warriors trending down, Kerr says his team doesn't know how to win. Lol \nWhy should we fear the Warriors last time I checked you haven't done anything since 2018?  Keep living that past. Warriors were over-rated since the start. Now you see what Wiggins is down the stretch.",
    "1187": "@Suns Congrats Phoenix now win the chip",
    "1188": "@rolandsmartin He used to be the GM for the Phoenix Suns years ago I believe.",
    "1189": "Nobody else was gonna make it soooo.... I had to do it. Haha. #TitanUp #RallyTheValley #TennesseeTitans #PhoenixSuns #MVP https://t.co/3QnSMW5N1I",
    "1190": "@Suns With. 10. Games. To. Go. \nThis is crazy. Love it.",
    "1191": "@JaMorant BULLS VS ELITE TEAMS\n\n0-4 vs Philadelphia Sixers \n0-3 vs Miami Heat \n0-3 vs Milwaukee Bucks \n0-2 vs Golden State Warriors \n0-2 vs Phoenix Suns \n0-2 vs Memphis Grizzlies",
    "1192": "@NeeNeeSr15 @IsiahThomas @DevinBook @Suns @NBA I was simply stating that jokic wasn't the best player in the league last year. Can't compare 2 very different players that play different positions.",
    "1193": "@Sixers_YB @moc_dude @Suns @LoveAdrxxn Please ignore this….thing💜🧡🏀🔥",
    "1194": "@RusseIIWest @Suns Lakers aren't even gonna beat New Orleans in the play-in.",
    "1195": "@Jared_Mccall21 @Suns nah only division champions*",
    "1196": "@NeeNeeSr15 @IsiahThomas @DevinBook @Suns @NBA I’m not comparing Book to Nash. Just making a point about His 2x mvp. And I don’t think ppl worried of CP over Book. Have you seen Book play in the clutch?",
    "1197": "@30reacts @Jumpshot8 @Suns We beat u once this year and making it even next game stop holding onto regular season games like u say they dont matter right",
    "1198": "@Alfredo12398875 @number1seed @Suns @StateFortyEight 2nd place https://t.co/010lKsSYFH",
    "1199": "@Suns Non @Suns fans right now: https://t.co/s0KsHUMBPM",
    "1200": "@30reacts @Jumpshot8 @Suns Idk why does every single team beat the shit out of u?",
    "1201": "Los Angeles Lakers’ LeBron James needs to be traded to Phoenix Suns, Charles Oakley says https://t.co/me60pAduJd",
    "1202": "@Jared_Mccall21 @Suns dbook already spent his years on a non playoff team he won’t go back to that now that he’s tasted success",
    "1203": "@30reacts @Jumpshot8 @Suns Yall a g-league team without steph 😂",
    "1204": "@vollner_xiii @Suns Don’t do this to me you know I love future laker Devin Booker",
    "1205": "Posting these in honor of the @suns winning their division again. So happy for @DevinBook @CP3 . #BackToBack #RallyTheValley 🏀 https://t.co/Ri9UhWFmG0",
    "1206": "Back to back #Pacific Division Champs! #Suns @Suns https://t.co/mrvgIf2m3m",
    "1207": "@30reacts @sunsbestteam @Jumpshot8 @Suns Atleast we won.Yall warriors fan talk so much trash but loose to the magic.When they lose you just make excuses that steph was injured. Now, you know that curry is carrying your whole team.",
    "1208": "@Sixers_YB @moc_dude @Suns @LoveAdrxxn Keep that same energy when your team gets bodied on Sunday fam",
    "1209": "@30reacts @Jumpshot8 @Suns 😂 How much Suns know about winning championships? You only earn the right to behave a certain way AFTER you win 1 chip at least.",
    "1210": "@Suns Update the name!",
    "1211": "@duragdonic @Veto_Roan @Suns This ratio has more rings than the Lakers franchise",
    "1212": "@30reacts @Jumpshot8 @Suns No we haven’t yall lost to the 15th seed im weak asf 🤣",
    "1213": "@DevinBook Very true. Also changes each time the “experts” see a highlight or listen to some guy shouting on TV. @Suns fans can tell the @NBA that Devin Booker has been phenomenal for 7 years now. About time everybody else realizes it too.",
    "1214": "@amiradelagarza @JacobDMartinez @JulieGunnigle @Suns I would hope not! Folks can sign the online petition either through their driver’s license number or voter ID number and SSN. In-person petitions will also be circulated throughout the county over the next two weeks!",
    "1215": "@DC4ForMVP @mikalbridge @BOOK1Rx4ULLER @DevinBook @Year3Cam23 @Suns @BookPlayoff @CantGuardBook1 You good bro. I appreciate the tag.",
    "1216": "@B500003 @IsiahThomas @DevinBook @Suns @NBA Sir are u saying that Booker I the MVp? Seriously?  Are you?",
    "1217": "@mikalbridge @BOOK1Rx4ULLER @DevinBook @Year3Cam23 @AlaaldinAlan @Suns @BookPlayoff @CantGuardBook1 I’m also new to suns Twitter lol",
    "1218": "@number1seed @RasJosh10 @Suns @StateFortyEight Felt good. Might bust the hat out soon",
    "1219": "@qdubJR @IamEthanG @IsiahThomas @DevinBook @Suns @NBA Ok so just best record team must have the mvp. That's Flummadiddle.",
    "1220": "Thanks to the @Suns community I will be going to see the Suns throwdown against the Timberwolves tomorrow. I am sooooooo fn excited I don't know how I will sleep! Big ups to @jaymikk for being amazing 🤩 https://t.co/7HCze4A4WF",
    "1221": "@30reacts @Jumpshot8 @Suns Yall lost to a g-league team🤣",
    "1222": "@yadonespooked @Suns @StateFortyEight We are sooo deep too",
    "1223": "@30reacts @Jumpshot8 @Suns A championship is never garenteed, regardless how hot a team looks. I'll give more chance to the Bucks.",
    "1224": "@IamEthanG @IsiahThomas @DevinBook @Suns @NBA Sir you really trying to compare Booker to Steve Nash? When u play the Suns, who are u worried about? Cp3. Stop it.",
    "1225": "@mikalbridge @BOOK1Rx4ULLER @DevinBook @Year3Cam23 @AlaaldinAlan @Suns @BookPlayoff @CantGuardBook1 No just off top of my head lmao",
    "1226": "@BSSportsbook Kevin Johnson, the Phoenix Suns point guard from the 1990s. He doesn't get enough recognition for his greatness on the court.",
    "1227": "@longjohnslvr85 @IsiahThomas @DevinBook @Suns @NBA Well not Booker. CP3, maybe.",
    "1228": "The Phoenix Suns have clinched homecourt in the first two rounds of the playoffs and a top-2 seed.",
    "1229": "@rfpcrawford @IsiahThomas @DevinBook @Suns @NBA No offense, like CP3, Steve Nash, qas that guy. Not Booker. Stop it.",
    "1230": "@DC4ForMVP @BOOK1Rx4ULLER @DevinBook @Year3Cam23 @AlaaldinAlan @Suns @BookPlayoff @CantGuardBook1 You only know 7 Suns fans?",
    "1231": "@Suns Wuns",
    "1232": "@BOOK1Rx4ULLER \n@DevinBook \n@Year3Cam23 \n@AlaaldinAlan \n@Suns \n@BookPlayoff \n@CantGuardBook1 \n@mikalbridge \nTagged as many suns fans as I know",
    "1233": "@Jumpshot8 @Suns Alls fair in love and trolling I see. 🤷🏻‍♂️ https://t.co/RNvFee29J5",
    "1234": "@B500003 @IsiahThomas @DevinBook @Suns @NBA It doesn't have to be the best player in the league sir, but Booker? Seriously?",
    "1235": "With the Warriors loss tonight, the Grizzlies are the only team left that have not been eliminated from catching the @Suns.  Tomorrow night could be the clincher. \n \nMagic Number is 2!!!!\n\n#RallyTheValley \n#ValleyProud \n#Suns https://t.co/DNJmtvaYbj",
    "1236": "@rying26 @herbsforsale @GraceMaximus @XavierHarkness @NeeNeeSr15 @IsiahThomas @DevinBook @Suns @NBA @Money23Green Didn't catch the like until I had responded 🤦‍♂️ \n\nI think the 3 of us are basically on the same page, just ya know, communicating on here isn't always clear at first",
    "1237": "@ToddJCefaratti @IsiahThomas @DevinBook @Suns @NBA No I'm sane. How do you come up with Booker winning the mvp?",
    "1238": "@Sixers_YB @moc_dude @Suns @LoveAdrxxn i’d believe him, sixers fans know what it’s like to lose second round",
    "1239": "@Slaughter369 @IsiahThomas @DevinBook @Suns @NBA You comparing Booker to Jokic?? Seriously...Stop it.",
    "1240": "@Sun_Maid @Phoenix_137 LEAVE MY OOMFIE ALONE https://t.co/dKAclCPCPU",
    "1241": "No thanks. Don't need his \"talents\" here:\n\nLos Angeles Lakers' LeBron James needs to be traded to Phoenix Suns, Charles Oakley says https://t.co/iCLErQBjoY via @azcentral",
    "1242": "LeBron James needs to be traded to Phoenix Suns, Charles Oakley says https://t.co/8QEuNt39oE",
    "1243": "@haileyaleah2 @BrooklynNets @Lakers @memgrizz @MiamiHEAT @nuggets @Suns @utahjazz @Bucks @NBA @SbtaughtU Hell na we will be healthy this year im done watching the Lakers and these other poverty franchises win 🏆 #DubNation we winning this shit",
    "1244": "Arizona's sunset \"blue hour\" delivered in bright neon orange tones as the setting sun's rays illuminated a band of cirrostratus. In a few minutes the colors evaporated into the night sky as Phoenix temperatures hovered in the mid-70's. #azwx https://t.co/XRjANKNkoz",
    "1245": "@mikal_bridges x @TheWildBunchNFT \nWe’re waiting for you man..\n@Suns help us out! https://t.co/mYWWdNwIwK",
    "1246": "@Suns @john34455537 @AZSportsHistory LET'S GOOOOOOOOOO 🔥🔥🔥",
    "1247": "@Lob2Ayton2 @Suns wym he averaged 25/7 this season",
    "1248": "@Suns Update to that Y folks! https://t.co/1Kdeu8MMod",
    "1249": "@evxz17 @Suns he not on the team",
    "1250": "@Grant2Will @nbatopshot If u tryna win a chip, better scope u opponent... 🧐🌞 @Suns https://t.co/nQkGIJYHlV",
    "1251": "Big W today @Suns fans #IYKYK https://t.co/ZbFvpq6JoV",
    "1252": "@Sixers_YB @moc_dude @Suns @LoveAdrxxn you funny",
    "1253": "@PincayChris @jj_redick @Suns But they will if needed...",
    "1254": "@AJ22Jahr Tell me how you feel about the best team on earth the Phoenix Suns",
    "1255": "@Suns Back to back champs",
    "1256": "@Lob2Ayton2 @Suns he’s the mvp of the season i don’t get it",
    "1257": "If @DevinBook doesn’t meet this so called “#criteria” with these numbers and best record, Then idk what a MVP is anymore. @IsiahThomas @Suns https://t.co/SKunD48dTm",
    "1258": "@evxz17 @Suns u know why",
    "1259": "Congratz @Suns https://t.co/ctsL4MwOKL",
    "1260": "@APB_CPA_MBA @Suns You won't believe who the Warriors lost to for us to become Pacific Div champs.",
    "1261": "@co_dhunt @PaulPfeiff @YevgeniyKogosov @IsiahThomas @DevinBook @Suns @NBA Who said I was a fan and not the goat him self https://t.co/aDUcV6320V",
    "1262": "@Suns Congratulations Valley Boyz fan from birth. Arizona native",
    "1263": "@Sixers_YB @moc_dude @Suns @LoveAdrxxn your team has james harden on it",
    "1264": "@Suns why isn’t Nader on here",
    "1265": "@valleyskills @RyB_311 True dat!  Either way our @Suns are gonna stomp them.",
    "1266": "@Jumpshot8 @Suns Lmao",
    "1267": "@Suns How did this happen today?  I imagine the Warriors lost huh?",
    "1268": "@duragdonic @Veto_Roan @Suns and you personally have none because you don't matter",
    "1269": "Yep. And national media still talk about play-in teams like they're the best in the league.\n\nKeep sleepin on @DevinBook and the @Suns. No, really, just keep doing it. https://t.co/0MIiGha643",
    "1270": "Congrats to the @Suns for winning their division for a second straight year! https://t.co/CDVaKfPs2z",
    "1271": "@canzole412 @Suns A week still left with March and the Warriors have already lost the division. Smh",
    "1272": "@RusseIIWest @Suns they won't though as the lakers are very terrible. like laughably bad, so bad that having a stan account on twitter must be horribly embarassing.",
    "1273": "@Suns Need to see that \"x\" turn into a \"y\" please.",
    "1274": "@canzole412 @Suns Facts",
    "1275": "@Suns MOOD RN https://t.co/9SCPkqbztz",
    "1276": "I know I know. Let’s wait to the playoffs. There is no regular season champion. When CP3 went down, the Warriors would walk us down. We walk up the stairs @Suns fans and don’t look back.  “We Good”. https://t.co/2QO1DOBRVF",
    "1277": "@Veto_Roan @Suns Tht has more rings then your entire franchise",
    "1278": "@Suns @RexChapman I love how Black men dominate the sport, \nbc theyre like aliens &amp; can fly in front of our faces! \nlike Mercury w  wings on their feet!  \n#FlyingMen",
    "1279": "@Sixers_YB @jacob_pretzman @Suns Suns own the Sixers. \n\nBucks barely beat a team without Book, CP3, &amp; Cam Johnson. You can settle down.",
    "1280": "@Suns Life is good",
    "1281": "@Suns change it to\ny - Phoenix Suns",
    "1282": "@Sixers_YB @moc_dude @Suns @LoveAdrxxn Sixers yeah",
    "1283": "@Free_Haiti6 Warriors beat the healthy suns at Phoenix without Poole Wiggins Klay Iguodala and Wiseman.\nThat’s not how things are measured bro",
    "1284": "@DJSCHEME_ How bout Dbook with The Phoenix  Suns?",
    "1285": "@Sixers_YB @moc_dude @Suns ironic coming from a 76ers fan",
    "1286": "@Suns i only like Devin Booker",
    "1287": "@Suns @DevinBook @fourpeaksbrew Love this dude",
    "1288": "@Sixers_YB @jacob_pretzman @Suns You’re a 76ers fan Khawi still owned you 😂😂",
    "1289": "PHOENIX SUNS 🧡💜 🧡💜 🧡💜",
    "1290": "@moc_dude @Suns @LoveAdrxxn Losing second round btw",
    "1291": "@DevinBook for #MVP and it ain’t even close @Suns @NBA",
    "1292": "@Sixers_YB @jacob_pretzman @Suns Raptors still own you 😂",
    "1293": "@Suns LET's GOOOOOOOOOOOOOOOOOO!",
    "1294": "@Suns Giannis owns you btw",
    "1295": "@Suns Warriors are the biggest frauds lmaooo",
    "1296": "@Suns Best rooster in the league in my book.",
    "1297": "@Suns satisfaction",
    "1298": "Want presale access to Playoff tickets when they go on sale? \n\nJoin the '68 Reserve Membership Waitlist today: https://t.co/Ei59L55hmt",
    "1299": "Watching @TheTraeYoung torch the Knicks right now 🔥 and this new Madison square garden floor is killing me 👀 don't like it at all 🤦looks kinda like the @Suns floor! @nyknicks pls go back to the Original ORANGE&amp;BLUE....",
    "1300": "🤣This team is beating Phoenix Suns in play offs? https://t.co/PXnQ0UWgsR",
    "1301": "@Suns @LoveAdrxxn I LOVE THIS TEAM SO FREAKING MUCH ❤️‍🔥☀️ https://t.co/fsouW4qnG7",
    "1302": "@Suns Tht has more rings then your entire franchise",
    "1303": "@jacob_pretzman @Suns Bucks still own you 😹😹",
    "1304": "@Suns THANK YOU MAGIC https://t.co/jU0Rx6jjXu",
    "1305": "@Suns All this to lose to the Warriors wow",
    "1306": "@Suns SMOKING THAT WARRIORS PACK TONIGHT",
    "1307": "@Suns NBA Champs next https://t.co/aJobbH07b7",
    "1308": "@Suns Ring next",
    "1309": "After the Golden State Warriors lost to the Orlando Magic, the Phoenix Suns became Pacific Division Champions for the 2021-22 NBA season, back to back! \nThe last time they clinched the Pacific Division in back to back season is 2005-06 and 2006-07! #ValleyProud #NBA75 https://t.co/LaJ1fQHsQ5",
    "1310": "@DarthVoita @Suns @NBATV I still haven’t recovered from that season!",
    "1311": "@zonaaybs @Suns @DevinBook @CP3 @campayne @DeandreAyton @mikal_bridges @JaValeMcGee @landryshamet First round exits",
    "1312": "@Suns @DevinBook @CP3 @campayne @DeandreAyton @mikal_bridges @JaValeMcGee @landryshamet Forgive me for asking, but who lost?",
    "1313": "@IsiahThomas @DevinBook @Suns @NBA this why you the 2nd best PG of all time in my eyes",
    "1314": "GCU Lopes vs ASU Sun Devils ⚾️. GCU up 3-2 after 1. Battle for Phoenix . Perfect Night for College Baseball https://t.co/MJOE8qWqBE",
    "1315": "With 10 games remaining, the Phoenix #Suns’ Magic Number to clinch:\nA play-in spot: ✅\nA top-six spot: ✅\nBest record in franchise-hist.: 5-5\nPacific Div. Champ: ✅\nWest. Conf. Best Record.: 2\nLeague Best Record: 2\n\n#ValleyProud https://t.co/lcEFP0kMW8",
    "1316": "@Suns @DevinBook @CP3 @campayne @DeandreAyton @mikal_bridges @JaValeMcGee @landryshamet Warriors really lost to the Magic for us to secure tonight \n\nDon’t even have to try at this point 😂🤝",
    "1317": "@Suns @DevinBook @CP3 @campayne @DeandreAyton @mikal_bridges @JaValeMcGee @landryshamet Yeah baby!!! https://t.co/NDYiOubOQg",
    "1318": "@01001100____ @Suns HOLY SHIT NOT U AGAIN, PLEASE MY LIFE IS ALREADY SHITTY WATCH THE GAME",
    "1319": "@Suns @DevinBook @CP3 @campayne @DeandreAyton @mikal_bridges @JaValeMcGee @landryshamet LET’S GO!!!",
    "1320": "@Suns Free jersey?",
    "1321": "@Suns @DevinBook @CP3 @campayne @DeandreAyton @mikal_bridges @JaValeMcGee @landryshamet The Journey Continues https://t.co/P5yuDekMxr",
    "1322": "@Suns @DevinBook @CP3 @campayne @DeandreAyton @mikal_bridges @JaValeMcGee @landryshamet gorgeous gorgeous GORGEOUS",
    "1323": "The Warriors beat the 1st seed Phoenix Suns WITH Stephen Curry and WITHOUT Jordan Poole, Klay Thompson and Andrew Wiggins. \n\nThe Warriors lost to the 15th seed Orlando Magic WITHOUT Stephen Curry and WITH Jordan Poole, Klay Thompson and Andrew Wiggins.",
    "1324": "@Suns @DevinBook @CP3 @campayne @DeandreAyton @mikal_bridges @JaValeMcGee @landryshamet LET'S GOOOOOOOOOOOOO!",
    "1325": "In a division with Kawhi, PG, LeBron, AD, and Curry. The Phoenix Suns have now fluked their way to back to back Pacific division titles. \n\nThe fluke run continues.",
    "1326": "@Suns @DevinBook @CP3 @campayne @DeandreAyton @mikal_bridges @JaValeMcGee @landryshamet Warriors are trash😂😂😂 losing to the Magic lmaooo",
    "1327": "@Suns @DevinBook @CP3 @campayne @DeandreAyton @mikal_bridges @JaValeMcGee @landryshamet EZ! Let's fucking go. Yall getting that ring this year!",
    "1328": "@cou_rage00 The Best now is @Suns",
    "1329": "@Espo THE PHOENIX SUNS ARE THE BEST TEAM IN THE PACIFIC DIVISION",
    "1330": "@Suns @DevinBook @CP3 @campayne @DeandreAyton @mikal_bridges @JaValeMcGee @landryshamet THANK YOU MAGIC https://t.co/KkzjhAIqaT",
    "1331": "@warriors i am officially a phoenix suns fan. this is so embarrassing",
    "1332": "@Suns @DevinBook @CP3 @campayne @DeandreAyton @mikal_bridges @JaValeMcGee @landryshamet yessa #valleyproud 😮‍💨",
    "1333": "I really wasted my time watching this game in Cancun. Must be nice to be a competent team w/o your best player @Suns @memgrizz",
    "1334": "@Suns @DevinBook @CP3 @campayne @DeandreAyton @mikal_bridges @JaValeMcGee @landryshamet Great but the job isn't done yet. Let's gooooo! https://t.co/JgCYX3kXQE",
    "1335": "Phoenix Suns posted 1m ago on Instagram and… https://t.co/PJVD5eh6Ot",
    "1336": "Your 2022 Western Conference Champions: The Phoenix Suns",
    "1337": "@Suns @DevinBook @CP3 @campayne @DeandreAyton @mikal_bridges @JaValeMcGee @landryshamet Want to thank google for translating this.",
    "1338": "@Suns @DevinBook @CP3 @campayne @DeandreAyton @mikal_bridges @JaValeMcGee @landryshamet Injured Pacific champs*",
    "1339": "@EighthRule @THEvacationJJ @solelybrbdoo @IsiahThomas @DevinBook @Suns @NBA how is he not a superstar? do you watch devin booker play basketball",
    "1340": "\"This story is part one of a three-part series on the life and career of Hall of Fame Suns broadcaster Al McCoy.\"\n#Suns @Suns\nhttps://t.co/PCj4VSgt2a",
    "1341": "The Phoenix Suns are Pacific Division champions in back to back seasons",
    "1342": "@Suns @DevinBook @CP3 @campayne @DeandreAyton @mikal_bridges @JaValeMcGee @landryshamet Nobody cares tht has more rings then your whole franchise",
    "1343": "@NBA @Suns  are your 2022 nba champion's",
    "1344": "this is where they are separated from phoenix suns where on the other hand, always won on clutch games https://t.co/RQgWmNReaN",
    "1345": "@Suns @DevinBook @CP3 @campayne @DeandreAyton @mikal_bridges @JaValeMcGee @landryshamet warriors frauds😂😂😂😂",
    "1346": "@Suns @DevinBook @CP3 @campayne @DeandreAyton @mikal_bridges @JaValeMcGee @landryshamet LETS GO",
    "1347": "@BearCubby57 @gmtoshit @Suns Naw, he's a weirdo using a made up newsletter for clout.",
    "1348": "Casuals really don’t realize how good the @Suns really are https://t.co/rQ2N3iCLqb",
    "1349": "3/22/02 – With the franchise's only season winding down, the ABA's Phoenix #Eclipse (20-13) used a 17-0 run to end the 3Q, pulling away from and holding off the 5-18 Las Vegas Slam 114-101 at Grand Canyon University. Former Phoenix #Suns star led the Slam with 27p. https://t.co/byjpVkomZG",
    "1350": "Battle of Phoenix - GCU Lopes vs ASU Sun Devils ⚾️ - Gorgeous Night for College Baseball in the 🌵 @ Phoenix Municipal Stadium https://t.co/L1knXnRMH7",
    "1351": "The Phoenix Suns have the best overall, home, road, conference, non-conference, OT, with Chris Paul, without Chris Paul, and last 10 games records in the NBA.  \n\nThey have the longest win streak, 2nd longest win streak, and current longest win streak in the NBA.\n\nlol",
    "1352": "@ItWasAKindness @EighthRule @IsiahThomas @DevinBook @Suns @NBA This is just a pathetic amount of insecurity.  This dude made a perfectly reasonable point and ur responded with ad hominem tryna say hes jealous.  \n\nBooker isnt as good as the top MVP candidates, and thats ok.  No shame in that.  Still great player.  Stop being so insecure",
    "1353": "@warriors bringing the heat with 88pts against the 19-53 @OrlandoMagic. @Suns are gonna run thru the West.",
    "1354": "@Suns @DevinBook @mikal_bridges BooK!!!",
    "1355": "@gmtoshit @Suns This you https://t.co/aCVsqx1wET",
    "1356": "@Suns @CP3 @DevinBooker31 @NBATV is streaming 1993 Suns road to finals.  Brought back great memories and admiration of the team you are today.  You all are the most strongest most complete suns team I can remember.  This is your year !!!",
    "1357": "LIGHTS CAMERA ACTION! Insert @Suns @DevinBook https://t.co/7RHIsNkHzv",
    "1358": "@finfan71 @rying26 @GraceMaximus @XavierHarkness @NeeNeeSr15 @IsiahThomas @DevinBook @Suns @NBA @Money23Green ^^^^ exactly my point",
    "1359": "@AndrewLeezus @azballer23 @suns put this man on a 2 way",
    "1360": "@EighthRule @solelybrbdoo @IsiahThomas @DevinBook @Suns @NBA Is your argument small market teams don’t break through (*cough* Giannis and Ja) or is it just Phoenix (*cough* Nash)… doesn’t matter you’re wrong!!! Moving onto the next hater.",
    "1361": "@EarlyJulius @LukeSwiatek @AndrewLeezus This is not a discussion about that. I am simply stating that Booker’s season is not really up to an MVP standard, not because he’s a Phoenix Suns player, but because there are more impactful seasons occurring by other players around the league.",
    "1362": "@Suns @DevinBook @fourpeaksbrew Preach book you da man",
    "1363": "@ShannonSharpe I love you, Unc but you got to get on this Phoenix Suns owner situation. This is bad, real bad",
    "1364": "@IsiahThomas @DevinBook @Suns @NBA Tell me about it",
    "1365": "No @Suns basketball tonight? Tune in to @NBATV. They’re showing 1993 Suns playoffs games.\n\nGame 6 of the 1993 Western Conference Senifinals on now!",
    "1366": "!!Devin Booker’s (Phoenix Suns) vs Nikola Jokic’s (Denver Nuggets) Thurs... https://t.co/JzMNLCNoy1 via @YouTube",
    "1367": "@ItWasAKindness @IsiahThomas @DevinBook @Suns @NBA And u got that out of what I said? Good lord. I plainly stated multiple times he’s good and that I like him. Just in my opinion I dnt think he’s at superstar status and that’s because he’s on the Suns. Annnd I even said I like the Suns. I like a bunch of teams",
    "1368": "@KumingasBurner @GraceMaximus @NeeNeeSr15 @IsiahThomas @DevinBook @Suns @NBA @Money23Green I wasn't listing a top 5 MVP candidate list. I was just listing the first players that's popped into my head. They are all valuable to their teams winning. Same for KD, Embiid, CP3, Draymond etc.",
    "1369": "!!Devin Booker’s (Phoenix Suns) vs Nikola Jokic’s (Denver Nuggets) Thurs... https://t.co/sAfaxyDX7y via @YouTube",
    "1370": "@drdicks @IsiahThomas @RexChapman @DevinBook @Suns @NBA Legendary profile pic bro",
    "1371": "CUZ HE PLAYS FOR THE SUNS, IF HE PLAYED FOR LA THEY WOULD BE OUT OF THE PLAY IN AND BOOK WOULD BE MVP. but he plays for Phoenix… it’s a sad narrative man. https://t.co/l6Sy2lQGW6",
    "1372": "Los Angeles Lakers' LeBron James needs to be traded to Phoenix Suns, Charles Oakley says https://t.co/mOaiSyu4WO",
    "1373": "@IsiahThomas @DevinBook @Suns @NBA So clearly even NBA legends do not get things right when talking basketball. Bruh GTFOH with this.",
    "1374": "It’s impossible to imagine in a best of 7 series, these guys don’t win 4. @Suns #planethoughts #ValleyProud  #bestbirthday #camjohnsonwavedatmeandifell",
    "1375": "Travel Guide: An Overview of Phoenix, Arizona (Valley of the Sun) https://t.co/VMtMbS5X3U",
    "1376": "Actually amazing. Thank you @Suns  and happy birthday @lisco_2000 https://t.co/cseRIan26z",
    "1377": "@IsiahThomas @DevinBook @Suns @NBA Nah mate - the fact CP hasn't been there the last few weeks doesn't mean Booker should get credit for the 50+ games he was. CP was my MVP before injury but now it's Jokic",
    "1378": "@KarlosValle_ @IsiahThomas @DevinBook @Suns @NBA DBOOK after he’s selected as 2nd all nba team and not 1st https://t.co/PaFAM4WEOE",
    "1379": "Watching 1993 @suns v @Lakers playoffs round 1 game 5. We know what happened. Fun memories. Pretty sure my parents were at this game. OT now #phoenixsuns https://t.co/0NAjbHPrb0",
    "1380": "@IsiahThomas @DevinBook @Suns @NBA @Maad_hbk3 there’s a guy who votes on mvp every year and he said winning has always been in the criteria",
    "1381": "@Harrison_Grimm And no phoenix sun with the best record by a while",
    "1382": "@IsiahThomas @DevinBook @Suns @NBA Thank youuuuuuuuuuuu omg dbook got his respect for once 💜🧡",
    "1383": "3/22/19 – Having not played in the NBA for 3yrs, the 17-55 Phoenix #Suns filled a hole in the roster following a thumb inj to Kelly Oubre that ended his season, signing 30-yr-old Jimmer Fredette to a \"2yr\" contract for $2.186M, but only a pro-rated $198K guaranteed. #ValleyProud https://t.co/2MiFmlC646",
    "1384": "@finfan71 @herbsforsale @GraceMaximus @XavierHarkness @NeeNeeSr15 @IsiahThomas @DevinBook @Suns @NBA @Money23Green thought that was made even more obvious by the fact that I liked your tweet to indicate I agree with it lmfao",
    "1385": "@therealTC24 @DevinBook @Suns What is you tan mail address?",
    "1386": "@finfan71 @herbsforsale @GraceMaximus @XavierHarkness @NeeNeeSr15 @IsiahThomas @DevinBook @Suns @NBA @Money23Green and I was replying to the person who replied to you, not you. the “chris paul related excuses aren’t valid since the suns are still kinda good without him” guy",
    "1387": "@NeeNeeSr15 @IsiahThomas @DevinBook @Suns @NBA Steve Nash got 2 MVPs bc of team record. The criteria changes like the weather",
    "1388": "@domojackson7 This right here. We can still get some more pieces for the oline through FA if we want. We improved everything and we got FAST. Really fucking fast. We are gonna be YAC/RAC Gods. I imagine the early 2000’s Phoenix Suns speed. Let’s fucking gooooo",
    "1389": "Top Ten #NBA Power Rankings 03/22:\n     1. Golden State Warriors\n     2. Utah Jazz\n     3. Denver Nuggets\n     4. Phoenix Suns\n     5. Milwaukee Bucks\n     6. Miami Heat\n     7. Boston Celtics\n     8. Brooklyn Nets\n     9. Memphis Grizzlies\n     10. Dallas Mavericks\n\n#NBATwitter https://t.co/vBBJ4R3CEt",
    "1390": "That one time we flew to Milwaukee and I got a selfie with @DeandreAyton 😆👏 #suns #phoenixsuns #valley #RallyTheValley https://t.co/UbiovbmLqK",
    "1391": "@rying26 @herbsforsale @GraceMaximus @XavierHarkness @NeeNeeSr15 @IsiahThomas @DevinBook @Suns @NBA @Money23Green Nobody said \"they aren't better with him\" - I was replying to \"Paul is the cog that makes the team run. Without Paul they were out of the playoffs or at the bottom.\" \n\nYou see the difference, right?",
    "1392": "@KiernanDaley @Suns I want to see the look on his face when they dont win it all 😄",
    "1393": "@TheNBACentral @CelticsGRD 2000 miles away you’ll hv to meet and greet and then (ahem) beat the Phoenix suns.  Love the optimism, though.  Lol",
    "1394": "@herbsforsale @finfan71 @GraceMaximus @XavierHarkness @NeeNeeSr15 @IsiahThomas @DevinBook @Suns @NBA @Money23Green all it shows is they’re good without him, but you don’t think they’d be better with him? 2 of those 4 losses were by 5 or less points",
    "1395": "@B500003 @NeeNeeSr15 @IsiahThomas @DevinBook @Suns @NBA And has won 70% of his games.  That's better than any other team since CP3 went out",
    "1396": "Phoenix suns without Cp3 and Booker had a winning record,  Memphis without JA morant still winning games.... Warriors full squad without 30 they struggling against fking Orlando magic. 😴,",
    "1397": "@KawhisIPad He’s also scared of the Phoenix Suns",
    "1398": "@KOHuerta Phoenix Suns*****",
    "1399": "@Youtubej9B @premier_fa Phoenix Suns",
    "1400": "Damn Phoenix Suns y’all got some toxic work environment shit goin on over there 😳"
}