{
    "0": "@celtics game time. https://t.co/zFtOgRtLYf",
    "1": "@celtics Pls make it a blow out so Jabari gets minutes🙏🏻",
    "2": "@gmen307 @celtics G willaams and r williams or Covington and McLemore which combo is good plz say",
    "3": "Portland Blazers - Boston Celtics, over 212 2.0 60% 4u #Sukkelat",
    "4": "@celtics took my medicine, therapy on Tuesday and still down bad. Please provide serotonin.",
    "5": "#FreePick: #NBA Boston Celtics +1 (-110) 3Units #DedLocks",
    "6": "@celtics Rooting for the Celtics https://t.co/Jj0I34pauB",
    "7": "All @celtics players warming up wearing headbands tonight #RipCity",
    "8": "I hate when we are on the west coast @celtics don’t start till 10pm I’m old I’m in bed at that time. I’ll watch later Let’s Go we need this win. The next 3 game are brutal #Celtics  #BleedGreen",
    "9": "Betting Picks: Boston Celtics vs Portland Trail Blazers preview prediction and picks  https://t.co/aCSBXdDrqw",
    "10": "@sow1707 @celtics Jrich better off the bench with Schroeder starting. He’s the scorer on the bench.",
    "11": "🏀 Portland vs Boston Celtics\n🏆 NBA\n🗓 04/dic.\n⏰ 23:59\n📺 ESPN 3",
    "12": "@trailblazers @celtics @ROOTSPORTS_NW @RipCityRadio620 I miss watching the games…",
    "13": "@gmen307 @celtics No way Boston doesn’t hold em to under 105 tho",
    "14": "@celtics Tatum 32\nSmart 11 assist \nSchroeder: 24 points \nGrant Williams 15 points \nRob Williams:  double double \nBoston wins 124-120",
    "15": "@celtics I feel as if this is Kemba Walker all over again. There goes our playoff hopes…",
    "16": "@taylorcsnow @jaytatum0 @celtics @Stathead 3-0 in championships in favor of Bird",
    "17": "Portland Trail Blazers vs. Boston Celtics\nNBA LiveStream\n 📲 : https://t.co/vKsqPrwHzw",
    "18": "@celtics I fully expect us to lose tonight 🤦🏿‍♂️🤦🏿‍♂️",
    "19": ".@BostonSportsBSJ:  BSJ Live Coverage: Boston Celtics vs. Portland Trail Blazers - C's hoping to avoid a let down https://t.co/TN7Arkga60",
    "20": "@trailblazers @celtics @ROOTSPORTS_NW @RipCityRadio620 Yet another game I can't watch because it's on Root.",
    "21": "@celtics Shouldn’t have brought back Brown if he wasn’t ready. it Seems like he doesn’t trust his hamstring.",
    "22": "Check out who takes the floor for the @celtics today!\n\nWatch them all in action LIVE on @MTVIndia, @Vh1India, @VootSelect, and @OfficialJioTV! 📺\n \n#NBA75 #NBAonMTV #NBAonVh1 #NBAonVootSelect #NBAonJioTV #NBALiveinIndia https://t.co/HToj618oZG",
    "23": "@trailblazers @celtics @ROOTSPORTS_NW @RipCityRadio620 Timbers just won. Honestly this could go either way and I would still feel good.",
    "24": "Betting Picks: Boston Celtics vs Portland Trail Blazers preview prediction and picks  https://t.co/8OQAEfkHjF",
    "25": "Trade Tatum for Ben Simmons @celtics you cowards",
    "26": "Portland Trail Blazers vs. Boston Celtics Game Day Thread: Photo by Maddie Malhotra/Getty Images Can the Blazers bounce back tonight? The Portland Trail Blazers are home in the Moda Center again tonight taking on the Boston Celtics. It’s been a… https://t.co/JO3gS3Rpy5 #RipCity https://t.co/MjAGO8tQxI",
    "27": "@JohnnyH004 @Celtics_PRam @PreKobeEra @taylorcsnow @jaytatum0 @celtics @Stathead When Larry came to the team they won 32 more games than the previous season. They lost in the ECF his first year and the second year won a title.  Has JT made this team even 10 games better... They won nothing and are barely a 40 win team...",
    "28": "@JKorpusinski @brandon_lirio22 @celtics Yall suck to a team that doesnt play d L",
    "29": "@CShredwards @celtics Lol you havent won against the jazz in like 80 years",
    "30": "@vscena @celtics That’s a nice fit ! Minus the socks",
    "31": "@JayFirstAccount @celtics L YOU ALL SUCK BALL HONG CENTRAL 14 7 OOPS LOSERS",
    "32": "@celtics Crippled Celtics love it",
    "33": "@trailblazers @celtics @ROOTSPORTS_NW @RipCityRadio620 Football is still on but cant wait to watch you guys play in January",
    "34": "@celtics GRANT https://t.co/Nsieh7Xs52",
    "35": "@Noah_Sayed529 @celtics Or Romeo Langford can take mine",
    "36": "Boston Celtics vs Portland Trail Blazers preview prediction and picks | SportsNus https://t.co/eNe71O3cdx",
    "37": "@lemontaaart @celtics Man said “dm me if you me need nba league pass” and then decided to delete it. Mans knew he took the L.",
    "38": "@celtics let’s go win a fucking game 🤦🏿‍♂️",
    "39": "@celtics Grant Williams gonna fuck around and get a triple double...",
    "40": "@celtics Grant “THE GOAT” Williams. https://t.co/nm22fQ2EiH",
    "41": "@JohnnyH004 @PreKobeEra @Redvizsla @taylorcsnow @jaytatum0 @celtics @Stathead 😂\n\nRight, when Larry was Tatum’s age LAST YEAR he was All-NBA 1st, brought a team w/o Parish &amp; McHale, just 1 all-star (like the Jays) to the ECF and got serious MVP consideration.\n\nTatum wasn’t even All-NBA 3rd.\n\nThe year Bird was the age Tatum is now Celtics won the ‘81 title.",
    "42": "@celtics Ngl grant William gone be good tonight",
    "43": "@celtics Grant 💀💀💀",
    "44": "@celtics Hey I predicted this lineup earlier.",
    "45": "Can the #Celtics please take Jaxson Hayes off the #Pelicans hands? @PelicansNBA  have no idea what to do with him anyway. Set him free! @celtics",
    "46": "@D1akayeat @celtics Not really",
    "47": "@celtics Let’s go boys",
    "48": "@celtics easy dub tonight",
    "49": "@celtics Put someone who doesn’t suck in these",
    "50": "@celtics grant williams",
    "51": "@celtics Pls win",
    "52": "@celtics Grant Williams",
    "53": "Starters for tonight ⤵️ https://t.co/UIfvvKceZI",
    "54": "@celtics Asking him about the importance of shutting the fuck up lmaooooo",
    "55": "@lemontaaart @celtics Ratio me if u need to shut up",
    "56": "As we look to respond tonight against the Blazers, Enes Freedom discusses his return to Portland and the importance of coming out and setting the tone early. https://t.co/oW7zGelEW0",
    "57": "@celtics What is Tatum wearing lmao",
    "58": "@JayDon10645543 @FreddieGibbs He used to play for the Boston Celtics",
    "59": "@LaVineGotNext @celtics Probably.  But at least they are playing some defense now",
    "60": "@celtics Please Win🙏",
    "61": "@NBAIndia @celtics @trailblazers @MTVIndia @Vh1India @VootSelect @OfficialJioTV What about heat vs bucks game ,\nWhy it isn't streaming in voot select?",
    "62": "@celtics Just play like you did last night",
    "63": "@celtics Better than Penaldo",
    "64": "New city, new vibe #JetBlueRunway https://t.co/8q4xBLjtPI",
    "65": "🚨 1 hour to go 🚨\n\nCatch the @celtics vs @trailblazers, LIVE at 8:30 AM on  @MTVIndia, @Vh1India, @VootSelect, and @OfficialJioTV! 📺\n \n#NBA75 #NBAonMTV #NBAonVh1 #NBAonVootSelect #NBAonJioTV #NBALiveinIndia https://t.co/GuGvoJbKKB",
    "66": "@celtics Put him in that Philly package for Ben 😤!",
    "67": "@celtics A little late",
    "68": "@JohnnyH004 @Celtics_PRam @Redvizsla @taylorcsnow @jaytatum0 @celtics @Stathead Oh no not that bro we want you to proceed with your take that Larry wasn't even in the league in Tatum's age.",
    "69": "@celtics Stay there?",
    "70": "The @Celtics starting Schroder, Smart, Tatum, Grant Williams, Robert Williams on Saturday. #Celtics #NBA",
    "71": "@SoxPatsCsplswin @celtics I regrow them it’s ok",
    "72": "After wrapping up his pregame conference, @celtics HC Ime Udoka runs across the room to hug @trailblazers radio legend Bill Schonely on his way out, telling onlookers \"I grew up on this guy\" #RipCity",
    "73": "Boston Celtics Starters:\n\nDennis Schroder\nMarcus Smart\nJayson Tatum\nGrant Williams\nRobert Williams\n\nPlayers out:\nRomeo Langford\nJaylen Brown\nAl Horford\n#BleedGreen #NBA #NBATwitter #NBA75",
    "74": "@celtics Is Romeo made of glass?",
    "75": "@celtics Hopefully Nesmith will play well",
    "76": "@celtics LET'S HANDLE BUSINESS BABY LET'S GOOOOOOOOOOOOOO",
    "77": "Ime Udoka says of coaching his first game in his home town of Portland, \"For myself personally, it's good to be back and see family and friends - briefly - but also handle business.\"",
    "78": "Tonight's starting lineup for the Boston Celtics: Schroder, Smart, Tatum, Grant Williams, Robert Williams https://t.co/bVWH4AMCA2",
    "79": "@celtics Made of glass",
    "80": "@utahjazzman47 @monilogue @celtics Don’t get me wrong, I love Clarkson, but if you can sacrifice a little bit of offense to become a better perimeter defending team, I think the Jazz are 100% the favorites out of the west",
    "81": "@celtics Did anyone think he actually would play. Dude is pure glass",
    "82": "@celtics Be better next time and rest a player until hes 100% healthy",
    "83": "@Noah_Sayed529 @celtics You have no body parts left to give",
    "84": "@celtics jesus christ bruh trade this mf",
    "85": "@celtics Pain",
    "86": "@celtics fantastic",
    "87": "@celtics Take my ankle",
    "88": "#NEBHInjuryReport Ime Udoka confirms that Romeo Langford (right ankle sprain) will not play tonight in Portland.",
    "89": "So excited i get to see the @celtics play tonight !!",
    "90": "@utahjazzman47 @monilogue @celtics Give the ball to Mitchell, Space the floor with Gay and O’Neale, and run the PnR with Gobert… unstoppable",
    "91": "@celtics Good",
    "92": "@celtics He looked far from healthy against the sixers, keep resting him",
    "93": "@GabrielBodily @monilogue @celtics Yeah, including the Jazz lol",
    "94": "@Noah_Sayed529 @celtics They can take my right ankle then",
    "95": "Ime Udoka says Jaylen Brown really fought hard to play tonight but the team is taking \"the big-picture approach\" with his hamstring.",
    "96": "@utahjazzman47 @monilogue @celtics Bro no way, Marcus Smart would make us true title contenders. Imagine a lineup of Smart, Mitchell, O’Neale, Gay, Gobert… Nobody is scoring on that lineup",
    "97": "@celtics You took Williams out of the game with 4 minutes left defense went out the window 2 dunks a layup drive and 3 pointer ball game over",
    "98": "@celtics Take My back and hamstring plz",
    "99": "@GabrielBodily @monilogue @celtics Because Clarkson helps the Jazz win more than Marcus Smart",
    "100": "@celtics hi! It is my birthday today, I was wondering if as a birthday gift you could be good tonight and preferably win the game. We will be watching you! (Also my name is trèfle which means clover like your logo if that can help☘️) thank you!",
    "101": "@Redvizsla @JohnnyH004 @taylorcsnow @jaytatum0 @celtics @Stathead I’m now actually thinking if you combine Kanter’s offense/rebounding with Baynes defense you get a better big man than Brook Lopez, even if the 3 ball isn’t a consistent weapon.",
    "102": "@CamWoodsville @celtics @trailblazers Just like you… https://t.co/gkoX71tSGf",
    "103": "Damian Lillard traded to the Boston Celtics in H.H.’s latest piece #NewsBreak  https://t.co/3REJtOjOYJ",
    "104": "@BeeeeJ_ @celtics Idk if I told you but from now on im only counting it as a win if they win by 10. Im tired of all this close game bs. We need to be blowing niggas out the water.",
    "105": "Boston Celtics Daily Links  12/4/21 https://t.co/gLttyOVxmU https://t.co/tCjeo7jEb0",
    "106": "@Paul_Wiggle A win tonight would count as the first session @celtics",
    "107": "@BBW_Candi @celtics @trailblazers They both sorry",
    "108": "@celtics you are giving me and @BeeeeJ_ depression",
    "109": "@GabrielBodily @monilogue @celtics I say no",
    "110": "@celtics Take my right hamstring, take my back, and take my right ankle and take @Noah_Sayed529 if you need it",
    "111": "🏀 Boston Celtics(-1.5) @ Portland Trail Blazers(+1.5)\n\n⌚ 10 PM ET\n\nO/U: 211.5\n\n📋 Under is 7-1-1 in Celtics last 9 road games.\n\nBet BTC ➡️ https://t.co/spMiJIgrUb\n\n#NBATwitter #NBAPicks #SportsBetting #GamblingTwitter https://t.co/EQRXJUY9s9",
    "112": "@monilogue Clarkson for Smart straight up rn what do you say @celtics ?? https://t.co/KQRM0fTQ1W",
    "113": "Boston Celtics ML vs Portland Trail Blazers @ 2.08 LOW",
    "114": "@DB82152020 @celtics It doesnt matter what their record is. You arent playing where you can risk a torn hamstring. That aint soft its smart",
    "115": "Down from Alaska to see @celtics  at the @ModaCenter #BleedGreen https://t.co/mT6YIqyeqo",
    "116": "@BSolomonsHood @celtics If “tightness” some huge issue nowadays then the world is going soft. Sorry. Especially when they’re coming off an L and have basically a .500 record. The team needs them out there",
    "117": "Boston Celtics | City Edition 2021/22 🍀🟢\n\nSwingman por R$200,00\nAuthentic por R$350,00 https://t.co/dQJtvI8G5K",
    "118": "@DB82152020 @celtics Yeah imagine either having a hamstring issue",
    "119": "@celtics Are we ever gonna have a full roster fit for a couple of games in a row",
    "120": "@celtics Imagine Pierce or KG sitting out because of “stiffness” or “tightness”? Yeah neither can I 😂",
    "121": "@Burner06137507 @celtics once again, typical marcus smart hater https://t.co/lZyNVYlpVa",
    "122": "@neveesque @jussayinpodcast @varun_garg21 @celtics atleast we won it",
    "123": "@taylorcsnow @jaytatum0 @celtics @Stathead Sheesh all I saw on timeline was get rid of him from the fake Celtics fans.",
    "124": "Have you seen today’s deal yet?\n\nCheck https://t.co/nViTeRGhJT every day to see what new deal has been unlocked. https://t.co/oWJQDAgo8Y",
    "125": "@JohnnyH004 @Redvizsla @taylorcsnow @jaytatum0 @celtics @Stathead @JSalomonsGhost we’ve got a toddler with a severe intellectual disability in the house.😂",
    "126": "@celtics Moral victories. Fantastic",
    "127": "@JohnnyH004 @Celtics_PRam @Redvizsla @taylorcsnow @jaytatum0 @celtics @Stathead Johnny, your 5 followers wont be impressed by this bad bad bad take",
    "128": "Boston Celtics at Portland Trail Blazers   Game #24   12/4/21 https://t.co/Ldf9APn87V https://t.co/Jqqx5bVH4i",
    "129": "12/4 Free Pick🚨\nNBA\nBoston Celtics ML\n\n#sportsbetting #handicapper #GamblingTwitter https://t.co/AjxjNvgAco",
    "130": "Everyone needs to step up and help out! We are better than this ! @celtics  let’s go! https://t.co/jaXgmZCT23",
    "131": "Back BOSTON CELTICS to BEAT Portland Trail Blazers tonight in the @NBA (Game Starts at 03.10 GMT) #NBA #Basketball",
    "132": "@bcelts_ @celtics @trailblazers Nope. Not anymore",
    "133": "@BBW_Candi @celtics @trailblazers 😭 gotta fire stick?",
    "134": "@BroncoRob @HonestLarry1 @celtics I want to say he made all nba in 91 w the bullets. At the least, an all star game w them",
    "135": "@celtics Tatum vs McCollum, decent matchup no cap",
    "136": "Why ya not showing majority of these games like I would love to see my @celtics play the @trailblazers but I’m not buying no league pass bruh 😒",
    "137": "@JohnnyH004 @Redvizsla @taylorcsnow @jaytatum0 @celtics @Stathead How are you this dumb?\n\nAllen Iverson, one of the fastest players to ever play the game, said 34-38 year old Stockton was one of the toughest guys he ever had to score on.\n\nStockton would be one of the best defensive PG’s in the game right now. This is not even debatable.",
    "138": "@celtics Should bring up some @MaineCeltics players since they're playing some winning basketball (7-1 record). 👀 #BleedGreen #crustaceannation🦞",
    "139": "@celtics Not ideal",
    "140": "@taylorcsnow @jaytatum0 @celtics @Stathead Tatum’s got a lot of games left to break Bird’s record.",
    "141": "🏀🎄\n\nChicago Bulls +2.5\nMemphis Grizzlies -2.5 🔥\nSA Spurs +9 🔥\nLA Clippers -1.5\nBoston Celtics PK",
    "142": "Boston Celtics to face Portland without Jaylen Brown, Al Horford #BostonCeltics #InjuryUpdate #PortlandTrailBlazers https://t.co/VfVF8lD6Sc",
    "143": "@celtics Christ 🥲",
    "144": "BOSTON CELTICS (GREEN) 59FIFTY now available from 4UCAPS\n\n#newdrop #4ucaps #nba #bostonceltics #celtcics #boston #massachusetts #celtics #green #59fifty #hatcrawler #neweracap #fitted #5950 #hat #thecaptheproswear #hatcollector #caps\n\nhttps://t.co/w2BI3brnDK",
    "145": "@MalcolmWillie95 @celtics I was begging the Celtics to rest him at the end of last yr...then dude went and did the Olympics...lol",
    "146": "If the @celtics or the @Patriots reply to this tweet I’ll either buy a Tatum Jersey or a Mac Jones jersey… #BleedGreen #JaysonTatum @jaytatum0 #Patriots #MacJones @MacJones_10",
    "147": "Three potential trade targets for the Boston Celtics who might be available after 12/15 https://t.co/2WUoA1lqm5 via @thecelticswire  Omg I just heard a scary rumor! Kyrie is interested in being traded back to Celtics?NOOOOO! It appears he had a lover quarrel wKD.Only in the NBA!",
    "148": "@celtics @trailblazers @NBCSBoston @985TheSportsHub Do we even have a chance without Brown and Al Horford?",
    "149": "Portland Trail Blazers - Boston Celtics\nPortland Trail Blazers ML (1.90)\nComeon/2 units",
    "150": "🚨🚨🚨BANGING #NBA BETTING CARD🚨🚨🚨\n\nBoston Celtics to win @ 1.95 ($100)\n\nKyle Lowry U7.5 Assists @ 1.85 ($100)\nJaren Jackson Jr. O17.5 Pts @ 1.95 ($100)\n\nLET'S END THE NIGHT WITH A GREAT SWEEP🤑🤑🤑🤑\n\nRT/FAV FOR GOOD LUCK🔥🔥🔥\n\n#GamblingTwitter https://t.co/KWNnLKYaxe",
    "151": "@celtics nice dude WTF",
    "152": "@JadenHours_ @celtics Or for some guys able to suck it up a little",
    "153": "@celtics Questionable stop it we know Romeo not playing",
    "154": "@2_libras @celtics Good point. He’s extremely durable.",
    "155": "@KoTW_Origins @celtics Literally the worst bench in the association bruh stop it lol",
    "156": "@2_libras @celtics Been saying this for a while",
    "157": "@water_fan1 @2_libras @celticsideline @celtics Not even",
    "158": "@theCyberZon @Jate57 @celtics Same thing some of y'all said before we played against Spurs \"rest them Spurs are bad and missing some key players\" lol",
    "159": "@celtics Masked pp https://t.co/Yr7GHamAmk",
    "160": "@celtics He’s absolutely right. Especially when your opponent shoots 51 3 pointers and hits 52% of them. 😂",
    "161": "@celtics @trailblazers @NBCSBoston @985TheSportsHub Let’s get this dub 🍀!",
    "162": "Don't miss #RipCity tonight!\n\nCoverage begins tonight at 6:30 PM PT as the @trailblazers host the Boston Celtics on ROOT SPORTS 🏀📺\n\nAlso, catch a new episode of Trail Blazers Courtside at 6:00 PM PT. https://t.co/b9TIAJeTfU",
    "163": "Portland Trail Blazers Predictions and Preview for 12/4/2021 hosts Boston Celtics.  Find out who we are taking in this matchup. #Picks #NBATwitter https://t.co/gVXwz7qTac",
    "164": "Go get Sabonis @celtics https://t.co/210qv40F3n",
    "165": "Trail Blazers Game Notes: Boston Celtics (12-11) vs. Portland Trail Blazers (11-12) https://t.co/Pz60cQl3NC https://t.co/u2nqDtuI6d",
    "166": "@celtics Big Al deserves a break, need the squad to hold it down for him",
    "167": "Boston Celtics visits Portland Trail Blazers Predictions and Preview for 12/4/2021 today.  Who are we taking in this game?  Find out now. #Picks #NBATwitter https://t.co/gVXwz7qTac",
    "168": "@Sullyrecruiter @taylorcsnow @jaytatum0 @celtics @Stathead Agreed",
    "169": "@celtics @trailblazers @NBCSBoston @985TheSportsHub We can’t stay healthy for a week!",
    "170": "@DalinIngrid Brooklyn nets \nMiami Heat \nGolden state \nMemphis \nBoston celtics \nSacramento kings",
    "171": "So enjoyed watching @nuggets #NikolaJokic today @TheGarden  \nAn @NBA player \nthat does it all 🏀 \nWish he was on my @celtics \nWatch his no look pass 👀 \nhttps://t.co/3Tipkf1ZJA",
    "172": "@celtics Ime uses the starters a bit too much for my liking, should go deeper into bench…..Al’s hot start is great and all but he’s 35 and needed in April",
    "173": "@JohnnyH004 @Redvizsla @taylorcsnow @jaytatum0 @celtics @Stathead Jordan, Moncrief, DJ, Mo, Stockton &amp; Dumars \n\nMUCH &gt; than\n\nSmart, Pat Bev, Simmons, Jrue, Butler &amp; Thybulle\n\nKawhi, George, Dray, Giannis &amp; Bridges\n\nprobably = to\n\nPippen, Rodman, Cooper, McHale, Buck &amp; Bobby J\n\nGobert, AD, Bam &amp; Embiid\n\n&lt; than\n\nDream, Eaton, Ewing, Parish, Tree",
    "174": "Let's Go @celtics!  #BleedGreen #mylocalma https://t.co/RAOzd21ICT",
    "175": "@water_fan1 @2_libras @celtics You’re very naive to believe the Jazz would want to part with Mitchell. It would be more like JB, 2 firsts, plus a young player. Successful teams aren’t just gonna give up their cornerstone, that also means the Celtics with JB.",
    "176": "Through provocative art on his footwear, the Boston Celtics' Enes Kanter rebuked the Los Angeles Lakers' LeBron James for his self-serving attitude toward \"social justice\"...\nhttps://t.co/Aa9CfZVDQS https://t.co/WraycagUIT",
    "177": "@celtics Not good 🤦🏻‍♀️",
    "178": "@frostybias @HonestLarry1 @celtics Wow!! I don’t even remember Red trying to sign him but I agree. He would have been great on those late 1980’s @celtics teams!! Even after his terrible injury he was scoring over 20 points a game for Bullets!!!!",
    "179": "@JohnnyH004 @Redvizsla @taylorcsnow @jaytatum0 @celtics @Stathead Nobody’s “crying” boss. We’re only saying 80’s defense was MUCH tougher and harder to score on than today’s. This is practically irrefutable fact. Any basketball fans who don’t get this are dumb as rocks.",
    "180": "@celtics @trailblazers @NBCSBoston @985TheSportsHub Keep grinding fellas. 💪",
    "181": "@Redvizsla @JohnnyH004 @taylorcsnow @jaytatum0 @celtics @Stathead But Laimbeer is tricky. He’d play today for sure. But would he merely be a fundamentally sound hustle big on offense (like Kanter) mixed with Baynes defense?\n\nOr would he become money from 3 (was solid by early 90’s) &amp; remain an elite rim defender, so a Brook Lopez type starter?",
    "182": "@celtics Imagine if yall rested brown for the 3 games he was daytoday",
    "183": "@celtics @trailblazers @NBCSBoston @985TheSportsHub See you there :)",
    "184": "@Redvizsla @JohnnyH004 @taylorcsnow @jaytatum0 @celtics @Stathead Laimbeer someone I’ve never decided if he’d be better or worse in the mod game.\n\nObviously most 80’s stars would be better today. Since most had speed, skill &amp; good jump shots.\n\nThen of course you have bench guys like Quinn Buckner &amp; Greg Kite who wouldn’t be in the league today.",
    "185": "Couple more for this evening\n🏒@Capitals in reg\n🏀@celtics (ml)\n\nBest of luck to everyone tonight.\n#GamblingTwitter #Sports #sportsbets https://t.co/vS5NIfhP5A",
    "186": "@celtics @trailblazers @NBCSBoston @985TheSportsHub Don’t let them make 300 threes",
    "187": "@BroncoRob @HonestLarry1 @celtics He had a chance to sign w Celtics for 87-88 season I do believe. Met w Red. Would’ve helped",
    "188": "TONIGHT ☘️ Celtics at @trailblazers \n\n⏰ 10PM\n📺 @NBCSBoston\n🎙 @985TheSportsHub \n\n#BleedGreen https://t.co/OaA09X6DUb",
    "189": "@Redvizsla @JohnnyH004 @taylorcsnow @jaytatum0 @celtics @Stathead I think Tatum is a guy who would eventually adjust to put up Alex English numbers. Same with KD. He’s so skinny, but would still shoot right over most D’s.\n\nI think someone like Harden would have a real tough time &amp; end up only being like Purvis Short or World B Free in the 80’s.",
    "190": "@Redvizsla @JohnnyH004 @taylorcsnow @jaytatum0 @celtics @Stathead I won’t say Tatum would score 5 a game. Like most guys today he’d simply see his stats decrease across the board if time machined back to the 80’s. Would have to toughen up &amp; adjust.\n\nBird meanwhile would OBLITERATE the modern game if time machined from 1980 to say 2013.😂",
    "191": "@HonestLarry1 That was a great series that I was so happy about @celtics winning but Bernard King was a handful before injuries derailed the great career he was having.",
    "192": "@Jate57 @celtics Who cares let them get an extra day off lillard not even playing. This way their ready for the back to back la games",
    "193": "🙏🏀🥋\n#FreePicks #SenseiSam \n\n🧨Boston  Celtics ML  🧨\n@celtics #BleedGreen\n\nKings 🆚️ LA Clippers\n🧨Under  221 🧨 -130 \n@SacramentoKings @LAClippers \n#SacramentoProud #ClipperNation \n\nRetweet 🏀‼️‼️\n@PicksCity",
    "194": "@Sullyrecruiter @andygocuse @taylorcsnow @jaytatum0 @celtics @Stathead Yup. Top 10 lock no debate allowed.\n\nTop 5 debatable depending on what you value as the individual fan (peak, longevity, era, titles, records, etc.) and typically your age creates bias here too.",
    "195": "@2_libras @water_fan1 @celtics He’s literally on one of the most team friendly deals in the league, the separation between him, Beal and Kat is not much. You’d have to throw extra assets to get a little better. Not worth it.",
    "196": "@JohnnyH004 @Redvizsla @taylorcsnow @jaytatum0 @celtics @Stathead Wow, simply…wow.😳\n\nMost of us love Tatum, while being smart enough to realize he’s currently flawed, has a way to go, and is nowhere near Bird, even at the same age.\n\nBut if you think Tatum’s faced tougher defenses than Larry you’re delusional and shockingly NBA illiterate.😁 https://t.co/vwHN3GE4Qr",
    "197": "@celtics Celtics bout to let Freedom ring in Portland",
    "198": "@trailblazers @celtics @ModaCenter @ROOTSPORTS_NW @RipCityRadio620 Tonight I'm not watching",
    "199": "@water_fan1 @2_libras @celticsideline @celtics Don wants to play with JB. \nThis arguement doesnt make sense.",
    "200": "@celtics not al but thank god they sitting out jaylen",
    "201": "@TheMrad_ @celtics It’s not just that, it’s the fact the significant injuries are happening to our most important players. It’s never just some random bench player",
    "202": "@MasonKessel @celtics Yeah I thought somebody got hurt in the sixers game but I couldn’t remember who",
    "203": "@Jate57 @celtics Nah actually like 3 and a half quarters",
    "204": "@celticsideline @water_fan1 @celtics If he still commands top dollar...you gotta explore it...we talking Beal, KAT, etc...",
    "205": "Tap in to the best @celtics coverage on @TwitterSpaces with my friend @ReesRebel31✊🏾\n\nWith #CelticsFullCourt live on #HoopSpaces 💯\n\nRetweets are appreciated 🙏🏾\n#BleedGreen \n\nhttps://t.co/ZWHMzpMIS0",
    "206": "Best birthday present made by @zenibuka. Here comes my hero @celtics @celticsfr ! https://t.co/GJ4DWjKv3q",
    "207": "@FantasyLabsNBA Anybody get injured the Boston Celtics 😕🤢🤢🤮🥶🤬🤬😡 https://t.co/Z0v51QLVUz",
    "208": "@kratsit_ @celtics Built different",
    "209": "@water_fan1 @celtics That literally just wouldn’t be smart lol",
    "210": "@celtics Man wtf",
    "211": "@celtics grant dropping 34 tonight",
    "212": "@FanficsUtahJazz @celtics graciass",
    "213": "@Celtics_PRam @andygocuse @taylorcsnow @jaytatum0 @celtics @Stathead Bird’s top ten all time probably top 5",
    "214": "@celtics GRANT TIME BABY",
    "215": "@JohnnyH004 @Celtics_PRam @taylorcsnow @jaytatum0 @celtics @Stathead You have absolutely no clue how hard they got hit in the 80's.  Rudy is a pastry puff compared the the bigs back then.  A foul back then would get you suspended nowadays..  no camparison on the physical level of play in the paint today..",
    "216": "@celtics Come on Jaylen",
    "217": "NBA ML. Date: 12-04\nBoston Celtics vs Portland Trail Blazers. 2.5%\nBetMGM. Celtics @ +105\nFOX Bet. Blazers @ +105\n#arbitrage #bettingtwitter #bettingpicks #sportsbets #freepicks #freemoney #mlb",
    "218": "@DanKelley66 @MaineCeltics @nbagleague @celtics It’s so when people play in the G league the Celtics can say “look you’re still playing for the Celtics”",
    "219": "@celtics Makes sense. Rest Horford. Rob, Grant And FREEDOM will lead us",
    "220": "@celtics Oh come on!!!",
    "221": "@celtics We stayed fully healthy for a whopping 4 quarters",
    "222": "@celtics Every season we deal with significant injuries. Why can’t we have nice things",
    "223": "@celtics I will be at the game tonight",
    "224": "@celtics Lillard out",
    "225": "@celtics Again 💀",
    "226": "@celtics Time to devlope other players 😥😥😥",
    "227": "@celtics Uh oh.. al horford?",
    "228": "@lemontaaart @celtics Dm me for this ratio",
    "229": "@celtics Damm injury report always fill with injuries",
    "230": "@celtics Yikes",
    "231": "@celtics how to ruin my day 101",
    "232": "#NEBHInjuryReport vs. Portland: \n\nJaylen Brown (right hamstring tightness) - OUT\nAl Horford (low back stiffness) - OUT\nRomeo Langford (right ankle sprain) - QUESTIONABLE",
    "233": "@Freedom33453 @celtics Nothing to do with basketball",
    "234": "@taylorcsnow @jaytatum0 @celtics @Stathead And a major difference between the two. One was a fierce competitor, team player and driven to win. The other is not even close! Larry would straighten Tatum out or destroy him on the court.",
    "235": "@JohnnyH004 @Celtics_PRam @taylorcsnow @jaytatum0 @celtics @Stathead Can you just image how Mr. Marshmellow ( JT) would fare against Bill Laimbeer fouls...  Right, more like 5 ppg.",
    "236": "@trailblazers @celtics @ModaCenter @ROOTSPORTS_NW @RipCityRadio620 That ripcity logo goes hard",
    "237": "@TimAsheVT @NBA @Nike @celtics Spot on!",
    "238": "Good on Bob Costas for stating the obvious - the IOC has a thing for authoritarian regimes. And the @NBA and companies like @Nike are right there with them. I didn't know the @celtics are off Chinese tv because of Enes Kanter's criticism of China's rights abuses. So gross. https://t.co/noRXbA7wms",
    "239": "@trailblazers @CHold @celtics @ModaCenter @ROOTSPORTS_NW @RipCityRadio620 Yeah, you might as well celebrate something nobody gives a damn about... when your team sucks and management is in shambles!!! 🎊🌸🎉🌺",
    "240": "@trailblazers @celtics @ModaCenter @ROOTSPORTS_NW @RipCityRadio620 Massive thanks to you guys for being inclusive. You have my upmost respect. Go blazers!",
    "241": "@Tyler1Chad @celtics that would be good. probably gonna part with nemsith pritchard romeo and picks but i like it.",
    "242": "@BasketB0t @celtics true. could also try trading for Terrence Ross or Josh Hart or a package for Sacramento Kings: Buddy Hield and Marvin Bagley.",
    "243": "Dennis Schroder Signs One Year Contract With The Boston Celtics https://t.co/7XiCO0p3wL via @YouTube",
    "244": "🏀 #NBA\n\nBoston Celtics 🆚 Portland Trail Blazers\n📆 Dom 5 dic 04:10\n\n#Raspibets #FreePicks #FreeTips #StatBets #SportsBetting #BettingTipster #BleedGreen #RipCity\n🆓🔎📈⬇ https://t.co/cAUwDGXEPG",
    "245": "@Tyler1Chad @celtics all im saying is we need shooting",
    "246": "@Tyler1Chad @celtics TPE and he can still shoot and defend",
    "247": "@BasketB0t @celtics he's washed bro and averaging 20+ mil next two seasons",
    "248": "Boston Celtics vs Portland Trailblazers 12/4/2021 Picks Predictions Previews\n\nhttps://t.co/OKGSZpwRpf\n\n#NBAparlay #NBAbetting #NBA #NBApicks #NBAprediction #odds #picks #sportsbetting #handicapper #sportspicks #basketballpicks #expertpicks #freepicks #Celtics #Trailblazers https://t.co/GNdq3lcIvi",
    "249": "If I’m the @Celtics I’d legit go for Eric Gordon from the rockets for romeo",
    "250": "#BleedGreen\n@celtics\n#セルティックス\n#ボストン・セルティックス\n\n#BullsNation\n@chicagobulls \n#ブルズ \n#シカゴ・ブルズ \n\n#DubNation \n@warriors \n#ウォーリアーズ \n#ゴールデンステート・ウォリアーズ \nFight🔥✊🏾 https://t.co/1a1NsYvNBw",
    "251": "WATCH: How can the Boston Celtics improve their offense moving forward? https://t.co/73aV29Xdt5",
    "252": "@youngboynotmid @LordBrOFFICIAL @celtics JIMMY AND DONAVAN OWN UR FRANCHISE https://t.co/aQhW0Xq5gQ",
    "253": "If analytics didn't already exist, they'd be invented to try and explain what's happening with this Boston Celtics team.",
    "254": "@GwashburnGlobe @BostonGlobe I think the Boston Globe is out to destroy the Boston Celtics !",
    "255": "We didn’t have bronny James playing calm down @celtics 🙄🙄🙄 https://t.co/2Zfd2S0tca",
    "256": "@trailblazers @celtics @ModaCenter @ROOTSPORTS_NW @RipCityRadio620 Please be committed to game play.  Show some life and enthusiasm out there.  Forget everything going on outside and just play the game you are supposed to love.  Play for eachother, play for yourself.  Turn up the 🔥!",
    "257": "@trailblazers @celtics @ModaCenter @ROOTSPORTS_NW @RipCityRadio620 Hopefully we take some pride in defense",
    "258": "@Celtics_PRam @JohnnyH004 @Redvizsla @taylorcsnow @jaytatum0 @celtics @Stathead Larry was playing plumbers",
    "259": "@EnesFreedom I support you. But you and the @celtics need to win tonight. We lost yesterday",
    "260": "@whocares2739 @celticjdavis @StoolGreenie Look at his %s. That is the only metric I need to make the statement, Tatum's efficiency is hurting the Boston Celtics. No Celtic fan would tell you different. No basketball fan would tell you different. You are the only one on the planet who thinks those 2 things are unrelated.",
    "261": "@Sullyrecruiter @andygocuse @taylorcsnow @jaytatum0 @celtics @Stathead Correct\n\nAnd no chance of EVER being greater than peak Bird.",
    "262": "Boston Celtics at Portland Trail Blazers odds, picks and prediction https://t.co/GR23m5N8AL",
    "263": "@celtics STOP SWITCHING ON EVERYTHING",
    "264": "@jtavarez_ @SLAMonline @celtics Nothing much we can do with a team of zenners",
    "265": "@celtics Freedom?? How Ironic for a Zionist! 🤔 https://t.co/At7p0gGpUy",
    "266": "@celtics Freedom?? How Ironic for a Zionist! 🤔 https://t.co/At7p0gGpUy",
    "267": "@LordBrOFFICIAL @ja_owns_curry @celtics own that jobless freak 🤣🤣",
    "268": "@Redvizsla @taylorcsnow @jaytatum0 @celtics @Stathead Couldn’t agree more",
    "269": "@celtics can we get a dub tonight and can coach Ime play Robert Williams in the last 2 minutes when we can’t get a rebound or a defensive stop ?",
    "270": "@taylorcsnow @jaytatum0 @celtics @Stathead I'm not talking about Tatum but we're trying to polish a tennis shoe.",
    "271": "The Boston Celtics play basketball today #BleedGreen https://t.co/nuFFd5QYj7",
    "272": "😂😂😂 gonna get drafted 6th round by the Boston Celtics too https://t.co/8aPhSOKlbl",
    "273": "\"It's not just about (individual) statistics. It's about helping your team become a #WinningTeam.\"-C.\n#BostonCeltics (12-11) at #PortlandTrailblazers (11-12), tonight, 7pm. Watch game on following channels: #NBA; NBA League Pass; NBA Sports Boston; Roots Sports Northwest. https://t.co/2ujyJAw81L",
    "274": "🏀 Episode 10 is LIVE 🏈\nThe boys are back at it with another 🔥 episode covering:\n- @redsox WTH are they doing?\n- @celtics back on track?\n- @patriots keep on rolling\n- Another #FantasyFive\n- Week 13 @NFL picks\n- Top 5: Guilty Pleasure Songs! \n\nLinks in bio! Don't miss it!",
    "275": "@celtics Was a fun game to watch! We played the right wayy which is most important! Jazz were better team last night that’s all!",
    "276": "These 2 Boston Celtics Most Likely to be Traded 👀\n\nhttps://t.co/O8nOT6wi9D",
    "277": "@celtics Utah got lucky wit that dub.",
    "278": "Watch the @MLOA2K 99League Season 7 MATCHUP between the @BrooklynNets and the @celtics !\n\n@DGOZ_ | @Dmv_Scott \n\n🖥: https://t.co/OgEPjqSEnM\n\n#99LeagueSeason7",
    "279": "This shirt will look good on all #Americans #Freedom11 #BostonCeltics #NBA #EnesKanterFreedom @EnesFreedom https://t.co/gd2zeBJmuu",
    "280": "@celtics Once again Pritchard did not play and Freedom a few minutes. This coach sucks",
    "281": "@taylorcsnow @jaytatum0 @celtics @Stathead What’s the total number of Celtics players to have THREE 35 point games?",
    "282": "@JohnnyH004 @Redvizsla @taylorcsnow @jaytatum0 @celtics @Stathead Larry was in the league at 22 years 309 days.\n\nTatum is 23 years 276 days old today. So almost an entire year older.\n\nI know man, math is tough.😉\n\nLarry won a title at 24 years 170 days. Tatum’s got this year only to win a chip at a younger age. We’ll see. Go Celtics!",
    "283": "That’s @Grant2Will @celtics https://t.co/hWoDsKUBv2",
    "284": "I have a better idea how about we trade the Boston Celtics to Seattle https://t.co/E0AgcPzR3k",
    "285": "@cflat_27 @rebelstar83 @celtics The way these teams rest players every game combined with legitimate injuries and covid, the Celtics could end up 4th",
    "286": "@trailblazers @celtics @ModaCenter @ROOTSPORTS_NW @RipCityRadio620 What’s the acronym stand for?",
    "287": "@AFehsy @celtics He used all of his hops on that play",
    "288": "@jwc292 @rebelstar83 @celtics They are not even close to a 4 seed.",
    "289": "Today's NBA Consensus (So Far):\n\nNew York Knicks 68%\nGolden State Warriors 68%\nMilwaukee Bucks 65%\nLos Angeles Clippers 64%\nBrooklyn Nets 62%\nMemphis Grizzlies 56%\nBoston Celtics 53%",
    "290": "Boston Celtics centre Enes Freedom — a journeyman NBA veteran who is one of the sports world’s fiercest critics of human rights abuse — is challenging NHL stars Sidney Crosby and Connor McDavid to boycott the upcoming Winter Olympics in Beijing @CBCNews \nhttps://t.co/w6HcctxgZd",
    "291": "@McDNBA But can’t believe Washington and Cavs have a better record then the @celtics unF$&amp;king Believable man. This is how I feel about my team rn 👇 https://t.co/UBBoBO1Knu",
    "292": "Boston Celtics",
    "293": "@Celtics \n\nif you win you win if not hey it's a fun sport we get paid to play so if we win we win cool if not we still get paid\nCool\nYa know \nHaha smh",
    "294": "@celtics Get well, Romeo!",
    "295": "@celtics Bellicheck would never speak like that. It’s embarrassing.",
    "296": "@celtics @J_Rich1 Best shooter we have.",
    "297": "@trailblazers @celtics @ModaCenter @ROOTSPORTS_NW @RipCityRadio620 So only a nine point defeat tonight?",
    "298": "Celtics.tez @celtics @tezos listing https://t.co/Fpw9nGcu1Q",
    "299": "@trailblazers @celtics @ModaCenter @ROOTSPORTS_NW @RipCityRadio620 Can't wait for the games to be on a network @dish supports!",
    "300": "@celtics Celtics have become such a pathetic team that such statements are now acceptable",
    "301": "Someone wanna buy Kobe.tez?  I have celtics.tez, Lamelo.tez, pistons.tez and Durant.tez plus others listed on secondary.  Get your fav routing domain before it’s gone 😁 @celtics @kobebryant @MELOD1P @DetroitPistons @KDTrey5 https://t.co/Msg2nCABSZ",
    "302": "22:00 –🏀NBA\nMiami Heat x M. Bucks\nNBA LEAGUE PASS\nChic Bulls x Brooklyn Nets\nNBA LEAGUE PASS\n22:30 – Memphis Grizzlies x Charlotte Hornets\nNBA LEAGUE PASS\nSA Spurs x GS Warriors\nNBA LEAGUE PASS\n00:00 – Boston Celtics x Port Trail Blazers\nESPN, WATCH ESPN, STAR+ e NBA LEAGUE PASS",
    "303": "@J4CKYL3GS @celtics It's all about winning a basketball game and not settling for a Loss.",
    "304": "Analyzing Saturday’s Boston Celtics at Portland Trail Blazers odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/ANhJU0m37S",
    "305": "Boston Celtics at Portland Trail Blazers odds, picks and prediction https://t.co/yH8QmsYGlG",
    "306": "@celtics Celtics in 5",
    "307": "\"High praise from Brad Stevens on rookie Semi Ojeleye: “He can be elite defensively, if …\"\n\nhttps://t.co/Bo9oe1huCs\n\n[via r/bostonceltics Dec 04, 2017 #Celtics]",
    "308": "\"REMEMBER WHEN LIL B SAID BEFORE THIS NBA SEASON STARTED THAT THE NBA BOSTON CELTICS HAVE …\"\n\nhttps://t.co/gwFA0sxDLW\n\n[via r/bostonceltics Dec 04, 2017 #Celtics]",
    "309": "@trailblazers @celtics @ModaCenter @ROOTSPORTS_NW @RipCityRadio620 Let’s celebrate a W",
    "310": "@trailblazers @celtics @ModaCenter @ROOTSPORTS_NW @RipCityRadio620 I’m PROUD that you finally fired Olshey! Woo hoo!",
    "311": "New on BSJ: Boston Celtics lit the fuse, and Utah Jazz bombed away at a historic rate\n https://t.co/p1TJxAUIHk",
    "312": "@trailblazers @celtics @ModaCenter @ROOTSPORTS_NW @RipCityRadio620 Another loss",
    "313": "@celtics New coach",
    "314": "@katakurance @cire_PS31 @celtics You said it for me lol. The bench is getting almost 30 a game and that’s with Shroeder starting!!!🤦🏾‍♂️",
    "315": "Tonight we celebrate Pride! \n\n🏀 #RipCity vs @celtics \n🏟 @ModaCenter\n🕰 7:00PM\n📺 @ROOTSPORTS_NW\n📻 @RipCityRadio620 https://t.co/3TQnNdcUUw",
    "316": "What will the Bill Russell rookie card sell for? @celtics @Topps @tdgarden @PSAcard",
    "317": "We are quickly approaching the @RealBillRussell personal collection Live Auction! Join us December 10 at 12pm EST @tdgarden! Spectacular items like this @Topps 1957 #77 rookie card are included! @celtics https://t.co/pkVA5DBn83",
    "318": "@celtics MARCUS SMAHT",
    "319": "@BurkeGerald @celtics well the first two never coached with a three point line and the other three coached in an era where a team attempting 27 threes would be unheard of, let alone making that many. i think it’s hard to compare",
    "320": "This was one of the best offensive games that the Boston Celtics cashed in so far this season. Al Horford was quite close to a triple-double in this contest. Big Al really had to step up with Robert Williams only playing 15 minutes. So what he did was drop 21p, 6r, &amp; 9a https://t.co/R1KWihSQhQ",
    "321": "Point Tatum https://t.co/ApeiwJuvuO #celticsstrong #nba #bostonceltics",
    "322": "@balldontstop @celtics What CAN be done aside, Clarkson came with a bag full of what SHOULDN’T be done",
    "323": "@spizzyspose @celtics Just once I want to know the wonders of and have the luck of being one of the couple healthy teams at the end of the season. JUST ONCE🙏🏽 you start to realize how rare it is and fortunate you have to be to make it that far unscathed",
    "324": "As a thank you for the feature about my new song @Green_Footballs I’d like to give you a behind the scenes look into this why I carried a football in this video but I literally have no idea.The joke about not knowing about sports is on me in the end! @celtics @NHLBruins @Canucks https://t.co/mFTBjRRbZL",
    "325": "@taylorcsnow @jaytatum0 @celtics @Stathead And still took an L.",
    "326": "@jarcar101 @celtics your takes arent good lmfao they played a good game they just hit everything...",
    "327": "@jarcar101 @chefboyarri @celtics its december 4th...",
    "328": "@celtics Anyone who is mad at this statement by Ime... I have a GIF for you. See below.. https://t.co/yYPNVEmU5H",
    "329": "@celtics Did not know smart could get up like that!",
    "330": "@celtics The only tweet I actually don’t mind Udoka saying when we lose. This is facts.",
    "331": "Donovan Mitchell hit the dagger three to secure the victory for the Utah Jazz over the Boston Celtics Final 137-130. #UTAvsBOS \n\nMitchell 34P/6A The Jazz closed out the game by making nine of their final 11 shots. \n\n https://t.co/dRaaMomcpv",
    "332": "@SLAMonline @celtics Means nothing without a win 😕",
    "333": "@celtics We need JB to come back in full form if we want to have any chance of making noise in the playoffs.",
    "334": "@NBA @jaytatum0 @celtics Great job!",
    "335": "@taylorcsnow @jaytatum0 @celtics @Stathead Rather see a win any day...Team&gt;Individuals",
    "336": "@celtics I love that the Boston Celtics have become a team that seeks moral victories. How the mighty have fallen.",
    "337": "Celtics (12-11) at Trail Blazers (11-12) Game #24 12/4/21 https://t.co/0OoTHYWyVi #celticsstrong #nba #bostonceltics",
    "338": "@celtics Huh?  Now we’re counting “Moral Victory Wins”?  How many of those do Celts need to make the playoffs?  Just asking…..",
    "339": "@celtics A loss is a loss. Celts suck at finishing games.",
    "340": "Utah couldn’t miss: 10 Takeaways from Boston Celtics-Utah Jazz – ZellaNews https://t.co/e9vo0wdkNT",
    "341": "The in-form McCollum or the free scoring Tatum, who would you have in your side?\n\nCatch the @celtics take on the @trailblazers tomorrow on @MTVIndia, @Vh1India, @VootSelect, and @OfficialJioTV! 📺! 📺\n\n#NBA75 #NBAonMTV #NBAonVH1 #NBAonVootSelect #NBAonJioTV #NBALiveinIndia https://t.co/YndNr5nmiB",
    "342": "@celtics please get this W today",
    "343": "@celtics Is this just another way of saying our defense sucked tonight ?",
    "344": "DasHaus made a bet!\n\nEvent: Boston Celtics vs Portland Trail Blazers #NBA\nBet: Portland Trail Blazers TO WIN +1.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "345": "DasHaus made a bet!\n\nEvent: Boston Celtics vs Portland Trail Blazers #NBA\nBet: Boston Celtics TO WIN -1.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "346": "@NBA_Math No wonder why @celtics struggled to catch up with Jass offensively.",
    "347": "@Townie617_ What is your standard for the Boston Celtics?",
    "348": "@NBAIndia @trailblazers @celtics @MTVIndia @Vh1India @VootSelect @OfficialJioTV Warriors vs Spurs Please 🙏",
    "349": "@rebelstar83 @celtics Exactly the problem……Organization and fanbase totally satisfied being a 4 seed",
    "350": "@Jordaanaaraujo Hello, @celtics. We want a free pass to @felipesalloun!",
    "351": "My hot take is  is going to come back and be ass and the warriors should trade him now but only to the BOSTON CELTICS cause he would literally fuck any other teams chemistry up and since the CELTICS don’t have any to begin there’s nowhere to go but up https://t.co/bP9cmiiWDq https://t.co/gZP4ldpUGh",
    "352": "Encerrado:\n\nUtah Jazz (15-7) 137 x 130 (12-11) Boston Celtics\n\nUTA 📊\nDonovan Mitchell: 34PTS/1REB/6AST\nMike Conley: 29PTS/4REB/7AST/1BLK\n\nBOS 📊\nJayson Tatum: 37PTS/6REB/5AST/1BLK\nDennis Schroder: 26PTS/2REB/3AST/1STL\n\n#NBA https://t.co/dmkv60uvfk",
    "353": "NBA Day 4️⃣6️⃣ 🏀🏀🏀\nDenver Nuggets vs New York Knicks\nChicago Bulls vs Brooklyn Nets\nMiami Heat vs Milwaukee Bucks\nMemphis Grizzlies vs Dallas Mavericks\nSan Antonio Spurs vs Golden State Warriors\nBoston Celtics vs Portland Trail Blazers\nLos Angeles Clippers vs Sacramento Kings",
    "354": "Donovan Mitchell had 34 points and six assists to lead the Utah #Jazz over the Boston Celtics 137-130 Friday night. 🏀 #NBATwitter  https://t.co/T9JsHD6F7x",
    "355": "@MaineCeltics @nbagleague @celtics Still don’t get the name change ☘️",
    "356": "@action781 @taylorcsnow @jaytatum0 @celtics @Stathead What",
    "357": "New Crossover pod, with the legend @cedricmaxwell81: On his new book, Larry Bird stories, @celtics concerns, Kyrie thoughts and much more. Superfun conversation.\n\nListen/subscribe: https://t.co/lhCvpA2us5 https://t.co/rXIIved2V4",
    "358": "@arxanii @ATLHawks @celtics @hornets @chicagobulls @dallasmavs @nuggets @warriors @LAClippers @Lakers @memgrizz @MiamiHEAT @Bucks @PelicansNBA @nyknicks @OrlandoMagic @sixers @Suns @SacramentoKings @Raptors Just feels harsh to include them",
    "359": "@arxanii @ATLHawks @celtics @hornets @chicagobulls @dallasmavs @nuggets @warriors @LAClippers @Lakers @memgrizz @MiamiHEAT @Bucks @PelicansNBA @nyknicks @OrlandoMagic @sixers @Suns @SacramentoKings @Raptors Why tag the magic and kings???",
    "360": "@celtics @KenBellABC6 Hi Ken. Nice story in Globe about breaking up the present group of Celts, claiming they stray best , a mediocre team. They are frustrating to watch, very inconsistent.\n   Enjoyed the lunch the other day. Keep up your great work and your Godly example. In His name.",
    "361": "Boston Celtics @ Portland Trail Blazers\nPick : Boston Celtics.\nBasketball. NBA",
    "362": "@taylorcsnow @jaytatum0 @celtics @Stathead The manifestation of true greatness.",
    "363": "@MTVIndia @celtics @trailblazers @NBAIndia @Vh1India @VootSelect @OfficialJioTV Lets go Blazers",
    "364": "@celtics They put up 140",
    "365": "@magiicrat1967 @celtics if they lost while playing poorly they shouldn't get credit. that's not what happened. they played their best offensive game of the season. they played great defense too but Utah made every single contested stepback 30 footer. sometimes it just isnt in the cards",
    "366": "TONIGHT: @Celtics vs #Trailblazers live from #Portland @NBA #NBA https://t.co/IsTMTUCHMc",
    "367": "The Boston Celtics dynasty was at full steam in 1966. https://t.co/xjCMhU4bpo",
    "368": "@celtics Wow another loss...what a surprise",
    "369": "@spidadmitchell put up 34 PTS as the @utahjazz (15-7) beat the @celtics (12-11) 137-130‼️ #NBA #NBA75 #NBATwitter #TakeNote https://t.co/JnnX2PRNuH",
    "370": "@celtics You guys literally the only sports club that has ads. Wtf",
    "371": "@taylorcsnow @jaytatum0 @celtics @Stathead Please stop comparing him to Larry Bird in any way.  He is not even in any Class with Larry.  At all!!!",
    "372": "For tonight's #NBA matchup between the Boston Celtics and Portland Trail Blazers, @KirkseySports has his #NBA #DFS Showdown Playbook, with a host of great #DFS plays in this game to help dominate your Showdown lineups tonight! 🏀\n\nRead here: https://t.co/K7BRGoQQmh https://t.co/luRSky8AGs",
    "373": "@AProskauer @celtics Yes I did. Amazing how you young fans think losing deserves credit. And it’s a success to make it to conference finals. Go on YouTube and watch old time Celtics to see what real Celtic Pride is. Not these spoiled AAU generation check cashing no defense playing heartless guys.",
    "374": "@andygocuse @taylorcsnow @jaytatum0 @celtics @Stathead I agree Tatum has the talent to be better than Pierce but if you’re trying to win now and you can take Tatum now or Pierce it’s absolutely Pierce",
    "375": "@NBAIndia @celtics @trailblazers @MTVIndia @Vh1India @VootSelect @OfficialJioTV Celtics will win",
    "376": "@JTandJBfan1 @kohltonmiller @KSite_ @celtics Give that bottle to Gibert…literally softest player in the league",
    "377": "@isjanosnba_ @Tyler1Chad @celtics Bro he speaking facts lmao tf u talkin ab",
    "378": "Boston Celtics @ Portland Trail Blazers\n\nPlayer Points Projections\n\nhttps://t.co/7xG0KaCem8",
    "379": "@Tyler1Chad @celtics well it seems like he’s getting paid to do it, but sure - i trust your idea of what a “real coach” is over the conventional “being paid to be a coach” understanding",
    "380": "@AullThat @celtics Yeah there were def moments vs the jazz where we looked like the best possible version of us. But I think wins or losses without jaylen or rob will 3 don’t matter very much because we’ve gotta have everyone healthy to matter in the playoffs so I hope we can have a health miracle",
    "381": "@taylorcsnow @jaytatum0 @celtics @Stathead Truly a great loss.",
    "382": "@celtics Smart",
    "383": "@Tyler1Chad @celtics Brain dead comment after that game 😂",
    "384": "@celtics So we are basically a middling team",
    "385": "@celtics @J_Rich1 Josh Stitchardson!",
    "386": "Who are you backing?\n\n@celtics vs @trailblazers, LIVE tomorrow from 8:30 AM on @MTVIndia, @Vh1India, @VootSelect, and @OfficialJioTV! \n \n#NBA75 #NBAonMTV #NBAonVh1 #NBAonVootSelect #NBAonJioTV #NBALiveinIndia https://t.co/s4Bhris16p",
    "387": "@celtics 5 games on the road let's see how many games we win lets keep track 0-1",
    "388": "@celtics We did not play Warrior or Suns. Udoka totally unaceptable! Lame excuse.",
    "389": "Boston Celtics vs. Portland Trail Blazers - 12/4/2021 Free Pick &amp; NBA Betting Prediction https://t.co/0Ag3Mn7qph\n.\n#Betting #FreePicks https://t.co/qolpq4e3QM",
    "390": "Staring lineups for both @utahjazz &amp; @celtics did a huge bulk of the scoring in this high paced/scoring game. \nJazz (109) out of 137 \nCeltics (107) out of 130\nJazz also shot 53% from 3 (27-51) while the Celtics shot 36% (14-39) \nJazz also won the battle on the glass 44-30",
    "391": "@Jeff84253469 @celtics Or you could have used his famous phrase-Oh Yeahhhh!! 😊Gotta love the Macho Man! ❤️ was one of the greatest!! 👍🏻",
    "392": "@celtics Everyone gets a Trophy",
    "393": "@utahjazz v @celtics \n\nJazz 🟡🟢\n- Mitchell : 34 pts, 1 reb, 6 ast\n- Conley : 29 pts, 4 reb, 7 ast\n- Gobert : 18 pts, 12 reb, 2 blk\n#TakeNote \n\nCeltics ⚪️🟢\n- Tatum : 37 pts, 6 reb, 5 ast\n- Schroder : 26 pts, 2 reb, 3 ast\n- Horford : 21 pts, 6 reb, 9 ast\n#BleedGreen \n\n#NBA75",
    "394": "Boston Celtics play Basketball tonight",
    "395": "@celtics Really? I got a news flash for you: YOU LOST. Your effort and your work was for naught.",
    "396": "@celtics That quote sums up the green teamer mentality.",
    "397": "@celtics I prefer that game than the game vs philly",
    "398": "@JakeB1911 @celtics What can you do when they are making every single contested 30 footer",
    "399": "We've got your Sunday morning plan covered! Don’t miss the action as @celtics take on the @trailblazers . \n\nWatch the @NBAIndia games live on @OfficialJioTV \n\n#NBA75 #NBAonJioTV #NBAIndia  #NBALive #BleedGreen #RipCity  #IndiaBasketball #Basketball #Dunk https://t.co/lnwX1KJAXc",
    "400": "@celtics Super proud the way the have played. I cant belive the fucking way jazz was shooting. If we play all the season like tonight we will have a great year.",
    "401": "@magiicrat1967 @celtics Clearly you didnt watch the game",
    "402": "Donovan Mitchell had 34 points and six assists to lead the Utah Jazz over the Boston Celtics 137-130 Friday night.\nhttps://t.co/PDEH3Cu4Cr",
    "403": "Donovan Mitchell had 34 points and six assists to lead the Utah Jazz over the Boston Celtics 137-130 Friday night.\nhttps://t.co/dU6SUcjiev",
    "404": "Donovan Mitchell had 34 points and six assists to lead the Utah Jazz over the Boston Celtics 137-130 Friday night.\nhttps://t.co/ix37wnD4Tm",
    "405": "To all (probably 1) my Sporting and Boston Celtics fans followers: how Sporting knocked around that pussy Joao Mario yesterday is how the Celtics should’ve handled Kyrie. Friendly off the court if you’re friends. On the court, he gets murder death killed! Well done lads!",
    "406": "@NBAIndia @trailblazers @celtics @MTVIndia @Vh1India @VootSelect @OfficialJioTV Blazers won title in 1977 in which Maurice Lucas, Jack Sikma and Bill Walton were the key players.",
    "407": "@celtics Gotta defend the pick and roll better than that",
    "408": "@StoolGreenie @Scalabrine @ByJayKing...The @celtics  need to free @paytonpritch3 ...after a great rookie season no minutes😡 #winner #getsbuckets #freedom",
    "409": "@celtics Credit? Hahah. Giving up 37 points in fourth q. I said this team sucked in 2019 and they still do. Fire the entire organization starting with Wyc down to last man on the bench. Trade everyone.",
    "410": "When did the @trailblazers win their maiden 🏆?\n\nCatch them in action against the @celtics tomorrow on @MTVIndia, @Vh1India, @VootSelect, and @OfficialJioTV!\n \n#NBA75 #NBAonMTV #NBAonVh1 #NBAonVootSelect #NBAonJioTV #NBALiveinIndia",
    "411": "We've got your Sunday morning plan covered! Don’t miss the action as @celtics take on the @trailblazers. \n\nWatch the @NBAIndia games live on @MTVIndia, @Vh1India, @VootSelect, and @OfficialJioTV\n\n#NBA75 #NBAonMTV #NBAonVoot #NBAonVh1 #NBAonJioTV #NBAIndia #IndiaBasketball https://t.co/ZuSwwDS3XX",
    "412": "@2yacatalan @celtics Ok bayina 🚶🚶🚶",
    "413": "@celtics Yeah or maybe defend the 3 point line",
    "414": "Resultado dos jogos de ontem:\n\nHouston Rockets 118 x 116 Orlando Magic \n\nDallas Mavericks 91 x 107 New Orleans Pelicans \n\nUtah Jazz 137 x 130 Boston Celtics \n\nLos Angeles Lakers 115 x 119 Los Angeles Clippers\n\nGolden State Warriors 118 x 96 Phoenix Suns",
    "415": "@celtics This is one loss I'm not ashamed of. Now beat LA!",
    "416": "@taylorcsnow @jaytatum0 @celtics @Stathead I think Tatum’s ceiling is higher than Pierce’s - Will he hit it, no one knows (yet)",
    "417": "@celtics How the hell do you put up 130 points and STILL lose? Defense tried, but Utah just made anything and everything, which is really just typical when others teams play the Celtics.",
    "418": "@CoachBryant5 @celtics Then go out there and do the job instead of talking that talk behind a phone . That's way too easy to not have to backing up what you're saying on social media",
    "419": "@cire_PS31 @celtics They literally put up 130 , what the fuck are you talking about ? The bench balled out tonight",
    "420": "@Vh1India @celtics @trailblazers @NBAIndia @MTVIndia @VootSelect @OfficialJioTV You guys should open vh1 sports channel.",
    "421": "@celtics Let’s give each player a trophy.",
    "422": "@NBAIndia @trailblazers @celtics @MTVIndia @Vh1India @VootSelect @OfficialJioTV I bought @VootSelect subscription just for NBA but it seems it's gonna be useless now. Got fooled probably.",
    "423": "We've got your Sunday morning plan covered! Don’t miss the action as @Celtics take on the @trailblazers.\nWatch the @NBAIndia games live on @mtvindia,@vh1india,@VootSelect,&amp; @officialjiotv\n\n#NBA75 #NBAonMTV #NBAonVoot #NBAonVh1 #NBAonJioTV #IndiaBasketball #NBALive #NBALiveInIndia https://t.co/lgj2Qsm6kq",
    "424": "@NBAIndia @trailblazers @celtics @MTVIndia @Vh1India @VootSelect @OfficialJioTV Yeah, why you guys telecasting only selective matches? Can't you guys stream every match on app?",
    "425": "Boston Celtics at Portland Trail Blazers: Stream, lineups, injury reports and broadcast info (12/4) https://t.co/WdgEuykbOO",
    "426": "@NBAIndia @trailblazers @celtics @MTVIndia @Vh1India @VootSelect @OfficialJioTV Hey why you guys showing the same match in two channels ? Show two different match.",
    "427": "@NBAIndia @trailblazers @celtics @MTVIndia @Vh1India @VootSelect @OfficialJioTV Warriors vs Spurs @NBAIndia",
    "428": "Start your Sunday with a clash between the @trailblazers and the @celtics! ⚔️\n\nCatch the action LIVE from 8:30 AM on @MTVIndia, @Vh1India, @VootSelect, and @OfficialJioTV! 📺\n \n#NBA75 #NBAonMTV #NBAonVh1 #NBAonVootSelect #NBAonJioTV #NBALiveinIndia https://t.co/1ZuC3ilMxV",
    "429": "Boston Celtics Score - Final: Jazz 137, @celtics 130. Jayson Tatum 38pts, Dennis Schroder 26pts, Al Horford 21pts. #bostonceltics #celtics #bostonathletes #boston #basketball #NBA75 #NBA #bostonsports #BleedGreen #bostonathletemagazine https://t.co/YNQfuWUeI8",
    "430": "We made our way back from a slow start, but Utah’s three-point shooting helped them pull away with a 137-130 victory. https://t.co/z0hBFuqVOn",
    "431": "@celtics This intern should be fired",
    "432": "@balldontstop @celtics My dawg !",
    "433": "Boston Celtics vs Utah Jazz - Full Game Highlights | December 3, 2021 | ... https://t.co/GpHO7ktXqB @YouTube",
    "434": "Three thoughts on the Utah Jazz’s 137-130 win over the Boston Celtics from Salt Lake Tribune Jazz beat writer Andy Larsen.\n https://t.co/j6L8X2bFyT",
    "435": "Boston Celtics News - After 3 Quarters the Jazz lead 100-97 over the @celtics. #bostonceltics #celtics #bostonathletes #boston #basketball #NBA75 #NBA #BleedGreen #goceltics #bostonathletemagazine https://t.co/9w0LLq2Dhd",
    "436": "@PickDawgz Angel Colin #317\nPick #1 NBA Boston Celtics -1 (-110)\nPick #2 NBA Miami heat ML (+176)\nPick #3 NBA Chicago bulls Ml (+130)\n#PickDawgzCapperContest",
    "437": "@celtics You don't get credit for losing. Get a grip",
    "438": "@smart_MS3 has become more of a playmaker and distributor this season. Over last 14 games for @celtics he’s averaging 6.6 assists with a 4.0 a/to ratio.",
    "439": "Four takeaways as Boston Celtics fall to Utah Jazz 137-130 amid a record-breaking 3-point shooting performance  https://t.co/fUNwwcmj9c",
    "440": "Three potential trade targets for the Boston Celtics who might be available after 12/15 via @freecapecodnews https://t.co/HxmsKYEvBa #Celtics #basketball",
    "441": "Portland Trail Blazers vs. Boston Celtics: Game preview, time, TV channel, how to watch free live stream online – ZellaNews https://t.co/nAoRLrbbSq",
    "442": "@OneMotolani Boston celtics happened to him",
    "443": "NBA\nL.A. Lakers -118 - LOSS\nGolden State Warriors -7 (-115) - WIN\nBoston Celtics +8 (-107) - WIN\nHouston Rockets -145 - WIN\nPhiladelphia 76Ers +2 (-112) - WIN\nCleveland Cavaliers +3 (-110) - WIN\n\n5-1-0: 83% accuracy.\n\n@Clappa12\n@StreakCoolers https://t.co/sWw1D9wpMV",
    "444": "Enes Kanter is trying to turn the Boston Celtics into the Boston Galatians",
    "445": "Donovan closing the game - a trend.\n\n3/5\n\n2:35 left in the game, Utah Jazz up 2 against the Boston Celtics.\n\nDonovan Mitchell drives on Schröder and scores over Al Horford. https://t.co/LHLB46lBIJ",
    "446": "Donovan closing the game - a trend.\n\n2/5\n\n3:08 left in the game, Utah Jazz down 1 against the Boston Celtics.\n\nDonovan Mitchell hits a contested 3 to take the lead. https://t.co/yCSaULYONw",
    "447": "Might be adding to the American sports teams I follow! \n@ravens @Orioles @celtics @NDFootball and now a NWSL team. Hope their merch is on point. 🏴󠁧󠁢󠁳󠁣󠁴󠁿 https://t.co/cx70OeTWKb",
    "448": "Boston Celtics (12-11, 10th in the Eastern Conference) vs. Portland Trail Blazers (11-12, eighth in the Western Conference) https://t.co/amSjIux08e",
    "449": "@celtics This team sucks",
    "450": "A Former Boston Celtics shooting guard has landed at the Sydney Kings with plenty of stories to tell, including the NBA’s brutal business  practices and the day he was held at knifepoint.\n@mattlogue7\nhttps://t.co/je9ZsXezX6 https://t.co/5P1ogVYNBb",
    "451": ".@BostonSportsBSJ:  Karalis: Boston Celtics lit the fuse, and Utah Jazz bombed away at a historic rate https://t.co/CcTzWVtWci",
    "452": "On this day, Boston Celtics icon Larry Bird scored a triple-double against the Detroit Pistons, and the team traded Jon Barry for Alaa Abdelnaby.  https://t.co/5ipY2nF39e",
    "453": "@jaytatum0 Jayson Tatum - 37 Pts (14 in Q3), 6 Reb, 5 Ast, 1 Blk Highlights｜Utah Jazz vs Boston Celtics | 2021.12.03\nhttps://t.co/XH4vxuurq2\n\n#JaysonTatum #NBA​ #Boston​ #Celtics​ #Basketball #Utah #Jazz",
    "454": "@Al_Horford Al Horford - 21 Pts, 6 Reb, 9 Ast, 1 Stl, 1 Blk Highlights｜Utah Jazz vs Boston Celtics | 2021.12.03\nhttps://t.co/cyXKXiUhW7\n\n#DominicanRepublic #AlHorford #NBA​ #Boston​ #Celtics​ #Basketball #Utah #Jazz",
    "455": "@JcsCommentary assistant GM Joe Cronin was promoted to interim GM, the team said it will conduct a search for a permanent replacement. Former Boston Celtics executive Danny Ainge, an Oregon native who played 2 seasons for the Blazers, has been mentioned as a potential replacement",
    "456": "Today's NBA Picks: 10:10 PM ET - Boston Celtics vs. Portland Trail Blazers - 1 PICK AVAILABLE: https://t.co/cRSNjCr5td #nba",
    "457": "@celtics Blah blah blah they suck and its routine at this point we all know no matter what they will choke late in games. Its been there M.O. for a couple years now",
    "458": "Spida extends the lead with 2:33 to play!\n\n@celtics  120\n@utahjazz 124\n\nQ4 on NBA League Pass: https://t.co/yKzqQqYS0r https://t.co/dMRmEjw9bP",
    "459": "Boston Celtics centre Enes Freedom — a journeyman NBA veteran who is one of the sports world’s fiercest critics of human rights abuse — is challenging NHL stars Sidney Crosby and Connor McDavid to boycott the upcoming Winter Olympics in Beijing.\n\nDecember 03, 2021 at 04:21PM…",
    "460": "@varun_garg21 @celtics Haha Have y’all even won a championship ?",
    "461": "@celtics Not even angry. Good pain",
    "462": "Utah was an unstoppable force Friday night, but our offense deserves some credit as well for putting forth its best effort of the season. \nhttps://t.co/How44L7YVV",
    "463": "Celtics stumble into second half of back-to-back at Portland  #NBA\n #trailblazers #RipCity #celtics #BostonCeltics https://t.co/6pkSFryuxs",
    "464": "We've got your Sunday morning plan covered! Don’t miss the action as @celtics take on the @trailblazers.\n\nWatch the @NBAIndia games live on @MTVIndia, @Vh1India, #VootSelect and @JioTV \n\n#NBA75 #NBAonMTV #NBAonVoot #NBAonVh1 #NBAonJioTV #NBAIndia #NBALive #NBALiveInIndia https://t.co/02pSnhxwBL",
    "465": "@celtics ITS A LOSS!",
    "466": "Boston Celtics at Utah Jazz    Game #23    12/3/21 https://t.co/FZ9KazGShe",
    "467": "Boston Celtics Daily Links  12/3/21 https://t.co/rT1iVdRJIf",
    "468": "Day 4️⃣ JASON COLLINS 🏀\n\nCollins is an American former professional basketball player who played for 13 seasons in the NBA. He played for the Boston Celtics and many others. \n\nIn 2013, he came out as gay, becoming the first active male NBA player to publicly do so 🏳️‍🌈 https://t.co/WslYFgZRZ1",
    "469": "this is now a “the Boston Celtics mascot is reverse racism” account #celtics #reverseracism",
    "470": "It was however the most ever against the Boston Celtics https://t.co/MrkC98CB1t",
    "471": "@celtics The Celtics rely too much in their starters. Thats why when their starter struggle, the celtics looses. Their bench should start to deliver, Coach Ime should start to maximize their bench.",
    "472": "@celtics We handing out moral victories now? Yikes.",
    "473": "@celtics Trade him. He’s softer than a sneaker full of shit",
    "474": "@sagforvet @BehSakinah @TayaSuri @stellarct @celtics @EnesFreedom Are you @EnesFreedom? You just can't tolerate people say negative things about you, right?",
    "475": "@celtics I'm sorry coach .... This is not a Celtic mentality .... You have to be more aggressive and eat the hardwood. .... You can not be satisfied for having lost a little .... Otherwise it does not exceed 50% this year",
    "476": "#DonovanMitchell had 34 points and six assists to lead the #UtahJazz over the #BostonCeltics 137-130 Friday night.\n\n#NBA \n\nhttps://t.co/BUnkAY9eX3",
    "477": "@kohltonmiller @KSite_ @celtics Yall won yet ur still crying about the refs? Lmao🍼",
    "478": "@celticsry @LFC0wen @celtics It was Star Wars night at the Vivint arena!",
    "479": "@celtics who runs this Twitter account? are you shitting me with this post? almost eeked out a win is an embarrassing thing to say",
    "480": "1/26/97 @packers win sb (31) 35-21 by (14) \n\n(142) days (13) years later 13th pick @kobebryant wins 5th last ring age (31) 83-79  vs @celtics 6/17/10\n\n142  rv (24)(1) 13 rv (31) \n\n#nfl https://t.co/swV2a26x9e",
    "481": "How my favorite teams faired today?\nBoston Celtics ❌",
    "482": "@ElJayDiche @celtics Nobody made shots late outside Tatum and then they kept leaving Conley wide open and it was pretty much wraps after that",
    "483": "Saturday Sale💥\n\nArsenal 15/16\nEverton 10/11\nBoston Celtics 07/10\nChicago Bulls 90s\n\nAll original. Gratis ongkir via Tokopedia✨\n\nMore detail at linktree or https://t.co/t2wtRWTpvQ\n\n@Jerseyforum #Jersey4sale 🙏🏻 https://t.co/mcddx0HdhW",
    "484": "SALT LAKE CITY (AP) — Donovan Mitchell had 34 points and six assists to lead the Utah Jazz over the Boston Celtics 137-130 Friday night. https://t.co/vdp9yCJtDh",
    "485": "@ElJayDiche @celtics Ya hear that Jay we played hard tonight after giving up 25 3s https://t.co/wHalTg5cHs",
    "486": "Boston Celtics vs Utah Jazz Full Game Replay 2021 Dec 03 NBA Replay HD\nhttps://t.co/kQmTqZ9fHL https://t.co/fDyYyPim3z",
    "487": "Today I learned that Antoine Walker was Top 5 in career steals* on the Boston Celtics all-time list...\n\n*Steals weren't an official stat until the 1973-74 NBA season, instantly eliminating K.C. Jones, Bob Cousy, Bill Russell &amp; Jo Jo White (1969-70 to 1972-73 with no steal stats)",
    "488": "@celtics So we’re doing moral victories already",
    "489": "Hard fought game by @utahjazz and @celtics \n.\n.\n.\n.\n.\n#utahjazz #utahjazznation #utahjazzbasketball #celtics #bostonceltics #boston #sports #basketball #hoops @nba @usatodaysports @imagncontent @canonusa #teamcanon #teamcanonusa #utahphotographer @promed… https://t.co/1llD2ySth5 https://t.co/MrLSnPkLkT",
    "490": "@harrisondb_ @hofTarasenko @celtics I feel like this team always plays up or down to the competition",
    "491": "https://t.co/dcbBywLuB5\n\nThanks to a combined 63 points from its all-star backcourt of @mconley11 and @spidadmitchell, the @utahjazz used a late fourth-quarter run to take down the @celtics 137-130 on Friday night\n#TakeNote",
    "492": "ALERT: New high roller bet posted!\nA bet has been placed for $5,468.66 on Portland Trail Blazers - Boston Celtics to win $10,499.83.\nTo view this bet or copy it https://t.co/y7bxIYZHNq https://t.co/7HIS4at5bT",
    "493": "The producer of the historic 1st Batman died age (83) 4/23/91 \n\n(17)(1) days after (29) year mark (23) @KingJames  wins (4th) ring 106-93 vs heat. Lakers 17th ring. Ties @celtics for a record (17) rings 10/11/2020 (73) days after (54) yr mark of the movie.  #Batman https://t.co/cyolRrrasC",
    "494": "🏀 @utahjazz WIN tonight against the @celtics, 137-130.\n\n@TalkinSports2 https://t.co/LUuS4kELzs",
    "495": "@celtics Do better next time y’all..",
    "496": "@LakersReporter The @Lakers should take full advantage of the extra few days of rest before their rematch with the @celtics on Tuesday. The offense and defense is nowhere near playoffs level, let alone championship level. Work on free throws. Work on spacing.",
    "497": "This Boston Celtics team is not very likable, are they?",
    "498": "@celtics A moral victory is still a loss, playing well but not winning is still a loss.  Just the start of a long string of losses coming...",
    "499": "#News Rudy Gobert with a last basket of the period vs the Boston Celtics https://t.co/NkZHtK7KC1",
    "500": "@celticsfuckyou @celtics Facts",
    "501": "Very entertaining game out in Utah tonight.  Tough loss on the road for the @celtics, and all credit to the @utahjazz for shooting the lights out all night and especially down the stretch. #BOSvsUTA #NBA #BleedGreen https://t.co/xGuXEh5MMN",
    "502": "@celtics You know something I definitely thought Steven was going to put our squad back together and get us back on top after the slaughter of the team Danny Ainge did to us in getting back Al I damn show thought Thomas was definitely next and yet still nothing where Thomas oh yeah Ballin",
    "503": "1st Batman movie 7/30/66   (93) days after @celtics /@RealBillRussell record (8th) ring in a row  4/28/66 95-93 vs @Lakers game 7.  Russell 10-22 25 points \n\nBatman star Adam west  age (8)(8) \n\nFilm made 3.9 mill  93  rv (39) when 1st Batman comic came out #Batman https://t.co/UwpZ4npshW",
    "504": "@AztroJB7 @jmpre1985 @LordBrOFFICIAL @celtics i was at the game and most of their shots were wide open",
    "505": "@celtics i was at the game literally embarrassing performance on D for the celics",
    "506": "@arxanii @ATLHawks @celtics @hornets @chicagobulls @dallasmavs @nuggets @warriors @LAClippers @Lakers @memgrizz @MiamiHEAT @Bucks @PelicansNBA @nyknicks @OrlandoMagic @sixers @Suns @SacramentoKings @Raptors Would you take a Bledsoe-Gordon trade? Only 3.9m guaranteed for Bledsoe next season.",
    "507": "#Sports Top dunks from Utah Jazz vs. Boston Celtics https://t.co/zbt29sy3PJ",
    "508": "#News Rudy Gay with an assist vs the Boston Celtics https://t.co/FHf7MYDpZa",
    "509": "#Sports Jordan Clarkson with a last basket of the period vs the Boston Celtics https://t.co/gzTLYctj3C",
    "510": "#News Mike Conley with a deep 3 vs the Boston Celtics https://t.co/QEXBF46xWJ",
    "511": "#Sports Donovan Mitchell with a deep 3 vs the Boston Celtics https://t.co/xUXkguLzT7",
    "512": "#Sports Royce O'Neale with a 2-pointer vs the Boston Celtics https://t.co/HWo1fyG3H5",
    "513": "@celtics We are rubbish 🙄",
    "514": "@balldontstop @celtics Awful defence by Clarkson",
    "515": "@SneakerNews Need both but I’m a big @celtics guy so ☘️ if I must lol",
    "516": "@spizzyspose @celtics I just mean how close and sweat inducing they usually are😅😅 couldn’t really play any better tonight, just had history dropped on our heads. Team looked super solid and without Jaylen, gotta feel encouraged",
    "517": "@___joetaylor @celtics I agree.",
    "518": "@celtics Stevens has put together a very disappointing team",
    "519": "12/3 Recap UTSA 🏈 +4✅💰 OREGON 🏈 +3❌ NEW ORLEANS PELICANS 🏀 +8✅💰 PHOENIX SUNS 🏀 +7❌ CALGARY FLAMES 🏒 -$130✅💰 MINNESOTA TIMBERWOLVES 🏀 +8✅💰 BOSTON CELTICS 🏀 +8✅💰 5W 2L wager $790 profit $280.  35.4% r.o.i. #NCAAF #NBA #NHL",
    "520": "@GeorgWilden @celtics Maybe if Tatum's 3 were shit we might have won.\nBut his 3s have been rubbish all year.",
    "521": "@taylorcsnow @jaytatum0 @celtics @Stathead 37 PTS, 0 TO, 1 L.  Congrats on the magnificent individual performance!",
    "522": "@CarlesPerez21 @Pants2k_ @celtics Brown was injured",
    "523": "@celtics Friggin SHIT DEFENCE coach.",
    "524": "@celtics What about defence Al?",
    "525": "@KRexo1 @celtics And the playoffs",
    "526": "Donovan Mitchell and Mike Conley were perfect in the clutch as the @utahjazz beat the @celtics in Salt Lake City. \n\n#TakeNote \n\nhttps://t.co/O4gxUNzjyx",
    "527": "NBA Viernes 3/12: 1-1 Temporada: 43-36\n\nWashington Wizards -3 (-110) ❌\nBoston Celtics vs Utah Jazz O210 (-110) ✅",
    "528": "@celtics Almost? Is this a moral victory for a 500 team named the BOSTON CELTICS? What is this world coming to? That’s NOT acceptable!!!",
    "529": "@BACCENDCHlLD @celtics Basketball was never a real sport anyway https://t.co/FhQ42LuYEX",
    "530": "Brutal stretch for the @celtics . Godspeed. https://t.co/KeqBib1ewh",
    "531": "My friends daughter :”what are the lakers” \nme: “nothing……..now the Boston Celtics is a great NBA team” \nMy friend: “😅you ain’t shit”",
    "532": "@danielhoffmanDC @Amanda_Pflugrad @celtics Go Freedom !",
    "533": "@arxanii @ATLHawks @celtics @hornets @chicagobulls @dallasmavs @nuggets @warriors @LAClippers @Lakers @memgrizz @MiamiHEAT @Bucks @PelicansNBA @nyknicks @OrlandoMagic @sixers @Suns @SacramentoKings @Raptors Lmao",
    "534": "@KDhabha Boston Celtics",
    "535": "On this day in sports history December 4, Boston Celtics Center Bill Russell recorded 26 Points and 38 Rebounds in a 122-107 win against the New York Knicks in 1959.",
    "536": "@celtics eked**",
    "537": "@celtics This should be much better than a .500 club. You’ve got the talent, why are we still stuck in neutral?",
    "538": "@positive_mets @L0udC33 @EnesFreedom @ipoundurmom69 Please do it for him @EnesFreedom 🙏 @celtics @FCHWPO",
    "539": "POSTCAST – Incredible night at Vivint as Utah Jazz and Boston Celtics go toe to toe to the end - https://t.co/FqLJ0NR43g",
    "540": "@celtics A new coach and y’all are treating like he’s done this for years we’re a young team that’s learning as we go a dub in my book we played great they just played better",
    "541": "@celtics I hope he get well soon.",
    "542": "Donovan Mitchell had 34 points and six assists to lead the Utah Jazz over the Boston Celtics.\n\nhttps://t.co/B23OcCtv6o",
    "543": "@celtics Soft team.",
    "544": "Utah Jazz 137 (Donovan Mitchell 34 pts, Rudy Gobert 18 pts, 12 rebs) Boston Celtics 130 (Jayson Tatum 37 pts)",
    "545": "@celtics Stop tweeting until we win",
    "546": "@celtics Of course the Jazz want to shoot lights out against us but in playoffs, they brick every shot and get rounded. 😂",
    "547": "I’m not even mad at this @celtics loss. They played hard &amp; worked the offense together. One of their best performance thus far",
    "548": "@celtics who the fuck asked him this and what other response did they expect 💀",
    "549": "@celtics That’s what a loser says",
    "550": "@harrisondb_ @hofTarasenko @celtics We coulda had jaylen brown this game if they aint play his crippled ass on 50% for 3 games. Poor management😒",
    "551": "@BroncoRob @celtics @FCHWPO It is going to be tough but i liked what i saw tonight, if we play like that every night we're gonna win a lot of games",
    "552": "@harrisondb_ @celtics we lost",
    "553": "@celtics Consolation prize https://t.co/rXOYWLygkk",
    "554": "@hofTarasenko @celtics to lose by 7 and have Conley shoot 7/7 from 3, and have the team shoot 50% from 3… is a great effort from the Celtics, also with no jaylen brown",
    "555": "Donovan Mitchell had 34 points and six assists to lead the Utah Jazz over the Boston Celtics 137-130.\n\nhttps://t.co/5aYp44fAcj",
    "556": "“We were there, we contested them,” Al Horford says when asked about Utah’s lights-out shooting performance. “We’ve got to shake their hand and give them credit.”",
    "557": "NBA\n\nFT.\n\nIndiana pacers 104 - 113 Miami Heat\n\nWashington Wizards 101 - 116  Cavs\n\n Hawks 96 - 98  76ers\n\nNets 110 - 105  Timberwolves\n\nHouston Rockets 118 - 116 Orlando magic\n\nDallas Mavericks 91 - 107 New Orleans pelicans\n\nUtah Jazz 137 - 130 Boston Celtics\n#TheGamePlan",
    "558": "@Broncomaniac58 @celtics Yep, hope the @celtics young guys can carry the old guys tomorrow night!!!! Sucks not having @FCHWPO!!!!",
    "559": "Jazz emerge with high-scoring win over Celtics  #NBA\n #utahjazz #TakeNote #celtics #BostonCeltics https://t.co/ZUsPDdb9rH",
    "560": "@CarlesPerez21 @Pants2k_ @celtics Brown &gt;&gt;&gt;&gt;&gt; Tatum",
    "561": "@jarcar101 @KellenEdwards3 @celtics We don’t have brown what u expect, Jazz is a good team",
    "562": "@celtics we fckn lost man who cares if we “almost” eeked out a win WE FCKN LOST",
    "563": "@celtics drug test everyone, even the water boy",
    "564": "Tough loss today @celtics Proud of the fight though.",
    "565": "@celtics Rare time a post after a loss is kind of ok",
    "566": "@celtics Eeked?",
    "567": "We almost eeked out a win in Utah despite a record-setting shooting night by the Jazz. https://t.co/Kim1dAZ9Bm",
    "568": "@celtics Nothing we can do, jazz on fire today",
    "569": "@kohltonmiller @KSite_ @celtics don't commit offensive fouls",
    "570": "@celtics Love to see it",
    "571": "@BokangQuu @celtics Hape it's cause team ena ke ea hae banna! 😂 Lea shata?!",
    "572": "@celtics FUCK",
    "573": "@celtics Marcus Smart",
    "574": "@BokangQuu @celtics I really think dude has to be consistent, it's not that dude ain't good but there are nights he drops a 25+ and 10+ rebounds and where are the assists he is supposed to be racking up. He has to work on delivering on what he promised he would off-season",
    "575": "@celtics Unlucky guys",
    "576": "@bergermelt @celtics No idea",
    "577": "@russwest44 fit better on the @celtics let’s swap give @Lakers @FCHWPO fair exchange ain’t no robbery 🤷🏽‍♂️🤷🏽‍♂️",
    "578": "@chefboyarri @celtics ONE stinken game over .500...  9th in the East.. we need to WIN games.. NOT lose them.. WIN them",
    "579": "@KRexo1 @celtics Hey they tried their hardest!",
    "580": "@KellenEdwards3 @ItzWildyy @celtics ONE stinken game over .500...    9th in the East... we need to start winning games... not losing them.. winning them",
    "581": "@celtics Agreed... Same energy vs Blazers coach",
    "582": "@BroncoRob @celtics That ain't going to be easy on the 2nd of a back to back. That was a tough loss thanks to the Jazz shooting out of their minds",
    "583": "@celtics That’s so lame. We’re into moral victories now?  Sad what happened to this franchise.",
    "584": "📽 Utah Jazz 137, Boston Celtics 130 highlights https://t.co/PEpMqR5sU5 https://t.co/yRvLLkvGGT",
    "585": "@jarcar101 @celtics as if this was just a easy game to win? you do understand if you go against good teams like the Jazz that you may lose right? they fought hard this game but you just gotta look into the next one",
    "586": "Trade @FCHWPO @celtics!",
    "587": "@AztroJB7 @LordBrOFFICIAL @celtics Once we allowed 100pts, 60 from 3s, after 3Qs the rim was 10ft wide..",
    "588": "@Broncomaniac58 Knew Jazz would shoot a lot of 3’s but didn’t think they would make so many of them. Tough loss but @celtics need a bounce back win at Portland tomorrow night!!",
    "589": "@zVxryy @celtics Whiff",
    "590": "@celtics Grant and Rob not on the court at the end was a mistake on Ime",
    "591": "@celtics the training wheels are off. time to ride the bike https://t.co/AZoe4hVtG7",
    "592": "@celtics A lame excuse, the Celtics could have played a much tougher defense but they didnt",
    "593": "Most haters team in NBA history @celtics",
    "594": "@celtics IME SUCKS",
    "595": "@celtics Tough loss but solid game by Celtics- Utah just couldn’t miss. Crazy",
    "596": "@celtics Too bad…they played well but Utah was on fire",
    "597": "Boston Celtics vs Utah Jazz - Full Game Highlights | December 3, 2021 | 2021-22 NBA Season\nhttps://t.co/1Fw2IVQR2j",
    "598": "@celtics Even if you think that not sure why you would say it as a pro coach",
    "599": "@AullThat @celtics I dunno man last two games… low scoring defense grudge match vs Philly for a win and decent defense and still 130-130 final minutes vs the jazz is crazy opposite ends of the spectrum, need team to stay healthy either way and build chemistry",
    "600": "Watched the @celtics for a few in the fourth. Legit watched 24,000 allowed 3’s and we couldn’t hit one given 90 attempts. Yikes man.",
    "601": "@HonestLarry1 Why Johnny Most isn’t in the Hall of Fame with Chick Hern is beyond me ! @celtics @NBA",
    "602": "@jaggilbert99 @celtics Just shut up and watch games instead of checking the box score and getting on twitter",
    "603": "@trrich75 @JShuttlesworthh @celtics Conley was injured for the second round last year, he seems to make a difference",
    "604": "@jaggilbert99 @celtics You clearly did not watch the game",
    "605": "@celtics Yes, but, we had a problem in the defense against their hot three pointers tonight. See the scoring, sir. https://t.co/7L38JKIYjl",
    "606": "@jarcar101 @celtics We’re gonna pull thru again I bet, we just gotta stay healthy and play good. If anything we’ll just end up in the playin tournament again",
    "607": "@jmpre1985 @AztroJB7 @LordBrOFFICIAL @celtics Yeah, so? Who doesn't? Calling him Scal doesn't change the fact that he sucks.",
    "608": "@celtics This Brad Stevens ass quote man lmao",
    "609": "NBA @celtics at @utahjazz, Friday, December 3, 2021 @NBA @NBAstats #gamecharts #dataviz #nft https://t.co/ih1XZHs4N3",
    "610": "@LordBrOFFICIAL @celtics I agree, our defense has been amazing, the offense just needs to catch up and the Celtics can be one of the biggest threats in the league",
    "611": "@jaggilbert99 @celtics That makes less than 0 sense",
    "612": "@0hSiya @LordBrOFFICIAL @celtics We couldn’t stop donovan Mitchell and Conley from hitting 30 foot step backs damn on us",
    "613": "@celtics That and the Celtics still can’t beat anyone good.",
    "614": "@jarcar101 @ItzWildyy @celtics Dude calm down, we are 3 games back from the 1st seed in the east. Its a tight race and this loss was innevitable with how ridiculous they shot the ball",
    "615": "@AztroJB7 @LordBrOFFICIAL @celtics First 3Qs was poo, really..They made contested 3s in the fourth, but we kinda threw it away down the stretch I feel..",
    "616": "@AdrianTroplini @celtics Basketball is hard for you to comprehend, huh?",
    "617": "Encerrado:\n\nUtah Jazz (15-7) 137 x 130 (12-11) Boston Celtics\n\nUTA 📊\nDonovan Mitchell: 34PTS/1REB/6AST\nMike Conley: 29PTS/4REB/7AST/1BLK\n\nBOS 📊\nJayson Tatum: 37PTS/6REB/5AST/1BLK\nDennis Schroder: 26PTS/2REB/3AST/1STL\n\n#NBA https://t.co/39vsagSxRU",
    "618": "@jmpre1985 @AztroJB7 @LordBrOFFICIAL @celtics Scal is just as good as your grammar",
    "619": "@mactojakobi @celtics shit.",
    "620": "@nickdelpizzahut @celtics If our offense as consistent as the defense then we def finals contenders",
    "621": "@yummyceltics @celtics don’t jinx it man",
    "622": "@BurkeGerald @celtics Exactly",
    "623": "@jmpre1985 @_giovo @LordBrOFFICIAL @celtics Your a casual admit it + ratio",
    "624": "@celtics A loss is a loss.  12-11 is nothing to be happy about",
    "625": "@celtics Another slow start and late last qtr collapse. Sick of it, we won’t be winning anything for another 10+ years",
    "626": "@celtics Not the reaction I want from a coach who is here to win",
    "627": "@celtics Same mistake he did in San Antonio putting horford in",
    "628": "@LordBrOFFICIAL @celtics The Celtics just have no luck…",
    "629": "@celtics Lost us the game when u took Rob will out n decided to leave al horford on an island on them switches last 4 mins of the game….",
    "630": "@ShadEO9 @celtics Agreed",
    "631": "@iruntwitr @celtics he’s right tho",
    "632": "@nickdelpizzahut @celtics Why teams always play like this we got they families hostage",
    "633": "@Pants2k_ @celtics stop",
    "634": "@celtics 50 or more three attempts and they say we played good.\nIsn't that a sign of how poor we are letting them take that man\nNo is a good loss..\nShit defence.",
    "635": "@celtics Awesome, another moral victory! This isn’t a middle school game. Would have rather lost by 20",
    "636": "@celtics This ain’t it",
    "637": "@celtics But IS not enough. Defense would be more agressive and also need Jaylen",
    "638": "@LordBrOFFICIAL @celtics Jazz won this game by making every 3, but are now cursed forever",
    "639": "Let’s bounce back tomorrow night @celtics ! Hard fought battle tonight!",
    "640": "@celtics Score 130, you should win.",
    "641": "@TheBigDal6 @celtics he’s not good at the sport of basketball",
    "642": "@Tyler1Chad @celtics Wait",
    "643": "@celtics Seemed like they didn’t miss last quarter… always tough to beat a team that hot. Just gotta take the L and move on",
    "644": "@Tyler1Chad @celtics Ime sucks. 💯 sucks. Can’t wOt to see him replaced already",
    "645": "@DejounteMurray @spurs Come to the @celtics you already have the clover in the bio 🍀",
    "646": "@Tyler1Chad @celtics But this is a REAL RATIO in my eyes",
    "647": "@celtics He’s right",
    "648": "@celticsfuckyou @celtics Al died in the second half",
    "649": "@celtics Showed you losers suck! 😂 played hard tonight…lol",
    "650": "@celtics The problem was, we couldn’t 🛑 @utahjazz three pointers tonight 😢 https://t.co/tnAn72Gl7n",
    "651": "@trrich75 @JShuttlesworthh @celtics Agreed. They were hitting unbelievable 3's.",
    "652": "@celtics Great game. A lot to take from the defeat. Onto the next",
    "653": "@celtics oh piss off... stop losing games so much",
    "654": "@celtics Damn💔",
    "655": "@frostingnotcake @JBsGoat @celtics Yeah but that was only once or twice. They legitimately couldn’t miss 3 it was hard to watch.",
    "656": "@celtics not a \"REAL COACH\" in my eyes",
    "657": "@celtics Y’all did fine. Blow the blazers out they have no defense and don’t shoot like this lol",
    "658": "@celtics so real, ime",
    "659": "@celtics RARE WDOKA",
    "660": "@celtics Coach Udoka PUT ROB WHEN DON AND CONLEY ARE HOT",
    "661": "@JBsGoat @celtics Bro I swear we beat all good teams but somehow lose to the average ones and blow out the shitty ones",
    "662": "@celtics i take this as a W. fluke game by the jazz",
    "663": "@celtics Well said Ime",
    "664": "@celtics I agree with this",
    "665": "@celtics And without our best player",
    "666": "Coach Udoka: \"To only lose by seven with a team shooting that hot, it shows our effort and the way we played hard tonight.\"",
    "667": "@celtics GG well played see you guys later in the year",
    "668": "@ItzWildyy @celtics we're gonna miss the playoffs if we don't win a couple in a row.. I'm so damn sick and tired of Boston being looked down on by the so called experts",
    "669": "Happy reading y'all\n\nUtah Jazz vs. Boston Celtics: Opponent Game Thread Highlights\n\nhttps://t.co/ku2m1JRTbz",
    "670": "@brandon_lirio22 @celtics When the game was on the line and there to be taken.\nWe let them do that.",
    "671": "@celtics Fluke 3 pointers by Utah saved their asses. Usually I’m always pissed after a Celtics loss. But today we played amazing as a team. If we play like this when brown in on the floor. We are a crazy team. We had a slow start but I feel like we gone finish for sure top 6.",
    "672": "@celtics mike conley and mitchell were on something else in the 4th",
    "673": "@celtics gotta win tomorrow",
    "674": "@celtics this can happen. So let’s go to the @trailblazers at #portland for next victory ✌️ on this @nba road trip. See the scoring from tonight loss 😢 https://t.co/MGvYpz2T2N",
    "675": "@SeamheadPete @celtics Eh fair its quite a strange combination without context",
    "676": "@zVxryy @celtics You consider that BLOWING the game. What would you have done to stop them?",
    "677": "@celtics Sadness",
    "678": "@celtics No defensive effort tonight",
    "679": "@celtics Im honestly not even mad, we played great Utah just wasn't missing anything lmao",
    "680": "@celtics WE MOVE https://t.co/anH3SQ9fhD",
    "681": "@celtics YOU JUST LOST TO THE RACIST JAZZZ",
    "682": "@SeamheadPete @celtics Live in Washington and grew up a WFT fan. I tend to like teams that I feel are misunderstood or lack recognition so over time I ended up supporting the Titans and Jazz.",
    "683": "@JBsGoat @celtics 4th quarter defense was awful down the stretch. Jazz shots the lights out yeah but they left Horford in 2 on 1s every time their ball handlers got downhill. Really hard to watch",
    "684": "@jmpre1985 @AztroJB7 @LordBrOFFICIAL @celtics Who the fuck is Joe Ingalls. And INGLES is garb this year.",
    "685": "@JShuttlesworthh @celtics Jazz offense is unsustainable which is why they will never be a championship team. 2nd round out again... Hope the Celtics play like this the whole trip because they'll have success.",
    "686": "@yruzi2 @celtics Defend harder more pressure.",
    "687": "@celtics This wasent an L they fought so hard",
    "688": "@celtics Tbh I didn’t expect it to be this close anyways",
    "689": "@jarcar101 @celtics Yeah tru but what can we do when they are shooting like that, let’s just hope we can take down Portland tmw",
    "690": "@jmpre1985 @AztroJB7 @LordBrOFFICIAL @celtics Ingles can dribble, drive, and pass too lmao he’s far from just a spot up guy",
    "691": "@celtics Another L lls, 41-41 season incoming lol",
    "692": "ENCERRADO: o Utah Jazz (15-7), em casa, venceu o Boston Celtics (12-11) por 137 a 130. #TakeNote \n\nMITCHELL: 34PTS, 1REB &amp; 6AST.\nConley: 29pts, 4reb &amp; 7ast.\n\nTATUM: 37PTS, 6REB &amp; 5AST.\nHorford: 21pts, 6reb &amp; 9ast.\n\n#NBA75 https://t.co/fRQuOYGvqI",
    "693": "@celtics Trade Tatum",
    "694": "Four takeaways as Boston Celtics fall to Utah Jazz 137-130 amid a record-breaking 3-point shooting performance https://t.co/9Dci6vtvKP",
    "695": "@celtics 1 pain for December",
    "696": "@jmpre1985 @AztroJB7 @LordBrOFFICIAL @celtics Just say you didn't watch the game",
    "697": "@celtics Trade smart! He fucking sux!",
    "698": "@celtics You can score as much as you like but if you can't defend,it don't matter.\nTatum 37 but 2-10 threes.\nUp by 4 with 6 to play then the jazz scored 28\nWhere's our defence coach.\nAnother L is the main result.",
    "699": "@jmpre1985 @AztroJB7 @LordBrOFFICIAL @celtics -didn’t watch the game",
    "700": "@ItzWildyy @celtics bad loss good loss, we lost to many already.. we can't afford losses anymore",
    "701": "@MikeDemers_ @celtics It's a city",
    "702": "Utah Jazz vs Boston Celtics was on AT&amp;T Sportsnet Rocky Mountain. With commentary from Craig Bolerjack. Co-commentator is Thurl Bailey.  For more details see https://t.co/8C7dAgrDJu #UtahJazz #BostonCeltics #ATTSportsnetRockyMountain",
    "703": "@kohltonmiller @KSite_ @celtics Y’all had 5 more fouls than us and took 1 more free throw than us. Chill out lmfaoo",
    "704": "@celtics Safe travels!🤟🏼 https://t.co/1ZRYpdS6lh",
    "705": "@celtics Not even mad at you",
    "706": "@jake89761 @celtics They played good but also gave up 137 points and 27 3s doesn’t matter if JB isn’t in thats way too much",
    "707": "@chefboyarri @celtics we can't afford to lose game we lost to many already",
    "708": "@jmpre1985 @LordBrOFFICIAL @celtics Cap cap cap they hit tons of step backs watch the game bro",
    "709": "@TacoJayT @celtics Bruh that’s the thing. They ain’t goin to do anything in the playoffs. They all show for the reg season and legit go nowhere. Name a 1 seed last year that lose to a kawhi less clippers 😂. They aren’t the real deal. I’ll take us anyday in the playoffs over them when we healthy",
    "710": "@kohltonmiller @KSite_ @celtics Stop bitching and enjoy your win man goddamn",
    "711": "@anthonypic_999 @celtics Agreed. I'm not even mad.",
    "712": "@celtics go screw",
    "713": "@celtics Not even upset. Play like that tomorrow and we waxing the Blazers",
    "714": "@celtics pain.",
    "715": "@NBA @celtics @utahjazz While @jaytatum0 tries a forced 3-pointer to avoid contact, @spidadmitchell penetrates through the paint to get the points. While Tatum cages himself on a penetration, Mitchell drops a great pass, That's why Mitchell is way better.",
    "716": "@celtics Gotta Stop Switching everything it Leads to lazy defense and Nights like tonight Utah shot lights out when it counted",
    "717": "Why do I pay for league pass to watch the @celtics. It only pisses me off knowing in actually pay money to watch this nonsense. I am further irritated thinking these millionaires are like whatever it’s just a reg season game… just remember the fans are the reason they get paid",
    "718": "@celtics Good game guys, you were killing our asses on defense.",
    "719": "@jmpre1985 @AztroJB7 @LordBrOFFICIAL @celtics Completely false, watch the game",
    "720": "@jmpre1985 @AztroJB7 @LordBrOFFICIAL @celtics Ur sped",
    "721": "@KSite_ @celtics You even had the refs helping you out with all those \"Offensive Foul\" calls",
    "722": "@celtics In all seriousness tho that might be the least upset I've ever been about a loss",
    "723": "@celtics We fought a good fight. There's many positives that can be taken from the game. #BleedGreen",
    "724": "@celtics it’s a loss but so many great things to take from this game. Utah couldn’t miss no matter how great defense we played. onto the next https://t.co/Vnk3ItgCmm",
    "725": "@celtics Won't be that mad I think they played team basketball, the oldies splash uncles Mike old Conley just won't miss",
    "726": "@celtics Who can I blame for this game like I mean everyone played so well down the stretch. Utah lucky ain’t no brown playing. Amazing game. Why did rob play only 15 minutes. Didn’t watch first half foul trouble?",
    "727": "@celtics Honestly can’t be mad. Why can’t we play like this more. This is the team we wanna see☘️🙌🏽",
    "728": "@celtics Jazz need to fix their sliders",
    "729": "@celtics Good game … they had the sliders on 100",
    "730": "@Burner06137507 @celtics twitter is for 13+ year olds",
    "731": "@MoooseSZN @celtics Where coaches great defence.\nWent out the the window.\nCant defend.\nDoesn't matter if you score 130 and let the jazz shoot like that .\nWe will never win.\nPoor defence.",
    "732": "@celtics BIKE CONLEY https://t.co/qpnRy9XqsI",
    "733": "@Xxtragarlic @celtics The Jazz",
    "734": "@celtics Damn that was close, actually unlucky, still annoyed we can’t shake off being a .500 team!",
    "735": "@Xxtragarlic @celtics The jazz",
    "736": "I love the Boston Celtics ☘️",
    "737": "@celtics Why the fuck did they hit every three",
    "738": "@celtics What a great shooting second half",
    "739": "@celtics Conley tonight: https://t.co/17WH2jqIsv",
    "740": "@LordBrOFFICIAL @celtics did you watch the game? out of the 27 probably 20 of them were contested",
    "741": "@celtics We played great. Closeouts and contests were good, these guys are playing 2k. Good game",
    "742": "@celtics Pain",
    "743": "@JShuttlesworthh @celtics It is a bit annoying how we lose to a team that we know won’t be successful in the playoffs but that’s the NBA. Onto the next. League is just a joke how we have west coast trip and back to back to back to back games. Just stupid. Clearly they want someone to injured. Gg’s",
    "744": "@celtics THE REFS PUT YALL AT THE FT LINE THE WHOLE 4TH QTR AND YALL STILL LOST!!!\nHahahahahHAH! 🤣🤣🤣",
    "745": "@JacquesD10_ @ninjanate1024 @celtics It’s called the Utah Jazz",
    "746": "@celtics Why does everyone become prime Golden State when they versus us? https://t.co/yVdodFoGs3",
    "747": "34 points for Donovan Mitchell to lead the Utah Jazz over the Boston Celtics! #NBA75 \n\nVisit https://t.co/K9jJDOXjil for other updates. https://t.co/77N3ZlYMYm",
    "748": "@celtics Not that bad of a loss I’ll be honest, they couldn’t miss. Celtics fought hard but dam spida and Conley are strapped",
    "749": "Boston Celtics (+8.5) 💰",
    "750": "@Tyler1Chad @celtics Tyler “brain dead” chad",
    "751": "@celtics Awesome game. Cant do much when every prayer that Utah chucked up was answered #BleedGreen",
    "752": "@K843_T @celtics So many bs bro its insane",
    "753": "Couldn’t ✋ @utahjazz threepointers, so @celtics lost 😞 https://t.co/tK2X1KsFMu",
    "754": "@celtics Dont Worry. i didnt expect we were gonna face the 2016 Warriors today either",
    "755": "@celtics THAT WAS THE BEST CELTICS GAME IN TWO YEARS AND WE LOSE!!!!!",
    "756": "@celtics Celts fans. take this game as a W. those bums needed 30 lucky 3s to fall to win by 7. great game by the Cs.",
    "757": "@celtics That wasn’t even good basketball by the jazz..",
    "758": "Tough @Celtics loss despite 37 points by @jaytatum0 (27 points in 2nd half)! Utah Jazz shot lights out from 3-point range making 27! Tough loss. Wish Cs played better defense in the 2nd half because allowing 137 points is gonna be tough to beat. #BleedGreen https://t.co/N9sDacrWr0",
    "759": "@celtics honestly expected to lose by +20 to the best offense team in the NBA right now. fantastic game and it felt good to finally see some shots go in.",
    "760": "@celtics sell the team and relocate please",
    "761": "@celtics bro i cant even be mad we didn't even play bad, Utah just put on sliders.",
    "762": "@celtics Can’t be mad about this one, they just hit everything",
    "763": "@celtics Drug test the entire jazz roster. We played super well tonight just nothign you can do when they don’t miss",
    "764": "@celtics Fucking pathetic https://t.co/CjZITr5QPt",
    "765": "@celtics Can't even be mad they mad everything even when it was contested",
    "766": "@celtics One of the best games Celtics have played all year offensively and the other team just happens to have an entire roster of curry’s 😂",
    "767": "@LordBrOFFICIAL @celtics Did you watch the game? They made some absurd, crazy 3’s that they will not make next game lol",
    "768": "@celtics tough loss, on to the next",
    "769": "@celtics How in tf do the Jazz shoots like that? Wtf",
    "770": "Game 22 ✔ (15-7) The @utahjazz beat the Boston Celtics 137-130 thanks to late heroics from Donovan Mitchell (34p) &amp; Mike Conley (29p)\n\nUp next: Road trip opens in Cleveland on Sunday afternoon (1:30 tip)\n\nScholarship Count: 1️⃣7️⃣\n\n#TakeNote #BOSvsUTA #NBATwitter   #NBA75 #NBA https://t.co/IbjmgtViOk",
    "771": "@celtics That was tough\n\nLove the genuine effort.",
    "772": "@celtics Honestly good game they played out of they minds and we need jb",
    "773": "@celtics Nothing we can do when the other team shoots 100% from 3. Win tomorrow",
    "774": "@celtics it was a good fight",
    "775": "@celtics whole mfing team turned into steph curry",
    "776": "@celtics These teams gotta be racist against the celtics, we always got teams breaking records on us",
    "777": "@celtics Good performance, they had the fakest night of their lives.",
    "778": "@KSite_ @celtics Lmao fr but i take this as a dub defense was amazing even though we broke they broke the 3pt record against us",
    "779": "@celtics Utah Jazz really just miraculously turned into the 2015 Warriors? Wtf?",
    "780": "@celtics klay* LMFAO",
    "781": "@LordBrOFFICIAL @celtics We played great defense they hit insane shots",
    "782": "@celtics Not mad tbh, Tatum looked fire tn",
    "783": "@celtics Drug tested the jazz fr they shooting like Steph Curry",
    "784": "@celtics I mean that’s an unwinnable game and we almost won. good job. we get so fucking unlucky",
    "785": "get a \"REAL COACH\" @celtics",
    "786": "@celtics Mike Conley is going to shoot 0-12 next game now😭",
    "787": "@celtics It’s fine Utah just felt like being the Warriors tonight oh well",
    "788": "@celtics Not even mad those mfs didn’t miss",
    "789": "@celtics Tbh praise to jazz they shot unreal in the 4th",
    "790": "@celtics Bad part was we didn’t even play that bad it’s just the jazz literally couldn’t miss any 3 they took",
    "791": "@celtics This wasn’t even a bad loss, Jazz jus shot like the 2016 warriors. Great fight imo",
    "792": "@martnextdoor_ @celtics ??? They made tough shots too man. Missing jb too. They did good",
    "793": "@celtics Whatever man. Thats just the definition of our team. Keep fighting till the end just to lose.",
    "794": "@celtics Mike conley had a genie with him giving him unlimited wishes for this game",
    "795": "@celtics Never seen a team get so lucky in my life",
    "796": "@celtics Conley scored 2 points his last game. Against the celtics he goes 7 for 7 from three. Cant make this up",
    "797": "@KSite_ @celtics Lmfaoooo blow the blazers out time",
    "798": "@celtics The better team won. What 3 pt shooting was that 😳",
    "799": "@celtics conley 7-7 from 3 and mitchell couldn't miss in the final minutes smh https://t.co/5clcxwdfar",
    "800": "@celtics Win a ring in the HD TV era",
    "801": "@celtics Utah isn’t a real state anyways, no worries fellas",
    "802": "@celtics TRADE SMART HE IS TRASH",
    "803": "@celtics Idc we played great Jazz hit so many stupid shots, no wonder they always flame out in the playoffs. On to the next one.",
    "804": "@celtics Way to blow in the 4th again",
    "805": "@celtics fought hard fellas, good game. took a historic offensive performance to barely beat us WITHOUT jaylen playing",
    "806": "@celtics get a \"REAL COACH\"",
    "807": "@celtics Played well but this Jazz team is on drugs lol",
    "808": "@celtics Celtics played on HOF but Jazz played on custom. Conley is a monster",
    "809": "@celtics Mitchell and Conley from 3 tonight: https://t.co/FvzvmQPvyD",
    "810": "@celtics we played well nothing you can do against that",
    "811": "@celtics Guard the 3 next time maybe",
    "812": "@celtics May have lost but team still played good so I’m not disappointed",
    "813": "@celtics Donovan Mitchell for Jaylen Brown. \n\nWho says no ?",
    "814": "@celtics Not mad.They just have custom sliders with 3 pointer maxed out",
    "815": "@celtics Nobody: \n\nThe Jazz: https://t.co/D6yhgMzlpa",
    "816": "@celtics Great effort fellas.",
    "817": "Can't even be mad about this one. The Jazz made 27 3s on close to 53% shooting. One hell of a shooting night. \n\nAnd the @celtics only lost by 2 possessions. Pretty absurd game. #BleedGreen #BOSvsUTA",
    "818": "@celtics We win with JB and if Jazz don’t have the best shooting night in NBA history",
    "819": "@celtics can’t even be mad, mfs turn into steph and joy against us😂",
    "820": "@celtics Brown needs to get healthy and stay healthy.",
    "821": "@celtics Great effort Utah just refused to miss a single 3",
    "822": "@celtics mike conley is insane",
    "823": "@celtics can't say anything tbh good game!!",
    "824": "@celtics good game seriously jazz doesn’t fucking miss",
    "825": "@celtics It’s not fair we played so well",
    "826": "@celtics Didn’t play rob when don and Conley were hot nice 👍",
    "827": "@celtics Not bad for having our best player out",
    "828": "@celtics Someone photoshop Mike Conley heads on the JFK assassination photo",
    "829": "@celtics We gave up 27 threes i dont want to fucking hear it",
    "830": "@celtics Ime \"BrainDead\" Udoka #FireImeUdoka",
    "831": "@celtics what even is this? ffs https://t.co/1j87GfW1yg",
    "832": "@celtics Unbelievable game. They wouldn’t miss",
    "833": "@celtics Fluke loss doesnt count in my book",
    "834": "@celtics Tatum still owns Mitch https://t.co/SOKAxxu632",
    "835": "Let’s beat Portland tomorrow @celtics",
    "836": "@celtics Welp",
    "837": "@celtics so much pain.",
    "838": "@celtics Pain",
    "839": "@rstorrs15 @celtics Have an awesome time! Smile Rhett. LOL",
    "840": "@celtics you guys did good",
    "841": "@celtics Drug test the whole Jazz roster immediately",
    "842": "@celtics Unbelievable",
    "843": "@celtics Yeah i got nothing, cant win when ur opponents just literally dont fucking miss",
    "844": "@celtics Celshit fans will never admit it but Mitchell is light years ahead of Tatum.",
    "845": "Final https://t.co/x1dyFq4lZC",
    "846": "@celtics can y’all not mess with my blood pressure?",
    "847": "I swear every game is the same @celtics smh PAIN",
    "848": "Josh Richardson - Boston Celtics\n11 PTS\n3 RBD\n1 AST\n2 STL\n1 TO\n[FD(21.1) DK(20.25)]",
    "849": "Dennis Schroder - Boston Celtics\n26 PTS\n2 RBD\n3 AST\n1 STL\n2 TO\n[FD(33.9) DK(35.5)]",
    "850": "Al Horford - Boston Celtics\n21 PTS\n6 RBD\n9 AST\n1 BK\n1 STL\n1 TO\n[FD(46.7) DK(47)]",
    "851": "Jayson Tatum - Boston Celtics\n37 PTS\n6 RBD\n5 AST\n1 BK\n[FD(54.7) DK(55)]",
    "852": "Mitchell/Conley: 13 3PM\nBoston Celtics: 14 3PM",
    "853": "@TheFrankIsola @Scalabrine nothing like @celtics loss on a Friday night. Y’all talking all that @utahjazz",
    "854": "The Utah Jazz made a season-high 27 threes and knocked off the Boston Celtics 137-130.\n\nDonovan Mitchell led the Jazz with 34 points. \n\n#takenote \n\nhttps://t.co/rsl9CblxCB",
    "855": "@celtics so uh… kinda awkward, but wanna Venmo me the $50 I was supposed to win if y’all didn’t trust Dennis so much?",
    "856": "Please get this fucking bum Schroeder off the roster immediately @celtics",
    "857": "Ya gotta just tip your hat when Mike freakin Conley played a perfect game against your team 🤷🏽 @CELTICSBLOG @NBCSCeltics @celtics #celticstalk",
    "858": "Good fight tho boys @celtics",
    "859": "I just watched @spidadmitchell get a layup from a backdoor cut at the logo. Wtf D is @celtics running?!?",
    "860": "@celtics one day we will learn how to finish a game",
    "861": "Good effort @celtics ridiculous 3-point shooting by the Jazz",
    "862": "Nah Utah shot lights out tonight. Good game @celtics",
    "863": "@celtics I hate you, my disappointment is immeasurable and my day is ruined",
    "864": "What a really fun game and a really fucking awful feeling getting pummeled by the 3 @celtics",
    "865": "@PtGisBACK @celtics @utahjazz Lots of empty stats",
    "866": "I am once again tweeting about how much the @celtics STINK",
    "867": "@PtGisBACK @celtics @utahjazz He’s everything we wish Tatum was",
    "868": "@PtGisBACK @celtics Utah has a closer. We don’t",
    "869": "@TheOnlyKingDevo @NBA @celtics @utahjazz Take this ratio",
    "870": "👀@celtics gave up 26 3’s #ayoo #cmon #nah",
    "871": "@celtics Mike Conley 6-6 threes and Tatum 1-9 .\nThat 1-9 costing us the game.\nEffort will show only L in the result column.",
    "872": "@NBA @celtics @utahjazz i can't accept",
    "873": "@NBA @celtics @utahjazz Don't care unfortunately",
    "874": "I’m sure “Utah Jazz vs Boston Celtics” is an actual basketball game https://t.co/cJdPtZNDCb",
    "875": "The @utahjazz were up by 7 with under two minutes remaining by the @celtics trimmed it to two. \n\nHowever, Mike Conley answered with a huge three to extend the Jazz lead to 130-125 with 57 seconds left to play. \n\n#takenote \n\nhttps://t.co/rsl9CblxCB",
    "876": "Good night @celtics",
    "877": "Tmnc Boston Celtics",
    "878": "Y’all kill me man @celtics",
    "879": "@seibxdawted @NBA @celtics @utahjazz Terrible news this ratio",
    "880": "@celtics fire Udoka, why do we have Al shooting 3s in the clutch",
    "881": "@celtics are rough at the end of games man",
    "882": "Spida extends the lead with 2:33 to play!\n\n@celtics  120\n@utahjazz 124\n\nQ4 on NBA League Pass: https://t.co/V0kkYEEIkG https://t.co/PVJVdaujFU",
    "883": "@celtics Damn tatum. Dont keep shooting 3's when you cant hit them.",
    "884": "Come on @celtics. My blood pressure can’t take thus!!! https://t.co/beFrw84qqI",
    "885": "@celtics Why are we driving in front of gobert. Do we want to lose possessions?",
    "886": "Utah has been sick from three points tonight @Celtics should be winning",
    "887": "Please take Schroder off the court @celtics",
    "888": "NOT IN MY HOUSE FILS DE PUTE @celtics",
    "889": "Mitchell is good in big moments @celtics @utahjazz",
    "890": "Wow these Boston Celtics are impressive. They fight man! Great game in Utah",
    "891": "@celtics @smart_MS3 is so underrated",
    "892": "@celtics Come on Celtics",
    "893": "NBA Live Scores: UTA v BOS 119-120 3:20mins rem in 4Q (BOS breaks the tie, still anyones game)...  @celtics",
    "894": "@celtics How much you paying the refs?",
    "895": "@celtics I think we should try winning the game imo tbh",
    "896": "@celtics Nice passsss",
    "897": "@celtics Jazz got a fucking Zen",
    "898": "JT ➡️ Rob https://t.co/z79GpefjoR",
    "899": "@jake89761 @celtics @Al_Horford Refs saw your tweet and said sike",
    "900": "If Utah losses to the Boston Celtics offense ina game where they hit 25+ threes they will never be taken serious again",
    "901": "@celtics Ingles corpse in the back",
    "902": "Nice 9-0 run to take the 113-109 lead with 6 minutes left in the 4th quarter, @Celtics! 👀 #LetsGoDefense #BleedGreen #BOSvsUTA",
    "903": "Timeout 4Q 6:13 \n\n@celtics 113 x 109 @jazz \n\n#bleedgreen #nba75",
    "904": "@rob_thibeault @celtics i need to clean my eyes after this",
    "905": "boston celtics are back",
    "906": "Tatum’s shooting might be bullcrap but his passing has been A 👌 so far this season @NBCSBoston @NBCSCeltics #celticstalk @celtics",
    "907": "THE BOSTON CELTICS ARE GOOD",
    "908": "Let's go, Boston Celtics! ☘ #TimeLord #JaysonTatum #Celtics @CausewayStreet https://t.co/EpdIZGUVgc",
    "909": "This is the @celtics team we want to watch every night",
    "910": "BOSTON CELTICS BASKETBALL",
    "911": "Plz win @celtics",
    "912": "Joel Embiid Drops 28, Late Go-Ahead Bucket as 76ers Outlast Trae Young, Hawks: The Philadelphia 76ers bounced back from an 88-87 loss to the Boston Celtics on Wednesday with a 98-96 win over the Atlanta… https://t.co/EGNBtAQzhd #AtlantaHawks #BNTNBA #Basketball #BreakingNews https://t.co/QrcQYQwroo",
    "913": "@ja_owns_curry @celtics Tell jimmy giannis wants dinner done by the end of the day",
    "914": "@celtics The staredown afterward https://t.co/ueu2LDZ3YI",
    "915": "@celtics They just hit everything bruh. Im losing my fucking sanity",
    "916": "@celtics Stop giving up 3s",
    "917": "According to @NBCSBoston the @celtics have allowed the @utahjazz to hit the most 3’s in a game in team history!! #TakeNote",
    "918": "@LordBrOFFICIAL @celtics tell ur team to accomplish holding a lead first jimmy butler is everything jayson tafraud wants to be",
    "919": "@celtics @celticsblog \nF*ck those splash uncles Bogdan and Ingles just let them retire",
    "920": "Please win @celtics",
    "921": "Idc how many thress the jazz make just win the game @celtics",
    "922": "Let’s go @celtics",
    "923": "@kjhogo @celtics Bro just stfu and enjoy the game 😂",
    "924": "@NiaLong @celtics How you doing nia? I’m a fan of yours.",
    "925": "Timeout 4Q 8:15 \n\n@celtics 104 x 109 @jazz \n\n#bleedgreen #nba75",
    "926": "@celtics Great lineup! It is a very close game! I am listening to the game on the radio 98.5 FM. The lead keeps changing. Keep getting the baskets. Beat the Jazz and win the game. GO CELTICS!",
    "927": "COVER the 3's @celtics",
    "928": "@2yacatalan @celtics Pleure☺️",
    "929": "Take a look on the scoring table at @nba @celtics at @utahjazz tonight. Close game, 104:103\n\nGo @celtics for 🏀✌️ https://t.co/wXfBitvxHn",
    "930": "Timeout 4Q 9:41 \n\n@celtics 104 x 103 @jazz \n\n#bleedgreen #nba75",
    "931": "@NBAOfficial the @celtics need all the help they can get … keep calling those bullshit calls #TakeNote",
    "932": "Imagine a 6’10 backing you down like this and hitting you with that spin. Nothing you can do. \n\n🎥 @celtics https://t.co/WTc6lGgJkH",
    "933": "Sorry, one threepointer for @utahjazz at the end of 3rd vs. @celtics https://t.co/T8YM4xXFck",
    "934": "@ja_owns_curry @celtics Jimmy Neutron hasnt accomplished anything in his career besides getting destroyed by Bron in the finals",
    "935": "@honestJBfan @celtics Bad rotations led to wide open 3s in this quarter but they been making sum bs shits bruh💀",
    "936": "@celtics @AnnaHorford Al is 🔥 tonight. So glad he came back home  ☘️",
    "937": "@celtics ofc you guys are losing jimmy is your father and soon donavan will own your franchise as well",
    "938": "@honestJBfan @LordBrOFFICIAL @celtics They keep making 3s with one second on clock",
    "939": "@celtics 9 less threes than them and only down 3. Pretty impressive tbh",
    "940": "@celtics with a 12-0 Run vs. @utahjazz in second quarter 🏀 coming back 👍\n\nNow 97:97 end of 3rd. #DennisSchroder 20 points so far. #Tatum 26 and #Horford 21 points.\n\n@celtics go for victory ✌️ \n\n#NBA \n\n https://t.co/NHThzpgjWo",
    "941": "@celtics He should pick up golf or tennis. Semi contact sports are not his forte.",
    "942": "@celtics How they shoot like this and not make it to the championship smh",
    "943": "Maybe play some defense? @celtics",
    "944": "@celtics They just don't miss the 3, no matter how contested it its.",
    "945": "@celtics Utah play style so fucking ugly. I need them to miss the rest of their threes forever",
    "946": "@celtics GUARD THE FUCKING 3. FUCK. THEYVE BEEN DOING THE SAME SHIT SINCE THE START OF THE GAME",
    "947": "@celtics Mike Conley is going to give me nightmares tonight....",
    "948": "@celtics Dont sleep in the 4th, push them and break them down.",
    "949": "@4Mooncakee @celtics They’re literally playing awful basketball then hitting a contested 3 it makes me sick",
    "950": "@celtics Haven’t seen the jazz miss a single 3",
    "951": "@celtics We are playing great rn keep it up boys",
    "952": "@celtics Nothing you can do, Every Jazz player just turned into Ray Allen today",
    "953": "@celtics Trade Jaylen",
    "954": "@celtics This game is such a good watch!",
    "955": "@LordBrOFFICIAL @celtics We are guarding it most of the time they are just making chuckers",
    "956": "@celtics drug test that entire team wtf they aren’t missing",
    "957": "@celtics Mike is super old god damn",
    "958": "@celtics Cmon boys",
    "959": "@celtics they cant fucking miss from three man -_-",
    "960": "@4Mooncakee @celtics So true.",
    "961": "@celtics I did not know the Jazz had 5 Steph curry's",
    "962": "@celtics Can we guard the 3 PLEASE omfgggggggg",
    "963": "@celtics They literally can’t miss from 3 wtf",
    "964": "@weirdishhh @celtics @Al_Horford At this point they’re making everything 3z",
    "965": "12 to play ⏳ https://t.co/sEMlZV78US",
    "966": "@celtics @Al_Horford Don’t wanna play defense today?",
    "967": "After three, the @utahjazz lead the @celtics 100-97. \n\nNot much defense here as both teams give up 41 third quarter points. \n\n#TakeNote \n\nhttps://t.co/3LfpeNX93B",
    "968": "@EnesFreedom @Olympics Fan of you as a player (go @celtics!). 🍀🏀 Huge fan of you as a fighter for human rights.  💪🏽",
    "969": "@celtics put in Rob Will there is money at stake here 😡",
    "970": "How about them @celtics tho right now... good game that going right now .... they might go into #overtime wyt @ESPNNBA @NBAonTNT",
    "971": "@joseignacio117 @celtics You weep about 3 shots in a quarter. Braindead",
    "972": "Imagine the @celtics hit on a late pick Like a jokic….nope just guards guards and yep more guards #NBA75  #NBATwitter",
    "973": "@kjhogo @celtics Lmaoooooooo",
    "974": "@MaineCeltics @nbagleague @celtics Where can I get 1?",
    "975": "Timeout 3Q 3:11\n\n@celtics 89 x 92 @jazz\n\n#bleedgreen #nba75",
    "976": "@LeBronsDaddi @celtics G shit bro LMAO",
    "977": "@celtics Chill out Mr. Smart",
    "978": "@Landon2kWRLD @celtics @Al_Horford Solid",
    "979": "Man I love a good back and forth basketball game. Let’s goooo @celtics ☘️",
    "980": "@arxanii @catwomyn31 @ATLHawks @celtics @hornets @chicagobulls @dallasmavs @nuggets @warriors @LAClippers @Lakers @memgrizz @MiamiHEAT @Bucks @PelicansNBA @nyknicks @OrlandoMagic @sixers @Suns @SacramentoKings @Raptors Y'all @'n everyone yet we don't even know what we might not want anything those teams have to offer.",
    "981": "@SmarcusAureliu1 @celtics Seriously? We're talking basketball on Twitter on a Friday night. We don't need the grammar police - get lost",
    "982": "Don't let me regret you Tatum, I couldve just stuck with my Utah boys and got it going.\n#Utah #Boston #Celtics https://t.co/Jttp55LypP",
    "983": "@celtics Celtics stay healthy challenge",
    "984": "Hey @HoustonRockets I think the @celtics sent you some leprechaun luck ☘️ You’ve won every game since losing to the @celtics 😂 https://t.co/ZVe8TudNJ1",
    "985": "@arxanii @ATLHawks @celtics @hornets @chicagobulls @dallasmavs @nuggets @warriors @LAClippers @Lakers @memgrizz @MiamiHEAT @Bucks @PelicansNBA @nyknicks @OrlandoMagic @sixers @Suns @SacramentoKings @Raptors PSA I’ve heard THJ might be down a while Mavs you can jump in the sweepstakes. We’re charging two FRP though division rival premium you know how it goes 😂",
    "986": "@Grant2Will jumpshot has improved so much! 🍀☘️🏀 #Celtics #CelticsNation #BleedGreen @celtics",
    "987": "Rookie Grant Williams and the Grant now is night and day! @NBCSCeltics @celtics #celticstalk",
    "988": "@arxanii @ATLHawks @celtics @hornets @chicagobulls @dallasmavs @nuggets @warriors @LAClippers @Lakers @memgrizz @MiamiHEAT @Bucks @PelicansNBA @nyknicks @OrlandoMagic @sixers @Suns @SacramentoKings @Raptors LMAOOOO U BASTARD",
    "989": "@arxanii @ATLHawks @celtics @hornets @chicagobulls @dallasmavs @nuggets @warriors @LAClippers @Lakers @memgrizz @MiamiHEAT @Bucks @PelicansNBA @nyknicks @OrlandoMagic @sixers @Suns @SacramentoKings @Raptors Thank you for your hard work brother. Someone has to do it.",
    "990": "@celtics Take my right ankle or take @Noah_Sayed529 right ankle",
    "991": "@celtics @Al_Horford Fire training staff NOW",
    "992": "@celtics @Al_Horford He’s 25 like JT 19",
    "993": "@celtics Nothing to say!!!...damn it haizz",
    "994": "Ummmm... where is Rob?\n@celtics",
    "995": "@jake89761 @celtics @Al_Horford Shits annoying lol",
    "996": "Timeout 3Q 8:37 \n\n@celtics 66 x 71 @jazz\n\n#bleedgreen #nba75",
    "997": "@celtics  sign me i could do better than are whole roster.",
    "998": "@celtics @Al_Horford He’s basically 20 in his 30s",
    "999": "@celtics @Al_Horford Why is a 80 year old carrying us",
    "1000": "@joseignacio117 @celtics You all are",
    "1001": "@celtics @Al_Horford Refs winning utah the game",
    "1002": "@arxanii @ATLHawks @celtics @hornets @chicagobulls @dallasmavs @nuggets @warriors @LAClippers @Lakers @memgrizz @MiamiHEAT @Bucks @PelicansNBA @nyknicks @OrlandoMagic @sixers @Suns @SacramentoKings @Raptors He’s gonna be a big piece for a contender. Let’s get EG to a contender and get some more draft capital!!",
    "1003": "@arxanii @ATLHawks @celtics @hornets @chicagobulls @dallasmavs @nuggets @warriors @LAClippers @Lakers @memgrizz @MiamiHEAT @Bucks @PelicansNBA @nyknicks @OrlandoMagic @sixers @Suns @SacramentoKings @Raptors Pels you can have him for your pick this year. Don’t think about it I promise you’ll make the playoffs 😂",
    "1004": "@celtics So much pain",
    "1005": "After losing to the @celtics the @HoustonRockets haven’t lost a game since 😂",
    "1006": "@celtics @yeahyeah22 UHHH......GIIINNN!!!!!!!!",
    "1007": "@celtics J.T🙋🏽 just be BALLING ON FIRE🔥🔥🔥💯 https://t.co/kVQuK1Fo6A",
    "1008": "@celtics pure hustle",
    "1009": "@leveillejeremy @celtics There*",
    "1010": "@celtics @AnnaHorford Al is having a hell of a game ❤️ so glad to have him back in Boston.",
    "1011": "@celtics Marcus !!!!!!!!",
    "1012": "@NBA @celtics If keeps going the way this game is going, he’ll to nah nah nah nahhhh Warriors don’t cover no damn 7 points!! Suns are no joke! Laying 7 with the GSW looks insane right now!",
    "1013": "Eric Gordon had 24 points on 71% shooting and hit the game winner tonight\n\n@ATLHawks @celtics @hornets @chicagobulls @dallasmavs @nuggets @warriors @LAClippers @Lakers @memgrizz @MiamiHEAT @Bucks @PelicansNBA @nyknicks @OrlandoMagic @sixers @Suns @SacramentoKings @Raptors",
    "1014": "Completely sick of checking in on @celtics box scores and seeing @jaytatum0 with more shots than points.",
    "1015": "Boston Celtics News - Romeo Langford will not return to the game after leaving with an ankle sprain. #RomeoLangford #bostonceltics #celtics #bostonathletes #boston #basketball #NBA #NBA75 #bleedgreen #goceltics #bostonathletemagazine",
    "1016": "@shooter_spike @celtics By FAR",
    "1017": "@celtics He’s injury prone move on",
    "1018": "@celtics and there he goes, out for his career lmao",
    "1019": "@kjhogo @celtics Bro…. look at the other comments lmao 🤦🏻‍♂️ he started off bad and now is better, relax dude haha",
    "1020": "@SmarcusAureliu1 @celtics A guy can roll his ankle without their being a foul on the play",
    "1021": "@celtics Well he’ll be out a month at least , this guy is made out of paper",
    "1022": "@MasonKessel @BigMacJonesStan @celtics What",
    "1023": "@nickdelpizzahut @celtics Ask the jazz and suns. No one ever gets hurt for them. We need to poach ppl from their training staff",
    "1024": "@celtics just end me now",
    "1025": "@celtics Pain",
    "1026": "@celtics The haters will say it’s only because he’s in the 4/5ths of a Mile High city",
    "1027": "@celtics Wtf he literally went back into the game the next play. Now he’s ruled out???",
    "1028": "@celtics I thought all trips were called fouls?",
    "1029": "@BigMacJonesStan @celtics Yeah a guy who's already made multiple Allstars, an AllNBA team, and led his team to two eastern conference finals  at only 23 years old definitely needs to quit basketball. I swear y'all have the dumbest takes",
    "1030": "@celtics FUCK ME RIGHT",
    "1031": "@celtics Pain",
    "1032": "@celtics every time he gets into a rythym smh",
    "1033": "@celtics NO WAY",
    "1034": "@Zedd89 @celtics Schroder is a 🤡, he miss every wide open shot, he sucks",
    "1035": "@celtics pain.",
    "1036": "@celtics Wasn’t a foul tho?",
    "1037": "@tics_in_6ix @celtics Me too 😂",
    "1038": "@celtics It was cool while it lasted, see ya next year Langford 🥲😞",
    "1039": "@celtics WHAT???",
    "1040": "@celtics What is having a healthy team? I wonder what it’s like",
    "1041": "@mattbm15 @celtics He needs to stop playing basketball bro",
    "1042": "@celtics Damn",
    "1043": "@celtics Not this again",
    "1044": "@celtics pain",
    "1045": "@celtics fuck",
    "1046": "@celtics Romeo is injury prone",
    "1047": "@celtics PAIN",
    "1048": "@W4k3up_ @AidanGLT @celtics Exactly",
    "1049": "#NEBHInjuryReport Romeo Langford (right ankle sprain) will not return.",
    "1050": "you ever watch the boston celtics and wonder what could have been",
    "1051": "@celtics Play Parker",
    "1052": "@celtics OHHH FUHHH😩😩😩",
    "1053": "@fiftyskies @BigMacJonesStan @celtics Averaging 7 rebounds and 3 assists and dropping 40s and 50s while also being a superstar but eh you know just like run of the mil",
    "1054": "Strong defense in the 2nd quarter! Keep it up, @Celtics!  #BleedGreen BOSvsUTA https://t.co/zEUo5do493",
    "1055": "@celtics If JT drove like this more consistently instead of settling for jumpers…",
    "1056": "@BigMacJonesStan @celtics This team is paying a guy over $20m to average 9 points a game and this is  the one thing that jumps out to you",
    "1057": "@celtics Best halftime show ever ! #starwars",
    "1058": "@BigMacJonesStan @mattbm15 @celtics bum hating on his own players weirdo",
    "1059": "Boston Celtics News - Halftime: Jazz 59, @celtics 56. #bostonceltics #celtics #bostonathletes #boston #basketball #NBA #NBA75 #bostonsports #bleedgreen #goceltics #bostonathletemagazine https://t.co/GK8rkymhEd",
    "1060": "@kjhogo @celtics Looks like you just started watching the game, that comment was based on his first quarter, dummie",
    "1061": "@BigMacJonesStan @celtics You act like 5/12 is terrible. He just needs to stop shooting threes and keep driving, 0-5 from three and 5/7 on non threes",
    "1062": "@celtics Let’s go, let’s win tonight boys",
    "1063": "@celtics Let’s go!!",
    "1064": "@celtics CELTICS. That was a massive second quarter",
    "1065": "@celtics Thank u Thunder",
    "1066": "@mattbm15 @celtics Mans is 5/12 0/5 from 3",
    "1067": "@celtics Al is a joy to watch.",
    "1068": "@celtics Horford owns Rudy",
    "1069": "@BigMacJonesStan @celtics He's scored like every time he's driven to the rim tonight",
    "1070": "@celtics Al's move in the paint had me like... https://t.co/gPZ5i1OAae",
    "1071": "@celtics please keep up the same 2nd quarter energy i’m begging you https://t.co/iXPZytWhCa",
    "1072": "@BigMacJonesStan @celtics Ratio",
    "1073": "@celtics 👏Not a bad 1st half considering how we started lol…now let’s see how we finish☘️🏁",
    "1074": "@celtics Marcus smart all star 2022",
    "1075": "@celtics So can we call this best 2nd quarter of the year thus far?",
    "1076": "@celtics Damnnnn😟",
    "1077": "@celtics BENCH SCHRODER",
    "1078": "@celtics Big Al Masterclass",
    "1079": "@celtics Yo what is this Star Wars shit LOLOL",
    "1080": "@celtics keep it up, loving how everyone’s playing",
    "1081": "@celtics Tatum is so bad lol",
    "1082": "We've got ourselves a game in Utah\n\nA. Horford - 19 PTS, 4 AST https://t.co/NoeFrDIeoC",
    "1083": "@celtics Fire scal",
    "1084": "@HoopsForHaiti12 @celtics My Teams app",
    "1085": "@SLAMonline @celtics Boxed the shit out of Gobert the previous possession too.",
    "1086": "@celtics yeah,, MOST OF US,,,, NEVER GONNA WIN the \"BIG ONE\"with Marcus,,,he destroys any decent offense‼️‼️‼️‼️‼️‼️trade his fucking egotistical ASS😁",
    "1087": "HELLO MARCUS SMART. (via @celtics) https://t.co/vgLWkNy3J6",
    "1088": "Boston Celtics News - Jazz lead 38-25 over the @celtics at the end of the 1st Quarter. #bostonceltics #celtics #bostonathletes #boston #basketball #NBA #NBA75 #bostonsports #bleedgreen #goceltics #bostonathletemagazine https://t.co/cYuI2x3VEj",
    "1089": "@celtics Al is on fire.",
    "1090": "@YahooSportsNBA @celtics That’s what he should be doing 80% of the time. Driving the ball to the basket!",
    "1091": "Lovin the fight of the @celtics and finally Tatum starts driving to the basket",
    "1092": "@celtics Take that booster shot, bitch",
    "1093": "@celtics the bench lol",
    "1094": "@NBA @celtics Overrated so it doesn’t really count",
    "1095": "Jayson Tatum has MOVES 🥶\n\n(via @celtics)\nhttps://t.co/gkfw6QaKLA",
    "1096": "Come on @celtics one more half",
    "1097": "@celtics imma need that a screensaver",
    "1098": "@fxrssj_ @celtics “Very good” 💀",
    "1099": "@celtics MARCUS SMART FOR THE SLAM DUNK CONTEST https://t.co/6V5WzWTTmf",
    "1100": "@celtics Drug test needed. Never seen him dunk in my life",
    "1101": "@celtics @smart_MS3 are you are aware this man has a family ?",
    "1102": "@celtics ON HIS FUUUCKIN HEAD",
    "1103": "@celtics don’t care ,win",
    "1104": "@celtics SHEEEESH",
    "1105": "@celtics Randy orton that shit",
    "1106": "@celtics THANK YOU! https://t.co/Ry3l6gFxEV",
    "1107": "@celtics On his head! https://t.co/30EqstayVC",
    "1108": "Marcus Smart flies in for the strong putback 💪\n\nWatch @celtics and Jazz on NBA League Pass now: https://t.co/V0kkYEEIkG https://t.co/g2MqheK7Ip",
    "1109": "@celtics exposed that french fraud",
    "1110": "@celtics PUTBACKKK DUNKKKK",
    "1111": "@celtics NEVER KNEW HE HAD IT LIKE THAT",
    "1112": "@celtics OH MY GOODNESS",
    "1113": "A really tough second quarter sees the @celtics outscore the @utahjazz 31-21 to trim the lead to just three at the break. \n\nThree Jazz players are in double-figures, but Al Horford has 19 points for Boston. \n\n#TakeNote \n\nhttps://t.co/XjIePdMDvC",
    "1114": "@celtics Smart putback crazy https://t.co/iKm8qIzyV8",
    "1115": "@celtics THANK YOU",
    "1116": "Boston Celtics flying back home tonight https://t.co/vF1z6zIanr",
    "1117": "SMART OUTTA NOWHERE https://t.co/IPYjSD5WtX",
    "1118": "Hit 'em with the St. Louis Shuffle. (via @celtics) https://t.co/nMPwXALjm6",
    "1119": "@DanPassenNH @celtics @utahjazz Awful start but nice rally. Feel good with the halftime score. Horford is a beast!!",
    "1120": "@celtics Comfortably too! We need more of that from JT. If the 3's aren't sticking, these skillful 2's will do just nicely! 🏀🌟💚☘️",
    "1121": "@celtics damn bitch play defense!",
    "1122": "@celtics smart",
    "1123": "@celtics POST SMART DUNK",
    "1124": "@celtics Give me the smart poster",
    "1125": "@celtics 0/5 from three🔥",
    "1126": "@celtics Post Smart’s putback tf🤨",
    "1127": "@celtics Post the Smart dunk",
    "1128": "@celtics Do the Marcus dunk",
    "1129": "@celtics Post Smart",
    "1130": "@celtics Idc post Smart poster on Rudy",
    "1131": "@celtics POST MARCUS SMARF",
    "1132": "@celtics Too easy",
    "1133": "Straight through three defenders like it's nothing 🔥 https://t.co/DzEUtCExe6",
    "1134": "@MikeCroninWMUR @celtics @utahjazz Need all the mojo, Mike!!!",
    "1135": "@stickynickyyyy New York lingo… \nThe New York Knicks beat the Boston Celtics. And also the sound of the subway doors",
    "1136": "@celtics Killing me I can’t watch Celtics gamdd we on this flight. Who knows a website"
}