{
    "0": "Spurs 1st half ML -110 since I’ll be at the game need some courtside action!\n\nSorry Wizards but I like San Antonio tonight https://t.co/02riBvWW6u",
    "1": "NBA Player Prop:\nDoug McDermott Over 12.5 Points -124 (San Antonio Spurs)\n\nNew look Wizards don't defend Forwards well and McBuckets is hot right now achieving this number 4/L5, 6/L10\n\n*Fwiw I have McDermott projected to have 3.4 3pm tonight",
    "2": "San Antonio Spurs Starters:\n\nDejounte Murray\nDevin Vassell\nDoug McDermott\nKeldon Johnson\nJakob Poeltl\n\nPlayers out:\nRomeo Langford\nJoshua Primo\nJosh Richardson\n#PorVida #NBA #NBATwitter #NBA75",
    "3": "San Antonio Spurs: NBA Announces Summer League Schedule https://t.co/xrS0uo6dmC",
    "4": "Tonight's starting lineup for the San Antonio Spurs: Murray, Vassell, Johnson, McDermott, Poeltl https://t.co/bVWH4AMCA2",
    "5": "🏀 Wizards vs San Antonio Spurs\n🏆 NBA\n🗓 25/feb.\n⏰ 21:00\n📺 NBA LEAGUE PASS",
    "6": "Game Thread: San Antonio Spurs (23-36) at Washington Wizards (27-31) Feb 25 2022 7:00 PM https://t.co/1EJwlRiOOf",
    "7": "It’s time for Basketball: San Antonio Spurs at Washington Wizards https://t.co/MR4YDZRcUs https://t.co/Z5vuxlI5Ph",
    "8": "🍽️Buffet's Pick ($25 to $2500 Fun Play) (6th Attempt)\n\n`#4 ($121.66 to $229.93)`\n\n(#NBA)\nWashington Wizards Vs San Antonio Spurs\n\n_**FQ Sans Antonio Spurs -1 @1.89**_\n\n#GamblingTwitter",
    "9": "Washington Wizards vs San Antonio Spurs EN VIVO \nhttps://t.co/nYj9l5pxjs https://t.co/brE8CVSnbC",
    "10": "Consensus Line Move:\n2022-02-25 San Antonio Spurs at Washington Wizards from 224.50 to 225.50\nOver business... man\n#NBA #soccer #programming #binaryoptions",
    "11": "@RonaldAllenJr @_KoBean_ @RealDCJerseyBoy @RealTalk900 In the 4th quarter of game 6 of the 2013 nba finals Lebron James scored 16 points in the 4th quarter. The San Antonio spurs as a TEAM scored 20.  That’s not doing it in the finals? LMAO Lebron had back to back 41 point games in the 2016 nba finals. That’s not doing it? LMAO",
    "12": "NBA 02/25🏀\n\nSan Antonio Spurs ML (-160) 2U⭐️\nBam Adebayo O10.5 Reb (-105) 1U\nReggie Jackson U19.5 Pts (-130) 1U\n\nHopefully we do a bit better on the props today but Spurs are the big one today\n\n#NBAPicks #NBA #sportsbettingpicks",
    "13": "NBA Betting Preview: San Antonio Spurs vs. Washington Wizards - Friday, February 25, 2022 https://t.co/W6jemYd1jp",
    "14": "RT @austin_spurs: Who’s down to play some @spurs trivia?🙋‍♂️ \n\nWe quizzed die-hard Spurs fan &amp; Austinite, David Fuentes on his San Antonio Spurs knowledge! \n\nChoose the answer below and check our instagram to see if you got it right👌 https://t.co/lAPgWQ1l1f #actnearn #sct",
    "15": "The \"No Graphics Guy\" Parlay 😂\n\n• Richmond ML\n• Miami Heat ML\n• San Antonio Spurs ML\n• Columbus Blue Jackets +3.5\n• Penn State ML\n\n+700 \n\nTail responsibly my friends. 💪🏽",
    "16": "2/25/22\nToday’s #MoneyMoves\nSan Antonio Spurs ML\nVegas Golden Knights ML\n\nLooking to rebound from a frustrating day yesterday. Let’s get it! \n#GamblingTwitter",
    "17": "San Antonio Spurs’ Zach Collins eager for second-half springboard https://t.co/SqjlhdJnAG",
    "18": "San Antonio Spurs’ Zach Collins eager for second-half springboard https://t.co/Sgaj2Tf1aO",
    "19": "Who’s down to play some @spurs trivia?🙋‍♂️ \n\nWe quizzed die-hard Spurs fan &amp; Austinite, David Fuentes on his San Antonio Spurs knowledge! \n\nChoose the answer below and check our instagram to see if you got it right👌 https://t.co/EBm0sfMQaC",
    "20": "Spurs: San Antonio #Spurs at Washington Wizards - 2/25/22 NBA Picks and Prediction - PickDawgz https://t.co/X5GGe072cQ",
    "21": "San Antonio Spurs are Coming off a 1 game winning streak #Spurs  Full odds at https://t.co/nUn5OcMhOI",
    "22": "Are you heading to the San Antonio Spurs vs. the Washington Wizards game tonight? Stop in and pre-game with us or join us after the game to keep the night going strong! \n#washingtonwizards #sanantoniospurs #rooftopdc #supportlocalbusiness #mydccool #exposeddc #rooftophappyhour https://t.co/hrxEtlJcvE",
    "23": "San Antonio Spurs Last 10 games: 5 Win 5 Lost  (PF)116.2 - (PA)114.5 #Spurs  Full odds at https://t.co/nUn5OcMhOI",
    "24": "Today's NBA Consensus (So Far):\n\nMiami Heat 77%\nPhoenix Suns 77%\nToronto Raptors 71%\nPhiladelphia 76ers 70%\nSan Antonio Spurs 67%\nLos Angeles Lakers 65%\nIndiana Pacers 58%\nOrlando Magic 57%\nUtah Jazz 53%",
    "25": "Washington Wizards Predictions and Preview for 2/25/2022 hosts San Antonio Spurs.  Find out who we are taking in this matchup. #Punters #Sportsbook https://t.co/YN3VmSpjJz",
    "26": "San Antonio Spurs: Washington Wizards vs San Antonio #Spurs - Preview, Tips and Odds - Sportingpedia https://t.co/KOGeNrTWSL",
    "27": "Washington Wizards - San Antonio Spurs\nUtah Jazz - Dallas Mavericks\n\nBet slip link: https://t.co/6xyMMiNnLH https://t.co/22aCZ2T6jx",
    "28": "@RussBurnerAcc @TheHoopCentral Russ also wasn’t nearly as old as demar either. Also this is coming from the same man that was having less than stellar years in San Antonio. Spurs fan all the way but what he’s doing in Chicago is incredible.",
    "29": "Washington Wizards Predictions and Preview for 2/25/2022 hosts San Antonio Spurs.  Looking for betting action?  Find out if there is any value in our preview. #Punters #Sportsbook https://t.co/YN3VmSGV89",
    "30": "Uniforms for San Antonio Spurs vs Washington Wizards at 4:00 PM. \n\n#PorVida #DCAboveAll https://t.co/XocBgqDunw",
    "31": "Spurs: Washington Wizards vs San Antonio #Spurs - Preview, Tips and Odds - Sportingpedia https://t.co/fMiQ0ARFVg",
    "32": "San Antonio Spurs: Denver Nuggets vs Sacramento Kings Feb 24, 2022 Game - Scores, Stats &amp; Highlights | https://t.co/bEJw1O5trm https://t.co/EnetvDBFBE",
    "33": "🚨🚨🚨NBA FREE BETS🚨🚨🚨\n\nSan Antonio Spurs -1.5 1Q\n76ers ML\nOklahoma City Thunder +7 \n\n#freebets #GamblingTwitter #nbabets #FreePick #NBA",
    "34": "🏀 NBA 🏀\n🏀 San Antonio Spurs x Washington Wizards \n🕐 21:00 🕐\n⛹️ DeJounte Murray ⛹️\n🏀 9,5+ assistencias 🏀\n💰 Odd 1.80 💰\n💸 1 Unidade 💸 https://t.co/Rv2ApozRfc",
    "35": "@ChiSportUpdates @OldManAndThree If Miami Heat won’t steal Chicago Bulls first place in Eastern conference if they do win tonight’s game or tomorrow night or really need New York Knicks win tonight’s game and San Antonio Spurs to win their tomorrow night game for us",
    "36": "(for people who are not hoops weirdos, San Antonio Spurs center Jakob Poeltl's last name is pronounced roughly \"pertle\")",
    "37": "San Antonio Spurs: Best of the Spurs Week: All-Star edition https://t.co/NjY3yZABoC",
    "38": "Demar literally played like this in San Antonio, maybe just one notch lower. This proves to me that Skip doesn’t watch “his Spurs” anymore. https://t.co/i7Zg1EvLZn",
    "39": "@FCsportz @Jahmi1990 @RealSkipBayless You mean while Dejounte Murray was out and carrying the Spurs?! Man right. That’s cause he’s awesome not because of San Antonio. If he was as good then they traded him for what reason?! What team did they build around him?! Take your homer 12th Place glasses and see reality.",
    "40": "@LuckiIntern @RealSkipBayless Lol stop. You didn’t watch one spurs game with this stupid take. DeRozan did his thing in San Antonio. He just didn’t work out. https://t.co/TzYQTnQZH8",
    "41": "On this episode of Locked On Spurs, host @JeffGSpursZone welcomes KENS 5's Casey Viera to give their not-so-bold predictions for the San Antonio Spurs' final stretch of the regular-season, and preview Friday night's Spurs-Wizards game. https://t.co/XeE7nKlDiy",
    "42": "Analyzing Friday’s San Antonio Spurs at Washington Wizards odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/2Vz8qIqt0Q",
    "43": "NBA FRIDAYS 🏀📈 \n\nSan Antonio Spurs (-3) #PorVida \nMiami Heat 1Q (-1.5)\n#HEATCulture \n\nAdded the Spurs, D. Murray looked pretty good before the AllStar break and during the Allstar game. I think he gets his boys ready for tonight and carry his play into tonight. Let’s go 2-0 🙏🏽 https://t.co/bmt1bMvNsg",
    "44": "Here is why I love the spurs:\n\nSan Antonio has a worse losing % then the Wiz, yet they are still favored...on the road. \n\nAlso, when you match talent to talent, Spurs are collectively better. Kuzma? Neto? KCP?  Come on.\n\nSpurs offense is rolling and Wizards rank 10th in ppg allow",
    "45": "San Antonio Spurs at Washington Wizards: NBA Betting Picks, Predictions and Tips - February 25, 2022 https://t.co/PsBOcaaLke",
    "46": "San Antonio Spurs Head-To-Head Record Against Every NBA Team: The Only Franchise With A Winning Record Against Every NBA Team\n😤 😤 😤\nhttps://t.co/HSlLcRaPU9",
    "47": "@RealSkipBayless Pop unlocked his play making abilities.  He made DeMar a smarter basketball player. He also has a lot more help on the Bulls then he did on the Spurs. He was playing at an All Star level in San Antonio but no-one cared. It harder to win in the West then the East.",
    "48": "@RealSkipBayless its was the san antonio coach that unlocked this talent.  derozan was dealing with his sick father. hard to play with alot on his mind. spurs fans appreciate.",
    "49": "@RealSkipBayless Because in the absence of LaMarcus Aldridge, San Antonio wasn't able to surround him with the kind of ball handling and shooting that Chicago has in spades, and had to give a lot of attention to developing the younger guys. Having said that, DeMar was really good for the Spurs.",
    "50": "@ziyanm_ demar derozan is a better chicago bull than demar derozan ever was a San Antonio spur or Toronto raptor",
    "51": "San Antonio Spurs: Pelicans shootaround update: Second half opens on home floor of NBA’s best team https://t.co/qb6ZVnbqRI",
    "52": "“San Antonio coach”, you know Pops  name. You are and will always just be another media member who pander to your audience saying you a @spurs fan to seem contrarian. Probably still bitter that Red McCombs brought them to San Antonio. https://t.co/FvGU2goMoE",
    "53": "Spread time, let’s get after it Spurs\n\nSan Antonio Spurs -3 -110\n\nTwitter Record: 18-12\nWin Percentage: 60%\n\n#GamblingTwiitter #sportsbettingadvice #sportsbettingpicks\n#SportsPicks \n#SportsGambling https://t.co/vOuLSL2cUu",
    "54": "GO SPURS GO: The San Antonio Spurs (23-36) will continue their 2022 Rodeo Road Trip Friday night as they visit the Washington Wizards (27-31). https://t.co/fVxZhRNPDC",
    "55": "Aldridge got worse when he went to San Antonio, Kawhi and DeRozan got better after they left… Pop had an incredible run with the Spurs but since the Tim Duncan era ended (or slightly before it ended) he’s been exposed. https://t.co/NTyrcGPBMm",
    "56": "@RealSkipBayless Although I agree with you, the amount of pure disrespect in calling him “the San Antonio coach” is wild lmao &amp; I thought YOU were the Spurs fan",
    "57": "The 2nd half of the season starts tonight for the Wizards and with 24 games to go the Wizards look to make a push to the playoffs as tonight they host all star Dejounte Murray and the San Antonio Spurs #DCAboveAll https://t.co/HT2NyM6V2B",
    "58": "NBA 🏀 Temporada: 86-76\n\nViernes 25/2:\n\nSan Antonio Spurs vs Washington Wizards O224 (-110)\nToronto Raptors vs Charlotte Hornets O226 (-110)\nPhiladelphia 76ers vs Minnesota Timberwolves U229 (-110)",
    "59": "DeMar was doing almost the exact same shit with the Spurs. Chicago just has better players around DeRozan so the media is gonna be all over it but let him still be in San Antonio having an MVP type season and the media wouldn’t give a damn. I’m just saying 🤷🏻‍♂️",
    "60": "@lilnormy26 @LegionHoops Portland was a thorn to the side for San Antonio from like 2008 to 2016. They always played tough against the Spurs, except that 1 year they met in the postseason",
    "61": "@AustinEatman24 i don’t think he had to do with spurs coaching i think he learned a lot in san antonio and chicago is just the perfect fit for him he’s surrounded by a lot of talent and i think that’s taken a lot of pressure off him",
    "62": "I got my Spurs on, San Antonio",
    "63": "@NBA2K_MyTEAM WTF is Cinny Powell? Dude never played in the NBA. Never played in San Antonio. Never wore a Spurs uniform. This is NBA2k. Not ABA2K. Give Spurs fans something better than this garbage.",
    "64": "Imagine calling fuckin Pop “the San Antonio Coach” i hate the spurs but respect on of the all time greats. https://t.co/ObdiZpTaF0",
    "65": "@ClanTheSpursFan I definitely think patty mills got his fair amount of credit. He’s recognized as an All time Spur by the fans here in San Antonio. We all might’ve had irks because we are fans of the team but when it comes to his contributions to the championship run, no one denies his respect.",
    "66": "Monday is HBCU Night at FedExForum, and our service partners will have the venue ready for the big game! Don't miss our Memphis Grizzlies as they face the San Antonio Spurs.\n\nServiceMaster by Stratos is a proud partner of the Memphis Grizzlies. https://t.co/J8PQAAP0p8",
    "67": "I just uploaded “San Antonio Spurs vs Washington Wizards Prediction 2-25-22 - Free NBA Picks” to #Vimeo: https://t.co/riC9CtGV4z",
    "68": "@TheAntManVelez @LeBronfactcheck He Faced The Splash Bros, The Greatest Team Ever (Twice), Mavericks that Swept Kobe, Hall Of Fame San Antonio Spurs, and Big 3 Celtics.",
    "69": "@NBATradeGuy @tankathon @qkhoops @BryceHendrick14 @H00P_Talk @HunterCruse14 @CozyLito @Alley_Oop_Coop @HawksDraftNerd @RocketsfanSid With the first pick in the 2022 NBA draft the San Antonio Spurs select Chet Holmgren. Holmgren gives the Spurs another big with elite rim protection and the added ability to space the floor https://t.co/YEcSxfzo2B",
    "70": "Spurs: San Antonio #Spurs vs. Washington Wizards Prediction, Preview, and Odds - 2-25-2022 https://t.co/X5GGe072cQ",
    "71": "Spurs: San Antonio #Spurs vs. Washington Wizards Prediction, Preview, and Odds - 2-25-2022 https://t.co/6OH035K8gq",
    "72": "Orlando Magic - Houston Rockets\nWashington Wizards - San Antonio Spurs\n\nBet slip link: https://t.co/70pf5oX9N2 https://t.co/WRTEp0m01S",
    "73": "DasHaus made a bet!\n\nEvent: San Antonio Spurs vs Washington Wizards #NBA\nBet: San Antonio Spurs TO WIN -3.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "74": "San Antonio Spurs: A closer look into the resurgence of Chicago Bulls’ DeMar DeRozan https://t.co/DZBAFiMV8k",
    "75": "NBA Basketball Game Betting Picks Simulator: 7:10 PM ET - San Antonio Spurs vs. Washington Wizards - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/bl2d90Pu0n #nba #sportsbetting #freepicks #cappertek",
    "76": "Spurs: Washington Wizards vs San Antonio #Spurs - Preview, Tips and Odds - Sportingpedia https://t.co/xlxdoyUWqX",
    "77": "San Antonio Spurs: Blazers Fall Victim to #Warriors' Runs, Come Up Short in 132-95 Loss https://t.co/KOGeNrTWSL",
    "78": "San Antonio Spurs vs. Washington Wizards - NBA League 2022\n🔴Live Streaming Now➠ https://t.co/URsqVkuFQ7\n📅 : 25-Feb-22\n⏰ : 7:00 PM",
    "79": "Spurs: Game Preview: San Antonio #Spurs at Washington Wizards - Pounding The Rock https://t.co/fMiQ0ARFVg",
    "80": "San Antonio Spurs: Washington Wizards vs San Antonio #Spurs - Preview, Tips and Odds - Sportingpedia https://t.co/EnetvDBFBE",
    "81": "San Antonio Spurs vs  Washington Wizards Prediction 2-25-22 - Free NBA P... https://t.co/AUanyWWxhP via @YouTube",
    "82": "NBA: San Antonio Spurs have won 7 of their last 7 games against teams that hold a losing record",
    "83": "Sports while i'm asleep \n\nWashington Wizards Vs San Antonio Spurs (NBA Matchday 59 of 82)\n\nTip-off: 1 A.m Swedish \n12 P.m British \n7 P.m Eastern \n4 P.m Western \n\nUtica Comets Vs Hershey Bears (AHL Game 50 of 71)\n\nFace-Off: 1 A.m Swedish \n12 P.m British \n7 P.m Eastern",
    "84": "San Antonio Spurs are the only franchise that have a winning record against everyone 🔥🔥🔥🔥🔥 https://t.co/wJuSiaURyt",
    "85": "San Antonio Spurs vs. Wizards\nhttps://t.co/eUAzKiaJsg\nhttps://t.co/eUAzKiaJsg",
    "86": "Game preview: San Antonio Spurs vs. Wizards https://t.co/8lvASfKRbr",
    "87": "Game Preview: San Antonio Spurs at Washington Wizards https://t.co/gVaE8UUAQv",
    "88": "Spurs: Game Preview: San Antonio #Spurs at Washington Wizards - Pounding The Rock https://t.co/AiM1vW1vBk",
    "89": "Spurs: Game Preview: San Antonio #Spurs at Washington Wizards - Pounding The Rock https://t.co/F6XTLARq6P",
    "90": "I'm going to sleep soon but one last thing I forgot to tweet I hate when people make up bullshit that the Spurs changed/reinvented Demar loooool. He wasnt doing this shit in San Antonio stop lying",
    "91": "⭐️FREE #livestream here👉https://t.co/2c6Ltzn7d4 😉\n——\n🏀#NBA ‼️\n1.Indiana Pacers Vs Oklahoma City Thunder\n2.Charlotte Hornets Vs Toronto Raptors\n3.Orlando Magic Vs Houston Rockets\n4.Washington Wizards Vs San Antonio Spurs\n5. New York Knicks Vs Miami Heat ... https://t.co/ikmhsU3TXR",
    "92": "San Antonio Spurs: Game Preview: San Antonio Spurs:  at Washington Wizards https://t.co/IcDtxKz8L5",
    "93": "San Antonio Spurs Head-To-Head Record Against Every NBA Team: The Only Franchise With A Winning Record Against Every NBA Team #SmartNews  https://t.co/tJjTE7Io4Q",
    "94": "San Antonio Spurs: 2021-22 San Antonio #Spurs Season - Highlights: Defense - YouTube https://t.co/KOGeNrTWSL",
    "95": "Spurs:  San Antonio #Spurs vs. Washington Wizards Prediction, Preview, and Odds - 2-25-2022 https://t.co/Qf0onNzhK9",
    "96": "San Antonio Spurs: 2 #Spurs Who Might Lose Starting Jobs Next Season - Air Alamo https://t.co/EnetvDBFBE",
    "97": "Game Preview: San Antonio Spurs at Washington Wizards https://t.co/tcauGjDV0d",
    "98": "'I'm loving it' | Spurs' Lonnie Walker IV talks giving back to the San Antonio community and more https://t.co/AY2mjOv0un #porvida #nbatwitter #nba75",
    "99": "Dave's Picks for Feb 25th, 2022\n\nCBB:\nCoastal Carolina Chanticleers -6.5\nSaint Louis Billikens +3\nNiagara Purple Eagles +1.5\n\nNBA:\nSan Antonio Spurs -1.5\nHouston Rockets/Orlando Magic OVER 228.5",
    "100": "@cwild22 That sounds great but… let me tell you about my San Antonio @spurs. 🤍",
    "101": "in San Antonio?  It's mind boggling.   Like the Spurs already exist.  At least 3 times I was told the map should be changed to include a team where there already is one. Also had a guy tell me to look at population sized, and he compares the city I want to add a team to with",
    "102": "@BabyYogurt_ @BBallBecka @Embiid_prodzz Houston Rockets\nSan Antonio Spurs\nDallas Mavericks\n\nYeah they could probably do 3 teams like they have for the last several decades.",
    "103": "@Embiid_prodzz Santa Fe - Lions?\nSanta Fe - Roadrunners?\nSante Fe - Pueblos?\nI’ve never been, but I do like the city name for a basketball team. Giving me San Antonio Spurs vibes. Cool city. https://t.co/qWa1xZTz2P",
    "104": "The San Antonio Spurs head to head record against the rest of the NBA 🔥\n\nHow has your team done against the Spurs?\n(via Fadeaway World)\nhttps://t.co/5CIJCazNpW",
    "105": "@zhanshudi San Antonio Spurs 2014, Motion Weak (Fist Option). https://t.co/sriOFw9vbC",
    "106": "@DeMar_DeRozan is that dude. Everyone said it was over for him when he was traded to San Antonio but now he’s back &amp; playing better ball than he did in Toronto. Top 3 MVP candidate for me. #Spurs #Bulls #Raptors",
    "107": "@BuckieLakers @KendrickPerkins Spurs didn't resign him because they were going young and wanted DeRozan to have a chance at a playoff run. They care about their players. DeRozan became a better player while in San Antonio. DD had his highest career rebounding/assists season averages while with the Spurs.",
    "108": "@PutinWRLD DeRozan was actually really good in San Antonio but people hated on him because the spurs around him STUNK",
    "109": "@WorldWideWob Saw this several times when he was with the Spurs! I called him the Closer or d’ Closer! He is a really good player! I felt really sad when he left San Antonio.",
    "110": "@KnicksMemes I’ve gotten over that Ray Allen 2013 NBA Finals Game 6 shot against my San Antonio Spurs.  Doesn’t fucking bother me at all. 🤷🏽‍♂️",
    "111": "Spurs: San Antonio #Spurs Head-To-Head Record Against Every NBA Team - Fadeaway World https://t.co/X5GGe072cQ",
    "112": "San Antonio Spurs: Four-Star WR Kevin Coleman talks Jackson State commitment from Poly Bowl https://t.co/r5pHXs1eS5",
    "113": "Spurs GM Brian Wright has aggressively pursued assets for the future, but without committing fans and players to a race to the bottom.\n\nHere's San Antonio's alternative blueprint for rebuilding in the NBA's dreaded middle ground:\nhttps://t.co/uAA5Oc5nme",
    "114": "New tumblr post: \"### NBA2K22 San Antonio Spurs vs LA Clippers MyLeague PS4 GAMES...\" https://t.co/0FeZgrUJax ifttt, youtube",
    "115": "San Antonio Spurs: Goran Dragic's Status For #Celtics-#Nets Game - Fastbreak on FanNation - Sports Illustrated https://t.co/KOGeNrTWSL",
    "116": "In case anyone actually cares about something other than the 25-40 Spurs in San Antonio, since @SA_Sports &amp; local media dont, 4th round is Friday, quarterfinals are Saturday, state semis/finals are next week. High school teams are a better story. Even Pophismouth knows that. https://t.co/WW6VKkbHa8",
    "117": "@ChrisForsberg_ “The beautiful game” 2014 San Antonio Spurs basketball",
    "118": "@BrendenErtle Houston Rockets. San Antonio Spurs. Even Chicago Bulls.",
    "119": "@NBAonTNT You couldn't said it better I 1000 percent agree !!!  Can anyone please tell me why Tony Parker  San Antonio Spurs is not a part of that club",
    "120": "Spurs:  Finger: As #Spurs restart after break, everybody's accountable - San Antonio Express-News https://t.co/Qf0onNzhK9",
    "121": "San Antonio Spurs: #Spurs partner with Kultured Misfits - Pounding The Rock https://t.co/EnetvDBFBE",
    "122": "Lonnie talks about why he does so much for the community, #Porvida fans... 👇👇👇👇👏👏\n\n'I'm loving it' | Spurs' Lonnie Walker IV talks giving back to the San Antonio community and more https://t.co/AY2mjOv0un #porvida #nbatwitter #nba75",
    "123": "San Antonio Spurs: NBA Fans Have A Heated Debate About Whether Tim Duncan Was Better Than Kobe Bryant: \"Respect To Timmy, But Kobe Is\u0085 https://t.co/BvCtQQvo8w",
    "124": "Check out this listing I just added to my #Poshmark closet: New Nba San Antonio Spurs New Era Beanie stocking cap. https://t.co/puODtCbrIE #shopmycloset @poshmarkapp",
    "125": "Check out this listing I just added to my #Poshmark closet: New Nba San Antonio Spurs New Era Beanie stocking cap. https://t.co/KAAriDrKLx #shopmycloset @poshmarkapp",
    "126": "Congratulations to morriswangg who moved up 23 spots to take #15 on the San Antonio Spurs team leaderboard.\n\nhttps://t.co/HQxWdPfRe7",
    "127": "Wizards vs. Spurs preview: Washington returns from All-Star break to face San Antonio https://t.co/b50Qtr4LIf"
}