{
    "0": "Together https://t.co/6DI84uZFYB",
    "1": "#NBA  Today's Lineups\n\n#LakeShow\nLos Angeles Lakers Starting 5:\nRussell Westbrook\nWayne Ellington\nKent Bazemore\nLeBron James\nAnthony Davis\n\n#RaisedByWolves\nMinnesota Timberwolves Starting 5:\nPatrick Beverley\nD'Angelo Russell\nMalik Beasley\nJarred Vanderbilt\nKarl-Anthony Towns",
    "2": "Bay College men’s basketball team watching the Los Angeles Lakers vs Minnesota Timberwolves game. #packpix @TheMarcusharri https://t.co/awnN8MAuw3",
    "3": "Two Wolves players out vs the Lakers due to Health and Safety porotocols #LosAngelesLakers #MinnesotaTimberwolves https://t.co/J6f0idOi0j",
    "4": "#NBA | Remember, theses games are about to begin:\n-Sacramento Kings vs Memphis Grizzlies\n-Portland Trail Blazers vs Charlotte Hornets\n-Minnesota Timberwolves vs Los Angeles Lakers \nBET NOW!\nhttps://t.co/IT7pYFdaVg https://t.co/BEa3Amxmkt",
    "5": "Bay College ladies basketball team watching the Minnesota Timberwolves vs Los Angeles Lakers game. #packpix @molsen2403 @PaigeWelch10 @haytrudell @AlainaTrudeau @KennedyEnglund @ChevyKoski https://t.co/d3Dlhd6Y92",
    "6": "#NBA | HEEEEEEEEEEEELLO THERE!\nRemember theses games are just around the corner:\n-Sacramento Kings vs Memphis Grizzlies\n-Portland Trail Blazers vs Charlotte Hornets\n-Minnesota Timberwolves vs Los Angeles Lakers\nBET NOW!\nhttps://t.co/0rTJpgSrdP https://t.co/jaaQoY47Nv",
    "7": "Quinteto inicial do Los Angeles Lakers para o jogo desta noite contra o Minnesota Timberwolves:\n\nRussell Westbrook\nWayne Ellington\nKent Bazemore\nLeBron James\nAnthony Davis\n\n#LakeShow",
    "8": "Los Angeles Lakers Starters:\n\nRussell Westbrook\nKent Bazemore\nWayne Ellington\nLeBron James\nAnthony Davis\n\nPlayers out:\nTrevor Ariza\nAvery Bradley\nTalen Horton-Tucker\nDwight Howard\nMalik Monk\nKendrick Nunn\nAustin Reaves\n#LakeShow #NBA #NBATwitter #NBA",
    "9": "Frank Vogel reveals Lakers vaccination status amid Covid-19 outbreak #FrankVogel #LosAngelesLakers https://t.co/aRztSAa7RW",
    "10": "Will Kyrie be ready for the Christmas game against the Los Angeles Lakers??",
    "11": "How to watch Los Angeles Lakers at Minnesota Timberwolves, live stream, TV channel, start time https://t.co/nk9ylF2UzS",
    "12": "What season did IT last play for the Lakers?\n\n#LakeShow x @SociosHoops",
    "13": "los angeles lakers culture https://t.co/wmJgkmFbok",
    "14": "Check out Kobe Bryant Los Angeles Lakers NBA Holographic 11\"x14\" Engraved Matted Frame https://t.co/YtV2rIUTbn @eBay",
    "15": "“ The team's next road game is Dec. 23 in Portland Trail Blazers, followed by a Christmas Day matchup at the Los Angeles Lakers and a Dec. 27 contest at the LA Clippers. \nThat stretch is followed by three more home games. “\n\nhttps://t.co/fqcaryHsyt https://t.co/qBu8YWP1yx",
    "16": "Isaiah Thomas vai usar a camisa 3️⃣1️⃣ durante a sua segunda passagem pelo Los Angeles Lakers. https://t.co/4g2dmjbwJX",
    "17": "Welcome back, @isaiahthomas 🙌 https://t.co/iTXNHS5VlI",
    "18": "Los Angeles Lakers Vs. Minnesota Timberwolves Live Play By Play &amp; Reaction https://t.co/za9g2ix6xR",
    "19": "Los Angeles Lakers star Anthony Davis discussed Austin Reaves’ big shot against the Dallas Mavericks.  https://t.co/CR72h2krnp",
    "20": "@Lakers @KingJames @russwest44 Acting like it hasn't FELT like 19℉ the past 2 weeks in Los Angeles.",
    "21": "Lakers' Russell Westbrook out of NBA's COVID protocols; team signs ... (Los Angeles Times)\n\nThe Lakers have added rookie guard Austin Reaves and injured guard Kendrick Nunn to the NBA'...\n\nAdd your highlights:\nhttps://t.co/kXmysYtw87\n #LA_Rams",
    "22": "@lakers, it’s really a crime that those of us who don’t live in Los Angeles can’t watch Backstage Lakers at all. You do know you have fans all over the earf, right??",
    "23": "Check out Kobe Bryant Los Angeles Lakers NBA Holographic 11\"x14\" Engraved Matted Frame https://t.co/uTg2qXByXD @eBay",
    "24": "As you watch each game this season, play Lakers Pick ‘Em for your chance to win prizes and test your Lakers knowledge.",
    "25": "The Los Angeles Lakers best possible buyout target is no longer an option – Lakers News https://t.co/LzrhIqXak2",
    "26": "(Ex-Celtic Isaiah Thomas signs with Los Angeles Lakers in NBA comeback (report)) \nhttps://t.co/EbMkPtoAcS https://t.co/CZ2GNwDhEz",
    "27": "(Ex-Celtic Isaiah Thomas signs with Los Angeles Lakers in NBA comeback (report)) \n https://t.co/kR2eNxIhLd https://t.co/cQuAIGIrBu",
    "28": "(Ex-Celtic Isaiah Thomas signs with Los Angeles Lakers in NBA comeback (report)) \n https://t.co/L425mPXUtX https://t.co/VoOs2KzUmW",
    "29": "BREAKING: #IsaiahThomas is BACK ?? Lakers plan to sign him tomorrow | NBA Today\n🏀https://t.co/NyqcI6xU2K\n\nRumors, news: https://t.co/IouJcktFOj\n\n#LosAngelesLakers \n@isaiahthomas @Lakers  #NBA #basketball https://t.co/RcDhwxCqiW",
    "30": "It should come as no surprise to any of us that the Brooklyn Nets'  Christmas Day game will be played in Los Angeles, vs. the Lakers. I'm sure it's no coincidence that this gives Kyrie a week to fast-track a return. #NBA https://t.co/CCH44Bvt09",
    "31": "Los Angeles Lakers, December 25th\n@KyrieIrving https://t.co/Ikdy2Cxf4c",
    "32": "@DataNFT_ Feeling very Los Angeles @Lakers https://t.co/QUrTuo7vwo",
    "33": "Lakers Sign Isaiah Thomas to 10-day Contract | Los Angeles Lakers (Los Angeles Lakers)\n\nThe Los Angeles Lakers have signed guard Isaiah Thomas to a 10-day contract pursuant to the ...\n\nAdd your highlights:\nhttps://t.co/my62MYhY3m\n #LA_Lakers",
    "34": "@Warriorsnin3rs @JayFirstAccount @TheHoopCentral @wojespn Isaiah Jamar Thomas (born February 7, 1989) is an American professional basketball player for the Los Angeles Lakers of the National Basketball Association (NBA).",
    "35": "LA Lakers: Los Angeles #Lakers at Minnesota #Timberwolves odds, picks and predictions https://t.co/FweJIN5GM3",
    "36": "Los Angeles Lakers https://t.co/JmoeU4G6A1",
    "37": "Isaiah Thomas reacts to signing with the Lakers #IsaiahThomas #LosAngelesLakers https://t.co/3myvkQMgBi",
    "38": "⭐️LOCK OF THE NIGHT\n\n-Los Angeles Lakers ML -112 Maxbet🐳\n\nWe been on an aboslute heater lately! \n\nAnyone gonna tail the 🐐? https://t.co/EQvDeEDv4k",
    "39": "Friday Night Hoops 🌴🆚🐺\n\n⏰: 7:00p.m. PT\n📺: @SpectrumSN &amp; ESPN\n📻: ESPN LA 710 &amp; 1330 KWKW\n\n#LakeShow x @SociosHoops https://t.co/Yb4eKJZyQV",
    "40": "Currently available for the Lakers tonight vs. Wolves #LosAngelesLakers #MinnesotaTimberwolves https://t.co/dVo04Wm9yR",
    "41": "Austin Reaves of the Los Angeles Lakers has entered the league’s health and safety protocols, per Shams Charania of the Athletic. For Fantasy Analysis Click Here: https://t.co/LnXJeIYmxZ",
    "42": "Three Things to Know: Lakers at Timberwolves - 12/17/21 | Los Angel... (Los Angeles Lakers)\n\nThe Lakers (16-13) are on a season-best, three-game winning streak following their thrilling...\n\nAdd your highlights:\nhttps://t.co/KNNzKXrwiy\n #LA_Lakers",
    "43": "Year-by-year history of the Los Angeles Lakers - https://t.co/fMPt0ZyRZk https://t.co/SVvXpyOxZH",
    "44": "Year-by-year history of the Los Angeles Lakers - https://t.co/1P1L8VjnwB https://t.co/XsRB8HFrma",
    "45": "Lakers reveal Isaiah Thomas’ status for tonight vs. Minnesota #IsaiahThomas #LosAngelesLakers #MinnesotaTimberwolves https://t.co/yN2seoQxFR",
    "46": "The Los Angeles Lakers will, in fact, have Russell Westbrook available to face the Minnesota Timberwolves on Friday night, as Westbrook has cleared the NBA’s health and safety protocols",
    "47": "Los Angeles Lakers sign Isaiah Thomas to a 10-day contract: https://t.co/4FwR4ZHSD0",
    "48": "Remember last time @isaiahthomas wore the Purple &amp; Gold? 💜💛 https://t.co/qdFcmgDarN",
    "49": "Brooklyn Nets v. Los Angeles Lakers final or Golden State?",
    "50": "Russell Westbrook clears Covid protocol, available for Los Angeles Lakers vs. Minnesota… – Lakers News https://t.co/nWTn3j21JA",
    "51": "NBA 🇺🇸\n\nTimberwolves - Lakers\n\nLos Angeles -1.5 @ 1.952 (1u)\n\nTrail Blazers - Hornets \n\nPortland -2.5 @ 2.000 (1u)\n\nCeltics - Warriors \n\nover216 @ 1.925 (1u)",
    "52": "The New Orleans Pelicans have the Los Angeles Lakers pick in 2024 but can defer to 2025.\n\nIf the Lakers offer NO 2x second-round picks to move that protection in 2024 or 2025, do you think that's enough compensation?",
    "53": "See NBA Twitter explode when Austin Reaves won the game in overtime for the Los Angeles Lakers against the Dallas Mavericks.  https://t.co/hdd16euaxQ",
    "54": "Isaiah Thomas has officially signed with the Los Angeles Lakers.\n\nIT is available to play Friday evening as the Lakers face Minnesota #lakeshow https://t.co/d0slzlP4LS",
    "55": "\"The Los Angeles Lakers have signed guard Isaiah Thomas to a 10-day contract pursuant to the NBA Hardship Exception provisions, it was announced today by Vice President of Basketball Operations and General Manager Rob Pelinka.\"",
    "56": "Isaiah Thomas has signed with the Lakers #IsaiahThomas #LosAngelesLakers https://t.co/eMIysZEh08",
    "57": "OFFICIAL: Welcome back, IT ⌚️ https://t.co/VuF98NRZnm",
    "58": "LA Lakers: Los Angeles #Lakers at Minnesota #Timberwolves odds, picks and predictions https://t.co/PDdFM9AHMC",
    "59": "NBA Basketball Game Betting Picks Simulator: 10:10 PM ET - Los Angeles Lakers vs. Minnesota Timberwolves - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/PHtUP8lZty #nba #sportsbetting #freepicks #cappertek",
    "60": "as i understand it, the vaccine mandate in los angeles only applies to home players so if we're trying to guess when kyrie makes his debut, it might be christmas night against the lakers the 27 vs. the clippers. if not, he wouldn't be back until mlk day vs the cavs",
    "61": "And that’s if the team can or will even practice with so many players in health and safety protocols. It’s likely they don’t have a practice for a while. After Portland, Nets travel to Los Angeles and play the Lakers on Christmas and then the Clippers on Dec. 27. https://t.co/RkJUFOmDPt",
    "62": "#RussellWestbrook clears COVID protocol, available for Los Angeles #Lakers vs. Minnesota #Timberwolves. 🏀 #NBATwitter  https://t.co/MZVyJ49GnE",
    "63": "Lakers guard Malik Monk was cleared to fly from Los Angeles to Minnesota to join the team for tonight's game, but ultimately was not cleared to play the game, sources tell ESPN. Russell Westbrook flew from Dallas to Minnesota today after testing out of protocols, per sources.",
    "64": "Consensus Line Move:\n2021-12-17 Los Angeles Lakers at Minnesota Timberwolves from 220.50 to 222.00\nOver who saw that coming?\n#NBA #sport #dataanalytics #ethereum",
    "65": "Consensus Line Move:\n2021-12-17 Los Angeles Lakers at Minnesota Timberwolves from -1.00 to 1.50\n#LakeShow steam engine\n#NBA #NBATwitter #data #entrepreneurship",
    "66": "Shop The Arena NBA: Los Angeles Lakers: Striped Men’s T-Shirt (White) https://t.co/xH6HUfPCw3",
    "67": "@xan_mommi No it because I wanna hear the gameday preview of Minnesota Timberwolves vs Los Angeles Lakers 😎",
    "68": "Los Angeles Lakers",
    "69": "@thatforeignlif1 @BleacherReport Well shit that's more on the system not being good enough then the Los Angeles Lakers, ifyou wanna blame someone, blame the NBA for their underprepared system",
    "70": "@ElTreMann @ElCurryRuletero HOLY FUCKING SHIT‼️‼️‼️‼️ IS THAT A MOTHERFUCKING LOS ÁNGELES LAKERS REFERENCE??????!!!!!!!!!!💜💛💜💛💜💛💜💛💜💛💜 https://t.co/S1T22itQiG",
    "71": "Los Angeles Lakers https://t.co/fV0Hjnjn6V",
    "72": "ALERT: New high roller bet posted!\nA bet has been placed for $5,551.00 on Minnesota Timberwolves - Los Angeles Lakers to win $10,158.33.\nTo view this bet or copy it https://t.co/4j2yj35iFu https://t.co/fSmq8MTO8a",
    "73": "Minnesota Timberwolves - Los Angeles Lakers\n\nBet slip link: https://t.co/QQektNrwla https://t.co/nNpGV1k9Eh",
    "74": "In case you're looking for the Staples Center, Los Angeles, it's now called  @cryptocomarena . If you're headed to a Lakers game it's only a 5 minute drive from #825SouthHill. https://t.co/fXO8RWrF4O",
    "75": "@Rollingitup1 @tylerrgeezy @theAlanLy The franchise “Los Angeles Lakers” will never change, but the organization within the franchise always change from personnel to staff to players. That’s how i see the difference between the two terms",
    "76": "#Lakers #KobeBryant #NBA #Fleer #TradingCards #LosAngelesLakers 1998-99 Fleer Brilliants Kobe Bryant #70 Lakers NMMT NBA Basketball Card Mamba https://t.co/qfm9l1tGUC @eBay",
    "77": "ALERT: New high roller bet posted!\nA bet has been placed for $6,322.48 on Minnesota Timberwolves - Los Angeles Lakers to win $12,518.51.\nTo view this bet or copy it https://t.co/Bsmhv9hyWe https://t.co/WbnjARHPPp",
    "78": "Minnesota Timberwolves - Los Angeles Lakers\n\nBet slip link: https://t.co/0cxBYDdJ8a https://t.co/wW5AcYNnU4",
    "79": "If only the Los Angeles Lakers were this fast on the court 🧐 https://t.co/B30xB0u79F",
    "80": "@Lakers Lakers Run Los Angeles best fans in league history",
    "81": "Los Angeles #Lakers G Russell Westbrook is available to play against the #Timberwolves. #NBA https://t.co/aiWFD0YoEa",
    "82": "I'M TAKING THE LOS ANGELES LAKERS OVER COVID IN A 7 GAME SERIES https://t.co/SulgH3JfPB",
    "83": "@clarencehilljr Any mention of parades, confetti, banners, or anything championship-related is one of the weirdest putdown attempts directed at a team like the Los Angeles Lakers.",
    "84": "I just don’t believe Russell Westbrook of the Los Angeles Lakers wants to be traded to ANOTHER team.",
    "85": "@Lakers @Delta Los  Angeles   Lakers   rookie  PF  Austin   Reaves    clutch  game  winning   3  point  goal   Wednesday  was   fantastic !!#LAKESHOW",
    "86": "Los Angeles Lakers star LeBron James came in at No. 2 in a new survey of the best player in the NBA.  https://t.co/Y4KL1xmFWp",
    "87": "Consensus Line Move:\n2021-12-17 Los Angeles Lakers at Minnesota Timberwolves from 1.00 to -1.00\n#RaisedByWolves did I do that?\n#NBA #CryptoHoops #coding #stock",
    "88": "Lakers’ Trevor Ariza will be in uniform #LosAngelesLakers #TrevorAriza https://t.co/JQtzkvaGjQ",
    "89": "GAMEDAY!📍\n-\nThe Los Angeles Lakers play the Minnesota Timberwolves at 7:00 PM PST in the Target Center. 💜💛\n-\nFollow @lalakersquad for more! 🔥 https://t.co/wjENkXWmSb",
    "90": "Los Angeles Lakers vs Timberwolves prediction, betting odds, TV channel – Lakers News https://t.co/EEZFMaWsKq",
    "91": "📆 12/17/1997\n\n📍 Chicago, IL\n\n🎟 Los Angeles Lakers at Chicago Bulls\n\n🐐 “It was great for me. I was looking forward to that moment, him being the pinnacle of who I was looking forward to playing against most.” - Kobe Bryant\n\n(📸 @adbphotoinc) https://t.co/OzG0GgzaCB",
    "92": "Analyzing Friday’s Los Angeles Lakers at Minnesota Timberwolves odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/20kszMzQkt",
    "93": "Spent an hour in traffic, ate In-N-Out and got elbowed by a celebrity at a Lakers game, I have completed the Los Angeles experience speedrun in under a week",
    "94": "Consensus Line Move:\n2021-12-17 Los Angeles Lakers at Minnesota Timberwolves from 0.00 to 1.00\n#LakeShow market flood\n#NBA #CryptoHoops #programmer #forexlifestyle",
    "95": "Anthony Edwards in Covid protocols before a Lakers game #AnthonyEdwards #LosAngelesLakers https://t.co/XiVleqwJZB",
    "96": "Behind the scenes and behind the wheel with Lakers VP, Basketball Operations, and General Manager, Rob Pelinka.\n\nCatch Backstage: Lakers, tonight at 10:30pm PT on @SpectrumSN. https://t.co/EBEyXIXxfk",
    "97": "Los Angeles #Lakers G Kendrick Nunn has entered health and safety protocols. #NBA https://t.co/xDh6breCVX",
    "98": "🚨 #BREAKINGNEWS 🚨\nHealthy emergency in Los Angeles Lakers, Russell Westbrook and Avery Bradley added to the healthy protocols with Howard, THT y Monk. Due to this problem the L.A franchise is planning to sing Isaiah Thomas with a 10-days-contract \n#lakeshow 🟣🟡",
    "99": "Today's NBA Picks: 10:10 PM ET - Los Angeles Lakers vs. Minnesota Timberwolves - 16 PICKS AVAILABLE: https://t.co/AlMghCuufi #nba",
    "100": "BREAKING: The Los Angeles Lakers have signed Peter Parker to a 100 year contract great swing man addition to the team well needed! https://t.co/esd99nukmG",
    "101": "The Lakers have hired Craig Hughner as the team’s new director of media relations. The Los Angeles native was most recently the vice president of communications for the San Diego Padres. Hughner will begin Jan. 3.",
    "102": "Hello, Los Angeles and State #30! If you know me, you know I’m a sports fanatic. Basketball, football, and tennis are my absolute favorites. It was only right that I go to a @Lakers game while in Los Angeles. I’ve seen @KingJames play in person a few times, and it never gets old. https://t.co/kPfWRjvGQu",
    "103": "December 23. Join us for a night honoring 22 Years of Lakers History at STAPLES Center.",
    "104": "** Reduced: $19.99 - Save $10.00 ** Los Angeles Lakers Mitchell &amp; Ness Hardwood Classics Vintage 2 Adjustable Snapback Hat https://t.co/ZbLYmMNT2I https://t.co/uBrOdtNKlc",
    "105": "Today's NBA Consensus (So Far)\n\nMilwaukee Bucks 73%\nMiami Heat 71%\nGolden State Warriors 69%\nAtlanta Hawks 65%\nMemphis Grizzlies 63%\nUtah Jazz 62%\nPortland Trail Blazers 60%\nLos Angeles Lakers 58%",
    "106": "Consensus Line Move:\n2021-12-17 Los Angeles Lakers at Minnesota Timberwolves from 222.50 to 220.50\nUnder what did I miss\n#NBA #bettingpicks #data #money",
    "107": "Consensus Line Move:\n2021-12-17 Los Angeles Lakers at Minnesota Timberwolves from -2.50 to 0.00\n#LakeShow just a touch\n#NBA #sportsbetting #analytics #entrepreneurship",
    "108": "Liberals are losing excuses as to why it’s important to get vacxed 🤣🤣🤣\n\nLos Angeles Lakers add Russell Westbrook, Avery Bradley to COVID-19 protocols\n\nhttps://t.co/az4JDzsORk",
    "109": "@feliciaday I have been Twitter Contributing for the Los Angeles Lakers and the Golden State Warriors NBA coverage for the Peach Basket. I can always Twitter contribute or write for you if you're still do gaming content. Can I send you a resume if you're interested?",
    "110": "Lakers Hire Craig Hughner as Director, Media Relations | Los Angele... (Los Angeles Lakers)\n\nThe Los Angeles Lakers have hired Craig Hughner as Director, Media Relations, President of B...\n\nAdd your highlights:\nhttps://t.co/oVFcFT1Mo0\n #LA_Lakers",
    "111": "2 Los Angeles Lakers vs Phoenix Suns Tickets 12/21/21 Section 108 Lebron NBA AD #eBay🇨🇦 #Tickets #Sports #SportsTickets https://t.co/eTdpDmE1Sc",
    "112": "Check out NBA Los Angeles Lakers Team Adult Face Covering 1 Mask New Purple  #NBA https://t.co/8tUgHIPTPB via @eBay",
    "113": "#ICYMI: #NOW “I’ve mostly found myself contemplating this with each passing Los Angeles Lakers game I watch.” https://t.co/6JE03FScVW",
    "114": "Los Angeles Lakers hire Craig Hughner as Director of Media Relations: https://t.co/prPv0SVgKG",
    "115": "Analyst on how the Lakers will fare without Russell Westbrook #LosAngelesLakers #RussellWestbrook https://t.co/5v2evd0mOf",
    "116": "Lakers should be renamed, Los Angeles Veteran Soldiers, for the time being. https://t.co/bxmWRJijpv",
    "117": "UPDATED Minnesota @Timberwolves Status Report in advance of tonight’s game vs Los Angeles Lakers:\n\nOUT\nEdwards - Health &amp; Safety Protocols Prince - Health &amp; Safety Protocols\nWright IV - G League Two-Way",
    "118": "NBA LIVE TODAY🔴 Los Angeles Lakers vs Minnesota Timberwolves - 17th Dece... https://t.co/TmxMX5TKW5",
    "119": "THE GOTDAM LOS ANGELES LAKERS HAVE A CHANCE TONITE BAH’GAWD lmfaooooo https://t.co/fQsBBssp3d",
    "120": "The Los Angeles Lakers are signing veteran guard Isaiah Thomas.  https://t.co/2ufxP0cXQo",
    "121": "Game Night. Los Angeles Lakers vs The Minnesota Timberwolves. Lakeshow 🏀 🏀 🏀 🏀 https://t.co/D96StMe9Dp",
    "122": "Historic First: Kiesha Nix Becomes First Black Woman VP In Los Angeles Lakers History https://t.co/EbfoY5icyq",
    "123": "Former AllStar PG Isaiah Thomas has been called up from the G League \n\nHe will sign a 10 day contract with the Los Angeles Lakers under the hardship exemption according to multiple reports \n\n#Betwaysquad #FullCourt",
    "124": "Our prediction and best bets for Friday’s game between the Los Angeles Lakers and Minnesota Timberwolves, with odds via @Tipico Sportsbook.  https://t.co/D19hrTBtOU",
    "125": "On this day in 2006, Gilbert Arenas of the Washington Wizards scored 60 points in a 147-141 win over the Los Angeles Lakers, setting a record for most points in an OT period with 16",
    "126": "Los Angeles Lakers add Russell Westbrook to COVID-19 Protocols, per report – Lakers News https://t.co/EkYYl5rkrR",
    "127": "📅 16th December 2021: Isaiah Thomas drops 42 points and 8 assists on his G-League debut \n\n📅 17th December 2021: The Los Angeles Lakers sign Isaiah Thomas to a 10-day contract. \n\nThe league is better with IT. \n\n🙌 https://t.co/zOaEFNFUXm",
    "128": "🟣🟡 GAME DAY\n\n🆚 Minnesota Timberwolves (13-15)\n🏟️ Target Center\n🕒 7:00 PM 🇺🇸 (Los Angeles) | 4:00 AM 🇪🇦 | 0:00 AM 🇦🇷\n\n🚑 OUT: Trevor Ariza, Kendrick Nunn, Talen Horton-Tucker, Malik Monk, Dwight Howard, Russell Westbrook, Avery Bradley.\n\n#LakeShow #NBA75 @lakers https://t.co/hHUoVWVjUL",
    "129": "New post (Los Angeles Lakers vs Minnesota Timberwolves NBA Pick – December 17) has been published on The Sports Geek - https://t.co/cDzD4ESrVO https://t.co/EZoSaTysfc",
    "130": "🚨NOW AVAILABLE🚨\n🏷️Get 20% off with promo code ACCESS15\n\n📸LeBron James Los Angeles Lakers Name &amp; Number French Terry Shorts\n\n🔗https://t.co/3I7qaq0JBO https://t.co/QMRBh5ZmZb",
    "131": "GAME DAY for the Wolves!! \n🆚 Los Angeles Lakers \n⏰ 9:00PM CST\n📍 Target Center https://t.co/QC1VKoqRoO",
    "132": "Consensus Line Move:\n2021-12-17 Los Angeles Lakers at Minnesota Timberwolves from 221.50 to 222.50\nOver to the rack\n#NBA #betting #deeplearning #bitcoinmining",
    "133": "Revenge Game: D'Angelo Russell plays Los Angeles tonight.  He played 143 games in his career for the Lakers.",
    "134": "The Lakers History Podcast is the first podcast detailing the almost 75 years of Minneapolis/Los Angeles Lakers history. The who, what, where, and why for #Lakers exceptionalism! Hosted by @JustTrynaLaugh. The first episode drops on January 16th!",
    "135": "Los Angeles Lakers guards Russell Westbrook and Avery Bradley enter the NBA's health and safety protocols. My thoughts on this recent development via @basketball4News. \nhttps://t.co/D2J4WRmD07",
    "136": "The Los Angeles Lakers defeated the Boston Celtics 117-102 on Tuesday.\nhttps://t.co/oI7gVNu6PD\nhttps://t.co/0fO0GKb5Sj\n\n#basketball\n#Lakers\n#LakersWin\n#ballabloc https://t.co/1iIcndv6Hy",
    "137": "Here is what you need to know as the Los Angeles Lakers continue the road trip against the Minnesota Timberwolves Friday.  https://t.co/PEl1a7PshW",
    "138": "Los Angeles Lakers add Russell Westbrook, Avery Bradley to COVID-19 protocols",
    "139": "🚨 It's Game Day!\n\n🏀 Los Angeles Lakers @ Minnesota Timberwolves\n\n🕒 Tip off alle 4:00 🇮🇹\n\n💬 Live su Telegram https://t.co/ggnxaixAHp\n\n#LakeShow #RaisedByWolves #NBA75 https://t.co/4BIeNQoU8h",
    "140": "Consensus Line Move:\n2021-12-17 Los Angeles Lakers at Minnesota Timberwolves from 222.50 to 221.50\nUnder up to the task\n#NBA #betting #datascientist #crypto",
    "141": "Consensus Line Move:\n2021-12-17 Los Angeles Lakers at Minnesota Timberwolves from -1.50 to -3.00\n#RaisedByWolves driving the market\n#NBA #parlay #python #personalfinance",
    "142": "Isaiah Thomas Will Reportedly Sign With the Los Angeles Lakers - #naijaforum #naijablog #naijamusic - https://t.co/9x2hnzJDcx https://t.co/Yz7S2pNHFU",
    "143": "GAMEDAY.\n\n🏀 LOS ANGELES LAKERS 🆚 Minnesota Timberwolves.\n\n🏟️: Target Center.\n\n⏱️ 00:00 (🇦🇷/🇧🇷/🇺🇾/🇨🇱/🇵🇾)\n⏱️ 23:00 (🇧🇴/🇻🇪/ 🇩🇴/🇵🇷/🇨🇺)\n⏱️ 22:00 (🇨🇴/🇵🇪/🇪🇨/🇵🇦)\n⏱️ 21:00 (🇲🇽)\n⏱️ 04:00 (🇪🇸)\n\n📺 ESPN.\n💻/📱 NBA League Pass. https://t.co/vcnk7xuigw",
    "144": "I voted for the Los Angeles Lakers! Pick your favourite all-time NBA Jersey. #NBA75EuroVote https://t.co/E5gff27ZIf",
    "145": "On this day in sports history December 17, Washington Wizards Point Guard Gilbert Arenas recorded 60 Points, 8 Rebounds, 8 Assists, and 2 Steals in a 147-141 OT win against the Los Angeles Lakers in 2006.",
    "146": "Los Angeles Lakers add Russell Westbrook, Avery Bradley to COVID-19 protocols - ABC7 https://t.co/TFhu0cN6Q0",
    "147": "The Los Angeles Lakers received some good news involving the status of one of its key players.  https://t.co/BmzlC34Wrz",
    "148": "Los Angeles Lakers: Hey, we also did a buzzer beater! https://t.co/S5u0dWWWHs https://t.co/VlQfvN88w6",
    "149": "The Los Angeles Lakers keep getting away from finding 🅰️ Point gaurd who can utilize Anthony Davis better……",
    "150": "@PickDawgz Los Angeles Lakers vs  Minnesota T-wolves [ LAL +1]\nMilwaukee Bucks vs New Orleans Pelicans Bucks [ -3.5]",
    "151": "Match: Minnesota Timberwolves - Los Angeles Lakers\n\nBet slip link: https://t.co/INujaTezxA\n\n#MinnesotaTimberwolves #LosAngelesLakers #pundix #sportsbet https://t.co/cELuu4n83G",
    "152": "Lakers' Russell Westbrook and Avery Bradley enter NBA's COVID protocols - Los Angeles Times\nHey Lakers - don’t b insulting.  U do have Rondo. Geez. https://t.co/Qgx0ee2cA5",
    "153": "Los Angeles Lakers vs. Minnesota Timberwolves Free NBA Picks 12/17/21\n\nNBA Score Forecast: https://t.co/RqpGxG2FzB\n\nBet on Basketball: https://t.co/gATumMKeIT\n\n#Draftkings #Fanduel #Pointsbet #Basketballpicks #Sportsbook #NBAPicks #NBATwitter #GamblingTwitter",
    "154": "Consensus Line Move:\n2021-12-17 Los Angeles Lakers at Minnesota Timberwolves from 223.50 to 222.50\nUnder getting dough\n#NBA #sportsgambling #ml #success",
    "155": "Consensus Line Move:\n2021-12-17 Los Angeles Lakers at Minnesota Timberwolves from -1.00 to -2.00\n#RaisedByWolves there's a pulse\n#NBA #CryptoHoops #dataanalysis #cryptocurrency",
    "156": "isaiah thomas is signing a 10-day contract with the los angeles lakers!\nover the next 10 days the lakers will face the minnesota timberwolves, chicago bulls, phoenix suns, san antonio spurs and brooklyn nets. \n\nthomas played 17 games for the lakers in the 2017-2018 season \n#NBA",
    "157": "New York Knicks: New York Knicks:  Named NBA's Most Valuable Franchise, Golden State Warriors, Los Angeles Lakers, And Brooklyn Nets In\u0085 https://t.co/qnYx3y0U4O",
    "158": "Listen to the most recent episode of my podcast: Los Angeles Lakers https://t.co/FHxJhGJDos",
    "159": "With the next pick in the 2022 nba draft, the los angeles lakers select…@LindeEU https://t.co/yBzI8rc93u",
    "160": "New York Knicks Named NBA's Most Valuable Franchise, Golden State Warriors, Los Angeles Lakers, And Brooklyn Nets In… – NBA News https://t.co/7ZZ9Wd8fnW",
    "161": "New York Knicks Named NBA's Most Valuable Franchise, Golden State Warriors, Los Angeles Lakers, And Brooklyn Nets In… – Lakers News https://t.co/RXwXUCUbFO",
    "162": "View the best photos from when Los Angeles Lakers undrafted rookie Austin Reaves nailed the game-winning shot against the Dallas Mavericks.  https://t.co/Owv0t2xfjK",
    "163": "Today’s Laker Game Is Always A Favorite 💜\n\nMy Team vs My State\nLos Angeles Lakers vs Minnesota Timberwolves 🐺 \n\n#LALvsMIN\n#LakeShow #Lakers https://t.co/1gpDXtOoo7",
    "164": "A crypto company got into bed with the Los Angeles Lakers: Then it shot an insult  https://t.co/f7Wq0lVUai via @ZDNet",
    "165": "A crypto company got into bed with the Los Angeles Lakers: Then it shot an insult  https://t.co/QnpC0JDOr6",
    "166": "“On this date, Dec 17th in 2006-\n\nGilbert Arenas scores 60 points in a 147-141 win over the Los Angeles Lakers. \n\nSets a record for most points scored in OT with 16.\n\n#GilbertArenas #NBA https://t.co/EnO2po66Kc",
    "167": "Los Angeles Lakers Talk Of The Town https://t.co/kY3c2leFzI",
    "168": "Boston Celtics: Los Angeles #Lakers Sign Isaiah Thomas - Sports Illustrated Boston #Celtics News, Analysis and More https://t.co/a5OpuHRIJR",
    "169": "Kobe Bryant Los Angeles Lakers 2006-07 Upper Deck Black Quad\n#sportsCards\nSource: Fanatics Checker\nReason: In Stock\n\n05:36:31.9390 AM EST #Ad\n\nhttps://t.co/TLEGaVdQ8b",
    "170": "Kobe Bryant Los Angeles Lakers 2006-07 Upper Deck Black Quad\n#sportsCards\nSource: Fanatics Checker\nReason: In Stock\n\n05:36:31.9390 AM EST #Ad\n\nhttps://t.co/CErKt9zEdk",
    "171": "Los Angeles Lakers Talk Of The Town https://t.co/nAthbeV9OL",
    "172": "Get a summary of the Los Angeles Lakers vs. Minnesota Timberwolves basketball game. https://t.co/OHlA4xwA1a\nvia @ESPN App https://t.co/BSvoQriPv4",
    "173": "Lakers' Russell Westbrook and Avery Bradley enter NBA's COVID protocols https://t.co/nQsHi1nJj7",
    "174": "The Los Angeles Lakers have signed 7 foot Veteran Late Night Talk Show host Conan O’ Brien. He is expected start at Center.\nFrank Vogel hopes O’Brien will be a spark off the bench with his ability to annoy opposing teams offenses into mistakes. \nVia @ShamsCharania and @wojespn 💯 https://t.co/8n4v37S2cp",
    "175": "🗑️ #NBA Big Odds!\n\n⏰ Sato, 6:00 a.m\n\n🏀 Minnesota Timberwolves vs Los Angeles Lakers\n\n✅ #Timberwolves have won their last 2 games. #Lakers have won their last 3 games.\n\nCheza na M-Bet ushinde https://t.co/bYFGK4TIzM au Piga *798# https://t.co/H6IRdYmzI0",
    "176": "NBA Basketball Game Betting Picks Simulator: 10:10 PM ET - Los Angeles Lakers vs. Minnesota Timberwolves - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/PHtUP8lZty #nba #sportsbetting #freepicks #cappertek",
    "177": "Los Angeles Lakers star LeBron James came in at No. 2 in a new survey of the best player in the NBA.  https://t.co/1W5QonyEtv",
    "178": "Isaiah Thomas Will Reportedly Sign With the Los Angeles Lakers https://t.co/mW3SWEgApc via @Hypebeast",
    "179": "Los Angeles Lakers vs. Minnesota Timberwolves - 12/17/2021 Free Pick &amp; NBA Betting Prediction https://t.co/GwLg7HudpB\n.\n#Betting #FreePicks https://t.co/PANyE9SHOF",
    "180": "Los Angeles Lakers vs Dallas Mavericks Full Game Highlights | 2021-22 NB... https://t.co/ybGgwYxV9h @YouTubeより",
    "181": "Isaiah Thomas signed a 10-day contract with the Los Angeles Lakers on Thursday, mere days after he joined a G League team in a comeback effort, The Athletic reported. | @Reuters https://t.co/236FfPYyEL",
    "182": "\"Isaiah Thomas plans to sign a 10-day contract with the Los Angeles Lakers\" 💜",
    "183": "@bwwebber @ZackMann1997 I was born and raised in LA and for me it’s dodgers, rams, lakers, chargers, kings. The other teams I root against. Speak for yourself though. And there are 6 teams in LA anyways the angels and ducks are not in los angeles.",
    "184": "Isaiah Thomas Will Reportedly Sign With the Los Angeles Lakers – Lakers News https://t.co/74N8CvI8Dm",
    "185": "Isaiah Thomas Will Reportedly Sign With the Los Angeles Lakers – NBA News https://t.co/YfKUkBEFpK",
    "186": "Isaiah Thomas Will Reportedly Sign With the Los Angeles Lakers https://t.co/sM6bmtdbz9",
    "187": "Russell Westbrook positivo, focolaio per i Los Angeles Lakers https://t.co/J4qns5oCUx #Sportal",
    "188": "Items ordered from now on will not arrive by Christmas but you can still give the gift of a Los Angeles Lakers Fanatics eGift Card ($10 - $500).\n\nhttps://t.co/tt3u5YZPeg",
    "189": "A crypto company got into bed with the Los Angeles Lakers: Then it shot an insult  https://t.co/OW8z5dfMIG via @ZDNet",
    "190": "A crypto company got into bed with the Los Angeles Lakers: Then it shot an insult  https://t.co/M5vLt6DuvF",
    "191": "Check out this listing I just added to my #Poshmark closet: ⚡️Vintage Adidas NBA Los Angeles Lakers Kobe Bryant #24 Jersey Size XL⚡️. https://t.co/fHA82k3fL2 #shopmycloset @poshmarkapp",
    "192": "Isaiah Thomas, 32, is the 10th oldest player on the Los Angeles Lakers. 🤯\n\n#LakeShow\n#Lakers",
    "193": "The Los Angeles Lakers are signing veteran guard Isaiah Thomas.  https://t.co/9S3NhM1DNR",
    "194": "The Los Angeles Lakers will be without Russell Westbrook and Avery Bradley when they face the Timberwolves after both were placed in NBA Covid-19 protocols.\n\nhttps://t.co/4HoU0S8Ecc | #VisionSports https://t.co/a8UNZJ3PrO",
    "195": "carmelo anthony to los angeles lakers espn first take  https://t.co/719KRS69R5",
    "196": "We are best manufacturing and strong supplier Based on the authentic NBA jersey, the Icon Edition Swingman (Los Angeles Lakers) Nike NBA Jersey lets you rep your team while helping keep you cool and comfortable through every move. https://t.co/4I3Uc0gOw9",
    "197": "LOS ANGELES LAKERS DRAFT CAPITAL\n\n2022 - 1-10 to NOP; 11-30 to MEM (via NOP)\n2023 - Own or NOP (swap)\n2024 - To NOP unless NOP defers to 2025\n2025 - To NOP if NOP defers LAL's 2024\n2026-28 - Own\n\nCONTRACTS\n\nTalen Horton-Tucker $9.5m\nKendrick Nunn $5m\nMinimum Deals x8",
    "198": "Los Angeles Lakers Kobe Bryant Black Mamba T-Shirt https://t.co/gAl2QiS6OZ \n#LALakers #KobeBryant #BlackMamba",
    "199": "I’m only a Los Angeles lakers and rams fan only fuck the chargers angry 😤 and I’m praying for Donald praham jr 🙏 https://t.co/wxeSMFZylM",
    "200": "Los Angeles Lakers LeBron James Get Better Premium Poster https://t.co/SlzT1iGtZs \n#LeBron #LakersWin #LALakers",
    "201": "New Orleans Pelicans have the power to defer Los Angeles Lakers 2024 1st Round pick to 2025. This is a problem if LA is trying to make a move.\n\nPelinka will need to negotiate with David Griffin to remove that protection using 2RP(s). If he can do that, it opens a 1st to be moved.",
    "202": "NBA Basketball Game Betting Picks Simulator: 12/17/2021 10:10 PM ET - Los Angeles Lakers vs. Minnesota Timberwolves - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/PHtUP8lZty #nba #sportsbetting #freepicks #cappertek",
    "203": "5 SIGNS Pointing Towards the Los Angeles Lakers Becoming a GOOD Team! | ... https://t.co/rgNNFNw7nV via @YouTube",
    "204": "The Los Angeles Lakers had their star trio on court on Wednesday, but it was rookie Austin Reaves who was the unlikely hero in their 107-104 National Basketball Association (NBA) overtime victory over the Dallas Mavericks.\n\nREAD MORE: https://t.co/LK5m4y92nZ\n\n#DailyTribune",
    "205": "The Los Angeles Lakers had their star trio on court on Wednesday, but it was rookie Austin Reaves who was the unlikely hero in their 107-104 National Basketball Association (NBA) overtime victory over the Dallas Mavericks.\n\nREAD MORE: https://t.co/QVg4jsFC7U\n\n#DailyTribune",
    "206": "Los Angeles Lakers signed Isaiah Tomas for a 10-day contract. He's back in the league! \n\nAnother Allstar-caliber point guard is added to Lakers' pool, will this addition make changes in their team's performance?\n\n#Vodds #NBA #IsaiahTomas #Lakers https://t.co/DgvZyZtCiO",
    "207": "MERCATO NBA - I Los Angeles Lakers firmano Isaiah Thomas https://t.co/k3O7I0BNfe",
    "208": "@wheelsee Do the Los Angeles Lakers play at Crypto dot com arena?\nOr is it still Staples?",
    "209": "Los Angeles Lakers star Anthony Davis discussed Austin Reaves’ big shot against the Dallas Mavericks.  https://t.co/ppZ2nzKur6"
}