{
    "0": "@DiogenesofSC @celtics Thanks!!",
    "1": "@aja_f94 @celtics Thank you!! ☘️🤟🏼",
    "2": "@Wilson_charless @celtics John wall",
    "3": "@GriffinDK96 @celtics Stop it.  Marcus isn’t the problem.  Running back on D and not complaining on every damned call is the problem.  Somebody get Deuce to tell his Daddy it’s time to be more like Mamba, less like Nelly.",
    "4": "Please just win 🙏🏼🙏🏼🙏🏼 @celtics",
    "5": "please @celtics",
    "6": "@celtics Don’t care just win",
    "7": "@celtics That’s how the starting lineups should be shown EVERYWHERE.",
    "8": "@celtics This guy is delusional",
    "9": "@celtics neeed to fuckin win tonight!!!",
    "10": "@celtics please win",
    "11": "Please win @celtics",
    "12": "@Jesse_lad @celtics Or use the good players off the bench, why was Richardson in the whole fourth, he had a -21 +-",
    "13": "Let’s get it @celtics",
    "14": "@Dan_Savage @OrlandoMagic @celtics You don’t say…😏",
    "15": "@celtics Good to hear...let's light it up!!!! https://t.co/QAAl3Z62Wr",
    "16": "@celtics Not sure blowing a huge lead game after game is considered “playing the right way” but I’m also not a professional athlete so 🤷🏼‍♂️",
    "17": "@celtics How is the handler of this account still excited for a Celtics game, I don’t get it",
    "18": "@halIsyy @Courndogg @AProskauer @celtics Hence the deleted tweet 🤣🤣🤣✌️",
    "19": "@celtics pls win a game",
    "20": "11/3 FULL CARD🚨🚨\n\n#NBA ⭐️OG Anunoby OVER 5.5 Rebounds⭐️(2U)\n#NHL 🏒 Carolina Hurricanes ML -145 (1U)\n#NCAAF 🏈 Kent State -3 -115 (1U)\n#NBA 🏀Boston Celtics -6 (bought .5) -130 (1U)\n#NHL 🏒Edmonton Oilers -1.5 +110 (1U)\n\n8 days of straight profit?👀📈\n\n#GamblingTwitter https://t.co/zbECjim0vf",
    "21": "@yummyceltics @celtics Nothing else to say😭😭😭",
    "22": "@celtics Stop it",
    "23": "@celtics did you mean shame time?",
    "24": "@hibritty @celtics And happy birthday. https://t.co/sA8YwaFXg4",
    "25": "@Noah_Sayed529 @celtics They definitely are",
    "26": "@celtics Pls win",
    "27": "@celtics Watch the jays don’t give smart the ball once lmao",
    "28": "@Noah_Sayed529 @celtics Please Noah, save us!",
    "29": "@celtics Def using this https://t.co/RmGLMddQSr",
    "30": "@ChrisForsberg_ @cgasper @SIChrisMannix Serious Question. What makes Brad Stevens and Ime Udoka think that threatening to break up the team is a threat? What if that's what Tatum and Brown want? @celticsblog @celtics",
    "31": "@celtics Loss 🔜",
    "32": "@leveillejeremy @mikey_2599 @celtics Always excited for Celtics game day :D",
    "33": "@celtics Marcus Smart, Tatum n Jaylen at shoot around today..🤣🤣 https://t.co/VyE3NjoELT",
    "34": "@celtics Let me know if I have to sub in tonight",
    "35": "@celtics I get this guy is fighting an uphill battle with this joke of a roster that his totally unqualified and inept GM built but what the hell games has he been watching?  Playing the right way?  Heading the right direction?  Ime, you’re delusional.",
    "36": "@nickdelpizzahut @celtics “just play basketball” 😭😭 shit is funny idk why",
    "37": "@celtics Almost pain time",
    "38": "There are maybe 5 people who follow me who’ll get this.... But:\n🎶 Catch the @celtics on: https://t.co/kLssUD3Kt8",
    "39": "@Pants2k_ @celtics Big if true",
    "40": "@celtics Can’t wait to go 2-6",
    "41": "@celtics how ab y’all don’t choke this time… appreciate it &lt;3",
    "42": "@celtics Celts by 9",
    "43": "@celtics Remember theirs 4 quarters in a basketball game",
    "44": "@yummyceltics @mikey_2599 @celtics Me too. \n\nReal fans are still watching - not the fake, fair weather fans",
    "45": "@celtics This team should not be a work in progress ffs",
    "46": "The @Celtics starting Smart, Brown, Tatum, Horford, Robert Williams on Wednesday. #Celtics #NBA",
    "47": "@celtics figure it out and win some damn games",
    "48": "@Kaoz989 @Courndogg @AProskauer @celtics i know damn well you’re not comparing KAT to the likes of KG LMAO",
    "49": "@JMunoz15 whats going on with these @celtics better get their shit together",
    "50": "@celtics Maybe it wasn’t Brad Stevens fault at closing out games.",
    "51": "11-3-21\n\nNBA 🏀\n1u New York Knicks ML (-109)\n1u Chicago Bulls +2.5 (-109)\n1u Boston Celtics -7 (-109)\n\n*lines from Barstool*\n\nMore to ads to come throughout the night.",
    "52": "@SuttonEnzo @celtics this is so true",
    "53": "@whitty0013 @celtics Excuse me. How are you not the temp Braves fan avi? You not even going to wait for the parade? 😭",
    "54": "@halIsyy @Courndogg @AProskauer @celtics Were*",
    "55": "@celtics don’t lose",
    "56": "@celtics please win this game 🥲",
    "57": "@celtics Just win !",
    "58": "@celtics Just w i n",
    "59": "@MsSamanthaMay @celtics Try gambling against them, I never win a bet…",
    "60": "@celtics They suck",
    "61": "@celtics I would say please win but even that doesn’t work, so just play basketball and maybe a win will happen",
    "62": "@celtics Lets do that winning thing we talked about this time",
    "63": "@MsSamanthaMay @celtics Look on the bright side, you could be a CAVS Fan!!! 🤣🤔😂",
    "64": "Game mode. https://t.co/1n7j7UlypI",
    "65": "@celtics amanda what’s ur favorite restaurant 🤨",
    "66": "#NBA #NBATwitter Today's Lineups\n\n#BleedGreen \nBoston Celtics Starting 5:\nMarcus Smart\nJaylen Brown\nJayson Tatum\nAl Horford\nRobert Williams III\n\n#MagicTogether \nOrlando Magic Starting 5:\nCole Anthony\nJalen Suggs\nFranz Wagner\nWendell Carter Jr\nMo Bamba",
    "67": "@TermineRadio Tatum, Brown, &amp; the Boston Celtics had better win tonight against the Magic, or Justin Termine will show NO MERCY of this commentary on them on Thursday’s edition of NBA TODAY!",
    "68": "@celtics nobody is watching anymore, stop tweeting",
    "69": "After watching film of Monday’s loss, Rob Williams discusses what adjustments we need to make in order to respond tonight against the Magic. https://t.co/805M1cyOkS",
    "70": "We Here @celtics Let’s Get This Win ☘️ https://t.co/5RpMvk88Ka",
    "71": "Please take a break from embarrassing me tonight @celtics",
    "72": "Orlando Magic Vs Boston Celtics en Amway Center https://t.co/doOwVB1uPY",
    "73": "Most people know @Amway is a pyramid scheme scam. Only in Florida can Amway be so profitable that they can buy the naming rights to the @OrlandoMagic home building. Only in Florida.\n#NBA #Amway @celtics",
    "74": "Tonight's starting lineup for the Boston Celtics: Smart, Brown, Tatum, Horford, Robert Williams https://t.co/bVWH4AMCA2",
    "75": "@lebrxnjwmes Boston Celtics",
    "76": "@celtics We already heard this for three years. The “right direction” form office only means another lottery pick to us now.",
    "77": "@gabbgoudy @celtics you’re tall",
    "78": "@celtics What games is this man watching to say this stupid shit",
    "79": "Tonight the pick is Over 212 total points in the Boston Celtics vs Orlando. The simulation is predicting a total of 229. So there should be good value in the bet.",
    "80": "@IAmBreezyii @celtics Cole Anthony scoring 52 points tonight",
    "81": "@mcuban I became a millionaire because of crypto and am still not gonna fully retire. By the way, I got a suite for the Dallas Mavericks vs. Boston Celtics this Saturday that my crypto gains paid for. Enjoy my crypto gains, brother!!",
    "82": "@TheJ35 @yummyceltics @celtics No one is saying this is a championship team. But its a much deeper team then it was last year",
    "83": "@celtics Playing the right way?!",
    "84": "@White_Mamba24x @celtics I feel like he and the players just say this to not give the media something to feed off. There’s no way they can actually think we’re playing well, let alone being on the right track",
    "85": ".@juneAmbrose, the creative director of @Puma, was seen with her daughter at a @celtics vs. @chicagobulls game wearing a few pieces from the upcoming “High Court\" collection. \nPhoto: June Ambrose https://t.co/nZ4PMXs9Ow",
    "86": "@celtics You are what your record says you are.",
    "87": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub I miss the greatness of the Celtics, it's bad to see a team with our greatness serving as a mockery good luck today",
    "88": "Gary Harris (left ankle sprain) is OUT tonight for the @OrlandoMagic’s home game agains the @celtics.",
    "89": "I’d honestly rather listen to @adamjones985 for 5 hours than pay any attention to the @celtics",
    "90": "@OrlandoMagic and @celtics are battling tonight in #NBA regular season, we got you covered at #sportsbattleapp for over/under picks \n@jaytatum0 3.5 Assists 7.5 rebounds 25.5 points which over/under are we jumping on ? #Celtics #NBA #OrlandoCity #BostonCeltics #boston #DFS https://t.co/QJgD0fpLHX",
    "91": "@celtics “Heading in the right direction” https://t.co/bpqaicdbCX",
    "92": "Today's NBA Picks: 7:10 PM ET - Boston Celtics vs. Orlando Magic - 25 PICKS AVAILABLE: https://t.co/njBknMNqaG #nba",
    "93": "@celtics We went into OT 4 games. \n\nThose games could have been in our favour but it didn’t happen. \n\nWe need a PG and we will be fine.",
    "94": "@MaineCeltics @celticsblog @Vistaprint Better than the Boston Celtics",
    "95": "@RhettMason10 @celtics Pritchard and Neismith to start.",
    "96": "@Courndogg @AProskauer @celtics i said what i said. you’re suggesting trading their superstar for a player who’s entire career has consisted of losing, no thanks lmao",
    "97": "@celtics I didn’t know 0 defense was the right direction not to talk about our “stupendous” offense that scores 11 points in the fourth quarter😬",
    "98": "🔴 Boston Celtics Vs Orlando Magic🏀 | Live Reaction &amp; Play-By-Play 🔴 https://t.co/7K2ojULH7K via @YouTube",
    "99": "@celtics play Nesmith",
    "100": "@celtics Huh? What growth? Playing the right way? Brah we have no pg or playbook.",
    "101": "@celtics Bring back BS, pls!",
    "102": "@celtics Give me nesmith",
    "103": "@halIsyy @AProskauer @celtics I said trade Tatum not Brown. Tatums ceiling is getting smaller and smaller.  Too much iso and throwing his hands up crying when the person he’s defending is over half court already.",
    "104": "@celtics Growth? Where? This team is making all of the exact same mistakes that kept them from putting away games last season. This team is not playing the right way. What team is Udona watching?",
    "105": "@JaequanFranks @celtics That’s really gonna sort our playmaking problems out",
    "106": "@wburneraccountt @celtics Ey tbf at least it’s a sign of progress from the first 6 games. We couldn’t even get a lead big enough to blow in those. I still think there is somin fundamentally fucked up within the franchise so I have little hope but we’ll see",
    "107": "@Courndogg @AProskauer @celtics ah yes because trading your superstar for a player who won’t be guaranteed to succeed with a change of scenery will work",
    "108": "See you soon @celtics",
    "109": "@celtics Play Pritchard and Nesmith. The lack of spacing is evident.",
    "110": "@DonteEverett @celtics Bro I swear on everything. Boys stinking it all the way up",
    "111": "Al Horford highlights vs Chicago Bulls \n\n▪️ 20 PTS (53%)\n▪️ 10 REB\n▪️ 3 AST\n▪️ 1 STL\n▪️ 1 BLK\n\nhttps://t.co/Emh4C4xp5H @celtics #BleedGreen",
    "112": "Can we pls getting a fucking win today?? @celtics",
    "113": "@celtics Blow a 19 point lead \n\n“Heading in the right direction”",
    "114": "The Democrats are the Boston Celtics of getting deals done https://t.co/uP7UU1BhUy",
    "115": "@celtics He’s starting to get scared. He’s starting to realize that he doesn’t hold the cards. Unfortunately, in that league, the players do.",
    "116": "Jaylen Brown vs Chicago Bulls highlights ⤵️\n\n28 PTS (56%)\n7 REB\n2 AST\n1 STL\n\n🔗 https://t.co/3ujFLNMUJP @celtics  #BleedGreen https://t.co/9YTnGolcbu",
    "117": "@yummyceltics @Aluna017 @celtics You can say what you want, but we’ve seen years of Jaylen, Tatum, Smart, Horford.  It’s got us what?",
    "118": "Whether you’re watching the game, or playing the game, do it in style! 💚🎮🏀\n\n#zipchairgaming #gamingsetup #gamingchair #cltxgaming #celticsnation #basketball \n\n@CLTXGaming \n@celtics https://t.co/Xpise6h88h",
    "119": "@lead2324 @RajonRondo @ACFresh21 @celtics @Lakers TS: Cbass47 @homerg29 sweet",
    "120": "@celtics Fire udoka please",
    "121": "@celtics We blew a 19 point lead what is he talking about 😑🤔",
    "122": "Let's go! @celtics let's get this win!",
    "123": "OK @celtics let's go! #BleedGreen @TheSportsMuseum @tdgarden @NBCSBoston @985TheSportsHub https://t.co/AOmg9zJ8AW",
    "124": "@Marc_DAmico I'm sorry but if you feel good about this team in any way after watching this start to the season than the standards for the Boston Celtics have been dramatically lowered. https://t.co/Vqp6RaPpoP",
    "125": "@ColinMc60207126 @celtics Okay Colin",
    "126": "@celtics \"We're playing the right way\"... God I hope not... If this is your design for both offense and defense you should not be a head coach in this league...",
    "127": "@celtics Nope, WINS are the big picture!",
    "128": "@IAmBreezyii @celtics Lmaoo man Im gonna be pissed if they lose",
    "129": "@Aluna017 @TheJ35 @celtics yea agreed lmao ain’t no way people think it’s the same roster as last year",
    "130": "@celtics We’re one of the worst defenses in the league so I don’t think that the trend you want.",
    "131": "@celtics Jesus coach, what the hell are you watching?",
    "132": "@celtics Is he kidding?",
    "133": "@wwfcjoe_ @celtics Yeah. An NBA coach knows less about basketball than a random guy named Joe on Twitter.",
    "134": "@celtics Growth.  Got it.",
    "135": "@celtics Ok homer",
    "136": "@Courndogg @celtics Ah yes cuz KAT who is a perennial loser is gonna help things",
    "137": "@celtics \"... WE'RE PLAYING THE RIGHT WAY.\" 🤣🤣🤣🤣🤡\n\n#whatcanbrowndoforyou",
    "138": "@TheJ35 @celtics This is the dumbest tweet of the day. If you think last year's roster is any better then this roster, then your opinion is absolute trash",
    "139": "Not watching y’all again if you lose tonight @celtics",
    "140": "@celtics With all due respect but coach Udoka can’t help this team",
    "141": "Boston Celtics Nike 75 Anniversary Long Sleeve Black\n\nhttps://t.co/SIIklwjXhZ\n\n#sponsored #celtics #nba #basketball #bostonceltics #boston #jaysontatum #nbaplayoffs #celticsnation #k #sports #jaylenbrown #kembawalker #bleedgreen #nbafinals #marcussmart #ballislife #nbabasketball https://t.co/KuS0SrcJnP",
    "142": "@celtics Growth is the last word I would use to describe last week.",
    "143": "@celtics We just wanna see wins \n\nHad the bulls won wire to wire I’d have been ok but you guys were up 15+ at home and at the start of the 4th quarter \n\nChokes are worse than anything",
    "144": "@celtics Trade smart and Tatum. Get KAT and have pritch move the ball around. Then sign an established point in the off season.  Rebuild.",
    "145": "@celtics What growth, Ime WHAT GROWTH? https://t.co/ekmDIr7nRY",
    "146": "@Becoming_Bryna @celtics Yup, let’s see how they respond to adversity! ☘️💚☘️💚",
    "147": "@celtics We are with ya, Celtics...championships are born out of adversity...one quarter at a time. 💚☘️💚☘️\n\nLet's..... https://t.co/ImPecnFbrc",
    "148": "I would like the @celtics to start winning games please",
    "149": "@celtics Having a higher score than the other team wins the game not showing growth",
    "150": "Boston Celtics Ime Udoka on recent Marcus Smart comments  directed at Jayson Tatum and Jaylen Brown..” It’s nothing that we haven’t talked about.Not trying to blow it out of proportion.”@wbznewsradio https://t.co/yLpFYXaTv3",
    "151": "@celtics Teems In the East got better in the off-season while we did nothing.  There is a reason we are where we are to begin the season",
    "152": "@celtics Is this Doc Rivers or something? https://t.co/i3XqIaH0y5",
    "153": "@celtics Implement the bench more man why Pritchard and nesmith not even get 10 combined minutes",
    "154": "@celtics C’mon the roster sucks, as well as the way we play 🤦🏼‍♂️",
    "155": "@celtics gonna have to bring this back :( https://t.co/Wmj1PfuScF",
    "156": "@celtics Coulda stopped talking after he called the team soft",
    "157": "@celtics Unfortunately tonight is a must win already",
    "158": "@celtics I don’t see it. I see players calling each other out for ball hogging",
    "159": "@celtics I’ve seen minimal to no growth…",
    "160": "@celtics Take conteol of the ball..control that game..focus and rebound more.",
    "161": "@celtics So blowing a 19 point lead is heading in the right direction?",
    "162": "@celtics Bro trade for Beal please",
    "163": "@celtics he’s watching different shit to me then",
    "164": "@celtics We hear this before every single game lmaooo at least switch it up",
    "165": "@celtics Just win we don’t care",
    "166": "\"You look at the record, it’s one thing,\" says Coach Udoka. \"But you look at the results and the growth that we’ve shown the last couple of games, we’re playing the right way. Haven’t closed out a few, but as long as we’re heading in the right direction, that’s the big picture.\"",
    "167": "Episode 94: We Break down a wild Week 8 in the NFL, Preview Week 9, and try and figure out what the F*** is up with the @celtics \n\nhttps://t.co/6KfqXyRTwy\nApple:https://t.co/ZXAiRgpE9K\nSpotify:https://t.co/sQu36QsXcZ https://t.co/I1wSGhxHo1",
    "168": "Pregame with @celtics Head Coach Ime Udoka. Boston is in Orlando to face the @OrlandoMagic tonight. @FortyEightMins https://t.co/klAF7xfnZF",
    "169": "Going to Add this 5 pick teaser as well just for fun:\n\nTeaser (5pt) +400\n- New York Knicks+6\n- Cleveland Cavaliers+10½\n- Boston Celtics-2\n- Washington Wizards+1½\n- Brooklyn Nets+½\n\n#NBA2K22 #NBA75 #NBA #NBATopShotThis #NBAonTNT #NBAPicks #NBATwitterLive #gamblingtwitter https://t.co/2LjzdbXUb5",
    "170": "1-2 yesterday. Tonight’s Lionheart Picks are \n1. Nashville Predators team total over 2 1/2\n2. Boston Celtics vs Orlando Magic over 212 1/2\n3. Toronto Raptors vs Washington Wizards over 212\n#LionheartPicks",
    "171": "@PedroTheK1ng @celtics Thank you!!",
    "172": "Please fellas @celtics",
    "173": "Seems like very one knows what the Celtics need except the @celtics 🤦🏿‍♂️…you already got two elite scorers get a playmaker /floor general at point guard you don’t need shoot first pgs anymore",
    "174": "Tuesday NBA Action🏀\n\nSingle plays:\n- Boston Celtics -6.5\n- New York Knicks +1\n\nParlay: +288\n- Celtics ML + Knicks +1 + Nets ML\n\nBest of luck to you all 🍀\n#gamblingtwitter",
    "175": "@hibritty @celtics Happy birthday",
    "176": "Pregame with Coach Mosely of the @OrlandoMagic. The Magic are at home in Orlando at the @AmwayCenter to face the @celtics tonight. @FortyEightMins #MagicTogether #NBA75 https://t.co/wPEhjd3Cic",
    "177": "Boston Celtics vs. Orlando Magic Game Preview, Injury Report, and Info \n\n@JackSimoneNBA on what to know ahead of tonight’s game:\nhttps://t.co/kQKTc3GBWf",
    "178": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub Their probably happy it's Away",
    "179": "Fulton and Cobb Counties canceling school on Friday for the @braves parade. All I’m sayin is, school was never canceled in Massachusetts for the @RedSox @Patriots @celtics and @NHLBruins",
    "180": "@js075 @celtics Thanks☘️!",
    "181": "@notfunnynflmeme @celtics Thanks!!",
    "182": "@estHerr34 @celtics Thank you!!",
    "183": "Lots of good peoples’ mental health is hinging on you tonight @celtics please be good",
    "184": "Boston Celtics Larry Bird Jersey Green\n\nhttps://t.co/OesB5fCIYG\n\n#sponsored #celtics #nba #basketball #bostonceltics #boston #jaysontatum #nbaplayoffs #celticsnation #k #sports #jaylenbrown #kembawalker #bleedgreen #nbafinals #marcussmart #kevindurant #ballislife #nbabasketball https://t.co/kZJEoFKnl2",
    "185": "#Basketball,\n\n#NBA, #NBATwitter, \n\n#GOCeltics, #Celtics, #BleedGreen, #CelticsWin, #BostonCeltics, vs. #PureMagic, #OrlandoMagic, #GoMagic, #LetsGoMagic, Get your best odds - fast at https://t.co/Ohl03KWAVe https://t.co/6jjCvRW7iM",
    "186": "@hibritty @celtics Happy birthday Celtics fan go C’s",
    "187": "GAME #9 \n\nThe @OrlandoMagic 5 game home stand starts tonight with the @celtics in town!\n\nPregame starts at 6:30 PM with @JakeChapmanOM with tip off set for 7 PM on @969thegame https://t.co/VwG7717GBK",
    "188": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub Please…",
    "189": "Been very (very) slowly completing S2 team sets.\n\n@ATLHawks ✅\n@celtics ✅\n@nuggets ✅\n@Timberwolves ✅\n@OrlandoMagic ✅\n@SacramentoKings ✅\n@hornets ✅\n\nWeird sense of accomplishment in adding another team to the list!  #NBATopShot #NBATopShotThis",
    "190": "WATCH: Is this a new low for the Boston Celtics? https://t.co/HICNP2TvqT https://t.co/WGuEMtkVMS #nba #sportsnews #basketball https://t.co/iDqgikwl08",
    "191": "@celtics trading brown 🏀 #Analyticsballer @RealJayWilliams  @sixers  don’t call Danny he is on a vacation ! @Espngreeny  🏀 @JalenRose",
    "192": "@celtics shouldn’t be looking this bad @FCHWPO @jaytatum0 I believe in y’all as the forefront on both sides of the ball…",
    "193": "Boston Celtics -6.5\nChicago Bulls ML\nNew York Knicks ML\nDenver Nuggets ML\n\n#NBA #sportsbettingpicks #sportsbets",
    "194": "The question shouldn’t be if the @celtics will bounce back against @OrlandoMagic, but more on how will they respond…Better offense or better defense? #Celtics #Magic #NBA #NBATwitterLive #NBA75 #VinnyHoopz",
    "195": "@RealJayWilliams  perk is extremely wrong on @celtics  Marcus smart! How is your veteran underestimating his teammates or coaching staff it’s clear basketball is play different  ways but Celtics basketball is Marcus smart as of the last few years! He wants to play tradition 🏀!",
    "196": "#Reading: what’s wrong with the Boston Celtics? Was Marcus Smart right? \n@BellyUpSports | @HoopsBellyUp | #NBATwitter | #nba | #BleedGreen \n\nhttps://t.co/2czT5Aqh6r",
    "197": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub Y’all play ball in I want y’all to communicate &amp; trust each other tonight ! Don’t give up on defense celtics.. let’s get a win #CelticsNation4L",
    "198": "Boston Celtics: BeanTown Bummers? (@painsworth512) https://t.co/kaA56lfZf9",
    "199": "#DailyPick \nCeltics-7 @ Magic\n@celtics will get right, eventually.  Hoping @smart_MS3 lights a fire under the team after his comments last game.  @OrlandoMagic got their surprise win last time out so not expecting much\n\n#NBA2K22 #NBA75 #GamblingTwiitter \nOverall: 185-152-5",
    "200": "ONLY ONE PIE TO MY GOALLLL🙌🏼Every Thanksgiving table needs a pie, so buy a pie from Marci to benefit @communityserv! Every $30 pie sold feeds a critically ill neighbor for a week.  https://t.co/kR8Y1oHvsG #Thanksgiving #pieinthesky please RT @BostonDotCom @BostonTweet @celtics 🥧",
    "201": "WATCH: Is this a new low for the Boston Celtics? https://t.co/sV3zUdhXLY",
    "202": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub Time to be disappointed again 🥰",
    "203": "The Boston Celtics are not happy with me-- that's okay. I'll still keep watching that garbage.",
    "204": "@hibritty @celtics Happy Birthday ☘️🏀",
    "205": "Picked up another #larrybird #rookiecard to add to my collection 💪💪hopefully it grades well #staytuned #bostonceltics #halloffamer #basketballcards #sportscards #sportscardcollector #sportscardinvesting https://t.co/BlCfSLrBrG",
    "206": "Remembering @Jerry_Remy. 🙏🙏\nRest in peace, #RemDawg \nThe @Patriots are in the playoff hunt after their big win over the @chargers!\nWHAT is going on with these infighting @celtics? \n#OurBestFoods #OurBestMeatballs \n#SkillingsAndSons #EverythingWater \nhttps://t.co/QhZ5RH8EG8",
    "207": "@a_garcia028 @celtics Thanks!! ☘️",
    "208": "@SmartOfMarcus @celtics Thanks!",
    "209": "@CodyBC0329 @celtics Thanks!!",
    "210": "What is wrong with the Boston Celtics?\nThey are currently 2-5 and 12th in the east\nCan they bounce back? https://t.co/RngmWxzrQ3",
    "211": "@PaulMurphy1973 @BCCoachStevens @celtics @memgrizz His athleticism is off the charts. Glad he is doing well, but disappointing he did not get more of an opportunity here.",
    "212": "@celtics Red Claws. Red Claws. Red Claws. Red Claws. Red Claws. Red Claws. Red Claws.",
    "213": "@celtics @KeithSmithNBA did the injury report drop yet?? Waiting for that last minute addition lol",
    "214": "This current Boston Celtics team is the Durant/Westbrook/Harden OKC Thunder team. In other words, like that Thunder squad, this Boston squad will never get it together and will never win a championship together.",
    "215": "Boston Celtics at Orlando Magic  Game #8   11/3/21 https://t.co/cr1sZ11JGn https://t.co/tN3qdPwc3o",
    "216": "Rui, Harrell, Deni and 2 firsts for Tatum @celtics",
    "217": "@SebouhMajarian @celtics Sixers city jawns are 🔥🔥🔥 this year.. I’m gonna need that 25 😂",
    "218": "Was Marcus Smart saying something smaht? What's wrong with the #NBA's Boston Celtics? #BleedGreen \n\n@BellyUpSports | @HoopsBellyUp | #NBATwitter \nhttps://t.co/9bXquKxD0H",
    "219": "Come on @celtics let’s get our shit together and start winning some basketball games #lfg #BleedGreen",
    "220": "@OrlandoMagic @celtics @AmwayCenter @BallySportsFL @969thegame @wendellcarter34 How do I purchase a message for the video board",
    "221": "@TheBostonBrit @celtics Those black unis 💥",
    "222": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub I think im prepared for another L https://t.co/UnyZUJ3GhA",
    "223": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub How can you be a veteran on the Celtics and play no defense much\nLess get the other players involved,\nBut at the end of the game call them your brother after losing a game that you should have won!!! How does that work?????? That's being selfish!!!!!",
    "224": "@LEcutioner @celtics smart can take his 8 points on 30% shooting to another team. there’s a reason they don’t pass him the ball",
    "225": "@celtics Yo omg it’s Hordan Geyward",
    "226": "@siawayne @celtics @OrlandoMagic @NBCSBoston @985TheSportsHub *Stevens",
    "227": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub I don't know, I just don't know, but the Tatum and Brown Duel might be coming to an end, cause the Celtics start is ugly and something got to change, players are not pulling their weight and a trade maybe in order\nTo get things back on track!!!!!",
    "228": "NBA 11/3 plays…\n\nWashington Wizards 1Q -.5\nBoston Celtics 1Q -2.5\nCleveland Cavaliers 1Q +1\nDenver Nuggets 1Q pk \nMinnesota Timberwolves 1Q -.5\n\nOne more later…. Best of luck!",
    "229": "Tomorrow 6pm tune into Episode #7 of @SwooshHoopsPod  in which we (@ErnestBooker88 @armastradamus and me) discuss: \nthe Scottie Pippen Drama \nthe Boston Celtics Drama, \nthis weeks power rankings, \nour most impressed team besides Lakers and Knicks \n\nhttps://t.co/QWmFGoFTcV",
    "230": "@BuckReising @1045TheZone Yep Boston Celtics 08",
    "231": "Fan of the Boston Celtics? Get a $300 Bonus with this #CreditCard. - https://t.co/vqWR6JC2x7",
    "232": "Every team comes up with sick theme nights/jerseys. I get they’re built on tradition but I’ll stand on this hill that the @celtics need a alternate logo or mark that’s more modern and that they can do something more fun with. Be bold. Try something that doesn’t look like a banner https://t.co/rM2Lf2wgpJ",
    "233": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub Please, for my mental sanity. Just please dont lose",
    "234": "@OrlandoMagicUK @celtics @AmwayCenter @OrlandoMagic @TheBostonBrit @NBA_UKfans @BallyMagic @mikeyclark87 @gera1nt @biffabacon439 Gonna watch this live, hopefully I don’t jinx it!",
    "235": "@hibritty @celtics You're very welcome! We got this! https://t.co/uCX4wlkF1Z",
    "236": "@nabrialong @MiamiHEAT gonna wipe the floor with them @celtics boys 🔥",
    "237": "@hibritty @celtics Happy birthday!! Go Celtics !!",
    "238": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub I’ll take one for the team and put money on the Magic so the Celtics can win",
    "239": "#UCL #NBA75\n\n• Inter/Boston Celtics {1.86} 2u https://t.co/P5ugc3DvWz",
    "240": "@StoolGreenie This is the type of team the Boston Celtics should strive to be",
    "241": "@hibritty @celtics Happy birthday",
    "242": "@LondonSlammer @celtics ☘️! You know it man https://t.co/4WCk3D76ma",
    "243": "@TheBostonBrit @celtics UK Celtic? Followed!",
    "244": "@celtics You tryna win later or?",
    "245": "@celtics We miss the Red Claws!",
    "246": "The Orlando Magic are back home tonight to take on the Boston Celtics at 7pm on @BallySportsFL\n\n#boston #sports #game #orlandomagic #magictogether #jaysontatum #podcast #spotify #jaylenbrown #nba #bostonceltics #basketball #ESPN #regularseason #coleanthony #nbaseason #franzwagner https://t.co/6rifHE2uLl",
    "247": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub Win please",
    "248": "@hibritty @celtics Happy birthday!",
    "249": "@celtics Bring back the Red Claws",
    "250": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub If we lose to the Magic bro... Cole Anthony been killing it so far",
    "251": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub if we don’t win…",
    "252": "@celtics cursed image",
    "253": "Boston Celtics are a poorly built team. They are going to have to trade Tatum or Brown eventually.",
    "254": "@raypadgett11 @smarfwater @Al_Horford @AnnaHorford @tvabby @aminajadeTV @DJ_Bean @ChrisForsberg_ @Max_Lederman @NBCSCeltics @celtics @NBCSBoston Totally agree, I really hope he finishes out his career in Boston",
    "255": "Imagine making a uniform with “cigar smoke” on the side from a coach that no one under the age of 55 saw coach the team?! Jesus fucking Christ @celtics, LIVE IN THE NOW! https://t.co/4no0yZnBFO",
    "256": "Miami Heat vs Boston Celtics game Friday night in Miami 🔥🏀",
    "257": "Given the current performance.of the team, where do you think the team will end up this season? ☘\n\n#bostonceltics #celtics #celticsdiary https://t.co/DD4NgWcIit",
    "258": "Power Plays\n\nNBA\nPortland Trail Blazers -5.5 @ 1.95 1u\nBoston Celtics -7.0 @ 1.93 1u\nNew Orleans Pelicans +4.5 @ 1.90 1u",
    "259": "@BeanTownBoolin @celtics The Celtics had like a 4 year head start to come up with SOMETHING not related to themselves and a friggin BASEBALL (read - an old fogey sport) team came in and absolutely smashed them creatively!",
    "260": "🔵ORLANDO M⭐️GIC GAMEDAY⚫️\n\n🏀: @Celtics \n🗓: Wednesday 3rd November\n⌚️: 11:00pm 🇬🇧\n📍: @AmwayCenter \n\n📲: Celtics Game Preview https://t.co/R7wC6HLYT3\n\nWatch the entire 2021/22 season with NBA League Pass UK: https://t.co/KlfvJJzQnK\n\n#MagicTogether #NBA75 https://t.co/5YhpiSky5L",
    "261": "@hibritty @celtics Same to you 🤘🏾",
    "262": "Don’t worry @celtics, I still believe in you😭 https://t.co/J0OYVh1fZc",
    "263": "“Robert Who? 75th List Snubs &amp; Klay Still Actin Light-Skinned”.\nhttps://t.co/DkEh1kL0q9\n@KlayThompson #BleedGreen #DubNation @warriors @celtics #NBA75 #NBATwitterLive #Klay",
    "264": "@HoodieMatic Subliminal shot from @chicagobulls beating @celtics 😎",
    "265": "Here's a look at my sports fandom offering the next few months \n- Atlanta Falcons (lol)\n- Boston Celtics (eh)\n- S. Carolina Women's hoops (hell ya)\n- S. Carolina Men's hoops (pain)\n- GT men's hoops (??)\n- Syracuse men's hoops (boogers) \n- Carolina Hurricanes hockey (🤷‍♂️)",
    "266": "This is just sad. Can the @celtics do SOMETHING interesting one of these years?! https://t.co/eYHYs9uRgX",
    "267": "@cmoney205 @celtics Thank you!!",
    "268": "@DanKelley66 @BCCoachStevens @celtics @memgrizz Was just reading an article on seven players that have really stood out so far this season. One was Javonte green😐",
    "269": "@pasha21k @celtics Thanks ☺️",
    "270": "@shooter_spike @celtics The showtime era lakers had a more diagonal drop shadow",
    "271": "@m0nte____ @celtics 🤟🏼 happy birthday! https://t.co/BWD0YFfbqS",
    "272": "@Cmoon05 @gabbyhurlbut10 @celtics Thanks!!",
    "273": "@gabbyhurlbut10 @celtics Thank you!! ☘️",
    "274": "I believe that if \n@BCCoachStevens\n would bring back \n@isaiahthomas\n he could help fix what is wrong with the \n@celtics. Or he could help the @BrooklynNets @sixers @Suns",
    "275": "@celticsblog I believe that if @BCCoachStevens would bring back @isaiahthomas he could help fix what is wrong with the @celtics",
    "276": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub More pain",
    "277": "@KingJames this is the first time @StinaAleah has painted Lebron.... Bird/Kobe/Jordan are coming along the wall with him @espn @Nike @NBA @Lakers @celtics @cavs  She's also working with the NBA for All Star Game in Cleveland. https://t.co/kkGfMUsN52",
    "278": "Boston Celtics Daily Links  11/3/21 https://t.co/C7fwJBh9AM https://t.co/qv7RcUEIeJ",
    "279": "@celtics @NBCSBoston @985TheSportsHub Another L. This Celtics Team is trash until Tatum and Brown learn how to play Team basketball. And Ime has not been impressive. Brad Stevens would have won both those OT games with his ability to draw up plays and not run players into the ground",
    "280": "@celtics Redclaws bettah",
    "281": "@celtics Good lord, these are god awful lol",
    "282": "NBA: \n    - Dallas Mavericks -1\n      [1u] -110\n    - Boston Celtics -6.5\n      [1u] -115 \n\nNHL: \n   - Carolina Hurricanes -1.5 \n      [1u] +165",
    "283": "@DanKelley66 @BCCoachStevens @celtics @memgrizz We definitely need a true point guard",
    "284": "@bubblybrielle @celtics @Jaguars @FSUHoops @FSUFootball Ma’am the Celtics...",
    "285": "@derekbfay @celtics @OrlandoMagic They will get blown out tonight…this team reacts very poorly to adversity",
    "286": "@celtics HOW CAN I BUY THESE IN THE UK WITHOUT HAVING TO RESORT TO FAR EAST KNOCK OFFS?!",
    "287": "@bballbreakdown @breathehoops @celtics Marcus smart hasn’t been good in two years and it’s time to let that sink in. We almost traded him this off season for lonzo. I think the Celtics know but won’t say because it would hurt his trade value. But smart is washed no matter how many random plays he does.",
    "288": ".@celtics win today and shut them up atleast PLS",
    "289": "@celtics I'm not even being hyperbolic, but I might have to switch basketball teams after seeing this tragedy. You guys are killing the fans. \n\nDO SOMETHING other than this. \n\nWHY IS VISTAPRINT SO HUGE ON THE JERSEY?\n\nWHOSE 4-YEAR OLD KID DESIGNED THESE??? STOPPP",
    "290": "@wwfcjoe_ @celtics @OrlandoMagic @NBCSBoston @985TheSportsHub Magic honestly not that bad tho. As bad as we were the other night against them, they played dece",
    "291": "WATCH: What is going wrong with the Boston Celtics this season? https://t.co/8518KoWE4l https://t.co/WGuEMtkVMS #nba #sportsnews #basketball https://t.co/rjlgT8Gdjv",
    "292": "@celtics bring back the red claws, cowards",
    "293": "@celtics @celtics @MaineCeltics \n\nYou guys aren't serious about these new jerseys, right? \n\nTHEY ARE AWFUL. \n\nDO YOU GUYS EVEN HAVE A GRAPHIC DESIGNER ON STAFF???\n\nWHO DESIGNED THESE????",
    "294": "THE Boston Celtics play tonight, let’s get it. Time to turn things around #BleedGreen https://t.co/VXG3GsP9Ot",
    "295": "@celtics is this a joke? \n\nSERIOUSLY?? \n\nTHESE ARE HORRENDOUS??",
    "296": "@BurkLuca @OrlandoMagic @celtics @AmwayCenter @BallySportsFL @969thegame @wendellcarter34 You realize the players don't control the social media guy right?",
    "297": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub Another Loss incoming",
    "298": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub Let me guess: have @FCHWPO make us competitive for 3 then use him as a listening post on the corner in the 4th for the sake of \"🏀 movement\" and \"sharing the 🏀\".\n\nMight as well stick the @CITGO sign on him so Wyc et. al can get the 💰.\n\n#whatcanbrowndoforyou",
    "299": "“We must hold the Chinese government accountable,” Boston Celtics backup center Enes Kanter said of the “cultish Chinese Communist Party.”  https://t.co/0uUz2NqL6J",
    "300": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub Plz win for my sanity",
    "301": "Orlando Magic - Boston Celtics • 2021-11-04 https://t.co/FwLkY2nMTY",
    "302": "@celtics Call Arch up.  Team needs a real point guard ! @VUCoachJWright @RyArch15",
    "303": "@celtics Redclaws was better and you know it, but get that bag for merchandising I guess",
    "304": "@gabbyhurlbut10 @hibritty @celtics Happy birthday!",
    "305": "@celtics We honestly couldn’t give two fucks",
    "306": "@celtics They can probably play better than this team tbf",
    "307": "@celtics Ima be honest I liked the red claws better",
    "308": "@celtics Maine Celtics &gt; Boston Celtics",
    "309": "@celtics Our only hope for a championship",
    "310": "@celtics These were my takes on them 👀🤷🏻‍♂️☘️ https://t.co/pXygA33kcn",
    "311": "@NonTwitWinson: Yo fam what you doing on 11/3?\n\nMe: Working and celebrating 🇵🇦independence Day. Why what's up?\n\n@NonTwitWinson: Okay bet, I got us tickets to the @celtics if you're down but it's in Orlando. Pull up on me.\n\nMe: Say less. \n\nHello, FL☺️😎",
    "312": "@HunchoJt__ @celtics Lmfao",
    "313": "@celtics Bro we need new colors. This shit is tiring",
    "314": "@hibritty @celtics Happy Nameday!🥳👏🐩🐾",
    "315": "@celtics Why don’t y’all worry about winning a game first like damn.",
    "316": "@celtics have the Maine Celtics play at TD Garden",
    "317": "@celtics These are cursed bruh",
    "318": "@celtics Those are awful",
    "319": "@celtics They’re better at basketball than us",
    "320": "First ever jerseys as the CELTICS 🔥☘️ https://t.co/2LDTwRwbP8",
    "321": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub I don't expect it. https://t.co/JwyzFdEVn0",
    "322": "@celtics selfish move.  just saying. Magic and Bird can do 40 points easily but they pick to pass.  no wonder they make over close 10 assists.   i never see Tatum to have least 8 assists.    not happening !",
    "323": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub You better win by 50",
    "324": "@hibritty @celtics Bday twinnnn 🤘🏾",
    "325": "And a bonus request would be the Lakers vs Boston Celtics in the NBA Finals 🥺🥺🥺🕯🕯🕯🕯",
    "326": "Cleveland Cavaliers - Portland Trail Blazers\nOrlando Magic - Boston Celtics\nPhiladelphia 76ers - Chicago Bulls\nIndiana Pacers - New York Knicks\nBrooklyn Nets - Atlanta Hawks\nMinnesota Timberwolves - Los Angeles Clippers\n\nBet slip link: https://t.co/PP8cL0srZJ https://t.co/qfFwWbWztt",
    "327": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub I feel like our season is over",
    "328": "@wwfcjoe_ @celtics @OrlandoMagic @NBCSBoston @985TheSportsHub please do 😫",
    "329": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub You think they’ll try this time or will it be another meh-okay first half, 3rd quarter collapse and flat out quit 4th quarter job?",
    "330": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub Already wanna cry",
    "331": "100% agree on your views on Tatum @Marc_Bertrand \n\nTatum at his age getting the most attention by defenses shows who is the threat on the @celtics  \n\nThe potential upside of a drafted player is the best I've seen since The Truth @paulpierce34",
    "332": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub Celtics lose tonight imma off myself. My life in yall hands now",
    "333": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub Does this classify as a 'trap' game for the Celtics or NAH?",
    "334": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub We know yall tanking,  the jig is up",
    "335": "@hibritty @celtics Happy birthday!!",
    "336": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub Please don’t lose to Magic? My heart is fragile rn",
    "337": "@chicagobulls @celtics please copy this idea asap thanks lol",
    "338": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub They are not good",
    "339": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub Al let’s go",
    "340": "Please win @Celtics",
    "341": "Panel from @SloanSportsConf '21 Fact or Fiction: Basketball Mythbusting featuring @kirkgoldsberry, @sixers GM Elton Brand, @celtics VP of Basketball Ops @mikezarren &amp; @memgrizz assistant @SoniaRaman: https://t.co/bZdboxBoGu",
    "342": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub I hope not to see this tomorrow 😒 https://t.co/HE2GUtO1rd",
    "343": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub i’m actually watching the paint on my wall dry tonight, but thanks!",
    "344": "@foggdiesel @celtics Thank you! Happy birthday to you too! https://t.co/LUo3dCznCM",
    "345": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub I swear if u lose…..",
    "346": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub cant wait to see how they lose this one!",
    "347": "@badbeatbeans @celtics Thank you!",
    "348": "@FatIsTired21 @celtics Thank you 🥰",
    "349": "@AquinoMass @papageezy @celtics If he ever comes back to Twitter, you’re getting it",
    "350": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub Don’t miss it again, please",
    "351": "@cIaxton @celtics @OrlandoMagic @NBCSBoston @985TheSportsHub I’ll smoke your ass",
    "352": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub Please win https://t.co/MlQ6QLYJtL",
    "353": "@wwfcjoe_ @celtics @OrlandoMagic @NBCSBoston @985TheSportsHub wagner smoking ur asses",
    "354": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub IM not mentally prepared for more pain",
    "355": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub expecting y'all to lose",
    "356": "@ThisWayArt @celtics Just speak for yourself. The roster was clearly trash, but the Jays weren’t.",
    "357": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub Own those frauds",
    "358": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub Get a W!",
    "359": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub No.1 pick here we go!",
    "360": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub Can’t wait to lose",
    "361": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub Pls win",
    "362": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub if you mfs lose this…",
    "363": "@celtics fan over 50 years and they’ve NEVER been this unwatchable @smart_MS3 is a lot more trouble than he’s worth and must be dealt ASAP 🏀",
    "364": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub Please Win",
    "365": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub Guarenteed loss. This team is trash",
    "366": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub We will lose",
    "367": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub If y’all those to them ur absolute dog shit.   Tatum gotta learn not to be greedy",
    "368": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub thanks udoka for a lottery season !",
    "369": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub Please get the W today. Also don’t blow to lead this time. Play smart basketball",
    "370": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub 15 point loss incoming",
    "371": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub can’t wait to lose again https://t.co/PfCkUtTsTA",
    "372": "Boston Celtics record a dismal https://t.co/D6EKjde0Nk Horford.”The reality is this is a new https://t.co/9Z1scPEOLS know it’s hard to win in this league.”@wbznewsradio https://t.co/NERW0x79YF",
    "373": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub PLEASE WIN. ☘️💚 https://t.co/uyF3Lwo1XZ",
    "374": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub Gonna lose",
    "375": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub Just fucking win",
    "376": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub Fuck this game ain’t even gonna watch",
    "377": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub Mo wagner masterclass incoming",
    "378": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub I am ready to get hurt",
    "379": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub Gonna be another L",
    "380": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub Let JB cook!!!!",
    "381": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub Who’s ready for another loss",
    "382": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub win pls",
    "383": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub Can we win pls",
    "384": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub Don’t make me become the Joker",
    "385": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub Bulls own you",
    "386": "@celtics @OrlandoMagic @NBCSBoston @985TheSportsHub Please win",
    "387": "@Savageraven88 @stephenasmith @ScottiePippen While dropping 60 on the Boston Celtics dynasty in Boston Garden at like 23 years old",
    "388": "Dallas Mavericks vs Boston Celtics is on Sky Sports Arena UK HD. With commentary from Mark Followill. Co-commentator is Derek Harper.  For more details see https://t.co/Ngx10GWKt6 #DallasMavericks #BostonCeltics #SkySportsArenaUKHD",
    "389": "TONIGHT ☘️ Celtics at @OrlandoMagic \n\n⏰ 7:00PM\n📺 @NBCSBoston️ \n🎙️ @985TheSportsHub \n\n#BleedGreen https://t.co/To40XXijEZ",
    "390": "WATCH: What is going wrong with the Boston Celtics this season? https://t.co/4a6BKL5vvj",
    "391": "Miami Heat vs Boston Celtics is on Sky Sports Arena UK HD. With commentary from Eric Reid. Co-commentator is John Crotty.  For more details see https://t.co/ri9Ocx1z8s #MiamiHeat #BostonCeltics #SkySportsArenaUKHD",
    "392": "My beloved Boston Celtics play tonight: https://t.co/7dYnxQl2BO",
    "393": "The @celtics need to blow out the @OrlandoMagic by at least 30 tonight for me to feel any better about this team.",
    "394": "🏀 #NBA 🏀\n\n🔒 Lock Of The Day 🔒\n\n@Celtics\nvs.\n@OrlandoMagic\n\nPick Now Available - https://t.co/Is9vQJmBST",
    "395": "NBA blocks leaders - [{\"team\":\"Boston Celtics\",\"player_name\":\"Al Horford\",\"blocks\":3.2},{\"team\":\"Milwaukee Bucks\",\"player_name\":\"Brook Lopez\",\"blocks\":3.0}...}]",
    "396": "Analyzing Wednesday’s Boston Celtics at Orlando Magic odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/BOsMOUfpSg",
    "397": "@celtics No amount of skill can compensate for disposition.",
    "398": "Can’t wait for Tonight’s Madness ❕ @cavs @trailblazers @memgrizz @nuggets @nyknicks @Pacers \n@celtics @OrlandoMagic @chicagobulls @sixers @Raptors @WashWizards @ATLHawks @BrooklynNets @LAClippers @Timberwolves @dallasmavs @spurs @warriors @hornets @PelicansNBA @SacramentoKings https://t.co/7d770rrPCW https://t.co/7oscDEKhkI",
    "399": "20:00 – 🏀NBA\nPortland Trail Blazers x Cleveland Cavaliers\nNBA LEAGUE PASS\nNY Knicks x Indiana Pacers\nNBA LEAGUE PASS\nBoston Celtics x Orlando Magic\nNBA LEAGUE PASS\nChicago Bulls x Philadelphia 76ers\nNBA LEAGUE PASS\nToronto Raptors x Washington Wizards\nNBA LEAGUE PASS\n\n(+)",
    "400": "@chicagobulls appreciation Day \nYa know they did whoop on them @celtics the other night.🤦🏾 Don’t Hate Just Double-tap Your Screen 😁\n.\n#explorepage #explore #instagood https://t.co/Mg3OTvUG2P",
    "401": "I've been screaming that for the past 3 years @KevinOConnorNBA. That lack of a true PG facilitator will kill the dream of 18 with the Jays. 😭\n\n@Celtics\n#Celtics",
    "402": "Wonderful analysis @KevinOConnorNBA and @ChrisVernonShow re: @Celtics 🍀 malaise. 👏\n\n#whatcanbrowndoforyou",
    "403": "@hibritty @celtics Happy Birthday beautiful! Go Celts!!! 💚🍀",
    "404": "@DanKelley66 @BCCoachStevens @celtics @memgrizz Sadly That’s not how we play though",
    "405": "How quickly we forget, but didn't this team start like 8-3 last season?!? Remind me how that turned out again? My point is maybe we shouldn't overreact after the first couple games of the season. Let's get a huge W tonight @celtics #NBA75 #Boston @NBA #NBA2K22 #orlando #NBA",
    "406": "@celtics @OrlandoMagic @smart_MS3 The Road to Redemption begins tonight! Did they really think we'd stop riding with you after a little controversy. Guess again ☘☘☘\nYT - Jags2Riches \n@FCHWPO @jaytatum0 @smart_MS3 @rob_williamsIII @Al_Horford @AnnaHorford \n\n#NBA #NBA2K22 #orlando @NBA2K  @NBA @NBCSBoston",
    "407": "The Boston Celtics have to be one of the most poorly managed teams in recent years. Everything literally went downhill after that first season without @isaiahthomas",
    "408": "Indiana Pacers - New York Knicks\nCleveland Cavaliers - Portland Trail Blazers\nOrlando Magic - Boston Celtics\nPhiladelphia 76ers - Chicago Bulls\nWashington Wizards - Toronto Raptors\n\nBet slip link: https://t.co/y0dG0x4ZqQ https://t.co/ludP7O4QH9",
    "409": "@celtics taking on the @OrlandoMagic. #Boston has quite a few lingering questions after last game and of course the now infamous @smart_MS3 postgame presser. I have a feeling a huge bounce back game/road trip are in order. See you at the end of this win streak starting tonight ☘ https://t.co/Gi8P2z5yw8",
    "410": "@hibritty @papageezy @celtics We are birthday siblings basically two days apart and all of that. Basically I want a signed IT jersey",
    "411": "@papageezy @AquinoMass @celtics Thanks my man! 🥳",
    "412": "@jcssthoughts @celtics Thank you! 💚☘️",
    "413": "@AquinoMass @hibritty @celtics Happy birthday",
    "414": "Gameday this Friday at 7:30 against the Boston Celtics! https://t.co/fNmta8lmhk",
    "415": "@alex______0 @BCCoachStevens @celtics @memgrizz In college he was in constant motion and was catch &amp; shoot with a quick release. Was hoping they’d use him in similar fashion in Boston.",
    "416": "@DanKelley66 @BCCoachStevens @celtics @memgrizz He’s not gonna find rythym standing around in the corner either",
    "417": "@stellarct @celtics You forgot: Take an L\n\nAstonishing how people don't understand that basketball is a team game!",
    "418": "@celtics play the @OrlandoMagic tonight and I don’t want to hear jack if the @celtics beat a team with the same record as them. False confidence is killing us!!!",
    "419": "@mertdalgic82 @celtics Trade Brown",
    "420": "@_cryzus @celtics Just say you missed the entire last season!",
    "421": "As seen on @r_BostonCeltics https://t.co/FhpIQJxKvI",
    "422": "@hibritty @celtics happy birthday!!! ☘️🥳☘️🥳☘️",
    "423": "🙏🏾👇🏾\n\n\"You were such a big part of the night’s mile high energy! Thx for all ur work in &amp; for the #community #abcdhoopdreams\" ~ @BostonABCD \n\n#ForTheKIDS #NITM @B87FM @celtics @DocRivers #ABCDHoopDreams #BOSpoli #MApoli @BostonABCD https://t.co/elqsQSJmTB",
    "424": "@PensiveKevin @celtics That, but I think he's really trying to see what he has with his vets and recognizing there is a HUGE problem!",
    "425": "Join us on the 6th floor while #OrlandoMagic take on #BostonCeltics starting at 7pm. No ticket necessary after the final whistle, see you tonight.\n\n#ItsBetterOnTheRoof\n#SkyLoungeAmway https://t.co/0mhb2GE7KL",
    "426": "10 worst defenses in the NBA right now: Boston Celtics should focus more on defense than on passing the ball\n\n https://t.co/Hr0pRwcLsM",
    "427": "@Logan96979691 @celtics Think about why Fournier, Hayward and Kyrie left 🤔",
    "428": "@queestringer @Edwardd46761565 @celtics Especially BOTH! Don't separate them now!",
    "429": "#NBA75 tonight:\n\nNY Knicks +1 @ 1.91 (Pinnacle)\nDenver Nuggets ML @ 1.98 (Pinnacle)\nPortland -4.5 @ 1.96 (Pinnacle)\nBoston Celtics -6.5 @ 1.96 (Pinnacle)\n\nGood luck !",
    "430": "@DigThumma @celtics Not facing the problem",
    "431": "@wutrain P.S. Congratulations Mayor-elect Michelle Wu! All aboard the @wutrain #Boston! And go @celtics! https://t.co/XXjA7Txdry",
    "432": "@DNTBFKNIGNRNT @celtics True, but the Js are the ones killing this team!",
    "433": "For a guy who likes sports betting so much I’d think @b_elk33 would be more excited about the @celtics in the lottery!",
    "434": "@james54111044 @celtics That's not why they're not passing, but you keep believing that!",
    "435": "@jgroves16 @celtics They haven't been a \"team\" in 3 seasons. There are 2 players that care more about being the scoring leaders than actually winning games! I didn't like Kemba, but couldn't blame him or Smart for the shots they took, when they knew if they passed,  they'd never get the ball back.",
    "436": "Boston Celtics vs. Orlando Magic- 11/3/21 Free Pick &amp; NBA Betting Prediction https://t.co/HKmJyMsgWI #FreePicks ... https://t.co/arkM5Yic6m",
    "437": "@BballCeltics33 @celtics 20 point blowout or bust.",
    "438": "@KrazyDazzle @celtics @B87FM @DocRivers \"Hilarious 😂\" \n    ~ @KrazyDazzle\n\nFACTS! 😅😂🤣😆\n\n\"I'm talking to the BIG MAN #BRADSTEVENS at court side of  HOOP DREAMS! #ForTheKIDS @celtics @B87FM @DocRivers #ABCDHoopDreams #BOSpoli #MApoli @BostonABCD\" \n\nhttps://t.co/QWfedGCAoK",
    "439": "@HoopsEmpire_ They are 2-5 and playing like GARBAGE!! They play for the BOSTON CELTICS!! We count CHAMPIONSHIPS!!! Not how many wins over ur career!! Stop whining about the refs play DEFENSE! REBOUND !! PASS!! Make teammates BETTER!  Be BETTER!! Start tonight!!",
    "440": "Perks has a good point with this one. For the struggling Celtics, You gotta finish your food. ☘\n#bostonceltics #celtics #celticsdiary https://t.co/JukYy0U03h",
    "441": "@frank_viola_jr @celtics You still don't see the problem.",
    "442": "@alex______0 @BCCoachStevens @celtics @memgrizz Pretty tough to find a rhythm from the end of the bench",
    "443": "@LuiHard @celtics Thanks!!",
    "444": "@kenzirob32 @celtics Thank you my friend 🥳",
    "445": "@petejones81 @celtics Thanks!! We all deserve this one, we need it!! https://t.co/2DlXSvpI8r",
    "446": "GREAT DAY FOR A @celtics WIN 🗣🗣🗣🗣🗣 A WIN",
    "447": "@hibritty @celtics Happy birthday! And Celtics, dear God, for all of us, I can't take 4 straight!",
    "448": "@DanKelley66 @BCCoachStevens @celtics @memgrizz 0/9 from 3",
    "449": "@hibritty @celtics Happy Birthday 🍀🍾🎂",
    "450": "'Boston Celtics' Leaked Skins Driver dies as bus",
    "451": "@lead2324 @RajonRondo @ACFresh21 @celtics @Lakers Noice!\nTS: LonelyFatGuy\n👍🏻",
    "452": "I have two tickets for next Wednesday @celtics game against the Raptors. 140 for the pair! Loge 18 row 16. Message me if you’re interested.",
    "453": "@alex______0 @BCCoachStevens @celtics @memgrizz They've got Aaron Nesmith sitting on the bench.",
    "454": "@aoburgess @celtics Thanks!!",
    "455": "@Becoming_Bryna @celtics Thank you Bryna!! 💚",
    "456": "@DanKelley66 @BCCoachStevens @celtics @memgrizz Na, we need shooting",
    "457": "I stand by my belief that Tyus Jones would be a perfect fit for the Boston Celtics. \n\ncc: @BCCoachStevens @Celtics @memgrizz https://t.co/2P6cdigsXV",
    "458": "@bballbreakdown @BasketB0t @celtics Okay understood. But His point was he’s not being put in the right positions to hit that ceiling and neither are the Jays. It was a coaching criticism as much as anything. Through 7 games, Udoka’s coaching has left a ton to be desired both in scheme and lineup choices.",
    "459": "@hibritty @celtics Happy Birthday 🎂",
    "460": "@hibritty @celtics Happy Birthday!!!!",
    "461": "@BasketB0t @bballbreakdown @celtics I disagree. While I think JT &amp; JB haven't done anything wrong, I do kinda with Smart that the less you use the closers and get buckets from your role guys the less pressure it'll put on those closers when they've gotta close the game.\nSmart's still an idiot, but he is right.",
    "462": "@sportssapphic @celtics Thank you girl! 💚",
    "463": "I’m there tonight @celtics y’all got no choice but to go crazy 😎",
    "464": "@breathehoops @BasketB0t @celtics I explained what I was looking for: shots that Brown and Tatum took when he was stuck on the weakside or just watching on the perimeter. While he might be solid in the right positions, he can be an equal liability that puts a ceiling on their potential",
    "465": "@985TheSportsHub @celtics Who is coaching for the Celtics tonight, Marcus Smart?? 🙄",
    "466": "@BasketB0t @bballbreakdown @celtics Marcus Smart has finished 1st or second on the team in assist percentage in 4 of the last 5 seasons. He is a solid table setter if he’s put in the right positions. Also weird you used mostly clips from the first 3 quarters when they built a huge lead and not rest of season.",
    "467": "There is nothing wrong with the Boston Celtics and people need to stop saying Jaylen Brown needs to be traded.",
    "468": "How will the Boston Celtics lose today?? https://t.co/9SRx5sSRPY",
    "469": "@washedwiz @celtics Ok, and what else?\nThats a trade ill do for 2022's draft picks &amp; a #2 in 2023, maybe Rui. That's my start and finish line on that. You have to remember Brad &amp; Jason gon hog the 🏀 take up all the shots( see #MarcusSmart)  until coach Wes can coach em up.\nNow you want what?🤔",
    "470": "@TheBostonBrit @celtics Thank you! ☘️",
    "471": "@AquinoMass @celtics Hahah excellent! 🎂🍰",
    "472": "@PlayoffHuskies @celtics Thank you!!",
    "473": "@frostybias @celtics Thanks!",
    "474": "@LuckyShirls13 @celtics Thank you girl!!",
    "475": "@ZeffaTV @celtics Of course! They have some serious potential with Scottie and OG. Looking real fun up there 😜",
    "476": "The Boston Celtics pick up Grant Williams fourth-year team option.\n\nhttps://t.co/85QopqTAf0",
    "477": "@hibritty @celtics Happy Birthday ☘️🙌🏻",
    "478": "🏀 @OrlandoMagic vs @Celtics Preview 🏀\n\n🔹Magic look to build on winning blueprint\n🔹@The_ColeAnthony &amp; @franzboogie in rare company\n🔹Wagner talks poster dunk\n🔹Latest injury updates\n🔹Rivals report with Celtics legend @Marc_DAmico \n\nAll that and more:\nhttps://t.co/DLJ8UiCHIL",
    "479": "@BasketB0t @bballbreakdown @celtics Ok fine but if this isn’t on Tatum then his superstar card needs to be under review because he simply isn’t performing.\n\nTrending to have career lows in FG%, 3pt%, FT%, STL, EFG% while playing a career high in minutes and turning the ball over at a high clip",
    "480": "@hibritty @celtics Will buy us both a cake!",
    "481": "@OrlandoMagic @celtics @AmwayCenter @BallySportsFL @969thegame @wendellcarter34 Plan to celebrate my birthday tonight with a Magic win, a triple double from Cole and Franz plus a buzzer beater from Cole. Thanks to our team for bringing back exciting basketball. Love our team.",
    "482": "Boston Celtics are a bunch of bitchasses...\n\nOverrated nônôns.",
    "483": "@OrlandoMagic @celtics @AmwayCenter @BallySportsFL @969thegame @wendellcarter34 Let's go Magic",
    "484": "@hibritty @celtics happy bday!",
    "485": "@hibritty @celtics happy birthday!",
    "486": "@hibritty @celtics Happy Birthday 🥳",
    "487": "@hibritty @celtics Happy BIRTHDAY 🎉",
    "488": "@hibritty @celtics Not my birthday but send the luck to the raptors as well please thanks :)",
    "489": "\"Today I stood with a King\"\n\nhttps://t.co/etcIWguu3q\n\n[via r/bostonceltics Nov 03, 2019 #Celtics]",
    "490": "@washedwiz @celtics This is brilliant.",
    "491": "@ahandvanish @FCHWPO Speak to Dr @brucep13 and @YoDoctorYo about #LongCovid treatments. @celtics @NBA",
    "492": "@OrlandoMagic @celtics @AmwayCenter @BallySportsFL @969thegame @wendellcarter34 Markelle Fultz ☹️😢 https://t.co/Dj5DHgP6CO",
    "493": "GAME DAY 🗣\n\n🆚: @celtics \n📍: @AmwayCenter \n🕖: 7:00 p.m.\n📺: @BallySportsFL \n📻: @969thegame https://t.co/qgXSaPweoU",
    "494": "Who is the biggest surprise scorer so far this season? For me it’s gotta be @FCHWPO straight killing it! #NBA #NBA75 #NBAFantasy #NBABaller #Boston #Celtics https://t.co/EcnqOrCB3q",
    "495": "Boston Celtics vs Orlando Magic 2021-22 NBA Season Preview, Predictions and Picks | SportsNus https://t.co/NeFM84wMbu",
    "496": "@BasketB0t @bballbreakdown @celtics Couldn't agree more with this take 👏 @bballbreakdown is the 🐐 and his word is the gospel",
    "497": "Consensus Line Move:\n2021-11-03 Boston Celtics at Orlando Magic from 215.50 to 213.50\nUnder snake in the weeds\n#NBA #bet #analytics #investing",
    "498": "I’m going to the game tonight. I better see some fucking effort @celtics",
    "499": "@im_aumyrrh @celtics Thank you!!",
    "500": "@AquinoMass @celtics Omg happy belated! You can share tonight’s win 🤞🏼🤞🏼🤞🏼",
    "501": "@MVP316theOne @celtics Thank you!!",
    "502": "@hibritty @celtics happy birthday!!",
    "503": "@hibritty @celtics The bulls game was my birthday what a blood bath",
    "504": "@hibritty @celtics Happy Birthday 🎊🎉",
    "505": "@BCCoachStevens @celtics can we start  Schroeder and have Marcus Smith come off the bench and put in Juan and Bruno to see what they can do instead of having them on the bench not getting any play time let's see what they got we definitely wouldnt mind harrell or bagley or both",
    "506": "@985TheSportsHub @celtics They’ll prob roll a pitiful ORL team away from the Garden and once again everyone will say not to worry this core just needs to mature a little 🙄",
    "507": "@Cherylafullert1 @celtics I hope we all are 😂 thanks! https://t.co/sdjgYN1Sn4",
    "508": "@WayneBreezie Boston Celtics vs Orlando Magic tonight sir",
    "509": "NBA has a new Super Star .\nEnes Kanter a real civil rights hero. @joeroganhq @NBAonTNT @HonestDamon @celtics @espn @FoxNewsSunday\n@celtics @BostonGlobe @StephenAtHome @GlennYoungkin @TNTPR @NBAonTNT @EnesKanter @nikebasketball",
    "510": "On today's episode, we talk about the Boston Celtics and their issues. Is a breakup necessary? Can they turn this around? Is there a piece waiting to be added? \n\nhttps://t.co/zOH3EzAiS2\n\nYouTube: https://t.co/Q1nlCmqCBV\n\n#NBA #NBATwitter #BostonCeltics \n@celtics",
    "511": "@hibritty @celtics You're Welcome",
    "512": "@hibritty @celtics Happy birthday! Hope you will be blessed tonight!☘️💚☘️💚",
    "513": "The Boston Celtics play basketball today ☘️",
    "514": "Even amongst “fans” constant complaining, I still get just as amped for game 8, game 28, game 58 as I do any other game. I love my Celtics and nothing will change that. @celtics ❤️",
    "515": "@__Michael_Prior @celtics Thanks!!",
    "516": "@ShawtyReed @celtics Thanks!",
    "517": "@JTsGoated @celtics Thanks!",
    "518": "@LizVicBo @celtics Thank you!! 💚",
    "519": "@_Zigmeister @celtics Thank you!",
    "520": "@celtics Nice",
    "521": "@celtics Nice",
    "522": "Boston Celtics @ Orlando Magic\nPick : Orlando Magic.\nBasketball. NBA",
    "523": "@NotoriousVOG @celtics @B87FM @DocRivers Hilarious 😂",
    "524": "Boston Celtics vs Orlando Magic 11/3/2021 Picks Predictions Previews\n\nhttps://t.co/s487g4STwy\n\n#NBA #NBApicks #NBAprediction #NBAparlay #NBAbetting #basketballpicks #sportspicks #odds #picks #handicapper #sportsbetting #expertpicks #freepick #freepicks #Celtics #Magic https://t.co/p7OFHUvUU4",
    "525": "@celtics Your support means the world to us. Thank you! 💚",
    "526": "Game day @celtics and @Timberwolves. Please don’t let me down I need a pick me up today.",
    "527": "@Stephen0610 @OrlandoMagic @celtics Which team is which? https://t.co/hfMBd3p8F2",
    "528": "@hibritty @celtics Happy Birthday!☘",
    "529": "@hibritty @celtics Happy birthday 🎉",
    "530": "@hibritty @celtics Happy birthday!!!",
    "531": "@hibritty @celtics Happy birthday! 🎉",
    "532": "Good morning @celtics it’s my birthday, please don’t break my heart tonight ☘️💚",
    "533": "Indiana Pacers - New York Knicks\nCleveland Cavaliers - Portland Trail Blazers\nWashington Wizards - Toronto Raptors\nOrlando Magic - Boston Celtics\nPhiladelphia 76ers - Chicago Bulls\n\nBet slip link: https://t.co/hFk8qZzJvC https://t.co/JJFRsQHeiN",
    "534": "Shop #Celtics Frames, Puzzles, Prints, Phones Cases, Towels and more @ &gt;&gt; https://t.co/Ub5fB3Sihw &lt;&lt; #NBA #NBA2K22 #NBATwitter #BleedGreen #WayOfLife #Boston #BostonCeltics",
    "535": "@SeatGeek I bought two tickets to the Orlando Magic/Boston Celtics game the other day and I have yet to receive the tickets. The game is tonight..",
    "536": "NBA Day 1️⃣6️⃣ 🏀🏀🏀\nPortland Trail Blazers vs Cleveland Cavaliers\nNew York Knicks vs Indiana Pacers\nBoston Celtics vs Orlando Magic\nChicago Bulls vs Philadelphia 76ers\nToronto Raptors vs Washington Wizards\nAtlanta Hawks vs Brooklyn Nets\nLos Angeles Clippers vs Minnesota Twolves",
    "537": "🇨🇳 | @EnesKanter, the center of the Boston @Celtics, once again has used his Twitter account and his status as a professional sportsman to criticize the Chinese #Communist Party. \n\nRead more about his past statements: https://t.co/cyFQ1iCj5d by @DanielEChangC https://t.co/01H6zIiEAc",
    "538": "Eat up @Celtics 🍜 https://t.co/2LzGnUQjsR",
    "539": "If you support SC Villa, Boston Celtics and Manchester United like I do, I send you love and light because I know you’re truly going through the most. Be brave, be strong and be positive because things will get better. Maybe. Perhaps. I also don’t know. 😭😭😭 #iNeedAHug",
    "540": "@celtics @Al_Horford this team need a true point guard.just get stephen curry.",
    "541": "TONIGHT the @OrlandoMagic face off against the @celtics at @AmwayCenter! Game time 7 PM.\n\nLet's Go Magic!\n#Orlando #Sports #OrlandoMagic \nhttps://t.co/jftIRByrjJ",
    "542": "The @celtics are a dysfunctional clown show rn 😂😂 you hate to see it (not me ) so much for the @BrooklynNets giving you that dynasty 😂😂 https://t.co/MMX7jHZz9O",
    "543": "Hey @KenGriffeyRules @Toucherandrich @celticsvoice I know a PG who is available and could help the @celtics right now: @isaiahthomas",
    "544": "@NotoriousAlexx_ @Yuggietv No Boston Celtics all day 😡",
    "545": "Boston Celtics play tonight \nRIP my mental health",
    "546": "@andrewteman @DavidKHill @celtics I just got tickets to see them play the Sixers when we are home for the holidays. They better have it figured out by then.",
    "547": "@985TheSportsHub @celtics At some point something is gonna click with these guys............right??",
    "548": "Who is the best fit to become the Boston Celtics head coach? | The Jump https://t.co/aU5IrOmjnr",
    "549": "GAME DAY 🚨🚨\n\nBoston Celtics ☘️ x @br_orlandomagic\n\n📌 Amway Center\n⏰: 20:00\n📺: League Pass\n\n☘️💚\n#BleedGreen  #MagicTogether",
    "550": "@985TheSportsHub @celtics So they'll either go to OT and lose or blow a huge lead and lose.",
    "551": "🎙☘️ ⁦@TheRaftersPod⁩ ☘️🎙 \n\n🎧 Ep. 77: What's wrong with the Celtics? \n\n…..Seriously, what’s wrong with the Boston Celtics?!\n\n🏀 Presented by ⁦@CouchGuySports⁩ \n\n⚡️ Sponsored by ⁦@ShockedEnergy⁩ ⚡️ https://t.co/JriFMdI5MI",
    "552": "The Boston Celtics should trade KD and build around Melo #BleedGreen https://t.co/9VwA5u8gwt",
    "553": "TONIGHT: @Celtics vs #Magic live from #Orlando https://t.co/2JjqxbWczS",
    "554": "Coming up at 11 am ET today @DHenryTV &amp; @jshector discuss the drama surrounding the Boston Celtics following Marcus Smart's comments &amp; why shooting %'s are down this season. \n#NBA #BleedGreen #NBATwitter #TheNBAExchange\n\nhttps://t.co/OIG56DppPk",
    "555": "I'm more triggered by dumbass fans making dumbass comments about the Celtics than the Celtics playing like crap. Please start winning again, @celtics.",
    "556": "The Boston Celtics play basketball tonight. Another opportunity to right the ship 🙏 ☘️ https://t.co/kW1tMJNkNF",
    "557": "After an thrilling win in Minnesota on Monday night, the Magic return home to host the Boston Celtics. \n\n#MagicTogether #OrlandoMagic #NBA https://t.co/8QDqL3YReG",
    "558": "Please check out the new Catch &amp; Shoot 2.0 from @purehoopsmedia.  @OttoStrong2 @Aaron_Berlin &amp; yours truly analyze the @celtics issues, question if @Zionwilliamson is giving @PelicansNBA fans Greg Oden flashbacks, &amp; discuss gambling concerns for the @nba\n\nhttps://t.co/UJTT10K6wv https://t.co/UBVzxkgiUp",
    "559": "@Angelo4justice3 @EnesKanter been offered passport, as is every immigrant that badmouths #China or #Turkey at racist congress direction. He stops RMB cash from businesses (except from @elonmusk) &amp; @nba players &amp; suppresses Blacks, for “Daila Lama” who ever he is. We’ve been played @celtics @CCTV",
    "560": "Boston Celtics \n\n@TheDebs4real https://t.co/wHmTa6iAWB",
    "561": "@celtics should think about John Wall… tells you where things stand",
    "562": "The Truth About the Boston Celtics' Early-Season Turmoil https://t.co/zE7gn04zUS",
    "563": "@chicagobulls I love how the guy next to him loses his shit even though he’s wearing a @celtics hat. Sometimes sports transcend reality.",
    "564": "Prior to Game 7 of the 1969 Finals, the Celtics noticed balloons sitting atop LA Forum. Lakers planned to hold a party after their INEVITABLE victory over Boston.\n\nCeltics won 108-106. The balloons never fell.\n\nKing Phil may retain his NJ throne, but it’s fun watching him sweat!",
    "565": "@HRF @celtics @EnesKanter Salute to Mr Kanter🙇🙇🙇 He is truly a hero who dares to speak the truth n offend #China!\n#BoycottChina\n#BoycottBeijing2022\n#BoycottBeijingOlympics",
    "566": "@MiamiHEAT WIN 125-110 vs the @dallasmavs 😂 in #DallasTexas tonight to stay hot and get to 6-1 on the season! Onto the @BostonCeltics coming to town Thursday night in #Miami at the @FTXArena at 7:30pm on @BallyHEAT! LETS GO #HEAT! #HEATCULTURE https://t.co/v8PpsxdEGW",
    "567": "@celtics It's the same as last season and the one before except it seems to be getting worse, inconsistency, \nThat comes down to the coach at the end of the Day, \nSure the players have responsibility in that too, \nI've said my point",
    "568": "@celtics Enough is enough here come on",
    "569": "Boston Celtics at Orlando Magic: Stream, lineups, injury reports and broadcast info (11/3) https://t.co/JoLa1bP83Z",
    "570": "@CelticsSentinel No One Is Larry Bird. @celtics @NicolaBogani",
    "571": "@y1025fm @TheRealNaaDzama @DjCarcious #MMRS\n\nit was beautiful until Boston Celtics🍀🏀 and Hearts of Oak decided to ruin it 😭😭",
    "572": "@celtics nice shot!",
    "573": "@celtics Man, the one announcer from the Celtics sucks. Literally calling Ayo Dosunmu - Derrick Jones for a good three quarters. Unprofessional at best, do better",
    "574": "@lead2324 @RajonRondo @ACFresh21 @celtics @Lakers So many giveaways! Hoping to win my first TS 🔮",
    "575": "On this day: Boston Celtics Tony Allen, Eric Williams, Al Jefferson debut https://t.co/ctX0p4Le0J",
    "576": "@celtics pain!",
    "577": "@BubbaJoMo @celtics Yeah wait till the season start. I think he is to be honest",
    "578": "@celtics shit aint working for you guys, JJJ and Dillon brooks for Jaylen Brown, come on, fuck it inih, ygm fuck it",
    "579": "@2damntrans Or: Post-apocalypse movie with New Vegas' Caesar's Legion vs a group calling itself the Boston Celtics, literally a bunch of sports-themed guys or something? :3",
    "580": "As an Aussie fan it’s been hard to find a @jaytatum0 jersey, had to cop the fit! @celtics #Celtics #NBA75 https://t.co/cWfgcHCVD6",
    "581": "#youtube DeMar DeRozan SAYS Chicago Bulls WIN over Boston Celtics is proof of the CHIP on their shoulders https://t.co/imlL6KXwb0",
    "582": "Fun show for @littlebirdietv today. Talked some Trae Young for MVP with @MichaelVPina + the Atlanta Hawks and some Boston Celtics. \n\nThe Last Shot NBA Show live stream Mon/Wed/Fri at 9am\n\nhttps://t.co/dfLnWCowPC",
    "583": "New post (Boston Celtics vs Orlando Magic NBA Pick – November 3) has been published on The Sports Geek - https://t.co/0T0UzGPKJZ https://t.co/lx0b5tUxHV",
    "584": "Tough times to be a Manu and Boston Celtics fun. Crazy coaches just",
    "585": "I should have known right from the start you go and break my heart @celtics https://t.co/4l8yppSOaM",
    "586": "@SmithJF35 @Randomp00711062 @TatumsWRLD @celtics He was the scapegoat jus like every other pg y’all turned on, funny how it’s nothing but crickets about how bad Tatum and JB played against the bucks but kyrie was the one that quit right 🤔",
    "587": "Boston Celtics ❤\nTag your friends 👦👩\nIf you like it pls support with ❤\n\nFollow 👉 @Boston_Cts 😍\n\n#Bostonceltics https://t.co/ZesoJdOGWa",
    "588": "@piusmwilson @BrianWathum @celtics Bro, don't get it twisted. What y'all are doing ain't drama but some else. We will rise again. #BleedGreen",
    "589": "\"POST GAME: Chicago Bulls (3-1) fall to Boston Celtics (3-1), (100-106)\"\n\nhttps://t.co/90fCOz4pk1\n\n[via r/chicagobulls Nov 03, 2016 #Bulls]",
    "590": "@laxthefacts @celtics Nice take right there OG💯 “hate your opponents” I like that",
    "591": "@celtics Recipe for success in obtaining a lottery pick maybe. \n\nRecipe for winning? Nope. \n\nThis team STINKS.",
    "592": "I don’t have to watch the @celtics @BillSimmons to know what’s happening .They going to dribble down the court pass to jayson tatum 18 ft from basket backdown dribble dribble dribble…shoot &amp; next fast break Tatum get ball stops ball (not defense) look dribble backdown shot 😂🤷🏾‍♂️",
    "593": "@BrianWathum @celtics Am choosing to stay sane for the rest of this year. Will be back on Christmas 😬",
    "594": "Nov 2, 1946 - Rhode Island native Dino Martin (#4), a 5-8 guard from Georgetown, led all scorers with 18 points as the Providence #Steamrollers beat the Boston #Celtics 59-53 in Rhode Island Auditorium (capacity 5,300) - the first game for both teams in the new BAA. #NBA75 https://t.co/0MLV9jSiau",
    "595": "@gang_andrew07 @celtics Not for the faint hearted....",
    "596": "You don't want @33643pts tweeting about local politics the way he tweets about injured Boston Celtics players https://t.co/zLEAHFaqM6",
    "597": "Am going on a break from this @celtics drama🤷🏿‍♂️.See you all in the playoffs.",
    "598": "@davidaxelrod @chicagobulls @celtics Go Youngkin!!",
    "599": "Go Boston Celtics! @CrptoTompouce https://t.co/fBCRRKhiJT",
    "600": "@celtics Now all we need is a team and coach",
    "601": "Hey it’s only 10% of the r season, but who would have predicted that @Raptors would be ahead of @Bucks, @celtics, @ATLHawks, and @BrooklynNets in the East? @NBA",
    "602": "Jalen Brunson as the @celtics starting pg could be something solid. 🤔💭",
    "603": "@celtics lower the stat.its hard to win.",
    "604": "the lakers have already figured out how to play basketball yall gotta do so too pronto @celtics",
    "605": "This just in: the @MiamiHEAT +/- keeps getting more ridonkulous. Meanwhile the @celtics look like a $142,424,201 dumpster-fire. Boo.",
    "606": "@NBAonTNT \n\nSince Chuck predicted the Braves would win, can he PLEASE predict that the Boston Celtics will get better?🙏🏾🙏🏾\n\n….send the help",
    "607": "If the @celtics lose to the garbage ass Orlando Magic tomorrow night… I quit. My happiness matters",
    "608": "This is one of the best visual representations I've seen so far of what the Bulls pulled off in Boston. Celtics scored 12 points from roughly the end of Q3 to the final whistle while the Bulls scored 43. That's violent. https://t.co/hDuznfWzNO",
    "609": "Boston Celtics center Enes Kanter made headlines when he uploaded videos to social media calling Chinese president Xi Jinping a \"brutal dictator.\" https://t.co/2nftbmGtuH",
    "610": "@allday__ajking @celtics @Jaguars @FSUHoops @FSUFootball Travis Hunter will bring us back https://t.co/gMUXagx3K1",
    "611": "@bubblybrielle @celtics @Jaguars @FSUHoops @FSUFootball 🤣🤣🤣🤣 that’s right lmao. Spoiled cfb fan tbh 💀",
    "612": "@allday__ajking @celtics @Jaguars @FSUHoops @FSUFootball LMAO LOOK. Technically they won it in 2014.",
    "613": "@bubblybrielle @celtics @Jaguars @FSUHoops @FSUFootball 2013 wasn’t too long ago 😂",
    "614": "Can I pull a @MattMcCarthy985 and kick the @celtics out of the city yet? They're nothing but a waste of everyone's time.",
    "615": "I wonder what it feels like for your favorite team to win it all? It's been awhile since I've experienced happiness. \n\nWhenever you're ready... take your time. \n\n@celtics \n@Jaguars  \n@FSUHoops \n@FSUFootball https://t.co/oG5z6HLulJ",
    "616": "@lead2324 @RajonRondo @ACFresh21 @celtics @Lakers TS: Dark_Rose",
    "617": "what if Boston rappers could challenge Cousin Stizz in 1v1 to become the \"Boston Celtics Rapper\"",
    "618": "What an ironic day today? @NBA - @celtics star @EnesKanter campaign about Chinese Genocide against Uyghurs and Boston new mayor is Chinese-American @wutrain gives a victory speech in Chinese… @ademyarslan @EmreUslu @AlperEnderFirat @Kuzzat_Altay @cevheriguven",
    "619": "@BostonCeltics_7 @MyFantasyLeague i’m leaning towards indy on the rare chance dak doesnt play",
    "620": "@celtics Your team is imploding and you ain't pinning this one on Kyrie sadly.",
    "621": "@celtics sign @isaiahthomas SHIT.",
    "622": "Authentic John Havlicek HOF Boston Celtics Signed Photo Framed https://t.co/n6gOMMMJYO eBay https://t.co/FP3rHSFUTa",
    "623": "@bballbreakdown @celtics in CA? id say a lot do but ,most when they play ball outside dont. i hope you announce it the next time. I'm first in line haha. 😷Thanks coach",
    "624": "Shop with me! #BostonCeltics #Celtics https://t.co/1AcAcCX4dB",
    "625": "@NotoriousVOG @JKoolLIVE @celtics @DocRivers @wutrain @juliaforboston @ruthzee4boston Damn. What kind of Sativa are you on? 😆",
    "626": "@BasketB0t @celtics Damn, I gotta get back out there.. no one has a mask down there, tho…. 😬",
    "627": "@VanAllenLab @Lakers @celtics @warriors In their defense the small label does say Los Angeles Lakers on it. 👀",
    "628": "@MiamiHEAT WIN 125-110 vs the @dallasmavs 😂 in #DallasTexas tonight to stay hot and get to 6-1 on the season! Onto the @BostonCeltics coming to town Thursday night in #Miami at the @FTXArena at 7:30pm on @BallyHEAT! LETS GO #HEAT! #HEATCULTURE https://t.co/rAxxIx9CxK",
    "629": "@frank_viola_jr @KAMMY__99 @celtics Rondo would’ve been a great option. I’ve been saying that for the last 2 years. He was playing for the vet. Minimum not long ago",
    "630": "@bballbreakdown @celtics thanks for the amazing content its been nice to see it summarized, and articulated better than most internet trolls. LOL when are you gonna be in Venice again.",
    "631": "Had to watch that mavs game we play Heat Thursday then come to Dallas Saturday! Let’s go @celtics",
    "632": "@BasketB0t @celtics Thx for sharing!!",
    "633": "@bow_papa @celtics That’s a lot of points bro. Just spoiled a lot of people ticket again bro. They suck bro.",
    "634": "@RogueSharks @PhantasiaSports Boston Celtics\n@Yash60334756",
    "635": "@BostonCeltics_7 @MyFantasyLeague im also wondering which of these teams to pick this week… this poll didn’t help",
    "636": "The Heat return home to host the Boston Celtics. Game starts Thursday at 7:30pm on NBA TV and Bally Sports Sun.",
    "637": "If I was Udoka Inwould let tatum and brown choose a team in line uo against smarts lineup. Let them battle it out and winner starts. 😂@celtics let the furstration bring out the dogs in them please.",
    "638": "@celtics @MAStateLottery Congratulations 🎊🎈&amp; Thank you for your Blessing ❤️ continue success 💜",
    "639": "WOW this video from @bballbreakdown IS the absolute best i've seen all day on the @celtics Situation with Smart and how it really isnt on Jayson and Jaylen. But more so on Smarts limited play. and reputation! WOW https://t.co/dnF4KCnEtn",
    "640": "@SamGibsonJr @celtics Man watching this team play is so sad…. Yesterday I almost broke my tv…. Team was up 20 something going into 4 Quarter… got blown out 43-11 in 4th quarter… how the hell you allow a team score 43 points in 4 Quarter….",
    "641": "Circle 2:\n@NHLBlackhawks \n@TomPelissero \n@mIbtraderumorz \n@HanaHoops \n@Bronx_ILs \n@WestSportsPT \n@darealijlaw\n@CurryInChicago \n@_Montzz_ \n@dort_lil \n@davy_mp4\n@MLBONFOX \n@CantGuardPitts \n@RustyBUCKETS321 \n@kfishbain \n@ShamsCharania \n@celtics \n@Three_Cone \n@EliteLavine \n@svmmy7",
    "642": "Btw y’all should be ashamed @celtics",
    "643": "The Boston Celtics possess a league-record 17 championships, and with that record have more iterations of the NBA’s most coveted hardware, the NBA Championship ring to go with each one. It is…  https://t.co/av6W2h3dG2",
    "644": "@Plugjoey @celtics Is he the real deal? We need some veterans.. It takes too long for these rookies to develop.",
    "645": "@MikeTFish @celtics Three quarters don’t matter if you can’t finish the job 🥱",
    "646": "@BubbaJoMo @celtics Unless we get Pablo from duke but that won’t happen and he is short than Tatum but taller than brown",
    "647": "I have no idea on the Boston Celtics. The pieces they have are fine, they just don’t play team basketball and it starts with the Js. Grow up fast or it will be over soon.",
    "648": "On Friday's when my dad was out..my mom made fried bologna ., that she'd put 4 small slits in and then add cream corn in the middle. Then we listened to the Boston Celtics on the radio and would eat in the living room(she called it \"the parlour\". Super special night for us.😁😂😂 https://t.co/E8VqBELQA6",
    "649": "Might be a Boston Celtics fan",
    "650": "Boston Celtics injury report update \nHEART- OUT INDEFINITELY https://t.co/0HmUCMbdib",
    "651": "@bow_papa @celtics Lol Celtics damn dull bro",
    "652": "This Peak Kelly Olynyk wouldve been a great player for the @celtics. He’s been the go to guy in Houston last season and this season while Cade was sidelined and still adjusting as a rook",
    "653": "Boston Celtics Fanatics Arch T-Shirt Black\n\nhttps://t.co/uEiUGoUTAV\n\n#sponsored #celtics #nba #basketball #bostonceltics #boston #jaysontatum #nbaplayoffs #celticsnation #k #sports #jaylenbrown #kembawalker #bleedgreen #nbafinals #marcussmart #ballislife #nbabasketball https://t.co/WstMbJHc1w",
    "654": "The more I think about it The Boston Celtics really do have both a Kobe &amp; T-Mac on they team, and in my take that’s not a good thing.",
    "655": "@SamGibsonJr Just like my team @celtics",
    "656": "#HotTake I’m calling it. Lamelo Ball @MELOD1P will lead the young and rebuilding @hornets (minus Gordon) to a deep playoff run, well before @jaytatum0 leads the @celtics to the NBA Finals. #IsaidWhatisaid @985TheSportsHub What do you think?",
    "657": "@celtics you see this https://t.co/Bqhq87P1eQ",
    "658": "@Charlie_MaSheen Watching the @celtics gives me diarrhea dawg",
    "659": "Jaylen brown for Ben Simmons @celtics",
    "660": "\"LeBron is 36 and looks like he's 25 right now\" @MichaelVPina \n\nLA expected to cruise past Houston as 10 point favs @TopSport_com_au today at 1:40pm. \n\nCatch up on - Trae Young &amp; Boston Celtics News 👇\nhttps://t.co/i8CtDyVjab https://t.co/tv5TMwgyAg",
    "661": "@HowardKellman @NCAA @GoBearcatsMBB @NBA @celtics @Pacers @sigg20 @AndyFurmanFSR @eddiewhite3 That’s a great trivia question.",
    "662": "The @celtics are not playing like a championship caliber team. They just don’t show that they want it. That’s just my call. I hope they start taking every touch seriously! No reason we should of lost to the bulls. Smh.",
    "663": "@KatieNovakUDL @celtics Seattle teams, bring back the Sonics! @BringBackSonics",
    "664": "Blake Griffin considered signing with the Boston Celtics last season. He reached out to a friend on the team, but his friend warned him to stay away because the Celtics’ chemistry on and off the floor had deteriorated so badly. https://t.co/X5SYhGraEG",
    "665": "@TermineRadio Yeah, and all day long, I heard everything that was wrong about the Celtics, but very little or nothing about the Bulls, . . . who might actually have a pretty good team this year.  Not world beaters, but deserving more respect and airtime than the legendary boston celtics . . .",
    "666": "@FunkyDiabetic1 Blake Griffin considered signing with the Boston Celtics last season. He reached out to a friend on the team, but his friend warned him to stay away because the Celtics’ chemistry on and off the floor had deteriorated so badly. \n\n(via The Athletic)",
    "667": "Hey who's got 5️⃣ alums in the NBA, 1️⃣in the MLB?  Simeon Does!💙💛\n\n@drose New York Knicks\n@FutureIs_Bright Milwaukee Brewers\n@Jabari_Parker12 Boston Celtics\n@nunnbetter_ LA Lakers\n@Tate0__ Santa Cruz Warriors\n@Thortontucker LA Lakers\n\nListed in proper alumni order. #SimeonFamily",
    "668": "What is going on with the Boston Celtics?\nLink to the video: https://t.co/KnTy9ChfNy\n#celtics #BostonCeltics #jaysontatum #jaylenbrown\n#MarcusSmart #theceltics #KyrieIrving #dannyainge #NBA75 #NBA #bradstevens #celticsvsbulls #espn #fs1 #firsttake #undisputed https://t.co/ASamkkjXDB",
    "669": "Boston Celtics Fanatics Hardwood T-Shirt Black\n\nhttps://t.co/gOfitTSeFf\n\n#sponsored #celtics #nba #basketball #bostonceltics #boston #jaysontatum #nbaplayoffs #celticsnation #k #sports #jaylenbrown #kembawalker #bleedgreen #nbafinals #marcussmart #ballislife #nbabasketball https://t.co/3kabNzH1bV",
    "670": "@WorldWideWob We need this energy on the @celtics @taylordisantis @Hovered_Bridges @jaytatum0",
    "671": "Court side with @juneambrose 🤪 Thank you for having us @celtics @pumahoops @ TD Garden https://t.co/9ClgkQx0uU",
    "672": "@fedupCelticsfan @celtics Happily bored though",
    "673": "@BCCoachStevens @celtics Sign Isaiah Thomas. He is the missing piece.",
    "674": "We’d all be bored as hell if the @celtics were actually a functional NBA team",
    "675": "Well said @smart_MS3 @celtics fans are pissed off and you nailed it with the Jays not passing creating enough for teammates. Bad coaching too",
    "676": "There's literally nothing exciting about baseball anymore. I'd watch a random Nascar race or a Boston Celtics preseason game over game 7 of the WS. https://t.co/D49Zd7ZX8u",
    "677": "@FCHWPO Trade Marcus Smart right now @celtics",
    "678": "@GilroyonHoops @celtics Hi Patrick . Sorry to bother you brother . Is there any podcast or radio show I can listen to you regarding the Celtics ?  Love your perspective about the C’s",
    "679": "@ThePoniExpress There's literally nothing exciting about baseball anymore. I'd watch a random Nascar race or a Boston Celtics preseason game over game 7 of the WS.",
    "680": "@Plugjoey @celtics Man this bench is pathetic.. We have a rookie Coach. Watch Tate Em and Brown get injured.. This team is lottery bound and it sucks. Nobody coming out next year is a difference maker.",
    "681": "@TA1297 Noted team no one hates: the Boston Celtics lmfao",
    "682": "1-1 after two meetings this season, the championship favorite Orlando Magic (1-6) square off against the plucky, up and coming Boston Celtics (2-5) to see who can get the upper hand in a true battle of the titans tomorrow. \n\nWill be a true test for Boston.",
    "683": "@EricRobbert @JKoolLIVE @celtics @DocRivers FACTS! That's after gum surgery following MY Urban Conversation with @wutrain. Then, this morning's #GOTV on radio. Now, I'm about to do the rounds at some vitory parties. Cocktails on @wutrain, @juliaforboston &amp; @ruthzee4boston! 🤣😂😅 #BOSpoli #MApoli https://t.co/xVQ0T483qT",
    "684": "Boston Celtics Larry Bird Jersey White\n\nhttps://t.co/bnudxdgG43\n\n#sponsored #celtics #nba #basketball #bostonceltics #boston #jaysontatum #nbaplayoffs #celticsnation #k #sports #jaylenbrown #kembawalker #bleedgreen #nbafinals #marcussmart #ballislife #nbabasketball https://t.co/JfAJh1xIr2",
    "685": "@NBAonTNT Wow that’s crazy what happens when you let the white guy shoot huh? @celtics @paytonpritch3 @jaytatum0 @FCHWPO",
    "686": "@NBAReactz You don’t hire the head coach of the Boston Celtics based on pedigree. \n\nI still expect him to work out … but that’s me being hopeful and having zero evidence to support it.",
    "687": "@NotoriousVOG @JKoolLIVE @celtics @DocRivers You’re workin’ hard, my friend. Love it! 🤙🏻💚",
    "688": "@celtics Reply to Marcus maybe they are not passing because nobody is cutting. The whole damn team thinks they are a 3 point shooting team and you just arnt. Quit standing on perimeter and move. Al please teach Robert how to block out and for gods sakes quit bringing the balldown on catch",
    "689": "8:45PM it's going down! Just a warning, if you love your Boston #Celtics I'm about to go in on them. Calling things how I see it straight up! Join the conversation with @DoubleMMedia_ \n\nhttps://t.co/hSy6Dex0tO",
    "690": "Can the Boston Celtics secure 43+ Rebounds vs Orlando Magic tomorrow at 4:00 pm PST? 🏀\n\nComment your predictions below! 👀 https://t.co/WVTEezAXFQ",
    "691": "Day 14 of posting @celtics players: \nBob Cousy https://t.co/k7msQ3HniM",
    "692": "I wish the @Celtics would invest in guys with this kind of character and leadership. https://t.co/Z9fw64yGOi",
    "693": "Boston Celtics @Any2Cards302 https://t.co/6myshf83wa",
    "694": "Does early season turmoil have the Boston Celtics on the brink of disaster?\nhttps://t.co/iJ9d7o3Q9z",
    "695": "@VanAllenLab @Lakers @celtics @warriors That would never happen if you're in LA 🤓😉",
    "696": "Boston Celtics 47 Black Hat\n\nhttps://t.co/q4ZLb2UmsW\n\n#sponsored #celtics #nba #basketball #bostonceltics #boston #jaysontatum #nbaplayoffs #celticsnation #k #sports #jaylenbrown #kembawalker #bleedgreen #nbafinals #marcussmart #ballislife #nbabasketball https://t.co/PGXXaFbLXf",
    "697": "I stan @EnesKanter ✊✊✊I know soddall abt basketball 🏀 but I now decide to be a @celtics fan just because of Enes. #BoycottBeijing2022 #BoycottBeijingOlympics #StandWithHongKong #StandWithUyghurs #StandWithTibet #StandWithTaiwan https://t.co/Dj69iItOme",
    "698": "The @celtics gone get everything together. They have to really stick together and believe the process.",
    "699": "I was wrong. Tatum is actually the lightskin Carmelo. Time to trade his ass @celtics https://t.co/IGsxv9oQ92",
    "700": "Boston Celtics center Enes Kanter made headlines when he uploaded videos to social media calling Chinese president Xi Jinping a \"brutal dictator.\" https://t.co/Klmhe0GnAE",
    "701": "@CelticsRiley @CelticsRiley for @celtics PR team",
    "702": "Over the decades, the Boston Celtics have made their bones (and hung their banners) through the work they’ve done in the draft and via trade, rarely signing splashy free agents in their quest…  https://t.co/tPwBld6Pbk",
    "703": "LOS ANGELES (AFP) — DeMar DeRozan scored a game-high 37 points as the Chicago Bulls used a fourth-quarter surge to overpower the struggling Boston Celtics 128-114 on Monday.\n\nREAD MORE: https://t.co/axPeWy54NK",
    "704": "@lead2324 @RajonRondo @ACFresh21 @celtics @Lakers Let’s goooo https://t.co/hBfzemUiKe",
    "705": "Once @T_Rozzay3 left everything took a turn for the worst @celtics",
    "706": "LOS ANGELES (AFP) — DeMar DeRozan scored a game-high 37 points as the Chicago Bulls used a fourth-quarter surge to overpower the struggling Boston Celtics 128-114 on Monday.\n\nREAD MORE: https://t.co/Socd9jWH3J",
    "707": "Everyone needs to know that Marcus Smart literally help the Boston Celtics beat the Hornets during the Whole Game",
    "708": "It’s hard enough brainwashing my kids into being proper @Lakers fans surrounded by @celtics around here, getting sent this @warriors ball (when I’d clearly ordered a Lakers emblazoned one for the kids to play with) hurt 😢 https://t.co/HVoCvzv3fg",
    "709": "What's wrong with the BOSTON CELTICS?🍀🏀\n\n\"I'll start with JAYSON TATUM\" @MichaelVPina \n\nFull show 👇\nhttps://t.co/i8CtDyVjab\n\n#TheLastShot #NBA https://t.co/iqtoknjTEh",
    "710": "@The7uice @FCHWPO @celtics You are Jaylen. But thank you",
    "711": "@paraaand Real Boston Celtics hours",
    "712": "Nothing drives me crazier than watching a deep bench not being utilized. #BostonCeltics Horford playing a lot of minutes, meanwhile we have Bruno Fernando, Enes Kanter who nearly averaged or did average a double double last season, and Hernangomez just watching from the bench.",
    "713": "The @celtics lost the trade with the Brooklyn Nets in 2013.",
    "714": "@celtics JB for JB you need to include a pick https://t.co/v4gOsEEb8H",
    "715": "For real, my life might be better than I’ve ever been. Like, the ONLY thing that sucks right now is the play of the Boston Celtics.",
    "716": "@hirst_josh @FCHWPO @celtics I’m not Jaylen but this cool lmao",
    "717": "@willr0bbins @celtics Celtics won 17 championships! We chasing 18 so stop hate-mongering.",
    "718": "Watch our own morning show host @NotoriousVOG In The Morning having FUN trash talking on the court with the Jr Allstars. \"I will disrespect this man.\" 😲 #ABCDHoopDreams #NITM @BostonABCD @celtics @DocRivers #ForTheKids https://t.co/4Z8CGMSqYA",
    "719": "Boston Celtics NEW ERA 59FIFTY Hat Green/Black\n\nhttps://t.co/j5EJIDN63y\n\n#sponsored #celtics #nba #basketball #bostonceltics #boston #jaysontatum #nbaplayoffs #celticsnation #k #sports #jaylenbrown #kembawalker #bleedgreen #nbafinals #marcussmart #ballislife #nbabasketball https://t.co/x5A1rJ6BKq",
    "720": "@celtics @MAStateLottery Obviously she has zero college plans",
    "721": "@JoshuaSimsSr @ryaninsix @celtics @NBA @UniWatch @PhilHecken @StoolGreenie @Nike We can 🙂",
    "722": "@tonygig @celtics Last year was painful.  This year is worse.",
    "723": "@DekayScott @celtics I won’t tell anyone",
    "724": "@SlcToyHunter @SMS4988 @celtics @luka7doncic I am 100% out of state on December 3rd. 😔",
    "725": "@BigDebsTweets @celtics this is indeed a stolen tweet. take me officers",
    "726": "@DekayScott @celtics 🚨Banger Alert🚨(ignoring that this is a stolen tweet)",
    "727": "Boston Celtics - Edible Cake Topper, Cupcake Toppers, Strips https://t.co/XvgPrMisAt",
    "728": "@ryaninsix @celtics @NBA @UniWatch @PhilHecken @unimockups @StoolGreenie @Nike Hey Ryan,\nCan you do these type of templates or designs for regular apparel as well?\nHoodies, Tee, Hats, etc….",
    "729": "The Boston Celtics are not off to a roaring start. It’s still early so things can be corrected. Still, they have some issues that are glaring to start\n#bostoncetics #bleedgreen #jaysontatum https://t.co/P6M79ak31E",
    "730": "@celtics got a good chance tonight",
    "731": "I stand with @smart_MS3 Nothing he said was negative or bashing. Don't fall into the drama the media wants for the @celtics https://t.co/3nK7g6Pilq",
    "732": "Milwaukee Bucks forward Khris Middleton has tested positive for COVID-19.\n\nHe must sit out for a minimum of 10 days, meaning he could miss the next six games through next Saturday's match-up on the road against the Boston Celtics.\n\nhttps://t.co/1Y0PNRKK1S",
    "733": "@NotoriousVOG @celtics @B87FM @DocRivers Last night was rough and I’m going to leave it at that",
    "734": "so proud of the @celtics! Honoring the NBA’s 75th season with 75 loses. Class act 🥂",
    "735": "@celtics They broke a record for blowing a lead and also they lost. JFC.",
    "736": "@numbaN9 @celtics He’s not wrong. Tatum is chucking up 25 shots a game",
    "737": "Boston Celtics Fanatics Kelly T-Shirt Green\n\nhttps://t.co/AXVna73Uz8\n\n#sponsored #celtics #nba #basketball #bostonceltics #boston #jaysontatum #nbaplayoffs #celticsnation #k #sports #jaylenbrown #kembawalker #bleedgreen #nbafinals #marcussmart #ballislife #nbabasketball https://t.co/ISUDDk8TC3"
}