{
    "0": "Lakers struggling and the Washington Wizards GM just got promoted for getting Westbrook outta there https://t.co/YdAkJWQEak",
    "1": "HTP Lifestream during @WashWizards vs @hornets on IG Live starting five minutes! JOIN THE FUN 🤩 🏀 \nhttps://t.co/zJWU0c7kT3\n\n#charlottehornets #washingtonwizards #nba #NBA75 #NBA2K22 #nbalivestream #nbalive #nbagame #bradleybeal #lameloball",
    "2": "#NBA75 | TONIGHT! We begin with \nCharlotte Hornets vs Washington Wizards\nBET NOW:\nhttps://t.co/0rTJpgSrdP https://t.co/E3rdoeQYyX",
    "3": "the washington wizards play basketball tonight https://t.co/xt4FljXV10",
    "4": "#NBATwitter Today's Lineups\n\n#DCAboveAll\nWashington Wizards Starting 5:\nSpencer Dinwiddie\nBradley Beal\nKentavious Caldwell-Pope\nKyle Kuzma\nDaniel Gafford\n\n#AllFly \nCharlotte Hornets Starting 5:\nLaMelo Ball\nTerry Rozier\nGordon Hayward\nMiles Bridges\nMason Plumlee",
    "5": "Charlotte Hornets to beat Washington Wizards @1.86",
    "6": "#NBA75 | TONIGHT! We begin with \nCharlotte Hornets vs Washington Wizards\nBET NOW:\nhttps://t.co/TvxEtPSCVL https://t.co/iWmwuJGP1J",
    "7": "Washington Wizards (+1.5) @ Charlotte Hornets #AllFly #DCAboveAll #NBA #NBATwitter #NBA75",
    "8": "NBA\n•Washington Wizards ML(15 Units) https://t.co/PROY47VAHb",
    "9": "#WashingtonWizards riding high w/new team! Is this the best squad #BradleyBeal has had since #JohnWall was at his peak? The #LosAngelesLakers off to a slow start Is the new supporting cast around #LeBronJames &amp; #AnthonyDavis enough to win big this season?\nhttps://t.co/AYJVhgHq56",
    "10": "Your Washington #Wizards, the HOTTEST team in the NBA, are in Charlotte to play the Hornets. Pregame coverage is on 106.7 The Fan NEXT!\n\nLISTEN: https://t.co/Jzy9SiLHb4",
    "11": "[GAME THREAD] Washington Wizards (10-3) @ Charlotte Hornets (8-7) - 7:30PM EST [NBCSW] https://t.co/IMqki849lT",
    "12": "⚠️Free Picks Of They Day⚠️🏀🏀🏀\n🤑🤑🤑\nSigamos con la gran racha de Free Picks!! \n\nAtlanta Hawks vs Boston Celtics 0216 \nWashington Wizards vs Charlotte Hornets ML https://t.co/hT82r06O5o",
    "13": "Jacob Haynes's favorite basketball team is the Washington Wizards.",
    "14": "11-17-2021 ACTION ⬇️\n\n(NCAA CFB)🏈 \nNorthern Illinois ML (-120) (1u)\nCentral Michigan ML (-135) (1u)\n\n(NHL)🏒 \nColorado Avalanche in regulation.(-110) (1u)\n\n(NBA)🏀 \nWashington Wizards ML (-110) (1u)\nPhoenix Suns -8 (-110) (1u)\nChicago Bulls +1.5 (-110) (1u)",
    "15": "Should be a good game Cuz, but you know I’m with the home team. #WashingtonWizards https://t.co/N7UDx77Fvm",
    "16": "Happy birthday to Elvin Hayes who is 1 of the greatest Washington Wizards players of all time, but is he No.1? \n\nSee for yourself and create your own top-5 #Wizards ranking ⬇️ https://t.co/gAmA3fg9Gs",
    "17": "🔥🔥🔥NBA Fire Picks🔥🔥🔥\n        Washington Wizards +1\n         Dallas Mavericks +8.5\n(Don’t be afraid to bang a parlay) https://t.co/BzVWQapbe1",
    "18": "🔴 IN LIVE\n\nCapital One Arena, Washington, DC\n\nGOLDEN STATE WARRIORS\nvs\nWASHINGTON WIZARDS \n\nANBATV: https://t.co/SyZA4GIw4M https://t.co/kZSs3BvxQ1",
    "19": "ALERT: New high roller bet posted!\nA bet has been placed for $9,041.28 on Charlotte Hornets - Washington Wizards to win $17,359.25.\nTo view this bet or copy it https://t.co/WyX3LZSmF8 https://t.co/gqdO0ygCJI",
    "20": "@TonyReali Washington Wizards winning without Westbrook",
    "21": "NBA\nWashington Wizards ML +100\n\n@Clappa12\n@StreakCoolers https://t.co/EZgTqaRKXV",
    "22": "Washington Wizards Starters:\n\nSpencer Dinwiddie\nBradley Beal\nKentavious Caldwell-Pope\nKyle Kuzma\nDaniel Gafford\n\nPlayers out:\nDavis Bertans\nThomas Bryant\nRui Hachimura\n#DCAboveAll #NBA #NBATwitter #NBA75",
    "23": "Tonight's starting lineup for the Washington Wizards: Dinwiddie, Beal, Caldwell-Pope, Kuzma, Gafford https://t.co/bVWH4AMCA2",
    "24": "@MiamiHEAT I need y’all healthy for those Washington Wizards games",
    "25": "Gordon Hayward (hamstring discomfort) will play in Wednesday’s game against the Washington Wizards. For Fantasy Analysis Click Here: https://t.co/qJ5fSAfXt7",
    "26": "NBA 2021: DeMar DeRozan to LA Lakers done deal, move to Chicago Bulls, Russell Westbrook trade with Washington Wizards – Lakers News https://t.co/7JUrniDJWT",
    "27": "ok so i think I solved the trade issue with Ben Simmons \nLamelo Ball for Kemba \nthen a rookie from the wizards for Simmons so that there could be a duo in Washington with Kuzma \nthe New York trade is just because I would really want kemba back in NC like the return of Cam / Kemba",
    "28": "@WashWizards Game at 7:00pm vs @hornets!\nMy 3 Predictions:\n-Bradley Beal will score 30+ points and have 6+ assists \n-Deni Avdija will score 10+ points and have 8+ rebounds\n-Kyle Kuzma will make 4 or more 3 pointers\n(The Wizards Will Win 116-109!)\n#DCAboveAll #WashingtonWizards",
    "29": "🚨NBA / NHL Power Picks🚨\n\nA Washington winner: Wizards and Capitals BOTH to win! These selections have been packaged as one bet and the odds have been boosted! \n\nBet Here ▶ https://t.co/RXPjAGtfqv   \n\n19+ https://t.co/CAc3KZEl8v",
    "30": "Washington Wizards President/ GM Tommy Sheppard tells me via phone, “great folks here make it go.” regarding his new extension. \n\nOn his big day, he credits others. Great leader! \n\n#DCAboveAll you have a good one!",
    "31": "TODAY’S #NBA #MarketMover @GerardDaffy is the Washington  Wizards H2H v Charlotte Hornets @tabcomau #RadioTAB @tabcomaumedia",
    "32": "@myname_isandrew Washington sitting comfortably at 10-3, top of the Eastern Conference. \n\nI’ll come knocking on your door around Christmas to remind you the Wizards are the better team.",
    "33": "🧔 NBAland\n📲 https://t.co/BFzlxVuUv4\n📢 Apuesta baloncesto – NBA 21/22 – CHARLOTTE HORNETS vs WASHINGTON WIZARDS",
    "34": "New post (Apuesta baloncesto – NBA 21/22 – CHARLOTTE HORNETS vs WASHINGTON WIZARDS) has been published on Apuestas NBA - https://t.co/5hAcbDub6j",
    "35": "Spilforslag:  Charlotte Hornets - Washington Wizards: Over 14,5 Point af M.Harrell https://t.co/KMst7r5XNm #betxpert #betdk https://t.co/iww4yfzhct",
    "36": "WEDNESDAY MORNING PICKUPS:\n@ethandepalma/@DepalmaEthan picked up Washington Wizards SG Kentavious \"KCP\" Caldwell-Pope (dropped Philadelphia 76ers PF Georges \"Minivan\" Niang)\n@benjamoney16 picked up Miami Heat SF P.J. \"Pops Junior\" Tucker \n\nWho had the better pickup?",
    "37": "🏀Overnight NBA Acca 🏀\n⏰ Starts at 12:10am\n⭐️ Returns 3/1\n\n🗣️\"The Washington Wizards are coming into this match in great form as they are top of the Eastern Conference with ten wins. The Wizards have won...\"\n\nView here 🔽\nhttps://t.co/HosxmEdeXJ…\n\n(18+ begambleaware) https://t.co/6U6XHQnohQ",
    "38": "The Washington Wizards currently sit atop the Eastern Conference. So is it time to start believing in this Cinderella team?\n\n@BillSimmons and @HousefromDC take a temperature check on their Wizards fever ... https://t.co/thaUQZ2rXf",
    "39": "Washington Wizards\nIndiana Pacers\nBoston Celtics\nBrooklyn Nets\nNew York Knicks\nSacramento Kings\nOklahoma City Thunder\nChicago Bulls\n\nlocked an cocked??? @poon1slayer",
    "40": "@Mike_Schmitz This really looks like his path to a successful NBA career. Exactly what the wizards need too. #DeniAvdija #WashingtonWizards",
    "41": "Wizards 20-year-old Deni Avdija has evolved into one of the more versatile wing defenders in the league so far this season. While he’s still settling in offensively, he’s played a big role in Washington’s success with his defense and energy. https://t.co/e6NScbf8VX https://t.co/SW8pShU3aB",
    "42": "Upstart Wizards extend GM Sheppard's contract: The Washington Wizards have rewarded general manager Tommy Sheppard with a contract extension amid the team's surprisingly fast start to the season. https://t.co/2Zmmt1s8DC https://t.co/H0IZdOsuKf",
    "43": "Washington Wizards visits Charlotte Hornets Predictions and Preview for 11/17/2021 today.  Who are we taking in this game?  Find out now. #SportsBetting #NBATwitter https://t.co/VUN43GFwnr",
    "44": "@CandaceDBuckner wrote in her latest article with the Washington Post that Wizards fans were chanting “Zion’s chunky” and Buckner wrote,\n\n“But somehow, lost in this progress, fat-shaming is still okay in sports discussion…as long as the target is male and wealthy.” https://t.co/H2Mem5RDyC",
    "45": "The Washington Wizards play the Charlotte Hornets tonight at 7p est! 🔥\n\nCan the @WashWizards bring home another win? Who do you have your money⁉️",
    "46": "Injury update ❗️ for #Fantasy5 NBA Jackpot Round 7 🏀\n\n[THREAD]\n\n#CHARLOTTEHORNETS\n\nGordon Hayward  - Doubtful  (Game Time Decision)\nP.J. Washington\n\n#WASHINGTONWIZARDS\n\nDavis Bertans\nRui Hachimura\nThomas Bryant",
    "47": "How Are The Washington Wizards The Best Team in the NBA?\n\nhttps://t.co/ysAn3IF85R https://t.co/fZSoOlsEPd",
    "48": "@ThatKyleMalone Just the wharf. Yeah. It's a visual improvement but the old wharf is gone. I believe the Captain D will go to Nat Harbor. Good news is the Washington Wizards are killing it and The Washington Football team is in better shape than I've seen them in lately. Bullets and Redskins",
    "49": "46 years ago, the team went on to win a franchise-best 60 games.\n\nAre the Washington Wizards on the verge of beating that record this season? 🤔 https://t.co/cUE9A9kAqe",
    "50": "🏀 #NBA\n\nWashington Wizards 🆚 Charlotte Hornets\n📆 Jue 18 nov 01:10\n\n#Raspibets #FreePicks #FreeTips #StatBets #SportsBetting #BettingTipster #DCAboveAll #AllFly\n🆓🔎📈⬇ https://t.co/hw77kobabf",
    "51": "Thinking about betting on Washington Wizards v Charlotte Hornets (NBA)?  Find out what pick Pine member @peruvianhope locked in for the game.\n\nhttps://t.co/E1iZeIVtvD",
    "52": "The Washington Wizards, who lead the Eastern Conference standings, would improve to 11-3 and equal a franchise-best start after 14 games if they defeat the Charlotte Hornets tonight. Click on the screen grab below for my keys to the game. https://t.co/oHeAsHepDm",
    "53": "Washington Wizards vs Charlotte Hornets SGP #GamblingTwiitter #ElParlay🥸 https://t.co/mwv6AGAQ2z",
    "54": "🏀\nMinnesota Timberwolves -2 (-110)\nDetroit Pistons +7 (-110)\nWashington Wizards +1 (-110)\n______________________________\nI also played under 211 on Pistons/Pacers game but line went rapidly down. If you like that, I would play it for smaller wager! Good luck guys🔥🏀",
    "55": "White House pool report: \"This afternoon, FLOTUS will join U.S. Surgeon General Dr. Vivek Murthy, Washington Mystics' Alysha Clark, and Washington Wizards' Thomas Bryant at a pediatric COVID-19 vaccination clinic at the Children’s National at THEARC.\"",
    "56": "The Washington Wizards have rewarded general manager Tommy Sheppard with a contract extension amid the team's surprisingly fast start to the season. \n#NBA #NBATwitter https://t.co/YrkQEd1YDM",
    "57": "Washington Wizards play basketball today #DCAboveAll https://t.co/bpdvvxPekq",
    "58": "If you start to lose hope and think your dreams are unachievable, the Washington Wizards are in first place. Dream Big! https://t.co/9wvn2XioS0",
    "59": "NBA  🏀 Temporada: 26-25\n\nMiércoles 17/11:\n\nWashington Wizards vs Charlotte Hornets O220.5 (-110)\nCleveland Cavaliers vs Brooklyn Nets O206.5 (-110)\n Phoenix Suns 1Q -2.5 (-118)",
    "60": "WASHINGTON (AP) — Wizards general manager Tommy Sheppard has received a contract extension amid Washington's fast start to the season. https://t.co/KKmt2cWoEm",
    "61": "NBA Twitter rlly has energy to hate on the Wizards? The Washington Wizards?!? 50 wins and a 5-6 seed would be a huge step for the franchise compared to last years direction it’s wild everyone is saying championship or it’s worthless",
    "62": "The Washington Wizards announced they have promoted Tommy Sheppard to President. He’ll also remain GM for the 10-3 Wizards 🔥\nhttps://t.co/JD2xudgVpE",
    "63": "NBA Betting Preview: Charlotte Hornets vs. Washington Wizards https://t.co/GN8Ky4kR0y",
    "64": "@BeccaMVP Washington Wizards have lower standards than a Laker fan since 1979. Not spending 44 million dollars this season and 47 million dollars next season on Westbrook to be 8-7, a veteran's minimum point guard can do that. https://t.co/zGYoeoYp2r",
    "65": "Washington Wizards' Spencer Dinwiddie calls out “popularity contest\" NBA 2K ratings https://t.co/f8DSJjlnsF",
    "66": "Very happy to hear about the promotion of Tommy Sheppard! The Washington Wizards are in great hands with him. #DCAboveAll",
    "67": "Have the Washington Wizards won the Russell Westbrook trade so far? https://t.co/ubhVmOMHmi",
    "68": "Washington Wizards vs. Charlotte Hornets Picks, Preview, and Prediction https://t.co/RU2TvU3sVI",
    "69": "Let’s fact check a false rumor that has spread through Wizards twitter for years. NBC Sports Washington is in charge of selecting the teams broadcast. Even if the team makes suggestions, that decision ultimately fell on the network. Shift your blame there. https://t.co/mLuSE8f0iU",
    "70": "Who would win: the Washington Wizards with Kyle Lowry or the San Antonio Spurs with Steph Curry? #DCAboveAll #GoSpursGo https://t.co/hw7XhUNL9n",
    "71": "Here's a weird one. Charlotte's won a couple as of late but the red-hot Wizards play at the Hornets tonight and Charlotte is favored by a point. Washington winning feels like a no-brainer there.",
    "72": "Wednesday's #NBA75 #BettingPicks by \n@SpreadAstaire\n\n🏀Charlotte Hornets vs Washington Wizards: Banker at -110 (1.91)\n\n#NBATwitter #NBAPicks\n+ 2-Team Parlay at +265 (3.65) \n👇👇👇\nhttps://t.co/lrR0WDuCtv",
    "73": "New episode: @PointsPaint 🎙\n\n➡️ GUEST @avarwallace of @postsports joins us to talk Washington Wizards\n\n➡️ Do we buy DeMar DeRozan as MVP\n\n➡️ Stat of the week &amp; more\n\n#DCAboveAll | #NBATwitter\n\nApple: https://t.co/bQGid9j3xc\n\nSpotify: https://t.co/FIDRkwoboF",
    "74": "Washington Wizards add president title to GM Tommy Sheppard https://t.co/IsmptLeidd",
    "75": "Washington Wizards add president title to GM Tommy Sheppard https://t.co/moh6PkyUfC",
    "76": "And two days later:\n\n“WASHINGTON, D.C. – Monumental Sports &amp; Entertainment announced today that General Manager Tommy Sheppard has been promoted to President and General Manager of the Washington Wizards” https://t.co/rum7s1Ws88",
    "77": "Pay it forward Giveaway Alert! NBA Washington Wizards FBF originals wristbands. To enter follow me and retweet. Winner announced tonight. @NBA @NBAHistory #Giveaways #Contest #win #WashingtonWizards  #NBA #basketball #NBATwitter #BeKind #StayAwesome #Payitforward https://t.co/InLdApALip",
    "78": "The @WashWizards have promoted General Manager Tommy Sheppard to President and General Manager of the Washington Wizards and Chief Planning and Operations Officer Sashi Brown has been promoted to President of Monumental Basketball and Special Advisor to the office of the CEO. https://t.co/BPQ9fBhqrq",
    "79": "The Washington Wizards and athletes from the Washington Mystics, Capital City Go-Go and Wizards District Gaming have partnered to host Wizards’ Thankful Meals, a community outreach for residents in Ward 7 and 8.",
    "80": "It is once again gameday.\n\nThe Charlotte Hornets, coming off of their big win against Golden State, are taking on the Washington Wizards tonight.\n\nHere is everything you need to know about the game tonight (@TheJacksonDylan):\nhttps://t.co/b8vsQWKacD",
    "81": "Lol. Watching this New Orleans + Washington game.\n\n7 minutes in and Kuzma has not even tried to shoot the ball w/ Brandon anywhere near him. Wizards also aren't doing a good job of getting BI off of Him.\n\nMeanwhile, Brandon has a middy, a tough drive &amp; a 3 ball, all in Kuz' eye.",
    "82": "Consensus Line Move:\n2021-11-17 Washington Wizards at Charlotte Hornets from 219.00 to 220.00\nOver this just in\n#NBA #sport #tech #realestate",
    "83": "@WFNYCraig No way in hell is that title fitting on a business card unless the font is 4 pt.\n\nSashi Brown\nPresident of Monumental Basketball and Special Advisor to the Office of the CEO at Monumental Sports &amp; Entertainment \n-And Washington Wizards\n-Michael Scott\n-Wayne Gretzky",
    "84": "🏀 ¡HOY JUEGA LAMELO! 🪄\n\n🆚 Washington Wizards\n🏟 Spectrum Center (Charlotte)\n⏰ 21:00 🇦🇷\n📺 NBA League Pass\n\n#AllFly https://t.co/U3XQNCShE0",
    "85": "Want to win tickets to the @spurs game against the Wizards on 11/29?  On our Instagram, we’re giving away a pair of tickets and 1 parking pass to 2 lucky fans so they can see the Spurs play the Washington Wizards at AT&amp;T Stadium! GO! https://t.co/dYATXSL9qc\n\n#STXFord #GoSpursGo https://t.co/N0pj8EEQJY",
    "86": "Washington Wizards add president title to GM Tommy Sheppard https://t.co/w8VMyhsZv6 #NBA #WashingtonWizards",
    "87": "Former Browns’ VP of Football Operations Sashi Brown, now with the Washington Wizards, has been promoted to President of Monumental Basketball and Special Advisor to the Office of the CEO at Monumental Sports &amp; Entertainment and signed an extension.",
    "88": "The best bets for the game between the Charlotte Hornets and Washington Wizards for Wednesday’s game.  https://t.co/1BDzdJhyXe",
    "89": "\"Former Browns’ VP of Football Operations Sashi Brown, now with the Washington Wizards, has been promoted to President of Monumental Basketball and Special Advisor to the Office of the CEO at Monumental Sports &amp; Entertainment and signed an extension.\"",
    "90": "Charlotte Hornets vs Washington Wizards NBA Picks, Odds, Predictions 11/17/21 » Sports Chat Place https://t.co/jZC1ZYjHFZ #NBA #NBAPick #FreePick #FreePicks #SportsBetting #ExpertPick #NBATwitter  #ExpertBettingAdvice #BettingTipster #Handicapper #Sports #dcaboveall #allfly https://t.co/ojjBhGXO8V",
    "91": "#RT @AdamSchefter: Former Browns’ VP of Football Operations Sashi Brown, now with the Washington Wizards, has been promoted to President of Monumental Basketball and Special Advisor to the Office of the CEO at Monumental Sports &amp; Entertainment and signed an extension.",
    "92": "Under 218.5 (-110) on Bovada\n(559) Washington Wizards @ (560) Charlotte Hornets\n\nDivisional Rivals will show more defense in this game, also I show Reverse Line movement in the Total.",
    "93": "Washington Wizards vs. Charlotte Hornets Picks, Preview, and Prediction https://t.co/26tHEkRdgY",
    "94": "Former #Browns Vice President of Football Operations Sashi Brown, now with #NBA75 Washington #Wizards, has been promoted to President of Monumental Basketball and Special Advisor to the Office of the CEO at Monumental Sports and Entertainment and signed an extension.\n\n#DCAboveAll",
    "95": "21:00 – 🏀NBA\nWashington Wizards x Charlotte Hornets\nNBA LEAGUE PASS\nIndiana Pacers x Detroit\nNBA LEAGUE PASS\n21:30 – NO Pelicans x Miami Heat\nNBA LEAGUE PASS\nBoston Celtics x Atlanta Hawks\nNBA LEAGUE PASS\nCleveland Cavaliers x Brooklyn Nets\nNBA LEAGUE PASS\n\n(+)",
    "96": "Former Browns’ VP of Football Operations Sashi Brown, now with the Washington Wizards, has been promoted to President of Monumental Basketball and Special Advisor to the Office of the CEO at Monumental Sports &amp;amp; Entertainment and signed an extension.",
    "97": "Former Browns’ VP of Football Operations Sashi Brown, now with the Washington Wizards, has been promoted to President of Monumental Basketball and Special Advisor to the Office of the CEO at Monumental Sports &amp; Entertainment and signed an extension.",
    "98": "Washington Wizards unloading the team buses https://t.co/iYHCjUYnJ0",
    "99": "The Washington #Wizards have promoted Tommy Sheppard to General Manager and President along with agreeing to a contract extension. The Wizards are 10-3 and first in the East. #NBA https://t.co/pvCUFDbC7Q",
    "100": "The Washington Wizards are promoting General Manager Tommy Sheppard to President and GM of the franchise. They're promoting Chief Planning and Operations Officer Sashi Brown to President of Monumental Basketball and Special Advisor to the CEO at Monumental Sports &amp; Entertainment.",
    "101": "Monumental has promoted GM Tommy Sheppard to President and GM of the Washington Wizards. \n\n“Tommy has effectively improved our team each year of his tenure by following the plan he laid out to us as his vision when we hired him as general manager.” -Ted Leonis\n\n#DCAboveAll",
    "102": "Monumental Sports &amp; Entertainment announced today that GM Tommy Sheppard has been promoted to President &amp; GM of the Washington Wizards &amp; Chief Planning and Operations Officer Sashi Brown has been promoted to President of Monumental Basketball and Special Advisor to CEO at MSE. https://t.co/bDsvgOa8Id",
    "103": "Tommy Sheppard has been promoted to President and General Manager of the Washington Wizards.\n\nWell deserved. \n\nTommy has done a fantastic job getting new pieces to build around Bradley Beal.\n\nThis franchise is in good hands with Sheppard and Wes Unseld Jr.",
    "104": "The Wizards have promoted Tommy Sheppard to president and general manager and signed Sheppard to a multi-year extension, per team. Sheppard, a frontrunner for Executive of the Year, has successfully revamped the Washington roster the last two seasons.",
    "105": "damn, a contract extension for a gm that leonsis didn't even have to do in secret, things really are changing for the washington wizards https://t.co/1wEnGwFDDX",
    "106": "I forgot Sashi Brown works for the Washington Wizards #Browns https://t.co/3uPwEQzPDq",
    "107": "Good morning, the East leading Washington Wizards play today. Also, Bradley Beal is making his return. https://t.co/B7nAEH1sjk",
    "108": "Monumental Sports &amp; Entertainment announced today that General Manager Tommy Sheppard has been promoted to President and General Manager of the Washington Wizards. #DCAboveAll",
    "109": "Top net ratings in East \n\n1. Miami \n2. Chicago \n3. Washington \n\nThe Heat play 3 upcoming games against the Bulls and Wizards",
    "110": "DasHaus made a bet!\n\nEvent: Washington Wizards vs Charlotte Hornets #NBA\nBet: Washington Wizards TO WIN +1\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "111": "WASHINGTON WIZARDS TURKEY DINNER 59FIFTY HATS now available from NEWERACAP\n\n#newdrop #neweracap #nba #washingtonwizards #wizards #dcfamily #washingtondc #washington #turkey #dinner #59fifty #hats #hatcrawler #fitted #fittedheads #newera\n\nhttps://t.co/zxtF1rAYmz",
    "112": "Revenge Game: Kelly Oubre Jr. plays Washington tonight.  He played 252 games in his career for the Wizards.",
    "113": "SOURCE SPORTS: Jayson Tatum Drops 50 to Lead Celtics to 7th Seed in the East\n\nJayson Tatum put the Boston Celtics on his bag and grabbed the 7th seed in the Eastern Conference behind a 50-point effort against Russell Westbrook and the Washington Wizards. https://t.co/8XfDD0kypv",
    "114": "Washington Wizards vs Charlotte Hornets 11/17/2021 Picks Predictions Previews\n\nhttps://t.co/Du9mnTL8BJ\n\n#NBAprediction #NBAparlay #NBAbetting #NBAbettingpicks #NBA #NBApicks #sportspicks #expertpicks #freepicks #odds #picks #sportsbetting #basketballpicks #Wizards #Hornets https://t.co/fVxk46ahlR",
    "115": "🏀Washington Wizards #DCAboveAll vs Charlotte Hornets #AllFly⌚️7PM 🖥Bally Sports SouthEast #NBA75 #NBA https://t.co/pGnSAlVs9u",
    "116": "NBA Tonight - Early\n\nWashington to beat Charlotte - 2.00\nPacers to beat Pistons - 1.40\nCeltics to beat Atlanta - 2.55\n\nTreble pays 15/2\n\nBet on https://t.co/Tss3gzMqEN\n\n#Basketball #NBA #GamblingTwitter #Freepicks #Tips #Celtics @AfribetNigeria #Wizards #Hornets #Pacers #Celtics https://t.co/xD0MCmdo9J",
    "117": "🚨the 1st place washington wizards play basketball tonight🚨",
    "118": "▶️https://t.co/U1lgtQSBz4◀️ Coming Live:\n#NBAseason \n#CharlotteHornets vs. #WashingtonWizards\n#DetroitPistons vs. #IndianaPacers",
    "119": "“The East leading Washington Wizards”\n“Bulls in second”\n\nwow I know it’s early but wow https://t.co/48TWQMZEt3",
    "120": "⛹️‍♂️NBA --  Charlotte Hornets vs Washington Wizards\n\n🏀Play Time: 11/17/2021 20:00 (GMT-4)\n\n📣Prediction: Washington Wizards to Win\n\n👇Click here 2 view more\n\nhttps://t.co/82RgRz9Oi3\n\n#WASvsCHA #Hornets #Wizards #NBA #NBA75 #NBAPicks #NBATwitter #ThatsGame #NBAECF #NBAWCF https://t.co/J2E9Pfc5yC",
    "121": "Wizards “fans” only show out when they’re really doing good or when the big teams are here. It may seem packed because they get loud and it’s not just the Wizards… I think the Caps are the only team in Washington that doesn’t have this problem. https://t.co/fannhJdDc6",
    "122": "NBA Day 3️⃣0️⃣ 🏀🏀🏀\nIndiana Pacers vs Detroit Pistons\nWashington Wizards vs Charlotte Hornets\nLos Angeles Lakers vs Milwaukee Bucks\nBoston Celtics vs Atlanta Hawks\nNew Orleans Pelicans vs Miami Heat\nCleveland Cavs vs Brooklyn Nets\nOrlando Magic vs New York Knicks",
    "123": "#Hornets gameday 🐝\n\n🏀 vs. Washington Wizards  \n📍- Spectrum Center \n⏰- 7:00 PM\n\n#AllFly https://t.co/GWPdrHpunx",
    "124": "Washington Wizards @ Charlotte Hornets\n\nhttps://t.co/IJc6doE0kQ",
    "125": "@ColinCowherd @JoyTaylorTalks I think your take on Russell Westbrook is spot on. You don’t have to look any further than the results of the #WashingtonWizards so far this year. #TheHerd",
    "126": "This week @Liam_Santa is joined on The Huddle podcast by NBL legend and now Washington Wizards scout Mark Worthington (@mwortho33) to break down the #NBLBlitz so far 🎧\n\nhttps://t.co/UagHEb9eP5",
    "127": "/r/CharlotteHornets: Charlotte Hornets vs Washington Wizards [11/17/21 - 7:00 PM ET] #AllFly https://t.co/erSpw2gIcG",
    "128": "Washington Wizards (MBA)superstar Bradley Beal WILL NOT GET THE VACCINE https://t.co/YtyxHOcuyD",
    "129": "Washington Wizards vs. Charlotte Hornets - 11/17/2021 Free Pick &amp; NBA Betting Prediction https://t.co/CK4mL3cdyD\n.\n#Betting #FreePicks https://t.co/TQlIdyiKZi",
    "130": "Washington Wizards:",
    "131": "The Whiteboard: Is the Washington Wizards’ defense for real? #FanSided #NBA https://t.co/e4NCJ7LVwW",
    "132": "@DisTrackers @DisTrackers —-&gt;I guess if we’re doing all stages🏀.UNC days ✅, Rookie/Early years✅, All Stars✅, USA Olympics ✅, NBA Pre-Leave✅, MJ Baseball (Barons)⭕️, NBA Return W/ # 45✅, Space Jam ⭕️, Washington Wizards Player/Owner ⭕️, Retiree/Golfer MJ ⭕️, MJ 09 HOF speech (Cry) ⭕️ https://t.co/RMbSLayXTO",
    "133": "@bandito_1914 Yeah, Bamba’s a great rim protector but he gets killed too often in one on ones. The Washington and Atlanta game definitely undid some of the praise for improvements he made as he just got resoundingly killed in both games despite the monster stats against the Wizards.",
    "134": "Wait a fuckin min the WASHINGTON WIZARDS are the number 1 team in the East https://t.co/uUPTO2VE8v",
    "135": "NBA: 'Jewish Jordan' Hails Wizards Star For Stepping Up Game For Washington https://t.co/Ht8myBvZ7Y",
    "136": "Heels win, washington football team and wizards win...might have to hit the streets this week and celebrate 😂😭",
    "137": "@MikeWiseguy Do you think the Washington Wizards will win 50 games this year?",
    "138": "How the Washington Wizards seem to be, quite literally, breaking the NBA 🤐\n\nhttps://t.co/ygMXNAFdo6 https://t.co/msYSh7O25Y",
    "139": "@_irey___ I only root for the Washington Wizards, Washington Go-Go's (when I ever see them on TV), and the Washington Kastles (when I get free tickets about every 5 years 😭) any more.\n\nMiddle finger to the racist's football team that took lifetimes to change their name.",
    "140": "@TheHobby247 2021 Toronto Raptors Lot $25 OBO\n2021 Utah Jazz Lot $35 OBO\n2021 Washington Wizards Lot $25 OBO https://t.co/woKdtjbNxr",
    "141": "@Itsamichael @warriors They don’t play the Wizards until March, will Washington still be the top team in the East? 🤷🏽‍♂️",
    "142": "First Gil and now John, wanna get paid come to the Washington Wizards! https://t.co/oI2rHr2wZB",
    "143": "@jadande Are the Washington Wizards the real deal?",
    "144": "@stephenasmith @FirstTake @BrooklynNets @StephenCurry30 You finally gonna acknowledge the “DAMN WASHINGTON WIZARDS!!!!”",
    "145": "@Sunny1Singh_ KD will push for a trade to the Washington Bullets... I know it's the Wizards but I still call them the Bullets.",
    "146": "#youtube Brandon Ingram EXPLAINS why the New Orleans Pelicans LOST to the Washington Wizards https://t.co/kTDapVX8jA",
    "147": "* Washington Wizards https://t.co/Ang1DVtUgv",
    "148": "Kyle Kuzma on playing for the Wizards: “This is kind of what I wanted. An opportunity to not be in someone’s shadows” #KyleKuzma #LosAngelesLakers #WashingtonWizards https://t.co/GcYjO1Xd9W",
    "149": "No wonder why Washington Wizards are leading in the East. Wtf is this??",
    "150": "Hey!!  Where the #WashingtonWizards new city edition jerseys at?  They sold out already? We need more!  More I say!! #cityedition #NBA #NBA75",
    "151": "Wizards at Hornets preview: Washington to start two-game road trip in Charlotte https://t.co/GYQZOUU3ZI",
    "152": "I’ve been a Washington wizards fan since i was young. I’ve watched Chris Webber, Michael Jordan, Gilbert arenas, Caron Butler and more. The hiring of Wes Unseld Jr with the move Tommy Shepherd made to flip Westbrook for the pieces he did, it’s great seeing this team as",
    "153": "The East is much tougher than the West — for the first time in eons. And that, + the fact they’re missing two starters, + the ACTUAL RECORD, means this needs revising:\n\n1. Washington Wizards\n2-30. Everyone else https://t.co/nnffY4XYfa",
    "154": "Girl is it Washington bullets or wizards Chile.",
    "155": "The last time I went to an NBA basketball game, it was a Washington Bullets game and \nChris Webber\nJuwan Howard\nRod Strickland\nCalbert Cheaney\nGeorge Muresan\n\nWere in the starting lineup #Wizards #NBA",
    "156": "Is the Washington Wizards defense just a fluke?\n\n✍️: @HickoryHigh \nhttps://t.co/b7FPkI6WUu",
    "157": "WASHINGTON WIZARDS DEF NEW ORLEAN PELICANS 105-100 KCP AND KUZMA CLUTCH https://t.co/Zf9CxhaJ7U via @YouTube",
    "158": "Wizards announce star Bradley Beal available vs. Hornets #BradleyBeal #WashingtonWizards https://t.co/kfblHUFgfX",
    "159": "I’m surprised the 10-3 Wizards haven’t sold out any games yet. Hope that changes soon. #DCAboveAll  #WashingtonWizards"
}