{
    "0": "That @SacramentoKings team is soft Dfox been out almost a week for a sore left ankle bruhhhh what",
    "1": "@SacramentoKings I’m gonna check the score around 5:20, just don’t be down by 10+ is all I ask",
    "2": "@SacramentoKings @Verizon @TyHaliburton22 @hoopculture13 @hbarnes @MB3FIVE @Rich_Holmes22 Member all the great memes? I member 😔",
    "3": "Donte stock rising .@SacramentoKings ??",
    "4": "Time for the @ATLHawks make statement and this 5 game home stand against the @SacramentoKings @celtics @Lakers @Raptors &amp; @Suns  #TrueToAtlanta #AtlantaHawksBasketball",
    "5": "@RealEddyParera @James_HamNBA @SacramentoKings Exactly, no changes 🤷😬",
    "6": "@James_HamNBA @SacramentoKings Davion starting https://t.co/gT6gChJxBi",
    "7": "@kingsfan42700 @BushwickSick718 @ToddyWoddy1330 @SacramentoKings Oo if they get fox I believe they gotta get rid of randle idk man randle has talent but I just see him as a solid third option if that",
    "8": "@flanconapucara @James_HamNBA @SacramentoKings What changes? It's Davion filling in TD spot.",
    "9": "My night with my kid. Hawks vs Sacramento Kings at State Farm Arena. #TrueToAtlanta https://t.co/CNPDc43f1g",
    "10": "@SacramentoKings If you had to choose one which one would you choose?? 👀👀 https://t.co/QkKJBRFaFK",
    "11": "@James_HamNBA @SacramentoKings Play Neemy",
    "12": "NBA Basketball Game Betting Picks Simulator: 7:40 PM ET - Sacramento Kings vs. Atlanta Hawks - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/oVmNGZKtu9 #nba #sportsbetting #freepicks #cappertek",
    "13": "@James_HamNBA @SacramentoKings Wow! So, they needed to take an epic beat, to finally make some changes... uh oh, they didn't.",
    "14": "The @SacramentoKings starting Haliburton, Mitchell, Barnes, Bagley, Holmes on Wednesday. #SacramentoProud #NBA",
    "15": "@SacramentoKings vs @ATLHawks \n\n-8 to -11 shesssshhh obviously fox isn’t playing. \n\n95 % on the -11 \n\n96 % on the under 233 opening to now 228. \n\nREFS \nTyler Ford 207.8 PPG \nLauren Holtkamp 208 PPG \nEvan Scott 219.4 PPG",
    "16": "@SacramentoKings @Verizon @TyHaliburton22 @hoopculture13 @hbarnes @MB3FIVE @Rich_Holmes22 Buddy? 🥴",
    "17": "@SacramentoKings @Verizon @TyHaliburton22 @hoopculture13 @hbarnes @MB3FIVE @Rich_Holmes22 A Back to Back now? https://t.co/DWiasHxkpW",
    "18": "January 19, 2006- @lakers @KobeBryant scores 51 points vs @SacramentoKings #VenusRetrograde https://t.co/MH0eodEsgZ",
    "19": "March 24, 2001 - Los Angeles @Lakers at @SacramentoKings #VenusRetrograde   https://t.co/8QCuvbXYKi",
    "20": "@SacramentoKings need to go ALL IN for Kyrie ASAP. Kyrie has the ability and talent to save the Kings franchise. \nHe would be in Cali big chillin\nCompeting with the likes Curry, Lebron , Lillard, Ja, and CP3. \nWe just need the stars to play. That’s what makes the NBA so great",
    "21": "Desensitized to Ls as a longtime @SacramentoKings fan and as an investor in 2022.",
    "22": "Sacramento Kings Starting Lineup 1/26\n PG: Tyrese Haliburton\n SG: Davion Mitchell\n SF: Harrison Barnes\n PF: Marvin Bagley III\n C: Richaun Holmes\nhttps://t.co/o75oZ8vnE8",
    "23": "@SacramentoKings @Verizon @TyHaliburton22 @hoopculture13 @hbarnes @MB3FIVE @Rich_Holmes22 Did we win last nights game",
    "24": "Always rooting for a @SacramentoKings win, but it becomes more enjoyable when you know at least a loss gets you one step closer to @ChetHolmgren",
    "25": "Sacramento Kings (+10.5) @ Atlanta Hawks #TrueToAtlanta #SacramentoProud #NBA #NBATwitter #NBA75",
    "26": "@SacramentoKings @Verizon @TyHaliburton22 @hoopculture13 @hbarnes @MB3FIVE @Rich_Holmes22 put neemias",
    "27": "Kings G Terence Davis out indefinitely with wrist injury #Sacramento #Kings #NBA https://t.co/8BgOLu1ZAV",
    "28": "Ok @SacramentoKings fam do we lose by Less or more than 20?",
    "29": "De'Aaron Fox is out for the Kings tonight.\nDavion Mitchell, who has a lot of people up here from Savannah and Liberty County tonight, is starting for Sacramento.",
    "30": "@SacramentoKings @Verizon @TyHaliburton22 @hoopculture13 @hbarnes @MB3FIVE @Rich_Holmes22 What was the final score of last night u never tweeted it out",
    "31": "@SacramentoKings @Verizon @TyHaliburton22 @hoopculture13 @hbarnes @MB3FIVE @Rich_Holmes22 Let’s go king!!!! Get this dub today boyz!!! #SacramentoProud #GoKings",
    "32": "@KingzMemez @SacramentoKings @Verizon @TyHaliburton22 @hoopculture13 @hbarnes @MB3FIVE @Rich_Holmes22 Yea, they should only lose by 30 today",
    "33": "@SacramentoKings @Verizon @TyHaliburton22 @hoopculture13 @hbarnes @MB3FIVE @Rich_Holmes22 Score more than 30 points in the first half, please.",
    "34": "@KingzMemez @SacramentoKings @Verizon @TyHaliburton22 @hoopculture13 @hbarnes @MB3FIVE @Rich_Holmes22 Yep. “We trail by 45 at half time”",
    "35": "@SacramentoKings @Verizon @TyHaliburton22 @hoopculture13 @hbarnes @MB3FIVE @Rich_Holmes22 Y’all gonna actually tweet during the game?",
    "36": "ATLANTA (AP) — Sacramento Kings guard Terence Davis will be out indefinitely after injuring his right wrist in Tuesday night's loss to the Boston Celtics. https://t.co/5Oo7bKaTDQ",
    "37": "@James_HamNBA @SacramentoKings Let’s go! This is a lineup that can win as we’ve seen time and again. Just keep doing the same thing and surely it’ll all work out! @SacramentoKings",
    "38": "@BrickhouseIND @James_HamNBA @SacramentoKings Hahaha",
    "39": "@chrisovega @James_HamNBA @SacramentoKings Never",
    "40": "@James_HamNBA @SacramentoKings When is fox coming back?",
    "41": "Sacramento Kings Starters:\n\nTyrese Haliburton\nDavion Mitchell\nHarrison Barnes\nMarvin Bagley\nRichaun Holmes\n\nPlayers out:\nTerence Davis\nDe'Aaron Fox\nChimezie Metu\n#SacramentoProud #NBA #NBATwitter #NBA75",
    "42": "@flyboiiant23 @BushwickSick718 @ToddyWoddy1330 @SacramentoKings Im not sure Randle moves the needle. He's a nice player. Fox is also a nice player. They both have unrealized potential Knicks fans probably thought was coming out last yr. Fox becoming a superstar wouldnt shock me. Tough decisions ahead.",
    "43": "Tonight's starting lineup for the Sacramento Kings: Haliburton, Mitchell, Barnes, Bagley, Holmes https://t.co/bVWH4AMCA2",
    "44": "Game night in Atlanta! \n\nOur @ATLHawks host the Sacramento Kings this evening https://t.co/DMyilMOBk8",
    "45": "@KarmeleonsNFT @TyHaliburton22 @SacramentoKings @NBA Cmon, check this out @TyHaliburton22! 🦎🔥",
    "46": "@kingsfan42700 @BushwickSick718 @ToddyWoddy1330 @SacramentoKings Believe it or not I don’t even think we need him to be the guy, the numbers he put up in Sacramento would make him the best guard the Knicks had since the 90’s if he was to be traded there lol",
    "47": "@SacramentoKings Damn",
    "48": "@flyboiiant23 @BushwickSick718 @ToddyWoddy1330 @SacramentoKings Fox may or may not be special. He is a very good player. I'm not sure if he will become a superstar. He does have all the tools to do so. His FT shooting has improved. 3pt shooting has regressed. He's still a great player not sure if he becomes THE GUY though.",
    "49": "@SacramentoKings @swipathefox @socios NFTs are like Monte Mcnair.\n\nYou pay a lot of money for absolutely nothing.",
    "50": "After posting only 75 points Tuesday, the Kings travel to State Farm Arena in Atlanta.\n\nThe Hawks have won 4 in a row, but remain 4 games below .500.\n\nSacramento is in the midst of a 9-game road losing streak.\n\nTipoff 7:30pm ET\n\nOur Image of the Day\n👇\nhttps://t.co/V0CCLj6Pgu https://t.co/Gy7hKKlxT1",
    "51": "@biggsnuggs Here ya go @SacramentoKings https://t.co/dzgQnkEOZn",
    "52": "Jayson Tatum *36-4-6* and the Boston Celtics beat Buddy Hield *11-5-1* and the Sacramento Kings 128-75 (2022-01-25)",
    "53": "@MarcosBreton @SacramentoKings I know they don't have the talent that some other teams have. I also know they do indeed have playoff-caliber talent on the roster right now. Something else is missing; a new face might not be the solution to current problems.",
    "54": "@MarcosBreton @SacramentoKings Bring back the WNBA Monarchs- at least they had heart.",
    "55": "Since Twitter's launch in July 2006, the Sacramento Kings have appeared in 0 playoff games",
    "56": "@GregDustcloud @SacramentoKings @swipathefox @socios Wow, that looks so good.",
    "57": "Congratulations to Boomboomjr who moved up 1 spot to take #5 on the Sacramento Kings team leaderboard.\n\nhttps://t.co/WHnq2718B3",
    "58": "@SacramentoKings oh we lost\nwe just lost",
    "59": "The Sacramento Kings reached a new low last night by losing to the Boston Celtics by 53 points. They play again tonight and it's the second of a back-to-back so I wouldn't be surprised if they lose by 106! #sackingssuck",
    "60": "@kingsfan42700 @BushwickSick718 @ToddyWoddy1330 @SacramentoKings Yes this is why I would rather see fox more then tyrese on the Knicks. I feel like he has the it factor as well and it would probably be a better fit",
    "61": "The Sacramento Kings aren’t tanking. They’re just a bad team, and Monte McNair needs to treat them as one. \n\nMy latest for @thekingsherald on the warped concept of tanking, rushed rebuilds, and why (this time) a reset in Sacramento may not take that long. https://t.co/Eo9AUInIZB",
    "62": "Sacramento Kings guard Terence Davis out with wrist injury: https://t.co/wHARZpEezc",
    "63": "Well damn... the Sacramento Kings definitely had a tough loss yesterday...even more important than ever when they get back from this away game stretch we get to Golden 1 Center and root them to a W!  Got your shot at free tickets around 4:30p on @1025KSFM  https://t.co/wVtM0o8Pbo",
    "64": "LeBron leave Austin alone the Laker fans would like to have somebody on the Los Angeles Lakers after you leave not sure why you took Westbrook over BUDDY HEID FROM THE SACRAMENTO KINGS THAT'S HOW LAKER FANS IS LOOKING AT YOU",
    "65": "@stephenasmith What trade would work for the  Sacramento kings?",
    "66": "To win 1 unit \n\nSacramento Kings +10 -110\n\nNuggets -2 -120",
    "67": "I never did like Buddy in Sacramento bey lol. When he was in NO the Pelicans twitter was repping The Bahamas dead hard.. but look at the Kings, they still ignoring us to this day 😂",
    "68": "I official retired as a Sacramento kings fan",
    "69": "@SacramentoKings @swipathefox @socios @SwipaTheFoxNFT of course 🤷🏻‍♂️🔥",
    "70": "@SacramentoKings Forfeit the rest of the season.",
    "71": "@SacramentoKings Oh god we are finished",
    "72": "Sacramento Kings vs. Atlanta Hawks - USA: NBA -  at 07:30 PM, January 26, 2022\n🔴 Link for this Match 👉 https://t.co/dWAshm8nFC\nPlease watch this match online it will be even better. https://t.co/lRuxgUG5aW",
    "73": "@MajesticMaxwel @SacramentoKings It’s been a rocky season, those lows are REALLY low 😭",
    "74": "@aaronbruski Brutal honesty along with competent management is the only way out. This team hasn’t had either in years. #basketball #sacramentokings #nba #nbatwitter",
    "75": "Sacramento Kings vs Atlanta Hawks NBA Basketball Prediction, Odds and Betting Tips 26/01/2022 https://t.co/wbHj0bwbuN via @YouTube #NBA #NBAPick #NBAPredictions #NBAOdds #Pickdawgz #Hawks #Kings #SacramentoProud #TrueToAtlanta #HawksVsKings",
    "76": "@SacramentoKings @swipathefox @socios Why is Robert Woodard still on the Kings ? He is awful anytime he plays. He should be gone yesterday",
    "77": "Sacramento Kings guard Terence Davis is out indefinitely due to a tendon injury in his right wrist. https://t.co/W57L6CobPp",
    "78": "The @NBA is so trash 🗑…can’t believe people still watch regular season the @SacramentoKings loss by 53 last night and the @WashWizards were up 35 points and LOSS….the @NBA is a joke (don’t forget the @okcthunder lost by 73 earlier this season)",
    "79": "Why You Cannot Withhold Payments from Employees https://t.co/C1nrJuUAZK \nI will come after anyone who try this with me.\nThe last employer said was threating. Because they violated by withholding me Check.   \nBurger King Freeport Blvd Sacramento California",
    "80": "Cleveland Cavaliers - Milwaukee Bucks\nAtlanta Hawks - Sacramento Kings\n\nBet slip link: https://t.co/S0e3LSyi3n https://t.co/sb63AiS7Pz",
    "81": "@PrimeWaller @thatdudekb @Gardas111 @SacramentoKings I get where you’re coming from and definitely not trying to argue. But the Warriors were by every measure a historically bad franchise before Steph.",
    "82": "@SacramentoKings getting a segment on PTI @espn for being terrible #kangz",
    "83": "Yo fr tho … the @celtics smacked @SacramentoKings around , how you get smoked by over 50 ?!! Wtf , aye low key if y’all need a locker room motivated… holla at me. Guarantee your next loss won’t be by 50 +",
    "84": "Per @betqlapp, heavy sharp action has driven the Hawks from -7.5 to -10 against the Kings tonight. Recency bias? Not? I don't really care- still comfortable with backing Atlanta in this spot. Sacramento is in a free-fall right now.\n#GamblingTwitter #BettingTwitter #NBA #NBAPicks https://t.co/E4fDnFzEEP",
    "85": "Congratulations to JNSVL who moved up 2 spots to take #4 on the Sacramento Kings team leaderboard.\n\nhttps://t.co/WHnq2718B3",
    "86": "@PeachSports_IE @ATLHawks @SacramentoKings When you're a team who's HUNGRY for a win, LOOK OUT!!! #SacramentoProud #Sacramento",
    "87": "We lost by 58 pts and nobody got fired  #Kangz we gotta do better @SacramentoKings",
    "88": "@SacramentoKings @swipathefox @socios NFTs alllll day.  Whose ankles am I breakin?! https://t.co/WekcQwPspC",
    "89": "@JTH__ In fairness. Us Kings fans could have told them that this is just how it goes in Sacramento",
    "90": "Congratulations to Dizzzler and Boomboomjr who moved up to take #4 and #5 on the Sacramento Kings team leaderboard.\n\nhttps://t.co/WHnq2718B3",
    "91": "@cwebstrong @SacramentoKings @swipathefox @socios @AaronRodgers12 Nope! Don’t like that guy",
    "92": "@SacramentoKings You know it's bad when the team posts an apology instead of the final score",
    "93": "@YunaOpinions @SacramentoKings @swipathefox @socios I can get @AaronRodgers12 to",
    "94": "Sacramento Kings vs Atlanta Hawks Free Prediction – 01/26 | NBA Expert Picks\n\nhttps://t.co/L1YO4MmKOC\n\n#gamblingtwitter #bettingpicks #sportspicks #freepicks #freepredictions #freetips #expertpicks #bettingexpert #sportsbetting #bet #betting #gambling",
    "95": "New post: \"Cappers Picks • PITBULL BARKING NBA\" Sacramento Kings +8 -110 Atlanta Hawks (7:40 PM)\nNew York Knicks +6.5 -110 Miami Heat (7:40 PM)\nToronto Raptors vs Chicago Bulls OVER 218.5 -110 (8:10 PM)\n\nStatistics: Posted by pitbull6 — Wed Jan 26, 2… https://t.co/sxD35NtGIs",
    "96": "@MirannLolani The Sacramento Kings saving the world while continuing to go 31-51 every year would be the most hilarious of outcomes.\n\nWorld Peace and the 8th pick in perpetuity.",
    "97": "Do you recognize the @SacramentoKings as a young baller⁉  \n\nTake a GUESS in the comments below ⬇ ⬇ ⬇ https://t.co/WLpDEF136T",
    "98": "@CrownDowntown Kings are a terrible organization and the arena downtown is an eyesore and plague on traffic. Taxpayer money wasted that could have gone toward better civic minded projects. Should have let the billionaires fund their own oasis outside of Sacramento.",
    "99": "#564 Rich@un H0lme$ - Sacramento Kings. 2021/2022 Season. 1/1. \nProject for basketball fans. Hurry up to collect your favorite players🏀\n@opensea \n\nDiscord: https://t.co/K1HDwaOeav.\nOpenSea: https://t.co/pOeK7CSiMq\n\n#NFT #nftnba #NBATopShot #NFTs https://t.co/4Nb5UVkFFt",
    "100": "@SacramentoKings @swipathefox @socios All that losing has gotten to their heads….",
    "101": "@kingsfan42700 @BushwickSick718 @flyboiiant23 @ToddyWoddy1330 @SacramentoKings Facts very well put",
    "102": "@SacramentoKings @swipathefox @socios Basketball???",
    "103": "@JillAdge Usually there's a bit of excitement when the celtics beat the kings. I get bragging rights over my friends until the next time.  \nThis game? Haven't said a word about it until now. \nJust disgraceful and disappointed for Sacramento.",
    "104": "@granthpaulsen @funnydanny I know what @whoisjwright said about Minnesota, but I don't completely write off Redwolves. NY/Winnipeg Jets, NY/SF Giants, Carolina/Florida Panthers, St Louis/Arizona Cardinals, Sacramento/LA Kings just to name a few. There's already precedence. 🤷🏾‍♂️",
    "105": "@TimMaxwell22 You mean the Kings firing their coach did not make the team better? Hard to believe. (In fact, the team may have gotten worse). #nba #NBATwitter #basketball #sacramentokings",
    "106": "Dear @SacramentoKings, do what you must do to bring change to your city immediately. \n\n-Philadelphia",
    "107": "The Sacramento Kings are TERRIBLE https://t.co/29dZt4VMy0 via @YouTube",
    "108": "@SacramentoKings @swipathefox @socios Will either win games?",
    "109": "What’s the worst franchise in American sports? I gotta go w the Sacramento kings",
    "110": "Tatum, Brown lead Celtics in 128-75 laugher over Kings - Kings finish a back-to-back with a visit to Atlanta on Wednesday night. #SacramentoKings #BostonCeltics #Kings #AtlantaHawks https://t.co/cdHNyDoLHP",
    "111": "@SacramentoKings @swipathefox @socios Who's running this social media?",
    "112": "@SacramentoKings @swipathefox @socios To be a Pacer",
    "113": "📈Capela's minutes are going up, and he faces Sacramento Kings who just gave up 17 rebounds to Robert Williams. For those reasons, @dailydogsports is on the ATL center tonight. \n\n#Draftkings #Fanduel https://t.co/IMOfyMUELw",
    "114": "\"Kobe says his favorite arena to play in besides Staples and MSG is ARCO in Sacramento …\"\n\nhttps://t.co/Biqar6vPRJ\n\n[via r/kings Jan 26, 2014 #Kings]",
    "115": "@SacramentoKings @swipathefox @socios we lost by 53 points yesterday",
    "116": "@SacramentoKings @swipathefox @socios When you don’t have any basketball related things to tweet…",
    "117": "@SpaceRunnersNFT @BrooklynNets @SacramentoKings The Brooklyn Nets actually shouldn't be worried about losing right now in fact they should think about just coming in at #5 IN there conference So Kyrie Irving can play four out of the seven game series instead of three",
    "118": "The LAST thing i want for Jaden Ivy is the Sacramento kings.",
    "119": "@SacramentoKings @swipathefox @socios ratio https://t.co/Ax0W828OgQ",
    "120": "@SacramentoKings @swipathefox @socios pls stop this cringe im serious",
    "121": "@SacramentoKings @swipathefox @socios Hey @SacramentoKings, my 7 year old son (he/him) is a HUGE fan! He’s on the fence of getting vaccinated.. I’m doing my best to persuade him, could I get a statement of encouragement from his favorite team to do so!? 😊",
    "122": "@SacramentoKings @swipathefox @socios @SwipaTheFoxNFT let em know!!!",
    "123": "@SacramentoKings @swipathefox @socios NFT's are a fucking scam that also destroy the environment and y'all are absolutely insane to equate them with actual art.    \n\nWe may suck on the court but it pales in comparison to how much we suck off the court.",
    "124": "@SacramentoKings @swipathefox @socios To be traded still y’all deleted that last one lmaoo",
    "125": "@SacramentoKings @swipathefox @socios A winning team is probably the preferred option",
    "126": "@SacramentoKings @swipathefox @socios Stop tweeting this we are FINISHED",
    "127": "@SacramentoKings @swipathefox @socios What the fuck",
    "128": "@Kings_Insight @SacramentoKings @swipathefox @socios lmao fr though",
    "129": "@SpaceRunnersNFT @BrooklynNets @SacramentoKings go runners!",
    "130": "@SacramentoKings @swipathefox @SociosHoops He chose:\n\n-fire Monte McNair\n- another coach\n-build a winning culture in Sacramento",
    "131": "@ToddyWoddy1330 As a life long Sacramento Kings fan I love it! Makes all the sense in the world to get Randle in this buy low scenario!",
    "132": "@SacramentoKings YOU STILL HAVEN’T TWEETED THE FINAL SCORE HAVE SOME SHAME",
    "133": "#Hawks will host the Sacramento #Kings at State Fram Arena, who do you think will win this game? According to our partner https://t.co/cAQ1KRAypV the pick Hawks -450 Kings +350\n\n#NBA #NBATwitter #NBAPicks #NBA75 #NBA2K22 #Sports #Preview https://t.co/fzhAYtPzCr",
    "134": "@SacramentoKings @swipathefox @SociosHoops 60 point blow out",
    "135": "@SacramentoKings @swipathefox @SociosHoops Follow back admin. How about a free jersey? \nhttps://t.co/fz9ypQUSHM",
    "136": "The @ATLHawks play tonight at 7:30 against the @SacramentoKings. Let’s get this win and keep the ball rolling! #NBA #Hawks #ATL",
    "137": "@SacramentoKings @swipathefox @SociosHoops follow back admin",
    "138": "@SpaceRunnersNFT @BrooklynNets @SacramentoKings Let's go! So glad I'm holding",
    "139": "@SacramentoKings @swipathefox @SociosHoops He’d probably just choose another team",
    "140": "@SacramentoKings @swipathefox @SociosHoops Not being perpetually 1-2 seeds out of the playoffs. (or play-in)",
    "141": "@MarcosBreton @SacramentoKings I’ve been a fan since they moved into town. And this is by far the worst team we have had. It’s not even close. They are talented, but don’t work together. A trade is coming and hopefully it’s a big trade.",
    "142": "@SacramentoKings @swipathefox @SociosHoops he loves nfts @SwipaTheFoxNFT",
    "143": "@SacramentoKings @swipathefox @SociosHoops He would choose to be traded what is wrong with this stupid franchise",
    "144": "@SacramentoKings @swipathefox @SociosHoops We just lost by 50, I know ur doing ur job but it's not really the time",
    "145": "@Ic3yHurts @SacramentoKings @swipathefox @SociosHoops Wont downgrade",
    "146": "@SacramentoKings @swipathefox @SociosHoops NFTs are like Monte Mcnair.\n\nYou pay a lot of money for absolutely nothing.",
    "147": "@SacramentoKings @swipathefox @SociosHoops art surely",
    "148": "Sacramento Kings visits Atlanta Hawks Predictions and Preview for 1/26/2022 today.  Who are we taking in this game?  Find out now. #NBATwitter #Sportsbook https://t.co/OOtGPRjl0I",
    "149": "@SacramentoKings @swipathefox @SociosHoops What is this tweet",
    "150": "@SacramentoKings @swipathefox @SociosHoops he would choose to be apart of the Philadelphia 76ers along with Tyrese Halliburton",
    "151": "@SacramentoKings @swipathefox @SociosHoops He would probably choose to be traded",
    "152": "Game 50 of the Sacramento Kings baby!!! https://t.co/NAVA4LVBkA",
    "153": "@CWilliamson44 i lost that happiness a long time ago ima Sacramento Kings/Dallas Cowboys fan....now im just surviving",
    "154": "@SacramentoKings @CoorsLight Cold hard fact: FANS WANT SOME CHAMPIONSHIPS",
    "155": "Atlanta Hawks Predictions and Preview for 1/26/2022 hosts Sacramento Kings.  Find out who we are taking in this matchup. #NBATwitter #Sportsbook https://t.co/OOtGPRjl0I",
    "156": "@SkeeProfit @TROTWAM Sacramento kings",
    "157": "@DPresgoatt @SacramentoKings Gots to! Got some nice tricks up my sleeves",
    "158": "@Ironman3319 @SacramentoKings For the brand cuzzo",
    "159": "@dontRidetooHard @SacramentoKings @CoorsLight Soon bro after the surgery I'll be back better than ever😤🥱",
    "160": "@illini3 @barstoolchicago that would be the sacramento kings",
    "161": "@BeterNBAFan @thatdudekb @Gardas111 @SacramentoKings the kings had a generational talent like demarcus cousins n still failed him and they doin the same with fox taking people like bagley over luka they deadass can’t draft for nothing. warriors were smart with their picks atleast",
    "162": "10-game Wednesday night 🏀\n\n▪️ #1 in the East Miami Heat take on New York Knicks \n▪️ Atlanta Hawks seek 5th straight win, host Sacramento Kings \n▪️ Nikola Jokic coming off 28 PTS, 21 REB, 9 AST last night, Denver Nuggets visit Brooklyn Nets\n▪️ Phoenix Suns seek 8th straight win, https://t.co/4aYcH0mrI5",
    "163": "4 takeaways from the Boston Celtics 128-75 rout of the Sacramento Kings\nhttps://t.co/oCiYyk3TIj",
    "164": "@askari_66 @AJMacias05 @GPTSal21 @kro_141 @adamsan751 @trapsojames @SacramentoKings I once stole a cowbell from a diary in Fresno on my way to the kings game! REAL ONE!",
    "165": "@SacramentoKings @CoorsLight Ready to another embarrassing loss 🖐🏼😢😢",
    "166": "@C_Salazarr5 @AJMacias05 @GPTSal21 @kro_141 @adamsan751 @trapsojames @SacramentoKings He a real fan! @SacramentoKings should hook us all up with tickets 😂",
    "167": "@SacramentoKings @CoorsLight Cold Hard Fact: The Sacramento Kings are a professional basketball franchise in name only.",
    "168": "Thanks to @WillofThaPeople for the idea of Operation MCNAIR. Donating 10$ to a local organization after each @SacramentoKings loss. Today I donated to @Sacramento_Soup to account for the current 4 game losing streak. https://t.co/PzrKKQWm88 https://t.co/L7p7qLRUO9",
    "169": "De'Aaron Fox (ankle) is listed as questionable for the Kings tonight in Atlanta.\n\nChimezie Metu (knee) is also questionable, with Terence Davis (wrist) ruled out for Sacramento.",
    "170": "🔴[LIVE'STREAM] ~ Sacramento Kings vs Atlanta Hawks - NBA League 2022\n🔗 🔴Broadcast Link !! https://t.co/YYm6QkXmLr ✅\n📆 : On Wednesday. January 26 /2022\n⏰ : 7:30 PM",
    "171": "@AJMacias05 @GPTSal21 @askari_66 @kro_141 @adamsan751 @trapsojames Been riding, stilling riding baby @SacramentoKings ;)",
    "172": "@RALFPRESSINGRED @RonitaMcAfee @Frediculous @1783Amer1can @Charlie_Breeze @3rdstringW She gonna be the Sacramento kings if she keep this shit up lmao",
    "173": "Atlanta Hawks vs Sacramento Kings. WE BETTER WIN THIS GAME. https://t.co/daA0ao1ZFA SHOULD ... https://t.co/T8nQokvMwZ via @YouTube There is no way we should lose to a team on the 2nd of a back to back and just lost by FIFTY points last night. #hawks #nba #basketball #Atlanta",
    "174": "@KawhiSzn_ @SacramentoKings @CoorsLight Hey Kawhi when will u be back bro",
    "175": "Tyrese Hits the Eastbay Dunk During Practice #Sacramento #Kings #NBA https://t.co/EzpCDV0EQF",
    "176": "@DickCage69 @StoolGreenie I enjoy when the team plays to their potential against great teams. Not when it’s against the Sacramento Kings and Wizards. It’s 2 steps forward 1 step back wit this team. I’m not falling for it again. They will go on another losing streak again soon.",
    "177": "Shaq has owned the @SacramentoKings kings for the last 22 years. Even he said ✌️ out.",
    "178": "The 2021-22 Sacramento Kings season summarized in a single image. https://t.co/zCXjCTZUk2",
    "179": "@BushwickSick718 @flyboiiant23 @ToddyWoddy1330 @SacramentoKings He's also 24 and 12 w out Fox. And the offense runs more smoothly.",
    "180": "@HeuristicLineup May be skipping my first one in about forever. @Vivek @mmcnair @SacramentoKings",
    "181": "@edsparksjr @SacramentoKings @cavs @spurs @celtics @WashWizards @BrooklynNets Hopefully they do too 😭",
    "182": "@TyHaliburton22 @SacramentoKings You are the leader this franchise needs and I'm confident in your ability to help turn this franchise around. As a lifelong Kings fan, I appreciate you Tyrese!!",
    "183": "@mikeycanihan @SacramentoKings Thanks. I'm glad it wasn't too bad also.",
    "184": "The @SacramentoKings are only 3.5 games from having the best odds at winning the lottery. Hope springs eternal",
    "185": "@SpaceRunnersNFT @BrooklynNets @SacramentoKings Lez get it",
    "186": "We are the Sacramento Kings. \n\nKings have Fox who’s a 2nd option but think he’s a top dog. \n\nWe have Beal who’s a 2nd option but think he’s a top dog. Blow it up! #DCAboveAll https://t.co/C7Jkfj2XsH",
    "187": "Attention HAWKS fans:\nI’m giving away TWO 100-Level tickets for tonight’s game against the Sacramento Kings at 7:30 pm. $20 will be loaded on each ticket…to enter please RT + Like. #TrueToAtlanta #MambaDay I will pick the winner at 6:00 pm!",
    "188": "Live updates throughout the day on tonight’s NBA game between the Sacramento Kings and Atlanta Hawks at State Farm Arena https://t.co/NYTrOIwxPq",
    "189": "Live updates throughout the day on tonight’s NBA game between the Sacramento Kings and Atlanta Hawks at State Farm Arena https://t.co/jLXyKUmx78",
    "190": "free neemias queta from the shackles of the sacramento kings",
    "191": "Live updates throughout the day on tonight’s NBA game between the Sacramento Kings and Atlanta Hawks at State Farm Arena  https://t.co/mFrWQjSK1R",
    "192": "@AlisonB916 I understand, but the fans are walking out on the team.  The arena is frequently 1/3 to 1/2 empty.  If this continues, the team will be sold to an owner who moves the Kings out of Sacramento within 5 years.",
    "193": "@Gregory69644311 @MarcosBreton @SacramentoKings Need to check your range of years.",
    "194": "I didn't see it in '96 '97 with the Playoffs against the Jazz shooting airballs &amp; I rooted in '00 to '01 those Sacramento King teams. Kobe Earned &amp; Took your Respect if not the \"Greatest Champion in sports he for sure was the Greatest Competitor.\" ❤🏀🏆 https://t.co/YaEtTxEpPa",
    "195": "The Sacramento Kings haven't made the playoffs in 16 seasons and don't appear ready to break that streak anytime soon. https://t.co/ewmfFXPSmH",
    "196": "against the sacramento kings u know https://t.co/8rqPzSYmUX",
    "197": "@EriUriQ @SacramentoKings @CoorsLight not *yet*",
    "198": "25: Sacramento Kings https://t.co/BByd9H2anv",
    "199": "The basketball Gods whenever the Sacramento Kings have an ounce of positive momentum: https://t.co/yjb8tLaUaO",
    "200": "@AwesemoNBA The entire franchise is questionable.   For example, what is a team like the @SacramentoKings doing in the NBA?  Does anyone in the front office even hoop?  Why didn't they just leave when they had the chance?",
    "201": "@PatrickKilken55 @SacramentoKings I literally was screaming at the tv. Shit is fucking redic",
    "202": "Sacramento Kings and yeah https://t.co/duyEd2NgTh",
    "203": "WATCH: Boston's Jayson Tatum gets 36 points, 6 assists vs. Sacramento Kings in historic blowout #Boston #Celtics #NBA https://t.co/mmVEA3VL8K",
    "204": "Congratulations to J_Money_82 (@ScarCit06427004) who moved up 2 spots to take #9 on the Sacramento Kings team leaderboard.\n\nhttps://t.co/WHnq2718B3",
    "205": "Analyzing Wednesday’s Sacramento Kings at Atlanta Hawks odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/GX4Co2ISqC",
    "206": "The Sacramento Kings haven’t been to the playoffs since 2006… https://t.co/vatIN99pvJ",
    "207": "The Boston Celtics absolutely dismantled the Sacramento Kings last night. Not even a 50+ spread could help this bettor https://t.co/YKFoVW9nWE",
    "208": "WATCH: Boston’s Jayson Tatum gets 36 points, 6 assists vs. Sacramento Kings in historic blowout https://t.co/wyYrFj6aHK",
    "209": "This is completely unrelated &amp; at this point I would totally welcome this, but Kevin Feige &amp; the entire Marvel Studios crew would run the Sacramento Kings sooooooooooo much better than the current ownership &amp; front office.",
    "210": "is ben simmons a sacramento king yet?",
    "211": "Careful what all you wish for and wanting a new owner for the @SacramentoKings ... at this point it wouldn't take much for the next owner to move the team #SacramentoProud",
    "212": "@rbritoreis @celtics @nemi1599 @SacramentoKings Boas stats",
    "213": "Tell Vivek I hope the season ticket holders file a lawsuit for overpaying to watch the Sacramento Clowns @SacramentoKings",
    "214": "One more time @SacramentoKings trade Tyrese Haliburton to the @nyknicks for Obi Toppin and a pick. Make the draft right.",
    "215": "@DanielCThigpen @SacramentoKings Last night was pathetic.  I, too, have remained true watching and/or attending every single game since 2002.  The lack of effort and passion is so discouraging.  Not sure I’ll be tuning in anymore 😩",
    "216": "@SacramentoKings @CoorsLight What was the final score from last night's game?",
    "217": "@BushwickSick718 @flyboiiant23 @ToddyWoddy1330 @SacramentoKings thought Fox does too. Maybe he does and it will come out w a change of scenery. Our team has just been so disappointing.",
    "218": "@SpaceRunnersNFT @BrooklynNets @SacramentoKings Nice, this is an awesome giveaway. Talk about dope perks",
    "219": "@BushwickSick718 @flyboiiant23 @ToddyWoddy1330 @SacramentoKings have the luxury of waiting bc of our owner wanting to \"win.\" My preference is to keep Fox and get lucky in the draft and then remodel the rest of the roster, but we may make a trade bc of Vivek. Fox could very well be on the same level of Ja Morant. Ja has that \"it factor.\" We",
    "220": "@visorboy1974 @SacramentoKings Yeah got me an autographed Mitch and Jason Williams.",
    "221": "@SacramentoKings @CoorsLight Thats good news! Not a losing record at least!",
    "222": "@BushwickSick718 @flyboiiant23 @ToddyWoddy1330 @SacramentoKings Fox may become a superstar. He has that potential. Or he may be a fringe all star or all star. He can take over games. He's not selfish. For whatever reason the fit isnt there w Tyrese. I want it to work. If it was proven to work tomorrow I'd keep Fox. It's just that we dont",
    "223": "@SacramentoKings @CoorsLight Cold hard facts: \n\nThis team sucks",
    "224": "It looks like trimester titan Tristan Thompson may have been caught out of bounds…again! After the Sacramento Kings lost to the Milwaukee Bucks…  https://t.co/UHu1rlXjPW",
    "225": "@SacramentoKings @AlvinGentry Hield should be starting, move Barnes to 4 with 28-30 min for bagley off bench till he gets a bigger NBA body (still a young person) &amp; he can run with mitchell &amp; Davis",
    "226": "@MarcosBreton @SacramentoKings Especially since we started so well it gave us hope. We’re a bit like Charlie Brown. We’ll always try and kick that stupid ball with hopes of a different outcome 😕",
    "227": "Even though this season has been a disaster, Born and raised in the east bay of the Bay Area.. And I’ve been that suffering @SacramentoKings fan since I was 8 years old. 1985. I wanted to be different and this fan base made me the fan that I continue to be today. #Kings4Life",
    "228": "It only takes a spark to get a fire going! I got $5 on it 🤗 Buying  the Sacramento Kings from Vivek Ranadive https://t.co/fEwsqWG0IX",
    "229": "@MarcosBreton @SacramentoKings I remember as a kid circa 1992 or so and watching the Richmond, spud, wayman, Lionel, Walt, teams go out and win less than 30 games a year and this town savored every moment of it. We loved those guys. Same can’t be said for this team.",
    "230": "@BushwickSick718 @flyboiiant23 @ToddyWoddy1330 @SacramentoKings Tyrese averages 24ppg and 12 apg in games played without Fox. He is more assertive and his play is outstanding. These #'s are well above the season avg of 14/7. Roster balance is poor. Fox needs the ball &amp; Haliburton does too. We like Fox. We love Tyrese bc he makes others better",
    "231": "@SacramentoKings Many have tried… all have failed",
    "232": "@SacramentoKings fans, who was drafted after Mitchell can you guys say is better than Mitchell. Not \"can be\" but actually has shown to be?",
    "233": "Sacramento Kings vs. Atlanta Hawks - 1/26/2022 Free Pick &amp; NBA Betting Prediction https://t.co/qSQToZyRem\n.\n#Betting #FreePicks https://t.co/0JcdtEFAw8",
    "234": "Move the Sacramento Kings @NBA",
    "235": "@JDLawGroup @SacramentoKings It's usually cold",
    "236": "@MattBroad15 @SacramentoKings Popcorn?",
    "237": "#Celtics set a series-record  for highest win differential vs. Kings/Royals, 53. The pvs record had been set in Sacramento, 2008, as Boston won by 45. The most one-sided  Celtics win over Royals in  Boston dates back to Nov. 11,1959 -a 33-pt margin",
    "238": "@kyrun49 @SacramentoKings You’re not wrong! In all seriousness, happy you’re alright and it wasn’t any worse.",
    "239": "@SpaceRunnersNFT @BrooklynNets @SacramentoKings I hope you write my name on the ticket like this hahahah 😅 https://t.co/0FDhGt1MTW",
    "240": "@redditSacUp @marchellagetsit @MarcosBreton @SacramentoKings Rondo was not an upperclassman. Further, Rondo was an elite playmaker in college. Lastly, while Rondo has made multiple all-star teams, the greater prominence of switchable wings has made Rondo less valuable. High upside isn’t a guy who’s comp has played for 10 teams…",
    "241": "📣 2 more #NBA Courtside tickets are up for grabs- exclusive to our NFT holders🔥\n\n🏀Watch @BrooklynNets vs @SacramentoKings on Feb 2nd!\n\nTo enter:\n⚡️Own a Space Runners #NFT\n⚡️Be active on Discord &amp; Twitter\n⚡️Submit info: https://t.co/MXsLX97NUn\n🎟Drawing: Tues. Feb 1 @ 10am ET https://t.co/htEbmHJ79q",
    "242": "@MarcosBreton @SacramentoKings Except for the year's 1998-2001 the were good and completive and under the Maloofs ownership group. Other than that they have been embarrassment to the city and its residents. And they have a beautiful arena which goes to waste with a current ownership group &amp; management.",
    "243": "@MarcosBreton @SacramentoKings It’s pretty grim but entertaining in its futility",
    "244": "I think it’s pretty obvious every Kings player has given up in hopes they get to escape the hell that is playing for Sacramento by the trade deadline lmao",
    "245": "Something about me, I stay with my teams FOREVER! I'm a Tennessee Titans (even Oilers), Sacramento Kings, and St. Louis Cardinals fan, have been, always will be. I may be critical, make fun of, and give a hard time to them, but I will ALWAYS root for them, no matter the pain!",
    "246": "@jimrome Rome!! My #beef is with myself for being a Sacramento kings fan. Please please put me out of my misery. UNWAR Divac for drafting BAgley",
    "247": "But to put on my @SacramentoKings gear and challenge him to a game of HORSE. https://t.co/3P5yMZSO3k",
    "248": "@SacramentoKings If we made the playoffs nobody would ask for sh*t",
    "249": "@Notorious_JGB @redditSacUp @MarcosBreton @SacramentoKings no comps are needed. there are plenty of 6 foot PGs who thrive and have thrived in the NBA. i dont remember Gary Payton having the same abilities as Steph or Dame. I think he carved out a nice career. there are hundreds of examples. you just make a ridiculously silly argument.",
    "250": "@ToddyWoddy1330 As a fellow kings fan I believe this to be a very good idea @SacramentoKings get it done",
    "251": "Lock it in @SacramentoKings @nyknicks https://t.co/rML3bnqNc2",
    "252": "@PatrickKilken55 @SacramentoKings 54 points is an embarrassment",
    "253": "is there any sports organization which is worse both now and tomorrow than the Sacramento Kings? No present, no future... this is absolute misery. This team shouldn't be in the NBA",
    "254": "@ATLHawks @SacramentoKings @StateFarmArena @BallySportsSO @929TheGame Keep the streak alive 🙌🏻  #TrueToAtlanta",
    "255": "@marchellagetsit @redditSacUp @MarcosBreton @SacramentoKings So no comps?",
    "256": "@redditSacUp @marchellagetsit @MarcosBreton @SacramentoKings Bob Cousy isn’t a pertinent comp for today’s NBA…",
    "257": "@MarcosBreton @SacramentoKings ive followed the Kings since day 1 when they moved here...this is the worst i've ever felt about the Sacramento Kings!! Gutless!!",
    "258": "@MarcosBreton @SacramentoKings Dunno, I honestly felt more hopeless during Motta's tenure, esp that season where they kept starting Sampson and won 1 game on the road.",
    "259": "Realized last night that I would be such a hardcore Sacramento Kings fan if they were good at least one season that I have lived in town. I have lived in town for FIFTEEN YEARS.",
    "260": "That was the worst ass-whoopin I can remember the @SacramentoKings receiving, and I’ve been a fan since ‘96 😳🤦🏾‍♀️",
    "261": "@MarcosBreton @SacramentoKings It's time to get into Pac-12 basketball... Great UCLA/AZ game last night... after Kentucky won in OT. I can't stomach how quickly the Kings lose their heart. And that's what a Kings team w/out DeAaron looks like... a brick-a-thon...",
    "262": "Miss last night’s MONSTER win over the Sacramento Kings?! No worries, we got you covered with 3 major takeaways \n#Celtics https://t.co/gq5tQ2wgph",
    "263": "@SacramentoKings How many players can you trade at once? Asking for a friend.",
    "264": "@SacramentoKings You can’t.",
    "265": "The last time the Sacramento Kings made the playoffs....\n Chris Paul was in his rookie season. 😳",
    "266": "@money_talks65 @BBack2021 @_JasonLT De'Aaron Fox shooting 25% for 3-pointers and listed as the Sacramento Kings franchise guy.\nDon't base anything on how the Sacramento Kings conduct business. 😄😄😄 Buddy Hield's previous 5 seasons of nothing below 38% despite at least 9 attempts. https://t.co/ZJoUd0QOVN",
    "267": "@martymush @SacramentoKings to cover the first half. @ATLHawks to cover the 2nd half.",
    "268": "@TheTraeYoung Take note @SacramentoKings",
    "269": ".@TyHaliburton22 this custom 1/1 Karmeleons NFT I made belongs to you. Hit me up friend so I can gift it to ya.\n\n🦎🏀✌️ @SacramentoKings @NBA #SacramentoProud #NBATwitter #nfts https://t.co/Ebn7bMP2En",
    "270": "They catch the 2011 NBA draft 4th overall pick from University of Texas slippin again? Imma need the Sacramento Kings to start giving this man minutes on the floor",
    "271": "the official @SacramentoKings account won’t post the final score from last night, but I will…\n\nembarrassing.\n\nwe gonna make moves now, guys? @Vivek @mmcnair https://t.co/OdvXkggece",
    "272": "@MarcosBreton @SacramentoKings No heart.",
    "273": "Please get the @SacramentoKings some help🗣🗣🗣🗣",
    "274": "@JoeyCorleoneBGR @SacramentoKings Give it up bro lmao",
    "275": "@FCartoscelli3 @kayte_c @CarmichaelDave @JasonRoss1140 Hey man you’re the best in the game! Hopefully Kings get you on the postgame show soon! Maybe even front office 🤷🏽‍♂️ 🔥 @SacramentoKings",
    "276": "Ayo @SacramentoKings 15+ yrs no playoff product, now a 50 point loss?! You know how hard it is to rep you guys out here 🤦🏻",
    "277": "@SacramentoKings @55buckets Brabo",
    "278": "@MarcosBreton @USCX1954 @SacramentoKings Is it like a tax writeoff to field a losing team or something?   Some franchises in major sports are so hopelessly pathetic it's hard to believe they are trying,.  Sustained endless misery?  Get a new owner then.",
    "279": "@hoaagie @TerryFranconia @SacramentoKings Actually, take thybulle out, they still a solid team",
    "280": "@MarcosBreton @SacramentoKings @celtics @nbcsnl Would have seen more heart and been more entertaining to watch the equipment manager and fans battle it out.",
    "281": "First Bulls game I ever attended. Chicago Bulls / Sacramento Kings 1995 Preseason Highlights (Moline, IL);... https://t.co/ixekd30FDM via @YouTube",
    "282": "Are the Sacramento Kings broken?\n\n\"I mean that's a tough question to answer... a game like last night, there's a level of fracture there, for sure.\"\n\n- @kayte_c",
    "283": "@hoaagie @TerryFranconia @SacramentoKings The trade is genuinely good for them. I have a hard time imagining they’d struggle to make the playoffs with Ben tobi and tisse",
    "284": "@marchellagetsit @redditSacUp @MarcosBreton @SacramentoKings Other than Steph and Dame, who have abilities Mitchell will never develop, who are the six-foot upperclassman who developed into all stars in the NBA?",
    "285": "@MarcosBreton @SacramentoKings I've watched this team since '85 when I was in the 6th grade and I have never in all of those years been so disappointed in the team and organization. Kings' fans don't have that high of expectations, but we do expect effort and heart and until then G1C will continue to be empty.",
    "286": "@NBCsTheSlap If you listen to “Set Fire to the Rain” in reverse on vinyl, you can hear @BenSimmons25 and Rich Paul discussing how Ben is fine with the @sixers sending him to the @SacramentoKings",
    "287": "@Fxiden8 @Dom_Ciccaglione @protectedpick “Poverty” “joker gif” \n\nugly and sad behavior. \n\nEnjoy being closer to Sacramento kings than you are to us.\n14 games back and growing. https://t.co/sZJOeqf50k",
    "288": "@SacramentoKings blow it up! or don’t..just trade Buddy",
    "289": "Consensus Line Move:\n2022-01-26 Sacramento Kings at Atlanta Hawks from 234.50 to 231.50\nUnder need it more\n#NBA #bettingpicks #coding #ethereum",
    "290": "A look at some of the impressive facts and figures from the #Celtics blowout of the Sacramento Kings on Tuesday.\n\nAlso, @jaytatum0 👀🔥 https://t.co/66AV2w18f2",
    "291": "@SacramentoKings Kings coaching staff might need me. 😂",
    "292": "@SacramentoKings Saving this for when we do to him the same thing we did to Fox, and Cousins, and Evans, and _______",
    "293": "@ed_bugsya3000 @LakersReporter @Lakers The reason the Lakers GM could leave Stanley Johnson UNEMPLOYED for that Sacramento Kings game without fear of the other 29 NBA teams scooping Johnson up.\nThe offensive side of the ball.",
    "294": "@SacramentoKings Trade fox build around Hali",
    "295": "@Muffiano_ @SacramentoKings @CoorsLight cringe",
    "296": "(She was GREAT. Very nice, big Sacramento Kings fan, teased me about when was I gonna marry my girlfriend to the point of eventually loaning me her place in NYC for a proposal trip. Thanks Lisa!)",
    "297": "The Hawks will go for their fifth consecutive win both straight up &amp; against the spread when they host the Kings tonight as 9.5-point home favorites. Sacramento is in a back-to-back spot after getting mauled at Boston last night. 'Bogi' is set to return for Atlanta.",
    "298": "@HoopsWill Taking Duren top 5 seems like a Sacramento Kings move lol",
    "299": "@MarcosBreton @SacramentoKings I just tried to think of an analogous “mailing it in” performance on the job in the newsroom. I couldn’t. Pretty sure a lot of high-skill jobs can’t be done with minimal effort. Pro sports pays millions a lot of employees who do little or nothing for the team.",
    "300": "Revenge Game: Bogdan Bogdanovic plays Sacramento tonight.  He played 209 games in his career for the Kings.",
    "301": "@MarcosBreton @SacramentoKings Is it time for Vivek aka the former 6th grade basketball coach to sell the team to someone that will really create a winning culture?",
    "302": "@MikeDSykes @FourVerts Hi, I'm a Sacramento Kings fan https://t.co/5Bm1kULNjz",
    "303": "At this point, the @WashWizards and @SacramentoKings should just join forces",
    "304": "@SacramentoKings Okay so I lowered the @SacramentoKings standard, if they win 20 game before the all-star I will consider it as if they won the championship..I will continue watching them play..",
    "305": "DasHaus made a bet!\n\nEvent: Sacramento Kings vs Atlanta Hawks #NBA\nBet: Atlanta Hawks TO WIN -8.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "306": "@ATLHawks @SacramentoKings @StateFarmArena @BallySportsSO @929TheGame Pre 42 &amp;11 game",
    "307": "DasHaus made a bet!\n\nEvent: Sacramento Kings vs Atlanta Hawks #NBA\nBet: Sacramento Kings TO WIN +8.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "308": "@Notorious_JGB @redditSacUp @MarcosBreton @SacramentoKings Please. Mitchell is much more talented than the players you compare him to. The obsession of his height or position he plays means nothing. And drafting a player for fit when you're a mid market team is silly. You draft the player you feel is the best talent. Position irrelevant.",
    "309": "Look what I found on @eBay! https://t.co/w21rJMPsk2 via @eBay \n\nEnds Today! Sacramento Kings Big Richaun Holmes Prizm RC BGS 9.5 \n#WhoDoYouCollect",
    "310": "He’s so SPECIAL!!! He’s HIM @ATLHawks @SacramentoKings https://t.co/DOyOiC4sqr",
    "311": "@MarcosBreton @SacramentoKings Nothing will change without selling the team to another owner.",
    "312": "Do you need something to do tonight? The Atlanta Hawks are playing the Sacramento Kings tonight at 7:30pm at State Farm Arena. Click here for discounted tix: https://t.co/PauNTodjXa https://t.co/9H9ypx4kcn",
    "313": "Had an accident making breakfast. Hot oil exploded out of the pan. Covered a good portion of my arm &amp; stove. My arm will probably blister from the boiling grease. I'm numbing the pain with an ice pack. This experience is still better than watching the @SacramentoKings play.",
    "314": "Yahoo! Sports:  WATCH: Boston’s Aaron Nesmith gets and-1 while breaking the ankles of Sacramento’s Louis King https://t.co/QYP61imh1e",
    "315": "Y’all are hot garbage  @SacramentoKings",
    "316": "#BostonCeltics - #SacramentoKings 128:75\n#NBA\n🇺🇲🏀🇺🇲🏀🇺🇲🏀\n\nMore info: https://t.co/ktAJ2Ceuif https://t.co/QD001kcIsN",
    "317": "Stars key an epic blowout: 10 Takeaways from Celtics-Kings\n\n@KeithSmithNBA saw Jaylen Brown and Jayson Tatum almost outscore Sacramento on their own as Boston got a second runaway victory in a row https://t.co/8dmRwl48tI https://t.co/cyWindeONL",
    "318": "@MarcosBreton @SacramentoKings This team is stealing from Sacramentans. They are taking our time, our money, our loyalty and making millions of dollars at the same time.",
    "319": "@SacramentoKings @TyHaliburton22 will play for the @SacramentoKings until his free agency then he is outie5000!",
    "320": "@ATLHawks @SacramentoKings @StateFarmArena @BallySportsSO @929TheGame Hey Hawks todays my daughter’s birthday and we are coming to see y’all get this W ! Let’s Go!",
    "321": "🏀 Sacramento Kings (@SacramentoKings) #SacramentoProud\n🆚 L @ Boston Celtics #BleedGreen #SACvsBOS\n⏭️ Atlanta Hawks #TrueToAtlanta #SACvsATL\n✈️ N655DL | DAL8941 | B752\n🛫 BOS - 11:26 pm ET\n🛬 ATL - 1:49 am ET\n📡 Tracking: https://t.co/6mC62RTRGD https://t.co/n2K41trYNB",
    "322": "Sacramento Kings vs  Atlanta Hawks Prediction 1/26/22 -  Free NBA Picks https://t.co/HciCpApbin via @YouTube \n\n#NBA #NBAPick #NBAPrediction #Basketball",
    "323": "📰 Atlanta Hawks vs Sacramento Kings Predictions and Odds Jan 26!\n👉 https://t.co/wIaEPNwGTN @sportsmemo",
    "324": "@SacramentoKings You’re dreaming, dude. This team is awful and will be for years to come",
    "325": "Robert Williams III's vision on full display on this play 🧐 \n\nHe had 13 points, career-high 17 rebounds, four assists, three steals and two blocks last night against the Sacramento Kings 😤 \n\nFull highlights ▶️ https://t.co/T1TD5MJg6k https://t.co/z8kqDwOMGz",
    "326": "@ATLHawks @SacramentoKings @StateFarmArena @BallySportsSO @929TheGame Oh yay, Let's Do It.",
    "327": "@ATLHawks @SacramentoKings @StateFarmArena @BallySportsSO @929TheGame Ice going for 60🔥",
    "328": "@ATLHawks @SacramentoKings @StateFarmArena @BallySportsSO @929TheGame Blow the doors off these Chumps",
    "329": "@ATLHawks @SacramentoKings @StateFarmArena @BallySportsSO @929TheGame We could sit Dre to be careful so he’s healthy when Lebron comes to town… we’ve seen this film before and todays an opponent to rest someone against.",
    "330": "@ATLHawks @SacramentoKings @StateFarmArena @BallySportsSO @929TheGame Easy w",
    "331": "Back in the A 🏀\n\n🆚: @SacramentoKings \n⏰: 7:30 PM ET\n📍: @StateFarmArena \n📺: @BallySportsSO \n📻: @929TheGame \n🎟️: https://t.co/B2S4BtKcbG https://t.co/qOQ8andMvr",
    "332": "SACRAMENTO KINGS 75-128\nBOSTON CELTICS, Final.\n#BleedGreen",
    "333": "The Sacramento Kings have to be the Worst Sports Franchise of the last 15 -16 years and I do not think anyone else is close except the browns",
    "334": "@tawlblackguy No Sacramento but we can all be kings!!!",
    "335": "@celtics The @SacramentoKings didn’t post anything from the game on their Instagram acct.. 🤦🏾‍♂️😂😂😂😂",
    "336": "Two Arizona Wildcats listed in ESPN’s latest NBA mock draft: Bennedict Mathurin (10/Atlanta Hawks) and Christian Koloko (35/Sacramento Kings) https://t.co/7Xmfpiqoqs",
    "337": "The Sacramento Kings 3 point defense last night was _ _ _ _ _ .\nWordle 221 4/6\n\n⬛⬛🟩⬛⬛\n⬛⬛🟩⬛⬛\n⬛⬛⬛🟨⬛\n🟩🟩🟩🟩🟩",
    "338": "Good Luck 2 my Atlanta Hawks against the Sacramento Kings 2night 🏀🏀🏀 https://t.co/gjgP46qoz7",
    "339": "▶️▶️https://t.co/uzAKNQfm4E◀️◀️\n#NBA live streams:\n#AtlantaHawks vs #SacramentoKings\nand more coming today... https://t.co/So4RxBrGeU",
    "340": "@hardCore3EO @Lakers @SacramentoKings @Pacers Plus need some 1st rd picks to get brodie &amp; that 47 mil out of their next year for some pieces. Lmao I suffered through this lineup and trying to avoid this phase in the next 3 years https://t.co/whxMU2W4tH",
    "341": "@hardCore3EO @Lakers @SacramentoKings @Pacers Not enough to move the needle in my opinion and only like a 14 mil and 16 mil if we throw in a vet min. AD and bron fully healthy not winning the chip with the way the roster currently constructed. AD the only value piece we got to get some more pieces and draft picks for now",
    "342": "Best trade scenario I’ve seen for @sixers @SacramentoKings @DetroitPistons https://t.co/Fzw9oFi4zW",
    "343": "@SacramentoKings now’s the time https://t.co/xNsCg5Yp92",
    "344": "I thought Fox was a ball hog who takes Ill advised shots and isn’t clutch? That’s why we lost by 53 without him? He is by and far our best player and if Vivek knew how to build a team around him like the grizzlies, we would be in the playoffs.\n#SacramentoProud #Sacramentokings",
    "345": "As a @SacramentoKings fan! I was literally crying with anger! On how bad of a team we are. This is so painful. Why is this front office not doing anything? The suffering continues.",
    "346": "@hardCore3EO @Lakers @SacramentoKings @Pacers Health is wealth and only played more than 68 games twice. Love that guy from Kentucky to now but we need availability",
    "347": "The Sacramento Kings are absolutely AWFUL 😂😂😂",
    "348": "@statmuse Petition to relocate the Sacramento kings all the way to Kazakhstan",
    "349": "Worst #NBA ATS records (2 of 2)\n\nDenver Nuggets 18-28\nWashington Wizards 19-28-1\nBrooklyn Nets 19-28\nLos Angeles Lakers 19-28-1\nAtlanta Hawks 19-27\nPortland Trail Blazers 20-27\nMilwaukee Bucks 21-29\nSacramento Kings 21-28\n\n#gamblingtwitter",
    "350": "@MarcosBreton @SacramentoKings The sad part is that there is some talent on this team…",
    "351": "@James_HamNBA I say Kings embrace youth movement go with the Powell, Moses, a 2nd and Green For Holmes. Build talent around Tyrese and Fox @SacramentoKings should consider this. #SacramentoProud",
    "352": "I say Kings embrace youth movement go with the Powell, Moses, a 2nd and Green For Holmes. Build talent around Tyrese and Fox @SacramentoKings should consider this. They gotta do this step by step. Start with a trade with Mavs #SacramentoProud",
    "353": "@SacramentoKings You guys need to play Neemias fr",
    "354": "@ThaLazy_Jeanius @nbatopshot @SacramentoKings @hbarnes Until I finally hit I thought that too at times",
    "355": "@mmcnair I say Kings embrace youth movement go with the Powell, Moses, a 2nd and Green For Holmes. Build talent around Tyrese and Fox @SacramentoKings should consider this. #SacramentoProud",
    "356": "@bellavita_82710 Wizards are already there! From what I hear wizards are viewed by the players as a Sacramento kings type organization!",
    "357": "Why Sacramento Kings should keep De’Aaron Fox through next season https://t.co/2cm9bxTCFe #NBA #SacramentoKings",
    "358": "@SacramentoKings Tobias Harris had almost half of your points yesterday, feels like you could really use him rn https://t.co/7V1LXefBI6",
    "359": "@SacramentoKings fuck is yaw doing?!? do the deal. Time to make the #Kings great again go get Ben at any cost @lockedonkings https://t.co/Cxyd7XYz0x",
    "360": "@davidkeenan1917 @MarcosBreton @SacramentoKings I thought that last night, that the Kings organization was more interested in real estate deals than basketball. But then, I thought the whole arena thing was a bad idea.",
    "361": "Tom Hanks and Ed Burns attend the Sacramento Kings vs New York Knicks game at Madison Square Garden on March 3, 2015. https://t.co/1GGzZRvcFY",
    "362": "Damn @SacramentoKings! You see this? https://t.co/sPtK0ufAcZ",
    "363": "@SacramentoKings What's there to fix? You didn't tell us how they did last night.",
    "364": "Boston Celtics dissect the Sacramento Kings with ball movement – NBA News https://t.co/5HiEhKhC0F",
    "365": "53???!!!! @SacramentoKings @mmcnair  get Ben and get Sabonis fix the rest in the off-season",
    "366": "@mhc_76 @SacramentoKings They could use top scorers like Ben Simmons to right the ship",
    "367": "Sacramento Kings ain’t even trying…",
    "368": "damn @SacramentoKings did you even compete last night?",
    "369": "I say Kings embrace youth movement go with the Powell, Moses, a 2nd and Green For Holmes. Build talent around Tyrese and Fox @SacramentoKings should consider this. #SacramentoProud",
    "370": "Boston Celtics dissect the Sacramento Kings with ball movement https://t.co/ggV0MoeX9m",
    "371": "Sacramento Kings gotta split that shit up that’s terrible @SacramentoKings",
    "372": "the @NBA GOT to contract the sacramento kings. enough is enough.",
    "373": "Good morning @SacramentoKings https://t.co/75T3LbDbwZ",
    "374": "My kids asked me what being married was like. I sat them down on the couch, and turned on the Sacramento Kings game",
    "375": "Boston Celtics dissect the Sacramento Kings with ball movement https://t.co/46vo8uqQju https://t.co/UOECGdDwoo",
    "376": "🏆RESULTADOS | NBA🇺🇸\n\nDetroit Pistons 1⃣0⃣5⃣-1⃣1⃣0⃣ Denver Nuggets\n\nPhiladelphia 76ers 1⃣1⃣7⃣-1⃣0⃣7⃣ New Orleans Pelicans\n\nToronto Raptors 1⃣2⃣5⃣-1⃣1⃣3⃣ Charlotte Hornets\n\nWashington Wizards 1⃣1⃣5⃣-1⃣1⃣6⃣ Los Angeles Clippers\n\nBoston Celtics 1⃣2⃣8⃣-7⃣5⃣ Sacramento Kings https://t.co/adAMxq2qnh",
    "377": "@MarcosBreton @SacramentoKings Should have invested in the Monarchs and sacked the Kings.",
    "378": "@barstoolsports I’m a @SacramentoKings fan but this shit is getting to me. Luckily @TyHaliburton22 gives me hope for the future.",
    "379": "@ChewieWoolf @nbatopshot @SacramentoKings @hbarnes 24k CS to get your FIRST Legendary Pack?! 😱😔  there is no hope for me bruh 😭😭😭",
    "380": "@barstoolsports Sacramento Kings most likely after reading this “Hold my Beer!” https://t.co/8QAXbkh1u0",
    "381": "Hey big heads .@SacramentoKings https://t.co/1KykKE5JUL",
    "382": "Check out my article on the Boston Celtics route on the Kings.\n#Celtics #sacramentokings\n#hardwoodhoudini https://t.co/Qiil1L6ja1",
    "383": "@BobRathbunTV @HawksOnBally @ATLHawks @SacramentoKings @DWilkins21 @laurenjbara @BrianOliver1313 Welcome back @DWilkins21! Thanks to all the sit-ins for keeping the broadcast lively.",
    "384": "@StoolGreenie Sacramento Kings.",
    "385": "@hldogg1 @MarcosBreton @SacramentoKings Go Rest High On That Mountain? Quittin Time? It Ain’t My Fault?",
    "386": "@kncitom @MarcosBreton @SacramentoKings Is there a country song about how the Kings fans feel at this stage of the season?",
    "387": "@GozumdeCanlanir @tonjukuk Hedolu sacramento kings - la lakers serisiii @cayirli8831",
    "388": "Some NBA🏀 results from last night's actions, \n\nSacramento Kings 75:128 Boston Celtics☘️\n\nDenver Nuggets 110:105 Detroit Pistons\n\nLA Clippers 116:115 Washington Wizards\n\nCharlotte Hornets 113:123 Toronto Raptors\n\n#SportsCenter \n@__DeeMoney__ https://t.co/Aqyra4kwds",
    "389": "@MarcosBreton @SacramentoKings Slowly? my spirit died about ten seasons ago",
    "390": "Jayson Tatum and Jaylen Brown combined for 66 points last night against the Sacramento Kings ☘️\n\nC’s blew out the Kings 128-75 from the T.D. Garden! \n\n#BleedGreen • #Celtics • #NBA \n\n https://t.co/TNf8xLDyDc",
    "391": "@haasboss @SacramentoKings They need to hear it! Lol",
    "392": "@lenildoj4 @brasilcoast2 Sacramento Kings Basketball",
    "393": "@BobRathbunTV @HawksOnBally @ATLHawks @SacramentoKings @DWilkins21 @laurenjbara @BrianOliver1313 Bring home the victory Bob!",
    "394": "@SacramentoKings @CoorsLight Cold hard fact: you lost by 50+",
    "395": "@BobRathbunTV @HawksOnBally @ATLHawks @SacramentoKings @DWilkins21 @laurenjbara @BrianOliver1313 Can’t wait!",
    "396": "📰 Sacramento Kings vs Boston Celtics Predictions and Odds Jan 25!\n👉 https://t.co/a6o8IMj4gi @wagertalk",
    "397": "Good morning all! Tonight on @HawksOnBally THE HALL OF FAMER RETURNS! Join us for all the fun 7e/6c as the @ATLHawks host the @SacramentoKings bidding for their 5th straight win! @DWilkins21 @laurenjbara @BrianOliver1313",
    "398": "@SacramentoKings Will be 0-5 this Road Trip.That Butt Kick gm last night is another embarrassing play.\nI don't even think if Kings Aquirer pieces at Trade Deadline it won't make a difference this https://t.co/K5CgtA2QCd picks 2022-2023.xx🤣🤣🤣",
    "399": "I’m a member of the Sacramento Kings, I’m gonna help fix this https://t.co/X7iBLAIv1F",
    "400": "BOSTON — Jayson Tatum scored 36 points and Jaylen Brown had 30 points and 10 rebounds before both rested the entire fourth quarter as the Boston Celtics routed the Sacramento Kings 128-75.  https://t.co/Jn2WWCedKN",
    "401": "@bizk10 @SacramentoKings No, play Neemias!",
    "402": "Marcus Smart had 0 points in the @celtics' 53-point drubbing of the  @SacramentoKings, but a +/- of 36 in just 23 minutes. That is the most Marcus Smart stat ever. I love this guy. #Celtics",
    "403": "@beewol Naye mukulu, with all due respect, no one, is going to brag about massacring  the Sacramento kings; there is a reason they are one of the worst teams in the division",
    "404": "@SacramentoKings And WE BELIEVE IN YOU!! @TyHaliburton22 💪🏽💪🏽",
    "405": "Neemias voltou 🇵🇹\n\n8⃣ minutos \n2⃣ ressaltos \n2⃣ blocks\n6⃣ pontos\n\nOs @celtics arrasaram os @SacramentoKings 128-75 🏀\n\n@NBA https://t.co/hXFs2hRRxo",
    "406": "NBA Basketball Game Betting Picks Simulator: 7:40 PM ET - Sacramento Kings vs. Atlanta Hawks - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/oVmNGZKtu9 #nba #sportsbetting #freepicks #cappertek",
    "407": "Tyrese Haliburton: I'm a member of the Sacramento Kings, I'm gonna help fix this https://t.co/j6rMFTNCan",
    "408": "@MarcosBreton @SacramentoKings @celtics @nbcsnl turn up the heat Marcos. i don’t understand why fans don’t boo the shit out of Vivek as soon as he walks on the court.",
    "409": "Sacramento Kings vs Boston Celtics Full Game Highlights | January 25 | 2... https://t.co/BTo3LdaYXL @YouTube",
    "410": "@GiantsKings9ers @fyremanbn @MarcosBreton @SacramentoKings Besides he quit he got fired from radio",
    "411": "Powerful man @SacramentoKings 🇵🇹 https://t.co/wfak1yJECI",
    "412": "Sacramento Kings vs Boston Celtics - Full Game Highlights | January 25, ... https://t.co/ugHZH44H7D @YouTube",
    "413": "@MarcosBreton @SacramentoKings go get them Marcos - you can apply the pressure and demand accountability that the rest of us fans can’t. the worst feeling is that vivek, mcnair &amp; co. don’t care and don’t hear us. Be our voice and hold these losers that make all the bad decisions to the fire and demand answers",
    "414": "@Notorious_JGB @redditSacUp @MarcosBreton @SacramentoKings agree - he’s a slightly better version of Frank Mason",
    "415": "Tyrese Haliburton: I&amp;#039;m a member of the Sacramento Kings, I&amp;#039;m gonna help fix this https://t.co/RdPSZ2PEKS https://t.co/fyj4uouDyA",
    "416": "@MarcosBreton @SacramentoKings They need new ownership. Vivek thinks he knows basketball because he coached his daughter's team.",
    "417": "@MarcosBreton @SacramentoKings Even worse than the Never Nervous Pervis days? Or the days of Joe Kline and Alaa Abdelnaby? 😂",
    "418": "Sacramento Kings vs Atlanta Hawks - NBA League 2022\n🎟️🎥Watch Here➠  https://t.co/T84jXID4q9\n📅 : Wednesday, Jan. 26\n⏰ : 7:30 PM",
    "419": "@PrimeWaller @thatdudekb @Gardas111 @SacramentoKings The warriors had made the playoffs once between 1994 and 2013, the We Believe year in ‘07. Aside from that one year, they were the laughing stock of the league like the Kings are now",
    "420": "@NBA shame on you @WashWizards  and @SacramentoKings  bad team! Bad !",
    "421": "🔴 Live▶ Sacramento Kings vs Atlanta Hawks - NBA League 2022\n🔗🌐🔴 https://t.co/QeV1waPXiM\n📅 : 1/26/2022\n⏰ : 7:30 PM\nOnly Available For Registered Users. Create a FREE account to get access",
    "422": "@raider_rob24 \n\nif the Sacramento Kings get a shame bell, I guess it would be a shame cow bell",
    "423": "WHICH HURTS MORE?\n\nThe Sacramento Kings was clobbered hard by the Boston Celtics, losing by 53 points as Tatum and Brown combined for 66 points. On the same day, the Washington Wizards wasted a 35-point lead and lost to the LA Clippers who was missing PG13 and Kawhi Leonard. https://t.co/DtPB9IfIfo",
    "424": "NBA fans, am I right in saying that Tottenham are the football equivalent of the Sacramento Kings?",
    "425": "@SacramentoKings players are just happy to be in the nba lol",
    "426": "@SacramentoKings When I watch this team it’s so difficult to watch them jack up 3’s after 3’s continually missing . This team is so soft and have no heart. They are scared to attack the the rim so they just take bad 3’s . Soft players don’t want any do tap and that’s why this teams defense is bad",
    "427": "RT @NBAHistory: The @LAClippers 35-point comeback marks the largest comeback in the NBA since the Sacramento Kings 35 point comeback on 12/21/2009 against the Chicago Bulls https://t.co/2J5iUciGfj #NBA",
    "428": "@SacramentoKings @LouisKing @moe_harkless @nemi1599 @newanimprovedJR This team is just horrible",
    "429": "@SacramentoKings This franchise has become woke and a total joke. Sad.",
    "430": "Hawks flying high as Kings visit  #NBA\n #ATLHawks #TrueToAtlanta #SacramentoKings #SacramentoProud https://t.co/aRJ7tvaAoe",
    "431": "New listing! \n\nMARVIN BAGLEY III 2020-21 Panini NBA Hoops Purple Parallel #142 Sacramento Kings \n\nCheck it out: https://t.co/lSk2sPLn0o\n\n#TradingCards #ForSale #eBay https://t.co/SNKirA61Wb",
    "432": "Dave's Picks for Jan 26th, 2022\n\nCBB:\nNavy Midshipmen -7.5\nUCF Knights +4.5\nGeorge Mason Patriots +3\n\nNBA:\nDallas Mavericks -4\nSacramento Kings/Atlanta Hawks OVER 233",
    "433": "Sacramento Kings (18-31, 13th in the Western Conference) vs. Atlanta Hawks (21-25, 12th in the Eastern Conference) https://t.co/R2HfE5bDEn",
    "434": "@barstoolsports The Sacramento Kings say “Hold My Beer”",
    "435": "Sacramento Kings (18-31, 13th in the Western Conference) vs. Atlanta Hawks (21-25, 12th in the Eastern Conference) https://t.co/BZmwuLJo41",
    "436": "@Vivek I can make the @SacramentoKings better… 100%",
    "437": "Sacramento Kings at Boston Celtics    Game #49    1/25/22 https://t.co/vbryCbGMWW",
    "438": "@mmcnair @Vivek Are you going to improve this pathetic @SacramentoKings  team?",
    "439": "@Mitchell_Eason Unless you’re a Sacramento Kings fan, we DEFINITELY suffer more in reality",
    "440": "🏀NBA🏀25/01/22\n\nSacramento Kings(18-31) 75\nB.Hield:11pts,5reb,1asis\nBoston Celtics(25-24) 128\nJ.Tatum:36pts,4reb,6asis",
    "441": "Sacramento Kings honoring the league scoring 75 points. #NBA75 https://t.co/VbVoLd9bGV",
    "442": "@MarcosBreton @SacramentoKings This feels like the beginning of season 1 of Ted Lasso, where management is trying to kill the team. \nExcept- in this case- I don’t think they are actually TRYING to kill the team. Ownership/management just seem so inept that it feels intentional.",
    "443": "when mj said \"expect disappointment and you won't be disappointment\" she was talking about the sacramento kings",
    "444": "@mmcnair you had the chance to answer kings fans concerns instead you made it non basketball convo way to take leadership of the titanic known as the Sacramento kings",
    "445": "@SacramentoKings This reminds me of Steph Curry’s tweet for the Warriors fans back in November 2009.",
    "446": "The @LAClippers 35-point comeback marks the largest comeback in the NBA since the Sacramento Kings 35 point comeback on 12/21/2009 against the Chicago Bulls https://t.co/dc6WlPY3qJ",
    "447": "@SacramentoKings Somehow, someway, kings are gonna break him. And it's sad.",
    "448": "53 point loss. What’s new @SacramentoKings 😭😩",
    "449": "@SacramentoKings It’s going to be okay.  Move on to the next one.  Thank you for being there for the team, the fans, and our city.",
    "450": "@SacramentoKings I'm getting sick of watching you guys lose all the time. Spend money on good players. The city didn't eat too much money on that agenda for you guys to be worse than a high school team.",
    "451": "Do you have any idea what it's like to play for the Sacramento Kings? Mind ya business shawty. https://t.co/ryzd3eRgKL",
    "452": "Sacramento Kings vs Boston Celtics Full Game Highlights | January 25 | 2... https://t.co/vTkvRXOIOX a través de @YouTube",
    "453": "NBA\n\nFT.\nDetroit Pistons 105 - 110 Denver Nuggets\n\nPhiladelphia 76ers 117 - 107 New Orleans pelicans\n\nToronto Raptors 125 - 113 Charlotte Hornets\n\nWashington Wizards 115 - 116 Los Angeles Clippers\n\nBoston Celtics 128 - 75 Sacramento Kings\n#TheGamePlan",
    "454": "@SacramentoKings Y’all some doo doo…..",
    "455": "Jayson Tatum and Jaylen Brown combined to score 66 points as the Boston Celtics throttled the visiting Sacramento Kings in a 128-75 victory for their seventh win in 10 games. https://t.co/Nreb2GGZvS",
    "456": "@heyMrcass @ChrisDuerr @SacramentoKings At least they didn't give false hope tonight.",
    "457": "@redditSacUp @MarcosBreton @SacramentoKings A low-upside, six-foot upperclassman coming off a national championship giving a shit?\n\nThat’s the definition of both Mateen Cleaves and Davion Mitchell.\n\nRegrettably, they make mediocre NBA players…",
    "458": "@SacramentoKings I love my Kings but good Lord yall sorry!",
    "459": "@MarcosBreton @SacramentoKings If is post 1985-it is beyond frayed political BS &amp; dissonance! Many years of missed out selections a la Ghastly draft outcomes- but stayed loyal!Covid fatigue? I want to love my team but man they are a Drama filled shit show! It would be nice if they cared!",
    "460": "@Sutton_Island I forgot 6 fouls vs Sacramento. My bad. It was only 2nd time this year a player fouled out vs Kings.",
    "461": "@MarcosBreton @SacramentoKings That was the largest margin of victory for the Boston Celtics at home in the history of the team.",
    "462": "@MarcosBreton @SacramentoKings @celtics @nbcsnl Maybe it's past time for the local media to start putting some pressure on Vivek and management, calling it like it is, a \"shit show at best\"",
    "463": "@SacramentoKings Trade us Barnes please 🙂",
    "464": "@MarcosBreton @SacramentoKings It's proven that 22+yo taken in the lottery are going to be limited.  In fact..SAC may have drafted one of the better older players in the lottery in Buddy Hield.  No need for three PGs however.",
    "465": "@SacramentoKings Welcome to basketball hell kid. You will be wishing you were back in Ames Iowa after playing for this 💩 hole franchise..",
    "466": "Enough is enough. This team is not fit for professional basketball. Sign me to a 10 day and I will get us to the play-ins @SacramentoKings",
    "467": "Sacramento Kings fan till the death of me!! Tonight wasn't a good night, but every team has a blow out night! I got faith in the Kings we are just one piece away I truly believe that! Win or Lose always going to be a @SacramentoKings Fan!! #sacramentokings #SacramentoProud",
    "468": "Josh Richardson is a Sacramento King",
    "469": "@MarcosBreton @SacramentoKings Mr. Breton, I do not believe you. Worse than the 17-65 team in 2008-09? No way! The Kings averaged 22 wins for four seasons 2008-12.",
    "470": "@SacramentoKings maan I been tellin y’all its the Nut-Sac Town",
    "471": "@MarcosBreton @SacramentoKings Bill Russell era is closest comparison",
    "472": "NBA Basketball Game Betting Picks Simulator: 1/26/2022 7:30 PM ET - Sacramento Kings vs. Atlanta Hawks - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/oVmNGZKtu9 #nba #sportsbetting #freepicks #cappertek",
    "473": "@SacramentoKings Move the team to Seattle.",
    "474": "@MarcosBreton @SacramentoKings Move the team to Seattle.",
    "475": "@redditSacUp @MarcosBreton @SacramentoKings You want more low-upside six-footers?\n\nI’m sure Mateen Cleaves is available…",
    "476": "@MarcosBreton @SacramentoKings It will continue to be the same, the only thing @vivek cares about is social issues and the large value he has made from the purchase of the kings.",
    "477": "@SacramentoKings Shoulda fixed this shit long ago, earlier this season.. that statement means nothing",
    "478": "@MarcosBreton @SacramentoKings It starts at the top….and they don’t know what to do",
    "479": "@missliz92 @SacramentoKings Don’t it’s just stress",
    "480": "@SacramentoKings You loose by 53 and Queta only have -8 +/- (the best +/- of Kings tonight)",
    "481": "@MarcosBreton @SacramentoKings been listening to the g man for 30+ years and felt bad for him tonite.  awful.",
    "482": "@redditSacUp @MarcosBreton @SacramentoKings You’re fooling yourself about Mitchell",
    "483": "@fyremanbn @MarcosBreton @SacramentoKings Oh yeah, we were absolutely crushing in the last decade with him",
    "484": "Boston Celtics: Sacramento Kings vs Boston #Celtics Full Game Highlights | January 25 | 2022 NBA Season https://t.co/bpOyT8bDpo",
    "485": "@BillHalldin @MarcosBreton @SacramentoKings You are everyone",
    "486": "The Sacramento Kings lost by 53 points tonight.",
    "487": "@SacramentoKings Oh yeah, he gone.",
    "488": "had no idea the sacramento kings still existed",
    "489": "@SacramentoKings Careers die when you play for the Kings. Better get out quick and hope you get traded.",
    "490": "Lakers go to 3OT with the Sacramento kings and lose.",
    "491": "@MarcosBreton @SacramentoKings I've shared season tickets for nearly 10 years and put up with a lot. I can't imagine renewing at this point. Renewal period coming up soon and it's going to be ugly for them.",
    "492": "#GamblingTwitter\n\nWell, I knew the streak had to end sometime. The Kings played like crap tonight. If I had known their lead scorer was injured, I wouldn't have bet it. (Over)\n\nSo, bettors, remember: until De'Aaron Fox comes back, don't bet on the Sacramento Kings to score much.",
    "493": "@SacramentoKings sign this guy to a 10-day🙏🏼 https://t.co/IGMXOJl8jf",
    "494": "@MarcosBreton @SacramentoKings The Curse of Grant Napier.  They never should have railroaded him",
    "495": "@MarcosBreton @SacramentoKings SPIRITS SLOWLY\nits the hope that kills you",
    "496": "@MarcosBreton @SacramentoKings “ I make billions sitting pretty, IDGAF about winning. I kept your Kings in Sacramento so shut up😎” - vivek https://t.co/hraXDV227V",
    "497": "The Sacramento Kings are not watchable from a competitive lens. At this point I want to see cool/obscene shit like Embiid going for 70/25 against them later in the week.",
    "498": "8🏀- Bucks (133) x (127) Sacramento Kings",
    "499": "@MarcosBreton @SacramentoKings Same here, I've seen some pretty bad Kings teams but boy this seasons been brutal..",
    "500": "Sacramento Kings vs Boston Celtics Full Game Replay 2022 Jan 25 NBA Replay HD\nhttps://t.co/MmxshDVLLJ https://t.co/t3d9fiQ3qV",
    "501": "@SacramentoKings love tyrese but i feel like i heard this from our past stars for last 10 years",
    "502": "@SacramentoKings The Curry guarantee LOL",
    "503": "@avdalaschi @SacramentoKings Trade everybody. Sell the team. Implode the arena. Embarrassing.",
    "504": "@MarcosBreton @SacramentoKings I was just saying that in my — significantly shorter — time as a fan, this is just about rock bottom. Maybe trading Boogie but otherwise",
    "505": "@Feelin_Breezy @SacramentoKings @cavs @spurs @celtics @WashWizards @BrooklynNets Lol I love this",
    "506": "Congratulations Boston @celtics on your 128-75 win over the Sacramento Kings 2021-2022NBASeason",
    "507": "How about a discount on Bagley @SacramentoKings ?",
    "508": "@cranium_cracker “You know what loses momentum?  Turnovers.”\n\nTurnovers do not have nearly as big of an impact on a game like bad calls and non calls do. Just ask the 2018 Saints. Or the 2002 Sacramento Kings. Or the 1988 Detroit Pistons who were robbed of a title due to shady officiating.",
    "509": "@MarcosBreton @SacramentoKings Watched the dubs… in phx",
    "510": "@MarcosBreton @SacramentoKings Maybe it’s time for Lukenbill to take over the team again",
    "511": "@pandahank41 Sacramento Kings curse ❌\nTelevised games curse ✅",
    "512": "@SacramentoKings This team doesn't deserve him",
    "513": "@MarcosBreton @SacramentoKings Coulda had this guy 😢 https://t.co/mZpF3gVUnO",
    "514": "@MarcosBreton @SacramentoKings Some private equity money will fix it. Worked in newspapers.",
    "515": "@ChewieWoolf @CadeCunningham_ @SacramentoKings @buddyhield Sell your holo 😉 https://t.co/WUjdeMpUvU",
    "516": "@MarcosBreton @SacramentoKings Gee, hard to believe firing Luke wasn’t the ticket…. 🥴",
    "517": "When I moved to Sacramento in 1989, the @SacramentoKings were not good. But Gregg Lukenbill, who brought the team here, cared deeply. I knew the team tried, just lacked talent. The current team? What can you say about them when they lay down like they did tonight? Gutless team",
    "518": "@SacramentoKings That’s what a true leader says.. that’s the type of player the kings need to keep",
    "519": "Stockton Kings \n\n       ▶️▶️▶️\n\n Sacramento Kings",
    "520": "@SacramentoKings This is why I love Tyrese! He’s a team player !",
    "521": "@MarcosBreton @SacramentoKings Have you tried not caring about professional sports?",
    "522": "I think @SacramentoKings probably would have broke 100 points tonight if did this… https://t.co/fdo6WnjPWf",
    "523": "I’m so glad I didn’t watch the game @SacramentoKings 🥴",
    "524": "@GrantNapearshow How bout what a shit show the Sacramento Kings are…",
    "525": "@MarcosBreton @SacramentoKings Ready for salt in the wound?\n\nThey used a lottery pick on a low-upside, six-foot upperclassman PG with two other promising young PGs already on the roster…",
    "526": "@MarcosBreton @SacramentoKings Having trouble with this. I used to watch the kings.  When they moved here they were doormats for years. Now they have some talent.",
    "527": "@djblackolive @SacramentoKings I tell myself the same damn thing brother",
    "528": "I already own every moment needed except the @CadeCunningham_ for my @SacramentoKings #SacramentoProud @buddyhield... but it's not gonna happen. Unless....?😉🙏 https://t.co/CrDd9TKOk9",
    "529": "@KofiAmankwaaJr The Sacramento Kings lost by 53 points. \nAnd it wasn’t even that close",
    "530": "@mmcnair the kind of guy to just tweet Ted Lasso gifs instead of actually just being a competent GM\n\ngood luck Sacramento! the Kings are going to suck until the world ends https://t.co/ZrFJYaclzm",
    "531": "@MarcosBreton @SacramentoKings I was thinking this exact same thing. Rock bottom.",
    "532": "@aldochavez300 @SacramentoKings Sign 5 star pro athlete @_Effie15",
    "533": "@SacramentoKings You know it’s bad when @SacramentoKings just doesn’t tweet for 5 hours",
    "534": "@SacramentoKings I swear to god, if y’all even think about trading Haliburton and/or Fox, I’m done. Ben Simmons is a problem child. He ain’t worth it!!!!",
    "535": "@MarcosBreton @SacramentoKings I wish ownership and Monte McNair would do something about the loss tonight. But as usual nothing isn’t happening the Fans don’t deserve this, it’s time something Big happens",
    "536": "So are the @SacramentoKings going to do something about this disaster of a team or are they going to continue killing our spirits slowly? In 32 years in Sacramento, this is worst I’ve felt about a Kings team ever. And my friends, that’s saying something",
    "537": "Describe how it’s like being a Sacramento Kings in ONE word: TORTURE \n\n@cameronsalerno1",
    "538": "Ende #Basketball Herren #NBA \n110:105 #DenverNuggets vs DetroitPistons \n107:117 NewOrleansPelicans vs #Philadelphia76ers \n113:125 CharlotteHornets vs #TorontoRaptors \n116:115 #LosAngelesClippers vs WashingtonWizards \n75:128 SacramentoKings vs #BostonCeltics",
    "539": "If this @SacramentoKings team, were to ever play @TheGenerals, who are you putting your money on? @DLoAndKC @IamKDiddy @damienbarling #SacramentoProud",
    "540": "@SacramentoKings Trade fox to the pelicans",
    "541": "Incoming Harrison Barnes &amp; Buddy Hield trade for Tobias Harris &amp; Furkan Korkmaz \n@dmorey @SacramentoKings get it done https://t.co/5u6yplzwC3",
    "542": "It’s time the @SacramentoKings  wake up the Fans don’t Deserve the loss you guys pulled tonight Kings there was no effort on that court wake the hell up and show some damn respect and play to Win",
    "543": "@SacramentoKings fox gone tho",
    "544": "The Sacramento Kings are legitimately the worst franchise in all four major team sports and it’s really not even close. 😢",
    "545": "@SacramentoKings Tyrese doing his part would be nice if he had some help tho…",
    "546": "@SacramentoKings I believe in you don't give up! @TyHaliburton22",
    "547": "@thatdudekb @Gardas111 @SacramentoKings they weren’t playing on a historically bad franchise. the kings last playoff appearance is older than 90% of nba twitter and twitter it’s self.",
    "548": "Holy shit @SacramentoKings",
    "549": "👍 on @YouTube: Sacramento Kings @ Boston Celtics - Postgame - Presented by Royal Rebounds https://t.co/kt1m0X80BX",
    "550": "since when did you start covering the Sacramento Kings, David? https://t.co/uLRE4aYlzW",
    "551": "@nbcsnl How about sequel sketch featuring the Sacramento Kings- except this time all their players are back from COVID restrictions and they STILL only score 1 point against a team, so they suit up arena fans and staff again since they were actually better.",
    "552": "@Russaldo @SacramentoKings Chris Webber 😉 oh and nice bet!",
    "553": "Tune in DAILY at 7:00a &amp; 4:00p to hear ALL the latest trade rumors around your Sacramento Kings! 🏀\n\n\"The Carmichael Dave Show with Jason Ross\" (HOUR 2): https://t.co/dhs98Zx2Wa\n\n\"The Nick Cattles Show\" (HOUR 2): https://t.co/COtsLTyN0H https://t.co/WynxKTSiRN",
    "554": "Being a Sacramento Kings fan sucks. Loyalty is overrated.",
    "555": "@DKSportsbook @SacramentoKings Haven’t us Kings fans suffered enough??\n\nAlso put $50 on the Kings to finish last in the West please and thank you.",
    "556": "how soon can the Sacramento Kings move to Seattle?",
    "557": "@SacramentoKings Give it 2 more seasons my G and you'll be reconsidering.",
    "558": "@SacramentoKings Don’t care https://t.co/vXELweJuoF",
    "559": "@renjinthomas @SacramentoKings @TeamBagley a clown bruh. What sac gotta eo with this? The fanbase better then your ego. Get over yourself. Let your kids be kids",
    "560": "@Russaldo @SacramentoKings Trying to be funny… ☹️",
    "561": "In other news, @SacramentoKings really should think about dismantling their team, rebrand &amp; rebuild. Good players on hand they just play such bad basketball for years now 😖 Getting blown by 50+ points to a low seeded @celtics really should open their eyes",
    "562": "@DKSportsbook @SacramentoKings Why Draft Kings…. Why….",
    "563": "@Gardas111 @SacramentoKings expect the kings been tryna figure it out for 16 yrs now 😂",
    "564": "* = It would be this one but y’all don’t even deserve my happy memories right now @SacramentoKings https://t.co/Fhdjcdw6Qz",
    "565": "@SacramentoKings Hasn’t helped yet…",
    "566": "@SacramentoKings name your arena after me",
    "567": "@SacramentoKings Y’all should really stay off social media for a while",
    "568": "PWC member Jackie Erbe says their arterials proposal doesn't ignore equity — by paving Sacramento, Martin Luther King and Dwight, it would benefit South and West Berkeley. Focusing on residential streets means fewer people will benefit, she says #berkmtg",
    "569": "@SacramentoKings Is there a contact for help with kids club orders? My three kiddos never got their kits - ordered on 12-2 for Xmas presents!",
    "570": "@SacramentoKings The entire Kings team should be forced to give their paychecks to fans after that type of atrocious performance.",
    "571": "@SacramentoKings The team is trash......it's all good. We're used to it",
    "572": "@SacramentoKings Hopefully he doesn’t see this https://t.co/pgyjzHrNkK",
    "573": "@SacramentoKings Players have a role, but ownership and management actually have a bigger role.  Not much changes till those two slots are fixed.",
    "574": "@SacramentoKings stop always tryna draft a foreign player,, how tf you miss luka tho.. sell the mf team y’all are some stinkers",
    "575": "The @SacramentoKings lost by 53.  Bless them Lord 🙏🏾",
    "576": "@SacramentoKings the game was over halfway through the first quarter and you only throw neemy in for 8 minutes in the 4th... poverty franchise",
    "577": "@CarmichaelDave I still think they should just give the Stockton Kings a chance for a couple of games, just as an experiment. (It'll give Sacramento a chance to play a couple of teams closer to their level, as a bonus.) https://t.co/6Cl9grBkR5",
    "578": "@SacramentoKings How can you not like this kid.",
    "579": "@SacramentoKings Also Free Buddy Hield! We'll take him and Harrison for Langford and a couple 2nds 🤝",
    "580": "@SacramentoKings Ain’t no fixing the kings",
    "581": "The Boston Celtics DESTROYED the Sacramento Kings, 128-75! \n\n📷 Boston Celtics\n\n#NBA75 #AlwaysAFan https://t.co/6tfV0a1dRu",
    "582": "@SacramentoKings maybe if you didn’t have a shitty nft profile picture",
    "583": "@SacramentoKings Same vibe https://t.co/K5i8okhUhK",
    "584": "@SacramentoKings the key word is \"help\"; he shouldn't have to do it all by himself-- the org has to provide him the necessary support",
    "585": "@SacramentoKings Thats beautiful 😢",
    "586": "@SacramentoKings We love to hear it 🤙",
    "587": "@SacramentoKings get your shit together it’s been long enough seeing us suck 💔",
    "588": "@SacramentoKings Therapist - \"I think you have commitment issues\"\nMe - \"I'm a Kings fan\"\nTherapist -  \"oh nvm. you good\"",
    "589": "@SacramentoKings I missed the game what's the final score...",
    "590": "@SacramentoKings LMAO https://t.co/O6fTepwVlz",
    "591": "@SacramentoKings Future Buck legend 👀",
    "592": "@SacramentoKings @TyHaliburton22 love you mush",
    "593": "@KingsGeneral01 @SacramentoKings Lmao dude what?",
    "594": "The Sacramento Kings reveal their new Logo after getting destroyed by 53 points. https://t.co/sfAaCh6ra0",
    "595": "@adamjones985 Celtics 1-0 when they flex their muscles all over the Sacramento kings to remain the 9 seed 🤔🤔🤔",
    "596": "@SacramentoKings aren’t even gonna post the score lmaooo",
    "597": "@SacramentoKings are a joke. The fans deserve better than that",
    "598": "Hey @SacramentoKings WAY TO SUCK! smh 🤦‍♂️",
    "599": "@SacramentoKings @Raw2512 @TerenceDavisJr @RealTristan13 @TyHaliburton22 Didn't even post once about the game lmao",
    "600": "Sacramento Kings shouldn't even be in the NBA anymore",
    "601": "Tatum and Brown: 66 points.\n\nEntire Sacramento Kings team: 75 points. https://t.co/V7ipUZz626",
    "602": "Maybe its time the Sacramento Kings move to Seattle or something.  Disgusting and embarrassing tonight.  Blow up the team by trading EVERYONE! I have zero interest in ever watching these losers ever again",
    "603": "@SacramentoKings @MichelobULTRA @buddyhield @hoopculture13 @hbarnes @dameology Yalls drip lost by 50 tonight",
    "604": "Who did this lol\n\nBuying  the Sacramento Kings from Vivek Ranadive https://t.co/Re2ke7gTIO",
    "605": "Despite the ridiculous blowout win tonight the @celtics do lose to the @SacramentoKings in the “color analyst” dept. https://t.co/ioMsjbQeIg",
    "606": "I keep seeing rumors/suggestions about a deal with the Sacramento Kings. Well, those Kings lost by 53 tonight and are now (18-31) on the season.",
    "607": "When your son is trying to make you feel better after that dumpster fire 🗑 🔥 of @SacramentoKings game. I hate that I love this team so much. https://t.co/vNh8EwHnue",
    "608": "Move the @SacramentoKings back to KC only if the @Chiefs change their name to Empire",
    "609": "@SacramentoKings I wanna see you talk shit now",
    "610": "@SacramentoKings You Seeing This?! https://t.co/OmmDQiMsup",
    "611": "Introduce relegation into the @nba for the @SacramentoKings.",
    "612": "Im taking my middle school team over the sacramento kings. I can actually make layups",
    "613": "Im taking mississippi state over the sacramento kings",
    "614": "did anyone else know that the Sacramento kings were a basketball team?",
    "615": "Y’all pray for me. Nothing is wrong, I’m just a Sacramento Kings fan",
    "616": "Sacramento Kings Got An Elite Beating Lmaooooo😭😭😭",
    "617": "53-point loss, absolutely EMBARRASSING @SacramentoKings This playoff drought might go another 15 years…",
    "618": "Boston Celtics 128 (Jaylen Brown 30 pts, 10 rebs, Jayson Tatum 36 pts, Robert Williams 13 pts, 17 rebs) Sacramento Kings 75 (Buddy Hield 11 pts), Brooklyn Nets 96 (James Harden 33 pts, 12 rebs, 11 asists) Los Angeles Lakers 106 (Lebron James 33 pts)",
    "619": "@celticsblog @MsSamanthaMay Unfortunately, you can’t play the Sacramento Kings without De’Aaron Fox every night.",
    "620": "The Colorado State Rams outscored the Sacramento Kings tonight.",
    "621": "hear that @SacramentoKings???? https://t.co/uVh0dBnPex",
    "622": "THE BOSTON CELTICS ANNIHILATED THE SACRAMENTO KINGS",
    "623": "@OverDrive1050 @HayesTSN Live in Sacramento and stream the show every day. Can confirm 100%. In a city with one pro sports team, the Kings are behind the Giants, A’s, Dodgers, 49ers, Warriors, and Lakers in relevance IN THE CITY!!!",
    "624": "move the sacramento kings to seattle",
    "625": "Cancel y'all next game @SacramentoKings https://t.co/ylueNqjRi3",
    "626": "Lakers bounced back from loss, prevailed versus the Kings at Sacramento 104-100\n\nKing James spearheaded Lakers' attack with 29 points, 10 dimes and 7 boards\n\nVintage V.Carter led the Kings in scoring with 16\n\n16-3 https://t.co/rSIWZwApaO",
    "627": "The @sacramento kings saw this and said “hold my beer” #NBA https://t.co/5pVnayyzPc",
    "628": "@SacramentoKings y’all hurt my feelings https://t.co/DoMYat8lsL",
    "629": "The saddest thing is that the Sacramento Kings should be an NBA Royalty (no pun intended) franchise \n\nThe influences this team has had on the game of basketball in the past is insane #SacramentoProud",
    "630": "I watched the Sacramento Kings TV feed tonight. \n\nI was so jealous: \n\nKayte Christensen-Hunter is an awesome analyst.  \n\n@kayte_c",
    "631": "JT and JB: 66 points\nSacramento Kings: 75 points \n\n😳😳😳😳 https://t.co/vvKotOrmRT",
    "632": "Did I see that right? The @celtics beat the @SacramentoKings by 53? Absolutely ridiculous. Just unacceptable. This is the freaking @NBA, not a #1 seed vs. a #16 in the Big Dance. #NBA",
    "633": "@SacramentoKings Nah bro if you haven’t noticed even the most hardcore fans (this guy) are checked out. I’m trying to mentally prepare for next season hoping you guys stop trying to make us cry 😢 😭 https://t.co/Gh60ZxfqT2",
    "634": "@AUgetoffmygold @SacramentoKings Hali for Tobias swap is your path to contention",
    "635": "A gofund me set up to buy the @SacramentoKings away from Vivek Ranadive.  https://t.co/oUZFiaiT2n",
    "636": "@49ersj5 @Vivek @SacramentoKings I can’t speak to it because I haven’t watched enough of the game over the last 20 years to not just be talking out of my ass, but it seems like teams used to have different identities. Now every team looks the same.",
    "637": "I just saw the final score in the @SacramentoKings / @celtics game. It seems that @nbcsnl skit was not that far off from the sad reality",
    "638": "I love who you are, I love who you ain't you're so Anne Frank. @SacramentoKings",
    "639": "@NBCSKings Not much to say?🤬\n\nHow about starting with an apology? And not just from Gentry &amp; players but from @SacramentoKings ownership/ops to fans for serving up such a lousy, ambitionless franchise that's embarrassingly painful to watch and support year after year?🙄",
    "640": "Disban the Sacramento kings",
    "641": "@socheesey @SacramentoKings Shoot it would be better if the kings pick me for one of their sweepssteaks so we can get some courtside tickets for the squad👀 #SacramentoProud",
    "642": "Send the Sacramento Kings to Hartford man",
    "643": "@TheRealMcKoy85 @Vivek @SacramentoKings Haha I feel ya man. I grew up watching the end of the Jordan era and it was the best. It's the new generation that has changed the game. What I can't stand now is the new 3pt contest every team is doing. No one plays that physical inside game anymore",
    "644": "@nmrci_lrde Sacramento kings lol",
    "645": "Dnt question my loyalty I’m still a @dallascowboys fan and a @SacramentoKings fan, only the @clubtomateros have brought me sports Joy 👌🏽",
    "646": "@MattBroad15 @SacramentoKings It’s not fam.",
    "647": "@mssocialwelfare @SacramentoKings Jazz be hooping!!",
    "648": "Vivek needs to sell the @SacramentoKings he’s the only thing holding the kings back",
    "649": "The Boston @celtics beat the @SacramentoKings 128-75 Tuesday night. https://t.co/WyE51atjch",
    "650": "O Celtics ACABOU com o Sacramento Kings kkkkkkkkkkkk",
    "651": "NBA SPREADSHEET system takes a step back tonight as the Sacramento Kings +8.5 never showed up ! System record now falls to (173-80) 68% ! \nOverall (3-2) night at https://t.co/W1vC8QDw2b @cappers_king @Sammy_Covers @DutchBoyFresh @TROTWAM @ItsDerl @SkeeProfit @NBATalkWithJay1 https://t.co/4NyNJSbvgT",
    "652": "As a lifelong Sacramento Kings fan, I’ve truly had enough. Time to get rid of Fox and build around Haliburton \nWe need to swap Fox for Randle straight up and never look back!",
    "653": "Sacramento Kings vs Boston Celtics Full Game Highlights | January 25 | 2022 NBA Season #Sacramento #Kings #NBA https://t.co/wSmd3XH3xV",
    "654": "Sacramento Kings vs Boston Celtics Full Game Highlights | January 25 | 2022 NBA Season #Boston #Celtics #NBA https://t.co/l0KjepENEV",
    "655": "@_petethetrainer and the @SacramentoKings  will still suck!",
    "656": "@49ersj5 @Vivek @SacramentoKings Yep. But I’m 36 and nobody cares  what I think anymore haha. I got to see the best to ever do it. I’m good.  😁",
    "657": "@MattBarnaby3636 Poor Sabres, Detroit Lions, Sacramento Kings the sad winter/fall 3",
    "658": "@SacramentoKings post the final score",
    "659": "@TheRealMcKoy85 @Vivek @SacramentoKings Agree. Its stupid as hell and makes it hard to have that loyalty towards players. Back in the day you wouldn't see Bird and Magic joining together to beat Jordan lol. It's the new NBA unfortunately",
    "660": "Hey @SacramentoKings we’ll give you Enes for Barnes. Tick tock ⌚️",
    "661": "@SacramentoKings 53 pt loss to @BostonCelticsMA is proof the @NBA needs relegation 🤦🏻‍♂️ #NBA #NBA75",
    "662": "Second-largest win in Celtics history 🍀\n\nJayson Tatum and Jaylen Brown combine for more than half of the Boston Celtics' points in a 128-73 vs. the Sacramento Kings! https://t.co/gJwdQ8ZiwG",
    "663": "Send Us Some Players @SacramentoKings #Lakeshow https://t.co/p6Qta6oT03",
    "664": "@SacramentoKings @Raw2512 @TerenceDavisJr @RealTristan13 @TyHaliburton22 Kings Twitter right now https://t.co/oBYRmyKWFx",
    "665": "Vivek, can you please sell the team to the city of Sacramento, this is horrible! #GreenBay  #SacramentoProud @sactownroyalty @SacramentoKings",
    "666": "I own you @SacramentoKings https://t.co/inkoZ3Ryas",
    "667": "Another blowout @SacramentoKings loss! And Monte is STILL sleeping on the job. Maybe he can give more NON answers on a certain morning local radio show! 😐😐😐😐 @damienbarling",
    "668": "It goes without saying, @SacramentoKings fans deserve better than this. From ownership to front office to players, you’re losing the fans. Why support the team when there’s no effort shown? Pathetic.",
    "669": "📽 Boston Celtics demolish Sacramento Kings 128-75 https://t.co/5scJBjeg6C https://t.co/oOu7Bc3gel",
    "670": "📽 Video: Boston Celtics demolish Sacramento Kings 128-75: https://t.co/Ij3FRDXYr3",
    "671": "Sacramento Kings Twitter is a scary place right now 😂",
    "672": "@49ersj5 @Vivek @SacramentoKings I just don’t like the way that players can bounce from team to team almost at will. “Super teams” irritate the crap out of me.",
    "673": "@SacramentoKings @MichelobULTRA @buddyhield @hoopculture13 @hbarnes @dameology the Kings looked a little better at the free throw line 11/15 73%...it's something......",
    "674": "@SacramentoKings Boycott these u grateful ghetto players! We know where they came from and its showing!",
    "675": "@TheRealMcKoy85 @Vivek @SacramentoKings Yea the NBA has seriously become a circus in the past decade. Yea management doesn't seem to care and its very unfortunate for the fans and that city. They deserve better than this shit show",
    "676": "@BarstoolBigCat Still waiting on the @SacramentoKings to post the final score.. Please help big cat",
    "677": "@SacramentoKings @MichelobULTRA @buddyhield @hoopculture13 @hbarnes @dameology Yall wont even post the final💀💀",
    "678": "@SacramentoKings @MichelobULTRA @buddyhield @hoopculture13 @hbarnes @dameology Nothing common bout this final score either",
    "679": "As a life long Sacramento Kings fan, Monte McNair should trade De’Aaron Fox for Julius Randle. Knicks need a PG &amp; we need a stretch 4 to pair with Haliburton. He can be our reincarnated Chris Webber with a jump shot.",
    "680": "@scott_erwin @SacramentoKings It was a bad one today.",
    "681": "kings new mascot 🤡 @SacramentoKings",
    "682": "@49ersj5 @Vivek @SacramentoKings I quit watching basketball a long time ago in general, but I can’t watch a team that never fixes anything. This city fought so hard to keep the Kings here and this is what they’re rewarded with. Consistent mediocrity. \n\nHonestly, maybe they should have sold the team. 🤷🏻‍♂️",
    "683": "@Trevor_Adams @SacramentoKings I know they aren't. But man, their play this year in general has been absolutely trash.",
    "684": "@celtics @BarstoolBigCat @SacramentoKings haven’t posted the score.",
    "685": "A reminder 4 @WashWizards &amp; @SacramentoKings fans although Sacramento certainly has &amp; continues to struggle in a major way “In an #NBA season there are probably 3 or 4 games, that you walk away, accept what happened and move on to the next game” - Hubie Brown",
    "686": "@Mr_CWBullock @SacramentoKings They're not relocating.  The arena is brand new.  Ownership is personally a billion dollars in at this point.",
    "687": "Kings losing by 53 pts tonight is another slap in the face for the fans. Management needs get their head out their asses and make some changes and do better! Unexcusable  @Vivek @SacramentoKings",
    "688": "Philly acquires entire Sacramento Kings organization \n\nCity of Sacramento gets Ben Simmons in return https://t.co/fs6D92CrzG",
    "689": "@Trevor_Adams @SacramentoKings So...we on the \"maybe they should relocate\" talk yet? I'm not saying they should, but their play seems like they're trying to force their way out.",
    "690": "BOSTON (AP) — Jayson Tatum scored 36 points and Jaylen Brown had 30 points and 10 rebounds before both rested the entire fourth quarter as the Boston Celtics routed the Sacramento Kings 128-75 on Tuesday night. https://t.co/vy4ZOHzKWH",
    "691": "My Parlay: We hitting tonight.\n\nSacramento Kings: Fuck Basketball",
    "692": "A reminder 4 @WashWizards &amp; @SacramentoKings fans although Sacramento certainly has had &amp; continues to struggle in a major way “In an #NBA season there are probably 3 or 4 games, that you walk away, accept what happened and move on to the next game” - Hubie Brown",
    "693": "Well, I can now say that I have watched the worst Sacramento Kings loss in my lifetime.\n\nOnce again, we must ask ourselves: Is THIS rock bottom? Or do things need to get even worse before they FINALLY get better for this team?\n\nWorst loss in 30 years--a new low for this team.",
    "694": "\"I'm a member of the Sacramento Kings, so I'm going to help fix this ... I'm going to be here and we're going to make it work. I promise that.\"\n\nTyrese Haliburton opened up after the Kings' loss to the Celtics https://t.co/ZWfJTH1y1W",
    "695": "I can’t believe that a team could have a worse loss than the @SacramentoKings who lost by 53 tonight. But the Wiz did 😵😵😵 https://t.co/9TUijWKgM0",
    "696": "@SacramentoKings this is embarrassing.",
    "697": "Tyrese Halliburton deserves better than to be on the Sacramento Kings https://t.co/ogyJ0wOaFO",
    "698": "The Sacramento Kings are now 0-14-1 OU, following a road loss in which they allowed 120+ points. Guess what’ll be active tomorrow ? \n\n📸 https://t.co/FcGYFMCDgA",
    "699": "@MajesticMaxwel @SacramentoKings Same for the Jazz 😩",
    "700": "Ime Udoka on Jayson Tatum and Jaylen Brown after Boston's 128-75 win over the Sacramento Kings: \n\n\"They are the two pillars and leaders of the team.\"\n\n📺Full Presser: https://t.co/E2m6S0gB0A\n\n#BleedGreen #Celtics\n\n⚡by @betonline_ag &amp; @HireOnLinkedIn https://t.co/zj7gs96qR1",
    "701": "@LegionHoops Thought u we’re talking about the Sacramento kings 😂 😂",
    "702": "I attached an appropriate theme song for the @SacramentoKings.  Please @mmcnair do something. No more Barnes. No more Buddy. No more players that don't care and don't want to be here.  https://t.co/r8uppsGund",
    "703": "@Vivek @SacramentoKings sell the team",
    "704": "Sacramento Kings are forever cursed by the basketball gods.",
    "705": "Congrats to JeMeil King and U of Idaho on their first Big Sky win vs Sacramento State.  JeMeil had 10pts 4ast 3reb in the win for the Vandals. #BRSfam https://t.co/MYagxTJpIQ",
    "706": "Nobody player on the Sacramento Kings should be untouchable lol",
    "707": "In a season of too many lows, losing by 53 in Boston tonight is the Kings lowest.  It’s the 4th worst loss in the Sacramento era. The Celtics led by as many as 60 which is the largest the C’s have ever led a game in their storied franchise history.  No Fox tonight isn’t an excuse",
    "708": "@nbirtcil @SacramentoKings Hey but maybe they’re on the cusp of the tenth seed. I guess that’s supposed to make us excited",
    "709": "The Sacramento Kings in the NBA.. https://t.co/d6G9DFHike",
    "710": "Get a summary of the Sacramento Kings vs. Boston Celtics basketball game https://t.co/538z0zCgu5\nvia @ESPN App https://t.co/GW3IzntEEA",
    "711": "@APerez916 @SacramentoKings Fake fan like you not wearing the jacket on your pic",
    "712": "Tonight was one of the worst @SacramentoKings loses I can remember.  To get blasted like that by a very average Celtics team should tell you all you need to know about how the Kings season is going",
    "713": "Wait, the Sacramento Kings got 50-pieced????",
    "714": "\"I refuse to let the culture of what the Kings have been in the past take over who I am as a person...  I'm a member of the Sacramento Kings so I'm gonna help fix this. It ain't gonna be in a day but ima be here and we're gonna make it work I promise that.\"\n\n- Tyrese Haliburton https://t.co/U3CG7JWdy0",
    "715": "Did you guys see how well Tobias Harris played tonight @SacramentoKings",
    "716": "@SacramentoKings @MichelobULTRA @buddyhield @hoopculture13 @hbarnes @dameology If they can't do it, I will then sir. https://t.co/wueWv0PGxX",
    "717": "\"It’s obviously dark right now. We’re not where we want to be, but there’s still a lot of season left and I’m a member of the Sacramento Kings, so I’m going to help fix this.\" 2/3",
    "718": "Someone convince me it’s worth watching a single @SacramentoKings game for the rest of the season",
    "719": "@SacramentoKings this organization is an absolute dumpster fire and not worth any fans time. I’m out ✌🏼bums",
    "720": "@SacramentoKings Straight up trash.  You make me embarrassed to be from Sacramento and rooting for this godforsaken franchise.",
    "721": "Damn that @SacramentoKings Pack is real and lit I see",
    "722": "@SacramentoKings @MichelobULTRA @buddyhield @hoopculture13 @hbarnes @dameology Sacramento Queens LMO",
    "723": "Kings at Celtics: Boston obliterates Sacramento at the Garden 128 – 75 https://t.co/L5aF6rvkAU",
    "724": "\"It's not too dark right now. We're not where we want to be, but there's still a lot of season left throughout this year and I'm a member of the Sacramento Kings. I'm going to help fix this.\" -Haliburton (cont.)",
    "725": "@SacramentoKings @MichelobULTRA @buddyhield @hoopculture13 @hbarnes @dameology Nah y’all got washed tonight b",
    "726": "The Sacramento Kings 😭 at this point just put them in the G league fr",
    "727": "Gospel of the night, @SacramentoKings and @WashWizards fans need therapy. https://t.co/JwiEcaFCfH",
    "728": "I said, \"Gosh, the @SacramentoKings are so so bad\" to my 5 y/o daughter. \nShe said, \"No, Daddy! They're the best!\" \nI was like, \"They're so terrible.\" \nAnd she goes, \"But Daddy... they love you.\" \nNo matter what, it's a complicated relationship I have with my team.",
    "729": "@SacramentoKings Yo!! What was that??!!! What TH was that?!!! \nThis has to be the worst team in modern NBA history.",
    "730": "@SmidgeConcerned @JillAdge @SacramentoKings He's pretty smart for a 6 year old.",
    "731": "Jayson Tatum scored 36 points and Jaylen Brown had 30 points and 10 rebounds before both rested the entire fourth quarter as the Boston Celtics routed the Sacramento Kings 128-75 https://t.co/WWscKutTzl",
    "732": "Imma need Sacramento to keep some of that same energy tomorrow night. Hawks have things to do this week and we need to start by locking down the Kings 🙌🏾. #TrueToAtlanta",
    "733": "@patrickgines_ @NateDeeGreat He should be a Sacramento King since he likes to lose.",
    "734": "Sacramento Kings suck.",
    "735": ".@SacramentoKings kings what happened?? 😈🤡🤡 https://t.co/tbd2EJhuXN",
    "736": "@SacramentoKings @Raw2512 @TerenceDavisJr @RealTristan13 @TyHaliburton22 damn y’all not even gonna tweet about the game at all?",
    "737": "@BarstoolBigCat @SacramentoKings Nearly 30 minutes later @BarstoolBigCat and still no update from the Kings.. Think of all the folks out there who only get their score updates from the Kings Twitter account. Please advise!",
    "738": "@SacramentoKings still waiting on y'all to start the trade https://t.co/khmu1dydk7",
    "739": "@APerez916 @SacramentoKings Holy shit, I just saw the score. 😲",
    "740": "“CELTICS JUST BLEW OUT KINGS BY 53 PTS! The highest scorer for Sacramento was Buddy Hield with 11 PTS 😳\n\nJayson Tatum: 36 PTS, 14/23 FGM, 7/14 3PM\nJaylen Brown: 30 PTS, 10 REB, 11/19 FGM, 5/12 3PM\n\nWHAT A BLOWOUT! ☘️” https://t.co/TOEP7wG8SI",
    "741": "@kyrun49 @JillAdge @SacramentoKings This kid has kings GM potential",
    "742": "@SacramentoKings should be ashamed https://t.co/UHHLkOKDUA",
    "743": "They've had a 16 year playoff drought and a shit coach and owner lmao we can't really be surprised about the product we call the SACRAMENTO Kings https://t.co/P0snraHYj6",
    "744": "Remember on fairly odd parents the basketball team got sent to Alaska for being ass? They should do that to the @SacramentoKings",
    "745": "@SacramentoKings what the hell man!!",
    "746": "Your Sacramento Kings are pathetic and embarrassing. 🤮 https://t.co/1I7zJAz5Sm",
    "747": "@SacramentoKings with one of the worst box scores in NBA history tonight. Unbelievably bad https://t.co/MGUaT0MHjE",
    "748": "@SacramentoKings @Verizon @TyHaliburton22 @TerenceDavisJr @hbarnes @MB3FIVE @Rich_Holmes22 Ben Simmons and Tobias Harris are the future of this franchise",
    "749": "Sacramento Kings just lost 75-128 to Boston Celtics. Score 75 points in total in an NBA game after full time is beyond shocking and a clear sign the players have given up on the team. A trade is definitely to shake things up in a big way",
    "750": "@SacramentoKings Players shouldn’t even get a game check for that performance. Pathetic.",
    "751": "Goes to check on the @SacramentoKings score. Sees they lost by 53 points.\n\nMe: How do you lose by 53 points?!?\n\nMy kid: Maybe their players aren't good.\n\nTruer words have never been spoken.",
    "752": "NBA @SacramentoKings at @celtics, Tuesday, January 25, 2022 @NBA @NBAstats #gamecharts #dataviz #nft https://t.co/x3nWT8MR5F",
    "753": "The Sacramento Kings tonight. https://t.co/p4N6qOvzGZ",
    "754": "Tues Nite Celts win 128-75 vs visiting @SacramentoKings TD Garden\nThe 53 pt win Narrowly missed @celtics Franchise Record of 56, set 12/8/18 (133-77 Road Win @chicagobulls )for Largest Margin of Victory. @jaytatum0 Brown and Smart played in both games for Boston @bostonsportsinf",
    "755": "Reggie Jackson zubac patty mills and the whole Sacramento kings fuck ya !",
    "756": "I love this @SacramentoKings squad. They are a chef’s kiss of perfection 🤌 if you’re gonna be good, be great   If you’re gonna be bad, be epically bad.  We are truly witnessing art in the making https://t.co/YgyKeQzMl5",
    "757": "@ESPNNBA Sacramento should change their name from Kings to Peasants",
    "758": "@SacramentoKings @Verizon @TyHaliburton22 @TerenceDavisJr @hbarnes @MB3FIVE @Rich_Holmes22 Look at the difference in nemias stats compared to holmes and jones, and the difference in time played! All said!",
    "759": "@SacramentoKings TWEET THE SCORE",
    "760": "@SacramentoKings @Raw2512 @TerenceDavisJr @RealTristan13 @TyHaliburton22 Deadass no tweets 😂 😂 😂",
    "761": "The Sacramento Kings are the basketball team of all time",
    "762": "Celtics lead by as many as 60, obliterate Kings 128-75  #NBA\n #celtics #BostonCeltics #SacramentoKings #SacramentoP https://t.co/XllSwybwbN",
    "763": "He must be watching the @SacramentoKings https://t.co/mmt0wi0lt6",
    "764": "Anybody know where I can get this hoodie at?? @SacramentoKings @AlvinGentry @KingsTeamStore #SacramentoProud https://t.co/LiTaFeYxrE",
    "765": "No tweets about the game AT ALL from the Sacramento Kings account is crazy",
    "766": "@013rupin @SacramentoKings @CoorsLight Yoooooo fax",
    "767": "@SacramentoKings @MichelobULTRA @buddyhield @hoopculture13 @hbarnes @dameology Dumpster fire organization. Benches ur whole starters midway through the 3rd and proceeds to lose by 53 and my money on Halliburton",
    "768": "The @SacramentoKings played like they will all be traded and like Dua Lipa said didnt give a fk 😮‍💨",
    "769": "Nights like this make me wish the NBA had relegation so that maybe my Sacramento Kings could actually be winners in a minor league for a change one year.",
    "770": "@thatl0calguy @SacramentoKings We failed. We thought we were gonna keep it at 60 when we hit it but they let up and it ended up being 53. I just can’t tonight. I wanted that 60 burger!",
    "771": "@NBA, relegate the @SacramentoKings https://t.co/jQQb2Y70tA",
    "772": "@SacramentoKings Head Coach Alvin Gentry keeps it 💯!!! 53-pt loss!!! 👑🏀 #SacramentoProud #KingsAllDay https://t.co/KIhan82sbv",
    "773": "@celtics Tatum balled out in his Sacramento Kings tryout.\n\nWatch out for the Tatum for Fox trade… you heard it here first.",
    "774": "Who is even coaching the Sacramento Kings?",
    "775": "POST THE FINAL SCORE @SacramentoKings https://t.co/qPrFGDVvye",
    "776": "Imagine being Ben Simmons, sitting out because you don't want to play for Philadelphia anymore. Only to wake up the next day playing for the fucking Sacramento kings",
    "777": "@wealthissimple @mmcnair @Vivek @SacramentoKings 🤣🤣pretty sure this isn’t a coaching issue, but yes everything needs to be overhauled stat!!",
    "778": "The Sacramento Kings loss by 53 points tonight",
    "779": "Them: “Don’t trade Beal, we’ll turn into the Sacramento Kings. Is that what you want?”\n\nMe: “We ALREADY ARE the Sacramento Kings!!!” https://t.co/XW4rmO5nOK",
    "780": "I’ve never seriously questioned my fandom to the @SacramentoKings, even with all the bullshit I’ve had to deal with my whole life but it’s at that point. \n\n@mmcnair this is absolutely inexcusable.",
    "781": "#Celtics defeat the Sacramento Kings 128-75‼️‼️💪💪 Jayson Tatum and Jaylen Brown combine for 66 points in blowout win🥵🥵 Record improves to 25-24👻 #ripbetty #gogreen #weloveduece https://t.co/U9BA3MMF5W",
    "782": "That was a tough blowout to watch 😔. The amount of disrespect coming from the Celtics broadcasters was unfortunately warranted🥲 @NBA @SacramentoKings @celtics",
    "783": "The Sacramento kings, less resilient than toilet water pants https://t.co/W2tZKrfCsU",
    "784": "@SacramentoKings we need CHANGE ASAP",
    "785": "The Sacramento Kings are 18-30 and 24th overall in the NBA standings.. Do what you want with it. Good win",
    "786": "53????? Grow up @SacramentoKings",
    "787": "@SacramentoKings who loses by 53 points, had so much faith in you guys, now I have to play 10 games as brimstone @PlayVALORANT",
    "788": "The Sacramento Kings need to pack it up and move to Seattle",
    "789": "@SacramentoKings are pathetic and disgrace no heart at all",
    "790": "You have to wonder what the Sacramento #Kings front office is thinking right now. A loss like tonight can certainly add urgency to show ownership changes. \n\n#NBA Trade Deadline 16 days away. https://t.co/aBXxOo0fvT",
    "791": "The @SacramentoKings loss to the  Bucks last game was only 6 pts difference. Im glad they decided to take this NIGHT OFF against the @celtics but the Cs played their best game of the season too",
    "792": "My @SacramentoKings looked ugly today",
    "793": "Dear @SacramentoKings been wating on a trade now. how for a long is it.\nI herd shaq sold his stock in kings thats a start. Maybe we can get big man grab some boards. Anyways 6-33 from 3 pretty shitty man. I kno u c it. Maybe by treadline turn this mess around https://t.co/amYd9YaaIb",
    "794": "Was that rock bottom? #SacramentoKings #SacramentoProud",
    "795": "@Vivek  time to sell the team. @SacramentoKings fans deserve better. You have had more than enough chances. Every year you make the same mistakes.  We are tired of this bullshit every season.  Fire the entire organization even morons like @CarmichaelDave  and @MarkJonesESPN",
    "796": "@BarstoolBigCat Still waiting on the @SacramentoKings to post the final score big cat.. please stand by https://t.co/fDhOcwW9Oo",
    "797": "somebody on the @SacramentoKings is getting traded for this.......right? https://t.co/S1Ug0KHMU5",
    "798": "I lied give me your first round picks you losers @SacramentoKings @WashWizards",
    "799": "@SacramentoKings we suck! We need to shake up the roster. Mitchell can’t shoot, bagley is still bagley, buddy can shoot(one dimensional) harkless garb, bad basketball! We don’t have the luxury to be building a brand outside of basketball guys have to focus!",
    "800": "Celtics-Kings score is insane. Kings roster is full of guys from the Sacramento YMCA.",
    "801": "@zemensberhe @celtics @SacramentoKings Great sit. I might be watching @dallasmavs with @warriors on TV.",
    "802": "We now go to the Sacramento Kings... https://t.co/x7tXuAkOnM",
    "803": "As long as the Sacramento Kings have their pfp as a nft, they deserve to lose",
    "804": "🔴#NBA🏀🇺🇲\n⬇️#SacramentoKINGS 75 (18-31)\n⬆️#BostonCELTICS 128 (25-24)🔸\n🔶AL HORFORD🇩🇴\n(C/6'9\"/240Lbs)\n🔹3/Pts\n🔹8/Reb\n🔹2/Ast\n🔹0/Stl\n🔹1/Blk\n🔹0/TO\n🔹0/7T2\n🔹1/2T3 \n🔹0/TL\n🔹23:00/min:seg\n@Al_HORFORD\n@Celtics\n@RDBSeleccion\n#RDenNBA\n#DominicanosEnNBA\n#MaTR®",
    "805": "Wow! This @SacramentoKings team is terrible! #sacramentoembarassed",
    "806": "Boston #Celtics trounce Sacramento Kings in win of the season, 128-75. 🏀 #NBATwitter #NBA  https://t.co/B819naVexZ",
    "807": "I'm shocked the @SacramentoKings had the second worst loss of the night. Congrats, @WashWizards !!!",
    "808": "DAAAAAAAAAAAAAAAMN @SacramentoKings",
    "809": "EMBARRASSING. @SacramentoKings https://t.co/cCCHEQ0Lnd",
    "810": "@SacramentoKings @MichelobULTRA @buddyhield @hoopculture13 @hbarnes @dameology Lol joke squad",
    "811": "yikes what a pounding by the @celtics on the @SacramentoKings",
    "812": "The @SacramentoKings are officially the WORST sports franchise currently today. \n\nNow they go for the worst in HISTORY.",
    "813": "@statmuse The Kings should get rebranded and moved to a different city. Whatever they’re doing down there in Sacramento isn’t working, hasn’t worked in years, and they look miles away from being a playoff team while still trying to compete (not like they’re trying to tank)",
    "814": "Lol poor Hawks the @SacramentoKings might be so pissed about this game theyll go ham on the Hawks next game (or maybe not) lol",
    "815": "🤖 #SofiAlert \n📅 25-01-2022 \nSacramento Kings - Boston Celtics \n🛋 2.6/5 Sofis https://t.co/lzHuAQ29xX",
    "816": "@NotoriousOHM In other news, The Sacramento Kings did not comeback from a 60 point deficit",
    "817": "@DT916 @KingSunnyyyy @celtics @SacramentoKings hire this man",
    "818": "The Sacramento Kings broke the NBA app’s chart.\n\nAt halftime. https://t.co/0Z0V9hAlP5",
    "819": "@SacramentoKings only had one player score in double figures with 11, and it was a reserve 🤣🤣",
    "820": "Oh my goodness. Really @SacramentoKings ? https://t.co/kpghcaP767",
    "821": "Imagine a Sacramento King with this effort...\n\nI hate the Lakers. https://t.co/F60B0mkhMj",
    "822": "@davidaldridgedc Thought this was about the Sacramento Kings for a second",
    "823": "Lmao @SacramentoKings",
    "824": "@Vivek @SacramentoKings you just lost another fan and season ticket holder. #kingsaretrash",
    "825": "@SacramentoKings @MichelobULTRA @buddyhield @hoopculture13 @hbarnes @dameology Y’all stink! https://t.co/kWI0SnpVUO",
    "826": ".@SacramentoKings Y'all lost by FITY THREE POINTS TONIGHT.  OWN IT.",
    "827": "@SacramentoKings @Raw2512 @TerenceDavisJr @RealTristan13 @TyHaliburton22 1 common theme. \nLoss. https://t.co/HAwNVLAavi",
    "828": "@TerryFranconia @SacramentoKings Man I was praying that shit wasn't real cuz if he turned that down he's legitimately got to be an undercover plant by someone else in the Eastern conference (Brad Stevens) to tear down the 76ers from within",
    "829": "@MVPJaylenBrown Had to rub it in @SacramentoKings",
    "830": "What just happened to the @SacramentoKings ?",
    "831": "@SacramentoKings I would to ask you if your going to tank just tell us! Don’t stroll a team out there and have them  pretend to play basketball!",
    "832": "53 point loss! Man it’s hard being a @SacramentoKings fan! We deserve better.",
    "833": "Boston Celtics cruise past Sacramento Kings 128-75 Jayson Tatum 36points 4rebounds 6assists and Jaylen Brown 30points 10rebounds 3assists.",
    "834": "Can someone explain me what happened in the @celtics vs @SacramentoKings game? 😮\nWhat a blowout!!!\nAt least my boy @nemi1599 played some minutes",
    "835": "@SacramentoKings Worst loss in 21 years for the kings, but honestly nothing surprises me with this team anymore",
    "836": "Sacramento Kings should just dissolve cos what kinda result ???",
    "837": "SACRAMENTO KINGS WITH SEASON LOW 75 POINTS WOW\n\nHOW MUCH FOR @swipathefox  ? \n\n@dg_riff @tralang_21 📞📞\n\n#Pelicans https://t.co/vShDgZ6OuG",
    "838": "@avdalaschi @SacramentoKings Yikes",
    "839": "No tacos as the @SacramentoKings were 6-33 from 3. Impressively terrible. \n\n#Kangz https://t.co/S5YugEIxpR",
    "840": "@Cigarette_Haver @SacramentoKings Don’t think that offer was real that was leaked recently",
    "841": "The Sacramento Kings just lost by 53 points tonight. This some shit you'd expect a college team to lose by not a NBA team.",
    "842": "@SBNation 2018 nba draft Sacramento Kings select LUKA DONCIC from Real Madrid",
    "843": "@SacramentoKings just checkin in to make sure you’re okay",
    "844": "@TerryFranconia @SacramentoKings *and Tobias Harris",
    "845": "The Boston Celtics crush the Sacramento Kings 128-75\n\nJayson Tatum\n36p 4r 6a 1b\nJaylen Brown\n30p 10r 3a\nRobert Williams III\n13p 17r 4a 3s 2b\n\nBuddy Hield\n11p 5r 1a 1s",
    "846": "@TerryFranconia @SacramentoKings Bro they tried😭😭\n\nMorey must be stopped and I won't let him keep getting away with this",
    "847": "@SacramentoKings That was quite a clown show vs. Boston tonight. You should be proud of your team. https://t.co/NgWW0ppNO7",
    "848": "The Sacramento Kings haven’t had a winning season since I was in middle school. I’m now 30. The highlight of my fandom over the last 16 years was that they didn’t move. Being a fan of this team has been a miserable experience, and this season is the low point of many low points.",
    "849": "They need to make the Sacramento Kings a college team because WTF...",
    "850": "How @celtics did @SacramentoKings *********** https://t.co/2I68PWdumc",
    "851": "Shout out @SacramentoKings for the IG post today!!!🔥😎 the questions is who won that Corona x kings mini fridge???? #SacramentoProud #KingsBaby https://t.co/JEe5M7WwEc",
    "852": "@SacramentoKings @Verizon @TyHaliburton22 @TerenceDavisJr @hbarnes @MB3FIVE @Rich_Holmes22 Moments before disaster",
    "853": "@SacramentoKings @Verizon @TyHaliburton22 @TerenceDavisJr @hbarnes @MB3FIVE @Rich_Holmes22 The SOFTEST team in the NBA!",
    "854": "The @SacramentoKings are down bad they need Ben Simmons bad he’s  the only player that can save them from the hell they are stuck in https://t.co/3tGyUOq7ap",
    "855": "Look at the bright side. Sacramento Kings will be doing the BOGO ticket sales for the rest of the season.",
    "856": "Pull your pants up @SacramentoKings",
    "857": "@SacramentoKings y’all are absolutely dog shit",
    "858": "I stopped caring about the Sacramento Kings about 2 years ago. My life and mental health have been better for it. Hope is what drives sports teams and their fan base. The Kings have none 🤷🏻‍♂️ https://t.co/eBEX5syKIw",
    "859": "@Pp_doesit Welcome to the Sacramento Kings!",
    "860": "@SacramentoKings should be embarrassed.  As a kings fan who spends money to go to the games.  This is just fucking redic. Fire everyone.  Except the social media guys.",
    "861": "WTF @SacramentoKings @Vivek  Fix this shit!! Sacramento fans deserve better!!!!!!!!!!!!!!!!",
    "862": "75 points in 4 quarters from Sacramento kings\n\nMy God what in fuvks is this madness? 😳😳 https://t.co/zKgL7YPjlv",
    "863": "@SacramentoKings post score pls",
    "864": "CELTICS JUST BLEW OUT KINGS BY 53 PTS! The highest scorer for Sacramento was Buddy Hield with 11 PTS 😳\n\nJayson Tatum: 36 PTS, 14/23 FGM, 7/14 3PM\nJaylen Brown: 30 PTS, 10 REB, 11/19 FGM, 5/12 3PM\nRobert Williams III: 13 PTS, 17 REB, 4 AST, 3 STL, 2 BLK, 6/8 FGM\n\nWHAT A BLOWOUT! https://t.co/oeD5lUsQi7",
    "865": "@SacramentoKings @MichelobULTRA @buddyhield @hoopculture13 @hbarnes @dameology Couldnt catch the game tonight, how are the Kings doing?",
    "866": "You’re an embarrassment @SacramentoKings hire me",
    "867": "@PBSImpulse9 @SacramentoKings Niggas doing they best to get traded up outta there..",
    "868": "@SacramentoKings building whole ass neighborhoods https://t.co/tAHVAM3yZE",
    "869": "The @celtics just left the @SacramentoKings in the elevator like: https://t.co/NXRM7ZyGMk https://t.co/J9zQiRbVmJ",
    "870": "Did somebody tell the @SacramentoKings they had a game tonight? 😳 https://t.co/HkljXwJPMA",
    "871": "The Sacramento Kings scored just 75 points tonight -- their lowest since April 4th, 2014.\n\nThey converted just 30.9% from the field tonight -- the lowest since October 29th, 2014.",
    "872": "Relocate the Sacramento Kings and force the current ownership group out that shit need to be torn down",
    "873": "It’s no way the Sacramento kings are a professional team",
    "874": "@SacramentoKings all I can say is come on learn to NBA. What a joke of a game. https://t.co/tkhGK9ImSC",
    "875": "@SacramentoKings @MichelobULTRA @buddyhield @hoopculture13 @hbarnes @dameology post the score, it's been 69 hrs",
    "876": "Only untradeable Sacramento King is the Golden 1 Center. Everybody else on the table",
    "877": "@SacramentoKings @Verizon @TyHaliburton22 @TerenceDavisJr @hbarnes @MB3FIVE @Rich_Holmes22 Kings fans deserve better. What an absolute joke. Why are some kings players smiling? They are more interested in the post game handshakes. Any players that aren’t pissed and embarrassed are LOSERS! They’ll never win anything.  53 point loss. No more $ spent from me. Blow it up!",
    "878": "The #Celtics beat the Sacramento #Kings, 128 to 75, Tuesday night at TD Garden. https://t.co/i5xDCUV1Rw",
    "879": "@SacramentoKings @MichelobULTRA @buddyhield @hoopculture13 @hbarnes @dameology I’m a Kings fan, but this is beyond embarrassing",
    "880": "OMG @SacramentoKings are in the record books, tied for the 13th worst loss in the history of the NBA!  #SACvsBOS",
    "881": "@SacramentoKings this aged like milk",
    "882": "Sacramento Kings 🥀 https://t.co/v0WbVvCRGS",
    "883": "@celtics and @SacramentoKings can both go fuck themselves for that score.",
    "884": "@FCartoscelli3 @Sports1140KHTK But hey, it is only the 23rd loss by 40 points or more and just the 4th highest margin of defeat in @SacramentoKings history.  #perspective",
    "885": "WATCH: Boston’s Aaron Nesmith gets and-1 while breaking the ankles of Sacramento’s Louis King https://t.co/FNtTojTwmx",
    "886": "This is who Tobias is every night btw @SacramentoKings @ATLHawks",
    "887": "The Sacramento Kings just suffered the 2nd biggest loss (53 PTS) this season. OKC still holds the #1 deficit at 73 PTS. The HELL NAW Kings amaze me ❤️",
    "888": "@SilingWu LOL, Enes Freedom. The Celtics beat the Sacramento Kings 128-75 tonight and he still scored 0 points. 😄🏀",
    "889": "Shoutout to anyone who has to work for Sacramento Kings media and/or sales.",
    "890": "Tweet something I dare you @SacramentoKings",
    "891": "Put all the @SacramentoKings on notice. https://t.co/pC2IljDMhm",
    "892": "I'm a Kings fan for life. Don't give a dam about the haters. @SacramentoKings I got you, you'll continue to get my business, my loyalty, my support.",
    "893": "@mmcnair….. plz help… we are losing hope…. Ur losing fans….@SacramentoKings please….",
    "894": "Congrats @SacramentoKings! 4th worse loss in Franchise History! Quite Impressive to lose by 53!",
    "895": "@SeanCunningham I thought I had seen the worst before, but apparently not. \n\nThis is pathetic. Congrats @SacramentoKings",
    "896": "1 Sacramento King was in double figures (at 11 points) and Harrison Barnes shot 1 for 12? good god",
    "897": "Sacramento has had the Kings long enough, bring the Sonics back man",
    "898": "The @celtics go off tonight against the @SacramentoKings 128-75",
    "899": "Is this a joke?\n\nNo…\n\nBut the @SacramentoKings are🙃 https://t.co/RtjqKrkpkn",
    "900": "If u like the  sacramento kings you genuinely like to suffer, They fucking suck",
    "901": "@SacramentoKings wtf was that 😳😳😳 #Sacramento #talkingbbuckets #NBATwitter",
    "902": "@SacramentoKings Your Worst Nightmare https://t.co/Y5XpL1bDCy",
    "903": "@hello90603534 Thats not the NBA, that’s the Kings…you can’t lump the entire league into what the coaching staff in Sacramento allows. https://t.co/jTrjlBJQCQ",
    "904": "Send the @SacramentoKings to Edmonton!! We need another Canadian basketball team here so I can go watch games 😄.",
    "905": "RIP Sacramento Kings 😔 https://t.co/Yc427hb6bf",
    "906": "@SacramentoKings The one where they were actually winning games",
    "907": "@SacramentoKings @MichelobULTRA @buddyhield @hoopculture13 @hbarnes @dameology Y’all are good?",
    "908": "🏀 Final Score 🏀\nSacramento Kings 75 - 128 Boston Celtics\n\nJayson Tatum 54.5 DK, 50.8 FD\nRobert Williams 51.8 DK, 54.4 FD\nJaylen Brown 51.0 DK, 46.5 FD\n\nhttps://t.co/IIuYCTQkL5",
    "909": "Wtf\nGet a summary of the Sacramento Kings vs. Boston Celtics basketball game https://t.co/Fa73TzHZGG\nvia @ESPN App https://t.co/C2LTEaAOwG",
    "910": "Not a single player on the Sacramento Kings had over 12 points tonight… 🤯",
    "911": "Assuming that the Rockets don’t mount a valiant comeback, the Kings will fall to 13th in the Western Conference tonight.\n\nSacramento will move up to 6th in the lottery, trailing the 5th place Pacers by a half game.",
    "912": "@SacramentoKings retire the whole franchise",
    "913": "@FabMeloHOF @j4webber @NBA please investigate the @SacramentoKings for tanking. They should be fined and lose draft picks.  Tanking is bad for the game!",
    "914": "Jaylen Brown and Jayson Tatum scored 66 points. The Sacramento Kings scored 75. Brown and Tatum didn’t play the 4th quarter.",
    "915": "@SacramentoKings shame shame shame",
    "916": "Dedicate this one to Sacramento Kings fans everywhere. Better days are coming. One day… https://t.co/2voIDKv6t7",
    "917": "Sacramento Kings, https://t.co/p2fueXuFBR",
    "918": "Hey @SacramentoKings, can you just leave us Buddy Hield and Richaun Holmes before you guys depart from Logan? @BCCoachStevens let’s get a deal done.",
    "919": "Sacramento kings lost by 53  in my eyes they the Sacramento princesses",
    "920": "So close! @SacramentoKings",
    "921": "Someone should start a GoFundMe to buy the Sacramento Kings from Vivek",
    "922": "We deserve so much more then this 🤦🏽‍♂️this is embarrassing 😣 @SacramentoKings https://t.co/7GcX4RKAj2",
    "923": "refund any money i’ve ever spent on this organization .@Vivek @SacramentoKings",
    "924": "The .@SacramentoKings did not post a single highlight of tonight's game.",
    "925": "The Sacramento Kings are cursed they're just never going to be a good basketball team",
    "926": "The Sacramento Kings lost by 53. Their top scorer on the night was Buddy Hield, with 11 points.",
    "927": "@SacramentoKings just tank",
    "928": "Time to move the @SacramentoKings to Seattle! \n#NBA",
    "929": "@SacramentoKings @MichelobULTRA @buddyhield @hoopculture13 @hbarnes @dameology Tweet out the final score",
    "930": "I see the @celtics are up 58 with just over 2 minutes left against the @SacramentoKings \nDo we feel they can hold on?\n#BOSvsSAC\n#SACvsBOS",
    "931": "@traedagreat11 hot take: the sacramento kings are trash and shouldn't exist",
    "932": "Kings trounced by 53 tonight in Boston. Its the 4th largest margin of defeat in the Sacramento era. 128-75 the final.",
    "933": "@JDub9911 @SacramentoKings You thought that was firing their coach but alas",
    "934": "The Sacramento Kings just lost by 50+ points for the first time since November 2, 1991 when the Golden State Warriors beat them by 62 points.\n\n30 years.\n\nWhat an absolute embarrassment.",
    "935": "Final\n\nBoston 128\nSacramento 75\n\nKings come to State Farm Arena tomorrow on the heels of a 53-point loss.",
    "936": "@SacramentoKings @Verizon @TyHaliburton22 @TerenceDavisJr @hbarnes @MB3FIVE @Rich_Holmes22 I don't know if I'd ever leave the locker room after today. How embarrassing.",
    "937": "@PBSImpulse9 @SacramentoKings No they were there I saw them. Those were the guys in purple just running around, right?",
    "938": "60 points on @SacramentoKings 😬😬 \nCan't stop this team 💚",
    "939": "@SacramentoKings thanks for playin like the court jesters today \n\n#Kings #Celtics",
    "940": "As go the Sacramento Kings, so go the Louis Kings, it seems.",
    "941": "The Sacramento kings are such an embarrassment lol",
    "942": "@CarmichaelDave @SacramentoKings in the history of sports, has an interim coach ever been fired after the original coach has been fired? Asking for an owner…",
    "943": "Your team is dumpster fire trash @SacramentoKings",
    "944": "@SacramentoKings is this a joke? I feel like @nbcsnl was foreshadowing the rest of out lowly Kings fans season. We deserve better. Well done-Let @Golden1Center sit empty and any positive cash flow dry up until management change things. #FDaKings #nodirection (now down 60) https://t.co/XaNkfs6sAJ",
    "945": "Sacramento Kings getting fucking raped lmao",
    "946": "@thatl0calguy @SacramentoKings please sign us.",
    "947": "Equivalent of watching a Sacramento Kings game https://t.co/rWTOTiM5T4",
    "948": "The @SacramentoKings once were down 60 today.\n\nThey gotta do something in the name of making a statement.",
    "949": "Did you forget there was a game tonight? @SacramentoKings",
    "950": "@SacramentoKings BUTT NAKED NASTY ON PUBLIC TELEVISION? FOR EVERYONE TO SEE???",
    "951": "The panic and flop sweat at Sacramento  Kings headquarters has to be enornous. That's a recipe for an all-time awful, knee-jerk trade. And the league will be laughing",
    "952": "Defund and cut @SacramentoKings outta the @NBA now !!!",
    "953": "@ComatoseSosa @fattestmallon @FaridTheDeafGuy @Raidernugg209 @ratchhhelss as a Sacramento native, i truly do want the Kings to succeed. y’all deserve better.",
    "954": "If I was @SacramentoKings management, I’d make the team hitchhike back to CA. https://t.co/VdBHkywPUt",
    "955": "Defund the Sacramento Kings",
    "956": "Sacramento kings💀💀💀",
    "957": "It’s an embarrassing night to be a Sacramento Kings fan… I am sorry for anyone who paid to go to this game!! 😑 https://t.co/5ab3oiaOs5",
    "958": "Posted it few days ago and I’m saying it again….. I’d blow up the @SacramentoKings beyond Recognition I mean fubar …seriously …EVERYBODY GONE players, coach’s front office I mean the guys who clean the building..if your part of this absolute catastrophe in anyway …your gone!",
    "959": "@AllanDagio @SacramentoKings It’s honestly impressive how bad we are lmao",
    "960": "Oh my god the Sacramento kings are getting mopped",
    "961": "The @SacramentoKings are dead to me…",
    "962": "@SacramentoKings WTH? No excuses for a HORRENDOUS blow out. A loss is one thing, but no heart. No effort. Ridiculous. Fans &amp; the city deserve better. Start the guys from the Stockton Kings at least they have grit &amp; a chip on their shoulder #sacramentokings",
    "963": "@SacramentoKings @Vivek @mmcnair Down 55. The Celtics announcers are calling this a summer league game. DO SOMETHING!!!! The players don’t care. Get new ones. We all love our players. But we are losing our love for this team and it’s decision makers.",
    "964": "@SacramentoKings suck @Vivek is the GOAT @CarmichaelDave is sad",
    "965": "The @SacramentoKings are doing an actual @nbcsnl skit against the @celtics .",
    "966": "The Sacramento Kings 🤮",
    "967": "Sacramento Kings down 55…So DeAndre Jordan for Buddy Hield who says no 😂😂😂",
    "968": "@SacramentoKings  has finally outscored Jayson Tatum and Jaylen brown with 3 mins left in the 4th.\n\nFun fact the Jays didn’t play the 4th qtr.@celtics",
    "969": "@KyleNeubeck As the @SacramentoKings only reason to go to Boston was Newbury st. Because it wasn't to play basketball",
    "970": "@SacramentoKings I'll keep that in mind",
    "971": "Hey @SacramentoKings  y'all alright there?",
    "972": "@tgoody97 @SacramentoKings Damn called it",
    "973": "Joel Embiid and Tobias Harris outscored the Kings tonight. \n\nIt’s time to stop messing around. @SacramentoKings",
    "974": "The Sacramento Kings are so bad they should change their name to the Flyers",
    "975": "@SacramentoKings are you all ok?",
    "976": "@SacramentoKings @Verizon @TyHaliburton22 @TerenceDavisJr @hbarnes @MB3FIVE @Rich_Holmes22 Are you taking the fucking piss or what?",
    "977": "We seriously need the league step in here…get the Kings sold and out of Sacramento. https://t.co/sTKsC22FHi",
    "978": "Don’t let the @SacramentoKings catch wind of Tobias dominating on the floor 🙏 https://t.co/1dE0kuznpB",
    "979": "Beat the 💩 outta  @SacramentoKings",
    "980": "@SacramentoKings @mmcnair We deserve better",
    "981": "I don’t normally comment on the @SacramentoKings but good god what an embarrassing organization",
    "982": "ayo @SacramentoKings yall good?",
    "983": "Sacramento Kings ..... Its time https://t.co/esxKy0X43Q",
    "984": "Team should be moved to Seattle by tomorrow morning @SacramentoKings @Vivek https://t.co/Vde9EDxAyb",
    "985": "Boston Celtics versus Sacramento Kings highlights https://t.co/KUhKxz2ugA",
    "986": "Look at that 33 burger by Tobias tonight! Wow what a player!! @SacramentoKings @BrooklynNets @trailblazers",
    "987": "Jesus Christ what a humiliating performance by the Sacramento Kings. My god.\n\n#Kings",
    "988": "@DrChuckRx @SacramentoKings @JoeRaineri @robvenosports @SkeeProfit @celtics On the under here...Needed it after Hornets embarrassing themselves",
    "989": "Come get your man, @SacramentoKings https://t.co/eDBmY0Duy8",
    "990": "\"My pickup game two weeks ago looked a lot like this.\" -Scal \nGive it up to @Scalabrine for still playing well enough in his rec league to keep up with talent being displayed by the young @SacramentoKings roster.",
    "991": "Just delete the Sacramento kings",
    "992": "RIP to the Sacramento Kings",
    "993": "This sure would be helpful @SacramentoKings https://t.co/6lnYEgx6cO",
    "994": "Sacramento Kings y’all fuckin stink 🤬🗑🚮",
    "995": "We gotta do better. @SacramentoKings 😭😭😭😭 https://t.co/v6YkyYy5F4",
    "996": "sacramento kings can’t score 80 points",
    "997": "The @SacramentoKings are losing 115-66. Time to shake up The team. @BenSimmons25 book ur flight. You too Tobias.",
    "998": "@mhc_76 @SacramentoKings just settle for being mediocre Sacramento!",
    "999": "Sacramento Kings are BOOTY BUTT CHEEKS",
    "1000": "@j_mistry3 @SacramentoKings Lmfao",
    "1001": "@dan92g @SacramentoKings Bro. How . Answer that HOW 😭",
    "1002": "@SacramentoKings just leave De’Aaron in Boston",
    "1003": "Hmmm looks like the @SacramentoKings just didnt have an OFF NIGHT it looks like they havent woken up and are sleepwalking",
    "1004": "&amp; fuck you too @SacramentoKings https://t.co/AouAYRtmuN",
    "1005": "My most recent article - “Stockton Kings NBA G League Update - January 2022”\n\nA few of these @StocktonKings guys are in the #sacramentokings game right now! \n\nGo Kings! #sacramentoproud \n\nhttps://t.co/Nt9zuTO9VX",
    "1006": "Do better\n\n@SacramentoKings",
    "1007": "@SacramentoKings hey what’s the score?",
    "1008": "@James_HamNBA Fyi... in the history of the team, the @SacramentoKings have suffered 22 loses by a total of 40 points or more.",
    "1009": "Live look of the @SacramentoKings in Boston tonight. https://t.co/RzKqen2LNk",
    "1010": "@SacramentoKings sure looks like you could use Ben Simmons and Tobias Harris",
    "1011": "Tobias had 31 tonight @SacramentoKings",
    "1012": "@BarrettSallee Sacramento Kings https://t.co/VTAPekfgVi",
    "1013": "@sixers @cryptocom @SacramentoKings I hope you watched this game",
    "1014": "@SacramentoKings pleaseee let Holmes get a double double . My Caesar bet would go crazy",
    "1015": "Hahaha @SacramentoKings twitter doesnt even update the score 😭🤟🏻 that is how ugly tonight is for them. Hahaha 🤡🤡🤡🤡🤡🤡",
    "1016": "Pls put Hali back in I need 1 assist 😩 @SacramentoKings",
    "1017": "Tobias Harris had 33/11 @SacramentoKings @cavs @spurs @celtics @WashWizards @BrooklynNets",
    "1018": "@SacramentoKings @MichelobULTRA @buddyhield @hoopculture13 @hbarnes @dameology guys please learn to play ball you're ruining my 2030 nba championship agenda",
    "1019": "Alvin Gentry giveth &amp; Alvin Gentry taketh away...OOF!\nOnly team last 2 weeks w/ offensive efficiency &gt; 115 but w/ NEGATIVE NET rating= @SacramentoKings 🤦‍♂️\n@JoeRaineri @robvenosports @SkeeProfit @MejiaDinero\nPlay little D-&gt; W\nPlay SOLID D-&gt; 10+ pt. W\nPlay @celtics amounts of D-&gt; https://t.co/dzJC5DIhas",
    "1020": "@kncitom @SacramentoKings Not only do they suck I don't know any of the guys on the court right now (maybe it's better this way)",
    "1021": "Tobias was incredible today @SacramentoKings",
    "1022": "Good lord, free De’Aaron Fox @SacramentoKings #NBA https://t.co/NcGjsDjHhe",
    "1023": "@SHAQ Yo please get Us Mark Jackson for Head Coach....Sacramento Kings Fan!!",
    "1024": "The Sacramento Kings just substituted in the roster of the Stockton Kings.\n\nAnd not because they are blowing out the other team.",
    "1025": "The @SacramentoKings are the @officialBBWAA of the NBA",
    "1026": "Who let the city of Sacramento have a pro sports franchise? What a disgrace. Cheapest ticket to a Celtics game since the 70s, and I still feel like I overpaid. Legitimately 0 good players on the Kings. Wow\n\n#NBA #SacrementoProud #BleedGreen @DanKelley66",
    "1027": "@NinjaBands @SacramentoKings @spurs oh whoops didn’t mean to tag u guys! Haha!",
    "1028": "The Sacramento kings losing by 50",
    "1029": "@heynurse_Arlene @AtwalKings05 @Vivek @mmcnair Nope. Jaguars, timberwolves, Mariners, red wings, etc. Sacramento is a one-team town so their fans don’t follow other sports and realize there are teams with even longer playoff droughts than the kings.",
    "1030": "Are the Sacramento kings okay? 😬#nba https://t.co/9cnR4ToKQi",
    "1031": "@_DevinDeane @SacramentoKings This team needs Jesus Christ &amp; the rapture to come",
    "1032": "Y’all ass @SacramentoKings",
    "1033": "@DougieMc_Kings @SacramentoKings So are you saying I should just hit delete and not actually watch the game?😳🤨",
    "1034": "@SKings916 @SacramentoKings Yeah ugly game luckily the guys get a chance to play tomorrow, so hopefully they can win and wash some of this out of their mouth",
    "1035": "@MattGeorgeSAC How do you not just blow it up? Even the stadium, leave no remains of the Sacramento Kings. 2 decades of shit, pack it up.",
    "1036": "How are the Sacramento Kings an NBA team 💀💀💀💀💀 https://t.co/EkWGFBbNr6",
    "1037": "When are the @SacramentoKings holding open tryouts for people who want to play basketball",
    "1038": "The benchmark is still 75. 13 points from scoring the fewest points in a game this season. @SacramentoKings",
    "1039": "This is why I stopped watching games @SacramentoKings 🥴🥴🥴",
    "1040": "Post a tweet, I dare you @SacramentoKings",
    "1041": "The Sacramento Kings should be relegated to the G-league",
    "1042": "The Sacramento Kings have 59 points while I type this with 6:30 left in the fourth. #nba #kings",
    "1043": "Sacramento Kings wtf……..",
    "1044": "@ShyntR @SacramentoKings @MichelobULTRA @buddyhield @hoopculture13 @hbarnes @dameology They probably be better off in Mc Donald’s right now cooking up food 😂",
    "1045": "@PositronicWoman it should be the sacramento kings but that keeps falling through and I am upset, because I always had a soft spot for the sonics. and, of course, I’m a storm fan to this very day",
    "1046": "We are now witnessing the Sacramento Kings Summer League team",
    "1047": "Luke Walton has the 2nd highest winning % in Sacramento Kings history. That says a lot. lol",
    "1048": "Jayson Tatum and jaylen brown after 3 Quarters combine for 66 points \nSacramento Kings after 3 quarters 55 points.🤯",
    "1049": "tobias almost outscoring the @SacramentoKings  himself tonight",
    "1050": "Quit @SacramentoKings",
    "1051": "Y’all franchise so pathetic @SacramentoKings",
    "1052": "I don’t think I’ll ever take the Sacramento Kings seriously",
    "1053": "@SacramentoKings you need some help i got y’all 🤣🤣👀 https://t.co/yRhBFBlDIu",
    "1054": "This game is literally hurtful. 59 to 106? I love you @SacramentoKings. But for real? Like…. Did y’all even try? ….",
    "1055": "The Sacramento kings is a disgrace of a franchise basketball team.",
    "1056": "@Dom_2k it's against the @SacramentoKings Dom... relax",
    "1057": "@SacramentoKings time to hit the red button and blow the squad up. Embarrassing tonight",
    "1058": "Kings are actually a shame to Sacramento",
    "1059": "National writers when they finally get around to watching ‘21-22 Sacramento Kings  https://t.co/eEiQhkUmq9",
    "1060": "@RealMikeBradley @SacramentoKings They’re seeing first hand that Aaron Nesmith is their future",
    "1061": "@SacramentoKings Tobias Harris and Ben Simmons will get you to the playoffs",
    "1062": "@SacramentoKings bruh please put Buddy back in",
    "1063": "@Dylan799_ the kings are leaving sacramento in 2025",
    "1064": "@DaniloA76 Bro you’re a fuckn Sacramento Kings fan, why are you talking? Lol",
    "1065": "Fun fact: Tobias Harris has more points tonight than the Sacramento Kings had as a team at halftime",
    "1066": "Sacramento Kings to the Celtics: https://t.co/iwwqXxgbxx",
    "1067": "@SacramentoKings Randle can literally drop 20 a night for y’all. call Leon https://t.co/LTGoES63pc",
    "1068": "@DougieMc_Kings @SacramentoKings We’re trying to break the 70 point record. We’re on our way:(",
    "1069": "@SacramentoKings just make a trade already cause oh my",
    "1070": "@redford Patrick, I'm a long time Kings fan. Please expand on \"compete.\"\n\nFun fact - did you know award winning film \"Lady Bird\" was actually set and filmed in Sacramento?",
    "1071": "The Sacramento Kings need to be disbanded and sold to the Dominican basketball league",
    "1072": "I guessing  @SacramentoKings are tanking to secure a lottery pick for the Sixers 🤷🏾‍♂️",
    "1073": "If you had the Sacramento Kings +60 alternate line tonight you’re looking decent, but not great",
    "1074": "Yikes @SacramentoKings",
    "1075": "The Sacramento Kings are the laughing stock of the NBA and have been for years. Big free agents don’t want to come, players constantly want out and the ones who don’t are cashing game checks to lose in blowout fashion. How do you fix this?",
    "1076": "put them in it’s time @SacramentoKings https://t.co/RNj7tHtFJU",
    "1077": "Price has gone 🆙 @SacramentoKings",
    "1078": "@sportssapphic @SacramentoKings TT stands for Titty Tuesday, put him in!",
    "1079": "Smfh @SacramentoKings .. i can’t even explain this anymore .. this is not good basketball ..",
    "1080": "The Sacramento Kings are getting blown out by 47 against Boston with 10 minutes left. Um yea, they better be looking to make a trade.",
    "1081": "In case anyone did not know… the Sacramento Kings officially suck.. get rid of the entire team. Straight up an embarrassment. It was Luke’s fault.",
    "1082": "I'm finding myself actually sad for the @SacramentoKings #NBA #NBATwitter Harrison Barnes, Fox and Hield I think could be huge pieces for contending teams but getting absolutely roasted by this #Celtics team is very sad #Yikes",
    "1083": "You just gotta do the deal after this shit @SacramentoKings",
    "1084": "@SacramentoKings Everyone’s tradable tonight",
    "1085": "@_Talkin_NBA @SportsCenter De'Aron Fox needs to get out of Sacramento. The #Kings are wasting his career",
    "1086": "*looks through the NBA scoreboard*\n\n😳😳😳\n\nThat’s what the Kings get for staying in Sacramento instead of moving to Seattle https://t.co/Lg4q6d1IM6",
    "1087": "Relegate the Sacramento Kings.",
    "1088": "goodness me is what we’re doing to @SacramentoKings legal? 😭",
    "1089": "Somebody send the Sacramento Kings some help !!",
    "1090": "@NinjaBands You could have this on a NIGHTLY basis @SacramentoKings @ATLHawks",
    "1091": "Sacramento Kings are such a poverty franchise",
    "1092": "Blow it up, holy hell @SacramentoKings https://t.co/zKXzA7omeV",
    "1093": "Are we really down 44 points??? So the @SacramentoKings are the @Lions of the NBA... 🗑️🤢🤮",
    "1094": "If the @SacramentoKings don’t score 65, Dougie will delete his account in protest",
    "1095": ".@SacramentoKings have you seen this hooper @tobias31?",
    "1096": "Jayson Tatum and Jaylen Brown are outscoring the entire Sacramento Kings team (66-55) through 3 quarters 🤯",
    "1097": "@LegendOfWinning They need to sell the Sacramento Kings.",
    "1098": "Please put haliburton back out there I need one more assist @SacramentoKings",
    "1099": "@James_HamNBA If the Kings get completely blown out in Boston, does it make a sound in Sacramento anymore? #HereWeBuildApathy",
    "1100": "Kings in Boston right now @celtics @SacramentoKings #BleedGreen #SacramentoProud https://t.co/r5gRyxo2u1",
    "1101": "Sacramento Kings with an inspirational effort tonight.  \n\n#NBA",
    "1102": "@SacramentoKings come get Westbrook https://t.co/ImTDflkwsd",
    "1103": "For Fox, Hield, and Bagley - I AM IN! A @BenSimmons25 @TyHaliburton22 backcourt? Vet leadership with @hbarnes &amp; @tobias31?? Can this please happen??? @SacramentoKings https://t.co/7RzChj87nq",
    "1104": "@SacramentoKings do better :/",
    "1105": "it’s the end of the 3rd and @jaytatum0 &amp; @FCHWPO have more than the whole #Sacramento_Kings 30 and 36…. @KendrickPerkins … they J’a are getting it done #together",
    "1106": "Sacramento Kings are #depression",
    "1107": "The @celtics are in @SacramentoKings ass https://t.co/PRY98Obvpe",
    "1108": "@MajesticMaxwel @SacramentoKings That team needs a complete reset",
    "1109": "Jayson Tatum (@jaytatum0): 36 points\nJaylen Brown (@FCHWPO): 30 points\n\n@SacramentoKings 55 points. \n\nThis is fun to watch.",
    "1110": "What crime did the Sacramento Kings commit 😂",
    "1111": "After 3 quarters, the Sacramento Kings are only down by 11 points to Jayson Tatum &amp; Jaylen Brown! \n\n https://t.co/rMQp9PBvHf",
    "1112": "Thru 3 Quarters\n\nSacramento Kings: 55 points\nJaylen Brown/Jayson Tatum: 66 points",
    "1113": "Jaylen Brown and Jayson Tatum 66\nSacramento Kings 55\nEnd of 3rd \n😂",
    "1114": "I’m so done with these @SacramentoKings players.   Fuck them all…..\n#",
    "1115": "Jayson Tatum &amp; Jaylen Brown: 66 points  \nSacramento Kings entire team: 55 points 🤯 https://t.co/rLKyMdqzhV",
    "1116": "If Kings fans truly care about the futures of Fox and Haliburton they should be rooting for them to get out of Sacramento ASAP.",
    "1117": "Not watching the Sacramento Kings play has helped my mental health. What a joke team. They told us this was a playoff caliber team. Lol",
    "1118": "Indigno club @SacramentoKings https://t.co/NA3qcgKIaZ",
    "1119": "Tatum and Brown are outscoring the Sacramento Kings 66-55 through 3 quarters",
    "1120": "The Sacramento Kings: \"Irrelevant since 2006\" 🏀😂🗑️\n\nAlso, Bring Back The Sonics 💚💛🏀 https://t.co/yL52YykZ0t",
    "1121": "@NinjaBands As all sixers fans have been saying he’s the future of this team and he’s going nowhere! Great contract and player imo @SacramentoKings",
    "1122": "@BolWrld Bro thinks a game against the Sacramento Kings counts lmaoooo",
    "1123": "Tonight, in lieu of the principal actor @HayesTSN the role of “Sacramento Kings Drag Bunter” will be played by the @celtics https://t.co/1Queuf9OCD",
    "1124": "Once again, the NBA world is laughing at the Sacramento Kings--and it's well deserved.\n\nJayson Tatum &amp; Jaylen Brown have outscored the ENTIRE Kings team 66-55 through three quarters of play tonight.",
    "1125": "Tuned into the @SacramentoKings game for a brief moment and that was all I needed to see https://t.co/N3HyWrvFxw",
    "1126": "tatum and brown 66\n@SacramentoKings 55 https://t.co/7NHlqdVTSu",
    "1127": "Love seeing the Celtics actually pull away with a game for once, but I feel so bad for Kings fans. I lived in Sacramento for a couple years and that fanbase deserves a real team. Golden One Center is an extremely fun place to watch a game, too.",
    "1128": "Poor Sacramento Kings",
    "1129": "Sacramento Kings Twitter is ablaze right now…",
    "1130": "I uhhhhh just happened to open my sports app…. And uhhhhh @SacramentoKings you good? https://t.co/rnIlYZWOaW",
    "1131": "@thekingsherald I stopped watching the @SacramentoKings about 2 months ago. I’ve accepted that they are a bottom 5 team and they have no chance of being enjoyable to watch. It’s been so nice not caring if they win or lose.",
    "1132": "Con un Middleton inspirado, los Bucks se impusieron ante Sacramento Kings https://t.co/40FNVSe6gi",
    "1133": "When you realize Jayson Tatum and Jaylen Brown alone are outscoring the entire Sacramento Kings team https://t.co/3mPCvFa1YT",
    "1134": "@Go_Sixers_Go You watching, @SacramentoKings ??",
    "1135": "@John_Karalis A real blood-and-guts effort by the @SacramentoKings tonight.",
    "1136": "Jayson Tatum and Jaylen Brown:66\nSacramento  King:52",
    "1137": "Trade them all @SacramentoKings it’s been fun current team there were glimpses but it just ain’t working @BleacherReport @CarmichaelDave @NBA @ShamsCharania @mmcnair @Vivek",
    "1138": "Why is Sacramento Kings considered a team? 🤣",
    "1139": "Jaylen Brown + Jayson Tatum = 66 points \n\nSacramento Kings = 52 points .\n\n🤭☘️",
    "1140": "Play Neemias Queta the entire 4th quarter @SacramentoKings, or else... https://t.co/xEoApqA5P3",
    "1141": "You shouldn’t have a single untouchable player\nRespectfully @SacramentoKings",
    "1142": "@SacramentoKings this team is pitiful. Lakers(struggling) Clippers &amp; Denver &amp; Portland (major injuries) you would think at least a decent shot at a 8th seed. Nope. Straight trash.",
    "1143": "Man fuck the @SacramentoKings bum ass team",
    "1144": "@SacramentoKings do y’all get tired of being a bad franchise?",
    "1145": "the sacramento kings have to be the worst franchise in all of sports",
    "1146": "@SacramentoKings down 41, late third quarter. Got my rally cap on.",
    "1147": "Just let our boy come home enough is enough @SacramentoKings",
    "1148": "@SacramentoKings Dennis for Haliburton seems fair imo",
    "1149": "Not so long ago I actually wanted to watch the @SacramentoKings",
    "1150": "The @SacramentoKings are such an embarrassment. It legitimately hurts to be a fan",
    "1151": "@PfNasty @SacramentoKings Absolutely right but I still had to tweet the score",
    "1152": "@SacramentoKings @mmcnair I love the Kings from the bottom of my heart. Diehard since day 1. With that being said, this team is embarrassing. You guys suck!",
    "1153": "You gotta be fucking kidding me. @SacramentoKings wyd? https://t.co/maqAyIzXkG",
    "1154": "the Sacramento Kings are awful",
    "1155": "@SacramentoKings @MichelobULTRA @buddyhield @hoopculture13 @hbarnes @dameology Pathetic niggas need whole team retired right now cos sac shits can’t ball",
    "1156": "@SacramentoKings bruh what are we doing. We suck right now. Pull your head out your a$$es and play kings ball. There should be no freaking way we should be losing by this much.",
    "1157": "let's go sacramento kings https://t.co/y7wOSjf6uY",
    "1158": "Please investigate the Sacramento Kings",
    "1159": "@BigRorDawg @AtwalKings05 You ever feel like the water in Sacramento curses NBA players for the Kings? How can this many coaches, GM's, players all stink when in Sactown. Belinelli shot great for every team. Except the his time with Kings. Makes no sense. LOL",
    "1160": "@pacingand @SacramentoKings They clearly are not busy right now",
    "1161": "Boston Celtics – Sacramento Kings https://t.co/kcfTbbKRDC",
    "1162": "@PfNasty @SacramentoKings They're busy rn https://t.co/LdPspsuxwf",
    "1163": "@Zach_Brach @sixers @tobias31 @SacramentoKings LMAO",
    "1164": "@sixers @tobias31 getting that trade value up you see that @SacramentoKings",
    "1165": "@TimMaxwell22 If I were an NBA player on a playoff contending team and traded to the Sacramento Kings right now, I would take that very... Very personal.",
    "1166": "@SacramentoKings @ATLHawks Tobias Harris is with 29 points",
    "1167": "@MattGeorgeSAC How to tank poorly by the Sacramento Kings",
    "1168": "@sixers @tobias31 u like what u see @SacramentoKings",
    "1169": "@SpookaDoncic @SacramentoKings they sure aren’t watching their own",
    "1170": "Bruh.....Sacramento Kings have only scored 46 points with 4 minutes left in the 3rd quarter 😳 terrible shooting night for them but #bleedgreen",
    "1171": "tatum &amp; brown: 57 points\nsacramento kings: 46 points",
    "1172": "@SpookaDoncic @SacramentoKings Also, their own game.",
    "1173": "@SactownKings916 And what makes a STH want to pay for another season. Maybe do home improvements, take vacations, there’s a thought. Curious what the seat prices will be next year. You would think lower, by A LOT! @Vivek @SacramentoKings",
    "1174": "The Sacramento Kings are a bad basketball team. Goodness.",
    "1175": "price of the brick going up @SacramentoKings",
    "1176": "You are a sick organization @SacramentoKings",
    "1177": "@SacramentoKings you need Ben Simmons and Tobias Harris desperately.",
    "1178": "You guys watching this game @SacramentoKings?",
    "1179": "U like what u see ? @SacramentoKings",
    "1180": "Another new low for the Sacramento Kings tonight. How is this even a team?! https://t.co/zKugerHPXp",
    "1181": "This is going really well, @SacramentoKings. Great decision to keep @nemi1599 on the bench. It's not like you need a good defensive player or anything... #PlayNeemias https://t.co/c7dzivgNUl",
    "1182": ".@SacramentoKings y’all watching this performance by tobias?👀",
    "1183": "Shame on you. @SacramentoKings https://t.co/rdYa0B6NyU",
    "1184": "@johhnyauburn @AtwalKings05 I always say this, but the Kings could pay for the best front office and coaching staff that money can buy for less than they pay Buddy Hield. It's one of the only advantages a team like Sacramento can exploit since there's no salary cap on non-player payroll.",
    "1185": "Jayson Tatum &amp; Jaylen Brown: 57\nSacramento Kings: 44\n\nWe are five minutes away from the fourth quarter.",
    "1186": "@SnowMan2989 The Sacramento Kings sent the Washington Generals in their place I guess",
    "1187": "Sacramento ''Kings'' are absolutely shit, what's new?",
    "1188": "Trade us Fox @SacramentoKings https://t.co/4mQiR6iD0T",
    "1189": "@celtics are opening a can of whoop ass on the @SacramentoKings right now. Up 38 points as of these tweet. https://t.co/BTk17zrzXO",
    "1190": "@SacramentoKings They are about to fire someone after this game. 🤣",
    "1191": "@KOT4Q I’m a free agent and a decent corner shooter if y’all need me @SacramentoKings",
    "1192": "@SacramentoKings y’all don’t deserve Cancun",
    "1193": "If you’re the Sacramento Kings coaching staff …\n\n… do you just scrap the win and work on actual game sets and not just try and shoot your way back from a 40 point deficit?\n\nOr are you going for the WIN!?!? \n\n#SacramentoProud",
    "1194": "@SacramentoKings just put neemias caralho",
    "1195": "Sacramento Kings have 38 points halfway thru the 3rd quarter 🤮",
    "1196": "@SacramentoKings @HedgyYT No it’s not a basketball team stop lying",
    "1197": "Uhm... Sacramento Kings?",
    "1198": "@SacramentoKings CaN I gEt A team fuLL of lesS scuMBaGs that actUAlLy wANTS to WIn a GaME",
    "1199": "The Sacramento Kings, a “professional” basketball team, had 30 points at halftime. https://t.co/kVz50cV6XK",
    "1200": "33-73 sacramento kings https://t.co/PNmPkdRexq",
    "1201": "@SacramentoKings you good?",
    "1202": "Sacramento Kings have come so close to landing stars in the NBA Draft:\n\n2009\n4-Tyreke Evans\n7-Stephen Curry\n\n2011\n10-Jimmer Fredette\n11-Klay Thompson\n\n2012\n5-Thomas Robinson\n6-Damian Lillard\n\n2013\n7-Ben McLemore\n10-CJ McCollum\n\n2018\n2-Marvin Bagley III\n3-Luka Doncic\n\nSo close. https://t.co/7bDFVFMXxJ",
    "1203": "Got here a little late today but the 🍀 boys are doing work! Live at @Celtics vs @sacramentokings Game!!!\n#CelticsNation #BallisLife #BOSvsSAC #SACvsBOS #BleedGreen  #BostonCeltics #HoopsForHaiti https://t.co/kFERzvbf3z",
    "1204": "@SacramentoKings Are you ok?",
    "1205": "RELEASE ME!\n- A Sacramento Kings fan",
    "1206": "The @SacramentoKings making the @okcthunder look so much better…",
    "1207": "How are the Sacramento Kings this bad??",
    "1208": "If only you had a giant man known for his defense on the bench @SacramentoKings... 😟",
    "1209": "The Sacramento Kings have 33 points and the game is in the 3rd quarter. How do we get this Simmons to Kings deal done?",
    "1210": "Down 40. 30 more to go!! Let's go @SacramentoKings #SacramentoProud https://t.co/GztKuTsyWc",
    "1211": "Did the Sacramento Kings’ under team total for the 1H hit?",
    "1212": "@GarrysPICKS @SacramentoKings Just saw that thought it was a mistake kept refreshing the page 😂 https://t.co/Dp4FyP2qCh",
    "1213": ".@SacramentoKings should be disbanded after this...I’m only kinda kidding but woof",
    "1214": "@TaylorSchultze @SacramentoKings Gotta love it.",
    "1215": "The Sacramento Kings are losing by a 40 piece right now - I repeat - 40!!!!!!",
    "1216": "Not with the @SacramentoKings 🙄 https://t.co/YzMZQFfwlq",
    "1217": "Sacramento Kings scored 30 points in the first half🤮 Tatum, Brown, and Rob Williams the only guys doing anything for fantasy",
    "1218": "relegate the Sacramento Kings. it's time.",
    "1219": "down by 40 we've got em right where we want em @SacramentoKings",
    "1220": "boston is absolutely destroying this kings squad. absolutely inexcusable from sacramento",
    "1221": "Quite a future you have @SacramentoKings https://t.co/1PLdkeNsnb",
    "1222": "The @SacramentoKings are the best team in the league at hitting a new rock bottom! @Vivek",
    "1223": "Move the Sacramento Kings to Vegas 😭😭",
    "1224": "Yo @SacramentoKings we’ll take a few guys off your hands anyways",
    "1225": "I’m not sure a team has ever played worse than the Kings are tonight. This is truly remarkable to watch. Boston leads 73-33, and I’m starting to wonder if Tatum and Brown will legitimately outscore Sacramento by themselves.",
    "1226": "Looking good tonight, @SacramentoKings. No need to make a trade!",
    "1227": "@CarmichaelDave Dave, you did the work to help keep this franchise in Sacramento and I hope the Kings turn it around and become a championship contender for the fans. Thank you for you effort.",
    "1228": "Wow the J's are absolutely demolishing the entire Kings starting five. I think they've been reading our tweets you guys. And doesn't it feel like Marcus Smart is purposely playing bad so he doesn't get traded to the worst franchise in the NBA, the Sacramento Kings. #SACvsBOS #nba",
    "1229": "The Sacramento Kings are getting 40-pieced. Please go do something else and enjoy the rest of your evening.",
    "1230": "@GarrysPICKS @SacramentoKings And you know Boston can blow this lol",
    "1231": "The Sacramento Kings are the NBA’s Robitussin",
    "1232": "The @SacramentoKings are pathetic https://t.co/dHQnqyYI9P",
    "1233": "I would take my I-HOP team to upset the Sacramento Kings in a 1 game playoff. I-HOP team would obviously be favored",
    "1234": "That Sacramento Kings score real?",
    "1235": "Wtf is wrong with the Sacramento kings",
    "1236": "So Sacramento Kings already gave up at the halftime",
    "1237": "The sermon today is entitled, “Be happy for what you have because it can always be worse” and will be presented by the Sacramento Kings.",
    "1238": "@paginadosducks @brunnbrooks @Pens_Br Sacramento Kings?\n\nBlock",
    "1239": "@Lin_23X Lin… it’s the Sacramento Kings. It’s like playing the Washington Generals. No one takes them seriously. 😂\n\n(I am now living in the moment you write a tweet and realize Sacramento will beat your team and this will be shared amongst group chats with anonymous people.)",
    "1240": "Taking bets now on the final score. Will kings lose a game 112-60 or 150-72? @SacramentoKings",
    "1241": "Whenever you’re ready @sixers @SacramentoKings https://t.co/H3Ezfce5oH",
    "1242": "Would unironically love another no tweets game from my Sacramento kings",
    "1243": "The Sacramento Kings have 30 POINTS AT HALF?!???",
    "1244": "If there ever was a time for an interim coach to be fired, the @SacramentoKings should do it now.",
    "1245": "I’m told the @SacramentoKings are interested in an elite scorer like Tobias Harris, sources say",
    "1246": "The whole Sacramento Kings organisation should apologise to the country of Portugal for drafting Neemias Queta and making them watch this team..",
    "1247": "Only one answer: Ben Simmons @SacramentoKings https://t.co/Bdy1MvUZjr",
    "1248": "@AllanDagio @SacramentoKings Turned on the radio on the way home to hear G-man call them pathetic, Down 33-7. Turned it right back off smh",
    "1249": "@SacramentoKings @MichelobULTRA @buddyhield @hoopculture13 @hbarnes @dameology Y’all don’t post the scores after each quarter ? L Franchise",
    "1250": "On this day in 2016, DeMarcus Cousins of the Sacramento Kings drops 56 points against the Charlotte Hornets. #SchoolinSession https://t.co/0xbgomJUDE",
    "1251": "@scrabbby @SacramentoKings they tried, teams know we are vulnerable rn and taxing, no one wants buddy or barnes contract for what we want in return",
    "1252": "@Vivek You are the most worthless piece of shit owner on the face of this planet. How do you sleep at night not living up to your promise to Sacramento and Kings Fans? You are so pitiful. Please sell.",
    "1253": "@SacramentoKings Yeah how’s that going tonight? Lololololol",
    "1254": "@_Puzzlepiecedad @nbatopshot @SacramentoKings @TyHaliburton22 Cool.",
    "1255": "@SacramentoKings @Verizon @TyHaliburton22 @TerenceDavisJr @hbarnes @MB3FIVE @Rich_Holmes22 It Hurts! Just hurts..feels like the whole world laughing at us now. I feel like this game will go down as the worst game in NBA history in the last 20 years 😪 God help us.\" We need new ownership! \"",
    "1256": "@Breeno31 @sloprules @SacramentoKings 1-20 from 3 gotta love it 🔥 🔥🔥",
    "1257": "Every motherfucking day someone on this app says our guys suck and that the team will get better if we trade them for players on the Sacramento Kings https://t.co/Bqq1CekRZZ",
    "1258": "The play-in was basically made for the Sacramento Kings and they still find a way to make it seem hopeless they can even get there.\n\nThe Trailblazers have been ass. It couldn't be more open.",
    "1259": "@Dio4V @BronBronSZN123 @OubreSZN12pt2 Funny how Lakers have had the easiest schedule in the league and still under .500. U don’t need a big 3 to beat OKC and Sacramento Kings",
    "1260": "@SacramentoKings I'm more than willing to volunteer and play with a little heart since no one else will.",
    "1261": "The Sacramento kings should be banned for scoring 30 points at halftime, I don’t care how bad you are, that’s unacceptable dawg 🤣🤣",
    "1262": "@ChiefKory @SacramentoKings They might as well trade Barnes buddy Thompson etc tho for somebody young or picks like do something for the fans",
    "1263": "@JPanther_24 @LakersNation @Lakers @SacramentoKings Just what the kings need. More guards. Lol",
    "1264": "@momoragan is the only highlight tonight. @SacramentoKings",
    "1265": "Do @Sacrament0Kings understand what is different from BOS basketball?\n\n#SacramentoKings",
    "1266": "It’s pretty hard watching this game… @SacramentoKings #SacramentoProud",
    "1267": "😳😳😳😳😳 Send the Sacramento Kings to Nicaragua https://t.co/BVtah8ZrwN",
    "1268": "@SacramentoKings have 30 points in the first half against a completely average @celtics team this year.  #welcometobasketballhell",
    "1269": "@celtics @SacramentoKings need to go, 15 years not making the play-offs is a crime. Replace them with @BringBackSonics asap.",
    "1270": "I don’t even play for this team but even I wanna be traded @SacramentoKings @mmcnair",
    "1271": "@Tjonesonthenba If Jazz fans think they have it bad imagine being a Sacramento Kings fan....",
    "1272": "Kings are down 33. Blow up the entire operation Sacramento",
    "1273": "@John_Zannis If this is an audition game for the Sacramento Kings players then I want none of them after that 1st half lol",
    "1274": "@SacramentoKings forfeit the game you guys fucking suck!! Embarrassing nobody go to the games no more don’t waste your time and money until things change drastically smh 🤦🏻‍♂️",
    "1275": "The Sacramento Kings have allowed 30+ points in a single quarter 29 times  including tonight. (h/t:@FCartoscelli3)\n\nThe Sacramento Kings have 30 points at halftime.",
    "1276": "S/o @SacramentoKings for my never ending suffering",
    "1277": "Extremely Low-IQ + No Pride = 2021-2022 Sacramento Kings.",
    "1278": "The Sacramento Kings are an NBA team.",
    "1279": "@SacramentoKings I know you watching this https://t.co/UUv7JTsIF1",
    "1280": "Jayson Tatum &amp; Jaylen Brown: 44 points on 16/27\nSacramento Kings: 30 points on 10/49",
    "1281": "If The Sacramento Kings lose by 40 tonight they should be relegated and Luke Walton should get his job back @iamSacTownKing",
    "1282": "The Sacramento Kings have only 30 points in a 33 point halftime deficit to the Boston Celtics😳",
    "1283": "@kipp__smithers @sloprules @SacramentoKings have entered the chat",
    "1284": "@scrabbby @SacramentoKings im@afraid we’re tanking brother",
    "1285": "I forgot there was a @SacramentoKings game on tonite.  Guess the players did too. NOT #SacramentoProud",
    "1286": "For as frustrating as the #Celtics have been all year they have never put together a half like the Sacramento Kings just did. Holy wow. Just cancel the rest of the season.",
    "1287": "1/19 3s from the kings. Beautiful af. @SacramentoKings if your player can play like this. Then how about letting me play as well. Give me half of the pays. Looks like your player just having fun in the court.",
    "1288": "😞😞😞😞😞😞😞@NBA @SacramentoKings 30 Points Really bro come on Really Joke team https://t.co/2htglFv1TE",
    "1289": "@SacramentoKings 30 points at halftime… wtf are you guys doing?",
    "1290": "@SacramentoKings @MichelobULTRA @buddyhield @hoopculture13 @hbarnes @dameology I can’t believe you guys are this bad.",
    "1291": "Jayson Tatum and Jaylen Brown: 44\nSacramento Kings: 30",
    "1292": "Halftime: Celtics 63, Kings 30. Jayson Tatum has 24 points and 5 assists, plus another five 3s. Jaylen Brown has 20 points and seven boards. Only drama left is how long the two of them can continue to outscore Sacramento by themselves.",
    "1293": "The Sacramento Kings are down 63-20 to the play-in tourney Celtics.  They need to make a trade.",
    "1294": "At the half:\n\nTatum + Brown 44-30 Sacramento Kings",
    "1295": "The kings should catch an early flight back to Sacramento",
    "1296": "Celtics more than double up the Kings, lead Sacramento 63-30 at HALFTIME. \n\nunreal. \n\nSeason low for points in a half, obvi.",
    "1297": "is this a joke? \n\nam I being punked? \n@SacramentoKings @mmcnair",
    "1298": "@SacramentoKings who’s getting traded tonight or tomorrow",
    "1299": "Sacramento is 1-19 from 3 so far\n\n#Celtics #Kings",
    "1300": "Right now you would have a hard time convincing me anyone on @SacramentoKings cares!",
    "1301": "A free suggestion for Sacramento: might want to prevent Jayson Tatum from casually walking to the middle of the paint and repeatedly catching passes without any attempt to guard him. This is just wild to watch this Kings defense.",
    "1302": "Y'all are down by 28 in the SECOND QUARTER @SacramentoKings?  I'll be back for the next game. https://t.co/v4ICzllxzv",
    "1303": "Sacramento Kings have 13 points after the first quarter. \n\nJust a few weeks ago, I watched Lance Stephenson put up 20 OFF THE BENCH in a first quarter. \n\n#Kangz",
    "1304": "Kings fucking suck. Do something about it @SacramentoKings https://t.co/0rlfrwtDPO",
    "1305": "Oh this is BAD for the Kings. Bagley swarmed in the post and misses. Brown tears through Sacramento's front line on the break and finishes through contact. \n\n28 point game.",
    "1306": "Sacramento Kings is a limited team, but the Celtics are also playing well. Today, if it were another opponent, I believe that victory would be won anyway. https://t.co/90qL7tWmQc",
    "1307": "As a kings Fan I don’t really care anymore @SacramentoKings Help us enjoy our team please damm https://t.co/Hx38CVIJo5",
    "1308": "BLOW IT UP @SacramentoKings",
    "1309": "@HunterFelt Genuinely weird to have this thought. The Sacramento Kings are not a professional sports team.",
    "1310": "@celtics @SacramentoKings @NBCSBoston @985TheSportsHub @CSSportsBar Yes,I am listening to the game on the radio 98.5 FM. Great lead over the Kings and keep it up to halftime. \nGO CELTICS!",
    "1311": "@SacramentoKings give us buddy hield and or harrison barnes and we’ll let you score one",
    "1312": "@AlphaDogBets Show these to the sacramento kings players.",
    "1313": "I have migraine watching these fuckers from sacramento play balls. Those dribbles those shots those transition. @SacramentoKings please just ask the refs to blow the final whistle.",
    "1314": "terrible first quarter for Sacramento kings 🤦🏻‍♂️",
    "1315": "@DeuceMason Boycott @SacramentoKings",
    "1316": "@SacramentoKings are just embarrassing at this point",
    "1317": "@James_HamNBA Boycott the @SacramentoKings",
    "1318": "Hey @SacramentoKings not near a radio or TV unfortunately. Is there a game tonight?",
    "1319": "The next time I complain about my life, I’m going to think about the fact that Sacramento Kings fans exist",
    "1320": "see that Nesmith dunk @SacramentoKings ?",
    "1321": "Did i see a flash of an NFT for the Sacramento Kings?\n\nKnock yoursrlf out with your NFTs rich weirdos.\n\nEnjoy",
    "1322": "@whitepine45N @SInow Or the Sacramento Kings",
    "1323": "Haliburton is 0-5 FG and 0-4 from 3\n\n@SacramentoKings he’s not worth keeping so hand him over and we’ll give you Maya Jama’s boyfriend and “Tobi”",
    "1324": "Alleman vs The Sacramento Kings\n\nWho you got? https://t.co/YM29aeK9SL",
    "1325": "Can we have a Sacramento Kings trade by the half",
    "1326": "I wouldn't even be mad if Fox requests to be traded from this trash ass poverty infested team @SacramentoKings. cuz our fake slum dog millionaire owner is stupid and is holding this team back",
    "1327": "Sacramento kings getting an ass whopping too 😂😂",
    "1328": "Play Queta you poverty mfs @SacramentoKings",
    "1329": "Sacramento Kings                  Me\n                                   🤝                                 \n            Not being able to hit more than 1 shot in an NBA game https://t.co/9SdtkkC1RO",
    "1330": "The story of the 2021-22 Sacramento Kings:\n\n- 3-4 game losing streak that gets capped off by blowout loss\n- Unimpressive two-game winning-streak\n- Another 3-4 game losing streak\n\nRinse. Repeat. Rinse. Repeat.",
    "1331": "@SacramentoKings @MichelobULTRA @buddyhield @hoopculture13 @hbarnes @dameology They’re just making sure that the game hits the under",
    "1332": "Flint Tropics &gt; Sacramento Kings",
    "1333": "The Sacramento Kings: https://t.co/VDDejLau2q",
    "1334": "Cut and paste comment that fits the last 20 years of Sacramento Kings basketball. https://t.co/AqcOJvL6Wb",
    "1335": "Turns on @SacramentoKings game: https://t.co/DrFkgeEd9A",
    "1336": "Beautiful basketball @SacramentoKings",
    "1337": "Can we get a petition to get the @SacramentoKings removed as an NBA team?",
    "1338": "This the Sacramento Kings team Monte McNair put together. Roster is ass and underperforming.",
    "1339": "@SacramentoKings I’d probably rather catch the flu at this point.",
    "1340": "Jaylen is on the bench and he's still tied with the Kings 3 minutes into the second quarter. Sacramento has no idea what it's trying to do on offense. 40-15 Celtics lead. https://t.co/fco7G8z3go",
    "1341": "@SacramentoKings @Verizon @TyHaliburton22 @TerenceDavisJr @hbarnes @MB3FIVE @Rich_Holmes22 Or until there’s a new roster, @Vivek sells the team, or next season comes. Whichever is first",
    "1342": "me not getting to watch basketball for a few months and coming back to see the sacramento kings https://t.co/xhlVrZEz4f",
    "1343": "Why do I still watch the @SacramentoKings 🤦‍♂️ 🗑",
    "1344": "I'd like to remind @SacramentoKings that the @celtics give up big leads quite frequently 🙄",
    "1345": "@SacramentoKings @Verizon @TyHaliburton22 @TerenceDavisJr @hbarnes @MB3FIVE @Rich_Holmes22 shameful this first quarter time",
    "1346": "The Sacramento Kings should be ashamed of themselves.",
    "1347": "@SacramentoKings really are a joke of a franchise. Some good players in this mess of a team, hope they can get traded and are given a chance to compete for a proper team #NBA75",
    "1348": "The Sacramento Kings are the worst franchise in sports. And that's coming from a guy who's watched 80% of all games over the past 25 years. Just pitiful.",
    "1349": "The Sacramento Kings need better players..they straight suck an I’m a die hard Kings fan but I can’t watch this anymore it’s embarrassing to even watch. 18-31 here we come lol",
    "1350": "@mmcnair @SacramentoKings dooooo something this team does not care. Soon you will legit have no one ever watching this team. This fan base has been so loyal us fans do not deserve to watch this pathetic of a team anymore blow it up. Idc anymore who it is. Just do something!",
    "1351": "@SacramentoKings fans,\n\nYou can’t control who they trade for, or control the decisions being made. What you can control is whether you give them your $. \n\nDon’t give them your $, and I promise they’ll make changes.",
    "1352": "@BSWest5 Future Sacramento King Grant Williams in the Smart-Buddy trade",
    "1353": "Jaylen Brown: 15 points 71.4 FG% (5 FGM) 50 3P% (2 3PM)\n\nThe Sacramento Kings: 13 points 17.2 FG% (5 FGM) 8.3 3P% (1 3PM)",
    "1354": "@SacramentoKings @Verizon @TyHaliburton22 @TerenceDavisJr @hbarnes @MB3FIVE @Rich_Holmes22 This game is terrible. Not going in person until you pay me to go. You need me more than I need you",
    "1355": "After the 1st quarter it’s Jaylen Brown: 15 Sacramento Kings: 13",
    "1356": "Yikes, @SacramentoKings are getting killed. Without @swipathefox to penetrate, not much offense. If @celtics get Fox in trade per rumors they would be even better. Every team has more depth/talent than the Kings, at most positions",
    "1357": "The Sacramento Kings are an American professional basketball team based in Sacramento, California. The Kings compete in the National Basketball Association (NBA) as a member of the Western Conference Pacific Division. The Kings are the only team in the major professional North Am",
    "1358": "@SacramentoKings wtf is going on??? \nBetter put @nemi1599 on, your defense needs him.",
    "1359": "Sacramento Kings only scored 13 points in the 1st q  jaylen brown has 15 points .",
    "1360": "@SacramentoKings how can you guys call yourself a basketball team!",
    "1361": "Boston leads 38-13 after 1 over Sacramento. Jaylen Brown and Jayson Tatum combined to score 26 points on 6-9 shooting, including 3-4 from 3. The Kings scored 13 points on a combined 5-29 shooting, including 1-12 from 3.",
    "1362": "First Quarter\n\nSacramento Kings: 13 points\nJaylen Brown: 15 points",
    "1363": "Got them right where we want them @SacramentoKings",
    "1364": "@Jones_Stats What are you gonna say about Sacramento Kings?",
    "1365": "Great 1st quarter wow. They really do need me to sing a 10 day. No joke. @SacramentoKings sheeesh 🏀 👑",
    "1366": "Me looking at the Sacramento kings score after the first quarter 🥲 https://t.co/YUBbr5cOoz",
    "1367": "tobias harris with 15 points in the 2nd quarter alone @SacramentoKings",
    "1368": "The Sacramento Kings just went 5/29 from the field and 1/12 from three in the first quarter",
    "1369": "The Sacramento Kings have 13 points heading into the second quarter. 13.",
    "1370": "Tobias has more points than your franchise currently @SacramentoKings",
    "1371": "Jaylen Brown 15-13 Sacramento Kings",
    "1372": "can you be serious i don’t need tatum and brown benched in the 2nd half @SacramentoKings",
    "1373": "That might be the worst quarter of basketball I’ve ever seen the Sacramento Kings play",
    "1374": "Well, that was pathetic @SacramentoKings",
    "1375": "Score through first quarter:\n\nJaylen Brown 15\nSacramento Kings 13 https://t.co/6wGIWSnXSq",
    "1376": "no, not at all thinking about how the Sacramento kings have been an absolute dumpster fire for 15 years except for the one year the celts had their lottery pick. Why do you ask?",
    "1377": "Checking in on the Sacramento Kings https://t.co/FzgsyW6FzN",
    "1378": "@SacramentoKings tobias harris has 15 first half points on 86%",
    "1379": "What a joke. The #Sacramento kings season is over at this point",
    "1380": "Sacramento Kings https://t.co/Dzc0x6frYy",
    "1381": "Did the Sacramento Kings forget how to play basketball?",
    "1382": "The Sacramento Kings are losing 33-9 and are 3-26 from the field.",
    "1383": "The @celtics are doing the @SacramentoKings so dirty right now… #BleedGreen #SacramentoProud",
    "1384": "@SacramentoKings this is so fucking embarrassing…. TRADE EVERYONE PLZ",
    "1385": "Lmfaooo @SacramentoKings https://t.co/NcNgzwOpSJ",
    "1386": "@SacramentoKings I'm turning this shit off. Fuck this team.",
    "1387": "I Am A King That Is Bussin But The Sacramento Kings Are Not Bussin \n@EmersonLotzia @KenniMiddleton @skg_18",
    "1388": "TRADE. EVERYONE. @SacramentoKings",
    "1389": "The Sacramento Kings are down 26 in the first 10 minutes lol\n\nThey have 7 points",
    "1390": "Why do the Sacramento kings have an NFT profile picture \n\nUnserious franchise",
    "1391": "yo @SacramentoKings you watching this?",
    "1392": "The Sacramento Kings are playing 4th Quarter Celtics basketball here in the 1st.",
    "1393": "Celtics are up 33-7 on the Sacramento Kings with 1:56 left in the 1st quarter…",
    "1394": "After turning the @SacramentoKings game on. 👎👎✌️ https://t.co/bAUXhI4o6k",
    "1395": "@SacramentoKings I know 2 guys that would help https://t.co/6qK4wmsdIa",
    "1396": "do the deal now this is pathetic @SacramentoKings",
    "1397": "It's almost the end of the 1st quarter and the Sacramento Kings are 3 for 26 against the Boston Celtics",
    "1398": "Damn @SacramentoKings",
    "1399": "@SacramentoKings @MichelobULTRA @buddyhield @hoopculture13 @hbarnes @dameology 31-7. This team and organization is pathetic",
    "1400": "🚨 BREAKING NEWS 🚨 \n\nThe @SacramentoKings are fucking embarrassing",
    "1401": "I think I can play better than the #sacramentokings right now against Boston … down 33-7 with a couple minutes left in the first quarter … 16-0 run by Boston \n\nStill, #sacramentoproud lol https://t.co/yvDAkj3H9u",
    "1402": "Relegate the Sacramento Kings",
    "1403": "@OverDrive1050 @HayesTSN the baseball HOF is more irrelevant than @SacramentoKings #HOF",
    "1404": "The Philadelphia 76ers have made Ben Simmons trade offers to both the Atlanta Hawks and the Sacramento Kings.  https://t.co/DcK72ILZbo",
    "1405": "Grant, Hayes and Olynyk for Hail and Bagley @SacramentoKings",
    "1406": "16-0 run for the C's and they're up 26 early on the Kings. Sacramento with 7 points.",
    "1407": "jaylen brown is leveling the sacramento kings to the fucking ground lmao",
    "1408": "Lol at the #sacramentokings right now … \n\nEmbarrassing. And have already lost the game and the first quarter isn’t even over yet.",
    "1409": "@SacramentoKings  You guys are FUCKING EMBARRASING",
    "1410": "Man this hurts… @SacramentoKings #SacramentoProud",
    "1411": "@PresidentEmbiid @SacramentoKings @ATLHawks  he does this all the time",
    "1412": "@Nate__NBA @SacramentoKings Marcus Smart is a fucking POINT GUARD",
    "1413": "You look at all the other NBA scores around the league tonight and they are all pretty normal..\n\nthan you look at the @SacramentoKings score. \n\nCeltics up 24-7 4:02 left in the 1st Quarter",
    "1414": "Sacramento Kings make a shot challenge: IMPOSSIBLE EDITION",
    "1415": "@SacramentoKings @MichelobULTRA @buddyhield @hoopculture13 @hbarnes @dameology L you guys are getting blown out by Brown and Tatum",
    "1416": "@sacramentokings if y’all gern get blowout let me at least hit the ova tho",
    "1417": "@SacramentoKings are you seeing this performance by tobias harris",
    "1418": "Way to go @SacramentoKings, y’all have done everything in your power to both kill Richaun Holmes production AND his trade value.",
    "1419": "Pack it up @SacramentoKings https://t.co/j5ACRUnTpr",
    "1420": "Boston is up on the Sacramento Kings 24-7 with half of the first quarter left to go!\n\nBut if this season has taught me anything, this ain't over until it's over. Still, nice to see the green playing with some energy on both ends - looking very sharp so far tonight.",
    "1421": "Embrace the tank!! @SacramentoKings @mmcnair",
    "1422": "Hmm. I just looked at the score of the Sacramento Kings, who are currently playing an NBA game in the first quarter.",
    "1423": "The Sacramento Kings consist of a group of people who play basket ball",
    "1424": "@mmcnair does it burn yet???? You like what u see from @SacramentoKings wake up!",
    "1425": "Did the Sacramento Kings show up to the game? #SacramentoProud",
    "1426": "Sacramento kings who ?",
    "1427": "If the @SacramentoKings make the playoffs this year @onlychildmitch will get a Kings tattoo bet 👀",
    "1428": "Yall got an elite passer and pull up shooter @sacramentokings maybe play him in a lil more pnr",
    "1429": "@SacramentoKings Looking back at our last playoff win 🥺. Let’s cry together",
    "1430": "🏀#NBA 🏀 in 15 min\n\nBET NOW ➡️ https://t.co/Srjy0dvhMR\nPromo ➡️ https://t.co/Wb8MxMxSym\n\n1️⃣ Washington Wizards - LA Clipper\n2️⃣ Boston Celtics - Sacramento King\n3️⃣ Brooklyn Nets - Los Angeles Laker\n\nDo a Parlay and win more ! 🤑\n\n @Bitsler_Indo @Bitsler_Brasil #Basket #basketball https://t.co/SG6i3ZfPjV",
    "1431": "Not #sacramentokings related but … well … I care lol https://t.co/O3qmZae8nX",
    "1432": "Boston Celtics vs. Sacramento Kings\nNBA Live Streaming\n\nToday's match\nWatch Live Match : https://t.co/VZxWzvh6Lq\n\nMobile phone\nVisit Link ☛ https://t.co/VZxWzvh6Lq",
    "1433": "Accidentally leave Harrison Barnes in Boston please @SacramentoKings",
    "1434": "@ChewieWoolf @nbatopshot @SacramentoKings @hbarnes Have fun!",
    "1435": "Game time @SacramentoKings",
    "1436": "@SacramentoKings @Verizon @TyHaliburton22 @TerenceDavisJr @hbarnes @MB3FIVE @Rich_Holmes22 What happened to Fox is he injured?? Last time I checked he was dealing with a ankle injury if I’m not mistaking?",
    "1437": "Watching @celtics vs @SacramentoKings then @trailblazers vs @Timberwolves on #NBALeaguePass",
    "1438": "Let's go kingdom 👑 🏀 #SacramentoProud @SacramentoKings #beatboston",
    "1439": "Sacramento Kings\n@ Boston Celtics\nTue 7:40 PM EST\n\n🏀 Bet of the Game 🏀\n\n🟡 SAC +9.5 -110",
    "1440": "Watch Live Stream of Sacramento Kings vs Boston Celtics\nhttps://t.co/TNwZVLEJCW",
    "1441": "@SacramentoKings All good but can I get a free shirt"
}