{
    "0": "New from Houston Chronicle — Suns star Chris Paul shows an understanding young Rockets seek https://t.co/K1fxbm7q3n",
    "1": "New from Houston Chronicle — Rockets hope to learn from NBA-leading Suns https://t.co/0Nf5neivF3",
    "2": "New from Houston Chronicle — Rockets' Christian Wood, Kevin Porter Jr. out against Suns https://t.co/1oFqO1j5a4",
    "3": "New from Houston Chronicle — Podcast: Rockets' All-Star festivities and James Harden said what? https://t.co/1WSd5sqdAx",
    "4": "The Phoenix #Suns go for their 7th win in a row against the Houston Rockets at 7 p.m.\n\nListen live on 98.7 FM. #ValleyProud https://t.co/FpFoldO3jK",
    "5": "@Suns and @HoustonRockets are warming up on the court now!🏀 https://t.co/xdDtMPtSlS",
    "6": "New #Rockets from Houston Chronicle — Rockets' Christian Wood, Kevin Porter Jr. out against Suns https://t.co/4mjtaWZZW6",
    "7": "New #Rockets from Houston Chronicle — Podcast: Rockets' All-Star festivities and James Harden said what? https://t.co/7eyCThjr7Z",
    "8": "Just arrived at the Footprint Center to watch the Phoenix Suns in their home court face the Houston Rockets. The @Suns current standing is 47 - 10 and the @HoustonRockets have a current standing of 15 - 41. #GoSuns 🧡💜",
    "9": "The @HoustonRockets starting Schroder, Green, Gordon, Tate, and Sengun on Wednesday. #Rockets50 #NBA",
    "10": "Houston Rockets @ Phoenix Suns: Spread Betting for Houston Rockets from 17.5 to 17.0",
    "11": "Western Conference Standings\n\n1st) @Suns (47-10)\n⬇️\n⬇️\n⬇️\n15th) @HoustonRockets (15-41) *last* https://t.co/blhLhtd9Yw",
    "12": "@NA30SC @aalho_3 @BamericaSZN The Houston Rockets have advanced to the 3rd round, defeating San Antonio in 5 games.",
    "13": "@HoustonRockets Silas needs to go",
    "14": "The Houston Rockets Gerald Green had 3 blind dates in the locker room at halftime.",
    "15": "🏀 Phoenix Suns vs Houston Rockets\n🏆 NBA\n🗓 16/feb.\n⏰ 23:00\n📺 NBA LEAGUE PASS",
    "16": "@MilkyHitsA @HoustonRockets Thanks 😊",
    "17": "@HoustonRockets Count down Silas’s time on this team smh",
    "18": "The Houston Rockets will start Dennis Schroder, Jalen Green, Eric Gordon, Jae’Sean Tate and Alperen Sengun in Wednesday’s game against the Suns. For Fantasy Analysis Click Here: https://t.co/nZotMsetjW",
    "19": "@KPJs_Goat @HoustonRockets That was quick 😄",
    "20": "Houston Rockets: Rockets look to avoid sixth consecutive loss against the league’s best team in the Suns https://t.co/cdoTcrmfKk",
    "21": "@HoustonRockets How's the starting 5?",
    "22": "@HoustonRockets Give Jalen all the touches please @HoustonRockets",
    "23": "@HoustonRockets tell us sengun starts",
    "24": "Tonight's starting lineup for the Houston Rockets: Schroder, Green, Gordon, Tate, Sengun https://t.co/bVWH4AMCA2",
    "25": "Christian Wood and Kevin Porter Jr. are both OUT for the Rockets tonight vs. the Suns. \n\nHouston plays the LA Clippers tomorrow night in the final game before the NBA All-Star break",
    "26": "Mikal Bridges and the Phoenix Suns look to remain dominant at home against Houston Rockets https://t.co/6zNHA9hZRy",
    "27": "Getting ready for Game drinking Go Houston Rockets https://t.co/WnwxrongOl",
    "28": "@HoustonRockets @MichelobULTRA @JalenGreen @Jaygup23 @alperennsengun SQUAD!!🔥🚀",
    "29": "🚨 Line Change 🚨\n\nHouston Rockets @ Phoenix Suns\nWed 9:10 PM EST\n\nFrom:\nPHO -16.5 -110\n\nTo:\nPHO -17.5 -110",
    "30": "Consensus Line Move:\n2022-02-16 Houston Rockets at Phoenix Suns from -16.50 to -17.50\n#ValleyProud who saw that coming?\n#NBA #vegas #technology #makemoney",
    "31": "Rockets legend and Hall of Famer Clyde Drexler shares his perspective on Jalen Green and the dunk contest, as well as the status of Houston’s ongoing franchise rebuild in 2022.  https://t.co/ZFrxBmvMsV",
    "32": "@HoustonRockets @MichelobULTRA @JalenGreen @Jaygup23 @alperennsengun I don't care about drip. I care about winning mfs.",
    "33": "The Houston Rockets Terik Black had 64 hotdogs in his pockets while playing.",
    "34": "@HoustonRockets @MichelobULTRA @JalenGreen @Jaygup23 @alperennsengun Don’t loose by more than 15 please 🙏🏾",
    "35": "NBA tomorrow on @CignalTV:\n8 am @WashWizards vs @BrooklynNets \n11:30 am @HoustonRockets vs @LAClippers \n@OneSportsPHL: @sixers vs @Bucks 9:30 am (@NBAonTNT)",
    "36": "@HoustonRockets @MichelobULTRA @JalenGreen @Jaygup23 @alperennsengun Please don’t lose by more than 40",
    "37": "@HoustonRockets better give Jalen the ball every possession today #Rockets",
    "38": "@SportsTalkPete @KauffBrian @TheHoopCentral @NBA @HoustonRockets Stop",
    "39": "@soggy_sportss @KauffBrian @TheHoopCentral @NBA @HoustonRockets lol ceiling is jordan clarkson",
    "40": "Watching the Houston Rockets in a different city. My favorite past time",
    "41": "@SlkXelif @chidireloaded @HoustonRockets I's not about being overrated, it's about being a mentor and I think he doesn't see himself in that role. You have to accept that role to be good at it, so he won't. Therefore it's a bad fit...",
    "42": "Kevin Porter Jr. (escapades)  ruled out Wednesday.\n\n#CREAMgetsTheMONEY at\nOCEANDFS:NBA\n\n@Kevinporterjr #Rockets @HoustonRockets #NBADFS #DFS https://t.co/27RnUQzcpi",
    "43": "Christian Wood (constipation)  ruled out Wednesday.\n\n#CREAMgetsTheMONEY at\nOCEANDFS:NBA\n\n@Chriswood_5 #Rockets @HoustonRockets #NBADFS #DFS https://t.co/UD1HFHJgi5",
    "44": "@ATTSportsNetSW @CalvinMurphyHOF @Toyota @HoustonRockets Jalen must have the game of his young life with all the missing players out.",
    "45": "#Rockets have lost 20 of their last 21 games when playing the first game of a back-to-back. Houston is the underdog given a 10.5% chance to beat #ValleyProud \n\n#NBA #NBATwitter",
    "46": "2018 Houston Rockets https://t.co/PDMDqv07HL",
    "47": "@ATTSportsNetSW @CalvinMurphyHOF @Toyota @HoustonRockets Must have great 4th quarter no meltdown.",
    "48": "I asked Monty what he saw change/improve on film for the Rockets since the last time the Suns played them 40ish games ago. One thing Williams mentioned is Houston is switching more now. Gotta think Phoenix will handle that well if it comes after just facing LA's great switching.",
    "49": "#Rockets vs Suns TONIGHT on AT&amp;T SportsNet\n\nHere are @CalvinMurphyHOF's Keys to the Game presented by @Toyota \n\n@HoustonRockets \n#toyotausa\nhttps://t.co/HOouXfTS9S https://t.co/HNooQNPteq",
    "50": "@MSNBC @thereidout Freedom, who formally adopted that last name after becoming a U.S. citizen in November, was recently waived by the Houston Rockets, making him a man without a team.\n\nFunny how the Liberal gurus defended a “Take-a-Knee-Disrespect-the-American-Flag” quarterback, Colin Kaepernick.",
    "51": "@_tep13 @WhatIfiWasWhYte @slabGod_ His legacy in Houston is being one of the best offensive players in history and leader of the 2018 rockets who were the only ones to challenge the KD warriors and who will go down as one of the best teams to not win a ring (would’ve won if cp3 didn’t get injured)",
    "52": "If you’re at all surprised that @EnesFreedom was waived by the Houston Rockets… You still don’t understand that sports has more politics baked into it than many other industries. The NBA is a globalist institution and China is the apple of their eye. #FreeTheUyghurs",
    "53": "#NBA,\n\n#Basketball,\n\n#NBATwitter,\n\n#RunAsOne, #RedNation, #Rockets,#HoustonRockets, vs. #Suns, #SunsAt50, #PhoenixSuns,Get your best odds - fast at https://t.co/Ohl03KWAVe https://t.co/OPzynFrcpb",
    "54": "🏀 Houston Rockets(+15.5) @ Phoenix Suns(-15.5)\n\n⌚ 9 PM ET\n\nO/U: 234\n\n🔥  Rockets are 4-0 ATS in their last 4 Wednesday games.\n \nBet #BTC ➡️ https://t.co/spMiJIgrUb\n\n#NBABetting #NBAPicks #SportsBetting #BitcoinBetting https://t.co/4SbKFLWRQj",
    "55": "You know what’s better that getting #dogecoin trending? $DOGE circulating!!! Tip with @sodogetip or spend with @Tesla @dallasmavs @Athletics @HoustonRockets @Cryptwerk_com @shop_doge @coffeeur_coffee",
    "56": "@RepDavidValadao @EnesFreedom Too bad @HoustonRockets are gutless",
    "57": "The Houston Rockets Luc Monte had 89 points scored with his head.",
    "58": "@PapaG817 Gerald Green for the Houston Rockets.",
    "59": "Just saw my @HoustonRockets in town tonight. Need to find a ticket asap!",
    "60": "@kingdj_5297 I think it also has something to do with the fact that the Houston Rockets are 1.) rebuilding, team won’t even play John wall despite him being paid 40M+ and having the worst record \n2.) Houston is the most popular team in China. It’s bad for business/ratings to have him rostered",
    "61": "Houston Rockets: Can James Harden make a new home in Philly and deliver an NBA title? https://t.co/tL4PcCT6wX",
    "62": "Milwaukee Bucks vs. Philadelphia 76ers NBA Betting Tips and Best Bets for Week\n\nhttps://t.co/EsQ6bYxsfe\n Houston Rockets center Christian Wood (35) shoots as Milwaukee Bucks forwar...",
    "63": "@HoustonRockets @trailblazers looking for an upset today",
    "64": "It's GAME NIGHT for the @HoustonRockets \n\n@cayleighgriffin has a preview in the Midday Minute presented by @memorialhermann \n\nJoin @KevinEsch1 @CalvinMurphyHOF &amp; @marioelie1 as they begin our coverage at 7PM with #Rockets Tip-Off\n\n#memorialhermann https://t.co/i3xmzLOImD",
    "65": "@ATTSportsNetSW @HoustonRockets Blake Griffin dunking over a Kia. #RocketsSocial",
    "66": "@HoustonRockets @KendraScott I tried to purchase this special today. Is it already over?",
    "67": "@ATTSportsNetSW @HoustonRockets Lebron slapping the floor and smiling when defending Kobe in 2016 in Kobes last all star game #RocketsSocial",
    "68": "@Toneman111 @dfsMCNiiCK He was cut because why would the Houston Rockets want him? They’re tanking and playing young players.  Is that wife beater a little too snug and cutting off the blood flow to your brain? He sucks, he’s the biggest defensive liability in the NBA",
    "69": "@Dakodas_Dad @HoustonRockets Houston you have a problem!  Bad news for Houston!  Let’s go Suns!!",
    "70": "It's SOCIAL NIGHT on the @HoustonRockets Broadcast\n\nTonight's Topic 🏀🏀🏀🏀🏀\nWhat is your favorite ALL-TIME memory from #NBAAllStar Weekend?\n\nTweet us your thoughts &amp; comments #RocketsSocial",
    "71": "@letitbeknown713 @tayylorrjeann @HoustonRockets We would recommend reaching out to the website where you made the purchase for assistance if you haven't heard anything!",
    "72": "@HoustonRockets @Suns @ATTSportsNetSW @SportsTalk790 I’d bet the house we lose this game by 20+",
    "73": "The Houston Rockets Luc Monte had  to go to the bathroom during the game so he hit his juul.",
    "74": "@HoustonRockets We brought the razzle dazzle.",
    "75": "Gameday . the reason Jalen not in the top 10 of rookies is because the @HoustonRockets are using him like a role player and letting him only take 2 shots per half . i serious cannot do another year with Silas they need to give jalen 10 shots a HALF .",
    "76": "@HoustonRockets @TilmanJFertitta I am sure this has nothing to with China right???? https://t.co/mbw0JimLVq",
    "77": "TIP: Phoenix Suns - Houston Rockets, J. Crowder 9.5 minus, 1.85 by #tipster Sale187 (profit this month: +66.72)\n  #betting #Basketball #Phoenix #Suns #Houston #Rockets",
    "78": "Phoenix Suns Predictions and Preview for 2/16/2022 hosts Houston Rockets.  Find out who we are taking in this matchup. #SportsBetting #Punters https://t.co/1gglL3aMPO",
    "79": "@HoustonRockets @Suns @ATTSportsNetSW @SportsTalk790 he has a slight injury i think too",
    "80": "@HoustonRockets @Suns @ATTSportsNetSW @SportsTalk790 will dennis play today?",
    "81": "Houston Rockets visits Phoenix Suns Predictions and Preview for 2/16/2022 today.  Who are we taking in this game?  Find out now. #SportsBetting #Punters https://t.co/1gglL3aMPO",
    "82": "Charles Barkley already dealt with a difficult retirement back in 2000 when he played his final NBA game with the Houston Rockets. Now an analyst with TNT, Barkley is talking retirement once again.\n\n#NBATwitter | #NBA75 | @NostraThomas123  https://t.co/OYGWABIrSV",
    "83": "@kerneltrader Dude is a straight up quitter too when times got tough in OKC he left to the rockets to get out of the pressure, shit got tough in Houston dude wants to join a super team with the nets, shit got tough in Brooklyn dude over there saying Philly was his first pick smh..🤦🏽‍♂️",
    "84": "@HoustonRockets @Suns @ATTSportsNetSW @SportsTalk790 Yay, we get to watch KPJ “learn” how to play PG while we have the #2 and #16 draft pick 🙄",
    "85": "Phoenix Suns vs Houston Rockets Live | 2022 NBA Basketball | 👉 ▶️ : https://t.co/sUz4oaWkCe | 16-Feb-22 | 21:00 | NBA | Basketball | Houston Rockets | Phoenix Suns | NBA, Basketball, Phoenix Suns, Houston Rockets, https://t.co/iixMjTkNfZ",
    "86": "@HoustonRockets @Suns @ATTSportsNetSW @SportsTalk790 Finna be a 50 point blowout😭😭 https://t.co/IUYDltUSZh",
    "87": "Houston Rockets vs Phoenix Suns - NBA League | 2022 💯\n🔗 🔴Watch Live Fullᴴᴰ 👉 : https://t.co/oMFpjMo30B ✅\n📆 :On Wednesday. February 16 /2022\n⏰ 9:00 PM",
    "88": "@HoustonRockets @Suns @ATTSportsNetSW @SportsTalk790 Pls let thw suns go off",
    "89": "@mrmosesdavis @Solidarity_Star If the rockets didn't waive him, he would have been the 2nd best defensive Turkish big in Houston lol.",
    "90": "@HoustonRockets @Suns @ATTSportsNetSW @SportsTalk790 Trash franchises",
    "91": "@HoustonRockets @Suns @ATTSportsNetSW @SportsTalk790 More Jaygup Sengun Green minutes or we riot",
    "92": "@HoustonRockets @RGVVipers Are y'all still gone pick up Armoni Brooks later",
    "93": "We've got a new episode of @HoustonRockets All Access Presented by @memorialhermann at 6:30!\n\n🚀 Preview of @JalenGreen in the Slam Dunk Contest\n🚀 Alperen Sengun tells us what he learned working out with Hakeem Olajuwon\n🚀 @TheRyanHollins on Sengun's impact on the game",
    "94": "@Patsnation87 Big game against the big bad @HoustonRockets and their 15 wins 💅🏻 https://t.co/vGY87aRTnE",
    "95": "@HoustonRockets @Suns @ATTSportsNetSW @SportsTalk790 It’s night go to sleep admin",
    "96": "@HoustonRockets @Suns @ATTSportsNetSW @SportsTalk790 let’s be real they finna thrash us",
    "97": "@HoustonRockets @Suns @ATTSportsNetSW @SportsTalk790 gup masterclass🔜",
    "98": "@HoustonRockets @Suns @ATTSportsNetSW @SportsTalk790 How much we losing by tn boys",
    "99": "Congratulations to dagamewhiz who moved up 4 spots to take #9 on the Houston Rockets team leaderboard.\n\nhttps://t.co/xnqyAdpoTd",
    "100": "@NbaLouvre @HoustonRockets Steve Francis",
    "101": "Houston allowed the #Jazz to shoot 55.1% from the field in a 135-101 loss on Monday. \n\nThe #Rockets are 1-15 ATS this season coming off a game where they allowed greater than 52.1% shooting. \n\nThey are 21-18 ATS in all other games.\n\n#SDQL #NBA #NBA75 #Suns #ValleyProud https://t.co/EFQf99FbFK",
    "102": "The Spark l Jalen Green &amp; Kevin Porter Jr. Interview | Houston Rockets #Houston #Rockets #NBA Video: https://t.co/oXm8LySywo",
    "103": "The Houston Rockets Luc Monte had a falling out with his uncle billy.",
    "104": "@DetroitPistons @BallySportsDET Why is my guy not involved. The entire playbook should have Cade Cunningham's name on it, our entire offense better be centered around him like 2018 Houston rockets with James Harden https://t.co/Uqn59nsPc7",
    "105": "Houston Rockets: Los Angeles Lakers Could Land John Wall In The Offseason https://t.co/H83MNJYIbA",
    "106": "@gclem0 @KauffBrian @TheHoopCentral @NBA @HoustonRockets Lol i like jalen to but not sure bout that hest only due to kpj having a history of being inconsistent",
    "107": "@10detens @HoustonRockets Cuttino Mobley !! 🔥",
    "108": "@KauffBrian @soggy_sportss @TheHoopCentral @NBA @HoustonRockets I feel good ab the puck Houston my team jalen and kpj gonna be the best backcourt in the nba in a couple years",
    "109": "The Big Brotha is watching you… You better be ready to bring it tonight for the Houston Bottle Rockets! #clifftheusher #ValleyProud #nba #phoenixsuns #Suns #launchtherocketsintospace https://t.co/CKUE1biXEd",
    "110": "Retail Operations Coordinator - Houston Rockets &amp; Toyota Center (Houston · TX) https://t.co/zXMyOd1TXl",
    "111": "\"James Harden 4\" by William Hunt(c) 2022 #lhunt4designs #willhunt4designs #jamesharden #harden #thebeard #nba #76ers #philadephia76ers #sixers #philadelphia #philly  #nbabasketball #mvp #houstonrockets #oklahomacitythunder #urbanart #urbanartist #art #artist #blackartist https://t.co/Ka5xIIwvU1",
    "112": "Our alumni set the standard for excellence. Larry Smith played 13 seasons in the National Basketball Association (NBA) with the Golden State Warriors, Houston Rockets, and San Antonio Spurs, scoring 5,904 points. #AlcornBlackHistory #WeAreBlackHistory https://t.co/1kVzCewQ5H",
    "113": "@GupScored @HoustonRockets @JalenGreen @kj__martin And KJ while u at it.",
    "114": "@LeGoatedOne @NBAonTNT @Hoophall @HoustonRockets @OrlandoMagic @Raptors @NBA Tmac slander cringe rare L bro",
    "115": "@HoustonRockets March 12, mark it! https://t.co/IMsJwNEUF9",
    "116": "The Houston Rockets Chris Paul had a poptart warming up in his shoes.",
    "117": "@Jeff_Shull @HoustonRockets Those pictures are tough. They gotta release those haha",
    "118": "“Senate Republican Steering Committee Chairman Mike Lee (R-Utah), who hosted the lunch, said he wants an explanation from the NBA about why Kanter Freedom was traded by the Celtics and then unceremoniously waived by the Houston Rockets.” https://t.co/wxWZJ3xtTa",
    "119": "Houston Rockets: Suns vs Rockets Prediction and Promo: Bet $10, Win $200 at WynnBET Sportsbook https://t.co/Hjfv5Bkgrp",
    "120": "@MilkyHitsA @ClutchCityBR @HoustonRockets @RGVVipers So was Kyle Lowry.👍🏾",
    "121": "@HoustonRockets @JalenGreen @kj__martin Getting blown out in the valley*",
    "122": "@barrypottercom @NBAonTNT @Hoophall @HoustonRockets @OrlandoMagic @Raptors @NBA doesn't sound like a favorite to me",
    "123": "@Peter4America @celtics @BradStevensTeam @HoustonRockets @ESPNNBA @NickAdamsinUSA @HowieCarrShow @SportsFanGirl22 He is a fucking American hero!",
    "124": "The Rockets take on the Suns tonight at 7pm!\n\n@HoustonRockets | #Rockets https://t.co/A5D2bixWUn",
    "125": "@NbaLouvre @HoustonRockets Moochie Norris.\nEddie Johnson.\nCuttino Mobley.",
    "126": "@soggy_sportss @TheHoopCentral @NBA @HoustonRockets Fair point it’s very early. Hope Jalen picks it up he seems like a good guy",
    "127": "@terryso @HoustonRockets @RocketsnationFr The GOAT 👌🏻🔥",
    "128": "@HoustonRockets @JalenGreen @kj__martin jidion owns you",
    "129": "@HoustonRockets @JalenGreen @kj__martin OUT SILLAS",
    "130": "@HoustonRockets @JalenGreen @kj__martin start gup",
    "131": "@KauffBrian @TheHoopCentral @NBA @HoustonRockets Their draft isnt bad at all sengun is solid chrisopher has shown flashes and green is far from done trae young looked horrible in the first half of his rookie season trust you cant give up on someone like that",
    "132": "2022 NBA mock draft roundup: Potential Houston Rockets picks at All-Star break #YahooSports #NBA https://t.co/Q9qsfXnLad",
    "133": "@RooshWilliams Roosh, good luck being back at work and stay healthy. I have a fun question. If the Houston Rockets win the NBA Lottery who should they draft with the #1 overall pick? The 2022 draft has three players that stand out to me. Which potential superstar pairs best with Jalen Green?",
    "134": "@KauffBrian @TheHoopCentral @NBA @HoustonRockets Lol everyone knew coming out of draft he needed development and polishing im not even a rockets fan but know what you talkin bout before you say somethin",
    "135": "Potential Houston Rockets picks at All-Star break\nhttps://t.co/VgIqoF8gz8\nhttps://t.co/VgIqoF8gz8",
    "136": "I’m in Phoenix at the Biltmore Hotel and the Houston Rockets players just happened to get here. Jalen Green, Eric Gordon and others walked by us. My mother in-law turned a corner and almost took out Christian Wood.",
    "137": "2022 NBA mock draft roundup: Potential Houston Rockets picks at All-Star break #Houston #Rockets #NBA https://t.co/f2VEudSm6F",
    "138": "I just added “Houston Rockets vs Phoenix Suns Prediction 2/16/22 - Free NBA Picks” to Free NBA Picks on #Vimeo: https://t.co/i3rl2AQAZX",
    "139": "The Houston Rockets take on the Phoenix Suns in NBA Basketball betting action.\n\nAndrew Cook has a free pick on this game today!\n\nhttps://t.co/9rTLwvygFB\n\n#NBA #NBAfreepicks #sportsbet #sportsbetting #HoustonRockets #PhoenixSuns #GamblingTwitter #procappers https://t.co/44btpmN1SP",
    "140": "China-basher Enes Kanter Freedom gets traded, then waived by the Houston Rockets. Coincidence? | Fox News.  Very disappointed in the @NBA choosing to support China. https://t.co/xKQpVp1Rw8",
    "141": "@HoustonRockets sign @EnesFreedom !! \n\nStop signing crap and sign talent!!",
    "142": "@HoustonRockets you suck so bad surely @enesfreedom could help on the court and a liite positive PR wouldn't hurt! https://t.co/Nb50VUn8AP",
    "143": "The Houston Rockets Zhou Qi had 64 hotdogs in his pockets while playing.",
    "144": "@tedcruz @EnesFreedom @NBA Remind them who the last team to cut him was ted. You’re beloved Houston rockets .",
    "145": "anyone who watches houston rockets games will tell you the answer is Wood https://t.co/mKBDDnCqV3",
    "146": "Houston Rockets: Rockets vs. Suns picks, odds: Who wins game Wednesday? https://t.co/UTYHTOASuR",
    "147": "Kevin Porter Jr. (actin' a fool)  listed questionable Wednesday.\n\n#CREAMgetsTheMONEY at\nOCEANDFS:NBA\n\n@Kevinporterjr #Rockets @HoustonRockets #NBADFS #DFS https://t.co/lrfuBxNRjH",
    "148": "Christian Wood (buffoonery)  listed questionable Wednesday.\n\n#CREAMgetsTheMONEY at\nOCEANDFS:NBA\n\n@Chriswood_5 #Rockets @HoustonRockets #NBADFS #DFS https://t.co/4yVSPOtL3u",
    "149": "@TheHoopCentral @NBA Jalen Green not even in the top 10, how you feeling about that pick @HoustonRockets ?",
    "150": "Check out the Rockets upcoming schedule and tune-in!\n\nSponsored by fuboTV, LIVE SPORTS &amp; TV WITHOUT CABLE\nhttps://t.co/bKIHwE4A7G\n\n@fuboTV | @HoustonRockets https://t.co/vQ2dSsJMJC",
    "151": "I just uploaded “Houston Rockets vs Phoenix Suns Prediction 2 16 22 - Free NBA Picks” to #Vimeo: https://t.co/dNYAqiAT8T",
    "152": "More #NBA75 :\n\nPhoenix Suns - Houston Rockets\nOVER 233.0 @ 1.91\n\nChicago Bulls - Sacramento Kings\nOVER 232.5 @ 1.94",
    "153": "Fuck the @NBA fuck @celtics fuck the @HoustonRockets \nAnd China can eat a bag of dicks also.\nThis is ridiculous.\nhttps://t.co/G1tkYSKbIQ",
    "154": "NBA Betting Preview: Houston Rockets vs. Phoenix Suns - Wednesday, Feb. 16, 2022 https://t.co/1NSHD2WaPA",
    "155": "@NbaLouvre @HoustonRockets The Dream 👀 https://t.co/5Rk5ZvULtR",
    "156": "@WrestleWithPigs @LongLiveThe51s @JonathanHernon @RooshWilliams You’ll have to refresh my memory on which of the guys Houston drafted last year used assets from the Harden trade.\n\nI guess we’ll find out how good they are but if the Rockets got all that from a single draft it seems like they’d be…well, not the 3rd worst team in the nba.",
    "157": "This should be a disappointment that Jalen Green, Josh Christopher or Alphren Sengun not on the list! We already having a losing season let those boys ball out the whole game stop sitting them to play our vets or put vets over they mins. #Rockets #NBA75 @HoustonRockets https://t.co/ngvJlKHI5x",
    "158": "The Houston Rockets Gerald Green had a six pack of budlight for breakfast on game day.",
    "159": "Full Court Houston didn't even know what my WTAPS Vans were and lowballed me on a '94 Rockets championship shirt with the stickers still on it. But s/o to the good folks at MANIA!",
    "160": "Congratulations to coreybored who moved up 1 spot to take #1 on the Houston Rockets team leaderboard.\n\nhttps://t.co/xnqyAdpoTd",
    "161": "Houston Rockets: The Rockets should consider Jalen Duren if they draft past four https://t.co/4pEnOE5ZcA",
    "162": "🏀 James Harden left the @HoustonRockets to win a title with the @BrooklynNets. Having now moved again, he believes he can achieve his goal with the 76ers. https://t.co/446nGxiasZ",
    "163": "@HoustonRockets #GameDay!! 🏀 Come play some free Bingo while watching the game! You'll wanna win these prizes! #DiabloLoco #Houston #Rockets",
    "164": "Which team was the 2014-2015 NBA Champions?\n\nA: Houston Rockets\nB: Cleveland Cavaliers\nC: Golden State Warriors\nD: Atlanta Hawks",
    "165": "🔮 NBA ELO Win Probabilities for February 16\n@BrooklynNets 43.6% @nyknicks 56.4%\n@nuggets 26.2% @warriors 73.8%\n@washwizards 39.1% @Pacers 60.9%\n@HoustonRockets 1.8% @Suns 98.2%\n https://t.co/Do2FyjVaYt",
    "166": "2/16/06 – Phoenix hit 10 3's by half and led 63-31, the franchise's largest halftime lead since 11/10/90, then cruised w/the starters resting in the 4Q (11pts) as the #Suns blew out the Houston Rockets, 109-75. PHX . Nash: 21p/6r/8a. Marion: 16p/12r. Yao: 6p/0r. #ValleyProud https://t.co/EpllL8MySv",
    "167": "The Houston Rockets James Harden had a disco ball hung up in his locker.",
    "168": "The Phoenix Suns take on the Houston Rockets tonight at 9 PM EST!\n\nPredict the score in the comments 👇🏼 https://t.co/Fpb02HF7YY",
    "169": "@HoustonRockets Can someone explain the fascination with Jalen Green?",
    "170": "Now kg you know besides the 95-96 Houston rockets you was the guy who created a big 3 to win your first n only ring…stop it @KevinGarnett5KG https://t.co/E5eAxlMq8v",
    "171": "@HoustonRockets @alperennsengun @DR34M New hakeem 💪",
    "172": "Suns game tonight ☀️🏀😎 @Suns @HoustonRockets",
    "173": "@HoustonRockets @alperennsengun @DR34M We ready 🚀🚀",
    "174": "@HoustonRockets @alperennsengun @DR34M no one using old as Hakeem as their wallpaper 😭😭",
    "175": "@HoustonRockets @alperennsengun @DR34M God bless u",
    "176": "@HoustonRockets I was wonder is the Houston rocket Chinese team or american nba team",
    "177": "Rockets vs. Suns PRO Report: Can Houston Keep it Close? https://t.co/0qkRrjrZeG",
    "178": "@Chrisavelli @Suugarrrr @JeremyMoore010 @DrGuru_ CP3 couldn’t run the Rockets offense to save his life. I would have done the same thing. He’s the reason James didn’t win a ring in Houston",
    "179": "@secretbase here's an idea, a Beef History mini-series featuring James Harden (vs. the Houston Rockets, vs. Kevin Durant, vs. Kyrie Irving).",
    "180": "@benshapiro It's the sin of having a large expiring contract which was valuable to the rebuilding Rockets. DJ Augustin and Armoni Brooks were waived by Houston as well.",
    "181": "@WhatSeperatesU @Suns @HoustonRockets @BALLYSPORTSAZ @AZSports @az_mejor @FootprintCNTR I was a season ticket holder a couple years back when we won less than 20. \n\nLet me live",
    "182": "Very disappointed (but not surprised) that the @HoustonRockets waived @EnesFreedom. They're apparently still beholden to Yao Ming and the Chinese government. \n\nI hope you don't win a championship until you do the right thing and stand up against Chinese human rights abuses.",
    "183": "In 84' the Blazers offered the Rockets the 2nd pick and Clyde Drexler for Ralph Sampson. Houston declined but if they said yes we could have seen them have the 1st and 2nd pick. Meaning we could have seen Olajuwon, Michael Jordan, and Drexler on the same team in Houston.\n\nCrazy.",
    "184": "The houston rockets https://t.co/dJu35q6giE",
    "185": "The Houston Rockets take on the Phoenix Suns in NBA Basketball betting action.\n\nAndrew Cook has a free pick on this game today!\n\nhttps://t.co/9rTLwvyOv9\n\n#NBA #NBAfreepicks #sportsbet #sportsbetting #HoustonRockets #PhoenixSuns #GamblingTwitter #procappers https://t.co/PRL4877FWJ",
    "186": "Catch me live and in person courtside at the @lakers vs @HoustonRockets  game being introduced https://t.co/dmSLoQ0Ro0",
    "187": "@HoopzLA @Potts_SSR Yeah yeah i know the dude is not jokic everyone knows that\n\nHe can is still be an average bench center though \n\nHouston rockets acquiring him just to get rid of him is very suspect to be honest",
    "188": "New #Rockets from Houston Chronicle — TNT's Kenny Smith: Developing good habits key for Rockets during rebuild https://t.co/PEBLySOvV6",
    "189": "The Houston Rockets Trevor Ariza had a twitterbot with no followers.",
    "190": "I wish to formally thank the Houston Rockets for waiving Enes Freedom",
    "191": "Houston Rockets vs. Phoenix Suns picks, predictions, odds: Who wins NBA game Wednesday? https://t.co/9GCI6ndAAu",
    "192": "Houston Rockets vs. Phoenix Suns - 2/16/22 Free Pick &amp; NBA Betting Prediction https://t.co/PwsG4BH8aC\n.\n#Betting #FreePicks https://t.co/yOcguSEJ9l",
    "193": "@PRTejeda @sirimahanthesh He was taken by the houston rockets for a reason \n\nJust to get rid of him\n\nHouston rockets is owned by the CCP",
    "194": "Houston Rockets vs. Phoenix Suns picks, predictions, odds: Who wins NBA game Wednesday? #Phoenix #Suns #NBA https://t.co/biEN0fyanN",
    "195": "Houston Rockets: Stephen A. Smith Claims James Harden Has Never Been Under More Pressure Than He Is Right Now: \"This Is More Pressure\u0085 https://t.co/k1TPwNKr1h",
    "196": "@Potts_SSR @HoopzLA lot more worst center that is still playing to this day than kanter\n\nhim got rid by houston rockets is not an accident\n\nthe whole team is owned by the ccp\n https://t.co/GuxuljoUnP",
    "197": "@Suns @HoustonRockets @BALLYSPORTSAZ @AZSports @az_mejor @FootprintCNTR Let’s keep going y’all and get this W 🙏🏻",
    "198": "\"Scotto: When I look at Dennis Schroeder and Eric Gordon in the backcourt for the Houston #Rockets on paper, it just doesn’t seem like a fit for the Rockets in their rebuilding phase.\"\n\n\"Gozlan: It’s not a good long-term fit there and not a great fit there right now either.\" https://t.co/cN2AdaBKvq",
    "199": "@Suns @HoustonRockets @BALLYSPORTSAZ @AZSports @az_mejor @FootprintCNTR Kick ass tonight guys!  Don't underestimate the Rockets. They will be starving for a win. If you relax, they will take advantage.",
    "200": "Revenge Game: Chris Paul plays Houston tonight.  He played 116 games in his career for the Rockets.",
    "201": "@Suns @HoustonRockets @BALLYSPORTSAZ @AZSports @az_mejor @FootprintCNTR im gonna need yall to lose. Yall fans getting too cocky",
    "202": "Last one before the All-Star break!\n\n🎟 https://t.co/hezRHvVi9k\n🆚 @HoustonRockets\n🕖 7PM\n📺 @ballysportsaz \n📻 @AZSports | @az_mejor\n📍 @footprintcntr https://t.co/zFVmVYCeCP",
    "203": "The Los Angeles Lakers had an offer from the Houston Rockets of John Wall for Russell Westbrook that would not have included their 2027 first round pick. The Lakers reportedly were not ready to give up on the idea of the team figuring out to play with Westbrook.",
    "204": "Rockets at Suns: Prediction, point spread, odds, over/under, betting picks (Feb. 16) #Houston #Rockets #NBA https://t.co/s8lCIfzNDN",
    "205": "The interest from the Brooklyn Nets in Ben Simmons dates back to when the Philadelphia 76ers made him available in a trade for James Harden with the Houston Rockets at the start of the 20-21 season.",
    "206": "Just a daily reminder that the @NBA is in bed with the genocidal dictators of #CCP #China.  They along with @celtics @HoustonRockets want nothing to do with @EnesFreedom. They supress #FreeSpeech and #HumanRights in favor of profit. #BoycottNBA.",
    "207": "Rockets legend and Hall of Famer Clyde Drexler shares his perspective on Jalen Green and the dunk contest, as well as the status of Houston’s ongoing franchise rebuild in 2022.  https://t.co/KBoxazb83a",
    "208": "@LantosFndn @celtics @HoustonRockets @EnesFreedom If that's hard for you to believe, you haven't seen him play.",
    "209": "The Houston Rockets James Harden had  to go to the bathroom during the game so he hit his juul.",
    "210": "New #Rockets from Houston Chronicle — Rockets at Suns: Five things to watch https://t.co/0cxGVJ8Wyj",
    "211": "Modo Carrera 76ers:\n\n🚨 Traspaso\n\nA Houston Rockets:\nKentavious Caldwell-Pope + Isaiah Joe\n\nA Philadelphia 76ers:\nEric Gordon + 2a ronda de 2024",
    "212": "Houston Rockets vs Phoenix Suns NBA Pick and Prediction NBA Betting Tips 2/16/2022 https://t.co/GoiPeo5y4w via @YouTube #NBA #NBAPick #NBAPredictions #NBAOdds #Rockets #Suns #ValleyProud #RocketsVsSuns",
    "213": "@TheDailyWolves Question? Regarding @EnesFreedom. Did the Houston Rockets owe a favor to China?",
    "214": "@HoustonRockets can y’all fucking buy out John wall already",
    "215": "@HoustonRockets @ATTSportsNetSW suns blowout incoming #ValleyProud",
    "216": "Today's NBA Picks: 9:10 PM ET - Houston Rockets vs. Phoenix Suns - 3 PICKS AVAILABLE: https://t.co/UQV9XleMov #nba",
    "217": "DasHaus made a bet!\n\nEvent: Houston Rockets vs Phoenix Suns #NBA\nBet: Phoenix Suns TO WIN -15.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "218": "Is there a culture? Or is there a clusterfuck on the bench in houston? #Rockets https://t.co/C5dq6upuSB",
    "219": "DasHaus made a bet!\n\nEvent: Houston Rockets vs Phoenix Suns #NBA\nBet: Houston Rockets TO WIN +15.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "220": "¡HOY JUEGA SUNS! (47-10)\n\n🆚 Houston Rockets\n⏰ 23:00hs (🇦🇷)\n🏟 Footprint Center\n📺 NBA League Pass https://t.co/iXG2QzNpCW",
    "221": "New Episode🚨\n\nWhat the culture is happening in Houston? @JP_Mirabueno &amp; @summitcommish breakdown the Schroder minutes, Silas’s rotations, and why setting a culture is important for a young team. #Rockets \n\nEpisode link below\nhttps://t.co/Aye86Da8FM https://t.co/BF4sBaTdIs",
    "222": "1/ It’s deeply disappointing to see both the @Celtics and @HoustonRockets deny @EnesFreedom a spot on their rosters, and it’s hard to believe this is completely unrelated to his courageous advocacy for persecuted minorities in China.",
    "223": "Through games on Feb. 15, which members of the Houston Rockets have done the most (or least) with their minutes during the 2021-22 NBA season, per TPA? \n\nFull data on @SportsMathNet: https://t.co/ktinOKHwqK https://t.co/sLfkBY73cj",
    "224": "No favors for the #Rockets with this year’s schedule. Some teams are already on All-Star break,with most wrapping up tonight. Houston has a back-to-back starting tonight in PHX, then a 10:30 pm ET start in LA vs. Clippers on Thursday.",
    "225": "NBA Basketball Game Betting Picks Simulator: 9:10 PM ET - Houston Rockets vs. Phoenix Suns - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/UnVHjgNB2I #nba #sportsbetting #freepicks #cappertek",
    "226": "📰 Phoenix Suns vs Houston Rockets Predictions and Odds Feb 16!\n👉 https://t.co/gMTfaIMxS5 @wagertalk",
    "227": "It’s night two of a back to back💜🧡💜🧡 We are 47-10🔥🔥🔥 Dakoda is right @HoustonRockets you have a problem. #BadNews #DakodaKnows #NBA75 https://t.co/zYayw6Qig1",
    "228": "@blange00 The downfall of the Houston Rockets. Lmao",
    "229": "Houston at Phoenix looks like a clear mismatch on paper, but one source of optimism for the Rockets is improved play by rookie Jalen Green, who is having his most efficient stretch in some time.  https://t.co/wBO1XMXyRV",
    "230": "@ReadsAboutBB @chidireloaded @HoustonRockets No..Overrated..perfect fit in Houston",
    "231": "New from Houston Chronicle — TNT's Kenny Smith: Developing good habits key for Rockets during rebuild https://t.co/Mi2KrSwyXS",
    "232": "@HoustonRockets Shame on you for dropping Enes Freedom. Too controversial for ya?",
    "233": "One of my favorite player, I really love this jersey design from the @HoustonRockets! 🚀\n\n@RocketsnationFr what's up! https://t.co/H6dpjGuIaY https://t.co/rHZzoTw7sp",
    "234": "The Houston Rockets Chris Paul had all the fans give him a group hug on valentines day.",
    "235": "Houston Rockets vs  Phoenix Suns Prediction 2/16/22 -  Free NBA Picks https://t.co/mH0IVCrduN via @YouTube \n\n#NBA #NBAPick #NBAPrediction #basketball",
    "236": "Houston Rockets: Game Preview: Suns battle Rockets on Bright Side Night https://t.co/g12DjjI6Jm",
    "237": "It could all be smoke, but James Harden spoke of wanting to play winning team basketball in Brooklyn Nets as opposed to the style he played in Houston Rockets. It sounds like he is echoing those comments here after playing in Brooklyn, where they led the league in ISOs per game. https://t.co/UsM0z9p2Xo",
    "238": "Houston Rockets | Zoom Flare https://t.co/M9dgeB8EUu",
    "239": "@SalmanAliNBA @HoustonRockets @TheDreamTake the stripclub MVP     does whatever HE wants to do. So HE wanted to go to the NETS and how HE wants to go the Philly. Otherwise, he quits playing and gets hits fatsuit.",
    "240": "GAMEDAY! 🚀\n\nHouston #Rockets 🆚 Phoenix Suns\n\n🕒 23h (NBA League Pass)\n🗺️ Footprint Center, Phoenix\n5⃣ Porter Jr, Green, Gordon, Tate &amp; Wood\n🔴 Usman Garuba fora https://t.co/7IDo6myVF9",
    "241": "I was a @HoustonRockets fan from my time in college. \n\nNo more.\n\nThis is despicable behavior on the part of a team, and a league, full of cowards. Enjoy your riches, appeasers. https://t.co/zWkucjUCR9",
    "242": "@SlkXelif @chidireloaded @HoustonRockets Just trolling?",
    "243": "James Harden spent his first 11-plus NBA seasons playing for the Oklahoma City Thunder and Houston Rockets. Will he be able to call Philly his home?\n\nHere's what he thinks about becoming a Sixer and how he can play a role in their season. https://t.co/GwklwHPYUg",
    "244": "New from Houston Chronicle — Rockets at Suns: Five things to watch https://t.co/E2uuE1A41i",
    "245": "@HoustonRockets How about y’all give him more minutes!! I’d rather rally like to see what he can do playing 25-30 minutes! What’s he averaging 15-16???? Come’on Silas!",
    "246": "Where #HoustonRockets #Rockets fans at? 😰💈 https://t.co/qpKjQYBGwD",
    "247": "The Houston Rockets Ryan Anderson had a six pack of budlight for breakfast on game day.",
    "248": "@TeddybitsC @HoustonRockets I love breeding day!!",
    "249": "Houston Rockets: Rudy Gobert is back — but that’s not the only reason the Utah Jazz are winning https://t.co/w8gxPnD8BA",
    "250": "James Harden rubbed many of his teammates the wrong way with his push out of Brooklyn. The situation became quite reminiscent of his last few weeks with the Houston Rockets.\n\n#NetsWorld | #NBATwitter | #Sixers | @bgarciaivsports  https://t.co/HPEoEfUbCR",
    "251": "Win season tickets to ALL MAJOR HOUSTON SPORTS! Texans, Rockets, Astros, Dynamo/Dash and more!\n\n$100 per ticket and only 500 tickets sold.\n\nPurchase tickets at link below.\n\nhttps://t.co/ht5maHB96y https://t.co/IgbpVGqahY",
    "252": "I dont think sports fans should call #BenSimmons  for #Harden trade a BLOCKBUSTER! \n@JHarden13 aint the same, since @HoustonRockets &amp; #Simmons has not played, real 🏀 plus he has #mentalillness issues @stephenasmith both teams will have a early exit #NBA playoffs, they not clutch https://t.co/sI4OyXEKs1",
    "253": "Harden: Let's see. I really like Alice in Wonderland. I'm into Assassin's Creed. I've always liked Houston Rockets red.\n\nTailor: Say no more.... https://t.co/MK8ZPhpEfM",
    "254": "@ChargersDumb @hale1914 @KAscuasiati @BleacherReport @JakeLFischer The suns went to the finals when the west has been its weakest in a decade. The rockets lost by one game to a top 2 team in nba history. Lol cp3 hasn't won shit. And he underachieved for years with the clippers, then kept getting hurt in the playoffs in houston. Give me james.",
    "255": "@getup have U guys ever thought that @JHarden13 &amp; @BenSimmons25  have been sitting this up since @HoustonRockets ? JH - “ u may have2 wait2 if @sixers don’t wheel &amp; deal but I promiseU I will get u2 @BrooklynNets because its not going 2work their a 🥜 @KyrieIrving &amp; a 🦆@KDTrey5",
    "256": "Join us IN 3 DAYS on Saturday, February 19th from 9-12PM for Pre-K Enrollment Fair at 4900 Simsbrook Dr. Houston TX 77045 | We hope to see all of our future Grissom Rockets scholars soon! https://t.co/ZGlcT3nSDS",
    "257": "Houston #Rockets vs. Phoenix #Suns| 2|16|22 | NBA Free Picks and Predictions | NBA Betting tips \n\nWatch:https://t.co/1LZW6QufKB\n\n#NBA #NBAPick #NBAPredictions #rocketsvssuns",
    "258": "@letitbeknown713 @KendraScott @HoustonRockets You get an email from someone who works there with times to go pick it up!",
    "259": "I love of basketball🏀 has pass on, but for this boy he choose to move to @HoustonRockets . Congratulations to @0xBlak , This one will make u and our TeddyBits🐻 proud in his own way.\nhttps://t.co/su6snAC4tD\n\n#NFT #nftcollectors #NFTCollection #NFTcollectibles  #NFTCommunity https://t.co/CiUFiP9xbI",
    "260": "The Houston Rockets Terik Black had 3 blind dates in the locker room at halftime.",
    "261": "The Houston Rockets are selling a Fruit Loop and mac-and-cheese covered hot dog.  But the most revolting thing at games is still the Rockets",
    "262": "@HoustonRockets TY Bro🍀☘💪🏾",
    "263": "@JoelEmbiid @sixers you are sleeping with the enemy @JHarden13 he shouldn't be trusted if a snake bites once he'll bite again ask @HoustonRockets and @KDTrey5",
    "264": "Kevin Porter Jr. with 8 dimes, a steal and 0 turnovers against Utah.\n\nCurrently in the 96th percentile in assist percentage (31%) with 23% usage (85th percentile).\n\nFuture looks good in Houston with Porter Jr. and Nix at the PG spot.\n\n#Rockets https://t.co/XJShSLbINi",
    "265": "Analyzing Wednesday’s Houston Rockets at Phoenix Suns odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/swgppUOdCh",
    "266": "Houston Rockets at Phoenix Suns odds, picks and prediction https://t.co/l2EBfXVwGH",
    "267": "@SunsFansUK @HoustonRockets @Suns Let's go, we are so good. Proud to be Suns Fan!\n\n#ValleyProud \n\nThanks for your awesome Twitter Work as always. 💜🧡✌",
    "268": "@NBAonTNT @Hoophall @HoustonRockets @OrlandoMagic @Raptors @NBA 13 points in 35 seconds easily the best moment",
    "269": "NBA Basketball Game Betting Picks Simulator: 9:10 PM ET - Houston Rockets vs. Phoenix Suns - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/UnVHjgvZE8 #nba #sportsbetting #freepicks #cappertek",
    "270": "The Houston Rockets P.J. Tucker had a twitterbot with no followers.",
    "271": "Houston Rockets (15-41, 15th in the Western Conference) vs. Phoenix Suns (47-10, first in the Western Conference) https://t.co/SsGHqcfVjC",
    "272": "The Houston Rockets Eric Gordan had a slip and slide free throw contest.",
    "273": "Charles Barkley says he'll probably retire after TNT contract expires in 2024\n\nBarkley played 16 seasons in the NBA with the Philadelphia 76ers, Phoenix Suns, and Houston Rockets before retiring in 2000. He joined TNT's Inside the NBA team shortly therea https://t.co/HphulxXYei",
    "274": "Hakeem Olajuwon Houston Rockets Men's Red Swingman Player Jersey\nRating:🌕🌕🌕🌕🌕\n$149.99 👍\n#hakeem #olajuwon #houston #rockets #men  #IndianaColts @indcolts10\n\nhttps://t.co/vnBGLdD4nO https://t.co/CRkN0Kbq8L",
    "275": "🏀GAME DAY🏀 🏠\n\n🆚 @HoustonRockets\n🕑 2:00am 🇬🇧\n🎽 🟣\n\n📊 Record\nSuns: 47-10\nRockets: 15-41\n\n⚔️ Season Series\nSuns 2-0 Rockets\n\nWho's winning tonight?\nComment your predictions 👇\n\n#Suns #SunsUK #RallyTheValley #ValleyProud\n@Suns #NBA75 #NBATwitter #Rockets",
    "276": "The Houston Rockets Terik Black had the Run DMC CD playing during the game.",
    "277": "Houston Rockets: Houston visits Phoenix, aims to stop road skid https://t.co/IMoqpwuk6d",
    "278": "\"76ers was my first choice\" -James Harden declares – James Harden wanted to go to the Philadelphia 76ers, even when he was leaving the Houston Rockets 13 months ago. After 80 games with th... https://t.co/Vma3ZOVeEZ https://t.co/4Q6asmBYzq",
    "279": "@HoustonRockets @NBAonTNT @Hoophall @OrlandoMagic @Raptors @NBA This look says it all 😂 #NBA https://t.co/YvUi7evVTi",
    "280": "Suns look to keep ascending against reeling Rockets https://t.co/1rC9oLneIB #NBA #HoustonRockets #PhoenixSuns",
    "281": "@NBAonTNT @Hoophall @HoustonRockets @OrlandoMagic @Raptors @NBA Penny, T-Mac, KD...I have always like this type of dudes. THe swagger, the not doing too much talking, just straight BUCKETS",
    "282": "Orlando Magic - Atlanta Hawks\nBoston Celtics - Detroit Pistons\nMemphis Grizzlies - Portland Trail Blazers\nChicago Bulls - Sacramento Kings\nPhoenix Suns - Houston Rockets\nLos Angeles Lakers - Utah Jazz\n\nBet slip link: https://t.co/RsqQIjpoAG https://t.co/pYaHYDndz9",
    "283": "Suns look to keep ascending against reeling Rockets  #NBA\n #Suns #WeArePHX #HoustonRockets #Rockets50 https://t.co/ztdGRc8XGz",
    "284": "The Houston Rockets Luc Monte had a slip and slide free throw contest.",
    "285": "Houston Rockets (15-41, 15th in the Western Conference) vs. Phoenix Suns (47-10, first in the Western Conference) https://t.co/MQDuHzMRPD",
    "286": "damn, Daryl Morey used to be a hardcore consultant before he became the general manager of the Houston Rockets. biggest TIL",
    "287": "The Houston Rockets Chris Paul had two chains.",
    "288": "Houston Rockets: James Harden, the perils of revisionist history and the value of receipts https://t.co/ookOdDAeIO",
    "289": "@NBAonTNT @Hoophall @HoustonRockets @OrlandoMagic @Raptors @NBA 13 pointss in 33 seconds. To win the game against Spurs",
    "290": "@nufc_rockets @LeMickeyBurnerr @BleacherReport You obviously don't remember the talks between Philly and Houston before the whole Brooklyn thing.",
    "291": "@KerithBurke Years ago when I lived in Houston I got to know Hannah Storm who was an unknown reporter for the Houston Rockets. You remind me of her you have improved so much since your first day with the Warriors your future is bright indeed.",
    "292": "A theory as to why the Rockets seem to not commit 100% to rebuilding:\n\nThe picks owed to OKC from 2024-26. Perhaps Stone/whoever is trying to speed-build so Houston rejoins contention soon &amp; the picks become worse.\n\nThat’s not the right strat, let the rooks grow &amp; it’ll happen",
    "293": "@_sykoraryan @Suns @HoustonRockets had to post it sometime. this post isn’t even the important one",
    "294": "@lesliechap715 @Suns @HoustonRockets bruh it’s midnight. engagement is about to be so low",
    "295": "Later today, I will be live-tweeting the @Suns vs. @HoustonRockets game for my #JMC305 assignment. What makes this particularly interesting though, is that I don’t really know how basketball works, so these tweets will be completely honest and made out of pure confusion",
    "296": "Dave's Picks for Feb 16th, 2022\n\nCBB:\nGeorge Washington Colonials +4.5\nUtah Valley Wolverines -1.5\nBoston College Eagles +10\nMaine Black Bears +11.5\n\nNBA:\nHouston Rockets +15.5",
    "297": "He keeps commenting on how great this fanbase is. Y’all @PelicansNBA @LAClippers @HoustonRockets @okcthunder what we’re y’all doin??? https://t.co/bjwSltbwi6",
    "298": "The Houston Rockets P.J. Tucker had 5 broken backboards in 1 game.",
    "299": "josh giddey took 22 shots vs the knicks . jalen green took 2 shots in a whole half @TilmanJFertitta @RafaelStone12 @HoustonRockets do something about it since us fans can’t . give him the ball like he’s the #1 option . stop trying to use him as a role player.",
    "300": "Do people from Houston still think Harden is so great or was that only while he played for Rockets?",
    "301": "@NBAonTNT @Hoophall @HoustonRockets @OrlandoMagic @Raptors @NBA One of my favorite T-Mac moments was when he had the duel with Jordan in ‘03 and Jordan had gave him the sneakers he played in that game. The another moment was the duel vs Kobe when they both had 38 pts.",
    "302": "@NBAonTNT @Hoophall @HoustonRockets @OrlandoMagic @Raptors @NBA As far as skill set Tracy McGrady was the Kevin Durant of his era. I have always viewed Kobe Bryant success in the NBA as the “what if” version of Tmac’s. They were 1A and 1B as shooting guards then. Tmac is not only top 75 player but a top 30 player ever.",
    "303": "Houston Rockets vs. Phoenix Suns game preview\n\n#Rockets\nhttps://t.co/5b04ZB35AY",
    "304": "Utah Jazz decimate rebuilding Houston Rockets in blowout - The J-Notes https://t.co/HGmU0oMJYk",
    "305": "@Suns   go to 47 -10 with a 103–96 victory over the @LAClippers  on  #NBAonTNT next up 15-41  @HoustonRockets #HOUvsPHX #ValleyProud",
    "306": "Houston Rockets vs. Phoenix Suns game preview, in which maybe the Suns will lay down after a tough win last night? Maybe? https://t.co/UQ5ZDL3VDa",
    "307": "Houston Rockets vs. Phoenix Suns game preview, in which maybe the Suns will lay down after a tough win last night? https://t.co/cwc5HEwFb2",
    "308": "CLIPPERS at SUNS | FULL GAME HIGHLIGHTS | February 15, 2022 #Houston #Rockets #NBA Video: https://t.co/CCtZk1dagB",
    "309": "@GrizzHooping @HoustonRockets would be smart to make a run at him next season. @Kevinporterjr is best used at the wing and would benefit from someone else setting the table for him and the offense.",
    "310": "The Houston Rockets Terik Black had a slip and slide free throw contest.",
    "311": "@HoustonRockets Fucking cowards.",
    "312": "@NBAonTNT @Hoophall @HoustonRockets @OrlandoMagic @Raptors @NBA The lob off the backboard to himself in the all star game https://t.co/3bpucqgs3B",
    "313": "Tough loss. Reggie Jackson made some bad decisions that cost them the game. \n\nLove the fight, though. On to Thursday to face the Houston Rockets, #ClipperNation https://t.co/4omDDDPeAE",
    "314": "Enes Freedom Released by Houston Rockets https://t.co/m5bL2gBa7P via @news_ntd",
    "315": "@HoustonRockets @Jaygup23 I love you Christopher 💗",
    "316": "@ChagNba The fact that Drexler eventually went on to play for the rockets anyways makes this declination look even worse for Houston.",
    "317": "The Houston Rockets Luc Monte had two chains.",
    "318": "Rockets at Suns: Lineups, injury reports, broadcast and stream info for Wednesday #Houston #Rockets #NBA https://t.co/WOGZDDvaZU",
    "319": "Serious question. Are there any significant similarities and/or differences between the 2017-18 Houston Rockets and the 2021-22 Phoenix Suns?",
    "320": "Houston Rockets: Enes Freedom Released by Houston Rockets:  https://t.co/1B2t8AbOmA",
    "321": "Houston at Phoenix looks like a clear mismatch on paper, but one source of optimism for the Rockets is improved play by rookie Jalen Green, who is having his most efficient stretch in some time.  https://t.co/AsrxgNcbVd",
    "322": "@HoustonRockets Balllllliiiiiiiing!",
    "323": "@BiasedHouston @HoustonRockets @RafaelStone12 @TilmanJFertitta @KellyIkoNBA @Rockets_Insider @TheRocketsWire Relax and enjoyed the loss to the Suns tomorrow because this Season was never about Wins. 😢😭(still don’t know what it was about🤔Young Players learning bad habits #Turnovers😩 #Rockets",
    "324": "The Houston Rockets Trevor Ariza had a poptart warming up in his shoes.",
    "325": "@NBAonTNT @Hoophall @HoustonRockets @OrlandoMagic @Raptors @NBA The self pass for a dunk in a game,,not the Allstar game either. Because he did it at home first. Otown",
    "326": "@haralabob RIP Houston Rockets 🥲",
    "327": "@HoustonRockets I NEED IT",
    "328": "@wojespn reporting that James’s harden asked the @sixers for a buyout … @HoustonRockets and @MiamiHEAT are potential suitors #hardenproblems https://t.co/zIduURn5dz",
    "329": "@NBAonTNT @Hoophall @HoustonRockets @OrlandoMagic @Raptors @NBA Tmac &amp; Yao vs Kobe &amp; Shaq games were amazing",
    "330": "@HoustonRockets @SunDevilHoops @Jaygup23 @memorialhermann NOW MY RECORD IS TRASH",
    "331": "@rolandsmartin @HoustonRockets @JohnWall daryl morey BANKRUPT DA FRANCHISE CHASING A CHIP HE COULDN'T WIN SO THEY'RE BLAMING SILAS. WAT A SUKKAH MOVE. 1",
    "332": "@StoolGreenie In Peak Form. Thank You @HoustonRockets!",
    "333": "DAM \nI WISH THE \n@HoustonRockets \nFREE\n @JohnWall \nON MY SOUL",
    "334": "bf4 the trade deadline reports said \n-LA assets have little 2 no value . \n-houston than asked 4 russ and a first 4 wall \n- the rockets said they wouldn't move wood unless something blew the away . \n\nnow all of a sudden ramona comes in with the bs and we suppose 2 believe her ?",
    "335": "@isthatru @HoustonRockets @ATTSportsNetSW Same💀",
    "336": "The Houston Rockets Clint Capela had a disco ball hung up in his locker.",
    "337": "Smh Silas has to go man! @HoustonRockets https://t.co/1q047ncqdP",
    "338": "@NBAonTNT @Hoophall @HoustonRockets @OrlandoMagic @Raptors @NBA Bout Time... What took so long he's  been right there all along!",
    "339": "New #Rockets from Houston Chronicle — Tanking or not, Spurs can win for losing https://t.co/jqZ9VYMZi2",
    "340": "New #Rockets from Houston Chronicle — TNT's Charles Barkley on James Harden: 'Be careful what you ask for' https://t.co/tOCPBLujMY",
    "341": "Milwaukee Bucks are Alex Chung, the Weeknd &amp; Trump House. I will leave a name there a Jessica Kohl my far almost wife. 😊🎶 Tesla.\nHouston Rockets will be add with JF98 team. FORD.\n\nWhile we begin a new one with Toronto Alfa_Raptors 🤔 Ⓜ️ale Tyrannosaurus. 😅\n\nCongratulations!\n🦖",
    "342": "good news. russ just needs to avoid a houston rocket type series and we can run it back healthier and with better chemistry.\n\ndon't even like the lakers but russ cannot be loooking like ish smith no more https://t.co/BCG5NkvvgO",
    "343": "@NBAonTNT @Hoophall @HoustonRockets @OrlandoMagic @Raptors @NBA I got so many but my best and favorite was his 8  3pointers in the first half against the Cavs",
    "344": "Casual 24 points, 11 assists, and 8 rebounds for *Houston Rockets* PG Daishen Nix",
    "345": "Chris Beard future Head Coach of The Houston Rockets.",
    "346": "GIVE HIM HIS MINUTES @HoustonRockets https://t.co/1d98Z6Egi7",
    "347": "@NBAonTNT @Hoophall @HoustonRockets @OrlandoMagic @Raptors @NBA One of my favorite players of all time and one of the greatest to ever put on a magic jersey man.\n\nPeople seem to forget the absolute duel that he had with Kobe 🔥 https://t.co/sRh4EZtYet",
    "348": "@NBAonTNT @Hoophall @HoustonRockets @OrlandoMagic @Raptors @NBA The oop to himself in the Allstar game. https://t.co/yHZeONk6Mo",
    "349": "@don_dougan @Parsiva24866528 @HoustonRockets @BenDuBose https://t.co/0OdDVeAAkk In the US you don't have the letter (Umlaut) ö. Not a single commentator ever got it right. And bc it is incredibly difficult to teach someone a letter, that they have never heard of, it is much easier to just go with an americanised version.",
    "350": "@Danizeh @BGN_5 This isn’t rocket science buddy. Harden has been very durable throughout his career. These reoccurring hamstring injuries aren’t a fluke. It’s happening because he hasn’t been taking care of his body right after he left Houston and that’s his fault.",
    "351": "@BleacherReport @JakeLFischer @JHarden13 shouldn't ever leave @HoustonRockets then",
    "352": "Funny how my most painful moments as a Houston Rockets fan was in 2009 and 2018. So I guess the next one is in 2027 🤣😩",
    "353": "Yes - @HoustonRockets please bring @snipabrooks_ back! 🆘🚀 https://t.co/Mtj96KMl3F",
    "354": "@HoustonRockets GIVE HIM MORE MINUTES",
    "355": "The Houston Rockets signed Daishen Nix to a four-year, $6 million contract. The deal is guaranteed for the first two years and then is non-guaranteed starting Year 3 (2023-24 season), league sources told @hoopshype."
}