{
    "0": "Los Angeles #Lakers vs Los Angeles #Clippers Live Stream &amp; Play By Play https://t.co/SXShyya5T4 via @YouTube #LALvsLAC #ClipperNation #LakeShow",
    "1": "ALERT: New high roller bet posted!\nA bet has been placed for $8,002.19 on Los Angeles Clippers - Los Angeles Lakers to win $16,644.55.\nTo view this bet or copy it https://t.co/DmkkVZaHFk https://t.co/3EUtO06p8q",
    "2": "If the Los Angeles Lakers lose tonight it's over.",
    "3": "Check out 1998-99 Topps Roundball Royalty #R18 Kobe Bryant BGS 9.0 #LosAngelesLakers https://t.co/yCHeg6LgJ3 via @eBay #NBA @kobebryant",
    "4": "Los Angeles Clippers vs Los Angeles Lakers\nWatch Live streaming:\nhttps://t.co/bIYTy32eDb",
    "5": "Los Angeles Clippers vs Los Angeles Lakers\nWatch Live streaming:\nhttps://t.co/bIYTy32eDb https://t.co/RZeHWzDj3V",
    "6": "Los Angeles Clippers vs Los Angeles Lakers\nWatch Live streaming:\nhttps://t.co/bIYTy32eDb https://t.co/wPCpIsbwTp",
    "7": "The Los Angeles lakers show some heart, passion and desire challenge!",
    "8": "@felixleapelaez @Lakers @LAClippers @espn @abc7curt @ABC7 @CBSLA @NBCLA @FOXLA @NBAonTNT @NBA @KTLA @latimes It’s been over but for this delusional fan base a win today means there title contenders again 😂",
    "9": "Your starting 5⃣\n\n#SuitingUpTogether | @ToyotaSoCal https://t.co/sdOwlCnMkJ",
    "10": "Currently filming my video review of HBO's new series about the '80s Los Angeles Lakers, \"WINNING TIME\"\n\nI fucking love this show :)\n\n#WinningTime #Lakers #LakersNation #LosAngeles #LAL #LosAngelesLakers #HBO #HBOMax https://t.co/A1gpRxLeNn",
    "11": "@felixleapelaez @Lakers @LAClippers @espn @abc7curt @ABC7 @CBSLA @NBCLA @FOXLA @NBAonTNT @NBA @KTLA @latimes The huge difference between having a competent owner and GM vs having incompetent Jeannie and Pelinka. Lakers had better assets than Clippers before Pelinka, Paul, and Lebron started trading everything away",
    "12": "LeBron James could definitely use a speedy guy these days as the Los Angeles Lakers continue to spiral.\nhttps://t.co/ukvOdAd6Ba",
    "13": "Uniforms for Los Angeles Lakers vs Los Angeles Clippers at 7:00 PM on TNT. \n\n#LakeShow #ClipperNation https://t.co/9sWc9VXQZ3",
    "14": "This is a big game for the Los Angeles Lakers tonight we definitely need this win.",
    "15": "Los Angeles Lakers\n@ Los Angeles Clippers\nThu 10:00 PM EST\n\n🏀 Bet of the Game 🏀\n\n🟡 LAC ML -125",
    "16": "@Lakers Lakers season is OVER, @LAClippers figured out to win without any of their STARS, Lakers can’t do it with their stars much less without them, time for Fran Vogel and AD to leave. @espn @abc7curt @ABC7 @CBSLA @NBCLA @FOXLA @NBAonTNT @NBA @KTLA @latimes",
    "17": "Los Angeles Lakers Vs. Los Angeles Clippers Live Play By Play &amp; Reaction https://t.co/MRvBBni8qY",
    "18": "Today's NBA Picks: 10:00 PM ET - Los Angeles Lakers vs. Los Angeles Clippers - 39 PICKS AVAILABLE: https://t.co/vSgwLzJ4fT #nba",
    "19": "From Texas to Cali 🌴 https://t.co/MzZck5Lw4s",
    "20": "@ddpage369 @alta_kkennon @vishant_mittal @GameInjuryDoc Here we go...OK, Question for you...WHEN was the last time Montrezz Harrell played a game for the Los Angeles Lakers? Exactly. Please, get a clue. It's done. It's over. Move on...",
    "21": "Jay Williams: Los Angeles #Lakers Have No \"Excuses\" - The Spun https://t.co/tooTSOZgYh",
    "22": "Los Angeles Lakers Starting Lineup 3/3\n PG: Russell Westbrook\n SG: Malik Monk\n SF: Austin Reaves\n PF: LeBron James\n C: Dwight Howard\nhttps://t.co/o75oZ8vnE8",
    "23": "Los Angeles Lakers (+2.5) @ Los Angeles Clippers #ClipperNation #LakeShow #NBA #NBATwitter #NBA75",
    "24": "Welcome to the #LakeShow https://t.co/GNqYnGf5AZ",
    "25": "Los Angeles Lakers Starters:\n\nRussell Westbrook\nMalik Monk\nAustin Reaves\nLeBron James\nDwight Howard\n\nPlayers out:\nAvery Bradley\nTalen Horton-Tucker\nAnthony Davis\nKendrick Nunn\n#LakeShow #NBA #NBATwitter #NBA75",
    "26": "\"Shaquille O'Neal allegedly hazed NBA rookies by pooping and peeing in a bucket for a week and then dumping it on them, according to his former Los Angeles Lakers and Miami Heat teammate Gary Payton.\"\n\n🤨🤨🤨🤨🤨🤨🤨🤨🤨\nhttps://t.co/Mwk0IpKhT9",
    "27": "LA mask mandates are finally ending AND the Lakers are 7 games under .500? Life is good in Los Angeles!",
    "28": "NBA\n\nMemphis vs Boston Celtics\n\nLos angeles Lakers vs los angeles Clippers",
    "29": "I just made a bet with The House. I'm taking Los Angeles Lakers +2.5 points (Lakers @ Clippers)\n\nDownload the WagerLab app to bet with me ➡️\nhttps://t.co/VnWTrfzSfL\n\n#NBA #NBATwitter #NBATwitterLive #LakersNation #ClipperNation #bettingpicks #Lakers #Clippers #bettingtwitter https://t.co/g8AQnpwM9B",
    "30": "Los Angeles Clippers Vs Los Angeles Lakers 2022 NBA Basketball | 3-Mar-22 @ 22:00 👉 ▶️ : https://t.co/b1loaZClYb | Los Angeles Clippers | Los Angeles Lakers | NBA | Basketball https://t.co/tUYojkNkCR",
    "31": "Was originally set for https://t.co/K8ojrDTjgg Arena in Los Angeles but the Lakers, Clippers Kings could both potentially be in the playoffs then. Far less likely for the Lakers and Clippers. No location finalized. https://t.co/sd7hG92YHy",
    "32": "The trickery the Los Angeles Lakers pulled off in the bubble needs to be investigated. Tricked the league on a level we’ve never seen before. https://t.co/NIQO5n1INf",
    "33": "@CorinnaBechko Guess it won't be a Los Angeles LAKERS tattoo...They're just about on the sports obituary page!",
    "34": "The Real Lakers of Los Angeles are a public service. https://t.co/fdyhss2OL7",
    "35": "Featured Art of the Day: \"KOBE BRYANT LOS ANGELES LAKERS 1\". Buy it at: https://t.co/S4PIJ5VDe5 https://t.co/DRORjBRttp",
    "36": "Los Angeles Lakers @ Los Angeles Clippers\nPick : Los Angeles Clippers.\nBasketball. NBA",
    "37": "Lebron James Los Angeles Lakers Youth Jersey Size Medium 10/12 - https://t.co/jn02cV1OlW\n\n#lebron #lebronjames #lakers #nba \nhttps://t.co/6ral5dd9zb",
    "38": "[Gameday] USA: NBA - 10:00 PM, March 03, 2022\nLos Angeles Lakers vs. Los Angeles Clippers\n📺 Watch Live Here =&gt;  https://t.co/dWAshmqwTK\nPlease LIKE and SHARE !!",
    "39": "Russell Westbrook has become the symbol of everything wrong with the Los Angeles Lakers. He could also be the one who saves them.\n\n#Lakers | #NBA | @BigTimeTimJim  https://t.co/jc0s1rdofn",
    "40": "The Los Angeles Lakers led all NBA teams with merchandise sold in the Philippines, based on sales from the online NBA store.\n\nFollowing the Lakers are the Golden State Warriors, the Brooklyn Nets, the Dallas Mavericks, and the Milwaukee Bucks. https://t.co/yGnn0digSQ",
    "41": "\"I don't mind losing, but when you don't have a lot of effort, it shows,\" says Shaquille O’Neal to the Los Angeles Lakers after the team’s third straight loss. https://t.co/6PrTklR3eR",
    "42": "LeBron James, barring something extremely surprising, will be a member of the Los Angeles Lakers through the end of next season. https://t.co/NPKlQQLSdI",
    "43": "Kobe Bryant Rookie Card 1996 TOPPS R9 NBA Basketball Los Angeles Lakers - https://t.co/jULUOkh3WQ\n\n#lebron #lebronjames #lakers #nba \nhttps://t.co/uOCfPZE991",
    "44": "Where will accountability come from with the Lakers front office af... (Silver Screen and...)\n\nUnless the Los Angeles Lakers go on a completely unexpected run over the next couple months,...\n\nAdd your highlights:\nhttps://t.co/bmfoXBnxuF\n #LA_Lakers",
    "45": "Casual Thursday 🕺🤙 https://t.co/zLgoiIvyAb",
    "46": "Today's NBA Picks: 10:00 PM ET - Los Angeles Lakers vs. Los Angeles Clippers - 38 PICKS AVAILABLE: https://t.co/vSgwLzJ4fT #nba",
    "47": "\"I don't mind losing, but when you don't have a lot of effort, it shows,\" says Shaquille O’Neal to the Los Angeles Lakers after the team’s third straight loss. https://t.co/KwwtSoXtWY",
    "48": "These concepts are so fundamentally different in execution, narrative development, team functionality, purpose, etc.\n\nThis is like saying: The SOS Brigade&gt;The Los Angeles Lakers (As a group, not in basketball ability) https://t.co/V3bZR0PeUS",
    "49": "The battle for Los Angeles doesn't have as much cache as in the past. The Clippers go for their seventh straight victory in the series against the Lakers tonight 🏀 \n\n#NBA #LakeShow #ClipperNation\nhttps://t.co/Qt1jhiFg2R",
    "50": "6 days later and it's another Battle of Los Angeles\n\n8th Place Clippers vs 9th Place Lakers\n\nClippers are the home team this time at https://t.co/9EVmIWikey Arena",
    "51": "🏀NBA🏀\nLos Angeles Clippers vs Los Angeles Lakers\n\nLos Angeles Lakers now suffered six defeats in the past seven games.📉 https://t.co/U25Q7a688M",
    "52": "🚨BREAKING🚨\n\nSources tell us that in no specific order, Iboss James’s Top 4 teams in Free Agency are the New York Knicks, the Los Angeles Lakers, the Phoenix Suns, and the Sacramento Kings.\n\nIf he doesnt get signed to a team, sources close to Iboss say he will “vibe in Come UP” https://t.co/Ih4WBvE8zR",
    "53": "is this russell westbrick from los angeles lakers? https://t.co/8RQdytiWNn",
    "54": "NBA LIVE TODAY🔴 Los Angeles Lakers vs Los Angeles Clippers - 3rd March 2... https://t.co/tZQy9n4B8t",
    "55": "Magic Johnson Signed A 25-Year, $25 Million Contract With The Los Angeles Lakers In 1981\nhttps://t.co/yKBMRPXdX3\n\nDownload Now\nhttps://t.co/Mkuc4iEwrm",
    "56": "Books:\nShowtime: Magic, Kareem, Riley, and the Los Angeles Lakers Dynasty of the 1980s by Jeff Pearlman\n\nBlood, Sweat &amp; Chrome: The Wild and True Story of Mad Max: Fury Road by Kyle Buchanan\n\nWest by West: My Charmed, Tormented Life by Jerry West and Jonathan Coleman https://t.co/OqTCDUvCfu",
    "57": "Los Angeles Lakers coach Frank Vogel may be on the hot seat, but one of his former colleagues gave him some public support the other day.  https://t.co/wMbOdwIDjg",
    "58": "🏀 GAME ANALYSIS 🏀\n\n🏟 Los Angeles Lakers vs Los Angeles Clippers\n\n▶️ BET THE NBA ▶️ https://t.co/odroCYfQFJ\n\n#NBA #GamblingTwitter \n\nhttps://t.co/No2XwSF97M",
    "59": "Solomon Hughes plays Kareem Abdul-Jabbar and Quincy Isaiah plays Magic Johnson in HBO’s forthcoming drama about the 1980s Lakers, “Winning Time.” https://t.co/aUGGQaJKkv",
    "60": "@SagED_UP Los Angeles Lakers",
    "61": "Check out 2020-21 LeBRON JAMES Panini Mosaic 2 Card Lot #81 Los Angeles Lakers NBA  https://t.co/JfpwIeiyYk @eBay",
    "62": "Check out Kobe Bryant Los Angeles Lakers NBA Holographic 11\"x14\" Engraved Matted Frame https://t.co/z1Lq0k7hmR @eBay",
    "63": "[📺LIVE - 04H00] 🏀 #NBA \n⚡️ Los Angeles #Lakers @ Los Angeles #Clippers en direct sur beIN SPORTS 1\n#NBAextra https://t.co/JblgseflaI",
    "64": "The Los Angeles Lakers https://t.co/W2ZpPcVUJY",
    "65": "Dwight Howard, Los Angeles Lakers, Xbox Open A State-Of-The-Art Gaming Lab Inspiring Kids To Dream Big - Afrotech https://t.co/TZ4xmJfM7L",
    "66": "8 Ways Kobe Bryant Carried the 2012-13 Los Angeles Lakers to the NBA Playoffs https://t.co/AHJVMYzmWC",
    "67": "@mikeysoslimey @Guilded_ @ESPNNBA @TheVolumeSports That’s very cute for OKC my dude. This is the Lakers in Los Angeles. You don’t perform you’re getting booed.",
    "68": "Los Angeles Lakers star PG Russell Westbrook is expected to decline his $47 Million Player Option and seek an extension for $50 Million+ per year. https://t.co/nLWhjYJ3GX",
    "69": "GAMEDAY!📍\n-\nThe Los Angeles Lakers take on the Los Angeles Clippers at 7:00 PM PST tonight in the https://t.co/8kT67grctA Arena. 💜💛\n-\nWho do you think will win this game tonight? 🤔 \n- \nFollow @lalakersquad for more! 🔥 https://t.co/o8DQsyR0po",
    "70": "los angeles lakers 104 - 109 dallas mavericks",
    "71": "As Los Angeles plays themselves out of playoff contention, the franchise must brace for the possibility that Anthony Davis could miss the rest of the season.\n\n#Lakers | #NBA | @bgarciaivsports  https://t.co/ZsdvbiDJVT",
    "72": "@SagED_UP A very close second is whichever team LeBron James is on, so the Lakers currently and a super close third the Los Angeles Dodgers",
    "73": "Los Angeles #Lakers are 3-0 Down vs. #Clippers This Season: Can They Overturn it Tonight? \n\n@Lakers #LakersNation #lakernation \n\nhttps://t.co/XjhZWiVzAW",
    "74": "Los Angeles Lakers. Check out our articles here! https://t.co/nqh1okRQdw #Los_Angeles_Lakers",
    "75": "los angeles lakers 👁👄👁?",
    "76": "Los Angeles Lakers, the OVER THE HILL GANG is now below 500.",
    "77": "@LegionHoops I wouldn’t trust LeMickey being General Manager of a Wendy’s, let alone the Los Angeles Lakers.",
    "78": "Los Angeles Clippers Predictions and Preview for 3/3/2022 hosts Los Angeles Lakers.  Looking for betting action?  Find out if there is any value in our preview. #NBATwitter #Basketball https://t.co/O9u1AQr4Jy",
    "79": "According to @JakeLFischer, when the #Lakers - #Kings trade talks fell apart, #NBAKings executives were largely made aware of it when the #Wizards trade framework was reported publicly, instead of being informed directly by Los Angeles' brass.",
    "80": "The Los Angeles Lakers have lost three in a row and 10 of their last 13, but LeBron James believes the team still has a chance.  https://t.co/8rGidCCLOb",
    "81": "According to @JakeLFischer, few coaching figures are optimistic that Frank Vogel will be the #Lakers head coach next season. The word in coaching circles is that Los Angeles will likely prioritize finding an experienced coach rather than a first-timer.",
    "82": "📍: Dylan O'Brien at the premiere of HBO’s “Winning Time: The Rise Of The Lakers Dynasty\" at The Theatre at Ace Hotel in Los Angeles, California.\n\n📆: March 2nd, 2022\n\n🧥: Starter Vintage Los Angeles Lakers Satin Bomber Jacket in yellow https://t.co/ltJu3BpoDe",
    "83": "Dwight Howard, Los Angeles Lakers, Xbox Open A State-Of-The-Art Gaming Lab Inspiring Kids To Dream Big https://t.co/U7McLfjS2i",
    "84": "The future of the Los Angeles Lakers with LeBron James and Russell Westbrook seems clouded at this point, as does Tobias Harris' future in Philadelphia. Here is some of the latest rumors gathered by @HoopAnalysisNet from around the NBA. https://t.co/nsXLFMTb3H",
    "85": "@BID316 @ShannonSharpe @Lakers I'm comparing the four year since LeBron arrived in Los Angeles. Missed the playoffs, won the bubble ring, play-in and bounced out of the playoffs, and this year I don't even want to talk about it",
    "86": "Draymond Green sounded off about the Los Angeles Lakers being booed by their fans 😳\n\n(via The Volume) https://t.co/IsFinFYyVF",
    "87": "@Ralph_MasonJr Lmao brodie bro, no one is taking your point away from you, it’s all yours. Los Angeles lakers won the Championship and not LeBron all stars.",
    "88": "The Los Angeles Lakers: Professional Basketball's Casting Couch https://t.co/M6hm9jTWRi @UrinatingTree you need to do a revisit of the Lakers",
    "89": "#Temporada: NBA en vivo: Los Angeles Lakers vs. Los Angeles Clippers. https://t.co/6ihRKPQafG",
    "90": "Super cool alert!\n\nDwight Howard, Los Angeles Lakers, Xbox Open A State-Of-The-Art Gaming Lab Inspiring Kids To Dream Big https://t.co/DU8xWhgHVV",
    "91": "Los Angeles Lakers LeBron James jersey lapel pin-Hardwood Collectibles-#1 Seller - https://t.co/Q8ASE8oBBd\n\n#lebron #lebronjames #lakers #nba \nhttps://t.co/apiaWNZQh6",
    "92": "Los Angeles Lakers vs. Los Angeles Clippers https://t.co/F5E9JstxVB",
    "93": "Los Angeles #Lakers prop bets: 7 props for Lakers vs. #Clippers https://t.co/q3onajlLXe",
    "94": "carmelo anthony to los angeles lakers espn first take  https://t.co/719KRS69R5",
    "95": "📸 Dylan O'Brien attending the 'Winning Time: The Rise of the Lakers Dynasty' Los Angeles Premiere (March 2, 2022) - https://t.co/FY8rS7mbGU https://t.co/fEokduYyx8",
    "96": "@nypost How bad does a trade and situation have to be for both player Russell Westbrook and team Los Angeles Lakers to be looking forward to the OFFSEASON to kill the beast ?? WTF https://t.co/ouNQTr61iG",
    "97": "I have given up on the Los Angeles Lakers this season 🥲",
    "98": "Bro. 9/13 from 3 and 11/15 from 3 in back to back games. Idc if he’s not all defense if he can make a 3 the @Lakers should already have him in Los Angeles by this afternoon https://t.co/xg1iC3PFlV",
    "99": "Magic Johnson Signed A 25-Year, $25 Million Contract With The Los Angeles Lakers In 1981 #SmartNews  https://t.co/iJXmGjTId9",
    "100": "HBO Max depicts the ‘Showtime’ era of the Los Angeles Lakers in ‘Winning Time’ https://t.co/9ieZ77FYT0",
    "101": "I have the perfect scenario for Russell Westbrook and the Los Angeles Lakers:\n\nhttps://t.co/TVdH1C8mqL",
    "102": "Phoenix Suns Have A 25.3% Chance To Win The NBA Championship This Season, Los Angeles Lakers Have 0% According To Basketball Reference https://t.co/OQ1fCSPwg5",
    "103": "New 📷\n\nDylan O'Brien (@dylanobrien) and his friend Sarah Ramos (@sarahramos) at the premiere of her new show, HBO's \"Winning Time: The Rise Of The Lakers Dynasty\" at The Theatre at Ace Hotel in Los Angeles, California. (March 2, 2022) https://t.co/eZSDG7bg4E",
    "104": "@pierre_armani “Coming to you live from the https://t.co/njEeWMWPdA Arena in Downtown Los Angeles, it’s the Battle of LA featuring the 8th seeded Clippers against these sorry trash ass Lakers.” - Kevin Harlan",
    "105": "Will the Los Angeles Lakers finally break their three-game losing streak tonight? #LALvsLAC https://t.co/NXR0qAOrSK",
    "106": "Christina Aguilera in a Black Leather Coat Arrives at the Lakers Game at the https://t.co/SKFa2fqLU0 Arena in Los Angeles 01/09/2022 https://t.co/0qSbTGYEzI",
    "107": "@JLewis562 This isn’t very difficult to comprehend: who was the head coach of the two time three peat Chicago Bulls and one time three peat Los Angeles Lakers",
    "108": "#Sports #TopStories LeBron James Believes That The Lakers Can Still Redeem Themselves After Their 10th Loss This Season: The Los Angeles Lakers, led by LeBron James, are now in a difficult situation. Following their most recent 109-104 loss to the… https://t.co/u3AwfmPPHH",
    "109": "New Los Angeles Times Podcast On True Stories Behind Scripted TV Shows To Debut With Look At 'Showtime' Lakers' 'Winning Time' https://t.co/P0iaGhpp6P https://t.co/zi8docenqH",
    "110": "Top offseason options for the Los Angeles #Lakers to dump Russell Westbrook, via @HoopAnalysisNet. #NBA \n\nhttps://t.co/5HUX7SAFbj",
    "111": "Draymond Green trashes Los Angeles Lakers fans, calls them 'spoiled brats' – Lakers News https://t.co/pDftlYZGcv",
    "112": "Xbox teams up with Los Angeles Lakers and Dwight Howard for new Dream Space collaboration https://t.co/1wPUPZQgxd #stiri #Romania",
    "113": "As well the finalists for the Los Angeles Lakers fall from grace award given to the team who fell the most in the standings from a season ago have been announced \n\nDBZ , RAPS , PPW 😂😂😂😂😂😂😂",
    "114": "“Meet the NEW LeBron James” Rockets’ Jalen Green sends NBA fans down memory lane with an iconic chase-down block https://t.co/UJQgpnqHTz #HoustonRockets #LosAngelesLakers",
    "115": "Built a team featuring my favorite Magic players of all time, and then simulated matchups (using WhatIfSports) against the 15-16 Golden State Warriors, the 95-96 Chicago Bulls, and the 99-00 Los Angeles Lakers \n\nMagic won all 3\n\nBox Scores for each game shown below https://t.co/FGUIBLp5mI",
    "116": "The Los Angeles Lakers &gt; The Klutch Sports Lakers",
    "117": "How a pair of unknowns made themselves into Lakers legends for HBO’s next big drama\nhttps://t.co/aUGGQaJKkv",
    "118": "Lebron James says his favorite player is PSG star Lionel Messi. The Los Angeles Lakers forward got asked which football/soccer player he enjoyed the most and even though he listed Cristiano Ronaldo, Mohamed Salah and Kylian Mbappé he ultimately chose Lionel Messi. #SZSNews https://t.co/Amk0bqBCky",
    "119": "Draymond Green trashes Los Angeles Lakers fans, calls them ‘spoiled brats’ https://t.co/A9u5guesae #Featured #NBA #DraymondGreen",
    "120": "Phoenix Suns Have A 25.3% Chance To Win The NBA Championship This Season, Los Angeles Lakers Have 0% According To Basketball Reference https://t.co/JFJd0sfHt4",
    "121": "Just in case you weren’t aware, the 2021-2022 Los Angeles Lakers have hit rock bottom\n\nIn a season where there were championship aspirations, we’re crossing our fingers that they make the play-in tournament…THE PLAY-IN TOURNAMENT",
    "122": "@brunohatestw The Los Angeles Lakers are a top 20 team in the NBA. \n\nTrue or False? https://t.co/VmeFUjrLgY",
    "123": "Los Angeles Lakers are the most POORLY constructed NBA team EVER\n\nhttps://t.co/udwy16hLhJ\n\n@LakersNation @Lakers \n\n#Lakers #PurplePrince",
    "124": "Xbox Teams Up with the Los Angeles Lakers and Dwight Howard for New Dream Space Collaboration: At Xbox, we know the joy of gaming can power dreams, which is why we love collaborating with organizations who consistently inspire their fans to reach for the… https://t.co/IMdzsytvy4 https://t.co/DYf8gkqc5Q",
    "125": "NOLA Pelicans (26-36) are only 1.5 GB the Los Angeles Lakers (27-34) and have yet to play out their final 2 games in their series. The Los Angeles Lakers owe their pick to the Pelicans if it lands between 1-10. https://t.co/sJ6kHJRePr",
    "126": "Reports : The los Angeles Lakers and Russell Westbrook have mutual Interest in parting ways this Offseason",
    "127": "The Los Angeles Lakers have fallen to the 9th seed in the West 😐\n\nIt's hard to believe. Will they make it to the Playoffs? 🤔\n\n🏀 BET ON THE LAKERS' PLAYOFF RUN ➡️https://t.co/uZJgIXi5xs\n\n#NBA #NBATwitter #LakeShow",
    "128": "🔥Thursday HOOPS 🔥\n\n🏀Game props available🏀\n\n💜💛@Lakers🆚@LAClippers💙❤️\n⏰10:00pm ET\n📍https://t.co/tWCZO1WOlA Arena, Los Angeles\n\nAre you team #LakeShow or do you go with #ClipperNation 😎\n\nODDS https://t.co/UOoXvd2FfD\n\n#sportsbettor #bettingtwitter #thursdaymorning #Bitcoin https://t.co/JYkib92x5x",
    "129": "Screening HBO's new series about the 80s Los Angeles Lakers, \"WINNING TIME\"\n\nDamn this show's awesome!\n\nThey made it look like they filmed this in the 80s 🙂\n\nEvery Laker fan's gonna love #WinningTime, believe me!\n\n#Lakers #LakersNation #LosAngelesLakers #LAL @Lakers #LakerNation https://t.co/GPSd2dDruc",
    "130": "Coming this weekend - Review: 'Winning Time' strives for substance in look at 1980s Los Angeles Lakers https://t.co/OXuSiZ3Gx6 @winningtimehbo C",
    "131": "How will the Los Angeles Lakers end their 2021-2022 season?",
    "132": "Did someone have #Xbox becoming an “Official Sponsor of the Los Angeles Lakers”?  🥰 Well, us in the #XboxSports team did just that. So stoked #PowerYourDreams #Lakers \n\nXbox Teams Up with the Los Angeles Lakers and Dwight Howard  https://t.co/DEqPHpNFwk",
    "133": "The Los Angeles Lakers play basketball today. Clippers are -2.5 #GamblingTwitter https://t.co/qlJmGj6gAz",
    "134": "Revenge Game: Ivica Zubac plays Los Angeles tonight.  He played 114 games in his career for the Lakers.",
    "135": "\"What I’m doing right now ain’t good enough,\" says Russell Westbrook of his recent play for the Los Angeles Lakers.  https://t.co/PIPEdoIqBh",
    "136": "Why The Los Angeles Lakers Are Dangerously Looming Out Of The Play-In https://t.co/tkF9RQ3Xx5 via @YouTube \nnew video dropped, sorry Lakers fans @TheImanolPerez",
    "137": "I pray for the day the Boston Celtics and the Los Angeles Lakers face each other one more time in the NBA finals..\n\nthe battle for 18☘️🔥 https://t.co/88BCo74RQf",
    "138": "Xbox Teams Up with the Los Angeles Lakers and Dwight Howard for New Dream Space Collaboration https://t.co/s0PTWBmAGn",
    "139": "Xbox Teams Up with the Los Angeles Lakers and Dwight Howard for New Dream Space Collaboration https://t.co/SQQxISHgdO",
    "140": "#NBA 🏀\n\n• LOS ANGELES LAKERS ML (+125) 1u\n\nTHE DAWG IS HITTING ON TNT TONIGHT FELLAS ‼️💯\n\n#GamblingTwitter #FreePicks https://t.co/uGzuyBg6Lj",
    "141": "Xbox Teams Up with the Los Angeles Lakers and Dwight Howard for New Dream Space Collaboration  https://t.co/9AvcBCThnv",
    "142": "Xbox Teams Up with the Los Angeles Lakers and Dwight Howard for New Dream Space Collaboration https://t.co/lDEy8jTHcl",
    "143": "Xbox Teams Up with the Los Angeles Lakers and Dwight Howard for New Dream Space Collaboration  https://t.co/dxwAC621br https://t.co/DmNeZQ6DNQ",
    "144": "HBO Max’s ‘Winning Time’ relives the formative years of the Los Angeles Lakers during the glitz and glam of the late 70s and 80s https://t.co/ivoL0IFCu6",
    "145": "Los Angeles Lakers vs. Dallas Mavericks Review (@naaaatteeee) https://t.co/PGc8MqknyS",
    "146": "\"I don't mind losing, but when you don't have a lot of effort, it shows,\" says Shaquille O’Neal to the Los Angeles Lakers after the team’s third straight loss. https://t.co/IwojL0j6Dp",
    "147": "Xbox Teams Up with the Los Angeles Lakers and Dwight Howard for New Dream Space Collaboration https://t.co/ZL2pWcmKbE",
    "148": "Consensus Line Move:\n2022-03-03 Los Angeles Lakers at Los Angeles Clippers from 219.00 to 220.50\nOver undervalued\n#NBA #soccer #coding #investingtips",
    "149": "Los Angeles Lakers vs  Los Angeles Clippers Prediction 3/3/22 -  Free NB... https://t.co/3PJynW4a9P via @YouTube",
    "150": "Event |  Washington Wizards VS Los Angeles Lakers https://t.co/97SGv8ta2K | For info &amp; tickets https://t.co/5FAxHuTcSp",
    "151": "Bu Gece NBA🏀 \n\nLos Angeles Clippers- Los Angeles Lakers\n\n⏲️06.00\n\n📺S Sport \n\n📱💻@ssportplustr\n\n🎙️ @ugurozan \n\n🗣️ @kaankural",
    "152": "Xbox teams up with Los Angeles Lakers and Dwight Howard for new Dream Space collaboration https://t.co/AVN9P216R5 #Microsoft #News",
    "153": "Xbox Teams Up with the Los Angeles Lakers and Dwight Howard for New Dream Space Collaboration https://t.co/HlwL7UQzv9",
    "154": "It's Time For Russell Westbrook And The Los Angeles Lakers To Break Up T... https://t.co/KSIrAzF7E9 via @YouTube\n\n#nba #nba75 #basketball #bball #lakers #lalakers #losangeles #westbrook #sports #espn #podcast #youtube #YouTubers #NBATwitter",
    "155": "LOS ANGELES LAKERS vs\nLOS ANGELES CLIPPERS, 11:00PM.",
    "156": "Xbox Teams Up with the Los Angeles Lakers and Dwight Howard for New Dream Space Collaboration  https://t.co/vLCPI2wNOG  #Xbox",
    "157": "Your Daily NBA Tip is Here!\nReggie Jackson - Under 19.5 against the Los Angeles Lakers #nbabets #nbabetting https://t.co/7e9oxVa0P5",
    "158": "“Anytime I can get his blood pressure up, I love it” Charles Barkley reveals ‘Best-Friend’ Shaquille O’Neal believes there’s no strategy in basketball https://t.co/pBb0hprPfB #LALakers #LosAngelesLakers",
    "159": "Xbox Teams Up with the Los Angeles Lakers and Dwight Howard for New Dream Space Collaboration – Lakers News https://t.co/KvXaRMnMen",
    "160": "Xbox Teams Up with the Los Angeles Lakers and Dwight Howard for New Dream Space Collaboration https://t.co/1fc84Y1mM9",
    "161": "7. Los Angeles Lakers https://t.co/OGTcx6RiZK",
    "162": "LOS ANGELES LAKERS https://t.co/Besut3fHKL",
    "163": "Xbox teams up with Los Angeles Lakers and Dwight Howard for new Dream Space collaboration : https://t.co/M2hy2q2uWN",
    "164": "Xbox Teams Up with the Los Angeles Lakers and Dwight Howard for New Dream Space Collaboration https://t.co/HWga00lL16",
    "165": "Great #autographed photo of Lenny Wilkens available @beckettmedia authenticated from our #basketball super-selections on eBay https://t.co/JDM4SnpVIp and Amazon https://t.co/CRD6I4ilfZ\n#lennywilkens #supersonics #lakers #seattlesupersonics #losangeleslakers #nba #allstar",
    "166": "Xbox Teams Up with the Los Angeles Lakers and Dwight Howard for New Dream Space Collaboration https://t.co/UT61v3oeoC",
    "167": "Xbox Teams Up with the Los Angeles Lakers and Dwight Howard for New Dream Space Collaboration https://t.co/Y9fV9T0wSC",
    "168": "Xbox Wire:  Xbox Teams Up with the Los Angeles Lakers and Dwight Howard for New Dream Space Collaboration: At Xbox, we know the joy of gaming can power dreams, which is why we love collaborating with organizations who… https://t.co/jHbjlOdKXG #videogames #xbox #gaming",
    "169": "Xbox News: Xbox Teams Up with the Los Angeles Lakers and Dwight Howard for New Dream Space Collaboration https://t.co/n8xJVKYelu",
    "170": "Xbox Teams Up with the Los Angeles Lakers and Dwight Howard for New Dream Space Collaboration https://t.co/cgeAizMgYg",
    "171": "Xbox Teams Up with the Los Angeles Lakers and Dwight Howard for New Dream Space Collaboration https://t.co/cgeAizMgYg",
    "172": "Xbox Teams Up with the Los Angeles Lakers and Dwight Howard for New Dream Space Collaboration https://t.co/aDZXg3xcVV",
    "173": "Xbox Teams Up with the Los Angeles Lakers and Dwight Howard for New Dream Space Collaboration https://t.co/y2rJSbc2bH",
    "174": "Xbox Teams Up with the Los Angeles Lakers and Dwight Howard for New Dream Space Collaboration  https://t.co/zRVQHvHXy9 #XBOX",
    "175": "News from : Xbox Wire! :\n   \nXbox Teams Up with the Los Angeles Lakers and Dwight Howard for New Dream Space Collaboration\n\n  Download the #app ApplayGames for more news, videos and #games information:\n  https://t.co/P9RwkTP5My\n\nhttps://t.co/vAO5qHA8SM",
    "176": "Consensus Line Move:\n2022-03-03 Los Angeles Lakers at Los Angeles Clippers from 218.00 to 219.00\nOver smoke and mirrors\n#NBA #sport #ai #cryptocurrency",
    "177": "Analyzing Thursday’s Los Angeles Lakers at Los Angeles Clippers odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/1tuKH40Gwg",
    "178": "Los Angeles Lakers at Los Angeles Clippers odds, picks and prediction https://t.co/mKa0k19dhN",
    "179": "Tonight's NBA Thursday double-header: \n\nMemphis Grizzlies @ Boston Celtics tonight at 7:30pm ET on TNT. \n\nLos Angeles Lakers @ Los Angeles Clippers tonight at 10pm ET on TNT. https://t.co/JLXDzJSDso",
    "180": "Thurday's #NBA75 #BettingPicks \n\n💰@SpreadAstaire is determined to cash his fourth consecutive banker of the week\n\n🏀Los Angeles Lakers vs Los Angeles Clippers: Banker at -110 (1.91)\n\n+Parlay at +265 (3.65)\n👇👇👇\nhttps://t.co/2mwfTKWwJL",
    "181": "After going to Los Angeles I see why the lakers keep losing. That place is fucking miserable.",
    "182": "#BASKETBALL can the story be ethically told now? Who was patient zero in the story of #Magic Johnson of the Los Angeles #Lakers getting HIV? Asking because HBO is advertising some sort of documentary. #NBA #MedEd \nhttps://t.co/LXxlJqRosX https://t.co/rBpU9YcUFT",
    "183": "On this day in sports history March 3, Boston Celtics Center Bill Russell pulled down 38 Rebounds against the Los Angeles Lakers in 1965.",
    "184": "NBA GM on Rob Pelinka: “He was an asshole as an agent” #LosAngelesLakers #RobPelinka https://t.co/nCZ1DiMBDO",
    "185": "The Los Angeles Lakers Are 6-12 Since LeBron James' Famous Apology Tweet: “It's Not His Fault.\" – NBA News https://t.co/KlDftbNncz",
    "186": "The Los Angeles Lakers Are 6-12 Since LeBron James' Famous Apology Tweet: “It's Not His Fault.\" – Lakers News https://t.co/fIn2tA0SI9",
    "187": "Los Angeles Lakers 27-34",
    "188": "3/3 on my @CollectableApp pod #CollectableDaily: Bestselling author @jeffpearlman discusses how @hbo turned his book \"Showtime\" into the series \"Winning Time: The Rise of the @Lakers Dynasty.\"\nhttps://t.co/tQx5W5bSoW\n#WinningTime #Lakers #LosAngelesLakers #NBA #basketball #HBO",
    "189": "Los Angeles Lakers 27-33",
    "190": "There is no #Light at the end of the tunnel for the Knicks - Stephen A. Smith | #NBA Countdown - https://t.co/WHjePU7GXD - #ESPN #LosAngeles #LosAngelesLakers #NewYork #NewYorkKnicks #Shares #York",
    "191": "Magic Johnson Signed A 25-Year, $25 Million Contract With The Los Angeles Lakers In 1981 – NBA News https://t.co/soAeEmtxs0",
    "192": "Magic Johnson Signed A 25-Year, $25 Million Contract With The Los Angeles Lakers In 1981 – Lakers News https://t.co/4J08kL7CjW",
    "193": "The Los Angeles Lakers have lost three in a row and 10 of their last 13, but LeBron James believes the team still has a chance.  https://t.co/b96fPQ2UBE",
    "194": "Phoenix Suns Have A 25.3% Chance To Win The NBA Championship This Season, Los Angeles Lakers Have 0% According To… – NBA News https://t.co/75fnEFLuAq",
    "195": "Phoenix Suns Have A 25.3% Chance To Win The NBA Championship This Season, Los Angeles Lakers Have 0% According To… – https://t.co/S5Vs1WpTQK",
    "196": "Phoenix Suns Have A 25.3% Chance To Win The NBA Championship This Season, Los Angeles Lakers Have 0% According To… – Lakers News https://t.co/J2E2KPbur6",
    "197": "\"#NBA News: Los Angeles Lakers Fighting Just to Make N.B.A. Playoffs - The New York Times #News\": https://t.co/pZrjR9alyM",
    "198": "The LA Clippers Have A Better Record Than The Brooklyn Nets And The Los Angeles Lakers Despite Not Having Kawhi Leonard … – Lakers News https://t.co/28BN1BM2yk",
    "199": "The LA Clippers Have A Better Record Than The Brooklyn Nets And The Los Angeles Lakers Despite Not Having Kawhi Leonard … – NBA News https://t.co/ivC5kPz6wi",
    "200": "\"#NBA News: Los Angeles Lakers Fighting Just to Make N.B.A. Playoffs - The New York Times\": https://t.co/LIoqjS3gMx",
    "201": "\"What I’m doing right now ain’t good enough,\" says Russell Westbrook of his recent play for the Los Angeles Lakers.  https://t.co/8IhbXbLnPE",
    "202": "\"What I’m doing right now ain’t good enough,\" says Russell Westbrook of his recent play for the Los Angeles Lakers.  https://t.co/rduJgHF0EF",
    "203": "James Worthy on Russell Westbrook: “He’s got to stop feeling sorry for himself” #JamesWorthy #LosAngelesLakers #RussellWestbrook https://t.co/VkMdGxdHYH",
    "204": "D.J. Augustin on joining Lakers: “You can’t pass up on opportunities like that as an NBA player” #DJAugustin #LosAngelesLakers https://t.co/DK8Rbkuq4D",
    "205": "Frank Vogel on D.J. Augustin: “He fills the need for what we have” #DJAugustin #FrankVogel #LosAngelesLakers https://t.co/BEfHFyrtwr",
    "206": "Colin Cowherd explores a potential blockbuster trade offer involving LeBron James and the Los Angeles Lakers as Colin continues to be vocal about the comatose Lakers blowing up their entire roster. https://t.co/xMdWay1LKw",
    "207": "Lebron James Los Angeles Lakers Purple Jersey Shirt #23 Stars - https://t.co/pDjXG1T2DL\n\n#lebron #lebronjames #lakers #nba \nhttps://t.co/24nHw9Zjl4",
    "208": "Wenyen Gabriel on how he joined Lakers #LosAngelesLakers #WenyenGabriel https://t.co/55vqUgRl8X",
    "209": "Kobe Bryant almost joined ‘NBA on TNT’ crew after retirement, per Charles Barkley https://t.co/hCgsldEecg #LALakers #LosAngelesLakers",
    "210": "Frank Vogel expects D.J. Augustin and Wenyen Gabriel to be available for Clippers game #DJAugustin #FrankVogel #LosAngelesLakers #WenyenGabriel https://t.co/rOZXe7qRDe",
    "211": "Los Angeles Lakers Fighting Just to Make N.B.A. Playoffs - The New York Times https://t.co/EWlmLA2Rtv",
    "212": "Los Angeles Lakers Fighting Just to Make N.B.A. Playoffs - The New York Times https://t.co/MWuVabmAyp",
    "213": "NBA Basketball Game Betting Picks Simulator: 10:00 PM ET - Los Angeles Lakers vs. Los Angeles Clippers - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/giSO7M3Uak #nba #sportsbetting #freepicks #cappertek",
    "214": "Los Angeles Lakers Fighting Just to Make N.B.A. Playoffs - The New York Times https://t.co/kvnJbQ0ybr",
    "215": "Los Angeles Lakers Fighting Just to Make N.B.A. Playoffs - The New York Times https://t.co/splsGolZaD",
    "216": "\"The Los Angeles Lakers will not only make the playoffs, but they will win a series\"\n\n@KingJosiah54's betting on the Lakers winning a series in the playoffs 👀\n\nTap in for more hot takes: https://t.co/xCiNPesMbA https://t.co/c6nipKJ8Us",
    "217": "The most recent tales recommend that Russ could look for from Los Angeles considerably more than Lakers fans need him out. https://t.co/Y1TUhAmaLU via @inworldcitynews \n#Lakers #LosAngeles",
    "218": "@kendontmiss The clippers will never win the whole thing, they are cursed or something. Sorry lakers will always rule Los Angeles even if lakers have a losing record. Just like the niners owned northern Ca when the raiders were up there,It is what it is.",
    "219": "Frank Vogel Still Has Faith In The Los Angeles Lakers: 'If Anthony Davis Is Able To Come Back And We Catch The Right… – NBA News https://t.co/uNFLSfapwt",
    "220": "Frank Vogel Still Has Faith In The Los Angeles Lakers: 'If Anthony Davis Is Able To Come Back And We Catch The Right… – Lakers News https://t.co/JRgSQOvTRO",
    "221": "Frank Vogel Still Has Faith In The Los Angeles Lakers: 'If Anthony Davis Is Able To Come Back And We Catch The Right… – https://t.co/vuQF4CshLy",
    "222": "'I don't mind losing, but when you don't have a lot of effort, it shows,' says Shaquille O’Neal to the Los Angeles Lakers after the team’s third straight loss. https://t.co/pgB4aW2WEi",
    "223": "'I don't mind losing, but when you don't have a lot of effort, it shows,' says Shaquille O’Neal to the Los Angeles Lakers after the team’s third straight loss. https://t.co/Rf03TEAin0",
    "224": "@Bl8knstuff2 @MikeRobledo2 @JimmyTraina I've loved the Lakers since birth but this is 100% a Dodgers town... this is simple proof that Dodgers fans care wayyyyyy and are much larger than the Lakers fan base IN Los Angeles https://t.co/NjHMipE7gG",
    "225": "Lebron James Los Angeles Lakers Youth Jersey Size Medium 10/12 - https://t.co/deu3an1Tq6\n\n#lebron #lebronjames #lakers #nba \nhttps://t.co/9zSRDIAL0T",
    "226": "The Los Angeles Lakers are fighting just to make the NBA playoffs https://t.co/PJpXXM8Pnl",
    "227": "Los Angeles Lakers Fighting Just to Make N.B.A. Playoffs https://t.co/GNV3QDQunf",
    "228": "Los Angeles Lakers Fighting Just to Make N.B.A. Playoffs - The New York Times https://t.co/u0Nlc6YF1g https://t.co/5ljS68SjV0",
    "229": "Los Angeles Lakers vs. Los Angeles Clippers - 3/3/22 Free Pick &amp; NBA Betting Prediction https://t.co/blQ5JAm8EG\n.\n#Betting #FreePicks https://t.co/FApgfL8uFU",
    "230": "Lakers vs. Clippers Preview: Can the Lakers ever stop their skid? (Silver Screen and...)\n\nLos Angeles is, was and always will be a Lakers https://t.co/f1ZYjVOGWI matter how hard the Clippers may try...\n\nAdd your highlights:\nhttps://t.co/1K3fbqC9sa\n #LA_Lakers",
    "231": "Three Things to Know: Lakers at Clippers - 3/3/22 | Los Angeles Lakers (Los Angeles Lakers)\n\nThe Lakers (27-34) face the Clippers (33-31) on Thursday evening for a road game at Crypto.c...\n\nAdd your highlights:\nhttps://t.co/CSxTeIWQ1l\n #LA_Lakers",
    "232": "Los Angeles Lakers coach Frank Vogel says DeAndre Jordan wants to go to the Philadelphia 76ers.  https://t.co/iqlxZfoj1Y",
    "233": "@sigalamelissa7 Russ = Russell Westbrook #0 on the Los Angeles Lakers Basketball Organization",
    "234": "Los Angeles Lakers Fighting Just to Make N.B.A. Playoffs - The New York Times https://t.co/RkDM4Co6zB",
    "235": "What's #Best on https://t.co/DVTf2jd2ZR ?\nWoj On How The Lakers’ Slide Can Either Benefit The Pelicans Or Grizzlies : Nba Countdown\nhttps://t.co/MUWjGL1ZxT\n#sports #lakers #losangeleslakers https://t.co/M3Z4VCnjZo",
    "236": "What's #Best on https://t.co/VfZu3jgOen ?\nWoj On How The Lakers’ Slide Can Either Benefit The Pelicans Or Grizzlies : Nba Countdown\nhttps://t.co/7cnzqIeOPE\n#sports #lakers #losangeleslakers",
    "237": "Russell Westbrook's stint with the Los Angeles Lakers looked to be just a one-and-done.\nhttps://t.co/bG4xyAjyQQ\n#FastbreakNews",
    "238": "Los Angeles Lakers Fighting Just to Make N.B.A. Playoffs https://t.co/w1futdc9Sh",
    "239": "Would the Los Angeles Lakers be better with Facundo Campazzo instead of Westbrook? https://t.co/bTr3pAlx6y",
    "240": "LeBron James might leave the Los Angeles Lakers after the NBA season ends.",
    "241": "also...this is the Los Angeles Lakers clearing their roster over the summer https://t.co/ohqj5P3jDD",
    "242": "Calling it now! This off season. \n\nThe Los Angeles Lakers trade Russell Westbrook to the New York Knicks for Derrick Rose, Alec Burks &amp; Nerlens Noel.",
    "243": "#winningtime #lakers #hbo #redcarpet @ Los Angeles, California https://t.co/r0ygZAW9WX",
    "244": "The Phoenix Suns clinched a better record than the Los Angeles Lakers in February..",
    "245": "@Lakers \nHeadlines\nThe Los Angeles Lakers were crowned today with their 18th NBA championship. Even though AD had to leave early with a sprained pinky and Westbrook had 20 turnovers, 37 y.o. LeBron went for 82 points and made the winning shot by passing the ball off Giannis' head",
    "246": "2. Lakers\n\n🔍 Related Searches: Russell Westbrook, Dallas Mavericks\n📊 Detailed Stats: https://t.co/uA06HMk6rA\n📰 News Related:\nThe New York Times: Los Angeles Lakers Fighting Just to Make N.B.A. Playoffs\nhttps://t.co/TfCnt2C3V6",
    "247": "https://t.co/VkuRQhoD9Q: Los Angeles Lakers’ future looks grim https://t.co/6H2rSGCPSv https://t.co/Bt1N1DYZEt",
    "248": "FIRE ROB PELINKA !!!!!!!!!!!!! 🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥 #firerobpelinka #firepelinka #robpelinkasucks #robpelinkamustgo #LosAngelesLakers #LeBronJames https://t.co/3aCPv7koBe",
    "249": "https://t.co/E5myeS01io: Los Angeles Lakers’ future looks grim https://t.co/Ad5mMd01Ug https://t.co/RhgTEwxE3A",
    "250": "@LFRPod @LakersReporter @LakerFilmRoom @forumbluegold The future looks dark for the Los Angeles lakers and what could be happening in the next 3 years.",
    "251": "@TheCrossover The future looks dark for the Los Angeles lakers and what could be happening in the next 3 years.",
    "252": "Todd L. Boehly is Co-founder, Chairman, and Chief Executive Officer of Eldridge. Mr. Boehly is an owner of the Los Angeles Dodgers, the Los Angeles Lakers, the Los Angeles Sparks, Cloud9, and DraftKings. https://t.co/YmKh9b3fP4",
    "253": "@CFCPys @Matt_Law_DT Todd L. Boehly is Co-founder, Chairman, and Chief Executive Officer of Eldridge. Mr. Boehly is an owner of the Los Angeles Dodgers, the Los Angeles Lakers, the Los Angeles Sparks, Cloud9, and DraftKings.",
    "254": "LeBron James' not counting himself out 😤\n\nLos Angeles Lakers https://t.co/5ovZQsbarW"
}