{
    "0": "Philadelphia 76ers - Washington Wizards\nDallas Mavericks - Oklahoma City Thunder\n\nBet slip link: https://t.co/YD8otvgfTe https://t.co/Wf3By43gev",
    "1": "Power ranking Washington DC sports team names:\n\n1. Nationals\n1a. Capitals\n3. Commanders\n87. Wizards",
    "2": "@HeatCultureSZN @Rooster7XC @metal_splinter @ChefTrillie_ @longliv3kyle Yeah. I haven't checked how the money would work but if somehow the Wizards took picks and allowed Indiana to grab Duncan while Sabonis goes to Washington with Herro and others I think it would work. ONLY if Miami was Beal choice. Herro has been having a career yr + sabonis",
    "3": "NBA - 03.02.2022 03:00\n\nPhiladelphia 76ers\nWashington Wizards https://t.co/bcERbBZPqJ",
    "4": "Reporting live tonight from the City of Brotherly love. Holding it down for The Washington Wizards faithful. https://t.co/p7R9vLXxxK",
    "5": "All I can say if the wizards keep Bradley Beal they gonna be losing for years to come, are used to care about them but I’m at the point I don’t even care about them no more I don’t even look at the games that much. The Washington commanders  stresses me out too much as it is 🤔",
    "6": "@Giants__Niners @mattbarrows @bushwoodgc holy shit Washington don't have any teams with a good name, across sports.\n\ncapitals, nationals, commanders, wizards. all terrible.",
    "7": "Tuesday February 2, 2002\nMixed bag.\n\nEASTERN TENNESSEE ST (-5.5)\nWASHINGTON WIZARDS (+10.5)\nSACRAMENTO KINGS (+4.5)\nDENVER NUGGETS (+3.5)",
    "8": "@mattbarrows The Washington Wizards said “hold my beer”.",
    "9": "[GAME THREAD] Washington Wizards (23-27) at Philadelphia 76ers (31-19) - [NBCSW] 7:00PM EST (2:00AM IDT, 9:00am JST) https://t.co/iHDWUbI4J2",
    "10": "Simplesmente a SeleSixers pra enfrentar o Washington Wizards https://t.co/bamBDtAIP3",
    "11": "🏀 NBA PROP BET 🏀 \n\nDinwiddie Points O 20+\nWendell Carter rebounds U 10.5\n+507\n\n#NBAPicks #WashingtonWizards\n#GamblingTwitter #MagicTogether",
    "12": "I have live through two on my favorite teams having to change there names. The Bullets to the wizards. And The redskins to the Washington Football Team. To the Commanders. And I’ve never even seen the Wizards win. Shoot I wasn’t even alive the last time the bullets won.",
    "13": "🏀 NBA PROP BET 🏀\n\nDrummond Points O 4.5\nDinwiddie Points O 12.5\nKuzma  Points O 17.5\n\nIf u parlay +220\n\n#NBAPicks #WashingtonWizards \n#76ers #Propbets",
    "14": "The Philadelphia 76ers will be without Seth Curry as they get set to take on the Washington Wizards.  https://t.co/9giwZwCnGC",
    "15": "NBA Basketball Game Betting Picks Simulator: 7:10 PM ET - Washington Wizards vs. Philadelphia 76ers - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/6RQeIbsczI #nba #sportsbetting #freepicks #cappertek",
    "16": "Wwyd if you woke up to “The Clippers are trading veterans Nic Batum, Serge Ibaka, youngsters Isaiah Hartenstein, Ivica Zubac, Keon Johnson, and BJ Boston, and 2027 &amp; 2028 unprotected first round picks to the Washington Wizards for Guard Spencer Dinwiddie” on trade deadline day?",
    "17": "Resultados NBA\nDetroit Pistons 101-111 New Orleans Pelicans\nMilwaukee Bucks 112-98 Washington Wizards \nToronto Raptors 110-106 Miami Heat\nChicago Bulls 126-115 Orlando Magic\nMinnesota Timberwolves 130-115 Denver Nuggets \nSan Antonio Spurs 120-124 Golden State Warriors",
    "18": "Bradley Beal conflicted about future with Wizards, still prefers to remain in Washington, per report https://t.co/kKKQSPXUpY #sports #feedly",
    "19": "Philadelphia 76ers: \nBen Simmons, Isaiah Joe, Bassey, Furkan Korkmaz   \n\nfor \n\nWashington Wizards: \nBeal, Bertans, 2nd round picks \n\nWho Says No?",
    "20": "Washington Wizards Starting Lineup 2/2\n PG: Spencer Dinwiddie\n SG: Aaron Holiday\n SF: Kentavious Caldwell-Pope\n PF: Kyle Kuzma\n C: Daniel Gafford\nhttps://t.co/o75oZ8vnE8",
    "21": "Just thinking about it ... is there any sports city that collectively has worse team names &amp; logos than Washington? Nationals, Capitals, Wizards and, now, Commanders. https://t.co/gB0r2WAVGG",
    "22": "@VochLombardi Washington Football Wizards or Washington Football Children forever",
    "23": "Tonight's starting lineup for the Washington Wizards: Dinwiddie, Holiday, Caldwell-Pope, Kuzma, Gafford https://t.co/bVWH4AMCA2",
    "24": "@mattbarrows Pairs well with the Washington Wizards",
    "25": "All the washington franchises (except wizards) are W’s for logos. This was the @Commanders chance to change it up but no, they settle for the most bland of them all https://t.co/cKMJY4F9Jc",
    "26": "A wizard surfing on a crescent moon that is also a basketball and his beard is making an implied W (for Washington and/or Wizards) and he's also spinning a basketball on his finger (using magic presumably), so two basketballs in case you wondered what sport we're playing.",
    "27": "@jareddiamond If it was 1997 and we were learning the Washington Bullets were becoming the Washington Wizards with this goofy logo, Twitter would’ve LIT UP https://t.co/SnR7lLe8Wh",
    "28": "Bradley Beal conflicted about future with Wizards, still prefers to remain in Washington, per report https://t.co/5qtP9fff7c",
    "29": "@CharlyOnTV Haha, this is exactly what I’m thinking. I remember disliking the Washington Wizards name change, but once the season got rolling and they were winning, I didn’t mind it anymore",
    "30": "Bradley Beal conflicted about future with Wizards, still prefers to remain in Washington, per report\n\nhttps://t.co/a9CYAeFkMy https://t.co/0xWrPgHR8A",
    "31": "Wizards took their 6th straight L last night against Milwaukee 112-98. Kuzma had 25 and 11 boards, and Harrell had 20 off the bench for Washington. Giannis had a triple double with 33, 15, and 11. Holiday also had 22 with Portis scoring 17. —&gt;",
    "32": "If I’m the Washington Wizards, I’m saying how fast can we trade our 28 year old potential free agent who has a 30% 3P%, .065 WS/48 &amp; a -1.4 DBPM this season to the 76ers for Ben Simmons who will help us in nearly every aspect of our failing team: https://t.co/amjcGfCDi0",
    "33": "@AndrewBeckUSA Washington football team was a great name! This new team brand will rank in the bottom five of merchandising revenue, similar to their NBA team, the Washington wizards. How lame.",
    "34": "@btoporek @mwteller You just said the key point IMO, Beal is 28 this season. He is currently in his peak. And the Wizards are currently bad. If all things go perfectly for Washington, they could be good in a few years. By then, Beal will be 32+. I don't think his timing fits with Wash.",
    "35": "Philadelphia 76ers - Washington Wizards\n\nBet slip link: https://t.co/OT5v1CZfPR https://t.co/ig8mafhwFh",
    "36": "The Washington Wizards are going to give Bradley Beal 250m dollars just for him to ask out almost immediately afterwards",
    "37": "@DominicDecoco81 @WashWizards Washington Wizards is catchy though and flows. They should have just picked Washington Warriors. They even had to publicly say they weren't taking that name cause it was a favorite lol",
    "38": "ATS \n\nNBA 7:15 pm Washington Wizards at Philadelphia 76ers\nPhiladelphia 76ers -10.5 for 1 units\n\nNCAAB 7:05 pm Arkansas at Georgia\nArkansas -10 for 1 units",
    "39": "Washington - Wizards , Capitals, Nationals, commanders .. see doesn’t even fit",
    "40": "DemoKKKrats run Washington DC. Let's talk about changing the name of the Washington Wizards NBA Team.",
    "41": "@TheRealTjayy he dragged the fucking washington wizards into the playoffs, why cant people see he’s not the problem? is the lakers roster worse than last years wizards? lmfao",
    "42": "@tunabreff The Washington Football Wizards would be good tho",
    "43": "🏀 Washington @ Philadelphia\n\nStill no Beal for the Wiz and the Sixers get Embiid back from his rest night. WAS lost by 14 last night to MIL and all things point to a big Sixer win but, maybe I'm a sucker, I still like the WAS to cover a double-digit spread.\n\n🔒 Wizards +10.5",
    "44": "The #Wizards played the #Bucks last night and finish off a back-to-back tonight against the #76ers as big 10.5-point dogs. \n\nWashington has gone over in all 9 games since 2019-20 playing with no rest as a double-digit underdog.\n\n#SDQL #NBA #NBATwitter #DCAboveAll #Sixers https://t.co/ZzlMr7siyc",
    "45": "Just like the #Wizards, I predict the #Commanders will try the new logos and jersey designs for a few years before reverting back to the classic burgundy and gold with “Washington” across the front as a way to scrap the old controversial name but maintain franchise brand loyalty. https://t.co/4F0ynCFhyP",
    "46": "Check out Blue 2020 Deni Avdija Donruss Optic Rookie Prizm Washington Wizards #159  https://t.co/hScDBVBlML via @eBay",
    "47": "Check out Blue 2020 Deni Avdija Donruss Optic Rookie Prizm Washington Wizards #159  https://t.co/fAMTXC74cM via @eBay",
    "48": "Bradley Beal Conflicted About Future With Washington Wizards #NewsBreak https://t.co/5nzKTmRNfy",
    "49": "Wizards To Trade Dinwiddie; Washington Soured On Fit With Beal #NewsBreak https://t.co/WIXxyroBH7",
    "50": "The Washington Wizards are 10-15 on the road this season but just 7-16 ATS.\n\nThey're a huge road dog (+10.5) at Philadelphia tonight. https://t.co/4pR4JDSZum",
    "51": "@Commanders At least it’s better than th Washington Wizards, which continues to be the worst name in pro-sports.",
    "52": "The Washington Commanders...not bad. Now, please sign my petition to give the Wizards a new name.",
    "53": "Well...Washington D.C. sports did it AGAIN!  They chose a LAME-ASS team-name.  The NBA basketball team was renamed \"The Wizards\".  YIKES! As in GRAND Wizards of the KKK?! Actually, the word \"Wizard\" conjures-up images of \"Harry Potter\"--no competition with \"Bears\", the...........",
    "54": "INTERNSHIP (Summer 2022): Senior Sales - Washington Wizards (Washington · DC) https://t.co/eQlo65RZiK",
    "55": "Washington Wizards visits Philadelphia 76ers Predictions and Preview for 2/2/2022 today.  Who are we taking in this game?  Find out now. #SportsBetting #Sportsbook https://t.co/tk7qChwPvS",
    "56": "NBA rumors: Washington Wizards reportedly shopping Spencer Dinwiddie – NBA News https://t.co/AnQ8IwTQUm",
    "57": "If I'm the Washington Wizards I'm shopping Bradley Beal",
    "58": "Washington Wizards’ Bradley Beal out at least week due to ligament injury to left wrist https://t.co/RppErqehjC",
    "59": "Philadelphia 76ers Predictions and Preview for 2/2/2022 hosts Washington Wizards.  Find out who we are taking in this matchup. #SportsBetting #Sportsbook https://t.co/tk7qChwPvS",
    "60": "Philadelphia 76ers - Washington Wizards\nIndiana Pacers - Orlando Magic\nDallas Mavericks - Oklahoma City Thunder\n\nBet slip link: https://t.co/aDdwAlFLKy https://t.co/pzBQif5emg",
    "61": "@Domo8186 I dont know the way out of the mess they constructed. But I do know the NBA needs to ban the Washington Wizards from the supermax ext. That more than anything is what has caused the Beal civil war. And..who knows maybe Tommy/Beal agree on the $ inbetween the 181 and 242",
    "62": "RT @RedChilliesLabs: hello #NBA fans, if you love Washington Wizards, you have a chance to win more than 4000 $ZIL today.\n\nLink: https://t.co/WdIUF6jFTY\n\n#Basketball #ZilChill https://t.co/XguCEF4x1W",
    "63": "Consensus Line Move:\n2022-02-02 Washington Wizards at Philadelphia 76ers from 213.00 to 211.50\nUnder steam engine\n#NBA #sportsbook #analytics #forextrader",
    "64": "🏀 The 76ers are one game behind top-seeded Chicago in the Eastern Conference. Washington, though, cannot find a way to win and stay competitive. \n\n🏟️ Wizards-76ers free pick\n\n#DCFamily #HereTheyCome #NBATwitter\nhttps://t.co/MNPwvVCwyt",
    "65": "@sjnwoh @Daisy_dor That being said, the local basketball team used to be the Washington Bullets. And 20ish (?) years ago they changed to the Wizards because of negative connotations of bullets. That seemed very weird, but we adjusted.",
    "66": "@Hail21RIP @WashingtonRealm No connection whats so ever! Its a stupid as the Wizards. DS killed a franchise. Im loyal to the Washington Redskins and its legacy. This team is no longer that team. He seriously killed us. @Commanders FU Snider!!",
    "67": "So we have D.C. United, and the Washington Capitals, Commanders, Nationals, and... Wizards? Cmon this is supposed to be professional",
    "68": "@DudeDadEsq @Commanders George Washington commanded the Continental Army. His his is just down the river. The President is the Commander in Chief. And it’s better than Wizards",
    "69": "Wizards’ Spencer Dinwiddie might be out of Washington much sooner than anyone expected https://t.co/mww174ZpC5",
    "70": "wait. the Washington Football Team has decided they'll be the \"Commanders\" now? \n\nthat's the best they could come up with when the other pro teams in DC are the Nationals, Capitals, Wizards and Mystics? lol",
    "71": "Why a Bradley Beal-for-Ben Simmons trade makes sense for Wizards, 76ers https://t.co/H5fLjd1Oc0 #NBA #Philadelphia76ers #WashingtonWizards",
    "72": "Washington Wizards Roster https://t.co/YB1OHtciNg",
    "73": "NBA Betting Preview: Philadelphia 76’ers vs. Washington Wizards - Wednesday, February 2, 2022 https://t.co/JgAv3xbS0q",
    "74": "Kyle Kuzma and his oversized sweaters thrive with Wizards - The Washington Post https://t.co/cQ3uNBAwW2 https://t.co/1dsCncA7qb",
    "75": "@CodiMichelle89 As much as the name is underwhelming (dont think its bad. Probably on the same level as the nationals and is better than the Wizards) the \"W,\" the logo, and the uniforms are the biggest disappointment. Theyre just meh to me. Feel bad for Washington fans haha",
    "76": "My prediction is this will be exactly what happened with the Washington Wizards/Bullets.  They will just logo as W or Washington and rarely use the Team nickname.  Go look at Wizards gear, hardly a mention of Wizards anywhere. https://t.co/hNE5T2QF8O",
    "77": "hello #NBA fans, if you love Washington Wizards, you have a chance to win more than 4000 $ZIL today.\n\nLink: https://t.co/Oy2cR2JCbx\n\n#Basketball #ZilChill https://t.co/yFJtuSWMXS",
    "78": "So, the team in Washington is changing its name from Redskins (following its no-name WFT era) to the #Commanders in honor of the MIC. FFS, you might as well complete this pro-war theme and have the NBA's Washington Wizards go back to its original nickname: The Washington Bullets.",
    "79": "DC Mayor Bowser calls on the Washington Commanders to move back to DC (re-joining the Capitols and Wizards who left MD for DC two decades)\n\nHowever Ward 6 councilman says don’t return home to RFK which has been one of dozens of proposals over the years. https://t.co/MCbUPS1yjL",
    "80": "@WrapGod_ It might be the worst team name I’ve ever heard. \n\nPrior to this announcement… It was the Washington Wizards.",
    "81": "#TradeBradleyBeal #TradeBeal do it don’t fuss and get better now before it’s too late #WashingtonWizards  https://t.co/abEm00IqcJ",
    "82": "WASHINGTON WIZARDS +10.5\nHOUSTON ROCKETS +5\nSACRAMENTO KINGS +4\n2/2",
    "83": "👀😳 Bradley Beal possibly 🙏. The Philadelphia 76ers reportedly don't want to part with additional pieces in a potential swap of guard Ben Simmons for Washington Wizards guard Bradley Beal.",
    "84": "Washington Wizards VS Milwaukee BUCKS and Brooklyn  https://t.co/SdmZhxSEnO via @YouTube Click the link to watch the full video Like, comment, subscribe, share and hit the notification bell to select all to receive content, donate to the page Cashapp me at https://t.co/axffuNFMHX",
    "85": "🔴Live Basketball ~ Philadelphia 76ers vs Washington Wizards - NBA | 2022 💯\n🔗 🔴Watch Live Fullᴴᴰ 👉 : https://t.co/oMW2mEp34k ✅\n📆 :On Wednesday. February 02 /2022\n⏰ : 01:00 GMT\nDONT FORGET TO SHARE AND FOLLOW FOR MORE INFO AND UPDATE.",
    "86": "@GarbageApe Washington's other big team got a lot of flak for changing to the Wizards, but nobody remembers the old team was the Bullets unless they've followed the NBA for more than 30 years. That wasn't a racist thing, tho, more like a \"ix-nay on the urder-may\" thing",
    "87": "#NBAupdate Giannis Antetokounmpo drove the Milwaukee Bucks home with a triple-double as they bounced back with a 112-98 victory over the Washington Wizards on Tuesday. #TAGYoureIt\nhttps://t.co/7W4NAJGp9K",
    "88": "I’m traveling to The Wells Fargo Center to cover the Washington Wizards vs Philadelphia 76ers today.  📍",
    "89": "Again with injuries... Wizards could be SUFFERING on this injury! https://t.co/Rve0h7jQKX \n\n#NBA #NBA75 #BradleyBeal #Wizards #Washington #WashingtonFootball #BreakingNews #DCAboveAll #CourtSideHeat",
    "90": "I know it's shocking that the NFL owner with the biggest Napoleon complex has named his team the Commanders. On the upside, it's not the dumbest name in Washington (ahem, Wizards). Also on the upside, everyone will call them the Commies, which in turn can be the RedScare.",
    "91": "@cfpisbiased @AdamSchefter Not at all.  I like Washington Wizards, New Orleans Pelicans, Oklahoma City thunder, Columbus blue jackets",
    "92": "Unpopular opinion: I actually dig the new Washington Commanders name. It ties together well with other professional names: Capitals, Nationals, DC United, and now Commanders. Wizards needs rebrand now.",
    "93": "Washington wizards? https://t.co/szI785wnAB",
    "94": "@JuniorPalmtrees Washington wizards?",
    "95": "@carson_levy @Mikey_Rocks33 @JPFinlayNBCS @JunksRadio As a Cowboys fan I hate Washington, but the Buccaneers, Browns, Wizards, Magic, and Senators all have worse names.\n\nEventually you get numb to the name and it starts to sound normal. \n\nCommanders is not bad and the design is better than the Redskins branding was.",
    "96": "In part of my recent interview with Capital City Go-Go GM Amber Nichols, she discussed her role with Washington and connection with Wizards General Manager Tommy Sheppard. https://t.co/uW2cfoMaRg",
    "97": "Analyzing Wednesday’s Washington Wizards at Philadelphia 76ers odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/hhVg1Wz397",
    "98": "@XXXMEEZY @luckykarms817 @matthewv42 Yea unless you’re a Wizards fan, not many people watching Washington play.I agree with that.",
    "99": "Bradley Beal is holding the entire Washington Wizards organization hostage till he signs his super max, (which they shouldn't give to him)",
    "100": "The Philadelphia 76ers are finalizing a swap to send guard Ben Simmons to the Washington Wizards in return for Bradley Beal, sources say.",
    "101": "@LauraCohenSolo I agree. There’s something about DC teams. Do you remember when the Washington Bullets became the Washington Wizards?",
    "102": "So the Washington DC area has 4 major sports teams:\nCapitols (NHL)\nNationals (MLB)\nWizards (NBA)\nCommanders (NFL)\n\nNot the most creative or motivative slew of team names imo.",
    "103": "[Fischer] Despite Beal's past flirtations with leaving the Wizards, the All-Star guard has by all accounts signaled plans to re-sign in Washington this summer. The Wizards can offer Beal a five-year, $242 million extension, that's one year and roughly $6… https://t.co/NfjXE2hsHh",
    "104": "@20002ist @GeorgetownMet I don’t remember hearing anyone propose the Washington Press back then though it would have been a great name.  Just about any name would be better than the Wizards which I thought was awful when announced and still awful today.",
    "105": "@PinkNightmare8 Starting to think it must be a rule where you have to pick a “patriotic name” if you are a DC sports team. I definitely agree they needed to change from Redskins but. Commanders, Nationals, Capitals, DC United, DC Defenders .. the only exception there is the Washington Wizards.",
    "106": "DC Missed a chance to get all the nerds into sports, coulda named them the washington warlocks or some other fantasy shit, then we got the wizards and the mystics, change caps and United the druids and babarians or sum, and we could have a whole dnd party worth of sports teams",
    "107": "Ranking of the logos for Washington teams \n\nCapitals \n\nNationals \n\ngap \n\nWizards \nCommanders",
    "108": "- Boston Celtics\n- Minnesota Vikings\n- San Diego Padres\n- Toronto Raptors\n- Washington Wizards\n- Orlando Magic https://t.co/5pwm3kHVeA",
    "109": "@PatMcAfeeShow So Washington has the Natzies, the Commies and the Wizards. A trifecta of horrid names.",
    "110": "@BruceIronsNFL So Washington has the Natzis, the Commies and the Wizards.",
    "111": "@_TradeDeadline @JakeLFischer Hachimura + Avdija have been suspect trade candidates since their time started in Washington\n\nThomas Bryant’s ACL injury essentially pushed him out of the lineup\n\nI’d be expecting a trade centered around those three + if the Wizards really wanted to shake it up, include Dinwiddie",
    "112": "@lockedonclips Beal is the problem in Washington…he should be the one the Wizards should trade to the Clippers 😂\n\nnot Dinwiddie",
    "113": "@pdelsignore @AndrewYang Better than the Washington Wizards.",
    "114": "INTERNSHIP (Summer 2022): Youth Basketball - Washington Wizards (Washington · DC) https://t.co/lxhjYHFIKj",
    "115": "Washington has the stupidest-named sports teams 😂\n\nThe Wizards, The Nationals, The Commanders 🤣🤮",
    "116": "@nuetro_360 @DCSportsvsWorld @Commanders It'll grow. Better then Washington wizards that's for sure. Jerseys are stale. Logos are corny and block-y. My point is they missed a massive opportunity. They'll make older fans check out and newer fans won't be attracted to a losing franchise. No heritage in this name.",
    "117": "🔊 NEW EPISODE!\n\n- Domantas Sabonis being traded to the Washington Wizards?\n- Bradley Beal demanding out of Washington?\n- a Beal for Ben Simmons swap?\n- Paul Millsap to join the Bulls, Bucks or Lakers?\n- more Ja Morant talk!\n\n🎧 https://t.co/YRRfoACzeB\n🍏 https://t.co/VxLIqnaou7 https://t.co/yggHKW9bFw",
    "118": "So far Washington have had teams called Redskins, Wizards, Commanders, Nationals…these are some of the worst ever - all in the same zip code",
    "119": "@Commanders Ok. Not bad.\nWashington Capitols 🏒\nWashington Nationals ⚾️\nWashington Commanders 🏈\nIt fits the DC area, that's for sure. \n\nNow The Washington Wizards 🏀 are way out of place. Hmm",
    "120": "@geoff_calkins @JWright929espn  Washington Bullets to Washington Wizards",
    "121": "@RoscoeJonny Interesting but also a let down if so. The Mavericks already signed multi year deal with Chime to be on their jerseys. The Memphis grizzlies and Washington Wizards are only teams with that real estate open.",
    "122": "Siri, give me a team name for Washington that makes about as much sense as the Wizards but without the alliteration…. https://t.co/kkp58PXLaS",
    "123": "@FranchiseTagUK if they TRUELY wanted to \"Rebrand\" \nWashington ( capitals, nationals ) both red white blue color schemes, &amp; the Wizards are a joke \nchange colors to red blue silver #Sentinels https://t.co/FPFbZxKpGq",
    "124": "@TalkNats Mine would be:\n\n1.) D.C. United\n2.) Washington Capitals \n3.) Washington Nationals\n4.) D.C. Defenders \n5.) Washington Commanders\n6.) Washington Mystics\n7.) Washington Wizards \n8.) Washington Spirit",
    "125": "@LilySZhao At least Washington is consistent. Two of the worst names in pro sports with the Wizards and now the Commanders.",
    "126": "In terms of DC area sports team branding themselves as the nation’s sports team (cough cough Washington Nationals), the Commanders isn’t a bad name.\n\nStill, Wizards have the best name that isn’t some how appropriating bland “national capital region” naming (cough cough Capitals).",
    "127": "76ers look for sixth straight win tonight against the Washington Wizards. \n\nPreview, Predictions, and Odds via @parxsportsbook \n\n#HereTheyCome | @LeoSilverman \nhttps://t.co/Ry02GNTgbn",
    "128": "@UrinatingTree That’s the general trend for Washington DC sports teams in general… bland Americana sounding names (Capitols and Nationals come to mind).\n\nThen you have the Wizards and to some extent the Mystics. \n\nI’d like more names like that then something like “Commanders”.",
    "129": "@Domo8186 Every owner in sports &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt; Washington Commanders owner.\n\nThe Wizards name does suck. Wish it were Dragons just as I wish my former fav team was Redwolves.. But no, the Wiz not as bad as the Commies - I'm sorry, what is the right shortened version of that name again?",
    "130": "Relegate the Washington Wizards for pure incompetence https://t.co/qo8n8bLEUP",
    "131": "@EdgeofSports It’s not even the worst name in the Washington market. ‘Wizards’ can F right off",
    "132": "#TradeDeadlineIntel: Just a week out from the Feb. 10 trade deadline, the Washington Wizards are being described by league personnel as one of the more active teams on the NBA trade market. 🏀 #NBATwitter #2022NBATradeDeadline https://t.co/xxj06GdzJb",
    "133": "@Callytops MLB Washington Nationals Red white blue\nNHL Washington Capitals Red white blue\nNBA Washington Wizards blue ???\nNFL Washington missed the boat \ncoulda really rebranded changed colors &amp; come up with something more intune #Sentinels",
    "134": "@jontalotta Better than the idiotic Wizards. But, you know, what's in a name. A bad Washington Football Team by any other name would still play as poorly.",
    "135": "Commanders is just the worst rebrand ever. Do something cool and creative, Washington Wizards is available, nobody cares if it was an NBA team",
    "136": "@FOXLA Remember the time when the Washington Bullets changed their name to Wizards.. in hopes that crime would go down.. well that never happened.. 😂",
    "137": "Exactly this. I thought the Washington Wizards was a dumb name change. Now I don’t think twice about it. https://t.co/hwwX6qXODR",
    "138": "@BSarver35 Washington's pro sports team name \nCommanders ✅\nNationals ✅\nWizards 🤢🤢",
    "139": "Top 5 No Order:\n\nWashington Commanders\nCleveland Guardians\nChicago Sky\nCleveland Browns\nUtah Jazz\n\nHM: Washington Wizards, Green Bay Packers, Oakland Athletics, Connecticut Sun, Montreal Canadiens, Houston Texans https://t.co/VgbCPsUgrq",
    "140": "I think the Wizards should have changed their name to the Washington Basketball Team https://t.co/vY5JIvL5eB",
    "141": "@Commanders It's dumb name.  All the finalists except Red Hawgs (which was barely pass-able) were horrible.  \n\nI don't know what it is about the Washington area, they can't name teams.  The Nationals?  The Capitals? What stupid generic names?  The Wizards are the only acceptable team name.",
    "142": "Washington has the Wizards and the Commanders now. Other sports team names could follow the trend: legacy, standard, Vizzerdrix…",
    "143": "🏀 Washington Wizards (@WashWizards) #DCAboveAll\n🆚 L Milwaukee Bucks #FearTheDeer #WASvsMIL\n⏩ Philadelphia 76ers #Sixers #WASvsPHI\n✈️ N662DN | DAL8945 | B752\n🛫 MKE - 11:09 pm CT\n🛬 PHL - 1:29 am ET\n📡 Tracking: https://t.co/AzNLQhARqB https://t.co/r37OS6X1Bs",
    "144": "@skye_oakesayy4 and the Washington Wizards is better?",
    "145": "Washington now has three of the worst named sports franchises in the history of the world:\n1) Capitals\n2) Wizards \n3) Commanders",
    "146": "NBA Rumors: Wizards leaning on making Bradley Beal happy, to heavily pursue trade deadline while focused on Jerami Grant &amp; Domantas Sabonis #BradleyBeal #DomantasSabonis #JeramiGrant #WashingtonWizards https://t.co/teusEO3Ef2",
    "147": "🏀 Milwaukee Bucks def. Washington Wizards 112-98 \n\n🏀 New Orleans Pelicans def. Detroit Pistons 111-101 \n\n🏀 Toronto Raptors def. Miami Heat 110-106 \n\n🏀 Chicago Bulls def. Orlando Magic 126-115",
    "148": "Sports while i'm asleep \n\nPhiladelphia 76ers Vs Washington Wizards (NBA Matchday 51 of 82)\n\nTip-off: 1 A.m Swedish \n12 P.m British \n7 P.m Eastern \n4 P.m Western \n\nHershey Bears Vs Hartford Wolf Pack (AHL Game 40 of 71)\n\nFace-Off: 1 A.m Swedish \n12 P.m British \n7 P.m Eastern",
    "149": "The Washington Wizards are struggling through another season and Bradley Beal is a perfect fit next to Joel Embiid, making the Sixers a title contender.\n\nThis is the move I’m hoping for in the next 8 days.\n\n#HereTheyCome #Sixers https://t.co/AY15gYzJNW",
    "150": "Washington DC pro sports team names ranked:\n\n1. Capitals - NHL\n2. D.C. United - MLS\n3. Wizards - NBA\n4. Mystics - WNBA\n5. Spirit - NWSL\n6. Commanders - NFL\n8. DC Defenders - XFL\n7. Nationals - MLB",
    "151": "Why can’t Washington DC teams have cool non-American sounding names? \n\nLike Wizards and Mystics may be left field… but they’re kinda better than Nationals, Capitols, and now Commanders.",
    "152": "@SomeHomer @RapSheet Washington Wizards would be hilarious",
    "153": "Consensus Line Move:\n2022-02-02 Washington Wizards at Philadelphia 76ers from 217.00 to 213.00\nUnder spot the sucker\n#NBA #parlay #dataanalytics #realestateagent",
    "154": "If you're the Washington Wizards are you handing Brad Beal a 5 year $242 million extension after the season?",
    "155": "@Ross_Wheatley Same, it fits the theme of all the other teams In Washington too….. well besides the Wizards lol",
    "156": "@itsAntWright Washington Wizards is bad enough. Keeping with the theme I would have gone Washington Wildebeests. https://t.co/hlMk3uKjIO",
    "157": "The Greek Freak secured his 17, 25+ point game with a win over the Washington Wizards. #FearTheDeer #MILvsWAS  \n\nFinal 122-98 \n\nThe Bucks rallied back from a 17 point deficit. While Giannis Antetokounmpo finished with 33 points, 15 rebounds, and 11 assists. https://t.co/Se2C3ZDlVg",
    "158": "GAMEDAY \n\n🆚 Washington Wizards\n🏟️ Wells Fargo Center\n⏰ 21:00\n📺 NBA League Pass https://t.co/6352p0wU2P",
    "159": "The Bullets became the Wizards, now the “Football Team” are the Washington Commanders. So we just need the Nationals to renames themselves the Washington Planeswalkers.",
    "160": "@TalkNats 1. DC United\n2. Washington Nationals\n3. Washington Capitals\n4. DC Breeze\n5. Washington Mystics\n6. DC Defenders\n7. Washington Justice\n8. Washington Wizards\n9. Washington Commanders",
    "161": "@washwizardsjp @rui_8mura The Washington Wizards Ace Player Mr. Rui Hachimura Amazing Shoot🇯🇵🇺🇸🇨🇦🇯🇵🇺🇸🇨🇦🇯🇵🇺🇸🇨🇦🏀🏀🏀😉😉😉 https://t.co/0NdZIYXYSD",
    "162": "@LilySZhao Still not the worst name for Washington area pro teams. Wizards? Really?",
    "163": "I’ll always say Washington wizards is a good name. It has a fun freewheeling ABA vibe",
    "164": "@SteveCollinsSJ On the bright side, Washington bottomed out with the \"Wizards\" so there's already a worse team name in town.",
    "165": "@skiyouMeeko @JonKrawczynski @TWolvesFr I never said “scouting” Wizards players. I said had talked to Washington and surely many other teams.",
    "166": "📰 Washington Wizards at Philadelphia 76ers Predictions and Odds Feb 2!\n👉 https://t.co/9M46P7UDAh @sportsmemo",
    "167": "So Washington Commanders huh? How about Kommandos? When do the Wizards become Bullets again?",
    "168": "@casekeefer @djrtodaizza @ReichelRadio @keithps22 @whale_capper @RossTuckerNFL\n@JeremyConn1057\n\nPICK OF THE DAY: 76ers -10\n\n1) Losers of six in a row, the Wizards are dead men walking. Beal is out. Bryant is questionable. Washington comes in on a road B2B after...\n#nba #NBAPicks",
    "169": "@macandcube I liked Washington Football Team better. Better than the Wizards.",
    "170": "@Commanders So glad you didn’t change the colors.   I still hate the color change from the Washington Bullets to the Wizards even after all these years",
    "171": "@maddenry The Washington Wizards NBA team would have had something to say about that. Do fans of the Vanderbilt Commodores use Commies for short? I have no idea. The MiLB Decatur Commodores were called the Commies and I think it was on their jerseys.",
    "172": "@BarstoolMSU Head to DC and watch him play for Washington Wizards (currently playing for Capital City Go-Go)",
    "173": "@CinemaMonsieur I love the Washington Wizards\n\"Yeah, we could be patriotic...but...nah\nSo we are officially changing our name from the Bullets (violent, death, blood, military?) to the Wizards  (fantasy, magic, Gandalf, fun pointy hats). This  the right direction for a professional sports team.",
    "174": "Over the last week, @davidaldridgedc and I have been speaking with league sources about what the Washington Wizards will attempt to do at the NBA trade deadline. Now at @TheAthleticNBA, with the trade deadline eight days away, this is what we're hearing.\nhttps://t.co/jTY5yZpXbC",
    "175": "Washington D.C. teams stay having the worst names\n\nWashington Commanders 👎\nWashington Wizards 👎👎👎👎\nWashington Nationals 👎\nWashington Capitals 👎\n#WashingtonCommanders #WashingtonFootball #Commanders",
    "176": "I am so glad I punted my fandom for this absurd and pathetic franchise over a decade ago. Rather spend my time, money, and heart on sports teams with integrity, like the Baltimore Orioles and Washington Wizards. https://t.co/41RkJvxZlv",
    "177": "Washington Commanders\nWashington Nationals\nWashington Capitals\nWashington Wizards…..\n\nOne of these names is actually ass and doesn’t fit with the others",
    "178": "@Syntari13 Washington Wizards. Always think of the KKK when I see / hear that nickname lol",
    "179": "Milwaukee vs. Washington: Bucks Make Wizards Vanish, 112-98 https://t.co/igIzD9sSeJ",
    "180": "@William40595690 @_JakeRussell New Orleans Pelicans and Washington wizards are definitely worse",
    "181": "@fivetoolmooks Washington Wizards!  Awful name and even worse logo. https://t.co/uLk0VN7G20",
    "182": "@danpfeiffer Washington Wizards still sounds dumb as hell 20+ years later.",
    "183": "@obvious_shirts I agree but it fits how all the major teams in Washington zero on... For instance (Nationals, Capitals, and now Commanders) and for basketball (Mystics and Wizards) fit together.  Looking at from the wide lens ~ it really really fits.",
    "184": "@amandacarpenter The Wizards and the Commanders. Can't think of two more corny terrible names. The Washington Commanders sounds like an XFL team name",
    "185": "@JeffreyTheGreek Still better than the Washington Sea Dogs (what the Wizards almost picked).",
    "186": "Hmm now that I think about it, Washington just doesn’t know how to name teams 💀 bullets, wizards, capitals, nationals, mystics, united…like…💀 https://t.co/Nr7sLx3mjp",
    "187": "@S_A_Smoot GP I think the Washington Wizards uniform should have  a big pee-yellow color patch on the front of white shorts.",
    "188": "Consensus Line Move:\n2022-02-02 Washington Wizards at Philadelphia 76ers from -9.50 to -10.50\n#Sixers its a trap!\n#NBA #bettingexpert #datascientist #investingtips",
    "189": "One of these things is not like the other. One of these things just doesn’t belong.. #WashingtonCommanders #washingtonfootballteam #washingtonwizards https://t.co/iPxn2Lp1hp",
    "190": "When the Washington Wizards and the Washington Commanders get together during the offseason https://t.co/5DE9kKT5Ln",
    "191": "@clintchilds Worst Washington name change since the Wizards.",
    "192": "@RRose78 Washington Hoop Club 😂\n\nAnything better than Wizards",
    "193": "@Domo8186 Hard to be worse then Wizards. Maybe if it was Washington basketball team 😭",
    "194": "Hittin the heat game Monday vs Washington wizards 💕",
    "195": "@sunraysunray if the city had any sense it would've adopted that nomenclature for all franchises. Washington Basketball Squad infinitely superior to Washington Wizards",
    "196": "@schadjoe if you look at bigger picture, Washington Nationals, Capitals, and now Commanders, that's sort of fit in that categories but left out the Wizards lol",
    "197": "“As the [Washington] Wizards have discussed adding key reinforcements such as Jerami Grant, Indiana Pacers forward Domantas Sabonis has also emerged as another significant trade target.” (via @JakeLFischer) https://t.co/D1wwZL70nJ",
    "198": "#WashingtonCommanders is the new Washington Wizards. It fits sure, and it's way better than the old name, but it's meh and generic and it will never hold any mystique. 5/10, it's fine. #TakeCommand",
    "199": "Washington Commanders &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt; Washington Wizards lol",
    "200": "Rank your favorite D.C. pro team names. Here is mine:\n\n1. Washington Nationals\n2. Washington Capitals\n3. D.C. United\n4. Washington Spirit\n5. Washington Commanders\n6. Washington Mystics\n7. Washington Wizards\n\nIf D.C. Defenders still existed, I'd make them #5. https://t.co/Jf7bgygfzv",
    "201": "@NotoriousVIC007 I’m kinda gonna miss WFT🤣Commanders sounds so generic right now, but I lived through having to learn to call Washington Bullets the Wizards.",
    "202": "The Washington Commanders.. two years for this name SMH! But just like when the Bullets became the Wizards it’s going take time.. winning cures all.. #really",
    "203": "@Acosta When the Bullets became the Wizards in the NBA, the perfect (and most obvious) team name would have been the Washington Monuments. Same for the NFL franchise. Whereas Wizards made sense in a basketball context, what does Commanders even mean in a football or a DC context?",
    "204": "@granthpaulsen The Washington Wizards is a better name and logo than this!",
    "205": "@Commanders @kevinsheehanDC The Wizards logo of ‘Starman being impaled by the Washington Monument’ is better then this childish logo!",
    "206": "Maybe this puts me in the minority, but the @Commanders rebrand looks great.\n\nWAY better than the Washington Bullets changing their name to the Wizards, IMO.",
    "207": "People crushed Wizards and Nationals early on too. Now it's normal. It'll be tweaked over the next couple years as things settle in and we will get used to it, as we do all things.\n\nI just want them to get a quarterback. Call them the Washington Sillies for all I care. https://t.co/oOdbFRdKhC",
    "208": "They should have changed the color scheme of the jerseys to Red, White and Blue like the Washington Capitals, Nationals and Wizards. https://t.co/0dsDTfMos2",
    "209": "Washington...\nWizards (basketball)\nNationals (baseball)\nCapitals (hockey)\nand #Commanders (football - new name announced today)\n\nSure, I support this change. Sounds good.",
    "210": "@nathandeanDC @Pdugas2000 Both are terrible.  \n\nAt least wizards has alliteration.  And wizards is a phrase once used to describe great ball skills.  (Think wizards of Westwood.). \n\nHow many Commanders do you need on a team? \n\nOTOH, “Washington Commanders” sounds like an all male dance review.",
    "211": "The once-and-future Sea Dogs (the Washington Wizards) are rolling on the floor laughing at the Washington Football Team right now. #Commanders",
    "212": "They both felt the need to bow to questionable social pressures. Silly IMO but okay. Now that it’s done:\n\nWashington Commanders\n\nis a MUCH better name than \n\nWashington Wizards",
    "213": "3 takeaways from Milwaukee Bucks' thrilling win over Washington Wizards – NBA News https://t.co/txBNPZHrQk",
    "214": "Milwaukee Bucks buckles up Washington Wizards 112-98 Giannis Antetokounmpo 33points 15rebounds 11assists 3D.",
    "215": "Washington got the uniforms right but the name absolutely sucks. Wizards 2.0",
    "216": "I like it. \n\nIf Washington can be The Nationals, The Capitals, or The Wizards, Commanders is cool, too. https://t.co/nqmDOTmfOA",
    "217": "In the last 25yrs two Washington area teams have rebranded their look:\n\nWizards\n\nCommanders",
    "218": "#NBA75 \n\nMilwaukee Bucks 112-98 Washington Wizards \n\n🇬🇷\"The Greek Freak\" a su ritmo:\n33 PTS \n15 REB\n11 PTS\n2 TAP\n\nEl impacto de Giannis sigue asombrando. https://t.co/3sgqDbuaCU",
    "219": "With much attention on Bradley Beal’s upcoming free agency, Domantas Sabonis has emerged as a trade target for the Washington Wizards, sources said. More intel at @BR_NBA on Toronto and Goran Dragic, Utah and Joe Ingles, Boston, Phoenix and others: https://t.co/7XytaQwSZY",
    "220": "@brgridiron That last interception is a perfect ally-hoop pass in the NBA so i think our beloved Washington wizards can use him.....",
    "221": "I don't care what you name the Washington Football club; it doesn't get any worse than Wizards.\n\nBRING THE BULLETS BACK",
    "222": "The Philadelphia 76ers will wrap up their 5-game homestand when they host the Washington Wizards on Wednesday.  https://t.co/AbXCvfEd9x",
    "223": "Washington Wizards (@WashWizards) 98 - Milwaukee Bucks (@Bucks) 112\nRecap : https://t.co/93wSYxy4ki\nBoxscore : https://t.co/osuy6Ubgna\nPlay-By-Play : https://t.co/zlBjCpXKWp\nhttps://t.co/hIYpJ3TFa1",
    "224": "Giannis Antetokounmpo en la victoria de Milwaukee Bucks ante Washington Wizards anoche:\n\n33 puntos\n15 rebotes\n11 asistencias\n\n#FearTheDeer https://t.co/tDDdC8uarP",
    "225": "Wizards Losing Streak Extends to Six With Spirited Fight Against Milwaukee Bucks - NBC4 Washington https://t.co/Zc1392LQcP",
    "226": "#Wizards at 76ers preview: Washington faces Philly on second end of back-to-back https://t.co/mjEfJREjwU",
    "227": "Wizards at 76ers preview: Washington faces Philly on second end of back-to-back\n\n https://t.co/ctVNfhihAl",
    "228": "Basketball Predictions and Betting Trips through Tarot Reading – Philadelphia 76ers vs Washington Wizards – NBA League on February 3, 2022 IST￼ https://t.co/WCaoRF71Vm",
    "229": "12th seeded Washington Wizards are 9 games back from the 1 seed 💀",
    "230": "Washington Wizards vs Milwaukee Bucks Full Game Highlights | February 1 ... https://t.co/uYaaoCblCi @YouTube",
    "231": "Washington Wizards vs Milwaukee Bucks - Full Game Highlights | February ... https://t.co/863LTRzaCS @YouTube",
    "232": "NBA Basketball Game Betting Picks Simulator: 7:10 PM ET - Washington Wizards vs. Philadelphia 76ers - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/6RQeIbsczI #nba #sportsbetting #freepicks #cappertek",
    "233": "Washington Wizards (23-27, 12th in the Eastern Conference) vs. Philadelphia 76ers (31-19, second in the Eastern Conference) https://t.co/XBfgD8y6H1",
    "234": "Philadelphia 76ers - Washington Wizards\nUSA - Honduras\nArizona Coyotes - Calgary Flames\n\nBet slip link: https://t.co/3XYXxxHvCe https://t.co/sCS4PNRWEU",
    "235": "Giannis Antetokounmpo notched his fourth triple-double of the season as the Milwaukee Bucks beat the visiting Washington Wizards 112-98 on Tuesday. https://t.co/rNBDaxKys5",
    "236": "The State of My NBA... since the 2000 NBA Draft.\n\n1. Russell Westbrook (PG) - The Washington Wizards\n2. Kyrie Irving (PG) - The Detroit Pistons\n3. James Harden (SG) Houston Rockets\n4.Cade Cunningham (SG) - The Detroit Pistons",
    "237": "🏀#NBA ‼️\n1.Philadelphia 76ers Vs Washington Wizards\n2.Indiana Pacers Vs Orlando Magic\n3. Boston Celtics Vs Charlotte Hornets\n4. New York Knicks Vs Memphis Grizzlies\n5.Houston Rockets Vs Cleveland Cavaliers ...\n-------\n⭐️Free #livescore &amp; #livestream 👉https://t.co/z8cdc9BY9Y 😉 https://t.co/j9Qhv6jPmr",
    "238": "Washington Wizards (23-27, 12th in the Eastern Conference) vs. Philadelphia 76ers (31-19, second in the Eastern Conference) https://t.co/KdLbv9NyCv",
    "239": "Giannis Antetokounmpo had 33 points, 15 rebounds and 11 assists for his fourth triple-double of the season as the Milwaukee Bucks beat Washington 112-98 on Tuesday night to hand the Wizards their sixth straight loss. https://t.co/Akrd9p0iFD",
    "240": "Giannis Antetokounmpo notched his fourth triple-double of the season as the Milwaukee Bucks earned a 112-98 win and held off the visiting Washington Wizards on Tuesday. https://t.co/UzAaFA5jKI",
    "241": "SHAQ DISRESPECT”s THE ENTIRE WASHINGTON WIZARDS TEAM. https://t.co/4plgXQ0Ku7 via @YouTube",
    "242": "🏀NBA🏀01/02/22\n\nWashington Wizards(23-27) 98\nK.Kuzma:25pts,11reb,2asis\nMilwaukee Bucks(32-21) 112\nG.Antetokounmpo:33pts,15reb,11asis",
    "243": "@barstoolsports Dc thinks every DC team NEEDS to be political in some fashion… The newly named COMMANDERS (in chief), NATIONALS baseball, CAPITALS hockey, the Wizards w the red/white/blue color scheme w Washington monument obelisk logo… and DC United w their bald eagle mascot. “creative” dc 🥴",
    "244": "Washington Wizards vs Milwaukee Bucks Full Game Replay 2022 Feb 01 NBA Replay HD\nhttps://t.co/puXiOuBYb1 https://t.co/jeTuo1UJ8W",
    "245": "@PaulBrar5 So was Senators.  Nationals is very bland.  Washington has not only gotten rid of THREE nicknames, the replacements are freaking awful:\n\nSenators  &gt;  Nationals\n\nBullets  &gt;  Wizards\n\nRedskins  &gt;  Commanders\n\nWFT should have gone with Pigskins, which would have been an upgrade.",
    "246": "NBA Basketball Game Betting Picks Simulator: 2/2/2022 7:10 PM ET - Washington Wizards vs. Philadelphia 76ers - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/6RQeIbsczI #nba #sportsbetting #freepicks #cappertek",
    "247": "Teammates don’t want #SpencerDinwiddie in Washington? #BlakeGriffin: Oooh! The #Nets knew #Spencer was damaged like me! Man #Brooklyn that was cold! https://t.co/Ne5Jzyz78s via @Yahoo #WashingtonDC #WashingtonWizards https://t.co/p2hnTVaIE0",
    "248": "2/1 Top Plays:\n[NBA]New Orleans Pelicans +2💰\n[NBA]Washington Wizards +11.5❌\n[NBA]Golden State Warriors -2.5💰\n[NHL]Seattle Kraken +225❌\n[NHL]Florida Panthers -143❌\n[NHL]Ottawa Senators +240❌\n[NHL]Dallas Stars +107❌\n\nFull Results:\nhttps://t.co/zOmjEHSIjT",
    "249": "🇺🇸 Giannis went into beast mode with a  33-15-11 triple double to help the Bucks top the Wizards. When he plays like that he’s unstoppable \n\n🇮🇹 Giannis devastante: 33-15-11 e Bucks trascinati alla W su Washington. Quando gioca così non ha eguali \n\n#NBA75 https://t.co/QqZA9u6D2L",
    "250": "@BrianRiccard33 But wizards though? Really Washington?",
    "251": "NBA\n\nFT.\n\nDetroit Pistons 101 - 111 New Orleans pelicans\n\nBucks 112 - 98 Washington Wizards\n\nToronto Raptors 110 - 106 Miami Heat\n\nChicago Bulls 126 - 115 Orlando magic\n\nMinnesota Timberwolves 130 - 115 Nuggets\n\nSpurs 120 - 124 GSW\n\nPhoenix Suns 121 - 111  Nets\n#TheGamePlan",
    "252": "Giannis Antetokounmpo’s triple double (33 pts, 15 reb &amp; 11 ast) saw the Milwaukee Bucks beat the Washington Wizards 112-98 at Fiserv Forum #SSBasketball",
    "253": "Giannis Antetokounmpo had 33 points, 15 rebounds and 11 assists for his fourth triple-double of the season as the Milwaukee Bucks beat Washington 112-98 on Tuesday night to hand the Wizards their sixth straight loss.  https://t.co/D4YNk3W2Lj",
    "254": "🏀| #NBA75\n\nResumen de partidos del 1/2. \n\nDetroit Pistons 101 🆚️ 111 New Orleans Pelicans. \n\nToronto Raptors 110 🆚️ 106 Miami Heat. \n\nMilwaukee Bucks 112 🆚️ 98 Washington Wizards. \n\nMinnesota Timberwolves 130 🆚️115 Denver Nuggets.\n\n#NBAAllStar #NBATwitter https://t.co/mzJLiOXbdZ",
    "255": "MILWAUKEE — Giannis Antetokounmpo had 33 points, 15 rebounds and 11 assists for his fourth triple-double of the season as the Milwaukee Bucks beat Washington 112-98 on Tuesday night to hand the Wizards their sixth straight loss. https://t.co/aokrYidUnh",
    "256": "#GiannisAntetokounmpo had 33 points, 15 rebounds and 11 assists for his fourth triple-double of the season as the Milwaukee #Bucks beat Washington 112-98 on Tuesday night to hand the Wizards their sixth straight loss.  🏀 #NBATwitter #FearTheDeer https://t.co/lQ3A0bDHJx",
    "257": "@PaulBrar5 Wizards is the worst name I don’t care what Washington football name their team I will not be worst than Wizards but we seem to live with it.",
    "258": "@HasBFromTheWest Washington wizards ruined mine",
    "259": "With Hachimura's odd situation, and the Wizards lacking in draft capitol, I just don't see what they could realistically offer. @_Facci had a great guest spot on a Wizards podcast and it would essentially take a complete gutting of Washington's assets to get him https://t.co/rrPR5r7g6T",
    "260": "Dallas Mavericks 130 (Karl Anthony Towns 24 pts, 10 rebs) Denver Nuggets 115 (Nikola Jokic 21 pts, 16 rebs), ), Milwaukee Bucks 112 (Giannis Antetokounmpo 33 pts, 15 rebs, 11 asists) Washington Wizards 98 (Kyle Kuzma 25 pts, 11 rebs)",
    "261": "@Krabs_Bets Washington Wizards + Sacramento Kings moneyline parlay.",
    "262": "Giannis Antetokounmpo  (@Giannis_An34) posted his fourth triple double of the season as the Milwaukee Bucks (@Bucks) handed the Washington Wizards their sixth straight loss with a 112-98 victory on Tuesday.\n\nRead more: https://t.co/DfmYEUohqo\n\n#basketball\n#DailyTribune https://t.co/yBjKgCgzx3",
    "263": "Giannis Antetokounmpo  (@Giannis_An34) posted his fourth triple double of the season as the Milwaukee Bucks (@Bucks) handed the Washington Wizards their sixth straight loss with a 112-98 victory on Tuesday.\n\nRead more: https://t.co/IuQbZ31ATO\n\n#basketball\n#DailyTribune https://t.co/a5fMNlKHlx",
    "264": "\"Several people I've spoken to around the league believe the [Washington] Wizards will look to go big-name hunting with the trade deadline coming up to keep Bradley Beal happy. And they could look to acquire Domantas Sabonis or Jerami Grant.\" (via @MikeAScotto) https://t.co/vkAArZPZxn",
    "265": "#MilwaukeeBucks - #WashingtonWizards 112:98\n#NBA\n🇺🇲🏀🇺🇲🏀🇺🇲🏀\n\nMore info: https://t.co/Qpl50NdaFq https://t.co/sYMvzHLSsR",
    "266": "The Wizards may have lost a game to the Bucks today, but also won by no longer having the lamest pro sports team name in Washington DC.",
    "267": "Encerrado:\n\nMilwaukee Bucks (32-21) 112 x 98 (23-27) Washington Wizards\n\nMIL 📊\nGiannis Antetokounmpo: 33PTS/15REB/11AST/2BLK\nJrue Holiday: 22PTS/5REB/2AST/2STL\n\nWAS 📊\nKyle Kuzma: 25PTS/11REB/2AST/1STL/3BLK\nMontrezl Harrell: 20PTS/5REB\n\n#NBA https://t.co/sKxf6BS4ml",
    "268": "Giannis Antetokounmpo posted his fourth triple double of the season as the Milwaukee Bucks handed the Washington Wizards their sixth straight loss with a 112-98 victory on Tuesday. | @AFP https://t.co/cVjEUoBhdr",
    "269": "Giannis Antetokounmpo posted his fourth triple double of the season as the Milwaukee Bucks handed the Washington Wizards their sixth straight loss with a 112-98 victory on Tuesday. https://t.co/WyiJRhu6Pw",
    "270": "Giannis Antetokounmpo notched his fourth triple-double of the season as the Milwaukee Bucks earned a 112-98 win and held off the visiting Washington Wizards. #NBA75\n\nhttps://t.co/ZeSKysAxj6",
    "271": "the real pandemic is being a washington wizards fan",
    "272": "Washington Wizards vs Milwaukee Bucks Full Game Highlights | February 1 | 2022 NBA Season #Washington #Wizards #NBA Video: https://t.co/pvp2BdhsdS",
    "273": "Washington Wizards vs Milwaukee Bucks Full Game Highlights | February 1 | 2022 NBA Season #Milwaukee #Bucks #NBA Video: https://t.co/z7OmuyNgmq",
    "274": "Giannis Antetokounmpo had 33 points, 15 rebounds and 11 assists for his fourth triple-double of the season as the Milwaukee Bucks beat Washington 112-98 to hand the Wizards their sixth straight loss.\n\nhttps://t.co/IOmO9dOdSP",
    "275": "Giannis notches a triple-double enroute Bucks' 112-98 win over the Washington Wizards! 💪\n\n33 PTS\n15 REB\n11 AST\n2 BLK\n14-21 FG\n\n#giannis #milwaukeebucks #nba https://t.co/XQeUag26Qh",
    "276": "Bucks rallied in the fourth quarter to defeat the Washington Wizards on Tuesday night.  #StoryOfTheGame",
    "277": "Antetokounmpo's triple-double helps Bucks top Wizards 112-98 #Washington #Wizards #NBA https://t.co/dh9l24YcEG",
    "278": "@Lakers are such a poorly run franchise. LeBron's gonna retire and they're going to become the Washington Wizards if they don't skip this petty garbage.\n\nThis is the Logo and the guy who is responsible for MULTIPLE Lakers rings https://t.co/ZqqJzN5mpF",
    "279": "[Post Game Thread] The Milwaukee Bucks (33-21) defeat the Washington Wizards (23-28), 112 - 98 https://t.co/gZVg9FYRS5",
    "280": "The Milwaukee Bucks defeat the Washington Wizards 112-98 off of 33 points from Giannis Antetokounmpo. #WASatMIL https://t.co/UxER3VDMJi",
    "281": "Wizards vs. Bucks final score: Washington’s comeback effort falls short in 112–98 loss https://t.co/LYA3A6CgI9 https://t.co/qzlHt1nF6W",
    "282": "Wizards vs. Bucks final score: Washington’s comeback effort falls short in 112-98 loss https://t.co/07ElvEdpZQ",
    "283": "the washington wizards are somehow worse for my mental health than the seattle seahawks \n\nthat’s a feat",
    "284": "a 7-step plan to fix the washington wizards. my services are available; my fees are reasonable. https://t.co/92FbWLuFSS",
    "285": "The Bucks faced the Washington Wizards at home Tuesday night\n\n       https://t.co/BClYuh8eiz",
    "286": "#DCAboveAll 98\n#FearTheDeer 112\nFinal.\n\nKuzma: Double Double \n\nANTETOKOUNMPO: Triple Double \n\nThe Washington Wizards drop to (23-27) &amp; travel to Philadelphia to take on the 76ers tomorrow night.",
    "287": "This is how ass our football team always been back home in Washington . No name just a football team . But commander .😂🤣 only DC sports team I support is caps , nationals , wizards even though we been ass . https://t.co/KHYLJtZFEd",
    "288": "MILWAUKEE (AP) — Giannis Antetokounmpo had 33 points, 15 rebounds and 11 assists for his fourth triple-double of the season as the Milwaukee Bucks beat Washington 112-98 on Tuesday night to hand the Wizards their sixth straight loss. https://t.co/hbMU3Fbwys",
    "289": "The Bucks faced the Washington Wizards at home Tuesday night\n\n       https://t.co/foEcDX08ae",
    "290": "Washington Wizards have not been the same,they been losing like forever",
    "291": "Washington Capitals, Nationals, Wizards, Mystics … and now Commanders … seems like DC needs to update the name of their BBall teams",
    "292": "I should date the Washington Wizards, cause they love choking and I love being choked. #NBA #NBATwitter",
    "293": "#Washington trying to  hurt 🤕  #Giannis flagrant fouled yellow flag on the play \n#NBATWITTERLIVE \n#Bucks  #Wizards",
    "294": "🤖 #SofiAlert \n📅 01-02-2022 \nWashington Wizards - Milwaukee Bucks \n🛋 3.0/5 Sofis https://t.co/kz24tCXF5t",
    "295": "@AUTiger7222 Then I remember I cheer for the Washington Wizards and what in the flying fuck is that name about? 🤣🤣🤣🤣",
    "296": "At what point do the #Wizards shift their focus from...\n\n\"Bradley Beal is our guy and we want to keep him in Washington long-term\"\nto...\n\"Yeah Beal is good, but we could use assets in a trade to accelerate the growth of our young core\".\n\nYes, I know he's injured.\n#NBA",
    "297": "@Bucks get the W over the Washington Wizards tonight 112-98!!!\n\nGiannis notches his 29th Triple Double and passes Michael Jordan for 18th all-time. https://t.co/XRP7eSkFKc",
    "298": "Sixth loss in a row for the Wizards after falling to the Bucks 112-98.\n\nCouldn't stop Giannis, who went for 33-15-11. Kuz had 25 &amp; 11 for Washington.\n\nWhat're your thoughts on the performance without Beal?",
    "299": "BUCKS WIN!\n\nA equipe de Milwaukee bateu o Washington Wizards por 112 a 98.\n\nGiannis: 33PTS/15REB/11AST\nHoliday: 22PTS\nPortis: 17PTS/7REB\n\nKuzma: 25PTS/11REB\nHarrell: 20PTS\n\n📷 Stacy Revere\n\n#FearTheDeer #NBA75 https://t.co/1U2Ef9njhV",
    "300": "Will the Washington Wizards ever win another game?",
    "301": "Streets saying that boy Giannis doing something strange to the Wizards of Washington, DC?",
    "302": "Milwaukee Bucks 112 Washington Wizards 98 (final) - #Wizards #NBA",
    "303": "🏀 Final Score 🏀\nWashington Wizards 98 - 112 Milwaukee Bucks\n\nGiannis Antetokounmpo 75.8 DK, 71.5 FD\nKyle Kuzma 51.8 DK, 51.2 FD\nJrue Holiday 35.8 DK, 34.0 FD\n\nhttps://t.co/IIuYCTQkL5",
    "304": "Washington Wizards 🤡🤡🤡🤡",
    "305": "#WashingtonWizards fall to #Milwaukee 98-112 behind Giannis' 33 points.",
    "306": "The Washington Wizards have fallen way off since the start of the season\n\nThank You Milwaukee Bucks (#FearTheDeer)",
    "307": "Rui Hachimura - Washington Wizards\n8 PTS\n3 RBD\n2 AST\n1 STL\n[FD(17.6) DK(17.25)]",
    "308": "Montrezl Harrell - Washington Wizards\n20 PTS\n5 RBD\n2 TO\n[FD(24) DK(25.25)]",
    "309": "Kyle Kuzma - Washington Wizards\n25 PTS\n11 RBD\n2 AST\n3 BK\n1 STL\n2 TO\n[FD(51.2) DK(51.75)]",
    "310": "FINAL: Bucks 112, Wizards 98\n\nIt wasn't quite the feel-good victory against short-handed Washington that Milwaukee was looking for.\n\nBut Bucks found enough energy in fourth quarter to pull away.",
    "311": "Giannis went full “MVP-mode” tonight for the Bucks with 33 PTS, 15 REB, 11 AST and 2 BLK in a 112-98 victory over the Wizards.\n\nWithout Bradley Beal, Kyle Kuzma stepped up with 25 PTS and 11 REB for Washington. \n\nMilwaukee closed out the game on a 17-4 run to improve to 32-21.",
    "312": "🚨 UPDATE: Kyle Kuzma - Washington Wizards has a Double Double\n1:23 4th\n25 PTS\n11 RBD\n2 AST\n3 BK\n1 STL\n[FD(51.2) DK(51.75)]",
    "313": "@BriannaChesser Washington Bullets was the original name for the Wizards basketball team. As a Clash fan, I agree with you.",
    "314": "@DarrenMHaynes @wusa9 Washington Wizards was not liked at first either. But it was a good name change.",
    "315": "We are really struggling against the Washington Wizards.😭",
    "316": "I didn't know Gucci Mane was  a NBA referee 😭😭😭😭😭😭😭😭 @NBA @NBAonTNT @gucci1017 \n\n#NBAonTNT \n#NBA \n#guccimane \n#Bucks \n#WizBucks \n#Washingtonwizards https://t.co/uTv5f2gY3U",
    "317": "Washington wizards need a back court they need a point guard and a shooting guard that’s what they lacking they need to trade Denwittie and Bradley Beal As a package and start all over they can do better",
    "318": "truly incredible that the wizards will remain the not dumbest name in washington",
    "319": "Washington Wizards 🏀 = Wiz\nWashington Nationals ⚾️ = Nats\nWashington Capitals 🏒 = Caps\nWashington Commanders 🏈 = …\n\nCommies?",
    "320": "the wizards really should have gone for lonzo in the offseason🤦‍♂️ hopefully we can get a good guard in return for dinwiddie, i rlly want SGA in washington, send dinwiddie and rui or thomas bryant to OKC for SGA",
    "321": "Why TF are the Washington Wizards on national TV?",
    "322": "And somehow, the Wiz take their first lead after that three by Rui. Haha. If you can make heads or tails of the 2022 Washington Wizards, please explain it to me. #DCAboveAll",
    "323": "Milwaukee Bucks - Washington Wizards\nToronto Raptors - Miami Heat\nSan Antonio Spurs - Golden State Warriors\nPhoenix Suns - Brooklyn Nets\n\nBet slip link: https://t.co/oNqhoNeYOG https://t.co/reQgt86ZD8",
    "324": "The Washington Wizards battled back. Rui Hachimura’s 3 gives them their first lead of the night! 86-83.",
    "325": "Wait a minute the dam Washington Wizards are on TNT. What the heck is going on. https://t.co/IJIoHhoS3f",
    "326": "ALERT: New high roller bet posted!\nA bet has been placed for $5520.29 on Milwaukee Bucks - Washington Wizards to win $10,488.55.\nTo view this bet or copy it https://t.co/c44B0zkzg3 https://t.co/9xTcJ4aIgh",
    "327": "Y’all are so pressed over the Washington Commanders when we have the Washington Wizards in the same city…… https://t.co/ekYwCmvQky",
    "328": "@jcstavish Washington Wizards bad too.",
    "329": "Whoa….the Wizards are not bad…..they low key need one more star and another defensive stalwart and they should be solid. Take Christian Wood Washington! We’ll take Rui and some picks yah?",
    "330": "Washington Wizards got too many players",
    "331": "I’ll be in Philly tomorrow night for Sixers/Wizards. Assuming Embiid decides to play and not sit out 🙄 I’ll be hammering Philly. Washington doesn’t look good and will have no answer in the middle for Embiid. I expect the spread to be somewhere in the -7 range at least.",
    "332": "Wanna watch Ruis playing #washingtonwizards let him play we need him to win",
    "333": "Washington #Wizards guard #BradleyBeal will miss at least his team's next four games after being diagnosed with a ligament injury in his left wrist.\n🏀 🤕 #NBATwitter #NBA  https://t.co/4GpGOCqDim",
    "334": "A defesa do Washington Wizards…https://t.co/GXqYGGD75J",
    "335": "@PFF_Washington This just feels like the Wizards debacle all over again. People say just win and the name won’t matter. Problem is that regardless of the name, this franchise won’t win",
    "336": "Washington Wizards vs Milwaukee Bucks Live NBA Play By Play/Commentary https://t.co/2kXi4wyG8Z via @YouTube\n\nHit that like button and subscribe to UNeducated Sports Talk on YouTube!!!\n\nStay Smart….Stay UNeducated",
    "337": "@BlkKnight2Mech @nhliving603 @tyler_roberts22 @stoolpresidente It would be the same thing if MJ thanked the Wizards in his retirement speech and not mentioning the Bulls. MJ also said goodbye to Chicago when he went to Washington….",
    "338": "@ScottinBayV Looked it up, Sashi works for Monumental Sports &amp; Entertainment, they control the Washington Wizards, WNBA Mystics &amp; a G league team. Doesn't appear he works in their personnel office.",
    "339": "Disgusting behavior by @NBAonTNT allowing the Washington Wizards to be seen by a national audience",
    "340": "@gregorytbyrne I HATE the Washington wizards.",
    "341": "The Washington Wizards catching strays from @Shaq on @NBAonTNT \n\n “I don't watch the Wizards, do you? I don't, Wizards Bullets Sonics...” \n\n#DCAboveAll",
    "342": "@HonestLarry1 Washington Wizards has gotta be up there",
    "343": "Washington Football Team\nI can see a Protest March in Washington DC if Dan Snyder goes through w) Commander name.\nRedskins have some die hard fans.\nCommanders evoke nothingness.\nThe Wizards have done ZERO since name change from  Bullets Champions to Loooosers. Same w) Redskins…",
    "344": "Wizards down 53-40 to the Bucks at halftime\n\nWashington shoots 35% from the field and have 9 turnovers without Bradley Beal",
    "345": "End 2Q: Bucks 53, Wizards 40.\nWashington shooting just 35 percent. Nine different players have scored, but no one in double figures. \nAllen leading the way for the Bucks with 10. Giannis being a facilitator today with 8 points, 8 rebounds and 7 assists.",
    "346": "@CarolynKarl Sounds like it was great for your family then. That's pretty cool. I just know a lot of Nationals fans that go out of their way to shit on the O's fans. But you know, I have to be nice to both sides because being a Washington football/Caps/Wizards fan and all that.",
    "347": "you're not allowed to complain about the Washington Commanders if you haven't vented about the stupidity of Washington \"Wizards\" since 1997",
    "348": "@wojespn More reason for the Wizards to blow up the roster - they're going nowhere, and Beal is likely gone in a year and a half since he's not winning a championship in Washington.",
    "349": "@SpiroAgnewGhost Commanders for Washington. What is the baseball team in Cleveland? Guardians.\n\nThe Wizards.\n\nWe can't even name teams decently anymore.",
    "350": "Bradley Beal to miss at least a week with left wrist injury #Washington #Wizards #NBA https://t.co/B2LBzzjhSQ",
    "351": "Grayson Allen has 10 on 4-6. Milwaukee leads Washington 38-26. 6:12 left in the 2nd Quarter. Kispert with 5 on 2-3 for the Wizards.",
    "352": "0-1 Milwaukee Bucks / Washington Wizards o118 👎🏼",
    "353": "Also - who idea was it to put the Washington Wizards on television??",
    "354": "Whoever put the Washington Wizards on national TV vs the Bucks should be arrested immediately",
    "355": "The Milwaukee Bucks and Washington Wizards franchises have met once in the playoffs in 1971 when the Washington Wizards were known by what name?\nWashington Capitals\nWashington Bullets\nBaltimore Bullets\nBaltimore Magic\n #DCAboveAllWashington #FearTheDeer https://t.co/iCfJCXTZDO",
    "356": "The Washington Wizards are a disgrace to Washington Basketball",
    "357": "Watching the Washington Wizards play causes me actual pain",
    "358": "wizards pulling a 2021 washington nationals to be honest",
    "359": "Allen knocks down a 3 and Wizards call timeout, trailing 14-5 with 7:36 left in 1Q. \nWashington 2 for 8 from the field.\nBucks 6 for 8.",
    "360": "Washington Wizards Starters:\n\nSpencer Dinwiddie\nAaron Holiday\nKentavious Caldwell-Pope\nKyle Kuzma\nThomas Bryant\n\nPlayers out:\nBradley Beal\n#DCAboveAll #NBA #NBATwitter #NBA75",
    "361": "Watch Live Stream of Washington Wizards vs Milwaukee Bucks\nhttps://t.co/XBaTjHn9b0",
    "362": "Wizards’ Beal to be sidelined for a week due to wrist injury — report #BradleyBeal #WashingtonWizards https://t.co/FJl2B24gAm",
    "363": "Washington Wizards +11.5 (-110) 2u 🔨",
    "364": "Age of Washington nicknames:\nCommanders (2022)\nNationals (2005)\nWizards (1997)\nCapitals (1974)\n(also, Channel 4 will be reporting from Redskins Park at a location in Fairfax County) https://t.co/VrJtU7s3cO",
    "365": "Washington Wizards vs Milwaukee Bucks - NBA\nWatch Here : https://t.co/TYbqcjx9dy\nVenue: Fiserv Forum (Milwaukee)\n\n#Wizards #Bucks #NBA #LIVE https://t.co/rg5jqTP0VX",
    "366": "Milwaukee Bucks vs Washington Wizards Live Stream - NBA Today\nWatch Here : https://t.co/gf2AYhTsBB\nVenue: Fiserv Forum (Milwaukee)\n#Bucks #Wizards #NBA #Live https://t.co/bUeLs16AyV",
    "367": "The Washington Wizards have zero players participating in the Rising Stars Challenge.",
    "368": "The Washington Wizards are starting Aaron Holiday, Spencer Dinwiddie, Kentavious Caldwell-Pope, Kyle Kuzma, and Thomas Bryant. For Fantasy Analysis Click Here: https://t.co/LzbtfqXL8q",
    "369": "The Milwaukee Bucks take on the Washington Wizards, who have lost five-straight games. Get live updates from Fiserv Forum.\n\n       https://t.co/btQy0xi5ws",
    "370": "Knowing Dan Snyder, the owner of the Washington Football Team, tomorrow I fully expect him to announce the new name of the team as the Washington Grand Wizards.",
    "371": "The Milwaukee Bucks take on the Washington Wizards, who have lost five-straight games. Get live updates from Fiserv Forum.\n\n       https://t.co/WNHIDbvpzr",
    "372": "Tonight's starting lineup for the Washington Wizards: Dinwiddie, Holiday, Caldwell-Pope, Kuzma, Bryant https://t.co/bVWH4AMCA2",
    "373": "@washwizardsjp @rui_8mura The Washington Wizards Ace Player Mr. Rui Hachimura Amazing Shoot 🇯🇵🇺🇸🇯🇵🇺🇸🇯🇵🇺🇸🏀🏀🏀😉😉😉 https://t.co/D0AGFYAsnH",
    "374": "Wizards say Bradley Beal has injured ligament in his left wrist, will miss next four games starting tonight vs. Bucks\n\nBeal will be re-evaluated in about a week\n\nWashington has plummeted in East after that hot start, down to 12th and playoff chances starting to look a bit grim",
    "375": "Washington Wizards\n@ Milwaukee Bucks\nTue 7:30 PM EST\n\n🏀 Bet of the Game 🏀\n\n🟢 Under 229.5 -110",
    "376": "Consensus Line Move:\n2022-02-01 Washington Wizards at Milwaukee Bucks from 230.00 to 228.50\nUnder smoke and mirrors\n#NBA #sportsbook #ml #profit"
}