{
    "0": "Washington Wizards +11.5 (-110) 2u 🔨",
    "1": "Age of Washington nicknames:\nCommanders (2022)\nNationals (2005)\nWizards (1997)\nCapitals (1974)\n(also, Channel 4 will be reporting from Redskins Park at a location in Fairfax County) https://t.co/VrJtU7s3cO",
    "2": "Washington Wizards vs Milwaukee Bucks - NBA\nWatch Here : https://t.co/TYbqcjx9dy\nVenue: Fiserv Forum (Milwaukee)\n\n#Wizards #Bucks #NBA #LIVE https://t.co/rg5jqTP0VX",
    "3": "Milwaukee Bucks vs Washington Wizards Live Stream - NBA Today\nWatch Here : https://t.co/gf2AYhTsBB\nVenue: Fiserv Forum (Milwaukee)\n#Bucks #Wizards #NBA #Live https://t.co/bUeLs16AyV",
    "4": "The Washington Wizards have zero players participating in the Rising Stars Challenge.",
    "5": "The Washington Wizards are starting Aaron Holiday, Spencer Dinwiddie, Kentavious Caldwell-Pope, Kyle Kuzma, and Thomas Bryant. For Fantasy Analysis Click Here: https://t.co/LzbtfqXL8q",
    "6": "The Milwaukee Bucks take on the Washington Wizards, who have lost five-straight games. Get live updates from Fiserv Forum.\n\n       https://t.co/btQy0xi5ws",
    "7": "Knowing Dan Snyder, the owner of the Washington Football Team, tomorrow I fully expect him to announce the new name of the team as the Washington Grand Wizards.",
    "8": "The Milwaukee Bucks take on the Washington Wizards, who have lost five-straight games. Get live updates from Fiserv Forum.\n\n       https://t.co/WNHIDbvpzr",
    "9": "Tonight's starting lineup for the Washington Wizards: Dinwiddie, Holiday, Caldwell-Pope, Kuzma, Bryant https://t.co/bVWH4AMCA2",
    "10": "@washwizardsjp @rui_8mura The Washington Wizards Ace Player Mr. Rui Hachimura Amazing Shoot 🇯🇵🇺🇸🇯🇵🇺🇸🇯🇵🇺🇸🏀🏀🏀😉😉😉 https://t.co/D0AGFYAsnH",
    "11": "Wizards say Bradley Beal has injured ligament in his left wrist, will miss next four games starting tonight vs. Bucks\n\nBeal will be re-evaluated in about a week\n\nWashington has plummeted in East after that hot start, down to 12th and playoff chances starting to look a bit grim",
    "12": "Washington Wizards\n@ Milwaukee Bucks\nTue 7:30 PM EST\n\n🏀 Bet of the Game 🏀\n\n🟢 Under 229.5 -110",
    "13": "Consensus Line Move:\n2022-02-01 Washington Wizards at Milwaukee Bucks from 230.00 to 228.50\nUnder smoke and mirrors\n#NBA #sportsbook #ml #profit",
    "14": "@LikeSpend1 @YoThatsBreal @LakerCentral365 Lebron demands the ball and he should as a Top 3 NBA on the ball decision maker. I didn't expect the loser asf Westbrook to even be a Laker. 😄😄😄 Talk about what the hell I expect, I expected Westbrook stay a Washington Wizards where he belongs.",
    "15": "Check out 2019-20 MOSAIC SILVER PRIZM #202 ADMIRAL SCHOFIELD RC PSA 10 WASHINGTON WIZARDS  https://t.co/fyPQ00oHS7 via @eBay",
    "16": "@RealQuintonMayo The Washington Wizards.",
    "17": "Detroit Pistons - New Orleans Pelicans\nMilwaukee Bucks - Washington Wizards\nChicago Bulls - Orlando Magic\nSan Antonio Spurs - Golden State Warriors\nPhoenix Suns - Brooklyn Nets\n\nBet slip link: https://t.co/1jB8zpwxdl https://t.co/oFVys4aAVe",
    "18": "@JPFinlayNBCS Will simply be \"Washington\"?   As in \"the Dallas Cowboys play Washington\" or \"Washington drafts ..\" or \"Washington signed a FA\" or \"Chicago is losing to Washington.\"  Though I wanted the Wizards to be named the \"Capitals\" to go along with the hockey team!",
    "19": "Bradley Beal now out until at least the trade deadline on February 10\n\nThe Wizards roster will look different when he returns\n\nWashington could be on a 9+ game losing streak when he returns with MIL, PHI, PHX, MIA, BKN on deck https://t.co/60sid1Rzrs",
    "20": "Check out 2019-20 MOSAIC GREEN PRIZM #122 JOHN WALL PSA 10 WASHINGTON WIZARDS  https://t.co/eKKE6pQw9E via @eBay",
    "21": "Washington Wizards All-Star guard Bradley Beal met with a specialist to examine his his injured left wrist in New York today and will be re-evaluated again in approximately a week, sources tell ESPN. Beal has been experiencing swelling and some pain in the wrist.",
    "22": "[GAME THREAD] Washington Wizards (23-26) at Milwaukee Bucks (31-21) - [TNT] 7:30PM EST (2:30AM IDT, 9:30am JST) https://t.co/Ydo3TpyLxo",
    "23": "The Washington Wizards have as many Black head coaches as the NFL, mark that down on the list of sentences that shouldn’t be true #BlackHistoryMonth #HireBlackCoaches",
    "24": "After starting the season 10-3, the Washington Wizards are in free fall. Now, a well-paid veteran might be on the way out ahead of the upcoming trade deadline.\n\n#NBA | #DCAboveAll | @BigTimeTimJim \nhttps://t.co/jeToCzGgEP",
    "25": "Milwaukee Bucks vs Washington Wizards is on TNT (usa). With commentary from Brian Anderson. Co-commentator is Stan Van Gundy. Reporter is Stephanie Ready.  For more details see https://t.co/tXLGXRwyJh #MilwaukeeBucks #WashingtonWizards #TNTusa",
    "26": "[546] (Milwaukee Bucks) ML -347 (1H)\nWashington Wizards / Milwaukee Bucks\nSport / League: NBA\nSelection: 1st Half Money Line",
    "27": "Why is the Washington Wizards and its fans on my feed?!🤣",
    "28": "Connecticut Huskies - Creighton Bluejays\nEastern Michigan Eagles - Toledo Rockets\nMilwaukee Bucks - Washington Wizards\nChicago Bulls - Orlando Magic\nColorado Avalanche - Arizona Coyotes\n\nBet slip link: https://t.co/k1vfxwBv7m https://t.co/CC72KcCTeA",
    "29": "The Jr. NBA League was created for Year 7 and Year 8 to participate in basketball and represent 1 of the 30 NBA teams. We proudly represent the Washington Wizards @Wizardshub and we won our first game today 38-19 @SBonnellSchool @Eastlea_School @ListerSchool @NBA @NBAUK https://t.co/p7J3dIqywh",
    "30": "ALERT: New high roller bet posted!\nA bet has been placed for $13997.76 on Milwaukee Bucks - Washington Wizards to win $23,096.30.\nTo view this bet or copy it https://t.co/I5VgwaCk9P https://t.co/x7M5z32aob",
    "31": "Milwaukee Bucks - Washington Wizards\n\nBet slip link: https://t.co/gzuFbl2L5P https://t.co/2r7gsgA0C2",
    "32": "Greek cheeks gonna lose to the Washington wizards and drop 12/5/7 🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣",
    "33": "🇺🇸#NBA75\n🏀Milwaukee Bucks - Washington Wizards\n📝Bobby Portis: duplo duplo\n🔪3.05 | Bet365 | 0.75%\n❤️Gostou? Dá um like!",
    "34": "Today's NBA Picks: 7:30 PM ET - Washington Wizards vs. Milwaukee Bucks - 19 PICKS AVAILABLE: https://t.co/5qDZN84Tvh #nba",
    "35": "New pick for Washington Wizards vs Milwaukee Bucks https://t.co/kXQfxTOsNE ##sportstrader",
    "36": "Listen to Todd &amp; DJ Flexx all week for your chance to win a pair of tickets to the Washington Wizards.\nhttps://t.co/3XwPiSdl0t",
    "37": "@RatedPG6275 The beginning of the wizards season showed me everything about the Washington fans lol get way to excited for nothing and overreact and end up contradicting themselves 90% of the time 🤣🤣 now I know why redskins Twitter is the way it is lol",
    "38": "The latest from me with @PhiladelphiaSN:\n\nQuestions of Bradley Beal's future in Washington come forward via the @AthleticNBAShow.\n\nIs there actually a chance the Wizards trade Bradley Beal and what would a deal look like? https://t.co/pQokjFQwHg",
    "39": "The Washington Wizards and their star Bradley Beal are struggling. As we approach the trade deadline, rumors of a split have started to come forward:\n\n76ers Trade Rumors: Could Bradley Beal Be Traded?\n\n#HereTheyCome | @ZachCiavoNBA https://t.co/hGdmeMbc7z",
    "40": "#NBA75 - CAPÍTULO 53\n\n🆚️ Washington Wizards\n⌚ 21:30 (hora 🇺🇾)\n🏟 Fiserv Forum, Milwaukee\n🚑 George Hill [cuello] - OUT\n📺 @NBAonTNT (🇺🇸) y League Pass\n\n#DaleBucks\n#FearTheDeer https://t.co/Pjg89pp2tl",
    "41": "📌 Winamax\n 👉🏼 Cote Boostée Milwaukee Bucks - Washington Wizards\n 💡 Giannis Antetokounmpo marque au moins 30 points et Milwaukee Bucks gagne le match\n 🔥 1.8 ➜ 2.15\n 🔗 https://t.co/PUXO36qoFV\n\n #TeamParieur #GCB #CoteBoostée",
    "42": "Milwaukee Bucks - Washington Wizards\nChicago Bulls - Orlando Magic\nSan Antonio Spurs - Golden State Warriors\n\nBet slip link: https://t.co/uhwY0CqfjC https://t.co/M2Uo5lk7r2",
    "43": "In his defense, who cares about Washington Wizards basketball ? https://t.co/15p0Cdh85P",
    "44": "Wizards HC Wes Unseld Jr. comments on Spencer Dinwiddie drama #Washington #Wizards #NBA https://t.co/jYZuXDNSDl",
    "45": "@subi_lawal14 the washington wizards are a poverty franchise",
    "46": "Who are my Washington wizards followers on my friends list.",
    "47": "Wonder if the Hornets give the Wizards a call for one of their centers. Washington and Ish Smith gets them to either one",
    "48": "Washington Wizards visits Milwaukee Bucks Predictions and Preview for 2/1/2022 today.  Who are we taking in this game?  Find out now. #NBATwitter #GamblingTwitter https://t.co/CSxYUrvMt1",
    "49": "Life in 2001 when Tom Brady first started for the Patriots: \n\n- Harry Potter &amp; the Sorcerer’s Stone was the #1 movie\n- Wikipedia launched\n- the first Xbox was released\n- Michael Jordan joined the Washington Wizards\n-  “Hanging by a Moment” by Lifehouse was the number one song",
    "50": "Milwaukee Bucks Predictions and Preview for 2/1/2022 hosts Washington Wizards.  Looking for betting action?  Find out if there is any value in our preview. #NBATwitter #GamblingTwitter https://t.co/CSxYUrvMt1",
    "51": "Every NBA team have a star ⭐️, The Washington wizards have not one not even close to having a star on there team..🤬 SMH absolutely pitiful franchise ownership GM",
    "52": "Last week: Wizards meltdown against Clippers and their fans go off on Twitter spaces \n\nThis week: Bill Simmons suggests Beal for Ben Simmons and stuff trade \n\nYesterday: Beal is out the next few games \n\nToday: the Athletic pod talks Washington moving Beal https://t.co/voj3l5H3YE",
    "53": "@wizardswatcher @nomad_blcksheep @ramonashelburne Washington Wizards #thisisntouryearitneveris https://t.co/69QezWfCqX",
    "54": "The Washington Wizards are looking to snap a five-game losing streak as they square off against the Milwaukee Bucks tonight.\n\n@bballgodsblog has the 3️⃣ best prop bets for this one and he has been on 🔥 ⤵️ \nhttps://t.co/7OMor2MpPg",
    "55": "Getting to know Washington Wizards's Kyle Kuzma, on and off the court https://t.co/nidicFhsmF",
    "56": "Better than Washington Wizards https://t.co/ffUryCJhgO",
    "57": "Today's NBA Picks: 7:30 PM ET - Washington Wizards vs. Milwaukee Bucks - 17 PICKS AVAILABLE: https://t.co/5qDZN84Tvh #nba",
    "58": "@caveman626 @washedwiz I was taking about winning a playoff series. Yes, not a high bar but going over Washington Bullets/Wizards history the last 40 years, winning a playoff series was an accomplishment. Beal/Wall did that, they won 3 playoff series. When’s the last time a Bullets/Wiz team did that?",
    "59": "NBA Defensive GOAT?! Washington Wizards may trade Spencer Dinwiddie per Kevin Oconnor. \"Teammates don't want him there\" https://t.co/IFER3oISky https://t.co/xi7MsffwYo",
    "60": "Washington Wizards (+11.5)\nToronto Raptors (-3.5)\nMinnesota Timberwolves (-4.5) \nOrlando Magic (+9.5)\n#NBAPicks #GamblingTwitter https://t.co/KjEtugtvG4",
    "61": "Milwaukee #Bucks vs Washington Wizards 2/1/22 NBA Picks, Predictions, Odds - Sports Chat Place https://t.co/RQR23LrIU1",
    "62": "@scottzolak its like Michael Jordan announcing his retirement and only mentioning the Washington Wizards",
    "63": "Imagine Jordan writing 6 paragraphs on how thankful he is for the Washington Wizards organization &amp; 4 hours later releasing a statement:\n\n“Thank you Bulls fans &amp; organization, love you” ❤️ - MJ\n\nIf I’m a Patriots fan I’m LIVID this afternoon 😂",
    "64": "Been a rough year for Spencer Dinwiddie so far with the Washington Wizards. The latest report being that his current teammates aren’t fond of him 👀 \n\n2021-2022 Stats:\n13.2 ppg\n4.5 rpg\n5.7 apg\n0.6 stls\n38/31/81\n51.2 TS%\n-0.8 BPM \n#NBATwitter https://t.co/Fli9MlRaP0",
    "65": "Today's NBA Consensus (So Far):\n\nGolden State Warriors 71%\nDetroit Pistons 66%\nToronto Raptors 63%\nWashington Wizards 59%\nChicago Bulls 57%\nDenver Nuggets 55%\nBrooklyn Nets 51%",
    "66": "Our #NBA Picks of the day (2/1/2021):\n\nNew Orleans Pelicans (ML)\nWashington Wizards (+11.5)\nMiami Heat (ML)\n✴️Chicago Bulls (-8.5) (#BackInBloodGame)\nNuggets/TimberWolves (Over 229.5)\nSpurs (+2.5)\nSuns (ML)\nKyle Kuzma (Over 21.5 Points)\nJokic (Triple Double)\n\n🤤 https://t.co/HunEipvhMe",
    "67": "Washington Wizards at Milwaukee Bucks odds, picks and predictions\nhttps://t.co/G63lq2Dc5p https://t.co/VDihGJ2nji",
    "68": "Dragons, Washington Wizards. Same thing. https://t.co/29N9j2lBhX",
    "69": "im going to be a victim of washington wizards basketball today https://t.co/TdO8pQ7YzQ",
    "70": "1U Bobby Portis over 8.5 Rebs \n-averaging 9.4 in L10, hitting in 6/10\n-had 13 last game Vs wizards \n-over L3 Washington has allowed the most Rebs 62.3 per game\n-Portis averages 16 reb chances a game",
    "71": "Get to take our entire AAU program… Over 55 kids… to this Saturday’s Suns/Wizards game in Washington DC.",
    "72": "Washington Wizards at Milwaukee Bucks odds, picks and predictions - Detroit Free Press https://t.co/fu1q34QgiE",
    "73": "@Josh_Fkn_Costa I’m sure Bulls fans would be annoyed if MJ thanked the Washington Wizards for his career and didn’t mention the Bulls at all",
    "74": "Consensus Line Move:\n2022-02-01 Washington Wizards at Milwaukee Bucks from 227.00 to 229.50\nOver its a trap!\n#NBA #bet #statistics #motivation",
    "75": "GAMEDAY! 🏀🦌🏀\n\nWashington Wizards (23-26) @ Milwaukee Bucks (31-21)\n\n⏰ 6:30pm CT\n📍 Fiserv Forum \n📺 Bally Sports Wisconsin, TNT\n\n#WASvsMIL | #FearTheDeer https://t.co/BXtZgAn0WU",
    "76": "The Washington Wizards start the season 10-3 but have been 10 games under .500 since. They face a rugged test at the defending NBA champion Milwaukee Bucks 🏀 \n\nREAD MORE ➡️ https://t.co/VL2kVXU8wq \n\n#NBA #DCAboveAll #FearTheDeer",
    "77": "Analyzing Tuesday’s Washington Wizards at Milwaukee Bucks odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/cgpVNU7xTF",
    "78": "Washington Wizards vs Milwaukee Bucks NBA Pick and Prediction NBA Betting Tips 2/1/2022 https://t.co/qNGvSG6Yae via @YouTube #NBA #NBAPick #NBAPredictions #NBAOdds #Wizards #DCAboveAll #Bucks #FearTheDeer #WizardsVsBucks",
    "79": "The Washington Wizards play today https://t.co/MHs3sX9pnE",
    "80": "📰 Washington Wizards at Milwaukee Bucks Predictions and Odds Feb 1!\n👉 https://t.co/9H6Sn91aDN @wagertalk",
    "81": "Russell Westbrook ensinando Deni Avdija e o resto do Washington Wizards a como melhorar nas trocas na defesa. Coach Westbrook! https://t.co/Cw2Zp8jiKu",
    "82": "Wizards vs. Bucks NBA Betting Lines | All-Star Bradley Beal Out For Washington https://t.co/rK45VwPvZN",
    "83": "GW alumnus @wacchi1013 was commemorated during the Washington Wizards’ Japanese Heritage Night\nhttps://t.co/5PQc9bwQI9",
    "84": "Imagine Michael Jordan thanking the Washington Wizards in his retirement without a Chicago Bulls reference. Tommy Boy is a salty man.",
    "85": "2)...I will take a look at Wed's Wizards-Sixers matchup. The hot Sixers (on two days rest) will host a reeling Wiz team on the second night of a road B2B (without Beal). The fact that the Wiz beat them in DC doesn't hurt. It could get ugly for Washington. The line should be 13.",
    "86": "I feel so bad thinking this, but what if I rename the \"Washington Wizards\" to the \"Memphis Grizzlies\" and just start obsessing about them?   LOL.",
    "87": "I’d like to thank the Washington Wizards organization and their fans only https://t.co/eXhmY1Htim https://t.co/YP78otG1gq",
    "88": "#roadtripping #washingtonwizards  @glennconsor @WashWizards @davejsports   I’m still all in even during hard times…🥸 #JustakidfromSouthEastDC https://t.co/1Mh2WHqPFm",
    "89": "Washington Wizards vs  Milwaukee Bucks Prediction 2/1/22 -  Free NBA Picks https://t.co/MC0QEX33t2 via @YouTube",
    "90": "After one of the largest blowout losses of the Mike Budenholzer era, the Milwaukee Bucks finish their three-game homestand against the Washington Wizards. @omgbradshaw has three keys for tonight. #FearTheDeer https://t.co/Upb6cKx0Rz",
    "91": "NBA 2K22 WASHINGTON WIZARDS SEASON https://t.co/GVygEEcwiG",
    "92": "Kyle Kuzma and the Washington #Wizards travel to Milwaukee to take on Giannis and the #Bucks in a battle of two playoff teams from last season @TWSN___\n \nWhat team has the edge? New NBA preview is here!\n\n#DCAboveAll #FearTheDeer\n\nhttps://t.co/EVNEqvawqQ",
    "93": "It’s time to hang em up and I’d like to thank Washington DC and the Wizards organization exclusively https://t.co/xaceqKz9aR",
    "94": "@EliotShorrParks Yep, next year for the Washington Wizards",
    "95": "u gotta be a sick man to willingly watch washington wizards basketball, anybody watching the bucks game 2nite?",
    "96": "Only 4 teams left! 2020-21 Mosaic Fast Break + Contenders Optic + Donruss Optic Retail PYT Group Break @sports_sell @HobbyConnector \n\nDallas Mavericks $49\nNew Orleans Pelicans $37\nPhiladelphia 76ers $47\nWashington Wizards $27\n\nJoin here: https://t.co/OPQvGR2MOl https://t.co/bJJobL4yvZ",
    "97": "Milwaukee Bucks: Milwaukee Bucks:  vs. Washington Wizards Preview: More National TV Magic? https://t.co/4HWnI1WfCi",
    "98": "Consensus Line Move:\n2022-02-01 Washington Wizards at Milwaukee Bucks from 225.50 to 227.00\nOver never wait\n#NBA #betting #technology #success",
    "99": "Look at MEM and CLE. ORL, DET and OKC are on their way.  The Wizards have a massive advantage over all of these franchises: \nWASHINGTON, DC!\n\nIf Tommy (and Ted!) take a deep breath and reset this thing, they can actually position DC as a destination for the next wave. 9/",
    "100": "Problems at Washington. \nBradley Beal will be lost the next two #Wizards games because of a left wrist sprain, besides this Spencer Dinwiddie is surly out of the team, the franchise want to move him and his teammates don’t want him at the team either.",
    "101": "Milwaukee Bucks vs. Washington Wizards Preview: More National TV Magic? https://t.co/5juDKxflPk",
    "102": "Milwaukee Bucks - Washington Wizards İddaa Tahmini 02.02.22\nhttps://t.co/BfHZ7C3VsT",
    "103": "I’m sorry the Washington Wizards is the worst name in North American pro sports — and it’s the worst name change ever from Bullets to Wizards… Still that’s my home team and I was more in tune with Hughes/Arenas/Jamison and Wall/Beal era than the team has a crap name",
    "104": "WASHINGTON WIZARDS vs\nMILWUAKEE BUCKS, 8:30PM.",
    "105": "If their name is actually the Washington Commanders this would be worse than the Washington Wizards.",
    "106": "@RealSheltonShow Listening to fans got us the Washington Wizards - just sayin'",
    "107": "@GREGSTOCKER Washington Wizards when will that go away the kkk had wizards I think we need to make it go away",
    "108": "NBA AI Analysis: Washington Wizards – Milwaukee Bucks https://t.co/MTyXG2O7Ck",
    "109": "The Washington Wizards play basketball today... https://t.co/jTN9gXiMSl",
    "110": "Tonight's NBA Tuesday double-header: \n\nWashington Wizards @ Milwaukee Bucks tonight at 7:30pm ET on TNT. \n\nBrooklyn Nets @ Phoenix Suns tonight at 10pm ET on TNT. https://t.co/0oqcbW5s15",
    "111": "ALERT: New high roller bet posted!\nA bet has been placed for $5727.75 on Milwaukee Bucks - Washington Wizards to win $8,333.22.\nTo view this bet or copy it https://t.co/9Qk5oHCBQk https://t.co/NNrGNaQmFP",
    "112": "New tumblr post: \"### NBA2K22 Utah Jazz vs Washington Wizards MyLeague PS4 GAMES...\" https://t.co/CYsdPNNTor ifttt, youtube",
    "113": "Washington Wizards at Milwaukee #Bucks 2/1/22 - NBA Picks &amp; Predictions - Free Picks https://t.co/RQR23LrIU1",
    "114": "AI-analys basket: Washington Wizards – Milwaukee Bucks https://t.co/LK34lBnYxa",
    "115": "Washington Wizards leading scorer Bradley Beal will miss the next two games with a sprained left wrist. The team said Monday that Beal will undergo further evaluation. https://t.co/Zh9FuzIYfH",
    "116": "Le Heat de Miami se reprend face aux Wizards  https://t.co/D1ZmESrJ2C #NBA #MiamiHeat #WashingtonWizards",
    "117": "🟢 BUCKS GAME DAY🟢\n\n🏀 Washington Wizards\n⏰ 0030 🇬🇧 \n📍Fiserv Forum\n📺 League Pass https://t.co/7mXiypmPLC",
    "118": "Congratulations to Chrry_fritter who moved up 79 spots to take #58 on the Washington Wizards team leaderboard.\n\nhttps://t.co/yEBg4vL1Td",
    "119": "Basketball Predictions and Betting Trips through Tarot Reading – Washington Wizards vs Milwaukee Bucks – NBA League – February 2, 2022 IST￼ https://t.co/GbYcwjz1kP",
    "120": "NBA Basketball Game Betting Picks Simulator: 7:30 PM ET - Washington Wizards vs. Milwaukee Bucks - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/1EUw4vQaNg #nba #sportsbetting #freepicks #cappertek",
    "121": "@washwizardsjp The Washington Wizards Ace Player Mr. Rui Hachimura Amazing Star🇯🇵🇺🇸🇯🇵🇺🇸🇯🇵🇺🇸🏀🏀🏀😉😉😉 https://t.co/7keNvMX6BJ",
    "122": "@BeccaMVP2 Lakers should have left Russell Westbrook with the Washington Wizards. Big mistake abandoning last season’s #1 Defensive rating roster including KCP &amp; Kuzma.",
    "123": "🏀#NBA ‼️\n1.Detroit Pistons Vs New Orleans Pelicans\n2.Milwaukee Bucks Vs Washington Wizards\n3.Toronto Raptors Vs Miami Heat\n4.Chicago Bulls Vs Orlando Magic\n5.Minnesota Timberwolves Vs Denver Nuggets ...\n-------\n⭐️Free #livescore &amp; #livestream 👉https://t.co/z8cdc9BY9Y 😉 https://t.co/3Ug6pAK69T",
    "124": "Washington Wizards vs Chicago Bulls - Full Game Highlights | January 7, 2022 | 2021-22 NBA Season\nhttps://t.co/oFyY7tbWPx\nhttps://t.co/oFyY7tbWPx",
    "125": "This was the Bengals' first conference championship appearance since January 1989. The only team in the 4 major sports that currently has a longer drought than that is the Washington Wizards/Bullets, who haven't had a Conference Championship appearance since 1979 (vs the Spurs)",
    "126": "Spencer Dinwiddie Trade Rumors: Wizards Players Don’t Want Guard in Washington | Bleacher Report https://t.co/rJo0iPOI5N",
    "127": "@i_am_a_toad That the Washington wizards are a legitimate contender",
    "128": "Milwaukee Bucks: Washington Wizards vs Milwaukee Bucks: : Live Stream, How to Watch on TV and Score Updates in NBA Season https://t.co/56jeu4HPOl",
    "129": "NBA Basketball Game Betting Picks Simulator: 2/1/2022 7:40 PM ET - Washington Wizards vs. Milwaukee Bucks - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/1EUw4vQaNg #nba #sportsbetting #freepicks #cappertek",
    "130": "The Washington Wizards are gonna somehow be the one seed now https://t.co/W97pDNuHMt https://t.co/q8TVuedVOT",
    "131": "Washington #Wizards star Bradley Beal out at least 2 games with sprained wrist - https://t.co/UtHBJdmfIt #NBA #NBA75 #NBATwitter #NBATwitterLive #DCAboveAll https://t.co/c9zvAG60mz",
    "132": "@VicDukes23 @blameitoncy @big_business_ The Wizards should trade Beal bc Brad already said he isn't re-signing in Washington, and Morey won't find a better offer from here on out. Washington would have a young-ish star and Philly gets their secondary scorer/ballhandler that they've needed.",
    "133": "@BarstoolNate Almost true …. See Washington Wizards.. win or lose that name will always suck.",
    "134": "Spencer Dinwiddie Trade Rumors: Wizards Players Don't Want Guard in Washington https://t.co/18rryNguFs",
    "135": "Wizards at Bucks preview: Washington looks to snap its 5-game losing streak on Tuesday against Milwaukee https://t.co/5Zhfwfifcy",
    "136": "@ECLamb @Nationals There's a sportbook on the corner of Capital One Arena where the #Caps and Wizards play. There will be a whole casino in or around the new Washington Footall stadium when it comes to VA. This fact doesn't make your feelings invalid but shows orgs are looking at this differently",
    "137": "@LikeSpend1 @AdisneyBurner @JayBOAT14 @EJBell310 @DonGreat12 @LakerCentral365 Look at how they traded Kyle Kuzma and KCP to the Washington Wizards. 😂😂😂 Dennis Schroder rejected the initial 84 million dollars over 4 years because he knew it was to INFLATE HIS SALARY FOR TRADING PURPOSES.",
    "138": "@TrueHoop @coachthorpe If the number of games were to be lessened, I think the NBA would really benefit from picking two or three nights a week for teams to play. I know the Washington Football Team plays on Sundays at 1:00 (for the most part), but it's work to find out when the Wizards play.",
    "139": "TUE\nFEB 1\n6:30 PM\nMilwaukee Bucks vs. Washington Wizards\nFiserv Forum - Milwaukee, WI\nGET TICKETS: https://t.co/SxUC1n8JlS",
    "140": "A HOUSE DIVIDED \nWashington Wizards / Orlando City SC https://t.co/kaK74Y80T8"
}