{
    "0": "@utahjazz @BucketsONeale00 @JordanClarksons @spidadmitchell Love how @spidadmitchell looks. He’s got nice fashion",
    "1": "@sportsiren @BuckleUpBoler @bigTbailey @utahjazz Boler appears to be on fire",
    "2": "Last time I was in this arena, the world shut down… let’s see what happens this time! #TakeNote @utahjazz https://t.co/8zMKQNtkEl",
    "3": "Ready to spend my birthday watchin' the game. I'll so happy if \n@utahjazz win tonight. \n#utahjazz #TakeNote",
    "4": "NBA Live Scores: Game open! Follow to get updates as OKC hosts UTA.  @okcthunder @utahjazz #NBA",
    "5": "@44Bojan and @JordanClarksons answers to when you can start listening to Christmas music on the pregame show made me love them even more! 🎄🎅💗 #utahjazz #takenote",
    "6": "@ESPNNBA @JordanClarksons @utahjazz the allen iverson effect",
    "7": "It's 🇦🇺 vs 🇦🇺 today. @joshgiddey's @okcthunder host @Joeingles7 and the @utahjazz \n\n📲💻: Watch live now on League Pass: https://t.co/RJlQCgJe1C https://t.co/wKbLvjT8wL",
    "8": "@MoneyManagment1 to answer your question, i dont really like fckn with Utah Jazz for now, but against OKC Thunder, 11-15 value bet. Thunder been covering big spreads against elite teams but Utah Jazz can be savage and still cover. But a spot at 12-14 maybe.",
    "9": "@keepfischin @CryptoPapi10 @apocalypsebiker @nateshinkle @rudygobert27 @utahjazz @nbatopshot Okay, thank you so much for the info !!!!",
    "10": "While losing is part of sports, for Utah Jazz fans, the most frustrating part of it all might be that the team is losing due to the same old issues both Quin Snyder and the players have acknowledged need to be fixed. So why can’t the Jazz fix the issues? https://t.co/JSO6hRgD9H",
    "11": "@Miiggyx @CryptoPapi10 @apocalypsebiker @nateshinkle @rudygobert27 @utahjazz @nbatopshot It's an extremely risky and volatile asset, and definitely only spend what you're willing to lose. But the technology is really fun and interesting and there are some fantastic communities!",
    "12": "@Miiggyx @CryptoPapi10 @apocalypsebiker @nateshinkle @rudygobert27 @utahjazz There's a broad range. The most popular chain, ethereum, would probably cost a few hundred dollars in most cases. But other less popular chains have interesting art for less. If you're into sports, the cheapest Moments on @nbatopshot start at $3.",
    "13": "...And this is why nobody picks the Utah Jazz in NBA2K... https://t.co/ViLyMot5FA",
    "14": "To say that @J_Hooper11's transition from college to the @NBA has been difficult would be an understatement. “It’s so hard,” Butler said. “Just every single part of it has been hard.” | By @NBASarah #utahjazz\n\nhttps://t.co/VbAqfJQuR9",
    "15": "@AdamantiumNFT @nateshinkle @rudygobert27 @utahjazz I heard my name #RightClickSaver",
    "16": "At the @utahjazz vs @okcthunder game since the little brother is a Jazz fan. Gonna root for the Jazz, but as always, go @celtics https://t.co/RRjilsYtsw",
    "17": "Royce said 🍁🍂🍁\n\n#TakeNote https://t.co/VIxH6oBSe4",
    "18": "@Mattygfor3 Dish network! The home for all your Utah Jazz games!",
    "19": "The nba on Christmas has the Dallas Mavericks and the Utah jazz for the Marquis game. Trouble trouble trouble. What a waste of time.",
    "20": "#NBA 11/24 Final Update:\n\n5 Plays for tonight (with 1 Top Play)\n\nFree Premium Play:\n\nUtah Jazz -12.5 (Line released) https://t.co/4vUHPN6K6U",
    "21": "Four years later this man still be going crazy on the Utah Jazz lmao https://t.co/be2PeotyYu",
    "22": "@nateshinkle @EcsZed @rudygobert27 @utahjazz no worries dude those pants are lit.",
    "23": "Utah Jazz vs OKC Thunder: Game Thread https://t.co/Kbxqln2qDg",
    "24": "Not to be dramatic, but if the Utah Jazz don't win tonight, I'm heading right for the kitchen and making a cranberry and pickle pie for Thanksgiving.",
    "25": "@utahjazz @ATTSportsNetRM @ZoneSportsNet Thankful for jazz basketball ☝",
    "26": "Quin Snyder NBA Utah Jazz Defense | Basketball Coaching Clinic Notes\nhttps://t.co/19qkVVdmlL",
    "27": "@RexChapman And that, kids, is why the @utahjazz should never win an NBA championship",
    "28": "New NBA John Stockton Utah Jazz Mitchell &amp; Ness 1996-97 Hardwood Swingman Jersey https://t.co/1c99AIc4Nt eBay https://t.co/OzLYqo6NdE",
    "29": "@SociosHoops @utahjazz #5 goes too hard!!! https://t.co/zvPPu4B5US",
    "30": "@CaipiraTips LA Lakers\nCharlote Hornets\nPhoenix Suns\nBrooklyn Nets\nWashignton Wizards\nChicago Bulls\nMinnesota Timberwolves\nUtah Jazz\nMilwaukee Bucks\nMemphis Grizzlies\nAtlanta Hawks\nGolden State Warriors\nPortland Trail Blazers",
    "31": "@NBACasual23 @PointGuardLife8 @nateshinkle @rudygobert27 @utahjazz They're not though.  I don't think you understand how this works.",
    "32": "Which @utahjazz play from last week was your favorite? https://t.co/fZGWQx0yeI",
    "33": "@sportsiren @utahjazz @BuckleUpBoler @bigTbailey @1041straight @DLocke09 Hazing",
    "34": "@nateshinkle @rudygobert27 @utahjazz have fun staying poor.",
    "35": "17 NOV A vs @utahjazz \n\n6 PTS\n5 REB\n3 AST \n1 BLK",
    "36": "@utahjazz @ZyiaActive Shawties bad",
    "37": "@utahjazz @SociosHoops Awesome!",
    "38": "@nateshinkle @rudygobert27 @utahjazz Wow you’re totally the first person to make that joke. You should go on a comedy tour!",
    "39": "@spidadmitchell @utahjazz Good luck tonight! Go and smash it! 💪💪",
    "40": "@TheBigDal6 As a Utah Jazz fan I can't believe you're seriously sitting here using the box score argument.\n\nYou sound like everyone who hates on Rudy right now.",
    "41": "It's crazy times when you can be just having a lazy day playing video games and you pick up your phone to see the Utah Jazz posting their take on a murder trial.",
    "42": "Destaques #basquete hoje 24/11:\n21h\nCavaliers x Suns\nPacers x Lakers\nOrlando x Hornets\n21:30h\nCeltics x Nets\n22h\nHouston x Bulls\nGrizzlies x Raptors\nBucks x Pistons\nMinnesota x Miami\nPelicans x Wizards\nOklahoma x Utah Jazz\n22:30h\nSpurs x Hawks\n0h\nWarriors x 76ers\nKings x Portland",
    "43": "Fuck the utah jazz https://t.co/ROVfamDkxy",
    "44": "Tonight’s Jazz Thunder game will be on AT&amp;T SportsNet.. which means you can stream tonight’s game on FuboTV 👍\nsign up for one week FREE trial of FuboTV 👉 https://t.co/crXTOylvbm\n\n#JazzNation #UtahJazz #TakeNote\n#NBA #FuboTV https://t.co/c5vYvoQOCp",
    "45": "Thankful for friends, family, and Zyia activewear— the official outfitter of our Jazz Dancers🖤\n\n#TakeNote | @ZyiaActive https://t.co/BlDnZpBYoz",
    "46": "@craighofeld has made a pick for @okcthunder vs. @utahjazz\n\n#OklahomaCityThunder | #UtahJazz\n    \nhttps://t.co/Hc4egCKGrx",
    "47": "@ZacharyLowNBA has made a pick for @okcthunder vs. @utahjazz\n\nMatchup Performance:\nOverall: 76-62-1 (55%) \n\n#OklahomaCityThunder | #UtahJazz\n    \nhttps://t.co/aj994U4jnq",
    "48": "@SportsHeartland has made a pick for @okcthunder vs. @utahjazz\n\nMatchup Performance:\nOKC Games: 26-15-1 (63%)\nOverall: 47-24-1 (66%) \n\n#OklahomaCityThunder | #UtahJazz\n    \nhttps://t.co/bNrQke2STz",
    "49": "@utahjazz @SociosHoops Filthy!",
    "50": "This is another reason why I will choose not to like the UTAH JAZZ. Y’all weird… https://t.co/fEoYTbVOXQ",
    "51": "Didn’t know Dwayne Wade partially owns the Utah Jazz 🤧",
    "52": "@utahjazz @SociosHoops Last play is Jazz Basketball at it’s finest. \n\nSo simple, so effective, so beautahful. 🔥❤️",
    "53": "@nateshinkle @rudygobert27 @utahjazz Thanks for spreading the meme! Every repost of BAYC MAYC helps the value go up. Everyone can play his or her part, even if you are a right click saver 👍",
    "54": "Prep for the game by watching the 5 best plays of the last week ⏪\n\n#InstantRewind | @socioshoops https://t.co/sTIhO73KUn",
    "55": "The Jazz are in OKC tonight to take on the Thunder! Join us at 5:30pm for pregame coverage!\n\n@utahjazz | #TakeNote https://t.co/19Ei7LjQdF",
    "56": "Mitchell (on the Utah Jazz) would be perfect on the Knicks.",
    "57": "@NBASarah, @sportsiren, @utahjazz, @DLocke09, @BuckleUpBoler\n\nCould any of you explain just what it means for the @slcstars to have drafted Zaire Wade?\n\nWill he just be available next year in an open NBA draft? Or do the Jazz have first option with him?\n\nThanks!",
    "58": "@utahjazz Done and done!",
    "59": "@CryptoPapi10 @apocalypsebiker @nateshinkle @rudygobert27 @utahjazz oh i see, that's so cool, thank you so much !!\nHow much money do you think someone need to start investing in nft ?",
    "60": "@nateshinkle @Miiggyx @apocalypsebiker @rudygobert27 @utahjazz No, that would be fortnite. In my case I own the chicken, the chicken has attributes that can make it great at the game or terrible too. The best chickens will be worth a lot because they have a high probability of paying out in the game.",
    "61": "@nateshinkle @twistophe_c @rudygobert27 @utahjazz Bud you are so ngmi its sad, go back to bed",
    "62": "@Miiggyx @apocalypsebiker @nateshinkle @rudygobert27 @utahjazz absolutely. Every collection is different. I bought NFT chickens that I can actually race in a video game, and if my chickens win I make money. I use this example because it's easy to wrap your head around. This is real utility from an NFT collection\nhttps://t.co/sk6ud5pbjF",
    "63": "@Miiggyx @CryptoPapi10 @apocalypsebiker @rudygobert27 @utahjazz you can use it as a skin in a video game 💀",
    "64": "@CryptoPapi10 @apocalypsebiker @nateshinkle @rudygobert27 @utahjazz what do you mean by utility ? \nIs there other benefit from buying nft than selling them at a higher price and enjoying collecting them ?",
    "65": "@paDEVul13 @CryptoPapi10 @apocalypsebiker @nateshinkle @rudygobert27 @utahjazz The token is bought and sold many times and the group(BAYC) earns royalties from these sales, merchandise, other revenue streams. sometimes directly paid back to owners. One nft can represent a larger catalog of nfts only purchasable by original owners for re sell opportunities..",
    "66": "@utahjazz @ZionsBank Man I love Donovan Mitchell! 😄💜☮️",
    "67": "@Miiggyx @apocalypsebiker @nateshinkle @rudygobert27 @utahjazz collection has something different to offer, some will be failed businesses like anything else. Some will turn out to be major businesses in the future!",
    "68": "@Miiggyx @apocalypsebiker @nateshinkle @rudygobert27 @utahjazz absolutely, here to help. Think of it like a stock for a business. Every NFT collection is a startup business. The value is determined by investors, supply vs demand, the utility people get for buying a token, whether people like the art, the belief in the founders, every...",
    "69": "@nateshinkle @apocalypsebiker @CryptoPapi10 @rudygobert27 @utahjazz \"i just can’t believe their scam is working, who ever owns the bored ape yacht club is a genius for getting so many people to think his jpegs are worth more than anyone else’s\" https://t.co/ht7egpfJMY",
    "70": "Before he was leading #Baylor to a National Championship, @J_Hooper11's basketball career was threatened by a heart condition called Hypertrophic Cardiomyopathy. Now, the @UtahJazz rookie tells me he is spreading awareness to help others with the same condition @BMSNews #SicEm https://t.co/SAV5GaeZBt",
    "71": "Utah Jazz visits Oklahoma City Thunder Predictions and Preview for 11/24/2021 today.  Who are we taking in this game?  Find out now. #Sportsbook #Basketball https://t.co/6Kwk465WcH",
    "72": "@CryptoPapi10 @apocalypsebiker @nateshinkle @rudygobert27 @utahjazz May I ask how the value of a token is determined ? Like how a certain Nft is worth more than another one ? It's a genuine question, i'm not trying to make fun of nfts btw, trying to understand how it works &gt;_&lt;",
    "73": "@utahjazz It's not black and white?",
    "74": "Looking for a value bet?  See if the Utah Jazz-Oklahoma City Thunder Predictions and Preview for 11/24/2021 is one in our preview.  No crazy hype just a prediction and preview. #Sportsbook #Basketball https://t.co/6Kwk465WcH",
    "75": "@nateshinkle @rudygobert27 @utahjazz Lol imagine this is your only interaction with an NBA star you follow and you get savagely dunked on. Couldn’t be me.",
    "76": "@nateshinkle @rudygobert27 @utahjazz Now you own the Mona Lisa. Congrats on your big art acquisition! https://t.co/UUUoutx4iB",
    "77": "The Utah Jazz will be okay. They need to be upgrade their wings. Conley and a first for Derrick White",
    "78": "@utahjazz Can you make one with the ball further down?",
    "79": "@themikesmithway @utahjazz Great point. Royce is an x-factor for this team, and his play seems to have taken a positive bump this season for sure. \n\nIf he continues to emerge on offense it will mean so much to the overall success of the season",
    "80": "@utahjazz @ATTSportsNetRM @ZoneSportsNet Let's Go jazz #takenote",
    "81": "@slomalockton41 I'm thankful to be a Jazz fan because the Utah Jazz are my biggest passion in life (other than family) I grew up watching the Jazz and bonded with my parents and now my own kids watching them. I've made numerous friends because of the Jazz and I even have Jazz tattoo!",
    "82": "@nateshinkle @pitpanther01 @carmastrikes @Halberstram_ @rudygobert27 @utahjazz Artistic value is all up to the purchaser 🤷🏼‍♂️",
    "83": "📹| Real teammates crash each other's interviews 😆\n\n#ShootaroundInterviews | @ZionsBank",
    "84": "Zaire Wade to Sign With NBA G League's Utah Jazz Affiliate  #music https://t.co/xfnjXvycuW  https://t.co/ZSmz8YH71w",
    "85": "@utahjazz @ATTSportsNetRM @ZoneSportsNet yeahh!! take note!!",
    "86": "@kslsports @utahjazz @okcthunder And they didn't even mention the \"inadvertent whistle\" as being incorrect since they \"corrected it\" for the game. They just ignore that it took the ball out of the jazz hands with 14 seconds left, and left the ending up to a 50/50 jump ball. Really there were 3 if you count that",
    "87": "@ToHellThenWeGo SLC? Last time I checked it was the Utah Jazz. But by all means, go off. 😂",
    "88": "OKC Thunder vs. Utah Jazz: How to watch, three things to know, lineups, live updates https://t.co/L6V0VWRjTC",
    "89": "Utah Jazz: Jared Butler’s uneasy path from college star to NBA rookie – ZellaNews https://t.co/mndVax1SWe",
    "90": "Gobert himself said it best.\n\nHopefully Gobert learns from this and plays better situational defense next time the Utah Jazz find themselves in a similar situation. https://t.co/rhpHDLARZZ",
    "91": "I will declare scorched earth on Salt Lake City, use a Utah Jazz Jersey as my personal doormat, and bully Mitt Romney over this unholy concoction. https://t.co/pRfP394b2g",
    "92": "The Utah Jazz have failed to win a championship every year that this has been a thing in the state. Coincidence?!",
    "93": "@spidadmitchell Utah Jazz 1996-97 Classic https://t.co/FQ1MoPxs53",
    "94": "@utahjazz take on @_OKCUK tonight. The Thunder are on a 3 game losing streak. The Jazz are coming off the back of a frustrating, &amp; late, defeat to the Grizzlies. It's fair to say neither side are in great form, but I respectfully predict a Utah W! Predictions, guys? #TakeNote https://t.co/JPuZlidQqd",
    "95": "What happened to the Jazz in the last two minutes against the Memphis Grizzlies? #TakeNote #NBA #UtahJazz https://t.co/ppNSNT7e1y",
    "96": "After a moderated talk for his book biography \"Dwyane,\" Miami Heat icon Dwyane Wade provides the media more glimpse into the big-three signing and his part-ownership of the Utah Jazz.\n\n#MiamiHeat #DwyaneWade #sportnews #NBA #basketball \n\nhttps://t.co/vc5aiNVXj7",
    "97": "@utahjazz @ATTSportsNetRM @ZoneSportsNet Can’t wait for the tunnel runway show 😻",
    "98": "@jamesevansxyz @ElectionDayMad1 @nateshinkle @rudygobert27 @utahjazz Literally loling",
    "99": "@CaipiraTips Indiana Pacers \nHornets\nPhoenix Suns\nBrooklyn nets\nWizards\nChicago Bulls\nMiami heat\nUtah Jazz\nMilwaukee\nToronto\nAtlanta\nGolden \nTrail blazers",
    "100": "@utahjazz Today is my birthday, so please give me the best gift: the win 🥳🤗",
    "101": "https://t.co/Zrkzhhku57\n\nBefore they can indulge in Thanksgiving turkey, the @utahjazz hit the road when they face the @okcthunder on Wednesday night\n#TakeNote",
    "102": "@dolphinsplswin @nateshinkle @rudygobert27 @utahjazz There are oil companies and government contractors LITERALLY destroying the world, not even indirectly harming it like energy usage from computation, but the people deciding where to point the blame for environmental issues are profiting more from these other industries",
    "103": "@utahjazz @ATTSportsNetRM @ZoneSportsNet If u continue playing soft, forget to win, those OKC kids are aggressive",
    "104": "@dolphinsplswin @nateshinkle @rudygobert27 @utahjazz sure, and there are certainly ways for crypto and other industries to improve environmentally (ethereum layer 2 coming next year),but i think it’s good for people to keep in mind that this eco narrative is being driven by people who want you to point fingers",
    "105": "OKC visit 📍\n\n⏰ 6 PM MT\n📺 @ATTSportsNetRM \n📻 @ZoneSportsNet \n\n#TakeNote https://t.co/afLfpxTR2g",
    "106": "Utah Jazz\nFG% assisted - 54.3 (29th)\nMitchell - 24.1\nConley/Clarkson - 42.7\nButler - 50\nForrest - 60\nWhiteside - 61.5\nBogdanovic - 65.6\nPaschall - 68.2\nIngles - 74.4\nGobert - 75\nGay - 77.8\nO'Neale - 81.6\n#TakeNote",
    "107": "I have given away the #UtahJazz tickets to Friday's game.  Thanks to all those who asked.  There will probably be more to give away in the future weeks.  So please keep watching for the next time.#TakeNote Go Jazz.",
    "108": "Utah Jazz Recap: A Gap Growing in the West https://t.co/agbwej55It via @stadium_sportzz",
    "109": "Wait theres the Utah Jazz, why isn't there a team named after hip hop",
    "110": "Utah Jazz x OKC Thunder\nNBA LEAGUE PASS\n22:30 – Atlanta Hawks x SA Spurs\nNBA LEAGUE PASS\n\n23:00 –🏒NHL\nChicago Blackhawks x Calgary Flames\n STAR+\nAnaheim Ducks x Colorado Avalanche\nSTAR+\n00:00 – Edmonton Oilers x Arizona Coyotes\nSTAR+\nToronto Maple Leafs x Los Angeles Kings\nSTAR+",
    "111": "@SandLot408 @LoadedBasesPod @DjCabrera2 @Athletics I love the Gold ones. As a Utah Jazz fan we have old jerseys that are essentially the same color and everyone hates them except me. Its so sad..",
    "112": "@kslsports @JakeScottZone @utahjazz @ZoneSportsNet @fuboTV @BensHoops A okay cooked tri tip all still eat it but it could be better",
    "113": "@ll0ydj @nateshinkle @newbie_27 @twistophe_c @rudygobert27 @utahjazz I think you can easily guess that😉",
    "114": "When they were scared to get it through the mailman, I went Utah jazz woooooooooo https://t.co/7up3Kjc1MK",
    "115": "@nateshinkle @rudygobert27 @utahjazz Cool bro see you on apefest next year! Just verify ownership to get a ticket, make sure to wear some merch u can get via the merch drop, just verify u own it to get access to the merch website",
    "116": "@JordanClarksons has made 16 of his last 49 triples!  That’s only 33% but tending in the right direction for sure after slow start. Also, 16.4 ppg the L5!  @utahjazz",
    "117": "@BodogCA @utahjazz @JabariDavisNBA @WalderSports @Cavsanada @Hebsyman @AWalksOfficial @gregbradyTO @RTNBA @PaulHeadleyNBA Depends who the other 4 are",
    "118": "@youngwhiteside has 8 blocks the last 4 games in only 16 min per game. That would be 4.5 blocks per 36 m!  Would easily lead the league at that rate. @utahjazz",
    "119": "On this week's \"How ‘Bout This Jazz\" podcast, the guys talk why the Utah Jazz can't seem to fix the same old issues — like transition defense and allowing opponents offensive rebounds — that have cost them games this season. https://t.co/Nj1jNFCbzI",
    "120": "@44Bojan made 7 triple vs Memphis. That was the 11th time he has made that many. In last 5 games, he’s had gms of 26, 27, and 24 and made 21 of his last 41 threes! (.512%) @utahjazz",
    "121": "Royce O’Neale has quietly made 10 of his last 20 three balls!  He’s now shooting .357 from deep. @utahjazz",
    "122": "@rudygobert27 had 23 pts, 13 rebounds and 5 blocks vs MEM the other night. He has only reached those numbers in same game one other time, and it was against Memphis!  @utahjazz",
    "123": "@dolphinsplswin @nateshinkle @rudygobert27 @utahjazz lol yes every jpeg I save on chain tortures a baby elephant, forgot that part 🙄. We should lobby governments across the global to support sustainable energy methods rather than allowing them to get off by pointing fingers at citizens and industries and yelling “their fault!”",
    "124": "I think @spidadmitchell breaks out in a big way tonight vs Thunder. He was upset about his late game turnover. The greats always have a response!  @utahjazz",
    "125": "Jazz and Thunder tonight!\nMike Conley has 64 assists and just 13 TO’s the L9!  Wow, that’s a 5/1 ratio. @utahjazz",
    "126": "New \"How 'Bout This Jazz\" podcast episode 🚨: \n\n@andyblarsen, @tribjazz and I talk:\n\n✅ Why the Utah Jazz still can't resolve their recurring issues\n✅ Donovan Mitchell's continued inefficiency\n✅ The 2 paths for the Jazz to win a title\n\nListen now! 👇🏽\n\nhttps://t.co/4CdDwxnpxZ",
    "127": "@CaipiraTips Os vitoriosos...\nInd Pacers. Cha Rornets. Phx Suns. Bkl Nets. Was wizards. Chicago. Timberwolves. Utah Jazz. Mil Bucks. Men Grizziles. Atl Hawks. GS warriors. Portland TB.",
    "128": "#NBA #GAMEDAY  \n\n🏀 Utah #Jazz 🆚 Oklahoma City #Thunder \n\n🕢 8pm 🇺🇸 (CT)\n8pm 🇲🇽🇨🇴🇪🇨🇵🇪 \n9pm 🇵🇾🇨🇱🇻🇪🇧🇴🇩🇴🇵🇷 \n10pm 🇦🇷🇺🇾🇧🇷\n2am 🇪🇸\n\n🏟 Paycom Center, #OKC\n\n#ThunderUp https://t.co/YUipGy3x52",
    "129": "@CryptoPapi10 @nateshinkle @painspatek @seansogonzo @rudygobert27 @utahjazz No way man just said normie unironically",
    "130": "‘How ‘Bout This Jazz’ podcast: Why are the Utah Jazz unable to fix their recurring issues?\nhttps://t.co/6hLHj2EnHt",
    "131": "@0x_Jackson @nateshinkle @rudygobert27 @utahjazz How so?",
    "132": "@BodogCA @JabariDavisNBA @utahjazz @WalderSports @Cavsanada @Hebsyman @AWalksOfficial @gregbradyTO @RTNBA @PaulHeadleyNBA @VernonMaxwell11 in the comments like.. https://t.co/BMOvQU8mjv",
    "133": "@BallySportsOK @okcthunder @utahjazz YouTube TV",
    "134": "Care to Jazz up your Wednesday? 🎶\n\n@okcthunder vs @utahjazz \n⏰ 6:30 pm\n📺 Bally Sports Oklahoma\n📲 Bally Sports App\n#ThunderUp https://t.co/K7XTyeorYO",
    "135": "@kslsports @BensHoops @utahjazz @ZoneSportsNet @fuboTV @JakeScottZone Turkey. Good, not great.",
    "136": "@pitpanther01 @nateshinkle @carmastrikes @Halberstram_ @rudygobert27 @utahjazz Rt click save as, equivalent to dry humping",
    "137": "@B_rightBrooks @nateshinkle @carmastrikes @Halberstram_ @rudygobert27 @utahjazz I think it’s hilarious. Imagine making fun of an NFT that’s worth more than everything you own + 2 years salary 😂",
    "138": "@pitpanther01 @nateshinkle @carmastrikes @Halberstram_ @rudygobert27 @utahjazz Gregory, ser … don’t argue with this fella … he ngmi",
    "139": "@BodogCA @utahjazz @JabariDavisNBA @WalderSports @Cavsanada @Hebsyman @AWalksOfficial @gregbradyTO @RTNBA @PaulHeadleyNBA I would take Karl Malone to ensure Isaiah Stewart doesn't   have another rage",
    "140": "@BodogCA @utahjazz @JabariDavisNBA @WalderSports @Cavsanada @Hebsyman @AWalksOfficial @gregbradyTO @RTNBA @PaulHeadleyNBA John , karl is good but there are many who could replace his stats , johns 3 ability was top notch . You can’t replace that",
    "141": "Gonna tweet this everyday until they follow me back. \n\nDAY 45\n\n@Patty_Mills @Joeingles7 @MatisseThybulle @BenSimmons25 @JockLandale @JoshBGreen @joshgiddey @BrooklynNets @utahjazz @sixers @spurs @dallasmavs @okcthunder",
    "142": "❔Which #Thanksgiving dish best describes the @utahjazz season so far❔\n\n📻: @ZoneSportsNet \n📺: AT&amp;T SportsNet &amp; @fuboTV \n🎧: https://t.co/yTfV2Fd1rE\n\n#TakeNote @BensHoops @JakeScottZone https://t.co/wPmUGhoGh7",
    "143": "@CryptoPapi10 @painspatek @seansogonzo @rudygobert27 @utahjazz can’t even save it right 💀",
    "144": "@nateshinkle @CryptoPapi10 @apocalypsebiker @rudygobert27 @utahjazz You're uh... Really hung up here. Like the pictures are personally offending you. Everything ok at home?",
    "145": "One is the greatest player to ever wear a Utah Jazz uniform and gets my vote. The other is Karl Malone. https://t.co/Shtu5XEyDp",
    "146": "@CryptoPapi10 @painspatek @seansogonzo @rudygobert27 @utahjazz i am living in your head rent free",
    "147": "@nateshinkle @painspatek @seansogonzo @rudygobert27 @utahjazz I appreciate you advertising my ape to 66 of your normie friends. Best way to get free advertisement.",
    "148": "@painspatek @seansogonzo @CryptoPapi10 @rudygobert27 @utahjazz i’ll take 10",
    "149": "Here are @BWsportsDamon  TheOne's Twitter Winners for the NBA lineup tonight.\n@Lakers \n@MiamiHEAT \n@Suns \n@hornets \n@BrooklynNets \n@chicagobulls \n@memgrizz \n@Bucks \n@WashWizards \n@utahjazz \n@warriors \n@trailblazers \n\n#stateofbasketball",
    "150": "@nateshinkle @newbie_27 @twistophe_c @rudygobert27 @utahjazz Super curious to know if these conclusions are based on any research whatsoever. Or you just guessing?",
    "151": "@NBACasual23 @nateshinkle @rudygobert27 @utahjazz Making $$$ is useless?\n\nJust because it’s useless to you doesn’t mean it’s useless to others. Do yourself a huge favor and educate yourself on these, cuz holy shit are they about to take over the world!",
    "152": "DasHaus made a bet!\n\nEvent: Utah Jazz vs Oklahoma City Thunder #NBA\nBet: Oklahoma City Thunder TO WIN +12.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "153": "DasHaus made a bet!\n\nEvent: Utah Jazz vs Oklahoma City Thunder #NBA\nBet: Utah Jazz TO WIN -12.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "154": "@nateshinkle @rudygobert27 @utahjazz People who don’t understand a subject, don’t bother to research it, but then rush to a public forum to try to ridicule people who *are* familiar with it and have had some success? Those are the thought leaders for the 21st century.\n\nYou’re smarter than everybody, kid. Keep going!",
    "155": "IT'S A GREAT DAY FOR SOME UTAH JAZZ BASKETBALL https://t.co/y7V9e6Ncxj",
    "156": "@BodogCA @utahjazz @JabariDavisNBA @WalderSports @Cavsanada @Hebsyman @AWalksOfficial @gregbradyTO @RTNBA @PaulHeadleyNBA John Stockton",
    "157": "@kslsports @utahjazz @okcthunder Shocker.",
    "158": "@cougsfan44 @utahjazz @44Bojan @rudygobert27 @JordanClarksons Hey man, not the real Hassan Whiteside. It’s just funny to use his name as my username",
    "159": "Hearing my 8 year old explain everything @Utah_Football and @utahjazz to my in-laws just warms my heart so much (they don't do sports).",
    "160": "Analyzing Wednesday’s Utah Jazz at Oklahoma City Thunder odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/NzIkFk8ohk",
    "161": "@nateshinkle @rudygobert27 @utahjazz Sick ape ser. Creating a music video. Giving 50k to use your ape just verify it's yours and will send money thxs.",
    "162": "@nateshinkle @rudygobert27 @utahjazz THE RIGHT CLICK SAVEOOOOR",
    "163": "Utah Jazz vs Oklahoma City Thunder 11/24/2021 Picks Predictions Previews\n\nhttps://t.co/8ALOqx8l25\n\n#NBAprediction #NBAparlay #NBAbetting #NBA #NBApicks #sportspicks #freepick #freepicks #odds #picks #expertpicks #sportsbetting #basketballpicks #handicapper #Jazz #Thunder https://t.co/NVFIfAVjyK",
    "164": "@newbie_27 @nateshinkle @twistophe_c @rudygobert27 @utahjazz you’re up one now 🙌🏿",
    "165": "@sj_vvs @nateshinkle @twistophe_c @rudygobert27 @utahjazz I think he blocked me lol https://t.co/k3QxVlb9SQ",
    "166": "@newbie_27 @nateshinkle @twistophe_c @rudygobert27 @utahjazz if he did would i dont think he would be talking how he is😂",
    "167": "Live edition of LOCKED ON JAZZ coming in just a moment on @YouTube \n\nThe sacrifice is real for the Utah Jazz \nOklahoma City Preview\nItems to be thankful about\nAre the standings right already&gt;\n\nhttps://t.co/uNEvvdjWvR",
    "168": "@nateshinkle @twistophe_c @rudygobert27 @utahjazz Have you actually done any research on the actual value that the token gives to the holders or are you assuming?",
    "169": "@yarramishog @utahjazz @spidadmitchell Let’s make it happen!!",
    "170": "@nateshinkle @carmastrikes @Halberstram_ @rudygobert27 @utahjazz I get it sir. You don’t.\n\nIf i priced an ape verified on blockchain at the floor it would sell quickly at around $190,000. \n\n“Ridiculous concepts” 😂",
    "171": "@pitpanther01 @carmastrikes @Halberstram_ @rudygobert27 @utahjazz i don’t think you get it, i’m not trying to sell an image of a digital monkey to anyone because it is a ridiculous concept there is no artistic value",
    "172": "@newbie_27 @twistophe_c @rudygobert27 @utahjazz and you saying the token has value doesn’t make any sense",
    "173": "@nateshinkle @apocalypsebiker @CryptoPapi10 @rudygobert27 @utahjazz Tell me you know nothing about NFTs without telling me you know nothing about NFTs",
    "174": "@EcsZed @rudygobert27 @utahjazz i am 16 years old in this picture, please find something better to do with your life",
    "175": "@carmastrikes @nateshinkle @Halberstram_ @rudygobert27 @utahjazz Okay. If I can’t verify it then please go ahead and take this image and sell it. Why wouldnt you?",
    "176": "@nateshinkle @twistophe_c @rudygobert27 @utahjazz Oh so you’re saying some numbers with no actual utility or community backing them are not the same as real money? Interesting…",
    "177": "@pitpanther01 @nateshinkle @Halberstram_ @rudygobert27 @utahjazz No you cannot. The NFT is a token on the blockchain completely unrelated by code, tag, or any other technical method to the image in question. As far as your computer is concerned, every single copy of that image is the same jpeg or png, barring compression and losses.",
    "178": "@protect_men @TreSumMusic @Hak88mNicks @ClutchPointsApp Phoenix Suns 93\" record 62-20/ Chicago Bulls record 57-25\nUtah Jazz 98' record 62-20/Chicago Bulls 98' record 62-20\n\nNo, the Bulls weren't the favorite every year. They were the better team in 97'. Wrong year.",
    "179": "@EcsZed @nateshinkle @rudygobert27 @utahjazz Wearing a Coldplay t shirt is actually more of a crime",
    "180": "@Raptors vs. @memgrizz \n@DetroitPistons vs. @Bucks \n@MiamiHEAT vs. @Timberwolves \n@WashWizards vs. @PelicansNBA \n@utahjazz vs. @okcthunder \n@ATLHawks vs. @spurs \n@sixers vs. @warriors \n@trailblazers vs. @SacramentoKings",
    "181": "@ElectionDayMad1 @nateshinkle @rudygobert27 @utahjazz This guy right click save as-ing with a potato",
    "182": "@nateshinkle @CryptoPapi10 @apocalypsebiker @rudygobert27 @utahjazz People do this all the time on different chains, doesn't make them worth anything 🤷‍♂️",
    "183": "MJ lives rent free in so many Utah Jazz fans’ heads. This is a story worth reading and enjoying if you’re a Bulls fan who recalls where they were when they saw The Shot in real time. I was sitting amidst a bunch of over confident Jazz fans. It was beautiful. https://t.co/8YEmD8GOmS",
    "184": "November 24 edition of DJ &amp; PK in the Morning\n\n- @LKennedy72 talking #RaiderNation, #NFL &amp; #Pac12 \n- @RileyJensen's weekly visit\n- @BrianHowell33 previewing #CUvsUTAH\n- @utahjazz vs. @okcthunder\n\n📻 97.5-FM/1280-AM\n📱 The @ZoneSportsNet App\n🗣 @PKKinahan\n\n#TakeNote #NBA #GoUtes https://t.co/lDenJWE7WX",
    "185": "@nateshinkle @rudygobert27 @utahjazz Adding you to my list! https://t.co/0Gyv0dhPVU",
    "186": "@nateshinkle @Halberstram_ @rudygobert27 @utahjazz Give me 1000 baseballs. I bet I could get 10 that people think are real. You can right click this image 1000000000 times and I can still verify everything via blockchain.",
    "187": "Your Wednesday lineup on The Zone Sports Network:\n\n6-10 am: DJ &amp; PK in the Morning\n\n10 am-12 pm: Jake Scott &amp; Ben Anderson\n\n12-3 pm: Hans &amp; Scotty G at @TimDahleNissan\n\n3-5 pm: Unrivaled at General RV\n\n5 pm: @utahjazz vs. @okcthunder \n\n📻 97.5-FM/1280-AM\n📱 Download our app https://t.co/lGpG5ioJTq",
    "188": "@BabyEsko3900 @Faithwalker1271 @ClutchPointsApp The whole Utah Jazz team with Karl Malone and John Stockton would have been champions multiple times if it wasn’t for MJ, just look at MJ opponents and you’ll know",
    "189": "@nateshinkle @Halberstram_ @rudygobert27 @utahjazz you realize digital art and photographs sell in the traditional fine art world and can be perfectly copied too right? saving that photo is no different than saving a drake song - it doesnt mean you own the rights to the music…",
    "190": "Gameday! (18/82)\n\n🏀 Utah Jazz x Oklahoma City Thunder\n📌 Paycom Center, Oklahoma City, OK\n⌚ 22h\n📺 NBA League Pass / Bet365\n🔵 Icon Edition\n\n#NBA75 #TakeNote https://t.co/Qc2mwynkSt",
    "191": "@hrrsnhys @utahjazz @TryHomie Ty for the tag since I am a die hard Jazz fan",
    "192": "Miami Heat vs Minnesota Twolves\nUtah Jazz vs Oklahoma City Thunder\nToronto Raptors vs Memphis Grizzlies\nAtlanta Hawks vs San Antonio Spurs\nPhiladelphia 76ers vs Golden State Warriors\nPortland Trail Blazers vs Sacramento Kings\n#NBA2022",
    "193": "@JazzDoingGood @LHM @utahjazz @utahfoods @rescuesaltlake @TheRoadHomeUT @_TheINNBetween @CCSUT Happy Thanksgiving",
    "194": "@PointGuardLife8 @nateshinkle @rudygobert27 @utahjazz most useless things ever created",
    "195": "Utah Jazz @ Oklahoma City Thunder \n\nPlayer Points Projections \n\nhttps://t.co/NLrv7SDBQG",
    "196": "\"The coolest kid. Thanks for making the day,\" says NBA’s reigning Sixth Man of the Year Jordan Clarkson of his young Utah Jazz fan. #NBA75 #TakeNote    https://t.co/iPwUhI4YFE",
    "197": "\"The coolest kid. Thanks for making the day,\" says NBA’s reigning Sixth Man of the Year Jordan Clarkson of his young Utah Jazz fan. #NBA75 #TakeNote   https://t.co/Y83xa69uc2",
    "198": "@nateshinkle @rudygobert27 @utahjazz Somebody come get their man please.. he’s trying on Pajamas in the local Walmart https://t.co/zOOwr7Okcm",
    "199": "Get out there and make an impact, be a playmaker today! #wednesdaythought #motivation #Thanksgiving2021 #basketball #ESPN #sports #win @utahjazz @WeberStateWkly @TheHiveSports @thetournament @JordanClarksons #teamwork https://t.co/zP4wIpoqMJ",
    "200": "@wooture @utahjazz @MichelobULTRA Comprehension fail..",
    "201": "\"Utah Jazz center Rudy Gobert says Dwight Howard and Dirk Nowitzki are more difficult to …\"\n\nhttps://t.co/YLHcW7rROX\n\n[via r/nba Nov 24, 2014 #NBA]",
    "202": "All games have been played on Nov. 23, 2021.\n\nThe Portland Trail Blazers are 10-8 and are currently the No. 6 seed in the West\n\nIf the playoffs started today, they would face the No. 3 Utah Jazz in the first round of the playoffs #RipCity",
    "203": "@CryptoPapi10 @apocalypsebiker @nateshinkle @rudygobert27 @utahjazz Sincere question- I get the community piece, but where does the passive income come from? I had assumed the only income would be when you sell it for a higher amount than you purchased.",
    "204": "And John Stockton sends the Utah Jazz to the NBA finals…. https://t.co/VA49Ru9vSw",
    "205": "Utah Jazz vs. Oklahoma City Thunder - 11/24/2021 Free Pick &amp; NBA Betting Prediction https://t.co/5dAXS9LySq\n.\n#Betting #FreePicks https://t.co/UNIMFr5wfg",
    "206": "It’s been a pretty good week for sports!! Thank you @Utah_Football @realsaltlake @UtahMBB @utahjazz",
    "207": "@nateshinkle @apocalypsebiker @CryptoPapi10 @rudygobert27 @utahjazz Do you buy your groceries with whatever pictures you have hanging in your bedroom? Walls? Do you swipe your tv for gas?? Not the same thing at all lol",
    "208": "@utahjazz @quartersnacks this you?",
    "209": "@utahjazz @TryHomie My cousin, he is a huge jazz fan and his dad just passed away last week. Please it would mean so much to their family. 🙏🏼\n\nhttps://t.co/maNY1FhVh4",
    "210": "Somehow, some way that I will never be able to comprehend. \n\nThe 2021 Utah Jazz and 2021 Real Salt Lake both made it to the Conference Semifinals. \n\nMake it make sense.",
    "211": "@nateshinkle @rudygobert27 @utahjazz When you see a brother that hates money https://t.co/xgrBdkgdR9",
    "212": "@GarrettDespain @apocalypsebiker @CryptoPapi10 @rudygobert27 @utahjazz i’m not going to buy my groceries with a fraction of a picture of an ape, and what holds that value besides you saying blockchain does?",
    "213": "@apocalypsebiker @CryptoPapi10 @nateshinkle @rudygobert27 @utahjazz Do you value the USD? If so, what’s attached to it? Besides trillions of debt??",
    "214": "@CryptoPapi10 @nateshinkle @rudygobert27 @utahjazz And then I'll be able to tell who paid $50k for a cartoon ape?",
    "215": "@twistophe_c @rudygobert27 @utahjazz those are just numbers you tweeted i can’t sell those unless i trick someone into thinking they are worth something and buying them",
    "216": "@nateshinkle @rudygobert27 @utahjazz how embarrassing recycling this overused joke.",
    "217": "@nateshinkle @rudygobert27 @utahjazz $1 000 000 \n\nCopy the amount above. Free gift, you're welcome.",
    "218": "@nateshinkle @rudygobert27 @utahjazz It’s blurry can you repost it again",
    "219": "@apocalypsebiker @CryptoPapi10 @nateshinkle @rudygobert27 @utahjazz its kindve the opposite - the jpeg isnt relevant - only the token is - and yes the jpeg is permanently attached to the token but because the token is on the block chain it can never be lost however the web 2 jpeg data actually can be lost if its not on chain which most nfts arent",
    "220": "@CryptoPapi10 @apocalypsebiker @rudygobert27 @utahjazz i don’t want your monkey token bro do you not get that",
    "221": "@apocalypsebiker @nateshinkle @rudygobert27 @utahjazz If you go in my wallet you can see my token. Very soon twitter will turn on integration with wallets and you’ll see right in my profile pic that I own the token. At that point copying the jpg will be very obvious to you that it’s just a copy. If you seek to understand you will",
    "222": "@nateshinkle @apocalypsebiker @CryptoPapi10 @rudygobert27 @utahjazz the bayc creators do not sell apes for 100k or more a piece only after market traders do so they really didnt scam anyone people are just buying this stuff lol",
    "223": "@nateshinkle @apocalypsebiker @CryptoPapi10 @rudygobert27 @utahjazz the people who made BAYC only made mint price x 10000 im not sure how much mint was but im assuming like 0.05 eth or something but theyre not getting paid these high valuations for the apes - after market traders are because of supply vs demand",
    "224": "@nateshinkle @rudygobert27 @utahjazz /2 people like feeling like they own “real” things, and then another thing to consider is how ownership of digital assets will evolve over time. more and more of life is digital, a Twitter blue check is more valuable than a copper rock or oz of gold in 2021. things to consider:)",
    "225": "@nateshinkle @rudygobert27 @utahjazz Man if you bothered to read up, you would realise you’re kinda just clowning rn…",
    "226": "@apocalypsebiker @nateshinkle @rudygobert27 @utahjazz The jpg can change. The token can’t. The token is valuable because it gives us access to a community. Passive income. Benefits and rewards that you don’t get when you have a jpg and not a token.",
    "227": "@CryptoPapi10 @nateshinkle @rudygobert27 @utahjazz Basically you are saying this garbage drawing is worth money because it has computer code with it that no one can see and no one knows that your jpeg is any different from anyone else's jpeg of the same pic.",
    "228": "@CryptoPapi10 @nateshinkle @rudygobert27 @utahjazz But the token is only valuable based on what it is attached to, right? You can't do anything else with the token, can you? It's permanently attached to the jpeg, right?",
    "229": "@nateshinkle @apocalypsebiker @rudygobert27 @utahjazz It’s actually impossible for you to create the same token. That’s like me saying I’ll just clone your dna. Is that possible?",
    "230": "@CryptoPapi10 @apocalypsebiker @rudygobert27 @utahjazz i’ll create the same token with the same jpg based on dogecoin then",
    "231": "@apocalypsebiker @nateshinkle @rudygobert27 @utahjazz The value isn’t in the jpg. Which is why nobody will pay you for that jpg but they’ll pay me for my token. Which you don’t have.",
    "232": "@nateshinkle @CryptoPapi10 @rudygobert27 @utahjazz Feel free. Mine is a screenshot of someone else's. Was just looking for crap nft examples.",
    "233": "@apocalypsebiker @CryptoPapi10 @rudygobert27 @utahjazz this pic goes hard, mind if i screenshot?",
    "234": "@nateshinkle @CryptoPapi10 @rudygobert27 @utahjazz Like why is it worth any more than this garbage nft drawing. They seem about the same to me. https://t.co/OseCo82wJy",
    "235": "@apocalypsebiker @CryptoPapi10 @rudygobert27 @utahjazz i just can’t believe their scam is working, who ever owns the bored ape yacht club is a genius for getting so many people to think his jpegs are worth more than anyone else’s",
    "236": "Nominate a Jazz fan aged 18 or under who has their community’s back, and they could win the chance to raid a player’s locker! \n\n#LockerRoomRaid | @tryhomie",
    "237": "The much-maligned Portland Trail Blazers are 1.5 games behind the Utah Jazz.",
    "238": "@nateshinkle @rudygobert27 @utahjazz Funny thing about this is how badly you’re just cheating yourself by not trying to understand them 🤣",
    "239": "@nateshinkle @rudygobert27 @utahjazz alright, I can buy an exact print of the Mona Lisa at the louvre gift shop. Someone can fake Ruth’s signature to the point where you can’t tell. The point is that people like owning things",
    "240": "@nateshinkle @Halberstram_ @rudygobert27 @utahjazz Well this one is pretty low quality compared to the og. Dude couldn’t even right click save properly",
    "241": "@Halberstram_ @rudygobert27 @utahjazz show me a pixel difference between the two images",
    "242": "@nateshinkle @rudygobert27 @utahjazz I personally am flattered that you like my ape so much.",
    "243": "@CryptoPapi10 @rudygobert27 @utahjazz no i’m going to keep it and get mad at anyone who screenshots it",
    "244": "@nateshinkle @rudygobert27 @utahjazz Please show it to all your friends.",
    "245": "@protect_men @TreSumMusic @Hak88mNicks @ClutchPointsApp His team WAS NOT better than Utah Jazz 97'', Phoenix Suns 93', Seattle Supersonics 96', or the Utah Jazz 98'. I guess you think cause you're on Twitter you can't be fact checked.",
    "246": "@dlbrows @nateshinkle @rudygobert27 @utahjazz Nice IP grab",
    "247": "@CryptoPapi10 @rudygobert27 @utahjazz i’ll take this one too then 🔥 https://t.co/KkB3Fnhc86",
    "248": "@nateshinkle @rudygobert27 @utahjazz i can write Babe Ruth’s name on a baseball pretty well. still not a real Ruth ball 🤷🏼‍♂️",
    "249": "@nateshinkle @rudygobert27 @utahjazz Here, make sure you have that photo saved and ready. Use it to check this out: https://t.co/pl1NFdKbVa",
    "250": "@nateshinkle @rudygobert27 @utahjazz Congrats you just copped the flea market replica.",
    "251": "Stan Van Gundy clearly never watched a Utah Jazz game in 2019",
    "252": "@fox13 And the Utah Jazz haven’t relocated 🤢🤢 https://t.co/TxH7Q0LIT0",
    "253": "#youtube Donovan Mitchell on MISSING the final SHOT in the Utah Jazz LOSS to the Memphis Grizzlies https://t.co/VNmeCX85eR",
    "254": "#youtube Ja Morant REACTS to Jaren Jackson Jr's GAME-WINNER over the Utah Jazz | Memphis Grizzlies https://t.co/NKSE4dWudG",
    "255": "Here are a few @utahjazz players I want to meet @44Bojan @rudygobert27 @JordanClarksons  @jaceford35 as well as Coach Snyder let’s make this happen Like or RT This",
    "256": "On this edition of The Daily Memphian’s Memphis Grizzlies podcast, beat writer Drew Hill and columnist Chris Herrington recap the thrilling victory over the Utah Jazz on Monday night.  https://t.co/CC0eQDohrj",
    "257": "#Grizzlies Memphis Grizzlies at Utah Jazz | Full Game Review | iTalkHoops https://t.co/yTwPtT6wyJ",
    "258": "@JustEsBaraheni I don’t want to hear shit about the Utah Jazz of NCAA basketball",
    "259": "@utahjazz @PodiumHQ Where is my EP ?",
    "260": "@JoeAli Meanwhile, I, a Grizzlies fan, am just riding the high of scraping by the Utah Jazz.",
    "261": "Pretty cool today - our referee in our tournament game this morning was former Kansas Jayhawks and Utah Jazz center Greg Ostertag. All 7’2” of him lol",
    "262": "Fanatics running a nice sale right now on Jazz merch\nsave on Jazz jackets, shirts, hats &amp; more\nLINK 👉 https://t.co/khd3i2lvaX\n\n#JazzNation #UtahJazz #TakeNote\n#NBA #Fanatics https://t.co/y3sbB20Q3c",
    "263": "@jmorrisihl @joewheat27 @BYU @UtahUtes @utahjazz I think I've made it clear that I will and was planning to do so regardless of what anyone said/says/willsay",
    "264": "@bstang3r @joewheat27 @BYU @UtahUtes @utahjazz …keep hating each other.",
    "265": "@jmorrisihl @bstang3r @joewheat27 @BYU @UtahUtes @utahjazz “Go back” lol I never stopped. Otis said it perfectly",
    "266": "@jmorrisihl @joewheat27 @BYU @UtahUtes @utahjazz You say \"Go back to hating each other\" like anybody ever stopped lol. No peace yesterday, no peace today, no peace tomorrow.",
    "267": "@bstang3r @joewheat27 @BYU @UtahUtes @utahjazz And this my friends is why we are in this predicament and it will never get better. Go back to hating each other.",
    "268": "@jmorrisihl @joewheat27 @BYU @UtahUtes @utahjazz Nope. I wish you no personal ill, but I hope Utah loses every game they ever play all the way until they fold the program and turn RES into a nuclear waste storage facility or something.",
    "269": "@jmorrisihl @joewheat27 @BYU @UtahUtes @utahjazz 100% agree. 😭",
    "270": "@daviddeweil That’s essentially how we divide up the Utah Jazz eras. It’s a bell curve.",
    "271": "@froggiejunkie @JazzDoingGood @utahjazz Thank you so much I have not seen this!",
    "272": "@DKSportsbook Chicago Bulls and Utah Jazz",
    "273": "@JazzDoingGood @utahjazz @coachjamesmorse  have you seen this?",
    "274": "Are you a non-profit, charity or school interested in attending a Jazz game?\n\nThrough our community ticket program, @UtahJazz players have generously purchased and donated tickets for groups.\n\nSubmit a request:\nhttps://t.co/QvQsTAtr34 https://t.co/THijClyQqr",
    "275": "@myopic_oldie @YRG_Ishy @Lazyboi27MPH @utahjazz @JordanClarksons It ignores the ways white people have used ethnically diverse hair against people who rock it to put them in the ‘less than’ category. We chopped/shaved their hair off but get to wear a version of it w/o thought?",
    "276": "Went to the trade machine to see how an Eric Gordon trade could work, and they just have no tradeable contracts.\n\n Every guy they're paying is a huge part of their team, this is Utah Jazz levels of impressive https://t.co/XC4po6A163",
    "277": "@ESPNNBA @JordanClarksons @utahjazz Is that Birdman’s kid?",
    "278": "@utahjazz @JakeMuhh @JordanClarksons Imagine",
    "279": "@ESPNNBA @JordanClarksons @utahjazz Good to see he has his horns up! 🤘🤘🤘",
    "280": "@SafemoonJoe https://t.co/wk1qI7siM3 Utah jazz have a 10 year contract so the renaming it won’t happen until at least 2026 if that would happen. @scottycoin #SAFEMOON #SAFEMOONARMY @DarkmoonTim",
    "281": "@joewheat27 Listen @BYU fans… let’s call it a truce for the year. You guys are good! Great year… we’re pulling for a NY6 game for you. @utahUtes go to the Rose Bowl. Great year for the state as a whole. We then focus on rooting for the @utahjazz together. Deal???",
    "282": "Owning a six-point lead over @memgrizz with just over a minute to play, things unraveled quickly for the @utahjazz. | By @NBASarah \n#TakeNote \nhttps://t.co/AYco2DDjw0",
    "283": "@kslsports @BensHoops @utahjazz @okcthunder And numerous “blown” possessions down the stretch by the Jazz",
    "284": "@AdamTrot @WSJ They’re also going to Chanukah night at the @utahjazz. Amiright @UtahRabbi ?",
    "285": "@splashnephew We are becoming hardened, even expecting the worse…of course I’m not over game 6 of the 98 finals.  Up by 3, with 36 seconds remaining.  I agree the journey is some the fun, but 42 years later..my legs r getting tired. @utahjazz",
    "286": "@ToxicSpidaFan @brgridiron @Connor_J_Hughes just like the Utah Jazz"
}