{
    "0": "NBA Basketball Game Betting Picks Simulator: 7:10 PM ET - Atlanta Hawks vs. Charlotte Hornets - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/PMvWropGCV #nba #sportsbetting #freepicks #cappertek",
    "1": "@dylanlee03 @ATLHawks @TheTraeYoung im sayin bruh like damn. stay fightin for my life on this app , im takin my ass back to insta😭",
    "2": "#BBCAN10 &amp; Atlanta Hawks game @ 7pm https://t.co/THAxaF1dhl",
    "3": "Hornets 🏀 on deck vs. @ATLHawks.\n***\n@hornets looking for their third straight &amp; a much needed one in the eastern conference standings. #AllFly \n***\nFull recap tonight on @CSLonQCN @ 11 https://t.co/qa1naCVNth",
    "4": "Out here in Charlotte! Go @ATLHawks!! Lets beat the Hornets on the road tonight and make it four wins in a row! #TrueToAtlanta https://t.co/Cr80AST3lK",
    "5": "@smhvibe @ATLHawks @TheTraeYoung nah that’s fr weird as fuck, I’m sorry that’s actually sum you gotta deal w over a Kast reference. man that block button jus gets easier to press everyday💀",
    "6": "@HornetsOnBally @hornets @ATLHawks @ashahahmadi @WesGotRange Let’s get it done!!!!",
    "7": "@HornetsOnBally @hornets @ATLHawks @ashahahmadi @WesGotRange Lose tonight season over",
    "8": "#NBA \n1u Atlanta Hawks ML -111 #Forever404\n\n#GamblingTwitter",
    "9": "Back at the Hive tonight! \n\n@hornets taking on the @ATLHawks! \n\n@ashahahmadi and @WesGotRange are taking you up to tipoff right now on @HornetsOnBally! \n\n#AllFly https://t.co/vvoIEl8ft5",
    "10": "Atlanta Hawks Starters:\n\nTrae Young\nKevin Huerter\nDe'Andre Hunter\nDanilo Gallinari\nClint Capela\n\nPlayers out:\nJohn Collins\n#TrueToAtlanta #NBA #NBATwitter #NBA75",
    "11": ".@MikeConti929 joined the @ClubhouseKB with @KyleBaileyClub as he looked at what he expects from tonight's @ATLHawks vs. @hornets game, and Mike gave his first impressions of @CharlotteFC.\n\nListen Here: https://t.co/XZsjFNv2an",
    "12": "NBA: 8-0 +14u\n\nAtlanta Hawks - Charlotte Hornets Under 240 (1u)\nNew York Knicks -12.5 (1u)\nPhoenix Suns -11 (2u)\nPhoenix Suns - Houston Rockets Over 235.5 (1u)\nUtah Jazz -7 (1u)\n\nLikely the end of the unbeaten record but who knows\n\n#GamblingTwitter",
    "13": "De'Andre Hunter of the Atlanta Hawks will have under 3.5 total rebounds   $25 for $17.25",
    "14": "Atlanta Hawks Starting Lineup 3/16\n PG: Trae Young\n SG: Kevin Huerter\n SF: De'Andre Hunter\n PF: Danilo Gallinari\n C: Clint Capela\nhttps://t.co/o75oZ8vnE8",
    "15": "Tonight's starting lineup for the Atlanta Hawks: Young, Huerter, Hunter, Gallinari, Capela https://t.co/bVWH4AMCA2",
    "16": "@ATLHawks @MichelobULTRA Show up and Show out",
    "17": "The Birds &amp; The Bees: Atlanta Hawks vs. Charlotte Hornets (TUT Preview) https://t.co/hmer630N7u via @YouTube",
    "18": "@ATLHawks @KevinHuerter @DreHunter @gallinari8888 @TheTraeYoung Kevin Huerter to get 60 pts tonight.",
    "19": "@dylanlee03 @ATLHawks @TheTraeYoung i didn’t make it deep , the people in my dms did💀 people have @‘d me about this too . i shouldn’t be getting death threats over a song reference bruh💀",
    "20": "The @ATLHawks Pregame Show is live now! Listen in now before they tip-off against the Hornets!\nhttps://t.co/kpjqTyHpdT",
    "21": "@smhvibe @ATLHawks @TheTraeYoung yeah we both joking ma’am😭nobody actually fr cares if u know abt outkast, it’s never that deep",
    "22": "🚨 Line Change 🚨\n\nAtlanta Hawks @ Charlotte Hornets\nWed 7:10 PM EST\n\nFrom:\nCHA 1.0 -115\n\nTo:\nCHA -1.0 -105",
    "23": "Uniforms for Atlanta Hawks vs Charlotte Hornets at 4:00 PM. \n\n#TrueToAtlanta #AllFly https://t.co/7AWo098mut",
    "24": "@ATLHawks @MichelobULTRA Bring back a Win!",
    "25": "Work night in Charlotte \n\n#ULTRADrip | @MichelobULTRA https://t.co/OhttiqL32Y",
    "26": "CHARLOTTE HORNETS VS ATLANTA HAWKS LAMELO VS TRAE WATCH LIVE NOW https://t.co/S2x8CC4Qw0 via @YouTube we are live in the ICE MAN COMETH ICE TRAE IS IN CHARLOTTE TONIGHT for a big game with play in implications we are live in the #LiTHoUse watch now https://t.co/Aar9ZN8wpk",
    "27": "🏀 NBA 🏀\n🏀 Charllote Hornets x Atlanta Hawks \n🕐 20:00 🕐\n⛹️ Trae Young ⛹️\n🏀 10,5+ assistencias 🏀\n💰 Odd 1.90 💰\n💸 1 Unidade 💸 https://t.co/ZsmRokpIdF",
    "28": "@Stillncrj1 @ATLHawks If they butt hurt FUCK EM",
    "29": "@Unsignedpornman @ATLHawks @TheTraeYoung i understand the caption , it was a joke😭",
    "30": "@KamauKuumba @ATLHawks @TheTraeYoung its a joke my guy",
    "31": "@dylanlee03 @ATLHawks @TheTraeYoung yall gotta chill , it was a joke . twitter folks be on sumn else💀",
    "32": "@melly_mel_06 @ATLHawks @TheTraeYoung it was literally a joke, i understand the caption . delete ur existence &lt;3",
    "33": "Huge playoff implications tonight as the @ATLHawks take on the Hornets in Charlotte. 7pm tip @929TheGame @Audacy app and SXM app 880. https://t.co/zPGFXZlRwA",
    "34": "The Birds &amp; The Bees: Atlanta Hawks vs. Charlotte Hornets \n\nHead over to https://t.co/J5bUDTDn8u and watch as @chevellecruz and I preview tonight’s Hawks vs. Hornets matchup \n\n@Livehiphopdaily @ATLLAEV @NickHamilton213  @samcrenshaw23 @getcastwithgreg @atl_hawksnation https://t.co/A9NogyFj13",
    "35": "Atlanta Hawks 75th Anniversary City Edition shorts size mens 42 XLarge \n$80 https://t.co/nVmerhewI1",
    "36": "@PatrikJobless @ATLHawks @emoryhealthcare But you also used KP (an empty stats player, fake #2 player) against Luka as him not being able to win with help so yea I’ll def troll you about John Collins and his annual $25Ms for the next 5 years",
    "37": "@PatrikJobless @ATLHawks @emoryhealthcare I actually agree, you know I was just trolling back and using y’all’s logic about Trae winning playoff series when Luka hasnt as an argument for being better against the Hawks supporting cast, right? Luka’s cast is better than Trae’s now since the Dinwiddie addition",
    "38": "Charlotte Hornets vs Atlanta Hawks 3/16/22 Free NBA Pick and Prediction ... https://t.co/1YSYnq4IXQ via @YouTube",
    "39": "@BloggingTheBoys They look like the Atlanta hawks 😂😂😂",
    "40": "@stewscloos @ATLHawks @emoryhealthcare Hawks supporting cast is severely overrated and we’d have a worse record than the magic of it wasn’t for Trae",
    "41": "Hopefully a certain demographic is not to butt hurt if Watson picks Atlanta. And Atlanta jumps at the chance to make the move. I know how sum of you like to Tussle. @ATLHawks",
    "42": "@PatrikJobless @ATLHawks @emoryhealthcare How are you feeling about the current state of the Hawks? Trae’s sensational but…",
    "43": "@PatrikJobless @ATLHawks @emoryhealthcare Honestly I’ll just yield you that hypothetical Mavs series loss just since I’m so content with the Mavs’ current state of things",
    "44": "@jamesle67719698 @smhvibe @ATLHawks @hornets @spectrumcenter @BallySportsSO @929TheGame @Hooters What?",
    "45": "@stewscloos @ATLHawks @emoryhealthcare You’re right Stoo the Knicks most certainly packed up the Mavs in the first round (although according to Mav cultists that’s not possible - laughable even to think that 😂🤣😭) cause they actually were a top defensive team then not like when they blew you guys out the other day",
    "46": "@PatrikJobless @ATLHawks @emoryhealthcare Hey honestly you may be right given that matchup seems to be horrible for the Mavs 😂 although the Knicks swept the hawks in the regular season last year too. Still doesn’t change the fact that the Mavs are better than the Hawks, they just matched up better with them",
    "47": "Since when do the @ATLHawks have Football jerseys? https://t.co/LFUfQp9Ys0",
    "48": "@stewscloos @ATLHawks @emoryhealthcare Stoo I think there’s enough evidence to say the Knicks would have packed Luka up in the first round now",
    "49": "@CENC_Official @ATLHawks @collegiatesmg @SkillshotMedia Money moves 🔥",
    "50": "Check out 2020-21 Panini Crown Royale Asia Red Trae Young #17 Atlanta Hawks https://t.co/xAf17j0nqX @eBay #traeyoung #Atlantahawks #nba #thehobby",
    "51": "The Birds &amp; The Bees: Atlanta Hawks vs. Charlotte Hornets \n\nHead over to https://t.co/J5bUDTDn8u and watch as @chevellecruz and I preview tonight’s Hawks vs. Hornets matchup #TrueToAtlanta #NBA \n\n🎥 @theseurbantimes @livehiphopdaily https://t.co/mjb4SE41T5",
    "52": "@PrizePicks 🔒of the night! \n\n73/113 = 65% success rate since March 1\n\n#playerprops #NBA #AtlantaHawks https://t.co/FJTp5BHGKE",
    "53": "@PatrikJobless @ATLHawks @emoryhealthcare Hawks, on the other hand, definitely will not be seeing the success of the ‘21 COVID-shortened season for quite some time… that is unless they acquire someone better than Trae… now that hawks fans are back to reality I can enjoy Trae’s masterclass performances though",
    "54": "@PatrikJobless @ATLHawks @emoryhealthcare If Mavs win tonight they’re tied for 5th best record in the league with the Bucks (and Jazz if they win). Hawks fans will celebrate their when/if they lose in 7 in epic fashion to the Jazz while Mavs fans realize that our next 3 years will be better than the past 3 years…",
    "55": "@PatrikJobless @ATLHawks @emoryhealthcare When did I claim to be smart? No one knows the future. You looked smart prior to the hawks run last year but also look really dumb considering how you and every hawks fan had them as a top 3 team in the East preseason. I’m just a dead clock that’s right twice a day",
    "56": "@YouHateGabe_ @NBA @ATLHawks @hornets Do you miss?",
    "57": "@stewscloos @ATLHawks @emoryhealthcare Sure Stoo what ever makes it seem more real/valid for you…",
    "58": "@stewscloos @ATLHawks @emoryhealthcare Stop you’re more worried about how you look in a twitter conversation 😂 Deflecting…redirecting…talking about ego. No doubt you’ve been told this before in the workplace but you come across as someone who thinks they’re smarter than they really are.",
    "59": "@PatrikJobless @ATLHawks @emoryhealthcare You hate to see this level of sanity from a Mavs fan because I know there aren’t any sane Hawks fans given how they talk about their team",
    "60": "@PatrikJobless @ATLHawks @emoryhealthcare If the Mavs lose to the jazz it’ll be fair and square. The Mavs roster is much better built around Luka this year to the point where they can’t be blamed entirely. This would be the first year he could justifiably be criticized for not beating his 1st round opponent IMO",
    "61": "@PatrikJobless @ATLHawks @emoryhealthcare No one’s guaranteeing a first round win my guy 😂😂😂 just celebrating the hawks’ steep, steep regression. The warriors won 50 games and lost in the first round before they made their regular season leap… no one’s worried about whether the Mavs get the chance to lose to the suns",
    "62": "@stewscloos @ATLHawks @emoryhealthcare Stoo you’re very pressed right now 😂 You’ve given me so much for the first round already I feel you’re going to give me some real gold if you keep going 😂🤣😭",
    "63": "Atlanta Hawks Outlook For 09-10 https://t.co/OooMyN1z5R",
    "64": "@PatrikJobless @ATLHawks @emoryhealthcare I mean you clearly need the ego boost so not surprised you can’t discuss basketball and would rather discuss me 😂 down to talk Luka/Trae/Mavs/hawks if the conversation doesn’t eat away at you too much 😂",
    "65": "The Birds &amp; The Bees: @ATLHawks vs. @Hornets (@eldorado2452 &amp; @ChevelleCruz Preview)\nhttps://t.co/wI2YpNO6Ik",
    "66": "@PFTCommenter Looks like NFL version of the Atlanta Hawks uni",
    "67": "The Birds &amp; The Bees: Atlanta Hawks vs. Charlotte Hornets (Preview) https://t.co/WOqTchYyxX #TUT",
    "68": "@DraftExpress @wojespn @nyknicks @ATLHawks y’all make the move",
    "69": "@Commanders It looks like the Atlanta Hawks jersey",
    "70": "@stewscloos @ATLHawks @emoryhealthcare I’m in your head Stoo you really exist to talk to me 😂",
    "71": "@ATLHawks @Chase @RealJayWilliams announce a new jersey sponsor",
    "72": "@ATLHawks @Chase @RealJayWilliams man deshaun becoming a falcon and Trae dropping 70 in the same night…how lucky are we tonight?",
    "73": "@ATLHawks @Chase @RealJayWilliams Announce Deshaun Watson to Hawks",
    "74": "We teamed up with @Chase, @RealJayWilliams and Hawks Principal Owner Tony Ressler to discuss mentorship, managing your money and how we'll help to build a stronger community together. 🙌 \n\n🔗: https://t.co/zHbp9TDokB https://t.co/FTD3HT2UKw",
    "75": "@Braves @ATLHawks how we looking? https://t.co/5nlYa6S6JJ",
    "76": "@PatrikJobless @ATLHawks @emoryhealthcare Like that run already put him on MJ, Dirk, Duncan level because that one run in the midst of several other losing seasons for solidified him as just a pure winner (despite his far below .500 career record)",
    "77": "@PatrikJobless @ATLHawks @emoryhealthcare Trae made it to the ECF in one of the greatest runs of all time. He’s already proven most definitely that he’s a #1 on a championship team with no #2. Stop complaining. The reason y’all have disappointed is because his stats have become more important this season",
    "78": "@HawksMuse @statmuse @ATLHawks Trae is going to son LaMelo tonight https://t.co/4txx68G3ru",
    "79": "@ATLHawks @KLChouinard Soooo what big news yall gonna have this week https://t.co/vSyJhzuKI1",
    "80": "@ATLHawks @KLChouinard they were only doing that because he was on fire from 3 in both games they won’t leave other shooters open if he isn’t hot from 3",
    "81": "Must win tonight @ATLHawks",
    "82": "@ATLHawks @KLChouinard Announce Watson to Atlanta",
    "83": "@ATLHawks @KLChouinard Announce Messi",
    "84": "Ice Trae  \n\nTypography, retouch and color correction practice\n\nI think some NBA teams could profit using this kind of style 👀 \n\n@TheTraeYoung @ATLHawks https://t.co/YCzwq8kZM8",
    "85": "@ATLHawks @KLChouinard announce watson",
    "86": "@ATLHawks @KLChouinard Announce Watson to the Falcons",
    "87": "Teams are changing their game plans when facing the Hawks and the Hawks are adapting back.\n\nRead more from @KLChouinard️ ⤵️ https://t.co/ssn4LMZhWk",
    "88": "Executive Assistant, Facilities / Operations - Atlanta Hawks and State Farm Arena (Atlanta · GA) https://t.co/grB7xbWgcj",
    "89": "The velour jacket and pants go hard, s/o to @StraussMax, @WishATL and the @ATLHawks for doing this Mitchell &amp; Ness launch right\n\n@boardroom \n\nhttps://t.co/wSPNnbJz4O https://t.co/spv0Rx3fKw",
    "90": "@CENC_Official @ATLHawks @collegiatesmg @SkillshotMedia Now that's HYPE ⚡️",
    "91": "NBA Picks:\nAtlanta Hawks ML\nPhiladelphia 76ers ML\nBoston Celtics ML",
    "92": "@NBA @ATLHawks @hornets Ant and Kat better",
    "93": "@YuriyATL @ATLHawks Good looks bro",
    "94": "@_WildHeart34_ We all know if we get Deshaun and Julio Jones, The Atlanta Hawks is losing in the Play-In game by 20.",
    "95": "@NBA @ATLHawks @hornets I'll be watching ROTY Scottie Barnes. https://t.co/UVu1qnUBZ3",
    "96": "Charlotte📍Seeing my @ATLHawks play against the Hornets later!🙌Four straight win on the way! #TrueToAtlanta https://t.co/Ao3A0amduY",
    "97": "“They’ve showed zero evidence that this could be a team that goes as far as they did last season” @ChrisKirschner on the Atlanta Hawks \n\nListen: https://t.co/bXuxtVn0vR https://t.co/l1cnPgebbF",
    "98": "@NBA @ATLHawks @hornets W matchup",
    "99": "@NBA @ATLHawks @hornets Tatum better don’t care",
    "100": "@NBA @ATLHawks @hornets The 2 best pg’s in the league",
    "101": "❄️ Trae x LaMelo 🛸\n\nWhat a fun point guard matchup to headline tonight’s @ATLHawks/@hornets action at 7pm/et!\n\nStream on NBA League Pass at a new low price ➡️ https://t.co/roSl8iWWYL https://t.co/t96QBJiFZU",
    "102": "Saw my @ATLHawks play in Houston a year ago today, with my bro Malcolm! That night was legendary. Saw my Hawks get the W, and we hit up Onyx in Houston after.🔥Exactly a year later, I’m gonna see my Hawks play against the Hornets in Charlotte tonight!🙌 #TrueToAtlanta https://t.co/n6SzOmnJel",
    "103": "@DinosChibi Charlotte hornets vs Atlanta Hawks\n\n1. T. Young (Atlanta) \n2. L. Ball (hornets)\n3. T. Young  (Atlanta)",
    "104": "@LadyE_tellem Does Trae Young Make up for the deficiencies on the @ATLHawks ?\n\nDid Joe Burrow Make up for a pathetic O Line?\n\nDo you know $17,000,000 would take almost all our FA money, No Younghoe Koo, no left tackle...\n\nYall gotta look at the big picture. We cant afford some of these folks",
    "105": "Look like the EC  Champion Atlanta Hawks https://t.co/Y52XuoKgdJ",
    "106": "NBA Betting Preview: Atlanta Hawks vs. Charlotte Hornets - Wednesday, March 16, 2022 https://t.co/Yb47TI1oWh",
    "107": "Bring your kids out for an evening of family-friendly fun as we take on the Pelicans! \n\n🗓️: Sunday, 3/20 at 6:00 PM\n\nGrab your tickets now for a fun time with Harry the Hawk, the ATL Dancers, and other young Hawks fans!\n\n🎟️: https://t.co/LOTvBg2NxL https://t.co/H44sCD3wFX",
    "108": "Another play where we aren’t trying to outsmart anyone.\n\n@ThatGuyBets walks us thru how to monetize Atlanta #Hawks  🆚 Charlotte #Hornets.\n\n🎯  Trae Young\n\n#NBAPicks #NBAProps #bettingsports | #BeatTheOdds👊\n\nhttps://t.co/ciivmrMCov",
    "109": "@ATLHawks @TheTraeYoung @TeamLou23 @BigO21_ @LeaderOfHorde Streak starts now guys !!!!! #wemove",
    "110": "@KyleBaileyClub @ClubhouseKB @pastorofpain @Panthers @MikeConti929 @hornets @ATLHawks @HDouglas83 @Braves @JonesAngell @wfnz I agree about the app any other way to listen to 92.7 besides the obvious.  This app is garbage and keeps closing and erroring out over and over.",
    "111": "@ATLHawks Saratoga Guys at Charlotte to cheer on former Shen star Kevin Huerter !!!",
    "112": "We made it to the jumbotron at the @ATLHawks game! 🤩\n\nThe Collegiate Esports Commissioner’s Cup is going to be the LARGEST live collegiate esports event ever! 🎮\n\nTogether we're setting firsts with our partners @collegiatesmg @SkillshotMedia and @ATLHawks. 🤝\n\n#Esports #Gaming https://t.co/SJc3uQzGSR",
    "113": "@KyleBaileyClub @ClubhouseKB @pastorofpain @Panthers @MikeConti929 @hornets @ATLHawks @HDouglas83 @Braves @JonesAngell @wfnz Pastor of pain turned into to the pastor of pu$$y on this phone call",
    "114": "@ATLHawks @hornets @spectrumcenter @BallySportsSO @929TheGame @Hooters We need this W.",
    "115": "@KyleBaileyClub @ClubhouseKB @pastorofpain @Panthers @MikeConti929 @hornets @ATLHawks @HDouglas83 @Braves @JonesAngell @wfnz I was ok with The President and his charges because nothing was proven the same as with Watson. So I'm good with both of them. As for a President give me the guy that knew what he was doing and ran this country to new heights rather than that child sniffing dipshit in office now",
    "116": "NBA fans couldn’t get enough of the Atlanta Hawks’ clearly staged ‘Diamond Tester’ prank https://t.co/mgrCPOQOrr",
    "117": "@tellumcastaway don’t ever disrespect an atlanta hawks legend ever again. ever. again.",
    "118": "She wondering if the jersey is real too at this point. #Ouch @ATLHawks half time show gonna get someone into a violent situation. https://t.co/1MVoqkzLow",
    "119": "@BellWifi @ATLHawks @KevinHuerter @DreHunter @gallinari8888 @TheTraeYoung OUBRE TOO",
    "120": "@ATLHawks @KevinHuerter @DreHunter @gallinari8888 @TheTraeYoung Just dont let Bridges and Lamelo get hot",
    "121": "I need @ATLHawks to beat the @hornets tonight but I know its gone be a tough game.",
    "122": "@ATLHawks @KevinHuerter @DreHunter @gallinari8888 @TheTraeYoung Gallo will carry",
    "123": "Go baller with @Svedka! 🏀 \n\nShow your Hawks spirit by entering to win a chance at the ultimate baller experience! https://t.co/4nntVywJGG",
    "124": "Looks like @TheTraeYoung hitting the slopes before the big game tonight for the @ATLHawks #TrueToAtlanta https://t.co/MsIB4ExKlx",
    "125": "@KyleBaileyClub @ClubhouseKB @pastorofpain @Panthers @MikeConti929 @hornets @ATLHawks @HDouglas83 @Braves @JonesAngell @wfnz Kyle , any app to listen to?",
    "126": "XXL @ClubhouseKB up next\n\n2:40 @pastorofpain Corey Miller on Watson, @Panthers \n\n3:20 @MikeConti929 previews @Hornets - @ATLHawks, talks soccer\n\n4:20 @HDouglas83 talks Watson, NFCS, @Braves \n\n5:00 @JonesAngell ahead of UNC-Marquette \n\nOnly on @wfnz https://t.co/iIdqtlimQN",
    "127": "@ATLHawks @KevinHuerter @DreHunter @gallinari8888 @TheTraeYoung PLEASE WIN",
    "128": "@KingPoloRich @ATLHawks @KevinHuerter @DreHunter @gallinari8888 @TheTraeYoung God I hope so cause I’m thirsting for this dub https://t.co/UP2mABRafl",
    "129": "NBA fans couldn't get enough of the Atlanta Hawks' clearly staged \"Diamond Tester\" prank 😭\nhttps://t.co/uMcgG1rtdj",
    "130": "@ATLHawks @KevinHuerter @DreHunter @gallinari8888 @TheTraeYoung Pls win today :)",
    "131": "@ATLHawks @KevinHuerter @DreHunter @gallinari8888 @TheTraeYoung Headed to Charlotte shortly!",
    "132": "@ATLHawks @KevinHuerter @DreHunter @gallinari8888 @TheTraeYoung Biggest game of the year so far. Can we do it ?",
    "133": "Gameday reps ☑️ https://t.co/jT3Mv74z8t",
    "134": "I’ve had this 1971 @topps “Pistol Pete” card in my collection for close to 40 years. It’s time to preserve it with @PSAcard so it looks as good 40 years from now. #TheHobby #PistolPete @ATLHawks https://t.co/FqUqdzJoGj",
    "135": "Atlanta Hawks @ Charlotte Hornets",
    "136": "Charlotte Hornets vs Atlanta Hawks (3/16 at 7pm EST) https://t.co/PP63PLAl7m",
    "137": "@ATLHawks This is dumb and gross",
    "138": "tonight’s @hornets vs @ATLHawks is Hawks -1 but ESPN says CLT is 52% to win. \n\nSo basically https://t.co/giE9G3Iw3Y",
    "139": "Atlanta Hawks Vs. Charlotte Hornets 3/16/22 NBA Free Pick, Prediction, &amp;... https://t.co/07cwV0OHQW via @YouTube",
    "140": "Atlanta Hawks at Charlotte Hornets NBA Betting Picks\n\n@TheTraeYoung @T_Rozzay3 @lameloball_br \n\nhttps://t.co/9UpGrHut8N https://t.co/yOopkyCXsG",
    "141": "Logbook Year II\nDay CDXXXIII\nGround control to @ATLHawks &amp; @TheTraeYoung have you already opened the twitter profile of your best worldwide fan, my friend @Alberto_W21 and press follow?\nLooking forward to hearing you soon.\nCaptain Rafa",
    "142": "The playoffs are right around the corner so that means the yearbooks are out so go check out the @ATLHawks yearbook….\n\nAtlanta Hawks Yearbook: https://t.co/5PiewxJEnm (Page 98)",
    "143": "Come and join us for LaGrange College Night with the College Park Skyhawks! Friday, March 18th, 7pm. Prizes, gifts, fun!  Support our Sports Management Program! PLACE YOUR ORDER TODAY: https://t.co/EgZZPYcx53\n#lcsportsmanagement\n#lcnightwithskyhawks\n#collegepark\n#atlantahawks https://t.co/GMnLwAlIGT",
    "144": "@jen_ch0i @LizAshleyMedia @ATLHawks Perfect!",
    "145": "@smhvibe @ATLHawks Facts I’m tryna see where I can cop em at",
    "146": "@ATLHawks These fire 🔥",
    "147": "@ATLHawks these make them look so wholesome",
    "148": "It's #WallpaperWednesday and Spring's right around the corner! 🌸 \n\nAppreciate the beauty of Georgia's native flowers while getting your 📲  ready for Spring! https://t.co/sRTCcwmtu0",
    "149": "@topshotblazers @ATLHawks @trailblazers Go Heat! #miamiheat",
    "150": "Big Dawg’s Daily Card\n\n• Bryant U +3 (-110) 1u\n• Atlanta Hawks ML (-110) 1u\n• Philadelphia 76ers -3.5 (-115) 1u\n• Dallas Mavericks -2.5 (-110) 2u\n• Boston Celtics +2.5 (-110) 1u\n\nBOL if you tail or fade!! 🍀🍀🍀\n\n#GamblingTwitter #FreePicks https://t.co/O31v8x2rlS",
    "151": "@BNightengale Atlanta Hawks? Atlanta Falcons? Help me out here…",
    "152": "@AtlantaRaised here. 1/2 of the SplashCast . I'm not gonna lie to y'all. It's hard to focus at work today. I'm thinking of scenarios for the @AtlantaFalcons while also watching @ATLHawks playoff push.",
    "153": "Seeing my @ATLHawks play against the Hornets here in Charlotte tonight!🙌Lets make it four wins in a row! #TrueToAtlanta https://t.co/np5Z4ubkDT",
    "154": "@jen_ch0i @LizAshleyMedia @ATLHawks If you have a video or something explaining nfts cuz I STILL don’t get what it is 😂 or how it works",
    "155": "I don't... imagine that most people see it this way but... The @ATLHawks at The @hornets is possibly game of the year. Let's go!",
    "156": "@BobRathbunTV @laurenjbara @ATLHawks @hornets @HawksOnBally @DWilkins21 @TreavorScales @ReneeMontgomery any way you slice, hawks a major disappointment this year",
    "157": "Consensus Line Move:\n2022-03-16 Atlanta Hawks at Charlotte Hornets from 0.00 to 1.00\n#TrueToAtlanta Lets Go!\n#NBA #sportsgambling #ml #forexlifestyle",
    "158": "@LizAshleyMedia @ATLHawks Thank you dear ❤️❤️ appreciate the support from a rising NFT influencer 📈",
    "159": "@ATLHawks @hornets @spectrumcenter @BallySportsSO @929TheGame @Hooters Please: Show Up and Show Out",
    "160": "Atlanta Hawks vs. Charlotte Hornets - 3/16/22 Free Pick &amp; NBA Betting Prediction https://t.co/fvdSjeVY5Y\n.\n#Betting #FreePicks https://t.co/k7zcc2d7QC",
    "161": "@ATLHawks fans were loud and helped fuel the team on an incredible postseason run and making their team’s home court one of the toughest places to play. Now, the team wants your commitment to becoming a Hawks Member. #Sponsored https://t.co/FPECAQtLu0",
    "162": "🚨Hump Day Hoops🚨\nLet's see if we can't find a slam dunk in the NBA tonight!\n1. @nuggets (-6.5)\n2. @dallasmavs (ML)\n3. @ATLHawks (ML)\n4. @cavs (+4)\n#NBATwitter #NBAPicks #NBABets #NBA75 #SportsBets #Basketball #GamblingTwitter https://t.co/8yPouTK0YD",
    "163": "The #Hornets are 1-7 in its last 8 home games vs teams projected to make the Eastern Conference playoffs.\n\nThey host the Atlanta Hawks tonight. Needless to say, it's a big game.",
    "164": "Good Hump Day March 16, 2022 , @ATLHawks Basketball, Tonight, LETS GO HAWKS 🏀⚫🔴🏆",
    "165": "🏀 #TapatioFreePick🍀🍀🍀\n\n@ATLHawks at @hornets \n#NBA75 #AllFly \n\n🗓️ 16/marzo/2022\n⏰17:10hrs🇲🇽\n🏟️ Spectrum Center\n🏆 @NBA \n🎰@bet365mx\n\nAp: ML\nPick: Charlotte (-110) https://t.co/WCMzn5eZiX",
    "166": "@MohantyLink Ts Phantomback Atlanta Hawks",
    "167": "Can't go to no Atlanta hawks game they ruin relationships that side 😹😹😹 https://t.co/nu8aoyjBX7",
    "168": "Congratulations to my girl @jen_ch0i for leading the @ATLHawks NFT project! Her leadership in innovation is unmatched 👏🏽 Cheers to your success, love! 🥂 https://t.co/iL3TzIm72L",
    "169": "🏀 Memphis Grizzlies (@memgrizz) #GrindCity\n🆚 W @ Indiana Pacers #GoldBlooded #MEMvsIND\n⏭️ Atlanta Hawks #TrueToAtlanta #MEMvsATL\n✈️ N655DL | DAL8930 | B752\n🛫 IND - 11:23 pm ET\n🛬 ATL - 12:31 am ET\n📡 Tracking: https://t.co/naWYc8Tay3 https://t.co/6bQVCRhHMx",
    "170": "Atlanta @ATLHawks First Round pick Jalen Johnson @Jalen_J23 leads the @nbagleague playoff push for @CPSkyhawks tonight as College Park hosts Wisconsin at @GatewayArena. Join @JonBabul @tenitrabatiste and me on #Southside or catch us 7p on @PeachtreeTV or @ESPN+ https://t.co/Ds7BngQdwE",
    "171": "@ATLHawks @AllHawksTalk @HawksNationCP @atl_hawksnation @HawksFanTV #NBATwitter \nIs he? No. Should he be? No. He's the clear best. (this season) https://t.co/A2VXxbtv9D",
    "172": "The Birds And The Bees Coming To You Live From The Hotbed Of CBB Especially on A Week Like This North Carolina And Charlotte Tonight 6:30pm Dont Miss It (Or Have It For Two TVs If You Wanna Watch The First Four Tonight!) \n\n@HawksOnBally @ATLHawks #TrueToAtlanta #BeatCharlotte https://t.co/ahqv78e9eE",
    "173": "NEWS BRIEF: Atlanta Hawks join mental health awareness campaign. March 20 home game a Silence the Shame event @ATLhawks https://t.co/58EzhlLLQk\n\n#CLNews #Atlanta #ATL #AtlantaNews #NewsATL #ATLNews #LocalNewsAtlanta",
    "174": "Consensus Line Move:\n2022-03-16 Atlanta Hawks at Charlotte Hornets from 238.50 to 240.50\nOver track it\n#NBA #gambling #ai #forex",
    "175": "DasHaus made a bet!\n\nEvent: Atlanta Hawks vs Charlotte Hornets #NBA\nBet: Atlanta Hawks TO WIN -1\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "176": "Analyzing Wednesday’s Atlanta Hawks at Charlotte Hornets odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/Ofe731HNL3",
    "177": "Atlanta Hawks at Charlotte Hornets odds, picks and predictions https://t.co/wrsn2wBVNt",
    "178": ".@ATLHawks fans right now https://t.co/Ms34kkbPol https://t.co/nRKsmxX0vh",
    "179": "Can the Atlanta Hawks climb above the Brooklyn Nets? – NBA News https://t.co/U5F7GkGmXN",
    "180": "🚨 Line Change 🚨\n\nAtlanta Hawks @ Charlotte Hornets\nWed 7:10 PM EST\n\nFrom:\nCHA -1.0 -110\n\nTo:\nCHA 1.0 -115",
    "181": "The @ATLHawks have always been so good at these little skits for their videoboard show 😂 https://t.co/nLim9DXFpw",
    "182": "Atlanta Hawks vs  Charlotte Hornets Prediction 3/16/22 -  Free NBA Picks https://t.co/4IeB1rjlnV via @YouTube",
    "183": "Can the Atlanta Hawks overtake the Brooklyn Nets for the eighth seed? #TrueToAtlanta \n\n(Via @mervsports78)\n\nhttps://t.co/36g50HQDF3",
    "184": "@ATLHawks How bout NFTrade for KAT next season",
    "185": "@ATLHawks Let's go!!! https://t.co/Z24G7DZf3C",
    "186": "@ATLHawks We didn’t lose last time so I’m fine with this",
    "187": "Day 3 of the Harry the Hawk Collection is LIVE ‼️\n\nToday's auction includes a signed player jersey!\n\nBid now for your chance to own a one-of-a-kind NFT! ➡️ https://t.co/UG9zOd9NPB https://t.co/wdcC5jnPuM",
    "188": "🚨 Line Change 🚨\n\nAtlanta Hawks @ Charlotte Hornets\nWed 7:10 PM EST\n\nFrom:\nCHA -2.0 -105\n\nTo:\nCHA -1.0 -110",
    "189": "Consensus Line Move:\n2022-03-16 Atlanta Hawks at Charlotte Hornets from -1.50 to 0.00\n#TrueToAtlanta shhhh...\n#NBA #CryptoHoops #programmer #forex",
    "190": "@ATLHawks @hornets @spectrumcenter @BallySportsSO @929TheGame @Hooters I'm praying since now.. Please, don't let me down! Focus tonight...",
    "191": "@BallySportsSO @ronaldacunajr24 @JaMorant @ATLHawks someone send him a trea young jersey ASAP!",
    "192": "#Hornets gameday 🐝\n\n🏀 vs. Atlanta Hawks  \n📍- Spectrum Center \n⏰- 7:00 PM\n\n#allfly https://t.co/t0NKKT0b58",
    "193": "📰 Charlotte Hornets vs Atlanta Hawks Best Bet and Odds 3/16/22!\n👉 https://t.co/sX4YHtzUlm @wagertalk",
    "194": "The Atlanta Hawks will need to draw fouls to beat the Memphis Grizzlies with Steph Curry as a power forward #TrueToAtlanta #GrindCity",
    "195": "Good Luck 2 my Atlanta Hawks 2night against the Charlotte Hornets 🏀🏀🏀 https://t.co/THjd5J8JN3",
    "196": "@ATLHawks @hornets @spectrumcenter @BallySportsSO @929TheGame @Hooters yo trae its your turn to drop 50",
    "197": "@ATLHawks @hornets @spectrumcenter @BallySportsSO @929TheGame @Hooters trae better drop another 40 piece , lamelo not boutta play w him💀",
    "198": "Big night of hoops in Charlotte!\n\n🆚 : @hornets \n⏰ : 7 PM ET\n📍 : @spectrumcenter \n📺 : @BallySportsSO \n📻 : @929TheGame \n🍽️ : @Hooters 🦉 https://t.co/TVt9IHjwy6",
    "199": "Pretty sure this is Kansas City’s youngest @ATLHawks fan. #LetsGoHawks https://t.co/a1bBVAEDiP",
    "200": "🏀Atlanta Hawks #TrueToAtlanta vs Charlotte Hornets #AllFly⌚️7PM 🖥Bally Sports SouthEast #NBA75 #NBA https://t.co/0aKCXLmkcj",
    "201": "Atlanta Hawks Mascot Exposes Fan's Fake Diamond Ring During Game https://t.co/ZHZBB9NgsF",
    "202": "@_lowkeycoyote_ @ATLHawks @TheTraeYoung @tonyparker @DCYOUNGFLY Ok ✅ thanks",
    "203": "The Atlanta Hawks have the worst road record of any Eastern Conf. team currently in the playoff race (12-21).\n\nProblem: The #Hornets have been better on the road than at home. Charlotte and Brooklyn are the only two teams in the EC playoff race with a sub .500 record at home.",
    "204": "ATLANTA HAWKS vs\nCHARLOTTE HORNETS, 7:00PM.",
    "205": "Cleveland Cavaliers' Brevin Knight records 6 rejections in blowout victory vs Atlanta Hawks. #NBA #NBA9798",
    "206": "Sooooooo the @NBA allows it’s franchises to switch their city names and team colors 😂, yet none of them are bold enough to switch their mascots to something mythological and awesome such as angels 🤣 ? i have to at Atlanta with this 😂 @AtlantaFalcons @ATLHawks @GAFollowers 😋 https://t.co/k10FxlOIwj",
    "207": "The fact is simple if you ask me. @TheTraeYoung is the BEST PG in the @NBA because he has to be the best every night for the @ATLHawks to win and be competitive. https://t.co/BLi8InsRhF",
    "208": "@ATLHawks @TheTraeYoung \"ATLIEN\" style ya heard me 😉👍🏿🤙🏿 https://t.co/smu4oyRT61",
    "209": "Consensus Line Move:\n2022-03-16 Atlanta Hawks at Charlotte Hornets from 237.50 to 239.00\nOver track it\n#NBA #gambling #deeplearning #invest",
    "210": "@HoodMarioSports @ATLHawks @tonyparker Tony is a legend wtf are you talking about",
    "211": "On Today’s #TM5 \n\n* The @mattolson21 contract, and @Collin_McHugh signing\n* @deshaunwatson to ATL? Yes please!\n* @ATLHawks preview\n* The Marine South Scoreboard\n* Games Tonight\n* Another Cup of Coffee https://t.co/n7ROXIcbE5",
    "212": "LET'S GO!! @BillyLindahl &amp; @BryceS89 break down a new, team friendly deal for a @Braves The @AtlantaFalcons may have a new QB and the @ATLHawks try to go streaking! #TM5 https://t.co/LeNNPEn3It",
    "213": "NBA Basketball Game Betting Picks Simulator: 7:10 PM ET - Atlanta Hawks vs. Charlotte Hornets - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/PMvWropGCV #nba #sportsbetting #freepicks #cappertek",
    "214": "Good morning all! Play-in Preview tonight as the @ATLHawks are in Charlotte to face the @hornets! Coverage at 630e/530c on @HawksonBally with @DWilkins21 @laurenjbara @TreavorScales @ReneeMontgomery",
    "215": "@FlossObama Georgia just passed a last-minute bill to block funding to enhance ballot access. Does this mean the Atlanta Hawks can't allow use of the stadium anymore?",
    "216": "The Atlanta Hawks potentially have some rotation minutes up for grabs with John Collins potentially out for an extended period. #TrueToAtlanta \n\n(Via @mervsports78)\n\nhttps://t.co/oLXxx8MbBF",
    "217": "/r/CharlotteHornets: Game Thread: Atlanta Hawks (34-34) at Charlotte Hornets (34-35) Mar 16 2022 7:00 PM #AllFly https://t.co/vH5ZbkaxJU",
    "218": "\"You can't be what you can't see\".\n\n@ATLHawks's Chief Marketing Officer, @msmelissammm on using her voice to encourage, support and create opportunities for others ⤵️.\n\n#LeadersAD | @AbuDhabiSC https://t.co/4kxO15Dvkq",
    "219": "Pleasure to chat to @ATLHawks @msmelissammm in Abu Dhabi today: the changing role of CMOs, team as civic institution and a part of a city’s identity, and operating at a local, regional and, as the NBA continues to expand, internationally. #LeadersAD https://t.co/5NRqn0dC8s",
    "220": "#LeadersAD Session 3 tackled How a leading NBA leading franchise is cornering international markets by Melissa Proctor, Chief Marketing Officer  @ATLHawks https://t.co/n5DP00jz2n",
    "221": "FREE #livestream here👉https://t.co/2c6Ltz64b4 😉\n——\nMar.16, Wed.\n🏀#NBA ‼️\n1.Washington Wizards Vs Denver Nuggets\n2.Cleveland Cavaliers Vs Philadelphia 76ers\n3.Charlotte Hornets Vs Atlanta Hawks\n4. New York Knicks Vs Portland Trail Blazers\n5.Brooklyn Nets Vs Dallas Mavericks",
    "222": "@cooligatorz @ATLHawks Nah lol but trae young is a damn good basketball player !",
    "223": "@BenBergerBaby @ATLHawks I thought you meant ATL hawks lol",
    "224": "NBA Basketball Game Betting Picks Simulator: 7:10 PM ET - Atlanta Hawks vs. Charlotte Hornets - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/PMvWropGCV #nba #sportsbetting #freepicks #cappertek",
    "225": "@cooligatorz @ATLHawks Lol the Chicago Blackhawks play hockey",
    "226": "@BenBergerBaby @ATLHawks Hawks is basketball I know that ! And goals are in soccer",
    "227": "@cooligatorz @ATLHawks Again wrong sport hahaha",
    "228": "@BenBergerBaby @ATLHawks I know that’s soccer but I’m a hawks fan😂",
    "229": "@cooligatorz @ATLHawks Wrong sport lol",
    "230": "@BenBergerBaby @ATLHawks all the way 🔥",
    "231": "Accountability. https://t.co/aW9XIRHw8t. #aroundtheatl #atlantasports #sportsradio #atlantahawks #truetoatlanta #nba #nbafinals https://t.co/pbySDjUlPu",
    "232": "As pro Kiwi sports develop protocols for athletes returning to play after Covid, Chelsea Lane shares her experiences in the NBA as Vice President of Athletic Performance and Sports Medicine for the Atlanta Hawks. She recently left the NBA to be back home in NZ. https://t.co/pXiS1jxect",
    "233": "NBA Basketball Game Betting Picks Simulator: 3/16/2022 7:10 PM ET - Atlanta Hawks vs. Charlotte Hornets - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/PMvWropGCV #nba #sportsbetting #freepicks #cappertek",
    "234": "Happy birthday to Jabari Parker of the Milwaukee bucks #jabariparker #jabarialiparker #milwaukeebucks #chicagobulls #washingtonwizards #atlantahawks #sacramentokings #bostonceltics https://t.co/1Kd5tyg8sz",
    "235": "Congratulations to Piri who moved up 2 spots to take #5 on the Atlanta Hawks team leaderboard.\n\nhttps://t.co/d744zp0bPM",
    "236": "@ATLHawks someone come get bogi  he's wylin https://t.co/JohM9Tq2nc",
    "237": "@web3ashlee @BALLERZ_NFT @ATLHawks @memgrizz @kurtybot @Jeremy_Born @GeniusNFT @GaiaMarketplace What a ball game!",
    "238": "@Kugla4 @ATLHawks @TheTraeYoung Trae is better than Luka and no amount of crying or coping will change that",
    "239": "@web3ashlee @BALLERZ_NFT @ATLHawks @memgrizz @kurtybot @Jeremy_Born @GeniusNFT @GaiaMarketplace Can't wait!!!",
    "240": "@JohnFricke what has changed in 10 years lol. Different gm, same kind of mindset. Not making any trades going to hurt this year. #Hawks #atlantahawks https://t.co/mXYgJYNxpD",
    "241": "@web3ashlee @BALLERZ_NFT @ATLHawks @memgrizz @kurtybot @Jeremy_Born @GeniusNFT @GaiaMarketplace Gotta rep the green goddess for St. Paddy's too!",
    "242": "@_MetaMoney_ @Bitboy_Crypto @CryptoJChains @emory_xp @StateFarmArena @MetaQuestVR @ATLHawks @NBA 💥LETS GO!!!\n\n  https://t.co/MWy7bPkIyK",
    "243": "@Hawksgoated @AssassnALT @DaddyTrae11 @NBA @TheTraeYoung @ATLHawks Baseball still around lol",
    "244": "@AssassnALT @NBA @TheTraeYoung @ATLHawks Lmao damn 😂",
    "245": "@theuntitledep @DWilkins21 @ATLHawks YO!!! Awesome!!",
    "246": "@PaperPrice323 @HornetSportSpot @T_Rozzay3 @ATLHawks Don't day ir out loud he might drop 60 if he sees this😂",
    "247": "@ATLHawks your only championship came from St. Louis https://t.co/xsIFk93FyJ https://t.co/4EX5ZZhzMl",
    "248": "@HornetSportSpot @T_Rozzay3 @ATLHawks Ya know terry's gonna lock up trae to a 50-pointer🤣",
    "249": "@TypicallySilent @KayJewelers @PANDORA_NA @CIV_LIT @michaelandrewyu The only crime committed here was loving the @ATLHawks more than her 🤷🏽‍♂️",
    "250": "Congratulations to chevy111 who moved up 2 spots to take #5 on the Atlanta Hawks team leaderboard.\n\nhttps://t.co/d744zp0bPM",
    "251": "@MegaZane5 The Atlanta Hawks basketball club",
    "252": "GRIZZLIES at PACERS | FULL GAME HIGHLIGHTS | March 15, 2022 #Atlanta #Hawks #NBA Video: https://t.co/uYRoZtO3tT",
    "253": "@jamilJo70851791 @ATLHawks @TheTraeYoung worst part is i'm dyslexic and fr misread the post, they ate me up",
    "254": "Hey @T_Rozzay3, since you challenged the fans to support you guys...I have a challenge for the #Hornets...\n\nHold the @ATLHawks to under 110 points tommorow by playing hard on BOTH ends of the court.\n\n#AllFly",
    "255": "🎉 My Nft highlight of the week: Ballerz Suite on Friday for the Hawks/Grizzlies game!! 🙏\n\n🏀 Back to my @BALLERZ_NFT pfp this week to celebrate \n\n#BallerzNation #ballerz @ATLHawks @memgrizz  #NewProfilePic @kurtybot @Jeremy_Born @GeniusNFT @GaiaMarketplace https://t.co/rvDnqPOBhJ",
    "256": "@ATLHawks Breaking them down from the inside 😭 https://t.co/PG2yoPmOIt",
    "257": "@ATLHawks @emoryhealthcare guys... Make. Him. Stop. ..with the hand gestures and high fives when he's on the bench. its like watching finger whiplash. https://t.co/fgZCeesuok",
    "258": "Finally got the Atlanta Hawks an NBA Championship in 2k rebuild 🙏🏾🙏🏾",
    "259": "@nvpxo Being 6’7 helps. If that’s not an option, I’d just go to Slovenia, practice, play for Real Madrid and then get drafted by the Atlanta Hawks.",
    "260": "@atl39 Meanwhile tears shed from slita at the clown show at fox theater. Our feature presentation....the Atlanta hawks!!!!",
    "261": "@ATLHawks #TrueToAtlanta  We Keep going up from here ☝🏽",
    "262": "#NationalReadingMonth celebrating my sons book #IRememberDad at the Detroit Pistons game vs Atlanta Hawks on 3/23/22.!! https://t.co/QGAIPw57Ic",
    "263": "@buddyp4eva @ATLUncensored @ATLHawks Never. They will forever be bottom feeders",
    "264": "Congratulations to BigPizza22 (@BillyBillBill6) who moved up 2 spots to take #15 on the Atlanta Hawks team leaderboard.\n\nhttps://t.co/d744zp0bPM",
    "265": "@CulverGoat @memgrizz @ATLHawks I love culver tbh he just cannot shoot",
    "266": "@dmeltfan @memgrizz @ATLHawks This ain't it",
    "267": ".@memgrizz status report, 18 March vs @ATLHawks \n\nOUT\nJa Morant - Struck by Jarrett Culver jumpshot",
    "268": "@dantechal @ATLHawks @emoryhealthcare that’s his finger https://t.co/6TVe86tj02",
    "269": "@EZshop1 @ill_outsmart_ya @overtime @ATLHawks @TheTraeYoung That’s exactly what I thought . Sit down",
    "270": "@BadVibeBrandon @ATLHawks @TheTraeYoung Ironic this made you an outkast",
    "271": "@Unsignedpornman @ATLHawks @TheTraeYoung Things like 40 burger should not be said. 50 piece nuggets are actual things. Yall just tryna sound creative but clearly dont have the sauce.",
    "272": "@LongLostMFFL @ill_outsmart_ya @overtime @ATLHawks @TheTraeYoung Win a playoff series first,  then talk..",
    "273": "Trae Young with HUGE 46-PT double-double 🥶 - https://t.co/EfVboSDiUA - #Atlanta #AtlantaHawks #ESPN #FourSeasons #Portland #PortlandTrailBlazers #Seasons #TraeYoung",
    "274": "Got to go enjoy an @ATLHawks game last night with @MattTheMouth and this happened! Got to slap hands with several players as they headed to the locker room at halftime! Thank you Matt! https://t.co/vovpExVukn",
    "275": "@ATLHawks @emoryhealthcare Can Clint capela be out?",
    "276": "@EZshop1 @ill_outsmart_ya @overtime @ATLHawks @TheTraeYoung No traes team went to the conference final. Trae went 5/28 in game 7 and won . Trae didn’t take them no where . Any other star shoot like that their team gets blown out . Nice try though you thought we forgot",
    "277": "@GAdamBruns @OfficialGHSA @NFHSNetwork @ATLHawks @GPBsports @WilsonBasktball @scoreatlanta 2013\nNorcross Boys &amp; Girls",
    "278": "https://t.co/gnmqg3dWJo Portland Trail Blazers vs Atlanta Hawks - Full Game Highlights | March 14, 2022 | 2021-22 NBA Season https://t.co/i5PtyjOdt9 https://t.co/KgeGggtKj1",
    "279": "@ATLHawks @tonyparker Two of the greatest PG who are king of the floater!!",
    "280": "Continuing to rant about my 8:30 English class because it would really be nice to go up to Charlotte tomorrow and watch the  @ATLHawks but ya know school is school 😞",
    "281": "Day whatever of getting the @ATLHawks to follow back"
}