{
    "0": "@SacramentoKings perfect fit https://t.co/wEGeN9kC3J",
    "1": "Uniforms for Sacramento Kings vs New Orleans Pelicans at 5:00 PM. \n\n#SacramentoProud #WBD https://t.co/CIwuaDNz2P",
    "2": "We’re here to cheer our Pels on to victory against the Sacramento Kings…Let’s Go Pels 🏀🏀#PelicansGameDay https://t.co/qk5rY9fkCM",
    "3": "@SacramentoKings @MichelobULTRA @Divincenzo @hbarnes @dameology @j_josh11 The vans fire",
    "4": "@SacramentoKings @MarkJonesESPN Mark jones wins best dressed 🔥",
    "5": "@SacramentoKings @MichelobULTRA @Divincenzo @hbarnes @dameology @j_josh11 Donte 😔",
    "6": "@SacramentoKings @MichelobULTRA @Divincenzo @hbarnes @dameology @j_josh11 The Ritz Carlton bro? Nice.",
    "7": "This is downright absurd!\n\nSomeone needs to explain this shit to me\n\n(All Credit: @Bballforeverfb) \n\n@ESPN1320 @damienbarling @IamKDiddy @SacramentoKings #NBA #NBAPicks #NBATwitter https://t.co/s0dkCoyx9f",
    "8": "mardi gras drip ⚜️  \n  \n@MichelobULTRA | #ULTRADrip #JOYWINS https://t.co/RfPacRynMj",
    "9": "@James_HamNBA @SacramentoKings 3 of those players are in the bottom ten for worst defensive rating among players averaging over 20 mins a game. And we wonder why we suck",
    "10": "The New Orleans Pelicans (25-36) look to win their third consecutive game as they host the Sacramento Kings at the Smoothie King Center. https://t.co/ftopvl6OFD",
    "11": "@James_HamNBA @SacramentoKings Richaun Homes should be starting!",
    "12": "Not to overly criticize the Sacramento Kings PR team, but you're going to hold this big farewell to Arco Arena party where people will undoubtedly be driving long distances and be drunk on both alcohol and nostalgia and you hold the even IN BETWEEN GAME DAYS!?",
    "13": "Today's Starting Lineup powered by @Verizon ⤵️ \n \n👑 @swipathefox  \n👑 @justholla7  \n👑 @hbarnes \n👑 @TreyLyles  \n👑 @Dsabonis11 https://t.co/BP82wjzsLM",
    "14": "@James_HamNBA @SacramentoKings Aka losing lineup…Fox, DiVincenzo, Barnes, Sabonis and Holmes should start, periodt",
    "15": "@James_HamNBA @SacramentoKings DiVincenzo should start over Holiday.",
    "16": "@James_HamNBA @SacramentoKings Is Trey Lyles liein? Or is he the real deal? We find out tonight!!!!",
    "17": "Sacramento Kings (+6.5) @ New Orleans Pelicans #WBD #SacramentoProud #NBA #NBATwitter #NBA75",
    "18": "@SacramentoKings @hedoturkoglu15 My throwback jersey from 2001.. let’s bring in the luck. Go Kings!\n#SacramentoProud https://t.co/QJs4ZixORq",
    "19": "Sacramento Kings Starters:\n\nDe'Aaron Fox\nJustin Holiday\nHarrison Barnes\nTrey Lyles\nDomantas Sabonis\n\nPlayers out:\nTerence Davis\nRichaun Holmes\n#SacramentoProud #NBA #NBATwitter #NBA75",
    "20": "We Live: check out the first game preview! Sacramento Kings vs. New Orleans Pelicans: Game Preview - Sports Illustrated @PelicansScoop https://t.co/sGRnLNZUG0",
    "21": "@James_HamNBA @SacramentoKings One day I'll see Donte in the starting lineup.",
    "22": "Starters for @SacramentoKings at New Orleans Pelicans - 3/2:\n\nG - De’Aaron Fox \nG - Justin Holiday  \nF - Harrison Barnes \nF - Trey Lyles \nC - Domantas Sabonis",
    "23": "Tonight's starting lineup for the Sacramento Kings: Fox, Holiday, Barnes, Lyles, Sabonis https://t.co/bVWH4AMCA2",
    "24": "Pelicans Pick winner William Dugas of Dequincy (second, right in first pic, far left in second) and his guests are excited to watch the @PelicansNBA take on Sacramento tonight at the Smoothie King Center in New Orleans! Who else will be watching the game at 7? Go Pels!!! https://t.co/oxQ7b6wCqZ",
    "25": "@BlqMgck Lmao his @ is crazy, he basically supports a team which is the Sacramento Kings of football (soccer)",
    "26": "The @SacramentoKings @Dsabonis11 goes up against fellow Lithuanian National Team member @JValanciunas and the @PelicansNBA tonight in a must win game for the Kings in Nola. Sacramento has been in win-or-die-tryin mode for a minute now💯I’ll be choppin it up with @kayte_c at 5pm https://t.co/3Fedygx3Ma",
    "27": "@SacramentoKings @ankr Make a Trey Lyles one please!",
    "28": "@305miami6924 It’s ridiculous. Like being a shitty fan for you team and hating other teams and getting mad when someone doesn’t like your team.\nLike the guy who cursed and stormed out of a men’s room because he thought I was wearing a Sacramento Kings hoodie. (It was LA Kings, btw.)\nChildren.",
    "29": "NBA: Sacramento Kings +6.5 https://t.co/zUuwej7uxS",
    "30": "@DKSportsbook why isn’t Sacramento Kings props in the SGP?!?",
    "31": "@SacramentoKings would be nice if this could be next to the Jerry Reynolds statue in DOCO somewhere https://t.co/RQTDStPPKA",
    "32": "@SacramentoKings @MattGeorgeSAC Still waiting for my old seats as promised to season ticket holders.",
    "33": "The @SacramentoKings play the New Orleans Pelicans today. You know what that means... De'Aaron Fox going for 30+ points.",
    "34": "@JonNJCB Needs to go into exile. Sacramento Kings or something…",
    "35": "@SacramentoKings Can we bring back Webber’s jersey and leave it in the building before we blow it up?",
    "36": "So after waiting since February 25 @FDSportsbook and @FanDuel_Support decided it’s alright that they give us a game on April 10 against the @SacramentoKings so instead of watching @Suns I’ll have to wait again, oh they didn’t even give me a bonus for the inconvenience.",
    "37": "Our top @NBA @FanDuel value play of the day is @SacramentoKings PF Trey Lyles. He will be the highest owned player on the slate but that is for good reason. He is in the starting lineup again and is simply too cheap! #FanDuel #NBA #NBA75 #NBATwitter #DFS https://t.co/1lrTqgNc4A",
    "38": "@BovadaOfficial @WhatsYaWager @thePatMorrow #whatsyawager \nSACRAMENTO KINGS\n\nDe’Aaron Fox over 30.5 Points and Assists\n\nThanks 🙏",
    "39": "My @espn app was little drunk this afternoon. Pay attention to the @spurs logo and the @SacramentoKings logos. Maybe the @PLinUSA had something to do with it 🤷🏽‍♂️😂 #GoSpursGo #ManchesterUnited https://t.co/phCVRFAw1F",
    "40": "The other teams calling: \n\nOrlando Magic\nDetroit Pistons\nHouston Rockets\nSacramento Kings\n\nYou ain’t fooling nobody DJ Augustin https://t.co/XHSQFHT1c6",
    "41": "@dakishaofyork's account is temporarily unavailable because it violates the Twitter Media Policy. Learn more.",
    "42": "@introgroove @RTNBA @BleacherReport My pathetic Sacramento Kings could have selected Luka, but they preferred the perpetually underwhelming Bagley. Now he's gone and Luka is a total star.",
    "43": "🏀 GAME ANALYSIS 🏀\n\n🏟 Sacramento Kings vs New Orleans Pelicans 🏟\n\n▶️ BET THE NBA ▶️ https://t.co/odroCYfQFJ\n\n#NBA #GamblingTwitter \n\nhttps://t.co/AZjA5K6aRa",
    "44": "@JCrossover will average 20+ in the league… coming off the bench.. but I’ll mind my business @SacramentoKings",
    "45": "A rising star for #WallpaperWednesday 📲\n\nBuild and learn with @ankr, a leader in #Web3 infrastructure https://t.co/AJCOM4ljcX",
    "46": "Sacramento's Arco Arena, the former home of the Kings, will soon be demolished: https://t.co/ZiHPH0FY4r",
    "47": "@SacramentoKings Will the court with the 2000’s Kings logo be on display?",
    "48": "Damn, the memories tho. I know older Kings fans and Sacramento natives are gonna miss it. https://t.co/DAk5SO1HCi",
    "49": "4. Sacramento Kings\n\nDe'Aaron Fox\n\n0.3u: OVER 24.5 PTS\nFox is averaging 27 PTS in Feb and has gone OVER this in 8 of his last 9.\n\nDomantas Sabonis\n\n0.3u: OVER 35.5 PTS + REB + AST\nAveraging about 37 PRA with SAC, gone OVER this in 11 of his last 15 games.",
    "50": "@SacramentoKings Farewell to the franchise",
    "51": "What’s your favorite design? @SacramentoKings",
    "52": "@jsmi53081 @SacramentoKings You are totally right! I have been trying to find any statement of the league on the brutal russian invasion on the Ukraine but there is nothing. What a shame!!!!",
    "53": "🏀💥Sacramento Kings 1H +3.5  3.00* (-102)\n\n🔎All eyes on Sabonis! Good luck tonight!🍀 https://t.co/oTSwVBvtRg",
    "54": "Bring it back @Golden1Center @SacramentoKings https://t.co/RPGDHiO5oa",
    "55": "Last bucket ever at ARCO.. \"who is @RudyGay Alex\". Lots of great @SacramentoKings memories there!! #SacramentoProud #herewestay #hellaproud #longlivethekings 💜💜 https://t.co/P8VtfmOufx",
    "56": "@SacramentoKings We need this back. https://t.co/ms6Gsi6Y0k",
    "57": "Sacramento Kings Invite Fans to Say Final Farewell to ARCO Arena\n\nFree Public Event to Take Place on Saturday, March 19 https://t.co/U6KJNZLHdp",
    "58": "@SacramentoKings So many good bands played there also. I must’ve saw at least 10 concerts there.",
    "59": "@BallisRoyal @SacramentoKings Yes correct but since the trade the defense has been way better an can potentially get even better.",
    "60": "SLOW MO: Kings big W in OKC #Sacramento #Kings #NBA Video: https://t.co/extWIodtXN",
    "61": "Prediction, Preview, and Odds\n#583 Sacramento Kings vs. #584 New Orleans Pelicans\n\n Wednesday, March 2, 2022 at 8:10pm EST\n Smoothie King Center, New Orleans\n Written by David Delano Marotta\n#NBAPicks\n\nhttps://t.co/cLXtLy8VXF",
    "62": "@FlyoutChase Future Sacramento King",
    "63": "@Moises78592826 @SacramentoKings Yes, which works to our advantage for stretches but not all the time. We suck too much because of our D. Offense isn’t our issue",
    "64": "The Sacramento Kings will begin an important back-to-back set of games tonight when they face the 10th-seed New Orleans Pelicans 👀\n\nHere's what happened on Monday in OKC, plus game notes, stats, injury updates &amp; more ✍\nhttps://t.co/7JrOlezLGT️",
    "65": "Relive the team's 21-point win over OKC in ｓｌｏｗ   ｍｏｔｉｏｎ 🎥 https://t.co/DuiCysE8yg",
    "66": "Sacramento Kings Hosting Final Farewell Party For ARCO Arena On March 19 – https://t.co/jGcPG5TG51",
    "67": "Sacramento Kings Hosting Final Farewell Party For ARCO Arena On March 19 – NBA News https://t.co/rVrl7uD7qF",
    "68": "@SacramentoKings @nbatopshot Y'all gonna scam the stans like the snake @swipathefox or nah?",
    "69": "🏀 NBA 🏀\n🏀 Orlando Magic x Sacramento Kings\n🕐 21:00 🕐\n⛹️ Jalen Suggs ⛹️\n🏀 4,5+ assistencias  🏀\n💰 Odd 1.90 💰\n💸 1 Unidade 💸 https://t.co/Q8dg2cgdeg",
    "70": "I breakdown &amp; give my predictions for the #SacramentoKings upcoming road back-to-back\n\nTonight against the New Orleans Pelicans &amp; Thursday 3/3 against the San Antonio Spurs\n\nHeavy with #NBAPlayInTournament implications!\n\nGO Kings! #SacramentoProud https://t.co/B7usiYGclV",
    "71": "🏀 NBA 🏀\n🏀 Sacramento Kings x New Orleans Pelicans\n🕐 22:00 🕐\n⛹️ Cj McCollum ⛹️\n🏀 24,5+ pontos 🏀\n💰 Odd 1.80 💰\n💸 1 Unidade 💸 https://t.co/0dKlN2qtR1",
    "72": "@SacramentoKings @nbatopshot Scammers",
    "73": "An exclusive 1-of-1 @nbatopshot NFT minted for the ultimate Kings fan, featuring 5 years of unprecedented #NBAAllStar access.👑  \n\nTap in to make your bid: https://t.co/UgIBjFS7th https://t.co/WYJSYzv0Cs",
    "74": "@BallisRoyal @SacramentoKings I do agree with you that when he plays the four, they lose a lot of length but on the flip side it makes them more dynamic on the offensive end.",
    "75": "The Sacramento Kings announced plans Wednesday to host a final farewell event at their former home on March 19. \nhttps://t.co/Sj35BzmTqw",
    "76": "@BallisRoyal @SacramentoKings No I totally disagree, he always shows up on defense but I will say sometimes he doesn’t show up on offense.",
    "77": "@SacramentoKings @CoorsLight @hbarnes Seeing buddy https://t.co/ZGn2kquQBL",
    "78": "Just posted a photo @ Sleep Train Arena Sacramento Kings Game https://t.co/4TcY7F512Y",
    "79": "@Moises78592826 @SacramentoKings You can count on him not guarding too though. Also, Barnes the SF works, Barnes the PF has us falling short in terms of length, shot blocking and size",
    "80": "Find out how you can say goodbye to the former home of the @SacramentoKings later this month.\n\nhttps://t.co/lXyvSRicj5",
    "81": "@ejkiewicz_com @hbarnes @SacramentoKings @NBA fantastic work!",
    "82": "New Orleans Pelicans Predictions and Preview for 3/2/2022 hosts Sacramento Kings.  Find out who we are taking in this matchup. #Sportsbook #NBATwitter https://t.co/K53C3hLIps",
    "83": "Sacramento Kings Hosting Final Farewell Party For ARCO Arena On March 19 https://t.co/zXE5bTjluT https://t.co/1FD21Bv1Ur",
    "84": "This was a Sacramento Kings roster https://t.co/GfCFRqzjFu",
    "85": "Analyzing Wednesday’s Sacramento Kings at New Orleans Pelicans odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/ghuILjl3kb",
    "86": "Sacramento Kings at New Orleans Pelicans odds, picks and predictions https://t.co/Pwa3Njgbxh",
    "87": "@ejkiewicz_com @hbarnes @SacramentoKings @NBA this is amazing. wow",
    "88": "New Orleans Pelicans Predictions and Preview for 3/2/2022 hosts Sacramento Kings.  Looking for betting action?  Find out if there is any value in our preview. #Sportsbook #NBATwitter https://t.co/K53C3hLIps",
    "89": "@bflewis3 @SacramentoKings @TopShotKingdom thinkin about it!",
    "90": ".@coorslight Cold Hard Fact: @hbarnes hit four 3s en route to a game-high 23 PTS in Sacramento’s last matchup against the Pelicans 💪 https://t.co/QRsFpmjHbb",
    "91": "@SacramentoKings @TopShotKingdom we going?",
    "92": "@ejkiewicz_com @hbarnes @SacramentoKings @NBA Brilliant work, as always!",
    "93": "We got the @SacramentoKings tonight in the blender tough match up but we ready for anything and everything let's get another dub @PelicansNBA #WBD #WeFlyHigh ⚜💯",
    "94": "@SacramentoKings Man I have been hoping and wishing they were going to do something like this since the initial redevelopment announcement last summer. Thanks so much to the bigwigs for thinking of the fans that have so much nostalgic attachment to this place!!",
    "95": "I shared this memory on Facebook yesterday. Today, I see the news about the March 19 farewell event. I'm sure every NBA fan in the Sacramento area, not just Kings fans, has a story about Arco Arena.\n\nIf you can go to the celebration, do it! Details here: https://t.co/SeQdZ4l3RT https://t.co/6CPO5IENuP",
    "96": "Excited that I get to go my first NBA game in years. Seeing the @chicagobulls play @SacramentoKings on March 14th. Got my entire outfit of Bulls underwear, socks, hat, T-shirt and sweatpants. Haven’t been this decked out since I was a kid. #basketball #FAN",
    "97": "Sacramento Kings invite fans to say final farewell to Sleep Train Arena before demolition https://t.co/9SCBOaWr5E",
    "98": "@waltasti @SacramentoKings True. Something about those wooden steps though. \n\nNew place is great &amp; deserves a Kings playoff series, hopefully sooner rather than later.",
    "99": "@Dom_2k Baseball is the Sacramento kings of sports. Terrible product, no one cares about it",
    "100": "@SacramentoKings @MattressFirm So a lot of people will die because of us…",
    "101": "If the Sacramento Kings want to get serious about a push for the Play-In, tonight is a critical opportunity for the team to start making that leap. https://t.co/ShN5J2lkmL",
    "102": "Now donating from the charity stripe 🏀💸 \n\nFor every free throw the Kings make at home games, @MattressFirm will donate $15 to the National Red Cross. https://t.co/5NlZwDtFvc",
    "103": "Having a 15 year playoff drought in the NBA, where half the league makes the playoffs, is totally absurd. @SacramentoKings",
    "104": "✨ Famous Followers\n\n🥇 SacramentoKings\n🥈 WorldWideWob\n🥉 pontofrio\n🏅 CharlesWieand\n🏅 1Mfollowiing\n🏅 IgorCharmes3k\n🏅 bocadesopak\n\n➡️ https://t.co/p6D92pe60r https://t.co/70slyaMXjO",
    "105": "So many memories, from middle and high school basketball games, working for the Sacramento Monarchs, high school graduation and Kings games with the family… 🥺\n\nSomeone please go with me! https://t.co/zepEySg8PJ",
    "106": "@PriviteraLouis @AlexWilsonESM I agree but in the nba the sacramento kings did it",
    "107": "@DaBarrera87 @SacramentoKings The new place will have a great atmosphere too, just need to win",
    "108": "I wish the @SacramentoKings still played here. There was no place like it. Great memories and the loudest sports arena/stadium I've ever experienced. Sad that it has to go. #NBA #NBA75 #sacramentoproud #Kings https://t.co/i35uKPGsyn",
    "109": "Some big games are coming up for the Sacramento Kings 👀 \n\n@kayte_c joined The @CarmichaelDave Show with @JasonRoss1140 this morning to preview tonight's matchup against the Pelicans &amp; more 👑 \nhttps://t.co/9jVEwjeHuA",
    "110": "@otepofficial I saw you open for Rob Zombie in a tiny show in Sacramento and my world has never been the same. You are my queen and my king and I'm proud to promote your music and your books to everyone I know.",
    "111": "Game 64 of the Sacramento Kings baby!!! https://t.co/Ai1lrHkeg1",
    "112": "@TonyXypteras That’s not true..you can assume but we really don’t know if we draft him that it would work you just don’t know you can only speculate. @SacramentoKings",
    "113": "@SacramentoKings The game's afoot https://t.co/RDECeN7XNi",
    "114": "@SacramentoKings @MattressFirm Sleep like a King while the actual NBA team puts on a Snoozer!",
    "115": "Come out to Sleep Like a King Night, presented by @MattressFirm.\n\nLearn more about important sleep facts and tips, plus the first 5,000 fans will receive a sleep mask and cowbell! \n\n3/7 at 7:30pm 🎟» https://t.co/EakChrHjdL https://t.co/luO9b2Ldvz",
    "116": "@SacramentoKings Kings fans after Arco detonates https://t.co/mQhJY7XuK1",
    "117": "@gwiss @congraved @SacramentoKings Exactly, I didn’t sign up to read this, I signed up to party.",
    "118": "@SacramentoKings 6th man statue to @docosacramento?",
    "119": "@FCartoscelli3 The @SacramentoKings should move back to that arena. They don’t deserve to play at the G1C.",
    "120": "Sacramento Kings hosting a farewell to Arco Arena on March 19th https://t.co/EeLqFbcMC4",
    "121": "14. No team or fanbase has a right to play the \"they hate us\" card more than the Sacramento Kings.\n\nThe Lakers built a dynasty off benefiting from corrupt gambler game fixing to beat them, and everyone pretends it didn't happen.",
    "122": "@300Hitter That reminds me of the 2018 draft. The Bulls and Sacramento were tied and the Bulls actually won the tie breaker, but the Kings got the better pick. Not sure what old FO of the Bulls would of done,  but I would hope we would of drafted Doncic.",
    "123": "@SacramentoKings Seriously considering flying from SC for this…. Just seems like something I can’t miss",
    "124": "@SacramentoKings Trying to register and I don't see a spot in that link.",
    "125": "#Pelicans shootaround update for 7 p.m. game vs. Kings (Extra practice time, Willie Green's rotation fine-tuning helps New Orleans start fast out of break; CJ McCollum on team adjusting, Tony Snell impact; Sacramento scouting report; lineup notes/keys): https://t.co/67ok7Ns6jV https://t.co/O2NMT4CHwc",
    "126": "@SacramentoKings Shout out to my dad for taking me to see monster trucks at the ARCO Arena",
    "127": "Congratulations to BeerdadB (@BeerdadB) who moved up 1 spot to take #5 on the Sacramento Kings team leaderboard.\n\nhttps://t.co/WHnq2718B3",
    "128": "@sigg20 Good photo.  Hairston played with Detroit, too, after being drafted by--gasp!--the Cincinnati Royals (i.e., the KC Kings and, now, the Sacramento Kings.)  Died too young, of prostate cancer, but he played the game well.",
    "129": "@LouisDeleo @SacramentoKings Better than Gimmick Rubber Band Pavilion like it was for a minute there.",
    "130": "@jefferrrson @Lakers Watch a few @SacramentoKings  games !",
    "131": "@SacramentoKings We said our farewell a few weeks ago. Some dude ran us off!",
    "132": "@mrBLAZE916 @SacramentoKings Damn. All the feels.",
    "133": "@SacramentoKings My first elementary school field trip was at Arco Arena… I remember it like it was yesterday.. fair well and thanks for all the memories!",
    "134": "@SacramentoKings Did they at least slap Arco Arena back on there? Sleeptrain Arena sounds terrible",
    "135": "@SacramentoKings That’s nice (not being sarcastic).",
    "136": "@SacramentoKings Had really good memories there",
    "137": "@SacramentoKings The way they playing they should have stayed there",
    "138": "@IamKDiddy Can't compare to the Seattle, I mean Sacramento Kings....😂",
    "139": "NEW article will be out this afternoon! \n\nI breakdown &amp; give my PREDICTIONS on the #SacramentoKings upcoming road back-to-back\n\nTonight against the New Orleans Pelicans &amp; tomorrow against the San Antonio Spurs\n\nGo Kings! #SacramentoProud https://t.co/nydK61CZSn",
    "140": "Sacramento Kings Invite Fans to Say Final Farewell to ARCO Arena\n\n📝⏩ https://t.co/Vldz5aG5TY https://t.co/UNnVHyfD8V",
    "141": "Is no one gonna start bidding on sacramento kings???",
    "142": "@BallisRoyal No don’t trade Barnes! He is the one guy you can count on every night Mr. Consistency. @SacramentoKings",
    "143": "@LAURIESMOOZ You were hanging out with the entire Sacramento Kings starting lineup? woah",
    "144": "Today is the biggest game of the season for the @SacramentoKings . We need this win to keep our chances alive at the playoffs/play-in. https://t.co/zyMLzPXj58",
    "145": "👇 But also fans didn’t have patience for a rebuild, not just GM and owner. Fans weren’t showing up to games and kids in Sacramento aren’t growing up as Kings fans. There was no opportunity for another rebuild and no assurance that the rebuild would have been successful. https://t.co/tfKaoa3Qk0",
    "146": "We usually don’t get a number this good in a matchup like this:\n\nCJ McCollum's chances of hitting a measly 3? ✅\n💰Bet $127 to win $100💰\n\n@ThatGuyBets banks on this #NewOrleans Pelicans 🆚  #Sacramento Kings prop.\n\n#NBAPicks #NBAProps | #BeatTheOdds👊\n\nhttps://t.co/933CLD2Wxn",
    "147": "The #SacramentoKings take on the #NewOrleansPelicans TONIGHT in New Orleans at 5PM PST ... \n\nWho do YOU think wins?\n\n#SacramentoProud",
    "148": "1U: CJ McCollum OVER 29.5 PTS+ASTS (-110, Caesars)\n\nCJ’s L6 games: 30, 36, 43, 37, 28 &amp; 41 PTS+ASTS &amp; now gets a great matchup vs. Sacramento. O/U for this game is 235 and the Kings are 5 point underdogs. His L4 vs. SAC: 19, 39, 38 &amp; 40 PTS+ASTS.  \n\n30.5 good too.\nPRAs up to 36.5 https://t.co/R1UDwRqw8i",
    "149": "New post (Sacramento Kings vs New Orleans Pelicans NBA Pick – March 2) has been published on The Sports Geek - https://t.co/yhFfeeNrOH https://t.co/AgsxvxLWrf",
    "150": "@n1njaturtle99 @TopShotKingdom @SacramentoKings @nbatopshot i added you to the group. if you're willing and able to drive out here, fill out the form when u get a chance",
    "151": "Consensus Line Move:\n2022-03-02 Sacramento Kings at New Orleans Pelicans from 235.00 to 233.00\nUnder shhhh...\n#NBA #bettingexpert #coding #bitcoin",
    "152": "@ChewieWoolf @TopShotKingdom @SacramentoKings @nbatopshot Definitely a Topshotter, been a long time supporter of the Kings (Piston fan by heart). Live about hour half away.",
    "153": "@n1njaturtle99 @TopShotKingdom @SacramentoKings @nbatopshot not at all? u a local kings fan topshotter?",
    "154": "@TopShotKingdom @SacramentoKings @nbatopshot @ChewieWoolf Is it to late to sign up?",
    "155": "Today's NBA Picks: 8:10 PM ET - Sacramento Kings vs. New Orleans Pelicans - 12 PICKS AVAILABLE: https://t.co/bt6xkPdjVw #nba",
    "156": "Accident, right lane blocked in #Sacramento on Hwy 99 NB after 12th Ave, stop and go traffic back to Martin Luther King Jr Blvd #traffic https://t.co/c3uk72lAkZ",
    "157": "Congratulations to king_of_kongs who moved up 53 spots to take #71 on the Sacramento Kings team leaderboard.\n\nhttps://t.co/WHnq2718B3",
    "158": "He's gonna be a Sacramento King by the end of the year https://t.co/miSLbodj21",
    "159": "The Kings are fighting for a play-in that is slipping away when they should be competing for championships with Luka. He was supposed to save us from our curse and there would have been statues, streets, and babies named after him in Sacramento #damnyouvlade",
    "160": "day 20 of asking the @SacramentoKings for a free @Dsabonis11 jersey",
    "161": "@SacramentoKings should build around Fox &amp; Sabonis everyone else can go… should be targeting Beal, Lavine.",
    "162": "Don’t forget that in 2011 they picked Fredette over Kawhi Leonard and Klay Thompson.\n\n@SacramentoKings have been the worst franchise in the NBA.\n\n@shwinnypooh https://t.co/LVOM3eSbhS",
    "163": "@SagED_UP Sacramento Kings",
    "164": "@FCartoscelli3 I mean it is the 20 year anniversary of the 2001-02 western conference finals travesty … would be fun to see it happen! \n\nGo Kings! #SacramentoKings",
    "165": "I love everyone in that picture. Picked me up when I was down. @SacramentoKings @celtics https://t.co/48xYqdlRvz",
    "166": "The Kings are in town for a Wednesday night matchup 🔥\n\n@PelicansNBA vs @SacramentoKings \n⏰ 6:30 pm\n📺 Bally Sports New Orleans\n📲 Bally Sports App\n#WBD https://t.co/7fw1LwMh2Y",
    "167": "Revenge Game: Garrett Temple plays Sacramento tonight.  He played 135 games in his career for the Kings.",
    "168": "Since Dec 1 the #SacramentoKings are 2-16 on the road …  \n\n8-22 overall on the road …\n\nThe Kings have a tough road contest tonight against the western conference 10th seed New Orleans Pelicans \n\n#sacramentoproud",
    "169": "@SacramentoKings \nHIRE ME ASAP\nI CAN GET THE TEAM\nWHERE WE NEED TO BE\nTHE FRONT OFFICE \nIS ATROCIOUS RIGHT NOW\nLETS SHAKE THINGS UP!!!!",
    "170": "26. Sacramento Kings: Domantas Sabonis https://t.co/IOR5gauYs0",
    "171": "@SagED_UP I do not know however hopefully the hosts will be great even if just you, me, and two random Sacramento Kings players.",
    "172": "🏀 𝗚𝗔𝗠𝗘𝗗𝗔𝗬 🏀\n\n👑 SACRAMENTO KINGS\n🐦 NEW ORLEANS PELICANS\n📍 Smoothie King Center (New Orleans)\n📺 NBA League Pass \n\n#SacramentoProud https://t.co/0xf5NSXsZV",
    "173": ".Are you serious!! A small-market-minded YAHOO from nowhere saying the FIRST question should've been about De'Aaron Fox moving up the @sacramentoKings asists ladder? .Uhhh, Mike Bibby is still the assist LEADER for #SacramentoKings, dumbA$$.",
    "174": "Sacramento Kings vs  New Orleans Pelicans Prediction 3/2/22 - Free NBA P... https://t.co/oOL5QHsOKm via @YouTube",
    "175": "Sacramento Kings require an Event Security Officer - more details here! https://t.co/yDdoVoPYGI",
    "176": "New Orleans Pelicans - Sacramento Kings İddaa Tahmini 03.03.22\nhttps://t.co/f6dHGE6w56",
    "177": "#NBA2K22 Sacramento Kings @ Denver Nuggets\n3ND League - User vs User - Hall of Fame Sliders\nhttps://t.co/FL5xsL0Xif",
    "178": "Consensus Line Move:\n2022-03-02 Sacramento Kings at New Orleans Pelicans from 234.00 to 235.50\nOver invested\n#NBA #espn #analytics #marketing",
    "179": "@RHC240 @SacramentoKings What",
    "180": "@EmptySeatsPics I feel like the years that have passed since the Kings didnt move to Seattle have proved exactly nothing for Sacramento and I am still baffled that it didn't happen",
    "181": "Sacramento Kings --&gt; Davion Mitchell https://t.co/E9NGkzWDUk",
    "182": "@bengalsheadline @SacramentoKings lepause",
    "183": "How can their be any Sacramento Kings fans after all these mistakes lmao https://t.co/DJm53FNDhR",
    "184": "In Season 2 Episode 43, I sit down with Abbey Mathis, VP of Suites and Premium Sales &amp; Service for the Sacramento Kings.  Abbey didn’t dream of working in this business but was able to find her passion and has spent her entire career in the NBA.  \nhttps://t.co/dVhnjtdthS https://t.co/IKM4dw3yek",
    "185": "Consensus Line Move:\n2022-03-02 Sacramento Kings at New Orleans Pelicans from 235.00 to 234.00\nUnder in trouble\n#NBA #sportspicks #programmer #daytrading",
    "186": "Sacramento #Kings vs New Orleans #Pelicans | 3/2/22 | NBA Free Picks and Predictions | NBA Betting tips.\n\nWatch: https://t.co/KdQzvRybjK\n\n#NBA #NBAPick #NBAPredictions #kingsvspelicans",
    "187": "BASKETBALL | NBA\n\nOKLAHOMA CITY THUNDER X SACRAMENTO KINGS\n\nBET: SACRAMENTO KINGS SPREAD -4\n\nRESULT: 110-131\n\nRECORD: 89-64-3 https://t.co/aemEJuDkSb",
    "188": "NBA Basketball Game Betting Picks Simulator: 8:10 PM ET - Sacramento Kings vs. New Orleans Pelicans - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/qqe2gWWTmA #nba #sportsbetting #freepicks #cappertek",
    "189": "Sacramento Kings Launch Health and Wellness Activities Presented by Kaiser Permanente | Sacramento Kings - https://t.co/CJKjCYUpPz https://t.co/NpFp55wAvJ",
    "190": "Somebody Fire Vlade Please @SacramentoKings @L0wee_ Smh https://t.co/xdzkDEUPSY",
    "191": "⭐️FREE #livestream here👉https://t.co/2c6Ltz5wlw 😉\n——\nMar.2, Wed.\n🏀#NBA ‼️\n1.Orlando Magic Vs Indiana Pacers\n2.Cleveland Cavaliers Vs Charlotte Hornets\n3.Philadelphia 76ers Vs New York Knicks\n4.Milwaukee Bucks Vs Miami Heat\n5. New Orleans Pelicans Vs Sacramento Kings ... https://t.co/DnHFglL9kX",
    "192": "Let’s not let this chance go by @SacramentoKings https://t.co/IlOCn1RdLo",
    "193": "@Rjayy_Lowkey Agreed... I hope Sacramento drafts Bronny. Sacramento Kings James jersey would sell forever",
    "194": "NBA Basketball Game Betting Picks Simulator: 3/2/2022 8:10 PM ET - Sacramento Kings vs. New Orleans Pelicans - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/qqe2gWWTmA #nba #sportsbetting #freepicks #cappertek",
    "195": "Sacramento Kings Launch Health and Wellness Activities Presented by Kaiser Permanente | Today, as an amplification of the NBA’s FIT Week presented by Kaiser Permanente, the Sacrame #wellness\n\nhttps://t.co/JXgNyT9PQY",
    "196": "@SacramentoKings This would be awesome to win",
    "197": "Betting the New Orleans Pelicans -5 tomorrow against the Sacramento Kings🏀\nThe Pelicans are starting to find their groove with CJ McCollum and the Kings have not been good on the road.\n#NBA #GamblingTwitter #NBAbets #NBATwitter #NBAbetting #sportsbettingpicks https://t.co/WCWBqOdGS9",
    "198": "The Dallas Mavericks fell to 16-18 following a 95-94 loss to the Sacramento Kings on Dec. 29. They have gone 21-7 since that game.\n\nOver this 28-game stretch, the Mavericks have produced a 113.1 offensive rating (13th), 105.5 defensive rating (2nd), and 7.6 net rating (3rd).",
    "199": "Sacramento Kings drafted Marvin Bagley as a lottery pick. Complete bust.",
    "200": "@realStanVG Where are the \n“Los Reyes” jerseys? @SacramentoKings",
    "201": "@SacramentoKings I bet a whole bunch of people want their money back after Fox scammed them with his NFT project.",
    "202": "@SacramentoKings join the space",
    "203": "The Kings passing on Doncic for Marvin Bagley is proof that God hates Sacramento.\n\nSource: am from Sacramento https://t.co/qoRRQuuLo3",
    "204": "@BleacherReport The Kings passing on Doncic for Marvin Bagley is proof that God hates Sacramento.\n\nSource: am from Sacramento",
    "205": "@BadBizzTheFurry @SacramentoKings That’s cool my bf is followed by the kings too but I made him a Cavs fan",
    "206": "@FlameZWRLD nicee, one of my irl friends has the @SacramentoKings following him",
    "207": "NBA - Pelicans vs Kings 3/2/22 Free Pick https://t.co/XRcUe0qgL5 via @YouTube #GamblingTwitter #Sacramento #SacramentoProud #Kings #NewOrleans #Pelicans #Pels",
    "208": "The strong-headed Mr. Make ‘Em Believe, Terence Davis, is an American professional basketball player for the NBA’s Sacramento Kings.\n#terencedavis #shootingguard #NBA\nhttps://t.co/zDG7cUmn13",
    "209": "day 19 of asking the @SacramentoKings for a free @Dsabonis11 jersey",
    "210": "Mavs get an ugly win against Lakers ✅. 8-2 record in this 11 games stretch. Sacramento Kings up next. https://t.co/90jIscUJ2s",
    "211": "@YouHateGabe_ @TheHoopCentral Y’all doin a Sacramento kings playoff challenge rn why would he go there",
    "212": "Bron &amp; AD saved the Lakers from becoming the Sacramento Kings man 😂",
    "213": "Wish he did this for my @SacramentoKings when we drafted him 🥺😡 https://t.co/FsZLfFCVDk",
    "214": "at a sacramento kings game, looking up at the jumbotron to see greta gerwig and then sam elliott on the celebrity roundup",
    "215": "when i become a sacramento kings fan after they draft bronny and sign lebron &gt;&gt;&gt;&gt;&gt; whatever the lakers doin rn",
    "216": "@MarkJonesESPN Steppin like a Kappa! Givem hell out there @MarkJonesESPN! Tell @adaniels33 no Turtlenecks when the @PelicansNBA play the @SacramentoKings! 😂 bruh enjoy Mardi Gras brothas! 📿📿📿🏀🏀🏀",
    "217": "@SacramentoKings Gonna find a way to rug this too",
    "218": "The Sacramento Kings really wasted a lot of players 💀 https://t.co/OdIMlruWzw",
    "219": "remember when the @SacramentoKings took bagley over luka? #life #luka",
    "220": "Ende #Basketball Herren #NA \n106:130 CharlotteHornets  vs #MilwaukeeBucks \n131:110 #SacramentoKings vs OklahomaCityThunder \n113:116 DetroitPistonsvs #WashingtonWizards \n98:107 AtlantaHawks vs #BostonCeltics \n108:109 BrooklynNets vs #TorontoRaptors",
    "221": "@anthonybax12 Our fanbase is spoiled man. I bet Sacramento Kings fans would kill for the kind of success we have year in and year out",
    "222": "@SacramentoKings fans! Help me out. \n\nDamian Jones (@dameology) is the best rim protector the Kings have had since ___________.",
    "223": "@johnbullphotos @HeuristicLineup @Love_Sacramento @VisitSacramento @DowntownSac This is much better content then the bull shit that is happening on King’s twitter right now",
    "224": "@BleacherReport Sacramento Kings really picked Marvin Bagley over Luka",
    "225": "@LakersNation Sacramento Kings Really chose Marvin Bagley over Luka",
    "226": "@LakersNation Sacramento Kings really picked Marvin Bagley over Luka in the draft",
    "227": "@SacramentoKings The game after my birthday! Would love to take my daughter to her first game ever! 🙃",
    "228": "Former @SacramentoKings draftee Nik Stauskas aka Sauce Castillo just dropped 57 points, 6 rebounds, 5 assists and 11 threes in an @nbagleague game.\n\nMaybe a lottery team can pick him up. For all his defensive flaws, the Canadian sniper sure can shoot.\n\n https://t.co/azJgoeWKI7",
    "229": "The Kings and the California Office of Traffic safety are giving you the chance to win four courtside seats, VIP lounge access, a Kings prize pack and safe transportation to and from the game! \n\nEnter here ➡️ https://t.co/CGaQcVY0EN https://t.co/RRBLnxpw9x",
    "230": "And the Kings are 2-4 in that time. The book on Fox has always been that he puts up good stats but his team doesn’t win games because he is bad on defense. \n\nMeanwhile Hali is killing it and playing winning basketball in Indy. \n\n#Sacramento traded the wrong guy.\n\n#SacramentoProud https://t.co/Csl9CFctb2",
    "231": "Seriously, good things come to those that are no longer @SacramentoKings\nLOL\n\n https://t.co/vtOMWeBgli via @ESPN App https://t.co/LPFFAb18na",
    "232": "Me and Vlade Divac. Former basketball 🏀 player for the Sacramento Kings and I think he was the VP and GM too. Him and Peja Stojakovic 🏀came into the restaurant for lunch. ANYWHO I HAVE THE SHOES ON https://t.co/kUG3dE2GOp",
    "233": "Mark my words, within the next 3 years Trae Young will go to a winning franchise such as the Sacramento Kings",
    "234": "Sacramento Kings donruss elite lot 11$ pwe @sports_sell @SportsSell2 @HobbyConnector https://t.co/dcDgOe6VE4",
    "235": "This past weekend our President &amp; CEO @DawnteEarlyWest was presented with the 2022 @SacramentoKings Dream All-Star award honoring local Black leaders. 👑\n\nCongrats again, Dr. Early! We're proud to have you leading our region forward in how to #LiveUnited 💙 https://t.co/FvlaL9jsh3",
    "236": "@celtics or @SacramentoKings sign this man https://t.co/SBt0nqR37K",
    "237": "@BugattiKnowles @statmuse @SacramentoKings You bite people https://t.co/yi1HDqqAjk",
    "238": "@JoshuaBCaldwell The Kings left KC/Omaha for Sacramento and we DO NOT want them back. That’s a cursed team.",
    "239": "@navsuperfan1 @statmuse @SacramentoKings - we can see you on extreme cheapskate eating roadkill. You hillbilly.",
    "240": "@BugattiKnowles @statmuse @SacramentoKings - can find your name searching Florida man",
    "241": "@navsuperfan1 @statmuse @SacramentoKings That’s right you live somewhere worse, Kansus.",
    "242": "@BugattiKnowles @statmuse @SacramentoKings Cap I don’t live in that fraud state",
    "243": "@navsuperfan1 @statmuse @SacramentoKings - literally lives in Oklahoma with a plantation in your backyard.",
    "244": "@BugattiKnowles @statmuse @SacramentoKings - pro-slavery Southerner",
    "245": "@navsuperfan1 @statmuse @SacramentoKings Ym + Ys already folding my clothes and feeding me grapes.",
    "246": "@BugattiKnowles @statmuse @SacramentoKings Ym has already invited me to the bedroom",
    "247": "@navsuperfan1 @statmuse @SacramentoKings unfortunately ym took me in and loves me like the son she never had.",
    "248": "@BugattiKnowles @statmuse @SacramentoKings Your sister took me in and she love me more than u",
    "249": "@navsuperfan1 @statmuse @SacramentoKings Ironic coming from an orphan.",
    "250": "@BugattiKnowles @statmuse @SacramentoKings Fatherless",
    "251": "@navsuperfan1 @statmuse @SacramentoKings Ym love me more",
    "252": "@navsuperfan1 @statmuse @SacramentoKings Shai is, that’s why he’ll be a Miami Heat next szn.",
    "253": "@overtime @nbagleague Face of the Sacramento Kings",
    "254": "@statmuse @SacramentoKings Is he tired of losing?",
    "255": "@SacramentoKings I would take another Loss. So no",
    "256": "This what @SacramentoKings thought he was going to be able to do in the League 🤣 https://t.co/21ZxwUX0YA",
    "257": "@SacramentoKings How can I get one if I’m from Aus? 🥲🥲",
    "258": "@statmuse @SacramentoKings When will he get tired of all the losing??",
    "259": "Want to get your hands on a limited edition De’Aaron Fox bobblehead? It’s easy, just purchase at least $15 in qualifying items from a participating Power Market location and it’s yours!\n\nVisit https://t.co/Ub1pwkKs6T for more info 🦊 https://t.co/VEalbv2FSf",
    "260": "Realizing Justin Bieber will be in Sacramento on Friday and wishing that some Sacramento King would take me to Golden 1 to sit in a box. 🥰🥰😍🥰",
    "261": "Between Haliburton and Bogdanovic these last two games I am furious with the Sacramento Kings",
    "262": "Sacramento Kings Launch Health and Wellness Activities Presented by Kaiser Permanente | Today, as an amplification of the NBA’s FIT Week presented by Kaiser Permanente, the Sacrame #wellness\n\nhttps://t.co/ssjzfs0p9c",
    "263": "@SacramentoKings let's go thank you🥰🥰",
    "264": "@GraapeZ happy birthday fam",
    "265": "@statmuse @SacramentoKings When will he get tired of all the losing?",
    "266": "@SacramentoKings I mean it isn't Friday and it wasn't within the 30 minutes but it's my birthday and I would appreciate it fr https://t.co/REbZox3p1y",
    "267": "❌ Blocks for Bucks ❌\n\nFor every Kings block at home this season, @phoonglaw will donate $100 to Gigi’s Playhouse. Kings have helped donate $16,400.\n\nBlocks for Bucks presented by @phoonglaw https://t.co/5ZTN1AyBNT"
}