{
    "0": "Tonight’s @invisalign Starting Lineup https://t.co/aVcGizCIU6",
    "1": "Let's get it going against the Toronto Raptors in the final game of the season at Madison Square Garden!!!! Let's go #Knicks!!!! #KnicksNation #SeasonFinale #NewYorkForever #TORvsNYK 🟠🔵🏀",
    "2": "Boston Celtics will be having a hard time during 1st round of the playoffs. With bucks ducking the Nets, they will either face (win then goes 2nd) Brooklyn Nets or (lose then goes 4th) Toronto Raptors. Pick your own poison",
    "3": "@Raptors Give Scottie the ball and let him cook, we dont need to win",
    "4": "Bucks &amp; 76ers both rest their star players on the last day of the regular season with playoff seeding at stake.\n\nWhat do you think this says about the @Bucks &amp; @sixers? Or about the @BrooklynNets? Or, for that matter, the @Raptors &amp; @chicagobulls? \n\n#NBA #NBAPlayoffs https://t.co/4RVhVJFSpR",
    "5": "@othagreat 👊 I can't wait dude! Champs coming outta the East this year! #NBAPlayoffs  #TorontoRaptors #BostonCeltics #ChampShit 🇨🇦🔥🔥🤙✊️👊💚🌿💨💨💨 https://t.co/m0JGb1rwP7",
    "6": "ALERT: New high roller bet posted!\nA bet has been placed for $6,998.25 on New York Knicks - Toronto Raptors to win $13,044.27.\nTo view this bet or copy it https://t.co/4nrAxvi5M6 https://t.co/9WqwVXCGtf",
    "7": "The @Raptors905 play for the Eastern Conference championship tonight! The first of the Toronto teams to enter the playoffs so far this season, but NOT the last as their big brothers the @Raptors and the @MapleLeafs are playoff bound. https://t.co/IGfVnUt4ZX",
    "8": "The @Lakers who built a senior home this season, is looking for a Nurse.  Makes sense.  \n\nBut uh, this ain't happening in any universe.  @Raptors https://t.co/D1N4a54TXm",
    "9": "I have the raptors -215 in a lay from this morning, long before starters were sitting for Toronto. Now they’re -116 lmao yikes",
    "10": "@ScottieB4MVP @Raptors 😂 😂 😂 Don't buss a bloody vessel",
    "11": "I’m ready either way. @BrooklynNets @chicagobulls @Raptors",
    "12": "@richardbriggs I was going to tell you to go catch a Toronto Raptors game, then looked up the distance to Edmonton…\n\nWow! You are WAY up there.\n\nI think your closest team might be the Blazers? https://t.co/pC0uVffzW1",
    "13": "@Tesla42593687 @JPG85673886 @JonesToBourne @Raptors @pskills43 You think siakam is the number one option on the raptors right?",
    "14": "@Raptors We are all Boston fans tonight.",
    "15": "@ekoreen @JLew1050 Toronto raptors fans are basically Boston fans tonight",
    "16": "@SKskills43 9 season from 13-14…but have only watched @Raptors games",
    "17": "@MaxeyBetta @Raptors 76ers First round exits",
    "18": "@harryrl32 @JPG85673886 @JonesToBourne @Raptors @pskills43 It’s now 2022 my friend and last game I watched Davis made him look like a child until the second half you know nothing about bball if you think brown is better. Tatum yes brown no not even close rn",
    "19": "Under the bright lights to end the regular season ✨ https://t.co/koJEqDzdS9",
    "20": "Masai Ujiri, Nick Nurse and Pascal when @Lakers  come calling @raptors https://t.co/d2oXg3kDpQ",
    "21": "@OpenGymAnunoby #tbh Going into a season with zero expectations and kinda expecting several nights of frustrated loses, but getting the exact opposite. This season was an absolute pleasure to witness. #WeTheNorth @Raptors",
    "22": "Back with the @nyknicks and the @Raptors playing the NFT Fanny Pack game! 🏀🏀 https://t.co/e1KR7BWEwT",
    "23": "The @Raptors will face ____________________________ in round 1 #WeTheNorth #NBA75",
    "24": "Toronto Raptors (+0) @ New York Knicks #NewYorkForever #WeTheNorth #NBA #NBATwitter #NBA75",
    "25": "Toronto Raptors Starters:\n\nArmoni Brooks\nGary Trent\nOG Anunoby\nScottie Barnes\nKhem Birch\n\nPlayers out:\nPascal Siakam\nFred VanVleet\n#WeTheNorth #NBA #NBATwitter #NBA75",
    "26": "@Swizzy_94 @Raptors Let the hate go my brother",
    "27": "Though, if the Celtics were to lose the Sixers would jump them with a win tonight making the Sixers the 3 seed to play the Bulls and the Celtics would become the 4 seed to face the Toronto Raptors.",
    "28": "Hope everyone books their Toronto travel asap as the Raptors are making the finals the same week",
    "29": "@Raptors 82 is as important as 1",
    "30": "@someone8372 @_woIfgang @ByJayKing Lol that’s not it at all. They even tried to avoid Brooklyn by resting Tatum Thursday. They just didn’t think the Raptors would creep into the 5 spot, but now they did and they’ve determined a series with the Nets is better than having to play in Toronto without the antivax boys",
    "31": "@celtics @Joe_Sway @RealBobManning @Jimmy_Toscano @John_Zannis @Real_BSmooth \nSo if we Win we are the #2 seed and we will play @BrooklynNets or @cavs.\nIf we Lose we and @sixers Lose we stay at #3 and play @chicagobulls\nBut if @sixers Wins we move to #4 and face The @Raptors",
    "32": "Lakers may pry Nick Nurse from Toronto Raptors after potential split with Frank Vogel https://t.co/hqVQSJbTUS",
    "33": "@TurboTaxCanada @Raptors @DALANOBANTON I love this player. He's going to be something!!",
    "34": "RT: Raptors: Eighty Two ✨ https://t.co/lslyEGeJk5 @raptors @olgproline @NBACanada",
    "35": "Last game of the regular season\nLast aloette of the regular season\nLesgo\n\n@william_lou \n@steven_lebron \n#Raptors \n#Toronto \n#NBA\n#aloette https://t.co/kV1u2BLEWQ",
    "36": "Tonight's starting lineup for the Toronto Raptors: Brooks, Trent Jr., Anunoby, Barnes, Birch \nhttps://t.co/bVWH4AMCA2",
    "37": "Toronto Raptors Starting Lineup 4/10\n PG: Armoni Brooks\n SG: Gary Trent Jr.\n SF: OG Anunoby\n PF: Scottie Barnes\n C: Khem Birch\nhttps://t.co/o75oZ8vnE8",
    "38": "@FortyEightMins @dubs_415 @Raptors @nyknicks @nbatopshot @NBA Ts: scoobydoinks @psychoquack123 https://t.co/dFyaW9msrx",
    "39": "Lakers may pry Nick Nurse from Toronto Raptors after potential split with Frank Vogel https://t.co/uwAKol0UaZ",
    "40": "TONIGHT...\n\nThe #Knicks wrap up the 2021-22 season by welcoming the playoff bound Toronto Raptors to MSG!\n\nJoin @krispursiainen RIGHT HERE at halftime &amp; @JCMacriNBA, @TheCohencidence &amp; @AndrewJClaudio_ for a LIVE edition of the KFS podcast on the KFS YouTube Channel! https://t.co/iSqfpwNyIh",
    "41": "*Charles Barkley Voice* I GUARENTEE a @Raptors win tonight + All-NBA Siakam with another Triple-Double",
    "42": "Uniforms for Toronto Raptors vs New York Knicks at 4:00 PM. \n\n#WeTheNorth #NewYorkForever https://t.co/0awfPEDfBJ",
    "43": "@Raptors Scottie can clinch roty with a bombastic performance tn",
    "44": "Your full Siakam: Our Big Read on his remarkable path back to the NBA's elite, and coming up in the @Raptors pregame show on @Sportsnet my sit-down with Pascal, produced by @PHDMAC. Read now, watch in a minute: https://t.co/fGVqJMda07",
    "45": "@Raptors Game Day! Let the kids loose! FREE Svi, Justin, Armoni, Delano, Isaac, David and Yuta!",
    "46": "I'm at Madison Square Garden - @thegarden for @nyknicks @Raptors in New York, NY https://t.co/ri4GBYkTIQ",
    "47": "Lakers could pry Nick Nurse from Toronto Raptors after potential cut up with Frank Vogel - Newsworldpress @ https://t.co/48KzdKysow https://t.co/XYr4Y2OtaT",
    "48": "@Raptors What a journey #82 exceeding expectations #16 more wins ahead after taking care of business in the Mecca tonight #WeTheNorth",
    "49": "Leon's is giving YOU a chance to bring home a piece of Toronto Raptors franchise history! Enter to win a one-of-a-kind coffee table, made from a piece of the 25th Anniversary “95 Rewind Court”! Don’t miss your chance to enter! https://t.co/3t7eOkaQwv",
    "50": "@Raptors They're so fine 🥰🤟🏽 #WeTheNorth https://t.co/82crgiFHys",
    "51": "Watch out for the team north of the border!\n\nHear @talkhoops explain why nobody should want to face the @Raptors in the playoffs.\n\n#WeTheNorth https://t.co/BhmOLoWqLE",
    "52": "@MarkColley Future 2nd round pick of the Toronto Raptors 🔥",
    "53": "@sickyvstheEarth @david_paran @Raptors @ScottBarnes561 If Barnes was on the magic it would be a disaster, jalen was and still is the better fit. no one in Orlando wanted to draft Barnes but we are very happy for you guys that you were able to take such a raw prospect and put him in a great position to succeed",
    "54": "@nbalegacypod @RobertoFlambay @WalderSports @Raptors you haven't seen nick nurse then",
    "55": "Honestly, I’d rather play the Raptors and then the Heat, than the Bulls and then the Celtics/Nets/Bucks\nWe struggle against Toronto SURE,we also haven’t seen Harden playoff mode yet. Toronto has 0 answer for Tyrese Maxey.Defensive intensity will pick up which is what they lack rn",
    "56": "@xlrxdzxx @LFPhilJackson @PapiChulo072902 @stevenperkins7 @KCJHoop They will most likely rest their stars out of preparation. They still should beat the Raptors, or at least be favored in a series like this... if they win, they win. If they don't, they get Toronto. I don't think they care if its Toronto or Chicago.",
    "57": "🏀Toronto vs New York\n\n📈TOP 4 KEY STATISTICS\n1⃣Total is UNDER in 5 of #Raptors last 5 away games \n2⃣Raptors is 8-1 SU in last 9 games\n3⃣Total is UNDER in 6 of #Knicks last 7 games\n4️⃣Total is UNDER in 5 of Knicks last 7 home games\n\n#GamblingTwitter #bettingtips #NBA #NBATwitter https://t.co/u4lMrdWB35",
    "58": "🚨 Line Change 🚨\n\nToronto Raptors @ New York Knicks\nSun 7:10 PM EST\n\nFrom:\nNY 4.5 -110\n\nTo:\nNY 1.0 -110",
    "59": "@CarloColaiacovo Longevity with a team is still important to be considered the greatest for that team, which is why Lowry is the greatest raptor, not kawhi, Vince, or demar. Until Matthews spends a while in Toronto, it’s still sundin to me https://t.co/Ei1Ez86dYa",
    "60": "@Raptors @pskills43 Yes, yes, yes. Let's start we US sports media. https://t.co/TNhYisEBdq",
    "61": "Consensus Line Move:\n2022-04-10 Toronto Raptors at New York Knicks from 216.00 to 214.00\nUnder who's in\n#NBA #sports #sabermetrics #cryptocurrency",
    "62": "Consensus Line Move:\n2022-04-10 Toronto Raptors at New York Knicks from 5.00 to 0.00\n#NewYorkForever business... man\n#NBA #bettingonline #data #bitcoin",
    "63": "@jxremmy @david_paran @Raptors @ScottBarnes561 Sadly barnes clears",
    "64": "@NotBlizzzo @Raptors Beat it Bozo!",
    "65": "@TangerineHoops @Raptors Let’s Gooo #WeTheNorth https://t.co/SnXoKtaKlj",
    "66": "Lakers may pry Nick Nurse from Toronto Raptors after potential split with Frank Vogel https://t.co/652qcrUo64",
    "67": "@Raptors Run it through @ScottBarnes561 tonight, please. We ready. 💯 https://t.co/Wb6yq4nmsR",
    "68": "@Saruhambagu @Raptors Most dangerous 5 seed ever",
    "69": "@NotBlizzzo @Raptors How does it feel to lose the title in the last game in the Oracle🤣🤣🤣🤣🤣🤣",
    "70": "Who’s ready for the last @Raptors game of the regular season? Show us how excited you are with a GIF!",
    "71": "@TheNBACentral @James_HamNBA Leave that poverty franchise and join the Toronto Raptors",
    "72": "@Raptors I will miss this season but we are back were we belong #WeTheNorth #Playoffs2022 #Champions",
    "73": "Danny Green Gifts @ScottBarnes561 his Championship Jacket https://t.co/mvLeNigh39 I wouldn't give away my jacket. Nice gesture from Green. @Raptors @sixers",
    "74": "If Philly (w/o Harden/Embiid) loses this evening, Boston would stay at the 3-seed and face off against the Chicago Bulls. If Philly wins, Boston would drop to 4 and face off against the Toronto Raptors https://t.co/9l3wHEdt5U",
    "75": "@BlakeMurphyODC @Raptors should've kept him over Bongga who we never see in regular season, stuck in GLeague 🤪😅",
    "76": "Lakers may pry Nick Nurse from Toronto Raptors after potential split with Frank Vogel\n#123INFO\nhttps://t.co/LWK5cNi8t2",
    "77": "@Raptors Can’t wait guys",
    "78": "@Inthe6ix13v2 @Raptors @TheHoopCentral I need ittt",
    "79": "@NotBlizzzo @Raptors Even if that does happen we was “supposed” to win less than 37 games this season according to most media analysts💀 what we happens Raps caught the W. This team bout to be a perennial top 3 seed for years to come lol.",
    "80": "@SB4xJG4 @Raptors Cade’s out and Mobley only put up 18, Scottie just gotta do good enough to get a @TheHoopCentral post",
    "81": "@Raptors Let Scottie eat tonight to secure the ROTY",
    "82": "@Raptors #WeTheNorth  baby!!! Lets go raptors!! https://t.co/hz4sW1iMas",
    "83": "@Raptors Let Scottie stat pad I beg, give the ball everytime to him, DONT BALL HOG PLEASE, the ballot ends today or tomorrow",
    "84": "@Raptors @MapleLeafFoods Ugh, the game is on Sportsnet! Go figure! My only day off and TSN ain’t the one broadcasting {IT}!",
    "85": "This all started with the trip to Toronto to play the Raptors\n\nGod I hope we don't have to play them https://t.co/iHAJFMBke9",
    "86": "Lakers may pry Nick Nurse from Toronto Raptors after potential split with Frank Vogel https://t.co/EB3lrnKr7U https://t.co/76Eb67Tq0j",
    "87": "Lakers may pry Nick Nurse from Toronto Raptors after potential split with Frank Vogel https://t.co/M364lXWVzK #news #topstories #berkleybearnews",
    "88": "Andy Vermaut shares:Lakers may pry Nick Nurse from Toronto Raptors after potential split with Frank Vogel: According to new reports on Sunday, the purple and gold are already hot… https://t.co/zRXp9cA7e7 Thank you. #ThankYouJournalistsForTheNewsWeGetFromYou #AndyVermautThanksYou https://t.co/NCgytL5qdq",
    "89": "Lakers may pry Nick Nurse from Toronto Raptors after potential split with Frank Vogel https://t.co/Q7ufKvfs4t via @foxnews",
    "90": "@NotBlizzzo @Raptors even broncos are a bigger franchise than the Chiefs",
    "91": "Leon's is giving YOU a chance to bring home a piece of Toronto Raptors franchise history! Enter to win a one-of-a-kind coffee table, made from a piece of the 25th Anniversary “95 Rewind Court”! Don’t miss your chance to enter! https://t.co/q62dzMS1B2",
    "92": "Twice as Tall…\n@Raptors https://t.co/WENzruMHL4",
    "93": "@Raptors Makin’ ‘em climb hills before 82, eh",
    "94": "@Raptors What a ride",
    "95": "Lakers: Executive Links Toronto Raptors Head Coach Nick Nurse to LA https://t.co/EM2cPpzOdT via @@eeulau",
    "96": "@Raptors All I ask for is some Scottie stat-padding this game",
    "97": "@NotBlizzzo @Raptors Ratio",
    "98": "@Raptors This season went by so quickly",
    "99": "Eighty Two ✨ https://t.co/TwNPiNAWz7",
    "100": "Last game in the #NBA regular season coming up. Do you think there is any team excited about facing the @Raptors in the #NBAPlayoffs2022  ?\nGo Raps! #WeTheNorth https://t.co/uC74TjV8KD",
    "101": "@TheNBACentral @SeanDeveney The Lakers aren’t tough enough to play for Nick Nurse. @Raptors",
    "102": "@JoeyAngus11 @toughseason Celtics tank and Sixers beat the Pistons, Celtics get the 4-5 Cs Raptors seeding, but Cs have unvaxxed players who can’t travel to Toronto. OTOH if Cs don’t tank +beat Grizzlies, they face Nets in 2-7 frst rnd seeding, then Bucks in the 2nd rnd",
    "103": "@FortyEightMins @Raptors @nyknicks @nbatopshot @NBA TS: darcyt14\nMy boy Freddy let's go! https://t.co/opkCKZDmTX",
    "104": "@MarxGasol I'm just grateful I don't have to deal with the post-kawhi abandonment issues raptors fans can't seem to shake. sending lowry to a place he'll never win another ring while Toronto is back in the mix this year must hurt too.",
    "105": "#KNICKS#CAPTURE#THE#RAPTORS#NEW#YORK#KNICKS#VS#TORONTO#RAPTORS https://t.co/k7fHZTCwSG",
    "106": "LAST GAME NBA REGULAR SEASON: New York Knicks x Toronto Raptors https://t.co/z1jCvLlfLK",
    "107": "Sixers lost to the Raptors 3 of 4 times. All games decided by 6 points or less. 3 of those 4 games they sat Fred Van Vleet &amp; OG Anunoby &amp; Embiid only sat out once. \n\nDidn’t want to have to see Toronto in these playoffs. Not so much because of the players, but Nick Nurse owns us.",
    "108": "Or Toronto. People are forgetting Toronto. \nIf Boston loses and Philly wins, Boston drops to 4 and faces the Raptors which also isn't an enjoyable outcome. Winning tonight avoids that. https://t.co/DDFss4DNzz",
    "109": "Check out 2019-20 ILLUSIONS BRONZE #158 TERENCE DAVIS RC PSA 10 TORONTO RAPTORS  https://t.co/QRPKkDgsoZ via @eBay",
    "110": "@JustEsBaraheni Who do you think should be favored in a sixers raptors series? I genuinely don’t see how Philly could win that series lol I got Toronto in 6",
    "111": "@YesLouisse @Raptors @gtrentjr Pure @MagicJohnson on @kaj33! I love his child-like energy! I'm 36 abd I act like @ScottBarnes561! Stay young and keep it up! We all love you!",
    "112": "New York Knicks - Toronto Raptors\n\nBet slip link: https://t.co/JzJhevUFMK\n\n#NewYorkKnicks #TorontoRaptors #monero #xmr #tips https://t.co/PjORaAl00H",
    "113": "Toronto Raptors at MSG to end the Regular Season Tonight Dudes !",
    "114": "Just get 1 of 2 on the road @Raptors",
    "115": "@JLew1050 Sixers want revenge with the @Raptors 🤪 #WeTheNorth",
    "116": "Our home grown franchise star player @pskills43 #AllNBA  @Raptors #WeTheNorth https://t.co/O8Lf1SEUWf",
    "117": "Likely locks Philadelphia into 4 and a matchup with the Toronto Raptors.\n\nBoston might not have the same incentive to win tonight now. https://t.co/5768mvmCmE",
    "118": "It’s GAME DAY FOR @raptors As They Play The New York Knicks https://t.co/GAIewBOp0l",
    "119": "Which getup for the game tonight? I know. It’s a no brainer. @Raptors https://t.co/3MOaxVO8zY",
    "120": "@ImDFSn @Hopephully The Toronto Raptors and the Memphis Grizzlies are tied for the best record in their last 15 games, with a record of 12-3.",
    "121": "#NBA, \n\n#Basketball,\n\n#NBATwitter,\n\n#Raptors, #RTZ, #WeTheNorth,#TorontoRaptors, vs. #KnicksNation,  #Knicks, #Nyknicks, #NewYorkKnicks, Get your best odds - fast at https://t.co/Ohl03KWAVe https://t.co/bdDVcEQ6Uw",
    "122": "@JonesToBourne @Raptors @pskills43 jaylen brown stans are better comedians",
    "123": "Lakers May Pry Nick Nurse From Toronto Raptors After Split With Frank Vogel\n https://t.co/zBIZgDgWZ3",
    "124": "Next @Raptors retired number? Oops! My Choice - 15 @mrvincecarter15",
    "125": "@wacchi1013 Even if you did, they took a shot on you and you played the rest of the game on pure effort! I always knew you, @gtrentjr and @pskills43 would be a lethal trio but damn @yungsmoove21! Always loved your game and glad you're a @Raptors! Plus #ROTY @ScottBarnes561 wow great ending!",
    "126": "The @cavs are really good at beating up on short handed teams.\nThe @Raptors not so much 😡",
    "127": "@CelticsRiley The raptors without williams. Brown and horford also for 3/7 games against toronto. Then face the 1 sedd?",
    "128": "Shoutout @halfgood_ for making a poster for EVERY @Raptors  game this season. Checking these out on game days was a regular part of my routine this season. Enjoyed every one of them. 👏🏻👏🏻👏🏻 https://t.co/JYFMbbh9z4",
    "129": "@PotterBarry @LorneMc @JoeWecker @Raptors Good one Barry",
    "130": "@Raptors @pskills43 Spicy P —MVP",
    "131": "Argued on Wednesday #Celtics would be better off vs. #Nets than #Raptors\n\nNot too concerned about Boston losing tonight, and Philly may rest Embiid/Harden, but Toronto possibility is still alive. https://t.co/nCPO5GuTdx https://t.co/iHr7aNC9zd",
    "132": "@InTheLabBrand Celtics don’t want raptors jaylen brown isn’t vaccinated so he can’t play in Toronto",
    "133": "I found out my best friend taught Toronto Raptor Dalano Banton when he was in high school in Toronto. I needed to share this. That is all.",
    "134": "Scottie Barnes is the greatest #4 to ever play for the @Raptors #WeTheNorth",
    "135": "@Raptors @pskills43 @Khritoh can’t wait to see yours x",
    "136": "@kemba_better @GiddeyDimes The TAMPA Bay raptors didn't make the playoffs. Toronto Raptors always get outta the first.",
    "137": "@YAnunoby @NekiasNBA Toronto's only ring was unethically sourced (non-locally-sourced kawhi was traded to raptors against his will &amp; disliked it so much he fled for LA even after winning a ring, also showed no post-chip loyalty to Ibaka or Gasol).",
    "138": "@Raptors you resting ur starters tonight or not",
    "139": "@PrisonBull @loveisourfiller @DerozanFan10 @ice_moke @RapsMuse @Raptors Weak",
    "140": "@yuishinron @Nixon_Kid @DerozanFan10 @BraedenSteele02 @TheNBACentral Raptors strengths are Boston's weaknesses. Boston gonna have to fight through having 15 less possessions a game to win things without Rob and no Brown for the Toronto games (unless things have changed). The Raps are the Celtics worst match up in the first round.",
    "141": "Does anyone know how a potential Celtics-Raptors series would go? What players would/would not be eligible to play in Toronto for the C’s?",
    "142": "@LorneMc @Agridome @JoeWecker That's easy...@Raptors",
    "143": "@Raptors @pskills43 🌶 never disappointed",
    "144": "RT: Raptors: Play our Raptors 50|50 presented by @AccessStorageCA. Proceeds will support our mission to change the game for youth on and off the court. \n\nGet your tickets now!\n\n➡️: https://t.co/DEqeVr8wmJ https://t.co/hyjG0vFn4j @raptors @olgproline @NBACanada",
    "145": "@gothamsfunnyman @RyersonInDundas @TPSOperations @BlueJays @Raptors @ScotiabankArena @RogersCentre He’s eluding to the “defund the police” thing, the movement to reallocate funding from 100% police force to a smaller percentage combined with more  social workers, psychologists, etc.  Still a dumb thing to say.",
    "146": "4/10/22 Part 2…\n#NBA \n🏀 Toronto Raptors -5 -110\n🏀 Sacramento Kings +10.5 -110\n#NHL \n🏒 Dallas Stars (60 min) ML +100\n\n#GamblingTwitter #NBA #NHL",
    "147": "@Doug_Thonus Honestly not sure whats better for Boston playing KD or playing the Raptors without JB or Al in Toronto",
    "148": "🏀 RAPTORS VS KNICKS!\n\nThe @Raptors close out the  regular season they take on the @nyknicks at MSG tonight!\n\nWill the 🦖’s wrap up their season in the big 🍎 with a 4th straight W?  \n\n#MakeAPlay ➡️ https://t.co/qUPBOzx6EM #WeTheNorth \n#NewYorkForever https://t.co/HSyDdWn7IY",
    "149": "@Burn3r__ @jermaine_tansey @Bucks Celtics will be rewarded by playing the Toronto Raptors if they lose tonight. Celtics are 1-3 against Raptors this year. 76ers play Pistons today and if the Celtics lose the 76ers will be rewarded with a Bulls first round match-up",
    "150": "The Bucks played Brooklyn four times this year and won three. \n\nThey played the Raptors three times this year and lost them all.\n\nThey uncharacteristically played everyone back to back two days ago and eliminated the Toronto/Miami path to the East Finals. They seem fine with it.",
    "151": "@raptors i have a favor to ask. https://t.co/8XhKo55UKH",
    "152": "@Raptors @vivekmjacob @TangerineHoops @ScottBarnes561 finish regular season 💪🏽 deserve to be ROTY #WeTheNorth",
    "153": "@Raptors @vivekmjacob @TangerineHoops Give him the ball constantly today",
    "154": "@JpConsulting4u @Raptors They’re 5th. Result doesn’t matter tonight against the Knicks",
    "155": "@KyleNeubeck Avoiding Raptors more important than normal because of Matisse absence in Toronto. Without him they have no one other than Embiid that can stop anybody.",
    "156": "All this talk about match-ups for playoff series against @Raptors \n\nDoes it matter if we win or lose, or is it only results from other teams that affect who we play? \n\nIf so, and if OG and Fred are healthy, should we play them? \n\nQuestions for @heyhalima or others\n\n#WeTheNorth",
    "157": "Ok so first game of what ended up being the NBA was the NY Knicks vs the Toronto Huskies in Toronto, 75 years ago. Today, capping off the 75th anniversary, it ends in NY—NY Knicks vs the Toronto Raptors. I’m sure this was intentional, right?",
    "158": "The @Raptors game gonna be nice lmao",
    "159": "The Raptors surpassed expectations in the regular season the old-fashioned way — with hard work #Toronto #Raptors #NBA https://t.co/EOzcUTKjd0",
    "160": "@TheNBACentral @SeanDeveney Who tf  thought of this? Clippers and Lakers want all Raptors.  #SMH @raptors",
    "161": "@ScottBarnes561 = best defender in his class✔️ will be one of the best two way players + position-less defenders for years to come🎯 guards all 5 positions 1-5 effectively #TheFutureIsNow 📈 \n\n@Raptors x @NBA x @ESPNNBA x @NBAonTNT x @NBATV x @rapsmuse_nba https://t.co/1rJeyskqqA",
    "162": "@Josh_an_James @Raptors @TangerineHoops Or over very soon",
    "163": "How cute is my little nephew!! (and brother 😂) #tangerinefanangle #wethenorth #torontoraptors #gorapsgo @Raptors @TangerineHoops https://t.co/5Ig1IV5yEQ",
    "164": "@Tesla42593687 @JPG85673886 @JonesToBourne @Raptors @pskills43 https://t.co/NReUt050of\nSeems like a pretty even match up to me",
    "165": "@rich_hofmann They're screwed with a tough matchup either way. The combo of missing starters + Williams injury against Toronto would make that a tough series.\n\nAs far as the Sixers go, fine with the Raptors. If they can't win that series what are we even doing.",
    "166": "@_emmajbrown @Raptors @pskills43 I would put my money on it that he is",
    "167": "@Tesla42593687 @Phoenix7863 @JPG85673886 @JonesToBourne @Raptors @pskills43 Didn’t use advanced stats but go off",
    "168": "@ShamsCharania All this to lose to the @Raptors in the first round.",
    "169": "@NevaCared_FN @OffBari @Raptors @ScottBarnes561 It’s called reverse jinx",
    "170": "@Phoenix7863 @harryrl32 @JPG85673886 @JonesToBourne @Raptors @pskills43 Advanced stats in general are irrelevant in every sport",
    "171": "@harryrl32 @JPG85673886 @JonesToBourne @Raptors @pskills43 You want me to show you clips of Davis making joker look like a child ?😂😂 this proves nothing brown is not better. He may be one day but he’s just simply not better",
    "172": "Preparing for tonight's season finale by re-living the championship run with my 3 month old Liam! #wethenorth #tangerinefanangle @Raptors @TangerineHoops https://t.co/qRynytkTgr",
    "173": "One of the few downsides to moving to Toronto is that now I get FOMO watching Leafs/Raptors/Jays/TFC home games",
    "174": "@DocHobo3 @phatasschad they are no Toronto Raptors I tell you what",
    "175": "@lisaovc @Raptors @pskills43 Haha finally something funny on this topic. Humor approval rating 8/10 👍",
    "176": "@Sportsnet @Raptors @halfgood_ GO RAPS GO ! #WedaNorth",
    "177": "Congratulations to Faron (@FaronLE) who moved up 3 spots to take #11 on the Toronto Raptors team leaderboard.\n\nhttps://t.co/uFactIaoLb",
    "178": "@Sportsnet @Raptors @halfgood_ I love this artwork.",
    "179": "The @Raptors look to close their regular season with a W against the Knicks in Madison Square Garden tonight.\n\nReply with your score predictions! ⬇️ #WeTheNorth\n\n🎨: @halfgood_ https://t.co/kEQbaaPLNu",
    "180": "Leon's is giving YOU a chance to bring home a piece of Toronto Raptors franchise history! Enter to win a one-of-a-kind coffee table, made from a piece of the 25th Anniversary “95 Rewind Court”! Don’t miss your chance to enter! https://t.co/Pggfpm5tlp",
    "181": "Play our Raptors 50|50 presented by @AccessStorageCA. Proceeds will support our mission to change the game for youth on and off the court. \n\nGet your tickets now!\n\n➡️: https://t.co/jQva3Nes3A https://t.co/mGkdreOIPh",
    "182": "@Raptors @pskills43 Weeehellll! Givin' praise to Masai and Bobby, the elders FVV &amp; OG, elder KLoe, may he rest in Miami. We have come to honour our All NBA  Mr. Siakim. Can I get a AND ONE?! https://t.co/kyLXjaYqG1",
    "183": "I’m a @Raptors 1H -2.5 away from quite a bit of $$$ https://t.co/TJSEjJ0sAb",
    "184": "@PMarshall16 @MurphKennedy @jefeboah @itzmeatt Brah w talking this year no raptors or KD and regardless Toronto has a deep roster and depth OKC was top heavy on KD and Russ. Atleast KD and Russ got to the finals",
    "185": "@AdamTaylorNBA I think it’s mainly the eligibility concerns. I’d rather have everyone (minus Rob of course) vs the Nets than be another man down vs the Raptors 3 out of 7. Especially considering how long Toronto plays",
    "186": "@bastiaa86949472 @julian_dsc @JoelEmbiid Toronto raptors are gonna win against your small team",
    "187": "Lakers: Executive Links Toronto Raptors Head Coach Nick Nurse to LA https://t.co/nNkJjTZkOB",
    "188": "New York Knicks Predictions and Preview for 4/10/2022 hosts Toronto Raptors.  Looking for betting action?  Find out if there is any value in our preview. #Picks #GamblingTwitter https://t.co/V1Lo1BdVSA",
    "189": "Final NBA Regular Season Day:\n\nCleveland Cavaliers -6\nToronto Raptors -3\n\nPlayoff time is upon us 🤙🏽\n\n#gamblingTwittter",
    "190": "@Sohey4562 @Raptors @pskills43 And he damn well should cause Pascal has to work twice as hard for a call then the rest of the so called all stars have to because he has to fight the refs the whole way. If the rest of them had to fight as hard as Pascal they wouldn’t be all stars!!!",
    "191": "@Phoenix7863 @IcyScottieV2 @JonesToBourne @Raptors @pskills43 It was less than 2 years ago after siakam had already won the chip with kawhi https://t.co/uRPFRqXBC5",
    "192": "The Raptors gonna give the Sixers a scare in the first round. I see Toronto pushing them to 7.",
    "193": "@RobertoFlambay @WalderSports @Raptors No coach, not even Pop, is gonna tell LeBron when he plays.",
    "194": "@RapsOwnYou @david_paran @YABarnes4ROTY @JonesToBourne @Raptors @pskills43 https://t.co/uRPFRqXBC5\nHere’s the film if you don’t believe me",
    "195": "@JergoatWest @Raptors @pskills43 Enjoy your crazy account 😊",
    "196": "@YABarnes4ROTY @arielhelwani This is why the raptors are the only real Toronto sports team",
    "197": "I'm excited about the New York Knicks vs. Toronto Raptors - Madison Square Garden, New York, NY - Sun, Apr 10. Who's in? https://t.co/lfI24NRH2D",
    "198": "@Tesla42593687 @harryrl32 @JPG85673886 @JonesToBourne @Raptors @pskills43 Those advanced stats are from 3 years ago in Disney land lol",
    "199": "@RGK91605631 @loveisourfiller @DerozanFan10 @ice_moke @RapsMuse @Raptors I'm going to buy this house for you to live in free-of-charge. This is to compensate for Scottie Barnes living in your head rent free. https://t.co/lHPqK8u0Vu",
    "200": "@SuperfanHornets No the Rockets been playing good they barely lost to the Raptors by a single basket up in Toronto the other day. Toronto is luck better than Atlanta right now.",
    "201": "@yuishinron @Nixon_Kid @DerozanFan10 @BraedenSteele02 @TheNBACentral Alright Casualboi. Here's the thing. I think the Celtics are a good team. If you are stupid enough to think the Raptors are not a good team then that is on you. If you want Boston to win a Chip then you should be praying they don't get Toronto because they broke you last time.",
    "202": "@Raptors @pskills43 @william_lou have you done it publicly yet?? If not, 🤫.",
    "203": "@MomOfEverybody @Raptors @pskills43 Truly! 😊",
    "204": "@harryrl32 @IcyScottieV2 @JonesToBourne @Raptors @pskills43 Mf pulling up a stat from 3 years ago rent free",
    "205": "@RGK91605631 @loveisourfiller @DerozanFan10 @ice_moke @RapsMuse @Raptors Casual.",
    "206": "@harryrl32 @JPG85673886 @JonesToBourne @Raptors @pskills43 Don’t share this shit it’s irrelevant. Stop looking at advanced stats they mean nothing",
    "207": "@Sohey4562 @Raptors @pskills43 Bruh you actually went and liked your own tweets, you are a troll 🤣",
    "208": "@PrisonBull @loveisourfiller @DerozanFan10 @ice_moke @RapsMuse @Raptors You’re not a true fan, I don’t really care what you have to say anymore.",
    "209": "@Raptors @pskills43 Focus on playoffs 💪🏾 thank you",
    "210": "The Toronto Raptors are going to beat the sixers in the first round lol bookmark this",
    "211": "Which Toronto GM/Pres. has improved his team the most over the past year?\n#LeafsForever \n#Jays \n#raptor",
    "212": "@Raptors @pskills43 ETHICAL BASKETBALL https://t.co/GVcI9QJG8i",
    "213": "@RGK91605631 @loveisourfiller @DerozanFan10 @ice_moke @RapsMuse @Raptors Scottie is so positive he evens lets your team have a few wins so you aren't so sad.",
    "214": "@PrisonBull @loveisourfiller @DerozanFan10 @ice_moke @RapsMuse @Raptors Shows how much you watch since Toronto hasn’t beat Detroit this season. Your credibility is gone. C ya",
    "215": "@PrisonBull @loveisourfiller @DerozanFan10 @ice_moke @RapsMuse @Raptors And losses right???",
    "216": "Leon's is giving YOU a chance to bring home a piece of Toronto Raptors franchise history! Enter to win a one-of-a-kind coffee table, made from a piece of the 25th Anniversary “95 Rewind Court”! Don’t miss your chance to enter! https://t.co/P8f1fkwRKU",
    "217": "@MomOfEverybody @Raptors @pskills43 And he's still barely surviving.",
    "218": "Why would Nick Nurse want to leave the Toronto Raptors organization? https://t.co/OMHcYvwQWi",
    "219": "@RGK91605631 @loveisourfiller @DerozanFan10 @ice_moke @RapsMuse @Raptors Only when he plays Detoilet.",
    "220": "@JergoatWest @Raptors @pskills43 Well, thank heavens it’s 2022",
    "221": "@PrisonBull @loveisourfiller @DerozanFan10 @ice_moke @RapsMuse @Raptors Scottie Barnes is definition of garbage time points",
    "222": "@Raptors @pskills43 They could keep them. Loving that he’s feeling well &amp; playing well ❤️ Haters truly don’t matter.",
    "223": "Them 2014-17 Toronto Raptors and Lob City Clippers had some of the worst luck.",
    "224": "@Raptors @pskills43 It’s gettin a little spicy ova here🌶🌶🌶",
    "225": "@JaredOfLondon @Dad_Loop They need to add a Raptor and do a Toronto Pro-Stars homage",
    "226": "@TPS51Div @TPAca @Raptors Nice!",
    "227": "No take-off in Toronto. Raps head to the Big Apple. 🍎\n\nRaps to cover and win + Manny's going over 217. 🎲\n\n@_mannyrao The Lineup: https://t.co/jyZk0RYOBk\n\n🖼: IG/@tansley\n\n#RTZ #Raptors #Knicks https://t.co/FH6o83ONtG",
    "228": "@Raptors @pskills43 For you @Sid_Seixeiro",
    "229": "What a day for Toronto sports!! @BlueJays @Raptors @Raptors905 I’ll also count @MapleLeafs win last night as part of our winning weekend! #WeTheNorth #RoadToTheSix https://t.co/p8bMHbPcxq",
    "230": "No take-off in Toronto. Raps head to the Big Apple. 🍎\n\nRaps to cover and win + I’m going under 217. 🎲\n\n@raptorsrepublic The Lineup: https://t.co/nfj5zCPNjL\n\n🖼: IG/@tansley\n\n#RTZ #Raptors #Knicks https://t.co/JuAbFAFFpq",
    "231": "Toronto is an underrated sports city right now. Leafs, Raptors, and Jays are all on fire.",
    "232": "🏀 Raptors game day 🏀\nSunday night hoops \n#Toronto @Raptors 🆚️ @nyknicks \n#wethenorth #NBA #nba75\n#NewYorkForever  \n\nBased on the options below, who will score the first bucket for #Raptors tonight?",
    "233": "RT: Raptors: We'll collect formal apologies here at the end of the PascAll-NBA szn. \n\n@pskills43 https://t.co/fwWwvIxUdG @raptors @olgproline @NBACanada",
    "234": "RT: Raptors: @NBACanada Love the concept, hate the spelling @raptors @olgproline @NBACanada",
    "235": "RT: Raptors: Sunday reminder ‘bout the MIP 🔥\n\n@gtrentjr https://t.co/HkGlRBgWcu @raptors @olgproline @NBACanada",
    "236": "@Sohey4562 @Raptors @pskills43 Booker who? 😂",
    "237": "@Raptors Barnes is the only rookie to rank top 5 in: points (third), rebounds (third), assists (fifth), minutes (first), steals (fourth) &amp; blocks (fourth). 6 rookies in history have finished top 5 in all categories: Ben Simmons, DeMarcus Cousins, LeBron, Vince Carter,Chris Webber",
    "238": "1998-99 Purple Toronto Raptors Tracy McGrady Mitchell &amp; Ness NBA Swingman Jersey https://t.co/ASOnIUP2GP eBay https://t.co/s02daakBvs",
    "239": "@sisiese @Raptors @pskills43 I will gladly eat humble pie 🥧",
    "240": "@Raptors @pskills43 LMAOOO https://t.co/OVc2TDiBtW",
    "241": "@sisiese @Raptors @pskills43 Let’s have this conversation at the end of the playoffs 😜",
    "242": "@JonesToBourne @Raptors @pskills43 Yes from being unvaccinated",
    "243": "@Raptors @pskills43 Especially from those children with no patience who wanted him to be traded",
    "244": "@Raptors @pskills43 Did u jus put a sad emoji face when Pascal stole the ball lmao💀, W admin😂",
    "245": "@YABarnes4ROTY @JonesToBourne @Raptors @pskills43 Own that CeltiKKKs fan",
    "246": "@Raptors @pskills43 Put her in the spin like siakam",
    "247": "@kri23sh @VinceCarterLast as a raptor fan from when he was drafted, he belongs in HOF for the simple fact he is key that the raps are still in Toronto \n\nQuite sure we would be the Vegas Raptors if Air Canada didn't happen",
    "248": "@dolfanshow Miami Dolphins\nVancouver Canucks\nToronto Blue Jays\nToronto Raptors\nInter Milan\nItaly national soccer team",
    "249": "@JonesToBourne @Raptors @pskills43 At what 💀",
    "250": "@Raptors @gtrentjr Been awesome to watch him play up to what he's capable of!",
    "251": "@Raptors @pskills43 Nets better sadly",
    "252": "@Raptors @pskills43 He wouldn't survive in the 1960s",
    "253": "@Raptors @pskills43 Wadmin",
    "254": "We'll collect formal apologies here at the end of the PascAll-NBA szn. \n\n@pskills43 https://t.co/dBjOrhj3yK",
    "255": "@Scooterg2015 @Nader_Hasan_law @SCC_eng @Raptors @BlueJays Further, see the commentary under Rule 5.6-1. \"A lawyer's responsibilities are greater than those of a private citizen. A lawyer should take care not to weaken or destroy public confidence in legal institutions or authorities by irresponsible allegations.\" 🤷",
    "256": "@RingTourJrue i dont think they will, they'd have to play the raptors which means jb, horford and time lord wont be able to play in toronto",
    "257": "F. Toca @Raptors. Hello darkness, my old friend. https://t.co/69eie4TK2p",
    "258": "@Scooterg2015 @Nader_Hasan_law @SCC_eng @Raptors @BlueJays It's a very reasoned, well-thought out decision that's firmly grounded in the law. No one is attempting to \"limit\" discussion, no need for hyperbole. Simply pointing out the lack of respect is unbecoming of someone who purports to be a principled professional.",
    "259": "Olha, com as notícias recentes, acho que teremos a seguinte ordem final no Leste:\n\n1. Miami Heat\n2. Boston Celtics\n3. Milwaukee Bucks\n4. Philadelphia 76ers\n5. Toronto Raptors\n6. Chicago Bulls\n7. Brooklyn Nets \n8. Cleveland Cavaliers\n9. Atlanta Hawks\n10. Charlotte Hornets",
    "260": "@Scooterg2015 @Nader_Hasan_law @SCC_eng @Raptors @BlueJays Reasoned critiquing is fine. Dismissing it as \"terrible\" simply because it doesn't comport with what you desire isn't. It displays a lack of respect.",
    "261": "@IcyScottieV2 @Raptors @NBACanada Watio",
    "262": "@Raptors @NBACanada W admin",
    "263": "What a time to be a Toronto sports fan. #LeafsForever #Raptors #BlueJays",
    "264": "The knock your socks off play of the day: Toronto raptors -5 let’s go! #GamblingTwitter #nba #sportsbettingpicks #freepicks https://t.co/sqoCJH01QW",
    "265": "@R0b_L0 @4for4phillymom The Toronto loss is acceptable the Detroit one is not . The Raptors have still balled out shorthanded or not .",
    "266": "@YT_Solo Toronto raptors",
    "267": "@Raptors_12345 @DerozanFan10 @TJB4MGB @TheNBACentral @Raptors Exactly! That’s why he doesn’t deserve to be here..he needs to be in a list with way better player than the other 3….😂😂😂",
    "268": "@NBACanada Love the concept, hate the spelling",
    "269": "logiciel ; Brooklyn Nets\n\nAtlanta Hawks\n\nToronto Raptors\n\nCharlotte Hornets\n\nOrlando Magic\n\nDetroit Pistons\n\nOklahoma City Thunder\n\nMinnesota Timberwolves\n\nPhoenix Suns\n\nDenver Nuggets\n\nUtah Jazz\n\nCleveland Cavaliers\n\nBoston Celtics\n\nGolden State Warriors\n\nDallas Mavericks",
    "270": "@Kxvaci @Raptors @ScottBarnes561 Cuz he’s so good?",
    "271": "@NevaCared_FN Yes sir.\nGlad he didn’t make me look like a fool.\nSolid player &amp; a person he turned out to be.\nThe Raptors &amp; Toronto is lucky to have him.",
    "272": "You know it's really spring when it's the last game of @Raptors regular season...getting hyped for #NBAPlayoffs and summer!! #wethenorth #Toronto \n\nPs: our sweet TO Fringe hats are on sale on our site: https://t.co/PixgyMlRqc https://t.co/zFKgwTSGvb",
    "273": "@TurboTaxCanada @Raptors @DALANOBANTON This would be amazing!",
    "274": "@JustEsBaraheni I thought best case scenario for Toronto would be a 6th place finish with a healthy squad. What they've done this year is nothing short of remarkable. This is the worst version of the Raptors. They are ascending. Amazing!",
    "275": "@Raptors cannot wait for the playoffs!",
    "276": "@BillfromBoynton @dolfanshow Dolphins \nLeafs \nRaptors \nBlue jays \nToronto FC\nPortugal national soccer team",
    "277": "@Raptors @gtrentjr He ain’t winning this award keep pushing siakam and Scottie agenda tho",
    "278": "@Raptors_12345 @_rparas @DerozanFan10 @TJB4MGB @TheNBACentral @Raptors Ok now you’re trippin 😂",
    "279": "Last game of the 2021-22 regular season until the playoffs!! Let’s Go #Toronto @Raptors #WeTheNorth 🍁🏀 🦖 #tangerinefanangle #LetsGoRaptors🏀 https://t.co/ZwEC4Yihec",
    "280": "@CoachGlaze13 Raptors not being good to you means absolutely nothing. Just take it from superstars in the East who absolutely hate playing Toronto. Superstars hate playing the raptors cuz you gotta bring your A game to win. If you don’t agree, then you just don’t follow ball enough.",
    "281": "@NevaCared_FN @Raptors @ScottBarnes561 All of the top 10 rookies look great can’t lie, that ROTY tho is between Barnes and Mobley but the class looks unstoppable",
    "282": "@NBA @Raptors Best player in the league",
    "283": "@_rparas @DerozanFan10 @TJB4MGB @TheNBACentral @Raptors As a Raptor fan I would not trade Siakam for the other 3 combined. Clearly you don’t watch Raptor games.",
    "284": "@NevaCared_FN @Raptors @ScottBarnes561 Appreciate it fr 🤝🤝🤝",
    "285": "@david_paran @Raptors @ScottBarnes561 It’s been TERRIFIC, his energy, physicality, and mentality are insanely good. He’s been a great fit on defense, offensively hes hitting a rookie wall which is what we all expected but the upside is very high we love him",
    "286": "In 2019 on my birthday April 18th  @Matt__Devlin gave my hometown #LadnerBC a shout-out off a 3pt shot @Raptors won the NBA Championship!! It would be epic to hear #KnocksItDownFromLadner in the playoffs!!🙏🏼 @Matt__Devlin @LeoRautins @20_awill @HelloooJack #WeTheNorth #LetsGoRaps https://t.co/Ys5aYHfNXP",
    "287": "@NevaCared_FN @PoolParty4Jesus @Raptors @ScottBarnes561 *Magic fans",
    "288": "@NevaCared_FN @PoolParty4Jesus @Raptors @ScottBarnes561 Going through these replies of when Scottie got drafted  are funny af\n\nThem Boys were saying \"thanks toronto\" and shit 😂",
    "289": "@Raptors @gtrentjr Dont care",
    "290": "Sunday reminder ‘bout the MIP 🔥\n\n@gtrentjr https://t.co/wVr9eoWcXA",
    "291": "@Raptors Scottie Barnes to the rescue 😂",
    "292": "@Jyreecefeasts @Raptors @vivekmjacob @TangerineHoops I bust in ya mom",
    "293": "@Jyreecefeasts @Raptors @vivekmjacob @TangerineHoops Busting a load in your mom lol rip bozo",
    "294": "@PoolParty4Jesus @Raptors @ScottBarnes561 update?",
    "295": "@jxremmy @Raptors @ScottBarnes561 How is that working out for you?",
    "296": "Our #RegentPark Neighbourhood Community Officers organized a basketball program for kids &amp; we are seeing potential @Raptors stars in the making in the Park! #CommunityMatters #TOgetherWeAreStronger ^hd https://t.co/7JeDuuXUmA",
    "297": "Absurd rumor links Toronto Raptors coach Nick Nurse to Lakers – NBA News https://t.co/6ebFomS7hq",
    "298": "Absurd rumor links Toronto Raptors coach Nick Nurse to Lakers – Lakers News https://t.co/9ALo6CIYG9",
    "299": "Leon's is giving YOU a chance to bring home a piece of Toronto Raptors franchise history! Enter to win a one-of-a-kind coffee table, made from a piece of the 25th Anniversary “95 Rewind Court”! Don’t miss your chance to enter! https://t.co/6uZrKQ9w9s",
    "300": "RT: Raptors: Winner\n\n📝 @vivekmjacob | @TangerineHoops \n\n➡️ https://t.co/0nTuol17v0 https://t.co/9i7JYfOvmo @raptors @olgproline @NBACanada",
    "301": "RT: Raptors: You + 11 friends can take over the Raptors practice court, win a jersey, and the entire @lottomax dream drop collection!\n\nEnter now for a chance to WIN!\n\n📲: https://t.co/z2QJJAEv0t https://t.co/uq5uqwMaCu @raptors @olgproline @NBACanada",
    "302": "@NotBlizzzo @Raptors @vivekmjacob @TangerineHoops Coming from a guy who's first pinned tweet says \"I have no friends.\" Means nothing.",
    "303": "@TurboTaxCanada @Raptors @DALANOBANTON Hi. I bought the Deluxe online version but now it shows I need a premier. Need your help to upgrade to premium please",
    "304": "@NotBlizzzo @Raptors @vivekmjacob @TangerineHoops easy ratio again",
    "305": "You could WIN a @Raptors prize pack &amp; signed @DalanoBanton ball. #TurboTaxBallDrop launches Apr 12. #TurboTaxBreak #TorontoBasketball https://t.co/ZBleBBbshp",
    "306": "@Raptors @vivekmjacob @TangerineHoops Scottie a bust",
    "307": "Winner\n\n📝 @vivekmjacob | @TangerineHoops \n\n➡️ https://t.co/UHMdUkhdDI https://t.co/9ONR55FuIi",
    "308": "@dolfanshow Miami Dolphins\nMontreal Canadiens\nToronto Blue Jays\nArsenal FC\nToronto Raptors\nToronto FC",
    "309": "@Raptors @lottomax Celtics betta I fear",
    "310": "You + 11 friends can take over the Raptors practice court, win a jersey, and the entire @lottomax dream drop collection!\n\nEnter now for a chance to WIN!\n\n📲: https://t.co/iXESYDd62V https://t.co/RQ2v45nGBw",
    "311": "@m_shantz Of course Winning!!!  From Masai and Bobby to coaches, to players @Raptors #WeTheNorth",
    "312": "@ESPNNBA @GetUpESPN @NBAonTNT @NBA cannot handle the @Raptors legit being a top 3 NBA franchise these days. Elite ownership, Elite mgmt, elite coaching, elite players, and all we do is win.",
    "313": "Five Things I Dig and Don’t Dig About the Toronto Raptors https://t.co/oD8gQUZe2s",
    "314": "@LakeShowSeason It's sad the Lakers can't compete with the Toronto fucking Raptors because of Jeanie",
    "315": "@stpatrickff Toronto Raptors!",
    "316": "@OSaumarezSmith Go see the @BlueJays or the @Raptors at the *SkyDome* (now the Rogers Centre™️). The world’s 1st stadium with a fully retractable roof ✨ https://t.co/6PTjWxU52d",
    "317": "@brraaanndon @TCOWrld Al said directly he’s vaxxed. We could honestly beat the raptors w out Jaylen (lost by 2 or something in OT in Toronto w backups) and it’s still unclear what his status is in all likelihood he’d be available. \n\nNo shot Raps beat Celtics in a series man",
    "318": "@DalanoDimesV2 Tbh if I was a raptors fans I would hike for Boston to lose. We can’t play Jb or Al in Toronto",
    "319": "@PizzaPizzaLtd @Raptors @Raptors_PR I’ve done all I can now… a response would be appreciated.",
    "320": "#TorontoSports gameday:\n\n⚽️ @TorontoFCII (0-1); 1PM\n#TFCLive\n\n⚾️ @BlueJays (2-0); 1:37PM\n#BlueJays #NextLevel\n\n🏒 @TorontoMarlies (33-26-4); 4PM\n#MarliesLive #ForeverStartsHere\n\n🏀 @Raptors (48-33); 7PM\n#Raptors #WeTheNorth #RTZ\n\n🏀 @Raptors905; 7PM\n#Raptors905  #RoadToTheSix",
    "321": "@dolfanshow Miami Dolphins, Toronto Raptors, Calgary Flames, Hamilton Tiger Cats. I don’t watch baseball or anything else so this is it",
    "322": "Looking for a bet in the Blue Jays game? 🧐\n\n@DeadPresPicks, who is 5-2-1 in Canadian bets this week, reveals his picks for the @BlueJays and @Raptors games today. ⤵️\n\n#MLBPicks #NBAPicks #WeTheNorth #NextLevel #LeafsForever | #BeatTheOdds👊\nhttps://t.co/SIpGcCFy0x",
    "323": "It's an amazing time to be a Toronto sports fan.  @MapleLeafs  Auston Matthews and Mitch Marner.  @Raptors Pascal Siakam and Scottie Barnes. @BlueJays  Vladdy and Bo.  A trio of dynamic duos, and a super supporting cast.",
    "324": "@MomentRanks @Bucks @cavs 3)  Starters of @Raptors and @MiamiHEAT might see some action tonight but expect less playing time. https://t.co/jsmsm9rDqH",
    "325": "@FortyEightMins @Raptors @nyknicks @nbatopshot @NBA TS: Dubs_1",
    "326": "Sixers fans afraid of the raptors are cowards. Yes, the raptors would be a real challenge and could potentially beat Philly. But shxt, they need to be challenged and if they can’t beat Toronto, they ain’t shxt anyway.",
    "327": "@gmbutts Sounds more like a party than a riot? Reminds me of downtown Toronto when raptors won.",
    "328": "Tonight’s the last @Raptors game of the regular season. Let’s get this W fellas! #Wethenorth #NBAEasternConference https://t.co/ZalMroBGNp",
    "329": "@TheNBACentral @Sid_Seixeiro @SeanDeveney “I would expect the lakers to get bent” - me \n\nLeave. Our. Fucking. Coaches. Name. Out. Your. Fuckin’. Mouth. #raptors @Raptors",
    "330": "Check out this listing I just added to my #Poshmark closet: Toronto Raptors Mitchell &amp; Ness Mens Pom Beanie Hat NBA 2013 Dinosaur logo. https://t.co/RR4JReGqhz #shopmycloset @poshmarkapp",
    "331": "Teams that will go far in the playoffs:\n\nMemphis Grizzlies \nBoston Celtics \nToronto Raptors \nDallas Mavericks",
    "332": "Delight yourself with sporty Mitchell &amp; Ness Toronto Raptors NBA Jacket offering eventful happenings @topsandbottoms\n\n#chicago #raptors #Nba #nbafinals #nbayoungboy #nbaplayoffs #nbabasketball #nbayoungboychallenge #nbaallstar #nbaallstars #nbaallstar2022 #nbaallstargame https://t.co/SqBTtXmhrc",
    "333": "🔮 NBA ELO Win Probabilities for April 10\n@Raptors 60.1% at @nyknicks\n@dallasmavs 80.5% vs @spurs\n@ATLHawks 78.3% at @HoustonRockets\n@memgrizz 58.1% vs @celtics\n https://t.co/DGx6qCE8kp",
    "334": "Heading into the season's last day, the #Raptors are matched with the #76ers in the first round.\n\nShould the #76ers win and the #Celtics lose their respective games today, Toronto would travel to Boston to open the first round.\n\nWho would you prefer to see the Raptors play?",
    "335": "Consensus Line Move:\n2022-04-10 Toronto Raptors at New York Knicks from 217.50 to 216.00\nUnder nervous?\n#NBA #sports #sabermetrics #blockchain",
    "336": "\"I’m doing what I love to do playing for my home country's team\"\n\nThe @Raptors close out the regular season against @nyknicks Sunday, almost a year to the day Montreal’s Khem Birch made his debut for Canada’s only NBA team @LindsayDunnTV https://t.co/NszxxLvoul",
    "337": "@Kmalikmusic @TerryFranconia It is but there's a legitimate chance we could lose to Toronto. It's not like we'd be a shoe in to beat the heat . I'd rather not lose in rd 1 in embarrassing fashion . I know Giannis is Giannis but as a team the Raptors are a worse matchup for us than the Bucs .",
    "338": "#KNICKS#CAPTURE#THE#RAPTORS#NEW#YORK#KNICKS#VS#TORONTO#RAPTORS https://t.co/jew3NXoj44 via @YouTube https://t.co/RNItM13trY",
    "339": "@G22XRP @ShxunVET_XRP @Ballies_NFT @keivo__ @cryptocom @NBA @hornets @Raptors @dallasmavs @nuggets @TheNBACentral @TheHoopCentral Message me",
    "340": "Celtics might not throw if they know an L guarantees a Raptors series where Brown can't play in Toronto.",
    "341": "#latestnews GAME #82 - TORONTO RAPTORS vs. NEW YORK KNICKS SUNDAY, APRIL 10, 2022 - 7P.M. (ET) - MSG TV: SPORTSNET - RADIO: FAN 590 - https://t.co/PShNideQXK (POST_EXCERPT}",
    "342": "@Raptors @pskills43 He's All NBA 😤",
    "343": "Nick Nurse got a life-time contract with the Toronto Raptors as long as Masai’s here https://t.co/Dwpi7oPZif",
    "344": "Gonna be a banger for both my teams! @OfficialRayLos &amp; #LeaveALegacyVentures are minority owners of the @nyknicks &amp; parent company #MSGSportsCorp as well as the #Toronto @Raptors 🏀 \nSee all #Business #Brand #RealEstate #Sports ownership stakes via 🔗 in bio. 🏖  #TheHamptons #NY https://t.co/RUXh3cwKCv",
    "345": "@LuckiIntern @DerozanFan10 @NBA @Raptors 1 ring in a 27 year existence is pretty good tbh",
    "346": "@gnoble79 You were a @sixers fan? Sorry, @Raptors are going to beat them in the first round of the playoffs! RoY @ScottBarnes561 over MVP @JoelEmbiid … #canadianoilmafia #WeTheNorth",
    "347": "@DickCage69 @Narutostan456 @StoolGreenie So you think our best chance for Celtics to get to NBA Finals is Brooklyn Nets with Kyrie / KD healthy and playing every game in Rd 1 instead of Toronto Raptors???",
    "348": "@rapsmuse_nba @pskills43 @Raptors might aswell add the time of day and court conditions while you’re at it",
    "349": "Pascal Siakam is rewriting the @Raptors record book and strengthening All-NBA case!\n\nhttps://t.co/6LDeWL8IJl",
    "350": "@scottiebetta @Raptors @TangerineHoops we cant they 905 have a playoff game",
    "351": "@Raptors @TangerineHoops Today we will discover if Scottie is the ROTY and if 905 advance to G-League finals, big day for a Raps fan!",
    "352": "Lets hope @sixers get #3 seed for playoffs... we cant afford to lose thybulle to the Raptors IN Toronto! \n#Sixers #NBAPlayoffs #Philly",
    "353": "@DerozanFan10 @TJB4MGB @TheNBACentral @Raptors Technically he’s right..siakams gotta go. he doesn’t deserve to be on this list….he deserves to be on a list with higher tier players…lol",
    "354": "@NBALatam Toronto Raptors 🙏❤️🦖",
    "355": "This can be further stated as Drake was caught the next day at a Toronto Raptors game being upset at whatever he was seeing on his phone, this just added further discussion and memes surrounding it like people joking he was texting Rhianna.",
    "356": "#Toronto #Raptors: Yerrrrr  New York City... \n \nhttps://t.co/BBFLLr1CTa\n \n#Basketball #NationalBasketballAssociation #NBA #NBAEasternConference #NBAEasternConferenceAtlanticDivision #Ontario #TorontoRaptors https://t.co/psOya6flgT",
    "357": "@Raptors_12345 @ZionESPN @Twowayh00ps Actually you should also look at earlier numbers without Mobley. Cavs record without Mobley is a losing record. Toronto still has a high ranked defense without Barnes. Mobley is very clearly a bigger impact.",
    "358": "@CaptLouElBammo @Nixon_Kid @DerozanFan10 @BraedenSteele02 @TheNBACentral flip a coin? boston is way above toronto, raptors needed ot and for the spin boy to drop 40 on 6 feet gleaguers to win against a team with one starter in the lineup. that’s a sweep, not a coin toss",
    "359": "The NBA Must Respect the Toronto Raptors https://t.co/QjALjIc9LW @Raptors @NBATVCanada @YahooSportsNBA @NBACanada  #torontoraptors",
    "360": "@dohbeedoo @DerozanFan10 @JLew1050 @ScottBarnes561 @Raptors Let Pascal and Scottie take 47 shots for thier All-NBA and ROTY cases.",
    "361": "@NBAPR @NBA Pretty simple for the @Raptors. If @memgrizz beat @celtics and @sixers get by @DetroitPistons, then Raptors play Boston in 1st round. Amy other combination they play Philly. \n\n7 to 10 combinations are wild though. 😂",
    "362": "Not sure why Nick Nurse would leave the Toronto Raptors which are arguably the best run franchise in the NBA for the dysfunctional Lakers unless he really wants to be in Space Jam 2. #WeTheNorth https://t.co/c01vMCgySC",
    "363": "@Dave_Augustyn @StJeromesUni @Raptors @NBA @Klow7 He's one of those duos that Raptors fans can respect. and DeMar DeRozan",
    "364": "@rzhallman @baydre @David68996 @waltermasterson I am Canadian indeed. We may not have crossed paths but if you are a @BlueJays or @Raptors, we are likely brothers.",
    "365": "DasHaus made a bet!\n\nEvent: Toronto Raptors vs New York Knicks #NBA\nBet: New York Knicks TO WIN +5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "366": "DasHaus made a bet!\n\nEvent: Toronto Raptors vs New York Knicks #NBA\nBet: Toronto Raptors TO WIN -5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "367": "Episode Drop!\n\nNick, Kyle and Irfan are back to breakdown #MLB Opening Weekend, Auston Matthews record setting week and the Toronto Raptors heading into the playoffs.  \n\nListen now:\nSoundCloud: https://t.co/v5Tpvdj54R\nYouTube: https://t.co/NU5bBJlOGF",
    "368": "📅 On this day in 2021, the @Raptors Gary Trent Jr. was 🔥:\n\n✅ 44 PTS\n✅ 17-19 FG\n✅ 7-9 3P\n\nTrent Jr. recorded the second-highest eFG% in a 40-point game in NBA history (107.9%).\n\nHe's one of four players in NBA history to make at least 10 2P without a miss in a 40-point game. https://t.co/BefhcVB1V3",
    "369": "Celebrating 1of 1 in franchise history @pskills43  deserve to be 2x #AllNBA  @raptors #WeTheNorth🇨🇦 https://t.co/VVduoRSiVL",
    "370": "@princethegoat10 @LuckiIntern @NBA @Raptors And when did the Pistons join the NBA?",
    "371": "Sixers gotta shake the Raptors. I do not believe they will move to 3rd seed. They gotta deal with Toronto and use the youth on their team when the lag in the second half begins",
    "372": "Poeltl 45 - 3/8 \n\n⬛🟨🟩⬛⬛⬛⬛⬛\n⬛⬛🟩🟩🟩🟩⬛⬛\n🟩🟩🟩🟩🟩🟩🟩🟩\n\n@KOT4Q I guessed Chicago Bulls/Toronto Raptors legend Matt Thomas for u",
    "373": "@Ballies_NFT Let me introduce you TEAM LIGHTNING!! Jerseys from @Lakers @spurs @Raptors\nI just can't wait longer for the #P2E game!!\n🏀💎🚀 Where are my Ballies Fam to follow and let's do 3x3 soon!!\n#NFT #Crofam #CRO #NBA #BalliesNFT #balliesfam https://t.co/Jg5iwjEdjZ",
    "374": "@LuckiIntern @DerozanFan10 @NBA @Raptors Raptors never had a stretch where they didn’t win a single playoff game in 14+ years just stop. 🤣🤣",
    "375": "NBA Basketball Game Betting Picks Simulator: 7:00 PM ET - Toronto Raptors vs. New York Knicks - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/Z3nLMo1ZLJ #nba #sportsbetting #freepicks #cappertek",
    "376": "More on this with the author himself on #Raptors Central at 630 pm ET. Will also keep you appraised of Sixers and Celtics goings-on, as we find out who Toronto gets in the first round https://t.co/zq3lqeHgsH",
    "377": "@eric_nehm Celtics will rather have Bulls than raptors. Anyone facing Toronto is a first round exit",
    "378": "Congrats! @pskills43 #Raptorstwitter @Raptors #NBA #NBA75 #NBAPlayoffs  🏀 https://t.co/1JrN1uzpYm",
    "379": "@Greg_D_Chambers @UndraftedRooks @rachmufc7 @Raptors can you just for once…🤐",
    "380": "Get tickets now and go see New York Knicks vs. Toronto Raptors at Madison Square Garden in Manhattan tonight at 7PM.\n\n@NYKnicks #Knicks #NewYorkCity\nhttps://t.co/KXMS31ZQIo",
    "381": "Leon's is giving YOU a chance to bring home a piece of Toronto Raptors franchise history! Enter to win a one-of-a-kind coffee table, made from a piece of the 25th Anniversary “95 Rewind Court”! Don’t miss your chance to enter! https://t.co/yaJiJf3AgI",
    "382": "@Raptors @TangerineHoops Yeeeeaaahhh!!!!!\nLet's shut up all of the haters out there. https://t.co/3pvz6plpHp",
    "383": "Have you entered to win a #TorontoRaptors coffee table, made from a piece of the '95 Rewind court? 👀 Contest is on now!! 🔥 Get your entries in here - &gt; https://t.co/fOAEohBO53\nOpen to Ontario residents only. https://t.co/QX6i4r0gFx",
    "384": "@Cresthaven6 @Raptors Hi Mr. Curtis i am Mehmet https://t.co/abxoVQHhBA",
    "385": "@Raptors @TangerineHoops 🏀 Good luck @Raptors 🏀\n8️⃣2️⃣ of 8️⃣2️⃣ | @TangerineHoops #Toronto #Raptors #NBA #NBA75 #WeTheNorth \nIt's almost the #NBAPlayoffs \n👏👏👏",
    "386": "@LuckiIntern @DerozanFan10 @NBA @Raptors You been poverty for 14 years",
    "387": "4.10.22\nAtlanta #Hawks vs Houston #Rockets\nBoston #Celtics vs Memphis #Grizzlies\nToronto #Raptors vs New York #Knicks\n\nToday's #NBAPredictions: https://t.co/hltNwEZVnD\nBet on NBA:  https://t.co/ArbfnziqHj\n#Draftkings #Fanduel #sportsbook #BetMGM #WilliamHillUS https://t.co/TGhTwU8lvB",
    "388": "@Twowayh00ps Whoever tells you that, show them the numbers.\nNumbers don't lie.\n#Raptorstwitter \n#WeTheNorth \n#torontoraptors https://t.co/oEaXnAbfVE",
    "389": "😍 Kyle Lowry Toronto Raptors 7 Jersey 😍 \nShop now 👉👉 https://t.co/apNKcMN99g\n.\n#sportsfans\n#sportsjerseys\n#sportswearstor\n#nflfans\n#nbafans\n#mlbfans\n#nhlfans https://t.co/qsPpXd2TPQ",
    "390": "New: Five Things I Dig and Don’t Dig About the Toronto Raptors https://t.co/L9Afv3UHdz",
    "391": "What a time to be a Toronto based Canadian sports fan:\n\n#Leafs have Matthews and Marner\n#Jays have Vladdy and Bo\n#Raptors have Scottie and Pascal\n\nAll 3 teams are contending teams at the same time, just wild. 🙏",
    "392": "Consensus Line Move:\n2022-04-10 Toronto Raptors at New York Knicks from 220.50 to 219.00\nUnder lollipops\n#NBA #CryptoHoops #datascience #cash",
    "393": "Toronto Raptors 1H -2.5 0.25u \nCeltics + Grizzlies under 227.5 0.25u \nNBA picks Sunday \n\nFinal day of the regular season. Small bets today until the playoffs ⏰🎯\n\nFor my early player props projections, watch the 📺 in the tweet below ⬇️ Thanks! https://t.co/wvlwUokyqy https://t.co/YN22dCCzP8",
    "394": "@TheNBACentral @SeanDeveney Toronto Raptors:\n\nhttps://t.co/joHKKrC6y2",
    "395": "Nick Nurse will be in Toronto for a long long time.\n\nIt would take some serious money to even entertain that, if I was him.\n\nRaptors have such a good program. Find hidden gems, develop them, use their g league as a place to experiment, all with very forward thinking management. https://t.co/NaXcqplBg4",
    "396": "TORONTO RAPTORS vs\nNEW YORK KNICKS, 7:00PM.",
    "397": "Tomorrow’s game between New York Knicks and Toronto Raptors will be epic!\n\nDon’t miss this chance to support and bet on your fave team. Which team do you think will make it to the playoffs? Place all your bets only at 747 Live. https://t.co/vGrqenL7zU",
    "398": "RAPTORS GAME PREVIEW:\n\n🏀: @Raptors vs. @nyknicks\n📺: Sportsnet One\n🕢: 7 PM/ET\n\nhttps://t.co/YAwTh5pB9r",
    "399": "@Kds_burner_ @KingdomOfJT_0 @Raptors Raptors a 1st round exit anyways as well 🤣🤣🤷🏾‍♂️",
    "400": "@Kds_burner_ @KingdomOfJT_0 @Raptors Your a nets fan. Stop 🤣💀",
    "401": "And the Raptors and Toronto FC. Evanka, don't forget them. https://t.co/sSYRfkv0zN",
    "402": "RT: Raptors: 82 of 82 \nLet’s finish strong! \n\nIt’s @TangerineHoops Raptors game day! https://t.co/G6fWg472OQ @raptors @olgproline @NBACanada",
    "403": "Ok yesterday saw Toronto raptors @FredVanVleet !!!",
    "404": "The NBA is the Toronto Raptors and a whole lot of teams who wish they were the Toronto Raptors, convince me otherwise https://t.co/muWoWzyJs9",
    "405": "@sixersmenace If we can’t get past the raptors we not winning a championship anyways. I’ll take my chances with Toronto if it means avoiding Bucks/Nets til the ECF.",
    "406": "Toronto is a top 3 Sport City in North America rn. Prove me wrong. Raptors on top, Toronto fc won just a couple years ago, leafs are top tier but need playoff wins, blue jays are gunna be top tier. We all really suffered for like 20+ years to see this happen",
    "407": "Leon's is giving YOU a chance to bring home a piece of Toronto Raptors franchise history! Enter to win a one-of-a-kind coffee table, made from a piece of the 25th Anniversary “95 Rewind Court”! Don’t miss your chance to enter! https://t.co/DbeCMymtvj",
    "408": "@TheNBACentral @SeanDeveney Nick Nurse ain’t leaving Toronto lmao. The raptors are on the way up and the lakers are on the way down.",
    "409": "@CobraKyleDOTeth @kenos89 @fyatlux This was in Jan 2006 if I recall correctly. I only follow Toronto raptor games, and he happened to be playing against them that night. Right after that everyone went crazy over basketball. Whenever they shoot they would say kobe. 🤷 I'm just like uh... Why?",
    "410": "@Raptors @TangerineHoops half life energizer bunny 'Pu' tangerine hoops watt's the count https://t.co/xnXeYiIXwV",
    "411": "Expectations were low, but \"my\" Toronto Raptors are the 5 seed. Nick Nurse can coach the ball!   Let's Go Raptors!!!",
    "412": "@SmithRaps you are so right.\nI'm sick of seeing a @Raptors staffer tease a little kid with a cheap, sponser-imprinted t-shirt for 2:45 during a timeout while ancient techno tracks I hated 20 years ago make my ears bleed.\n\nI read a book on my phone during time outs when I attend🎓 https://t.co/oQV17Jv2wt",
    "413": "@NekiasNBA Nekias will try to lead the Toronto Raptors for their second championship in franchise history",
    "414": "@Raptors @TangerineHoops Love you guys",
    "415": "@Raptors @TangerineHoops Is this The Next Magic Johnson?",
    "416": "@DalanoDimesV2 @Raptors @TangerineHoops it was a joke 🤡",
    "417": "@Raptors @TangerineHoops That is a few hours from now",
    "418": "JAYS - Vladdy, Bo &amp; TeOscar\n\nLEAFS - Matthews, Marner &amp; Tavares\n\nRAPTORS - Siakam, VanVleet &amp; Barnes\n\nnever been a better time to be a fan of all three Toronto teams.",
    "419": "@iamanascott @rachmufc7 @Raptors I think we all expected more from the Lakers.",
    "420": "Just sharing this propaganda \n\nLakers: Executive Links Toronto Raptors Head Coach Nick Nurse to LA - All Lakers | News, Rumors, Videos, Schedule, Roster, Salaries And More https://t.co/KgObSpu2Po",
    "421": "Here's the early injury report for tonight's Knicks vs. Raptors game -- which could just be a hint since Toronto is locked in 5th place. https://t.co/q150tHGrVa",
    "422": "Consensus Line Move:\n2022-04-10 Toronto Raptors at New York Knicks from 221.50 to 220.50\nUnder almost there\n#NBA #bettingpicks #pythonprogramming #invest",
    "423": "📅GAME DAY📅\n\n⚽️ @TorontoFCII at 1pm\n⚾️ @BlueJays at 1:37pm\n🏎️ #AGPLB at 3pm\n🏒 @TorontoMarlies at 4pm\n🏀 @Raptors905 at 7pm\n🏀 @Raptors at 7pm\n\n#TFCLive #NextLevel #INDYCAR #MarliesLive #RoadToTheSix #WeTheNorth https://t.co/WCg5uQcU0H",
    "424": "last game of the season @Raptors 🥲 give it to scottie",
    "425": "@UndraftedRooks @Raptors I’m surprised it was even that high 🤣",
    "426": "@Raptors @TangerineHoops Rest the starters",
    "427": "Leon's is giving YOU a chance to bring home a piece of Toronto Raptors franchise history! Enter to win a one-of-a-kind coffee table, made from a piece of the 25th Anniversary “95 Rewind Court”! Don’t miss your chance to enter! https://t.co/3UxN2GAfAR",
    "428": "@Raptors @TangerineHoops Feed him and let him have a 30 piece combo tonight. We don't need the NBA to keep the snub agenda going. Let the #ROTY @ScottBarnes561 EAT man.",
    "429": "@Raptors @TangerineHoops GO RAPS!!",
    "430": "@Raptors @TangerineHoops Let Scottie take 50 shots. No joke. He needs ROTY.",
    "431": "Pause and marvel 🇨🇦\n- The @Raptors are 5th in East and would also be 5th in the West 😳\n- Siakam is putting up All Nba Team numbers 😳\n- @ScottBarnes561 is putting up Rookie Of The Year numbers😳\n@pskills43\n#AllNbaTeam\n#ROTY\n#nba\n@timandfriends\n@NBACanada\n@NBATVCanada \n@NBAonTNT https://t.co/8twTdMb3Ww",
    "432": "@Raptors @TangerineHoops Can’t believe regular season is already over. Crazy ride! Off to the playoffs https://t.co/3pBJcFtVNg",
    "433": "@Raptors @TangerineHoops Brilliant and fun season!",
    "434": "@Raptors @TangerineHoops bring out the 905 please, we have bigger plans",
    "435": "Let’s finish this @Raptors https://t.co/7SKdXB3RXG",
    "436": "@Raptors @TangerineHoops The season finale",
    "437": "@Raptors @TangerineHoops Rest everyone except for Scottie and let him take 30 shots tonight",
    "438": "@RaptorsGotMe @Raptors Ima bookmark this",
    "439": "@Raptors @TangerineHoops Feed him from start to finish and put this race to bed with a 50 piece.",
    "440": "@Raptors @TangerineHoops No good reason to play anyone at all",
    "441": "@Raptors @TangerineHoops If Scottie drops 60 today can they just give him ROTY on the spot",
    "442": "82 of 82 \nLet’s finish strong! \n\nIt’s @TangerineHoops Raptors game day! https://t.co/TArKibP6an",
    "443": "@Pacers vs. @BrooklynNets \n@WashWizards vs. @hornets \n@Bucks vs. @cavs \n@ATLHawks vs. @HoustonRockets \n@celtics vs. @memgrizz \n@Raptors vs. @nyknicks \n@MiamiHEAT vs. @OrlandoMagic \n@DetroitPistons vs. @sixers \n@chicagobulls vs. @Timberwolves \n@spurs vs. @dallasmavs",
    "444": "@giddychapo @Raptors Thank you man 🙏",
    "445": "@Willdestdesigns @Raptors Amazing",
    "446": "@Braves Make Freddie Freeman wait 3 years to get his ring, just like the Toronto Raptors made Danny Green wait.",
    "447": "@ClutchPointsApp @npowell2404 @Raptors legend Norman Powell. \n🥰🇨🇦❤️🏀\n\n#WeTheNorth",
    "448": "@UndraftedRooks @rachmufc7 @Raptors bookies had us winning 🥲",
    "449": "@Lesley_NOPE I wondered what your reaction would be. I was getting heebie jeebies just looking at TV at packed Dome and ACC all weekend for Leafs, Raptors and Jays. \n\nIt's a great time to be a sports fan in Toronto, but I'm still not ready to get together with all of them.",
    "450": "Devereaux Sports: Globber INC -  Philadelphia Sixers vs Toronto Raptors Playoffs | Phillies Opening Weekend https://t.co/mFMlFZGPOD",
    "451": "@rachmufc7 @Raptors The bookies had us winning 36 games.",
    "452": "@Noahgilberto19 @enra6ed @Raptors @Drake Aged well",
    "453": "@michaelgrange @Raptors are very fortunate to have @pskills43 on the team.  Amazing talent.",
    "454": "@pskills43 @michaelgrange @Raptors Great article on the man fans call SpicyP.  Glad to have him on our team.  Never doubted you’d be better than ever.  Keep playing with your head up.  You have almost reached the potential that was there during your 1st 2 seasons. Lets Go Raptors",
    "455": "While the raptor and leads are pretty good as well.\nSuccess in Toronto sports ?????? https://t.co/8Wj7RAaDPc",
    "456": "Consensus Line Move:\n2022-04-10 Toronto Raptors at New York Knicks from 224.00 to 221.50\nUnder shhhh...\n#NBA #NBATwitter #python #entrepreneur",
    "457": "He guards ALL 5 POSITIONS! I had a plan to get him back to his place and the me Toronto Raptors man… https://t.co/hJSnsLMqLE",
    "458": "That is absolutely awesome @Raptors !!! https://t.co/RBcvW290Wd",
    "459": "@Raptors @pskills43 I voted for him everyday, he is an all-star, GO RAPS!!!",
    "460": "In S4:E10:\n\nWhat do Dr. J, John Elway, and Babe Ruth have in common? They were involved in the most lopsided trades in sports history.\n\nThe guys also cover the resurging @Raptors, the enigma that is Phil Kessel, and @macleod_alex gives his MLB predictions. https://t.co/nYiSGJeDac",
    "461": "@msinger @donnovanbennett Dear @Raptors Pascal has my vote. Now where do I get one of those toolboxes 🧰?",
    "462": "New Episode!\n\nWhat do Dr. J, John Elway, and Babe Ruth have in common? They were involved in the most lopsided trades in sports history.\n\nAlso covered: \n—the resurging @Raptors, the enigma that is Phil Kessel, and @macleod_alex gives his MLB predictions\n https://t.co/93jJE0uAhm",
    "463": "@jelynchjr @asalciunas975 @975TheFanatic Please make that make sense where u want Toronto n 1st RD without thybulle for at least 3 games...Wouldn't mind seeing Miami n Conference semis if they could get by Raptors..I say get 3rd seed play bulls n opening RD @jelynchjr @asalciunas975 @975TheFanatic",
    "464": "@siakamandlowry1 @Raptors No worries😎👌🏾",
    "465": "🔴LIVE ~ Toronto Raptors vs. New York Knicks - NBA League Pass\n🔴Live Here➠ https://t.co/pxAZo2ymdA\n📅 : Sunday, April 10, 2022\n⏰ : 7:00 PM",
    "466": "🔴LIVE ~ Toronto Raptors vs. New York Knicks - NBA League 2022\n🔴Live Now➠ https://t.co/AX7iOwte4L\n📅 : Sunday, April 10, 2022\n⏰ : 7:00 PM",
    "467": "Happy @Raptors game day!! Final game of the regular season vs the Knicks. ❤🏀 #WeTheNorth https://t.co/VRp18aZ4Qe",
    "468": "@Naked__Dave @Raptors I have family in Toronto! I have no other connections to any other teams in the NBA and love basketball so it made sense ✌🏼😃",
    "469": "The @mapleleafs and @Raptors have both now clinched playoff spots. @bluejays start the season 2-0. Good time to be a Toronto sports fan! https://t.co/Qoq5uNMWfL",
    "470": "@JohnKincade @975JKShow We beat the Toronto Raptors,Maple Leafs,Blue Jays and Drake in 6 😤 with or without Matisse. FACTS",
    "471": "@rachmufc7 @Raptors What made you support the raptors? Not often you see many UK basketball fans",
    "472": "Final @Raptors game of the regular season tonight vs Knicks. Overall thoughts of the regular season is all positive. To come out at the 5 seed when everyone (even me at times) wrote us off at the start of the season is amazing. \n\nImmensely proud♥️ #WeTheNorth",
    "473": "Man, can’t wait to get my ass back to Canada to watch the @Raptors in the same timezone",
    "474": "@dogmanp_sparks @HubRaptors @Raptors @ScottBarnes561 He has to make one of the teams",
    "475": "@Raptors @ScottBarnes561 That's what I am talking about\n\nIf you don't speak for them who will? Definitely not hockey media. They try to convince everyone the Leafs are more popular than The Raptors inside Toronto proper.\n\nTrust me, its not like that",
    "476": "Talk about a great Sunday Toronto sports fans!\n@BlueJays at 1:07EST &amp; @Raptors at 7:00EST 🇨🇦⚾️&amp;🏀💪🏼\n#NextLevel #WeTheNorth",
    "477": "@thatcelticfan1 @BraedenSteele02 @TheNBACentral @Raptors used to have the tendency to play down to their opponents’ level so I’m not surprised.  Our last game vs HOU was another example.  Still a W at the end of the day.",
    "478": "New York Knicks - Toronto Raptors İddaa Tahmini 11.04.22\nhttps://t.co/eyLti3L1A3",
    "479": "Kudos to @steven_lebron and @william_lou for regularly bringing @Raptors and other NBA players on their show. Here’s a challenge to @RealKyper and @jtbourne to bring more current #Leafs rather than just Kyper’s contemporaries on their show.",
    "480": "@umar_h80 @JLew1050 I definitely want the bulls over the raptors. I think we're the favorites in both but Toronto is a tough team",
    "481": "NBA Basketball Game Betting Picks Simulator: 7:00 PM ET - Toronto Raptors vs. New York Knicks - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/Z3nLMo1ZLJ #nba #sportsbetting #freepicks #cappertek",
    "482": "@TCM08698426 @Raptors @DeMar_DeRozan @Klow7 I think they listened",
    "483": "FREE #livestream here👉https://t.co/2c6Ltz5wlw 😉\n——\nApr.10, Sun.\n🏀#NBA ‼️\n1.Brooklyn Nets Vs Indiana Pacers\n2.Houston Rockets Vs Atlanta Hawks\n3.Charlotte Hornets Vs Washington Wizards\n4.Cleveland Cavaliers Vs Milwaukee Bucks\n5. New York Knicks Vs Toronto Raptors",
    "484": "Drake Spotted Wearing What Appears To Be NOCTA x Nike Zoom Flight 95 Collaboration Last night when Drake attended the Toronto Raptors game, he was spotted wearing what appears to be a NOCTA x Nike Zoom Flight 95 collaboration. The... - https://t.co/ecv5g3C2n5 #spiffy https://t.co/SlNxoEirMc",
    "485": "🏀NBA🏀 #NBA \n🏀Saison régulière🏀\n\nLos Angeles Clippers - Oklahoma City Thunder\nMemphis Grizzlies - Boston Celtics\nMinnesota Timberwolves - Chicago Bulls\nNew Orleans Pelicans- Golden State Warriors\nNew York Knicks - Toronto Raptors\nOrlando Magic - Miami Heat",
    "486": "@LouisZatzman And they thought @Raptors were in rebuild",
    "487": "@SandyDShipley01 @Raptors 23 years since I was last at a raptors game. Hope you enjoyed it",
    "488": "@NBA Its the @Raptors  shocking the world again #2022theraptors",
    "489": "Check out 2018-19 Panini Prizm Gary Trent Jr. Rookie #71 Toronto Raptors RC Trailblazers https://t.co/InS4HPFx1H #eBay via @eBay",
    "490": "Hilarious 🤣\nAnd I'm going to make a run at OG for my rec league 🙄\nNurse's happy w/#Raptors, one of #NBA's highest paid, &amp; just signed 4 year contract extension! 😉\n#WeTheNorth\n\n#Lakers Exec Links Toronto Raptors Head Coach Nick Nurse to LA https://t.co/kHY9si2Q0v via @@eeulau",
    "491": "Check out OG Anunoby 2021-22 Panini Sticker &amp; Card Collection NBA Card #68 Toronto Raptors https://t.co/jKPUb9Y6uC #eBay via @eBay",
    "492": "Check out 2021-22 Panini NBA Sticker &amp; Card Collection #62 Fred VanVleet TORONTO RAPTORS https://t.co/ZuGZ1nzRLO #eBay via @eBay",
    "493": "@raptorsrepublic @RaptorsDigest @Raptors @Imman_Adan @dbhoops_ @PascalFanClub\n#DocNurse from now on",
    "494": "Rumors: Lakers to possibly engage with Raptors’ Nick Nurse for team’s head coaching helm #LosAngelesLakers #NickNurse #TorontoRaptors https://t.co/kGk6XeeQzq",
    "495": "@Sohey4562 @Raptors @pskills43 The sun's can't guard him so I understand why you so mad. You had a Lame ass take anyway",
    "496": "Blue jays World Series?\nRaptors NBA finals? \nMaple leafs Stanley cup?\n\nIS THIS THE YEAR OF TORONTO SPORTS?? https://t.co/gTRS2Z9wOC",
    "497": "@Raptors @ScottBarnes561 Admin been sipping on that Henny https://t.co/8m2LSNEW7m",
    "498": "@DalanoDimesV2 @dark_769_ @Raptors You guys both support the same team",
    "499": "@NBA @Raptors Three @Raptors highlights - wow!  #WeTheNorth",
    "500": "@NickManohar12 @WalderSports @Raptors @pskills43 Only one will make All-NBA 1st team, that’s obvious because they’re both centers.\n\nYou’re obviously missing my point too. I’m saying he’s a Top-15 player this year.\n\nYou just keep saying he’s not a Top-15 player overall.",
    "501": "Like don't forget how the raptors made their run in Ramadhan, we got score updates in between taraweeh and I firmly believe that the Toronto Ummahs collective duas made the rub possible 😌✨",
    "502": "Shout out to the man on the grid rocking the throw back @Raptors Vince Carter Jersey at the Australia F1",
    "503": "@bryanjj0nes @WalderSports @Raptors @pskills43 Your missing my point obviously they’ll fall under the center category but they are literally 1 and 2 in mvp and only 1 might make all nba first team. Siakam sadly isn’t a top 15 player regardless of making an all nba or not",
    "504": "Sterling = Toronto Raptors",
    "505": "@Raptors @ScottBarnes561 Winner nights",
    "506": "@Raptors will have to wait until Sunday to learn their playoff opponent Photo by @john_sok #nba #playoffs https://t.co/rYwXGRyljn",
    "507": "Playoff Probabilities: Where the @Raptors Stand and Who They May Face Photo by @john_sok #nba #playoffs https://t.co/qxlgkaC4dh",
    "508": "@Boostedsn95x @dreinin11 @Raptors @pskills43 To the starters but the reserve is coaches decision",
    "509": "@TheHoopCentral Raptors wont allow this @Raptors",
    "510": "@Raptors @ScottBarnes561 Mobley still clears lmao",
    "511": "@BillSimmons @HousefromDC @NathanCHubbard Celtics are the worst case scenario for the Raptors. No team plays Toronto better. 👀",
    "512": "It's amazing how many people still refer to Masai Ujiri as the GM of the Toronto Raptors - a title he hasn't held since 2017",
    "513": "@LuckiIntern @DerozanFan10 @NBA @Raptors Pistons haven’t won a playoff game since 2008 pipe down",
    "514": "Been a good couple days for Toronto fans. Leafs and Raptors make the playoffs, Jays start the season 2-0. Looking good",
    "515": "For the @sixers to beat the @Raptors , it got to be bully ball 🏀 starting with the projected @NBA #MVP @JoelEmbiid . Moreover if @JHarden13 really steps up , he can be the #Raptors by himself.",
    "516": "Let’s Go Raptors. 🏀 \n\nGo Leafs Go. 🏒 \n\nLet’s Go Blue Jays.  ⚾️ \n\n#TORONTO\n#SCARBOROUGH\n\n*Where French Immersion is ALWAYS Cool.",
    "517": "@TJB4MGB @TheNBACentral You clearly haven’t been watching the @Raptors.  Absolutely obvious.  Pascal’s been in an absolute tear and he has done countless of clutch plays for us.  He’s on the verge of superstardom and he’s in the AllNBA convo.  Raps are 5th in the East, which exceeded expectations.",
    "518": "@Raptors Why are you affiliated with @PizzaPizzaLtd?  Do you not realize their scams are ruining your reputation as well?",
    "519": "@PizzaPizzaLtd @cbgoode_caspar @Raptors @Raptors_PR How many times a week do we read this?  Why is this a perpetual issue for you?",
    "520": "@NBA @Raptors They have been some fire plays from the Raptors all season that never got a look. Precious Achiuwa has 2 posterizers game.",
    "521": "@BinniePCQC @Nader_Hasan_law @SCC_eng @Raptors @BlueJays I don't know how whether he's right or wrong in his opinion but it's entirely appropriate within the Code of Professional Conduct (and otherwise in law) that he be able to critique it. What's not in keeping with those ideals is to attempt to limit that discussion.",
    "522": "@RaptorsNationCP In 68 games... Raptors 1 of 1 @pskills43 AllNBA @Raptors #WeTheNorth",
    "523": "@Raptors @ScottBarnes561 Delete this, it's confusing.",
    "524": "@JeeYunTV @superfan_nav @rinkstweets @Raptors Go Raptors.🏀😊",
    "525": "💥 saturday night 💥 @gtrentjr @GTJGIRLS @Raptors https://t.co/ZYq7Tfzo7z",
    "526": "Why tf are the Toronto Raptors on this? https://t.co/mAEm37ncAX",
    "527": "Hey @BlueJays, I have an idea. Why don't you include the @Raptors airhorn for every home run or grand slam that they hit at @RogersCentre?",
    "528": "All Toronto's good sports vibes could be crushed with first round match ups with the Celtics and the Bruins. I think our Locals match poorly with the Boston teams. #TORsports #Toronto #mapleleafs #raptors",
    "529": "In the last two nights, I’ve witnessed the Raptors overcome a 24-point deficit to beat the Rockets, the Blue Jays erase a 7-0 Rangers lead to win it (and Toronto beat Texas again today) and the Leafs beat the Habs. Yes, that really happened. 😃",
    "530": "@Raptors  lets go!!! https://t.co/5KOVA0KQlk",
    "531": "@MALinYYC @GodlLotus @Raptors @pskills43 def over middleton and i guess allen but garland was much deserved",
    "532": "Gotta say that's a mean lookin hot rod @WilliamByron \n\nApparently sponsored by the @Raptors 🤔\n😉\n#BlueEmu400 #NASCAR https://t.co/2VL0HBrhUL",
    "533": "Maillot Toronto Raptors Pascal Siakam #43 Rouge Icon https://t.co/vgwwFlZDcM",
    "534": "@BounceBackOn1 @TheJurassicPack @TheArchiveClub Love the JP and my Toronto Raptors! For sure one of the best TS communities there is #WeTheNorth",
    "535": "@Raptors ✅ Playoffs @MapleLeafs ✅Playoffs! Toronto it’s a very exciting 2022 so far! 🙌🏼🙌🏼🍁",
    "536": "@PatCSportsFan Toronto sports fans have suffered a lot throughout the years but we're finally getting rewarded. This is the first time in history that the Leafs, Raptors and Blue Jays are all good and exciting to watch at the same time. #LeafsForever #WeTheNorth #NextLevel",
    "537": "Since Wednesday:\n\nToronto Maple Leafs: 2/2 wins.\nToronto Raptors: 2/2 wins.\nToronto Blue Jays: 2/2 wins.\nToronto FC: Draw. \n\n@ManUtd… Cheers lads.",
    "538": "@msinger You know Ethical basketball  Pascal AllNBA @pskills43 @Raptors #WeTheNorth",
    "539": "Leafs are rolling, Blue Jays are rolling and the Raptors are rolling. Fun times ahead for Toronto sports fans",
    "540": "Great meeting! @2Deep_Sidhu one of the best fans in Toronto! #NextLevel #LeafsForever #Raptors The 6ix 🇨🇦🔥💯💥 https://t.co/oKrFKbMOi8",
    "541": "@Raptors @ScottBarnes561 No question‼️ https://t.co/hQkDpzss9f",
    "542": "Just stop it Toronto Raptors are going to the playoffs this year without Kawhi that’s like me saying bam only game because of jimmy Butler https://t.co/zmXHfSHoEt",
    "543": "Hey @TSN_Sports you can take the @NBA and @Raptors commercials and shove them up your ass!  Couldn't care less about it!",
    "544": "Lakers: Executive Links Toronto Raptors Head Coach Nick Nurse to LA\n⁦@JeanieBuss⁩ #Mark Jackson will win  https://t.co/bIdjcVRjpj",
    "545": "Am I...optimistic? About Toronto sports? \nThe Leafs are in the playoffs. \nThe Raptors are in the playoffs. \nThe Jays are focused on being World Series contenders. \nSo yes, yes I am. An unusual and odd feeling,  but very good.",
    "546": "@BlueJays @MapleLeafs Imagine if the Leafs, Raptors and Blue Jays all win a championship this year. That would be the greatest year in Toronto sports history.",
    "547": "@BlueJays @MapleLeafs Jays and raptors run Toronto not the maple laughs",
    "548": "Tuesday, April 5th: X - Toronto #Raptors \n\nFriday, April 8th: #BlueJays come back from 0-7 to win Season Opener.\n\nSaturday, April 9th: X - Toronto Maple #Leafs.\n\nI'd say Toronto Sports looking pretty damn good right now.\n\nKEEP THE GOOD TIMES ROLLIN'!\n\n#LeafsForever #NextLevel",
    "549": "@HCH2487 @Thomas_Ember @GorTweets @Raptors @ScottBarnes561 Cade has a higher usage rate and plays guard so he’s got better offensive production. He wouldn’t be the number 1 scoring option on a good team like Toronto and he doesn’t contribute to the team in the myriad of ways Scottie can",
    "550": "Yes!!!!  What a time to be a Toronto fan!  Raptors and Leafs are play off bound! https://t.co/nlphtGbGTq",
    "551": "Donate to support a great cause and get a chance to win a Spicy P autographed card and other great prizes!  Hoping @pskills43 can help out with a RT to help spread the word! #WeTheNorth @Raptors @LeoRautins @Matt__Devlin @HelloooJack https://t.co/qJGT1XNxjl",
    "552": "@NMwarriors1989 @ThisDirt @BleacherReport @Braves @BRWalkoff @BravesOnBally @Raptors no just the only one of us with common sense apparently😂",
    "553": "@jebronsburner @Raptors @MapleLeafs What the fuck makes you think that",
    "554": "Rooting for the Memphis Grizzlies and Toronto Raptors this #NBAPlayoffs",
    "555": "Boston Celtics: #Raptors must wait until the final day to learn who they'll face in the first round - Toronto Star https://t.co/GtwYTUBGhG",
    "556": "@Raptors Am just happy to see Thad looking happy to be playing basketball 🏀. I wish the whole squad nothing but the best of luck in the playoffs. Don't know how far they'll go but I think we'll be pleasantly surprised. #Raptors #WeTheNorth",
    "557": "Lakers: Executive Links Toronto Raptors Head Coach Nick Nurse to LA – NBA News https://t.co/72rIgslIW7",
    "558": "@NonCasualFann @DrGuru_ If Boston loses tomorrow and Philly wins, Boston is down to the 4 seed and gets a matchup with the Raptors in which they won't have Brown or Horford in Toronto (unvaxxed) and Timelord (injured).  It's really a no-win situation for the Celtics from here.",
    "559": "@SLAMonline @Raptors Head top! 🏀",
    "560": "@bryanjj0nes @WalderSports @Raptors @pskills43 You make all nba based on position if it was purely off of the top 15 players like siakam and randle wouldn’t get the award. Literally Jokic or Embiid could be second team all nba Bcus of the positions. Siakam is not a top 15 player and prolly won’t ever be.",
    "561": "@n1fpr @MapleLeafs @Raptors Technically Leafs own Matthews because they’re paying him not Perry",
    "562": "Lakers: Executive Links Toronto Raptors Head Coach Nick Nurse to LA – Lakers News https://t.co/FNmbG54xUf",
    "563": "@NickManohar12 @WalderSports @Raptors @pskills43 Yes, this season he is. That’s exactly what that means.\n\nI don’t think you’re understanding what awards mean.\n\nThey’re for this season. He’s a Top-15 player this season and Julius Randle was last season.",
    "564": "I believe the Raptors have what it takes to beat either the Celtics or the Sixers plus they get some sort of an advantage with key players from both teams not being allowed in Toronto because of vaccine mandates. https://t.co/lMZZepjGjl",
    "565": "@NBA @Raptors I see why rih rih couldn’t stand him 🤣",
    "566": "@Raptors The best looking guys in the NBA...Go Raps Go!! All so stylist!",
    "567": "Lakers: Executive Links Toronto Raptors Head Coach Nick Nurse to LA\n\nhttps://t.co/KfTlH8bWI7",
    "568": "@bryanjj0nes @WalderSports @Raptors @pskills43 But siakam isn’t better than any of them therefore he’s not a top 15 player. Julius randle was all nba last year was he a top 15 player 😂😂",
    "569": "@NickManohar12 @WalderSports @Raptors @pskills43 Dame, Beal, AD, PG and Kyrie will not be All-NBA. \n\nNone of them have played enough games.\n\nThat alone puts Pascal in and he actually deserves it over Jimmy as well.",
    "570": "@SheaSerrano Yeah, but the @Raptors still won. #WeTheNorth",
    "571": "@ayyeebraham @Raptors It's a fair trade. We get a win for the standings and you guys get a higher chance for the #1 pick.",
    "572": "@TheAthletic @Raptors @BlueJays @TheAthleticNBA @TheAthleticMLB Toronto is Texas daddy... Boston is Toronto's daddy",
    "573": "Raptors recent Champs and still competitive.\nAuston &amp; Mitch at the height of their powers (so far).\nThe Jays loaded with talent. \n\nIf I wasn’t a lifelong fan of Toronto sports teams, I might believe we’re on the brink of a Golden Era.",
    "574": "@MapleLeafs @Raptors What does this mean?",
    "575": "@MapleLeafs @Raptors JT my captain!",
    "576": "Thank you very much! @superfan_nav and @Raptors https://t.co/n8kPTMTfSR",
    "577": "@MapleLeafs @Raptors THATS MY CAPTAIN",
    "578": "Former @Raptors @Bruno_Caboclo #MVP &amp; #LucaBebeNogueira leads @SPFCBasquetebol 98 of Brazil over @biguabasquet 84 of Uruguay in the @BCLAmericas 2022 championship. Great inaugural showing by @CEBLeague @ED_Stingers going 3 &amp; 3. https://t.co/flawOlzn3y",
    "579": "@ripxac @ThisDirt @BleacherReport @Braves @BRWalkoff @BravesOnBally @Raptors I mean 3 rings. Not mad but I wouldnt compare Braves to Raptors.",
    "580": "@ThisDirt @BleacherReport @Braves @BRWalkoff @BravesOnBally @Raptors I am an Oakland A’s fan and they suck ass.",
    "581": "@ThisDirt @BleacherReport @Braves @BRWalkoff @BravesOnBally @Raptors I am from Oakland, why would I be a rams fan???? I been a warriors fan for over 25 years. Everyone said KD was the best player on the warriors and he didnt play. They would have swept the raptors if he played.",
    "582": "Johnny in the post? 👀 @Raptors #LeafsForever https://t.co/TNNTwKePBC",
    "583": "@aburner_acc @o4sky1 @MapleLeafs @Raptors Same I was like wtf is wrong with my tv or eyes",
    "584": "The @Raptors, @MapleLeafs &amp; @BlueJays are extremely exciting teams to watch right now.",
    "585": "@o4sky1 @MapleLeafs @Raptors Lmao I thought it was my TV",
    "586": "RT: Raptors: @MapleLeafs 👀 @raptors @olgproline @NBACanada",
    "587": "@MapleLeafs @Raptors Does anyone see this yellow circle that keeps popping up on the broadcast?",
    "588": "@MapleLeafs @Raptors i dare y'all to score another goal to go up 4-1. 🤣",
    "589": "@MapleLeafs @Raptors # hash mark shot lol",
    "590": "@tavmarnythews @MapleLeafs @Raptors LETS GOOOOOOO",
    "591": "@NMwarriors1989 @ThisDirt @BleacherReport @Braves @BRWalkoff @BravesOnBally @Raptors you sound sad",
    "592": "@MapleLeafs @Raptors JOHNNY TORONTO",
    "593": "Johnny in the post? 👀 @Raptors https://t.co/cRyI5EWFh3",
    "594": "@Raptors_Noahh @NotBlizzzo @Raptors @ScottBarnes561 Should start charging.",
    "595": "@ThisDirt @BleacherReport @Braves @BRWalkoff @BravesOnBally @Raptors The one where KD played 5 minutes and Klay got hurt in game 6?",
    "596": "@TheNBACentral Ahem… @gtrentjr @Raptors",
    "597": "@playcampls If course, I couldn't believe when it was canceled, least they ended with Skeets and Tas Team, the Toronto Raptors winning the NBA Finals",
    "598": "@Sukhmanjit20 @ScottBarnes561 @Raptors Nice job…what app did you use?",
    "599": "@Raptors @MapleLeafs ratio",
    "600": "Toronto sports teams that have won games since Wednesday:\n\nMaple Leafs: ✅\nRaptors: ✅\nBlue Jays: ✅\nTFC: 👀\n\n#TFCLive | #RSLvTOR",
    "601": "Man, Toronto is really riding a wave with great Sports right now.  @Raptors , @BlueJays and @MapleLeafs are legit Championship contenders.  As a Montealer, I'm just jealous.  #NBA #MLB #NHL",
    "602": "@jebronsburner @Raptors @MapleLeafs Ratio",
    "603": "@B_Tran @Akhanna95 @PizzaPizzaLtd @Raptors I would file a complaint with the competition bureau. This company does stuff like this all the time. It won’t change until we all file complaints! https://t.co/YCKPKwjJ91",
    "604": "@Raptors @MapleLeafs Scenes when Siakam, Matthews, and Vladdy win MVP.",
    "605": "Kyle Lowry Says Toronto is 'A Place I'll Always Call Home' After Heat Beat Raptors https://t.co/ZxGrSn9n4j",
    "606": "@Raptors @MapleLeafs @AM34 🤝@pskills43 the groats",
    "607": "How spoiled are Toronto sports fans right now… @MapleLeafs @Raptors @BlueJays",
    "608": "@Raptors @MapleLeafs No one likes hockey",
    "609": "@Raptors @MapleLeafs Auston Matthews Should walk away with all major individual awards. \n\nSiakam all nba. \n\nScottie rookie of the year. \n\nWhat a time to be alive!",
    "610": "@Raptors @MapleLeafs hockey isnt a sport lil bro",
    "611": "@Raptors @MapleLeafs Toronto sports teams are thriving rn",
    "612": "Toronto raptors Black Lives Matter in metaverse play gta5 I have used gra5 vjj in ca metaverse on play station https://t.co/IJs3iKcYtI",
    "613": "🍁 Canadians kicking some TEXARSE ass \n\nThe past 48 hours Toronto Jays beat the Rangers, Raptors beat the Rockets and Leafs bounced the Stars. \n\nY'all can take that 'War on women shit' and stuff it!! https://t.co/wnxL6FWi5e",
    "614": "Emma, very graciously when she barely knew me, went out of her way to give me incredible writing advice that lifted and saved me and also she very kindly explained the Toronto Raptors to me even though I’m sure it’s annoying to watch the game with someone who asks “who’s that?”",
    "615": "@Raptors @ScottBarnes561 Nah it was just some guy named Steve. https://t.co/UlwPRbUZrF",
    "616": "What a time for Toronto fans. Jays have a Pennant team.  Leafs and Raptors going to the playoffs.   As well as Canadas Men Soccer team going to the #WorldCup2022 https://t.co/D6ECWFm2Xj",
    "617": "@CenturyOG @Raptors @CanadianTire Although since phila won it wont make a big difference.. resting for 10 days + the last game is not that good of an idea. They need to play at least 10-15. We dont want them to be rusty.",
    "618": "@OpenGymAnunoby @NBA but heres the thing… triggered or not, still true.still facts.. we need #ethical ball 😌🤷🏾‍♀️ and its clearly coming by way of the trendsetting Toronto Raptors and its fanbase😬",
    "619": "Toronto fandom is weird.\n\nRaptors fans are 🔥\nJays fans are 😒\nLeafs fans are 😴\n\nIt had to be said.",
    "620": "@MaFavRaps @KendrickPerkins is delusional. When has Nick Nurse ever shown his hands!!!  My guy has more defensive schemes than a conman has scams.  @Raptors twisted them up and arguably their two best defenders werent even on the floor. Raptors in 5. #wethenorth",
    "621": "@Raptors @ScottBarnes561 We love when you get spicy!!",
    "622": "@Raptors Gary will drop 50pts tom",
    "623": "RT: Raptors: Remember that time the NBA put out their ROTY rankings 😂 https://t.co/GRCwFXpdDn @raptors @olgproline @NBACanada",
    "624": "@LeafsNeedGod Crazy time to be a Toronto sports fan. Leafs, Jays, Raptors killing it all at the same time",
    "625": "@Raptors @ScottBarnes561 remember that time ROTY rimmed out a point on a missed finger roll when he couldve just DUNKED it ? \n\nME neither... \n#NotSHortOfDUNKSthisKidAndTHATsWhatsGOnnaWinANotherChampwich   \n\n#ALwaysDUNKtoENSUREthePOINTS\n\ncc @pskills43 @FredVanVleet @chrisboucher @Khem_Birch @yungsmoove21 https://t.co/vAc5OAxaDb",
    "626": "@Raptors Sheeesh i see you precious",
    "627": "@Raptors @ScottBarnes561 W caption",
    "628": "@Raptors @ScottBarnes561 Push Fred for All-Defense",
    "629": "@Raptors @ScottBarnes561 Own them Raptors admin",
    "630": "@Raptors @ScottBarnes561 The disrespect is stupid. Ok another level of stupidity. Barnes is a clear cut ROTY winner.",
    "631": "@Raptors @ScottBarnes561 Own em wdmin",
    "632": "@NotBlizzzo @Raptors @ScottBarnes561 Tom Brady owns Mahomes",
    "633": "@NotBlizzzo @Raptors @ScottBarnes561 Mafraud a bust",
    "634": "@NotBlizzzo @Raptors @ScottBarnes561 Rent free",
    "635": "@Raptors @ScottBarnes561 GO GET THEM Twitter Person",
    "636": "@NotBlizzzo @Raptors @ScottBarnes561 Ratio",
    "637": "@NotBlizzzo @Raptors @ScottBarnes561 Why you got notis on lmao",
    "638": "@NotBlizzzo @Raptors @ScottBarnes561 bust deez nuts",
    "639": "@Raptors @ScottBarnes561 Wadmin per usual",
    "640": "@MaxeyBetta @Raptors @ScottBarnes561 I remember and care",
    "641": "@Raptors @ScottBarnes561 Green lol",
    "642": "@Raptors @ScottBarnes561 They really put that lob merchant first",
    "643": "@Raptors @ScottBarnes561 Follow back admin",
    "644": "Remember that time the NBA put out their ROTY rankings 😂 https://t.co/uk2Opnoq3L",
    "645": "@SLAMonline @Raptors This duo (Pascal and Scottie) is going to be a problem for years to come.  #wethenorth @raptors #ROTY #spicyp",
    "646": "Repost for grammar purposes*\n\nI'd be cool falling to the #4 seed if we knew that Jaylen Brown would be available to play in Toronto. But, I don't know if we want to take that risk, since we likely won't know unless we do match up with the Raptors.",
    "647": "@Raptors @gtrentjr we need GTJ to go off in the playoffs 💪🏽",
    "648": "The @Raptors have locked up the 5th spot. 4th is either the @celtics or @sixers - anything other than a Sixers win AND Celtics loss tomorrow means the Raptors will head to Philly in Round One of the #NBAPlayoffs2022",
    "649": "BIT BUY Thanks! My mom in Long Term Care receiving her gift from Bit Buy after I tweeted a video of her watching @Klow7 commercial during the @Raptors and Heat game as we welcomed home one of her favorite basketball players! https://t.co/4EbrhqTGXQ"
}