{
    "0": "#latestnews Would baseball’s team name equivalent to the Brooklyn Nets be the Brooklyn Bases? - https://t.co/BobqsYA8kL (POST_EXCERPT}",
    "1": "@xyqar @BrooklynNets Didn’t make this account to chase followers since that’s all you care abt. Literally joined last month",
    "2": "Golden States warriors vs Brooklyn Nets let’s go Steph Curry",
    "3": "@CHRISPL79266739 @BrooklynNets damn bro your 1 follower loved that tweet!",
    "4": "Golden State Warriors vs Brooklyn Nets. It's about to go down. #DubNation",
    "5": "Brooklyn Nets at the Golden State Warriors Sidecast. \n\n#Warriors \n#WarriorsGround \n#Nets \n\nhttps://t.co/yZCanxUtoK https://t.co/XyE1IQZ6Qt",
    "6": "Let's Go #GoldenState! #Warriors vs #Brooklyn #Nets Game. #MichelleHOPEWalker Youtube:MichelleHOPEWalkerSpeaks https://t.co/YCgtnHdGap https://t.co/31sysUgbov @HOPE_Speaks #NBA #Basketball 1/29/2022",
    "7": "I put all my life savings on the brooklyn nets winning this game",
    "8": "Brooklyn Nets have some sorry ass Stories",
    "9": "I'm watching BROOKLYN NETS vs GOLDEN STATE WARRIORS tonight.🏀 This game is going to be good. \nStephen Curry dropping 35 tonight. I'll go ALL IN for 40. \n#NBA https://t.co/QPTFgzsHGI",
    "10": "@lancem69 @77_greg_77 @BrooklynNets *better than curry\n\nHere I fixed it",
    "11": "Andrew Wiggins workout/threes, misses free throws at Golden State Warriors pregame b4 Brooklyn Nets https://t.co/XcOgpvbOdm",
    "12": "@dtonen1gga @BrooklynNets Afraid to lose against curry so ruled out better option",
    "13": "ESPNs agenda with the Brooklyn Nets is simply pathetic",
    "14": "Golden State Warriors vs Brooklyn Nets - NBA Live Stream\nWatch Here : https://t.co/VEhmtyBh4G\n\nVenue: Chase Center (San Francisco)\n#Warriors #Nets #Live #NBA https://t.co/nwVIYoKbDD",
    "15": "@NBA @BrooklynNets boa got mfs shook still from 2016 🏆",
    "16": "@MarkGre84321817 @BrooklynNets We didn't use that strategy",
    "17": "James Harden Won't Play for Nets vs. Warriors Because of Hand Injury #Brooklyn #Nets #NBA https://t.co/ACyd41m6ZC",
    "18": "the brooklyn nets are the most dc villain team",
    "19": "this league is RIGGED they not be wanting a win for Brooklyn Nets i’m so mad",
    "20": "@xyqar @BrooklynNets 6th seed incoming",
    "21": "@BrooklynNets @YESNetwork Warriors by 20",
    "22": "Get the popcorn ready because major things are set to happen. It's the @BrooklynNets vs the @warriors today at #NBA75! 🍿😎\n\nYou don't wanna miss one bit of this match. Watch it with NBA League Pass with Globe: https://t.co/4nYNBsfchU #GlobeNBA #BestTimeWithGlobe",
    "23": "NBA Saturday Night : Brooklyn Nets vs. Golden State Warriors 8:30 on ABC https://t.co/gDeR3NmIVd",
    "24": "@JuliaMagicNets @BrooklynNets They won? https://t.co/IXimB8lf64",
    "25": "Exclusive NBA Saturday Primetime on ABC Series Presented by Meta Quest Returns as the Brooklyn Nets Visit the Golden State Warriors on January 29 https://t.co/87dTCyGSxG https://t.co/fF508e8fzp",
    "26": "I’m starting to hate this Brooklyn Nets team. It’s always something",
    "27": "Pretty lame that #kyrieirving is allowed to play tonight in @ChaseCenter when all the @warriors and the #DubNation have to be vaxxed &amp; boosted. @BrooklynNets don’t let him on the court, why should we?",
    "28": "The @BrooklynNets starting Irving, Mills, Bembry, Edwards, Claxton on Saturday. #BrooklynGrit #NBA",
    "29": "@towers_deanbob @untuckedkai @NBA @BrooklynNets Well no You’re wrong because he’s not making the shot, you’d be correct if you said “take”",
    "30": "4 men contributing their take on the Golden State Warriors vs. Brooklyn Nets game. I need them to mute one of them. 😒#cantdohim",
    "31": "🏀 Golden State Warriors vs Brooklyn Nets\n🏆 NBA\n🗓 29/ene.\n⏰ 22:30\n📺 ESPN 3",
    "32": "Golden State warriors vs Brooklyn Nets  Live Stream NBA Streaming link free \n\n..\n.\nWatch on 👉 [https://t.co/8272roLiFR]\n\n#NBA",
    "33": "Brooklyn Nets @ Golden State Warriors Film Thread (01/29/2022) -&gt;",
    "34": "@JeriTsaiNets @BrooklynNets 😩😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂 smoothie bussin",
    "35": "@HattMuh @ShamsCharania Look I said, if I’m Brooklyn I am not looking at the record. I’m looking for the bench to get extra reps because there is nothing you can do about injuries anyways and eventually the big 3 will comeback. If the bench can keep getting better, the nets will be scary.",
    "36": "@BrooklynNets NO HARDEN BRO GOD DAMN IT",
    "37": "@BrooklynNets Hand strain… cmon harden 😭",
    "38": "NBA Top 3 Brooklyn Nets vs. Golden State Warriors MUST BET NBA Betting Picks Tonight | 1/29/22 ~ @TopherSquints \nhttps://t.co/cUJz1khLdX",
    "39": "James Harden (hand) out vs. Warriors #JamesHarden #NBA\n #BrooklynNets #BrooklynGrit  https://t.co/ZIdFb1rXa0",
    "40": "\"[Charania] Free agent Iman Shumpert is finalizing a deal with the Brooklyn Nets, sources …\"\n\nhttps://t.co/9U2TGKfaIY\n\n[via r/nba Jan 30, 2021 #NBA]",
    "41": "@DubsNets @BrooklynNets So who you gonna have guarding Curry? Coz Cam is not keeping up with him",
    "42": "@BrooklynNets We losing by 50",
    "43": "@BrooklynNets Nets fans have such bad luck…every time we look forward to something we get bad news. https://t.co/yiaeYpbouD",
    "44": "Which PG is the most talented❓#NBA  #NBA75 #NBATwitter #NBATwitterLive #BrooklynNets #Brooklyn #WarriorsGround #DubNation",
    "45": "@DubsNets @BrooklynNets So you want no scoring when the bench comes in and you want to make our defense worse with playing three players in kai, mills and cam at the same time who aren’t bad defenders bad aren’t good ones",
    "46": "Nets and Warriors tonight. I was looking forward to this game and damn; if the don’t want to play Nets sit Harden because of a BS hand injury. If your scared say your scared! The @BrooklynNets Suck! #Joke",
    "47": "@BrooklynNets This lineup is being put out there for an ABC primetime game, this is a war crime",
    "48": "29-19 with uncertainty time can’t wait till my brothers start to care about each other lol 😂 #BrooklynNets  @NBAonABC",
    "49": "@unvariedd @BrooklynNets Damn",
    "50": "@DubsNets @BrooklynNets Bembry tonight https://t.co/PJxCHq1oGL",
    "51": "@BrooklynNets what the fuck",
    "52": "Golden State Warriors (-9.5) vs. Brooklyn Nets! #NetsWorld #DubNation #NBA #NBATwitter #NBA75",
    "53": "NBA Live Scores: Halftime score: DAL leading IND at home, 72-60Game open! Follow to get updates as GSW hosts BKN.  @warriors @BrooklynNets #NBA",
    "54": "@BrooklynNets Let's go Beard 👁️",
    "55": "@BrooklynNets Play hard",
    "56": "@Curry2021mvpszn @DepressedNets @NBA @BrooklynNets It’s the same with NY. Kyrie can’t play there but visiting unvaccinated players can",
    "57": "Brooklyn Nets Starting Lineup 1/29\n PG: Kyrie Irving\n SG: Patty Mills\n SF: DeAndre' Bembry\n PF: Kessler Edwards\n C: Nicolas Claxton\nhttps://t.co/o75oZ8vnE8",
    "58": "@JuliaMagicNets @BrooklynNets Against the warriors? https://t.co/lANqQv8yQG",
    "59": "Been a crap day ... but those all star pregame broadcast talents on @NBAonABC @RealMikeWilbon @stephenasmith @Espngreeny @JalenRose are great to see... sight 4 sore eyes...  @BrooklynNets vs @warriors",
    "60": "@NBA @BrooklynNets Kyrie vs Steph TUH NIGHT!!! 😤🔥 Still my favorite Matchup in the League!!! @HoopsNBrews @famouslos32 @maxisnicee it's UP!!! 🍿🙌🏾",
    "61": "@BrooklynNets Blow this “scary hours” shit up ASAP the chemistry clearly isn’t there hand strain? Son just don’t want to play with kyrie tonight more red flags trade ASAP",
    "62": "@BrooklynNets This is a disgrace",
    "63": "@77_greg_77 @BrooklynNets Scared of Curry",
    "64": "@BrooklynNets No harden sadly but hopefully kyrie pulls it through",
    "65": "Brooklyn Nets vs Golden State Warriors \n#NBA #NBA75 #NBAnaESPN",
    "66": "@hardensgotnext @BrooklynNets Scared of Curry",
    "67": "@BrooklynNets omg he ducking smoke",
    "68": "Another great Saturday night game!! Brooklyn Nets vs Golden State Warriors Jan 29, 2022 Game Summary | https://t.co/qMJqSyLaf1 https://t.co/JMoRHApVIS",
    "69": "@NBA @BrooklynNets Should be a good game",
    "70": "@BrooklynNets Harden is out we don’t care",
    "71": "@BrooklynNets Cam should start when Harden/Kyrie is out stop starting Bembry ffs",
    "72": "Three Bensons walk into a…Warriors-Nets game. I’m Brooklyn-born.\nWhose my team? https://t.co/NACz4YkCG3",
    "73": "@BrooklynNets Well I mean Durant and Harden played alone with them and won, Kyrie’s time to step up.",
    "74": "@BrooklynNets If Kyrie has a masterclass Imma talk so much shit plsss",
    "75": "@BrooklynNets Scary hours ⏳: https://t.co/7BNIFMqZIz",
    "76": "@BrooklynNets Kyrie dropping 60 on Lurry tonight",
    "77": "@BrooklynNets The warriors are finished",
    "78": "@KingTechnical08 @BrooklynNets Even kd agree curry is god😂 https://t.co/m3e8hAWpFa",
    "79": "@BrooklynNets We just wanna scary hours back again\nThat's all pls🥺😔",
    "80": "@BrooklynNets I nearly fainted",
    "81": "@BrooklynNets Where is harden ?",
    "82": "Tonight's starting lineup for the Brooklyn Nets:  Irving, Mills, Bembry, Edwards, Claxton https://t.co/bVWH4AMCA2",
    "83": "@BrooklynNets we’re screwed https://t.co/SVUgHcmgu1",
    "84": "Brooklyn Nets escalado! #NetsWorld https://t.co/n3xehMUqRd",
    "85": "@BrooklynNets Where is Jevon?",
    "86": "@BrooklynNets Just what Adam Silver had in mind when he put this game in prime time",
    "87": "@BrooklynNets Nice starters we can do it",
    "88": "Brooklyn Nets vs GSW in the next 30 min 👀 on @Official_SABC1",
    "89": "@BrooklynNets Good lineup",
    "90": "@BrooklynNets take off that emoji",
    "91": "Brooklyn Nets Vs Golden State Warriors | Live Reactions And Play By Play https://t.co/lHGXx3F9sp via @YouTube",
    "92": "@dtonen1gga @BrooklynNets Ruled out",
    "93": "@ShamsCharania I know the casual fan is probably freaking out about how the nets being 5th in the east with more injuries is worrisome. But winning the games up until the all star break shouldn’t be their priority. If I’m Brooklyn, that’s not my focus. Get the second unit some reps in.",
    "94": "@BrooklynNets pain.",
    "95": "@BrooklynNets good luck 🙌",
    "96": "🚨 Line Change 🚨\n\nBrooklyn Nets @ Golden State Warriors\nSat 8:40 PM EST\n\nFrom:\nGS -9.0 -115\n\nTo:\nGS -10.5 -105",
    "97": "@BrooklynNets Yep perfect A+",
    "98": "@BrooklynNets Incoming L 😹😹😹",
    "99": "@BrooklynNets Guess ill tune in",
    "100": "@BrooklynNets Where’s harden",
    "101": "@BrooklynNets CLAX LETS GO",
    "102": "@BrooklynNets omg kyrie hiiii",
    "103": "@BrooklynNets play harden i don’t care",
    "104": "Starters against the Warriors💪 https://t.co/M6xZCTtYVq",
    "105": "@LordGlizzythe3 @hargoat121 @vicecity4life @Kevin43503829 @BrooklynNets But Harden is not lauded as the goat shooter 🤷🏽 he can all he wants it's not a problem",
    "106": "NBA Live Thread: Brooklyn Nets at Golden State Warriors, 8:30 EST https://t.co/SFvDRPIeEJ https://t.co/dNQS14FRIy",
    "107": "Klay Thompson is coming off a season-high 23 points, as he warms up for tonight's action against the Brooklyn Nets!\n\n(Music by: @UnitedMasters) https://t.co/eHviNuQnPW",
    "108": "@LV13MVP @lancem69 @BrooklynNets You own him",
    "109": "@ItBegins2012 @BrooklynNets Hes gone bro. His hand is fine.",
    "110": "A star-studded match featuring many of the most famous names in the NBA today, it’s time for the Brooklyn Nets to go against the Golden State Warriors once again. This Sunday, 9:30 AM https://t.co/fYQhsQ0yvB",
    "111": "@marlonplayzalot @BrooklynNets But bro Warriors cant loose this one man . Curry klay poole wiggs boutta have a field day",
    "112": "My question still remains…\n\nWHO are the Brooklyn Nets??? No one knows",
    "113": "@KingTechnical08 @cyanshsharma007 @BrooklynNets Thats why he always gets knocked out the playoffs by curgoat",
    "114": "@BrooklynNets is he serious rn",
    "115": "@cyanshsharma007 @BrooklynNets he owns CurShit https://t.co/v2E4X1WDaJ",
    "116": "@NBA @BrooklynNets Curry's father is putting in work",
    "117": "@BrooklynNets Nah im not watching this bruh",
    "118": "@lancem69 @BrooklynNets You scared of social interactions with females",
    "119": "@BrooklynNets Come on! Injuries keep destroying this team",
    "120": "@BrooklynNets What a mess!This is the first time I can watch a live about JH with Kyrie this season. And now we can only enjoy Kyrie’s personal performance and they can hardly win.",
    "121": "@BrooklynNets If Philly wins and Nets lose they're all the way down to the 6th spot",
    "122": "@LordGlizzythe3 @hargoat121 @vicecity4life @Kevin43503829 @BrooklynNets Goat sh...ter,yeah https://t.co/WaGgOI57PC",
    "123": "@BrooklynNets Terrified of Klay Thompson's return. Has PTSD",
    "124": "@BrooklynNets Good job Sean marks performance team",
    "125": "@BrooklynNets Harden not playing we might as well post pone",
    "126": "@BrooklynNets Harden rly scared of getting cooked by Curry again",
    "127": "@Tony994445271 @lancem69 @BrooklynNets Wait you mean kd and harden not enough to beat curry 😂 you need kyrie,harden,kd to beat curry😂😂",
    "128": "Brooklyn Nets scout sitting next to me when I asked him about biggest difference in Mavs Jalen Brunson's game this year: \n\n\"Just being aggressive, Jason Kidd has given him confidence, and he doesn't have the handcuffs on him like with the other guy (Carlisle the other guy)\" #MFFL",
    "129": "@ShamsCharania Nets don’t care about their seeding at all. Road games are with Kyrie so winning Games 1 &amp; 2 away from Brooklyn will give them great momentum in a playoff series.",
    "130": "@Shewantalex_ @MarkGre84321817 @BrooklynNets Players of the home team have to be vaccinated not away",
    "131": "@marlonplayzalot @BrooklynNets Hes a lefty lol",
    "132": "@BrooklynNets Pain",
    "133": "@ActionNetworkHQ @BrooklynNets he a lefty make his ass play tonight…",
    "134": "Losing James Harden for this game is clearly a huge hit. The Nets (17-6 on the road) have yet to drop consecutive road games this season. \n\nTough ask for Brooklyn to win this one.",
    "135": "@BrooklynNets I think he already saw highlights of last match that's why he don't wants to play 😂 https://t.co/coYxpCOWxi",
    "136": "@BrooklynNets pain https://t.co/qr5hhkbQQA",
    "137": "@BrooklynNets Kyrie for 55+ or an L",
    "138": "@BrooklynNets why? I know he can play and want to play. nash should shut his mouth",
    "139": "@BrooklynNets kyrie 60 pts",
    "140": "@BrooklynNets Fuck kyrie go for 60!",
    "141": "The Brooklyn Nets have ruled James Harden out for tonight's game vs. the Warriors due to a right hand strain.\n\nHis 2nd absence in a row and 7th overall this season.",
    "142": "@BrooklynNets crying rn",
    "143": "Andrew Wiggins workout/threes, misses free throws at Golden State Warriors pregame b4 Brooklyn Nets\n\nhttps://t.co/Qm0NGLTltt",
    "144": "Brooklyn ruling out Harden vs the Warriors. Strap yourself in folks for the Kyrie Irving show. #Nets",
    "145": "Update to the Status Report for tonight’s game at Golden State:\n\nHarden (right hand strain) - OUT",
    "146": "@stxph30 @BrooklynNets Ffs you lot are winning https://t.co/FAwWINHXdE",
    "147": "Brooklyn Nets say James Harden will miss tonight's game vs the Warriors. #BKNvsGSW",
    "148": "@BrooklynNets @aldridge_12 @KesslerEdwards @Patty_Mills @KyrieIrving Patty usually always wins best dressed",
    "149": "@ShamsCharania just say you’re trading him already @BrooklynNets",
    "150": "Nets' James Harden has strained hand, is a game-time decision Saturday #Brooklyn #Nets #NBA https://t.co/NRfOwK8NOh",
    "151": "@NBA @BrooklynNets Thought you need to get vaxxed",
    "152": "NBA Top 3 Brooklyn Nets vs. Golden State Warriors MUST BET NBA Betting Picks Tonight | 1/29/22 ~ @TopherSquints \nhttps://t.co/OgDpNWyXeb",
    "153": "@LordGlizzythe3 @vicecity4life @Kevin43503829 @BrooklynNets He’s shooting 41%",
    "154": "Jason Kidd Game-Worn Warm-Ups 2002-03 Fleer Flair New Jersey Nets HOF # CK-JK #NBA #NJNets #BKNets #TheHobby #Brooklyn https://t.co/1NrMTUY7if @eBay",
    "155": "Jalen Brunson is getting paid man, a Brooklyn Nets scout sitting to my right, said \"yep\" he's getting paid...#MFFL",
    "156": "@TejS40 @lknowhoops @NBA @BrooklynNets He's more outspoken against the vaccine than Kyrie though. Well, since you didn't know Justin Holiday is not vaccinated and he's against it, Bradley Beal is not vaccinated either",
    "157": "@LordGlizzythe3 @vicecity4life @Kevin43503829 @BrooklynNets Steph is shooting 41%",
    "158": "@NBA @SteveNash @StephenCurry30 @warriors @BrooklynNets Y'all act like Nash playing",
    "159": "@GSWRevengeTour @NBA @BrooklynNets why you didn’t said anything when Justin Holiday played against your team ?",
    "160": "🏀 Golden State Warriors - Brooklyn Nets\n⏰ 04.30\n📺 S Sport\n🎙️ @ugurozan &amp; @inanozdemir",
    "161": "TONIGHT ||||| The #NBA Is Live On @953WDAE\n\n@BrooklynNets v @warriors \n\nCoverage Begins:  8:00pm\n\n📻 95.3FM | 620AM\n📱https://t.co/ofcFkfgRfX On @iHeartRadio App or @ESPNRadio\n🔊 \"Play WDAE On IHeartRadio\" (Smart Speakers) https://t.co/C30MN3n5IU",
    "162": "@NBA @warriors @BrooklynNets 530 Start on the west coast should b 630... Do Better @ABCNetwork",
    "163": "@NBA @BrooklynNets @warriors Is LEBRON playing, if not, NONE!!!",
    "164": "1/29 Free Pick🚨\nNBA\nBrooklyn Nets +9.5\n\n#sportsbetting #handicapper #GamblingTwitter https://t.co/LInKeTP7UM",
    "165": "Brooklyn Nets James Harden is questionable for tonight’s game vs the Golden State Warriors. #BKNvsGSW https://t.co/967DOKbthA",
    "166": "@GSWRevengeTour @NBA @BrooklynNets Don't be scared to the point that you want the law to be violated! He's a visiting player just like Holiday,the unvaxed that lead the Pacers to a win in the same arena this very week. Good news for you though: Kyrie is not yet back to his regular game shape, he's still ramping up",
    "167": "@NBA @BrooklynNets Kyrie, please don't land on the ball boys foot bcoz your delusional crying Nets fans will blame the poor ball boy..😆",
    "168": "@BrooklynNets @aldridge_12 @KesslerEdwards @Patty_Mills @KyrieIrving Medical team used to be so good apparently this team became a joke from top to bottom..",
    "169": "Here we go…\nSeen this movie before #NBATwitterLive #NBATwitter #BrooklynNets https://t.co/pEUrBvhSjQ",
    "170": "How is Kyrie playing at chase center? Aren't unvaccinated people not allowed to play there? @BrooklynNets @ChaseCenter https://t.co/E7cBLs7tdS",
    "171": "@nvmpq @cazziblanco @NBA @BrooklynNets Biden lied, and I’m making that known",
    "172": "@NBA @BrooklynNets Just shows that GSW fans have no clue about mandates since justin holiday played there unvaccinated 🤦🏾‍♂️",
    "173": "Get this man out of Brooklyn immediately. Only missed a handful of games his entire career and as soon as he goes to The Nets he’s getting injuries left and right……. https://t.co/RcizYTr26F",
    "174": "James Harden Delivers an Assist to Haiti | Brooklyn Nets https://t.co/728alf4qmF",
    "175": "@nvmpq @cazziblanco @NBA @BrooklynNets I’m not using him as a source, I’m using it to trash him and his administration",
    "176": "Brooklyn Nets’ player top trade chip for the deadline is Nic Claxton. BKN’s big3 is a cheat code. Trade market? Things get tricky. A deal involving Claxton would make a big difference. They can trade Bruce Brown or Paul Milsa but Claxton has the bigger return #NBA #BrooklynNets",
    "177": "@BrooklynNets @aldridge_12 @KesslerEdwards @Patty_Mills @KyrieIrving Could you work en defense bro",
    "178": "@dyt_beg @BrooklynNets Trading",
    "179": "@DepressedNets @NBA @BrooklynNets The rule in SF is also weird. If you live in SF you need to get vaccinated to play but if you are a visitor you only need a negative test. So that’s weird",
    "180": "(Sports Predictions on 29 Jan 2022, 19:00)\n\nbasketball NBA 2022-01-29 20:00:00\nMemphis Grizzlies – Washington Wizards – Win: 1 (1.44)\n\nbasketball NBA 2022-01-29 20:30:00\nGolden State Warriors – Brooklyn Nets – Win: 1 (1.4)\n\nsoccer Greek Super League 2 20… https://t.co/IjrZgT2E0J",
    "181": "@AhmedAa0204467 @BrooklynNets @aldridge_12 @KesslerEdwards @Patty_Mills @KyrieIrving Traded",
    "182": "@xyqar @KingTechnical08 @Envy_Gxbriel @BrooklynNets @aldridge_12 @KesslerEdwards @Patty_Mills @KyrieIrving He’s traded",
    "183": "@Envy_Gxbriel @BrooklynNets @aldridge_12 @KesslerEdwards @Patty_Mills @KyrieIrving He’s traded",
    "184": "@BrooklynNets Just break up the “scary hours Shit” dudes about to be in the play in at this point",
    "185": "@BrooklynNets @aldridge_12 @KesslerEdwards @Patty_Mills @KyrieIrving Play harden I'm begging",
    "186": "@Superbowlfifty2 @BrooklynNets @KyrieIrving 50 points 🤔",
    "187": "@BrooklynNets @aldridge_12 @KesslerEdwards @Patty_Mills @KyrieIrving Is harden playing",
    "188": "@BrooklynNets he was jacking himself off too hard huh",
    "189": "The @warriors are 7-1 SU in their last eight home games 😎\n\n@Gamble_IQ has you covered with his prediction and top bets to place as they battle the @BrooklynNets 🔗 https://t.co/8wZit4ee8U https://t.co/YwKNq66kRX",
    "190": "@BrooklynNets when will joes Harris come back, the nigga got a left ankle sprain 3 months ago, lebron went through that shit and shrugged it off",
    "191": "#NBA\n\n🗑️#Nets vs #Warriors -8\n🏀 Total 227½\n\nThe total has gone OVER in 10 of Brooklyn's last 15 games against an opponent in the Pacific Division division.\n\nThe total has gone UNDER in 8 of Golden State's last 10 games against Brooklyn.\n\nBet here: https://t.co/ECPrLfNSnt https://t.co/0idP2IrzqT",
    "192": "#NBA 🏀\n\n#Nets vs #Warriors -8\n🗑️ O/U 227½\n\nBrooklyn are 4-12 ATS in their last 16 games.\nGolden State are 7-2 ATS in their last 9 games played on a Saturday when playing at home.\n\nWho covers?\n\nBet now: https://t.co/xCxoQKJpa0 https://t.co/BJGR7u1v9K",
    "193": "@BrooklynNative7 @NBA @BrooklynNets Knicks run new york. nets are only relevant inside barclays center. Only thing people care about outside it is the traffic on atlantic ave.",
    "194": "@stxph30 @BrooklynNets Kessler Edwards will lock him up",
    "195": "@BrooklynNative7 @NBA @BrooklynNets we are. Harden is leaving yall in the offseason, kyrie is a part time player and yall are gonna run KD into the ground",
    "196": "@LordGlizzythe3 @vicecity4life @Kevin43503829 @BrooklynNets Cringe",
    "197": "@stephdillrides @NBA @BrooklynNets Commerce clause of the constitution. Interstate commerce is protected. Kyrie can enter and play basketball as an employee of the Brooklyn Nets, but could not enter for example as a customer to watch a game (until Feb when the mandate changes to allow Covid neg people to enter).",
    "198": "@BrooklynNets @aldridge_12 @KesslerEdwards @Patty_Mills @KyrieIrving Lamarcus fit is valid",
    "199": "@SuckingOnCock @BrooklynNets @aldridge_12 @KesslerEdwards @Patty_Mills @KyrieIrving Nope but i hope it’s a good game",
    "200": "Brooklyn Nets vs. Golden State Warriors 🍿 #NBA75 \n\n📺: ABC | 8:30 PM ET \n\nSteph Curry, Wilt Chamberlain, Rick Barry and the Golden State Warriors https://t.co/o5guCvt6os",
    "201": "@brooklynsbeat @BrooklynNets lack of transparency with injuries is approaching @nhl levels of vagueness",
    "202": "@BrooklynNets @aldridge_12 @KesslerEdwards @Patty_Mills @KyrieIrving Yall losing sadly",
    "203": "@KingTechnical08 @Envy_Gxbriel @BrooklynNets @aldridge_12 @KesslerEdwards @Patty_Mills @KyrieIrving yea i just saw mb",
    "204": "NBA Top 3 Brooklyn Nets vs. Golden State Warriors MUST BET NBA Betting Picks Tonight | 1/29/22 ~ @TopherSquints \nhttps://t.co/Kkhd9YA4m9",
    "205": "@xyqar @Envy_Gxbriel @BrooklynNets @aldridge_12 @KesslerEdwards @Patty_Mills @KyrieIrving hes questionable",
    "206": "@SamDobbyKim1 @NBA @BrooklynNets @LondonBreed @ChaseCenter scared of kyrie?🤣🤣🤣",
    "207": "@Envy_Gxbriel @BrooklynNets @aldridge_12 @KesslerEdwards @Patty_Mills @KyrieIrving he’s cleared he wasn’t on injury report",
    "208": "@BrooklynNets @aldridge_12 @KesslerEdwards @Patty_Mills @KyrieIrving KYRIEEE",
    "209": "@BrooklynNets @aldridge_12 @KesslerEdwards @Patty_Mills @KyrieIrving where is harden? ooh right he is masturbating with his right hand",
    "210": "@stephdillrides @NBA @BrooklynNets clearly judging by ur horrid profile picture",
    "211": "@BrooklynNets @aldridge_12 @KesslerEdwards @Patty_Mills @KyrieIrving WIN PLEASE",
    "212": "@BrooklynNets @aldridge_12 @KesslerEdwards @Patty_Mills @KyrieIrving Harden update?",
    "213": "@A_3_0_2 @osicash @dako779 @NBA @BrooklynNets He is lol",
    "214": "Workin’ on the weekends 💼 https://t.co/CKoUkN8Dty",
    "215": "@LackinJC @NBA @SteveNash @StephenCurry30 @warriors @BrooklynNets Right?",
    "216": "@Tae_richboyz @BrooklynNets They can lose i just wanna watch him",
    "217": "Later in the evening, I might watch NBA Basketball (Brooklyn Nets at Golden State Warriors) on the DVR (ABC).  Afterwards, I might watch “Blade Runner” (1982) on Blu-ray.",
    "218": "@BrooklynNets @HSpecialSurgery When did Millsap join the Nets? I guess I don’t pay attention.",
    "219": "Check out 2020-21 Donruss Optic Landry Shamet Checkerboard Prizm #133 Brooklyn Nets SSP https://t.co/tRvMBVccjj ⁦@eBay⁩  #thehobby #sportscards\n#basketballcards",
    "220": "@vicecity4life @BrooklynNets If he does play they still gone lose anyway",
    "221": "Lindo!!!! @warriors vs @BrooklynNets 🔥🔥🔥🔥",
    "222": "@NBA @BrooklynNets Klay is back, Kyrie is back, the good NBA is back!",
    "223": "@NBA @BrooklynNets Cant see them winning with KD out",
    "224": "This weekend in the Bay\n\n* Golden State Warriors vs. Brooklyn Nets (POTENTIAL FINALS PREVIEW)\n* San Francisco 49ers vs. Los Angeles Rams (NFC CHAMPIONSHIP)\n\nWhat a weekend this is gonna be.",
    "225": "I watched The Wraith starring @charliesheen &amp; now watching Gladiator starring Cuba Gooding jr. Then after NBA Primetime Saturday. My Brooklyn Nets vs Golden State Warriors. Awesome snow day @TamsenFadal @JamesGunn @NoraKAli  @NorahODonnell @RyanFieldABC @JoyTaylorTalks",
    "226": "@BrooklynNets Pls no\nPls no",
    "227": "@BrooklynNets Nets fans in shambles rn",
    "228": "@GSWRevengeTour @NBA @BrooklynNets I heard he received an \"exemption\". \nComplete BS. He can't even play in his own arena!",
    "229": "The NJ/Brooklyn Nets are just a cursed organization https://t.co/Oj02bRcCAd",
    "230": "@BrooklynNets Nets can't catch a break....🤦",
    "231": "@EvanRobertsWFAN I’m a die hard Knick fan and hate where the team is right now, but I would rather have the current Knick situation than your Brooklyn Nets situation! I can’t even hate on the Nets at this point!!",
    "232": "For my bday i either wanna spend the weekend in Georgia and plan some stuff to do or go to a Brooklyn nets game and just spend the day in NY 😩",
    "233": "@Ash_Trey707 @warriors @BrooklynNets Warriors!",
    "234": "Brooklyn is 4-12 ATS in its last 16 games. Tonight the #Nets are getting 6.5 points against the #Warriors at home.\n\nRead our analysis of their matchup🔽\n\n#NBAtwitter #gamblingtwitter \n\nhttps://t.co/gOnPVDnHGn",
    "235": "@NBA @BrooklynNets @warriors I thought Kyrie couldn't play in SF? Due to their vaccination guidelines!!",
    "236": "@UtdJessee @BrooklynNets Kyrie and Harden always perform when they’re playing without KD so anything is possible https://t.co/GrFgHycMJ5",
    "237": "Warriors/nets tonight. Who ya got? @warriors @BrooklynNets",
    "238": "@Badz24303077 @GSWRevengeTour @NBA @BrooklynNets you’re scared of otto porter jr. https://t.co/kV3u3bPu2o",
    "239": "@NBA @BrooklynNets Still can’t believe KD isn’t playing :/ not fair man",
    "240": "We’ve got your only local coverage of the Nets v Warriors tonight. Join Chris and Capper at 8:20 with the pregame show. Tip off at 8:40 on @WFAN660 and 101.9FM as well as the @BrooklynNets app.",
    "241": "@NBA @BrooklynNets Hooper",
    "242": "@dyt_beg @BrooklynNets Team agreed to “find him a new team, so he can actually play”",
    "243": "@NBA @BrooklynNets Oh no Kyrie’s playing 😭 this is gonna be a tough match",
    "244": "@dyt_beg @BrooklynNets Rumors says he's about to be traded",
    "245": "@SeIIAwb @BrooklynNets no chance without kd",
    "246": "@BrooklynNets Just let him rest",
    "247": "BROOKLYN NETS STAY HEALTHY CHALLENGE (IMPOSSIBLE) https://t.co/CpCCVB46LU https://t.co/WFAzwuDlfs",
    "248": "@NBA @BrooklynNets Brooklyn needs a W today 🙌🏻",
    "249": "🚨 Line Change 🚨\n\nBrooklyn Nets @ Golden State Warriors\nSat 8:40 PM EST\n\nFrom:\nGS -8.0 -110\n\nTo:\nGS -9.0 -115",
    "250": "@BrooklynNets Bullshit ;/",
    "251": "@BrooklynNets omg the nba needs to get a grip man first no kd harden injured what is our luck i hope he plays",
    "252": "@GSWRevengeTour @NBA @BrooklynNets 😂 y’all scared didn’t Justin play while being unvaccinated",
    "253": "@BrooklynNets @blakegriffin23 @BruceBrown11 Proud of you guys for doing this. The @nyknicks said NOTHING. Despicable.",
    "254": "Consensus Line Move:\n2022-01-29 Brooklyn Nets at Golden State Warriors from -8.00 to -9.00\n#DubNation nervous?\n#NBA #CryptoHoops #coder #investors",
    "255": "@NBA @BrooklynNets Dude finna get people sick smh",
    "256": "@BrooklynNets Fuck",
    "257": "@BrooklynNets Millsap? Why? Anyone knows the reason?",
    "258": "@BrooklynNets Royal rumble on",
    "259": "@BrooklynNets Nba the corniest league. Literally every good match up someone is sitting out.",
    "260": "Will @KyrieIrving get best of @StephenCurry30? 3 questions, stats before @BrooklynNets-@warriors\nhttps://t.co/Xsz2O4zaf9",
    "261": "@BrooklynNets BS! Y’all know if he’s playing or not… Is he playing or is he not?",
    "262": "@BrooklynNets @HSpecialSurgery Harris update???",
    "263": "@BrooklynNets Play in here we go.",
    "264": "@Kevin43503829 @vicecity4life @BrooklynNets Most definitely top 10",
    "265": "@Badz24303077 @GSWRevengeTour @NBA @BrooklynNets We aint scared of a dude thats gonna drop 15 and 5 on bad efficiency",
    "266": "@BrooklynNets Man if harden don’t freaking man tf up and play 🤬",
    "267": "@vicecity4life @BrooklynNets If Kyrie somehow wins this game he’s top 10 all time right?",
    "268": "@towers_deanbob @NBA @BrooklynNets Are you implying Kyrie isn’t clutch or that he can’t create a Covid vaccine?",
    "269": "@BrooklynNets Wait, what?",
    "270": "@NBA @BrooklynNets I thought SF is like NY - unvaccinated players can't play.",
    "271": "@BrooklynNets Wtf 🤦🤦🤦🤦🤦🤦🤦😡😡😡😡😡, how did he strained his hand ?",
    "272": "@BrooklynNets CURRY BAILED",
    "273": "@BrooklynNets Don’t do this ffs",
    "274": "@BrooklynNets woah woah woah",
    "275": "@Dr_Dreidel_ @Badz24303077 @GSWRevengeTour @NBA @BrooklynNets What about the other players who go to chase unvaccinated",
    "276": "@BrooklynNets Scary",
    "277": "@yccuubo @BrooklynNets Not hard",
    "278": "@BrooklynNets Not watching if he don't play",
    "279": "@stxph30 @BrooklynNets Not hard KD is injured, praying for a Harden and Kyrie masterclass",
    "280": "@Dr_Dreidel_ @sifyNF @DaGoatx_x @Badz24303077 @GSWRevengeTour @NBA @BrooklynNets Same thing in nyc, that’s why kyrie can’t play there. But opposing players who aren’t vaccinated can play in nyc",
    "281": "@j0rdanpoole @NBA @BrooklynNets He don’t live in sf He is a away player Away players who are unvaccinated can play in different cities but can’t play in their own cities when they’re teams are playing at home So since he doesn’t live in sf He is allowed to play there",
    "282": "#Warriors coach Steve Kerr on #Nets navigating Kyrie Irving's part-time status: \"What Brooklyn's dealing with is unprecedented...and it can't be easy.\"",
    "283": "Update to the Status Report for tonight’s game at Golden State:\n\nHarden (right hand strain) - QUESTIONABLE",
    "284": "@JalapenoJordan @cazziblanco @NBA @BrooklynNets Explain",
    "285": "@towers_deanbob @NBA @BrooklynNets are you implying Kai ain’t clutch? 💀",
    "286": "@BamForTheSlam @cazziblanco @NBA @BrooklynNets 1. Why do you gotta bring race into everything 2. Show how the vaccine is proven to work years after you get it",
    "287": "@stephdillrides @NBA @BrooklynNets Only resident in SF.",
    "288": "@BamForTheSlam @stephdillrides @NBA @BrooklynNets I know what vaccines are supposed to do and this isn’t it. We can have a scientific debate about how vaccines have stopped transmission of polio, meningitis, measles, etc. and how this mRNA therapy isn’t working, increasing variants and causes myocarditis in young men. Let’s go!",
    "289": "@GSWRevengeTour @NBA @BrooklynNets He is a visitor. Unvaccinated beal played in barclays center. It is unfair",
    "290": "@NBA @BrooklynNets So are u vaxxed or not?",
    "291": "@BrooklynNets @HSpecialSurgery We are saved we having our fucking shitty hero in the person of Irving he is available this guy fucks everyone but we continue to support him wake up guys !!",
    "292": ".@BrooklynNets granny isn’t getting out if you don’t beat Warriors today https://t.co/TKvuB3WymB",
    "293": "@mox_zi @DaGoatx_x @Badz24303077 @GSWRevengeTour @NBA @BrooklynNets Yh but also from a moral perspective it’s very unfair but it still effects every team in the nba not just warriors or nets🤷🏾‍♂️so there’s really nothing you can say",
    "294": "@NBA @BrooklynNets Poetry",
    "295": "@sifyNF @DaGoatx_x @Badz24303077 @GSWRevengeTour @NBA @BrooklynNets It's still in California where you can't goto a game w/o vax. This some BS. Double standard",
    "296": "@999kyrievibes @kaiishome @NBA @BrooklynNets Btw Kai will own Curry tonight",
    "297": "@Badz24303077 @GSWRevengeTour @NBA @BrooklynNets -suns fan",
    "298": "@ron92975154 @DaGoatx_x @Badz24303077 @GSWRevengeTour @NBA @BrooklynNets That’s also stupid from a moral perspective.",
    "299": "@blakedsharksfan @NBA @BrooklynNets It’s the same rules in NYC away players can be unvaccinated and play it only applies to home players",
    "300": "@osicash @dako779 @NBA @BrooklynNets Never was and never will be of a side kick(part time) player",
    "301": "@stephdillrides @NBA @BrooklynNets 💯 Thanks for pulling up the 🧾🧾🧾. I love how they try to spin it and say “They never said that. It’s meant to reduce symptoms and prevents hospitalizations.”  😵‍💫😵‍💫😵‍💫 🧟‍♂️🧟🧟‍♀️ Mass formation psychosis.",
    "302": "@NBA @BrooklynNets Curry stands no chance !!",
    "303": "@Badz24303077 @GSWRevengeTour @NBA @BrooklynNets No it's simple. The league will do anything to fuck the warriors. You can't even go to a game without a bossier shot but kyrie is practicing on our court RN TF. The league scared of Warriors.",
    "304": "@stephdillrides @NBA @BrooklynNets Only if you live there it makes 0 sense. So Wiggins had to get vaccinated to play home games for the Warriors because he lives there but Kyrie can play in the same game against him unvaccinated lol shit is stupid.",
    "305": "@stephdillrides @NBA @BrooklynNets That’s for the home players it’s the same rules in NYC",
    "306": "@milt9n_ @NBA @BrooklynNets There's a mandate that you can't play if your unvaxxed in sf",
    "307": "@Badz24303077 @GSWRevengeTour @NBA @BrooklynNets Nobody afraid of a part time player. Also the suns are definitely afraid of gsw 😂",
    "308": "@TejS40 @NBA @BrooklynNets Apply",
    "309": "@TejS40 @NBA @BrooklynNets Rule only applie to home team players.",
    "310": "@TattooYourFace @NBA @BrooklynNets Was about to type the SAME EXACT THING. Wiggins has to be Vaxxed, Nets have mandate due to NYC mandate sooo how can Kyrie play there on the road? It was never about science or safety. Its about control",
    "311": "@stephdillrides @cazziblanco @NBA @BrooklynNets Disgusted to share the same fandom as you 🤢",
    "312": "@j0rdanpoole @NBA @BrooklynNets he doesn't live in sf??",
    "313": "@rTghost2 @br_Andy1 @MolefiMofoken17 @NBA @BrooklynNets @warriors He can play since he’s visiting need a negative test tho",
    "314": "@MarkGre84321817 @BrooklynNets I don’t think kyrie can play Bc it’s in Cali and you have to be vaccinated",
    "315": "@NBA @BrooklynNets I ain kno covid hoop like that",
    "316": "@NBA @BrooklynNets People still don’t seem to understand he can play anywhere but New York and Toronto",
    "317": "@GSWRevengeTour @NBA @BrooklynNets What’s unfair is you can be vaccinated, boosted and Covid POSITIVE but still allowed to attend a game cause you have a QR code. Kyrie’s not sick and he’s exempt per SFDPH. As a Dubs fan, I want to see him play my guys.",
    "318": "@NBA @BrooklynNets Which fan base is worse",
    "319": "@NBA @BrooklynNets Stephen Curry drills shots from the midcourt while Kyrie Irving is doing lay-ups in the warm-up. We can tell who's going to win tonight 😂",
    "320": "@chicinthegeek I got a new phone today and the Verizon guy and the security guard were arguing about the Nets and my nosey ass jumped in because the salesman was saying no one could beat Brooklyn with the big 3 at full strength and I had to agree with him and tell the security the was WRONG!",
    "321": "@cazziblanco @NBA @BrooklynNets The vaccine doesn’t work\nI thought we were told the vaccine would prevent people from getting COVID 🤷‍♂️",
    "322": "@DaGoatx_x @Badz24303077 @GSWRevengeTour @NBA @BrooklynNets Nets have the exact same ruining so it’s fair 🤷🏾‍♂️🤷🏾‍♂️🤷🏾‍♂️away players play at the Barclays too",
    "323": "@yeahokbuddy473 @NBA @BrooklynNets Change ur user to (24-26) 😆",
    "324": "Brooklyn Nets for me. \nSteph &gt; Kyrie &amp; Harden\nKyrie &gt; Klay &amp; Green \nHarden &gt; Klay &amp; Green \nKlay &lt; Kyrie, Harden &amp; KD\nKD &gt; Steph, Klay &amp; Green \nDraymond Green is a “Thank You” player. Bye! https://t.co/HsuJLwBs2C",
    "325": "Kyrie Irving of the Brooklyn Nets practices at San Francisco's Chase Center ahead of the NBA game against the Golden State Warriors. @sfchronicle @SportingGreenSF https://t.co/Zj9mazsHp5",
    "326": "@NBA @BrooklynNets Washed",
    "327": "Brooklyn Nets Become the First Professional Sports Team in America To Join the Metaverse - HYPEBEAST https://t.co/qQXndO5sAX",
    "328": "@NBA @BrooklynNets Who’s guarding Kyrie on the dubs?",
    "329": "@stephdillrides @NBA @BrooklynNets Not if you’re a visiting player or performer. Then your exempted per SFDPH. 🤗  Happy for Kyrie. He’s clearly not sick. I know someone who went to a game and was CV positive but since he’s vaccinated and boosted, his QR code granted entry. It’s all theater.",
    "330": "@DaGoatx_x @Badz24303077 @GSWRevengeTour @NBA @BrooklynNets Because he is playing away if he was playing for the warriors he would need the vaccine",
    "331": "@NBA @BrooklynNets Ohhh the Warriors are pulling up in blue tonight, it’s over!",
    "332": "Saturday NBA Pick of Day\n\nBrooklyn Nets +8 -110 MAX (3 Units)\n\nCollab with @AlphaDogBets (1 Unit) Play for him\n\nSponsored by @purewage5 \n\nLIKE it up if you are DANCING with us! https://t.co/hPrye5GcC9",
    "333": "@NBA @BrooklynNets ready for this road trips? https://t.co/yZ1Yxj444j",
    "334": "@babymomma988 @NBA @BrooklynNets It’s kyrie day ‼️‼️",
    "335": "@Badz24303077 @GSWRevengeTour @NBA @BrooklynNets nah but they forced wiggins to take the vaccine cause he was gonna miss all the home games so idk why there's and exception with Kyrie",
    "336": "@BrooklynNative7 @NBA @BrooklynNets He did get the shot though, and believe me, I did criticize him for not getting it initially.",
    "337": "@BrooklynNative7 @NBA @BrooklynNets First, has to do with caring about others and their health. All he has to do is just get the shot. Second of all, we'll be going for a championship this year. Yall enjoy the regular season while you can because that's as far as you will get.",
    "338": "@NBA @BrooklynNets Once you broke your mandate people won't follow it again. If you enforced mandate make sure you stand it no matter what.",
    "339": "@stephdillrides @NBA @BrooklynNets Only if your a resident",
    "340": "@Xd_Asterr @BrooklynNets @KDTrey5 Tatum doesn't deserve it. Trae and demar way more deserving",
    "341": "NBA:\nBoston Celtics Primera Mitad Alta 105 -110 [2]\nWashington Wizards +6 -110 [2]\nGolden State Warriors -8 -110 [3] MAX \nBrooklyn Nets Primera Mitad Alta  116 -110 [2]\nMiami Heat Primera Mitad  -2 -110 [2]",
    "342": "@NBA @BrooklynNets He shouldn't be in that building. Shame on @LondonBreed for letting this happen. Spectators aren't even allowed at @ChaseCenter without getting their vaxx cards check and you let this guy in???",
    "343": "@NBA @BrooklynNets So unvaxxed Kyrie can play in SF but not BK but attendees and warriors have to be vaxxed but unvaxxed Wiggins couldn’t play in SF but he could play elsewhere.",
    "344": "@notjmorant @BrooklynNets @KDTrey5 Only starters were announced, so no not yet",
    "345": "@yeahokbuddy473 @NBA @BrooklynNets Cringe",
    "346": "@dubzridah @NBA @BrooklynNets Wow, I really thought SF officials wouldn't be so soft on this... perhaps the NBA gave them trouble or something",
    "347": "@NBA @BrooklynNets How tf is he allowed to play in sf?",
    "348": "@NBA @BrooklynNets They test his ass before the game? https://t.co/COy2NQpHJX",
    "349": "@lknowhoops @NBA @BrooklynNets I don't know Justin's vax status, but he should not be allowed to play either if he isn't.",
    "350": "@BrooklynNets vs @warriors tonight 🏀✌🏾",
    "351": "@NBA @BrooklynNets AMAZING",
    "352": "@NBA @BrooklynNets I'll be watching lacrosse",
    "353": "@NBA @BrooklynNets Future maverick",
    "354": "@NBA @BrooklynNets Irving  25  points",
    "355": "@TejS40 @NBA @BrooklynNets Did you say the same about Justin Holiday?",
    "356": "@NBA @BrooklynNets Btw I don’t support the vaccine or the mandates",
    "357": "Brooklyn Nets Kyrie Irving Warming up before tonight’s Game Against the Warriors #NetsWorld https://t.co/kx5C1n9Z6S",
    "358": "@NBA @BrooklynNets Better than lebum",
    "359": "Throwback💥\nFinal minute of @Bucks @BrooklynNets Game 7 https://t.co/SE21BuypUv",
    "360": "@NBA @BrooklynNets Kyrie&gt;mlk. And i m not trolling",
    "361": "@NBA @BrooklynNets I thought you need to be vaccinated to play in SF",
    "362": "@NBA @BrooklynNets Why is he being allowed to play in San Francisco?",
    "363": "@NBA @BrooklynNets He’s going for 40",
    "364": "@NBA @BrooklynNets better than curry",
    "365": "@NBA @BrooklynNets Who’s winning",
    "366": "Kyrie gets loose for @BrooklynNets #NBAonABC action vs. Golden State (8:30pm/et)! https://t.co/A2YyP5YtFK",
    "367": "#Atlantic #BrooklynNets Good News, Bad News. Nets have 10 players in protocols but plan to play on Christmas https://t.co/Vij5dkDPNr",
    "368": "@WinamaxSport possible de remettre le my match sur golden state/ brooklyn nets 🏀 Svp ??",
    "369": "@Herro4three @JimmyyButlerSZN @DubsNets @KnicksKaiSZN @Wartin68309 @2016PaulGeorge @Durantsworld @jimmysburneracc @BrooklynNets @RatiodByJynx @vicecity4life You are the goat",
    "370": "@YasephIan @JimmyyButlerSZN @DubsNets @KnicksKaiSZN @Wartin68309 @2016PaulGeorge @Durantsworld @jimmysburneracc @Herro4three @BrooklynNets @RatiodByJynx W Wonest WD Wan",
    "371": "@YasephIan @JimmyyButlerSZN @DubsNets @KnicksKaiSZN @Wartin68309 @2016PaulGeorge @Durantsworld @jimmysburneracc @BrooklynNets @RatiodByJynx @vicecity4life W goat",
    "372": "NBA Top 3 Brooklyn Nets vs. Golden State Warriors MUST BET NBA Betting Picks Tonight | 1/29/22 -- @TopherSquints \nhttps://t.co/cUJz1khLdX",
    "373": "Here's what GM Sean Marks and the Nets need to do at the trade dead... (https://t.co/5AvbMDzwqY)\n\nSAN FRANCISCO - The NBA trade deadline is less than two weeks away, and the buyout market of...\n\nAdd your highlights:\nhttps://t.co/KcIR1WgHTR\n #Brooklyn_Nets",
    "374": "- The Kevin Durant-less Nets take a trip to the Bay Area to face the Warriors on Saturday\n- The Dubs beat Brooklyn in their first meeting in November\n- See the Nets vs Warriors odds for Saturday’s matchup\n\nThe struggling Brooklyn Nets will be looking to\n\nhttps://t.co/OduuMeYiuL https://t.co/5QF2n97xzX",
    "375": "- Looking at the player props available for a 6-pack of games on the NBA docket Saturday\n- The Brooklyn Nets kick off a 5-game West swing starting against the Warriors\n- Find the player props and bestbets below\n\nIt might be a light night of games, but\n\nhttps://t.co/rdVmfa1ZV5 https://t.co/CvMtnfX1c1",
    "376": "@StartMcBride @NBA @SteveNash @StephenCurry30 @warriors @BrooklynNets Kyrie's not on par at their tier. He hasn't even won a season MVP.",
    "377": "Today @BrooklynNets vs @warriors\n The Total is 227.5.\ntheir Past 10 game avg 228.\nAvg points given up in 10 games 222\nThe recomended bet is Avoid.\n what do you think? \n#NBA #GamblingTwitter #Total #Bookie #SportsBetting",
    "378": "@SocratesCastro6 @NBA @BrooklynNets @warriors Warriors of COURSE",
    "379": "@BrooklynNets Tried to tell y’all that man can Thomas is nice",
    "380": "Nike NBA Toddlers (2T-4T) Brooklyn Nets Team Name T-Shirt\nhttps://t.co/88Yc6Hmhm2",
    "381": "¡Noche de NBA!\n\n🏀Golden State Warriors vs. Brooklyn Nets\n⏰22:30 \n📺ESPN3/TCC Vivo \n\n#TCC #TCCvivo #NBA https://t.co/RUrrXt494u",
    "382": "[📺LIVE - 02H30] 🏀 #NBA \nBrooklyn #Nets @ Golden State #Warriors en direct sur beIN SPORTS 1 \n#NBAextra",
    "383": "Warriors without four players ahead of Saturday’s clash against the Brooklyn Nets; Nemanja Bjelica questionable #BrooklynNets #GoldenStateWarriors #InjuryReport https://t.co/xRPQWPjGSZ",
    "384": "@NUFUO_mu_IGP @kay_boatx @BrooklynNets Let’s go Warriors!!!",
    "385": "Stephen Curry stats: Why is Warriors star stuck in shooting slump after breaking 3-point record? by Pre Chewed #Basketball #BrooklynNets #GoldenStateWarriors #GoldenStateWarriorsVBrooklynNets #NBA https://t.co/hQfNd0Lf5P https://t.co/wKyhkjWZYe",
    "386": "NBA Top 3 Brooklyn Nets vs. Golden State Warriors MUST BET NBA Betting Picks Tonight | 1/29/22 -- @TopherSquints \nhttps://t.co/OgDpNWyXeb",
    "387": "get that W @BrooklynNets",
    "388": "Kyrie vs. Curry. Harden vs. Klay. It's Saturday Primetime.\nWatch the Brooklyn Nets vs. the Golden State Warriors TONIGHT, Saturday, at 8:30 on ABC11 https://t.co/YQ4Vil0iFe",
    "389": "@NUFUO_mu_IGP @BrooklynNets May the best team win",
    "390": "Here’s what GM Sean Marks and the Nets need to do at the trade deadline #Brooklyn #Nets #NBA https://t.co/9CV7lL4Xbu",
    "391": "@NBA2K @BrooklynNets Guess what?i don’t think anyone fucking cares",
    "392": "@AhmedAa0204467 @Muntasirmasud1 @StartMcBride @NBA @SteveNash @StephenCurry30 @warriors @BrooklynNets bruh u deadass just brought up stats on how someone doin better all i said was yall to worried abt stats more then wins",
    "393": "@NUFUO_mu_IGP @BrooklynNets If he's coming up against warriors..I can trust him to get the job done 😄😄",
    "394": "Question Of The Day: in what year did MLB Legend Hank Aaron celebrate his 85th Birthday?\nA. 2013\nB. 2015\nC. 2017\nD. 2019\nThe answer will be announced after the Brooklyn Nets-Golden State Warriors NBA Game on ABC tonight. https://t.co/gn7V9xBSyi",
    "395": "NBA Betting Preview: Brooklyn Nets vs. Golden State Warriors - Saturday, January 29, 2022 https://t.co/3IeH6NK9dk",
    "396": "@NUFUO_mu_IGP @BrooklynNets You and I know curry and klay haven't been pulling numbers off late..you know that😂😂😂",
    "397": "@Kangnem1224 @Muntasirmasud1 @StartMcBride @NBA @SteveNash @StephenCurry30 @warriors @BrooklynNets What 😂 how you supposed to know if someone is having good or bad game 😂 n u just stated stats 🤦🏿‍♂️",
    "398": "NBA Top 3 Brooklyn Nets vs. Golden State Warriors MUST BET NBA Betting Picks Tonight | 1/29/22 -- @TopherSquints \nhttps://t.co/Kkhd9YA4m9",
    "399": "@AhmedAa0204467 @Muntasirmasud1 @StartMcBride @NBA @SteveNash @StephenCurry30 @warriors @BrooklynNets and someone they not second ranked hmmm shhhh kid yall stat chasers",
    "400": "@NUFUO_mu_IGP @BrooklynNets I trust Kyrie and harden😂😂😂😂",
    "401": "TONIGHT |||| The #NBA Is Live On @953WDAE\n\n@BrooklynNets v @warriors \n\nCoverage Begins:  8:00pm\n\n📻 95.3FM | 620AM\n📱https://t.co/ofcFkfgRfX On @iHeartRadio App or @ESPNRadio\n🔊 \"Play WDAE On IHeartRadio\" (Smart Speakers) https://t.co/QKaw3Msqaw",
    "402": "@Muntasirmasud1 @StartMcBride @NBA @SteveNash @StephenCurry30 @warriors @BrooklynNets 😂 he dropped2 30 points in the last 5 games while Steph is struggling to shooting n only making it to 20 😂",
    "403": "Philadelphia 76ers - Sacramento Kings\nGolden State Warriors - Brooklyn Nets\n\nBet slip link: https://t.co/3xMtzhMJnM https://t.co/o7l05RYbsB",
    "404": "@BrooklynNets tonight we beg don't disappoint....make them hear am at Chase 😂😂😂",
    "405": "@NBA @SteveNash @StephenCurry30 @warriors @BrooklynNets AWESOME!!!!!!",
    "406": "We will be doing another livestream on the @Colorcastapp ! We will on during the @BrooklynNets vs @warriors game tonight at 8:30pm on @ABCNetwork Come have some fun! #nba https://t.co/Vru6h7GCuY",
    "407": "Josh and I are doing another stream tonight on the @Colorcastapp We will be live during @BrooklynNets vs @warriors Come by and chat and have some fun! #nba https://t.co/jU3e1Kgwbu",
    "408": "🇺🇸NBA Picks\n\nBoston Celtics ML (1.40)\nSacramento Kings +12.5 (1.70)\nMiami Heat ML (1.62)\nBrooklyn Nets +7.5 (1.93)\n#nbapicks #nbabettingtips #NBATwitter https://t.co/aDjGjAZV5q",
    "409": "It’s going to be a busy weekend in San Francisco with start of the Lunar New Year, the Brooklyn Nets facing the Warriors and people watching the 49ers vs Rams at local bars. But what about omicron? the city is urging everyone to keep their guard up. https://t.co/9SuuZAH1TW",
    "410": "PHIL'S PROP BET GUARANTTTEEEEE 💯💯\nNBA 🏀;\n\nBrooklyn Nets @ Golden State Warriors\nKyrie Irving Total points over 24.5 (-125)🔒🔒\n\nLETTTT'SSS GOOOO 🔥🔥🤫\n\n#GamblingTwitter #NBA https://t.co/0GOH86Pdyr",
    "411": "@DrDKilpatrick @inthelowpost @sixers @JuliusErving @BrooklynNets A generic basketball fan would not make this mistake",
    "412": "How can #KyrieIrving play tonight against @warriors when #AndrewWiggins was told he could not play there unvaccinated? #NBA @BrooklynNets",
    "413": "@NBA @JHarden13 @BrooklynNets Thank you ABC 🏀",
    "414": "Brooklyn Nets vs. Golden State Warriors Preview | Hoop Streams #Brooklyn #Nets #NBA https://t.co/QmcCy4o0Uy",
    "415": "Brooklyn Nets vs. Golden State Warriors Preview | Hoop Streams #GoldenState #Warriors #NBA https://t.co/ShGH56pDx4",
    "416": "Golden State Warriors Predictions and Preview for 1/29/2022 hosts Brooklyn Nets.  Find out who we are taking in this matchup. #Picks #Sportsbook https://t.co/1t9l1DJvT1",
    "417": "@ktmumf Do itttt!!! Except Kyrie plays for Brooklyn Nets. 😂",
    "418": "Brooklyn Nets Varsity Jacket https://t.co/ABIvtNnrHz",
    "419": "Remember the only reason @BrooklynNets brought Kyrie Irving back was because too many vaccinated players were becoming sick",
    "420": "Buddy Hield to the @BrooklynNets",
    "421": "@NBA @JHarden13 @BrooklynNets crazy how he changed from a jordan level scorer to a elite passer",
    "422": "Golden State Warriors Predictions and Preview for 1/29/2022 hosts Brooklyn Nets.  Looking for betting action?  Find out if there is any value in our preview. #Picks #Sportsbook https://t.co/1t9l1DJvT1",
    "423": "Nets Insider Podcast: Nets at Warriors preview with @RandyBSP of @BackSportsPage and\n @ArielEpstein of @YahooSportsNBA to share her thoughts on the Brooklyn Nets along with her expert NBA betting insights. #nba #NetsWorld #netsvswarriors #nba #nets https://t.co/7XhqrfkLmM",
    "424": "@NBA @JHarden13 @BrooklynNets Took u long enough 2 post this",
    "425": "@NetsW2 @BrooklynNets That strategy didn’t work when we played them in BK",
    "426": "@NBA @JHarden13 @BrooklynNets Who cares Brady drama going on rn",
    "427": "James Harden (10.1 APG) can thread the needle to set up his teammates! 👀\n\nWatch @JHarden13 and the @BrooklynNets take on the Warriors tonight for Saturday Primetime on ABC at 8:30pm/et. https://t.co/4pt03mFKJx",
    "428": "Brooklyn Nets",
    "429": "The Nets were in action on Tuesday against the Los Angeles Lakers (Brooklyn lost, 106-96) and during the broadcast, Yahoo Sports’ Chris Haynes reported that Brooklyn now expects Durant to take the entire six weeks, if not longer, in rehabbing his knee. As such, KD is set to miss",
    "430": "#NBA75- #NBA: #goldenstatewarriors/#BrooklynNets; Who U got-#Warriors/#Nets?\n@warriors \n@BrooklynNets    \n@ESPNNBA  \n@NBA",
    "431": "@NBA Brooklyn nets vainqueurs  ? \nToronto raptors vainqueurs  ?",
    "432": "@SportsCenter If they play in Brooklyn it would be the Warriors.\n\nBcuz the NETS would only have a big 2 vs the Warriors big 3.\n\nSince \"Cryrie\" won't sacrafice to be there for his teammates as they did to be there for him.\n\nYep... https://t.co/gzDwnJt5bs",
    "433": "NBA Golden State Warriors - Brooklyn Nets https://t.co/mPEt12wb7p",
    "434": "@BrooklynNets We can have a fighting chance but Kyrie and Harden have to be great tonight and good production from the role players",
    "435": "Brooklyn Nets vs. Indiana Pacers- 1/5/2022 Free Pick &amp; NBA Betting Prediction https://t.co/fb7SFCHMPd",
    "436": "@YES75628975 @NBA @SteveNash @StephenCurry30 @warriors @BrooklynNets I’m sayin’",
    "437": "A little disappointed didn't get to drop a 5u bet, no love. Here is a couple for tonight.\n🏀@celtics -5.5 based on JoVal out\n🏀@UHCougarMBK -6.5\n🏒@TBLightning (ml)\nDog of the Day\n🏀@BrooklynNets (ml) +265 too much value to pass up on a strong team\nBRING IT!\n#GamblingTwitter https://t.co/3W6n3kGjDs",
    "438": "@basketusa Brooklyn nets vainqueurs  ?",
    "439": "@BrooklynNets Get ready to be 6th seed @BrooklynNets",
    "440": "@isojaybtw @mattmcfc_ @CratroidXd @BrooklynNets @HSpecialSurgery Gave him a free pass to play",
    "441": "After Steph Curry's explosive start to the season, a recent shooting slump is starting to derail his MVP case. @bjarmstrong suggests why that might be... \n\nCan he rediscover that form tonight? 👇\n🔘 Brooklyn Nets @ Golden State Warriors\nSky Sports Arena + Main Event | 1:30AM https://t.co/uXGbXK2DVJ",
    "442": "🎞 SHOWDOWN\n\n🔥 #NBASATURDAYS\n\n🏀 #BrooklynNets @ #DubNation\n\n📣 02:30 | LIVE su @SkySportNBA https://t.co/RnUWLS5Rph",
    "443": "🚨GAMEDAY! The Golden State Warriors will take on the Brooklyn Nets in Golden State. Who y’all got?👀",
    "444": "Will Brooklyn Nets lift the trophy this year? \n\nFull NBA Championship odds here: https://t.co/r3k4Bm99zU\n\n#NBA75 #NBA #NBAodds https://t.co/AvXKspzUGk",
    "445": "The brooklyn nets calling their metaverse the \"netaverse\" is so funny for me for some reason 😂",
    "446": "@WC1221 @SportsCenter Brooklyn is better in terms of individual talent, but as a unit I'm taking Steph Klay and Draymond. They have continuity, chemistry and they're very unselfish. The nets trio haven't played many games together. Plus there's reports that Harden isn't cool with Kyrie and his antics",
    "447": "@NBA @SteveNash @StephenCurry30 @warriors @BrooklynNets The editing 💯💯💯",
    "448": "@MenInBlazers Brooklyn Nets in play too",
    "449": "@NBA @BrooklynNets @warriors Im confused Steph and Klay are the only mentioned stars here",
    "450": "Will to win backcourt Brooklyn Nets. \n\n#NBACardsAddict https://t.co/Pza2h6cHbA",
    "451": "@NBA @BrooklynNets @warriors They’re all overrated players so who cares",
    "452": "The #NBA75 season rolls on with a matchup full of stars!\n\nDon't miss James Harden, Kyrie Irving and the @BrooklynNets visit Steph Curry, Klay Thompson and the @warriors for Saturday Primetime on ABC at 8:30pm/et. https://t.co/7SckEWngos",
    "453": "@brooklyn_nfts @BrooklynNets It's gotta be done",
    "454": "Hey @BrooklynNets trade Harden, and get destroyed tonight like most nights now @NBA @NBATV #NBA",
    "455": "Check out 2021 Chronicles Basketball James Harden Teal Prizm Hometown Heroes #Brooklyn #Nets https://t.co/5JDdGAVc4I @eBay",
    "456": "no denying that Brooklyn can easily win a championship if big 3 are healthy. HOWEVER outside of the big 3, the warriors have a stronger bench, so even if one of the big three for the nets is hurt, the warriors have a better chance of winning. https://t.co/Ka5lCU6WTB",
    "457": "@NBA @BrooklynNets @warriors I’m all nets",
    "458": "Golden State Warriors vs Brooklyn Nets is on ESPN 3 (United States). With commentary from Alejandro Pérez. Co-commentator is Leo Montero.  For more details see https://t.co/OQctowNA5r #GoldenStateWarriors #BrooklynNets #ESPNUnitedStates",
    "459": "@NBA @SteveNash @StephenCurry30 @warriors @BrooklynNets yes, yes and yes. plus Rajon Rondo",
    "460": "No KD or Draymond but we do get KAI &amp; Klay tonight as the #Nets take on the #Warriors in SF as Brooklyn looks to snap their 3 game losing streak - #Nets vs #Warriors Preview. #NetsWorld #NBA #NBA75 https://t.co/I2D46ASrok",
    "461": "@BrooklynNets @HSpecialSurgery Trade Irving !",
    "462": "NBA LIVE TODAY🔴 Brooklyn Nets vs Golden State Warriors - 29th January 20... https://t.co/T9Yhv4OmNl",
    "463": "@BrooklynNets @HSpecialSurgery Claxton and Sharpe??",
    "464": "@NBA2K @BrooklynNets Should be 93 at least",
    "465": "@NBA @SteveNash @StephenCurry30 @warriors @BrooklynNets Curry on everything!! @stephenCurry30",
    "466": "I hope everyone is still aware that the Brooklyn Nets are still the NBA champions.  #nba",
    "467": "Brooklyn Nets vs. Golden State Warriors Preview | Hoop Streams - https://t.co/FiErGM7W5L temporary covers https://t.co/Bn9IBaC7CG - https://t.co/Djfb6Ez3Be",
    "468": "BREAKING: The Brooklyn Nets have signed Tom Brady to a 1 year deal.",
    "469": "@brooklyn_nfts @BrooklynNets Litty",
    "470": "@NBA2K @BrooklynNets How do you even tell what ratings went up? There's no details..",
    "471": "I leave you with this how much DOES JAMES HARDEN CARE ABOUT BROOKLYN NETS..BY THE POINTS AND LEADS THE NETS TO A W TONIGHT OTHERWISE YOU LOOKING AT ANOTHER JULIUS RANDLE AKA NETS STYLE..GET THE W AND JUST BEAT THE WARRIORS AND SHOW US JAMES HARDEN NOT DRIBBLE..DRIBBLE..FAT..FAT! https://t.co/bw53BMxH9x",
    "472": "Brooklyn Nets vs. Golden State Warriors Preview | Hoop Streams https://t.co/0GdQBCEhv4",
    "473": "SPLASH! 💦 #NBASaturdays\n\n🆚 Brooklyn Nets - Golden State Warriors\n🕟 Bu Gece, TSİ 04.30\n📺 @ssporttr ve @ssportplustr https://t.co/Nxn36GEqcD",
    "474": "📅GAME DAY📅\n\n🏒 @AHLIslanders at 7pm\n🏀 @LongIslandNets at 7pm\n🏒 @NJDevils at 7pm\n🤼 @ArcherOfInfamy, @TheaTrinidad, @DanielleMoinet and @YaOnlyLivvOnce after 8pm\n🏀 @BrooklynNets at 8:30pm\n\n#BRIsles #CatchUsFromTheJump #NJDevils #RoyalRumble #NetsWorld",
    "475": "#e_RadioUS Brooklyn Nets vs. Golden State Warriors Preview | Hoop Streams https://t.co/KHs26EJu8F https://t.co/VLLwaqiiq9",
    "476": "🔴Live ~ Brooklyn Nets vs. Golden State Warriors - NBA League 2022 🏀💯\n🔗 🔴Watch Live Fullᴴᴰ 👉 https://t.co/NIncpEyhPk ✅\n📆 :On Saturday. January 29 /2022\n⏰ : 8:30 PM\nDONT FORGET TO SHARE AND FOLLOW FOR MORE INFO AND UPDATE.",
    "477": "NBA Basketball Game Betting Picks Simulator: 8:40 PM ET - Brooklyn Nets vs. Golden State Warriors - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/XugfzfTNkR #nba #sportsbetting #freepicks #cappertek",
    "478": "Golden State Warriors vs Brooklyn Nets is on ESPN (Central America). With commentary from Alejandro Pérez. Co-commentator is Leo Montero.  For more details see https://t.co/OQctowNA5r #GoldenStateWarriors #BrooklynNets #ESPNCentralAmerica",
    "479": "Golden State Warriors vs Brooklyn Nets is on ESPN (Mexico). With commentary from Alejandro Pérez. Co-commentator is Leo Montero.  For more details see https://t.co/OQctowNA5r #GoldenStateWarriors #BrooklynNets #ESPNMexico",
    "480": "Golden State Warriors vs Brooklyn Nets is on ESPN 3 (South America). With commentary from Alejandro Pérez. Co-commentator is Leo Montero.  For more details see https://t.co/OQctowNA5r #GoldenStateWarriors #BrooklynNets #ESPNSouthAmerica",
    "481": "Golden State Warriors vs Brooklyn Nets is on ESPN Deportes. With commentary from Alejandro Pérez. Co-commentator is Leo Montero.  For more details see https://t.co/OQctowNA5r #GoldenStateWarriors #BrooklynNets #ESPNDeportes",
    "482": "@cyanshsharma007 @lancem69 @BrooklynNets And who wasn’t playing 🤨",
    "483": "Y’all the @BrooklynNets are getting into the Metaverse…who wants to see a brooklyn.nfts X Brooklyn Nets collab?! 🏀 🌆",
    "484": "All-Time Brooklyn/New Jersey Nets Team https://t.co/V9uE3JNzPO",
    "485": "Brooklyn Nets https://t.co/udGDSIre6N",
    "486": "@StartMcBride @NBA @SteveNash @StephenCurry30 @warriors @BrooklynNets kyrie isn't good now",
    "487": "Play against Brooklyn Nets will be tough",
    "488": "@BrooklynNets @HSpecialSurgery Casuals really thought Kyrie couldn’t play 🙄",
    "489": "Pick your side @BrooklynNets squadA or @warriors squad B #ballislife https://t.co/4OxDHsr1hG",
    "490": "Two of the greatest guards to ever play the game, @SteveNash &amp; @StephenCurry30! #NBA75 \n\nThe @warriors host the @BrooklynNets tonight for Saturday Primetime on ABC at 8:30pm/et. https://t.co/H5H965R87s",
    "491": "🔥 #NBASATURDAYS\n\n🏀 #BrooklynNets @ #DubNation\n\n📣 02:30 | LIVE su @SkySportNBA https://t.co/ktbivyGoyv",
    "492": "Big showing for Steph coming tonight against the Nets?\n\nWe've got a same game parlay for the Brooklyn/Golden State game ⬇️",
    "493": "@MolefiMofoken17 @NBA @BrooklynNets @warriors And who told you Kyrie aint playing",
    "494": "@NBA @BrooklynNets @warriors Not the Swamp Dragons. https://t.co/zy4eUJPRNb",
    "495": "still a lot time to join @BrooklynNets , akhi 🤧🤧🤧🥺🥺🥺🥺🥺🥺 https://t.co/BNZuhIRpAf",
    "496": "It’s a quadruple-header today on KPAYSports 1290 and 102.9 FM\n\n@ChicoWbb vs @SonomaSeawolves 12:45pm \n\n@ChicoState_MBB vs @SonomaSeawolves  3pm \n\nBrooklyn Nets @Warriors 5pm \n\nSharks vs Florida Panthers 8:30pm",
    "497": "@BrooklynNets @HSpecialSurgery Bring Millsap back. He can be a 3D player",
    "498": "TONIGHT ||| The #NBA Is Live On @953WDAE\n\n@BrooklynNets v @warriors \n\nCoverage Begins:  8:00pm\n\n📻 95.3FM | 620AM\n📱https://t.co/ofcFkfysEx On @iHeartRadio App or @ESPNRadio\n🔊 \"Play WDAE On IHeartRadio\" (Smart Speakers) https://t.co/dNLkKa4Glv",
    "499": "@NBA @BrooklynNets @warriors Nets",
    "500": "@BrooklynNets @KyrieIrving @KesslerEdwards @blakegriffin23 @Patty_Mills Where",
    "501": "#NBA\n\n📝 Brooklyn are 3-9 SU in their last 12 games against Golden State.\n📝 Golden State are 7-1 SU in their last 8 games at home.\n\n#Nets +265\n#Warriors -8\nO/U 227½\n\nSign up now for a premium #perhead service and get 2 weeks free! 👉 https://t.co/jUA8LsIyOe https://t.co/HzNeFCoLHg",
    "502": "@OfficialJohnRod @BrooklynNets Just gotta go 21-13 for that to happen, I don’t think it’s out of the realm of possibility, especially since we are on the road so much the next couple weeks",
    "503": "Brooklyn Nets Should ‘Shop’ 22-Year-Old Starter By Trade Deadline: Analyst https://t.co/J7m8nCGLvE",
    "504": "EXO’s LAY ‘莲 (LIT)’ was played at the\nNBA Basketball in New York during\nLos Angeles Lakers vs Brooklyn Nets game. https://t.co/qRxHqG03k5",
    "505": "@BrooklynNets her number is 25",
    "506": "@BrianRKey @bonesjackson2 @Chrispix720 @bnice19831 This current Brooklyn Nets team is the most easily hateable team I can think of. Durant, Harden, Griffin, and Irving are all such puds. I've never seen such a collection of unlikeable players. I do like Aldridge, Mills, and Millsap though.",
    "507": "Where Brooklyn at!! Lets go Nets 🔒- 1/21/22 https://t.co/SHW6tTrWWx",
    "508": "Consensus Line Move:\n2022-01-29 Brooklyn Nets at Golden State Warriors from 229.00 to 227.50\nUnder who saw that coming?\n#NBA #handicapper #dataanalysis #rich",
    "509": "@NBA2K @BrooklynNets 96 at least",
    "510": "@BrooklynNets @newyorklottery This would be an amazing prize as we are visiting from Ireland next month!",
    "511": "Lil’ Kim attends New York Knicks Vs. Brooklyn Nets. (2017) https://t.co/Yod1JE0Hut",
    "512": "@NBA @BrooklynNets @warriors The better one",
    "513": "@SC30myfave @NBA @BrooklynNets @warriors @StephenCurry30 warmups &gt;&gt;&gt;&gt;&gt;",
    "514": "@NBA @BrooklynNets @warriors Is this a question asked for all games every week? Don't recall, seriously,I don't. But #CarryOn Don't bury your leading ❓❓❓ @NBA 😂😂😂😂😂",
    "515": "@NBA @BrooklynNets @warriors I would prefer to watch kittens playing.",
    "516": "@NBA @BrooklynNets @warriors KAI own the Warriors https://t.co/BBxWMfkxD8",
    "517": "@NBA @BrooklynNets @warriors Go Splash brothers",
    "518": "@NBA @BrooklynNets @warriors I swear every one of these polls golden state wins",
    "519": "@NBA @BrooklynNets @warriors who CAAAAAAAAARES",
    "520": "@NBA @BrooklynNets @warriors I'd rather watch paint dry.",
    "521": "@NBA @BrooklynNets @warriors nets",
    "522": "Which team do YOU want to watch warm up before Saturday Primetime on ABC tonight? #NBAVote \n\n8:30pm/et: @BrooklynNets/@warriors",
    "523": "@SportsCenter The Bucks and Nuggets have a better big three than the Nets. The Nets are old, not happy in Brooklyn, hurt and can only play 50% of the time. They are just as accomplished as Kawhi and PG in LA.",
    "524": "New tumblr post: \"### NBA2K22 Brooklyn Nets vs Atlanta Hawks MyLeague PS4 GAMES...\" https://t.co/Mh8cbAwrdx ifttt, youtube",
    "525": "@BrooklynNets @newyorklottery #22 miss caris LeVert",
    "526": "If we had to put our bets in! We’d have to go with the @BrooklynNets https://t.co/4XrYUOKNJK",
    "527": "The Nets are 18-5 (2-2 this season) when it’s only Kyrie Irving and James Harden, and no Kevin Durant. \n\nBrooklyn has scored over 100 points in all 23 of those games. This season, the Nets are 13-2 (7-0 on road) when scoring 110-119 and 11-1 (8-1) on road) when scoring 120+. https://t.co/mXdwlIe96m",
    "528": "@eviilflame @dannnnnps @seahawksfan2314 @SportsCenter warriors smoked nets first game of the season without klay and kevon looney as our center 😭😭😭 brooklyn plays no defense. they’re done",
    "529": "Brooklyn Nets Deandre Bembry Showing off The Views From the Bay https://t.co/QeyOcTNycp",
    "530": "Golden State is favored by 8 points tonight against Brooklyn.\n\nDespite the Nets’ recent struggles, that’s a generous line for the Warriors given that there’s no Draymond Green and James Harden + Kyrie Irving await on the other side.",
    "531": "@BrooklynNets Let's go for the 7 spot tonight 🙌 🤣",
    "532": "Would love Holmes on the @BrooklynNets 🙏🏼 https://t.co/ZHyMmfCjNI",
    "533": "@complexity888 @BoonjiProject @andre Definitely the missing puzzle piece.  Mint your Loolee after you dust off the @BrooklynNets",
    "534": "The Brooklyn Nets' super-team is teetering between NBA dominance and falling apart https://t.co/9TUrW3OD0D via @Yahoo #movietitle 🎬  #partowner",
    "535": "Brooklyn Nets vs Warriors today would be explosive.",
    "536": "@gguccichris @BrooklynNets i did this to myself 😭😭",
    "537": "Basketball Predictions and Betting Trips through Tarot Reading – Golden State Warriors vs Brooklyn Nets on 29 January 2022 in NBA League https://t.co/eiFSWYME6J",
    "538": "@EGFanZone @HardensBetta @SportsCenter So you are saying the Nets need everybody to play to even have a chance? Thanks for saying the Bucks are better. The Bucks were super injured last time and still destroyed the Nets in Brooklyn.",
    "539": "1/29 Saturday College and NBA \n5-7 overall record\nCuse-1.5\nMary+1.5\nOklahoma+9\nBrooklyn Nets +8.5",
    "540": "I’m going with @BrooklynNets https://t.co/FmVaJzdBCQ",
    "541": "@Nawafsoprano9 @BrooklynNets Kai ain’t. He beat this clown before he’ll show up trust bro 🙏🏿",
    "542": "@lancem69 @BrooklynNets And Kai owns curry don’t get ut fucked up",
    "543": "The Brooklyn Nets are looking for more shooting in a potential Paul Millsap trade.  https://t.co/aO9pXTexpX",
    "544": "Brooklyn Nets Rookies Are Pretty Solid Role Players https://t.co/v4JkibQdkq",
    "545": "According to @MikeAScotto, the #Cavs #Cavaliers like #Nets SG-SF Joe Harris, but from afar, due to Brooklyn's asking price of a star.",
    "546": "@AndrewCuenca6 @BrooklynNets BUT I NEED TO BE HUMBLED RIGHT ?",
    "547": "@isojaybtw @mattmcfc_ @CratroidXd @BrooklynNets @HSpecialSurgery I think it’s just like New York, players from different team can play there but golden state players can’t play if they are not vaccinated..",
    "548": "I’ve notice the media been trying to cause chaos in the Brooklyn Nets locker room just to have a hot story. coming up with lies and fake stories 🤦🏿‍♂️",
    "549": "@BrooklynNets go get Holmes https://t.co/xWb6qxdarv",
    "550": "@LegionHoops @James_HamNBA @BrooklynNets  try and get HB",
    "551": "@mattmcfc_ @CratroidXd @BrooklynNets @HSpecialSurgery I’m just telling u what I was told lmao, they told me he can’t play in gs or ny without a vaccine",
    "552": "@BrooklynNets Let’s go now",
    "553": "@J_Nova_Kane @BrooklynNetcast And he only won player of the month 1 time lmao since joining the nets \n\nHarden was the mvp before he got hurt also and hes been better than kd since arriving in Brooklyn \n\nStop the cap",
    "554": "im going to throw hands why is the warriors vs nets game a blackout game here IM NOWHERE NEAR BROOKLYN FUCK THIS SHIT",
    "555": "Brooklyn nets https://t.co/DiSSr5v19z",
    "556": "This is disrespectful to the Brooklyn nets. https://t.co/UJCYxK5XPx",
    "557": "Is the @BrooklynNets  the worst super team ever assembled ?? #nba #basketball #Nets",
    "558": "Nets Gameday: Brooklyn looking to end season-high three-game losing... (The Brooklyn Game)\n\nThe Nets will begin a five-game road trip Saturday with a visit to Golden State to play the ...\n\nAdd your highlights:\nhttps://t.co/H9oxsyR7Po\n #Brooklyn_Nets",
    "559": "Saturday betting options🔥⏬\n\n🏇Pegasus World Cup\n+105 / O 2.5 | -135 / U 2.5\n⏰16:03 ET \n\n🏀@BrooklynNets🆚@warriors\n⏲️20:03 ET \n\n👊Bellator 273: Bader🆚Moldavsky\n+5.5 / +195 / O 47.5 | -5.5 / -245 / U 47.5\n⌛️18:00 ET \n\nBest Odds🔥⏬\nhttps://t.co/UOoXvd2FfD\n\n#Pegasus #sportsbet https://t.co/QyWRlhrSY2",
    "560": "@BrooklynNets are gonna win it all with the big Three. Titans amongst men, they will join forces at the moment of the loss of all hope, saving basketball, the world, and most importantly, themselves.",
    "561": "told u … @BrooklynNets https://t.co/uHBsWe9ZKV https://t.co/hFRHk1mx8n",
    "562": "@NBAFRANCE Brooklyn nets vainqueurs",
    "563": "Imma Join In on the Fun😂 Brooklyn Nets Kyrie Irving &amp; James Harden play Basketball Today #NetsWorld https://t.co/lTYkzkPSrP",
    "564": "@thatkidatrayne @myguyknowsaguy Who really watches a Warriors game on TV??? It’s the Lakers in the West &amp; Brooklyn Nets in the East . U think people really have time to watch Steph Curry ? 🤦🏻🤦🏻",
    "565": "NBA Player Props: Brooklyn Nets vs. Golden State Warriors - @SportsNerd824 has three winners for tonight's big #warriors vs #nets game!\n\nhttps://t.co/Wv2cvc71IL\n\n#nba #basketball #sportsbet #SportsGambling https://t.co/ed3VA9X1Qn",
    "566": "Just ONCE I want to see ANY @NBA team beat a 100% healthy @BrooklynNets team. Not one team on the planet can beat @KyrieIrving @JHarden13 Joe Harris @KDTrey5 @aldridge_12 That starting 5 is one of the best ALL-TIME!",
    "567": "@ClutchPage @yemeksepeti Brooklyn Nets",
    "568": "https://t.co/C9RyJpdbwV🏀TOP TIPS OF THE DAY🏀\n\n🇺🇸 NBA\n💥Golden State Warriors vs Brooklyn Nets:\n handicap (+9.5) for Brooklyn Nets👉 @ 1.62\n\n💥Miami Heat vs Toronto Raptors:\nvictory Miami for handicap (-5)👉 @ 1.83\n\n💥Memphis vs Wizards:\nhandicap (+9) for Wizards👉 @ 1.61 https://t.co/l1IO5sSwfc",
    "569": "@CratroidXd @BrooklynNets @HSpecialSurgery I think he can’t even play in gs so it should just be harden",
    "570": "@NBA That @BrooklynNets 🗑and @warriors 🌉 game gonna be 🔥",
    "571": "@reallygood127 @celtics @PelicansNBA @NBCSBoston @985TheSportsHub @BCCoachStevens @KyrieIrving uhm, I'm afraid you are using Internet Explorer. Did you not know notice we already had him, he was bad, a bad leader and extremely resentful when he left??? He is a Brooklyn Net nowadays.",
    "572": "@ClutchPage @yemeksepeti Brooklyn Nets",
    "573": "The Golden State Warriors play basketball today against the Brooklyn Nets!",
    "574": "@BrooklynNets - You already know… #LetEmKnow 🤣😄 https://t.co/TmqZZMDZmJ",
    "575": "Nets at Warriors: Prediction, point spread, odds, over/under, betting picks #Brooklyn #Nets #NBA https://t.co/uz2oG2ZxjP",
    "576": "2 Philadelphia 76ers Sixers ROW1 Cadillac Club tickets – Brooklyn NETS 3/10 #eBay🇺🇸 #Tickets #Sports #SportsTickets https://t.co/1uxw1hMohY",
    "577": "@BrooklynNets @HSpecialSurgery Millsap taking up space",
    "578": "Nets Gameday: Brooklyn looking to end season-high three-game losing streak – NBA News https://t.co/cEdCknbUoe",
    "579": "We talkin play in for the Brooklyn Nets already? My god. We really in the bad of shape? Wish people had @Keith_McPherson attitude. No wonder I’m a glass empty person reading Twitter at times #NetsWorld",
    "580": "With The Deadline 12 Days Away The Brooklyn Nets  have Three TPEs of 11.5M 6.3M &amp; 3.4M \n⁃Six Rookies\n⁃No Draft picks this year &amp; cant trade a first till 2028 \n⁃Only two seconds thru 2025 then seconds in 2026 2028 2029\n⁃No cash considerations",
    "581": "@SportsCenter Doesn’t matter @BrooklynNets are never healthy",
    "582": "@BrooklynNets Curry owns y'all",
    "583": "NBA Player Props: Brooklyn Nets vs. Golden State Warriors - @SportsNerd824 has three winners for tonight's big #warriors vs #nets game!\n\nhttps://t.co/Ji1Br1nM3b\n\n#nba #basketball #sportsbet #SportsGambling https://t.co/H6zD8nbbUc",
    "584": "Check out 2020-21 KEVIN DURANT Stained Glass Refractor Brooklyn Nets Mosaic Basketball  https://t.co/huuZZptryB via @eBay",
    "585": "Brooklyn Nets! https://t.co/11f8BcLmx6",
    "586": "🚨THE DICE HAVE SPOKEN🚨\n1/29 @MoneylineDice Roll:\n\n#NBA\n6U #Warriors -8 💰MAX💰\n\nCheck out our Dice/Notebooks @ https://t.co/tnaCLx2J5V\n\nTrack our rolls: https://t.co/3elvJGWB0V\n\n#GamblingTwitter #Brooklyn #Nets #GSW #GoldenStateWarriors https://t.co/Js1cXU5duI",
    "587": "@BrooklynNets Please dont play Aldridge.. \nI mean if there was EVER  a time you bench him, it's this one. \nPlay only one big lineups with clax and day ron. 30 minutes to clax, 18 to DayRon",
    "588": "Brooklyn Nets’ James Harden ‘ready to go’ after missing NBA game with hamstring injury https://t.co/zqEegSLVqc",
    "589": "@CauXion_ @SportsCenter In a 3 v 3 Nets is washing lmao. Warriors got years together this only Brooklyn 2nd year",
    "590": "@SportsCenter If Curry and Thompson get hot from behind the 3-point line, it's going to be wrap. It'll be yet another game where the Nets wish that they had Harris. \n\nGolden State Warriors 124\nBrooklyn Nets 118",
    "591": "TONIGHT || The #NBA Is Live On @953WDAE\n\n@BrooklynNets v @warriors \n\nCoverage Begins:  8:00pm\n\n📻 95.3FM | 620AM\n📱https://t.co/ofcFkfysEx On @iHeartRadio App or @ESPNRadio\n🔊 \"Play WDAE On IHeartRadio\" (Smart Speakers) https://t.co/rehOvL0ZNC",
    "592": "Will Brooklyn find a way to steal a win at the Chase Center tonight? \n\nPlace your early bets now→ https://t.co/xCxoQKJpa0\n\n#Nets #Warriors #NBA https://t.co/GYF4upxF6l",
    "593": "NBA STUFF… 🏀\n\nWarriors way better Big 3.\nWho disagrees? 🤔\n\n@BrooklynNets vs @warriors https://t.co/CI7RNOdl7S",
    "594": "@BrooklynNets Vs @warriors , @WWE Royal rumble, @FlaPanthers game…idk if I have enough screens tonight 🧐🤔😬",
    "595": "[{\"team\":\"Phoenix Suns\",\"fg_pct\":0.477},{\"team\":\"Chicago Bulls\",\"fg_pct\":0.475},{\"team\":\"Brooklyn Nets\",\"fg_pct\":0.471}...}]\n\nBRK 3rd in NBA team FG% ahead of tonight vs GSW\n\n#api #python #DataAnalytics #basketball",
    "596": "The Brooklyn Nets' super-team is teetering between NBA dominance and falling apart – NBA News https://t.co/nRoy0seRAF",
    "597": "Nets at Warriors: Stream, lineups, injury reports and broadcast info for Saturday #Brooklyn #Nets #NBA https://t.co/sc1ID5fxwL",
    "598": "New Orleans Pelicans - Boston Celtics\nMiami Heat - Toronto Raptors\nGolden State Warriors - Brooklyn Nets\n\nBet slip link: https://t.co/KxLIWXgfgK https://t.co/mmIRYFrwld",
    "599": "Brooklyn Nets vs. Golden State Warriors https://t.co/yPVvDCa7GP",
    "600": "Play the @NewYorkLottery scratch-off to instantly win prizes, including Nets tickets, autographed merch, and more!",
    "601": "Analyzing Saturday’s Brooklyn Nets at Golden State Warriors odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/321CeB4Lct",
    "602": "@BrooklynNets Kyrie playing at least 🙏🏾",
    "603": "Brooklyn Nets at Golden State Warriors odds, picks and prediction https://t.co/5ZBH9qzvV2",
    "604": "Consensus Line Move:\n2022-01-29 Brooklyn Nets at Golden State Warriors from 230.50 to 229.00\nUnder market flood\n#NBA #CryptoHoops #tech #blockchain",
    "605": "Consensus Line Move:\n2022-01-29 Brooklyn Nets at Golden State Warriors from -6.50 to -7.50\n#DubNation did I do that?\n#NBA #bettingonline #dataanalyst #investing",
    "606": "TONIGHT | Watch the Golden State Warriors vs. the Brooklyn Nets right here on ABC10. https://t.co/UYWcGfnkCt",
    "607": "GAME DAY!\n\n🆚️ Brooklyn Nets \n⏰ 22h30 \n📍 Chase Center\n📺 ESPN\n\n#DubNation https://t.co/mYDtZ2Zv4t",
    "608": "@BrooklynNets Lets Go Nets",
    "609": "@BrooklynNets get ready to get whooped",
    "610": "@BrooklynNets Please don't show harden what it looks like in NYC today. He gonna wanna leave for sure",
    "611": "@bellacfc @BrooklynNets @HSpecialSurgery he injured the same ankle from 2020, might be back soon now.",
    "612": "@BrooklynNets Play Kyrie 40+ mins, we need him to win us games.",
    "613": "The Brooklyn Nets' super-team is teetering between NBA dominance and falling apart https://t.co/lMAurI4HQN",
    "614": "@BrooklynNets Fire Nash",
    "615": "The Brooklyn Nets visit the Golden State Warriors tonight! How will it pan out? Our man @TillJam3 is here with his analysis, prediction and picks for tonight’s marquee matchup in California. 🏀https://t.co/zMq6I1COdn",
    "616": "2018 brooklyn nets&gt;&gt; literally any team ever #NBA https://t.co/YdpUC0REQ9",
    "617": "@BrooklynNets Nets fans no need to watch this game l😆",
    "618": "@BrooklynNets @HSpecialSurgery WHENS JOEY BUCKETS BACK ITS BEEN 2 AND A HALF MONTHS",
    "619": "@BrooklynNets @HSpecialSurgery is joe harris on his death bed or something because what kind of ankle injury is this man",
    "620": "@BklynBreedGC @BrooklynNets They better!!",
    "621": "Random edit Idea.\nAvatar the last Airbender Intro\nWater: Curry splashing the three against the 2016 OKC\nEarth: Andre Drummond grabbing a rebound\nFire: Kevin Garnett defensive intensity\nAir: Lamelo or Magic Flashy Pass\nBrooklyn Nets as the Fire nation",
    "622": "@DarrellNeloms @BrooklynNets Thanks man! Nets better win! 😂😂",
    "623": "@Lamar95008948 @BrooklynNets he’s playing tn wym",
    "624": "@greeaase @nickclemente6 @BrooklynNets yes he is",
    "625": "Nets Warriors tonight. HUGE game for Brooklyn. Saturday Night Primetime. Should be a fun one🍿💯",
    "626": "@BklynBreedGC @BrooklynNets Oh snaps! Happy Birthday, Bro Bro!! 💯💯💯",
    "627": "@BrooklynNets @HSpecialSurgery Please trade Millsap already for the love of god lol",
    "628": "@BrooklynNets (29-19)-@warriors (36-13)\n📺NBA LEAGUE PASS📺\n#DubNation https://t.co/zbYbizpBmV",
    "629": "@BrooklynNets @HSpecialSurgery Clax and KAI are back tonight!",
    "630": "@BrooklynNets @HSpecialSurgery Clax attack is back baby",
    "631": "@2UWCHK @NBA_NewYork There was no Brooklyn nets when Riley left LMFAOOOOO",
    "632": "Dhamakedar Sunday = Watching NBA action in Hindi 🤩\n\nWatch the @brooklynnets take on the @warriors LIVE tomorrow at 7:00 AM in Hindi only on @mtvindia.\n\n#NBA75 #NBAonMTV #NBAonVoot #NBAonVh1 #NBAonJioTV #NBAIndia #IndiaBasketball #NBALive #Basketball #sports #dunks #balllife https://t.co/Q6k7djln6W",
    "633": "@Hargoat13 @BrooklynNets you don’t believe that",
    "634": "DasHaus made a bet!\n\nEvent: Brooklyn Nets vs Golden State Warriors #NBA\nBet: Golden State Warriors TO WIN -6.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "635": "@nickclemente6 @BrooklynNets It’s an away game so I assume so",
    "636": "Nets @HSpecialSurgery Status Report for tonight’s game at Golden State https://t.co/VXrVBInYaz",
    "637": "@greeaase @BrooklynNets He’s playing?",
    "638": "@BrooklynNets y’all better win tonight. It’s my birthday! 😂😂",
    "639": "@BrooklynNets Please win",
    "640": "@BrooklynNets SHIIIIIT eyes 👀 AINTS goin nowhere. Eyes is gonna stay home and collects Dems ders big ass checks. 😂 https://t.co/L93hryfihm",
    "641": "@BrooklynNets Let’s get these W’s",
    "642": "@BrooklynNets we have to win",
    "643": "Brooklyn Nets Lot - Durant Optic Hyper Pink, Irving Express Lane.\n\n$3 https://t.co/OwvjNWpcL9",
    "644": "@BrooklynNets We're gonna get our ass kicked",
    "645": "⭐️ ⭐️ ⭐️ ⭐️ ⭐️ \n#NetsWorld | BEST OF 21-22\n\n@KyrieIrving | @BrooklynNets\n\n#NBASaturdays | 02:30 | @SkySportNBA https://t.co/S0BXfgzz04",
    "646": "[Boston Celtics Trade Idea]\nTrade from the Nets\nBring Kyrie back again\nHe will be the savior of Celtics 🍀\nIf this trade market is difficult, aim\nfor Next year's FA, ok Celtics\nRestart\n\n@celtics @KyrieIrving @jaytatum0 @BrooklynNets @BCCoachStevens https://t.co/jyDfFFMoYJ",
    "647": "@DarthVoita @CP3 @espn Why is it that the suns aren’t getting NO press ? Now that I think about it, oh the @BrooklynNets get so much coverage and are a circus side show yet the #chrispaul and @DevinBook team get NO LOVE. They were just in the FINALS and are the BEST TEAM. Yeah OK",
    "648": "@ClutchPage @yemeksepeti Brooklyn Nets",
    "649": "@ClutchPage @yemeksepeti Brooklyn Nets",
    "650": "@zaybucks28 @brooklynnets85 I’m a fan of the Harden agenda, not the Brooklyn Nets",
    "651": "Brooklyn Nets vs  Golden State Warriors Prediction 1/29/22 - Free NBA Picks https://t.co/yvZOEnOVKW via @YouTube \n\n#NBA #NBAPick #NBAPrediction #Basketball #NBATwitterLive",
    "652": "@ClutchPage @yemeksepeti Brooklyn Nets",
    "653": "@BrooklynNets hi there! We’re travelling from Galway, Ireland for our belated 10 year wedding anniversary and would love to get tickets to the Celtics game on Friday 25th February 2022. Please can you point us in the right direction as we don’t want to get ripped off 🙂",
    "654": "@ClutchPage @lanset99 @yemeksepeti Brooklyn Nets",
    "655": "Best of Hot game 🔥\n\n(1/29) at Chase Center\n[29-19] Nets vs Warriors [36-13]\n\n※Irving,Harden,Thompson (yes)/Durant,Green (no)\n\n@KyrieIrving @JHarden13 @BrooklynNets @warriors \n@StephenCurry30 @KlayThompson https://t.co/n0QPguDYVK",
    "656": "@ClutchPage @yemeksepeti Brooklyn Nets",
    "657": "Companies exploring the #metaverse:\n\n- Nike\n- Meta\n- Sony\n- Apple\n- Puma\n- Nvidia\n- Disney\n- Adidas\n- Walmart\n- Samsung\n- Microsoft\n- Warner Music\n- Brooklyn Nets",
    "658": "@KhmaladzeG @Shot_Quality @mdludwig2 @dallasmavs @NetsRepublic @BrooklynNets @celtics @warriors i was looking for other @BrooklynNets stats too 😆, thought i was bugging out . good stuff",
    "659": "San Antonio Spurs vs Brooklyn Nets - Full Game Highlights | January 9, 2022 | 2021-22 NBA Season\nhttps://t.co/LpxMWcS4Gv\nhttps://t.co/LpxMWcS4Gv",
    "660": "@ClutchPage @yemeksepeti Brooklyn Nets",
    "661": "Inside Nets draft steal Kessler Edwards' emergence and shot-doctor ... (New York Post)\n\nSign up here to get Inside the Nets delivered to your inbox each Saturday morning.The Nets, ...\n\nAdd your highlights:\nhttps://t.co/FZRr5Wqfj1\n #Brooklyn_Nets",
    "662": "@ClutchPage @yemeksepeti Brooklyn Nets",
    "663": "NEW BROOKLYN BUZZ⚫️⚪️🎙️\n\n@JacManuell and I talk Nets trades! \n\n- Assets \n- Targets \n- Twitter proposals \n- AND MORE\n\nApple:\nhttps://t.co/d0JczGyTzC\n\nSpotify:\nhttps://t.co/BoQzauJsjJ",
    "664": "Today is a special day for me. 10 years ago on this day I went to my first NBA game and became a New Jersey (now Brooklyn) Nets fan!🎉🎉\n\nOne decade of great memories and moments down, a lifetime to go🖤🤍 https://t.co/At1QSiNihz",
    "665": "Dhamakedar Sunday = Watching NBA action in Hindi 🤩\n\nWatch the @brooklynnets take on the @warriors LIVE tomorrow at 7:00 AM in Hindi only on @mtvindia.\n\n#NBA75 #NBAonMTV https://t.co/WHfTIGrKnS",
    "666": "@BrooklynNets don’t ruin this for me https://t.co/LMLAUhi5qW",
    "667": "Steve Nash hasn't often had all of the clubs in his bag since becoming coach of the Brooklyn Nets. But with Kevin Durant sidelined, he has a chance to make his mark on the club.\n\n#NetsWorld | #NBATwitter | #NBAAllStar https://t.co/8gCwlJTiFT",
    "668": "Brooklyn Nets Highlights vs. San Antonio Spurs | 1/9/22\nhttps://t.co/KmykSZgF9U\nhttps://t.co/KmykSZgF9U",
    "669": "NBA Matchup: \n\nBrooklyn Nets @ Golden State Warriors tonight at 8:30pm ET on ABC. https://t.co/mYTJVHXs6b",
    "670": "Inside Nets draft steal Kessler Edwards’ emergence and shot-doctor sessions with Kyle Korver #Brooklyn #Nets #NBA https://t.co/3JCpI2nr6P",
    "671": "Golden State Warriors vs Brooklyn Nets is on DAZN Schweiz [$] (geo/R). With commentary from Flo Pertsch.  For more details see https://t.co/OQctowNA5r #GoldenStateWarriors #BrooklynNets #DAZNSchweizgeoR",
    "672": "Golden State Warriors vs Brooklyn Nets is on DAZN Deutsch [$] (geo/R). With commentary from Flo Pertsch.  For more details see https://t.co/OQctowNA5r #GoldenStateWarriors #BrooklynNets #DAZNDeutschgeoR",
    "673": "@ClutchPage @yemeksepeti Brooklyn Nets",
    "674": "It's a star-studded affair in the Bay! 🔥\n\nCatch the @brooklynnets take on the @warriors LIVE at 7:00 AM tomorrow in Hindi on @MTVIndia, and in English on @Vh1India, @VootSelect, and @OfficialJioTV!\n\n#NBA75 #NBAonMTV #NBAonVh1#NBAonVootSelect #NBAonJioTV #NBALiveinIndia https://t.co/xjeuPJDDKo",
    "675": "TONIGHT | The #NBA Is Live On @953WDAE\n\n@BrooklynNets v @warriors \n\nCoverage Begins:  8:00pm\n\n📻 95.3FM | 620AM\n📱https://t.co/ofcFkfysEx On @iHeartRadio App or @ESPNRadio\n🔊 \"Play WDAE On IHeartRadio\" (Smart Speakers) https://t.co/HQ0tlgSqtw",
    "676": "NBA VIP BETTING TIP: Golden State Warriors vs Brooklyn Nets https://t.co/pLmYsZWwf9",
    "677": "@ClutchPage @yemeksepeti Brooklyn Nets",
    "678": "Golden State Warriors - Brooklyn Nets İddaa Tahmini 30.01.22\nhttps://t.co/1TfCw4xsKv",
    "679": "@ClutchPage @yemeksepeti Brooklyn Nets",
    "680": "@BrooklynNets Cam Thomas is a bucket 🏀 getter big up to the 757 keep grinding young bro",
    "681": "@ClutchPage @yemeksepeti Brooklyn Nets",
    "682": "@ClutchPage @yemeksepeti Brooklyn Nets",
    "683": "INSANE ENDING! Brooklyn Nets vs San Antonio Spurs Final Minutes Of Overtime! 2021 NBA Season\nhttps://t.co/eF13m2WqAe\nhttps://t.co/eF13m2WqAe",
    "684": "@ClutchPage @yemeksepeti Brooklyn Nets",
    "685": "Highlights: Lonnie Walker's 25 PTS vs. Brooklyn Nets | 2021-22 San Antonio Spurs Season\nhttps://t.co/5dKBRm8zch\nhttps://t.co/5dKBRm8zch",
    "686": "@ClutchPage @yemeksepeti Brooklyn Nets",
    "687": "@ClutchPage @yemeksepeti Brooklyn Nets",
    "688": "@ClutchPage @yemeksepeti Brooklyn Nets",
    "689": "@ClutchPage @yemeksepeti Brooklyn Nets",
    "690": "@ClutchPage @yemeksepeti Brooklyn Nets",
    "691": "@ClutchPage @yemeksepeti Brooklyn Nets",
    "692": "@ClutchPage @yemeksepeti Brooklyn Nets",
    "693": "Pronostico Baloncesto NBA Golden State Warriors - Brooklyn Nets (30-Enero-2022) - https://t.co/ywimNkly2V\n\n#pronosticos #pronosticosfutbol #pronosticosapuestas #apuestasdeportivas #pronosticosgratis https://t.co/QjvMRWRTZM",
    "694": "@ClutchPage @yemeksepeti Brooklyn Nets",
    "695": "@ClutchPage @yemeksepeti Brooklyn Nets",
    "696": "@ClutchPage @yemeksepeti Brooklyn Nets",
    "697": "@ClutchPage @yemeksepeti Brooklyn nets",
    "698": "@ClutchPage @yemeksepeti Brooklyn Nets",
    "699": "@BrooklynNets @YESNetwork \n\nJust let me know. Ive had this domain for 2 months now.\n\nhttps://t.co/3gEFRf289Z",
    "700": "@NBAAllStar @KDTrey5 @BrooklynNets How's going to start for KD?",
    "701": "@ClutchPage @yemeksepeti Brooklyn Nets",
    "702": "@ClutchPage @yemeksepeti Brooklyn Nets",
    "703": "ALERT: New high roller bet posted!\nA bet has been placed for $5007.56 on Golden State Warriors - Brooklyn Nets to win $9,113.77.\nTo view this bet or copy it https://t.co/lG289SGBBG https://t.co/XMrCIiL5H7",
    "704": "Highlights: Dejounte Murray's 19 PTS, 12 AST vs. Brooklyn Nets | 2021-22 San Antonio Spurs Season\nhttps://t.co/wNqQ4hY6Ck\nhttps://t.co/wNqQ4hY6Ck",
    "705": "The @BrooklynNets take a trip to the Bay Area to face the @Warriors in tomorrow's action!\n\nCatch it LIVE at 7:00 AM in Hindi on @MTVIndia, and in English on @Vh1India, @VootSelect, and @OfficialJioTV!\n\n#NBA75 #NBAonMTV #NBAonVh1 #NBAonVootSelect #NBAonJioTV #NBALiveinIndia https://t.co/X9q3cAp9KX",
    "706": "Who's gonna excited tommorrow?\nWarriors vs. Brooklyn Nets \n-Hoping they win 🙏🥺",
    "707": "Wardell Curry the Second will have his 2nd straight game of shooting over 50% from three and 50% from the field against the Brooklyn Nets at home",
    "708": "@BrooklynNets go get John Collins or Nurkic!!!!   Get Bruce Brown, James Johnson, and Milsap up outta here...",
    "709": "Tho macocomplete na fave jerseys ko! \n\nI have Miami Heat (city pink), Brooklyn Nets (basquiat), Toronto Raptors (98-99) tas bili pa ako Charles Barkley Phoenix Suns and Allen Iverson Philadelphia 76ers!",
    "710": "Empresas explorando o metaverso:\n\n- Nike\n- Meta\n- Sony\n- Apple\n- Puma\n- Nvidia\n- Disney\n- Adidas\n- Walmart\n- Samsung\n- Microsoft\n- Warner Music\n- Brooklyn Nets\n\n@BitcoinSignalsFutures",
    "711": "Highlights: San Antonio Spurs 119, Brooklyn Nets 121 | 01.09.22\nhttps://t.co/HDV3EB8ezT\nhttps://t.co/HDV3EB8ezT",
    "712": "@werner_milan @kirkgoldsberry @celtics @dallasmavs @Suns @MiamiHEAT @dmorey @Lakers @BrooklynNets @nyknicks @chicagobulls @warriors When your best player is in a 2 month shooting slump, it will effect your offensive rating, also missing Draymond the best facilitator on the team.",
    "713": "💥JUST IN: The major companies that entered the world of Metaverse 👇\n\n- Nike\n- Meta\n- Sony\n- Apple\n- Puma\n- Nvidia\n- Disney\n- adidas\n- Walmart\n- Samsung\n- Microsoft\n- Warner Music\n- Brooklyn Nets\n-Alibaba\n-Epic Games\n-Zara https://t.co/fVtHh5PLDg",
    "714": "Harden to Simmons, do it @BrooklynNets @sixers https://t.co/9A1Fcdibja",
    "715": "The Brooklyn Nets are not making it to the NBA Finals",
    "716": "Denver Broncos Tap Allen &amp; Co to Run Potential Record Sale. Sportico recently valued Broncos at $3.8bn; the previous record valuation for a sports team was $3.3bn in 2019 when Joe Tsai bought the rest of the Brooklyn Nets and Barclays Center. https://t.co/xehaVk8SFS via @sportico",
    "717": "🏀 Kyrie Irving pone en jaque a los Brooklyn Nets\n\n@NachoGuti23 \nhttps://t.co/Taqm40fTTg",
    "718": "Companies exploring the metaverse:\n\n- Nike\n- Meta\n- Sony\n- Apple\n- Puma\n- Nvidia\n- Disney\n- Adidas\n- Walmart\n- Samsung\n- Microsoft\n- Warner Music\n- Brooklyn Nets",
    "719": "That net really wasn’t that wide. He casted that net from Buffalo to Brooklyn. I guess tho https://t.co/ybYT8b5Yfo",
    "720": "@kirkgoldsberry @celtics @dallasmavs @Suns @MiamiHEAT @dmorey @Lakers @BrooklynNets @nyknicks @chicagobulls @warriors The hawks 💀💀 no. 1 offence but give it right back at the other end",
    "721": "San Francisco Bay Area ABC tv 7, Golden State Warriors vs. Brooklyn Nets @ Chase Center, SF 5:30 TV 7 - SF Area Saturday, January 29th, 2022",
    "722": "Brooklyn Nets vs. Golden State Warriors Prediction, Preview, and Odds - 1-29-2022 - Winners and Whiners https://t.co/Ne5N5hUBpQ",
    "723": "Game Preview: Warriors vs. Nets - 1/29/22: HOMESTAND FINALE The Warriors will play their seventh and final game of a two-week homestand on Saturday as they welcome the Brooklyn Nets to Chase Center for an NBA Saturday primetime showdown. The Dubs have… https://t.co/EMuM7N7STG",
    "724": "My little boy is representing the @BrooklynNets today. 🏀 #NBA #Nets https://t.co/4IFuAbn2xH",
    "725": "@matthew99427781 @kirkgoldsberry @celtics @dallasmavs @Suns @MiamiHEAT @dmorey @Lakers @BrooklynNets @nyknicks @chicagobulls @warriors 5-17, 2-8 to blame for that - this season has proven of the two, who your most important player is",
    "726": "@kirkgoldsberry @celtics @dallasmavs @Suns @MiamiHEAT @dmorey @Lakers @BrooklynNets @nyknicks @chicagobulls @warriors @matthew99427781 Boston woken up",
    "727": "#RT @NGSCSports: #RT @NGSCSports: #RT @NGSCSports: NBA Swing: Is This the End of the Big Three Era in Brooklyn? @NGSCSports @NBA @BrooklynNets \n\nhttps://t.co/solU3IRvet",
    "728": "The Brooklyn Nets are looking for more shooting in a potential Paul Millsap trade.  https://t.co/dLRLpVLoCo",
    "729": "Brooklyn Nets gets another chance to reclaim victory from the Golden State Warriors, who ended their previous game with 99-117 in favor of the latter. 🏀 Watch the game as it happens with the #GlobeNBA League Pass: https://t.co/4nYNBrXBqm https://t.co/5VMG4DGddA",
    "730": "#RT @NGSCSports: #RT @NGSCSports: NBA Swing: Is This the End of the Big Three Era in Brooklyn? @NGSCSports @NBA @BrooklynNets \n\nhttps://t.co/VWHjxTdQAG",
    "731": "Another NBA vaccination controversy is brewing in San Francisco with Kyrie Irving and the Brooklyn Nets scheduled to play the Golden State Warriors at Chase Center on Saturday night.\n https://t.co/B4qNs51S2q",
    "732": "Companies exploring the metaverse:\n\n- Nike\n- Meta\n- Sony\n- Apple\n- Puma\n- Nvidia\n- Disney\n- Adidas\n- Walmart\n- Samsung\n- Microsoft\n- Warner Music\n- Brooklyn Nets",
    "733": "RT TheJayShah3: James Harden trying to carry the Nets without KD and Kyrie:\n\n#Nets #Lakers \n https://t.co/fGEABRkujL #BrooklynNets",
    "734": "@NBA2K @BrooklynNets No Bismack update ? He deserves at least a + 5. 🤬",
    "735": "#RT @NGSCSports: #RT @NGSCSports: NBA Swing: Is This the End of the Big Three Era in Brooklyn? @NGSCSports @NBA @BrooklynNets \n\nhttps://t.co/z1HJtDymLq",
    "736": "Brooklyn Nets' James Harden to return after missing game\nwith hamstring injury \nhttps://t.co/SbyvJAj2cq",
    "737": "A big S/O to the @hornets for beating the @Lakers 🏀 lezinja besezi mila impiko for beating the @BrooklynNets 🤣",
    "738": "NBA front-office executives are reportedly prepared to ask the league to investigate potential collusion if Brooklyn Nets superstar James Harden lands with the Philadelphia 76ers on a sign-and-trade deal this summer.",
    "739": "such as Portland Trail Blazers guard Damian Lillard, Washington Wizards guard Bradley Beal, Boston Celtics guard/forward Jaylen Brown or Brooklyn Nets guard James Harden.",
    "740": "@CMilholenSB Hypothetically situation. Nets-Bucks second round rematch. Game 7 in Brooklyn, what do you think Kyrie does?",
    "741": "James Harden can become a free agent this season, and the Brooklyn Nets star is reportedly interested in joining the Philadelphia 76ers, as ESPN's Kendrick Perkins reported on the All the Smoke podcast.",
    "742": "@andy8052 1% @BrooklynNets ownership",
    "743": "@TrapZacks @AIxAnalyst @SportsCenter had enough skill to send your brooklyn nets home",
    "744": "Brooklyn Nets’ James Harden to return after missing game with hamstring injury https://t.co/73SQId7wPp",
    "745": "James Harden set to return for Nets clash with Warriors (New York Post)\n\nAfter watching James Harden practice, Nets coach Steve Nash declared the guard would be read...\n\nAdd your highlights:\nhttps://t.co/Str135hg22\n #Brooklyn_Nets",
    "746": "21finz just discovered: Brooklyn Nets' James Harden to return after missing game with hamstring injury - https://t.co/j6wmE8i0uC",
    "747": "@KingTechnical08 @tonyelgringo12 @BleacherReport Maybe start your own Disney+ series “the Brooklyn Nets what If”",
    "748": "RT SomeonesAnIdiot: Playing in the NBA seems to be way too tough for the #Nets \n\n(via Johnpaolo_Fera) https://t.co/p68a2Am3Na #BrooklynNets",
    "749": "Brooklyn Nets player Kyrie Irving is set to take the court against the Warriors in a huge match-up at Chase Center Saturday. The problem is Irving is not vaccinated. https://t.co/I1nzGiLpI0",
    "750": "Looking at Nets jersey, why is Brooklyn shortened to BKLYN, not BRKLYN?",
    "751": "Watch Los Angeles Lakers star LeBron James drop 33-7-6-3-2 to beat the Brooklyn Nets Tuesday.  https://t.co/svf7YZwAfl",
    "752": "@celticsfuckyou @kirkgoldsberry @celtics @dallasmavs @Suns @MiamiHEAT @dmorey @Lakers @BrooklynNets @nyknicks @chicagobulls @warriors losing to the hawks smh",
    "753": "@MicahRoschke It's there own fault, they don't bitch and moan like little girls to the refs like the @warriors @BrooklynNets @MiamiHEAT @Suns @Lakers @chicagobulls do  maybe if they did they would get more calls.",
    "754": "Yes Philly is going to hold on to Ben until this summer in hopes they can trade with the Brooklyn Nets for James Harden https://t.co/s20XnVTUtA",
    "755": "@enzgomez @japor13 Well on paper at the very least. Plus you were the 2nd predicted title favorite behind brooklyn before the season started. With a 1st rd exit to boot. 😅\n\n1.Nets\nDurant - weak knees\nHarden - out of shape\nKyrie - part time\n\n2.Lakers\nJames - old\nDavis - made of glass\nWestbrick",
    "756": "Brooklyn #Nets' James Harden to return after missing game with hamstring injury - https://t.co/UtHBJdmfIt #NBA #NBA75 #NBATwitter #NBATwitterLive #NetsWorld https://t.co/EdtjranA7l",
    "757": "Brooklyn Nets Fathers Day Chain by SalemDianaDesigns via @Etsy https://t.co/DRGgKv22xA",
    "758": "Nets should trade Harden lol he not staying in Brooklyn another season. Might as well get something. I know they betting on winning a ship and he stay or even if he leaves they still get a title out of it. High risk high reward",
    "759": "Brooklyn Nets' James Harden to return after missing game with hamstring injury https://t.co/eew2wpuP63 https://t.co/9H6qdLD6gV",
    "760": "Brooklyn Nets' James Harden to return after missing game with hamstring injury https://t.co/uV7czhTFwL",
    "761": "When they press start immediately after you hit a bucket, you already know they about to quit lol #PS5Share #NBA2K22 \n#BrooklynNets https://t.co/edV6H4EBtj",
    "762": "Hey @NBA I'm tampering: @JHarden13 demand a trade to Philly, tell @BrooklynNets Ben is an awesome teammate and is truly committed to improving his game",
    "763": "What We All NEED To Know About the Brooklyn Nets This Season https://t.co/WHegZiGqfX",
    "764": "@_MoneyMolina We not talking about that bro lol. We’re talking about the Brooklyn Nets losing to the Lakers, 1.25.22. Dont point out the better team or healthy or none of that. I’m just saying it to both ways. Ya wasn’t healthy &amp; lost, to the same team you been talking shit about all year.",
    "765": "Companies exploring the #metaverse:\n\n- @Nike \n- @Sony\n- @Apple\n- @Puma\n- @Nvidia\n- @Disney\n- @Adidas\n- @Walmart\n- @Samsung\n- @Microsoft\n- @wbpictures \n- @BrooklynNets \n+ @bloktopia #blok #Bloktopia $blok",
    "766": "Brooklyn Nets Big 3 Poster Basketball Painting Hand Made Posters Canvas Print Kids Wall Art Home Man Cave Gift Decor (36\"x24\" Ready to Hang)\nhttps://t.co/gEqltEYWEk",
    "767": "@bigballerkhat What about Brooklyn nets Isaiah whitehead",
    "768": "Good to know that @JHarden13 is staying with the @BrooklynNets instead of any teams. Congratulations to @davidortiz on the hall of fame induction. Didn’t know @NHLFlyers is on the worst losing streak recently.",
    "769": "@Ali_Szn14 @big_business_ he did the same thing to the nets in brooklyn third game of the season",
    "770": "@ta__mka @Lakers @celtics Hell did y’all win y’all last game? @BrooklynNets",
    "771": "@myfabolouslife @jimjonescapo @mainohustlehard @DaveEast yall some knicks fans ? Can we get y’all at some @BrooklynNets games 🗽",
    "772": "@LegionHoops @ZachLoweNBA Bring back Spencer @BrooklynNets",
    "773": "next date i go on gon be a brooklyn nets game",
    "774": "BROOKLYN NETS vs\nGOLDEN STATE WARRIORS, 9:30PM.",
    "775": "Companies exploring the #metaverse:\n\n- @Nike \n- @Meta \n- @Sony \n- @Apple \n- @PUMA \n- @nvidia \n- @Disney \n- @adidas \n- @Walmart \n- @Samsung\n- @Microsoft \n- @warnermusic\n- @BrooklynNets",
    "776": "DENVER NUGGETS 124-118\nBROOKLYN NETS, Final.",
    "777": "NBA LIVE – LA LAKERS vs. BROOKLYN NETS | Nba Live Today https://t.co/0YO2SrlJWo",
    "778": "Jason Kidd Game-Worn Warm-Ups 2002-03 Fleer Flair New Jersey #Nets HOF # CK-JK #NBA #Brooklyn #TheHobby ⁦@BrooklynNets⁩ https://t.co/1NrMTUY7if @eBay",
    "779": "@TerryFranconia @rise_and_grime @SilvioJD22 @BrooklynNets Then trade Harris for someone who can rebound",
    "780": "LeBron James reacts to viral moment with Austin Reaves’ confused face https://t.co/RIkWzG6A47 via @YahooSports @YahooSportsNBA @Lakers @BrooklynNets @TheAthletic @TheAthleticLA @TheAthleticNYC @TheAthleticNBA",
    "781": "Nets hope to avoid ultra-tight East's playoff play-in (New York Post)\n\nIt is not a likely scenario, but it is a realistic one.\n\nAdd your highlights:\nhttps://t.co/fcnqg7LUmr\n #Brooklyn_Nets",
    "782": "@ZubizuBags @trusttravelgirl @Brooklyn_277 @wiesenthal @StoptheChopNYNJ I bet it trades below net cash before this is all over. Not unheard of, and trade then it to liquidate company if you can get control, but that won't happen.\n\nThat said, Blade has enough cash to survive a nuclear winter. They aren't going anywhere.",
    "783": "@SInow Brooklyn Nets, the Nets would win the NBA championship with Simmons. He solves their problems on defense, offensively he only has to \"contribute\". This with  Harden,KD roster, Kyrie odd man out.",
    "784": "@NickFriedell ,@BrooklynNets could easily be in six place if they continue to lose games.  Currently they in fourth place behind Cleveland.  Sounds unbelievable considering last year Cleveland was near last place.",
    "785": "@BrooklynNets @JHarden13 @SteveNash pls don't injury ya self",
    "786": "@CoachAC_NFT @nbatopshot @13edm @hyfr_alex @NoChillNullJr \n\nBrooklyn nets!!!",
    "787": "@WindhorstESPN @BillSimmons Reckon you blokes were extremely harsh on @Patty_Mills when you said @BrooklynNets role players 4-15 have all been terrible this season.",
    "788": "@stephenasmith Stephen A Smith how can you go from telling the entire world that Kevin Durant &amp; the Brooklyn Nets will be unstoppable &amp; win the NBA Finals to the Cleveland Cavaliers can come out of the Eastern Conference???\n\nYou don’t even believe what you are saying!!!! 😂😂😂",
    "789": "If you have ever wanted to hear @DenisGorman talk to @MatthewBlittner about @HLundqvist, the @NYRangers, the @NYIslanders, the @Giants, @StJohnsBBall, @StonyBrookMBB, the @nyknicks, and @BrooklynNets, go to the 41-minute mark of this video: \nhttps://t.co/ZmSYzpa4Jg https://t.co/DCdB54oHb7 https://t.co/96VWpveNhg",
    "790": "Woj Is Now Reporting James Harden Actually Loves Being A Brooklyn Net Which Means We Officially Have A #SourceOff!! https://t.co/assvOuMxte"
}