{
    "0": "Becky Hammon’s move to WNBA leaves San Antonio Spurs with mixed feelings  https://t.co/Vkhc7gek0N #SpursNation #GoSpursGo https://t.co/4T1a1tIylL",
    "1": "San Antonio Spurs’ rookies fitting in nicely  https://t.co/muf1N2Yo5U #SpursNation #GoSpursGo https://t.co/ZpwzUadwrm",
    "2": "A return to Grizz coverage on New Year's Eve, and here are your officials for tonight's matchup with the San Antonio Spurs -- Sean Corbin, Leon Wood and J.D. Ralls. I'm sure @badunclep wishes them the best in their New Year's Eve endeavors.",
    "3": "San Antonio Spurs: Becky Hammon named new Las Vegas Aces coach https://t.co/IE4immMLP4",
    "4": "San Antonio Spurs Starters:\n\nDerrick White\nDoug McDermott\nKeita Bates-Diop\nKeldon Johnson\nJakob Poeltl\n\nPlayers out:\nDevontae Cacok\nZach Collins\nDejounte Murray\n#PorVida #NBA #NBATwitter #NBA75",
    "5": "Tonight's starting lineup for the San Antonio Spurs: White, Johnson, McDermott, Bates-Diop, Poeltl https://t.co/bVWH4AMCA2",
    "6": "@BleacherReport What a shot man. Top 5 MVP candidate this year. \n\nBut just remember, spurs fans have been warning everyone that this is who Demar is and has been since he got to San Antonio",
    "7": "NEW YEARS EVE ACTION⬇️\n\n•NBA•🏀\nNew York Knicks ML -135 (1u) \nSan Antonio Spurs +6 (1u)\n\n#NBA #GamblingTwitter",
    "8": "It’s time for Basketball: San Antonio Spurs vs Memphis Grizzlies https://t.co/k7QP7Yjywa https://t.co/WRppgUm84i",
    "9": "[Live] 2021 NBA Basketball Memphis Grizzlies vs San Antonio Spurs\nFree Stream Access : https://t.co/5Fgw1tPBgY | Friday Dec 31, 2021 | 20:00 | NBA | Basketball | Memphis Grizzlies | San Antonio Spurs | San Antonio Spurs at Memphis Grizzlies NBA Basketball | Live 2021 https://t.co/VGBvFRl5u2",
    "10": "The Memphis Grizzlies are hosting the San Antonio Spurs – NBA News https://t.co/6L3rKyVWZX",
    "11": "The Memphis Grizzlies are hosting the San Antonio Spurs – https://t.co/GOkuFLQLAx",
    "12": "NBA Basketball Game Betting Picks Simulator: 8:10 PM ET - San Antonio Spurs vs. Memphis Grizzlies - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/X9ZYn6YBDZ #nba #sportsbetting #freepicks #cappertek",
    "13": "NBA - Cleveland ML, San Antonio Spurs +6 ( bought 1/2 point )",
    "14": "Becky Hammon's hire is official. An AP source says she'll be the highest-paid coach in the WBNA.\n\nHammon has been an assistant coach with the San Antonio Spurs for eight seasons. \n\nhttps://t.co/67qBlhcrHW\n\nhttps://t.co/67qBlhcrHW",
    "15": "#SanAntonio are 5-1 ATS in their last 6 games\n\nMore trends and match ups below 🔽\n\nhttps://t.co/EFJWbVJkgO\n\n#NBAPicks #GamblingTwitter #Spurs #Grizzlies https://t.co/ju8Ye5wc9f",
    "16": "Becky Hammon to leave the NBA as the San Antonio Spurs assistant coach to become the new Las Vegas Aces head coach: What it all means to me. https://t.co/CETCSmKafL #WNBA",
    "17": "Becky Hammon’s move to WNBA leaves San Antonio Spurs with mixed feelings https://t.co/tybK0MxE99 via @expressnews",
    "18": "It's official: San Antonio Spurs assistant coach and six-time WNBA All-Star Becky Hammon has been hired as the new head coach of the WNBA Las Vegas Aces. https://t.co/H5MD4BcaDP",
    "19": "San Antonio Spurs: Las Vegas Aces hire Spurs assistant Becky Hammon as new head coach https://t.co/1S1K4BRjHo",
    "20": "San Antonio Spurs coach Gregg Popovich on new Aces coach Becky Hammon: \"For her, it's a great opportunity to have a head coaching job at that level. To prove herself. She's already proven herself to me but that doesn't matter in the long run.\"",
    "21": "@spursnsalsa @dannysanders80 That's fine. I'll hit them with the facts. Demar was not a good fit with San Antonio. Both him and the Spurs have benefitted from his departure. It's a win win for both sides.",
    "22": "@AndyP1693 He is.  For a lot of reasons it wasn't the right time/fit in San Antonio -- and saying his name sets off a firestorm of a debate on Spurs Twitter, but I'm glad to see him doing well.",
    "23": "@itsyourboyad this is an open space for those San Antonio Spurs fans that lost DeRozan https://t.co/Gb7RNIcZJT",
    "24": "More from Becky:\n\n“I have so many incredible memories and proud moments in San Antonio from my time with both the Stars and the Spurs. From the fans and players to coaches and staff, everyone in the organization has treated me so well for so many years...\"",
    "25": "And there it is... Las Vegas makes it office... Las Vegas Aces President Nikki Fargas announced today that the team has hired San Antonio Spurs assistant coach, and six-time WNBA All-Star Becky Hammon as the team’s new head coach. #porvida #nba75",
    "26": "Congratulations to walnut who moved up 1 spot to take #8 on the San Antonio Spurs team leaderboard.\n\nhttps://t.co/HQxWdPfRe7",
    "27": "Las Vegas Aces President Nikki Fargas announced today that the team has hired San Antonio Spurs assistant coach, and six-time WNBA All-Star Becky Hammon as the team’s new head coach.",
    "28": "San Antonio Spur Legend https://t.co/UHHeLNoyXS",
    "29": "Press Release: @LVAces \n\nLas Vegas Aces President Nikki Fargas announced today that the team has hired San Antonio Spurs assistant coach, and six-time WNBA All-Star Becky Hammon as the team’s new head coach. \n#WNBA",
    "30": "THAT’S FORMER SAN ANTONIO SPUR DEMAR DEROZAN TO YOU!!!!! https://t.co/xgej1s8l15",
    "31": "@KJtruth144 @SportsCenter @wojespn You're trolling, maybe this one? 🤣\n\n- Hall of Fame playing career 14+ yrs\n- NBA assistant coach for the San Antonio Spurs since 2014 under 1 of the best coaches of All-Time (Gregg Popovich)\n- Named top team assistant (1st chair)\n-  Spurs Summer league team head coach since 2015",
    "32": "Another product of the @spurs. His work ethic is incredible, and what he learned from San Antonio has showed: he is far from old and far from washed. https://t.co/ZTqoKboLhq",
    "33": "NBA Basketball Game Betting Picks Simulator: 8:10 PM ET - San Antonio Spurs vs. Memphis Grizzlies - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/X9ZYn6YBDZ #nba #sportsbetting #freepicks #cappertek",
    "34": "San Antonio Spurs: #Spurs' Becky Hammon finalizing deal to coach Las Vegas Aces - Spectrum News https://t.co/KOGeNrTWSL",
    "35": "Game notes for tonight's matchup with the San Antonio Spurs – the first New Year's Eve home game in franchise history – are available online: https://t.co/xYCwG545j9 https://t.co/IIAqSzf4a9",
    "36": "San Antonio Spurs: At last, Becky Hammon is getting her chance to be a head coach https://t.co/W7ZMsroeSJ",
    "37": "New post (San Antonio Spurs vs. Memphis Grizzlies Pick - NBA December 31, 2021) has been published on The Sports Geek - https://t.co/pNpJMENeX7 https://t.co/fT7PY8qJ0j",
    "38": "Congratulations to Battletoad824 who moved up 81 spots to take #76 on the San Antonio Spurs team leaderboard.\n\nhttps://t.co/HQxWdPfRe7",
    "39": "San Antonio Spurs’ Becky Hammon nears deal with WNBA’s Las Vegas Aces https://t.co/GLzKpWqvvv",
    "40": "Sources: Las Vegas closing in on deal to hire San Antonio assistant Becky Hammon as new head coach via @TheAthletic | 🏀 #WNBA #WomensHoops #Aces #Spurs #NBA  https://t.co/aMKeyUTQW3",
    "41": "Reports say Becky Hammon, who has been an assistant coach with the San Antonio Spurs for eight seasons, is finalizing a deal to take over as coach of the WNBA's Las Vegas Aces. https://t.co/2r9v3ov6rz",
    "42": "San Antonio Spurs' Becky Hammon nears deal with WNBA's Las Vegas Aces https://t.co/6tt9kIeKsW",
    "43": "Today's NBA Picks: 8:10 PM ET - San Antonio Spurs vs. Memphis Grizzlies - 13 PICKS AVAILABLE: https://t.co/sIzP4QhGNq #nba",
    "44": "Cincinnati +13 and over 57.5, Michigan +7.5 and under 45.5, San Antonio Spurs +5.5 and Lakers -5.5.",
    "45": "#Pistons Luka Garza said he was down about his defense against the #Spurs on Sunday, but he was happy about his defensive play against the #Knicks. \n\nHe gets another chance against San Antonio tomorrow night.",
    "46": "ICYMI: San Antonio Spurs assistant coach Becky Hammon is finalizing a five-year deal with the WNBA’s Las Vegas Aces to become their next head coach, according to multiple sources, including ESPN. https://t.co/Ix6BfKxIFm",
    "47": "[Live] 2021 NBA Basketball Memphis Grizzlies vs San Antonio Spurs\nFree Stream Access : https://t.co/xK49uS2IMu | Friday Dec 31, 2021 | 20:00 | NBA | Basketball | Memphis Grizzlies | San Antonio Spurs | San Antonio Spurs at Memphis Grizzlies NBA Basketball | Live 2021 https://t.co/yTjYwT6JKm",
    "48": "Congratulations to Kurtchou, JakeLess, reggie8in9 (@mrchechile) and antique_bonobo652 who moved up to take #10, #13, #14 and #94 on the San Antonio Spurs team leaderboard.\n\nhttps://t.co/HQxWdPfRe7",
    "49": "Looking for a value bet?  See if the San Antonio Spurs-Memphis Grizzlies Predictions and Preview for 12/31/2021 is one in our preview.  No crazy hype just a prediction and preview. #GamblingTwitter #Picks https://t.co/nYTjVOH0Uj",
    "50": "San Antonio Spurs visits Memphis Grizzlies Predictions and Preview for 12/31/2021 today.  Who are we taking in this game?  Find out now. #GamblingTwitter #Picks https://t.co/nYTjVOH0Uj",
    "51": "San Antonio Spurs: Recapping redshirt statuses and play of Oregon freshmen this season https://t.co/4tY9kiWygu",
    "52": "My mission in Dallas is complete. See you San Antonio soon 😍😍😍😍😍😍 #Spurs #GoSpursGo #porvida https://t.co/w6MhjFUU00",
    "53": "Targeting San Antonio Spurs at +6.5 if the line moves there #GamblingTwiitter #Nbabets",
    "54": "Spurs rookie guard Joshua Primo is on the path many young players have taken in their first steps as a pro in San Antonio. https://t.co/ObG8KJttHz",
    "55": "San Antonio Spurs: continue to give Dejounte the keys to dominate on the offensive end, and get yourself a second star. Wether it’s via a trade, or a lottery pick. Doesn’t matter. This rebuild doesn’t have to last long with the way their core is growing. Trade White and Young https://t.co/nNXbDtBptC",
    "56": "@spurs_boy Yeah I mean I don’t want to be dramatic but I think the Spurs may continue to win basketball games in San Antonio.",
    "57": "San Antonio Spurs assistant Becky Hammon is finalizing a five-year deal with the WNBA's Las Vegas Aces that will make her the league's highest-paid coach, sources confirmed to ESPN on Thursday.",
    "58": "Congratulations to JPMunoz and The_Norris who moved up to take #1 and #13 on the San Antonio Spurs team leaderboard.\n\nhttps://t.co/HQxWdPfRe7",
    "59": "Fuck the San Antonio Spurs for not giving Becky Hammon the coaching job she deserves. I’m glad she’s getting paid in the WNBA tho 🐏💚",
    "60": "📰 Memphis Grizzlies vs San Antonio Spurs Picks and Odds Dec 31!\n👉 https://t.co/H9YQ5AfAV4 @wagertalk",
    "61": "@thehalestone @sellsbells18 @jon123spurs @spurs Bro I’m IN San Antonio and I can’t get any love @spurs",
    "62": "Analyzing Friday’s San Antonio Spurs at Memphis Grizzlies and lines, with NBA expert picks, predictions and best bets.  https://t.co/IbjwaSTx3E",
    "63": "Acceptable answers: San Antonio Spurs https://t.co/9MZfN9PXaB. \nMore details: https://t.co/hpWqxKz0Xi\n\nScores at https://t.co/yE0NxWEqIN",
    "64": "NBA 🏀 12/31/21\nYTD Record 1-0\nChicago Bulls -3\nSacramento Kings +2\nHouston Rockets +4\nCleveland Cavaliers -1\nToronto Raptors -7\nSan Antonio Spurs +6",
    "65": "Memphis Grizzlies vs San Antonio Spurs 12/31/21 NBA Picks, Predictions, Odds » Sports Chat Place https://t.co/yb5GzzTnAg",
    "66": "Indiana Pacers - Chicago Bulls\nHouston Rockets - Miami Heat\nMemphis Grizzlies - San Antonio Spurs\n\nBet slip link: https://t.co/laCS0LjbUR https://t.co/kMFhHMYRGX",
    "67": "San Antonio Spurs at Memphis Grizzlies odds, picks and prediction https://t.co/YfgEszaZJP",
    "68": "LIVE ~ San Antonio Spurs vs Memphis Grizzlies - NBA League Pass\n🔴Watch Live📺📱:  https://t.co/VeK0MFSG2g\nDate : Friday, December 31, 2021 - Time : 8:00 PM",
    "69": "LIVE ~ San Antonio Spurs vs Memphis Grizzlies - NBA League 2021\n🔴Live Now📺📱:  https://t.co/AyoztZXV3X\nDate : Friday, December 31, 2021 - Time : 8:00 PM",
    "70": "#BeckyHammon is headed to the WNBA to become the head coach of the Las Vegas Aces, a franchise she previously played for. Hammon, who has spent the past 8 years as an assistant coach to the San Antonio Spurs, is now the highest paid coach in the WNBA, according to @wojespn . https://t.co/itQ7TpXxsp",
    "71": "@McGuire_GIS @Hulcricket @mjserven Eh, any small market team that's the only one in the city (yes I know but come on they're perpetually horrible) has that vibe. San Antonio is the same for the Spurs.",
    "72": "His: \"I think she was one of Pop's assistants.\"  \"Who?\"  \"POPs, San Antonio Spurs.\"  \"Historic, no doubt.\"",
    "73": "San Antonio Spurs: Report: Becky Hammon Will Become Head Coach Of The Las Vegas Aces https://t.co/vcY4LPARKC",
    "74": "San Antonio Spurs @ Memphis Grizzlies\nPick : San Antonio Spurs.\nBasketball. NBA",
    "75": "Sources: Minnesota @Vikings  QB Kirk Cousins tests positive for COVID-19\n\nColorado assistant football coach Mark Smith loses 'everything' in wildfires\n\nSources: San Antonio Spurs' Becky Hammon nears deal with @WNBA's Las Vegas Aces",
    "76": "Becky Hammon, asst. coach San Antonio Spurs (which did not interview her for the top spot) perhaps has a new job as coach WNBA's Las Vegas Aces. https://t.co/zwmvpn0zsC",
    "77": "**Premium Pack Pt 1**    💎5u💎\n\nCBB\n1.High Point +27.5 (-110) \n\nNBA\n1. Boston Celtics +3.5 (-110)\n2. San Antonio Spurs +5.5 (-110) \n3. Boston Celtics Moneyline (+138)",
    "78": "⭐️⭐️🐳FREE VIP PLAYS🐳⭐️⭐️\n\nRARE PARLAY BUT SHOULD BE A LOCK\n\n🏈GEORGIA BULLDOGS ML + LAKERS ML   -113 MAXBET🐳\n\n🏀SAN ANTONIO SPURS +5.5 -110\n\nWE ON A 14-1 RUN🔥\n\nLIKE OF TAILING FREE VIP PLAYS",
    "79": "San Antonio Spurs: Now's the Time to Buy Low on the #Spurs - FanSided https://t.co/KOGeNrTWSL",
    "80": "Revenge Game: Kyle Anderson plays San Antonio tonight.  He played 257 games in his career for the Spurs.",
    "81": "Becky Hammon is returning to the WNBA (!!!)\n\nThe longtime San Antonio Spurs assistant coach is leaving her NBA position for a 5-year deal with the WNBA's @LVAces, reportedly making her the highest paid coach in the league 💰\n\n@BeckyHammon #thegist https://t.co/5lnok9YqjZ",
    "82": "Becky Hammon is returning to the WNBA (!!!)\n\nThe longtime San Antonio Spurs assistant coach is leaving her NBA position for a 5-year deal with the WNBA's @LVAces, reportedly making her the highest paid coach in the league 💰\n\n@BeckyHammon #thegist https://t.co/Vg7Rfn7lha",
    "83": "San Antonio Spurs assistant Becky Hammon reportedly is nearing a five-year deal with the Las Vegas Aces that would make her the highest-paid coach in the WNBA. https://t.co/FJFOW9G8PD",
    "84": "San Antonio @spurs assistant coach Becky Hammon is set to join the @LVAces on a 5 year deal which will make her the #WNBA 's highest paid coach. Get the details below \n\nhttps://t.co/BDJkF97wYq",
    "85": "The San Antonio Spurs (14-19) will visit the Memphis Grizzlies (22-14) tonight as the Spurs get set to begin a long road trip. https://t.co/TFrO8zErsf",
    "86": "San Antonio Spurs assistant coach #BeckyHammon is finalizing a five-year deal with the #WNBA’s #LasVegasAces, according to ESPN’s Adrian Wojnarowski and Shams Charania of The Athletic. 🏀 #WNBATwitter https://t.co/qJ1x6GfgYt",
    "87": "DasHaus made a bet!\n\nEvent: San Antonio Spurs vs Memphis Grizzlies #NBA\nBet: Memphis Grizzlies TO WIN -6\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "88": "DasHaus made a bet!\n\nEvent: San Antonio Spurs vs Memphis Grizzlies #NBA\nBet: San Antonio Spurs TO WIN +6\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "89": "Memphis Grizzlies vs. San Antonio Spurs Game Preview https://t.co/jH4BgrD69q",
    "90": "My year with the San Antonio Stars, Becky Hammon would still come in from time to time and watch practices, talk with the staff, even jumped in on the practice team a few times. As an assistant for the Spurs. She loved that organization and it’s only fit to see her as HC now 🏀💯",
    "91": "San Antonio Spurs: Report: Hammon to leave Spurs, become Aces HC https://t.co/EsWnSZHcZa",
    "92": "@TurtleTwinsburg @RuthlessEchoz @Randomp00711062 @JayLGK @ShamsCharania @TheAthletic @Stadium Wow! Sans GSW, you’re really insane if you believe that the 2011 Dallas Mavericks, 2014 San Antonio Spurs &amp; 2020 Miami Heat were rougher than the (Magic/Divac) Lakers, (Drexler/Porter) Blazers, (Barkley/KJ) Suns, (GP/Kemp) Sonics &amp; (Pedo/Stockton) Jazz teams that MJ faced &amp; BEAT.",
    "93": "Sources: San Antonio Spurs' Becky Hammon nears deal with WNBA's Las Vegas Aces - via @ESPN App https://t.co/kSisgaktm2",
    "94": "San Antonio Spurs: Memphis Grizzlies vs. San Antonio Spurs:  Game Preview https://t.co/thUOKlggeJ",
    "95": "@RobertIger that’s very kind of you to mention me along with your children.  So proud to have worked under your #leadership. I wish you and @Willow_Bay a true #happilyeverafter, &amp; if you ever find yourself in #SanAntonio please let me know, maybe we Can catch a @spurs game.😂👏🤷‍♂️ https://t.co/TAPysi7Mhe",
    "96": "“Ppl won in lebron’s era” 😂😂 drop the San Antonio spurs, the Kobe lakers, the 73 win warriors, the superteam kd warriors in any era.. who is stopping them from grabbing minimum 1 championship?? No one. Mfs think mj faced a gauntlet in the 90s lol a bunch of 1 hof led teams foh",
    "97": "Sources: San Antonio Spurs' Becky Hammon nears deal with WNBA's Las Vegas Aces - via @ESPN App.  #NBA.   https://t.co/IsrkO5seca",
    "98": "2020-21 San Antonio Spurs Rookie Card Lot (20) Tre Jones &amp; Devin Vassell NBA #thehobby #whodoyoucollect https://t.co/zvZmUcx5vJ",
    "99": "NO SAN ANTONIO SPURS ACCOUNT SHOULD HAVE LESS THAN 1K FOLLOWERS \n\nREPLY WITH #PORVIDA AND FOLLOW EVERYONE WHO LIKES YOUR TWEET\n\nRETWEET SO IT FORMS A CHAIN REACTION \n\nDON'T FORGET TO FOLLOW ME AND TO FOLLOW EVERYONE BACK!!!",
    "100": "CALLING ALL SAN ANTONIO SPURS FANS!!!!!!\n\n𝗗𝗥𝗢𝗣 𝗔𝗡 𝗘𝗠𝗢𝗝𝗜 𝗗𝗢𝗪𝗡 𝗕𝗘𝗟𝗢𝗪 𝗔𝗡𝗗 𝗙𝗢𝗟𝗟𝗢𝗪 𝗘𝗩𝗘𝗥𝗬𝗢𝗡𝗘 𝗪𝗛𝗢 𝗟𝗜𝗞𝗘𝗦 𝗜𝗧!!!!\n\n𝗥T 𝗦𝗢 𝗜𝗧 𝗙𝗢𝗥𝗠S 𝗔 𝗖𝗛𝗔𝗜𝗡 𝗥𝗘𝗔𝗖𝗧𝗜𝗢𝗡!!!!!!!!!!!!!!! #PorVida  #GoSpursGo #LosSpurs #SanAntonioSpurs https://t.co/E6wfx2ApIt",
    "101": "San Antonio Spurs: Becky Hammon to replace Bill Laimbeer as Aces coach - Las Vegas Review-Journal https://t.co/EnetvDBFBE",
    "102": "Consensus Line Move:\n2021-12-31 San Antonio Spurs at Memphis Grizzlies from 224.00 to 226.00\nOver getting dough\n#NBA #CryptoHoops #statistics #entrepreneurship",
    "103": "BREAKING: San Antonio #Spurs Assistant Coach Becky Hammon is closing in on a landmark deal to become the next Head Coach of the WNBA’s Las Vegas Aces \n\nHammon's deal will be a record-setting contract for a WNBA Head Coach \n\n#PorVida",
    "104": "The @utahjazz at San Antonio @spurs | @NBA FULL GAME #HIGHLIGHTS | December 27, 2021 https://t.co/pkcqQIR4Eq via @YouTube \n#TakeNote, #PorVida, #PorJuego, #PorMomento.",
    "105": "San Antonio Spurs assistant coach Becky Hammon is finalizing a five-year deal with the WNBA’s Las Vegas Aces to become their next head coach, according to multiple sources, including ESPN. https://t.co/Ix6BfKxIFm",
    "106": "Sources: San Antonio Spurs' Becky Hammon nears deal with WNBA's Las Vegas Aces - via @ESPN App https://t.co/VH1BCMSoSa",
    "107": "San Antonio Spurs’ Becky Hammon nears deal with WNBA’s Las Vegas Aces https://t.co/ygS3iKnr9C",
    "108": "San Antonio Spurs assistant Becky Hammon is finalizing a five-year deal with the WNBA’s Las Vegas Aces that’ll make her the league’s highest paid coach, sources tell ESPN. Hammon plans to finish season with San Antonio.",
    "109": "San Antonio Spurs Pin Dribble Hand Off Action https://t.co/nIvBtSVqPx",
    "110": "Report: Becky Hammon, WNBA's Aces Nearing 'Record-Setting' Contract Agreement #sports\n\nSan Antonio Spurs assistant Becky Hammon is reportedly \"closing in on a landmark deal\" to join the WNBA's Las Vegas Aces as the team's next head coach,\n\nhttps://t.co/PTrWyjBduF",
    "111": "NBA Basketball Game Betting Picks Simulator: 8:10 PM ET - San Antonio Spurs vs. Memphis Grizzlies - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/X9ZYn6YBDZ #nba #sportsbetting #freepicks #cappertek",
    "112": "@Dez_Bracy @dweber34 @MD__Dominguez @wojespn It makes sense that’s she’s leaving San Antonio. Especially with the stories regarding the Feedback the Trailblazers received from the Spurs during their background check on her. It feels she ran her course there and needs to move on.",
    "113": "San Antonio Spurs: Memphis Grizzlies center Xavier Tillman Sr. now in COVID protocols - The Commercial Appeal https://t.co/KOGeNrTWSL",
    "114": "San Antonio Spurs' Becky Hammon nears deal with WNBA's Las Vegas Aces\nhttps://t.co/l42HLnZMjJ",
    "115": "Sources - San Antonio Spurs' Becky Hammon nears deal with WNBA's Las Vegas Aces - ESPN https://t.co/8jy8WW7GVp https://t.co/e31Qj68I0N",
    "116": "Becky Hammon leaves her job as an assistant coach for the San Antonio Spurs to take over as the Las Vegas Aces' head coach. #WNBA  https://t.co/0QZvWVq2D3",
    "117": "WNBA - Sources: San Antonio Spurs' Becky Hammon nears deal with WNBA's Las Vegas Aces https://t.co/ZPEh1MtFOT",
    "118": "Becky Hammon leaves her job as an assistant coach for the San Antonio Spurs to take over as the Las Vegas Aces' head coach. #WNBA  https://t.co/9cckAXZZlx",
    "119": "San Antonio Spurs vs. Memphis Grizzlies: Live Stream, TV Channel, Start Time - Sports Illustrated https://t.co/B4atkPM3OH",
    "120": "Sources - San Antonio Spurs' Becky Hammon nears deal with WNBA's Las Vegas Aces - ESPN https://t.co/9zlPr5zSBM https://t.co/vwzZTrcp2h",
    "121": "San Antonio Spurs is really going to miss Becky Hammon, but Aces got the biggest  🎁 🔥 https://t.co/8hhXyF25Vz",
    "122": "Game Preview: San Antonio Spurs @ Memphis Grizzlies https://t.co/JNVnzFUrvl",
    "123": "Game Preview: San Antonio Spurs at Memphis Grizzlies https://t.co/IFDZRrACkw",
    "124": "The Miami Heat vs San Antonio Spurs series are ALL TIME",
    "125": "@KCar0726 She would have been great for the @spurs  She'll be great for @LVAces too. I wanted to see her stay in San Antonio, though, and I'm not even a Spurs fan",
    "126": "Congratulations to EagleTex who moved up 1 spot to take #10 on the San Antonio Spurs team leaderboard.\n\nhttps://t.co/HQxWdPfRe7",
    "127": "San Antonio Spurs: San Antonio #Spurs face air of uncertainty on long trip https://t.co/EnetvDBFBE",
    "128": "San Antonio Spurs assistant Becky Hammon is finalizing a five-year deal with the WNBA’s Las Vegas Aces Hammon plans to finish season with San Antonio.",
    "129": "San Antonio Spurs: Report: Spurs’ Hammon Close to Deal to Become Aces’ Head Coach https://t.co/rb8J4GgdV3",
    "130": "Well deserved. RT @wojespn: San Antonio Spurs assistant Becky Hammon is finalizing a five-year deal with the WNBA’s Las Vegas Aces that’ll make her the league’s highest paid coach, sources tell ESPN. Hammon plans to finish season with San Antonio.",
    "131": "Spurs fans who are disappointed Becky isn’t waiting around for Pop’s retirement to (maybe) make history with the San Antonio job:\nIf you were Becky Hammon, would you really want to go through another summer or two of speculation and rumors? She’s earned this. Go get that bag. https://t.co/uqNXMwuwRp",
    "132": "Contrary to popular belief among some Spurs fans, coaches aren't the same as players and Coaches are going to be lining up (if available) to take a chance at the consistency/culture/FO dynamic San Antonio has created. There won't be a shortage of options.",
    "133": "Team used to be in San Antonio and had the same owner as the Spurs. Now owned by Mark Davis. https://t.co/tOUrp1VRIG",
    "134": "@wojespn San Antonio are gonna lose the Spurs when Pop retires.",
    "135": "San Antonio Spurs assistant Becky Hammon is finalizing a five-year deal with the WNBA’s Las Vegas Aces that’ll make her the league’s highest paid coach. #wnba #allin♦️♠️",
    "136": "San Antonio Spurs assistant Becky Hammon is finalizing a five-year deal with the WNBA's Las Vegas Aces that'll make her the league's highest-paid coach, sources told ESPN's Adrian Wojnarowski.\n\nhttps://t.co/X00IxkaqQl",
    "137": "San Antonio Spurs assistant coach Becky Hammon is finalizing a five-year deal to become the Las Vegas #Aces head coach. \n\n#WNBA | #Lvaces | #3ptcnvrsn https://t.co/yhpW9QxaDQ",
    "138": "Just in: San Antonio Spurs assistant and WNBA legend Becky Hammon is closing in on a landmark deal to become the new head coach of the WNBAs Las Vegas Aces, sources tell me and _Chantel5... #mobilsocial https://t.co/mjUr9NdNE4",
    "139": "Breaking: San Antonio Spurs assistant Becky Hammon is finalizing a five-year deal with the WNBA's Las Vegas Aces that will make her the league's highest-paid coach, sources told Adrian Wojnarowski. https://t.co/Gpfhxyd459",
    "140": "I'm sad that Becky Hammon won't be the next coach of the San Antonio Spurs, but at the same time thrilled she is getting a chance to be a head coach and securing that bag!",
    "141": "@JeffGSpursZone My 📍might be in DOH but I do have a San Antonio 🏠 address … you know… @spurs 😏🥲😛",
    "142": "Hammon, an assistant coach with the San Antonio Spurs, played her prime years for the San Antonio Stars, who became the Aces in 2017. She was a six-time WNBA All-Star and is still the franchise leader in assists, 3-pointers and  free-throw percentage.",
    "143": "Shout out to @BeckyHammon for taking the leap! This is bittersweet, we love Becky here in San Antonio, but she will make an excellent head coach! Once a Spur, always a Spur #GoSpursGo https://t.co/7lfbVAY0Ay",
    "144": "San Antonio Spurs assistant coach Becky Hammon likely to be named head coach of the Las Vegas Aces \nhttps://t.co/VF0Lugvd04",
    "145": "San Antonio Spurs assistant Becky Hammon is finalizing a five-year deal with the Las Vegas Aces that will make her the WNBA’s highest paid coach. \n\nWell. Deserved. 👏 https://t.co/W5TFoDQnq0",
    "146": "San Antonio Spurs assistant Becky Hammon is finalizing a five-year deal with the Las Vegas Aces that will make her the WNBA’s highest paid coach, per @wojespn.\n\nHammon plans to finish the season with San Antonio. https://t.co/gTySeMxJ7m",
    "147": "@Mic_45 She still could get the spurs gig though…getting head coaching experience is way better than being coach in waiting for 3-5 years…if she wins a title in the next 2-3 years she’ll solidify herself as the successor in San Antonio",
    "148": "Who will be the next coach for the San Antonio Spurs after Pop retires?",
    "149": "@TaeTimeNow glad I got to see her coach with San Antonio while she did. She made history with the spurs",
    "150": "🔥🔥🔥RT @wojespn: San Antonio Spurs assistant Becky Hammon is finalizing a five-year deal with the WNBA’s Las Vegas Aces that’ll make her the league’s highest paid coach, sources tell ESPN. Hammon plans to finish season with San Antonio.",
    "151": "BREAKING: Spurs assistant &amp; WNBA legend Becky Hammon will become the head coach of the WNBA’s Las Vegas Aces. The deal is over 5 years. \n\nHammon will replace Bill Laimbeer as the head coach after she finishes the 2021-22 season with San Antonio.\n\nCongratulations, Becky! 👏 https://t.co/xKi2uDR7gr",
    "152": "San Antonio Spurs assistant coach Becky Hammon is closing in on becoming the next head coach of the Las Vegas Aces, according to Chantel Jennings and Shams Charania of The Athletic.\n\nhttps://t.co/AVQEK27UWQ",
    "153": "San Antonio Spurs assistant Becky Hammon is finalizing a five-year deal with the WNBA’s Las Vegas Aces that’ll make her the league’s highest paid coach, sources tell ESPN. Hammon plans to finish season with San Antonio.",
    "154": "🚨 BREAKING NEWS 🚨\n\nSan Antonio Spurs assistant and WNBA legend Becky Hammon is closing in on a deal to become the head coach of the Las Vegas Aces, per @ShamsCharania. https://t.co/tlKflFliBZ",
    "155": "My girl! Definitely going to miss her in San Antonio. Hopefully we'll see her running the Spurs one day as well. Way to go Coach Hammon! #PorVida @BeckyHammon https://t.co/iQJUweeOor",
    "156": "The San Antonio Spurs have LOST the one true asset that could have given them relevancy and marketability in today’s nba. \n\nThis is a huge blow to the franchise that they won’t recover from. \n\nIt’s over. That’s it.\n\nGet ready for the Las Vegas Spurs.  https://t.co/cdxEA9IrKr",
    "157": "Congratulations to DOPEITSJOSHY (@DOPEITSJOSHY) who moved up 6 spots to take #5 on the San Antonio Spurs team leaderboard.\n\nhttps://t.co/HQxWdPfRe7",
    "158": "Becky Hammon’s No. 25 was retired by the San Antonio Silver Stars of the WNBA\n\nAfter retiring, she stayed in San Antonio and became a Spurs assistant coach\n\nMeanwhile, the Silver Stars moved to Vegas and became the Aces\n\nNow, Becky Hammon will be the Aces' next head coach https://t.co/bzRCrScfSF",
    "159": "BREAKING: San Antonio #Spurs assistant coach and former #WNBA star Becky Hammon is close to agreeing to a deal with the Las Vegas Aces to become their next head coach. https://t.co/THaUGaWP6D",
    "160": "Congratulations to LunaticFridge, Beef_Supreme, dolphingirl, Kurtchou and EagleTex who moved up to take #5, #6, #7, #9 and #10 on the San Antonio Spurs team leaderboard.\n\nhttps://t.co/HQxWdPfRe7",
    "161": "Becky Hammon, the San Antonio Spurs assistant and WNBA legend, is closing in on a landmark deal to become the Las Vegas Aces head coach, sources tell @ChantelJennings &amp; @ShamsCharania. \n\nhttps://t.co/dfbdldqfbv",
    "162": "BREAKING: San Antonio Spurs News ⬇️⬇️⬇️ https://t.co/9alfBnTjXr",
    "163": "Just in: San Antonio Spurs assistant and WNBA legend Becky Hammon is closing in on a landmark deal to become the new head coach of the WNBA's Las Vegas Aces, sources tell me and @ShamsCharania.\n\nhttps://t.co/XYVsYgQo6j https://t.co/JXV9NXVing",
    "164": "Just in: San Antonio Spurs assistant and WNBA legend Becky Hammon is closing in on a landmark deal to become the new head coach of the WNBA’s Las Vegas Aces, sources tell me and @ChantelJennings.\n\nhttps://t.co/upEi4FMKrs",
    "165": "NBA Basketball Game Betting Picks Simulator: 12/31/2021 8:10 PM ET - San Antonio Spurs vs. Memphis Grizzlies - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/X9ZYn6YBDZ #nba #sportsbetting #freepicks #cappertek",
    "166": "Check out 1999-00 SPx Basketball #73 Tim Duncan SAN ANTONIO SPURS FREE SHIPPING https://t.co/zi9O0NdBs4 @eBay",
    "167": "San Antonio Spurs: San Antonio #Spurs Spread Holiday Cheer During the Season of Giving - YouTube https://t.co/KOGeNrTWSL",
    "168": "At Guard 6'6 from The San Antonio Spurs.. IN HIS FIRST ALL STAR GAME START. FROM WASHINGTON #DejounteMurray #NBAAllStar https://t.co/6FrN6XlLBU",
    "169": "@couchtomato62 @simshine95 @DamonAndRatto @GSWReddit @anthonyVslater When the heat were in San Antonio last night they were told to pick players from the spurs g league team.",
    "170": "Congratulations to DOPEITSJOSHY (@DOPEITSJOSHY) who moved up 5 spots to take #12 on the San Antonio Spurs team leaderboard.\n\nhttps://t.co/HQxWdPfRe7",
    "171": "@Jager11Robert 07 finals vs Spurs he was young and had worst finals roster in modern times, &amp; besides 2011, he was clearly the best player on the court in every other finals. He just happened to be playing far superior teams. San Antonio had 4 HoFers in 2014, GS had 3 HoFers in 2015, 17, 18.",
    "172": "Mal explained 3 Texas cities in one word exactly like I would lol\nHouston = women\nDallas = Cowboys\nSan Antonio = Spurs",
    "173": "Congratulations to PandaBearGuy, JPMunoz, Jandipants (@Jandipants1), TKGG, LunaticFridge, Beef_Supreme, walnut, dolphingirl and Kurtchou who moved up to take #2, #3, #4, #5, #6, #7, #8, #9 and #10 on the San Antonio Spurs team leaderboard.\n\nhttps://t.co/HQxWdPfRe7",
    "174": "Congratulations to Mryourewrong (@Mryourwrong), EagleTex and PandaBearGuy who moved up to take #1, #2 and #3 on the San Antonio Spurs team leaderboard.\n\nhttps://t.co/HQxWdPfRe7"
}