{
    "0": "🏀NEW YORK KNICKS VS Sacramento Kings LIVE🎙️️ PLAY BY PLAY &amp; 🍿WATCH-ALONG KNICK Follow Party https://t.co/k1nvqYzDHa",
    "1": "@PlayoffBoundNYK @nyknicks We’ll see",
    "2": "@nyknicks Is Gibson playing",
    "3": "@RuddienBurton @NazayW @KnicksMSGN @RjBarrett6 @nyknicks Never said that, but ok.",
    "4": "@nyknicks Lets get it 🧡💙",
    "5": "@nyknicks Play the kids",
    "6": "Ok guys it that time again LETS GO @nyknicks LETS THE YOUGINS PLAY THIBS LOLOL THATS ALL WE WANT TO SEE PLEASE  AND THANK YOU",
    "7": "@nyknicks It’s Fournier’s night. Mark my words",
    "8": "@RuddienBurton @NazayW @KnicksMSGN @RjBarrett6 @nyknicks Jason Tatum is shooting 43% yet he’s a superstar.",
    "9": "Time to work. https://t.co/4RzWgF1PCb",
    "10": "@nyknicks Cam and RJ in the starting lineup make it happen already... don't be afraid to try something that just might work....",
    "11": "Starters for @SacramentoKings vs. New York Knicks - 3/7:\n\nG - De’Aaron Fox \nG - Justin Holiday  \nF - Harrison Barnes \nF - Trey Lyles \nC - Domantas Sabonis",
    "12": "Was going to keep my nose clean after last nights heartbreaker 💔 \n\nBut, only one way to get back on the winning path... \n\nHere's what I like in the @nyknicks vs. @SacramentoKings which tips in just under 30 minutes\n\n-STEVEN 😈\n\n#GamblingTwitter #NBA #FanDuel #SportsGambling https://t.co/V9mgrIRJ8X",
    "13": "@nyknicks In Sacramento. Let's get this W",
    "14": "the New York Knicks are in Sacramento and I’m missing the game 😭😭",
    "15": "The @nyknicks have FINALLY broken a 7-game losing streak vs. the LA Clippers with the YOUTH playing quality basketball, but can they carry over the momentum off last night going into THIS upcoming game against the @SacramentoKings??? We shall find out shortly on MSG!!🔷🔶🏀🏀",
    "16": "Starters for @SacramentoKings vs. New York Knicks - 3/7:\n\nG - De’Aaron Fox \nG - Justin Holiday  \nF - Harrison Barnes \nF - Trey Lyles \nC - Domantas Sabonis",
    "17": "@nyknicks Please don’t waste him",
    "18": "Can Julius Randle learn to handle his emotions? | New York Knicks weekly... https://t.co/0fyBC2ppvs via @YouTube",
    "19": "@KnicksAnalyzer @nyknicks it’s not that hard an thibs makes it seem like it’s impossible",
    "20": "@KnicksMSGN @RjBarrett6 @nyknicks young king",
    "21": "Updated Injury Report vs. New York Knicks - 3/7:\n\nRichaun Holmes (personal reasons) - OUT \n\nMaurice Harkless (right ankle sprain) - OUT\n\nJeremy Lamb (left hip soreness) - OUT",
    "22": "Updated Injury Report vs. New York Knicks - 3/7:\n\nRichaun Holmes (personal reasons) - OUT \n\nMaurice Harkless (right ankle sprain) - OUT\n\nJeremy Lamb (left hip soreness) - OUT",
    "23": "Late Monday night 20K BIG BET sent out to clients! Knicks at Kings 10:30pm est start! @nyknicks @SacramentoKings dm me to get it for 50$! Or sign up for rest of season/monthly! \n\nYTD #NBA @FastestPayout\n10-7 20K BIG BETS +48K \n22-14 10K BETS +71.8K\n11-8 5K BETS +11K\n43-29 +130.8K https://t.co/9foW5Xgj50",
    "24": "#Knicks #Kings Lets go @nyknicks",
    "25": "@Knickfan881 @nyknicks Agreed. Kids should play half of the game",
    "26": "🏀 KNICKS VS KINGS!\n\nLast chance for NBA action as the the @nyknicks take the court to battle the @SacramentoKings in Sac-Town! \n\nWho are you taking? 🤑\n\n#MakeAPlay ➡️ https://t.co/qUPBOzx6EM #NewYorkForever #SacramentoProud https://t.co/rub2DRlRlI",
    "27": "@nyknicks Nothing changed after last night huh https://t.co/ECw5I0qRCn",
    "28": "@nyknicks Send me one pls 👉👈🥺",
    "29": "@nyknicks I need one of that @nyknicks 🥺❤️",
    "30": "@nyknicks I’m cool with it as long as the kids get extended minutes like last game.",
    "31": "NEW YORK KNICKS 116-93\nLOS ANGELES CLIPPERS, Final.",
    "32": "@JusticeTorres13 @nyknicks Stop you’re making too much sense 😂",
    "33": "Today's NBA Picks: 10:40 PM ET - New York Knicks vs. Sacramento Kings - 28 PICKS AVAILABLE: https://t.co/3FByG56Cfz #nba",
    "34": "@PlayoffBoundNYK @nyknicks Yeah ik I just meant like the irritation of “the same starting 5”",
    "35": "@ChefTrillie_ he’s talking to you @nyknicks",
    "36": "@nyknicks Quick was getting it in early out here",
    "37": "@KingBarrettOfNY @nyknicks At least Burks is a decent NBA player when utilized properly. The Suns literally traded for Aaron Holiday because Elfrid couldn’t even hold his own as the 3rd string PG.",
    "38": "@KnicksKaiSZN @nyknicks 36-4 actually",
    "39": "@nyknicks Thibs anytime anyone says Randle doesn’t need to play 50 minutes a game https://t.co/oWxnhIQqZw",
    "40": "@nyknicks Especially a shit ton together",
    "41": "@nyknicks Don’t care as long as cam plays 25+ minutes and McBride plays 15+",
    "42": "@nyknicks GODDAMN IT STOP PUTTING BURKS AT POINT GUARD",
    "43": "@nyknicks Cam RJ quick deuce better play a shit ton",
    "44": "@nyknicks Here we go again",
    "45": "@nyknicks I wanted 20+ minutes of IQ, Deuce, RJ, Cam and Jericho/Mitch",
    "46": "@nyknicks This is starting to turn into the elfrid posts again",
    "47": "@nyknicks Going to kill myself",
    "48": "@nyknicks RATIOOOOO",
    "49": "@nyknicks LMFAOO",
    "50": "@nyknicks pain",
    "51": "@nyknicks fatass",
    "52": "Where can I get the hoodies @nyknicks https://t.co/ejU3uoRH2J",
    "53": "New York Knicks: Kyrie ‘Grateful’ NYC Mayor On His Side Regarding Return to Home Games https://t.co/ouNSpScid2",
    "54": "@nyknicks Tonight’s starting 5… the same starting 5 we been losing with",
    "55": "julius randle plz New York City immediately PLZ🙏🏾 Knicks deserve better 🤦🏾‍♂️",
    "56": "i will get that @nyknicks follow, believe it",
    "57": "@nyknicks start cam over ev an start iq over ab",
    "58": "@nyknicks Hoping we see reddish and quickly to start 🙏",
    "59": "@nyknicks Start them",
    "60": "@nyknicks Wam Weddish",
    "61": "Warming up 🔋 https://t.co/xNN16UpnaJ",
    "62": "@hhpthebook @nyknicks @IQ_GodSon Lmao 🤣",
    "63": "@nyknicks He deserves a new contract to stay with the Knicks💰💵.",
    "64": "@delio_monegro @nyknicks @IQ_GodSon I like him with the ball",
    "65": "@hhpthebook @nyknicks @IQ_GodSon Quickley shouldn't be bringing up the ball, he dribbles too much n is not good setting others up. Not a PT. Where he's good at is playing off the ball. He's a good off guard. But Thibs been forcing players to play out of position.",
    "66": "Check out New York Knicks 17 Card Lot RJ Barrett Rookie Cards, Randle, Robinson, D-Rose https://t.co/zowcN0QDyZ?🏀🟠🔵🏀mkcid=16&amp;mkevt=1&amp;_trksid=p2349624.m46890.l6249&amp;mkrid=711-127632-2357-0 @eBay",
    "67": "this is going to be a schedule for the NEW YORK KNICKS\n\nKings handle those teams really well https://t.co/o2zgUrPgZt",
    "68": "Essentials official sponsor of the New York Knicks https://t.co/D48fPQ2Iwg",
    "69": "@nypost Y’all remember the New York Knicks. Please don’t let this man back in the front office!!",
    "70": "@nyknicks @IQ_GodSon @RjBarrett6 Fun watching the guys in person last night",
    "71": "@saquarantine @nyknicks @SacKings_Unis @SacramentoKings @RjBarrett6 They're called the Icon edition for a reason",
    "72": "@NBA_NewYork @FromNYtoLA1 Absolutely…..yep lol……just sad what it all evolved to…..I just remember talkin with my buddies and especially that home opener and then 5-1 at top of conference…….I’m like wow Knicks are ballin…… but ah little did I know what was gonna come 😞 \n\nRoller coaster season",
    "73": "@therealselena23 @nyknicks love u",
    "74": "@Knicks_SNOB @nyknicks @TAPEDByKnicks @IQ_GodSon Exactly 💯 🤣🤣🤣",
    "75": "@hhpthebook @knicks81 @nyknicks @IQ_GodSon Nah. You’re in that boat alone 🤡",
    "76": "@Btruetolife @nyknicks @TAPEDByKnicks @IQ_GodSon Are you saying that Thibs is really the younger brother of the diabolical Dr. Evil from \"Austin Powers?\"\nThe canniness is undeniable, though.😅 https://t.co/zqJ7lwHL3V",
    "77": "@nyknicks @wingstop Wish Randle was smoother at basketball",
    "78": "i saw evan fournier and alec burks placing bets on knicks games @nyknicks @nba @adamsilver @woj @nypost",
    "79": "@nyknicks Burks in the orange bc his play is criminal",
    "80": "@nyknicks play the youth",
    "81": "@nyknicks Essentials really gotta sponsor us,legit all of our players rock that shit😭",
    "82": "@nyknicks Why the game gotta be at 10:30 😭 I’m gonna be a zombie in class tomorrow",
    "83": "@nyknicks Trade randell",
    "84": "@nyknicks We want Cam drip",
    "85": "@nyknicks Knicks run NY",
    "86": "@nyknicks played so well yesterday I need that same energy tonight",
    "87": "New York Knicks Starting Lineup 3/7\n PG: Alec Burks\n SG: Evan Fournier\n SF: RJ Barrett\n PF: Julius Randle\n C: Mitchell Robinson\nhttps://t.co/o75oZ8vnE8",
    "88": "@FromNYtoLA1 @NBA_NewYork Yea, lotta fans was hype about him too. Knicks definitely hyped up his NYC roots as well and was marketing that quite a bit.\n\nJust sad he couldn’t even finish a season but that’s how bad it’s been for him and mostly the team as well.\n\nSeems like Thibs been lukewarm on Kemba",
    "89": "Tonight's starting lineup for the New York Knicks: Burks, Fournier, Barrett, Randle, Robinson https://t.co/bVWH4AMCA2",
    "90": "just went up to the bookie and said \"this is me Evan Fournier. I would like to gamble on the New York Knicks\"",
    "91": "@nyknicks @wingstop So of course y’all going to (try) win tonight’s game when this is a key game to loose for a top pick. Let’s trust Thibs will be Thibs tonight!",
    "92": "Uniforms for New York Knicks vs Sacramento Kings at 7:30 PM. \n\n#NewYorkForever #SacramentoProud https://t.co/nW1ZUw0pne",
    "93": "@KnicksUniTrack @nyknicks @SacKings_Unis @SacramentoKings @RjBarrett6 smh it’s a classic look. my favorite set for a while until this years citys were introduced",
    "94": "Check out New York Knicks 17 Card Lot RJ Barrett Rookie Cards, Randle, Robinson, D-Rose https://t.co/zowcN0QDyZ?🔵🟠🏀🏀mkcid=16&amp;mkevt=1&amp;_trksid=p2349624.m46890.l6249&amp;mkrid=711-127632-2357-0 @eBay",
    "95": "@FromNYtoLA1 @NBA_NewYork Yea really sad with Kemba. I was so hype with that 5-1 start and him playing well at that time was a lotta fun. Had me thinking Knicks were on their way to being one of the top teams in the league.\n\nThen things went south but then came back and that 44 pt game was fun too.\n\n(2/2)",
    "96": "@saquarantine @nyknicks @SacKings_Unis @SacramentoKings @RjBarrett6 Yeah we really do, tonight is the last time in the regular season though, means it will only be worn 9 times this season",
    "97": "📅: GAMEDAY @ 10:30 PM\nNew York Knicks Vs. Sacramento Kings - NBA League 2022\n🎟️🎥: https://t.co/FVLb5cWwZi\nOnly Available For Registered Users. Create a FREE account to get access",
    "98": "NBA Basketball Game Betting Picks Simulator: 10:40 PM ET - New York Knicks vs. Sacramento Kings - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/4Y42kU00O0 #nba #sportsbetting #freepicks #cappertek",
    "99": "@Knicks_SNOB @nyknicks @TAPEDByKnicks @IQ_GodSon Hey maybe in fact it's Thibs that's the evil genius &amp; motivated Quick by saying Burks was the best option we have lol... Hilarious to us, but just what Quick needed to really hear that nonsense for him to say He'll Nah &amp; start to play with the 🔥 &amp; as well as he is now IJS Lol 😆",
    "100": "Never 👎 seen the New York Knicks @ AAC in Dallas, Texas .",
    "101": "@hhpthebook @edotBrand @nyknicks @IQ_GodSon I just blocked this annoying person I don’t have time for bullshit",
    "102": "@JZero29 @Knickloyalty @hhpthebook @nyknicks @IQ_GodSon I’d disagree man. IQ has average 20mpg both this season and last. He’s had a way longer leash than Obi especially with the crazy shot selection IQ has at times.",
    "103": "@hhpthebook @nyknicks @IQ_GodSon He’s been used out of place all season but it looks like he’s getting the grasp of pg. shit takes years for some guards to learn like conley and Lowry it took awhile so I’d remain patient with iq.",
    "104": "@edotBrand @knicks81 @nyknicks @IQ_GodSon That he doesn't care about",
    "105": "@edotBrand @knicks81 @nyknicks @IQ_GodSon Thank makes two of us. That he first care about",
    "106": "@johncpacker @nyknicks @NBA Appreciate you reading it, my friend— thank you so much",
    "107": "@hhpthebook @knicks81 @nyknicks @IQ_GodSon AGAIN…do you ACTUALLY know any of the players⁉️🤔 EXACTLY…so you have NO REAL FACTS‼️ Just talkin out ya ass 😆😆😆😆😆😆😆😆",
    "108": "If The @Lakers &amp; @nyknicks Win Tonight I’ll Buy Someone A Copy Of #WWE2K22 @WWEgames  \n\nTo Enter :\n                 Follow-Like-Retweet 😎\n\nGoodluck Game Drops At Midnight 🎙",
    "109": "Sacramento Kings Vs New York Knicks [LIVE] 2022 NBA Basketball 👉 ▶️ : https://t.co/2rgaYbORAG | 7-Mar-22 | 22:30 | NBA | Basketball | New York Knicks | Sacramento Kings https://t.co/zyoppsZcAW",
    "110": "Sacramento Kings Vs New York Knicks [LIVE] 2022 NBA Basketball 👉 ▶️ : https://t.co/rSt9FY8FcR | 7-Mar-22 | 22:30 | NBA | Basketball | New York Knicks | Sacramento Kings https://t.co/TP7GfhQ2BQ",
    "111": "@edotBrand @knicks81 @nyknicks @IQ_GodSon Here is why...it all started about 10 hours ago. Then you came, and that's how we got here. Listen, just avoid my threads, we never have to do this again. Thanks https://t.co/viyTPErl26",
    "112": "Sacramento Kings Vs New York Knicks [LIVE] 2022 NBA Basketball 👉 ▶️ : https://t.co/UJvWpqFgDK | 7-Mar-22 | 22:30 | NBA | Basketball | New York Knicks | Sacramento Kings https://t.co/iXEyNPMp6f",
    "113": "It’s been quite the Monday evening for New York Knicks fans. \n\nLatest for @HeavySan: \n\nhttps://t.co/pKA4DtYE4E",
    "114": "Just finished reading Blood In The Garden about the @nyknicks of the 90s. A great read for a kid who followed the @NBA in the 90s. A great job @Herring_NBA",
    "115": "@nyknicks I need some city edition jerseys.. \nRowan n Cameron. Where does one need to go?",
    "116": "Youth programs are important to providing spaces for our kids to have positive role models &amp; resources.\n\nGrowing up, I loved playing basketball! It was great to watch the next gen of #CD18 enjoy their Saturday’s w/ their friends &amp; special guest Former @nyknicks John Wallace!\n\n2/3 https://t.co/o56rkjhyRo",
    "117": "Had so much fun at @CASTLEHILLYMCA Saturday Night Lights Basketball Clinic this Saturday. Thank you to @nyknicks @NYCYouth @ymca &amp; @Nike for supporting important programs like this that give our kids options for how they want to spend their time &amp; plan for their futures.\n\n1/3 https://t.co/djZRogM88Z",
    "118": "Last thing you want to do is attack #Knicks fans. Last thing. Because once you leave New York, you'll never get the same love. This is the price you pay when you're on the Knicks. This is the price of fame. Gotta be a whole lot stronger and tune out all the noise - good or bad.",
    "119": "The New York Knicks’ fast start to the season helped its ratings on MSG.  https://t.co/UTqMxctOhs",
    "120": "@sny_knicks @nyknicks Cam can ball",
    "121": "@nyknicks Chea: teams gonna make sure we don't tank now. Hello 8 seed pick. Any city out there that starts with a K or N wanna buy a team? Knoxville Knicks? Has a nice ring. Norfolk?",
    "122": "@nyknicks Please speak out! https://t.co/kjWX0qdAQp",
    "123": "New York Knicks' Chris Mills scores 49 points in close loss to Sonics. #NBA #NBA9798",
    "124": "@nyknicks Extend Mitch",
    "125": "This Knicks-Magic Trade Features Markelle Fultz To New York #NBA #NBA75 #NBATwitter #MarkelleFultz #MagicTogether #NewYorkForever \n\nRead More- https://t.co/SWx3Snl1yk https://t.co/DMJ33cfrfV",
    "126": "@hhpthebook @knicks81 @nyknicks @IQ_GodSon My ex is a Knicks player…I’m someone who ACTUALLY knows him. You’re NOT‼️ Why are you even on the feed⁉️😆😆😆😆😆😆😆😆",
    "127": "@KendraRandle_ @NBA_NewYork When the star player plays bad and looks disinterested the fans are allowed to criticize. The fact that your on Twitter attaching a dude who’s job is commenting on the Knicks during the good and bad shows that your out of touch. This is a profesional sport not AAU.",
    "128": "@nyknicks @IQ_GodSon @RjBarrett6 I call BS. This has to be a typo.",
    "129": "very winnable game tonight ngl @nyknicks",
    "130": "@hhpthebook @nyknicks @IQ_GodSon Until he’s off the ball I’m not sold, if a top notch wing is on the board draft wise, he’s outta here.",
    "131": "@nyknicks JULIUS RANDLE BE BETTING ON GAMES REPRIMAND HIM",
    "132": "@FanDuel The New York Knicks: A Story of Incompetence",
    "133": "So what kind of @nyknicks we are going to get tonight? So we win one more and that’s it so we can Tank tank tank lol as my bro would say @KillaDaMak or we continue to win and keep whatever draft picks and just fucking build the right way? What do yal think? Talk to me",
    "134": "@edotBrand @knicks81 @nyknicks @IQ_GodSon See, why am I ignorant? You came on a feed where we knick fans discuss the knicks.  You went all in on the crazy ex routine. Nobody cares and me saying that makes me ignorant. Okay!",
    "135": "@forevershinin @nyknicks @J30_RANDLE Facts she prob fuels a lot of it",
    "136": "@Farbod_E @ALLAN_HOUSTON @nyknicks @J30_RANDLE I would give this a million ❤️ if I could.",
    "137": "@nyknicks are in good hands… if they don’t get in their own way lol https://t.co/ju2EVXCyeh",
    "138": "@inkookang I must confess this title did cause me some confusion because back in 2010 in the inaugural ESPN 30 for 30 documentary run they had a documentary called \"Winning Time: Reggie Miller vs. The New York Knicks.\" So now there are two NBA related long titled things called winning time.",
    "139": "#NBA New York Knicks forward Julius Randle has been fined $50,000 for initiating an on-court altercation\n\nRead the full details on https://t.co/J5bUDTDn8u (@theseurbantimes) https://t.co/IrBrc39fns",
    "140": "@HighlyPoison @nyknicks RJ shot a million times better from the field last year (40% from 3 which is well above nba average) and you said he couldnt shoot..which one is it?",
    "141": "@KrauseHouseDAO @Suns @nyknicks @Dlee042 Wow, amazing",
    "142": "Apuesta en #NBA\nNew York Knicks vs Sacramento Kings \nbet on NBA https://t.co/G12GZJAZB5",
    "143": "@HighlyPoison @nyknicks Its called free throw line and 3 pointers..your not paying attention to todays nba 8-20 ..10-23 is widely accepted..I dont necessarily like it but thats todays nba ..if Ja had the same stat line as RJ you wouldnt call it a bad game",
    "144": "@DiehardknicksPC @rahmmagick @StateNYKPOD @DailyKnicksFS @boxand21 @nyknicks Sims can be a Mitch like player I wouldn’t mind being a starter if he leaves.",
    "145": "Surging RJ Barrett looks likely to break Knicks’ sad first-round pick trend #NewYork #Knicks #NBA https://t.co/7ZDNu637HF",
    "146": "@rahmmagick @StateNYKPOD @FloydSamuels20 @DailyKnicksFS @boxand21 @nyknicks What if Mitch leaves though? Who would you look to replace him? I'm curious to hear answers too... this isn't even my post lol... can we get some order? https://t.co/VhAKlpaM9F",
    "147": "@hhpthebook @nyknicks @IQ_GodSon It was hard to stay on that IQ train for those couple weeks when he couldn’t make a shot lol good to see him looking like himself again.  A little worried he may be a real streaky shooter throughout his career tho",
    "148": "In conclusion: put Julius Randle on the first Amtrak train leaving Penn Station.\n\n@nyknicks",
    "149": "🚨 NEW POD ALERT 🚨\n\n🎙 Ep. 7 of Around The Association is LIVE\n\n🏀 We're back for Part 2 with former @Suns coach + 20 year NBA vet, Phil Weber!\n\n🧠 We talk hoops strategy, the brilliance of Mike D'Antoni, + @NYKnicks stories about @DLee042\n\n👇 Stream it!\nhttps://t.co/R9KaNv8jfH",
    "150": "@nyknicks u really have to trade @J30_RANDLE this draft/summer for many reasons it's time now his family is coming at innocent ppl who love the #knicks cmon it's getting outta hand the whole attitude &amp; entitlement from this guy Randle nah it's gotta stop fans dont wnat him here !",
    "151": "#spikelee might not be in attendance at @nyknicks vs @SacramentoKings but, don't worry Spike I got you. #NBA #NewYorkForever https://t.co/bsKscgw6cV",
    "152": "@hhpthebook @knicks81 @nyknicks @IQ_GodSon And you’re calling me crazy 😭😭😭😭😭😭😭😭😭😭😭😭😭😭",
    "153": "@CWilliamson44 Totally uncalled for. @CPTheFanchise is a class act. It's just time for the @nyknicks to move on from Randle. The situation has become toxic.",
    "154": "@nyknicks @IQ_GodSon I hope Knicks don’t get rid of him. Quickley, Grimes, Sims, Robinson, Barrett they are Knickerbuckers future ..",
    "155": "@nyknicks @wingstop So he been talking his way into the rotation? I have a feeling y’all set Alec Burks up for this 😭 y’all knew what we was going to say",
    "156": "Hell freaking Yeah! \nAlthough I'm not a Fan of New York Knicks but you go have fun there. https://t.co/NTtrrb15tb",
    "157": "@nyknicks @wingstop I don’t know why thibs is using A. Burcks as a point guard. For me the best line up is Barrett as PG, with Reddick playing as SF or some def player as SF. Burcks is better when he come out the bench.",
    "158": "Who's the smoothest talker on the team? | Wingstop x Knicks #NewYork #Knicks #NBA Video: https://t.co/peDkc7x3Yz",
    "159": "New York Knicks: Kings vs Knicks: Live Stream, Score Updates and How to Watch NBA Match https://t.co/J7x4Rfmurh",
    "160": "@nyknicks @wingstop I think Burks should talk his way out of the starting line up.",
    "161": "@terrellowens @Suns @nyknicks That’s because Cam went to Unc",
    "162": "@Knicks_SNOB @nyknicks @TAPEDByKnicks @IQ_GodSon Thought the same thing.",
    "163": "Other than the @nyknicks, @StJohnsBBall is the least deserving team to call MSG their home arena.",
    "164": "@DustinJ65534149 @KayCSmooth @NBA @IQ_GodSon @nyknicks Eveyone under the age of 25. Start Quickley and Obi, they're not going anywhere anyways so wtf they got to lose? Or at the very least give the kida 25 mins a game. When Taj Gibson is playing 35 mins and Obi 10 something is wrong.",
    "165": "@nyknicks @wingstop ALEC SHOUT TALK HIS WAY OUT THE STARTERS",
    "166": "@Farbod_E @ALLAN_HOUSTON @nyknicks @J30_RANDLE I used to see Wayed a lot when I worked in phone sales in Irvine, my Target was down the street from him! Such a good dude, really makes me smile seeing him meet his Knicks",
    "167": "Hell yeah! Rocking my old school replica jersey from 1999… Bench Mob creator the awesome sharp shooter, Jon Barry. We back at home vs them New York Knicks. Late game start time is at 7:30pm, 7:40pm tip off! Let’s do our thang baby.. \n#KingsAllDay\n#SacramentoProud\n#Golden1Center https://t.co/MP6nvRYc6y",
    "168": "he is gold he plays on the New York  knicks",
    "169": "@edotBrand @knicks81 @nyknicks @IQ_GodSon Quickley is the King of NY",
    "170": "@edotBrand @knicks81 @nyknicks @IQ_GodSon And you wonder why relationships may be a problem",
    "171": "@nyknicks @wingstop Who’s the craziest Knick? Orange Julius!",
    "172": "@hhpthebook @knicks81 @nyknicks @IQ_GodSon You’re OBVIOUSLY unemployed 😆😆😆😆",
    "173": "Back NEW YORK KNICKS to BEAT Sacramento Kings tonight in the @NBA (Game Starts at 03.40 GMT) #NVA #Basketball",
    "174": "@Farbod_E @ALLAN_HOUSTON @nyknicks @J30_RANDLE Ayyyyy Wayed is the man, he goes to the same gym as me haha",
    "175": "@_BigSteve89 @nyliberty @nyknicks LETS GOOO 😂😂",
    "176": "@KnickedupFan @nyknicks @wingstop He also talked his way out of being traded",
    "177": "@Viral_Marc @nyknicks @wingstop Thanks for strolling through my photos? Love my fans",
    "178": "50K+ #Google searches 4 @nyknicks 1h old https://t.co/NSAGIRqFvB https://t.co/pviRRV9FHV \n#California 🌅 6:20 🌆 17:59 PST https://t.co/59FQ02acHZ",
    "179": "New York Knicks",
    "180": "@Rakish_5 @nyknicks @NBA @NY_KnicksPR Just a concerned citizen wanting to see justice served",
    "181": "@Viral_Marc @nyknicks @wingstop Very fuck Julius! Can’t wait for him be off the team",
    "182": "@kaitlancollins Guy's got more balls than the New York Knicks. #Ukraine https://t.co/3xeBisPAhA",
    "183": "🏀NEW YORK KNICKS VS Sacramento Kings LIVE🎙️️ PLAY BY PLAY &amp; 🍿WATCH-ALONG... @dyingbreed18  https://t.co/u2IHjL8NqP via @YouTube",
    "184": "@NicoleFetchko @nyliberty @nyknicks I’ll be your agent ! Max contract or we walk",
    "185": "@_BigSteve89 @nyliberty @nyknicks HAHAHA thanks for promoting me 😂😂😂😂😂😂😂",
    "186": "@edotBrand @knicks81 @nyknicks @IQ_GodSon Show your face, I can tell you right now that you're a Liar.",
    "187": "@knicks81 @edotBrand @nyknicks @IQ_GodSon Yo, I'm like did we just enter the crazy zone",
    "188": "@nyknicks @IQ_GodSon YESSS QUICK",
    "189": "@gracecook12899 @nyknicks @23savage____ Im done this is too good seeing them side by side 😂😂 mitch is a legend",
    "190": "@NicoleFetchko @nyliberty sign her ! Hell even @nyknicks sign her up !!",
    "191": "@nyknicks this is what happens here. Knicks should just tank but they will probably try to make a push when they have no chance.  5.5 behind with 19 games is no chance.  So  let’s play the young core.  Thibs is not gonna want to be proven wrong with switching rotation",
    "192": "New York Knicks: Game Preview: Knicks at Kings- 03/07/22 https://t.co/GHNajQM3IP",
    "193": "Rob V: NBA Late Night NBA Power System Play\nGame: (575) New York Knicks at (576) Sacramento Kings\nDate/Time: Mar 7 2022 10:40 PM EST\nBetting Line Provider: Consensus Line\nPlay Rating: 2 units\nPlay: New York Knicks +3.5 (-110)",
    "194": "Rob V: NBA Late Night NBA Power System Play\nGame: (575) New York Knicks at (576) Sacramento Kings\nDate/Time: Mar 7 2022 10:40 PM EST\nBetting Line Provider: Consensus Line\nPlay Rating: 2 units\nPlay: New York Knicks +3.5 (-110)",
    "195": "@MFZOOM12 @nyknicks @NBA @NY_KnicksPR Snitching??????",
    "196": "@nyknicks you are the laughing stock of sport. https://t.co/xPJiUfpUsP",
    "197": "@nyknicks @wingstop I think Julius he can talk himself out of the game real quick 😂",
    "198": "@nyknicks @wingstop Now we know how Burks is still starting",
    "199": "@nyknicks @wingstop Quentin funny af",
    "200": "@nyknicks @wingstop It’s has to be Burks… he obviously talked his ways into the starting PG role",
    "201": "@BurnerClarkson @nyknicks @wingstop More w games than wins",
    "202": "@nyknicks @wingstop so thats how Alec Burks stays starting",
    "203": "@nyknicks @wingstop Alec talked his way into playing pg",
    "204": "@nyknicks @wingstop burks definitely can talk his way into getting unnecessary minutes",
    "205": "@nyknicks @wingstop Tom is",
    "206": "@NYCtoCincy @NBA_NewYork @TheAthletic Well done…I hope all Knicks fan follow suit",
    "207": "\"I think he can talk his way out of anything.\" 😂\n\nWho's the smoothest talker of the bunch? | @wingstop https://t.co/IUPj1LAksc",
    "208": "@dan_ny_b Yes, New York Knicks forever! I went to Lakers game vs. Knicks game in February,  my first time watching my team.  SO KOOL 🏀",
    "209": "Resultados NBA\nWashington Wizards 133-123 Indiana Pacers \nHouston Rockets 123-112 Grizzlies\nOklahoma City Thunder 103-116 Utah Jazz\nCleveland Cavaliers 104-96 Toronto Raptors \nDenver Nuggets 138-130 New Orleans Pelicans (pro)\nLos Ángeles Clippers 93-116 New York Knicks",
    "210": "#BingBong is to the @nyknicks season as Jay Bruce was to the @Yankees season.",
    "211": "@SpecificNY @NBA @WNBA @nyknicks @AdamSilver @marktatum @TheNBPA @nypost @nytimes @NYDailyNews @Newsday @BleacherReport @TMZ @KnicksMSGN @MSGNetworks @wcknicks @NBAOfficial @OfficialNBARefs @WaltFrazier @MikeBreen I also have information that could lead to the arrest of Julius Deion Randle 🙏🏽",
    "212": "March 2, 1962: \"Give it to Wilt,\" the crowd screamed. The Philadelphia Warriors' Wilt Chamberlain sets a NBA record when he scored 100 points (36/63 FGs and 28/32 FTs) in an NBA game against the New York Knicks in Hershey, Pennsylvania. \n\nThe late Kobe Br…https://t.co/FpNkRst5HV",
    "213": "Jazz, Knicks show value on Monday NBA betting board #NewYork #Knicks #NBA https://t.co/cHbPtPxutc",
    "214": "If the New York Knicks beat the Sacramento Kings tonight, I will give one random person who likes this tweet $50 free play.",
    "215": "Some of my photos from the @nyknicks win versus the Clippers last night. https://t.co/RdJrSLpKlg",
    "216": "Oh God @TheFrankIsola can’t help himself “New York Knicks draft pick Hubert Davis”",
    "217": "#Bulls fans, #NBA writer @Herring_NBA from @SInow joins The Double A Team tonight to talk about his best-seller, \"Blood in the Garden: The Flagrant History of the 1990s New York #Knicks\"\nJoin the YouTube Chat at 7pm CT / 8pm ET\nhttps://t.co/955fCFIBWz https://t.co/jHqdSgL8YJ",
    "218": "Thibs stay in those gambling discords @nyknicks @NBA @NY_KnicksPR",
    "219": "Following Teams Remain for Tonight's 5 Box Basketball Mixer\n\nhttps://t.co/AF0AXOU7od\n\nFREE SHIPPING &amp; NO TAX\n\nLos Angeles Clippers$65.00\nNew York Knicks$65.00\nPhoenix Suns$75.00\nPortland Trail Blazers$75.00\nSan Antonio Spurs$80.00\nUtah Jazz$75.00\nWashington Wizards$75.00 https://t.co/H8b14OdwsL",
    "220": "@KnicksVerse @IQ_GodSon @nyknicks That was a good win last night. Hopefully thibs realized what everyone has been seeing about the fourth quarter",
    "221": "@knicks81 @hhpthebook @nyknicks @IQ_GodSon Pray you NEVER go through Narcissistic abuse…you OBVIOUSLY couldn’t handle iT‼️",
    "222": "@nyknicks last night we got a lineup of Barrett &amp; Reddish at the forward spots and it was very successful.  i’m assuming it was more of a necessity move with Obi out, but i think Thibs has to give us  a lot more of this lineup.  it can’t be an aberration or one off 👍🏿",
    "223": "@knicks81 @hhpthebook @nyknicks @IQ_GodSon You’re DEF just a fan…FACTS‼️💯",
    "224": "@hhpthebook @knicks81 @nyknicks @IQ_GodSon You’re the one you LOOKS crazy…supporting someone YOU’VE never met and who doesn’t give AF about you 😆😆😆😆😆😆😆😆",
    "225": "Waiting for that Zion has been traded to the New York Knicks notification",
    "226": "NEW City That Never Sleeps Glitter Gel from the @ColourPopCo x @nyknicks Collection! #nyknicks #colourpopnba https://t.co/MQS4Z5bMOz https://t.co/opkmdis83J",
    "227": "Philadelphia 76ers - Chicago Bulls\nSacramento Kings - New York Knicks\n\nBet slip link: https://t.co/xD2W4oeMlT https://t.co/qsvT2g4Vwp",
    "228": "@hhpthebook @nyknicks @IQ_GodSon I don’t think IQ is an assist first PG. I believe he’s a scorer first. Thibs plays him as atraditional PG, that’s why he’s ineffective sometimes. When the Knicks are running and pushing pace he can be effective even when the Jumper isn’t falling.",
    "229": "@jojofashow @nyknicks Yeah bad is 6 for 26, 8 for 20 that's bad.. you can't miss more shots than you made but praise you for having 20 points",
    "230": "Fighting to stay up at my age for these 10 pm @nyknicks games… https://t.co/2MZKfCLbDt",
    "231": "The Sacramento Kings will look to get back into the win column tonight when they face the New York Knicks at Golden 1 Center.\n\nHere's what happened on Saturday in Dallas: https://t.co/pjxEsAkRnK",
    "232": "Hey thibs… how’s that for numbers? @NY_KnicksPR @nyknicks https://t.co/UrbU0xgGzr",
    "233": "@Farbod_E @ALLAN_HOUSTON @nyknicks @J30_RANDLE the Breen pic is priceless it’s always more than just a game",
    "234": "@hhpthebook @edotBrand @nyknicks @IQ_GodSon Facts who ever this person is sounds bitter as fuck I don’t care about iqs personal business it’s knicks on the front of the jersey as long as he’s helping us win we good",
    "235": "@sny_knicks @BrandonLondonTV @NYPost_Berman Victory”\nA song dedicated to our New York Knicks. Inspiration for Knicks players and fans. \nVictory (Kings and Queens) wherever you listen to music!",
    "236": "@edotBrand @knicks81 @nyknicks @IQ_GodSon 🤣🤣🤣 I don't care about a entertainers personal life, I have my own family. Aint nobody pressed to meet a ball player,  except maybe a groupie. Don't stay on here looking crazy, slide in the background and just be quiet. Telling strangers who you use to date.  Stop it!",
    "237": "@Knicks_SNOB @nyknicks Berman is something special 🤣",
    "238": "@mark_geisel @Rangers @dallasmavs @utahjazz @nyknicks Tickets in email",
    "239": "@Dutch_Oven45 @Rangers @dallasmavs @utahjazz @nyknicks No problem we still good here!🙏🏻",
    "240": "@mark_geisel @Rangers @dallasmavs @utahjazz Lmao guess what it’s Wednesday game. I’m a dumbass and read the schedule wrong.  You will be going to Wednesday game vs the @nyknicks hahah totally read that wrong hahahah but congrats and enjoy the game WEDNESDAY not today!!",
    "241": "@nyknicks I'll be at the game tonight https://t.co/Hc8UX51NOO",
    "242": "@nyknicks @IQ_GodSon @RjBarrett6 If the Knicks make free throws they will Win.  That means having Cam &amp; IQ on the floor in the 4th qtr",
    "243": "@SpecificNY @NBA @WNBA @nyknicks @AdamSilver @marktatum @TheNBPA @nypost @nytimes @NYDailyNews @Newsday @BleacherReport @TMZ @KnicksMSGN @MSGNetworks @wcknicks @NBAOfficial @OfficialNBARefs @WaltFrazier @MikeBreen Oh this the one",
    "244": "@SpecificNY @NBA @WNBA @nyknicks @AdamSilver @marktatum @TheNBPA @nypost @nytimes @NYDailyNews @Newsday @BleacherReport @TMZ @KnicksMSGN @MSGNetworks @wcknicks @NBAOfficial @OfficialNBARefs @WaltFrazier @MikeBreen This deserves to be a viral tweet",
    "245": "#Knicks @ #Kings Free NCAA Basketball Betting Pick For Tonight. https://t.co/598IOqlKlW after beating the #Clippers in #LosAngeles #NewYork is in #Sacramento for the 4th of a 7 game trip. #FreeNBAPicks #RJBarrett #Tipster #Golden1Center #SportsBettingTips",
    "246": "@SpecificNY @NBA @WNBA @nyknicks @AdamSilver @marktatum @TheNBPA @nypost @nytimes @NYDailyNews @Newsday @BleacherReport @TMZ @KnicksMSGN @MSGNetworks @wcknicks @NBAOfficial @OfficialNBARefs @WaltFrazier @MikeBreen Vouch",
    "247": "I have proof Evan Fournier bets on NBA games who do I talk to about this @NBA @WNBA @nyknicks @adamsilver @marktatum @TheNBPA @nypost @nytimes @NYDailyNews @Newsday @BleacherReport @TMZ @KnicksMSGN @MSGNetworks @wcknicks @NBAOfficial @OfficialNBARefs @WaltFrazier @mikebreen",
    "248": "#NBA \n\n@dallasmavs vs @utahjazz \n+213.5 x 1.61\nFinney Smith 17.5 PPR x 1.75\n\n@SacramentoKings x @nyknicks \nSibonis RP +17.5 x 1.80\nFox +24.5 Points x 1.68 \nBarnes 20 pts x 2.60\n\n@spurs x @Lakers \n3 points inscrits dans le match\n+24.5 x 1.80",
    "249": "@oth_basketball @SacramentoKings @nyknicks Let’s go Kings!",
    "250": "The @SacramentoKings have revenge on the mind as they return home from a 5-game road trip for a rematch with Julius Randle and the @nyknicks. Tom Witt (@sactowncrown) brings you everything you need to know in his preview! #SacramentoProud https://t.co/Uh5YkX6g8t",
    "251": "@nyknicks Pay him already.If I was coaching him,he would be a 70% foul shooter and average 16 to 20 points a game.",
    "252": "@nyknicks @IQ_GodSon Tougher defense 🏀 stronger offense 💪 let's gooooooooo Knicks 🏀⛹️⛹️⛹️⛹️⛹️⛹️⛹️⛹️⛹️",
    "253": "@NBA_NewYork I like fun Knicks ball",
    "254": "@nyknicks @MSGNetworks @BetMGM Break the losing STREAK 🏀 💪 Tougher defense 💪 stronger offense 💪 let's get the WIN STREAK Baccccccck 🏀",
    "255": "@edotBrand @hhpthebook @nyknicks @IQ_GodSon As long as he helps the knicks win and plays team ball I’m happy 🤷🏽‍♂️",
    "256": "Looking for a value bet?  See if the New York Knicks-Sacramento Kings Predictions and Preview for 3/7/2022 is one in our preview.  No crazy hype just a prediction and preview. #Punters #Basketball https://t.co/lvRWLZyx1W",
    "257": "@HighlyPoison @nyknicks 1 game good than 2 bad?  Problem is your definition of bad is different for different players",
    "258": "Tale of the tape 📊\n\n@DKSportsbook | #NewYorkForever",
    "259": "@SeanTheGawd_ 😂😂😂 I’m crying lol. Niggas don’t appreciate shit smh. Only thing that’ll make y’all relevant again after bron is the city. They got the women, weed, and weather. Other than that The franchise has been Uber incompetent the past 10 years. Like New York Knicks incompetent",
    "260": "Coach k retirement from college takes the knicks head coaching job and knicks trade for Zion the New York DukeNukeEms 💥 https://t.co/XCciLuTuwy",
    "261": "@hhpthebook @knicks81 @nyknicks @IQ_GodSon STOP supporting a guy that YOU WILL NEVER meet and doesn’t give AF about you….that’s the REAL NONSENSE‼️🤦🏽‍♀️",
    "262": "New York Knicks visits Sacramento Kings Predictions and Preview for 3/7/2022 today.  Who are we taking in this game?  Find out now. #Punters #Basketball https://t.co/lvRWLZyx1W",
    "263": "@hhpthebook @knicks81 @nyknicks @IQ_GodSon Says the fan who has NEVER met him and NEVER will‼️😆😆😆😆😆😆",
    "264": "@edotBrand @knicks81 @nyknicks @IQ_GodSon I know you ain't on Twitter trolling,  stop the nonsense!",
    "265": "New York Knicks: Kings vs. Knicks Preview: Start spreading the news https://t.co/nU9LbyL0h9",
    "266": "@NBA_NewYork @TheAthletic Even if you wanted to take another objective source like a video game, @NBA2K has him at 59…..how he isn’t recognized in top 125 is purely to get a reaction from Knicks fans",
    "267": "@nyknicks If he only had a mid range game, a go to move to the basket improve is free throw shooting and stay healthy he might be extended.",
    "268": "@knicks81 @hhpthebook @nyknicks @IQ_GodSon And as a fan, you should know the type of person you’re supporting…BECAUSE you’ve OBVIOUSLY NEVER met him‼️ I know him, so I’m going to keep it ALL the way 💯",
    "269": "@KnicksMSGN @RjBarrett6 @camreddish Give them all the playing time pls @nyknicks",
    "270": "Driving and thriving @nyknicks @TheKnicksWall https://t.co/6Avhtq02jY",
    "271": "@nyknicks @IQ_GodSon bully",
    "272": "Lil man a @nyknicks fan now https://t.co/LOdYsJsIUn",
    "273": "@tommiedotjpg @nyknicks You’re on a roll my man! 🏆",
    "274": "@nyknicks @MSGNetworks @BetMGM Cam Reddish minutes",
    "275": "@edotBrand @hhpthebook @nyknicks @IQ_GodSon Looking at your tweets you sound bitter he balled out last night and is showing improvement running the point as long as he plays defense and makes the right plays I’m happy with him",
    "276": "Been begging @nyknicks to hire Mark Jackson since we drafted RJ. I’m glad to rest of the world is finally catching on. He clearly gets what development is and would allow the org to really evaluate what we have in these young boys.",
    "277": "@Lakitu886 @nyknicks Cam Reddish",
    "278": "@MumuAFC23 @nyknicks @RjBarrett6 Tf is this suppose to mean",
    "279": "Check out New York Knicks 17 Card Lot RJ Barrett Rookie Cards, Randle, Robinson, D-Rose https://t.co/8E1GLeRVtM @eBay",
    "280": "@Farbod_E @ALLAN_HOUSTON @nyknicks @J30_RANDLE This is amazing. Thanks for sharing, Farbod. 😭",
    "281": "1992-1993 New York Knicks - Standing Pat In A Bullish Eastern Conference - https://t.co/4Nov8RCA7y #Basketball #NBA #NewYorkKnicks https://t.co/bjp63XKB6i",
    "282": "@Lakitu886 @nyknicks Cam Reddish",
    "283": "@Lakitu886 @nyknicks Cam Reddish",
    "284": "@nyknicks Start Cam Reddish",
    "285": "Ende #Basketball Herren #NBA \n96:104 TorontoRaptors vs #ClevelandCavaliers \n130.138 nV NewOrleansPelicans vs #DenverNuggets \n116:93 #NewYorkKnicks vs losAngelesClippers",
    "286": "@Lakitu886 @nyknicks Cam Reddish",
    "287": "@Lakitu886 @nyknicks Cam Reddish",
    "288": "@nyknicks Cam Reddish",
    "289": "The games keep coming. Let's get after it again tonight 🔒 https://t.co/O3ifOob8Jl",
    "290": "📅GAME DAY📅\n\n🏒 @NYIslanders at 7:30pm\n🏀 @nyknicks at 10:30pm\n\n#NYC #Isles #NewYorkForever https://t.co/EQMcGAmvEu",
    "291": "@Farbod_E @ALLAN_HOUSTON @nyknicks @J30_RANDLE Aww I love this, so cool Farbod",
    "292": "@Knicks_SNOB @nyknicks @IQ_GodSon Lol they always have good matchups too",
    "293": "@Itstomjon @duhitzzack_ @NBA @nyknicks Bad coaching",
    "294": "@knicks81 @hhpthebook @nyknicks @IQ_GodSon I’m his EX‼️ I wouldn’t be telling y’all this unless I lived iT‼️ Quickley is seriously the WORST person you will EVER meet‼️🤡",
    "295": "@hhpthebook @knicks81 @nyknicks @IQ_GodSon I’m his Ex so I actually know him…and I’m going to speak the 💯",
    "296": "@nyknicks Kings and Nets should be victories. Mavs and grizzlies they gonna have to excellent to win those games",
    "297": "#snkrs #jordan #nike #NewYork #knicks\n\nThese are nice in hand! \n\nJordan 3  “Knicks”\n\n04-08-88 https://t.co/T4xxeZK5IH",
    "298": "@edotBrand @hhpthebook @nyknicks @IQ_GodSon How do u know this u know him personally ? Come on 🙄",
    "299": "@nyknicks @SociosUSA LET’S GO CAM!!!!!!",
    "300": "@edotBrand @knicks81 @nyknicks @IQ_GodSon Easy there sparky!",
    "301": "@nyknicks @TAPEDByKnicks @IQ_GodSon Maxey inspired him.",
    "302": "@alanhahn preach on man! @nyknicks Let’s ride with the young guns for the rest of the year.#Knicks",
    "303": "The last Knicks draft pick to sign a multi-year contract with New York after his rookie deal was Charlie Ward in 1999 https://t.co/O30qiZAIXq",
    "304": "@Knickloyalty @hhpthebook @nyknicks @IQ_GodSon thibs is the guy who gave him only 10 min a game &amp; a very very short leash. Never allowed him to get into rhythm, afraid of making any mistakes or get benched &amp; shattered his confidence.",
    "305": "Hey @NFLOfficiating @nyknicks  and @espn, check out this awesome information our 8th graders put together on discrimination and injustice in sports!\nhttps://t.co/dErIrMiFFu",
    "306": "It’s been 3,230 days since the New York Knicks last won a playoff series #bingbong 🤡",
    "307": "They say my body is not used in the right field well if I’m not on the @nyknicks that’s not a bad idea",
    "308": "The New York Knicks stupidly won last night &amp; have dropped to the 8th spot in the draft lottery only giving them a 20.3% chance of landing a TOP-4 PICK.\n\n@_AngelfrmPhilly @UGPMANAGEMENT @MoesKnicksTake @DewayneKnicks @iamrocknation @ariojosdemiel @NathanielEdge1 @CornholeCousins",
    "309": "@nyknicks Seriously doubt any Knicks fan wanted Randle's Autograph. #FireThibs",
    "310": "NYC Daily Roundup 03/07: Vaccine + mask mandates end across city, @nyknicks end losing streak on the road &amp; more news https://t.co/gNzsAqT4LX \n\n#NewsBreak",
    "311": "@nyknicks People saying extend him need to realize that Robinson is near the bottom of the league across several stat lines when it comes to starting centers. He is only ranked in the top 10 for his blocks per game. The Knicks CAN &amp; should look to improve at the center position.",
    "312": "New York Knicks stuns Los Angeles Clippers 116-93 at https://t.co/eg7qZg6wzA Arena.",
    "313": "@knicks81 @hhpthebook @nyknicks @IQ_GodSon Quickley is NEVER going to be consistent because he’s a Narcissist‼️ He is ONLY about manipulating whoever to get what is BEST for him. Period.",
    "314": "@bk_yank86 @hhpthebook @nyknicks @IQ_GodSon Quickley is a Narcissist‼️ It’s not “hero” mode…it’s ALL about him getting his numbers. You all won’t be successful with him in a team because he is ONLY thinking about self‼️🤡",
    "315": "@tyknickstape @nyknicks If they don't find someone better, they will. As good as he is playing, he is near the bottom in terms of top starting centers in the league. Blocks per game being his only stat that has him in the top 10. They can extend him but it would be wise to not overpay him.",
    "316": "@hhpthebook @nyknicks @IQ_GodSon Quickley is a Narcissist‼️ Stop supporting a guy that treats people like 💩",
    "317": "@Farbod_E @ALLAN_HOUSTON @nyknicks @J30_RANDLE That’s awesome ❤️",
    "318": "@money_talks65 @CKeeley1021 @TakeDeezPolls @TheLakersReview @MagicJohnson Dallas Mavericks new addition 6'7 Reggie Bullock just left the New York Knicks,  a Top 5 NBA Defense.\nWhen you have the #1 ranked NBA defense you don't abandon that Carmelo, Westbrook, Monk, &amp; Ellington.",
    "319": "@MrChuckD @nyknicks @KnicksFanTv @CPTheFanchise @livelikelefty @Traticaster101 @JDSportsTalkNY JADEN IVEY HANDS DOWN. IF I WAS LEON I WOULD\n\n1) KEEP THIBS TILL END OF THE SEASON TO COMMAND TANK AND FIRE HIM THE SECOND THE LAST GAME ENDS\n2) TRADE RANDLE AND FOURNIER EVEN IF U HAVE TO SELL LOW (SHOULDA LISTENED TO ME LAST YEAR/THIS OFFSEASON)\n3) NO IVEY THEN ADDRESS PG IN FA",
    "320": "@nyknicks Did you #FireThibs yet? If not, it's not a good morning",
    "321": "@Arifromanhattan Who’s your drafted golden child Ari might I politely ask to take the @nyknicks to the promised land lol ? @KnicksFanTv @CPTheFanchise @livelikelefty @Traticaster101 @JDSportsTalkNY",
    "322": "@Farbod_E @ALLAN_HOUSTON @nyknicks @J30_RANDLE This is very awesome. I see him around town and at the local gym a lot. Can’t wait to talk to him about his experience",
    "323": "@nyknicks Great Night 🤩🎊",
    "324": "All the time bro…im convinced @espn literally hates anything NEW YORK…its done to the knicks jets yankees Giants as well https://t.co/5Z0dI61w3W",
    "325": "@LynchLucine @NBA @nyknicks Yeah I See That Happen Every Time",
    "326": "The New York Knickerbockers have a record of 26 - 38 #Knicks https://t.co/WAzPD57hUX",
    "327": "Magic Johnson was traded by the Lakers to New York Knicks. \n\nTrue or False",
    "328": "@nyknicks Pay him",
    "329": "@nyknicks Y’all posting lay ups. We really suck https://t.co/o6MSVaKCD6",
    "330": "@SuperJude_ @nyknicks @DKSportsbook Im just glad they didnt blow the lead and held on, im a diehard fan.",
    "331": "@nyknicks Extend my Starting Center",
    "332": "@nyknicks Fire Thibodeau and trade Randle",
    "333": "@Knickloyalty @nyknicks @IQ_GodSon Whatever, I'm trying to get it back",
    "334": "@nyknicks Extend Him",
    "335": "@nyknicks KEEP THE DEUCE, QUICK, RJ, CAM, MITCH/SIMS LINEUP",
    "336": "@nyknicks Extend him please",
    "337": "@nyknicks so maybe you should extend him!",
    "338": "@nyknicks Start Cam plz",
    "339": "@nycSportsfan718 @hhpthebook @jbryant3 @nyknicks @NY_KnicksPR If the Knicks won't quit, you shouldn't quit!!!",
    "340": "@NBA_NewYork At 10:30pm no less w/e I'll be watching - Go Knicks!",
    "341": "@KnicksMSGN @RjBarrett6 @nyknicks Last night was a great example of when you run rj out with the other kids, they all thrive. The old farts don't have nearly the amount of effort the kids do and last night proved that",
    "342": "What's #Best on https://t.co/DVTf2jd2ZR ?\nRj Barrett : Knicks Postgame (3/4)\nhttps://t.co/arbc821dd8\n#sports #knicks #nyknicks #newyorkknicks #nba #knickshighlights #juliusrandle #tomthibodeau #rjbarrett https://t.co/100KFCGIcL",
    "343": "#Best of the day on https://t.co/MqmlMsmdvk\nRj Barrett : Knicks Postgame (3/4)\nhttps://t.co/HLP5q5btp3\n#sports #knicks #nyknicks #newyorkknicks #nba #knickshighlights #juliusrandle #tomthibodeau #rjbarrett",
    "344": "What's #Best on https://t.co/VfZu3jgOen ?\nRj Barrett : Knicks Postgame (3/4)\nhttps://t.co/ItFFPsfLR5\n#sports #knicks #nyknicks #newyorkknicks #nba #knickshighlights #juliusrandle #tomthibodeau #rjbarrett",
    "345": "@nyknicks  WE BACK! Play in tournament here we come!! Quik, RJ, Cam, Mitch, Julius! Jericho, Obi, and Duece the first off the bench. Shut down DRose and Grimes til we make the tournament. Omaha steaks and Burks can sit.",
    "346": "@NBA_NewYork That’s why fans wanted the Knicks to hired him for their head coaching job bcuz Jackson sees &amp; knows talent just like when he did it at Golden State.",
    "347": "Start Duece, Quick, RJ, Cam, Mitch every night. @nyknicks",
    "348": "NBA Consensus (So Far):\n\nPortland Trail Blazers 65%\nDallas Mavericks 64%\nGolden State Warriors 62%\nLos Angeles Lakers 60%\nHouston Rockets 58%\nPhiladelphia 76ers 53%\nAtlanta Hawks 52%\nNew York Knicks 51%",
    "349": "@duhitzzack_ @NBA @nyknicks The Knicks discredit themselves. They should easily be a top 8 team and they’ve yet to do it so 🤷🏻‍♂️",
    "350": "The MVP cashes the SGP ✅\n\nDoubling those odds tonight for @NYKnicks @SacramentoKings — Knicks are finishing up a long west coast trip and should be gassed. Plus no chance that disaster of a team wins on back-to-back nights.\n\n-@simondlehrer https://t.co/lgkNnJh4KE",
    "351": "McBride\nGrimes\nRJ\nZion\nMitch\n\nQuickley\nIvey\nReddish\nToppin\nSims\n\nDo what needs to be done @nyknicks https://t.co/8PoiTTfXZr",
    "352": "WAKE THE FUCK UP @nyknicks https://t.co/mJmbooEclz",
    "353": "@tommiedotjpg @nyknicks That's dope! Congrats!",
    "354": "@tommiedotjpg @nyknicks My man 👏🏽 🧱x 🧱",
    "355": "@nyknicks @RjBarrett6 Julius Thandle salutes yung Rowan.👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾✊🏾 https://t.co/HZH1ckkDpn",
    "356": "@KnicksMSGN @camreddish @nyknicks More cam please.  Play the youngens.",
    "357": "This New York Knicks Young Lineup DOMINATED the Clippers\n\nPLAY THE KIDS THIBS\n\nVIDEO: https://t.co/bnA9pRN8vZ https://t.co/cfGiMJNW2D",
    "358": "@tommiedotjpg @nyknicks R E S U L T S 💪🏽",
    "359": "👀👀#knickstape #knicks #newyork #newyorkknicks\nKnicks Twitter: the Best Accounts to Follow https://t.co/fB3wV0RxeF",
    "360": "@DavidDTSS @nyknicks MoMA I’m coming for you! https://t.co/HDapAC4O7F",
    "361": "@CantoDota Cuz the New York Knicks are like a Newport fix",
    "362": "@NBA_NewYork Love this kid. Face of the Knicks",
    "363": "@tommiedotjpg @nyknicks congrats Tommie!",
    "364": "@tommiedotjpg @nyknicks Congrats, G!",
    "365": "@KnicksMSGN @AshNicoleMoss @RjBarrett6 @nyknicks Everyday all day. Great or sucks Knick for life 🥃🥃🇹🇹",
    "366": "@tommiedotjpg @nyknicks LET'S GOOOOOO",
    "367": "New York Knicks All-Star Julius Randle has been fined $50,000 by the #NBA due to his ejection from Friday’s game against the Suns. \nhttps://t.co/I1RUkUkYCS",
    "368": "New York Knicks: Seven NBA Observations on the Knicks, Jarrett Allen’s Injury, and More https://t.co/Gorjrc78Hq",
    "369": "7W-4L! New York Knicks +4 over Sacramento Kings https://t.co/MPhXqy4VaS",
    "370": "@hhpthebook @nyknicks @IQ_GodSon Word, IQ has me eating crow today. IQ balled out last night, much props to IQ!",
    "371": "Tyronn Lue reacts to being called ‘gambler’ by Tom Thibodeau #LosAngelesClippers #NewYorkKnicks #TomThibodeau #TyronnLue https://t.co/lDOOrCW3zw",
    "372": "NBA:\nChicago Bulls +7.5\nAtlanta Hawks\nDallas Mavericks \nNew York Knicks +3.5 \n$4.17 for $32.98",
    "373": "@LaVinesBurner Knicks fans and execs in New York",
    "374": "@hhpthebook @nyknicks @IQ_GodSon Rat me out....IDGAF 🤣🤣🤣 you' be sliding out that Hive again. 🤭🤭",
    "375": "@MumuAFC23 @nyknicks @RjBarrett6 Nobody wants his contract. Randle would be on bench on a top 6 team",
    "376": "@DannyD15_ @nyknicks Definitely same style",
    "377": "@zsx_simon @nyknicks @MSGNetworks @BetMGM Don't mess with him https://t.co/uJl3Wx26gW",
    "378": "It was a good night indeed..! Being there in person, supporting our @nyknicks in @cryptocomarena... Loved to see our incredibly young team fighting till the end. Let the boys play their minutes..! #KeepFighting #NYK #NYKnicks #Knicks #KnicksvsClippers https://t.co/bfJKou2I2E",
    "379": "@duhitzzack_ @nyknicks @MSGNetworks @BetMGM Nothing is easily winnable have you not been watching the season",
    "380": "@nyknicks Dude probably has the most hops in the league more than Morant…Yup I said it!",
    "381": "📰 Sacramento Kings vs New York Knicks Odds and Betting Prediction 3-7-22!\n👉 https://t.co/ehJuF8JyHm @wagertalk",
    "382": "@nyknicks @RjBarrett6 Keys!!!",
    "383": "@nyknicks @RjBarrett6 Can any Knicks fans tell me what time the game on April 10th us gonna be? Final day of the season against Toronto",
    "384": "@nyknicks @RjBarrett6 Build around RJ and Cam",
    "385": "#News #Twitter Here’s What Twitter Is Saying About Cam Reddish’s Big Game: The New York Knicks beat the Los Angeles Clippers on Sunday night in California by a score of 116-93, and Cam Reddish had his best game since joining the Knicks. The former Duke… https://t.co/Tj3YywEFk7",
    "386": "@nyknicks @RjBarrett6 Can we please get this stud some help?????",
    "387": "@nyknicks @RjBarrett6 RJ when Julius checks out: https://t.co/XfBtqbvJ5I",
    "388": "@nyknicks @RjBarrett6 l e g e n d",
    "389": "@nyknicks @IQ_GodSon Quick !!!!!!!",
    "390": "@nyknicks @RjBarrett6 Release randle and build around RJ",
    "391": "@nyknicks @RjBarrett6 Trade him to a better team",
    "392": "@nyknicks @RjBarrett6 Poole better",
    "393": "@nyknicks @RjBarrett6 He owns LeMickey",
    "394": "5 consecutive 20+ point games for @RjBarrett6 📈 https://t.co/pNji4CJ5PR",
    "395": "@nyknicks If we can keep playing consistently better",
    "396": "@dan_moskow @nyknicks They play in Sacramento tonight https://t.co/zX5cw8I6Dl",
    "397": "@duhitzzack_ @Itstomjon @NBA @nyknicks Five games is most they win in a row all season",
    "398": "@taze2k @chef_mj @nyknicks @LAClippers Yes sir 👏🏾 🙌🏾 https://t.co/kvG5KQRP5D",
    "399": "@nyknicks @IQ_GodSon Him and Deuce coming off the bench together at the guard spots🔥",
    "400": "@alpotheosis @nyknicks @MSGNetworks @BetMGM Pels declaring bankruptcy after Zion spent 80 mil on chicken and sausage gumbo",
    "401": "Unfun Fact: the @nyknicks haven't won a game outside California since January 31st (a home game against the Kings).",
    "402": "@nyknicks @IQ_GodSon Stunt on the Kings tonight too IQ @IQ_GodSon https://t.co/gEEaxC3Ff9",
    "403": "@zsx_simon @nyknicks @MSGNetworks @BetMGM Watch your tongue. If not, you WILL lose to the New Orleans Pelicans. That would be unwise. https://t.co/MthFaRPLT8",
    "404": "@hhpthebook @nyknicks @IQ_GodSon hes best used a 2guard. he has flashes as a pg like last night but it aint his game in my opinion",
    "405": "@nyknicks Good morning my fellow KNICKS FANS",
    "406": "The Kings finally return home as they take on the New York Knicks tonight at 7:30. https://t.co/EYPpLE2n7o",
    "407": "@nyknicks @MSGNetworks @BetMGM What are you waiting for?Sign Robinson now before you lose him and hire a coach tha will expand his offensive game like Atkinson",
    "408": "@alpotheosis @nyknicks @MSGNetworks @BetMGM battle of the poverties 😍 https://t.co/7w10Me5V5x",
    "409": "@nyknicks @MSGNetworks @BetMGM Better see the Quick, McBride, Barrett, Reddish, Mitch lineup at some point tonight",
    "410": "10 Unique New York Knicks Fan Gifts https://t.co/O14weBpevV",
    "411": "New York Knicks haven’t won a title in almost a half-century and Bill Simmons is really out here asking questions like “was it worth it” regarding the Lakers going all in and WINNING THE TITLE. https://t.co/Qc2V8QHrYx",
    "412": "@hhpthebook @nyknicks @IQ_GodSon He’s gotta show consistency and find the open man if he is playing point guard if he doesn’t hold the ball and runs the offense properly I’m happy with quick",
    "413": "@dereck2x @nyknicks @IQ_GodSon Quickley is a NARCISSIST‼️ Stop supporting someone who treats people like 💩",
    "414": "@HoopsAnalyst @nyknicks @celtics Ouch!",
    "415": "@nyknicks @IQ_GodSon Why you all continue to promote this NARCISSIST is sickening and says ALOT about your organization‼️",
    "416": "@nyknicks @MSGNetworks @BetMGM @zsx_simon Winning streak continues tonight. We're coming for the crown.",
    "417": "@knickswintrack @nyknicks @MSGNetworks @BetMGM Lol always funny",
    "418": "@nyknicks @IQ_GodSon Still not a PG I'm starting to not like him he's a ball hog",
    "419": "@nyknicks 10:30pm is crazy lol",
    "420": "@nyknicks @MSGNetworks @BetMGM I feel like any wins just hurt us with our draft pick 🤣",
    "421": "@nyknicks @MSGNetworks @BetMGM Another 25 point Rj game tonight",
    "422": "@nyknicks @MSGNetworks @BetMGM More Cam minutes please and thank you  https://t.co/keJe4dajyw",
    "423": "What's #Best on https://t.co/DVTf2jd2ZR ?\nTom Thibodeau : Knicks Postgame (3/4)\nhttps://t.co/IGczVI7GRz\n#sports #knicks #nyknicks #newyorkknicks #nba #knickshighlights #juliusrandle #tomthibodeau #rjbarrett https://t.co/4dF3p2b7GX",
    "424": "#Best of the day on https://t.co/MqmlMsmdvk\nTom Thibodeau : Knicks Postgame (3/4)\nhttps://t.co/Twr7CP4cK7\n#sports #knicks #nyknicks #newyorkknicks #nba #knickshighlights #juliusrandle #tomthibodeau #rjbarrett",
    "425": "What's #Best on https://t.co/VfZu3jgOen ?\nTom Thibodeau : Knicks Postgame (3/4)\nhttps://t.co/Qcp1IQvZ3V\n#sports #knicks #nyknicks #newyorkknicks #nba #knickshighlights #juliusrandle #tomthibodeau #rjbarrett",
    "426": "@nyknicks @MSGNetworks @BetMGM The late season run starts now. We will barely miss the playoffs and ruin our lottery odds. They are winning tonight and all of a sudden tomorrow we will hear Rose will be coming back soon.",
    "427": "@nyknicks @MSGNetworks @BetMGM so i have to stay up late on a school night and watch the knicks lose ? aight",
    "428": "@nyknicks @MSGNetworks @BetMGM Easily winnable game don’t screw it up",
    "429": "@nyknicks @MSGNetworks @BetMGM Start IQ and Cam",
    "430": "@nyknicks @MSGNetworks @BetMGM Can we just do what we did yesterday",
    "431": "Knicks at Nite.\n\n🏀: vs. Kings\n🕥: 10:30 PM ET\n📺: @MSGNetworks | MSG GO\n@BetMGM | #NewYorkForever https://t.co/8WdKn36AUc",
    "432": "@AfterDarkMarcel @nyknicks @LAClippers @Mountaingal456 @KnicksSavage @KnicksNetwork @knicksfancam @skywalker42811 @forevershinin @nbamlb @JamieLK85 @jen_NY25 @AaliyahNevaeh7 @UbelCheryl @smonk318 @GoMets01 Thanks for the tag! Hoping everyone has a wonderful day!",
    "433": "@MattZeitlin ALD Book Club’s March choice - Blood in the Garden: The Flagrant History of the 1990s New York Knicks",
    "434": "@KnicksMSGN @RjBarrett6 @nyknicks I love him so much",
    "435": "What's #Best on https://t.co/DVTf2jd2ZR ?\nAlec Burks : Knicks Postgame (3/4)\nhttps://t.co/enAgNodB5I\n#sports #knicks #nyknicks #newyorkknicks #nba #knickshighlights #juliusrandle #tomthibodeau #rjbarrett https://t.co/4bm6gvtUoG",
    "436": "#Best of the day on https://t.co/MqmlMsmdvk\nAlec Burks : Knicks Postgame (3/4)\nhttps://t.co/IIJoNK1AAd\n#sports #knicks #nyknicks #newyorkknicks #nba #knickshighlights #juliusrandle #tomthibodeau #rjbarrett",
    "437": "@Shortz2186 @nyknicks @IQ_GodSon Funny.",
    "438": "What's #Best on https://t.co/VfZu3jgOen ?\nAlec Burks : Knicks Postgame (3/4)\nhttps://t.co/vbKFllY7Ed\n#sports #knicks #nyknicks #newyorkknicks #nba #knickshighlights #juliusrandle #tomthibodeau #rjbarrett",
    "439": "🏀NBA🏀 #NBA \n🏀Saison régulière🏀\n\nCleveland Cavaliers - Toronto Raptors\nWashington Wizards 133-123 Indiana Pacers\nHouston Rockets 123-112 Memphis Grizzlies\nOklahoma City Thunder 103-116 Utah Jazz\nLos Angeles Clippers 93-116 New York Knicks\nDenver Nuggets 138-130 New Orleans",
    "440": "@bk_yank86 @nyknicks @IQ_GodSon I like him, and as for his shot,  he's a shooter. We loved them when they go in. I was more encouraged last light by how easily he got into the paint.",
    "441": "@hhpthebook @nyknicks @IQ_GodSon It takes a High IQ ! \nTo realize one's mistake",
    "442": "NBA Rumors: Julius Randle &amp; Kemba Walker To Sacramento, Harrison Barnes To New York In Proposed Kings-Knicks Deal https://t.co/cQfyw9eHVz",
    "443": "@GeoffJMags We're New York's NHL team, we don't answer to the Knicks little brother. Maybe you should get the Knicks permission to wear these. https://t.co/BjKaqI5js1",
    "444": "Revenge Game: Justin Holiday plays New York tonight.  He played 82 games in his career for the Knicks.",
    "445": "Revenge Game: Emmanuel Mudiay plays New York tonight.  He played 81 games in his career for the Knicks.",
    "446": "@nyknicks @IQ_GodSon l e g e n d",
    "447": "New York Knicks Forward Julius Randle Fined $50,000\nhttps://t.co/9A7BN0rCQh",
    "448": "Bro the New York Knicks really dominated the LA Clippers",
    "449": "Very good game last night, Mr. @camreddish go @nyknicks",
    "450": "@lifestylelocks @chef_mj @nyknicks @LAClippers My guys! Another day for you two. Straight ballers",
    "451": "New York Knicks Forward Julius Randle Fined $50,000 https://t.co/L9DY5QPP9V #TUT",
    "452": "@Jukebox3331 @nyknicks You are so unreal 💀",
    "453": "@trashcanbang @nyknicks Then you never paid attention to knicks twitter for 2 straight months, i dont expect much from a bulls fan anyways, keep it up",
    "454": "@Jukebox3331 @nyknicks You have a new best player every day calm down",
    "455": "Play the kids, Thibs! @nyknicks https://t.co/bOYXrF6boM",
    "456": "@trashcanbang @nyknicks “Is ThIs Ur BeSt Player-“ Shut up this is https://t.co/mgO0jsnCzr",
    "457": "@nyknicks Coincidence that Knicks and rockets end there worst losing streak on the same day?? I think so!! We’re officially the 2nd worst team in nba and I’m proud",
    "458": "New post (New York Knicks vs Sacramento Kings NBA Pick – March 7) has been published on The Sports Geek - https://t.co/dYBKYCGJWj https://t.co/QN6hbbNuoW",
    "459": "KEEP FIGHTING. https://t.co/uS1nzxAfId",
    "460": "@hhpthebook @nyknicks @IQ_GodSon My only issue with Quick is his shot selection at times. He goes into hero mode and wants to shoot a 28 footer in transition… usually it’s at a critical point and kills all the momentum for us when he misses it…lol",
    "461": "@FNRTJohnson23 @ForeignAffairzz @JCrossover wild take but jr smith was THAT GUY and if he had at least HALF of kobe's work ethic he could've been that 2nd or 3rd player that denver AND new york knicks team to go all the way 🤷🏽‍♂️ most of the time he just got in his own way",
    "462": "Again with these @nyknicks 😂💀 https://t.co/cCoqBGoaXz",
    "463": "The NBA has fined New York Knicks forward Julius Randle $50,000 for shoving a referee and Phoenix Suns forward Cam Johnson. https://t.co/dwInTdhfRH",
    "464": "@nyknicks @IQ_GodSon Why can't this be done every night!",
    "465": "@nyknicks @IQ_GodSon Play our young players pls",
    "466": "@nyknicks @topfanscorner Number 6 NBA Basketball team is called @LAClippers have 34 wins &amp; 32 losses &amp; other NBA Basketball team is called @nyknicks have 26 wins &amp; 38 losses &amp; final score yesterday is the New York Knicks had 116 points &amp; the Clippers had 93 points &amp; lost yesterday!!!! NOOOOOOOOOOOO!!!! https://t.co/m7Ok6EunQU",
    "467": "@livelikelefty @robinlundberg It's not insane at all big bro. If your a @nyknicks fan, then we don't care about another team. We Don't Care At All if another team wins a title. It's @nyknicks or bust!!!",
    "468": "@knickswintrack @nyknicks @IQ_GodSon @RjBarrett6 Exactly. I'd rather lose and see the Youth grow.  Or kick the Clippers ass like last night.  They are 5.5 out a play in spot.  Who knows.  If they get hot.  Shades of 99.  Or we tank it for a better draft spot.  lol.",
    "469": "@Twonbdepressed @nyknicks Lmaooo just worry about a fully healthy Nets team, the bucks, the heat and even Chicago. Bc they all will handle y’all in a playoff series. Philly not winning anything",
    "470": "@nyknicks Go get 'em!!",
    "471": "Him talking bout he’s @nyknicks being sorry 😂😂 https://t.co/oLcIhS2ldz",
    "472": "@hhpthebook @nyknicks @IQ_GodSon Lmaoo yall see ya mans? 🤣🤣🤣🤣",
    "473": "New York Knicks: Irving 'grateful' NYC mayor 'on my side' in vax situation https://t.co/I3PLwvhAPU",
    "474": "After last night's victory by @nyknicks I'd like to see Thibs play the kids more for the rest of the season. Start Quickley. Give McBride, Sims &amp; Reddish more minutes. But most of all trade or cut Randall in the off-season.",
    "475": "What is the New York Knicks doing for you sir? https://t.co/4AI5hSTMSQ",
    "476": "NBA Rumors: Julius Randle &amp; Kemba Walker To Sacramento, Harrison Barnes To New York In Proposed Kings-Knicks Deal\nhttps://t.co/gTwEWRsP1w",
    "477": "Things from @nyknicks win last night..what If @IQ_GodSon can be the PG? And @camreddish ability to score was key in holding off @LAClippers postgame last night with @alanhahn @wallyball @KnicksMSGN @MSGNetworks https://t.co/UhavQEIoGK",
    "478": "@KnicksMSGN @RjBarrett6 @nyknicks Do your thing 👌!",
    "479": "@77Blazers @nyknicks @celtics something about the Knicks, Drexler had a worse game against them in 94:\n\nhttps://t.co/EbIw4j6CJ9",
    "480": "@RAMEL927 @TheKnicksWall @KnicksFanTv @nyknicks @travbryanmusic @stephenasmith @KinG_Easy @NYPost_Berman @johnnyjohnjon83 @hhpthebook I wouldn’t start IQ. he’s too unpredictable. Deuce is the PG. Grimes replaces Fournier",
    "481": "@KinG_Easy @RAMEL927 @TheKnicksWall @KnicksFanTv @nyknicks @travbryanmusic @stephenasmith @NYPost_Berman @johnnyjohnjon83 Bench",
    "482": "@BROOKLYN80372 @nyknicks I'm sold...48 mill",
    "483": "@nyknicks @IQ_GodSon Quck",
    "484": "@knickswintrack @nyknicks Cam and RJ are the pieces the Knicks must build around.",
    "485": "@nyknicks @IQ_GodSon Why did Randle have to tell Thibs no, don't put me back in, in the 4th when the young guns was cooking, and up 20+ ?\n\nwhy is that even a fucking thought from a \"coach\" ?",
    "486": "@earview @nyknicks @IQ_GodSon True",
    "487": "@nyknicks I cant wait for the day Julius Randle is not longer a knick. That way i wont have to see any more pictures if him in this twitter handle. Julius Randle is an I player. Selfish. Calls out team for not playing defense, when he hasn't played a lick if defense all year.",
    "488": "@KinG_Easy @TheKnicksWall @KnicksFanTv @nyknicks @travbryanmusic @stephenasmith @NYPost_Berman @johnnyjohnjon83 @hhpthebook This is while Grimes is out but he's definitely part of the 10. I would lean towards sitting Burk but Duece would be the one who sits. But I'm placing Cam over Grimes. Right now, Cam is the better player, I believe",
    "489": "@nyknicks @IQ_GodSon ayyy lets go! coach let him play more than 17 mins!",
    "490": "@hhpthebook @nyknicks @IQ_GodSon Your funny",
    "491": "@nyknicks @camreddish He’s amazing hope we sign him to an decent extension",
    "492": "@RAMEL927 @TheKnicksWall @KnicksFanTv @nyknicks @stephenasmith @KinG_Easy @NYPost_Berman @johnnyjohnjon83 @hhpthebook Where my son Grimes at https://t.co/T58A0Vh3pW",
    "493": "Q U ⚡️ C K \n\n@IQ_GodSon brought the energy last night in LA. https://t.co/zUlMkt2bhh",
    "494": "I gotta stay up late again to watch the game. Y’all better win @nyknicks",
    "495": "#NBAPick for tonight's @nyknicks vs @SacramentoKings game. \n#FreePicks \nhttps://t.co/ECOzmV08fM https://t.co/yBvgRVFbem",
    "496": "\"W! Let's keep working. #NewYorkForever\"\n\n🏀🗽🔵🟠\nCredit by @nyknicks https://t.co/3FDBZtNRLT",
    "497": "@nyknicks Lets.... https://t.co/cYDzH77YfL",
    "498": "@olliejames_10 @nyknicks We felt sorry for you. You guys can barely make play offs. https://t.co/N3EUvcR9l1",
    "499": "Drexler scored a season-low 3 points in game vs @nyknicks two days prior to @celtics game. \n\n#RobertParish scored the 18K career point in game. \n\n#Blazers #RipcCity #thisdateBlazersHistory https://t.co/oDrd34uTkY",
    "500": "@RAMEL927 @TheKnicksWall @KnicksFanTv @nyknicks @travbryanmusic @stephenasmith @NYPost_Berman @johnnyjohnjon83 @hhpthebook Where would you put grimes",
    "501": "The New York Knicks finally snap their 7 game losing streak, with a win over the Los Angeles Clippers 116-93. #NYKvsLAC \n\nThe Knicks are currently five games out from the 10th seeded Atlanta Hawks! https://t.co/IwixiEqbjK",
    "502": "@nyknicks Just play the young guys idc if we win or lose",
    "503": "@TheKnicksWall @KnicksFanTv @nyknicks @travbryanmusic @stephenasmith @KinG_Easy @NYPost_Berman @johnnyjohnjon83 @hhpthebook My Starting 5 and Bench rotation, thoughts??? https://t.co/7I8i45xR67",
    "504": "Check out 2020 Immanuel Quickley Silver Prizm Honors Rookie New York Knicks#583 Pack Fresh  https://t.co/u88eSP5VZt via @eBay",
    "505": "Check out 2020 Immanuel Quickley Silver Prizm Honors Rookie New York Knicks#583 Pack Fresh  https://t.co/WVxrdlAlGM via @eBay",
    "506": "@nyknicks 0-4 incoming",
    "507": "@hhpthebook @nyknicks How much you paying Mitch? I am not sold.",
    "508": "Tell me you see this. This is acceptable?  @NBA_NewYork @nyknicks https://t.co/WQxCNdywwJ",
    "509": "@nyknicks Please don't go 0-4 or 1-3",
    "510": "@nyknicks Knicks suck so shit doesn’t matter at this point",
    "511": "@nyknicks Good win last night keep that same energy tonight in Sacramento.",
    "512": "@nyknicks I see 2-2",
    "513": "@nyknicks 10:00 is bad enough, and you have to make it 10:30",
    "514": "@nyknicks start Cam",
    "515": "@nyknicks That second picture Barrett like \"you know this my team right\"",
    "516": "@hhpthebook @nyknicks @IQ_GodSon No disrespect to anyone on our squad. Maybe Randle for being a head case. But even him - no one's really benefiting from Thibs's stubbornness/coaching. Last night is proof he's been wrong all season. Now let's see if \"resting\" Randle during the 4th pays off tonight.",
    "517": "🏀 𝗚𝗔𝗠𝗘𝗗𝗔𝗬 🏀\n\n🟠 NEW YORK KNICKS\n👑 SACRAMENTO KINGS\n📍 Golden 1 Center (Sacramento)\n📺 NBA League Pass\n\n#SacramentoProud https://t.co/ptXO9iX7pI",
    "518": "@whyangelinawhy New York Knicks are rather embarrassing, according to Mike Lupica, whose Pop was a member of the Greatest Generation in WW II",
    "519": "LIVE: PHOENIX SUNS vs NEW YORK KNICKS | SCOREBOARD | PLAY BY PLAY | BHORDZ TV https://t.co/siPLeEHnXF",
    "520": "@nyknicks the future ! Continue with this rotation https://t.co/mAym8IliOf",
    "521": "GM fam. It’s game day! Off to Sacramento to watch @SacramentoKings take on the @nyknicks. Hope everyone has a great start to the week! #SacramentoProud",
    "522": "@hhpthebook @nyknicks @IQ_GodSon Haha you’re funny",
    "523": "Consensus Line Move:\n2022-03-07 New York Knicks at Sacramento Kings from 229.50 to 231.50\nOver fold em\n#NBA #soccer #statistics #forextrader",
    "524": "The NBA has fined New York Knicks forward Julius Randle $50,000 for shoving Phoenix Suns forward Cam Johnson and other events in Friday night's game. https://t.co/m07qbNlHed",
    "525": "@nyknicks @camreddish That’s a righty player going left…. Y’all better keep him I swear",
    "526": "@Brandon99436042 @nyknicks I’d rather lose than win atp. We ain’t making the playoffs",
    "527": "Seriously, I want back in the Quickley-Hive.  Some of these disgruntled @nyknicks fans, tricked me into believing that Quick wasn't the man, I won't name names, you know who you are. I renounce my disrespect for @IQ_GodSon and if I have to rat them out to get back in 🧀🧀🧀🧀",
    "528": "@nyknicks GOOD FUCKING MORNING",
    "529": "@nyknicks 👀 you in Dallas on Wednesday!!!\n\nHopefully I can get on the Twitter feed!",
    "530": "@Eliiscool4 @nyknicks Better then losing",
    "531": "Great stuff from former Knicks scribe @MikeVorkunov. 36-year-old Brock Aller reps New York on this list. https://t.co/xSlV0gzEkQ",
    "532": "@nyknicks Finally the young guys got more playing time",
    "533": "New York Knicks vs  Sacramento Kings Prediction 3/7/22 - Free NBA Picks https://t.co/rI1p0mB3iN via @YouTube",
    "534": "@nyknicks Rj cam deuce sims/Mitch and quick are them",
    "535": "@nyknicks Stop it lil bro it was one win",
    "536": "@nyknicks Trade Randle",
    "537": "@nyknicks TO THE YOUNGINS THAT HAVE BEEN BALLIN",
    "538": "@nyknicks Start Quickley he’s better than burks",
    "539": "GOOD MORNING! https://t.co/xKTKNGCwt5",
    "540": "I just want to thank the @nyknicks for over paying fournier saved me a headache appreciate yall.",
    "541": "The New York Knicks and Sacramento Kings face off tonight with tip-off coming at 10:30pm EST\n\nRJ Barrett vs De'Aaron Fox should be a fun watch! Who comes out with the victory? New #NBA preview for @TWSN___ 🏀\n\n#NewYorkForever #SacramentoProud\n\nhttps://t.co/c2fzo5Noc0",
    "542": "Your Daily NBA Tip is Here!\nHarrison Barnes - Over 15.5 against the New York Knicks #nbabets #nbabetting https://t.co/mm6ONHkZ9p",
    "543": "@kcekjm @ShanghajSharks @statmuse @nyknicks @NY_KnicksPR @J30_RANDLE @KembaWalker @RjBarrett6 Lmfao",
    "544": "Awful season, but future ain’t so bad for the squad. Develop the young guys, have premium draft capital, and money. Need to embrace the young movement and get after it @nyknicks https://t.co/7uxFZ6D8e5",
    "545": "Hola this message is for send regards for my favorite NBA Player Mr Patrick Ewing and New York Knicks Team from your special fanatic Edwin Suarez Suarez https://t.co/fzSHalHN1A",
    "546": "Sacramento Kings - New York Knicks İddaa Tahmini 08.03.22\nhttps://t.co/fqS8KHKESr",
    "547": "\"fuck all the glamours and glits, I plan to get rich, I'm from new york and never was a fan of the Knicks\" https://t.co/3K5j2oJktR",
    "548": "Check out New York Knicks youth shirt #Fisll #NewYorkKnicks https://t.co/3h1udCqna7 via @eBay",
    "549": "@BmonBets @LAClippers just didn’t have it last night, now we’re not sure if they cooled off or @nyknicks are back, both inconsistent asl, but #Knicks +3 against @SacramentoKings , got to think they can cover that too https://t.co/drQVCI4Ske",
    "550": "@statmuse @nyknicks @NY_KnicksPR @J30_RANDLE @KembaWalker @RjBarrett6 LMFAOOOOOO",
    "551": "@nyknicks Hahaha FOH https://t.co/tbvbv5vgPV",
    "552": "@nyknicks let me find out y’all finally giving cam reddish his opportunity might as well make him a starter",
    "553": "@nyknicks Ok im up to 13m for Mitch from 12. Keep it going. Get paid more 😂",
    "554": "\"With the tenth pick in the NBA draft the new york knicks select. TyTy Washington\"",
    "555": "@nyknicks @RyArch15 knicks legend iced it 🔥",
    "556": "@H_thereal1 @nyknicks To much common sense 😅",
    "557": "@nyknicks The energy and defense McBride brings is just as valuable even if he only scored 8ppg. He defense equates to winning.",
    "558": "@nyknicks Sims  looks good. If only he could create his own offense some.",
    "559": "@nyknicks Look what happens when we give the young players good minutes 🤔🤔🤔",
    "560": "It feels GOOD when the @nyknicks win!!",
    "561": "NO REGRETS. 💪\n\nFollow the wise words of @nyknicks @RjBarrett6 and never not do enough to reach you goals. 🙌 #MondayMotivation #JrNBA https://t.co/32RFesnWG6",
    "562": "@lElijahsDad @dan_ny_b You’d think you were a number 1 option if 80% of the offense ran through you https://t.co/xThrKlOrPj stop making this a Julius problem,THE @nyknicks have a problem,collectively.From Leon to Thibs.The fact there’s no real PG puts the onus on Julius via Thibs,who’s fault is that?🤔",
    "563": "For the record we like Alec Burks, just not as the point God @nyknicks",
    "564": "@Knicks_Mafia @KnicksMSGN @RjBarrett6 @camreddish Those were reports were wild BS even by new york trash media standards.",
    "565": "Mitchell Robinson | Knicks Postgame (3/6) #NewYork #Knicks #NBA Video: https://t.co/LLtT2gig83",
    "566": "@NBA @nyknicks The knicks actually held the lead omg!!",
    "567": "@DynastyFrank @nyknicks @WFANmornings Worst morning sports talk show ever in NYC",
    "568": "Will it be a bad deal to swap Randle &amp; Zion? @PelicansNBA deserves a player who wants to play &amp; win, everyone does &amp; they'll be legit. While the @nyknicks who's loosing anyways will have DUKE reunion &amp; will be fun &amp; interesting. That be a DEAL for me. @NBA @NBA_Philippines",
    "569": "@nyknicks @camreddish Cam looking like Julius Irving",
    "570": "New York Knicks Player of the Week: February 25th-March 3rd – NBA News https://t.co/Q2hQhRepTU",
    "571": "@nyknicks win 11 more and get to .500",
    "572": "@tashawnbeckham1 @NBA @nyknicks You know they show out because it Lakers all NBA teams do this and then lose fee days later",
    "573": "3 things for my beloved @nyknicks : \n1) Make sure you lock down @23savage____ &amp; give him his 💰\n2) Play the kids, future success is with a youth movement 👶🏾\n3) @RjBarrett6 wears the 👑for this team. He is your leader.\n#NewYorkForever",
    "574": "Why is anyone still talking about the @nyknicks ?? @WFANmornings enough already.",
    "575": "Analyzing Monday’s New York Knicks at Sacramento Kings odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/CCvf8slti1",
    "576": "good Monday morning my friends; warm rainy day in the Hudson Valley. back to seasonal rest of the wk. enjoy work/play. Putins' forces continue to annihilate civilians. Shameless autocrat. Knicks actually win while Nets lose again. No MLB progress. Rangers win. Namaste New York. https://t.co/VdYVpG3k5y",
    "577": "New York Knicks at Sacramento Kings odds, picks and prediction https://t.co/2nlftXakh8",
    "578": "The New York Knicks play basketball tonight. Rejoice accordingly 😅",
    "579": "@mikeygrogins_ @nyknicks Twitter https://t.co/ICRYW1dEep",
    "580": "@Vindicatum2 @NBA @nyknicks He has a tendency to take terrible shots. I mean not really any different than Randle, but what do you expect from Thibs",
    "581": "LEADER OF THE @nyknicks ! That’s right @RjBarrett6 lead these boys by example. It’s your team. https://t.co/Wa1oaTlAR9",
    "582": "@BenRitholtzNBA Cam Reddish at 6’8 with solid 3 AND-D capability.\nGreat trade that will impact the New York Knicks in a positive way for the next 5 years, you know they are keeping Reddish.",
    "583": "Sixers vs. Knicks game preview: How to watch, TV channel, start time https://t.co/99Vy4SOhRw via @sixerswireQuickley was the key.If New York is looking for a point guard, Immanuel Quickley, number 5 is on your bench!SELL THE TEAM BY DENNIS REED ON AMAZON, BARNES AND NOBLE \n$11.99",
    "584": "A rare @nyknicks win",
    "585": "This is what we as @nyknicks fans have wanted &amp; it’s why NYK won the game instead of losing another big lead. If we see this tonight against the Kings, it’ll likely lead to #Knicks’ first back-to-back wins since 3 in a row on Jan. 15. https://t.co/iU6cHexEvs",
    "586": "@LaVinesBurner because Knicks are the biggest market team in the NBA they are getting most tv time. More population in New York than most teams. The NBA viewership is lower than usual and they are trying to get as many people to see the NBA as possible. My Heat don’t even get recognition on tv.",
    "587": ".@channingfrye is one of my favorite @nyknicks and was great to hear him on the @InvestVint podcast https://t.co/IwibbVLDVf",
    "588": "@JoysNotHot @nyknicks Im Posting this Everytime The Knicks Get a Win Now. Plus you get a Follow so I can @ you everytime. Prepare to be annoyed for the Next Ten Years.",
    "589": "@KnicksMSGN @RjBarrett6 @nyknicks bully",
    "590": "@nyknicks ABOUT FUCKIN TIMEEE",
    "591": "Play the Youth!!!! @nyknicks",
    "592": "@ZenteyHOF @Twonbdepressed @nyknicks Sure he did keep telling your self that! https://t.co/PIGPr8Sdem",
    "593": "@KnicksMSGN @camreddish @nyknicks Thibs NY coming for ya ass if you don’t keep playing these rookies",
    "594": "Obi Toppin took two Knicks fans affected by the Jan. 9 Bronx, NY fire on a shopping spree. \n\nThe fire, which impacted their living situation, engulfed an entire New York City apartment building &amp; killed 19 people.\n\nRespect to Obi! 👏🙏 https://t.co/GRdrxQGiv6",
    "595": "@nyknicks @RyArch15 See what happens when you bench Randle in the 4th quarter? They WIN!",
    "596": "The @nyknicks are gonna be playing a back-to-back game in Sacramento late tonight right??? Well, I only got 5 words.\n\nLET THE YOUNG KIDS PLAY!!🔷🔶🔷🔶\n#NewYorkForever",
    "597": "@KnicksBear @Twonbdepressed @nyknicks He had a great amount of talent around him over the years🤦🏾‍♂️. Fym “wasted”",
    "598": "@nyknicks Pay Mitch!!!!!",
    "599": "Hot Take 🧐\nI believe that the New York Knicks will trade Julius Randle for Zion Williamson from the New Orleans Pelicans 😨 \n\nWhat do y'all think 💬🤔",
    "600": "The New York Knicks decided to play Cam Reddish last night, and he had 17 points, 57% shooting and was a +22... \n\nThe Knicks WON and snapped a 7-game losing streak Hmmmmm🧐",
    "601": "GOOD MORNIN' GET UP‼️💯 (@nyknicks) #MondayMotivation https://t.co/dua19193nD",
    "602": "The @nyknicks have:\n\nBarrett \nQuickley\nToppin\nMcBride\nReddish\nGrimes\nSims\n\nAnd outside of Barrett, barely let them play. @WorldWideWob",
    "603": "@NegroNinja4 @nyknicks You won't be laughing in a few weeks. Winning streak starts NOW.",
    "604": "The New York Knicks will play their their third game in four nights when they face the Kings on the second night of a back-to-back.  https://t.co/QBChYxXdSI",
    "605": "@nyknicks reddish and McBride need to play 25 plus min a game every night!! Like last night at we got the W",
    "606": "@nyknicks Cam started to get cookin at Phoenix and Thibs sat him for Fournier who did nothing in the remaining minutes.",
    "607": "The New York Knicks will play their their third game in four nights when they face the Kings on the second night of a back-to-back. https://t.co/FGeD4g558a",
    "608": "The New York Knicks will play their their third game in four nights when they face the Kings on the second night of a back-to-back. https://t.co/gtU9iWEAtK",
    "609": "@nyknicks Gameday! Let's Go!\n\n#NewYorkForever #Knicks #KnicksTape #NBA #NBA75 #NBATwitter",
    "610": "@nyknicks play the kids..",
    "611": "@NBA @nyknicks Why y’all postin rj had 24 bro avg 20",
    "612": "Wow I woke up this morning and I couldn't believe my eyes that the New York Knicks finally know how to finish a basketball game ,by winning a basketball game 🤣🤣🤣🤣 I'm very impressed that my @nyknicks didn't choke at all against a good team 👍🏾",
    "613": "@Itstomjon @NBA @nyknicks Stop hating. The clips just went on a 5 game win streak. Anything to discredit the Knicks",
    "614": "@nyknicks ..START/theROOKS..#NewYorkForever☑️ https://t.co/nDyoCCpsjJ",
    "615": "Denver Nuggets 138 (Nikola Jokic 46 pts, 12 rebs, 11 asists) New Orleans Pelicans 123 (Brandon Ingram 38 pts, Jonas Valanciunas 19 pts, 14 rebs), Los Angeles Clippers 93 (Amir Coffey 16 pts) New York Knicks 116 (Immanuel Quickley 21 pts, 10 rebs)",
    "616": "https://t.co/Dm9xmaoAAV\n\nSELL THE TEAM recreates the Championship years of 1970 and 1973 for the New York KNICKS.  Earl \"the Pearl\" Monroe and the rest of the crew kept the lights on in the old Garden of Eden of 50th Street\n\n$11.99\n\nTWO WEEKS ON AMAZON NEW AND NOTEWORTHY TOP 100!",
    "617": "NBA Basketball Game Betting Picks Simulator: 10:40 PM ET - New York Knicks vs. Sacramento Kings - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/4Y42kU00O0 #nba #sportsbetting #freepicks #cappertek",
    "618": "@NBA_NewYork @TheAthletic This is why I cancelled my subscription. \nThey are just trying to get more clicks by pissing off Knicks fans.",
    "619": "@nyknicks Wow! Finally lol",
    "620": "@KayCSmooth @NBA @IQ_GodSon @nyknicks Now I see why NFL teams prefer to hire young coaches. I mean I don't get it, this man just wants to play a bunch of old dudes instead of teaching the young ones.",
    "621": "@YavoShmurda @NBA @nyknicks Just like that huh? Just walk up to the front door ask him if he wants to come here and Detroit will just let him walk. Genius.",
    "622": "@NBA @nyknicks Why tf is Quickley not getting 35 minutes a night?",
    "623": "The New York Knicks play basketball tonight 🔥 Let’s get another WIN https://t.co/vx2zyIvOM1",
    "624": "@MOOKieBETTSALOT @nyknicks That last line made me snort laugh",
    "625": "@NBA @nyknicks If the Knicks was smart they’d get Marvin Bagley out of Detroit",
    "626": "Yesterday in the NBA\n\nThe @nyknicks held the @LAClippers to 93 points.\n\nThis was the first time they held an opponent under 100 in 13 games.\n\nThey held opponents under 100 in 11 of 20 before this stretch.",
    "627": "@nyknicks @IQ_GodSon @RjBarrett6 😂 feels like it’s been ages 🤦‍♂️",
    "628": "Congratulations to DrewsVentures (@DrewAustin) who moved up 20 spots to take #12 on the New York Knicks team leaderboard.\n\nhttps://t.co/KTWpkR4EiB",
    "629": "@nyknicks 🗣 LFG COACH THIBS LETTING THEM YOUNG BOYS OUTSIDE ❕",
    "630": "@nyknicks BRO W LETS GOOO BRUHHHH IM HAPPY FOR THE WHOLE KNICKS TEAM CAM ND RJ SHOWED OUT",
    "631": "source @nyknicks https://t.co/gyStqSam53",
    "632": "@nyknicks it’s time to trade Randle and let the kids play",
    "633": "@nyknicks @DanielJonesMVP Knicks tn\nRj Barrett 24 &amp; 10 \nImmanuel Quickley 21 10 &amp; 6\nCam Reddish 17 2 &amp; 2\nNew big 3??",
    "634": "Look at that, the @nyknicks wore their #BLUE uniforms and they actually WON A GAME #getridoftheblackunis",
    "635": "New York Knicks (26-38, 12th in the Eastern Conference) vs. Sacramento Kings (24-42, 13th in the Western Conference) https://t.co/33jbSyxXQX",
    "636": "On a lighter note, the @nyknicks grabbed that W last night!\n#NewYorkForever",
    "637": "@knickswintrack @nyknicks Both should be starting together. Bring Evan Fournier off the bench.. U can see they have good chemistry playing together",
    "638": "@ShanghajSharks @nyknicks A win is a win it doesn’t matter who you play as long as you win since when you have to beat the Starters whoever steps on the court they’re there because they’re professionals and they made the team they getting paid to play. So what’s the issue. By the way do you  played Ball",
    "639": "@nyknicks @IQ_GodSon @RjBarrett6 They're getting close.  So close.",
    "640": "New York Knicks vs LA Clippers Full Game Highlights | March 6 | 2022 NBA... https://t.co/wtXCaICY3e @YouTube",
    "641": "Goooood Morning!!!\n\nLove waking up to Winners!!\n\nNew York Knicks +180 (1 Unit)✅\nApp State Mountaineers ML -130 2H (1 Unit)✅ https://t.co/E4OoXL1R0Q",
    "642": "@nyknicks @zsx_simon LA IS FREE",
    "643": "@NBA @nyknicks Let's go Knicks!!",
    "644": "@MikeA38910983 @nyknicks Nobody is on hit seat yet. But I'd like to hear from aforementioned front office a bit more.",
    "645": "@NBA @nyknicks Damn finally",
    "646": "New York Knicks vs Los Angeles Clippers - Full Game Highlights | March 6... https://t.co/zfJbTraj5E @YouTube",
    "647": "New York Knicks: Jayson Tatum drops 56 for Celtics over Nets; Nikola Jokic has 46-point triple-double in\u0085 https://t.co/ysLxyUmB0Z",
    "648": "🏀NBA🏀 #NBA \n🏀Saison régulière🏀\n\nCleveland Cavaliers - Toronto Raptors\nWashington Wizards - Indiana Pacers\nHouston Rockets- Memphis Grizzlies\nOklahoma City Thunder - Utah Jazz\nLos Angeles Clippers - New York Knicks\nDenver Nuggets - New Orleans Pelicans",
    "649": "@TylerSiebert2 @dgreder22 @nyknicks @camreddish Agree",
    "650": "@OneMotolani Exactly, you need to see the way other panelist laugh hard at Stephen A whenever he starts ranting about the New York Knicks. Football is so boring.",
    "651": "@nyknicks @espn @MSGNetworks @BetMGM Told ya boys",
    "652": "@nyknicks lose a heartbreaker to the best team in the league on the road, then blowout the CLips the next day. I am not smart enough to understand this team.",
    "653": "@NBA @IQ_GodSon @nyknicks Thibs is trapped in 2002",
    "654": "@NYYprincess33 @jrockNY820 @NYRangers @nyknicks They would have been a bball dynasty...except...Michael Jordan. Ewing was the 2nd best player in the league, but he was 2nd best. I wish Bernard King played on those teams",
    "655": "@NYYprincess33 @NYRangers @nyknicks Long suffering #NYR fan - why do you say this?",
    "656": "#Knicks starters rest of season:\nMitchell Robinson,JR Barrett,Cam Reddish,Immanuel Quickley&amp;Miles McBride,w/Jericho Sims(C)&amp;Obi Toppin(PF)first off bench.\nMUST!At 26-38,ZERO downside.\nOnly experience for core young guys salvages season!\n#NewYorkForever #KnicksTape #newyorkknicks https://t.co/H3CgkpA8WC",
    "657": "@nyknicks Let them young guys play some more they did good especially sims and Mitchell Robinson looking healthy and good we need to keep him if he’s a FA this summer dude gotten way better and way stronger",
    "658": "@NYYprincess33 @NYRangers @nyknicks Could be worse. You could be a Utah Jazz fan, or a Minnesota Vikings fan. Close but never got there.",
    "659": "The @nyknicks didn't blow a 20pt lead for the 1st time in 4 tries, and @EvanFourmizz didn't see the floor for almost the entire 4th quarter, after giving up 24 4Q pts to Cam Johnson last game. Is it a coincidence? I think not. Fournier needs to be shut down just like Kemba was.",
    "660": "@nyknicks Knicks really do run LA",
    "661": "@nyknicks @IQ_GodSon @RjBarrett6 Holy shit they didn’t blow a lead for once.",
    "662": "▶ L.A. Clippers (34-32) 93:116 New York Knicks \n🧮 Isaiah Hartenstein: 20:34 Minuten, 14 Punkte, 4 Assists. \n\nhttps://t.co/ZcjfsgRc8b",
    "663": "We Lost!!! .. It Happens!!! as the @LAClippers Lose to the @NyKnicks 93-116!!! #LETSGO #FANTRUTH #CLIPPERDARRELLCARES #FROMAFANSPOINTOFVIEW https://t.co/fbs0RzFBhp",
    "664": "@BCusterTV @nyknicks Love this! Better up your wardrobe standing next to Clyde😉",
    "665": "Hoy a las 04:30 h. Sacramento Kings vs New York Knicks.",
    "666": "🔶🔷GAME RECAP🔶🔷\n\n&gt;&gt;&gt; 64/82 &lt;&lt;&lt;\n\n… endlich …\n\nNew York Knicks @ LA Clippers https://t.co/gaZWxtZmdq",
    "667": "@KnicksMSGN @camreddish @nyknicks Good Job Knicks!",
    "668": "@datboi_007 @KnicksMSGN @RjBarrett6 @nyknicks they tweeted this for me",
    "669": "Onde assistir Los Angeles Clippers x New York Knicks Basquete AO VIVO NBA 2022\n\n#futebolstats\n\nhttps://t.co/aYDjmKcF3W",
    "670": "man I really got to see a @NJDevils win and a @nyknicks win in the same day…. Damn good day https://t.co/7P9FDTGgOX",
    "671": "This is why Knick fans have been pushing for IQ over Burks&amp;Cam playing more significant minutes than Evan and Burks. The youth if Thibs played them from after the AllStar break god knows where we’d be now probably would’ve won way more games! #firethobs @NY_KnicksPR @nyknicks https://t.co/SXDiKDFenS",
    "672": "@DamnFlair @nyknicks And Randle is off the floor! The ball moves much more freely when’s on the bench everyone gets involved!",
    "673": "New York Knicks vs LA Clippers Full Game Highlights | March 6 | 2022 NBA Season #NewYork #Knicks #NBA Video: https://t.co/evpcRVUSm2",
    "674": "New York Knicks vs LA Clippers Full Game Highlights | March 6 | 2022 NBA Season #LosAngeles #Clippers #NBA Video: https://t.co/WCDLJ28Nxj",
    "675": "@nyknicks I’m telling you. I. am. ready. Tell them all about me! I’m 6 foot one hundred and sixty five pounds let’s move",
    "676": "@NBA @nyknicks Immanuel Quickley",
    "677": "@NBA @nyknicks The Clippers Lost To The Knicks After Beating The Lakers A Few Days Ago😭😭😭😭",
    "678": "No one reads my tweets but no fucks given @IQ_GodSon @RjBarrett6 @camreddish @deucemcb11 @JerichoSims &amp; @23savage____ balled out tonight and were proof  we need to #playthekids @nyknicks @livelikelefty @NYPost_Berman @PrestonCucuzza",
    "679": "@JPronos23 New York Knicks 😍",
    "680": "New York Knicks with vexation finished Clippers. Lmaoo",
    "681": "@NBA_NewYork Knicks finally have their 25 ppg guy. REJOICE",
    "682": "@DaCreaTaur @nyknicks unfortunately, wrong Thibs...",
    "683": "@Twonbdepressed @nyknicks crazy how literally every fanbase is allowed to celebrate a win except the Knicks. You realise most of us want to tank anyway… right? But you’re a Philly fan so it makes sense",
    "684": "Final. Los Angeles Clippers 93-116 New York Knicks.",
    "685": "The New York Knicks pulled out of a seven-game tailspin while snapping the host Los Angeles Clippers’ five-game winning streak in a 116-93 rout on Sunday. https://t.co/ax30IxuGkf",
    "686": "The Clippers really got blown out by the New york Knicks?",
    "687": "@vincanario @nyknicks EXACTLY‼️ Quickley is a Narcissist 🤡 He is about himself.",
    "688": "@hopefulmetsfan @nyknicks Quickley is a NARCISSIST‼️ Stop promoting someone that treats people like 💩",
    "689": "Kith Wilson for New York Knicks Basketball Black Ball Size 7 (29.5\") Brand New https://t.co/gEmxH9fsks eBay https://t.co/nZsrOncCDk",
    "690": "@nyknicks STOP PROMOTING THIS NARCISSIST‼️ Y’all know better @nyknicks",
    "691": "@NBA @nyknicks Actually, after looking at the Western Conference standings. I guess they deserve to be between seven and 10th Considering the rest of the west is just 🤮",
    "692": "@NBA @nyknicks Nothing impressive about this at all. The clippers and the Knicks are both playing like complete scrubs. No one actually showed up for this game. And yet the clippers are still in 8th somehow??? #GamblingTwitter",
    "693": "The New York Knicks pulled out of a seven-game tailspin while snapping the host Los Angeles Clippers' five-game winning streak in a 116-93 rout on Sunday.\n\nhttps://t.co/4xb1oDJ3eV",
    "694": "@JasonWoodley33 @nyknicks @camreddish “I don’t like that shit, ima drop a dime on dem niggas”",
    "695": "@nyknicks we got a dub sack tonight. that’s love …",
    "696": "@BCusterTV @nyknicks I love hearing him on commentary. He has rhymes for days! 🤣 that's a gift.🏀",
    "697": "Man it was an honor to meet @nyknicks legend Walt Clyde Frazier! I’m always humbled when they’re excited to meet me as I am meeting them. #knicks #clippers #LA #legend https://t.co/b6OxDlRY6R",
    "698": "Terance Mann with a 2-pointer vs the New York Knicks\nhttps://t.co/CixhXkRr9N\nhttps://t.co/CixhXkRr9N",
    "699": "New York Knicks: Highlights: Knicks 116 | Clippers 93 https://t.co/7HMzd8TeVM",
    "700": "@FiNOxMAYC @ryansnuggs @BoredApeYC @LAClippers @nyknicks Damn we ducking up",
    "701": "New York Knicks defeated Los Angeles Clippers 116-93 https://t.co/2BbbxQ4IfJ",
    "702": "Ivica Zubac with a buzzer beater vs the New York Knicks\nhttps://t.co/HSMofJxhMp\nhttps://t.co/HSMofJxhMp",
    "703": "The LA Clippers put up a stinker Sunday night, falling 116-93 to the New York Knicks. @RalstonDacanay with the recap:\n\nhttps://t.co/t1kmqSLVPT",
    "704": "@nyknicks @IQ_GodSon @RjBarrett6 Finally",
    "705": "@SOULbeautifulme Today's the beautiful Day the Clippers lost to the New York Knicks 🤣🤣🤣😅 I can't stop lol that to sorry ass Clippers team https://t.co/ATT6u5pmWe",
    "706": "Ex @nyknicks all-star KP needs to be the focus, says ex-Knicks coach @IsiahThomas:\n\n“I think believe @kporzee is the main guy u should be 👀king for on offense &amp; I do think he’ll come thru.”\n\nKP scored 25 points &amp; 5 rebs in his debut @WashWizards.\n\n#DCAboveAll #NewYorkForever https://t.co/8V0yV02be3",
    "707": "I love New York sports. So much young talent for my @nyjets 🏈and @nyknicks 🏀🙏🔥finally my teams in the right direction. Rj Barrett is just so damn good. We’re gonna be contenders for the future. And mr Zach Wilson has turned me into a believer for real.❤️ #gonewyorkgonewyorkgo",
    "708": "@ryansnuggs @BoredApeYC @LAClippers @nyknicks @_inFidel_Castro  this why we gotta move to La",
    "709": "New nina open your chest up like Vick's Vapor\nBallin in New York they confusin me wit a Knicks player",
    "710": "It's crazy that Joel Embiid is joining Zion Williamson on the the New York Knicks #NewYorkForever",
    "711": "@NBA @nyknicks Cam reddish",
    "712": "New York Knicks vs Los Angeles Clippers Post Game Show: Highlights, Anal... https://t.co/Vd7mxt9tCJ via @YouTube #POSTGAMENYK",
    "713": "@nyknicks Feels great to get in the left column again regardless",
    "714": "Finally a W, for @nyknicks a third option is much needed.",
    "715": "@knickswintrack @nyknicks 💯 Facts",
    "716": "New York #Knicks: W! Let's keep ...\n \nhttps://t.co/A6epzMdYhe\n \n#Atlantic #AtlanticDivision #EasternConference #EasternConferenceAtlantic #EasternConferenceAtlanticDivision #NBAAtlantic #NBAAtlanticDivision #NBAEastern #NBAEasternConference #NBAEasternConferenceAtlantic https://t.co/Wr2zjrqraO",
    "717": "🌎 WORKD WIDE WES 🌍 \nHIJACKED the @nyknicks MSG account😂😂🤣🤣😭😭\n\nLet the kids PLAY! \n#FireThibs #Knicks #NYK  #NewYorkForever #NBA https://t.co/r2XyZSmXEU",
    "718": "@nyknicks good morning knicks baby",
    "719": "The young boys hooped AND we won?!?! What a night! #NewYorkForever #KnicksTape @nyknicks",
    "720": "Isaiah Hartenstein with a last basket of the period vs the New York Knicks\nhttps://t.co/aeFtQ1NSkA\nhttps://t.co/aeFtQ1NSkA",
    "721": "@nyknicks Happy Monday for sure",
    "722": "Ok I love the @nyknicks win, but I think I love @23savage____ at the 🎤 so much better. They were not ready for him 😂😂😂 https://t.co/P0aOOKzadL",
    "723": "Knicks 116, Clippers 93: Scenes from the kids finally breaking through\n(New York Knicks)\nhttps://t.co/avC4tgJ7nM",
    "724": "@nyknicks Humble pie",
    "725": "@nyknicks When your boy bags his crush. Lol 💪🏾",
    "726": "@nyknicks @camreddish Thibs watching https://t.co/1ht2u7Iddu",
    "727": "Kith Mitchell &amp; Ness for New York Knicks 10 Year Jersey Size Large Brand New DS https://t.co/dGMer3xt2X eBay",
    "728": "@nyknicks Getting better learning.   Let run",
    "729": "@nyknicks Start him please",
    "730": "Children × Children R the Future... @bigdaddykane\n\nRJ Barrett +36\nCam Reddish +22\nMiles McBride +27\nJericho Sims +15 \nIQ +15 \n\n@nyknicks",
    "731": "@nyknicks fucking finally.",
    "732": "@ryansnuggs @BoredApeYC @LAClippers @nyknicks That’s a dope move . Go NYK",
    "733": "@nyknicks See what happens when ya play the kids? 🤦",
    "734": "@nyknicks how many months has it been?",
    "735": "@nyknicks Finally can sleep happy. Gn y’all https://t.co/alndmi8UDp",
    "736": "@nyknicks Build around the youth. goodnight",
    "737": "@nyknicks Goodnight ?",
    "738": "@NBA @nyknicks Lmao the whole clippers roster could not score more than 16 points. What a rigged clippers team",
    "739": "Knicks buzz Clippers in wire-to-wire 116-93 rout #NewYork #Knicks #NBA https://t.co/rkuQdSAJcY",
    "740": "Goodnight, Knicks fans! https://t.co/Cexvf1RoT5",
    "741": "LOS ANGELES (AP) — RJ Barrett had 24 points and nine rebounds and the Knicks dominated the Los Angeles Clippers in a 116-93 victory Sunday night that snapped New York’s seven-game losing skid. https://t.co/DGrO6W3prS",
    "742": "@nyknicks thanks for nothing, just deleted @FDSportsbook because of you actually winning a fucking game yo by 20",
    "743": "@NBA @nyknicks Quickley is a NARCISSIST‼️ STOP promoting this 🤡 @nba",
    "744": "Luke Kennard with a 3-pointer vs the New York Knicks\nhttps://t.co/1gUmBcogpE\nhttps://t.co/1gUmBcogpE",
    "745": "Rowan Alexander \"RJ\" Barrett Jr. is a Canadian professional basketball player for the New York Knicks of the National Basketball Association (NBA).",
    "746": "Cold-shooting Clippers fall in 116-93 loss to New York Knicks https://t.co/G6mcfrhpl7",
    "747": "NBA\n\nFT.\n\nWashington Wizards 133 - 123 Indiana pacers\n\nHouston Rockets 123 - 112 Memphis Grizzlies\n\nOklahoma city Thunder 103 - 116 Utah Jazz\n\nCavs 104 - 96 Toronto Raptors\n\nDenver Nuggets 138 - 130 New Orleans pelicans\n\nLA Clippers 93 - 116 New York Knicks\n#TheGamePlan",
    "748": "@Twonbdepressed @nyknicks For anyone wondering the scared 76ers fan retweeted one of the comment cause he was scare of the heat he was going to get over here 🤣.",
    "749": "Immanuel Quickley and the @nyknicks grab the road win!\n\nRJ Barrett: 24 PTS, 9 REB\nCam Reddish: 17 PTS https://t.co/0Kc0fOmwwW",
    "750": "@nyknicks @IQ_GodSon @RjBarrett6 The fan base needed this",
    "751": "Dear @Lakers kindly call the @nyknicks coach to show y'all how to tame the @LAClippers what a blow out indeed!",
    "752": "@chef_mj you was right on the 208.5 \nI was right  on the -16 5 \n@nyknicks @LAClippers  \nGreat game  \n🤑🤑🤑🤑🏀🤙🏾 https://t.co/C1hgWYnQXe",
    "753": "@nyknicks @SociosUSA Bullshit.. the youngins got this win.. period.. it was heading for disaster again",
    "754": "@nyknicks @SociosUSA IQ/Deuce/Cam/RJ/Sims IS THE FUTURE",
    "755": "@nyknicks @SociosUSA Im excited for the future https://t.co/qKVHRY6M3D",
    "756": "What happened to the deadeye Clippers? Team doomed by missed shots vs. Knicks \n \n#NewYorkKnicks #LosAngelesClippers #Nba https://t.co/rZ6nopbHBc",
    "757": "Everybody who stepped in contributed and scored. Team W!\n\n🎥: @SociosUSA | #NewYorkForever https://t.co/EnoPk6OYm6",
    "758": "@nyknicks This is why you play the kids. Love to see it",
    "759": "@Twonbdepressed @nyknicks Also this game wasn’t on National tv today so you couldn’t have seen it in south jersey unless you bought the Knicks game pass and if you did that than I would question wether you’re a real 76ers fan.",
    "760": "@Twonbdepressed @nyknicks Lmao this kid really trying to convince people his team ain’t a super team lmao 🤣 listen kid if it makes you feel any better you’re not so (super) team will never win a championship don’t have nightmares over it.",
    "761": "@bardot_Barbie @nyknicks @IQ_GodSon @RjBarrett6 Quickley the Narcissist‼️ STOP promoting someone that treats people like 💩",
    "762": "New York Knicks vs Los Angeles Clippers - Full Game Highlights | March 6, 2022 | 2021-22 NBA Season\nhttps://t.co/DLYB9x4IRA\nhttps://t.co/DLYB9x4IRA",
    "763": "@jeff152390 @nyknicks @IQ_GodSon @RjBarrett6 EXACTLY‼️💯 Quickley is a Narcissist and ONLY thinks about himself 🤡",
    "764": "@anajuh_sz @nyknicks @IQ_GodSon @RjBarrett6 Quickley is a Narcissist. Don't promote this 🤡",
    "765": "@Twonbdepressed @nyknicks Embiid and harden alone is a super team but go off you’re super team ain’t never winning a title also 76ers account must be dead that you had to come on to a NY Knicks vs LA clippers post to talk shit.",
    "766": "@nyknicks Knicks actually won a game!!",
    "767": "@nyknicks Stop fucking up the tank",
    "768": "@nyknicks Feel bad for whoever got that shit 😭",
    "769": "Oh, also, shout out to the @nyknicks for running up the score in the fourth quarter. Jackasses",
    "770": "@MoisesAliceaJr @nyknicks @IQ_GodSon @RjBarrett6 @MarkJackson13 Thibs discovered he can play first and second year players. They've actually played basketball before joining the #Knicks . #PlayTheKidsThibs",
    "771": "@Twonbdepressed @KnicksBear @nyknicks First than Philly. Mark my words.",
    "772": "@nyknicks Yessir",
    "773": "@Twonbdepressed @nyknicks A super team who will never win a championship must suck to know you had a super team and couldn’t win a championship.",
    "774": "@nyknicks Nobody wants that shit 😭😭",
    "775": "@nyknicks Randle better be ready to carry tomorrow against Sacramento. He was MIA today",
    "776": "@nyknicks Knicks!!",
    "777": "@RuseCurry @nyknicks im a loyal dude i cant ever switch up on my teams yo",
    "778": "@nyknicks He didnt 🔥",
    "779": "@nyknicks Nobody wants a randle jersey",
    "780": "@Twonbdepressed @nyknicks Right cause the Knicks built a super team. We don’t need a super team to make the play offs y’all the other hand 🤣.",
    "781": "@ShanghajSharks @nyknicks The clippers had just won 5 in a row.. wtf you talking about?",
    "782": "@nyknicks Lightskin🤣🤣🤣🤣🤣",
    "783": "Knicks fans showed out in LA 💙 https://t.co/SGy4HQ6cov",
    "784": "Elite jinx. You’re welcome @nyknicks https://t.co/LmqsTNVCoV",
    "785": "@nyknicks FIRE THIBS",
    "786": "@KnicksMSGN @nyknicks @camreddish @IQ_GodSon IQ is a NARCISSIST‼️ STOP promoting someone you don’t even know, who treats people like 💩",
    "787": "@sny_knicks @nyknicks Impressive ..",
    "788": "Love this 🧡💙@nyknicks https://t.co/Zi8La9AHrV",
    "789": "🤖 #SofiAlert \n📅 06-03-2022 \nNew York Knicks - LA Clippers \n🛋 1.1/5 Sofis https://t.co/0Go2wPBGit",
    "790": "@nyknicks About time !",
    "791": "@ANT_NYK @ibrotherealone @nyknicks @IQ_GodSon @RjBarrett6 Don’t forget my guy https://t.co/t9SLhABdJp",
    "792": "@nyknicks @IQ_GodSon @RjBarrett6 A WIN Is always a Energy Boost for Fans and the Players. #NewYorkForever #Knicks #NBA",
    "793": "@Twonbdepressed @nyknicks Oh look a franchise who wasted Embiid career and will never win a championship with him.",
    "794": "New York Knicks: RJ Barrett, Knicks rout Clippers https://t.co/6DG8v4wS8j",
    "795": "@nyknicks Sims and cam played good as well as Robinson we gotta keep him and give him a deal if he’s a FA this summer he’s looking good and healthy him and RJ is the soul of the team and build around them",
    "796": "@nyknicks @RyArch15 YEEEAAAAH BABY! LET'S GOOOO!",
    "797": "@nyknicks STOP promoting this NARCISSIST‼️🤡",
    "798": "#Knicks please start Quick and Reddish in place of Fournier and Burks. I don’t want to see them anymore. @TheStrickland @NY_KnicksPR @nyknicks",
    "799": "@nyknicks @RyArch15 Let the #ArchSanity begin! Lol",
    "800": "@KingFitch_H19 @nyknicks @IQ_GodSon @RjBarrett6 Quickley the Narcissist‼️",
    "801": "Play the kids more @nyknicks",
    "802": "ALL MY #SQUADS GOT WZ THIS WEEKEND @NYKNICKS @NJDEVILS @CHELSEAFC @MSU_BASKETBALL 🌪",
    "803": "@nyknicks I don't know, I feel we might still blow this lead",
    "804": "@isobhog @nyknicks @IQ_GodSon @RjBarrett6 Quickley is a NARCISSIST‼️ Stop promoting someone you don’t EVEN know, who treats people Iike 💩",
    "805": "@nyknicks U still won't make the playoffs 😂😂",
    "806": "@nyknicks It’s so nice watching a win completely led by the young guys",
    "807": "Great win for my @nyknicks",
    "808": "@nyknicks The Knicks not blowing a 20 point lead😅😭 https://t.co/KyOcifQgtZ",
    "809": "The @nyknicks are back in the win column! A dominant victory over the Clippers 💪\n\n#NBA75 https://t.co/ZeK0UFsj6S",
    "810": "@nyknicks @RyArch15 This is a rec league game. Get everyone in the books with a lt least one point",
    "811": "@__ItsJayy__ @RJBarrettEra2 @nyknicks @IQ_GodSon @RjBarrett6 Philly sucks they need the refs to beat the Knicks",
    "812": "@nyknicks Randle's so irrelevant right now.",
    "813": "@nyknicks This team still blows and tomorrow we’ll get abused by the kings",
    "814": "@nyknicks Clippers = Buffalo Bills!\nKnicks = Dallas Cowboys!",
    "815": "@NBA @nyknicks IQ is a Narcissist‼️ STOP PROMOTING THIS 🤡",
    "816": "Update the Clippers lost to the crappy New York Knicks https://t.co/bU1HOIVAPC",
    "817": "@nyknicks Gimmeeeee threeeeeeeeed!!!!",
    "818": "@nyknicks Finally",
    "819": "@RJBarrettEra2 @nyknicks @IQ_GodSon @RjBarrett6 Fake run into the playin just tonget murdered by philly",
    "820": "@nyknicks Can we get everyone in the books tonight?? Duece duece dnt jam",
    "821": "@DarylTh95883545 @nyknicks @IQ_GodSon @RjBarrett6 AND THEY PLAYED THE KIDS WHO DONT PLAY DOWN TO THEIR COMPETITION. Cant say im surprised, they know how to want to win.",
    "822": "@KxngLenny_ @nyknicks U already know one of them is gone this offseason",
    "823": "@nycSportsfan718 @hhpthebook @jbryant3 @nyknicks @NY_KnicksPR Thibs gotta be licking his wounds for not playing the young kids all this time. He’s counting the losses he could’ve won. There’s nothing like young energy.",
    "824": "@nyknicks Quickly quick3",
    "825": "@H_thereal1 @nyknicks Not that hard....and Burks from the bench at 2.",
    "826": "@WashedTraruso @nyknicks We don't care because our youngins played well",
    "827": "never separate them @nyknicks https://t.co/Io4ohGRAQ0",
    "828": "Hat tip to the @nyknicks , you were the better team tonight. 🤝 #ClipSet #Clippernation",
    "829": "@nyknicks Start Cam, Bench Fournier. It’s not that hard.",
    "830": "@nyknicks What a run. Hand and glove fit with our young guys. Is this garbage time? Or is he closing this game??  #CamJam",
    "831": "The New York Knicks won a basketball game. It’s been a while. Bing bong.",
    "832": "@nyknicks Can't wait for Grimes and Obi to come back.",
    "833": "@nyknicks too ez when u play da kids",
    "834": "@nyknicks Proof to play the kids. Cant not now",
    "835": "PLAY THE KIDS. @nyknicks",
    "836": "@nyknicks I can finally use this edit https://t.co/cwO1huZR19",
    "837": "My New York Knicks FINALLY win a game! I repeat my New York Knicks FINALLY win a game! News at 11  😳 https://t.co/DCMMpvNKED",
    "838": "@nyknicks @KnicksOnClutch not an impressive win",
    "839": "@nyknicks Quickley should start until D Rose come back and put McBride as the second unit pg",
    "840": "@nyknicks Omg. The Knicks finally won a basketball game. 😱 #NewYorkForever",
    "841": "@nyknicks Ez baskets win games. Thank fellas",
    "842": "Cam Reddish - New York Knicks\n17 PTS\n2 RBD\n1 STL\n2 TO\n[FD(20.4) DK(21.5)]",
    "843": "Jericho Sims - New York Knicks\n4 PTS\n11 RBD\n1 TO\n[FD(16.2) DK(17.25)]",
    "844": "Immanuel Quickley - New York Knicks\n21 PTS\n10 RBD\n6 AST\n1 STL\n1 TO\n[FD(44) DK(47)]",
    "845": "Alec Burks - New York Knicks\n15 PTS\n4 RBD\n4 AST\n2 BK\n1 STL\n[FD(34.8) DK(34)]",
    "846": "Mitchell Robinson - New York Knicks\n12 PTS\n11 RBD\n2 BK\n1 STL\n1 TO\n[FD(33.2) DK(32.75)]",
    "847": "RJ Barrett - New York Knicks\n24 PTS\n9 RBD\n4 AST\n2 TO\n[FD(38.8) DK(40.75)]",
    "848": "Damn @nyknicks was it so hard to finally close out a game!!",
    "849": "@nyknicks @IQ_GodSon @RjBarrett6 Out with the old…in with the new. What are we waiting for Thibs?!",
    "850": "@nyknicks Redeem themselves. Nice.",
    "851": "@nyknicks he’s done miracles on me",
    "852": "@knickswintrack @nyknicks Agreed",
    "853": "@nyknicks We are New York good or bad we are here !!!",
    "854": "KNICKS BLOWOUT! Tom Thibodeau unleaded his young guns tonight, &amp; they helped New York blowout the Clippers, 116-93, led by Barrett, Reddish, &amp; Quickley! \n\nRJ Barrett: 24 PTS, 9 REB, 5 AST\nCam Reddish: 17 PTS, 25 MIN, 4/7 FGM, 25 MIN\nImmanuel Quickley: 21 PTS, 10 REB, 6 AST https://t.co/Xes2HZzU5N",
    "855": "@nyknicks Start Cam",
    "856": "@nyknicks Youngins did it with ease..\nPlayed hard on both ends..\nSome went nut..\nBut at least it was rim attacks..\nThibs was itching to take them out.. \nSo it’s still fuck you…",
    "857": "@nyknicks @IQ_GodSon Says ALOT about your organization that you promote someone who treats people like 💩 Quickley is a NARCISSIST‼️🤡",
    "858": "@nyknicks @IQ_GodSon @RjBarrett6 Holy shit the Knicks won!!! And by 20 something pts. Knicks have a good group of young players that can ball &amp; should use them more often especially these last games of the season. Let’s just see what Thibs do…",
    "859": "@hopefulmetsfan @nyknicks @IQ_GodSon @RjBarrett6 From beginning of this season. They would be so much further ahead in competitive NBA experience.",
    "860": "@nyknicks Listen to twitter: play the kids. \n\nIt's really not rocket science.",
    "861": "@nyknicks @IQ_GodSon @RjBarrett6 Finally holy shit this team.",
    "862": "@nyknicks START THE KIDS EVERY GAME NOW PLEASE",
    "863": "@BCusterTV @nyknicks @LAClippers @MarkJackson13 @espn Excellent call tonight. Custer is world class and we need him to do more nba games (especially Knicks espn games)",
    "864": "@nyknicks Finally Knicks didn’t blow another lead down the stretch. https://t.co/PcdQ00sBIr",
    "865": "@DanielJonesMVP @nyknicks 1-0 against the kings this szn 💪",
    "866": "Good team win @nyknicks y'all see when @camreddish gets solid minutes he can produce.. so Tibs plz stop being stubborn and stuck in ya ways and give the kids minutes let's F****** Go Baby!",
    "867": "@AboutToRatioU @nyknicks even if mcbride shits the bed i wont care cus hes the future and has potential. id rather see him grow than burks being mid every game. just look at RJs growth",
    "868": "@nyknicks CAM AND RJ NEED AT LEAST 25 MINUTES ON THE COURT TOGETHER EVERY GAME FOR THE REST OF THE SEASON https://t.co/ZYYqmn3VUf",
    "869": "@nyknicks Thibs finally let the young fellas loose! #NewYorkForever https://t.co/vGjfQurFSf",
    "870": "@nyknicks @Thibs!!\n\nThe Young guys won this game by preventing the all to common collapse https://t.co/cCVcZcGkj6",
    "871": "@nyknicks I'm happy, this was a great win. Our young Knicks pulled it off. Young Knicks should have been playing a couple weeks ago. Again a great win.",
    "872": "KNICKS WIN! New York Knicks vs Los Angeles Clippers Postgame Recap! https://t.co/ARBaWYoaye via @YouTube",
    "873": "@nyknicks We need @MarkJackson13 for Head Coach.",
    "874": "@nyknicks You know what we just did? I want to do that tomorrow",
    "875": "@AmberMo55719387 @nyknicks Can I be honest with u I don’t think anyone cares",
    "876": "@nyknicks Mickey Mouse win against the clippers bench. Let’s be honest",
    "877": "@nyknicks KEEP PLAYING OUR YOUNG GUYS",
    "878": "@nyknicks Only took 64 games to play the young guys and look what happens",
    "879": "@nyknicks We WON  A GAME https://t.co/Ve2g0YH9RB",
    "880": "@nyknicks Forgot how this feels",
    "881": "@nyknicks Play the kids bro #playthekidsbro",
    "882": "BREAKING NEWS: The Knicks actually win a game. (And win a game in L.A.) #NewYorkForever @nyknicks https://t.co/fY9cq2GL5q",
    "883": "@nyknicks PLAY THE KIDS AND WE WIN https://t.co/cPeW0MMs06",
    "884": "@MirSyed12 @Iukeswanson @nyknicks @IQ_GodSon @RjBarrett6 No cap bro dude is a good 2 jus catch and shoot",
    "885": "@nyknicks @RyArch15 We got such an amazing group of young talent man",
    "886": "KNICKS WIN! New York Knicks vs Los Angeles Clippers Postgame Recap! https://t.co/ejSKC3JBTb",
    "887": "@nyknicks PLAY THE KIDS",
    "888": "@nyknicks Play the kids and the wins will keep coming. Trust.",
    "889": "@nyknicks Guys get ready to spam this when the clippers post😈 https://t.co/M664YFaYW1",
    "890": "@nyknicks Thibs during post-game interviews dealing with reporters that are going to hammer him with Cam Reddish questions https://t.co/aRDuv90EoJ",
    "891": "@nyknicks KEEP PLAYING CAM REDDISH",
    "892": "@nyknicks Even though Burks played good today but he’s better as a backup 2",
    "893": "Good Shitt @nyknicks 🔥🔥💯",
    "894": "@chairmanlim1990 @nyknicks Ew cowboys suck",
    "895": "@nyknicks This is what happens when Evan Fournier doesn’t play starter minutes",
    "896": "@nyknicks LET THE KIDS COOK",
    "897": "@nyknicks PLAY THE YOUNG GUYS! KNICKS FANS KNOW WHAT THEYRE TALKING ABOUT",
    "898": "@nyknicks Please continue to play the young guys. Knicks basketball was actually fun today",
    "899": "@AdmireIIII @nyknicks @IQ_GodSon @RjBarrett6 Warriors are first round exit",
    "900": "@nyknicks FINALLY",
    "901": "@nyknicks Start Cam!",
    "902": "@TeriCarson @RedHourBen New York Knicks, basketball team?",
    "903": "@nyknicks YEZZZIRRR❕",
    "904": "@nyknicks Imagine having a point guard in Miles McBride with a +27 and still continue to start Burks at PG",
    "905": "@nyknicks God I pray that this opens Thibs eyes. I know there’s no obligation in listening to fans. But it doesn’t take a genius to see the obvious young talent on this team. Trade these old heads away.",
    "906": "@nyknicks It’s been forever since this was tweeted",
    "907": "@nyknicks Play the kids more",
    "908": "@nyknicks CANT BELIEVE IM ACTUALLY SAYING THIS RIGHT NOW BUT WE FINALLY WON!\n- CAM REDDISH 🤯\n- Mitch is a beast \n- Sims has been cooking thibs finally plays him over Noel and taj \n- IQ great game \n- RJ another great game from the goat \n- Can’t believe I’m saying this but great game burks",
    "909": "@nyknicks Clippers = Buffalo Bills!\nKnicks = Dallas Cowboys!",
    "910": "@nyknicks @obitoppin1 Happy born day",
    "911": "@nyknicks @IQ_GodSon @RjBarrett6 Knicks win and RJ will not be dancin TONIGHT!!",
    "912": "@ibrotherealone @ANT_NYK @nyknicks @IQ_GodSon @RjBarrett6 And Grimes",
    "913": "@JoshBraaten Who knew @nyknicks could hold, and build, a lead?  Glad they did.",
    "914": "@nyknicks @IQ_GodSon @RjBarrett6 I CANT BELIEVE MY EYES https://t.co/8syHPHyGMt",
    "915": "@nyknicks @IQ_GodSon @RjBarrett6 @MarkJackson13 for @nyknicks Head Coach",
    "916": "@nyknicks @RyArch15 Great to see. Shouldn't have took this long to play him. Signed him for depth purposes and if he played reps at pg it would move Burks back to his natural position.",
    "917": "Knicks beating the \"longest losing streak from a New York basketball team this season\" allegations https://t.co/1H7RwvbGuk",
    "918": "Always and forever @nyknicks 🔷🔶🔷🔶🔷🔶",
    "919": "@ibrotherealone @nyknicks @IQ_GodSon @RjBarrett6 True",
    "920": "@nyknicks @IQ_GodSon @RjBarrett6 Good",
    "921": "@nyknicks @IQ_GodSon @RjBarrett6 SEE WHAT HAPPENS WHEN THE YOUNG GUYS PLAY TOGETHER",
    "922": "@nyknicks @IQ_GodSon @RjBarrett6 WE FUCKING SUC… oh wait WE WON 🙌🏾 😤",
    "923": "@nyknicks @IQ_GodSon @RjBarrett6 Still not making the playoffs",
    "924": "ENCERRADO: O New York Knicks (26-38), fora de casa, venceu o Los Angeles Clippers (34-32) por 116 a 93. #NewYorkForever\n\nBarrett: 24pts, 9reb &amp; 4ast.\nQuickley: 21pts, 10reb &amp; 6ast.\n\nCoffey: 16pts, 1reb &amp; 3ast.\nMann: 11pts, 8reb &amp; 4ast.\n\nFIM DA RODADA! #NBA75 https://t.co/vu5GRaI54A",
    "925": "@nyknicks @IQ_GodSon @RjBarrett6 Lesson learned in this win, play the kids",
    "926": "KNICKS WIN!\n\nA equipe de Nova York bateu o Clippers por 116 a 93.\n\nBarrett: 24PTS/9REB\nQuickley: 21PTS/10REB/6AST\nReddish: 17PTS\nRobinson: 12PTS/11REB\n\nCoffey: 16PTS\nHartenstein: 14PTS\n\n📷 @nyknicks \n\n#NewYorkForever #NBA75 https://t.co/nQyVLKQa5k",
    "927": "@nyknicks @IQ_GodSon @RjBarrett6 More of this. Thanks",
    "928": "@nyknicks @IQ_GodSon @RjBarrett6 BARRETT'S WALLPAPER PLEASE",
    "929": "I can now rest easy tonight thanks @nyknicks I enjoyed watching that game",
    "930": "@ANT_NYK @nyknicks @IQ_GodSon @RjBarrett6 Only missing quickly",
    "931": "@nyknicks @IQ_GodSon @RjBarrett6 Imagine if Thibs had listened to us Knicks fans and played the young guys together!",
    "932": "@nyknicks @IQ_GodSon @RjBarrett6 FINALLY LFG",
    "933": "@nyknicks @IQ_GodSon @RjBarrett6 YEAH BABY!!!!!",
    "934": "@nyknicks @IQ_GodSon @RjBarrett6 SEE WHAT HAPPENS WHEN YOU PLAY THE KIDS THIBS?? LETS GOO",
    "935": "I genuinely haven’t felt joy like this in weeks, love you @nyknicks 😘",
    "936": "BOUT FUCKIN’ TIME @nyknicks",
    "937": "@nyknicks @IQ_GodSon @RjBarrett6 Great win guys",
    "938": "@nyknicks I can’t believe it https://t.co/vu3cm3yZU0",
    "939": "@nyknicks @IQ_GodSon @RjBarrett6 great win but if i see another heineken ad imma fucking scream",
    "940": "Trust and play the kids @nyknicks",
    "941": "@nyknicks @IQ_GodSon @RjBarrett6 Your telling me that if we play the young guys we can win????? Thank god we are realizing this at game 64 while we are 12 games under .500!!!",
    "942": "@nyknicks @IQ_GodSon @RjBarrett6 Trade randle and you won’t be tanking anymore",
    "943": "@nyknicks @RyArch15 When you think of the GOAT debate some common names people bring up come to mind, LeBron James, Michael Jordan… me? I’m taking Ryan Arcidiacono",
    "944": "The New York Knicks just won a basketball game. This is not a drill.",
    "945": "Finally a fucking win.. finally y’all played a full 48 minutes of regulation! @nyknicks",
    "946": "@nyknicks @IQ_GodSon STOP PROMOTING THIS NARCISSIST‼️🤡",
    "947": "@nyknicks @IQ_GodSon @RjBarrett6 I forgot what this felt like",
    "948": "@nyknicks @IQ_GodSon @RjBarrett6 WHAT NO FUCKING WAY WE WON🥳",
    "949": "@nyknicks @IQ_GodSon @RjBarrett6 And only 5.5 games out of a play in yay. But see what happens when the young guys play more keep playing them.",
    "950": "@nyknicks @IQ_GodSon @RjBarrett6 Finally",
    "951": "WAY TO END THE STREAK FELLAS!!!! @nyknicks @KnicksTape #knicksnation",
    "952": "You’re welcome, @nyknicks. https://t.co/buRKAlyBoU",
    "953": "@nyknicks @IQ_GodSon @RjBarrett6 You guys see what happens when you play cam reddish",
    "954": "Amazing what happens when you play the kids extended minutes @nyknicks",
    "955": "@nyknicks @IQ_GodSon @RjBarrett6 Didn’t blow another 20pt lead, congrats",
    "956": "@nyknicks @RyArch15 Welcome aboard",
    "957": "@nyknicks @IQ_GodSon @RjBarrett6 Its quite literally been forever since a W",
    "958": "@nyknicks @IQ_GodSon @RjBarrett6 See how we win when our young guys are given more chances?",
    "959": "@nyknicks @IQ_GodSon @RjBarrett6 It’s been so long lmaooo",
    "960": "@nyknicks @IQ_GodSon @RjBarrett6 We win against the clippers and warriors but lose to everyone else 😭 I love this team",
    "961": "@nyknicks @IQ_GodSon @RjBarrett6 LOOK AT WHAT HAPPENS WHEN THE KIDS PLAY EXTENDED MINUTES",
    "962": "@nyknicks @IQ_GodSon @RjBarrett6 SEE WHAT HAPPENS TOM",
    "963": "@nyknicks @IQ_GodSon @RjBarrett6 Finally https://t.co/hxJzA7TvRI",
    "964": "@nyknicks @IQ_GodSon @RjBarrett6 We needed this win after the last month",
    "965": "@nyknicks @IQ_GodSon @RjBarrett6 FINALLY",
    "966": "@nyknicks @IQ_GodSon @RjBarrett6 This is why you play the young guys",
    "967": "@nyknicks @IQ_GodSon @RjBarrett6 Julius Randle sucks",
    "968": "@nyknicks @IQ_GodSon @RjBarrett6 Quickley ball hog masterclass",
    "969": "@nyknicks @IQ_GodSon @RjBarrett6 I forgot what it’s like to see you tweet this",
    "970": "@nyknicks @IQ_GodSon @RjBarrett6 THE FUTURE https://t.co/oaD4mBWrVJ",
    "971": "@nyknicks @IQ_GodSon @RjBarrett6 To all the fans that wanted Reddish to play more minutes, congrats. You are smarter than an NBA head coach.",
    "972": "@nyknicks @IQ_GodSon @RjBarrett6 FINALLY",
    "973": "@nyknicks @IQ_GodSon @RjBarrett6 Clippers = Buffalo Bills!\nKnicks = Dallas Cowboys!",
    "974": "KNICKS WIN! https://t.co/xthbcp3z9f",
    "975": "Finally @NyKnicks beat the breaks off somebody on the road. must be inspired by the Lakers.",
    "976": "Great W @nyknicks",
    "977": "@nyknicks @RyArch15 More points than game 7 John Starks 🥶😈",
    "978": "@nyknicks thank you for giving my man Cam some minutes. Hopefully this is a consistent thing!",
    "979": "The @nyknicks have FINALLY decided they wanted to WIN A GAME!!🔷🔶🔷🔶\n#Knicks",
    "980": "@nycSportsfan718 @FredKatz @nyknicks @jbryant3 LMASSOFF!",
    "981": "@nyknicks @RyArch15 Better than LeBron imo",
    "982": "Just know @nyknicks the young's could've done it by themselves... easily..",
    "983": "@nyknicks @RyArch15 bulls legend",
    "984": "@nyknicks @RyArch15 Chills.",
    "985": "@NYCDAOtoken @nyknicks @BrooklynNets Can you let me back into the telegram plz @poethefirst",
    "986": "#freecamreddish @camreddish @nyknicks 30 plus minutes for the rest of the season TIbs and Dolan @nba WE NEED Ws and free throws made down the stretch! We need guys that aren’t scared and passive and can shoot high percentage shots and help gang rebound! Playoff bound or bust 💯🏀",
    "987": "@NBA @nyknicks its 2 bad tips.hates him and he will never be a starter n soon as the season is over he's cut he will be the 1st one then randell.the bum.. and I'm a knicks fan saying thing. but I ain't  fan of these bums.",
    "988": "@nyknicks @RyArch15 Get 51 in the rafters",
    "989": "@nyknicks @RyArch15 congrats bro",
    "990": "@nyknicks @RyArch15 i’d rather play him at point than to see burks play point again",
    "991": "@nyknicks @RyArch15 Knicks Legend",
    "992": "NEW YORK KNICKS LEGEND RYAN ARCIDIACONO",
    "993": "@nyknicks @RyArch15 LETS GOOOO",
    "994": "First Knicks bucket for @RyArch15! https://t.co/LJghRmSm9V",
    "995": "🚨 UPDATE: Immanuel Quickley - New York Knicks has a Double Double\n1:56 4th\n19 PTS\n10 RBD\n6 AST\n1 STL\n[FD(42) DK(45)]",
    "996": "@nyknicks Clippers cut the 26 point lead to 12 points. Then put in IQ, Sims, RJ, McBride, and Reddish. Who bring the lead up to 32. I think that means we should be playing the young guys. Just a thought🤔",
    "997": "@nyknicks YOU SEE WHAT HAPPENS WHEN YOU PLAY THE KIDS THIBS? 👀",
    "998": "@hhpthebook Who cares we are the New York Knicks people look down on us we are not perfect but we still bring it every night good or bad  we are NEW YORK. For ever",
    "999": "@nyknicks I really hope Thibs wakes the hell up and realizes to play him more",
    "1000": "@nyknicks YEA DEUCE 🗣",
    "1001": "@nyknicks this guy needs to start asap",
    "1002": "The @nyknicks were hooping tonight",
    "1003": "Hey! New York Knicks! https://t.co/yVf7Q5Q8GQ",
    "1004": "@nyknicks Don’t give af fire thibs still on top",
    "1005": "My young boys did their thing tonight and @RjBarrett6 @nyknicks",
    "1006": "@nyknicks NEED\nMORE",
    "1007": "@nyknicks quickley pass it to him stop ball hogging",
    "1008": "@nyknicks Thibs mad asf",
    "1009": "@nyknicks Will be choking in 3rd n 4th",
    "1010": "@nyknicks Best player on the Knicks",
    "1011": "@nyknicks This picture is hard",
    "1012": "@nyknicks Look at what happens when you give him minutes",
    "1013": "@nyknicks This is why you play the young guys",
    "1014": "@nyknicks Paul George 2.0",
    "1015": "@nyknicks Start him",
    "1016": "KillAaaaa 🏀🔥🏀🔥@camreddish in LA @LAClippers plus 30 @nyknicks Let this man play 30+ min &amp; let’s make this play in! Make @J30_RANDLE a spot up shooter &amp; let @RjBarrett6 N  @IQ_GodSon carry us to the playoffs! It ain’t over till I say it’s over @nba WAKE UP TIBS💯🌍🏀🌏🏀🌎🏀",
    "1017": "CAM COOKIN'\n\n📊 16 PTS in 20 MIN https://t.co/EBczjZhtdC",
    "1018": "GET US IN THE PLAY IN GAME, THE NEW YORK KNICKS ARE BAck… nah, I can’t do this again. I can’t let them get my hopes up just to crush them like a gnat on a sunny day in August. Gonna chill on the porch with some lemonade until I see another couple dubs.\n\n*Cam Reddish tho 👀 📈",
    "1019": "@NYCDAOtoken @wizardofsoho @nyknicks @BrooklynNets @newbhuh it begins",
    "1020": "@nyknicks Why does Burks play when we got Cam?",
    "1021": "@KnicksFanTv oh happy days.. @nyknicks oh happy days.. #NewYorkForever..",
    "1022": "@nyknicks thank you for making my Sunday night🥂",
    "1023": "See how good we can be if we switch our lineups and let the kids play?? @nyknicks",
    "1024": "@WorldWideWob Nets: 0-1 since March 7th\n\nKnicks: 1-0 since March 7th\n\nIt’s a new era in New York",
    "1025": "Peep this @nyknicks @dumbbaldknickscoach",
    "1026": "Can I finally sigh an air of relief knowing the @nyknicks are about win their first game in abt 3 weeks .... y’all think I’m stupid I’m holding my breath til that 4th quarter buzzer sounds @LAClippers #TheKnicks #Knicks #clippers",
    "1027": "KEEP FEEDING HIM @nyknicks",
    "1028": "The New York Knicks have lost 17 of their last 21 games. Two of those wins were against the Clippers.",
    "1029": "@nyknicks I love watching Deuce",
    "1030": "Up by 32 play the young guys they said @nyknicks might wanna listen to us fans next time",
    "1031": "@nyknicks Play him more then",
    "1032": "@bardot_Barbie @nyknicks Yall finally don't blow a lead",
    "1033": "@nyknicks Destroying the best team in LA",
    "1034": "@nyknicks WE NEED MORE DEUCE CONTENT",
    "1035": "@MVisuaIs @nyknicks Facts bruh even tho this year been not fun I do enjoy watching that young core hopefully next year draft we get a young stud at PG maybe TyTy Washington or etc.",
    "1036": "@nyknicks Feels good watching the young guys",
    "1037": "@nyknicks This is art",
    "1038": "Give Cam Reddish minutes asap @nyknicks",
    "1039": "@nyknicks Put this guy starter !!!",
    "1040": "So happy to see Cam playing well @nyknicks",
    "1041": "@AboutToRatioU @nyknicks Yall finally don't blow a lead",
    "1042": "Deuce from deep. https://t.co/W68AotoZho",
    "1043": "if the @nyknicks blow this lead within 5mins 😥",
    "1044": "@NYCDAOtoken @nyknicks @BrooklynNets GM DEGENS",
    "1045": "LOOK WHAT HAPPENS WHEN YOU GIVE CAM MINUTES @nyknicks",
    "1046": "Fun watching @nyknicks tonight - especially after great @NYRangers win",
    "1047": "@nyknicks @camreddish KEEP ADVERTISING",
    "1048": "Whoever gets the @nyknicks coaching job next year is going to be in a great spot: a true #1 scorer in Barrett; athletic rebounders/defenders in Robinson/Sims; Great 3 pt shooter in Fournier; talented guards/wings like Reddish, Quickley, Burks. Should be a good team next yr.",
    "1049": "Quick staying aggressive. https://t.co/1m7AjJIonc",
    "1050": "Nets since March 7th: 0-1\n\nKnicks since March 7th: 1-0 \n\nIs this the start of a new era in New York? https://t.co/8jxoh4wXQC",
    "1051": "Leave them in the rest of the game! @nyknicks",
    "1052": "@LatinLegacy @nyknicks I think he can find a home here. The more comfortable he is the better he's going to play Thibs is perfect to get the best out of him.",
    "1053": "Los Angeles Clippers - New York Knicks\n\nBet slip link: https://t.co/vuJJySemK9\n\n#LosAngelesClippers #NewYorkKnicks #dai #betting https://t.co/O42FL8Npzr",
    "1054": "@nyknicks Crazy how young athletic players that play defense can stop a team from coming back from 20🥴🤔",
    "1055": "I can’t believe you are a talented basketball coach if u watch Evan Fournier and Cam Reddish play everyday and come to the assumption Reddish is the worse player. You have to be at least slightly autistic or French to actually believe that statement. #nba #Knicks #thibs #NewYork",
    "1056": "@nyknicks Do you young fella",
    "1057": "@nyknicks PLAY HIM, don’t play Fournier",
    "1058": "@nyknicks hes playing way too good.. thibs might bench him",
    "1059": "@nyknicks Start him.",
    "1060": "@Exedral @nyknicks Are you telling me that we should not suffer more being a Knicks fan?",
    "1061": "@nyknicks THIS SHOULD BE OUR STARTING 5!!!!!",
    "1062": "This just goes to show #thibs cost us this season with his inability to recognize our talented youth and his terrible so-called coaching #Knicks @nyknicks #thibsneedstogo",
    "1063": "@nyknicks Imagine playing athletic and hungry guys? SMH. Thibs should have listened to us months ago",
    "1064": "@NBA @nyknicks blowing the lead",
    "1065": "@nyknicks Start him",
    "1066": "@nyknicks Start Cam,bench Randl3",
    "1067": "@nyknicks See what happens when you play the young guys",
    "1068": "@nyknicks @camreddish POST CAM REDDISH MEDIA NOW!",
    "1069": "@nyknicks Why aren’t we losing",
    "1070": "@nyknicks @camreddish Should’ve played at the end of the suns game instead of Fournier",
    "1071": "@nyknicks Lose@",
    "1072": "R 3️⃣ D D I SH https://t.co/wLqKb1Ymva",
    "1073": "this shit is not too hard to comprehend.. @nyknicks https://t.co/eRgnNrb1qn",
    "1074": "Just Jericho things. https://t.co/ocbXtr7WDy",
    "1075": "@nyknicks @camreddish CAM FAM",
    "1076": "@hhpthebook @nyknicks Talk about it bro!",
    "1077": "@nyknicks @camreddish Start him",
    "1078": "The New York Knicks are winning. That's good news Portland https://t.co/aiGkIqkVJL",
    "1079": "PLEASE SCORE ONE MORE TIME RJ.\n\n@nyknicks @NY_KnicksPR @KnicksGaming\n\nPLEASE DON'T TAKE HIM OUT https://t.co/VR0vNkh6oI",
    "1080": "@KnicksMSGN @RjBarrett6 @deucemcb11 @IQ_GodSon @nyknicks Quickley the Narcissist 🤡",
    "1081": "This is some of the sorriest shit I’ve watched in a while @nyknicks. Y’all better not over pay Randle",
    "1082": "@hhpthebook @nyknicks Pay him so he can afford an elite chiropractor!! Lol",
    "1083": "@sny_knicks @nyknicks He can drive to the basket?",
    "1084": "@nyknicks Well, New York Knicks, you gotta play him more often, huh?",
    "1085": "@FantasyGenius4U How disgusting. Lue gives up with 9 minutes left against the New York Knicks.",
    "1086": "Nothing feels good like seeing #Clippers loosing to #Knicks , basically being beaten 👏🏼👏🏼👏🏼But I don’t get it , it’s like they (clippers )were built to beat us #Lakers . \n#newyorkknicks \n#nba \n#Clippers https://t.co/4wU3tVmrF8",
    "1087": "So your telling me the young guys are playing and they’re up by 20 on the clippers hmmm 🤔 tells you something doesn’t it @nyknicks",
    "1088": "Always believed in ya @nyknicks",
    "1089": "@nyknicks Cam is a solid player. He just needs a coach that believes in him &amp; will help him develop. He was pushing close to 20 points a game as a starter for the Hawks. He just wasn't good at moving the ball. Something he can be taught to do.",
    "1090": "This line up is perfect @nyknicks",
    "1091": "Tom Thibodeau and the New York Knicks are challenging an offensive foul call in a game they lead by 24 with 7:26 to play.",
    "1092": "Please @nyknicks don't fuck this up. I don't want you to end up having a worse record than my Spurs 😂",
    "1093": "@nyknicks If you guys had just listened and played the young guys months ago we wouldn’t be in 12th place",
    "1094": "@nyknicks @camreddish CAM MAN Definitely CAN!!!!! #NYKnicks",
    "1095": "Tough finish from Cam 💪\n\n🎥 @nyknicks https://t.co/5Q6Euq9L9v",
    "1096": "@camreddish  keep lighting it up. Yes Thibs!! @nyknicks",
    "1097": "If this isn’t the game showing we need to get rid of all the vets this off-season, idk what is @nyknicks",
    "1098": "@nyknicks @camreddish Thibs Better leave him in!!",
    "1099": "@nyknicks Why isn’t he starting?",
    "1100": "@nyknicks @camreddish That’s what I’ve been waiting for!",
    "1101": "@nyknicks @camreddish THIBBS DONT MESS THIS UP!",
    "1102": "@nyknicks Start him",
    "1103": "@nyknicks Better than Fournier",
    "1104": "get it done @nyknicks https://t.co/EU6YBNVrxN",
    "1105": "@nyknicks Look what happens when we play the young ones",
    "1106": "@nyknicks I don’t want to see E*** F******* for the rest of the night",
    "1107": "@nyknicks CUM REDDISH",
    "1108": "Our game to lose @nyknicks #NewYorkForever #knicks_fever007",
    "1109": "@nyknicks KEEP RUNNING PLAYS FOR HIM U MFS",
    "1110": "@nyknicks Start him over Evan",
    "1111": "@nyknicks I beg you please start cam",
    "1112": "@nyknicks DO NOT TAKE HIM OUT",
    "1113": "@nyknicks Lose lose lose",
    "1114": "@nyknicks Don’t sub this lineup out",
    "1115": "@nyknicks Start him",
    "1116": "Cam with the lefty finish. https://t.co/Q1KlfGTDNk",
    "1117": "@nyknicks @camreddish Oh wow the lineup everyone wants to play together got the lead back? Crazy how that works",
    "1118": "@NBA @nyknicks This is the clippers that beat the Lakers the other day...",
    "1119": "@nyknicks @camreddish Can thibs and the front office open their fucking eyes now? No reason the fans can see this youth lineup succeeding but they can’t..",
    "1120": "@deucemcb11 @camreddish @RjBarrett6 @IQ_GodSon @qdotgrimes &amp; #JerichoSims @nyknicks Didn’t Miss With These Picks They Just Need To Play More 💯💯💯 #KnicksTape",
    "1121": "@nyknicks @camreddish better not sub any of them MF back in.. !!!\nword.. keep the young guns on the floor..",
    "1122": "@nyknicks @camreddish The Cam Reddish Masterclass",
    "1123": "@nyknicks @camreddish nice to see reddish and mcbride more on the court",
    "1124": "@NBA @nyknicks get him the ball more",
    "1125": "@nyknicks @camreddish Better not come out",
    "1126": "@NBA @nyknicks hopefully he gets a chance in nyc",
    "1127": "Letsss go Cammm @nyknicks",
    "1128": "@WestCoastDraco @Sermanson_2002 @IllWillofficial @raptvcom Right now: Russ - Blue chip\n\n“New York Knicks fame so she deep throat\nYeah, my D. Rose, then her knees broke, I'm the G.O”\n\n“Fuck a blue check, I'm a blue chip, reliable stock”\n\n“I wasn't invited, so I through my own party\nDidn't let me join, so I got my own army”",
    "1129": "That's smooth, Cam.\n\n10-0 @nyknicks run to open the 4th quarter on ESPN https://t.co/0lBGbBH2Yy",
    "1130": "@nyknicks @camreddish You can’t tell me thibs watches Reddish play basketball and thinks playing him won’t help us win games",
    "1131": "@nyknicks @camreddish HE NEEDS MORE MINUTES",
    "1132": "@nyknicks @camreddish This Lineup right now https://t.co/RlqTlYK5bV",
    "1133": "@nyknicks @camreddish Look at him Thibs",
    "1134": "@nyknicks @camreddish IM GONAN CUM",
    "1135": "@nyknicks @camreddish all this from the young guys just for the starters to come in and us to choke",
    "1136": "LFG KNICKS LMFAO. ONE NEW YORK TEAM HELPING ME TODAY.",
    "1137": "Let’s Go @nyknicks",
    "1138": "@nyknicks @camreddish SCOOP THERE IT IS",
    "1139": "@nyknicks @camreddish UNLOCK CAMM",
    "1140": "@nyknicks @camreddish thibs gotta play him more after this",
    "1141": "@nyknicks @camreddish WE WANT REDDISH",
    "1142": "@nyknicks @camreddish Please lose",
    "1143": "Single scoop \n\n🍨 @camreddish https://t.co/I5IplkW06i",
    "1144": "With 8:53 to go in the fourth quarter, the New York Knicks lead the LA Clippers, 90-68.",
    "1145": "RUN IT UP @nyknicks",
    "1146": "48 minutes fools! @nyknicks",
    "1147": "@nyknicks @23savage____ Finish sttrong",
    "1148": "@nyknicks @23savage____ Please lose",
    "1149": "@23savage____ Too strong. https://t.co/8WZGCs6wDK",
    "1150": "@NYCDAOtoken @nyknicks @BrooklynNets @cryptoskullx @beaniemaxi  @EricCryptoman check out NYCDAO sers",
    "1151": "@funominalle @NYCDAOtoken @nyknicks @BrooklynNets @mattallen1043 @Shears399 Im in",
    "1152": "WHEN DEUCE AND SIMS PLAY WE PLAY NEW YORK KNICKS BASKETBALL.",
    "1153": "The Future Is On The Floor For The @nyknicks Loving This Shit LFG !!!",
    "1154": "Sick of this same movie over and over again.. y’all blowing this lead or nah? @nyknicks",
    "1155": "Before this 4th Quarter starts I’d like to make this clear, if the New York Knicks blow another 20 point lead and lose tonight; Tom Thibodeau must be fired within an hour of the final buzzer. Enough is enough.",
    "1156": "@nyknicks up 12 headed into 4th… going to sleep knowing we lose by 2",
    "1157": "We are giving away 2 tickets to the @nyknicks and @BrooklynNets  game happening March 13th! 🏀🏀🏀\n\nSimply follow our Twitter page, like, retweet and tag 3 friends on this post for a chance to win!!!!!",
    "1158": "@cheeseislifeee @nyknicks Also the refs who gave the clippers about 3 free points for not calling foul on Barrett also taking 2 points from him getting tech cause refs cant do job right another plus 1 so score rn shouldn’t be 80-68 it should be 82-64",
    "1159": "• nigga , 😂😆🏀 New York Knicks !!",
    "1160": "Can’t wait to see the @nyknicks  blow this lead. Smh it’s hard being a Knick fan. #NBA75 #Knicks #NewYorkForever",
    "1161": "@LAClippers take advantage of RJ Barrett's time on the bench to outscore the Knicks 28-21 in Q3 to make this a 12 pt game. @nyknicks lead 80-68. Hard double teams on RJ and probably 1 v 1 coverage on Mitchell Robinson will be needed to get enough stops to have a shot.",
    "1162": "i know how this end @nyknicks",
    "1163": "Here we go @nyknicks fans brace yourself for the 4th LOL these guys could have a 50 pts lead &amp; I still wouldn't trust it. #Knicks #nyknicks #knickerbocker #NoLeadIsSafe",
    "1164": "Amazing to see how every game the @nyknicks manage to blow 20+ point leads. My Gawd https://t.co/DLafeWytGs",
    "1165": "And so it begins now @nyknicks thank god Killa Cam is in the game now",
    "1166": "👀 @nyknicks don’t blow another one",
    "1167": "@hhpthebook @nyknicks This is all I ever ask bro...lol",
    "1168": "@MarkGottlieb @Foxtel @NBA @nyknicks Felt the same way about them although I'm pretty happy watching them lose.",
    "1169": "Put in Cam Reddish @nyknicks",
    "1170": "Oh Hell Ya! The @nyknicks r up 18 coming to the end of the 3rd!!!! Time to watch a meltdown!!!!",
    "1171": "@nyknicks Wish Julius randle wouldn’t 😂",
    "1172": "'Knicks vs. Clippers Prediction and Odds (Fade New York at All Costs)' via @fansided #knicks #newyorkforever #nba75  https://t.co/5hAdwAYbA5",
    "1173": "Mitchell Robsinson is all about grown man business. 💪\n\n(🎥: @nyknicks)https://t.co/zMhzjpKSop",
    "1174": "@nyknicks @23savage____ These step backs are Horrendous",
    "1175": "@kunal____ @KinG_Easy @nyknicks Lets go Knicks!",
    "1176": "@nyknicks Is he gone realize he’s not James Harden ? https://t.co/1rww67ftQn",
    "1177": "If the @nyknicks lose this lead the problem is try out #juliusrandle #ny",
    "1178": "If we continue to lead this big going into the 4th, Thibs should rest his starters and play the bench, we have back-to-back games.\n\nLet's win this, @nyknicks.\n\n#NewYorkForever",
    "1179": "@nyknicks So tired of seeing it",
    "1180": "If the @nyknicks lose this one I’m revoking my month Fanship lmao pass even if it was only for 3 months lmao Jk",
    "1181": "With 2:56 to go in the third quarter, the New York Knicks lead the LA Clippers, 78-60.",
    "1182": "@nyknicks #BahaBarrett “watch out. Im going to the cup”",
    "1183": "@nyknicks @23savage____ Bang out. Big body",
    "1184": "@nyknicks Still scared",
    "1185": "@nyknicks Love it but. Really hate seeing Julius make tough shots. Cuase then he misses his nxt 3",
    "1186": "@nyknicks Barrett tech, the refs must’ve really messed up",
    "1187": "@nyknicks We’re gonna blow this lead",
    "1188": "$7500 on the New York Knicks to close it out, let’s get this money @CircaSports @VSiNLive",
    "1189": "Fadin' from the free throw line. https://t.co/kRNQ4xvleN",
    "1190": "@J30_RANDLE is point shaving. @NBA @nyknicks",
    "1191": "@nyknicks FINISH the FUCKING fight please!!!!!",
    "1192": "@nyknicks @23savage____ Randle is so bad 😐",
    "1193": "I have a great idea for a reality show… Behind the scenes of the Chart Seater for NBA games. Maybe a comedy? @nbc @NBATV @ESPNNBA @NBAonTNT @nyknicks https://t.co/BThXgoOEpw",
    "1194": "ALERT: New high roller bet posted!\nA bet has been placed for $25,060.32 on Los Angeles Clippers - New York Knicks to win $25,310.92.\nTo view this bet or copy it https://t.co/ho8bfLEmX9 https://t.co/LYWI3vOZEu",
    "1195": "Los Angeles Clippers - New York Knicks\n\nBet slip link: https://t.co/hCUJCl37CX https://t.co/sfl2dKpOrq",
    "1196": "@nyknicks @23savage____ Extend him now",
    "1197": "@nyknicks I predict we lose by 5",
    "1198": "@nyknicks Pay MITCH; BETWEEN 10-12 MILL A YR. IF NOT, CHI OR SOMEBODY ELSE WILL GRAB HIM.",
    "1199": "@nyknicks future piston",
    "1200": "The New York Knicks are up big on the Cleepers and I did not get fleeced on a possibly imaginary $35k line of credit via a Twitter bookie. Can’t ask for more than that.",
    "1201": "Mitch is a FORCE on the glass @23savage____ 💪\n\n🎥 @nyknicks https://t.co/W0saunFO1Z",
    "1202": "@nyknicks man needs more freedom. he can do it!",
    "1203": "Wow these are your New York Knicks ?",
    "1204": "@nyknicks Do not let this guy get away. Sign him! @23savage____",
    "1205": "@nyknicks He’s a beast, imagine if he could make free throws",
    "1206": "@nyknicks Imagine if he could hit literally 1 free throw",
    "1207": "@therealselena23 @nyknicks Ratio",
    "1208": "@nyknicks Knicks run NY",
    "1209": "This is objectively hilarious. y’all have scarred us @nyknicks https://t.co/zI13BqTKtG",
    "1210": "@nyknicks He’s working that rim with all them free throw bricks",
    "1211": "@nyknicks Pay that man",
    "1212": "@nyknicks Extend him now",
    "1213": "Mitch is WORKING 😤\n\n12 PTS / 11 REB / 2 BLK https://t.co/65SL2YGpXy",
    "1214": "With 7:16 to go in the third quarter, the New York Knicks lead the LA Clippers, 74-52.",
    "1215": "@nyknicks You can’t possibly blow this, right?",
    "1216": "@nyknicks I wish we had Covington.",
    "1217": "I’m watching @nyknicks @LAClippers game… Mitchell Robinson is the best true center in the league. There’s no argument. \n\n#Knicks #Clippers #nba",
    "1218": "Evan Fournier hits the three as the Knicks lead BIG in the 3rd. \n\n(🎥: @nyknicks) https://t.co/z2edBM3qHC",
    "1219": "RJ goin' left &gt;&gt;&gt; https://t.co/OqGXiE5oYs",
    "1220": "need that pic of RJ and Mitch flexing @nyknicks",
    "1221": "@nyknicks Extend @23savage____ plz",
    "1222": "Mitchell Robinson is giving me Marcus Camby vibes right now @nyknicks PAY THIS MAN!!",
    "1223": "@nyknicks Side step balance. Rise and fire. Gimmmeeeeeee 3eeeeeee!!",
    "1224": "@nyknicks F I N A L L Y",
    "1225": "We almost blowing these boys out by 30…. I’m amazed @nyknicks",
    "1226": "@Nyknicks Jericho Sims looking good. He should get more time on the floor.",
    "1227": "St3️⃣pback 3️⃣van\n\n🎥 @nyknicks https://t.co/XfUipTVNZG",
    "1228": "@nyknicks Should be coming off the bench.",
    "1229": "@nyknicks 🤑💰 Just Won my Mitchell Robinson Double Double. #Knicks #NewYorkForever #NBA #Sportsbook #NYK",
    "1230": "Please resign mitch @nyknicks",
    "1231": "🚨 UPDATE: Mitchell Robinson - New York Knicks has a Double Double\n10:45 3rd\n10 PTS\n10 RBD\n2 BK\n1 STL\n[FD(30) DK(29.5)]",
    "1232": "The NBA fined New York Knicks star Julius Randle $50,000 -- and it was for more than just shoving Phoenix Suns forward Cam Johnson during Friday's game. https://t.co/9YUG8xT0yO",
    "1233": "If I know anything about the Knicks this year and anything about the Clippers this year, this is not going to end well for New York https://t.co/GyIR82l0S8",
    "1234": "@nyknicks Third Quarter Collapse inbound",
    "1235": "MAINTAIN or CHOKE\n\nYour ball, @NYKnicks",
    "1236": "@nyknicks up and I’m live in person. But the get down is 3 quarters of good basketball…………………#Knicks https://t.co/EPX2GpBZt0",
    "1237": "Ok, when will the @nyknicks blow this 19-point lead? #Knicks #NewYorkForever #KnicksTape",
    "1238": "@nyknicks i swear, if you blow the lead one more time. Thibs should be fired",
    "1239": "@nyknicks Cant wait for another second half collapse 🤦‍♂️i should start betting on it id kill lol",
    "1240": "Ok I’m going to sleep. Don’t lose gn @nyknicks",
    "1241": "Knicks will blow this @nyknicks",
    "1242": "Get a win @LAClippers.\nInvent a way to lose, @nyknicks",
    "1243": "@nyknicks Mitchell Robinson or Ben Simmons shooting a free throw to save your life, who you taking?",
    "1244": "@LanceGoodThrust @nyknicks At the buzzer.",
    "1245": "@nyknicks Let’s don’t get happy yet. Still have a whole 2nd half… Knicks get double digits leads &amp; then 4get how to play with each other.",
    "1246": "@nyknicks This is the game where they figure it out and get the W. Let’s stay positive!!!!!!",
    "1247": "@nyknicks That young kid lineup in the second quarter should be running way more minutes",
    "1248": "@RjBarrett6 doesn’t get the recognition he deserves because the @nyknicks aren’t winning right now. But he is in that batch of the next wave of NBA stars right along with Luka, Trae Young, Ja Morant &amp; Jason Tatum https://t.co/WWxfBmkHL0",
    "1249": "ALERT: New high roller bet posted!\nA bet has been placed for $5005.06 on Los Angeles Clippers - New York Knicks to win $9,509.61.\nTo view this bet or copy it https://t.co/jFPV1IIce4 https://t.co/1qqDTvdRJh",
    "1250": "@nyknicks let’s see how we fuck this one up",
    "1251": "@nyknicks Close strong. RJ might own the clippers",
    "1252": "@nyknicks Don't flirt with me unless you mean it",
    "1253": "@nyknicks Wait till the infamous 3rd quarter starts",
    "1254": "Live Bet New York Knicks winning margin by 31+ (+3100)\n\n#gamblingTwittter #parlaykhi💰",
    "1255": "@nyknicks 1 stop 1 basket. Every damn time",
    "1256": "@Jr965C @nyknicks @LAClippers Knicks will still find a way to lose haha",
    "1257": "@nyknicks He’s figured something out",
    "1258": "@nyknicks We know they will lose in 2nd half",
    "1259": "@nyknicks Knicks have never lost back to back halftime leads of 19+ points in franchise history",
    "1260": "@KayD21__ @nyknicks when i cum and she keeps sucking",
    "1261": "@nyknicks $200 says we lose.",
    "1262": "@nyknicks @IQ_GodSon Quick3",
    "1263": "New York Knicks x Los Angeles Clippers \n#NBAnaESPN",
    "1264": "the New York Knicks really playing basketball these days.",
    "1265": "@ItzLamarSZN @NBA @nyknicks He had one bad game😭",
    "1266": "@NBA @nyknicks They still gonna choke this",
    "1267": "Mark Jackson just said about @RjBarrett6 on @espn: he's playing Confident right now like he's that dude for @nyknicks, and guess what...HE IS!!! #fakks",
    "1268": "Sims gonna hurt somebody dunking the way he do @nyknicks",
    "1269": "@nyknicks No way we blow this lead you think, correct?",
    "1270": "@NBA @nyknicks Who’s the most overrated player in the league?\n\nJa Morant!\n\nJa Morant!\n\nJa Morant!\n\nJa Morant!\n\nJa Morant!",
    "1271": "ALERT: New high roller bet posted!\nA bet has been placed for $7,062.00 on Los Angeles Clippers - New York Knicks to win $14,466.28.\nTo view this bet or copy it https://t.co/FJ6b1TRt1R https://t.co/gEX7Ecg64q",
    "1272": "@nyknicks They better keep pushing otherwise they will blow it",
    "1273": "@nyknicks They still gonna lose. Y’all please don’t get y’all’s hopes up",
    "1274": "@nyknicks Begging y’all not to blow this one https://t.co/aMui1TJFB6",
    "1275": "@anstahh_ @KnicksMSGN @RjBarrett6 @nyknicks Clipper ml at +500 rn",
    "1276": "@LeGOAT99 @nyknicks And they still suck, plus those poverty Knicks are worth more the lakers.",
    "1277": "@nyknicks Can’t wait to see this lead get blow leading to a double digit loss.",
    "1278": "@EpicRacismHater @nyknicks An opponent should tweet this and the Knicks would do good but they won't",
    "1279": "The @nyknicks looked unstoppable heading into the break 😤\n\nHalftime:\nKnicks 59-40 Clippers\n\nCan the @LAClippers make a comeback in this one? 🤔\n\nFind out LIVE on @VootSelect and @OfficialJioTV! 📺\n\n#NBA75 #NBAonVootSelect #NBAonJioTV https://t.co/POYBAVLyEr",
    "1280": "Do you guys ever wonder if @RjBarrett6 knows how much the @nyknicks fans love him? Someone should tell him. That kid is special. So happy he is a Knick\n#NewYorkForever",
    "1281": "@NBA @nyknicks Yea they are losing",
    "1282": "@real_law_4H @nyknicks The ShitShow Lakers got a better Record than the poverty knicks 😂🙏",
    "1283": "New York Knicks: WE HERE\n\nAlso New York Knicks: Second half collapse https://t.co/6DisLl11VP",
    "1284": "@nyknicks Alright! Let’s see how we blow this one!",
    "1285": "10 for IQ.\n18 for RJ.\n\n@nyknicks rolling at halftime on ESPN https://t.co/sttbzkNqGs",
    "1286": "@MechaNielsen @nyknicks Sadly nope 😮‍💨",
    "1287": "@KayD21__ @nyknicks Facts",
    "1288": "@nyknicks Don’t blow it pls",
    "1289": "@TheCodestarr @nyknicks Why do we want this win? I want Ivey and an RJ 30 piece",
    "1290": "@SheeeedySheed @nyknicks Luke Kennard finna go Curry mode 😂",
    "1291": "@LeGOAT99 @nyknicks Why are the shit show lakers?",
    "1292": "@nyknicks Those IQ/Deuce/RJ/Cam/Sims minutes were the most fun I’ve had watching Knicks basketball all season",
    "1293": "@BuiltDiffy @nyknicks Adam silver never gonna give us that first pick",
    "1294": "@KnicksMSGN @RjBarrett6 @nyknicks we still finding a way to lose this game",
    "1295": "@RowanABarrett @AlcantaraRBW @nyknicks Well God damn",
    "1296": "@nyknicks We will blow this",
    "1297": "@nyknicks 3rd quarter Knicks inbound",
    "1298": "@nyknicks Yalll better not lose",
    "1299": "@BCusterTV @nyknicks @LAClippers @MarkJackson13 @espn Doing a great job calling my two favorite sports - 🥊 &amp; 🏀. 👏✊",
    "1300": "@nyknicks Keep the lead",
    "1301": "@nyknicks Just don’t play Fournier pls and we win",
    "1302": "@nyknicks Not getting my hopes up",
    "1303": "@nyknicks This ain’t how we supposed to tank dawg",
    "1304": "@nyknicks clippers ML live.. NOW!",
    "1305": "@nyknicks Someone on the clippers about to drop 30 in the second half",
    "1306": "@nyknicks Why is Randle on your team",
    "1307": "@nyknicks Can't wait till we blow this lead",
    "1308": "@TheCodestarr @nyknicks Lmfaoo I’ll be so sad but not surprised at all😭😭",
    "1309": "@nyknicks Trade Randle and give him the fucking keys",
    "1310": "@hhpthebook @Bknicks @nyknicks I’m not, I’m cautioning the other person said they are better when Randle is off the floor. I assume they used either +/- or on/off, and I’m just saying take those stats with a grain of salt. As for playing young players, I agree not much reason not to.",
    "1311": "@LAClippers getting outclassed by the @nyknicks 60-49 at the half. Knicks should've won vs Phx the other night and were ahead in their last 2 games vs Philly. They're playing better and have a true #1 in RJ Barrett. Clips have to take the ball out of RJ's hands to have a shot.",
    "1312": "@nyknicks Feel like I’ve seen this movie before",
    "1313": "@nyknicks Julius Randle actually made shots 😭 thought he was going for an 0fer fr",
    "1314": "@nyknicks I love Rj Barrett he’s my world",
    "1315": "@nyknicks Better not be another L",
    "1316": "@nyknicks get ready for second half knicks",
    "1317": "@nyknicks There’s no way we blow this lead, right? 😂😭",
    "1318": "@nyknicks I swear they better not blow this lead with another meltdown. If they do they shouldn't be allowed back in New York",
    "1319": "Way to go @nyknicks. The young one's came to play today @ESPNNBA #Knicks",
    "1320": "@nyknicks Don’t play randle for the rest of the game",
    "1321": "@nyknicks I’m going to bed now. I sure hope I don’t wake up to another epic collapse",
    "1322": "Make me whole tonight @nyknicks that’s all I want please, for the love of God, Roxanne, Mary, and Joseph 🙏🏾🙏🏾🙏🏾",
    "1323": "@nyknicks This is not unreasonable to say, but this is TOO CLOSE of a game to feel comfortable. The real Knicks fans know this. 😐",
    "1324": "@nyknicks Incoming Collapse!",
    "1325": "@nyknicks Incoming a choke sadly 😭",
    "1326": "@nyknicks If you blow this fucking game",
    "1327": "@nyknicks Someone wake Julius up",
    "1328": "@nyknicks STAR J",
    "1329": "@nyknicks 0% chance we keep this lead",
    "1330": "@nyknicks Good half guys keep it up",
    "1331": "@nyknicks He’s him",
    "1332": "@nyknicks Fournier playing defense?",
    "1333": "@nyknicks I think I speak for all Knicks fans when I say we should extend Thibs!",
    "1334": "@nyknicks He’s a superstar in the making. Reminder folks, 21 years old. https://t.co/8v5cMP0g0H",
    "1335": "@nyknicks Fournier playing defense? Oh dear heavens 😱",
    "1336": "New York Knicks have just one turnover tonight.",
    "1337": "@sny_knicks @nyknicks I fucking swear to God if you blow this game",
    "1338": "What’s the odds of the New York Knicks blowing another double digit league at halftime? 59-40",
    "1339": "Keep pushing. https://t.co/BmJGraPcK2",
    "1340": "@nyknicks why are you guys always on National Television",
    "1341": "This RJ Barrett team…take over my boy!! #KnicksTape @nyknicks",
    "1342": "RJ Barrett cannot be stopped.\n\n🎥 @nyknicks https://t.co/NAJJEvwphL",
    "1343": "@nyknicks DO NOT blow this lead",
    "1344": "@nyknicks Damn , another foul 2 free throws for the Knicks",
    "1345": "@nyknicks He like dat https://t.co/Oz1HcW7avT",
    "1346": "@nyknicks I swear if we lose this game 😭😭",
    "1347": "@nyknicks 30 plus on coming 🔥🔥🔥🔥",
    "1348": "@nyknicks Him and chet are gonna be crazy next season",
    "1349": "STARTS ON DEFENSE https://t.co/gLtgGjJQOX",
    "1350": "Are the @nyknicks going to #knick or #win this one?",
    "1351": "16 points in the second quarter alone.\n\n18 at the half.\n\nRJ is on fire. https://t.co/hxfIn9W3tk",
    "1352": "Like there should be absolutely no way that the @nyknicks lose this game but yet I’m still confident that it happens… This is where we are at this point in time in the season unfortunately",
    "1353": "@RjBarrett6 ALLLLL FUUUUUCCCKING DAY!!!!!!!!! @nyknicks",
    "1354": "@jojofashow @nyknicks If you watching the game this what I'm talking about one game good then 2 games bad.. RJ is inconsistent",
    "1355": "Arriba 19 al HT, por favor cabrones @nyknicks",
    "1356": "If it’s a day that ends in Y, there’s a good chance Adam Silver is putting the sub .400 New York Knicks on national TV.",
    "1357": "Getting blown off the court by the pathetic New York Knicks 🤦🏾‍♂️🤦🏾‍♂️🤦🏾‍♂️ I hope that dancing against the Lakers was worth it",
    "1358": "Great half @nyknicks",
    "1359": "@nyknicks better win!!!!!!!",
    "1360": "@nyknicks To the baha. Baha Barrett",
    "1361": "Clippers shot 32% in the first half. Knicks shot 41%. New York holds a 21-5 free throw advantage. The 16 free throw difference all came in the second quarter as the Knicks outshot the Clippers, 16-0.",
    "1362": "@nyknicks push the player and get the bucket and foul.  Damn.  @nba we going back to #Badboy days of the Pistons?  @LAClippers",
    "1363": "first time investor (@ https://t.co/XyPg78171m Arena - @staplescenter for @LAClippers @nyknicks in Los Angeles, CA) https://t.co/vV5grMOLVy",
    "1364": "The @nyknicks are just bullying the @LAClippers right now.  More physical and dominating the Clippers on the glass.  Knicks up 19 on the road at halftime.",
    "1365": "@BCusterTV @nyknicks @LAClippers @MarkJackson13 @espn whose idea was this to put you on play-by-play?",
    "1366": "@nyknicks The mans name is Jericho. #enough said",
    "1367": "@nyknicks Mitch aint no b!tch. Tough",
    "1368": "Finish the job! @nyknicks",
    "1369": "@nyknicks End of séries for everyone buts cmon knick..",
    "1370": "ALERT: New high roller bet posted!\nA bet has been placed for $10,022.75 on Los Angeles Clippers - New York Knicks to win $19,043.23.\nTo view this bet or copy it https://t.co/PFpwKJDgLE https://t.co/PHoR5jYvhx",
    "1371": "Los Angeles Clippers - New York Knicks\n\nBet slip link: https://t.co/NtmbEJE9SZ https://t.co/WnneT9J0Uf",
    "1372": "@nyknicks Excuse me!!",
    "1373": "@nyknicks Knicks getting bullied out of the play in \n\n https://t.co/MHZLUql0T2",
    "1374": "@nyknicks Chill out pr team 😂",
    "1375": "I am currently watching ESPN where Julius Randle and his New York Knicks are playing the Los Angeles Clippers without  Kawhi Leonard and Paul George. The Knicks trying to find their way after losing their last 7 games.",
    "1376": "@nyknicks To the cup",
    "1377": "@nyknicks Calm down, we got the end",
    "1378": "@nyknicks Get Fournier off the court please",
    "1379": "RJ IS FEASTING\n\n🎥 @nyknicks https://t.co/0sbcHi3BDq",
    "1380": "@nyknicks julius make a bucket challenge",
    "1381": "@nyknicks Future warrior",
    "1382": "RJ BULLY BALL https://t.co/c4Wn3M6Hhn",
    "1383": "@Eliss1629 @nyknicks He is a Narcissist‼️ Stop supporting someone who treats people like 💩",
    "1384": "To avoid being frustrated all the time with my @nyknicks, my new hobby when watching the game is looking at which J @qdotgrimes is rocking.\n\nIn the last 3, he had the AJ 4 Union, AJ 3 A Ma Maniere and today, I think it's the AJ 3 Cardinal.\n\nWay to go, Q!\n\n#NewYorkForever",
    "1385": "Y’all lucky the bitches are sleeping @nyknicks",
    "1386": "@KnicksMSGN @RjBarrett6 @deucemcb11 @IQ_GodSon @nyknicks Big differences w/ so call vets back in. Clippers starting to close the lead.",
    "1387": "@DrSalt_PhD He does not play for the New York Knicks",
    "1388": "put a free throw related bonus in Mitch contract please @nyknicks",
    "1389": "@nyknicks  @J30_RANDLE STOP Jumping for No Reason!",
    "1390": "With 2:36 to go in the second quarter, the New York Knicks lead the LA Clippers, 48-37.",
    "1391": "@KnicksMSGN @RjBarrett6 @deucemcb11 @IQ_GodSon @nyknicks Why take them out",
    "1392": "@nyknicks Randall comes and the pace slower,  ball movement gone, defense leaves.",
    "1393": "@AlcantaraRBW @nyknicks youre not wrong",
    "1394": "Is it me or does @J30_RANDLE make the @nyknicks worse when his on the floor? @CardPurchaser",
    "1395": "@BCusterTV @nyknicks @LAClippers @MarkJackson13 @espn BCust in the house-Love it!!",
    "1396": ".@nyknicks plz choke that would be entertaining for the TL",
    "1397": "@delio_monegro @nyknicks idk man mitch is a beast",
    "1398": "@nyknicks STOP promoting a Narcissist‼️🤡",
    "1399": "@nyknicks Who is the photographer tonight?? This some heat 🔥",
    "1400": "@JayMoneyIsMoney The dogs can’t cover! We got 1 more left ! Pls don’t choke @nyknicks",
    "1401": "New York Knicks @ Los Angeles Clippers (10:00 PM ET)\nSelection: Los Angeles Clippers -4.5",
    "1402": "@DannyD15_ @WickedKnick @nyknicks Who airballed a wide open runner earlier too 😂",
    "1403": "Randle comes back and boom TO right away! We got a 17 point lead why bring anyone in the guys on the floor are killing it? I thought minutes were earned and merit based Thibs wtf you fucking hypocrite! #firethibs @NY_KnicksPR @nyknicks",
    "1404": "@trashcanbang @nyknicks it’s been RJ for a solid two months",
    "1405": "@nyknicks @IQ_GodSon STOP promoting this Narcissist‼️🤡",
    "1406": "Worst NBA bet tonight! All the dogs can’t cover! Got 1 more dog left! Go @nyknicks",
    "1407": "@dan_ny_b @nyknicks @RjBarrett6 RJ is THAT guy and shouldve always been THAT guy !!!",
    "1408": "@nyknicks I can’t wait to see how we fuck this up",
    "1409": "@WickedKnick @nyknicks Look immediately for Fournier 😂 clown coach",
    "1410": "@Toure It was AWESOME! You're going to LOVE IT! Reggie Miller was like kryptonite to the New York Knicks! 😂\nhttps://t.co/5zUog6dLLO",
    "1411": "@trashcanbang @nyknicks Trust 💯🔥",
    "1412": "@nyknicks The whole body language just switched bruh",
    "1413": "@nyknicks You gotta trade Randle as fast as possible literally take anything for him",
    "1414": "Every @nyknicks fan has been pleading for Deuce, and the young guys, to get some significant minutes. We are playing some beautiful ball right now. Thankful to see Thibs overcome his stubbornness",
    "1415": "@nyknicks Thibs bro…..",
    "1416": "@nyknicks No way Thibs takes Cam out cuz of a missed dunk 🤦🏾‍♂️🤦🏾‍♂️🤦🏾‍♂️",
    "1417": "@nyknicks still gonna blow it",
    "1418": "@throwballoons @NYTankingSZN @JPal319 @lightstofbodies @CLBFan6 @SWelch05 @nyknicks Frankie in the being considerate contest https://t.co/Kh62bHgQG9",
    "1419": "RJ moovin' &amp; groovin'.\n\nHe's up to 10 PTS. https://t.co/r7S73gEkms",
    "1420": "@nyknicks Here we go…",
    "1421": "Need @nyknicks to invent a way to lose this too.",
    "1422": "@nyknicks @IQ_GodSon Why do you all promote a Narcissist⁉️🤡",
    "1423": "With 5:39 to go in the second quarter, the New York Knicks lead the LA Clippers, 41-27.",
    "1424": "@nyknicks Hey, let's see how many points the Knicks can lead by before they go into full crumble mode and lose.",
    "1425": "@nyknicks Thibs finally playing the kids and they are playing DEFENSE",
    "1426": "@nyknicks Lol there goes the lead",
    "1427": "Definitely a winnable game! They play with fire! @nyknicks #ESPN #JohnStarks #PatrickEwing",
    "1428": "The New York fuckin Knicks are you kidding me lmaooo",
    "1429": "@realsxucey @nyknicks Who’s it gonna be next week?",
    "1430": "@nyknicks How are we going to mess this one up?",
    "1431": "@trashcanbang @nyknicks It’s this guy https://t.co/MDtVmev2Xg",
    "1432": "@nyknicks Send randle to ukraine",
    "1433": "@nyknicks Extend him",
    "1434": "The @nyknicks are running the show in LA! https://t.co/TqRf5q1hrp",
    "1435": "@TimBontemps Me, a @nyknicks and @NYRangers fan in Jersey stuck with @Xfinity https://t.co/VcrzC7YW97",
    "1436": "@nyknicks @rudedogreyes Mixed boy can jump. So there we go white boy you can too;)",
    "1437": "ALERT: New high roller bet posted!\nA bet has been placed for $5077 on Los Angeles Clippers - New York Knicks to win $7,209.34.\nTo view this bet or copy it https://t.co/Shg69CM3fJ https://t.co/c6xdslWbfL",
    "1438": "@nyknicks Are A Young PG Away From Being Great",
    "1439": "@nyknicks I'm ready for Randle, Fournier, and Burks to come in, ruin our momentum, and blow this lead!",
    "1440": "@nyknicks Imagine what’s happens when you play young guys who are hungry and can actually play defense",
    "1441": "new york knicks $999 trillion",
    "1442": "Going to bed…dreaming of a @nyknicks W \n#bedtime #easternstandardtime \n#NewYorkForever",
    "1443": "@DanielJonesMVP @nyknicks Nah man, I decided today that losing is best so they’re gonna win",
    "1444": "@nyknicks Still gonna lose",
    "1445": "These are the @nyknicks the fans like watching. Definitely better with @J30_RANDLE on the bench #Knicks #NewYorkForever #meccamafia #knicks_fever007",
    "1446": "@trashcanbang @nyknicks Its been like this for a month we've been consistent",
    "1447": "Mitch pushes the run to 12-0 ‼️ https://t.co/297JuTMtqG",
    "1448": "2 steps forward and go 10 steps back. If the Clippers are not gonna come out and play and want to get blown out by the pathetic New York Knicks, I’m wasting my time then 🤦🏾‍♂️🤦🏾‍♂️🤦🏾‍♂️🤦🏾‍♂️ https://t.co/RN3Kqkv0si",
    "1449": "@DanielJonesMVP @nyknicks Same here",
    "1450": "@nyknicks Right hand RJ we love to see it my boy",
    "1451": "Look out below. https://t.co/Ufmvou5gTZ",
    "1452": "@Burks2Hell @nyknicks Y’all pick a new captain every week",
    "1453": "@LAClippers @nyknicks ya'll really letting Vegas control your players the best players on each team 0 in the second Qtr wow. We know who dicks ya'll sucking",
    "1454": "I'm forced to watch the @nyknicks on @espn because my @KnicksMSGN feed looks like this...\n\nThank you @Ask_Spectrum @GetSpectrum https://t.co/w7DnJnCmEd",
    "1455": "@nyknicks I’m ready for the collapse",
    "1456": "@nyknicks You can tweet this out again for the next month and I’ll retweet every time",
    "1457": "R. J. BARRETT.\n\n🎥 @nyknicks https://t.co/H7hNBB6m6B",
    "1458": "@nyknicks @IQ_GodSon Can McBride please take the ball out of IQ hands... two fast break plays were IQ had people open and he force up a bad shot. The ball didn't even touch any other Knick hand. IQ is not a PG.",
    "1459": "@nyknicks maybe keep the lead this time",
    "1460": "@nyknicks Thibs watching the young core thrive https://t.co/qDqzM7wfeU",
    "1461": "@nyknicks Keep the kids in 😌😌😌",
    "1462": "@ARC818 Let the kids play #knicks @knicks_post @nyknicks",
    "1463": "@nyknicks OnLy GoEs LeFt",
    "1464": "@nyknicks The lead is gonna go downhill",
    "1465": "RJ goin' downhill. https://t.co/0xyA9imO6V",
    "1466": "@trashcanbang @nyknicks This man is the new face of the Knicks https://t.co/GlBQu3s2id",
    "1467": "extend #23 @nyknicks",
    "1468": "I hope Thibs allow these group to continue to play and don't bring back Randle and Fournier at the 6th minute mark.\n\nLet's go, @nyknicks!\n\n#NewYorkForever",
    "1469": "@nyknicks Jericho Simms is a better player than Mitchell Robinson..",
    "1470": "This your best player @nyknicks? https://t.co/BaHUM7juDM",
    "1471": "@NYTankingSZN @JPal319 @lightstofbodies @CLBFan6 @SWelch05 @nyknicks he’s so considerate",
    "1472": "@nyknicks Yea Chris Jericho lost at Revolution",
    "1473": "LET THE KIDS PLAY @nyknicks",
    "1474": "@JPal319 @throwballoons @lightstofbodies @CLBFan6 @SWelch05 @nyknicks vouch, this was Frankie walking the blind girl to school yesterday https://t.co/7b76Ym0cW1",
    "1475": "@nyknicks Defense is noticeably better without Randle, Burks, and Fournier. They’re long, they can switch everything, and there’s no lack of effort or athleticism. \n\nAlso, the fact that Sims was sitting behind Noel and Taj is ridiculous. Taj couldn’t jump that high off a trampoline.",
    "1476": "@Iukeswanson @nyknicks No one's forcing u to watch this shit team",
    "1477": "@nyknicks @RjBarrett6 major props to whoever took this photo. the reflection, the players, the smoke feel… perfect",
    "1478": "With 8:53 to go in the second quarter, the New York Knicks lead the LA Clippers, 37-22.",
    "1479": "@lightstofbodies @throwballoons @nyknicks It’s me",
    "1480": "The @nyknicks have 2 lob threats 👀 https://t.co/rAuLOZUQew",
    "1481": "@KnicksPrime @nyknicks look at that last fast break... IQ had two open guys and forced that shot which was a miss. He is not a PG.",
    "1482": "@CLBFan6 @throwballoons @lightstofbodies @JPal319 @SWelch05 @nyknicks Sup U https://t.co/PIWLouTLLL",
    "1483": "@gritsngrams @nyknicks Inspiring game by the young guys leading to Fournier closing the game chucking up all the shots?🤷🏻‍♂️",
    "1484": "@throwballoons @lightstofbodies @JPal319 @CLBFan6 @nyknicks Does a built in set of pillows get me anything?",
    "1485": "@nyknicks He’s very raw defensively but if he could develop he’s gonna be a fucking monster",
    "1486": "@nyknicks MONSTER",
    "1487": "@JaDnice18 @nyknicks Agreed, would love to see McBride be main ball handler",
    "1488": "@JPal319 @throwballoons @lightstofbodies @SWelch05 @nyknicks LMFAOOOOO",
    "1489": "@throwballoons @lightstofbodies @CLBFan6 @SWelch05 @nyknicks Frankie is Slenderman I was lying just now",
    "1490": "@throwballoons @lightstofbodies @JPal319 @SWelch05 @nyknicks Mfs like me got the meats pause",
    "1491": "@KnicksPrime @nyknicks Same here but McBride should be running the point and have IQ play his natural roll. Thibs still being Thibs.",
    "1492": "@lightstofbodies @JPal319 @CLBFan6 @SWelch05 @nyknicks she likes em tall and scrawny",
    "1493": "@lightstofbodies @JPal319 @SWelch05 @throwballoons @nyknicks Give me steroids and 6 months, that’ll be easy to attain",
    "1494": "@nyknicks they gonna post a missed ja dunk instead of THAT",
    "1495": "@nyknicks @23savage____ We play much better without that nigga randle https://t.co/hKMP6LBpuM",
    "1496": "@nyknicks He’s a bunny 🐰",
    "1497": "Yes @RjBarrett6 I see you using your right hand!!!! @nyknicks",
    "1498": "@nyknicks IS BETTER THAN RANDLE",
    "1499": "@throwballoons @CLBFan6 @SWelch05 @lightstofbodies @nyknicks how old is she?",
    "1500": "@nyknicks I love this lineup we have out here",
    "1501": "Ok sims I see you!!!! @nyknicks",
    "1502": "@nyknicks That was cool",
    "1503": "@CLBFan6 @SWelch05 @throwballoons @lightstofbodies @nyknicks This is what Frankie looks like Holl-E https://t.co/2eYEpNQo0y",
    "1504": "#NYKvsLAC @nyknicks maybe you should bring back @davehopla",
    "1505": "@CLBFan6 @SWelch05 @lightstofbodies @nyknicks she is neither of your ages",
    "1506": "@SWelch05 @throwballoons @lightstofbodies @nyknicks She’s my age old lady",
    "1507": "@KnicksTape518 @nyknicks I'm liking the 0 for 7 start from randle but I think we could get a little more creative",
    "1508": "@nyknicks @IQ_GodSon Send Julius Randle to the Beijing Ducks!",
    "1509": "@CLBFan6 @throwballoons @lightstofbodies @nyknicks Go finish your essay babe. The adults are in the room now.",
    "1510": "I can’t believe I am up for this @nyknicks game! Don’t disappointed me……Lol",
    "1511": "@nyknicks Stop ignoring us we all watching the same game https://t.co/uRt9mhoswt",
    "1512": "@nyknicks @IQ_GodSon I cant stand Randle's style of play. Turnover machine, he looks like he has no plan when he drives and just ends up doing a 360 jump pass. Shot selection is horrible. Why do we play him like he is all that good???",
    "1513": "@mybrother81 @SKB1ER @hhpthebook @nyknicks @spidadmitchell Like @spidadmitchell",
    "1514": "Would really love to see the @nyknicks in the playoffs going H.A.M., at the least once again in life. 🗽🏀 https://t.co/vV9QSvEINt",
    "1515": "@throwballoons @CLBFan6 @SWelch05 @lightstofbodies @nyknicks The Dion Waiters 0-9 quote",
    "1516": "@throwballoons @SWelch05 @lightstofbodies @nyknicks This is Serena Williams losing in the first round to the worst opponent and she points to the heavens",
    "1517": "Obi woukd atleast produce offensive movement!! Lord have mercy Thibs is too dedicated to Randle. Won’t sit him if he turned into a dog! #KNICKS @nyknicks #NYK #NYKvsLAC #NBA",
    "1518": "@CLBFan6 @SWelch05 @lightstofbodies @nyknicks you’re going to have to translate this to basketball or tennis for holly to understand",
    "1519": "Knicks 25, Clippers 22 | End 1 | \n\nNew York shoots 10 for 27. \nThe Clippers shoot 9 for 22. \nTerance Mann is LA's leading scorer, with 7.",
    "1520": "*Turns the game on to Randle dribbling the ball out of bounds* @nyknicks https://t.co/fY5zXenBeT",
    "1521": "@nyknicks @IQ_GodSon How isn’t that a 3?",
    "1522": "@throwballoons @lightstofbodies @CLBFan6 @nyknicks Respect Franklin?",
    "1523": "@SWelch05 @lightstofbodies @throwballoons @nyknicks You rn lol https://t.co/GmFtqfCLDO",
    "1524": "Calling @nyknicks vs @LAClippers  with the great @MarkJackson13 🏀 on @espn https://t.co/qSa9NPpvv7",
    "1525": "@PlayoffBoundNYK @nyknicks @IQ_GodSon we traded for him already",
    "1526": "@CLBFan6 @lightstofbodies @throwballoons @nyknicks Cats are superior. We love cats. All cats. The best.",
    "1527": "@nyknicks @IQ_GodSon How was this not a 3?",
    "1528": "@JPal319 @throwballoons @CLBFan6 @nyknicks who would have known that Franklin has this soft side",
    "1529": "@lightstofbodies @throwballoons @nyknicks I save all types of cats, I’m a nice guy.",
    "1530": "@lightstofbodies @throwballoons @CLBFan6 @nyknicks Frankie is a feline enthusiast.",
    "1531": "HE BANKED IT IN! ⚡\n\n🎥 @nyknicks https://t.co/5MS9AyFDv0",
    "1532": "@mybrother81 @SKB1ER @hhpthebook @nyknicks @spidadmitchell RJ is not a point/shooting guard either. We will be in this situation until we get a bonofied pg who can distribute, control the pace of the game and create their own shot &amp; as talented as RJ is that’s not his game",
    "1533": "@nyknicks practice freethrows in our long off season plz :)",
    "1534": "@NafrmdaV @nyknicks @IQ_GodSon Yo you got me rolling rn",
    "1535": "@nyknicks @23savage____ ..and then, there’s the 4th quarter..#NewYorkForever👻 https://t.co/23RfTsWFiQ",
    "1536": "@nyknicks @IQ_GodSon I wonder how bad yall will choke the game today",
    "1537": "@nyknicks @IQ_GodSon Beijing and Shanghai are looking for a 3rd string PF",
    "1538": "@nyknicks @IQ_GodSon Bench that nigga rn pls https://t.co/Z4uMdn0BnK",
    "1539": "At a @nyknicks game in the 1st time in a long time. I got a theory. I’ll share later. #KnicksTape",
    "1540": "@nyknicks @IQ_GodSon why is julius not benched",
    "1541": "BANK'S OPEN @IQ_GodSon https://t.co/8rrNpoVBfi",
    "1542": "@SNorma11 @nyknicks every one.. Mills, Donnie, Zeke, Phil came to MSG with an open door policy and spoke regularly only to get skewered.  grunwald was a guy who spoke rarely IIRC\n\nill be waiting to hear from Leon in the offseason until then its sit tight and hear from The coach.",
    "1543": "@nyknicks @23savage____ Y does thibbs takes out the hot guys dude a bad coach",
    "1544": "@nyknicks @23savage____ Quickly in his bag omg",
    "1545": "@nyknicks @RjBarrett6 hang it in the louvre",
    "1546": "@nyknicks @23savage____ Give that man the bag 💰",
    "1547": "@throwballoons @lightstofbodies @nyknicks You are very welcome alan!",
    "1548": "Too strong, @23savage____. https://t.co/mornis1dft",
    "1549": "@CLBFan6 @lightstofbodies @nyknicks Thanks for saving all of those abandoned kittens!!",
    "1550": "@nyknicks Quickity quick quickly",
    "1551": "@nyknicks Get Evan Fournier off the court. He’s so inconsistent for what he’s paid",
    "1552": "@Knicks4lyfe1 @nyknicks @RjBarrett6 Having a good team would be art. I’m not getting exciting about random plays anymore. Done with that crap. 20 years of crap play.",
    "1553": "@JPal319 @lightstofbodies @throwballoons @nyknicks No problem brother man.",
    "1554": "@nyknicks @IQ_GodSon Until we blow the lead in the 4th",
    "1555": "@CLBFan6 @lightstofbodies @throwballoons @nyknicks Thanks for letting me borrow the Lamborghini last week!",
    "1556": "ENERGY \n\n⚡️ @IQ_GodSon https://t.co/pCfh5PhoRu",
    "1557": "@dereck2x @nyknicks To barret is a stud we need another stud and role players and we have a legitimate shot",
    "1558": "@nyknicks start him over Burks",
    "1559": "@nyknicks Start him",
    "1560": "@nyknicks @RjBarrett6 My god this picture is Art 🖼",
    "1561": "Step back.\n\nKnock down. https://t.co/8HGgRSvKgn"
}