{
    "0": "@DetroitPistons @Kia And it’s Detroit Playas, come on Pistons social media person, step the game up…",
    "1": "@smh24yt_ @DetroitPistons @Kia yeah you’re right cade is top tier buns",
    "2": "Halloween Hoops! Join us for @BrooklynNets v @DetroitPistons on @YESNetwork #NETSonYES https://t.co/RJSidSIhzZ",
    "3": "@DetroitPistons @Kia No Cade don’t care",
    "4": "@CadePistons @DetroitPistons @Kia i agree",
    "5": "@NFLandNBAexpert @DetroitPistons @Kia All them more know than",
    "6": "@DetroitPistons @Kia Somebody I talked with is gonna be happy Hami is starting 😂😂😂 but they blocked me so oh well…",
    "7": "#NBA (Temporada Regular) - Encerrados:\n\nWashington Wizards 115 x 112 Boston Celtics \nDetroit Pistons 110 x 103 Orlando Magic \nNew Orleans Pelicans 117 x 123 New York Knicks \nIndiana Pacers 94 x 97 Toronto Raptors \nPhiladelphia 76ers 122 x 94 Atlanta Hawks",
    "8": "@smh24yt_ @DetroitPistons @Kia he’s not playing a back to back",
    "9": "@HoseinKyleBP @DetroitPistons @Kia maybe to make up for not playing at all",
    "10": "@DetroitPistons @Kia Follow me Pistons please 🥺",
    "11": "@DetroitPistons @Kia Cade playing at all?",
    "12": "@DetroitPistons @Kia why is hami starting after not playing at all?",
    "13": "My Detroit Players 🔥\n\n@Kia | #Pistons https://t.co/vkMcv9SNkv",
    "14": "Detroit Pistons Starters:\n\nKillian Hayes\nHamidou Diallo\nSaddiq Bey\nJerami Grant\nIsaiah Stewart\n\nPlayers out:\nCade Cunningham\nIsaiah Livers\nChris Smith\n#Pistons #NBA #NBATwitter #NBA75",
    "15": "@JLEdwardsIII Why was it necessary to move the G league team to Detroit? You can say proximity but there's tons of teams whose G league team is not in the same city. As a WM native it really stinks not having a somewhat direct link to the Pistons within 2.5 hrs.",
    "16": "🏀 Brooklyn Nets vs Detroit Pistons\n🏆 NBA\n🗓 31/oct.\n⏰ 20:30\n📺 NBA LEAGUE PASS",
    "17": "@JLEdwardsIII Probably not a Pistons mailbag Q, but best restaurant recommendations in Downtown Detroit?? I keep finding myself going to the same places every time I make the trip.",
    "18": "Fright Night in Brooklyn. \n\n📺 | @BallySportsDET https://t.co/FM8I9l9vE5",
    "19": "@DetroitPistons this crap that you guys are pulling with Cunningham is a joke if he can play then play him",
    "20": "NBA Live Scores: Game open! Follow to get updates as MIL hosts UTA.  @Bucks @utahjazz #NBAGame open! Follow to get updates as BKN hosts DET.  @BrooklynNets @DetroitPistons #NBA",
    "21": "@DetroitPistons @MichelobULTRA No Cade after 1 game is pathetic",
    "22": "NBA Live Game Thread: Brooklyn Nets vs. Detroit Pistons, 7:30 PM EST https://t.co/y62FWSZGJa https://t.co/BZ9UwFXwE3",
    "23": "Hello Brooklyn! 🌃 \n\n#ULTRADrip | @MichelobULTRA",
    "24": "WLCM BIG SHOT\n- https://t.co/CqaNuTAWzA\n- #chaunceybillups #mrbigshot #detroit #detroitpistons #pistons #detroitmi #michigan #michigansports #downtowndetroit #detroitart https://t.co/30U1KeQTYq",
    "25": "Watching the Detroit Pistons vs the Brooklyn Nets tonight. #KevinDurant #LaMarcusAldridge #BlakeGriffin #JamesHarden https://t.co/xIWTpOV3Hk",
    "26": "@DetroitPistons @HenryFordNews Guess I’m not watching the game tonight then",
    "27": "Ok, here’s my television watching choices for tonight. \n&gt; cowboys vs Minnesota Vikings \n&gt; World Series \n&gt; Detroit pistons vs Brooklyn nets.",
    "28": "@tonydombrowski @DetroitPistons I also think he was surprised about how open he was he hesitated for a minute did you notice that?",
    "29": "@tonydombrowski @DetroitPistons Terrific signing",
    "30": "#Pistons have covered the spread in 3 straight games when facing #NetsWorld. Detroit has been given a 52.4% chance to cover a +12-point spread \n\n#NBA #NBATwitter",
    "31": "Today's NBA Picks: 7:40 PM ET - Detroit Pistons vs. Brooklyn Nets - 21 PICKS AVAILABLE: https://t.co/3MioQPges5 #nba",
    "32": "@answersfrommen @balldontstop @WashWizards it happens with every superstar. blake griffin joined the nets and played a much lesser role than he did on the pistons when he was the star. the exact opposite happened with jerami grant, went from role player next to jokic and murray to no.1 guy in detroit",
    "33": "@DetroitPistons This Guy with y'all young Core will be something special 1 Day https://t.co/sSpS4wV5BT",
    "34": "@tonydombrowski @GavinRhoades @DetroitPistons Did I see you chugging a beer on the big screen Mr. D?",
    "35": "🏀n my way🚊t🏀 2 game ⛹🏽@DetroitPistons Vs @BrooklynNets at 📍@barclayscenter \n#NBATwitter \n#nba",
    "36": "@tonydombrowski @GavinRhoades @DetroitPistons Hang it in the Louvre",
    "37": "I'm at @BarclaysCenter for @detroitpistons vs @BrooklynNets in Brooklyn, NY https://t.co/5qRJ27MgUa",
    "38": "@DetroitPistons please let @CadeCunningham_ play tonight. Thanks https://t.co/FZe5XUDVlN",
    "39": "Detroit Pistons: Oh, the bench is back (via @Realstuartl)\n#Pistons #NBA \n#NBA75\nhttps://t.co/SHsHI3fJzW",
    "40": "Yahoo! Sports:  Detroit Pistons vs. Brooklyn Nets: How to watch Detroit go for 2 wins in a row https://t.co/LxuVGgnuiy",
    "41": "I’d like to apologize to the @DetroitPistons, I do not think I will make the game tonight. Went too hard compensating for that @Lions loss today. I will take no questions",
    "42": "@DetroitPistons @HenryFordNews Livers coming soon https://t.co/HYbR9lmtzu",
    "43": "“Defensively they’re going to be really tough.”\n\n⁃Steve Nash on the Detroit Pistons.",
    "44": "@DetroitPistons @HenryFordNews Follow back Pistons, please",
    "45": "@natepoulos @BallySportsDET @YouTubeTV @DetroitPistons How did you get it to work?",
    "46": "@DetroitPistons @HenryFordNews Lets get the W",
    "47": "@DetroitPistons @HenryFordNews L play Cade",
    "48": "Tonight’s @HenryFordNews injury/status report against the Brooklyn Nets: https://t.co/Qynguh32UR",
    "49": "@tonydombrowski @DetroitPistons I’m surprised nobody is talking about that block he had",
    "50": "Plug your nose for this one!\n\nDetroit Pistons 1Q +4.5 \n\n#Pistons",
    "51": "@wulfalos @DetroitPistons @JeramiGrant @KellyOlynyk @SaddiqBey @j_josh11 Ig scottie pippin, Dennis Rodman don't exist",
    "52": "@kingdj_5297 @BrooklynNets @DetroitPistons @NBA start the game now, help the man",
    "53": "Looking for a value bet?  See if the Detroit Pistons-Brooklyn Nets Predictions and Preview for 10/31/2021 is one in our preview.  No crazy hype just a prediction and preview. #Basketball #Picks https://t.co/MOk9S8yOPQ",
    "54": "@tkhamm @wanderer922 @NBAHistory @DetroitPistons What makes curry “not a real pg”",
    "55": "Detroit Pistons visits Brooklyn Nets Predictions and Preview for 10/31/2021 today.  Who are we taking in this game?  Find out now. #Basketball #Picks https://t.co/MOk9S8yOPQ",
    "56": "@tonydombrowski @DetroitPistons 6th man of the year",
    "57": "@Alfredo96538707 @DetroitPistons @JeramiGrant @KellyOlynyk @SaddiqBey @j_josh11 it does also atleast our rings arent from 1 player",
    "58": "@MotownCade @DetroitPistons That picture is so legendary lol",
    "59": "@_XabdulmalikX_ @NBA @CadeCunningham_ @DetroitPistons @unitedmasters Nah is overrated asf",
    "60": "Another moment from last night where the crowd went absolutely nuts. I still cannot believe Kelly Olynyk did THAT. \n\n#Pistons \n\n(via @DetroitPistons) \n https://t.co/lPoEEtFxxN",
    "61": "Today's NBA Picks: 7:40 PM ET - Detroit Pistons vs. Brooklyn Nets - 18 PICKS AVAILABLE: https://t.co/3MioQPges5 #nba",
    "62": "@DetroitPistons @PistonsHooper @UWM Broke out my Bad Boys tee https://t.co/BJUUaoICRn",
    "63": "Charlotte Hornets - Portland Trail Blazers\nMilwaukee Bucks - Utah Jazz\nBrooklyn Nets - Detroit Pistons\n\nBet slip link: https://t.co/Rozkuo6Nuj https://t.co/FyefTbCIIK",
    "64": "Winners of the week\n@Matt_chu7 - Wisconsin Football\n@Kyle34463 - Detroit Pistons\n@skiponair - Kenneth Walker III\n@TheMizOnAir - Jerron Cage (big man tuddy)",
    "65": "Rep the 3️⃣1️⃣3️⃣ and grab our @RicoIndustries \"313 Respect the Code\" foam finger for $3.13! \n\n🔗: https://t.co/BW3RPSDeFT https://t.co/uWLmIregMl",
    "66": "Our little @DetroitPistons fans are the BEST. HOOPER HALLOWEEN! 👻🎃 #HappyHalloween2021 https://t.co/Yhju2TdD8A",
    "67": "Spartans up to No. 5 in AP Top 25 Poll after beating Michigan, Wolverines drop to No. 9\n\nJoe Veleno scores in season debut, but @MapleLeafs  edge @DetroitRedWings \n\n@DetroitPistons beat @OrlandoMagic in Cunningham’s debut for first win of season\n\n9PM Motor City Riffs @101wrif! https://t.co/pcRfI6AwpQ",
    "68": "@DetroitPistons @LCArena_Detroit @BallySportsDET @KellyOlynyk An absolutely brutal call of a dunk",
    "69": "@DetroitPistons  beat @OrlandoMagic  in Cunningham’s debut for first win of season https://t.co/cd7mqmNn0o",
    "70": "@therealrockhead At least you’ve been to 3 Super Bowls and won 1.\n\nWe have won ONE playoff game in over 60 years. You’d think it’d be laughable by now. That’s what I get for growing up 30 miles from Detroit. I’m a die hard Tiger, Lion &amp; Piston fan. Red Wings are okay, but I don’t care for hockey.",
    "71": "Ngl now is a good time to be a Detroit fan. All three teams: Lions, Tigers, and Pistons are in good stages of their rebuilds and have a pretty good future.",
    "72": "Back BROOKLYN NETS to BEAT Detroit Pistons tonight in the @NBA (Game Starts at 23.40 GMT) #NBA #Basketball",
    "73": "@DetroitPistons @PistonsHooper @UWM I just wore my Cade jersey",
    "74": "The future for Detroit sports looks bright! \n\nPistons got their first win!\n\nGotta trust the Yzerplan with the Redwings! \n\nLions \n\nTigers have built a promising foundation!",
    "75": "Piston fans might be the dumbest fans out of all detroit sports",
    "76": "@jemelehill Detroit Lions suck again duh where's that big mouth from yesterday!!  Pistons suck too!!  Baseball team who cares ONLY thing you got is NCAA football teams eating each Mich and Mich St!!  Go ahead and get that tissue ahahahahah",
    "77": "Anyone dress up as a Pistons player for Halloween today? Or @PistonsHooper? \n\nLet's see what you got! Upload your photos here to show off your #Pistons pride and be featured in an upcoming @UWM Reppin' the D shout out: https://t.co/4F7dYy2bvA https://t.co/V3MHOTwRef",
    "78": "@AnthTheKnee @DetroitPistons @DraftKings @hamidoudiallo I guess this was to good of a point. I got blocked, I thought it was just a fun conversation🤭🤯",
    "79": "@AnthTheKnee @DetroitPistons @DraftKings @hamidoudiallo You don’t think upper management could tell Case to get Hami more minutes and Frank less if that was the case? Weaver brought back Frank and CoJo and signed Trey to even make this a debate in blocking the young fellas…",
    "80": "@FreedumFyghter @DetroitPistons @DraftKings @hamidoudiallo Not management the terrible coach named Dwayne Casey that got fired as leading a team to the finals isn’t very smart. Troy is the reason they signed hami because of how good he is. “Coach’s decision” is the reason he didn’t play. Casey is gone soon",
    "81": "@AnthTheKnee @DetroitPistons @DraftKings @hamidoudiallo And Pistons management I guess 😬 Damn, would you be more upset if I said CoJo and Lyles should get minutes over LightSaben and \nGar-Zilla? Like I hit a nerve on Hami…",
    "82": "@FreedumFyghter @DetroitPistons @DraftKings @hamidoudiallo If you wanna be the 1 guy who thinks that out of every Detroit fan in Michigan then sure lol",
    "83": "@AnthTheKnee @DetroitPistons @DraftKings @hamidoudiallo Ok Kewl. I don’t think any team would play Hami over Frank so🤷🏼‍♂️ I guess agree to disagree. Maybe we should hit up a game to talk it out😂😂😂",
    "84": "The Detroit Lions so ass the Detroit Pistons ass can we just start over",
    "85": "Tonight the Brooklyn Nets (3-3) host the Detroit Pistons (1-4) at 7:30 🕢 @YESNetwork #Brooklyn #Nets #NBA #BrooklynTogether",
    "86": "At Least My Dawg @CadeCunningham_ Ain’t Let Me Down In His @DetroitPistons Season Debut Last Night Being A Playmaker In That Win vs. Orlando! We Going For ROTY!!!",
    "87": "After making debut, Cade Cunningham will miss Detroit Pistons' Sunday road game https://t.co/jKBhyGNnGt",
    "88": "@FreedumFyghter @DetroitPistons @DraftKings @hamidoudiallo You really think Frank Jackson is better than hami you literally have no credibility lmfao",
    "89": "@AnthTheKnee @DetroitPistons @DraftKings @hamidoudiallo Damn you’re a OKC and Detroit fan😳 how many MPG was he averaging with OKC? Even if he’s only on the team for being Jerami’s BFF, sometimes gotta keep your best player happy🤷🏼‍♂️ I don’t know if the expectations preseason could reason firing Case…",
    "90": "Had the pleasure of taking @Walterejones and #BlakeFoster to their first #Pistons game. Big thanks to the @detroitpistons for the tickets and on-court experience! 🤟🏾🏀 #DetroitBasketball #AaronConey #WalterJones #PowerRangers #HustleMatters https://t.co/aa46iT88tO",
    "91": "@freepsports @DetroitPistons Why Not?",
    "92": "As expected, Pistons rookie Cade Cunningham is OUT tonight against Brooklyn. Detroit played last night. It was Cade’s first game after missing all of preseason with an ankle injury.",
    "93": "@AnthTheKnee @DetroitPistons @DraftKings @hamidoudiallo I haven’t brought Cade up, he’s not in the discussion for the bench. I’m saying the bench should be\nLightSaben\nFrank\nJJ\nKelly O\nGarz-illa \nHami would be an eleven man to add intense athleticism while the other team is tired…",
    "94": "I’m giving him his flowers while we still got him. Let’s appreciate the legend George Blaha! @DetroitPistons @JohnnyKaneTV #GOAT #detroit #pistons https://t.co/5eJhw0B68u",
    "95": "No Cade Cunningham tonight. The @DetroitPistons are taking it easy with the 2021 No. 1 overall pick. https://t.co/FuFLZPSV5q",
    "96": "@FreedumFyghter @DetroitPistons @DraftKings @hamidoudiallo Frank is a role player at best. Hami is literally a 10x better player than Frank is and will ever be. Not playing hami over them is what’s going to get Casey fired",
    "97": "@FreedumFyghter @DetroitPistons @DraftKings @hamidoudiallo Last year was completely irrelevant. Last year was supposed to just be a development year for the rookies. Frank Jackson has been in the league long enough and is only on the team because he’s grants friend. You’re nuts if you think Frank would ever take away from Cade lol",
    "98": "@AnthTheKnee @DetroitPistons @DraftKings @hamidoudiallo Hami is a better athlete but Frank got the team back in games last year that made sports radio worried that he would cost us Cade. I wouldn’t be pissed if Frank wasn’t brought back but he did earn it after last year… Trey and CoJo haven’t played bad but it’s not good timing…",
    "99": "@FreedumFyghter @DetroitPistons @DraftKings @hamidoudiallo Hami is 10x better than Frank Jackson. Saben, hami, josh Jackson Kelly O and Garza need to be the bench.",
    "100": "Cade sitting on the b2b, Killian looking like junior varsity… deep sigh @DetroitPistons",
    "101": "PSA: Reminder to everyone that basketball players should play basketball. #DetroitBasketball #detroitpistons #basketball @CadeCunningham_ @DetroitPistons #DetroitUp #Pistons",
    "102": "@AnthTheKnee @DetroitPistons @DraftKings @hamidoudiallo I’m ok w/ Frank resigning but the CoJo and Lyles pickups stalling LightSaben and Garza’s development feels like a massive mistake. Hami unfortunately was always likely gonna be a 3rd string type. Maybe send them to the G-League if they’re not getting min but they don’t have 2way?",
    "103": "Jalen Green will be better long term than Cade Cunningham 💯🤷🏽‍♂️👍🏽 also I haven’t seen Cade play but just a feeling @DetroitPistons @HoustonRockets",
    "104": "It's cool that Detroit has 3 major professional sports teams; the Tigers, Pistons and Red Wings. \n\nPlenty of great history and at least a current trajectory we can all be proud of.",
    "105": "@DetroitPistons @DraftKings @hamidoudiallo Now give him some real minutes smh",
    "106": "@DetroitPistons @DraftKings @hamidoudiallo Cade out tonight with rest 😳😥",
    "107": "@DetroitPistons @DraftKings @hamidoudiallo I wish he played",
    "108": "@DetroitPistons @DraftKings @hamidoudiallo Imagine playing Frank Jackson and Corey Joseph over hami and saben lee smh",
    "109": "@DetroitPistons @DraftKings @hamidoudiallo Tired of Casey not playing him. Dudes a beast and needs to be played",
    "110": "@DetroitPistons He didn’t he play yesterday?",
    "111": "Hami intercepts the pass and slams through the Dunk of the Week 💪 \n\n@DraftKings | @hamidoudiallo https://t.co/22oCyMdGVM",
    "112": "@DetroitPistons Hey social media manager. Tell the front office to play Cade or they gonna come back to no office",
    "113": "This ain't it @DetroitPistons https://t.co/VOv7whYl2Y",
    "114": "Frustrating. Let the kid get 15 minutes, he is 20 @DetroitPistons Ankle will be fine. Now he keeps the poor shooting night taste and has time for it to get in his head. Poorly managed quick turn around imo #Pistons https://t.co/yAw1tXvGzy",
    "115": "@NBA @DetroitPistons Hustle!",
    "116": "Trying again to get the @DetroitPistons to follow me!",
    "117": "Today\nBrooklyn Nets vs Detroit Pistons match\nVCT C9B vs Rise Grand Final",
    "118": "Listen, if you want to celebrate wins over the Detroit Pistons. Who am I to stop you?\n\nDon’t let me rain on your 4 games over .500 parade, what if it takes another 25 years to happen",
    "119": "What? Lol @DetroitPistons 😒🤦🏾‍♂️ https://t.co/eUtGRSkdrA",
    "120": "@wulfalos @DetroitPistons @JeramiGrant @KellyOlynyk @SaddiqBey @j_josh11 That makes him better apparently",
    "121": "@DetroitPistons Great team win last night 🔥🙌🏼🔥",
    "122": "@DetroitPistons @BrooklynNets @BallySportsDET @971theticketxyt @Shopify @barclayscenter Let’s go 🔥🙌🏼🔥",
    "123": "The Nets have won the past two meetings against Detroit and the past four against the Pistons at Barclays Center. \n\nBrooklyn is looking for consecutive victories for the first time this season.",
    "124": "@DetroitPistons @BallySportsDET @CadeCunningham_ @OSUMBB @OSUAthletics Nobody has Ballysports",
    "125": "@DetroitPistons just won they first game last night. Let’s go @Lions",
    "126": "Happy Halloween NetsWorld!\nIt’s GAME DAY! 🎃 👻 🏀 \nTonight the home-stand in the BK continues as the 1-4 Detroit Pistons come to town.\nLet’s Go Nets ⚪️⚫️\n\n#Nets #BrooklynNets #BKN #Brooklyn #NetsWorld https://t.co/W9Tj2yXtJr",
    "127": "I dont think you understand how nice it is seeing a Detroit Pistons draft pick hustle for the ball like this in his very first game. #Pistons https://t.co/zHZt4XjAtD",
    "128": "@DeepakN16418348 @DetroitPistons I think it is. Where have you seen 159 referenced?",
    "129": "The bench combined for 59 points and put four players – @KellyOlynyk (18), @j_josh11 (13), @TreyLyles (12) and @Cory_Joe (11) – in double figures. \n\n“They came in and took care of business,” - @Dreamville_33 on the second unit\n\n@Keith_Langlois \n🔗: https://t.co/iznogxO5Wb",
    "130": "@jkubatko @DetroitPistons I thought the number was 159. Is 158 actually correct?",
    "131": "Big lean to Pistons +12 tonight at Brooklyn. Nets at Lakers tomorrow, \n\nLike those prima donnas care about tonight's game against Detroit\n\nPistons ML +550 worth a bet\nand +12 for sure\n\n#NBA",
    "132": "📅 On this day in 1986, #NBA75 member Dennis Rodman grabbed two rebounds in his NBA debut with the @DetroitPistons.\n\nRodman had 158 career 20-rebound games, the most such games since the ABA-NBA merger.\n\nHe led the NBA in rebounds per game for a record seven consecutive seasons. https://t.co/q1gdL7R6K9",
    "133": "@WomenCantParlay I took a Detroit parlay with Lions +4 and Pistons +11 today.",
    "134": "The pistons past two top ten picks combined for 5 points. Such a Detroit thing",
    "135": "@STUDYTHEGOAT @IsiahThomas @KyrieIrving @cedricmaxwell81 @NBACobwebs • 2x champ\n• entire career w Pistons\n• built Detroit into destination for top tier talent\n• Isiah invented “handles”\n• Zeke was ACTUALLY a BAD boy on the hardwood. Kyrie is just disruptive and dangerous\n• top50 &amp; 75\n• DEFENSE!\n\nI’ll take my chances w @IsiahThomas any day",
    "136": "In three hours the @Lions will have the same amount of wins as the @DetroitPistons",
    "137": "@DetroitPistons @BrooklynNets @BallySportsDET @971theticketxyt @Shopify @barclayscenter W for us",
    "138": "The Jaguars are the Detroit Pistons of the NFL.",
    "139": "@LockyLockerson Detroit pistons +646 on a Monday, nope... But on a SUNDAY...",
    "140": "35 years ago today, in 1986: Dennis Rodman makes his NBA debut for the Detroit Pistons. #onthisday  https://t.co/uZeFeLw5R5",
    "141": "@DetroitPistons @JeramiGrant @KellyOlynyk There will be no Red Vines slander in this House, Josh Jackson!! Twizzlers suck.",
    "142": "@wulfalos @DetroitPistons @JeramiGrant @KellyOlynyk @SaddiqBey @j_josh11 Neither is Cade tool him awhile to play Cade won't be playing after this year",
    "143": "@DetroitPistons @Kia Fresh  out the garbage",
    "144": "@Alfredo96538707 @DetroitPistons @JeramiGrant @KellyOlynyk @SaddiqBey @j_josh11 well is he playing",
    "145": "@ESPNNBA @IsiahThomas @DetroitPistons Isiah Thomas started the Winning mentality for the Detroit Pistons Championships traditions. Two back to back. The Bad Boyz. Isiah, Joe, Bill, Mark, Edwards, Sally Rodman and Vinnie. And another with Wallace and Wallace. Mr Big Shot. Tayshaun Prince, Richard Hamilton.",
    "146": "JOGOS DO DIA\n\nSacramento Kings x Dallas Mavericks - 16h30\nPortland Trail Blazers x Charlotte Hornets - 20h\nUtah Jazz x Milwaukee Bucks - 20h\nDetroit Pistons x Brooklyn Nets - 20h30\nHouston Rockets x Los Angeles Lakers - 23h30 (BAND, Gaules e TNT Sports)\n\n#NBA75 https://t.co/o5d7wBtrmf",
    "147": "Analyzing Sunday’s Detroit Pistons at Brooklyn Nets odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/k6kXh2qgLN",
    "148": "Detroit Pistons at Brooklyn Nets odds, picks and prediction https://t.co/VRKXK6ZVGY",
    "149": "@tonydombrowski @DetroitPistons Shots will start going down",
    "150": "@Ayo_TTime9 Detroit got the pistons and red wings. They are fine",
    "151": "@LucasAG911 @DetroitPistons @BrooklynNets @BallySportsDET @971theticketxyt @Shopify @barclayscenter I’m honestly not sure if we see him tonight",
    "152": "@DetroitPistons @BrooklynNets @BallySportsDET @971theticketxyt @Shopify @barclayscenter Can we have more Cade",
    "153": "The Jaguars are literally the Detroit Pistons of the NFL. #Seahawks",
    "154": "@SLAMonline @DetroitPistons @Ryan_Pre23 I didn’t see this but THIS got me extremely pumped up. Especially after the DEEEEETRRROIIIITTTT BASKETBALL",
    "155": "🏀 Game Day 🏀\n\nNets look to make it two in a row as the homestand continues\n\n🆚 Detroit Pistons\n🏟️ The 'Clays\n⏰ 7:30 ET\n📺 YES\n📻 WFAN https://t.co/o6x2Bno3uT",
    "156": "@ESPNNBA Hustle Cade. Hustle. Hustle Pistons. Hustle. “Defense is not something you put around the fence.” Coach Earl Lloyd. Defense Wins Championship! Win Detroit. Win.",
    "157": "@OSUMBB @CadeCunningham_ @DetroitPistons Yessirr!! my guy cade need to turn up brodie letss go man we here! we up!!💯😤",
    "158": "@KendraLust @DetroitPistons A big win for the Pistons ,as they were graced by you being there to inspire and motivate them for a win! The Pistons and other Detroit teams have a huge advantage with you dear Kendra as their fan, you are Detroit's most beautiful woman and the rest of the world! 👏💪🙌💕💞💖",
    "159": "@theRealDCM @DLFPtweets @DetroitPistons @Lions Yes yes",
    "160": "When u go to a @DetroitPistons game and see @JoeyRadio @woodwardsports 🙌🏻 so nice to see u last night.",
    "161": "@tonydombrowski @GavinRhoades @DetroitPistons You guys sounded loud and clear all the way up to the mezzanine section! 🔥 🦖",
    "162": "@tonydombrowski @GavinRhoades @DetroitPistons Thanks for shouting it back and forth with me!",
    "163": "@KendraLust @DetroitPistons Beatiful women¡¡¡¡¡🥰🥰🥰🥰🥰🥰💥💥💥💥💥💥💥💥💥💯💯💯💯💯",
    "164": "Sun, 31st Oct: #BrooklynNets vs #DetroitPistons - ODD @ 1.79\nMore details on: https://t.co/uaKifYwuKK\n#baskettips #basketprediction #basketballbets #nba #usabasket",
    "165": "Revenge Game: Bruce Brown plays Detroit tonight.  He played 132 games in his career for the Pistons.",
    "166": "Revenge Game: Blake Griffin plays Detroit tonight.  He played 118 games in his career for the Pistons.",
    "167": "@BallySportsDET @DetroitPistons Play the fucking pistons games live dbags!!!!",
    "168": "@KendraLust @DetroitPistons You brought good luck to them Kendra.",
    "169": "@SLAMonline @DetroitPistons The 2004 team never got a nickname, I regret it wasn’t “The Goodfellas.” Maybe this new squad can use it — AFTER they win a playoff series. We can’t just give away names Willy Nilly.",
    "170": "Cade Cunningham only had a few points and assists (though he should have had a couple more) but the energy, rebounding and defensive effort were much appreciated. @DetroitPistons  https://t.co/7vdYKRXoxJ",
    "171": "@DetroitPistons @BrooklynNets @BallySportsDET @971theticketxyt @Shopify @barclayscenter Kelly going for 30 🤷🏽‍♂️",
    "172": "Detroit Pistons vs Brooklyn Nets 10/31/2021 Picks Predictions Previews\n\nhttps://t.co/uqKVX1SQhG\n\n#NBApicks #NBAparlay #NBAprediction #NBAbetting #NBA #sportsbetting #basketballpicks #odds #picks #freepick #freepicks #sportspicks #handicapper #expertpicks #Pistons #Nets https://t.co/NKqittJWxZ",
    "173": "@MatthewGranat @DetroitPistons @JeramiGrant @KellyOlynyk You just made my stomach hurt",
    "174": "@DetroitPistons @JeramiGrant @KellyOlynyk Cade a bust, no tootsie roll slander",
    "175": "On this day in 1950, Earl Lloyd made history when he became the first Black person to play in an NBA game. The two-time college All-American went on to enjoy a solid career with the Washington Capitols, Detroit Pistons, and Syracuse Nationals. #NBA75\n\nhttps://t.co/1LosQNqqN8",
    "176": "@DetroitPistons @JeramiGrant @KellyOlynyk Bro josh tripping Red Vines slap",
    "177": "@DetroitPistons @JeramiGrant @KellyOlynyk reeces",
    "178": "The worst Halloween candy I've ever received was _______________.\n\n\"Those little carrot things\" -@JeramiGrant \n\n\"Fruit. Not good with the code of conduct here for Halloween\" -@KellyOlynyk https://t.co/T0HyQS77VB",
    "179": "@DetroitPistons @BrooklynNets @BallySportsDET @971theticketxyt @Shopify @barclayscenter More Cade https://t.co/WY61lyh1KW",
    "180": "🇺🇸 East Coast, do not miss this! 👇🏀\n\n#Pistons #Nets #NBA #Socios #Brooklyn #Detroit #EastCoast #basketball #giveaway #NetsNation #NetsWorld #DCAboveAll #NBA75 #NBATwitter  $CHZ #BleedGreen #NewYorkForever #HereTheyCome https://t.co/Z2UxKZJttm",
    "181": "@PistonFanInIndy @DetroitPistons No doubt 💯",
    "182": "My Family were on both sides of country rooting on our favorite teams @DetroitPistons @Suns to Victory! Thanks to @frankgarza57 for introducing himself to My Son at LCA!!Can’t wait till @LukaG_55 and Squad visit #ValleyProud in December. https://t.co/KPEHuEoNnF",
    "183": "Jeremi Grant scored 22 points, No. 1 pick Cade Cunningham added seven rebounds in his NBA debut and the Detroit Pistons beat the Orlando Magic 110-103 for their first win of the season.\nhttps://t.co/0lUgG3bGWg",
    "184": "@DetBadger No sleep till Brooklyn 😤",
    "185": "As the Brooklyn Nets are set take on the Detroit Pistons, we’ve got you covered with all you need to know.  https://t.co/dec5w1tgQi",
    "186": "#breaking Pistons Detroit Pistons game vs. Brooklyn Nets: How to watch Cade ...,Nets seeking back-to-back wins in matchup with Pistons The Detroit Pistons visit the Brooklyn Nets at 7:30 p.m. on Sunday, Oct. 31, 2021, with Bally Sports Detroit televising the matchup.,The most enc",
    "187": "@tonydombrowski @GavinRhoades @DetroitPistons I could hear y’all from the concourse 😂😂😂",
    "188": "@sjdbdbsbdbf @tonydombrowski @DetroitPistons Box score watchers aren’t going to like Cade. His impact on the floor goes beyond points",
    "189": "Dallas Mavericks - Sacramento Kings\nCharlotte Hornets - Portland Trail Blazers\nMilwaukee Bucks - Utah Jazz\nBrooklyn Nets - Detroit Pistons\nLos Angeles Lakers - Houston Rockets\n\nBet slip link: https://t.co/Epotvz95PX https://t.co/KByxuBb2mM",
    "190": "Detroit Pistons vs. Brooklyn Nets - 10/31/2021 Free Pick &amp; NBA Betting Prediction https://t.co/YQybS0UFpt #FreePicks ... https://t.co/GIJTpRgdjQ",
    "191": "@KendraLust @DetroitPistons Are you a fan of the Detroit Pistons? I would have bet you're a lakers fan. 🤔",
    "192": "@SacramentoKings vs @dallasmavs , @utahjazz vs @Bucks , @trailblazers vs @hornets , @DetroitPistons vs @BrooklynNets , @HoustonRockets vs @Lakers",
    "193": "The only team that are on average scoring less than 100 points per game this season\n\nDetroit Pistons\nOKC (the abomination of basketball)\nYour Dallas Mavericks",
    "194": "@DetroitPistons @BrooklynNets @BallySportsDET @971theticketxyt @Shopify @barclayscenter This man Kelly went nuts and became the poster boy LOL",
    "195": "@DetroitPistons @BrooklynNets @BallySportsDET @971theticketxyt @Shopify @barclayscenter Big L",
    "196": "@IsiahThomas @DetroitPistons @Cheurlin1788 Yessir classic!!💪🏿💯..Pistons for life 2004 champs!!",
    "197": "Halloween hoops in Brooklyn 👻 \n\n🆚 @BrooklynNets \n📺 @BallySportsDET \n📻 @971theticketxyt \n💻 https://t.co/jLuRed9YBB\n🤝 @Shopify | Pingree Detroit\n📌 @barclayscenter https://t.co/L9SOsM0KyG",
    "198": "#OTD 1950, Earl Lloyd became the first of three Black players in the @NBA. Helped Syracuse Nats (now @Sixers) defeat the @DetroitPistons for the NBA Championship. He &amp; Jim Tucker were the first Black players on a championship team. #SundayVibes #tdih https://t.co/MeWqDOisH3 https://t.co/p4SuqYzhqn",
    "199": "Detroit Pistons vs. Brooklyn Nets - NBA (10/31/21) | How to Watch, Start Time https://t.co/jZDpoNfcFC",
    "200": "Got a chance to link with the homies after the #Pistons dub. Nothing but love from both of them. #DetroitGrind #DetroitVsEverybody #DetroitPistons 🔵🔴 https://t.co/ZHMAyXKm86",
    "201": "Detroit Pistons vs. Brooklyn Nets - NBA (10/31/21) | How to Watch, Start Time https://t.co/N4y9k2akfg",
    "202": "Keeping Up With The Canadians 🇨🇦\n\nKelly Olynyk | vs. Orlando\n\n18 POINTS\n3 THREE POINTERS\n6 REBOUNDS\n4 ASSISTS\n3 STEALS\n2 BLOCKS\n\n#Pistons | @DetroitPistons https://t.co/daNjq4AWzh",
    "203": "Detroit Pistons vs. Brooklyn Nets - NBA (10/31/21) | How to Watch, Start Time https://t.co/qN8TfFdRvW",
    "204": "If the Lions win today and the Pistons win today, this will be the most successful Detroit sports weekend in recent memory. #Pistons #Lions Lions win by 3, Pistons may need some help to pull off the win but I got them by 4.",
    "205": "@wulfalos @DetroitPistons @JeramiGrant @KellyOlynyk @SaddiqBey @j_josh11 15 ppg 4rpg 5apg so he's not a bust bud Cade had 2 points",
    "206": "Detroit Pistons @ Brooklyn Nets\nPick : Brooklyn Nets.\nBasketball. NBA",
    "207": "Teams with only 1 win on the season #NBATwitter \n\nLos Angeles Clippers\nIndiana Pacers\nNew Orleans Pelicans\nOrlando Magic\nDetroit Pistons \nHouston Rockets \nOklahoma City Thunder https://t.co/t5r9WE28nP",
    "208": "@NBA @DetroitPistons False advertisement you cannot watch piston games on pass if you’re in Detroit..",
    "209": "@tonydombrowski @DetroitPistons Tony, it’s literally just love pouring out every possession. I missed you yesterday…. But I did feel you.",
    "210": "@tonydombrowski @DetroitPistons Bro my friend had a breakdown on men because he thinks he’s a bust already lol casuals crazy af dawg",
    "211": "This right here had me going crazy in my seat last night. Cade Cunningham is here.\n\nStats aside, plays like this shows you the type of impact Cade makes for the Pistons. I love him already 🔥\n\n#Pistons   \n\n(via @DetroitPistons)\n https://t.co/daH5IscFG8",
    "212": "Here's to a long career, @CadeCunningham_. \n\nWe'll be cheering along the whole way, @DetroitPistons. \n\n#NewEra I #GoPokes https://t.co/3C869gkMY0",
    "213": "@MotorCityCruise @CadeCunningham_ @DetroitPistons Minor point: it’s not really “down there.” It’s a mile and a half away, right?",
    "214": "@DetroitPistons This picture just genuinely made me like Kelly Olynyk again. 6 years of anger gone just like that.",
    "215": "@WorldofIsaac @DetroitPistons I guess last night wasn’t 50/50. More of a 0/100",
    "216": "@DetroitPistons did you announce the 50/5] last night? Because I don't recall and it's not on the website",
    "217": "@KendraLust @DetroitPistons Beby i love you",
    "218": "@MrSober4 @NBA @DetroitPistons Subscribe to a VPN to bypass that. So annoying.",
    "219": "@DetroitPistons Tuesday against the 76ers will be Cade’s Motor City coming out party 🎉🥳🎈🎊🎁🍾",
    "220": "🏀Game 7\n🆚@DetroitPistons \n📺@YESNetwork \n⏰7:30 EST \nAssociation vs. Statement\nHappy Halloween! 🎃 https://t.co/tbaeGSg5S0",
    "221": "Pistons Sandstone Car Coasters, 2 Piece Coaster Set, Unique Detroit Basketball Fan Gift for Dad, Boyfriend, Groomsmen or Graduate https://t.co/K5dmKKo3bg #Etsy #SignsofTimeDesigns #giftlist #christmasgift #christmasshopping #GraduationGift https://t.co/d5X18K60l3",
    "222": "@DetroitPistons The 313 was 🔥",
    "223": "7️⃣ #Pistons players scored in double-digits in last night's win at home over the Orlando Magic ✨ https://t.co/436okV5lUk",
    "224": "Former @AuburnMBB standout Chuma Okeke made his 2021-22 @NBA debut on Saturday night in the @OrlandoMagic's 110-103 loss to the @DetroitPistons. He'd been sidelined by a hip injury. In 14 minutes, he had two points, a rebound, an assist and a steal. https://t.co/neTExy7RTp",
    "225": "#1 pick Cade Cunningham made his NBA debut and the Detroit Pistons picked up their first win over the Orlando Magic last night. They're 1-4. Pacers also were 1-4 when we faced them Friday. Beat the teams you're supposed to beat. Start fast. Pistons vs Nets at The Clays 7:30pm ET",
    "226": "#OTD Oct 31, 1950: Earl \"Big Cat\" Lloyd was the 1st African American to play in an NBA game when he debuted for the Washington Capitals. After a 10yr playing career, Lloyd worked for the Detroit Pistons, being named head coach in 1972.\n\nEarl Lloyd: My 1st Game\n#History #NBA https://t.co/FXRSER5MnR",
    "227": "#OTD Oct 31, 1950: Earl \"Big Cat\" Lloyd was the 1st African American to play in an NBA game when he debuted for the Washington Capitals. After a 10yr playing career, Lloyd worked for the Detroit Pistons, being named head coach in 1972.\n#History #NBA https://t.co/i6fhc5XU33",
    "228": "ICYMI: Cade Cunningham to 'play free' after getting past injury-delayed Detroit #Pistons debut https://t.co/NL9phDRSDH",
    "229": "NBA Day 1️⃣3️⃣🏀🏀🏀\nSacramento Kings vs Dallas Mavericks\nPortland Trail Blazers vs Charlotte Hornets\nUtah Jazz vs Milwaukee Bucks\nDetroit Pistons vs Brooklyn Nets\nHouston Rockets vs Los Angeles Lakers\n#NBA2022",
    "230": "Not a great start for the rook\n\nThe #1 pick of the 2021 NBA draft made his debut last night. Cade went off for:\n\n📊2pts/7reb/2ast/1-8FG\n\nEven throughout the horrible start the @DetroitPistons mage to get their first win as they  beat the @OrlandoMagic 110-103.",
    "231": "Did a quick vlog at the Detroit game last night..check it out! 🏀\n\nDetroit Pistons first Win of the season:Cade Cunningham NBA Debut! https://t.co/7ZI76UJzRI",
    "232": "Good morning Nets world, the Slim Reaper is going to the ruin the Detroit Pistons Halloween today 🎃😈https://t.co/oveHuBDxBM",
    "233": "@adam7king @NBA2K @NBA2K_MyTEAM @DetroitPistons Thanks Bro 😎",
    "234": "Hey @DetroitPistons … this would be pretty cool to do https://t.co/tADfZuxxjx",
    "235": "@Rokujay14 @wanderer922 @NBAHistory @DetroitPistons Yes he is. Curry ain't a real pg.",
    "236": "🏀 NBA fans are expected tonnes of games on Sunday from which we single out the most exciting ones. \n\n👉 01:00 Utah Jazz - Milwaukee Bucks \n👉 01:30 Detroit Pistons - Brooklyn Nets\n👉 04:30 Houston Rockets - Los Angeles Lakers\n\n#Bet11 https://t.co/GXRtBA8AdP",
    "237": "MAGIC at #Pistons | FULL GAME HIGHLIGHTS | October 30, 2021 - https://t.co/QUZqImr946 - #Brooklyn #Detroit #Minnesota #NBA #OrlandoMagic",
    "238": "Congrats to @DetroitPistons on getting that first win. https://t.co/rDuj99NbSF",
    "239": "The Detroit Pistons will take on the Brooklyn Nets on the road tonight at 7:30pm ET. https://t.co/4ctHIeuRMG",
    "240": "He was selected by the Washington Capitols in the 1950 NBA Draft and played professionally for nine seasons, retiring in 1960. From 1972 to 1973, he coached the Detroit Pistons and then served as a scout with the team for five seasons.",
    "241": "Detroit Pistons' Cade Cunningham playing catch-up to NBA game, but breathes life into team https://t.co/zZFg9x6292",
    "242": "Why Detroit Pistons rookie Cade Cunningham isn't worried about poor shooting in his debut https://t.co/MAhbZ8cpm9 https://t.co/voik0I62dW",
    "243": "Pistons vs. Magic final score: Bench explodes to give Pistons first win of the Cade Cunningham era, 110-103 - Detroit Bad Boys https://t.co/2hKigYEVAj #news #topstories #berkleybearnews",
    "244": "Pistons vs. Magic final score: Bench explodes to give Pistons first win of the Cade Cunningham era, 110-103 - Detroit Bad Boys https://t.co/lLvkGCYr5J",
    "245": "Pistons vs. Magic final score: Bench explodes to give Pistons first win of the Cade Cunningham era, 110-103 - Detroit Bad Boys https://t.co/LhUfAHfc5Z",
    "246": "@DetroitPistons I still think Corey Joseph played entirely too much but maybe that's just me 🤷🏽‍♂️🤷🏽‍♂️🤷🏽‍♂️",
    "247": "Why Detroit Pistons rookie Cade Cunningham isn't worried about poor shooting in his debut https://t.co/4JE1mdCPBR @SteveM_OD @SteveLarabee1 @heybrendan @DrTreyMalone",
    "248": "@KendraLust @DetroitPistons Kendra Lust was the #Pistons good luck charm https://t.co/ZHTtW5XLlA",
    "249": "Come watch pt 2 of my Detroit Pistons rebuild @ 5:30 AM ⛹🏻‍♂️ #Detroit #DetroitBasketball #twitch #twitchleak #twitchstreamer #twitchstreaming #twitchclips #TwitchPartner #stream #streaming #streamers #StreamingNow",
    "250": "Why Detroit Pistons rookie Cade Cunningham isn't worried about poor shooting in his debut https://t.co/eMTJjsLqop",
    "251": "@KendraLust @DetroitPistons So beautiful and very  nice",
    "252": "Detroit Pistons game vs. Brooklyn Nets: How to watch Cade Cunningham vs. Kevin Durant https://t.co/rMlvJwDsS4",
    "253": "Detroit Pistons game vs. Brooklyn Nets: How to watch Cade Cunningham vs. Kevin Durant https://t.co/kpO6NM3p5H",
    "254": "• Orlando Magic103-110 Detroit Pistons\n» Cade Cunningham: 18 mins, 7 rebs, 2 pts, 2 ast, 1 blk \n\n#NBA \n#NBA75",
    "255": "Cunningham makes NBA debut for Detroit Pistons in win over Orlando Magic https://t.co/9r08YMhUbG",
    "256": "Cunningham makes NBA debut for Detroit Pistons in win over Orlando Magic https://t.co/Rx5Egg5TzC",
    "257": "Dallas Mavericks - Sacramento Kings\nCharlotte Hornets - Portland Trail Blazers\nMilwaukee Bucks - Utah Jazz\nBrooklyn Nets - Detroit Pistons\nLos Angeles Lakers - Houston Rockets\n\nBet slip link: https://t.co/ctVYl5ZgGi https://t.co/MS7NZez5dd",
    "258": "The Detroit Pistons defeat the Orlando Magic 110-103.\n\n#detroit #sports #game #orlandomagic #magictogether #cadecunningham #podcast #spotify #jeramigrant #nba #detroitpistons #basketball #ESPN #followme #likeforlike #like4like #regularseason #franzwagner #nbaseason #coleanthony https://t.co/kNoC0riE3n",
    "259": "10/30 #NBA🏀\n\n➖2u - NY Knicks -6 -110\n✅2u - Detroit Pistons -6 -110\n❌2u - Memphis Grizzlies -2 -112\n✅2u - Chicago Bulls +3.5 -109\n❌2u - Minnesota Timberwolves -2 -112\n❌2u - Cleveland Suns -10.5 -107",
    "260": "No.1 draft pick Cade Cunningham is set to make his long awaited debut for the Detroit Pistons in their game against the Oralndo Magic on Saturday night. https://t.co/STO6Jz3RQ1 https://t.co/HUbZOJyrh4",
    "261": "@MotorCityCruise @DetroitPistons @CadeCunningham_ man hopefully he turns out to be good 👍🏼 im rooting for this young guy",
    "262": "@aaronmike03 @OrlandoMagic @DetroitPistons i miss this meme already",
    "263": "Here's how many minutes Detroit Pistons plan Cade Cunningham to play vs. Magic https://t.co/4U3WcEMLGm https://t.co/PLvP8JB6do",
    "264": "Kelly Olynyk scores 18 points off the bench on 6/12 from the field (3/6 from 3, 3/5 FT) along with 6 rebounds, 4 assists, 3 steals, and 2 blocks in a win over the Magic @KellyOlynyk @DetroitPistons",
    "265": "NBA @OrlandoMagic at @DetroitPistons, Saturday, October 30, 2021 @NBA @NBAstats #gamecharts #dataviz #nft https://t.co/H1mIWGaV3z",
    "266": "#Detroit #Pistons: Kelly was in his bag tonight like ...\n \nhttps://t.co/jRUAHohRGg\n \n#Central #CentralDivision #DetroitPistons #DetroitPistons #EasternConference #EasternConferenceCentral #EasternConferenceCentralDivision #Michigan #NBACentral #NBACentralDivision #NBAEastern https://t.co/crU5WxgdtF",
    "267": "Nets seeking back-to-back wins in matchup with Pistons  #NBA\n #BrooklynNets #BrooklynGrit #DetroitPistons #DetroitB https://t.co/2oSnjZfdlA",
    "268": "20:00 – 🏀NBA\nPortland Trail Blazers x Charlotte Hornets\nNBA LEAGUE PASS\nUtah Jazz x Milwaukee Bucks\nNBA LEAGUE PASS\n\n20:15 - ⚽🇦🇷Campeonato Argentino\nEstudiantes x River Plate\nESPN 2, WATCH ESPN e STAR+\n\n20:30 – 🏀NBA\nDetroit Pistons x Brooklyn Nets\nNBA LEAGUE PASS\n\n(+)",
    "269": "@lunabiass @NBA @DetroitPistons For sure they will, people forget that this is their first time playing in the pros. It’s gonna take some time til they play at their highest levels. Both players are gonna be studs though",
    "270": "@DetroitPistons Why are you up so late? We got a game tomorrow",
    "271": "@DetroitPistons Hey admin",
    "272": "\"Pistons No. 1 overall pick Cade Cunningham making NBA debut\"\n\nOctober 30, 2021\n\nNo. 1 overall draft pick Cade Cunningham of the Detroit Pistons is making his NBA debut on Saturday night against the visiting Orlando Magic.\n\nCunningham missed the first fo… https://t.co/uxxkqcuDOj",
    "273": "3 3's from last night's game in the 313 at 3:13 👌 https://t.co/horsUp9ZZB",
    "274": "@TenspotLTD @DetroitPistons @mrbyrdmath I have increased your follower count by 20%, I expect compensation",
    "275": "Good to see your @DetroitPistons finally get a W! More to come @LOQuent?",
    "276": "Detroit Pistons win first game of season as Cade Cunningham struggles in NBA debut https://t.co/y8M5bXlanP",
    "277": "Detroit Pistons fresh off a win Against the Orlando Magic . The Pistons are young and can run all day but will a back to back against the Nets tonight show there inexperience ?",
    "278": "@OSUMBB @CadeCunningham_ @DetroitPistons @NBA Good luck and wish you well on your new journey",
    "279": "Orlando Magic vs Detroit Pistons Full Game Replay 2021-10-30 NBA Replay HD\nhttps://t.co/UOOuTfIQXa https://t.co/kgD04grN0V",
    "280": "@DetroitPistons @IsiahThomas Isiah Thomas was the greatest Pistons ever.",
    "281": "@DetroitPistons @DomoSimonetti That was a good one…had goosebumps",
    "282": "Cade Cunningham /  Historic day past and present for Detroit Pistons https://t.co/2lTmqjpKFg #NBA #DET",
    "283": "@tkhamm @wanderer922 @NBAHistory @DetroitPistons Bro IT is not above Curry and Oscar all time",
    "284": "NBA @OrlandoMagic at @DetroitPistons, Saturday, October 30, 2021 @NBA @NBAstats #gamecharts #dataviz #nft https://t.co/dMv6Lui7WU",
    "285": "BASKETBALL | NBA\n\nDETROIT PISTONS X ORLANDO MAGIC\n\nBET: OVER 206.5 POINTS\n\nRESULT: 110-103\n\nRECORD: 24-3-1 https://t.co/qdbPVdQorN",
    "286": "Cade Cunningham to 'play free' after getting past injury-delayed Detroit Pistons debut.",
    "287": "@KendraLust @DetroitPistons Beautiful Doll @KendraLust",
    "288": "@KendraLust @DetroitPistons Superstar @KendraLust",
    "289": "@DetroitPistons @KellyOlynyk @BELFORGroup That’s my Cuz!! Rippin it up Big KO #OlynykKlynyk",
    "290": "@LakersPH2 @SLAMonline @DetroitPistons His ability to adjust midair, the awareness that stew was trailing him, the ability to absorb contact and make a good play, would you like more?",
    "291": "Good Dub @DetroitPistons Keep Building.",
    "292": "@OrlandoMagic @DetroitPistons This team might not get 10 wins this year",
    "293": "@DetroitPistons the clinic 🔥🔥🔥",
    "294": "Jerami Grant had 22 points and the host Detroit Pistons overcame a spotty debut by Cade Cunningham to collect their first victory, a 110-103 triumph over the Orlando Magic on Saturday. https://t.co/267iEmcRly",
    "295": "Encerrado:\n\nDetroit Pistons (1-4) 110 x 103 (1-6) Orlando Magic\n\nDET 📊\nJerami Grant: 22PTS/7REB/5AST/1STL\nKelly Olynyk: 18PTS/6REB/4AST/3STL/2BLK\n\nORL 📊\nFranz Wagner: 19PTS/3REB/2AST/1STL\nCole Anthony: 15PTS/10REB/3AST\n\n#NBA https://t.co/l9qaMWAT1V",
    "296": "Cade Cunningham delivers Detroit Pistons' first win, 110-103, despite scoring struggles https://t.co/VvaKjQoSqg https://t.co/Xq51xzJHPF",
    "297": "Cade Cunningham only had 2 points and 2 assist 7 rebounds and 1 block in his debut In 19mins of play NBA season with the @DetroitPistons what do ya think about that for the number 1 pick",
    "298": "@lunabiass @NBA @DetroitPistons Guy had a minute restriction and coming off of an injury and they’re already hating",
    "299": "@vedant_iyer27 @mohamudmcr @NBA @DetroitPistons LEGOD https://t.co/ZTloCJ4B5f",
    "300": "@jack__light @mohamudmcr @NBA @DetroitPistons Kuz better w/o Lebron what that tell you?? Lebron is ass",
    "301": "NBA\n\nFT.\n\nWashington Wizards 115 - 112 Boston Celtics\n\nDetroit Pistons 110 - 103 Orlando Magic\n\nNew Orleans pelicans 117 - 123 New York Knicks\n\nIndiana pacers 94 - 97 Toronto Raptors\n\nPhiladelphia 76ers 122 - 94 Atlanta Hawks\n\nChicago Bulls 107 - 99 Utah Jazz\n#TheGamePlan",
    "302": "Three of my four favorite teams that played today won (@OhioStateFB , @DetroitPistons , @Braves) if the @Lions win it will probably be one of my favorite sports weekends of all time! Oh yeah, ❌ichigan lost!! #Boom #Sports https://t.co/kLgAuffrGs",
    "303": "@TerenceSmithJr @tjaymetal @DetroitPistons @CadeCunningham_ @PriorityHealth bulls own pistons stay mad",
    "304": "@blaineconti123 @smh24yt_ @MotorCityCruise @CadeCunningham_ @DetroitPistons everybody sucks at clutch shots even dame also i love cade but i dont think he will shot that high yet hes young i this he cant shoot around 42-45%",
    "305": "@BSnapz2019 Well... Michigan State beat Michigan today, the Red Wings lost, and the Lions might win 2 games this year... Oh, and the Pistons aren't great either... So typical day here in Detroit...🤣",
    "306": "Per @espn @KDTrey5 skipped practice telling coach @SteveNash : “Let me rest, we have the @DetroitPistons next”",
    "307": "@wulfalos @smh24yt_ @MotorCityCruise @CadeCunningham_ @DetroitPistons Cades better at passing by far and at rebounding already and he’s only had 20 mins to play",
    "308": "@EvadeMoonlight @tjaymetal @DetroitPistons @CadeCunningham_ @PriorityHealth Bulls are frauds",
    "309": "@wulfalos @smh24yt_ @MotorCityCruise @CadeCunningham_ @DetroitPistons Just calling it like it is if Grant doesn’t miss his free throws the last game we might win he sucks at getting clutch buckets down the stretch the numbers say it basketball isn’t only about scoring plus Grant shoots a low % when Cade will end up shooting a very high %",
    "310": "@mrprodesign @CadeCunningham_ @SaddiqBey @Dreamville_33 @DetroitPistons Got ready for nothing .. should of got green",
    "311": "@DetroitPistons @KellyOlynyk @BELFORGroup Definitely confused",
    "312": "9 Years Ago Today: @JHarden13 Made His @HoustonRockets debut in a 105-96 win over the @DetroitPistons.\n\nHarden finished with 37 points, 6 rebounds, 12 assists &amp; 4 steals in 44 mins.\n\n@NoDunksInc\nhttps://t.co/phZGyi0Qmm via @YouTube",
    "313": "@santimags3 @Lakers @DetroitPistons Parang THT contract hahaha",
    "314": "@wulfalos @smh24yt_ @MotorCityCruise @CadeCunningham_ @DetroitPistons 20 million is what you would pay a number 2 option a max is what a number 1 gets in the Nba Cade will get a max after his rookie contract here which is already not to far off from what Grant is making his contract as a rookie with his endorsements pays him more then Grant",
    "315": "@blaineconti123 @smh24yt_ @MotorCityCruise @CadeCunningham_ @DetroitPistons he can average 14-16 hes not averaging 20 with grant",
    "316": "@wulfalos @smh24yt_ @MotorCityCruise @CadeCunningham_ @DetroitPistons Grant will still score more this year per game though but I think once Cade is off minutes restrictions and gets a few games in he will be score if 18-20 a game with 5 reb 3 ast and a stl and a block",
    "317": "@blaineconti123 @smh24yt_ @MotorCityCruise @CadeCunningham_ @DetroitPistons for a minute they gave him 20mil to be number 1 for atleast 2 more years",
    "318": "@wulfalos @smh24yt_ @MotorCityCruise @CadeCunningham_ @DetroitPistons Grant will only be our number 1 option for a minute rockets have kpj and wood who are better then green who will score a lot of points themselves that’s what I see happening to me Grant is already getting ready to be a future number 2 option or a 3 option depending on Saddiq",
    "319": "Jerami Grant had 22 points and the host Detroit Pistons overcame a spotty debut by Cade Cunningham to collect their first victory, a 110-103 triumph over the Orlando Magic on Saturday.\n\nhttps://t.co/mhAaWaFvlB",
    "320": "@KendraLust @DetroitPistons I didn't realize you were from Michigan!  I am right across the river(in Canada).  I fuckin love the Pistons!!",
    "321": "@smh24yt_ @MotorCityCruise @CadeCunningham_ @DetroitPistons Damn dude, two freaking points",
    "322": "@mohamudmcr @NBA @DetroitPistons First of one",
    "323": "@wulfalos @smh24yt_ @MotorCityCruise @CadeCunningham_ @DetroitPistons We will see if it’s not Cade it’s Scottie Barnes",
    "324": "@smh24yt_ @blaineconti123 @MotorCityCruise @CadeCunningham_ @DetroitPistons as a pistons fan i should agree but i wont the rockets suck so bad jalen with average more were actually ok",
    "325": "@lunabiass @NBA @CadeCunningham_ @DetroitPistons @unitedmasters Well 2 points is better than 0 points",
    "326": "@DetroitPistons @BallySportsDET @CadeCunningham_ @OSUMBB @OSUAthletics Future rookie of the year",
    "327": "@MotorCityCruise @CadeCunningham_ @DetroitPistons Cade will win rookie of the year ! Calling it now",
    "328": "@smh24yt_ @MotorCityCruise @CadeCunningham_ @DetroitPistons Cade will win rookie of the year",
    "329": "Yeah Detroit definitely up there. Pistons did win a NBA Title in the early 2000’s tho. https://t.co/2JczZiFxJS",
    "330": "Jeremi Grant scored 22 points, No. 1 pick Cade Cunningham added seven rebounds in his NBA debut and the Detroit Pistons beat the Orlando Magic 110-103 on Saturday night for their first victory of the season.  https://t.co/KUdX0fQdOB",
    "331": "Woolloongabba: Burst water Fight Live Tigers blog: Detroit Pistons Vs. Australia lowest for",
    "332": "@santimags3 @Lakers @DetroitPistons 3 years 37 million dollars 😊",
    "333": "@JalenGreenMvp @DetroitPistons Didn’t green play like ass his first game?",
    "334": "@KendraLust @DetroitPistons Yes it was. Nice seeing you at the game.  So damn sexy! No one at the game can hold a candle to you.",
    "335": "@KendraLust @BubbaAlmony @DetroitPistons The best woman ever on the planet💯❤🙏",
    "336": "The @WashWizards  sealed the W in 2 OT while the @DetroitPistons got their first win of the season. 🔥\n\nStandout result?\n\n#NBA75 https://t.co/k5PthdA80p",
    "337": "@Deaton2021 @DetroitPistons All this hype for 2 points https://t.co/b4yi74fcgh",
    "338": "@KendraLust @DetroitPistons You always win Kendra💯",
    "339": "October 30 is a historic day, past and present, for Detroit Pistons one hopes (via @Realstuartl) #Pistons \n#NBA #NBA75\nhttps://t.co/6WOFWLa2Uw",
    "340": "@JalenGreenMvp @DetroitPistons Didn’t play in preseason and first time off injury calm down😂",
    "341": "@DetroitPistons Fuck yeah🤘",
    "342": "Never count out the city @DetroitPistons 🔥🔥",
    "343": "@DetroitPistons @JeramiGrant @KellyOlynyk @SaddiqBey @j_josh11 Kelly Oclinic out there man he’s nuts",
    "344": "Great win @DetroitPistons",
    "345": "@DetroitPistons @IsiahThomas Dang, I forgot all about the light gray home jerseys.",
    "346": "Cade Cunningham delivers Detroit Pistons' first win, 110-103, despite scoring struggles https://t.co/cGwH6Hjtqi",
    "347": "@BrianGilbertso2 @DetroitPistons @WorldofIsaac I’ll be there!! 🤞👍💪",
    "348": "Olynyk desperation 3-pointer as shot clock expired when #Pistons were down 7 was HUGE!!! Another 3 and tough finish at the rim for him, transition layup for Grant, Joseph 3 and Grant 3 off Olynyk drive puts Detroit up 3 just a few minutes later....great stretch from KO",
    "349": "#Detroit #Pistons: Tonight @cadecunn1ngham got out ...\n \nhttps://t.co/CcNw34LVwh\n \n#Central #CentralDivision #DetroitPistons #DetroitPistons #EasternConference #EasternConferenceCentral #EasternConferenceCentralDivision #Michigan #NBACentral #NBACentralDivision #NBAEastern https://t.co/5kXs5mshIL",
    "350": "@TURKSAYSHI @DetroitPistons @KellyOlynyk @BELFORGroup Okay but his game says otherwise. he got bullied on the boards and did nothing offensively. I'm sure he was a good locker room guy but no production.",
    "351": "What a day for Michigan sports. State pulls off a wild come from behind win, Cade Cunningham makes his NBA debut, AND the Detroit Pistons get their first win of the season. WE ARE SO BACK! @BSMotorCity @DetroitPistons @MSU_Football https://t.co/kyuVB9j34l",
    "352": "@DetroitPistons @IsiahThomas Great highlights of the best little man ever...and I didn't recall that Tripuka wore #34 at one point.",
    "353": "@KendraLust @DetroitPistons Love love love ❣️😘",
    "354": "@tjaymetal @DetroitPistons @CadeCunningham_ @PriorityHealth bust",
    "355": "Astros got a mid 2000s Detroit Pistons thing going on if they lose this series",
    "356": "Detroit Pistons vs Orlando Magic was on Bally Sports Detroit. With commentary from Johnny Kane.  For more details see https://t.co/HLdStd2TcN #DetroitPistons #OrlandoMagic #BallySportsDetroit",
    "357": "@don_ginger11 @DetroitPistons Fake friend",
    "358": "@don_ginger11 @DetroitPistons Fake fan",
    "359": "Detroit Pistons vs Orlando Magic was on Bally Sports Florida. With commentary from David Steele.  For more details see https://t.co/HLdStd2TcN #DetroitPistons #OrlandoMagic #BallySportsFlorida",
    "360": "@DetroitPistons @IsiahThomas Cade is no Isiah.",
    "361": "Let’s go @DetroitPistons ! Great win and welcome to the NBA @CadeCunningham_ I guess you were all we needed, nice first game for only 19 mins, we can only go up from here! #Pistons #DetroitUp #DetroitBasketball",
    "362": "@nbatopshot No. 1 pick Cade Cunningham is set to make his NBA debut for the @DetroitPistons TONIGHT at 7pm/et on NBA League Pass!\n\nI predict @CadeCunningham_  will say #ToppsNFT's is his #1 stop for all his #SportsNFT needs \n#TakingShots #NBA #NBAFantasy #ToppsNOW #topps ToppsOverNBATopShots",
    "363": "@DetroitPistons @brgulker Haters gonna hate",
    "364": "Just some 3rd row action from the @DetroitPistons earlier tonight https://t.co/eCzkLrIpQO",
    "365": "@SLAMonline @DetroitPistons Easy partner. That’s a title that needs to be earned with time and     playoff success.",
    "366": "@KendraLust @DetroitPistons In love 😘😘😘😘😘😘😘😍😍😍😍😍😍🍑🍑🍑🍑🍑❤️❤️❤️❤️❤️",
    "367": "@DetroitPistons @CadeCunningham_ @PriorityHealth 2 points lmfao",
    "368": "In the D in the paint!! #walterejones #blackranger #detroit #pistons https://t.co/5Gld7C5XjE",
    "369": "Thank you @DetroitPistons $",
    "370": "@B_Street_Bully @NBA2K @NBA2K_MyTEAM @DetroitPistons I locked for him too. 😊",
    "371": "@DetroitPistons Kelly O and Jerami Grant for the win.",
    "372": "Grant scores 22, Pistons beat Magic in Cunningham's debut\nhttps://t.co/1wx9JEtu5t\n\n#cadecunningham #basketball #michigan #detroitpistons #sports",
    "373": "@CadeCunningham, in his first game, showed hustle, good defense, poor outside shooting, and lots of turnovers -- he fits in well with the rest of the @DetroitPistons. Detroit got its first win of the season -- if only we could play the Magic every day.",
    "374": "Tonight Cade got out those first game jitters and can just go play free now.\n\n@CadeCunningham_ | @PriorityHealth https://t.co/xNVOckwmYl",
    "375": "@KendraLust @DetroitPistons The most important person on the court! ❤️💯👑",
    "376": "@KendraLust @DetroitPistons u look gorgeous kendra",
    "377": "Enjoying some DEEEETROIT BASKEEEETBALLLL 🏀💙❤️ Thank you @CadeCunningham_ and @DetroitPistons! https://t.co/1fjR2ybzVA",
    "378": "@DetroitPistons \n\nThese guys LOVED their first game! #DetroitBasketball #313 #Restore https://t.co/DY056CMq6C",
    "379": "@Pistons_PR @DetroitPistons Jelly!!",
    "380": "Cade Cunningham struggled offensively in his NBA debut but Detroit Pistons still went on to beat Orlando Magic, 110-103, in the 2021-2022 NBA Season on Saturday at the Little Caesars Arena in Detroit, Michigan.\nhttps://t.co/Z6MrADndfl\n#FastBreakNews",
    "381": "“… air craft carriers like embiid” - coach casey\n\n😂\n\n#DetroitBasketball #detroitpistons #pistons https://t.co/odxsO60uQE",
    "382": "@DetroitPistons Way to go Detroit!!!! Let’s keep this win streak going.",
    "383": "@Mtn_Mann22 @DetroitPistons I like Stewart but Kelly just has the skill set. He’s literally the reason why we won the game tonight.",
    "384": "Detroit Pistons pisses off Orlando Magic 110-103 Jerami Grant 22points 7rebounds 5assists.",
    "385": "WATCH: Cade Cunningham makes debut as Detroit Pistons get first win https://t.co/LWDQGImt8u #GameScores #DetroitPistons #OrlandoMagic",
    "386": "@KendraLust @DetroitPistons 🙌🏻 Respect you Bad Girl!",
    "387": "@JaylenTatum0 @NBA @DetroitPistons 1st view made it appear that way but the other view seemed to show it was not",
    "388": "@brgulker It is our player of the game tweet. Thanks for asking.",
    "389": "Pistons Win 110-103 vs Magic. Cade Cunningham NBA Debut. Saddiq, Grant, Josh, and Olynyk. \nhttps://t.co/aQSTDWRp9F\n#Suggs #basketball #DetroitRoots #NBA75 #NBATwitter #subscribe #SupportSmallStreamers #contentcreator #detroit #Pistons #detroitup #Restore #NBA #YouTube https://t.co/NXwlK719MR",
    "390": "@DetroitPistons @KellyOlynyk @BELFORGroup Way better than Plumlee",
    "391": "Jeremi Grant scored 22 points, No. 1 pick Cade Cunningham added seven rebounds in his NBA debut and the Detroit Pistons beat the Orlando Magic 110-103 on Saturday for their first win of the season. https://t.co/O08HAzyG5c",
    "392": "Damn cade did not show up tonight at all 🥶 glad @DetroitPistons got the W doe",
    "393": "@ESPNNBA @IsiahThomas @DetroitPistons Where is this?",
    "394": "The Rookie &amp; The Vet #Year1 @ Detroit Pistons Practice Facility https://t.co/B49M9sA97G",
    "395": "@JustoATL @DetroitPistons Been saying he's A starter",
    "396": "@Pistons_PR @DetroitPistons @EliasSports bust",
    "397": "@AVKingJames @JoannePistonFan Detroit Pistons social will be sickened to know milk comes in a carton/jug in 90% of the country.",
    "398": "Attention: @ESPNStatsInfo \n\nThe @DetroitPistons have a franchise win/loss percentage of 1.000% when @CadeCunningham_ plays. #Pistons #FunFact https://t.co/TnxdSyhrzT",
    "399": "@KendraLust @DetroitPistons Smh I was gonnna go too! As beautiful as ever! Keep those tickets for the game, those are investments. If Cade is an all timer, those tickets from his first NBA game are gonna be valuable! A Lebron first NBA game ticket sold for $20K a cpl months ago🔥 https://t.co/WIaQSKVO9b",
    "400": "@DetroitPistons you're running Kelly Olynyk as a primary Ball Handler on your second unit. Maybe give @isaiahthomas a call you nerds.",
    "401": "@DetroitPistons @IsiahThomas This is when you know your stud rookie just might be the man. I was at this game.",
    "402": "“I thought it was good. I got all the jitters out and now I can just play free” - @CadeCunningham_ on his first game \n\n“I trust in me and I trust in my ankle”\n\n#Pistons | @DetroitPistons https://t.co/1o3G7B99pV",
    "403": "@rocketsbeliever @MrBig_Shot @dlorapaport @CadeCunningham_ @DetroitPistons You guys are funny. The type of guys that tweet steph curry is cooked after a bad first quarter. Long careers my friends. Long time to debate. There’s nothing I saw tonight that showed Cades a bust. I wasn’t box score watching like you folks. Good luck with our boy c. Wood",
    "404": "CADE DEBUT!!!!! Reacting to Orlando Magic vs Detroit Pistons | 2021 NBA ... https://t.co/w7COAfVxAn via @YouTube",
    "405": "@KendraLust @DetroitPistons You’re the only reason the won",
    "406": "@DetroitPistons @BallySportsDET @j_josh11 He does this every game and gets snubbed from the top plays. Great block Josh",
    "407": "@DetroitPistons LETS GO EASY WIN",
    "408": "@OrlandoMagic @DetroitPistons gg yall https://t.co/NkHgjHIPEZ",
    "409": "Review of Philadelphia 76ixers win against Detroit Pistons https://t.co/fM5OnOADQf via @YouTube",
    "410": "@DetroitPistons @KellyOlynyk @BELFORGroup Nice I like it",
    "411": "#ORLvsDET glad to see @DetroitPistons get that first W on the season a D #Cade make his debut. https://t.co/JJvMoCOx7I",
    "412": "@DetroitPistons @KellyOlynyk @BELFORGroup 🔥 tweet",
    "413": "Pistons fans arguing with me but i win anyway cause they still wake up everyday in detroit",
    "414": "Kelly was in his bag tonight like the milk in Canada 🥛🍁  \n\n@KellyOlynyk | @BELFORGroup https://t.co/8Hvoe7l4aB",
    "415": "Washington Wizards 115 (Bradley Beal 36 pts, Kyle Kuzma 17 pts, 17 rebs, Montrezl Harrel 23 pts, 14 rebs) Boston Celtics 112 (Jayson Tatum 27 pts, 15 rebs, Jaylen Brown 34 pts), Detroit Pistons 110 (Jerami Grant 22 pts) Orlando Magic 103 (Cole Anthony 15 pts, 10 rebs)",
    "416": "@KendraLust @DetroitPistons You look amazing",
    "417": "@bianchixtm @luxembourgman @NBA @DetroitPistons Making everyone better. Moving the ball and moving without it too. Had to watch it to see how positive he was",
    "418": "@DetroitPistons This dude sucks. 2 points in 19 minutes",
    "419": "So scrappy! Gonna be a gritty team, building like the 2004 Detroit Pistons. https://t.co/oXEstaOQaO",
    "420": "@NBA @DetroitPistons Cade looked solid in the 1st half, his stat line was awful but passes the eyeball test",
    "421": "@KendraLust @DetroitPistons Have you ever been to Toronto?",
    "422": "Bey is consistent, him &amp; Grant. Tonight was a good game #detroitpistons",
    "423": "@DetroitPistons This guy is questioning all of his life choices right here… https://t.co/g51KIrdZyL",
    "424": "@KendraLust @DetroitPistons Can you stick around and wish our Lions a little luck ?",
    "425": "@DetroitPistons @JeramiGrant @KellyOlynyk @SaddiqBey @j_josh11 @Keith_Langlois He looked decent,  stat line was awful but he played well in the 1st half",
    "426": "@KellyOlynyk (Kamloops,BC) had 18 pts,6 rebs,4 asts,3 stls,2 blks in 28 mins in @DetroitPistons 110-103 win over Orlando. #CanBall \n(PHOTO: Getty Images) https://t.co/A7X4ouQbZ4",
    "427": "Cade Cunningham delivers Detroit Pistons' first win, 110-103, despite scoring struggles https://t.co/8hsBJK5QRm",
    "428": "@KendraLust @DetroitPistons Sexy 😍😍😍",
    "429": "Who’s gonna be the second nba team to follow me @ATLHawks @Bucks @celtics @chicagobulls @PelicansNBA @WashWizards @Lakers @warriors @nyknicks @BrooklynNets @okcthunder @LAClippers @spurs  @MiamiHEAT @HoustonRockets @cavs @sixers @Raptors @Suns @Pacers @DetroitPistons @hornets",
    "430": "Jerami Grant scored 22 points, No. 1 pick Cade Cunningham added seven rebounds in his NBA debut and the Detroit Pistons beat the Orlando Magic 110-103 on Saturday for their first win of the season. https://t.co/pwVqmxKmbl",
    "431": "@KendraLust @DetroitPistons Yes big win tonight! Thanks for always representing the ‘D’ ❤️🏀",
    "432": "@OCPDesigns @OrlandoMagic @DetroitPistons He’s been excellent so far.. one thing I love about him, is his ability to play off ball … he cuts well &amp; is able to get into good spots to score .. you need guys like that to make your offense work",
    "433": "@KendraLust @DetroitPistons Cade was rusty tonight. His first game maybe nerves too",
    "434": "@NBA @DetroitPistons Cunningham had very limited playing time.",
    "435": "@NBA @DetroitPistons Congratulations @DetroitPistons",
    "436": "@JonathanGrij @OrlandoMagic @DetroitPistons For what? This organization can't draft for shit. You got them trying to bring j.cole and adam sandler to camp lol",
    "437": "My #NBA Picks For 10/30/21:\n\nOrlando #Magic @ Detroit #Pistons  - Over 208 (-110) ✅\n\nMy current ‘21-‘22 NBA Season Record: (5-0)\n\n#SportsBetting #FreePick #GamblingTwitter #FreePicks #SportsBets #NBAPicks #NBATwitter   #DraftKings   #BettingTwitter",
    "438": "@luxembourgman @NBA @DetroitPistons playing defense",
    "439": "@DetroitPistons @JeramiGrant @KellyOlynyk @SaddiqBey @j_josh11 Good job now @Lions get your first win tomorrow",
    "440": "@DetroitPistons Cade 😂😂😂 come on man",
    "441": "@Lakers what about make a call with the @DetroitPistons to inquire about Kelly Olynk.. He will be a good fit in Frank Vogel's system can shoot the 3...😊🙏💯 #justsaying #suggestion",
    "442": "@RyanFieldABC @DantonioMark Great photo!  Cunningham won his @DetroitPistons debut. 2-7-2 &amp; a block. Keep enjoying the trip. That is all 👍🏻🏀",
    "443": "@NBA @DetroitPistons Jerami grant is budget Harrison Barnes",
    "444": "@mrprodesign @CadeCunningham_ @SaddiqBey @Dreamville_33 @DetroitPistons 2points😹",
    "445": "Lowry goes to the bench and we turn into the Detroit Pistons",
    "446": "Cade Cunningham delivers Detroit Pistons' first win, 110-103, despite scoring struggles https://t.co/QdVpiTUXCM via @freep",
    "447": "CADE COMIN 4 THAT ROY\n@DetroitPistons https://t.co/FRxERzFkZK",
    "448": "Cade Cunningham makes debut as Pistons get first win  #NBA\n #DetroitPistons #DetroitBasketball #OrlandoMagic #PureM https://t.co/an3gdifSw7",
    "449": "@DetroitPistons @JeramiGrant @KellyOlynyk @SaddiqBey @j_josh11 Proof Cade is a bust",
    "450": "Jerami Grant provides 22 PTS, 7 REB and 5 AST as the @DetroitPistons come away with their first win of the season!\n\nKelly Olynyk: 18 PTS, 6 REB, 4 AST\nSaddiq Bey: 13 PTS, 7 REB\nJosh Jackson: 13 PTS, 7 REB https://t.co/lfpY0jhcpK",
    "451": "@CadePistons @DetroitPistons Naw that was grant 35 points",
    "452": "@ORLRFC1719 @OrlandoMagic @DetroitPistons They need robin Lopez minutes REBOUND!",
    "453": "@WorldofIsaac @FBI Sausage Haus closed on a Saturday game night? \nYou're better than this @DetroitPistons.\nI bet the $18 pizza places were open. Just sayin.",
    "454": "@DetroitPistons @JeramiGrant @KellyOlynyk @SaddiqBey @j_josh11 @Keith_Langlois Too bad the game was nowhere to be found among our 100’s of cable channels. In fact I could find only one NBA game airing at all.",
    "455": "@JonathanGrij @OrlandoMagic @DetroitPistons Y? They’re just gonna waste it anyway",
    "456": "@mark19472311 @MrBig_Shot @dlorapaport @CadeCunningham_ @DetroitPistons gerald green is better than cade",
    "457": "Detroit Pistons get first win of season, beat Orlando Magic, 110-103: Game thread recap #YahooSports #NBA https://t.co/xKxZViARBA",
    "458": "@DickieNuggz @jasonms316 @bigjimmurray One title in 35 years. They’re not even the Detroit Pistons. Lol.",
    "459": "@MrBig_Shot @dlorapaport @rocketsbeliever @CadeCunningham_ @DetroitPistons Gerald green looks pretty good for Houston. Ahem I meant Jalen green. Same thing.",
    "460": "DetroitPistons great win tonight! Able to keep @CadeCunningham_ under your minute restrictions and did it with the bench!!! @KellyOlynyk was a stud tonight! #DetroitBasketball baby! https://t.co/FpMTFzS2fC",
    "461": "@Konop8 @DetroitPistons Make that money!",
    "462": "@tweettweetman21 @DetroitPistons And they covered!!",
    "463": "Detroit Pistons get first win of season, beat Orlando Magic, 110-103: Game thread recap https://t.co/o5aUwZANtT",
    "464": "@DLFPtweets If the @DetroitPistons can win their first game, so can the @Lions 🤷🏾‍♂️",
    "465": "@JeramiGrant @KellyOlynyk @SaddiqBey @j_josh11 Check out @Keith_Langlois' 3️⃣ quick observations from Saturday night’s win vs. the Orlando #Magic.\n\n🔗 : https://t.co/YnzX3oVCB2",
    "466": "@DetroitPistons @OrlandoMagic Common W admin showing sportsmanship.",
    "467": "@OrlandoMagic @DetroitPistons 1.Okeke a bust\n2.Suggs is a fake ass a player. \n3.Organization is used to tanking\n4.Y'all just lost to the worst team\n5.F wagner already better than Gordon.",
    "468": "@OrlandoMagic gg, see you in January🤝",
    "469": "Cole Anthony had a 15-point, 10-rebound double-double in a loss to the Detroit Pistons on Saturday, also tallying three assists, three 3-pointers and two turnovers in 35 minutes. For Fantasy Analysis Click Here: https://t.co/lZPlllaUwn",
    "470": "I love my pistons but playing Corey Joseph 27 mins is not gonna get it done he should not have more minutes than Killian ...... what do yall think #Detroit",
    "471": "@kingbrick123 @OrlandoMagic @DetroitPistons Tross is the only reason y’all have a win",
    "472": "@MrBig_Shot @dlorapaport @mark19472311 @rocketsbeliever @CadeCunningham_ @DetroitPistons Bro who are you arguing with 😂",
    "473": "@DetroitPistons Kelly really turned that 3Q around almost unanimously, it was amazing. Jerami should gain some confidence from this one. Cade didn’t make much of an impact but the excitement was there so I’m not worried about it. Great getting that first win of the season. Off to BKLN #Pistons",
    "474": "@DetroitPistons Now that the @DetroitPistons got that first win…. Hope the @Lions can follow down that path and taste victory..#Onepride #DetroitBasketball https://t.co/YG77KZpgoY",
    "475": "LFG! The 180 degree alley-oop layup from White Chocolate for 37 points after the 17 straight points to finish the game against the @DetroitPistons with a dub! #NBA @DwyaneWade @MiamiHEAT @nbatopshot https://t.co/sH7DZAj8cG?",
    "476": "@MrBig_Shot @dlorapaport @mark19472311 @rocketsbeliever @CadeCunningham_ @DetroitPistons man arguing with himself",
    "477": "@dlorapaport @rocketsbeliever @CadeCunningham_ @DetroitPistons They were up 20 and didn’t play the starters",
    "478": "@luvspar10s_19 @DetroitPistons It's true",
    "479": "Remember, the Detroit Pistons have never lost a game that Cade Cunningham played. #Pistons",
    "480": "Detroit Pistons beat Orlando Magic 110-103 for first win of season\n\nNo. 1 pick Cunningham making NBA debut with2 points, 7 rebounds, 2 assists\n\nIsaiah Stewart: 11 PTS, 8 REB, 2 STL, 1 BLK\n\nFor Orlando:\n\nCole Anthony: 15 PTS, 10 REB, 3 AST https://t.co/KSAWmbLrv9",
    "481": "@DetroitPistons @JeramiGrant @KellyOlynyk @SaddiqBey @j_josh11 Shame Cade didn't do enough to be included in this",
    "482": "@CBolin21 @DetroitPistons Perfect. 👌",
    "483": "@OrlandoMagic @DetroitPistons Who are we looking at at the top of the draft next year?",
    "484": "@DetroitPistons @JeramiGrant @KellyOlynyk @SaddiqBey @j_josh11 Kelly 6th man of the year",
    "485": "@OMagicHQ @DavidBaumannORL @DetroitPistons @OrlandoMagic You’re not wrong.",
    "486": "@DetroitPistons @JeramiGrant @KellyOlynyk @SaddiqBey @j_josh11 Grant 🐐",
    "487": "@DetroitPistons @JeramiGrant @KellyOlynyk @SaddiqBey @j_josh11 K3LLY MVPYK",
    "488": "@OrlandoMagic @DetroitPistons Respect 👌",
    "489": "@OrlandoMagic @DetroitPistons Mosley.",
    "490": "Saturday showdown for a #PISTONSWIN\n\n🔹 @JeramiGrant: 22 PTS / 5 AST / 7 REB\n🔹 @KellyOlynyk: 18 PTS / 5 REB / 3-6 3PT\n🔹 @SaddiqBey &amp; @j_josh11 with 11 PTS and 7 REB each https://t.co/Wcmb1TLXoT",
    "491": "@dlorapaport @mark19472311 @rocketsbeliever @CadeCunningham_ @DetroitPistons Green cares about one thing, shooting the basketball. Cade wants to be a captain, he wants to play defense, pass the ball. You do know basketball is more than scoring right? Both players will be good but you're fooling yourself if you think Green has more potential.",
    "492": "@Jemiah23825030 @StaticSeth @ESPNNBA @IsiahThomas @DetroitPistons Lol stands true",
    "493": "@OrlandoMagic @DetroitPistons Can we have a solid bench player?",
    "494": "@JoshNotDrake_ @OrlandoMagic @DetroitPistons that would assume we are trying to win...fuck that",
    "495": "@OrlandoMagic @DetroitPistons We need Fultz and Isaac",
    "496": "@OrlandoMagic @DetroitPistons Mosley, wtf was that?",
    "497": "@OrlandoMagic @DetroitPistons Franz been so good man.",
    "498": "@OrlandoMagic @DetroitPistons We some garbage. Star talent don't want to play for Orlando.",
    "499": "@BalaBaiulus @OrlandoMagic @DetroitPistons Best players, Fultz and JI, aren’t ready to return",
    "500": "THE DETROIT PISTONS WIN A BASKETBALL GAME #Pistons",
    "501": "@DetroitPistons Cade galvanized the troops his presence set the tone",
    "502": "@tonydombrowski @DetroitPistons Where can I get that shirt",
    "503": "Franz Wagner with a Magic team high 19 points on 8/15 FG (3/6 3s) in the 110-103 loss in Detroit. \n\nCole Anthony had 15p,10r,3a (6/10 FG, 3/4 3s)\n\nJalen Suggs had 10p,6a,5r,2s,1b (3/13 FG, 0/4 3s) \n\nMagic fall to 1-6.\n\nPistons improve to 1-4.",
    "504": "@BalaBaiulus @OrlandoMagic @DetroitPistons Wendell getting 16 minutes lol",
    "505": "@OrlandoMagic @DetroitPistons Still no Fultz and JI https://t.co/NTc28NVBDH",
    "506": "@ryancashh @OrlandoMagic @DetroitPistons @BallySportsFL @969thegame @jalensuggs you good we both have really nice young teams",
    "507": "@OCPDesigns @DetroitPistons thank you for giving us michigan fans a win today 😭😭",
    "508": "@OrlandoMagic @DetroitPistons I may have underrated the Franz pick...",
    "509": "@OrlandoMagic @DetroitPistons another good game from cole and frank jalen back to sucking i see.... how do you lose this one?",
    "510": "@dlorapaport @mark19472311 @rocketsbeliever @CadeCunningham_ @DetroitPistons Haha like yall are embarrassing yourselves. Tell us you don't know basketball without telling us. Jalen Green will be good. He's a baller. But he's just a scorer. A great scorer, but his game is limited.",
    "511": "@OrlandoMagic @DetroitPistons Respect for the ggs and it was cool seeing the Wagner Bros. ball out. https://t.co/eZQh3NoLE8",
    "512": "@OrlandoMagic @DetroitPistons CAN WE STOP TRYING TO LOSE AND ACTUALLY PLAY OUR BEST PLAYERS, THANK YOU",
    "513": "@OrlandoMagic @DetroitPistons Embarrassing.",
    "514": "@OrlandoMagic @DetroitPistons Maybe you should’ve played Wendell. https://t.co/YQVWsdGq8M",
    "515": "@DetroitPistons YESSSSSIRRRRSSSSSSKKKIIIIIIII\n\nMotor Cade have a plan.",
    "516": "@PistonsAntonio @OrlandoMagic @DetroitPistons @BallySportsFL @969thegame @jalensuggs My fault Antonio",
    "517": "@DetroitPistons Just need Kelly to start the games from now on.",
    "518": "@DetroitPistons @Konop8 got that W",
    "519": "@DetroitPistons My only complaint is that they kept Joseph all the way to the end and they allowed Magic to go over 100.",
    "520": "I’m not saying that the @DetroitPistons won because we were there, but other people are saying it. \n\n(How did I do @WorldofIsaac ?)",
    "521": "First win of the season! @DetroitPistons \n\nCade with a modest debut, especially shooting just 1 for 8, but he undoubtedly made a difference to the overall spacing and offense.\n\n#DetroitPistons https://t.co/LESwRTqJWQ",
    "522": "Welcome to the win column, Detroit. \n\nBeen a while. \n\nThank you, @DetroitPistons!!!!!!",
    "523": "@ryancashh @OrlandoMagic @DetroitPistons @BallySportsFL @969thegame @jalensuggs whoops",
    "524": "@DavidBaumannORL @DetroitPistons @OrlandoMagic Franz &gt; Cade. There I said it.",
    "525": "@DetroitPistons we will be seeing lots of these with cade",
    "526": "@DetroitPistons We got a W Detroit!",
    "527": "@dlorapaport @mark19472311 @rocketsbeliever @CadeCunningham_ @DetroitPistons Haha like yall really on here talking shit about a rookie that didn't play in the preseason AND acting like Jalen Green has played well. You looked up Cades stats tonigiht, so why don't you go check out Greens stats.",
    "528": "Josh Jackson - Detroit Pistons\n13 PTS\n7 RBD\n2 AST\n1 BK\n2 STL\n1 TO\n[FD(32.4) DK(31.75)]",
    "529": "Cory Joseph - Detroit Pistons\n11 PTS\n1 RBD\n6 AST\n2 STL\n1 TO\n[FD(26.2) DK(25.75)]",
    "530": "@DetroitPistons It's about time!",
    "531": "@DetroitPistons The Cade affect is real",
    "532": "@DetroitPistons Pleasure doing business with ya https://t.co/Diocq2GOIN",
    "533": "The Detroit #Pistons(1-4) defeat the Orlando #Magic(1-6) 110-103. \n\nJerami Grant: 22 points, 7 rebounds, 5 assists\nKelly Olynyk: 18 points, 5 rebounds, 4 assists\n\nCade Cunningham in 19 minutes: 2 points(1-8 FG), 7 rebounds, 2 assists",
    "534": "@DetroitPistons YES YES YES",
    "535": "@DetroitPistons if someone told me Cade didnt play today I would believe them",
    "536": "@DetroitPistons Kelly is such a W pickup",
    "537": "@DetroitPistons no longer winless tonight!! @Lions now it’s YOUR TURN tomorrow! Let’s get that W!!",
    "538": "@dlorapaport @mark19472311 @rocketsbeliever @CadeCunningham_ @DetroitPistons Haha do you really want us to pull up Jalen Greens stats? Green is a better scorer and more athletic. That's it. Cade is a mature leader that plays defense, runs the offense, and can score.",
    "539": "@DetroitPistons Wistons",
    "540": "Let's go #Pistons good game fellas @DetroitPistons 👏🏾💪🏾 https://t.co/FK0kJL9rF2",
    "541": "Bless you @DetroitPistons https://t.co/3Jmb5COfhp",
    "542": "@Wkeidai \n@Yui_Zo_Detroit \n@ranger0004 \n\npistons wiiinn!!\n\n#detroitbasketball https://t.co/miGjZNVw91",
    "543": "@dlorapaport @rocketsbeliever @CadeCunningham_ @DetroitPistons He shot bad tonight but was missing open shots. We know he can score. He’s been a good shooter in every level of basketball. I’m not worried",
    "544": "Cade Cunningham: 2p,7a,2r,1b (1/8 FG) in 18:55 in his NBA debut. \n\nHis @DetroitPistons beat the @OrlandoMagic 110-103.",
    "545": "Reading the news after @DetroitPistons on @WWJ950  until 6a:\n\n-Spartans beat Wolverines in thriller\n-CBP arrests Oakland Co. sex offender\n-2 DPD officers charged in corruption case\n-Realtors face midnite deadline\n-@WWJTraffic + @AccuWeather on 8s\n\nLISTEN: https://t.co/e4xZVM7rX9",
    "546": "LETS GO!!!!!!!! @DetroitPistons  WELL ROUNDED GAME FROM EVERYBODY!",
    "547": "@zarchasmpgmr @ChrisNHarrelson @notnotpreston @DanielBinDC @BNightengale Plenty of precedent. NY Giants / Jets playing in Jersey. SF 49ers in Santa Clara. Dallas Cowboys in Arlington. Detroit Pistons in Auburn Hills for 30+ years.\n\nATL has been growing out for decades. It was the right move. And the atmosphere there this month speaks for itself",
    "548": "The Detroit Pistons are undefeated with Cade Cunningham in the lineup",
    "549": "Detroits defense is better than their offense tonight. #DetroitPistons",
    "550": "@DetroitPistons @LCArena_Detroit @BallySportsDET @KellyOlynyk Kelly is our best player yikes",
    "551": "@dlorapaport @rocketsbeliever @CadeCunningham_ @DetroitPistons 1-0 with Cade. Let’s go. Everyone knew this was going to happen with you guys. Jalen is a pure scorer and Cade is an all around player. You’re stat watching, not watching games.",
    "552": "#Pistons going to come off with a win here… finish it #DetroitPistons #DETvsORL #PistonvsMagic #DetroitPistonvsOrlandoMagic #NBA #NBA75",
    "553": "Kelly bringing down the roof in @LCArena_Detroit! 🏡\n\n@BallySportsDET | @KellyOlynyk https://t.co/ABK7mrCR2Q https://t.co/WSDXyU2oJ0",
    "554": "Let’s Go @DetroitPistons!🏀🔥",
    "555": "@JohnnyKaneTV giving off Gus Johnson vibes with his announcing! Hey @BallySportsDET, make him the successor to George Blaha.\n@DetroitPistons",
    "556": "@JaylenTatum0 @NBA @DetroitPistons nope",
    "557": "1st games in the NBA for the Detroit Pistons \n\nIsiah Thomas \n31 pts 11 assists\n\nGrant Hill \n25pts 5 ast 10 reb",
    "558": "@mark19472311 @dlorapaport @CadeCunningham_ @DetroitPistons using +/- is like admitting youve lost lmao",
    "559": "Pistons owner has an arm.  Wonder if he ever played baseball.  He’s launching tshirts from the floor far into the stands!!!  #detroitpistons",
    "560": "we are getting blown out by the detroit pistons.",
    "561": "Cade and Killian having a terrible game and the bench carrying the Pistons to a win is the most Detroit sports thing ever",
    "562": "Second game of a back to back .. I get it. But this is inexcusable. You don’t play like this against the Detroit Pistons.",
    "563": "[Woodyard] Detroit #Pistons coach Dwane Casey confirms that No. 1 pick Cade Cunningham will make his debut tonight. He missed all preseason action and the first 4 games with a sprained ankle. “Yes, he’s good to go,” he said. https://t.co/gZoiU8qsfp",
    "564": "@rocketsbeliever @dlorapaport @CadeCunningham_ @DetroitPistons Enjoy that -33 Jalen green posted the other night. At least he got his 13 pts on 33% shooting.",
    "565": "@NBA @DetroitPistons Imagine being excited for Kelly Olicknick",
    "566": "@NBA @DetroitPistons Wat a dunk",
    "567": "@NBA @DetroitPistons I need those tennis 😜",
    "568": "@zergwizard @NBA @DetroitPistons he signed with the pistons",
    "569": "@DetroitPistons 6MOY KELLY",
    "570": "@NBA @DetroitPistons WHO CARES .... I do",
    "571": "@NBA @DetroitPistons this isn’t a double dribble?",
    "572": "Pistons' bench has looked a lot better in the second half. That Josh Jackson 3, which followed a Kelly O one, is sending people to the exits. Detroit up 17 with 6:13 left. Funny how things look when shots go in at a better-than-20-percent clip",
    "573": "That's that Detroit defense!! Let's go Pistons! https://t.co/uJFq62lWwz",
    "574": "@mark19472311 @dlorapaport @CadeCunningham_ @DetroitPistons Whatever helps you sleep",
    "575": "@DetroitPistons Kelly GOAT",
    "576": "@NBA @DetroitPistons When did kelly get traded from the rockets to pistons lmao",
    "577": "@dlorapaport @rocketsbeliever @CadeCunningham_ @DetroitPistons Playing great just not hitting his shots, hasn’t played in a month. Knew his stats weren’t gonna be good tonight and Rockets fans would Jack off. Makes everyone on the floor better and his defense has been sick",
    "578": "@DetroitPistons @JeramiGrant @KellyOlynyk @Dreamville_33 Cade and Killian are the same player",
    "579": "@Hawksrevengeszn The Detroit Pistons would like a word",
    "580": "@NBA @DetroitPistons Heat owns this finished franchise",
    "581": "@NBA @DetroitPistons Overrated",
    "582": "@NBA @DetroitPistons Post the Knicks",
    "583": "The pump-fake sets up the jam 💪\n\nKelly Olynyk (13 PTS) and the @DetroitPistons own the lead in Q4 on NBA League Pass!\n📱💻: https://t.co/V0kkYEEIkG https://t.co/RkaRWRHVtQ",
    "584": "@natepoulos @BallySportsDET @YouTubeTV @DetroitPistons Do you have YoutubeTv?",
    "585": "Detroit sports are back: \nLions - fun team with lots of energy and heart under an amazing coach\nPistons - cade go balling \nRed Wings - pretty much same as lions but with more up and coming talent \nTigers - Almost finished rebuilding with lots of good young pitchers",
    "586": "Detroit #Pistons rookie Cade Cunningham notches first-career bucket [Video] https://t.co/099lyrOIpp",
    "587": "@DetroitPistons The bench literally saved this game. The starting lineup is nothing but 1 on 1 guys who don’t set screens, picks or cut",
    "588": "It’s a bad day when u getting beat down by the @DetroitPistons",
    "589": "Cmon @DetroitPistons ! Close them out 🏀🔥",
    "590": "@DetroitPistons Kelly has been awesome in the D early love his game very energetic.",
    "591": "The Pistons are semi-clownin' for the first time this season. A CoJo under-the-basket pass leads to a Lyles dunk Detroit up 13 with 9:05 left.",
    "592": "@DetroitPistons Love that guy",
    "593": "@DetroitPistons KELLY O",
    "594": "@DetroitPistons Heat legend",
    "595": "WHATUPDOE DETROIT https://t.co/IacnkuUirK",
    "596": "@DetroitPistons Can’t wait til Cade finds his rhythm. He’s gonna be a problem.",
    "597": "@DetroitPistons @JeramiGrant @KellyOlynyk @Dreamville_33 Let’s run the table! 78-4!",
    "598": "@C_O_D_ @DetroitPistons Nigga enough is enough huh 😂",
    "599": "@DetroitPistons @JeramiGrant @KellyOlynyk @Dreamville_33 Lets finish this",
    "600": "@DetroitPistons @JeramiGrant @KellyOlynyk @Dreamville_33 This team is fun to watch! Ps get Hayes outta here he doesn’t fit !",
    "601": "@DetroitPistons @JeramiGrant @KellyOlynyk @Dreamville_33 How the bench better then the starters?!!",
    "602": "Detroit Pistons look like a championship team. Of course the Magic are pure shit so",
    "603": "I'm LOVING hearing @JohnnyKaneTV calling the @DetroitPistons game on @BallySportsDET! So much energy. He might need a regular announcing job soon.",
    "604": "@dlorapaport @mark19472311 @rocketsbeliever @CadeCunningham_ @DetroitPistons Does he have a +- of -37???",
    "605": "@DetroitPistons @JeramiGrant @KellyOlynyk @Dreamville_33 WIN WIN WIN WIN WIN",
    "606": "LET'S GO! Final frame coming up.\n\n🔹 @JeramiGrant: 22 PTS / 5 AST / 6 REB\n🔹 @KellyOlynyk: 13 PTS / 2 STL / 4 REB\n🔹 @Dreamville_33: 11 PTS / 8 REB / 5-8 PG https://t.co/Of6JMAaiak",
    "607": "Just get this win @DetroitPistons",
    "608": "At the end of the third quarter, the #Pistons lead the #Magic 82-73. \n\nJerami Grant: 22 points, 6 rebounds, 5 assists\nKelly Olynyk: 13 points, 4 rebounds \n\nDetroit used big third quarters from Grant, Olynyk, and Josh Jackson to build a lead.",
    "609": "The @DetroitPistons wrestle the lead right back as we head for the 4th in Motown! #Pistons https://t.co/mV6dZ9qpZi",
    "610": "@DodaLu @PistonsHooper @DetroitPistons This is phenomenal content and I am so happy to have it in my twitter feed. Thank you.",
    "611": "@DetroitPistons It’s time to retire this man’s number https://t.co/SbA1NxtWNC",
    "612": "I’d love to know the series of events that took place for KIA to be the automotive sponsor of the Detroit Pistons.",
    "613": "@DetroitPistons where is it playing on the radio online?",
    "614": "Fire Detroit Pistons head coach please!!!!",
    "615": "Watching a pair of former @ZagMBB’s tonight in Detroit as @KellyOlynyk and the @DetroitPistons host @jalensuggs and the @OrlandoMagic #UnitedWeZag",
    "616": "@NFLandNBAexpert @Pistons_PR @DetroitPistons @EliasSports Jalen is no where near the amount of rebounds that cade has and probably never will.",
    "617": "#Pistons have a lot of their veterans off the bench. It shows. Cory Joseph, Kelly Olynyk alongside Jerami Grant calming this game down for the #Pistons. Turnovers have stopped and they are hitting threes. Detroit back in the lead by three late in the third.",
    "618": "@SLAMonline @DetroitPistons Don’t do that!",
    "619": "@DetroitPistons @Kia The product of Pistons' rebuilding project.",
    "620": "The Detroit Pistons drafted Spud Webb in the 1985, 4th round, pick 87. Released in training camp.",
    "621": "Next step for the @DetroitPistons is to get a inside the paint player to make things easier",
    "622": "bad ball movement, bad shot selections, offense doesnt look really good. Grant iso plays cant be the solution. #DetroitUp #detroitpistons",
    "623": "@OrlandoMagic @DetroitPistons @BallySportsFL @969thegame @jalensuggs GO Magic!!!! 🏀",
    "624": "Hey @DetroitPistons, we want @LukaG_55!!",
    "625": "@EliNSavit @CadeCunningham_ @DetroitPistons As a proud Washtenaw county resident, I'm sure you've heard about the big football game... on Tuesday Eastern plays for bowl eligibility!!",
    "626": "I hate that it is against my Detroit Pistons but I am SO HAPPY to see Franz and Mo Wagner playing and excelling in the NBA!\n\n#ProBlue",
    "627": "@NBA @DetroitPistons 8 pts 3 rebs 2 assists",
    "628": "Noticing though (could be wrong… ) team need to give the ball to Cade more.. trust him.. he’s been open, wanting the ball &amp;  team not passing the him much (despite that fluke shot) #Pistons #DetroitPistons #DETvsORL #DetroitPistonvsOrlandoMagic #NBA #NBA75",
    "629": "ALERT: New high roller bet posted!\nA bet has been placed for $17,981.61 on Detroit Pistons - Orlando Magic to win $47,651.27.\nTo view this bet or copy it https://t.co/anPUvozkfW https://t.co/AiT0YVRGNu",
    "630": "You'd get better entertainment value for your time and money literally by watching pee wee league basketball than watching the Detroit Pistons. Jalen Green is the #1 pick. Sale the team please.",
    "631": "@DetroitPistons y’all sorry as hell btw",
    "632": "2 bad teams being competitive, got to love it my @OrlandoMagic v @DetroitPistons 💪🏾",
    "633": "Number 1 overall pick Cade Cunningham #2 of the Detroit Pistons makes his NBA debut against the Orlando Magic after missing the first 4 games due to a sprained ankle 📸: @nicantaya https://t.co/3Py8Ihuzlf",
    "634": "@NBA @DetroitPistons @PrinzStylz lefty!\n\nYour new favorite player plays on my pistons!",
    "635": "@MarcThePilot95 Sounds like Mom's having a great time! https://t.co/nUv76zZqof",
    "636": "@DetroitPistons My mom said “Thank you, this is faaaaantastic.”  #Pistons",
    "637": "How tf y’all ain’t Tayshaun Prince number retired @detroitpistons",
    "638": "@Pistons_PR @DetroitPistons @EliasSports Already breaking records",
    "639": "@DetroitPistons @BallySportsDET @j_josh11 Jackson does that every game … but no recognition… but once pistons start wining… league will notice his defensive skills …",
    "640": "@MarcThePilot95 Happy birthday Mom! Hope the fam is enjoying tonight's game. Let's go #Pistons!",
    "641": "@DetroitPistons can we please fire the head coach….he has no clue how to coach offense…everyone stands around the three point line and watch to see who’s going to shoot instead of cutting to the basket or hell just moving without the ball",
    "642": "@Pistons_PR @DetroitPistons Pistons legend .... ZELLY https://t.co/JOVCoM4ek7",
    "643": "@mattjhill71 @Pistons_PR @DetroitPistons @EliasSports LMFAOOO",
    "644": "Detroit Pistons Playing With More Energy &amp; Confidence Tonight",
    "645": "@MarkJKim_ Mark I’m sure I have missed it, do you have Detroit ties? Are so you just like the Pistons?",
    "646": "@DetroitPistons @IsiahThomas Those were great times ❤Isiah",
    "647": "Celebrating my beautiful mom’s 56th Birthday with a @DetroitPistons game!!! #Pistons https://t.co/ClBplJJi73",
    "648": "@Pistons_PR @DetroitPistons @EliasSports Why is killian in the game still",
    "649": "It’s is me on the jumboton at the Detroit Pistons Game! I was selected as a Detroit Pistons Game Changer for my work with @Detroitk12! My school will receive $1500 and I get a jersey and banner! I’m so blessed by this honnor! @Dr_Vitti https://t.co/UY4i6FV535",
    "650": "@Pistons_PR @DetroitPistons Rebraca had the best hair in the nba too.",
    "651": "Ayooo wtf going on in the Detroit Pistons halftime show, shit has me dying 😭",
    "652": "@DetroitPistons @BallySportsDET @CadeCunningham_ Wish I could watch. No Pistons on my 100’s of channels except a paid subscription channel. Only one NBA game at all. Me thinks the NBA would not be pleased.",
    "653": "@DetroitPistons @JeramiGrant @Dreamville_33 @SaddiqBey @TreyLyles Get killian the F off this team already @DetroitPistons",
    "654": "can’t believe i’m about to watch a detroit pistons game just for cade cunningham 😭",
    "655": "@NBA @DetroitPistons He's a bust",
    "656": "@NTFCNathan @mikey_2599 @NBA @DetroitPistons Proof they rigg the game",
    "657": "@DetroitPistons @JeramiGrant @Dreamville_33 @SaddiqBey @TreyLyles Cade looks good so far. Let’s keep this energy.",
    "658": "@chrisgier @DetroitPistons @IsiahThomas 😂true dat",
    "659": "@DetroitPistons @JeramiGrant @Dreamville_33 @SaddiqBey @TreyLyles Killian bro. 😐",
    "660": "@DetroitPistons @JeramiGrant @Dreamville_33 @SaddiqBey @TreyLyles Let's pull away in the second half and finish this.\n\n😊♥️♥️♥️♥️♥️",
    "661": "@DetroitPistons @JeramiGrant @Dreamville_33 @SaddiqBey @TreyLyles Amazed they are somehow leading the game at half",
    "662": "Brought that ⚡ energy ⚡  to the first half.\n\n🔹 @JeramiGrant: 13 PTS / 4 AST / 5 REB\n🔹 @Dreamville_33: 9 PTS / 9 REB / 4-6 FG\n🔹 @SaddiqBey &amp; @TreyLyles with 6 PTS each https://t.co/2uF4nofvqn",
    "663": "@NBA @piec_mieczy @DetroitPistons bust",
    "664": "36 first half boards ...   Thirty effing six @DetroitPistons 🔥🔥",
    "665": "Magic trail Detroit at halftime by just a point, coming back from 10 down. Not a well played game by either team. Orlando is giving up a zillion offensive rebounds, but the Pistons can't stop turning it over.",
    "666": "HALFTIME: Pistons 48, Magic 47. Ugly end to the half for Detroit.\n\nJerami Grant: 13p, 5r and 4a\nIsaiah Stewart: 9p and 9r\nSaddiq Bey: 6p and 3\nCade Cunningham: 2 points, 7 rebounds and 2 assists\nKillian Hayes: 3 points and 2 assists",
    "667": "It's a close one at @LCArena_Detroit as the first half comes to a close. #Pistons https://t.co/UFfNm3Hjqk",
    "668": "@BolWrld @DetroitPistons hes just a rookie",
    "669": "Detroit Pistons rookie Cade Cunningham notches first-career bucket [Video] #Pistons https://t.co/4a7bnzqk19",
    "670": "@DetroitPistons Yeah I’m going next week",
    "671": "@ESPNNBA @IsiahThomas @DetroitPistons In the toughest era👀",
    "672": "Fire your mop boys @DetroitPistons",
    "673": "Game stream: Orlando Magic vs. Detroit Pistons https://t.co/UrzOAshBk5",
    "674": "@TURKSAYSHI @DetroitPistons Let's hope it holds up.",
    "675": "@Dallaswhitten10 @DetroitPistons @BigSean gotta’ come to the 313!!",
    "676": "@NTFCNathan @NBA @DetroitPistons everytime the lakers are in a close game, all you see is OH MY FUCKING GOD LEBRON FOR 3. when the celtics are in OT you just see one tweet",
    "677": "@YahooSportsNBA @DetroitPistons Nice lefty layup",
    "678": "Cade Cunningham gets his first NBA bucket 👏\n\n(via @DetroitPistons)\n\nhttps://t.co/wlGVskDzea",
    "679": "@GoblinToAnGoon @NBA @DetroitPistons First game dog",
    "680": "@DetroitPistons @BallySportsDET @CadeCunningham_ let him get reps without killian on the court",
    "681": "@DetroitPistons @BallySportsDET @CadeCunningham_ Start of a legendary career",
    "682": "So thrilled to have witnessed @CadeCunningham_ ‘s first points as @DetroitPistons 🎉🎉🎉 https://t.co/7817U5Cele",
    "683": "@NBA @DetroitPistons He’s doing so bad",
    "684": "Cade Cunningham's first points as a Detroit Piston 🙌\n\nHe is +500 to win Rookie of the Year https://t.co/fEIRRAyHbv",
    "685": "Detroit Pistons - Orlando Magic\nHouston Cougars - SMU Mustangs\nNew Orleans Pelicans - New York Knicks\nPhiladelphia 76ers - Atlanta Hawks\n\nBet slip link: https://t.co/gHcFcGx8YH https://t.co/FAix0pB5XN",
    "686": "🚨 Bring out the MotorCade, Detroit. Cade is in the building. 🚨\n\n@BallySportsDET | @CadeCunningham_ https://t.co/9QM1B2Wa2Y",
    "687": "@NBA @DetroitPistons stop posting him every second",
    "688": "@NBA @DetroitPistons everytime the lakers are in a close game, I see 50 tweets abt it. the celtics are in the second OT and you haven’t said one thing",
    "689": "@NBA @DetroitPistons First of many 😎",
    "690": "@NBA @DetroitPistons Overrated + he’s a bust so who cares",
    "691": "FYI, December 18-19 all three Detroit sports play at home. I’ll be at all three games. 😁 #Pistons #LGRW #OnePride",
    "692": "Got to witness @CadeCunningham_ first regular season points tonight!\n\n#detroitpistons #detroitbasketball https://t.co/Jn0w6nAeEW",
    "693": "The lefty lay-in is good 💰\n\nCade Cunningham opens his scoring account with the @DetroitPistons! #NBARooks \n\nPistons and Magic into Q2 on NBA League Pass. https://t.co/JU04rLgo8w",
    "694": "Saddiq Bey for 3!! 🔥\nLet's go Detroit! #Pistons \nPistons lead against the Magic: 40-32 in the 2nd quarter",
    "695": "Cade’s first NBA points!! #Pistons @DetroitPistons let’s goooooooo https://t.co/hGdnBtK6Lb",
    "696": "Pistons having a block party that's Detroit D ♥️♥️♥️♥️♥️",
    "697": "@KMartinPhotog @DetroitPistons They look good brother... Pistons defense looks solid.. great bench depth...\n\nI know it’s Orlando... but they look reinvigorated \n\nCade has Superstar written ALL over him",
    "698": "@DetroitPistons @BallySportsDET @j_josh11 🚫\n\nNot in the D",
    "699": "@DetroitPistons offer something for him https://t.co/bIegRrfYY6",
    "700": "Pistons Basketball. 💪🏾♨️ (via @DetroitPistons) https://t.co/2B2zrIrYP4",
    "701": "I wish I was at home to watch a new era of @DetroitPistons basketball in person. I'll catch them over here in Cali. #DetroitRoots #CadeCunningham",
    "702": "Josh Jackson about that ACTION! ❌\n\n@BallySportsDET | @j_josh11 https://t.co/4hKZj7uWb3",
    "703": "#NBA: @detroitpistons fans loving @cadecunn1ngham’s hustle early in his #NBA debut! #NB...\n \nhttps://t.co/um2nl3Tg8m\n \n#Basketball #NationalBasketballAssociation #NationalBasketballAssociation #NBARooks https://t.co/6WPZBGrMzi",
    "704": "@BolWrld @DetroitPistons 2 assists, 6 rebounds, hustling",
    "705": "Kelly Olynyk has been a fantastic signing for the #detroitpistons",
    "706": "@DetroitPistons Scrappy Pistons we back",
    "707": "Bad Boys Pistons New Gen. Edition. (via @DetroitPistons) https://t.co/ROVBQp1aj7",
    "708": "@DetroitPistons He’s 0-5 from the field",
    "709": "Hey @YouTubeTV! I’m a big fan and longtime subscriber, but tonight I’m missing @CadeCunningham_’s first @DetroitPistons game because you no longer carry Bally Sports. Bummer! Work it out please. I’ll pay more or subscribe as an add on! #DetroitBasketball #Pistons",
    "710": "@DetroitPistons WEAVER 🐐",
    "711": "No. 1 overall draft pick Cade Cunningham of the Detroit Pistons is making his NBA debut on Saturday night against the visiting Orlando Magic. https://t.co/ASipsFhTZ9",
    "712": "@DetroitPistons Troy Weaver a goat",
    "713": "@DetroitPistons troy u did it again",
    "714": "That's a DEEETROIT basketball. https://t.co/tRqHCNrmPw",
    "715": "@mick_cloudy @DetroitPistons @BigSean You lucky duck!! Man I wish I could just get out of Montana every once an awhile",
    "716": "@SLAMonline @DetroitPistons who’s watching a magic pistons game 😂🤣",
    "717": "Let’s go @DetroitPistons!",
    "718": "Re\nJec \nShon\n\n@DetroitPistons",
    "719": "Cade serving up some Beef Stew tonight! Tune in to see Cade's first NBA game. He's going to be special. (via @DetroitPistons) https://t.co/IrlbEuOx90",
    "720": "@NBA @DetroitPistons Post Tatum",
    "721": "The Detroit Pistons are playing amazing playing with fire 🔥 in their hearts this is the 2003 2004 pistons git an grind let's goooooo",
    "722": "Pushing the pace, passing the rock 👀\n\nCade Cunningham drives and dishes to Isaiah Stewart for 2. \n\n@DetroitPistons and Magic head into Q2 on NBA League Pass ➡ https://t.co/V0kkYEEIkG https://t.co/df3NuNKtaD",
    "723": "Special delivery for Beef Stew 📬\n\n@BallySportsDET | @Dreamville_33 https://t.co/xPuHg5e3d2",
    "724": "Settling in and watching the game I’ve been looking forward to all week—@CadeCunningham_’s debut with the @DetroitPistons! \n\nIf there were any other sports matches today I am unaware of them. \n\nGo Pistons.",
    "725": "@BallySportsDET @DetroitPistons Still got time to get a deal done with dish network @BallySportsDET so maybe all the fans can catch the last quarter and Cade making a three at the buzzer to win our first game LFG!",
    "726": "@B_Street_Bully @InkKing1990 @NBA2K @NBA2K_MyTEAM @DetroitPistons Is he any better catch and shoot than say Allan Houston? I’m guessing no",
    "727": "Good to be back on home court.\n\n🔹 @JeramiGrant: 10 PTS / 4 REB / 3-5 FG\n🔹 @Dreamville_33: 4 PTS / 3 REB / 2-3 FG\n🔹 @SaddiqBey: 3 PTS / 1 AST / 1-2 3PT\n🔹 @CadeCunningham_: 2 AST / 6 REB / 8:33 MIN https://t.co/5Gm3zWH35s",
    "728": "You gotta really love basketball to watch Pistons/Magic.\n\nI am watching, for the record. And Detroit's offense is...2015 Suns-ish",
    "729": "Detroit Pistons game score vs. Orlando Magic: Live updates from Cade Cunningham debut https://t.co/Osq88G6KiU",
    "730": "It's a five point lead for the @DetroitPistons after 12 minutes. #Pistons https://t.co/l550YM2Xvz",
    "731": "@NBA @DetroitPistons This kid could do it all. He’s the perfect size for a ball handler in the game today. Great on both sides of the ball with a good enough jump shot. Sky is the limit 🌌",
    "732": "@phxIIymxkan Me when I’m enjoying Detroit Pistons basketball but Olynyk enters the game https://t.co/W47K0N5wqG",
    "733": "@NBA @DetroitPistons Giddey is better",
    "734": "Watching the @DetroitPistons Get Busy! \n@masonradio313\nPlease Play \"CONEY ISLAND\" by 3269Chise &amp; P-DOT!  PLEEEEEEEEASE !",
    "735": "The Pistons offense flows better with Cade as the decision maker. make Cade our PG and Killian our SG let Killian become a shooter. @DetroitPistons",
    "736": "@NBA @DetroitPistons Cade learnt to play D at #GIA with @OSUMBB",
    "737": "Will KD secure 10 rebounds vs the Detroit Pistons tomorrow? 🔒👀\n\nBack - or challenge your favorite players on the TakeSide app NOW! ⁠\nComment your take below! 🔥 https://t.co/uCXWH4yA9N",
    "738": "@NBA @DetroitPistons You have to appreciate Cunningham debuts, this draft class is truly something else",
    "739": "@DetroitPistons My photoshopping skills are next level https://t.co/cGMwxxie4m"
}