{
    "0": "all i want for my bday is for the @nyknicks to win. Pls n thnx.",
    "1": "@hhpthebook @_mthagoon @nyknicks His job was to score, we had no offense without him.",
    "2": "@nyknicks Rose pls come back😞",
    "3": "#NBA: New York +4 (+110)\n     Knicks vs Clippers\n\nFollow me for more #NBAPicks https://t.co/GcWvCCZMXP",
    "4": "@nyknicks Quick is going to work tonight! Believe that!",
    "5": "@KnicksMSGN @WaltFrazier @nyknicks All I see are 2 GOATs",
    "6": "@MonkeyboyBTC2 @BoredApeYC @LAClippers @nyknicks I don’t sell them period, they are free.",
    "7": "@El_Meetch @SKB1ER @hhpthebook @nyknicks @spidadmitchell Facts. The offense needs to be run through RJ, JR needs to stop bring the ball up, he is not a point forward.",
    "8": "@nyknicks lol IQ will be lucky to see 10 minutes tonight",
    "9": "@nyknicks There's not that many games left in the season, is it really that hard to start McBride at least once",
    "10": "@LindorHOF @nyknicks Blame it on Javier Baez👎",
    "11": "@nyknicks I guess?",
    "12": "@nyknicks On the tank",
    "13": "Let's work. https://t.co/hJPGFrJPih",
    "14": "ALERT: New high roller bet posted!\nA bet has been placed for $8012.18 on Los Angeles Clippers - New York Knicks to win $11,537.53.\nTo view this bet or copy it https://t.co/9mJNPP3rw9 https://t.co/1qpkcF15bu",
    "15": "@nyknicks Randle should sit",
    "16": "@nyknicks This franchise really knows how to ruin their fans lives on a daily basis",
    "17": "Los Angeles Clippers - New York Knicks\n\nBet slip link: https://t.co/dW8ic7eKWY https://t.co/qiBNIluR1y",
    "18": "🚨🚨FREE PLAY🚨🚨\n\nClippers -5 vs New York Knicks\n\nNYK have lost 7 in a row and last 11 of 12. There 2-10 ATS last 12! While LAC have won 5 straight and won 7 of their last 8. They are 7-1 ATS during that stretch. Clippers winning by double digits tonight. LETS CASH! 💰 https://t.co/KK0tOf8aMd",
    "19": "I cannot believe I’m about to watch 48 minutes of New York Knicks basketball",
    "20": "Are Knicks enabling Julius Randle's issues? #NewYork #Knicks #NBA https://t.co/MGHi6C6Qu8",
    "21": "New York Knicks +5\n\nTrust the process..... https://t.co/tuQoqwQX7v",
    "22": "@nyknicks Korn said it best: \"Sick of the same old thing. So I dig a hole. Bury pain\"",
    "23": "@nyknicks How the hell fournier and burks get starting minutes is beyond me… especially the latter! Thibs dropped this 🤡",
    "24": "@hhpthebook @nyknicks Agree to disagree when necessary;peace is healthy",
    "25": "FREE LOCK ALERT 🚨 SUNDAY GAME OF THE CENTURY ALERTS🚨:\n\nNBA🏀:\n\nNEW YORK KNICKS +5.5 ($100 TRILLY GOC OF THE WEEK)",
    "26": "@nyknicks FIRE THIBS",
    "27": "@nyknicks IQ the NARCISSIST 🤡",
    "28": "@nyknicks Change something",
    "29": "@nyknicks damn",
    "30": "@dereck2x @nyknicks Julius looking like he is in the sunken place. LoL.",
    "31": "@nyknicks Burks no!!!!!!!!",
    "32": "@nyknicks Me, everytime the Knicks are on national television https://t.co/7KtoleslRz",
    "33": "Hey @alanhahn &amp; @wallyball I've been saying all season long the @nyknicks need to run the offense thru @RjBarrett6 He can score and facilitate after breaking down the defense. The future is now!",
    "34": "@nyknicks Thibs https://t.co/w9It0x6Je4",
    "35": "@nyknicks Nah this is treason",
    "36": "@nyknicks How will we lose today",
    "37": "@nyknicks This is elfrid round 2",
    "38": "#Knicks #Clippers Will the @nyknicks get clipped?",
    "39": "@nyknicks Burks is not a point guard. Shouldn’t be playing more than 15 minutes a night. Start Deuce and fire Thibs. Sick of this shit.",
    "40": "@nyknicks Brilliant lineup strategy in response to being 3-17 in your last 20 games with the same starting 5.",
    "41": "@nyknicks 2nd one looks staged",
    "42": "@nyknicks I just don’t understand when u lose 7 games in a row what are we gonna fucking lose from trying something new",
    "43": "@nycSportsfan718 @jbryant3 @nyknicks @NY_KnicksPR I'm on board with you now. Just yell at me next time",
    "44": "@nyknicks Well said and Yankees and Giants had stand up guys like Eli and Jeter..so sad and pathetic how bad the Knicks have fallen 🙄https://t.co/gL6PsVFwKs",
    "45": "@nyknicks We tanking!",
    "46": "@hhpthebook Lol dude I’ve been posting #firethibs and Hire @jbryant3 for like a month now and recently been adding the @nyknicks &amp; @NY_KnicksPR so someone can get the message but I’ve failed 😞 lol 😂",
    "47": "@nyknicks I will watch ten minutes of it just to see RJ.",
    "48": "@nyknicks Our coach just doesn't care does he",
    "49": "@nyknicks Alexa, please provide an example of the word, \"understatement.\"",
    "50": "@AlecBurks10 @J30_RANDLE @RjBarrett6 @nyknicks still can’t believe y’all did me like that 🥺 https://t.co/phUWIRqvDi",
    "51": "@nyknicks A team with any common sense would realize that our chances of making the playoffs are slim to none and because of this would start playing the kids. But nah let’s keeping run burks at the point",
    "52": "@nyknicks *throws up a little*",
    "53": "@nyknicks THE BEIJING DUCKS OWN YOU",
    "54": "@nyknicks Can we fucking get burks out the lineup already was the game losing missed free throw not enough already",
    "55": "@nyknicks Oh no",
    "56": "@nyknicks ALEC BURKS IS STARTING AGAIN. PLEASE END THIS https://t.co/ndIH34cGJy",
    "57": "@nyknicks i stg it’s the most frustrating thing seeing burks start",
    "58": "@nyknicks Don’t even post this at this point we know the deal 😢",
    "59": "@nyknicks Thank you for reminding me that we play so I know not to turn on my tv",
    "60": "@nyknicks Stop starting Burks at point guard https://t.co/L5ojOgC9bl",
    "61": "@nyknicks Burks…",
    "62": "@nyknicks Oh brother here we go again!",
    "63": "@nyknicks Thibs jus doesn’t even wanna win lmao",
    "64": "@nyknicks Nice",
    "65": "@nyknicks Horrible nobody cares",
    "66": "@nyknicks Play deuce",
    "67": "@nyknicks Here we go again",
    "68": "The five tonight in LA 🖐 https://t.co/Z8IQ0nzi9m",
    "69": "@FredKatz When you're 3-17 in your last 20 games, it makes so, so, so much sense for the @nyknicks to pursue the same losing lineup that has landed them in lottery land.",
    "70": "@ClipsUniTracker @Ayegreggy626 @nyknicks @LAClippers @cryptocomarena What’s happening on the 14th, @ClipsUniTracker? 🤔",
    "71": "Kith New Era for New York Knicks Low Crown Fitted Hat Cap Size 7 5/8 Black New https://t.co/dnsR4WwL6h eBay https://t.co/LGu8KS3vji",
    "72": "Bruh please win a game @nyknicks fuck them Clippers",
    "73": "@hhpthebook @nyknicks True to this not new to this (Twitter) sounds like rubbish nos but i been saying this too since they pulled kemba da first time…this not it ..we need to build around RJ n Deuce move Julz for some roll players everyone else expandable too",
    "74": "ALERT: New high roller bet posted!\nA bet has been placed for $12,500.00 on Los Angeles Clippers - New York Knicks to win $24,000.00.\nTo view this bet or copy it https://t.co/X5n7AfOg8C https://t.co/L0Znct3tKH",
    "75": "Los Angeles Clippers - New York Knicks\n\nBet slip link: https://t.co/uTabriHdqD https://t.co/JjqwyIJyNj",
    "76": "see what you did @nyknicks https://t.co/0cjxuBFxku",
    "77": "LETS GO @nyknicks",
    "78": "@nyknicks Some New York legends going at each other on the same night lol https://t.co/waWI0TwNtF",
    "79": "@NBA_NewYork It's true...the point guards the Knicks are using are different, if by \"different\" you mean that they just can't play point guard.",
    "80": "@PlayoffBoundNYK @nyknicks I mean, it’s messed with me and I’m on my couch. Imagine being on the court for these collapses",
    "81": "@PlayoffBoundNYK @nyknicks We need some wins just to get everyone’s heads right at some point. Season has messed with the psyche of guys on the team.",
    "82": "@nyknicks “work” would be a severe understatement.",
    "83": ".@nyknicks vs Clippers - coming up LIVE on the American Forces Network📺🌍\n\n#NBA #ForTheTroops🇺🇸 https://t.co/n2E0UkXoBD",
    "84": "@nyknicks do you guys mind if we take Randle?",
    "85": "@ClipsUniTracker @Ayegreggy626 @nyknicks @LAClippers @cryptocomarena This schedule has all the uniforms they’re wearing the rest of the season, y’all. https://t.co/B4tEw6MdZl",
    "86": "@nyknicks Honest question.. do all teams make these embarrassing pre-game tweets? Especially when they’re this bad?",
    "87": "@nyknicks What the tank strategy today? Traditional blow second half lead and make terrible substitutions? Surprise me.",
    "88": "@nyknicks Another 1am L for the Knicks, Burks starts at PG and continue not to get a 1st half assist, Thibs literally killing this mans career",
    "89": "Toronto is the worst offensive basketball team outside of the New York Knicks",
    "90": "@nyknicks lets get that top 5 pick!",
    "91": "@suckmeoffdumdog Also dudes in Brooklyn nets Jersies whilst wearing a new York knicks hat",
    "92": "@nyknicks I’m pro tank, but please win one time at least, just for my sanity.",
    "93": "@nyknicks We not winning so just tank",
    "94": "@nyknicks Stop blowing leads",
    "95": "@nyknicks Not waisting my time watching",
    "96": "@nyknicks WE OWN THE CLIPPYS",
    "97": "@nyknicks don’t lose",
    "98": "Got work to do 🔒 https://t.co/avS21jYKKM",
    "99": "Uniforms for New York Knicks vs Los Angeles Clippers at 7:00 PM on ESPN. \n\n#NewYorkForever #ClipperNation https://t.co/9SX8AibHcY",
    "100": "@flynns_page @nyknicks If you look at my feed most of the people I interact with is crazy cool. I muted and blocked a few, but I ain't up for that nonsense.",
    "101": "@nyknicks Ready for another Late night L",
    "102": "@InvokableTv ur weird i was saying new york knicks",
    "103": "@knickswintrack @nyknicks It’s already been announced by thibs",
    "104": "@hhpthebook @nyknicks Same here but being apart of twitter and the knicks nation fb page I’d say like 65% of the fan base just shits on each other. Instead of having a debate/discussion it goes straight to name calling most the time. That’s just my experience.",
    "105": "@ryansnuggs @Joey_badaboom_ @BoredApeYC @LAClippers @nyknicks Unfortunately not in LA but it’s super dope you do this 🔥",
    "106": "@rachelsellers @Ayegreggy626 @ClipsUniTracker @nyknicks @LAClippers @cryptocomarena I read it as both teams wearing blue at the same time on the court. Lol",
    "107": "@nyknicks Please play McBride",
    "108": "@flynns_page @isabellalexande @nyknicks So true",
    "109": "@flynns_page @nyknicks Been a Knick fan all my life, been on Twitter and I'm not disrespectful.  I was raised right!",
    "110": "@JTandJBfan1 @Iukeswanson @nyknicks I’m not sure we do tbh but thanks",
    "111": "@nyknicks @J30_RANDLE  numbers aren't as good as they were last year but he's not mentally as strong",
    "112": "@nyknicks Please win man",
    "113": "@Ayegreggy626 @LawlersLawYo @ClipsUniTracker @nyknicks @LAClippers @cryptocomarena Ohhhh hahaha my bad",
    "114": "@nyknicks It def wasn’t short weather today here lol",
    "115": "@rachelsellers @LawlersLawYo @ClipsUniTracker @nyknicks @LAClippers @cryptocomarena Guys I'm not saying wear blue while they're wear blue at the same time",
    "116": "The Knicks are utterly woeful, especially on defense, where they've allowed 12 straight opponents to top their team total. And guess what? \n\n@D_Farmer is betting to make it unlucky 13 against New York tonight. \nhttps://t.co/KRS2aZ4sjq",
    "117": "@ICabrera10 @cryptop56816653 @ABC Dude I marched against war criminal Bush Jr. Same with calling out Biden for this idiotic blunder. You know nothing and make it clear, you live in New York yet only tweet out Russian propaganda at least try to look real follow the Knicks or something bot.",
    "118": "@nyknicks oh Boy ‼️‼️ , lookin all’ Dapper. 😈",
    "119": "@nyknicks Please don’t post the starting lineup",
    "120": "@LawlersLawYo @Ayegreggy626 @ClipsUniTracker @nyknicks @LAClippers @cryptocomarena Even I would be confused 😂",
    "121": "The @nyknicks are the officially intramural team of NYC.",
    "122": "@nyknicks Rangers are on we good",
    "123": "@SoyCristianRey Clippers 109- New York Knicks 112 #CristianRey  ✌🏼",
    "124": "@nyknicks Of losing",
    "125": "@nyknicks noone is staying up for this 20 pt blowout",
    "126": "@nyknicks Another game of me staying up past 12 when I got school the next morning to see the Knicks lose",
    "127": "Tonight's starting lineup for the New York Knicks:  Burks, Fournier, Barrett, Randle, Robinson https://t.co/bVWH4AMCA2",
    "128": "@nyknicks holy drip",
    "129": "@nyknicks start both of them",
    "130": "Late night action in LA 😎\n\n#UltraDrip https://t.co/i2ogwRjnTF",
    "131": "@isabellalexande @hhpthebook @nyknicks People literally skim through their feeds looking for a tweet or comment to lash out at its ridiculous.",
    "132": "@hhpthebook @nyknicks Knick fans ain’t built like that. I bet Toronto fans are nice to each other.",
    "133": "@madebyjuan @nyknicks No sir, they don't know.",
    "134": "The @LAClippers and @nyknicks tip off in under an hour!\n\nDon't miss out on what @Gamble_IQ has as his prediction and top bet to place on the action 🔗 https://t.co/apWli38o2U https://t.co/rCxqTxwv86",
    "135": "@hhpthebook @nyknicks Been saying it since his rookie year his presence on defense plus the raw potential he has and he only scores on put back imagine with a pg even with elfrid he was scoring 20 plus off lobs we have to franchise tag him lol",
    "136": "@hhpthebook @nyknicks Exactly man. These kids they get in their feelings quick and start with their keyboard gangsta ish. They don’t know man. They just don’t know.",
    "137": "@JonnyGTree27 @nyknicks I just like watching him play. He goes hard.",
    "138": "@NBA_NewYork For what???? Is there so@etching to smile about concerning the Knicks??",
    "139": "NBA Late\n\nRiding another dog tonight in Primetime.\n\nNew York Knicks +5.5 1.1u\n\nLFG",
    "140": "The New York KNICKS https://t.co/8bqUNBuy5L",
    "141": "@nyknicks where the outfit flicks at",
    "142": "@ESPNNY98_7FM @NYRangers Please explain why one of the greatest teams in the NHL this season is bumped to 1050am for a game that starts at 7:00. While the basketball team @nyknicks can’t buy a win and have a loosing record all season?! The Rangers always get bumped!!!",
    "143": "ALERT: New high roller bet posted!\nA bet has been placed for $15000 on Los Angeles Clippers - New York Knicks to win $28,350.00.\nTo view this bet or copy it https://t.co/FsQf0nOwy9 https://t.co/ctN40Q1sdX",
    "144": "Los Angeles Clippers - New York Knicks\n\nBet slip link: https://t.co/gyX4srzb6V https://t.co/GwOrxZhqme",
    "145": "@FromNYtoLA1 @nyknicks @LAClippers @ESPNNBA @NBA Hopefully my clippers get it rolling, no offense. Cuz I just wanna get outta the play in.😫",
    "146": "We out here @nyknicks #NewYorkForever https://t.co/IXLilM5G0m",
    "147": "@KnicksNation @nyknicks Thanks",
    "148": "New York Knicks: Knicks rookie to continue in this bigger role https://t.co/z5V9EGu8fC",
    "149": "@nyknicks Can we get hungry for a win tonight ?",
    "150": "Jericho Sims to keep Knicks backup role as plantar fasciitis sidelines Nerlens Noel #NewYork #Knicks #NBA https://t.co/Z3o0qsstv1",
    "151": "New York Knicks Starting Lineup 3/6\n PG: Alec Burks\n SG: Evan Fournier\n SF: RJ Barrett\n PF: Julius Randle\n C: Mitchell Robinson\nhttps://t.co/o75oZ8vnE8",
    "152": "@hhpthebook @Troutprophet @nyknicks 🤣🤣🤣He’s a Troll for sure!",
    "153": "@hhpthebook @nyknicks I agree bro, this season has had fans Wilding out here. I've had good debates on here in the past but this year folks have just gone plain crazy 🤷‍♂️",
    "154": "when do the @nyknicks play these bums again? https://t.co/XcDWQFXOAJ",
    "155": "@LawlersLawYo @ClipsUniTracker @nyknicks @LAClippers @cryptocomarena Not really",
    "156": "#knicks#in#the#city#of#angels#new#york#knicks#vs#los Angeles#Clippers https://t.co/EzuIX24rez",
    "157": "@Knicks_SNOB @nyknicks yawn.. I hope you learn from the reaction you have gotten to this tweet.  Just stop.. Plus posting a pick like that of Randle to hightlight your tweet is also low..",
    "158": "@kirkgoldsberry @kevinwildes @celtics @Suns @memgrizz @dallasmavs @Lakers @BrooklynNets @nyknicks @nuggets The fact that it’s a 15 game sample size. That jumps out pretty quick",
    "159": "@Ayegreggy626 @ClipsUniTracker @nyknicks @LAClippers @cryptocomarena It would be confusing for the teams and referees. Lol",
    "160": "@badseedsteve @Troutprophet @nyknicks You're chatting with someone I muted. 🤣🤣🤣",
    "161": "@hhpthebook @nyknicks No thanks",
    "162": "@ClipsUniTracker @LawlersLawYo @nyknicks @LAClippers @cryptocomarena Why can't the clips wear their blue uniforms like the knicks here in the pic. Going all blue would look tuff.",
    "163": "New York Knicks’ Julius Randle fined $50,000 for shoving referee, Phoenix Suns’ Cameron Johnson https://t.co/zL0Iei4h6b https://t.co/6gZgIKdWno",
    "164": "Caught the Wizards ML when they were down 12, just won 💼🤞🏼 send us home @nyknicks",
    "165": "Randle fined $50K for shoving Johnson in Knicks' wild loss\n(New York Knicks)\nhttps://t.co/fRP9Z9eKgX",
    "166": "@SoyCristianRey #CristianRey angeles clipepers 112 new York Knicks 109",
    "167": "@hhpthebook @nyknicks They should pay him on the strength that he’s our BEST interior defender &amp; Constantly cleaning up the mess from our players allowing dribble penetration! It’s no wonder Mitch is gassed at the end of games. Running around all over the place with Randle giving no help.",
    "168": "@hhpthebook @nyknicks Two games isn’t gonna get him paid and Ayton had a bad game which Knick fans know all about watching Randle and RJ be inconsistent all year",
    "169": "@jamesdampney23 @Foxtel @NBA @nyknicks And the Lakers.",
    "170": "Hey @Foxtel, I know you are limited in the @NBA games you can show, but please find a way to stop showing the dreadful @nyknicks every second game. Signed, all Aussie NBA fans (surely)",
    "171": "I’m excited for Pelicans-Nuggets, but that’s really just an appetizer for tonight’s main event:\n\nClippers vs Knicks.\n\nL.A. vs New York, baby.\n\nThis is gonna be fun.",
    "172": "@SoyCristianRey Clippers 115- new York knicks 103 #CristianRey",
    "173": "5 weeks left in the regular season, so 2nite, I'm gonna B a @nyknicks fan: #NewYorkForever #BEATCLIPPERSPLEASE #NBA75 🏀 https://t.co/vsc7MU7yTB",
    "174": "Hey @ESPNNBA @espn I see your favorite team the @nyknicks play later tonight with their lousy record. Thanks for fitting the @cavs and @Raptors in tonight.",
    "175": "It’s been 3,229 days since the New York Knicks last won a playoff series #bingbong 🤡",
    "176": "Wow. Where can the @nyknicks get a @dariusgarland22?! Dude is amazing.",
    "177": "@Troutprophet @hhpthebook @nyknicks @hhpthebook Where do you find these Kids with their Bullshit Stats🤣🤣🤣? Because ONLY CASUALS look at the Stat line instead of the game. Casual My Ass !! I’ve been involved in Basketball longer than you’ve been alive !! Stop IT! Your Embarrassing yourself!!",
    "178": "I wanna watch the Knicks game tonight but every-time i watch it they disappoint me. @nyknicks",
    "179": "New post (New York Knicks vs. Los Angeles Clippers Pick - NBA March 6, 2022) has been published on The Sports Geek - https://t.co/6yzSb0V8hY https://t.co/PtUfYssJec",
    "180": "@hhpthebook @nyknicks He fuc? Crazy, time for him and the coach to go!!!",
    "181": "@Troutprophet @hhpthebook @nyknicks Yeah looks good on paper . 19.7/10/5. But AGAIN you conveniently left out all the Stats &amp; Intangibles that I gave you . Casual Fan ?? I FORGOT MORE ABOUT BASKETBALL THAN YOU KNOW, Kid !!🤣🤣🤣",
    "182": "@nyknicks @espn @MSGNetworks @BetMGM With the players available for this game, I would say this is an L for tonight or by 12:30 in NY time",
    "183": "@nyknicks @espn @MSGNetworks @BetMGM I'll be sure to stay up late to watch...bwahahaha...NOT",
    "184": "@Troutprophet @hhpthebook @nyknicks And this is the guy you want taking a shot at the end of games",
    "185": ".@nyknicks' @J30_RANDLE fined $50,000 for altercation\nhttps://t.co/VkjzIjnOc1",
    "186": "@Troutprophet @hhpthebook @nyknicks On court awareness is abysmal. When the Double comes you can count on him Turning it over.",
    "187": "@Troutprophet @hhpthebook @nyknicks When’s the last time he hit a big shot or free throw ? You focus on the Stats too much. But you fail to mention the ones I just gave you. Here’s some more. 5.2 Ass./3.5 TO per game. 41% shooting. 30% from 3.",
    "188": "Bet my ps5 the Knicks win today @nyknicks get it done",
    "189": "The Kings are listing Jeremy Lamb as questionable vs. the New York Knicks on Monday due to left hip soreness.",
    "190": "Los Angeles Clippers (1.54) v \nNew York Knicks (2.81) \n07.03.2022 - 04:00\nhttps://t.co/V2othaEBQo\n\n#NBA \n#Basketball https://t.co/CTS7lYqZjl",
    "191": "@Troutprophet @hhpthebook @nyknicks Leads the team in Turnovers. At the most crucial part of games. Talks to the Refs more than his teammates. He can’t close out games. His defense is bad. His help defense even worse! At the bottom of the league in efficiency for a high usage player.",
    "192": "Honored to host the CYO New York Knicks Clinic today for over 300 student-athletes. https://t.co/Sg1kZezfZC",
    "193": "New York Knicks’ Julius Randle fined $50,000 for shoving referee, Phoenix Suns’ Cameron Johnson https://t.co/ehT4zCu1UR",
    "194": "@hhpthebook @nyknicks Iman shumpert stated many times that he was a leader and people just don't give him credit, Phil Jackson always threw dirt on him and he kept quiet, always took the blame when it wasn't his fault.",
    "195": "Today's NBA Picks: 10:00 PM ET - New York Knicks vs. Los Angeles Clippers - 27 PICKS AVAILABLE: https://t.co/joDntJcUMi #nba",
    "196": "New York Knicks’ Julius Randle fined $50,000 for shoving referee, Phoenix Suns’ Cameron Johnson https://t.co/C2ueBQp24q",
    "197": "Uniforms for tonight's matchup between the Clippers and Knicks\n@nyknicks Statement 🔵\n@LAClippers Association ⚪️\n🕖 7:00 PM PT\n🏠 @cryptocomarena \n📺 Bally Sports SoCal / ESPN\n📻 AM 570\n#ClipperNation https://t.co/tEEWhJhEdG",
    "198": "@hhpthebook @nyknicks I Agree 💯☝🏾",
    "199": "Only have one candy but if i were to get a book game and Knicks to win…what a night @garyvee @veefriends @nyknicks",
    "200": "@hhpthebook @nyknicks i’m on board",
    "201": "@DraftKings New York, we haven't had an NBA team since the knicks left",
    "202": "Knicks New York 🏀🗽\n\n🛒 https://t.co/AZxOqW3Php https://t.co/Z9boBVcjEW",
    "203": "@ryansnuggs @BoredApeYC @LAClippers @nyknicks Nice!!!",
    "204": "@Hardestyespn @ChrisCanty99 @BrooklynNets @nyknicks @MLB @MLBPA @ESPNNY98_7FM Nobody picking up the phone, next time.✌🏾",
    "205": "Talk about NOT getting your $50,000 worth? New York Knicks Julius Randle fined $50,000 for initiating on-court altercation by forcefully shoving Phoenix Suns Cam Johnson, making contact with a game official in attempt to get at Johnson, and for noncompliance #NBA investigation",
    "206": "@nyknicks @obitoppin1 King",
    "207": "@ryansnuggs @BoredApeYC @LAClippers @nyknicks Haven't been to a Clippers game since they moved from the Sports Arena.  Would love to take you up on these one time.  Made it to the Lakers game last night and we picked a good one.",
    "208": "@danielarnold15 @nyknicks 🤣🤣 re2pect",
    "209": "@SoyCristianRey Clippers 117 - 105 New York Knicks #CristianRey",
    "210": "Sources: LSU football lands ex-Arizona State Sun Devils star QB Jayden Daniels\n\n @nyknicks ' Julius Randle fined $50,000 for shoving referee, Phoenix @Suns ' Cameron Johnson\n\nSports talk! \nCall: 800-923-9385\nLive stream: https://t.co/SW2TBCx5R4 https://t.co/6KK9hS3nxI",
    "211": "@TD_mcgaha @nyknicks I try not to kick my friends when they’re down 😂",
    "212": "@SoyCristianRey Clippers 110 - 98 New York Knicks #CristianRey",
    "213": "@FromNYtoLA1 @nyknicks We beat them last time so it's not a stretch that we can beat the clippers again",
    "214": "@Melzb1284 @nyknicks Lmfao or by 20 lol",
    "215": "New York Knicks: Julius Randle’s latest fine: $50k for shove in Phoenix https://t.co/ayRPms2U1D",
    "216": "Will Tom Thibideaux be the .@nyknicks coach next year?",
    "217": "#CristianRey  resultado exacto LA clippers 103- New York knicks 109 https://t.co/beAJPGwgoa",
    "218": "Just grateful my guy @danielarnold15 doesn’t roast me like he does @nyknicks fans after my team takes an L",
    "219": "@ryansnuggs @BoredApeYC @LAClippers @nyknicks Snuggs 🐐! Were you able to make it to Lakers vs Clippers this time?",
    "220": "@nyknicks Another terrible season. Pass.",
    "221": "@blamesdolan_ Vintage @nyknicks",
    "222": "@ryansnuggs @BoredApeYC @LAClippers @nyknicks What a ape",
    "223": "Got my lucky hat on for the #BOOKGAMES Giveaway. Have my Candy @desmondridder and 4 Bookgames tokens. But the hats what is magic! @veefriends @garyvee @Corso52 @nyknicks https://t.co/SDhNEamlRz",
    "224": "@Melzb1284 @nyknicks Right lmfaoooooo",
    "225": "Knicks concerned with Julius Randle's psyche? #NewYork #Knicks #NBA https://t.co/SGuJEbKUCi",
    "226": "@_vc09 @nyknicks Fasho knicks on losing streak I think they come tru for u tonight &amp; bet",
    "227": "Opening Line: New York Knicks (219.5) vs. Los Angeles Clippers(-5) - Linemoves Since: (11) #Knicks #Clippers  Full odds at https://t.co/nUn5OcMhOI",
    "228": "@dadirway_1 @nyknicks Yessir fam. Put the house on Knicks tonight . Ima make a sgp ima hit you",
    "229": "@_vc09 @nyknicks Good shit 💰",
    "230": "Some matchup rankings headed into Knicks at LA for Sunday night.\n\nThis will be the first time Clippers play a non-Rockets/Lakers opponent since losing in Phoenix February 15. \n\nClippers lost in New York 6 weeks ago mainly because they forgot Barrett/Randle are very left-handed. https://t.co/quR5iWaZYh",
    "231": "@SoyCristianRey Clippers 118 - New York Knicks 114 #CristianRey",
    "232": "New York Knicks Reportedly Concerned About Julius Randle's 'Overall Psyche' – NBA News https://t.co/HOlBf9RAAI",
    "233": "@NBA_NewYork Knicks should fine him too..",
    "234": "@SoyCristianRey Knicks (126) clippers (119)Gana New York Knicks",
    "235": "@CheyenneTweets @CharlesOakley34 @nyknicks No need to put ALL our feelings into it . Bigger things in the whirl yo",
    "236": "@safeawkwardboy @hhpthebook @nyknicks Yeah, they get fucking ejected all the time. He is a horrendous player and teammate, PERIOD.",
    "237": "Everyone will be asleep by the time the #Knicks play tonight. It'll probably be the \"Game of The Year\" for the @nyknicks, but no one will see it.\n\nI could be wrong #NewYorkForever",
    "238": "@ddouglas7 @hhpthebook @nyknicks Thibs, yes is a huge role. You are not the smartest fan ever though if you solely blame him, and not JR who is a horrendous player and teammate.",
    "239": "@hhpthebook @nyknicks He makes me just sick.",
    "240": "@hhpthebook @nyknicks 11-12 a year",
    "241": "but why the @nyknicks gotta play today?! AND they play the Clippers here in LA so you know the game’s on TV locally so i gotta watch 😫 and you know they gonna get flamed dammit",
    "242": "New York Knicks: Randle fined for shoving referee, Suns' Johnson https://t.co/VNqyPNALmJ",
    "243": "@NBA_NewYork I'm gonna need Burks to fake an injury for a hot minute #NewYorkForever #Knicks",
    "244": "@nyknicks fact, Money Mitch held Ayton  to 8 points on 34 minutes. Today against the Bucks, Ayton has 29 points.... Pay Mitch.",
    "245": "If any verified @BoredApeYC or Mutants are in LA and want 2 tix to the @LAClippers vs. @nyknicks TONIGHT at 7:00pm tag me (snuggster) in the verified members discord. Must own an ape or mutant. Previous winners eligible after 30 min.",
    "246": "@ESPNNBA @espn @NBA @NBATV #NBA @NBAonTNT @nyknicks #knicks trade this guy this Sumner/draftnight no leadership,  not a #1 or #2 has a bad attitude &amp; empty stats cuz 4th qrt when it counts he GHOST 🤷🏾‍♂️ OH YEAH ILL SAY IT AGAIN HORRIBLE ATTITUDE!#knicks https://t.co/6Hj0JQ6Pyb",
    "247": "Damn @McNuttMonica @nyknicks he did us dirty. https://t.co/IaeMvn3Fn9",
    "248": "@WorldWideWob I always liked @KDTrey5 but it definitely would have been better in my opinion if the @nyknicks were a potential super-team instead of the @BrooklynNets \nMore actual @nyknicks fans !!!",
    "249": "@SoyCristianRey Los Angeles Clippers 121-102 New York Knicks #CristianRey",
    "250": "The NBA has fined New York Knicks forward Julius Randle $50,000 for shoving Phoenix Suns forward Cam Johnson, making contact with a referee who was trying to break up the altercation and refusing to participate in its ensuing investigation. https://t.co/xUlqKO9IlK",
    "251": "@SoyCristianRey LA Clippers 112 - New York Knicks 109 #CristianRey",
    "252": "@SoyCristianRey Angeles Clippers 119\nNew York Knicks 114\n  #CristianRey",
    "253": "New York Knicks’ Julius Randle fined $50,000 for shoving referee, Phoenix Suns’ Cameron Johnson https://t.co/0qkuk0hxV2",
    "254": "@jam9835 @nyknicks I agree",
    "255": "Now we know his weakness @nyknicks https://t.co/h8iB7REpN9",
    "256": "@hhpthebook @nyknicks Let see what happens tonight... the starting 5 will stay the same... McBride probably gets 8-12 minutes tonight game will show the Knicks character...",
    "257": "@JblazeNYC @ChrisCanty99 @BrooklynNets @nyknicks @MLB @MLBPA @ESPNNY98_7FM You know me well @JblazeNYC, however I'll need more $ because if I'm only watching those two sports, I'll need another job!",
    "258": "@SoyCristianRey LA clippers 122 - 108 New York Knicks #CristianRey",
    "259": "NEW YORK (AP) — New York Knicks forward Julius Randle was fined $50,000 by the NBA on Sunday for shoving Phoenix Suns forward Cam Johnson, making contact with a referee who was trying to break up the altercation and refusing… https://t.co/AbeXbi9zq9",
    "260": "@SoyCristianRey #CristianRey \nLA CLIPPERS 126 - 121 NEW YORK KNICKS",
    "261": "@nyknicks Who ever is running this account needs to be fired! Some of the dumbest things I’ve read all season. We haven’t been hungry in 20 games. Our coach quit 3 weeks into the season with his rotations",
    "262": "@SoyCristianRey Angeles Clippers 108\nNew York Knicks 102\n  #CristianRey",
    "263": "@SoyCristianRey 117-111 New York Knicks #CristianRey",
    "264": "@SoyCristianRey New York Knicks 108 - Los Angeles Clippers 113 #CristianRey",
    "265": "@SoyCristianRey #CristianRey Clippers 118 vs New York Knicks 96 @SoyCristianRey",
    "266": "@jam9835 @nyknicks He took the ball out of McBride hands. Had him stand in the corner like he dies with Obi and Grimes",
    "267": "@cannonshell @TVG @UrbnHandicapper @KentuckyDerby @nyknicks NBA title contender. \n\nPlease LIE to me and tell me the @nyknicks are on the way back to being consistent WINNERs. \n\nThe 1990s are a long long long time ago.",
    "268": "@SoyCristianRey #CristianRey\nNew York Knicks 108\nLos Angeles Clippers 113",
    "269": "@hhpthebook @nyknicks I'm not sure but he gave McBride about 8 minutes = 0 points 0 rebounds 1 assist, he probably should of gave Reddish more minutes I'm not overly impressed with McBride that just me .",
    "270": "@nyknicks Stay hungry….for the Lottery!",
    "271": "@SoyCristianRey #soycristianrey  118-115 favor new York knicks",
    "272": "@SoyCristianRey L.A 106- 100 New York Knicks",
    "273": "New York Knicks' Julius Randle fined $50,000 for shoving referee, Phoenix Suns' Cameron Johnson - via @ESPN App.  #NBA.    .#NYK.  #Knicks.   https://t.co/42Yzs2gA3p",
    "274": "Randle fined for shoving referee, Suns' Johnson #NewYork #Knicks #NBA https://t.co/n3sCXx33mi",
    "275": "@WilliamsII @ddouglas7 @nyknicks So many of us do.",
    "276": "#NBA75- #NBA: #NewYorkKnicks/#LosAngelesClippers; Who U got-#Clippers/#Knicks?\n@nyknicks \n@LAClippers \n@ESPNNBA \n@NBA",
    "277": "@Wynn92Kirk @KendrickPerkins Lmao how did Bron run Pierce outta Boston, when Pierce's final playoff appearance with the Celtics was against the Knicks? Did LeBron go play for New York? You're not making sense",
    "278": "@jam9835 @nyknicks Definitely, but this is why I have a problem with Thibs and Randle.  Thibs should have left cam and McBride out there, but he came back with Fournier and Burks",
    "279": "@SoyCristianRey #CristianRey Clippers 130 - 128 New York Knicks",
    "280": "@SoyCristianRey Angeles Clippers 111 y los new York Knicks 105\n#CristianRey",
    "281": "Sixty years ago, Wilt Chamberlain dropped 100 points in the Philadelphia Warriors’ win over the New York Knicks.\n\nWill an NBA player ever break Wilt’s 100-point record? NBA stars such as James Harden, Anthony Davis and Klay Thompson share their thoughts: https://t.co/plyuGSnrFs",
    "282": "@Hardestyespn @ChrisCanty99 @BrooklynNets @nyknicks @MLB @MLBPA @ESPNNY98_7FM Uncle L, take a look at the question I just tagged you in (although I feel like youre for sure 🏀 &amp; 🏈) , just an interesting question by the person, I'll get you at you about other topics",
    "283": "@_mthagoon @nyknicks One thing Melo did that showed he was a leader, other than score.",
    "284": "@SoyCristianRey Angeles clippers 118 y New York Knicks 104",
    "285": "@SoyCristianRey Angeles clippers 104 new York Knicks 98 #CristianRey",
    "286": "New York Knicks’ Julius Randle fined $50,000 for shoving referee, Phoenix Suns’ Cameron Johnson https://t.co/WCkfOX1gC2",
    "287": "Washington Wizards - Indiana Pacers\nCarolina Hurricanes - Seattle Kraken\nChicago Blackhawks - Tampa Bay Lightning\nVegas Golden Knights - Ottawa Senators\nAnaheim Ducks - San Jose Sharks\nLos Angeles Clippers - New York Knicks\n\nBet slip link: https://t.co/ycyz1eE269 https://t.co/5Z7G0ySDoi",
    "288": "@mikeygrogins_ Not one Knick in the bunch 🤦🏾‍♂️ we have to draft better. Stop thinking stars want to sign here. @nyknicks got to scout better",
    "289": "Ready to speak with you at 18009193776 following Suns vs Bucks. @ChrisCanty99 on the #NFLCombine at 7. We'll also discuss @BrooklynNets, @nyknicks and @MLB vs @MLBPA. Join me  @ESPNNY98_7FM.",
    "290": "@AaliyahNevaeh7 \"the New York Knicks TRY to play basketball tonight\"",
    "291": "@nyknicks it's gonna be long time diet for you😂",
    "292": "@SoyCristianRey #CristianRey Angeles Clippers 110 New York Knicks 106",
    "293": "@SoyCristianRey Clippers 118 - 105 New York Knicks #CristianRey",
    "294": "@SoyCristianRey #CristianRey Clippers 114 vs New York Knicks 104",
    "295": "New York Knicks' Julius Randle fined $50,000 for shoving referee, Phoenix Suns' Cameron Johnson https://t.co/89geuZhfUi\nvia @ESPN App https://t.co/ihVT6suEPd",
    "296": "Hey @nyknicks!! \n\nDo we need to have a pep talk before the Clippers game? Like do I wear my Knicks attire tonight orrrrr keep it neutral?\n\nI wouldn't mind an Overtime like the Lakers game. \n\nEither way I'm there too see yall. Just be easy on my heart, in person.\n\nThanks :)!",
    "297": "@SoyCristianRey Clippers 106 - New York Knicks 110.  #CristianRey",
    "298": "@SoyCristianRey LA Clippers 120-117 New York Knicks #CristianRey",
    "299": "@DonRobbieBurner @nyknicks This is why we've endured decades of disfunction. ☝🏾This right here!!!",
    "300": "@SoyCristianRey 107-99 ganan los New York Knicks #CristianRey",
    "301": "New York Knicks' Julius Randle fined $50,000 for shoving referee, Phoenix Suns' Cameron Johnson\nhttps://t.co/Q2AuhZsz5Z\nhttps://t.co/Q2AuhZsz5Z",
    "302": "@SoyCristianRey 109-102 a favor de New York knicks",
    "303": "@rosshenryhair Hey i clippers play the Knicks later tonight we have to beat them keep i winning steak up clippers beat new york tonight.",
    "304": "New York Knicks' Julius Randle fined $50,000 for shoving referee, Phoenix Suns' Cameron Johnson - via @ESPN App \nWhat is up with ⁦@J30_RANDLE⁩ ???\n https://t.co/GWUX8Qxi4R",
    "305": "@SoyCristianRey Angles clippers 115 \nNew York knicks 103 #CristianRey",
    "306": "@SoyCristianRey #SoyCristianRey Los angeles Clippers 121 a 117 New York Knicks",
    "307": "EhTs the iver and under the Knicks won’t win tonight? @nyknicks asking for a friend",
    "308": "@ddouglas7 @hhpthebook @nyknicks I truly think things started to fall apart when Mike Woodson left.",
    "309": "@GetSum85 @nyknicks @LAClippers Reggie jackson 50 piece coming soon 😂😂😂",
    "310": "NEW YORK (AP) — New York Knicks forward Julius Randle was fined $50,000 by the NBA on Sunday for shoving Phoenix Suns forward Cam Johnson, making contact with a referee who was trying to break up the altercation and refusing… https://t.co/ljbPfMlkTk",
    "311": "Heads up on tonight's program @WFAN660: \n11:15pm @Dan_Grunfeld on #NBA, his family's story escaping the Holocaust &amp; his dad Ernie Grunfeld becoming an Olympian &amp; player with @nyknicks \n12:15 am @rydunleavy on #NFLCombine @Giants &amp; @nyjets \n1:15 am @JonathanMayo on #MLB prospects",
    "312": "Couldn’t resist this at the flea market today. LG!!\n@TheRealLJ2 \n@nyknicks \n#Legend https://t.co/jMg5zksoS0",
    "313": "Absolute favorite team in history of @nba &amp; I am a @nyknicks super fan.\n@magicjohnson +  #showtime @lakers = 🤯\n\nRepost from @winningtimehbo\n•\nThe perfect recipe https://t.co/Z9OjfiwfoC",
    "314": "@playoffpbball @nyknicks @LAClippers Get it!",
    "315": "🚨GAME DAY!\n\n🏀 @uk_knicks \n📍 New York, NY\n🕔 03:00AM/GMT, 19:00PM/PT\n⚖️ 34-31\n📺🇬🇧 @NBATV \n\n#ClipperNation https://t.co/TpTSXa16nv",
    "316": "Fantasy Basketball Week 20 (Mar. 7 - Mar. 13) Waiver Wire: Pick Up DeMarcus Cousins Before He's Gone: As the #NBA regular season winds down, some teams like the New York Knicks' hopes for a post-season are coming to a close. This can give young players… https://t.co/SI4HsuYZVa",
    "317": "On my way to Crypto so excited for my first NBA game in person this season! @nyknicks @ @LAClippers both my favorite teams! I will take some cool pictures &amp; videos! #NewYorkForever #ClipperNation",
    "318": "I'm actually so ready to see New York LOL I think about the sidewalk Knicks video every other day https://t.co/sjj3h1djNX",
    "319": "@SNorma11 @nyknicks and i was never a Isaiah Thomas fan as an exec.. liked him as a person\n\nbut maybe Leon Rose has learned from all of them.. \n\nthe knicks  owner clearly prefers a lack of communication. \n\noh and i was NOT a Brody Von waggonen fan either  .. and i liked Omar Minaya for a few years.",
    "320": "@nyknicks @23savage____ Robinson is another player who is inconsistent.  He will give us 8 points and 6 rebounds tonight.",
    "321": "@hhpthebook @nyknicks It’s over we tried the Randle experiment. Trade him for Zion or Sabonis or take him out of the starting lineup",
    "322": "NBA Basketball Game Betting Picks Simulator: 10:00 PM ET - New York Knicks vs. Los Angeles Clippers - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/A8D6fRRVrQ #nba #sportsbetting #freepicks #cappertek",
    "323": "New York Knicks visits Los Angeles Clippers Predictions and Preview for 3/6/2022 today.  Who are we taking in this game?  Find out now. #NBATwitter #NBA https://t.co/T68IodNjGo",
    "324": "@hhpthebook @nyknicks The Knicks were still in the game... losing on a last second shot.. now u can say what if ? But the Knicks still had enough to win",
    "325": "@nyknicks We know neither of those shots dropped 😂",
    "326": "@SNorma11 @nyknicks i also railed against Donnie walsh and Steve Mills.. what's your point?",
    "327": "@statmuse @nyknicks take notes. Thibs could never",
    "328": "Marc Berman of the New York Post reports that the Knicks are concerned about Julius Randle's 'overall psyche' 😳\n\nRandle's ejection Friday night was just one of many incidents this season. The Knicks are 3-17 in their last 20 games 😬😬\n\nMore here: https://t.co/rK2yHQArbk https://t.co/G4rbvIUCS1",
    "329": "@BillyReinhardt It's going to be a long summer in New York... no Knicks, No Nets, No Yankees, No Mets.... only hope for NY is if Kyrie makes his way to the local CVS or Walgreens... and we know that ain't happening.... so I guess we'll see these teams in the fall....",
    "330": "@nyknicks Can we get the man in Nikes. 🤦🏻‍♂️",
    "331": "The Knicks have lost 17 out of the last 20. And nothings changed! Not one damn thing. No sense of urgency. Why do we stand for this #KnicksFans? Fire the coach, replace the front office, trade Randle, play the young guys. It’s not that hard. @nyknicks your way isn’t working!",
    "332": "New York Knicks",
    "333": "And would have a better record than the New York Knicks. https://t.co/8fNypWS2mh",
    "334": "@jingersteel @nyknicks @FirstTake @SportsCenter @espn Thx boo, this right here is home &amp; we’ve had great games today, so happy to be here.",
    "335": "Julius Randle ‘hurt’ by ejection in Knicks loss that got him fined $50K #NewYork #Knicks #NBA https://t.co/mBC38GZPtp",
    "336": "@nyknicks this is a JOKE! Have some pride and clean house. https://t.co/MxQiP6UMlJ",
    "337": "@nyknicks As long as RJ and Cam do well it’s a good night. 😄",
    "338": "@nyknicks RJ Tired of getting sold",
    "339": "@nyknicks What’s Leon got to say about anything? Have some accountability.",
    "340": "@nyknicks We suck",
    "341": "@nyknicks For what? More Ls",
    "342": "@nyknicks I'm tired of starving, I wanna eat for once",
    "343": "@nyknicks I'm hungry for some players to actually have some heart. Not a bunch of overachieving 🤡",
    "344": "@nyknicks WE ARE STARVING",
    "345": "@nyknicks Let RJ drop 20 for my agenda pls",
    "346": "@nyknicks Stay ratio",
    "347": "@SNorma11 @nyknicks everyone has choices..",
    "348": "@nyknicks Win a game",
    "349": "@nyknicks play deuce pls",
    "350": "@nyknicks yea bro i’m hungry for a win",
    "351": "Stay hungry. https://t.co/gkQPiFuAsl",
    "352": "@Troutprophet @hhpthebook @nyknicks No! Of course the teams lack of success isn't entirely on Randle. The factors you mentioned are part of it . However, Randle has shown no signs of being our Leader like he was last year. In fact, he's making it worse by showing a bad example.Especially with RJ's rise as our #1.",
    "353": "@hhpthebook @nyknicks Yeah ur buggin",
    "354": "NBA fines Knicks' Julius Randle $50K for altercation during game vs. Suns #NewYork #Knicks #NBA https://t.co/uqZqgICg4Y",
    "355": "New York Knicks: Knicks star fined by NBA for shoving incident in brutal loss https://t.co/rrrikB0HcF",
    "356": "@stephenasmith looks mighty mad postgame that his 2nd team lost today. Knicks fan first, New York always 👎🏿 His teams are 🚮 😂😂😂 #celtics https://t.co/A8hyIlQSWf",
    "357": "@IanBegley @nyknicks @nba @J30_RANDLE Needs #angermanagent training ! For real!",
    "358": "New York Knicks\n\nKnicks, short for Knickerbockers, is a style of pants that became ubiquitous with those of Dutch ancestry in NY. \n\nI honestly like the reference to the city's Dutch origins, however if you're gonna say Pelicans is dumb, how do you defend a team named after pants?",
    "359": "@BrooklynNets The Knicks run New York have some shame",
    "360": "@hhpthebook @WilliamsII @nyknicks Thibs entire career is trash without a healthy DRose.  If DRose isn't playing he's significantly under .500.  Pathetic coach.  Smh.  And no way in hell you can tell me he deserves COY over Monty last season.  Look what Monty continues to do w the damn Suns.  Thibs is ass.  Smh🤦🏾",
    "361": "@SNorma11 @nyknicks that's the way they like it. no leaks. i dont think it's one person making the calls..  but we dont know.  \n\nno rocket scince to know Randel underperformed, rose and kemba broke down and NN/Mitch both laid eggs\nand we were still in it at the half way pole.. time catches up",
    "362": "Gus is a good man! We go back to the @NBA play-by-play days together. Him with @nyknicks me with @cavs Always enjoyed our getting together in those days. Glad son Cal got to see him in Columbus! https://t.co/IutiZrkFwo",
    "363": "@hhpthebook @nyknicks Although I agree, we must tell people when they are stupid. Some things are perceptions/opinions and others are facts.",
    "364": "The NBA announced Sunday that New York Knicks forward Julius Randle has been fined $50,000 for his altercation with the Suns' Cam Johnson.\n\nhttps://t.co/YJvuN0jUsH",
    "365": "@NBA_NewYork EVEN OFF THE COURT THE NBA JERKS US, YALL COULDNT GIVE HIM A 3 GAME SUSPENSION OR SOMETHING SINCE WE KNOW KNICKS DONT HAVE GUTS TO DO SO🤔😡😡🟠🔵💪",
    "366": "New York Knicks forward Julius Randle has been fined $50,000 for initiating an on-court altercation with Phoenix Suns forward Cam Johnson, the league announced on Sunday.\n\nhttps://t.co/6IjGLOBndN",
    "367": "New York #Knicks forward Julius Randle has been fined $50,000 for initiating an on-court altercation by forcefully shoving Phoenix Suns forward Cam Johnson, making contact with a game official in his attempt to get at Johnson, and for his noncompliance with an #NBA investigation https://t.co/ganFEG7hm6",
    "368": "@InconvenientTr5 @TVG @UrbnHandicapper @KentuckyDerby @nyknicks No\nNo\nContender for what?",
    "369": "Allan Houston 2003-04 Topps Chrome Gold Refractor /99  #39 PSA 8 New York Knicks Card. \n\n🔗https://t.co/SPqxiFJKLD\n\n#thehobby #sportscards #whodoyoucollect https://t.co/zmw6jJLzWb",
    "370": "NBA:\nINDIANA + 2 1/2\nINDIANA/WASHINGTON UNDER 227 1/2\nNEW YORK KNICKS/LA CLIPPERS OVER 220\n\nCOLLEGE BASKETBALL:\nTULANE/SMU UNDER 143 1/2\nIOWA/ILLINOIS OVER 155\nCHATTANOOGA - 2\nSAMFORD/FURMAN UNDER 148 1/2\nGEORGIA STATEAPPALACIAN STATE UNDER 128\nWESTERN ILLINOIS OVER 164",
    "371": "@TVG @cannonshell @UrbnHandicapper Is the 2022 @KentuckyDerby going to lift up AP as a TOP TIER Sire? \n\nCan #HorseRacing benefit from Legalized #Sports Gaming? \n\nWill the @nyknicks be a legit contender in the next 5 Years?",
    "372": "#NBA 🏀\n\n#Knicks +165 vs #Clippers -5\n🗑️ O/U 219½\n\nNew York are 1-6 ATS in their last 7 games.\nLA Clippers are 7-1 ATS in their last 8 games.\n\nWho covers?\n\nBet now: https://t.co/xCxoQKJpa0 https://t.co/qY1ICh0xVi",
    "373": "#NBA\n\n🗑️ #Knicks +165 vs #Clippers -5\n🏀 Total 219½\n\nNew York are 4-1 ATS in their last 5 games against an opponent in the Pacific Division division.\nLA Clippers are 8-1 ATS in their last 9 games played in March.\n\nBet here: https://t.co/ECPrLfNSnt https://t.co/QFZ7CIVSAO",
    "374": "@wilk_hustle @nyknicks Mee too, dam it would be nice to have a winning team again",
    "375": "@McNuttMonica I am not mad at you. Everytime I see you whether it’s @nyknicks post and pre game or on @FirstTake , @SportsCenter and now @espn women’s college basketball U GET UR BAG‼️",
    "376": "The New York Knicks trail the Spurs by 1.5 games for the 7th seed in the lottery.\n\nIf the Knicks catch the Spurs they will have a 31.9% chance of landing a Top-4 pick in the draft.\n\n#NewYorkForever \n\n@_AngelfrmPhilly @KillaDaMak @MoesKnicksTake @UGPMANAGEMENT @iamrocknation",
    "377": "@hhpthebook @nyknicks Good call but man I was u was wrong . I just want to knicks  to win.",
    "378": "@TD22TD @KDJmedia1 @CoachCarver_ @locallivenet @nyknicks 😂😂! Awesome! And I Agree Tremendous Job @CoachCarver_ @KDJmedia1",
    "379": "See you tonight @nyknicks",
    "380": "@JenXperience But I'm a Knicks fan and I watched the Knicks games on ESPN New York on cable TV",
    "381": "Sad case had the Root for the Brooklyn Nets Because New York Knicks are not representing😡",
    "382": "@Rjeff24 I owe you props. You called a clean @nyknicks game. I was impressed, you didn't take any shots. As Knick fans that's all we asked. Thank you!",
    "383": "@dallasmavs @tpinsonn @SDinwiddie_25 @tpinsonn is the glue - his vibe and energy are why my @nyknicks are done this season as they got no pinson",
    "384": "@BrooklynNets Knicks run New York",
    "385": "@hhpthebook @nyknicks Of course, I'd say we all surely want the W but that seems to be too far from happening that let's at least enjoy some sane and healthy conversation without drowning in vitriol",
    "386": "Check out New York Knicks 17 Card Lot RJ Barrett Rookie Cards, Randle, Robinson, D-Rose https://t.co/8E1GLeRVtM @eBay",
    "387": "I wonder if the Gotham Knicks suck as bad as the New York Knicks. #TheBatman",
    "388": "@hhpthebook @nyknicks It's not going to happen. I'm a Knox fan, I didn't like the way management handle him. I can't tell you some of the nasty confrontation I had on Twitter. I think some people look for something to be nasty about. That makes their day.",
    "389": "Hoy a las 04:00 h. Los Angeles Clippers vs New York Knicks.",
    "390": "@hhpthebook @nyknicks Well said..",
    "391": "@NBA_NewYork Smile your Knicks lose today😀",
    "392": "@hhpthebook @nyknicks Just how a portion of the fan base is unfortunately. If you disagree you’re somehow the enemy rather than having a conversation. Plenty of discussion to be had with this team",
    "393": "Now that’s some funny shit! And I’m a @nyknicks fan! Sorry… not much to smile about lately 🤷‍♂️ https://t.co/0a7M3dEesf",
    "394": "Im looking forward to 10 pm as I will be getting extremely angry at both The game Elden Ring which I will be playing , and the New York Knicks game in which I will be watching. Oh boy. Can’t wait.",
    "395": "@TD22TD @CoachCarver_ @KDJmedia1 @locallivenet @nyknicks Lol too funny",
    "396": "Pronostico Baloncesto NBA  Los Angeles Clippers - New York Knicks (07-Marzo-2022) - https://t.co/zE3fbbN8pp\n\n#pronosticos #pronosticosfutbol #pronosticosapuestas #apuestasdeportivas #pronosticosgratis https://t.co/WiYpVPCSUa",
    "397": "Handcaps alternativos para os jogos de hoje 2:\n\nCleveland Cavaliers -3.5 / ou Toronto Raptors +11.5 \nDenver Nuggets +5.5  / ou New Orleans Pelicans +8.5 \nLos Angeles Clippers -3.5 / ou New York Knicks +10.5",
    "398": "@nyknicks @espn @MSGNetworks @BetMGM Come on let’s get back on track and start winning 😤😤😤",
    "399": "@hhpthebook @nyknicks this could extend to a lot of areas of life these days. \nI’m not a randle hater, but i don’t defend his poor play…i think he’s good in right scenario, which includes a real pg, so not the knicks at present",
    "400": "📅: GAMEDAY @ 10:00 PM\nNew York Knicks vs. LA Clippers - NBA League 2022\n🎟️🎥: https://t.co/FYBrBoJZxf\nOnly Available For Registered Users. Create a FREE account to get access",
    "401": "@hhpthebook @h2sdrummer @nyknicks 💯... that’s all we’re really asking for .. we’re losing either way so no point in benching the kids.  Kids might fuck around and win some games who knows ... 🤷🏻‍♂️",
    "402": "@NBA_NewYork i absolutely despise this team and how they find literally any way to lose, but HOW BOUT THEM KNICKS BABY 👏👏👏👏👏",
    "403": "@h2sdrummer @Bknicks @nyknicks You are talking about +/- I'm more so talking about Wins and Losses.  We've loss 12 out of our last 13. We can do that same amount of losing with the kids...that was my main point.",
    "404": "New York Knicks: Game Preview: Knicks at Clippers- 03/06/22 https://t.co/ibkOkdmd61",
    "405": "@nyknicks @espn @MSGNetworks @BetMGM Break the losing STREAK 🏀 stronger Defense 💪 Better offense 🏀 let's gooooooooo Knicks",
    "406": "【Stock information】NEW YORK KNICKS / CAP / https://t.co/SmFVYPJwWG",
    "407": "How #Knicks' #fans can enjoy its #NewYork team that won only one in the last 10 #NBA #basketball #games: Only watch the first half!",
    "408": "@LAClippers @nyknicks @BallySportWest @ESPNNBA @AM570LASports @TuLigaRadio @AguaCalientePS Announce PG return Bozo",
    "409": "@Troutprophet @hhpthebook @nyknicks *Thibs",
    "410": "@Troutprophet @hhpthebook @nyknicks If you're referring to playing the kids. We're really NOT !Look at the minutes distribution. And No Deuce? This is throwing us crumbs!!",
    "411": "@William57790761 @hhpthebook @nyknicks 😂😂 That'll never happen. You can't just sit a Starter the entire 4th quarter. You can't have your cake &amp; eat it too. Thibs, Randle or Both have to go",
    "412": "@Bknicks @hhpthebook @nyknicks Careful because if you use on/off (not +/-), RJ is also a net negative. Burks/Taj are net positives, as are IQ and Obi. So okay Burks and Taj more?",
    "413": "Rutgers is the only basketball team I wanna watch for the rest of the year sorry @nyknicks",
    "414": "ATS Stats Streak Monitor -NEW YORK 7 SU LOSS #Knicks  Full odds at https://t.co/nUn5OcMhOI",
    "415": "@hhpthebook @nyknicks And that's not even the main concern. Developing our youth &gt; Winning games at this point.",
    "416": "Players today wouldn’t be allowed to do that, the league got soft. It was a lot fun in the 1990’s when I was a fan of the New York Knicks, even the early 2000’s was that way! https://t.co/QRk5Uj8guN",
    "417": "@DanyalIshaque1 @nyknicks @Suns Thank you, Danyal!",
    "418": "@nyknicks @espn @MSGNetworks @BetMGM Nobody cares",
    "419": "@chapulana @nyknicks When your teams not winning, this is all we have. I'd rather winning over these Twitter debates any day.",
    "420": "More hoops in DTLA!\n\n🕧 7:00PM PT\n🆚 @nyknicks\n📺 @BallySportWest, @ESPNNBA  \n📻 @AM570LASports, @TuLigaRadio https://t.co/1L9pCXXHxH",
    "421": "@nyknicks REALLY WHAT WE DOIN??? https://t.co/45hdNjXo1F",
    "422": "Damyean Dotson (2017 PIT MVP, Houston) tallied 21 points in 29 minutes to help the Austin Spurs (NBA G League) take a 136-126 win over the Salt Lake City Stars. Dotson has played in the NBA for the New York Knicks and Cleveland Cavaliers. @UHCougarMBK #GoCougs",
    "423": "@nyknicks Pepsi stop doing business in Russia",
    "424": "@hhpthebook @nyknicks One single good thing about the Knicks situation (too messy and open as to foster great debates and discussion) and folks be hating and mad about it all smh they never learn",
    "425": "@hhpthebook @nyknicks This tendency to get mad disrespectful online is silly. Most of these people won’t behave this way in person. If you have to name call. Your take is ass",
    "426": "the new york knicks are a mess right now",
    "427": "Work and progress 🙂\nMy #artwork\n@EvanFourmizz\n@nyknicks\n#Graphic https://t.co/LVhdTyrdgN",
    "428": "Consensus Line Move:\n2022-03-06 New York Knicks at Los Angeles Clippers from 219.50 to 221.00\nOver smoke and mirrors\n#NBA #sportsbettingadvice #artificialintelligence #ethereum",
    "429": "@DamnImHungry23 @nyknicks @espn @MSGNetworks @BetMGM All real fans are with you on this one",
    "430": "@nyknicks @espn @MSGNetworks @BetMGM Not watching 😭😂",
    "431": "@WilliamsII @ddouglas7 @nyknicks Last year was his best year. Could it be that he can't handle the pressure. Without fans he had his best year with fans he's back yo normal.",
    "432": "@nyknicks @espn @MSGNetworks @BetMGM We may never win again",
    "433": "@ddouglas7 @hhpthebook @nyknicks Yes, I agree with those points, and all may agree. Did it work last year. Yes. So what changed. That's why I said Thibs is thibs.",
    "434": "@nyknicks @espn @MSGNetworks @BetMGM Ah more national tv😒",
    "435": "OTS NBA New York Knicks Men’s Grant Lace Up Pullover Hoodie, Logo, Small https://t.co/qzGzRCnweq",
    "436": "@WrestleCringe They remind me of Dallas Cowboys fans or New York Knicks fans.",
    "437": "@hhpthebook @nyknicks Mentally soft like wet toilet paper. Not capable of being a leader.",
    "438": "#knicks#in#the#city#of#angels#new#york#knicks#vs#los Angeles#Clippers https://t.co/wnGlygZ9Rd via @YouTube https://t.co/b6wdYqqrQ7",
    "439": "@Resultswithjohn @Kalorsr @nyknicks @23savage____ Don’t you talk about Rj in that tone!!! https://t.co/VdvygO6wRD",
    "440": "I’ll be @NASCAR in a few hours, the @KnightHawksIFL first game on the 18th, and back in New York on the 24th @NYRangers @penguins @nyknicks @chicagobulls @BrooklynNets @hornets and then off to Minnesota twin cities @mnwild to round out March 2022.\n\nLFG!!!",
    "441": "@Ruddy19781 Jamal Crawford con 4 equipos distintos: \nChicago\nGolden St.\nNew York Knicks\nPhoenix",
    "442": "https://t.co/94n00lyspY\n#NBA75 @nyknicks @CoachEwing33 FOREVER!!!!\n#NewYorkForever #MSG @TheGarden #BingBong",
    "443": "@sakeem13 @nyknicks I don't respond to them. I leave them chatting with themselves🤣🤣🤣",
    "444": "The Suns &amp; Warriors are still the top 2 favorites to win the NBA Finals per @betonline_ag. Not pictured are the Grizzlies &amp; Nuggets both at +2800. For those wondering about the Lakers - they’re at +5000. The mighty New York Knicks are listed at +100,000 https://t.co/8nZ6ClhMOZ",
    "445": "@nyknicks @espn @MSGNetworks @BetMGM Can’t wait 🙄 https://t.co/97A7B0BV9T",
    "446": "@Fightful @nyknicks @CoachEwing33 FOREVER!!!! #NewYorkForever #PatrickEwing @TheGarden #MSG",
    "447": "@nyknicks @CoachEwing33 FOREVER!!!! #NewYorkForever #PatrickEwing @TheGarden https://t.co/WXVpXBry7U",
    "448": "Brookie is watching her New York Knicks tomorrow night. 🏀 in our town play the Sacramento Kings. I’m happy for her outfit and cute dinner 🍽 out with her Dad 💘. SHE HAS TERRIFIC SEATS. TOO BLESSED TO BE STRESSED",
    "449": "The New York Knicks take on the Los Angeles Clippers in NBA Basketball betting action.\n\nBen Meyer has a free pick on this game today!\n\nhttps://t.co/9rTLwvygFB\n\n#NBA #NBAfreepicks #sportsbet #sportsbetting #New YorkKnicks #Los AngelesClippers #GamblingTwitter #procappers https://t.co/yHcHd4ipaJ",
    "450": "@nyknicks @DKSportsbook One night closer to Ivey",
    "451": "@nyknicks @DKSportsbook Knicks will be up by 15 with 7 min to go. That’s all I got.",
    "452": "@SuperJude_ @nyknicks @DKSportsbook Us as Knicks fans are allowed to dream. Dream on Man! Hoping for a win",
    "453": "@nyknicks @DKSportsbook Knicks!!",
    "454": "3 possible plays today @nyknicks +4.5 @Senators +1.5 and @mnwild ML #Norm #Lennystinks",
    "455": "@hhpthebook @nyknicks Worst part is we play better when he’s off the floor.",
    "456": "@nyknicks @DKSportsbook Julius Randle for Donovan Mitchell and a first round pick is good enough… the will be foolish to trade cam reddish .. and I Q for 1 guy that would be the dumbest trade I have ever seen .. can Rj have a chemistry they need more playing together..",
    "457": "@SuperJude_ @nyknicks @DKSportsbook I dont think its possible, we get double digit leads and then just lose",
    "458": "@LawlersLawYo @LAClippers @nyknicks @cryptocomarena LETS GOOOOOOOOO",
    "459": "@anstahh_ @nyknicks @DKSportsbook At one point the oldest player on the court was 22",
    "460": "@anstahh_ @nyknicks @DKSportsbook That is what they have been doing",
    "461": "As a New York Knicks fan please stop putting them on National tv!! Thanks a Knick fan!",
    "462": "@nyknicks @DKSportsbook seasons over let the young guys develop",
    "463": "@nyknicks @DKSportsbook Time for another L",
    "464": "@nyknicks @DKSportsbook don’t care",
    "465": "Tale of the tape 📊\n\n@DKSportsbook | #NewYorkForever",
    "466": "Happy Gameday, #ClipperNation!\n\nIt’s time for the Clippers to extend their winning streak as the @LAClippers play at home against the @NYKnicks at 7pm PT (Not 4:30pm as originally scheduled).\n\nLet’s show our support at the @cryptocomarena or at home, as always. GO CLIPPERS!! https://t.co/jk9h8agNjo",
    "467": "Can the Clippers exact some revenge over the Knicks after a rare New York win a month and a half ago? \n\n@KennyDucey likes their chances: https://t.co/acDOnaXCOj",
    "468": "@knicksshitposts @nyknicks Thought you died bro. Happy to see you pulling through the suffering🙏🏾",
    "469": "@nyknicks @espn @MSGNetworks @BetMGM Another sad loss for the new york knickerbockers",
    "470": "@NBA_NewYork Chuckle our Knicks play today",
    "471": "@nyknicks @alanhahn @KeyJayandMax @TMKSESPN Due to Randle’s ejection Barrett was left to lead team. Suns won on a buzzer beater by C Johnson because Barrett tried to win game by himself (made 6 out of 26 shots) instead of trying to pass, rebound, defend trusting other teammates.",
    "472": "No Love for @RjHampton14 ? Green Prizm right here for dirt cheap..Dont miss great deals all around\n#NBA @nyknicks @MagicJohnson @OrlandoMagic \nCheck out 2020-21 Panini Mosaic - RJ Hampton - #233 Rookie Green Prizm Orlando Magic #OrlandoMagic https://t.co/xHStBdZgOw via @eBay",
    "473": "@MrChuckD @CharlesOakley34 @nyknicks I picked up Oak’s book along with Pippen’s last weekend. I chose to read @CharlesOakley34 first. Great book…reading the last chapter now.",
    "474": "@NBA_NewYork I'll smile at 75% to be consistent with how many quarters the Knicks will play today.",
    "475": "@hhpthebook @nyknicks That request will fall on deaf ears my dude. People get on here just to name call and troll because that's what brings them joy. My advice, ignore them, block them and keep it pushing.",
    "476": "@nyknicks @espn @MSGNetworks @BetMGM First game I'll intentionally miss this season. #FireThibs",
    "477": "@hhpthebook @nyknicks It was never Julius Randle",
    "478": "The New York Knicks play basketball tonight. Rejoice (and/or drink) accordingly 😅",
    "479": "@nyknicks fans, all I am asking is when you don't agree with someone else's take, don't start name calling. We are all here to discuss the Knicks. I don't mind a healthy debate, but the name calling BS has to stop. No of us know everything and we can all learn from eachother.",
    "480": "Knicks Rumors: Julius Randle's 'Overall Psyche Is of Concern' amid NY's Struggles #NewYork #Knicks #NBA https://t.co/HimLyXIjrl",
    "481": "@nyknicks @espn @MSGNetworks @BetMGM Hopefully not another late night stinker I’ve got work in the AM",
    "482": "@NBA_NewYork On game day in our house we say “Who are the Knicks losing to today?”",
    "483": "@nyknicks @espn @MSGNetworks @BetMGM TANK mode in full effect 👌🏼 let’s get that top draft pick without Thibs and Randle next year. 👍🏼",
    "484": "@EdMemphisPimpin @GodSonRel @rahmmagick @Knickanators @Christian_J_D_M @LuLuLunayfan @eepdllc @Woodshed_1914 @DaveChapelle676 @TruePG718 @queens_dude @_knicks1688 @Not47Buddz @Chuck1one @DonaldP47082631 @Rick__War @StateNYKPOD @SellDaTeamDolan @Trace_AVP @IanChisolm @YankeesKnicks99 @0oty_Mac @mikenieve @Knickstape2005 @ShannonTFortune @LegionOfKnicks @AJTheManChild @Jaelin_Taylor @victorlb03 @Freekeith @RTaylor2283 @JeDiGoLLuM01 @Markjoh91017488 @J1gg__ @PreZnyc621 @TMal761 @BadBadLeroyBro7 @RMPChats @Sharonchik266 @StepThroughJoe @quietknicksfan @nightnurse38 @LukeHen73716015 @Julius_DL @KnicksBig15 @stalling_e @MikeFromQns7 @MikeK634 @acedghill @boxand21 Good read on the current state of the Knicks\n\"Lupica: These Knicks are getting beat on and off the court - New York Daily News\" https://t.co/K9RHMzTf8j",
    "485": "1969-70 NEW YORK KNICKS 8X10 TEAM PHOTO PICTURE NY ... https://t.co/QzuaBK3ggZ Here they go!  The Supermen that flew over the city and lit up the 50th Street Garden of Eden...SELL THE TEAM by DENNIS REED on Amazon, Barnes and Noble and Waterson's sites.   $11.99",
    "486": "@KING_MACHO_MANE @nyknicks @espn @MSGNetworks @BetMGM That’s the energy I like",
    "487": "Best bets for New York: Knicks at Clippers and Rangers at Jets on Sunday, March 6 – NBA News https://t.co/xraP7zcgt1",
    "488": "@nyknicks Terrence Mann is going to drop 50 on Evan Fournier",
    "489": "@nyknicks 1-12 in our last 13 games. Remember when we said play the kids, and the Randle-Hive said that, if we did that we would lose every game. Do any of you Remember,  they called me a clown and said I don't know ball. Were 1-12 with Randle playing, clowns",
    "490": "Check out New York Knicks youth shirt #Fisll #NewYorkKnicks https://t.co/3h1udCqna7 via @eBay",
    "491": "@nyknicks @espn @MSGNetworks @BetMGM We don’t care anymore",
    "492": "@nyknicks @espn @MSGNetworks @BetMGM Leon rose needs to face the music he can't continue hiding under the desk. We want answers now !",
    "493": "@mrcrom1 @NYPost_Berman @nypostsports @nyknicks I think we are tanking but they don’t want the fan base to know.",
    "494": "Sunday (3/6) #NHL/#NBA75 New York OVERs Value Play (+145):\n\n🏒New York-Winnipeg GT Ov 5.5\n🏀NY Knicks-LAClippers GT Ov 209.5\n\nBOL Everyone! 🍀💰🍀\n\n#GamblingTwitter 🏟 #NHLPicks #NBAPicks #FreePicks",
    "495": "@NYPost_Berman @nypostsports So Burks repeated #thibs \"anyone can play the Point\" b.s philosophy.\n\nThat's both delusional and low basketball IQ.\n\n@nyknicks automatically become an improved team without Burks &amp; #Thibodeau",
    "496": "Your New York Knicks play basketball today 🪖🪖🪖🪖🪖🪖👀👀🪖🪖 https://t.co/t2vXGpkpBT",
    "497": "New York Knicks: Best bets for New York: Knicks at Clippers and Rangers at Jets on Sunday, March 6 https://t.co/gJ8pUY0TYc",
    "498": "@nyknicks @espn @MSGNetworks @BetMGM Another loss!!! BTW!!!",
    "499": "JOGOS DE HOJE\n\nA ESPN transmite QUATRO jogos\n\nBoston Celtics x Brooklyn Nets\nMilwaukee Bucks x Phoenix Suns\nCleveland Cavaliers x Toronto Raptors\nLos Angeles Clippers x New York Knicks\n\nA Band, o canal da TNT Sports e o canal do Gaulês transmitem Oklahoma City Thunder x Utah Jazz https://t.co/rVJdqsRgHC",
    "500": "@_tak3shi_ @MrWestbrick0 @nyknicks Lol he got injured after the next game. He was injured since November 2021 until now",
    "501": "@nyknicks @espn @MSGNetworks @BetMGM Obi gunna get more olaying time on this thumbnail than in the actual game lmao.",
    "502": "@champagnecoco @FuckHowUFeelDoe Nah this when he played for New York Knicks and they was getting bullied by the Pacers in the 2nd round.",
    "503": "@NBA_NewYork We need a True point Guard Not some knockoff who's he kidding certainly Not True Knicks Fans",
    "504": "@NBA_NewYork The Knicks are cursed bro, it doesn’t even matter",
    "505": "@nyknicks @espn @MSGNetworks @BetMGM They are winning this time",
    "506": "@nyknicks @espn @MSGNetworks @BetMGM ima sleep instead",
    "507": "@nyknicks @espn @MSGNetworks @BetMGM no one is staying up to watch this + ratio",
    "508": "@nyknicks @espn @MSGNetworks @BetMGM Pity the fool who stays up to watch this",
    "509": "@nyknicks @espn @MSGNetworks @BetMGM Another letdown incoming…",
    "510": "@nyknicks @espn @MSGNetworks @BetMGM LFG SQUAD WE NEED A W❕",
    "511": "@nyknicks @espn @MSGNetworks @BetMGM Keep it",
    "512": "@nyknicks @espn @MSGNetworks @BetMGM Great",
    "513": "Let’s get a Sunday Funday parlay going:\nHouston ML\nLoyola-Chicago ML\nIllinois ML \nBrooklyn Nets ML\nOhio State -4\nNew York Knicks U107.5",
    "514": "@nyknicks @espn @MSGNetworks @BetMGM Why do you do this to us",
    "515": "@nyknicks @espn @MSGNetworks @BetMGM Oh god please no https://t.co/ZgkCMd4FKi",
    "516": "@nyknicks @espn @MSGNetworks @BetMGM Reggie Jackson gonna drop 50",
    "517": "@nyknicks @espn @MSGNetworks @BetMGM Tank Day",
    "518": "@hhpthebook @nyknicks Need D rose back 🌹 👀",
    "519": "@AnitaMarks  if I was the #Knicks I would totally do that trade. Think about it, would you make that deal for curry? Of course you would he is averaging 25.8 PPG and Donovan is averaging 25.8 PPG. #ESPN #NBA #Utah #Jazz #Warriors #NewYork #GoldenState",
    "520": "New York Knicks vs  Los Angeles Clippers Prediction 3/6/22 - Free NBA Picks https://t.co/hP09q5Nv56 via @YouTube",
    "521": "@NBA_NewYork @nyknicks @NY_KnicksPR They haven’t made me smile in 2 months. Thibs is sabotaging the young players development.",
    "522": "@ddouglas7 @hhpthebook @nyknicks How is Thibs the problem, they all bought into his system last year. Julius signed a contract extension now he dont believe in the system. That system got him his money and made him an Allstar. Thibs is Thibs nothing is going to change with him.",
    "523": "@moneymaddnes203 @NYPost_Berman @nypostsports Hell, Thibodeau started Burks over Derrick Rose - the clear cut best Point Guard!\n\nWhen asked about it #Thibs said\n\n \"anyone can be the Point Guard\"\n\n@nyknicks have to decide if they can live with that WHACK philosophy going forward.",
    "524": "Just going through my childhood closet and found this drip @nyknicks @StarburyMarbury https://t.co/urGr5p9egt",
    "525": "@TyTroII Retire his jersey when he hangs it up clown @nyknicks",
    "526": "@BigRayHernandez @nyknicks @KnicksVerse Yeah, his motives are In  question",
    "527": "Consensus Line Move:\n2022-03-06 New York Knicks at Los Angeles Clippers from 218.00 to 219.50\nOver lollipops\n#NBA #bettingexpert #dataanalytics #investinyourself",
    "528": "@NBA_NewYork Pg 100% matters. Captain on court for majority of teams but I am convinced there is not a single legitimate point guard on this roster. Have to work with what they have now.\nPlenty of legitimate PGs that will be looking for new homes this O/S through trade if no Ivey #Knicks",
    "529": "New York Knicks: New York Knicks:  vs. Los Angeles Clippers: Time, TV channel, how to watch free live stream\u0085 https://t.co/aS3efdIYUR",
    "530": "Your Daily NBA Tip is Here!\nIvica Zubac - Over 10.5 against the New York Knicks #nbabets #nbabetting https://t.co/CB4lSp2ccQ",
    "531": "@hhpthebook @nyknicks Great post",
    "532": "@hhpthebook @nyknicks Randle isn't a leader of this team. Let's roll with RJ &amp; Co",
    "533": "@nyknicks @23savage____ Mitch was in BEAST MODE against the Sun's.\n Keep that up brother I see you getting better every night",
    "534": "The New York Knicks take on the Los Angeles Clippers in NBA Basketball betting action.\n\nBen Meyer has a free pick on this game today!\n\nhttps://t.co/9rTLwvygFB\n\n#NBA #NBAfreepicks #sportsbet #sportsbetting #New YorkKnicks #Los AngelesClippers #GamblingTwitter #procappers https://t.co/wTJLyvNu5d",
    "535": "The @NYKnicks travel to LA to take on the @LAClippers tomorrow ⚔️\n\nFind out which team will emerge with the W, LIVE at 8:30 AM on @vootselect and @officialjiotv! 📺\n\n#NBA75 #NBAonVootSelect #NBAonJioTV https://t.co/D7ZBE9YaIw",
    "536": "@hhpthebook @nyknicks He ain't tough my dude. He's a bully. Bullies pick out the weak &amp; pounce. Real tough guys want the smoke with anyone.",
    "537": "@JTatuMvp @SteveKe05131664 @KeithSmithNBA New York Knicks may be the team that would take a chance on Westbrook. Rose + Noel + Walker + Burks for Westbrook",
    "538": "Best Book I’ve read in a long time &amp; a must read for any @nyknicks fan. Thanks @Herring_NBA \n\nBlood in the Garden: The Flagrant History of the 1990s New York Knicks https://t.co/aXGQQD42HH",
    "539": "@hhpthebook @nyknicks Blood in the Garden!",
    "540": "NEW YORK KNICKS vs\nLOS ANGELES CLIPPERS, 11:00PM.",
    "541": "NEW YORK KNICKS 114-115\nPHOENIX SUNS, Final.",
    "542": "@itsbuddyman Definitely require a @nyknicks Doofy…been rugged for the past decade 🏀🏀",
    "543": "@MelvinS52046201 @nyknicks My Twitter feed is where I post my thoughts. You can post \"Can we win a game\" on your Twitter feed. Yall got to stop trying to control what I post.",
    "544": "@MrChuckD @CharlesOakley34 @nyknicks Hell at least just let the legend watch a game at msg in peace!",
    "545": "@hhpthebook @nyknicks Randle is a pariah period We all know that However can We just win a game for Heaven's sake",
    "546": "Los Angeles Clippers - New York Knicks İddaa Tahmini 07.03.22\nhttps://t.co/mObL8e5K7p",
    "547": "@hhpthebook @nyknicks That's nowhere near the worst thing he's done.  In fact I'm always gonna be OK with a little grit.",
    "548": "@nyknicks @23savage____ Pay Mitchell he's integral to this Team's Future Success yes He's not perfect footwork positioning developing another shot down low yet that's what a good Coach will do And that We don't have in Thibideau especially in the development of our KNICK Youngsters",
    "549": "Westchester Knicks G League alum Brandon Williams had a huge game last night.\n\n21 PTS\n2 REB\n1 AST\n\n9-for-14 shooting\n1-for-1 from the line\n\nGot to the bucket at will, no idea why New York preferred Arcidiacono over a guy who was dominating the G League at Knicks' own team.. https://t.co/waYOixOGdw",
    "550": "@nyknicks Hit your fucking free-throws!",
    "551": "@_mthagoon @nyknicks No he wasn't. Melo was about Melo",
    "552": "@nyknicks need a major change …again. Our city deserves better. \nAnother example of poor #leadership and of what not to do …have to find some silver lining. \n\nLeon Rose is turning his back on fans by hiding from @nyknicks \nfailures https://t.co/w10YzTcciO via @nypostsports",
    "553": "@DonBolo79 @nyknicks Facts",
    "554": "@DWallace_NJ @KnicksFanTv @nyknicks @alanhahn @TheStrickland I’m just tired of looking at his facial expressions",
    "555": "Bing-Bong! NYC Dogs-in-your-front-yard T-Shirt New Funny Viral New York Knicks #eBay🇺🇸 #Men #TShirts https://t.co/UBMikpt0xf",
    "556": "@nyknicks @23savage____ They lost",
    "557": "@xMagikJ20 @NFL @nyknicks @NASCAR @HastyHighlights @DennyHamlinSZN @NYIslanders @SkyTrace29 I ain’t moving m",
    "558": "@hhpthebook @nyknicks I guess Melo wasn't the leader of the knicks lol",
    "559": "@nyknicks Gameday! Let's Go!\n\n#NewYorkForever #Knicks #KnicksTape #NBA #NBA75 #NBATwitter",
    "560": "The New York Knicks play basketball tonight 🔥 https://t.co/8EvzXl00tu",
    "561": "New York Knicks: Ex Atlanta Hawks wing Cam Reddish is still struggling with the Knicks https://t.co/Egbq0LQcLg",
    "562": "#knicks @nyknicks \nLeon Rose is turning his back on fans by hiding from Knicks' failures https://t.co/Rfdcsd2IHO via @nypostsports",
    "563": "Phoenix Suns blows up New York Knicks 115-114 Cameron Johnson 38points 2rebounds.",
    "564": "https://t.co/0UByrh4YC6: Knicks vs. Clippers: Start time, where to watch, what’s the latest: The New York Knicks (25-38) play against the Los Angeles Clippers (34-31) at STAPLES… https://t.co/T9a2LU6SNy https://t.co/0UByrh4YC6: #News #Celebrity #FutureStarr #Shopping #Sports https://t.co/SSl4bLtyuQ",
    "565": "Consensus Line Move:\n2022-03-06 New York Knicks at Los Angeles Clippers from 216.50 to 217.50\nOver spot the sucker\n#NBA #bettingpicks #analytics #investment",
    "566": "@JPronos23 New-york Knicks",
    "567": "@JPronos23 New-york Knicks",
    "568": "Magic’s Cole Anthony puts on show versus Knicks in New York homecoming #Anthony #Magic’s #news24 #newsweek #newspaper #newsroom #newstoday\nhttps://t.co/5ez6QbG7DV",
    "569": "Today's NBA Picks: 10:00 PM ET - New York Knicks vs. Los Angeles Clippers - 1 PICK AVAILABLE: https://t.co/joDntJcUMi #nba",
    "570": "@JasieMartinez26 @hhpthebook @nyknicks If he didn't get ejected, they would of actually played worse. The main problem is that he slept on and woke up Cam Johnson. They all did.",
    "571": "@hhpthebook @nyknicks He is no leader. I wish Randle would embrace the enforcer role for the team. We would thrive with him in that role",
    "572": "@JPronos23 Ce sera New York Knicks , 😉",
    "573": "New York Knicks: Knicks still don't have an answer at this position https://t.co/1w2SEDVszz",
    "574": "Cam Johnson banks in 3, NBA-leading Suns stun Knicks 115-114 - CBS New York https://t.co/OeZ8CZMArg",
    "575": "Knicks continue to search for answers at point guard #NewYork #Knicks #NBA https://t.co/k4EBx3ZyQV",
    "576": "@JPronos23 Les Knicks de New-York",
    "577": "@SKB1ER @hhpthebook @nyknicks U can’t learn to be a third option when the ball constantly being run though you.And you def can’t be a third option when we last in assists.Who’s passing him the rock?Thibs “enabled” all this https://t.co/lMNlfgdqOL gone with him,get @spidadmitchell and let Julius/RJ go to work",
    "578": "@nyknicks Get this man in Orange and Blue. He’s the answer to our problems. @shaiglalex https://t.co/1tRkiZZNaf",
    "579": "@IpsonKenny @QuandreWeaver All they had to do was look at his twitter bio. Even if he was a Lakers fan, him being from Chicago doesn’t mean he has to automatically root for the Bulls 🤦🏾‍♂️😂. You can be from New York and not root for the Knicks or Nets 🤷🏾‍♂️",
    "580": "@nyknicks fire Tom https://t.co/fjclfigEWm",
    "581": "NBA Basketball Game Betting Picks Simulator: 3/6/2022 10:00 PM ET - New York Knicks vs. Los Angeles Clippers - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/A8D6fRRVrQ #nba #sportsbetting #freepicks #cappertek",
    "582": "Few things warm my heart more than the @nyknicks being garbage",
    "583": "@nyknicks @23savage____ Pay mitch rob",
    "584": "@DWallace_NJ @KnicksFanTv @nyknicks @alanhahn Move this fool",
    "585": "The @nyknicks pulling up to the @NBA lottery this year: https://t.co/3gS8AgAzr3",
    "586": "The Batman was just a metaphor for the state of the New York Knicks.",
    "587": "It was never the 2022 New York Knicks 🤡🤡",
    "588": "@TJ_NYK Wanting to be right in a debate with other Knicks fans. Haha. Both on his fit in New York and that he has a higher ceiling than what you see on first glance. The intangibles are ridiculous.",
    "589": "@hhpthebook @nyknicks lmao at the shameless randle stans in this thread! Him slapping a laptop away from asst coach is so tough! Intimidating refs after a game is so tough! swinging at Cameron was leadership!\ndudes just spewing gibberish &amp; believe their own nonsense. Randle toxic!",
    "590": "@hhpthebook @nyknicks Get him out of here!!!",
    "591": "@Josh_Rodriguez_ The @nyknicks should make it happen for next year. Throw in some features from Ewing, Starks, Houston, LJ, Oak and Bernard King… fans would go bonkers. https://t.co/CPlAlaKJNt",
    "592": "Get better @nyknicks https://t.co/tjbBKbLUg6",
    "593": "@casualtakeking The @nyknicks a must not watch!!",
    "594": "@pay_paul718 @nyknicks Yet Thibs won COY last year over Monty?  Makes sense",
    "595": "@hhpthebook @nyknicks 🤣🤣🤣 damn!!!",
    "596": "@nyknicks @DukeMBB @RjBarrett6 And coach Thibs needs to learn how to make adjustments.... Burks is not a pg... Mcbride is!!!!!!",
    "597": "@nyknicks Fire the coaching staff",
    "598": "@Reese929IndAtl @nyknicks @TheTraeYoung Hawks haven’t been to the finals since 1961 , humble yaselves",
    "599": "@MoSchra96 @BIGDSportsTopic @kirkgoldsberry @celtics @Suns @memgrizz @dallasmavs @Lakers @BrooklynNets @nyknicks @nuggets Remembers* Celtics have to play wire to wire to let Luka near the clutch https://t.co/YUYCpSCyTt",
    "600": "@nyknicks Haha",
    "601": "Check out New York Knicks 17 Card Lot RJ Barrett Rookie Cards, Randle, Robinson, D-Rose🔵🟠⚪️🏀🏀🏀 https://t.co/8E1GLeRVtM @eBay",
    "602": "The answer in itself is the reason why Thibs gotta go. None of these players know what to do because the coach has to show he can piss further than anyone else can! @nyknicks https://t.co/gCGpLJX9w5",
    "603": "@NBA_NewYork I bet on the warriors. Only bet against the knicks during this travesty. Fuck me.",
    "604": "@hhpthebook @nyknicks I honestly think thibs has enabled this version of Randle, we get a coach who can run actual sets and a PG to dictate the flow better he can possibly fall in line, but that’s a lot of ifs and that right there is the problem",
    "605": "@SKB1ER @nyknicks I can see that, I doubt he could",
    "606": "@hhpthebook @nyknicks THERE.        IS.         NO.           I.                  IN.                      TEAM",
    "607": "@hhpthebook @nyknicks If he wants a future with us he should embrace that enforcer role and learn to be a third option after we find ourselves a point guard ,",
    "608": "@nyknicks @23savage____ pay ROBINSON",
    "609": "@SwordsLiquidity @KnickedupFan @NBA_NewYork Look at Quickley right now. He’s struggling because the Knicks are a bad situation. Deuce doesn’t deserve that. I’m all for playing him but let’s put him in the best spot to succeed",
    "610": "@NYCDEATHROWCATS The shelters are full. Rescues needed!\n@newyorkcity @newyorkcitynext @NYCPride @NYCPridePower @NewYorkRedBulls @NewYorker @nyphospital @newyorkerunion @newyorklivetv @BrooklynNets @nyknicks @NJDevils @NYCFC @NYCFCHelp @GothamFC @NYIslandersPR @WFAN660 @BigBoxRadio @wrhuradio",
    "611": "@Gb33r @nyknicks @Suns Haha you’re a no one",
    "612": "@hhpthebook @nyknicks Looks like a NEW YORK Knick to me!",
    "613": "@hhpthebook @Knicks_SNOB @nyknicks Nah, he can lead New Orleans next year when we flip him for Zion",
    "614": "@elwyn9674 @anthonyk56 @nyknicks @Mets Oh shit. I did forget about David Wright. Last great closer? Please dont say Franco.",
    "615": "@WorldWideWob @nyknicks  what’s wrong with your head coach?",
    "616": "Knicks concerned about Julius Randle's \"overall psyche\" following ejection #NewYork #Knicks #NBA https://t.co/e8e7NiVEza",
    "617": "@channingfrye How’s this tweet working out for you now?? @nyknicks and @Lakers in two great games on consecutive nights.",
    "618": "NBA Picks 3/6/22 New York Knicks vs Los Angeles Clippers https://t.co/1b9dBfuzUd",
    "619": "@HastyHighlights @NFL @nyknicks @atlsportsstan_ @NASCAR @DennyHamlinSZN @NYIslanders @SkyTrace29 Wasty",
    "620": "90's @nyknicks had a ton of fights. But the game legislated that out with fines and suspensions.  No one is questioning Randles toughness,  just his lack of composure and judgment. https://t.co/nYqu7iIeJm",
    "621": "@hhpthebook @nyknicks Nowhere near a leader, he’s a number 3 on most teams",
    "622": "@NinjaHoops_1 @warriors @nyknicks should've drafted @StephenCurry30 all along my dad says 😭",
    "623": "Warriors looked unstoppable the first half of the season, now they look like the New York Knicks. #smdh",
    "624": "@hazelboy_16 @nyknicks One time, I actually forgot that",
    "625": "@nyknicks TRASH NY TREASH NY TRASH LOST TO BUZZERBEATER FT ALL TRESHHH",
    "626": "@hhpthebook @nyknicks One time all star and already think he run shit",
    "627": "@hhpthebook @Knicks_SNOB @nyknicks This post is sawft!! Like it or not, this is leader energy! Don’t take shit from nobody, and be the big dog in the yard! Soft ass league with soft as refs making it so he got ejected last night. Ain’t his fault Thibs ain’t using the best talent around him!",
    "628": "@Heracli15667921 @nyknicks Yeah, I'm in love with me",
    "629": "@hhpthebook @nyknicks Get over it.  Thibs is the real problem.",
    "630": "@JasieMartinez26 @sambox71 @nyknicks We also forget our great coach took Cam out.",
    "631": "@JasieMartinez26 @hhpthebook @nyknicks Yo we lost on a near half court buzzer beater he’s not the reason we lost",
    "632": "@jharrisfuture @nyknicks It's always about whataboutism when it comes to Randle.",
    "633": "@hhpthebook @nyknicks Get over yourself lol",
    "634": "@hhpthebook @nyknicks Rather have a fighter than a punk…",
    "635": "Check out this listing I just added to my #Poshmark closet: VTG Reebok Authentic New York Knicks Latrell Sprewell 8 White Jersey Mens 58 3XL. https://t.co/bcCDOvY3Na #shopmycloset @poshmarkapp",
    "636": "@nyknicks Fire Thibs!!! | Please 🙏",
    "637": "In Game 63 of the 2021-2022 #NewYork #Knicks #NationalBasketballAssociation Season, played on #March 5, 2022, The New York Knicks lost to The #Phoenix #Suns; The New York Knicks record is now: 25-38 https://t.co/OINWwkFdhC",
    "638": "@nyknicks @23savage____ Fire Thibs | Please 🙏",
    "639": "@nyknicks @DukeMBB @RjBarrett6 Fire Thibs | Please 🙏",
    "640": "When did the Golden State Warriors start wearing the New York Knicks uniforms?",
    "641": "I want what is best for the @nyknicks but they feeling isn't mutual smh https://t.co/UvY12W70U9",
    "642": "@hhpthebook @nyknicks He needs anger management",
    "643": "@ALLAN_HOUSTON  just reading Knicks twitter fan posts you can get better lineups and substitutions and this is not MM QB. You all see it too but no adjustments? No changes? another year of @nyknicks with no purpose.",
    "644": "@hhpthebook @nyknicks He needs a therapist"
}