{
    "0": "@dallasmavs Completely forgot we were playing tonight",
    "1": "@dallasmavs We don't care just win",
    "2": "@dallasmavs She’ll never forget that in her life",
    "3": "@dallasmavs @ModeloUSA Trash",
    "4": "GAME TIME. \n\n(Wait for it 🥺) https://t.co/6FgjyFxAn8",
    "5": "@dallasmavs @ModeloUSA Another Reggie start 😭😭",
    "6": "Dallas Mavericks Out Of Context. https://t.co/WJnbRNNHaf",
    "7": "@dallasmavs @ModeloUSA Hey guys 😃 when looking you and the ball.. you know who is the boss.. put the ball in its place.. 😉 go mavs go go go 😃🙌🙌🙌",
    "8": "@dallasmavs @ModeloUSA Goddammit win this shit! Fuck! Tired of losing",
    "9": "C'mon, boss, we love you as one the best owners in the NBA, but this just breaks my heart 💔 Twitter allowed me to find my co-fans of the @dallasmavs since here in the PH I felt within the minority. Hope you can still change your view. Win or lose, we all #MFFL https://t.co/wckTbSgZ1h",
    "10": "first 5⃣ out vs. @dallasmavs \n\n〽️ @1Tyus  \n〽️ @dillonbrooks24 \n〽️ @DBane0625 \n〽️ @jarenjacksonjr \n〽️ @RealStevenAdams \n\n@Verizon | #GrzNxtGen https://t.co/qVELFJ82xx",
    "11": "@dallasmavs @SteveNash @RealJasonKidd Both could shoot the 3 but didn’t depend on it like our current roster",
    "12": ".@dallasmavs I'm talking about you.",
    "13": "@fatlukadoncic @dallasmavs @ModeloUSA 0 followers. Bruh.",
    "14": "@dallasmavs @memgrizz @BallySportsSW @theeagledallas This is all he fucking does besides dribble out the shot clock and not pass https://t.co/spUS0jPjqI",
    "15": "@stephen_rules77 @dallasmavs @Chime Very impressive to be a fan from the time you were -5 years old.",
    "16": "@BallySportsSW @dallasmavs Easy, Reggie Bullock can build pyramids with his bricks",
    "17": "If you had to be stranded on a desert island with one teammate, who would it be? 😂 🏝 \n\n@dallasmavs | #MFFL https://t.co/2e2hoY9Lfu",
    "18": "Game Day!!! Game #24: 🐴Dallas Mavericks (11-12) @ 🐻Memphis Grizzlies (14-10): 🏟️FedExForum in Memphis, Tennessee. 📺🏀⛹🏿🎫🤜🤛\n\n#MFFL #GrindCity https://t.co/Yes7qQ8EKT",
    "19": "@CtxSoles @dallasmavs @memgrizz @BallySportsSW @theeagledallas Never should of paid Luka that much trade him soon he’s not a team leader",
    "20": "The @DallasMavs starting Doncic, Bullock, Finney-Smith, Porzingis, Powell on Wednesday. #MFFL #NBA",
    "21": "@dallasmavs @ModeloUSA Beautiful graphic",
    "22": "Mark Cuban Can get Upset.. but @dallasmavs this team is bad besides not even 100% Luka. Most of the Starters are average NBA players and most of them would not start on Good team. I would be very aggressive in Trade deadline &amp; free agency. Whatever it takes. We fans deserve more.",
    "23": "@dallasmavs @ModeloUSA Let's gooooooo Mavsss!!!",
    "24": "@dallasmavs @ModeloUSA Man, i still don't get the yesterday' loss. Man, this team is bad as fuck holy molly.",
    "25": "@dallasmavs @ModeloUSA Coach Kidd: https://t.co/lvGIp1emSs",
    "26": "@dallasmavs @memgrizz @BallySportsSW @theeagledallas Luka is a cancer for anyone else playing along side of him trade him and make Mavericks fun to watch again",
    "27": "@dallasmavs @ModeloUSA Mark gonna go on a basketball rant again if the Mavs lose?",
    "28": "Wait I’m completely forgetting about the 2011 Miami Heat when they lost to the Dallas Mavericks tht was a complete embarrassment on there end especially my favorite player Lebron who completely shit the bed and disappeared tht series like a ghost till this day idk wtf happened https://t.co/ixCpWyZY1V",
    "29": "@dallasmavs @ModeloUSA If I see more than 20 bricks from three this game…lol. Even if we win, the quality of the game would annoy me into turning it off.",
    "30": "@dallasmavs @ModeloUSA Bullock kkkkkkkkkkkkkkkkkkkk",
    "31": "@dallasmavs @ModeloUSA Bullock 😭😭😭😭😭😭😭😭",
    "32": "@dallasmavs @ModeloUSA If you add all the numbers on this graphic it equals my weight.",
    "33": "@dallasmavs @ModeloUSA Mavs Twitter",
    "34": "El quinteto inicial de los Dallas Mavericks para enfrentar a Memphis Grizzlies: \n\nPG: Luka Doncic\nSG: Reggie Bullock\nSF: Dorian Finney-Smith\nPF: Kristaps Porzingis\nC:  Dwight Powell\n\n#MFFL \n\nhttps://t.co/wVtLF3iBZN",
    "35": "@dallasmavs @ModeloUSA NO BULLOCK 😤😤😤😤😤",
    "36": "@dallasmavs @ModeloUSA Start Frank please…",
    "37": "@dallasmavs @ModeloUSA Finally https://t.co/RdJMDO5z20",
    "38": "@dallasmavs @ModeloUSA Nets own u",
    "39": "@dallasmavs @ModeloUSA We gonna pretend the other tweet not happened, ok?",
    "40": "@dallasmavs @ModeloUSA What is love, baby don’t hurt me",
    "41": "@dallasmavs @ModeloUSA I can’t wait… 😔",
    "42": "@dallasmavs @ModeloUSA DWIGHT POWELL 💦",
    "43": "Your first 🖐 on the floor tonight. \n\n@ModeloUSA | #FightingSpirit https://t.co/e9ag1bVzpn",
    "44": "Memphis Grizzlies vs. Dallas Mavericks: Live updates, scores https://t.co/T91F9NYGDf",
    "45": "@djwhitman34 @MavsFilmRoom @dallasmavs I’ve seen plenty of times where off the ball movement (back screen here and there) led to a easy basket.",
    "46": "@Mavs_FFL If the Mavs win my whole week will be made, if they do not, I will be miserable, you really want that to happen?? @dallasmavs",
    "47": "Memphis Grizzlies (1.53) v \nDallas Mavericks (2.78) \n09.12.2021 - 02:00\nhttps://t.co/QXquYsJsQ1\n\n@NBA \n#Basketball https://t.co/jmwDcdFTBD",
    "48": "Dallas Mavericks (+1.5) @ Memphis Grizzlies #MFFL #GrindCity #NBA #NBATwitter #NBA75",
    "49": "Memphis Grizzlies to beat Dallas Mavericks @1.86",
    "50": "Dallas Mavericks Starters:\n\nLuka Doncic\nReggie Bullock\nDorian Finney-Smith\nKristaps Porzingis\nDwight Powell\n\nPlayers out:\nSterling Brown\nWillie Cauley-Stein\n#MFFL #NBA #NBATwitter #NBA75",
    "51": "Memphis Grizzlies to beat Dallas Mavericks @1.76",
    "52": "Tonight's starting lineup for the Dallas Mavericks: Doncic, Bullock, Finney-Smith, Porzingis, Powell https://t.co/bVWH4AMCA2",
    "53": "NBA Live Scores: Game open! Follow to get updates as HOU hosts BKN.  @HoustonRockets @BrooklynNets #NBAGame open! Follow to get updates as MEM hosts DAL.  @memgrizz @dallasmavs #NBA",
    "54": "NEW YORK (AFP) — James Harden and Kevin Durant led a late fightback as the Brooklyn Nets overturned a 17-point, third-quarter deficit to edge past the Dallas Mavericks on Tuesday. https://t.co/Mo6n89lqN8",
    "55": "@dallasmavs @ModeloUSA God this is so on brand for today",
    "56": "@dallasmavs @ModeloUSA who cares? Why do you interact with the fake fans?",
    "57": "@dallasmavs @ModeloUSA Is Luka daddy playing or no!?",
    "58": "@dallasmavs @ModeloUSA same thing as the last 3 years dallas?",
    "59": "@dallasmavs @ModeloUSA So nobody is playing?",
    "60": "@dallasmavs @ModeloUSA Sick",
    "61": "@dallasmavs @ModeloUSA Nice picture",
    "62": "Wednesday Nite 🏀 \n@memgrizz vs. @dallasmavs \nGrizzlies Starters:\nTyus Jones\nDesmond Bane\nDillon Brooks\nJaren Jackson Jr. \nSteven Adams \nNOW: GrizzliesLive \n7pm: Tip\n@GrizzOnBally 📺 https://t.co/ASWxBqf8sH",
    "63": "NEW form @TimCowlishaw: \n\nLuka Doncic’s numbers resemble those of one former MVP, and that’s bad news for the Dallas Mavericks\n\n#MFFL https://t.co/3v1K03a1XS",
    "64": "@FantasyLabsNBA Do Dallas mavericks please!😩",
    "65": "@dallasmavs @Academy @MaxiKleber @DwightPowell33 @JoshBGreen Can I get someone from academy to help me with a golf sweater that continues pilling..it was very expensive!Thanks",
    "66": "The @dallasmavs have lost 8 of the last 10 and @mcuban is complaining about the fans https://t.co/1Hz5B8PPZh https://t.co/6EBzPAYusI",
    "67": "Mark Cuban having a twitter melt down an hour before tip off is peak Dallas Mavericks",
    "68": "@GrizzliesPR @memgrizz @dallasmavs feel like Slow might be back by the weekend if he's the closest back \n\n12 we won't see for a minute just yet though perhaps the Portland/OKC home b2b in a week and a half",
    "69": ".@memgrizz status update: Kyle Anderson (Back Soreness) is out tonight vs @dallasmavs.\n\nIn addition, Jarrett Culver and Yves Pons are both available. https://t.co/PHcHIBhZEC",
    "70": "We out here \n\n@dallasmavs || #MFFL https://t.co/egZ46TP5I3",
    "71": "Wednesday Nite 🏀 \n@memgrizz vs. @dallasmavs \n6:30pm- GrizzliesLive \n7pm- Tip\nOn @GrizzOnBally 📺 \n#GoGrizz 🐻 \n#GrzNxtGen 🙅‍♂️\n#GrindCity \n#GoFor6 🥇 \n#SilverBullets 👞 https://t.co/5pWSguDwEp",
    "72": "Consensus Line Move:\n2021-12-08 Dallas Mavericks at Memphis Grizzlies from 218.50 to 219.50\nOver almost there\n#NBA #sports #data #profit",
    "73": "Consensus Line Move:\n2021-12-08 Dallas Mavericks at Memphis Grizzlies from -2.50 to -1.50\n#MFFL what ya gonna do?\n#NBA #bettingsports #dataanalytics #bitcoinmining",
    "74": "GAME THREAD: Dallas Mavericks at Memphis Grizzlies https://t.co/fBXJPheii6 https://t.co/MDupabHmWZ",
    "75": "@dallasmavs @swish41 commentators annoying asf",
    "76": "@MavsFansForLife Tonight it's @dallasmavs at @memgrizz - hope I finally get to see a W tonight! https://t.co/EnpSzERyY2",
    "77": "@andyserling @NBAonTNT @dallasmavs nothing on Medina Spirit",
    "78": "@MavsPR @dallasmavs Rest him for the remainder of the season.  Or until they build a team around him.",
    "79": "Dallas Mavericks @ Memphis Grizzlies\nPick : Dallas Mavericks.\nBasketball. NBA",
    "80": "NEW YORK (AFP) — James Harden and Kevin Durant led a late fightback as the Brooklyn Nets overturned a 17-point, third-quarter deficit to edge past the Dallas Mavericks on Tuesday.\n\nREAD MORE: https://t.co/xvpNVqrSF6\n\n#NBA \n#DailyTribune",
    "81": "@dallasmavs money line is a lock against the @memgrizz",
    "82": "@jontaffer we need you to rescue the Dallas Mavericks!!!",
    "83": "Luka Doncic /49 Timeless Moments Auto pulled today from our @paniniamerica One and One Basketball breaks! 🏀🏀 @luka7doncic \n#boom #whodoyoucollect #luka #dallas #mavericks #nba #lukadoncic #basketball #thehobby #autograph #groupbreaks https://t.co/RV0rUuoRAr",
    "84": "@MavsPR @dallasmavs we gonna lose anyway",
    "85": "64% of consumers cite brand recognition as the primary reason they have a started using a brand. Same for #crypto\n\nWho's talked about #Dogecoin before?\n\n@elonmusk\n@TheEllenShow\n@mcuban  \n@dallasmavs \n@AMCTheatres \n@tacobell \n\n#dogearmy #doge is strong!!\n\nMy mom even knows it!",
    "86": "Get it done @dallasmavs !!!! https://t.co/fYDnyNoPKv",
    "87": ".@dallasmavs Coach Jason Kidd says that Luka Doncic (left ankle soreness) is warming up and is a game time decision tonight at @memgrizz https://t.co/drMeWxOiME",
    "88": "Back the Grizzlies tonight as they put their five-game win streak on the line with the Dallas Mavericks in town.\n\nNew Users: Use code ATOZSPORTS to get a 20% deposit bonus up to $1,000 on @DKSportsbook! https://t.co/jHrv9LHHDI",
    "89": "Dallas Mavericks owner Mark Cuban purchased a small (and empty) #Texas town. #urbandesign\n\nhttps://t.co/XFO91Oxn6S",
    "90": "Memphis Grizzlies vs Dallas Mavericks\n\nProjected Score\n\nPlayer Prop Point Projections\n\nhttps://t.co/b2YaLv4TKU",
    "91": "@dallasmavs @memgrizz @BallySportsSW @theeagledallas The poster art though 🔥🔥🔥",
    "92": "Memphis Grizzlies Predictions and Preview for 12/8/2021 hosts Dallas Mavericks.  Looking for betting action?  Find out if there is any value in our preview. #NBATwitter #Picks https://t.co/3vfYziS57L",
    "93": "Dallas Mavericks: Down 17, Nets Rally 102–99 to Give Mavericks Fifth Straight Home Loss https://t.co/Ld1JO3ES1y",
    "94": "@dallasmavs are 24 out of 30 teams in 3-point shooting percentage this year.  Last year they were 17. 33% will not get it done. Highly correlated to best teams (Golden State, Chicago, Phoenix, Utah, Brooklyn, Milwaukee, etc.) https://t.co/da0vRBnbM2",
    "95": "Looking for a value bet?  See if the Dallas Mavericks-Memphis Grizzlies Predictions and Preview for 12/8/2021 is one in our preview.  No crazy hype just a prediction and preview. #NBATwitter #Picks https://t.co/3vfYziS57L",
    "96": "Honored to be performing tonight at the Forum again for the @memgrizz vs @dallasmavs  game. Start time 7pm. See you there #Memphis https://t.co/YZkCx5Ef41",
    "97": "I support anything Dallas but the Mavericks and that’ll never change",
    "98": "@dallasmavs  should really look up to this, Turner would stabilize the Center position just like Tyson Chandler back in 2011 while he was playing with Dirk. #MFFL #LetsgoMavs @nianoelle24 https://t.co/d5wCQuu6nu",
    "99": "NBA Basketball Game Betting Picks Simulator: 8:10 PM ET - Dallas Mavericks vs. Memphis Grizzlies - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/eHqW8ZXbjX #nba #sportsbetting #freepicks #cappertek",
    "100": "@RawstonGeorge I just wanna hear him say “I coulda played for the Dallas Mavericks, but they found crack in my jacket” lmao",
    "101": "This season, the Dallas Mavericks rank number 27 in the NBA for defensive rebounds with 765 #DallasMavericks #MFFL #NBA #NBA75",
    "102": ".@IMPACTWRESTLING's @TheMooseNation opines on the Dallas cold, Mavericks and being the best World Champ in wrestling - @inthemageors &amp; @OThankKevin https://t.co/Bz6MtXCbcV",
    "103": "dallas mavericks https://t.co/qw1iIAxLCb",
    "104": "@dallasmavs @cavs @Bucks my money is on y’all tonight! Please make my night and destroy the teams y’all are facing tonight. Especially you @Giannis_An34 for making that BS 3 that fked up my Cavs +6.5 the other night.",
    "105": "@memgrizz @dallasmavs @GrizzOnBally @FDSportsbook @929espn What uniforms are wearing tonight?",
    "106": "@dallasmavs @memgrizz @BallySportsSW @theeagledallas Let’s go Mavs #MFFL https://t.co/Afdi207buD",
    "107": "@dallasmavs @memgrizz @BallySportsSW @theeagledallas To another L?",
    "108": "Marc Stein on @dallasmavs:\n\n“They want to make a move, but it’s not going jump off of the page.” \n\n#MFFL #NBATwitterLive https://t.co/t7XRK2xgIc",
    "109": "@ctoricky @MavsFilmRoom @dallasmavs If I know you can't shoot.. i can just stand in the paint. Not being able to shoot makes the game so much more tough. We don't have post up players like that. KP is okay but its not like we dumping it down to Embid or Giannis.",
    "110": "The Mavericks of Dallas are a bad professional basketball team right now. That’s all",
    "111": "My biggest achievement: staying mentally strong while supporting Barcelona and Dallas Mavericks",
    "112": "The Dallas Mavericks are struggling and Luka Dončić deserves some of the blame https://t.co/1aOl1Gjk50 https://t.co/r1Fve2rAC6",
    "113": "🏀 #NBAtwitter\n\n#MFFL\n\nLuka Doncic accepted his conditioning must improve amid criticism following the @dallasmavs' fifth straight home defeat in the #NBA. https://t.co/fOc8qTDHIR",
    "114": "Consensus Line Move:\n2021-12-08 Dallas Mavericks at Memphis Grizzlies from 217.00 to 218.00\nOver Lets Go!\n#NBA #parlay #sabermetrics #businessowner",
    "115": "The #Rockets' quest for a 6th straight win in a clash with the #Nets and a #Mavericks-#Grizzlies rematch with a fortified Dallas squad are two of the big storylines on a huge #NBA Wednesday. A betting preview, including free picks videos, @TheLinesUS: https://t.co/KijBK6Guyb https://t.co/CeU2yyb5SK",
    "116": "No. Have @SpectraExp fill it if they can…and then raze it…soon the city will have @AACenter to hold all their conventions when #NevilleCuban moves the @dallasmavs across the street. Enough with the shiny objects and spending other people’s money. https://t.co/7gKjKGT3Cm",
    "117": "Just added under 219 Dallas Mavericks. I now have 213.5-219 middle going.",
    "118": "@dallasmavs What going ham really looks like… https://t.co/28nKjAz0Z7",
    "119": "@WilsonBasktball I would like to know why you have single-handedly ruined the Dallas Mavericks season? @mcuban has advised that this is all your fault, so please explain yourself 🙃",
    "120": "@MavsBurner @SJBasketball8 @BibsCorner @pandahank41 @redditmavericks @Mavs_FFL This person deserves to be our social media admin for the Dallas mavericks",
    "121": "I'm begging you to sell the Dallas Mavericks organization LMAO you are the most useless owner of all time in the history OF ALL SPORTS. You wasted Dirk nowitzki's prime years, you let nash go and now you are wasting Luka's prime. https://t.co/whKEeIbvbW",
    "122": "🐎//🥫 What’s the secret sauce to winning a championship?\n\nAt the @dallasmavs, they had @swish41 on the court, but off the court? It was all about consistency.\n\n🗣Season 3 of @FullContactCEO is out now!\n\n@GeorgeKillebrew | @AlexMagleby\n\n#SaddleUp #TogetherWeRide",
    "123": "Dallas Mavericks: NBA Rumors: Luka Doncic Reportedly Interested In Playing With Ben Simmons 'Since The Summer' https://t.co/ecL3o1WXle",
    "124": "Has he been hacked? @dallasmavs did Cuban just blame our inability to shoot on the.....ball? https://t.co/6kAKGmEPRO",
    "125": "The Dallas Mavericks are struggling and Luka Dončić deserves some of the blame https://t.co/XwGk7a8bbP #sports #feedly",
    "126": "(seeing something terrible happen to zingus) \n\ndamn....poor zingus\n\n@dallasmavs @SportsCenter @kporzee @SHAQ #basketball #fun #jamescorden",
    "127": "Hey @dallasmavs, send me a contract. I promise I can knock down open 3’s.",
    "128": "So Luka gets his extension, and then decides to be a fat ass?  Awesome job everyone... @dallasmavs",
    "129": "@dallasmavs @luka7doncic Luka: \"Did you film it?\"",
    "130": "@dallasmavs @Chime Sad loss",
    "131": "The Dallas Mavericks are struggling and Luka Dončić deserves some of the blame https://t.co/C3EryNdlle",
    "132": "Luka and Simmons might start a dynasty. Mavericks never had a good perimeter defender and Simmons would solve 95% of Dallas problems on defense.",
    "133": "@dallasmavs this is being generous. https://t.co/TyHMxZiJm5",
    "134": "Wait...what? @dallasmavs @RealJasonKidd still has a job today? I've LOVED JKidd since he was an All-American. He's a treasure. He is not the coach we need right now, however. This isn't working. Look at our record. If this were anyone else, with any other team, @ this time in the",
    "135": "@dallasmavs @swish41 One of the best! Very loyal and never went to chase a championship like other selfish players that couldn’t do it with just one team.. This guy deserves my salute!",
    "136": "The Dallas Mavericks are struggling and Luka Dončić deserves some of the blame https://t.co/C1LZs4Y6xS",
    "137": "@mcuban This is such bs. You are literally blaming a ball as the reason for the @dallasmavs not winning games? Everyone is shooting with the same ball and no one is complaining but you.",
    "138": "NBA Free pick of the Night 🏀\nMemphis Grizzlies vs Dallas Mavericks - Dallas ML (2.6)\n\nLast time these teams met, Memphis beat the Mavs by only 7 points which isn't very impressive considering neither Luka or KP played that game.",
    "139": "@XeinWins @dallasmavs @swish41 Your book https://t.co/461wxb0PCm",
    "140": "Even if we lose or win, I don’t mind seeing Kidd put JG in the game to guard Bane. Who’s with me. @JoshBGreen @dallasmavs #mffl @luka7doncic",
    "141": "@dallasmavs @Chime Doncic weighs more than the whole nets team he should hit the gym",
    "142": "#CardOfTheDay \n\n@Lukadoncic and the @dallasmavs take on the @memgrizz tonight! \n\nUse code: COTD20 to get 20% off our card of the day\n\nShop now\nhttps://t.co/hh8E8vMAMi \n\n#CXStuff #CollectibleXchange #thehobby #whodoyoucollect #nbacards #paniniamerica #rookiecards #gemmint https://t.co/gNCOF5scn3",
    "143": "imagine playing PG for the Dallas Mavericks but your last name not Doncic",
    "144": "@dallasmavs @memgrizz @BallySportsSW @theeagledallas Media guy can you pls let @mcuban or your boss know this sucks and the fan base wants something done about this team, so depressing how you’re just wasting Luka",
    "145": "I added the Dallas Mavericks +4 @-110 &amp; Stephen Curry Over 27 Points @-110. He is aiming to hit 16 Threes tonight so the with the Total at 27 we had to take this Wager. 7 #FreePicks for #GamblingTwitter from #JuniorSports @BetOpenly @SportsDataNow @barstoolsports @BleacherReport https://t.co/5ArvAawI7u",
    "146": "Which team do you think has the most firepower this season ?\n\nA. Dallas Mavericks - @CulebroVikingo \n\nB. Los Angeles Lakers - @JanselTheGreat \n\nC. Atlanta Hawks - @KeepUpGifted \n\nD. Milwaukee Bucks - @yellowcordero \n\nE. Other\n\n#99LeagueSeason7 https://t.co/ec89TD3KjZ",
    "147": "@dallasmavs How did they lose!?",
    "148": "Luka Doncic’s numbers resemble those of one former MVP, and that’s bad news for the Dallas Mavericks https://t.co/j4zqfglp77",
    "149": "@Dame_Lillard and #BenSimmons come to @dallasmavs because @luka7doncic neeeeedss help and y’all want rings!",
    "150": "@GrizzliesPR @memgrizz @dallasmavs Let’s give Culver time 🙏🏼",
    "151": "@dallasmavs @SteveNash @RealJasonKidd Did they take a pic together with Dirk in the middle?",
    "152": "This tweet is not Dallas Mavericks related. I wanted to let y'all know I started streaming Apex Legends on Twitch. I'll be live tonight at 7PST follows appreciated 😊 https://t.co/qcOZyeQCyG",
    "153": "Team: Dallas #Mavericks vs Memphis #Grizzlies\nStart time: December 08, 2021, 20:00 ET\nFree NBA Stream - https://t.co/67ocb31064\nVenue Name: FedExForum\nVenue Location: Memphis, TN 38103, USA\nCompetition: Regular Season\nSport: #NBA https://t.co/H9QgpzTkDp",
    "154": "Bring Myles Turner home @dallasmavs https://t.co/wwobdJsP20",
    "155": "@dallasmavs please on everything that is good in life…please win this game tonight with or without Luka!",
    "156": "Luka Doncic’s numbers resemble those of one former MVP, and that’s bad news for the Dallas Mavericks, @TimCowlishaw writes | #MFFL https://t.co/3v1K03a1XS",
    "157": "This is what I mean by the Mavericks were missing a LOT of open shots. Nets rotate out of this okay initially (clip doesn't show full play), but that's two completely uncontested threes for Dallas. https://t.co/FA3Dn9gf5Q",
    "158": "@MFFLdaniel @LakerFanSince73 @TrolledByPG @statmuse Clippers are the owners of the Dallas Mavericks and Luka soon weighs more than Zion 🤣",
    "159": "Dallas Mavericks: Luka Doncic's numbers resemble those of one former MVP, and that's bad news for the Dallas\u0085 https://t.co/49Mso490WJ",
    "160": "@M_Flores187 @coachdupo @407matto @icetraelatte @dallasmavs @Chime Just don’t report me again 😂🤣😭",
    "161": "Last night the Nets showed some fight as they came back from a 17-point deficit to defeat the Dallas Mavericks\n\n@J_Thomas_24 recaps the game and gives two key takeaways from what was another nail-biter\n\nhttps://t.co/qwarUKXORs",
    "162": "@M_Flores187 @coachdupo @407matto @icetraelatte @dallasmavs @Chime Don’t report me 😂🤣😂",
    "163": "@emelendez30 @dallasmavs @mcuban MAKE THIS HAPPEN",
    "164": "@girldadNFT @ChewieWoolf @TopShotGiftGoat @BrooklynNets @dallasmavs @TopShotDadMoves @etchedNFT @TheOfficialHDA Thank you for the opportunity.",
    "165": "@letstalknow187 @coachdupo @407matto @icetraelatte @dallasmavs @Chime You won't be talking now again.",
    "166": "@letstalknow187 @coachdupo @407matto @icetraelatte @dallasmavs @Chime I'm good but you should behave we all know this is it for you 😂",
    "167": "@memgrizz @dallasmavs They’re still recovering from Saturday",
    "168": "Shannon Sharpe on Luka Dončić’s conditioning level: ‘This is flat out embarrassing’ | UNDISPUTED: The Dallas Mavericks hosted the Brooklyn Nets Tuesday night. The Mavericks lost the game by three after not being able to connect on a game tying shot while… https://t.co/DVw7nHvolm https://t.co/V8F584oceo",
    "169": "@M_Flores187 @coachdupo @407matto @icetraelatte @dallasmavs @Chime You should operate 3 accounts like my fellow Korean",
    "170": "@MFFLdaniel @TrolledByPG @statmuse Nothing you will say will change the fact that the Clippers are the official owners of the Dallas Mavericks LMAO 2 beautiful first round exits for you 😊",
    "171": "@M_Flores187 @coachdupo @407matto @icetraelatte @dallasmavs @Chime Don’t report that tweet! 😂",
    "172": "@M_Flores187 @coachdupo @407matto @icetraelatte @dallasmavs @Chime You did and you know it. Touched a nerve with the comment",
    "173": "@letstalknow187 @coachdupo @407matto @icetraelatte @dallasmavs @Chime What excuse we lost by 3 to the best team in the East.",
    "174": "@letstalknow187 @coachdupo @407matto @icetraelatte @dallasmavs @Chime I didn't report anything but that's hilarious 😂",
    "175": "@M_Flores187 @coachdupo @407matto @icetraelatte @dallasmavs @Chime Good to see you’re still making excuses for Luka tho. He’s proving he’s not the guy! 😂",
    "176": "Dallas Mavericks will return home on Monday against the Charlotte Hornets after a 3-game road trip.",
    "177": "The best hope right now is to wait to see if there is any redemption tonight for Dallas Mavericks in Memphis against the Grizzlies. Till then, it's time to reflect on the loss.",
    "178": "Last night, the Dallas Mavericks suffered a heartbreaking home loss to the Brooklyn Nets. It was very sad to see it happen and caused a lot of pain for the fans. To those that experienced it, I feel your pain right now, but there's nothing we can do to go back and change it.",
    "179": "@M_Flores187 @coachdupo @407matto @icetraelatte @dallasmavs @Chime You reported that account - can’t say why cause you’ll report me again",
    "180": "@dallasmavs @SteveNash @RealJasonKidd 11-12 \"the vibes are immaculate\" https://t.co/oiOYp8nnYp",
    "181": "Dallas Mavericks’ Luka Doncic admits having issue with weight, conditioning https://t.co/HNOA95NfeT",
    "182": "@dallasmavs Green playing hard to defend..THJ is a lazy defender",
    "183": "@letstalknow187 @coachdupo @407matto @icetraelatte @dallasmavs @Chime What happened 😂 how much did this account cost? https://t.co/nuSPHseWf6",
    "184": "@jslime22 @realonlinejack @dallasmavs @SteveNash @RealJasonKidd Ratio.",
    "185": "@dallasmavs Green is better than THJ",
    "186": "@jslime22 @dallasmavs @SteveNash @RealJasonKidd you’ve made an enemy when you could’ve made an ally\n\nprepare oneself",
    "187": "@M_Flores187 @coachdupo @407matto @icetraelatte @dallasmavs @Chime You really reported that account and you know it\n\nWas fun seeing Luka shit the bed yesterday 😂🤣😂",
    "188": "Enjoy basketball? Free tickets for #TexasVeterans to home games of Texas Legends, minor league team of Dallas Mavericks, thanks to @prjkt_vet , Digital Names &amp; Texas Legends. Upcoming home games Dec. 9 &amp; 11; 75 tix for each game, limit 4/ person. \nGet tix:\nhttps://t.co/hu7qGX9nky https://t.co/SFmoQwDICt",
    "189": "Watching the @dallasmavs recently ☹️ https://t.co/XOJmHa4J17",
    "190": "@dallasmavs go tell @mcuban to do whatever it takes to get Sabonis!  https://t.co/JgRExJwyvZ",
    "191": "@dallasmavs @SteveNash @RealJasonKidd Do the Suns really have to own yall on the basketball court AND Twitter? C'mon yall have some dignity https://t.co/ruh8nwVe8E",
    "192": "@HouseMavericks @dallasmavs @memgrizz @BallySportsSW @theeagledallas we not bouncing back",
    "193": "@dallasmavs @memgrizz @BallySportsSW @theeagledallas woke up and i still hate this team",
    "194": "@KDTrey5 One of my Favs.. \n#DallasMavericks Basketball 🏀 https://t.co/pKVAv5wWyh",
    "195": "@M_Flores187 @coachdupo @407matto @icetraelatte @dallasmavs @Chime No wonder K took the kids 😂",
    "196": "@coachdupo @407matto @icetraelatte @dallasmavs @Chime I’m Korean like you champ just not a butcher 😂😂😂",
    "197": "In partnership with @ForOakCliff and @RepToniRoseTX, and with support from the @dallasmavs, we will open a Connected Learning Center in Oak Cliff on 12/9. The center will provide students and families w/ free access to internet, computers, and educational resources.",
    "198": "@Mavs_Win @dallasmavs @memgrizz @BallySportsSW @theeagledallas Who tf is voting for mavs +10????",
    "199": "@dallasmavs @memgrizz @BallySportsSW @theeagledallas Another L cant wait",
    "200": "@lileddiiee Dallas Cowboys or Dallas Mavericks apparel thanks bud",
    "201": "The Dallas Mavericks might have the worst and ugliest logo in the NBA. Thought this when Cubes decided to change the look and unis in the early 00's. It is unfortunate Dirk had play almost his whole career wearing this. https://t.co/rMwsRBxyVq",
    "202": "@jericho130 @MavsPR @dallasmavs Hope they recover soon",
    "203": "Sistema #NBA75   🏀\n\nDallas Mavericks vs Memphis Grizzlies \n7:00 P.M. \n\nGRIZZLIES -3.5\n\nMomio: -110\n\n#GrizzDub         @memgrizz \n\n#DALvsMEM \n\n#FreePick https://t.co/v4lcCqoVaR",
    "204": "@dallasmavs @memgrizz @BallySportsSW @theeagledallas Wow we’re going to get smashed again",
    "205": "If they handle business we could be top four. \n\n@memgrizz \n@okcthunder \n@OrlandoMagic \n@dallasmavs",
    "206": "Never ran into any of the Dallas Mavericks until today, when I ran into all of them in the lobby of my hotel in Memphis",
    "207": "TONIGHT @ 7pm: @memgrizz VS @dallasmavs. 🏀 Grab your tix now &amp; make sure you stop by &amp; see us on the way to the game! 🐻 https://t.co/5k31OXwwCi @RobertPera @JaMorant https://t.co/qEZxPeITVW",
    "208": "the Dallas Mavericks play NBA basketball tonight https://t.co/lPKeZt8fwl",
    "209": "@dallasmavs @memgrizz @BallySportsSW @theeagledallas Just win tonight please",
    "210": "Mavericks’ Luka Doncic addresses his conditioning: ‘I know I’ve got to do better’. Luka Doncic’s comments come following Brooklyn’s come-from-behind victory over Dallas. https://t.co/kedYO0YmbR",
    "211": "@dallasmavs @memgrizz @BallySportsSW @theeagledallas But are they going to review film and practice or just show up disinterested? Hurting ticket sales in every city!",
    "212": "I think it was @HPbasketball who basically said that because the Dallas rim rate is so bad, the Mavericks are a jump shooting team who hits jumpers at an average rate at best. So open or not, the shots arent good enough, if I'm understanding all this.",
    "213": "@dallasmavs This kid can help us. I don’t care what anyone says. We need high energy guys which is lacking at times for this team.",
    "214": "Our PRO Report shows sharp money coming in one one side in tonight's matchup between the Dallas Mavericks and Memphis Grizzlies: https://t.co/UwlOA5ImJy",
    "215": "@NBA @BrooklynNets @dallasmavs Bro this man is insanely clutch something I’ll cherish",
    "216": "Warzone  NEW MAP!! High Kills!! Dallas Mavericks tickets giveaway.. follow @plugmeingaming on IG!! Come chill and talk!  https://t.co/h4vzhWigxN",
    "217": "@affishall @ReggieBullock35 @dallasmavs I’m a diehard fan and it’s tough for me to watch these games bro.",
    "218": "@dallasmavs @Chime I was in the game last night. How can we redeem free chick-fil-a sandwich for the two missed foul shots?",
    "219": "@dallasmavs let me train Luka I’ll get him in shape",
    "220": "Shareef O’Neal has signed a NIL deal with NFT Genius, a cryptocurrency startup. Investors in the company include celebs like Dallas Mavericks owner Mark Cuban and actor Ashton Kutcher. https://t.co/fWW7T1u4R2",
    "221": "@MimirToken @theqkit @NASA @volvocars @E3 @MLS @dallasmavs Can you update the play store, so we can have the latest version of the app?",
    "222": "@HouseMavericks @dallasmavs @memgrizz @BallySportsSW @theeagledallas Regarding how was the outcome of last few Mavs games: are you sure?\nJust pointing on obvious.",
    "223": "Dallas Mavericks Legend Dirk Nowitzki Talks about Brooklyn Nets Kevin Durant 💪🏾🔥 https://t.co/oSOizR574Y",
    "224": "@dallasmavs @NBA2K @kporzee @NBA2K @MosesBrown_ Moses Brown's face scan missing more than one year!!!",
    "225": "Mavericks vs. Grizzlies PRO Report: Do Sharps Back Dallas to End Losing Streak? https://t.co/5emtrOo9RW",
    "226": "How I feel about Dallas Mavericks after they lost to Brooklyn Nets 102-99 https://t.co/7nGa7iZVSs",
    "227": "@dallasmavs @Chime Bullock https://t.co/IujQrhKVbr",
    "228": "@dallasmavs @memgrizz @BallySportsSW @theeagledallas Luka on Beale Street looking for BBQ https://t.co/c0YaBfd8HA",
    "229": "13-game slate TONIGHT on NBA League Pass and NBA on ESPN! 🏀👍👍👍👍👍👍👍👍\n\n📱: \nhttps://t.co/9R7TWwo4Dz 👍👍👍👍👍👍👍👍\n\nWhat game are you looking forward to?! 👀 Dallas Mavericks vs Memphis Grizzlies 👍👍👍👍👍👍👍👍 https://t.co/zUyH9j52BD",
    "230": "@steph_rts @dallasmavs @memgrizz @BallySportsSW @theeagledallas Well guess you won’t be giving any funds to any mavs players 😂",
    "231": "@dallasmavs @memgrizz @BallySportsSW @theeagledallas Make sure to tell the team they have a game today since it’s clear they haven’t showed up in the last few games.",
    "232": "@dallasmavs @memgrizz @BallySportsSW @theeagledallas Oh yay can’t wait",
    "233": "@MavsTracker @BallySportsSW @FedExForum @dallasmavs @memgrizz @GrizzUniTracker Not ready for another 10% shooting night 😞",
    "234": "Dorian Finney-Smith (2016 PIT All-Tournament Team, Florida) collected 15 points (4-9 3-pt), 6 rebounds and 3 steals in the Dallas Mavericks' 102-99 loss to Brooklyn Nets. Finney-Smith has made 12-of-22 three-point attempts in December (54.5%). @GatorsMBK @FloridaGators",
    "235": "NBA rumors: 5 best targets for the Dallas Mavericks right now\n\n https://t.co/DoHY6P2Pn2",
    "236": "@vcoronado7 @MavsTracker @Jumpman23 @luka7doncic @dallasmavs @MavrelloB @MavsPR @CenterAirlines That is awesome - Thank you for your service Vincent 🤜🤛",
    "237": "@dallasmavs @memgrizz @BallySportsSW @theeagledallas Time for the big payback! Let’s humble Desmond Bane! https://t.co/EFKGBf3CSK",
    "238": "@dallasmavs @Chime I'm waiting for the copypasta of being a Mavs fan since 2001 or something. Where y'all at?",
    "239": "@LukaDonkicks @MavsTracker @Jumpman23 @luka7doncic @dallasmavs @MavrelloB @MavsPR @CenterAirlines We were in section 304 and were given tix as part of the Community Ticket Program. I work for a nonprofit and we were able to give tix to our youth and their families",
    "240": "@vcoronado7 @MavsTracker @Jumpman23 @luka7doncic Absolutely saw these at a recent game. I believe they hand them out in the former Spite Fan Zone section. @dallasmavs @MavrelloB @MavsPR @CenterAirlines can probably help you with the section #!",
    "241": "@dallasmavs @memgrizz @BallySportsSW @theeagledallas Racking up the L's lately",
    "242": "Census Bureau has updated the list of counties that must provide election language assistance: https://t.co/rpjTS2hjRr #txlege\n\n-Dallas must join Harris &amp; Tarrant in providing assistance in Vietnamese\n-Polk must join Maverick in providing assistance to American Indian voters",
    "243": "@dallasmavs Jr.  is a number 6 man at best.    Make a Trade if you can upgrade.",
    "244": "@dallasmavs @memgrizz @BallySportsSW @theeagledallas Let’s get it… https://t.co/4NZQeImpSS",
    "245": "@memgrizz @dallasmavs @GrizzOnBally @FDSportsbook @929espn Can we snag a flight on that PJ?",
    "246": "@dallasmavs Come on Mavericks!    What could we get for Luka, Finney-Smith,  Tim Jr. and KP?     We need high caliber players every night.   We cannot shoot the ball,  There is no Dirk Nowitzki on this team. We need a team of driven winners.  Win or leave.",
    "247": "@Mavs_Win @dallasmavs @memgrizz @BallySportsSW @theeagledallas Wow last year these had more positive results. Mavs fans have lost all hope 💀💀",
    "248": "@dallasmavs @memgrizz @BallySportsSW @theeagledallas as the great philosopher Big Sean so elegantly said \n\n“last night took an L but tonight I bounce back.” https://t.co/id4gVvQ3TB",
    "249": "@MavsNetwork @dallasmavs @memgrizz @BallySportsSW @theeagledallas reheating leftovers. aka the Mavs signing ex-Knicks players.",
    "250": "@dallasmavs Imagine losing a game in which you do this",
    "251": "@realonlinejack @dallasmavs @memgrizz @BallySportsSW @theeagledallas don’t worry kids, we’ve got leftover pasta from last night",
    "252": "Congratulations to NAFC Member @PediPlace on their recent grant from the @dallasmavs Foundation! @MavsOffCourt @TXACC https://t.co/mTuIfJhRiI",
    "253": "@dallasmavs @memgrizz @BallySportsSW @theeagledallas Go Mavs!!!",
    "254": "@dallasmavs @memgrizz @BallySportsSW @theeagledallas It doesn’t matter, this front office a complete joke.  The refusal to build around Luka is baffling",
    "255": "⛹️‍♂️🏀 at @dallasmavs home https://t.co/Sq1tgYRNhY",
    "256": "@CtxSoles @dallasmavs @memgrizz @BallySportsSW @theeagledallas When",
    "257": "@dallasmavs @memgrizz @BallySportsSW @theeagledallas @RealDealBeal23 and @luka7doncic would win the games the mavericks are supposed to win,",
    "258": "@dallasmavs @memgrizz @BallySportsSW @theeagledallas I do artwork for your brand/business ✍️💯",
    "259": "@dallasmavs @memgrizz @BallySportsSW @theeagledallas How we feeling MFFL’s?",
    "260": "@dallasmavs @memgrizz @BallySportsSW @theeagledallas prepare for another round of gumbypasta this evening",
    "261": "Don't miss the @dallasmavs take on the @memgrizz TONIGHT on 97.1 The Eagle! 🏀\n\nListen live here: https://t.co/ELv86LZwOE https://t.co/4E6RCKyRd9",
    "262": "Consensus Line Move:\n2021-12-08 Dallas Mavericks at Memphis Grizzlies from 214.50 to 216.50\nOver pouring in\n#NBA #vegas #machinelearning #investments",
    "263": "@dallasmavs @memgrizz @BallySportsSW @theeagledallas If we lose tonight rebuild better start",
    "264": "Woke up in Memphis.\n\n🆚 @memgrizz  \n⌚️ 7PM CT\n📺 @BallySportsSW \n📻 @theeagledallas &amp; 99.1 FM https://t.co/6Cg168NP6F",
    "265": "@HogfarmerChris There’s so many of them cowturd fans here in Florida. I always ask them what part of Texas they come from or how are the @dallasmavs doing this year? \n\nBlank stare \n\nProbably Yankees and lakers fans too \n\n#BANDWAGON",
    "266": "@domandrews123 @dallasmavs They play the nets today so we gone see",
    "267": "@KDTrey5 scored 24 PTS as the @BrooklynNets (17-7) beat the @dallasmavs (11-12) 102-99‼️ #BrooklynTogether #NBAonTNT #NBA #NBATwitter https://t.co/ZbpWSThrQ1",
    "268": "@Xxx_Abelito_xxX Well, Lebron is dubbed “The Chosen One” and not only has he not been the best player in the NBA for multiple seasons but he choked against the Dallas Mavericks in the NBA Finals\nNot my goat",
    "269": "5 Best Trade Targets For The Dallas Mavericks Right Now #MFFL #NBA #NBATwitter #NBATwitterLive\n\nRead More- https://t.co/j4QuieimNW https://t.co/laYF5Qjo66",
    "270": "Bunch of hero ball out there in Dallas.. @mcuban @dallasmavs",
    "271": "@memgrizz @dallasmavs Yo Mavericks social .. I'm friends with the Grizz social, just checking if you got the Grizz message or if you don't \"like\" them like that? 🤔🤦🤦🤦",
    "272": "@Coach_King5 @ReggieBullock35 @dallasmavs This is sick, yes you’ve watched more games than me this season - I just know every time I watch a Mavs game it’s atrociously disgusting.",
    "273": "Wednesday's #NBA75 #BettingPicks from \n@SpreadAstaire\n\n🏀Dallas Mavericks vs Memphis Grizzlies: Banker at -110 (1.91)\n\n+2-team Parlay at +265 (3.65)\n👇👇👇\nhttps://t.co/uCbhVj0pqr",
    "274": "Rant over, but the Dallas fan base has every right to question and be upset with Mark. Rick was a problem and isn't that good of a coach anymore, but he was probably 25% of the problem, the fact is the Mavericks roster stinks and they need to make moves, stop with the feelings.",
    "275": "The worst mascot in the league? Fans said the Dallas Mavericks' Mavs Man should be in last place. https://t.co/La3VW2MisN",
    "276": "Two Hampton Roads players battled last night when Brooklyn beat Dallas 102-99. Mavericks forward Dorian Finney-Smith (Norcom), left, had 19 points, 6 rebounds and 2 assists in the loss, while Chesapeake's Cameron Thomas had 6 points and 5 rebounds in the win. https://t.co/AgMSXHCYGc",
    "277": "Basketball tweet: It pains me to say this, but the Dallas Mavericks problems are not exclusively on Jason Kidd. That roster... is bad. Their front office did a bad job, and put Jason Kidd in a position to avoid accountability for being a bad coach.  Shame on them.",
    "278": "@domandrews123 @dallasmavs Stop hating",
    "279": "@MavsFilmRoom That's my whole problem with the offense. If the 3's aren't falling, why do we keep taking them??????\nAt the beginning of that clip, @dallasmavs had 86 points. They only ended up with a total of 99. Why not take higher percentage shots (closer to the rim)?",
    "280": "@mcuban One question I have been dying to know for years as a Mavs fan is if the red fry in the @Whataburger timeout competition to win free Whataburger for year, is at all different from the others used between the two people competing to throw the coveted red fry? @dallasmavs",
    "281": "holding all four opponents to 91 points or fewer.  One of those games was against the Dallas Mavericks on Saturday when they won 97-90 for just 187 combined points.  These teams are obviously familiar with one another now, and familiarity favors defense and low-scoring games.",
    "282": "@memgrizz @dallasmavs @GrizzOnBally @FDSportsbook @929espn Build around steven",
    "283": "Dallas Mavericks: Lakers In Playoff Bracket, Mavs Out https://t.co/2C2FH8YTwU",
    "284": "@affishall @ReggieBullock35 @dallasmavs The roster is poorly constructed. If they aren’t able to make a cpl trades we might be stuck in mediocrity for a cpl seasons.",
    "285": "@MimirToken @theqkit @NASA @volvocars @E3 @MLS @dallasmavs To the moon 🚀 🚀 🚀",
    "286": "@affishall @ReggieBullock35 @dallasmavs I watch every game, trust me, the only guy on this team that can finish at the rim with contact is Luka. KP post ups really don’t command a dbl and when he is doubled it’s a kick out for another open missed 3.",
    "287": "NBA Martes 7/12: 0-1 Temporada: 46-37\n\nBrooklyn Nets vs Dallas Mavericks O221 (-110) ❌",
    "288": "This season, the Dallas Mavericks rank number 10 in the NBA for opponent free throws per field goal attempt with 0.166 #DallasMavericks #MFFL #NBA #NBA75",
    "289": "@dallasmavs @Chime Get SABONIS from Indiana!",
    "290": "@memgrizz @dallasmavs @GrizzOnBally @FDSportsbook @929espn See you Saturday 😉",
    "291": "back at the crib. come join us. \n\n🆚 @dallasmavs\n📺 @GrizzOnBally | @FDSportsbook\n⏰ 7:00pm \n📻 @929espn \n🎟️⤵️",
    "292": "NBA @BrooklynNets at @dallasmavs, Tuesday, December 7, 2021 @NBA @NBAstats #gamecharts #dataviz #nft https://t.co/V2vA3ajlIz",
    "293": "@MimirToken @theqkit @NASA @volvocars @E3 @MLS @dallasmavs Only one place this project is going and that is to the moon 🚀🚀🚀🚀🚀🚀",
    "294": "@jdjordan13 @dallasmavs @Chime Ong bro",
    "295": "After playing extending themselves to beat Dallas Mavericks last night, don't be surprised to see Houston Rockets win its seventh game in a row with a win over Brooklyn Nets early tomorrow morning",
    "296": "Consensus Line Move:\n2021-12-08 Dallas Mavericks at Memphis Grizzlies from 213.50 to 214.50\nOver has books scared\n#NBA #sportsgambling #coding #entrepreneur",
    "297": "@dallasmavs @Chime Why my favorite player gotta cook my team 😭",
    "298": "BROOKLYN NETS 102-99\nDALLAS MAVERICKS, Final.",
    "299": "@aakam27 @dallasmavs I got 12 pluckers cards 🤣🤣🤣",
    "300": "@dallasmavs Seemed like zero after that from the rest of the team",
    "301": "@Pacers\n@BrooklynNets\n@LAClippers\n@nyknicks \n@sixers\n@spurs\n@utahjazz\n@Lakers\n@suns\n@trailblazers\n@DetroitPistons\n@HoustonRockets\n@dallasmavs\n@warriors\n@MiamiHEAT\n@celtics\n@chicagobulls\n@cavs\n@nuggets\n@Bucks\nSome bad people hold onto their guns\nLousy @NBA people hold onto CCP🇨🇳💰 https://t.co/YL36BHKa3D",
    "302": "Memphis Grizzlies - Dallas Mavericks İddaa Tahmini 09.12.21\nhttps://t.co/x44Aihgk9I",
    "303": "One of the rare times I bet on my favorite team. Mavericks on the road 5-1 ATS in their last 6, 10-3 ATS in their last 13 against a team with a winning record, and it’s a revenge game for when the Grizzlies smacked us up short handed in Dallas. I think Mavs win outright here. https://t.co/vK2pchuAAq",
    "304": "@ProjectUnityNTX @MavsOffCourt @dallasmavs @catalystHN @GiveWisely Awesome! Thank you!",
    "305": "@CJK_STL @dallasmavs Smh they needa quit playing",
    "306": "@Penny4YaThot @dallasmavs I ain’t get nun bro 😂",
    "307": "DasHaus made a bet!\n\nEvent: Dallas Mavericks vs Memphis Grizzlies #NBA\nBet: Memphis Grizzlies TO WIN -4\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "308": "DasHaus made a bet!\n\nEvent: Dallas Mavericks vs Memphis Grizzlies #NBA\nBet: Dallas Mavericks TO WIN +4\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "309": "@All_Things_Mavs The Dallas Mavericks should not be 11-12. That’s all I’m gonna say.",
    "310": "@dallasmavs We lost",
    "311": "I’d be willing to bet if the @dallasmavs shot as well as my local Rec team does on open looks, we wouldn’t hear a peep about @luka7doncic conditioning.",
    "312": "The dallas mavericks are a joke of a franchise. Free Luka Doncic",
    "313": "magic.\n\n@luka7doncic | @dallasmavs https://t.co/FCQxDRot79",
    "314": "@mcuban Can we trade some crypto for some players ? @dallasmavs",
    "315": "@MimirToken @theqkit @NASA @volvocars @E3 @MLS @dallasmavs Let’s gooo 🚀 🚀🚀🚀🚀",
    "316": "Hey @Original_Turner can you demand a trade to Dallas please? #mffl @dallasmavs",
    "317": "@Coach_King5 @ReggieBullock35 @dallasmavs I don’t disagree with any of those statements chief. We need lineups and workouts to be better in regards to “jump shots”. 9-49 is horrendous. When that’s not working you get it to the 7’3 man who will be doubled and let him find a cutter for an easy deuce.",
    "318": "@memgrizz @dallasmavs Watched the zbo documentary. I cried https://t.co/gUAU8bY7mO",
    "319": "Today’s summary:\n@Patty_Mills x @BrooklynNets \n@JoshBGreen x @dallasmavs \n@JockLandale x @spurs #AussieHoops #NBA75 #NBATwitter https://t.co/bd4khtpdYf",
    "320": "@memgrizz @dallasmavs Rise And Grind 💪",
    "321": "@iamDzo @dallasmavs you good?",
    "322": "Mavericks offensive woes continue: Analyzing Dallas’ disappointing loss to Brooklyn https://t.co/xurqPJ51TK",
    "323": "@BallySportsSW @dallasmavs Ouch",
    "324": "Dallas Mavericks' Luka Doncic admits having issue with weight, conditioning - ESPN https://t.co/CA9BUU6iSy",
    "325": "@statmuse as a long time dallas'ite, I am tired of my @dallasmavs being anything but great. I am tired of my @dallascowboys being anything but great! problem is, both of them, with an endless revenue stream, committed owners and a city ripe for the plucking; seem to be two Huge~oh well's.",
    "326": "@KikeGarcia41 Dallas Mavericks😂",
    "327": "@affishall @ReggieBullock35 @dallasmavs Open missed shots is the reason why they lost last night, and the reason they have lost most of the games they have lost. 9-49 from 3 is not going to cut it. This team is jump shooting team who can’t shoot.",
    "328": "@affishall @ReggieBullock35 @dallasmavs It’s not coaches going away from what that works, it be the other team taking it away along with players going away from it. The Mavs are a jump shooting team so they will always revert back to who they are.",
    "329": "My damn @dallasmavs how Tf yah let the nets come back and win how https://t.co/vsa9owgGmt",
    "330": "$MIMIR joins forces with The Q to become the leader in #blockchaingames for the mass markets!\n\n@theqkit technology is tested &amp; trusted by world class brands like @NASA , @volvocars , @E3, @MLS and sports clubs like @dallasmavs.\n\nMore here: https://t.co/O4FgGKp0kC\n\n#GameFi #gaming https://t.co/dy5DL2kP3J",
    "331": "Consensus Line Move:\n2021-12-08 Dallas Mavericks at Memphis Grizzlies from 215.50 to 213.50\nUnder in trouble\n#NBA #sportsbettingadvice #statistics #cash",
    "332": "🏀NBA🏀\n\n(1-0) yesterday\n\n15* Detroit Pistons +6\n15* Dallas Mavericks +4",
    "333": "@memgrizz @dallasmavs If we keep playing ball at this level we will not lose another game this season",
    "334": "@dallasmavs He look drippy",
    "335": "@dallasmavs  Hello, hi hey guys! Y’all gotta start nailing some of these wide open ass 3’s so we can be good.",
    "336": "\"Crazy timelapse of American Airlines Center in Dallas transforming from NBA arena to NHL …\"\n\nhttps://t.co/O8om34I9jv\n\n[via r/mavericks Dec 08, 2019 #Mavs]",
    "337": "Every time you see a @dallasmavs article that takes a comment out of context and spins it in a negative way against the #dallasmavs you know it’s gotta be @espn_macmahon",
    "338": "Dallas Mavericks superstar Luka Doncic addresses criticism over weight, conditioning: “I had Olympics, took three weeks off &amp; then I said I relax a little bit, maybe too much, and I’ve just got to get back on track.” @CallieCaplan reports. #Luka #Mavs #NBA https://t.co/BzptUiMeqR",
    "339": "@Swaggy_Fee @dallasmavs chill hes coming to boston.",
    "340": "@coachdupo @407matto @letstalknow187 @icetraelatte @dallasmavs @Chime This guy really bought a fake account so he could tweet about Luka on a free app. 😂 https://t.co/puxon6aABH",
    "341": "A former Dallas mavericks employee said Luka be drinking ice tea on the sideline instead of water 😂he gotta grow up… if he get in top shape he gon be a serious problem, when shit come too easy some don’t appreciate it",
    "342": "@Mavs_Win @dallasmavs @Chime I think mavs fans frustration lies in that this team just simply haven’t been able to take the next leap into an elite contender despite having Luka, feels like the same team every year",
    "343": "@memgrizz @dallasmavs Nothing much. Just got 2 tix for the Dec. 20 game vs OKC. Going for 80 point dub that night 😬",
    "344": "@MFFL_5 @MavsLad @dallasmavs @ModeloUSA Because is Luka's fault for being fat.",
    "345": "🏀 Dallas Mavericks (@dallasmavs) #MFFL\n🆚 Memphis Grizzlies #GrindCity #DALvsMEM\n‼️ Rare @JetTipNet arrival alert @flymemphis \n✈️ N801DM | B752\n🛫 DAL - 10:49 pm CT\n🛬 MEM - 11:46 pm CT\n📡 Tracking: https://t.co/zJxMhQC9QA https://t.co/Dsc5VV6eF7",
    "346": "@SpyrosVel @MavsLad @dallasmavs @ModeloUSA How in the world is Dwight Powell STILL starting on a NBA team? Stunning.",
    "347": "Dallas Mavericks: Are Mavericks a poor shooting team? Can they turn it around? https://t.co/dY6402kzfC",
    "348": "@DALLUDO41 @Alec77H @dallasmavs @kporzee @NBA2K *points to series vs Clippers*\nWe deadass lost that series because he sorry af",
    "349": "🏀 Brooklyn Nets (@BrooklynNets) #NetsWorld\n🆚 W 102-99 @ Dallas Mavericks #MFFL #BKNvsDAL\n⏭️ Houston #Rockets #BKNvsHOU\n✈️ N664DN | DAL8920 | B752\n🛫 DAL - 10:45 pm CT\n🛬 HOU - 11:22 pm CT\n📡 Tracking: https://t.co/vAkFrRJyVJ https://t.co/Ub2jpn0j4V",
    "350": "@KenNewhouse1 @dallasmavs what’s good ken?",
    "351": "@ygsix_ @memgrizz @dallasmavs Grizzlies sem morant &gt; demonio",
    "352": "@Pikachu_Rangers @memgrizz @dallasmavs Vouch",
    "353": "@dallasmavs Yeh just give them alot of shots🤷🏾‍♂️",
    "354": "@memgrizz @dallasmavs Good morning, Grizz!",
    "355": "@memgrizz @dallasmavs Admin troll",
    "356": "@memgrizz @dallasmavs Top of the morning grizz admin",
    "357": "The Dallas Mavericks were 11-11 before the matchup against the Brooklyn Nets last night.\n\nThe Dallas Mavericks are NOT  a Championship Caliber Team.\n\nThe Brooklyn Nets proved NOTHING last night by falling behind a mediocre team and having to stage a comeback to win.",
    "358": "The @dallasmavs were down 15 points with 6 minutes to go in Game 2 of the 2011 NBA Finals and still won.",
    "359": "@memgrizz @dallasmavs GOOD MORNING",
    "360": "top of the morning @dallasmavs",
    "361": "ASSIST of the Night: Dec. 7th\n\n👉 Luka Doncic of the @dallasmavs https://t.co/li7NB4nfb2",
    "362": "WE’RE GOING (win) STREAKING! Hopefully it continues.\n\nMemphis Grizzlies vs. Dallas Mavericks Game Preview https://t.co/R9XOFNWdxK https://t.co/tVYyMVf1JH",
    "363": "Mavericks (11 - 12) @ Grizzlies  (14 - 10)\n🚨Buzzer Moment Watch\n⏰8:00 pm EST\n📱Buzzer⚡️, NBA League Pass\nSpread: DAL: +5 (-110) | MEM: -5 (-110)\n\nDallas will try to bounce back from a blown lead to Brooklyn against a Grizzlies team that has won 5 in a row without Ja Morant",
    "364": "Will Luka stop the winning run of Memphis? Or will Jaren and company make sure the current issues for Doncic’s squad continue?\n\nMemphis Grizzlies vs. Dallas Mavericks Game Preview https://t.co/hNwaRNwzr0 https://t.co/4EPQzUQxWV",
    "365": "@getnickwright can we ever get your Slovenian son some help down in Dallas? He is not having his best season but the Mavericks are wasting him Cuban has been terrible and they have one of the worst rosters in the NBA. Also I would take Frank Road room over JKidd any day. #MFFL",
    "366": "@TonyHer34152993 @rubenfaz214 @dynamic_voltage @dallasmavs @Chime https://t.co/GDgxI0VGzd\n\nYou’re making us look bad smh",
    "367": "@oscaaargalla @rubenfaz214 @dallasmavs @Chime https://t.co/GDgxI0VGzd\n\nWe lost that year bro, how do y’all not remember this",
    "368": "Dallas Mavericks vs. Memphis Grizzlies Prediction 12/8/21 – Free NBA Picks\n\nNBA Pick Here: https://t.co/5jxDGbnjzn\n\nBet This NBA Game Here: https://t.co/c53tq5Fk5O\n\n#Draftkings #Fanduel #Pointsbet #BETNOW #Sportsbook #bettingpicks #bettingtips #NBA https://t.co/gsb0zVcEzL",
    "369": "@nattypools @dallasmavs @Chime trade everyone",
    "370": "@Coach_King5 @ReggieBullock35 @dallasmavs I watched Kidd now go away from what worked in the 1st half like going to Porzingas with the obvious height mismatch. You don’t change that you play that same tune until it’s worn out.",
    "371": "@luka7doncic I know that your ankle is still bothering you but my son and I are going to our first @dallasmavs game on Dec 21st and we really hope you can play. Appreciate the hard work you’re putting in. Get well and keep grinding!! #MFFL",
    "372": "@peppersquad @OfficialEvanAZ @dallasmavs @SteveNash @RealJasonKidd About as many titles as you won in life ..",
    "373": "@dallasmavs owe me $200! I just needed y’all to score one more basket 100 points was all I asked for 🥲",
    "374": "They’ve had the second most used starting lineups in the league.\n\nAnd they’re only 1.5 games out of the Top 4 in the West with a better record than the likes of the Denver Nuggets, Portland Trailblazers, Dallas Mavericks and New York Knicks.\n\nDon’t throw dirt on them just yet…",
    "375": "@dallasmavs @Chime You guys broke my heart 💔👎🏼",
    "376": "Down the Stretch vs #dallasmavericks. ⁦@ChrisCarrino⁩ with all the comeback Calls. ⁦@TimCapstraw⁩ #bkblock #broooklynnets https://t.co/7WYxjMKOTQ",
    "377": "@dallasmavs @Chime The vibes are not immaculate",
    "378": "@siKUTmismo @dallasmavs @Chime Thank you Kurt, somebody out there has to stay a fan",
    "379": "I don’t understand the @dallasmavs fan who are upset with a team that can’t win.  When @mcuban goes out and hires thug @RealJasonKidd what did you expect?",
    "380": "@seereelgoose @Quietly0bservin @NBA @luka7doncic @dallasmavs he's not that fast",
    "381": "@WisconsinWan03 @NBA @BrooklynNets @dallasmavs because your ass",
    "382": "@dallasmavs @SteveNash @RealJasonKidd Suns Guards for sure. https://t.co/EpVHZaWhMk",
    "383": "@arinettamb @dallasmavs Lmbo",
    "384": "@freekyleusa @dallasmavs invite this kid for a tour man",
    "385": "@jarrettjanssen_ @dallasmavs @Chime @mcuban you see this this is all of us",
    "386": "Dallas Mavericks star Luka Doncic acknowledged he needs to improve his conditioning, saying Tuesday that he has \"got to get back on track.\" #weight #espn #conditioning #issue #dallas #mavericks #luka #doncic #admitsu'https://t.co/CIvgF2Q4ZI'",
    "387": "The Brooklyn Nets beat Dallas 102-99 on Tuesday night, handing the Mavericks their fifth consecutive home loss. https://t.co/dqm2emKPGg https://t.co/w0W7lP6Kwr",
    "388": "5th Consecutive Home Loss For The Dallas Mavericks As They Fall 102-99 To The Nets – NBA News https://t.co/OIP8HQS7Zj",
    "389": "Luka Doncic admits he needs to work on his conditioning after Mavs loss #DallasMavericks #LukaDoncic https://t.co/VZyzstDkKR",
    "390": "5th Consecutive Home Loss For The Dallas Mavericks As They Fall 102-99 To The Nets – CBS Dallas / Fort Worth https://t.co/IJT9r2oAYO",
    "391": "@dallasmavs trade for @Original_Turner !! https://t.co/plrxiSzhuG",
    "392": "@letstalknow187 @dallasmavs @Chime Harry bird under every Mavs post… you’re a literal freak lol",
    "393": "@407matto @letstalknow187 @icetraelatte @dallasmavs @Chime This is Harry bird he’s trolled Luka since the draft day trade. He’s been suspended on over 6 accounts. This one will likely be next",
    "394": "@aakam27 @dallasmavs When y’all find out let me know lol I was wondering the same.., I got my pluckers tho",
    "395": "@arinettamb @dallasmavs Go Mavs",
    "396": "3 things to consider as the Dallas Mavericks hit the road to take on the Memphis Grizzlies  https://t.co/5Tzyy6APf5 https://t.co/m2YtDa1Qor",
    "397": "@dallasmavs @Chime How do you blow that lead",
    "398": "@vettelsge @dixoncic dallas mavericks.",
    "399": "@boreddallascboy @TrashbagsCash @squirrleydad1 @theunclebeard I like the Dallas Mavericks",
    "400": "@dallasmavs Bullock 0-7. THR 0-6.",
    "401": "@dallasmavs @Chime I’ve been a lifelong Mavs fan since 2002 and I can say this is the most embarrassing moment of my life. I’m ashamed right now so I’m turning in my fan card. Goodbye Dallas. I won’t miss you. I’ll be rooting for no one now because I'm a die hard NBA fan.",
    "402": "The Brooklyn Nets pull out a 102-99 win over the Dallas Mavericks https://t.co/p8VRbNHAXE via @wordpressdotcom",
    "403": "Dallas Mavericks’ Luka Doncic admits having issue with weight, conditioning https://t.co/cNGRIzZD7X",
    "404": "@NBA @kaiishome @BrooklynNets @dallasmavs When he make that basket and move he reminds me so much about MJ",
    "405": "The 2015-16 @dallasmavs had 3 point guards (Raymond Felton, J.J. Bares, and Deron Williams) all born on June 26, 1984!!! 🤯 #nba #nbarandomfacts",
    "406": "Dallas Mavericks: How author Brian Cuban overcame drug and alcohol addiction to create his own shadow https://t.co/G4GeOHZBd1",
    "407": "@dallasmavs @Chime I’ve been a lifelong Mavs fan since 2002 and I can say this is the most embarrassing moment of my life. I’m ashamed right now so I’m turning in my fan card. Goodbye Dallas. I won’t miss you. I’ll be rooting for no one now because I'm a die hard NBA fan.",
    "408": "Brian Cuban, brother of Dallas Mavericks owner Mark Cuban, is now 14 years sober. The author has a new book out: “The Ambulance Chaser.” https://t.co/GutIO52ke0",
    "409": "[FINAL] Nets 102 Mavs 99\n\nBrooklyn Nets (17-6) bat Dallas Mavericks (11-12) 102-99.\n\nK. Durant: 24 PTS | 7 REB | 3 AST \nJ. Harden: 23 PTS | 9 REB | 12 AST \nL. Aldridge: 15 PTS | 5 REB \nJ. Johnson: 12 PTS | 4 REB | 4 AST",
    "410": "@FirstTake @NBA @dallasmavs another max deal recipient out after signing 😂😂😂. @mcuban should know better to invest that much on one player.  Luka spent too much on food and now his out of shape. He said it, conditioning issue. What’s the “experts” say today? 😂😂😂",
    "411": "Dallas Mavericks' Luka Doncic admits having issue with weight, conditioning - ESPN https://t.co/poTfDBHluK https://t.co/PWoLpm050c",
    "412": "@407matto @icetraelatte @dallasmavs @Chime Luka should just keep putting up empty stats and not caring on D then. Leadership 😂🤣😭",
    "413": "If you've ever wondered what Luka's pre-game looks like, it's the most casual day in the office 🙂🤣\n\n🎥 @dallasmavs https://t.co/CfJFUBB4Fv",
    "414": "@letstalknow187 @icetraelatte @dallasmavs @Chime I’m not hating I gave you 2 players who are supposed to be their shooters who are both shooting below -40% from the field this season. That’s not hating that’s literally statistical facts",
    "415": "@dallasmavs @Chime Donutcic needs a diet asap",
    "416": "@407matto @icetraelatte @dallasmavs @Chime Mavs fans hate on anyone not named Luka - Mavs win all Luka, they lose everyone else’s fault. Poverty fan base 😂🤣😭",
    "417": "#Grizzlies It's GAMEDAY! Your Memphis Grizzlies (Far from good and honest) take on the Dallas Mavericks (11-12, SEGABABA) https://t.co/ekCYyCy0yt",
    "418": "@letstalknow187 @icetraelatte @dallasmavs @Chime I’m not making excuses. I’m trying to learn more about your strange obsessive hatred. Luka went cold and the whole team was cold. THJ 0-7 on 3s, Bullock 0-6 on 3s and you wanna hate the guy the player that had the most points in the game",
    "419": "@407matto @icetraelatte @dallasmavs @Chime More excuses for Luka going cold in the 2nd half when he was challenged ooof https://t.co/JEen2j0NI8",
    "420": "NBA Basketball Game Betting Picks Simulator: 8:10 PM ET - Dallas Mavericks vs. Memphis Grizzlies - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/eHqW8ZXbjX #nba #sportsbetting #freepicks #cappertek",
    "421": "@letstalknow187 @icetraelatte @dallasmavs @Chime Look at yourself in the mirror man, all your tweets are hating a man that has no idea who you are. Think about that",
    "422": "@407matto @icetraelatte @dallasmavs @Chime Jesus Christ won’t help Luka from all the excuses Mavs fans make for him 😂🤣😭",
    "423": "@letstalknow187 @icetraelatte @dallasmavs @Chime Jesus Christ man your whole account is Luka hate. I hope you get the help you need brother",
    "424": "@dallasmavs Sorry you lost",
    "425": "James Harden Highlights | 23 Points vs. Dallas Mavericks https://t.co/hJ3oON9WiO @YouTube",
    "426": "Kevin Durant Highlights | 24 Points vs. Dallas Mavericks https://t.co/vna1rq6rhd @YouTube",
    "427": "@dallasmavs @Chime Canceling this fucking annual team pass i can’t stand paying money for a 9th seed play in tournament worthy team that has an owner that cares more about his NFTs then getting his team past the 1st round",
    "428": "Brooklyn Nets Highlights vs. Dallas Mavericks | 12/7/21 https://t.co/G4cLrFGR7u @YouTube",
    "429": "Brooklyn Nets vs Dallas Mavericks Full Game Highlights | Dec 7, 2021 | F... https://t.co/56GAP9Yr9U @YouTube",
    "430": "@BrooklynNets  WIN -  Nets vs Dallas Mavericks - Full Game Highlights | December 7, 2... https://t.co/RdvrfW5uPy via @YouTube",
    "431": "Brooklyn Nets vs Dallas Mavericks - Full Game Highlights | December 7, 2... https://t.co/8RSZ7ZCh16 @YouTube",
    "432": "Dallas Mavericks (11-12, seventh in the Western Conference) vs. Memphis Grizzlies (14-10, fourth in the Western Conference) https://t.co/Ro6kuqw2L4",
    "433": "Brooklyn Nets vs. Dallas Mavericks Full Game Highlights | December 7 | 2... https://t.co/FZWrkflurN @YouTube",
    "434": "Mavericks Luka Doncic Says 'I Know I've Got to Do Better' on Conditioning #sports\n\nDallas Mavericks point guard Luka Doncic acknowledged that he has to get into better shape after his team's 102-99 home loss to the Brooklyn Nets on Tuesday\n\nhttps://t.co/JZya1LLzDG",
    "435": "The Brooklyn Nets overcame a 17-point deficit to beat the Dallas Mavericks 102-99 at American Airlines Center #NBA75 #SSBasketball",
    "436": "@ShamsCharania @bkravitz @TheAthletic @dallasmavs \n\nBring Myles Turner home.",
    "437": "#Grizzlies Memphis Grizzlies VS Dallas Mavericks Match Preview https://t.co/mV09Ei7WRP",
    "438": "NBA Spread Results for 12/7/2021:\n\nDallas Mavericks: LOSE $110\nBoston Celtics: LOSE $110\n\nYesterday Spread: 0-2, -$220\nYTD Spread: 93-87, -$270",
    "439": "@dallasmavs @Chime nice choke 😑, this is depressing at this point",
    "440": "There's a @dallasmavs game today .. Im starting to think if I dont watch the game  maybe it'll help them win.🥺 #mffl 🤞🏾 https://t.co/Jt05fSpEnM",
    "441": "Dallas Mavericks: Luka Doncic makes surprising admission after Mavs loss https://t.co/6w5sT2zcRi",
    "442": "@407matto @icetraelatte @dallasmavs @Chime Luka got the entire Mavs fans base twerkin for him and he’s going to leave in a few years 😂🤣😭",
    "443": "Dallas Mavericks vs. Phoenix Suns Odds, Pick, Prediction 11/19/21 https://t.co/5wPdA6sKOC",
    "444": "@dallasmavs @NBA2K @kporzee @NBA2K y’all telling me he a higher overall than Lonzo",
    "445": "Dallas Mavericks\n\n#NBA #basketball #champion #Passionsports https://t.co/m16IQVPE6P",
    "446": "KD. CASH 💰\n\n@BrooklynNets 102\n@dallasmavs 99\n\nFinal minute on TNT! https://t.co/P3Yrppk5vl #NBA",
    "447": "@dallasmavs @Chime It's time https://t.co/KXhs2ijBH8",
    "448": "Kevin Durant and star James Harden as Brooklyn Nets give Dallas Mavericks a fifth consecutive home defeat |  NBA News https://t.co/YN1uCPBnBY\nSports, Brooklyn, consecutive, Dallas, defeat, Durant, give, Harden, home, James, Kevin, Mavericks, NBA, Nets, News, star",
    "449": "Dallas Mavericks' Luka Doncic admits having issue with weight, conditioning - ESPN https://t.co/m7YPOWJs3J https://t.co/weiEHTrVCM",
    "450": "Dallas Mavericks vs. Memphis Grizzlies - 12/8/2021 Free Pick &amp; NBA Betting Prediction https://t.co/1biGHFum6F\n.\n#Betting #FreePicks https://t.co/hCTmtfeulO",
    "451": "KD. CASH 💰\n\n@BrooklynNets 102\n@dallasmavs 99\n\nFinal minute on TNT! https://t.co/wpLoGjN84H",
    "452": "@dallasmavs gone and get him @Dsabonis11 https://t.co/3niBibWFAI",
    "453": "Cmon @jalenbrunson1 don’t be scared to tell your “team captain” @luka7doncic he was at fault and he should be focused on playing better defense rather than blaming his teammate. BE BETTER! \n#NBAonTNT  #Dallas #Mavs #Brooklyn #Nets #DallasMavericks #BrooklynNets #FYP #foryoupage https://t.co/93ppJ2bIDH",
    "454": "@dallasmavs I love your style....",
    "455": "Dallas Mavericks: NBA Wk8: Nets 102-99 Mavericks https://t.co/kZ7EmIN4Yy",
    "456": "ℕ𝔹𝔸-𝕌𝕡𝕕𝕒𝕥𝕖: 🇺🇸🤝🇩🇪 | 07.12.2021\n\n▶ Dallas Mavericks (11-12) 99:102 Brooklyn Nets\n🧮 Maxi Kleber: 13:36 Minuten, 1 Rebound. \n\nhttps://t.co/uXSz1lCAkK",
    "457": "@AuzyM51 @RubenA82 @dallasmavs @luka7doncic Bullock and Hardaway 0 for 13 from 3 🤦🏾‍♂️🤦🏾‍♂️🤦🏾‍♂️",
    "458": "Notte #NBA @dallasmavs - @BrooklynNets 99-102 (Nets sotto 71-54 al 35esimo, ultimo quarto 13-27) DAL: Finney Smith 15, Porzingis 17 (+12r), Doncic 28, Hardaway Jrr 11. BKN: Durant 24, Aldridge 15, Mills 10, Harden 23 (+12a), Johnson 12\n\n#NBATwitter #NbaTipo #MFFL #NetsWorld #Nets",
    "459": "@wrongpassword23 @dallasmavs @Chime suree.....",
    "460": "@dmn_mavericks @KSherringtonDMN Not winning anything in Dallas - Mavs fans starting to realise it",
    "461": "@dallasmavs @swish41 If the Mavs could shoot like a decent HS team Luka woulda had 20 assists tonight. WTFU Cuban...surround the man with shooters!!! #MFFL",
    "462": "@dallasmavs @swish41 Once a Maverick, always a Maverick 💜",
    "463": "Brooklyn Nets 102-99 Dallas Mavericks https://t.co/zYUG6orMsI",
    "464": "Basket – NBA – Les Brooklyn Nets renversent les Dallas Mavericks, Luka Doncic fait son autocritique https://t.co/B4rU7zBCh8",
    "465": "Ende #Basketball Herren #NBA \n102:99 #BrooklynNets vs DallasMavericks \n121:109 #NewYorkKnicks vs SanAntonioSpurs \n102:117 BostonCeltics vs #LosAngelesLakers",
    "466": "@dallasmavs @luka7doncic Well done!",
    "467": "@RubenA82 @dallasmavs @luka7doncic Cuz no one wants to watch role players miss every single shot",
    "468": "@wviclaunch_bob @ddw58 @dallasmavs @luka7doncic This is the dumbest thing I have ever seen. Leads the league in potential assists and then his guys shoot 5% on wide open shots he creates for them",
    "469": "@dallasmavs @luka7doncic Good thing cuz he has to since your front office won’t put together a real roster",
    "470": "NBA: Kevin Durant, James Harden spark Brooklyn Nets' fightback over Dallas Mavericks – NBA News https://t.co/ifx73ITjVa",
    "471": "Kevin Durant scored 11 of his 24 points in the fourth quarter as the visiting Brooklyn Nets erased a 17-point deficit and earned a 102-99 victory over the slumping Dallas Mavericks on Tuesday night. | @Reuters https://t.co/jWjk7rXf8e",
    "472": "Brooklyn Nets vs Dallas Mavericks Full Game Replay 2021 Dec 07 NBA Replay HD\nhttps://t.co/3vDR16FXxu https://t.co/fcg5yw0sc1",
    "473": "Dallas Mavericks: NBA: Kevin Durant, James Harden spark Brooklyn Nets' fightback over Dallas Mavericks:  https://t.co/dDQJw1QZVW",
    "474": "scores, results, Russell Westbrook, Boston Celtics v LA Lakers, Luka Doncic, Brooklyn Nets v Dallas Mavericks, updates, videos, highlights https://t.co/7faZSi32FU",
    "475": "#SportsNews Luka admits conditioning issue: 'Got to do better': Dallas Mavericks star Luka Doncic acknowledged he needs to improve his conditioning, saying Tuesday that he has \"got to get back on track.\" https://t.co/V7kPfl458x",
    "476": "#RapMagBasket Basket - NBA - Les Brooklyn Nets renversent les Dallas Mavericks, Luka Doncic fait son autocritique https://t.co/2zetOZXeY7",
    "477": "12/7/99 - Playing against a Steve Nash-less Mavericks (he had lost his starting spot prior to an ankle injury), the Vancouver #Grizzlies (4-14; 50-254 all-time) snapped a 30-game losing streak with a 104-95 win at Dallas. @ShareefAbdur_R: 26p/15r/3s. Dickerson: 21p. Dirk: 31p/7r. https://t.co/ftyQ7DYyBW",
    "478": ".@JHarden13 and Kevin @KDTrey5 led a late fightback as the @BrooklynNets overturned a 17-point, third-quarter deficit to edge past the @dallasmavs. #NBA \n\nhttps://t.co/tlJ88i6Obr",
    "479": "Good morning. \n\n⚡🔥 Dallas Mavericks",
    "480": "@Matthiesen_FWTX @dallasmavs @Chime Mavs is not all about Luka. Sure his not a good shooter but even if he is this team still cant win with the core of players around him as shown when Luka misses games.",
    "481": "The Denver Nuggets have agreed on a trade that will send Stephen Curry and Ralph Sampson to the Dallas Mavericks in exchange for Dirk Nowitzki, Donovan Mitchell and Ray Allen, via @CulebroVikingo and PSN: llSZYll .\n\n#99LeagueSeason7 https://t.co/3N8foXFOfs",
    "482": "Luka Ran Out Of Magic! \"Brooklyn Nets vs Dallas Mavericks Highlights\" RE... https://t.co/TCghiaB1kY via @YouTube",
    "483": "James Harden and Kevin Durant (@KDTrey5) led a late fightback as the Brooklyn Nets (@BrooklynNets) overturned a 17-point, third-quarter deficit to edge past the Dallas Mavericks (@dallasmavs) on Tuesday.\n\nREAD MORE: https://t.co/QtpNbBwtOW\n\n#BrooklynNets\n#DailyTribune",
    "484": "James Harden and Kevin Durant (@KDTrey5) led a late fightback as the Brooklyn Nets (@BrooklynNets) overturned a 17-point, third-quarter deficit to edge past the Dallas Mavericks (@dallasmavs) on Tuesday.\n\nREAD MORE: https://t.co/f3chWkpw9z\n\n#BrooklynNets\n#DailyTribune",
    "485": "@affishall @ReggieBullock35 @dallasmavs Coaching isn’t the problem though Chef.",
    "486": "Kevin Durant scored 11 of his 24 points in the fourth quarter as the visiting Brooklyn Nets erased a 17-point deficit and earned a 102-99 victory over the slumping Dallas Mavericks on Tuesday night. https://t.co/XLzs9tDNzB",
    "487": "The Mavericks continues to struggle. They are 2-8 in their last 10 games and are under .500 (11-12) for the first time since they were 0-1 to start the season. Dallas hits the road for a 3-game road trip to Memphis, Indiana and Oklahoma City.\n\n@austyniven \n@_BOneal https://t.co/EJpPBmAFoz",
    "488": "I just asked the same question.. I was there 2nite too!! @aakam27 @dallasmavs",
    "489": "@dallasmavs please https://t.co/RbbhtF6O7l",
    "490": "I was at the game 2nite... How do I claim my free sammich from @Chick-fil-A??  @dallasmavs",
    "491": "@dallasmavs I love that man damb 👊🏻👊🏻",
    "492": "@BrooklynNets took down @dallasmavs while @Lakers  were too good for @celtics. #NBA #basketball https://t.co/8jzijC8yzS",
    "493": "Luka is the BEST Dallas Mavericks 🏀 player!! #bestplayer #number1player #mavericks #mavs #dallastx",
    "494": "Dallas Mavericks: Dallas Mavericks: ' Luka Doncic admits having issue with weight, conditioning https://t.co/RmSi0EZaB1",
    "495": "@dallasmavs @SteveNash @RealJasonKidd Did you say…. the MAVS???",
    "496": "@dallasmavs @SteveNash @RealJasonKidd Suns*",
    "497": "New video check in\n\nThe Dallas Mavericks Are So Frustrating https://t.co/pDrmoqCkZD",
    "498": "@dallasmavs @SteveNash @RealJasonKidd Take your kid to work day at the Mavericks facilities",
    "499": "@dallasmavs @Chime Only 15 fouls in whole game by Dallas.",
    "500": "Rough night for the @dallasmavs #MFFL https://t.co/nRpZWQyJbr",
    "501": "Hot Topics: Dallas Mavericks https://t.co/P8OTwtT0bu",
    "502": "@dallasmavs @Chime Washed team",
    "503": "NBA\n\nFT.\n\nDallas Mavericks 99 - 102 Brooklyn Nets\n\nSan Antonio Spurs 109 - 121 New York Knicks\n#TheGamePlan",
    "504": "Dallas Mavericks' Luka Doncic admits having issue with weight, conditioning – NBA News https://t.co/bqYsHrLtkr",
    "505": "@dallasmavs @Chime You just lost to James Honeybun fear the beard Harden💀💀 https://t.co/Y2mUnF1DFH",
    "506": "Basket - NBA - Les Brooklyn Nets renversent les Dallas Mavericks, Luka Doncic fait son autocritique https://t.co/vs27ZpXPpE https://t.co/cLoe6LjyTu",
    "507": "@XeinWins @dallasmavs @swish41 You don’t even f-ing read! What damn book you know?",
    "508": "🔥🚀 Fantasy TOP 10 (9cat H2H) Dec07 🚀🔥\n\n🏀🏀 Kristaps Porzingis 🏀🏀\n\nRANK: #10\ndx score: 305\n\n6-17 FG\n4-4 FT 🔥\n1 THREE\n12 REB 🔥\n5 AST\n1 STL\n1 BLK\n2 TO\n17 PTS\n\n@DallasMavs #Mavericks\n\nhttps://t.co/S6kYKrW1ZS",
    "509": "🔥🚀 Fantasy TOP 10 (9cat H2H) Dec07 🚀🔥\n\n🏀🏀 Luka Doncic 🏀🏀\n\nRANK: #6\ndx score: 348\n\n9-21 FG\n7-8 FT 🔥\n3 THREE\n6 REB\n9 AST 🔥\n0 STL\n0 BLK\n1 TO\n28 PTS 🔥\n\n@DallasMavs #Mavericks\n@luka7doncic\n\nhttps://t.co/YhdJa6ORbn",
    "510": "#RecentSportNews #hotsports #latesports #sportblog #sportlisting Luka admits conditioning issue: ‘Got to do better’: Dallas Mavericks star Luka Doncic acknowledged he needs to improve his conditioning, saying Tuesday that he has “got to get back on… https://t.co/HXHbDaS5QB",
    "511": "Dallas Mavericks 99 (Kristaps Porzingis 17 pts, 12 rebs) Brooklyn Nets 102 (James Harden 23 pts, 12 asists), San Antonio Spurs 109 (Derrick White 26 pts) New York Knicks 121 (RJ Barrett 32 pts)",
    "512": "Kevin Durant scored 11 of his 24 points in the fourth quarter as the visiting Brooklyn Nets erased a 17-point deficit and earned a 102-99 victory over the slumping Dallas Mavericks. #NBA75 https://t.co/Mf7uREa5p0",
    "513": "Could’ve went to school in Dallas and played for the Mavericks. https://t.co/HvBktCQH4c",
    "514": "@mavsncowboys @dallasmavs @Chime He’s making a trade right now. - At least I hope.",
    "515": "@dallasmavs @mcuban Let’s make some moves. I’d take any of these 3 in a heartbeat https://t.co/pi8IVViBrG",
    "516": "@NBA @BrooklynNets @dallasmavs @celtics @Lakers Ahem",
    "517": "Trending on Google:  Dallas Mavericks https://t.co/tFod7uIY0X",
    "518": "@RobloxJeffSteel @dallasmavs @Chime ugly Harden is only better than yr mom",
    "519": "@dallasmavs where my chick-fil-a at??  Anybody that was at the game tap in!!!! #Mavs",
    "520": "Dallas Mavericks: Stats rundown: 4 numbers to know from the Mavericks heartbreaking loss to the Nets https://t.co/Wpdj8dyHAZ",
    "521": "Nets Rally From 17 Down In 3rd Quarter To Beat Mavericks (Cbslocal)\n\nDALLAS (CBSNewYork/AP) - Kevin Durant scored 24 points, James Harden had 23 points and 12 as...\n\nAdd your highlights:\nhttps://t.co/4i8uDLw7DJ\n #Brooklyn_Nets",
    "522": "Kevin Durant took charge for Brooklyn as they overcome a 17-point deficit to beat the Dallas Mavericks, 102-99. \n\n📷 Brooklyn Nets \n\n#NBA75 #AlwaysAFan https://t.co/fipCnT4IO2",
    "523": "@dallasmavs @Chime Mavs winning most of the game, until...",
    "524": "@andyserling @NBAonTNT @dallasmavs Football reporters. And im not suggesting they do gamble. I guess I could research Europe where sports wagering has a much longer history. Its just interesting with all these leagues/broadcasters full-on embracing wagering after so many years of publicly shunning it",
    "525": "@thedirtiestdeez @NBAonTNT @dallasmavs I don’t know who they are. I don’t bet Sports",
    "526": "@andyserling @NBAonTNT @dallasmavs What would be interesting to me is if an Adam Schefter or Jay Glazer are/were wagering, what their records were. Would it be inline with; or better/worse than the general public?",
    "527": "Yeaaaaa 💙💙💙Get a summary of the Brooklyn Nets vs. Dallas Mavericks basketball game https://t.co/cWJQqizmTS\nvia @ESPN App https://t.co/X7W6eTGeuG",
    "528": "Brooklyn Nets traps Dallas Mavericks 102-99 Kevin Durant 24points 7rebounds 3assists.",
    "529": "@WordCertified @dallasmavs @BrooklynNets Brooklyn just got a lucky bounce",
    "530": "@dcwriter360 @dallasmavs Luka is not 7’4. The Unicorn is.",
    "531": "James Harden and the Brooklyn Nets were in danger of back-to-back losses for the first time this season, trailing Luka Doncic and the Dallas Mavericks by 17 points in the third quarter after blowing a double-digit lead against Chicago. https://t.co/xkcWwHNEJA",
    "532": "@dcwriter360 @dallasmavs No one wants to blame the 7’4 guy who is scared of the rim.",
    "533": "Everything about the Dallas Mavericks pisses me off. We have a generational talent and literally can not put a formidable roster around him, yet are go to talking point is said generational talent’s weight. Put a damn team around the man. That’s what we need. https://t.co/5D1rjTsiOF",
    "534": "Don't look now, but the @dallasmavs have 8 out of 23 games where they haven't made it to 100 points. 2 of those 8 the Mavs didn't even hit 90 points. This is just a couple of seasons removed from breaking the then NBA record for offense.",
    "535": "@WordCertified @dallasmavs @BrooklynNets @Bucks coming there in January",
    "536": "@dcwriter360 @dallasmavs @BrooklynNets Shame on ‘em.",
    "537": "@dallasmavs @swish41 My favorite player of all time my goat for sure",
    "538": "@dallasmavs @Chime seeing all these spammed \"i'm a long time...blah blah\" makes me wanna say i'll be a dallas mavericks fan for life and a will always be a Luka fanboy 🙂",
    "539": "@null Luka admits conditioning issue: 'Got to do better' Dallas Mavericks star Luka Do  https://t.co/qsUpGhNdyq",
    "540": "@null Luka admits conditioning issue: 'Got to do better' Dallas Mavericks star Luka Do  https://t.co/enBL89mwMB",
    "541": "@mostlypointing @dallasmavs I guess she should just join a convent and leave our secular world…right?",
    "542": "you feel me @dallasmavs? #mffl https://t.co/ZO8ov3gG2r",
    "543": "@RuthlessEchoz @mr_polymath @NBA @dallasmavs But will we make playoffs at this rate",
    "544": "@mr_polymath @RuthlessEchoz @NBA @dallasmavs Bro ngl i said same thing but i hope im wrong and i hope he takes his health more serious hes a big guy but i think ppl overreacting a little bit he does need to get a trainer and put some more muscle on",
    "545": "@dallasmavs Pretty sure that’s the only basket he made all night!",
    "546": "@SportsSturm The @dallasmavs need a major shake-up of sorts. This team does not have the right players in the correct pecking order. After Doncic we need a solid number 2. KP is a number 3. Major trade is needed for this to make any impact, or risk losing Luka in coming years. \n#MFFL",
    "547": "@wviclaunch_bob @ddw58 @dallasmavs @luka7doncic True insight. What,  me play transition D? And please get out of the lane (you belong out on the perimeter) so I can get my 12 second quota of dribbling.",
    "548": "@thedirtiestdeez @NBAonTNT @dallasmavs Horse racing is a gambling game. While sports betting is getting more and more prevalent, it's not theoretically conducted for gambling. I would like to think the people on the sports betting shows are backing up their opinions, but not hosts and announcers on broadcasts.",
    "549": "@Mavs_Win @dallasmavs @Chime Very bad",
    "550": "@andyserling @NBAonTNT @dallasmavs I agree, Im wondering with the growing prevelance of sports betting   should announcers disclose they took a side? Its something I think horse racing does well and would like to see in other sports. If Joe Buck takes a position in a game, should that be disclosed?",
    "551": "@dallasmavs @Chime I am literally disgusted at how we are playing like I’m at the point where I even look forward to games anymore, I go to bed angry, I just don’t even like y’all anymore this stinks this teams playing stinks our roster stinks, our coach stinks our owner stinks..this is miserable",
    "552": "THREAD: RESULTADOS 7/12\n\nEncerrado:\n\nDallas Mavericks (11-12) 99 x 102 (17-7) Brooklyn Nets\n\nBKN 📊\nKevin Durant: 24PTS/7REB/3AST/1STL/1BLK\nJames Harden: 23PTS/9REB/12AST/1BLK\n\nDAL 📊\nLuka Doncic: 28PTS/6REB/9AST\nKristaps Porzingis: 17PTS/12REB/5AST/1STL/1BLK\n\n#NBAnoSporTV https://t.co/MUeJYO1GTt",
    "553": "@dallasmavs @Chime who has the connect fork into wall pic with the mavs hat",
    "554": "The Brooklyn Nets stay number 1 in the Eastern conference with this big win against the Dallas Mavericks! #NBA75\n\nMissed this game? Watch it on demand with PLDT Home’s NBA League pass. Visit https://t.co/g8UgOqr8jE and subscribe today! #PLDTHomeNBA75 https://t.co/79rbiaJZCh",
    "555": "The #DallasMavericks lost a close one to the #BrooklynNets tonight, 102-99. Check out our pics from the game: https://t.co/3uBjKlSSWt #NBA #MFFL https://t.co/sUdK9Ms07P",
    "556": "@TylerJHorn_ @dallasmavs Harden&gt;Doncic, bitch",
    "557": "Here's what the Mavericks had to say about the Nets' rally for a 102-99 victory Tuesday night, the fifth consecutive loss Dallas has had at home.\n https://t.co/a8ui5CFrnh",
    "558": "@dallasmavs gotta make a move https://t.co/RgLvZ8ru2Y",
    "559": "@thedirtiestdeez @NBAonTNT @dallasmavs I bet my picks. Why can't they bet their opinions? I think it gives credibility. In fact, I think it's a problem in racing that some analysts aren't willing to back up their opinions. You don't have to bet a fortune, but enough to feel some pain when you're wrong.",
    "560": "@ChrisAnstey13 @dallasmavs @BrooklynNets @NBA Kidd had a very consistent career, but Nash hit far greater heights for me",
    "561": "Nets beat Mavericks 102-99 behind Aldridge, Durant, Harden! #NBA #NBA75 #BrooklynNets #DallasMavericks  @BrooklynNets @dallasmavs @WFAN660 @NBAonTNT @NBA",
    "562": "@dallasmavs @Chime Luka is a ball dominant player. Luka also is a turn style on defense. He made so many errors on defense and to have the audacity to blame others on help defense is beyond me.  Why is Frank Ntilikina playing 11 mins? You need him to finish games with KP and Luka.",
    "563": "@dallasmavs @Chime Lol absolutely a joke shooting 9-44 and we were up 17",
    "564": "oh @luka7doncic &amp; @dallasmavs got tuned into a pack eh? you don’t say? 💨 💨💨💨💨💨💨💨",
    "565": "James Harden shines as Brooklyn Nets top Dallas Mavericks, 102-99!\n\nJames Harden : 23 PTS, 9 REB, 12 AST\nKevin Durant: 24 PTS, 7 REB, 3 AST\n\n#jamesharden #brooklynnets #nba https://t.co/hnJnFJA2fo",
    "566": "The Dallas Mavericks shot 19% from 3PT range tonight. Just let that sink in",
    "567": "@NBA @dallasmavs oh my goood",
    "568": "DIRK. This man is the reason the Dallas Mavericks are relevant. He is the greatest shooting big man of all time and even though he had a finals stolen from him, he never gave up and brought one back to Dallas a few years later in what maybe be the biggest upset in recent history https://t.co/wTOwa7LZ8q",
    "569": "3 things we learned from the Dallas Mavericks loss to the Brooklyn Nets 102-99 – NBA News https://t.co/S7KBAdJ4Rs",
    "570": "🚨FINAL🚨\n\nNets defeat the Dallas Mavericks by 1⃣0⃣2⃣ points to 9⃣9⃣\n\n#NetsWorld https://t.co/uAiGfN4MiN",
    "571": "The Dallas Mavericks are a very pedestrian basketball team. #MFFL",
    "572": "@TheBigShotPod @Mavs_Win @dallasmavs @Chime @mcuban Kleber has played better this yr but he goes 0-6 tonight.. if this team hits shot no doubt in my mind they can make a playoff push off shotmaking alone that 4th qtr was so pathetic even tho james harden got away with a blatant foul also the kleber and1 play just smfh",
    "573": "@mike_jonker @dallasmavs @NBA That's what I've been saying; tank and suffer now for a brighter future. We would just had to hit on the draft pick and not whiff like we did with Green over Bane...",
    "574": "Kevin Durant Highlights | 24 Points Vs. Dallas Mavericks - Oakland News Now https://t.co/MTy0vCE3WC",
    "575": "@ChewieWoolf @girldadNFT @FtsySharksDFS @TopShotGiftGoat @BrooklynNets @dallasmavs @TopShotDadMoves @TheOfficialHDA Alright, @TopShotGiftGoat, we might be addicted to these scavenger hunts.\n\nWhere we going next? NYE in Times Square?! 😂",
    "576": "@TheBigShotPod @Mavs_Win @dallasmavs @Chime @mcuban yes he may leave if he does its on cuban..as much as i like jbrunson the only safe player should be Luka but the only reason i say brunson because he is probably the only one outside of luka who has trade value i honestly dont think u get fair value with trading kp bcus injuries",
    "577": "@dallasmavs @Chime DISAPPOINTED!!!\nDO U HAVE ANY RESPECT FOR YOURSELVES OR THE NAME MAVERICKS? 17 POINT LEAD BLOWN...AS A LUKA AND MAVERICKS FAN;IM M_ BARRASSED!!!",
    "578": "@SportsSturm I keep telling people that the @dallasmavs suck as does @NBA",
    "579": "@etchedNFT @girldadNFT @FtsySharksDFS @TopShotGiftGoat @BrooklynNets @dallasmavs @TopShotDadMoves @TheOfficialHDA notice they switched seats too",
    "580": "@ChewieWoolf @girldadNFT @FtsySharksDFS @TopShotGiftGoat @BrooklynNets @dallasmavs @TopShotDadMoves @TheOfficialHDA Legitimately so impressed with all of this 🔬🕵️",
    "581": "@dallasmavs can yall please go get Myles Turner or levert.. I'm tired of watching my boy luka being forced to be ineffective",
    "582": "@adsrul @dallasmavs @Chime Why does Doncic always get a pass when he shoots poorer than those garbage players?",
    "583": "@jhiller89 @dallasmavs @Chime It truly pains me that I wanted every single draft pick they chose this year, and that the Mavs had zero picks to get any of them",
    "584": "@dallasmavs You're doing nothing trade that kid to Knicks you mfs. He'll become the best player in the league in here",
    "585": "@adsrul @dallasmavs @Chime Garbage, 6 shoot 3s better than Doncic.",
    "586": "@Matthiesen_FWTX @dallasmavs @Chime He has to because when his teammates are garbage.Remove Luka and this team is worse than OKC",
    "587": "@LukaDirkic @dallasmavs @Chime this the entire comment section ahahahah",
    "588": "3 things we learned from the Dallas Mavericks loss to the Brooklyn Nets 102-99 by @benzajdel https://t.co/1ZJe6NZvK5 https://t.co/3yujS8NmZ6",
    "589": "@andyserling @NBAonTNT @dallasmavs I think you may have an interesting point of view on this. With the expansion of sports gambling across the country, is their an ethical obligation for broadcasters/analysts to disclose their wagers? Their opinions may influence lines or they may have inside info",
    "590": "@dallasmavs @Chime Get Luka some help Lads",
    "591": "\"Do better\" is starting to ring hollow. I blame you, @dallasmavs social media folks https://t.co/W4k9bPKdjS",
    "592": "@dallasmavs @Chime We need Josh or Dennis BACK 😩",
    "593": "If @dallasmavs loose next game..@mcuban owe me an nft. DEAL!? #MFFL #NFT #nftcollector",
    "594": "Straight from the @dallasmavs  game (KD is a cheat code) to BIG BUSINESS TALKS!! FLIGHT MERCH COMING SOON!! 🗣🗣 \n\nGod is GREAT!! 🙏🙏🙏",
    "595": "jamahl mosley should've been the head coach of the dallas mavericks.",
    "596": "Seth would of made that shot... @dallasmavs let's find a way to reverse that trade... \n\nSincerely,\n#MFFL",
    "597": "@donhaloacts @dallasmavs @Chime LMAOOO",
    "598": "@dallasmavs @Chime Keep Luka, everyone else is expendable including Kidd… get him some help! https://t.co/jUJWJ2hneQ",
    "599": "@dallasmavs @Chime 13 Points Only in 4Qtr Shame on u ALL on this Lose.",
    "600": "Brooklyn Nets @ Dallas Mavericks Four Factors (12/07/2021) \n\nVia Cleaning the Glass https://t.co/lq1eopju1A",
    "601": "🏆 Winning day for NBA Tips with the @BrooklynNets storming home to cover the line Vs @dallasmavs 🏀\n\nDay: +0.9u | Overall: +24.7u\n\nJoin here: https://t.co/YmGeZNkpKm",
    "602": "Nets rally late to pull out tight win over Mavericks (New York Post)\n\nDALLAS - The Nets looked dead and buried, taken out by a great Luka Doncic performance.Until...\n\nAdd your highlights:\nhttps://t.co/ky56YU60IM\n #Brooklyn_Nets",
    "603": "@donhaloacts @dallasmavs @Chime They literally went 9-46 from 3 bro no joke lol. They shot 19% as a team 😭",
    "604": "@dallasmavs really lost by 3 🤦🏽‍♂️",
    "605": "@umadinac6 @dallasmavs @Chime @3pts It’s actually impressive to shoot that poorly at this level.",
    "606": "@theenatet @GDB_LPN @oscaaargalla @rubenfaz214 @dallasmavs @Chime I'll do you one better: if the Mavs shot 100% they would have won convincingly.",
    "607": "@mavsncowboys @Starr_Rx @dallasmavs @Chime It goes back to coaching should thj really be starting with luka luke he fid for a few games i think that can mess up your flow when u dont know when the ball is coming ur way",
    "608": "@rubenfaz214 @mccoyeryan @dallasmavs @Chime Did he win a championship for that? Nope. The Mavs did when they beat him (when he was a higher seed, no less).",
    "609": "I can't believe the Dallas Mavericks shot 9-46 (19.6%) from 3 tonight",
    "610": "@dallasmavs @Chime It’s basketball and we can’t shoot the ball 🤷‍♂️",
    "611": "✨Kevin Durant scored 24 points, James Harden had 23 points and 12 assists, and the Brooklyn Nets beat Dallas 102-99 on Tuesday night, handing the Mavericks their fifth consecutive home loss.\n👉https://t.co/rfhe3bJofU\n\n#NBA #basketball",
    "612": "@mavsncowboys @Starr_Rx @dallasmavs @Chime True",
    "613": "@keeplt1hunnid @Starr_Rx @dallasmavs @Chime he also said we got \"significantly better\" this off-season which is a complete lie. All we did was resign Hardaway and get Bullock who have both been terrible",
    "614": "@mavsncowboys @Starr_Rx @dallasmavs @Chime Big who mans the paint and get a decent guard back who may not be as good as brunson but is good enough i would do it and im a guy who says brunson is arguably our 2nd best most consistent player.",
    "615": "“I’m into having shit turning dreams to average shit/Bringing your trophy to the club Dallas Mavericks shit”\n\n@myfabolouslife 🎧🎧🎧🎧",
    "616": "@adsrul @dallasmavs @Chime Luka not paid to be a shooter. LOL. Takes over 30% of Mavs shots every game.",
    "617": "@keeplt1hunnid @Mavs_Win @dallasmavs @Chime @mcuban Hes missed 16 of 23. But he’s missed games ever since he came to Dallas. And he’s on track for playing more games this season than last…",
    "618": "@mavsncowboys @Starr_Rx @dallasmavs @Chime This is true but i honestly believe mark is trying but it works both ways teams have to want to trade with you and players have to want to come here in free agency.. my thing is whats holding it back bcus as much as i like brunson if we can get a rebounding shot blocking",
    "619": "@dallasmavs ….NEEDS HELP",
    "620": "@Starr_Rx @keeplt1hunnid @dallasmavs @Chime 100% same, I miss Seth more and more each day now lol",
    "621": "@dallasmavs @Chime Hey almost!  Let’s get ready for another almost!",
    "622": "@Muzixndmd @AfterDarkMarcel @BrooklynNets @dallasmavs @ml_buckley @RawUncutSports @GinoShapiro @CMMortlock LETS GOOO NETS!!!",
    "623": "Kevin Durant Highlights | 24 Points vs. Dallas Mavericks https://t.co/auC7dfWSBp via @YouTube",
    "624": "@NBAKrell Too bad the Dallas Mavericks don't have anything worth the 76ers time.  If we traded Ben for Tim Hardaway Jr, Morey rightly wouldn't hear the end of it.",
    "625": "@TheBigShotPod @Mavs_Win @dallasmavs @Chime @mcuban Exactly how many has kp missed?",
    "626": "Nets rally from 17 down to hand Mavericks fifth straight home loss https://t.co/lwCFdhFWGh #NBA #Brooklyn #Dallas",
    "627": "@mavsncowboys @keeplt1hunnid @dallasmavs @Chime I was so hype for Bullock instead of Richardson this year and maybe boban but yet Powell plays every minute but yet I can literally see the smile on Lukas face when Bobi plays. I just don't even know anymore with this front office.",
    "628": "@dallasmavs Is fat",
    "629": "@Matthiesen_FWTX @dallasmavs @Chime Well Luka is not paid to be a shooter😂 but when the shooters they paid are on close competition to Luka on terms of 3 point percentage then this team is heading into the abyss",
    "630": "James Harden Highlights | 23 Points vs. Dallas Mavericks https://t.co/udNtQEC2Hg via @YouTube",
    "631": "@dallasmavs @Chime Just terrible.",
    "632": "I DON'T THINK I CAN SUMMARIZE THIS DALLAS MAVERICKS SEASON BETTER THAN WHAT WE JUST SAW TONIGHT \n\nFUUUUUUCK\n\nLET'S (OVER)REACT - https://t.co/A9QjwNSu8j https://t.co/ti5HZfTFTB",
    "633": "Nets comeback down 17 to beat the Dallas Mavericks 🚨https://t.co/Ltx9JWzU2b",
    "634": "Do the #dallasmavericks have a nutritionist for Luka? Jesus ! Smh",
    "635": "Kevin Durant scored 24 points, James Harden had 23 points and 12 assists, and the Brooklyn Nets beat Dallas 102-99, handing the Mavericks their fifth consecutive home loss.\n\nby @apschuyler https://t.co/xP0mm3CkTM",
    "636": "@keeplt1hunnid @Starr_Rx @dallasmavs @Chime we've *essentially* had the same team for 3 years now while other teams (i.e the Hawks, Bulls, Bucks to name a few) are helping and building around their stars...",
    "637": "Liverpool's 💯 UCL record is balanced by Dallas @dallasmavs loss to take them below .500 win rate. Oh well",
    "638": "@adsrul @dallasmavs @Chime Hardaway 19-20 39.8%, 20/21 39.1%. Only in Doncic's wildest dreams.",
    "639": "@dallasmavs @Chime Where is Cuban ??",
    "640": "Hey @dallasmavs I know a spot where y'all can get a egg cleanse to get any bad negativity out",
    "641": "@dallasmavs @Chime You should've just let Luka go somewhere else Mark Cuban, you're ruining this kid's career.",
    "642": "@dallasmavs @Chime Mavs fans really wanted this to help with the Luka cares only when they play good teams 😂 #shambles #excuses #frauds",
    "643": "@SM1THR0WE @dallasmavs @Chime Also I like the Bull’s jerseys",
    "644": "@girldadNFT @TopShotGiftGoat @BrooklynNets @dallasmavs @TopShotDadMoves @etchedNFT @TheOfficialHDA So i get 15% of an nft for being 7th?!? Haha. https://t.co/1Uo3TFR9uf",
    "645": "@SM1THR0WE @dallasmavs @Chime I find Lonzo, DeMar, and Nikola attractive as well lol",
    "646": "“They pretty much run the same plays.”\n\n⁃Kevin Durant on the Dallas Mavericks.",
    "647": "@manny__xo @dallasmavs I didn't bet the Mavs but good try",
    "648": "@girldadNFT @FtsySharksDFS @TopShotGiftGoat @BrooklynNets @dallasmavs @TopShotDadMoves @etchedNFT @TheOfficialHDA and I am half kidding anyways... 😉❤️",
    "649": "the Dallas Mavericks are embarrassing themselves but at least Cuban is getting called out on national television https://t.co/ltokXFRb5S",
    "650": "Kevin Durant scored 24 points, James Harden had 23 points and 12 assists, and the Nets beat Dallas 102-99 on Tuesday night, handing the Mavericks their fifth consecutive home loss. https://t.co/LOVS7TZzYs #NetsWorld",
    "651": "@Allison_MFFL @dallasmavs @Chime I am inclined to agree w/ Cavs but Zach Lavine is carrying the Bulls in terms of hotness imo 🤔",
    "652": "@dallasmavs @swish41 Big D in the house 🔥",
    "653": "@mavsmarie @dallasmavs @Chime Chill",
    "654": "@Starr_Rx @mavsncowboys @dallasmavs @Chime Ngl i definitely believe we should get better players but.. we focus so much on what these players dont do but dont give them credit for things they do well like powell is a good lob threat and rebound tapper but we can do better",
    "655": "@dallasmavs @Chime Don’t have the pieces to trade for Ben. But that’s who is needed. Defense &amp; playmaking. Need to get Luka off the ball or at least a running mate that handle the ball but scare defenses.",
    "656": "@dallasmavs @Chime Start making these photos NFTS then maybe our owner will understand them",
    "657": "@keeplt1hunnid @Mavs_Win @dallasmavs @Chime @mcuban Luka has missed 4 games…",
    "658": "Brooklyn Nets Highlights vs. Dallas Mavericks | 12/7/21 https://t.co/vJh7QImvsS via @YouTube",
    "659": "James Harden on the comeback @dallasmavs:\n\n“We communicated and got rebounds it’s a make more miss league and we were able to stick with it.” \n\n#Netsworld  #MFFL https://t.co/8EDfO0eaSd",
    "660": "@dallasmavs @luka7doncic Why the seats are empty?",
    "661": "Pretty much done with the Dallas Mavericks this season. Officially checked out.",
    "662": "Kevin Durant got a basket that killed the Dallas Mavericks https://t.co/cATkZ7rTbo",
    "663": "can he make a trade for the dallas mavericks…please https://t.co/EtEPQDG7Zq",
    "664": "@MavsNetwork @dallasmavs @Chime come join me in Denver? https://t.co/3Bwiq1fumG",
    "665": "@1053SS @rjchoppy @MikeBacsik @dallasmavs should have won. Their shot selection in the 4th was horrible. They got complacent with the 3 ball. Didn’t use the clock either when they had the lead. The lead was lost with 2 mins left. Patheticulious! 🤦🏼‍♂️",
    "666": "Dallas Mavericks vs Brooklyn Nets was on TNT (usa). Co-commentator is Reggie Miller. Reporter is Stephanie Ready.  For more details see https://t.co/HsHI9I3527 #DallasMavericks #BrooklynNets #TNTusa",
    "667": "@MrHarryBoughner @dallasmavs @luka7doncic blown lead man at least i got to watch it in person",
    "668": "@TheBigShotPod @Mavs_Win @dallasmavs @Chime @mcuban Well luka has missed and kp has missed some so???",
    "669": "4th Quarter\n\nBrooklyn Nets: 27\nDallas Mavericks: 13",
    "670": "@dallasmavs my boys, let’s be better.  We can be better.  We can always be better. \n\n-Young Weather Learner",
    "671": "The Dallas Mavericks only had 4 turnovers tonight",
    "672": "@icetraelatte @dallasmavs @Chime Luka lives rent free in Hawks fan heads",
    "673": "@JJ_Burr5 @dallasmavs Dwight Powell is also not a starting center and gets destroyed every time they play a decent center.",
    "674": "Watching the Dallas Mavericks https://t.co/dcyJncXGoE",
    "675": "@FtsySharksDFS @girldadNFT @TopShotGiftGoat @BrooklynNets @dallasmavs @TopShotDadMoves @etchedNFT @TheOfficialHDA hmmm controversy.... now you RT'd but at the time I posted you had not yet done so. So who wins? you for being first or me for doing both requirements 1st?",
    "676": "@SM1THR0WE @dallasmavs @Chime The Bulls. The Hornets and Cavs are honorable mentions!",
    "677": "@dallasmavs @Chime Fuck you 👍",
    "678": "@adsrul @dallasmavs @Chime Hardaway consistently throughout his career a better 3pt shooter than Doncic.",
    "679": "BARNES, DRAGIC, THEIS IS ALL I WANT FOR XMAS @mcuban @dallasmavs",
    "680": "@girldadNFT @TopShotGiftGoat @BrooklynNets @dallasmavs @TopShotDadMoves @etchedNFT @TheOfficialHDA * wasn't",
    "681": "@Joaquin21981246 @dallasmavs @Chime My girlfriend said “his hair looks bad”",
    "682": "@realonlinejack @styleemusic @gstevens0 @dallasmavs @Chime Hahahaha",
    "683": "@girldadNFT @TopShotGiftGoat @BrooklynNets @dallasmavs @TopShotDadMoves @etchedNFT @TheOfficialHDA * wasn't",
    "684": "@BullsFan2021_ @NBA @dallasmavs What?!?!?!",
    "685": "@dallasmavs @swish41 The only thing we'll ever celebrate because Luka is not staying with this organization.",
    "686": "@dallasmavs @Chime Why doesn’t Luka take this shot?!? https://t.co/hjqppC7pev",
    "687": "@dallasmavs  you hurt so much in the chest.... https://t.co/IdlLn1pbqX",
    "688": "The Dallas Mavericks are going to lose Luka Doncic and I might sports cry. Sell the damn team @mcuban",
    "689": "@Allison_MFFL @dallasmavs @Chime LOOOOOL the ending... out of curiosity which is the hottest team in the league 🤔",
    "690": "@bossmanfat4 @dallasmavs @luka7doncic Lost by a bucket, you totally called it bubba.",
    "691": "@luka7doncic @mcuban @dallasmavs @nba the Mavericks are a rudderless org. No sign of a heart, doesn’t give a F, no pulse. This group of cowards can’t do it. Mark Cuban, this on you big boy.",
    "692": "@dallasmavs soooooo yall don't wanna win or what? Because.... 😬😵‍💫🥴",
    "693": "Congratulations  to The Brooklyn Nets on the win against the Dallas maverick",
    "694": "@Footballtakeoff @dallasmavs @Chime 1 assist? Respect the goat",
    "695": "@dallasmavs @Chime Pain",
    "696": "@dallasmavs @Chime Cuban should step aside if all he can do is resign a guy like Hardaway and sign Bullock",
    "697": "@dallasmavs @Chime it was your game to lose and that's what you did once again.",
    "698": "@dallasmavs @swish41 And we embarrassed him. Nice.",
    "699": "@dallasmavs @Chime DeBallZaVic owns both these franchises 😎",
    "700": "Dallas Mavericks: Nets beat Mavs 102-99, hand Dallas 5th consecutive home loss https://t.co/jGMFXWl4qS",
    "701": "@andyserling @NBAonTNT @dallasmavs Up 17 points in the 3Q and still lose at +1.5\nThat's a brutal beat for anyone who played the Mavs.",
    "702": "@dallasmavs @luka7doncic PRe season  roster was better",
    "703": "@squish41 @slingy24 @dallasmavs @Chime Mood https://t.co/1mo4V8L77o",
    "704": "@redditmavericks @dallasmavs @Chime Imagine the admin of Chime getting al this notifications tomorrow.",
    "705": "@dallasmavs @Chime Trade every dam body including luka and get some people in the front office that knows what to do to build a team!!!",
    "706": "@nxckcheek @dallasmavs @Chime @mcuban Not even OKC would take him",
    "707": "@dallasmavs @Chime Fuck so hard to be a fan of this team sometimes. Cuban pls do something. Jesus.",
    "708": "Y'all disgust me @dallasmavs https://t.co/Bge6EP5Cud",
    "709": "@dallasmavs I guess they took their foot off the gas! 😧",
    "710": "@dallasmavs @Mark_Gorski @swish41 Might have to suit him back up @Mark_Gorski 🤷🏻‍♂️😂 Prob still got it",
    "711": "@dallasmavs @Chime Luka played a good game",
    "712": "Gross @dallasmavs",
    "713": "@dallasmavs gotta be better",
    "714": "@jm_henao96 @redditmavericks @dallasmavs @Chime No they will just tell you how you are wrong and when the mavs win 1 game blast your ass into the sun.",
    "715": "@ddw58 @dallasmavs @luka7doncic Lukas the problem no other star wants to come here and deal with him trade him for two youngsters and rebuild let him bring down another team he’s a cry baby no defense nor gets anybody else in rythem",
    "716": "I think this game encapsulates life as a Dallas Mavericks fan. #MFFL https://t.co/2xEk2E9lnu",
    "717": "@dallasmavs @Chime So saaaaddddddddd😭😭😭",
    "718": "teaching the @dallasmavs how to take a shot https://t.co/OlUhsNiuU7",
    "719": "@_____Jab______ @dallasmavs @Chime The plan is to build a wall..a very tall wall",
    "720": "Me after this @dallasmavs game #mffl https://t.co/cRI8SIRgSC",
    "721": "@dallasmavs @Chime Shots @3pts\n\nDoncic 3/11\nPorzingis 1/5\nBrunson 1/3\nHardaway 0/7\nBullock 0/6\nNtilikina 0/3\nKleber 0/2\n\nTOTAL 5/37 !\n\nWTF",
    "722": "Russel “Dallas Mavericks” Westbrook with two straight wide open bricks",
    "723": "@ninjaturntle406 @dallasmavs @Chime And then KD cooked y’all in 2012 and 2016",
    "724": "@dillon_seaton @dallasmavs Brunson is about the only one that’ll take it to the rack. Hardaway will go 0-6 and think he’s hot, Luka disappears in the 4th quarter. Then you got 7’3 KP that’s wants to be a guard.",
    "725": "@dallasmavs Must have only put 3$ in the tank🤬",
    "726": "I’m starting to lose hope on the @dallasmavs . They can’t form a good team",
    "727": "@richierich_9 @dallasmavs @Chime This isn’t 2011. It’s 2012 when KD swept y’all",
    "728": "@jm_henao96 @redditmavericks @dallasmavs @Chime Good. The content sucks anyway lol",
    "729": "@dallasmavs @Chime I haven’t done it \n\nYet",
    "730": "@YoungWood609 @dallasmavs @Chime Nice to see someone without 'get Doncic help'?",
    "731": "@dallasmavs @Chime Trade every1 to indiana for levert/sabonis and turner",
    "732": "@TheAverageBrian @dallasmavs @Chime Bro just root for the hottest team in the league.  #Rockets",
    "733": "@squish41 @dallasmavs @Chime My heart is hurting I'm with you!",
    "734": "Tough loss definitely need some change!!! 😪 @dallasmavs",
    "735": "@Mavs_Win @dallasmavs @Chime Mostly because half our team was out due to COVID. We have zero excuses this season, other than @mcuban sucks as GM/owner",
    "736": "@dallasmavs @DBane0625 Guess Mavs FO heard you the other night!!",
    "737": "@dallasmavs @Chime Im so hurt",
    "738": "@imthe_christian @dallasmavs @Chime Still shooting 3s &gt; Doncic.",
    "739": "@SSburneracctt @dallasmavs Lmao yeah i heard reggie miller say that too",
    "740": "@dallasmavs It all went down hill after this tweet lmao",
    "741": "@squish41 @slingy24 @dallasmavs @Chime I can’t bring myself to do this copy pasta but this one is worthy",
    "742": "@styleemusic @gstevens0 @dallasmavs @Chime Very astute observation",
    "743": "@dallasmavs @Chime Kidd ain’t the answer",
    "744": "@styleemusic @gstevens0 @dallasmavs @Chime you missed the comma again",
    "745": "@dallasmavs @mcuban @RealJasonKidd  shooting coach need to...STEP! Y'all see it. We all do. https://t.co/nhbONiLu3b",
    "746": "@T_HardJR Dallas Mavericks should trade you right away",
    "747": "@redditmavericks @dallasmavs @Chime I think they're going to end up blocking all of us",
    "748": "@T_HardJR Dallas Mavericks should trade you right away",
    "749": "@T_HardJR Dallas Mavericks should trade you right away",
    "750": "@T_HardJR @UMichFootball Dallas Mavericks should trade you right away",
    "751": "@rubenfaz214 @dallasmavs @Chime KD got owned in that pic. Dirk dropped 50 on the Thunder",
    "752": "@dallasmavs @Chime @mcuban please trade reggie i beg you please",
    "753": "@dallasmavs @Chime Luka pls leave this fucking garbage franchise",
    "754": "@realonlinejack @gstevens0 @dallasmavs @Chime I appreciate you Comma police.",
    "755": "@imthatdude69420 @dallasmavs That doesn’t help your argument. My advice is don’t bet on the Mavs for a couple of weeks.",
    "756": "@jtadamsn @dallasmavs @Chime 6 Mavs shooting 3s &gt; Doncic. Trade Doncic?",
    "757": "@alexjuan777 @dallasmavs @doefinney_10 Didnt age well",
    "758": "KD. CASH 💰\n\n@BrooklynNets 102\n@dallasmavs 99\n\nFinal minute on TNT! https://t.co/xhh08wAWd1",
    "759": "@dallasmavs @Chime Admin, the gumbypasta, like Thanos, is inevitable.",
    "760": "@dallasmavs @Chime This is starting to become embarrassing. Luka needs to take accountability. He may haven’t played great tonight but Porzingis is balling  this year.  Tim Hardaway has to elevate his play too. We need changes in front office. Who ever decided to trade Seth curry needs to be gone.",
    "761": "@dallasmavs @Chime Luka gonna leave. Cuban needs to step aside.",
    "762": "Y’all get on my nerves @dallasmavs  🙄",
    "763": "@NBA @BrooklynNets @dallasmavs KEVIN DURANT\n\nTHE GREATEST THERE IS. THE GREATEST THERE WAS. THE GREATEST THERE EVER WILL BE",
    "764": "@dallasmavs @Chime Boo!  A lot of talent on the Nets!",
    "765": "@styleemusic @gstevens0 @dallasmavs @Chime you are a hater of the Oxford comma",
    "766": "@dallasmavs @Chime CUT TIM HARDAWAY CUT TIM HARDAWAY CUT TIM HARDAWAY CUT TIM HARDAWAY.\nI HATE YOU @T_HardJR",
    "767": "@dallasmavs @Chime wow jus wow…Who to blame J.kidd or luka… play kleber down the stretch to defend KD take Brunson out the game..mavs have no identity RN…those couple bad possessions with luka coming down n jaking up 3’s along with the Tech was the turning point…",
    "768": "@mikeyemalone3 See I can’t even talk about it that’s how trash the Dallas Mavericks are",
    "769": "@NBAonTNT @NBA @dallasmavs Mark Cuban watching the final 3 minutes against the Nets tonight!!🏀🏀 https://t.co/27tGWAaN6B",
    "770": "KD went 10-22FG against the mavs  but when I was watching him in LIVE TV I didn’t see him missing one shot. @KDTrey5 @BrooklynNets @dallasmavs #mffl",
    "771": "Go get Goran NOW @dallasmavs",
    "772": "@dallasmavs @Chime Sign the whole Slovenian team &lt;3",
    "773": "I hate to say this but i pretty much like this loss, to let GM see whats matter to thia team - TO MAKE A MOVE, TRADE, BUYOUT, OR ANYTHING. THIS IS THE TIME @dallasmavs rebuild around Luka KP JB DFS and Kleber #MFFL @MavsNationCP @All_Things_Mavs",
    "774": "How have the @dallasmavs become one of the worst offensive teams after  being one of the best offensive teams last year? Two words, Jason Kidd 🤦🏽 @All_Things_Mavs",
    "775": "@dallasmavs @Chime GARBAGE 🗑",
    "776": "@dallasmavs @Chime START BY GETTING RID OF BULLOCK AND THJ!!! 😡",
    "777": "@407matto @dallasmavs @Chime No, I love the mavs",
    "778": "The Dallas Mavericks are currently  11-12 &amp; tied for 8th in the West.",
    "779": "YALL JUST CANT KEEP THE LEAD????? WHY MUST YALL SUCK SO MUCH ASS?????? WHY IS OUR RELATIONSHIP SO TOXIC?????? @dallasmavs https://t.co/VIIqYgWfJQ",
    "780": "@Aleexxx_77 @dallasmavs @Chime Damn. Shocked you made it this long if a regular season chokejob was enough to end your fandom",
    "781": "@wrongpassword23 @dallasmavs @Chime Good notice.",
    "782": "@mavsncowboys @dallasmavs @Chime Dwight Powell and a bag of Fritos for any other center in the league. Also trolling aside I'm just curious who taught him how to volleyball spike every single rebound, watch this team since the early 90s and no one has ever done that so it has to have been somebody who taught him",
    "783": "You want fans and continue to spit in their faces with bad coaching and 💩 players like @ReggieBullock35 @dallasmavs",
    "784": "@dallasmavs @Chime How the f*** we lose?!",
    "785": "@dallasmavs @Chime Garbage team 🗑 led the 1st, 2nd, and 3rd all to choke the 4th like usual. Keep shooting 3’s when you stay bricking, go for fucking lay ups",
    "786": "@dallasmavs Tell Luca and Kidd to hit the road nobody’s coming to Dallas to play with a guy like Luca or a fraud like kidd",
    "787": "The @dallasmavs are really going to fire Kidd before the @vikings fire Zimmer huh?",
    "788": "@dallasmavs @Chime this just sad bro",
    "789": "Just flat out GARBAGE 🗑 @dallasmavs",
    "790": "@KennethS_1028 @dallasmavs @Chime come home",
    "791": "@MrHarryBoughner @dallasmavs @luka7doncic pretty obvious how this game was gonna finish one day you’ll learn",
    "792": "@dallasmavs although playing with lots of energy tonight they struggled to break their 4 game home losing streak only to have the Nets snatch the game away from them 102- 99 during the last two minutes of the game. Damn!",
    "793": "@mccoyeryan @dynamic_voltage @dallasmavs @Chime KD took out Mavs in 2012 and 2016 in the playoffs tho 😎",
    "794": "@YoDaveeexx @dallasmavs @Chime Good game tho. I respect KD",
    "795": "All to save my parlay @dallasmavs you’re doing the lords work https://t.co/3qU8Zdm2Mm",
    "796": "@dallasmavs @Chime Bottled",
    "797": "@__cd5 Sounds a lot like the Dallas Mavericks.",
    "798": "Los Dallas Mavericks hoy tirando desde el triple: \n\nFinney-Smith: 4/9\nPorzingis: 1/5\nDoncic: 3/11\nHardaway: 0/7\nBullock: 0/6\nBrunson: 1/3\nKleber: 0/2\nNtilikina: 0/3\n\nEn equipo: 9/46 (19.6%) #MFFL",
    "799": "@dallasmavs Y’all killing me as a fan right now 🤦🏾‍♂️ https://t.co/WlLcXtd0Ww",
    "800": "@NBA @BrooklynNets @dallasmavs Good choice @Patty_Mills!",
    "801": "@Starr_Rx @dallasmavs @Chime no, he's too busy talking new NFT's or arguing about the vaccine and not changing anything with his team",
    "802": "@dallasmavs @Chime Thanks for the Win 🤣 https://t.co/hYdEYuCQzE",
    "803": "@dallasmavs @Chime SELL THE TEAM @mcuban",
    "804": "Welp get those sponsors in @dallasmavs social media team. I'm a terrible person now because of you",
    "805": "A young fella sitting next to me at the @dallasmavs game asked his date, “So what kind of music do you like?”. Her response? “Do you mean secular music, or praise? I just don’t see the point of singing unless it’s for our Lord.”",
    "806": "@dallasmavs @Chime Bullock = 💩\n@mcuban = 🤡🤡🤡",
    "807": "Hey @dallasmavs can we please get @IsaacLHarris and @NickVanExit at SG and SF next game? They're build different and i trust them to go 1-13 every game!! Right?\nP.s. it would be funny too😂",
    "808": "@dallasmavs @luka7doncic You poor roster changes construction is wasting Luka’s career",
    "809": "@NBA @BrooklynNets @dallasmavs Unstoppable 🤯",
    "810": "@gstevens0 @dallasmavs @Chime This same tweet has been sent out from multiple accounts, we see you haters.",
    "811": "@rubenfaz214 @dynamic_voltage @dallasmavs @Chime The mavs are literally 3-1 in their last 4 against KD and won in the 2011 playoffs. How the hell does KD own the Mavs lol?",
    "812": "@G_Reg3rdLeg @dallasmavs @Chime Ugh so bad and so annoying",
    "813": "@AndresFCBi @dallasmavs @Chime Same 3s 0-6 as Doncic vs Pelicans.",
    "814": "@vibegxd @dallasmavs @Chime Same lmaoo",
    "815": "@dallasmavs 5 game losing streak at the AAC L O L",
    "816": "@dallasmavs @Chime I wasn’t even going to watch this game, but y’all were playing good, up big, just to melt down. I couldn’t say this enough last season and it’s more important now…GET LUKA HELP!!!!!!!!!!!!!!!!!!!!",
    "817": "@Cogno_Scentist @dallasmavs His the king of bricks since he came to Mavs plus he cant defend",
    "818": "How can the @dallasmavs lose like that in front of 👑 @swish41 🤦🏽‍♀️ #mffl",
    "819": "@dallasmavs @Chime Why y’all hurt me like this man",
    "820": "@dallasmavs @Chime I’m going to just start rooting for the rangers at least their trying to build a team",
    "821": "13 fucking points in the 4th from a professional basketball team! Fuck u @dallasmavs",
    "822": "@mcuban @dallasmavs if y’all don’t make trades y’all gonna lose fans deadass..",
    "823": "@dallasmavs find a better roster outside of Luka. @RealJasonKidd stop blaming Luka for this teams inefficiencies.",
    "824": "@dallasmavs @Chime It’s time, You have to make a trade before I watch again. Why can’t anyone score?",
    "825": "@RatiodByJynx @dallasmavs @Chime I love this image",
    "826": "HOW annoying @dallasmavs",
    "827": "What a disappointment @dallasmavs",
    "828": "@dallasmavs just tank",
    "829": "@dallasmavs @Chime WE WANT MYLES TURNER",
    "830": "@dallasmavs @Chime When are we gonna start hittin 3’s?",
    "831": "@andyserling @NBAonTNT @dallasmavs Smelling a chase on the Celtics?",
    "832": "@dynamic_voltage @dallasmavs @Chime Wrong series fam. KD swept the Mavs 2012",
    "833": "🤖 #SofiAlert \n📅 07-12-2021 \nBrooklyn Nets - Dallas Mavericks \n🛋 2.9/5 Sofis https://t.co/qMc8ewyg4m",
    "834": "@dallasmavs @Chime You would think that at least 1 of the “significant” Mavs signings/trades would’ve worked out.  Bullock, Richardson, Brown, Johnson. Nope.  All trash.",
    "835": "My Tennessee Vols and Dallas Mavericks combined to shoot 15-86 from 3 tonight. Some stormtrooper level shit right there",
    "836": "@dallasmavs @Chime Y'all just flat out suck! J.Kidd was a train wreck of a hire! Trade KP, and the coaching staff for fresh towels and Gatorade",
    "837": "@dallasmavs @Chime At this point its not even losing...  Its how we lose that's even more embarrassing!",
    "838": "Luka really needs some help, get Domantas Sabonis to the @dallasmavs plz",
    "839": "@dallasmavs very fuccing hard to be a damn mavericks fan. Y’all are not good",
    "840": "Being a @dallasmavs fan is rough😵‍💫 https://t.co/OQd25VBlJ2",
    "841": "@dallasmavs @Chime Wanna give me a refund? Buncha bums. https://t.co/Ekyl2ApOMi",
    "842": "13 points in the fourth quarter? @dallasmavs what a fucking shame",
    "843": "@dallasmavs @Chime Of course we did",
    "844": "Whew don't turn on the tv @dallasmavs @mcuban",
    "845": "@dallasmavs have been history setting bad at 3 pointers, yet that's all they shoot. Zero offense, even less coaching. #nba",
    "846": "Coaching matters #MFFL @dallasmavs #BKNvsDAL @NBAonTNT https://t.co/GeDYHQJ6YN",
    "847": "@dallasmavs @Chime Mavs signed Haraway based on his last postseason performance but Mavs forgot how many bricks this guy hit since he came to Mavs.",
    "848": "Another fun night watching the Dallas Mavericks. https://t.co/DdSRSlrIew",
    "849": "Being a @dallasmavs and @dallascowboys is literally the most stressful sports experience in the world. 🤬",
    "850": "@dallasmavs @Chime This team is not a playoff team at all",
    "851": "SON \nOF A......\n\n#NetsWorld 102\n#MFFL 99\n\nThe @BrooklynNets pull off the comeback over the @dallasmavs. This has to be one of their most impressive victories this season.\n\n#NBA75 \n#TuesdayVibe\n⚪️⚫️⚪️⚫️ https://t.co/S4Gj2ZNzmz",
    "852": "@rubenfaz214 @dallasmavs @Chime Wait - you posted a picture of a series where the Mavs beat KD 4-1 on their way to a championship. That's pretty embarrassing for you.",
    "853": "@SportsCenter Also helps the @dallasmavs are a garbage team right now.",
    "854": "@mavsncowboys @dallasmavs @Chime Quite frankly as someone who has a page on the Mavs website for my wedding, I'd rather text than look at Dwight Powell too",
    "855": "@mrobbins1016 @dallasmavs @Chime And now it’s poorly coached too so may not even make it to the first",
    "856": "@dallasmavs @Chime Wasn’t surprised, but it still hurt. 😑",
    "857": "@dallasmavs @Chime 9-46 for three",
    "858": "@dallasmavs @Chime A combined 0-13 from 3, from the guys we pay to shoot 3s 😭😭😭😭😭😭 https://t.co/h6N8IqMwnk",
    "859": "@GDB_LPN @oscaaargalla @rubenfaz214 @dallasmavs @Chime Congrats, KD is a monster. Mavs shot 9-46 from three lol, if they shot 25% (which is still garbage) they would have won this game.",
    "860": "@dallasmavs  trade @jalenbrunson1",
    "861": "The way Charles is whining coming back on @NBAonTNT I think he did more than just predict the @dallasmavs would win",
    "862": "y’all tired of losing yet? @dallasmavs",
    "863": "Blow it up @dallasmavs",
    "864": "@manny__xo @dallasmavs That call was REVERSED. After watching it in slow mo so think about that.",
    "865": "Tell them Barkley! Make a move @dallasmavs 🙏🙏🙏🙏 #thisrostersucks",
    "866": "@dallasmavs @Chime If this keeps on going, then they must forget Playoffs.",
    "867": "@mcuban was on his phone right after the game ended. When players were walking back to the locker room👀👀 @dallasmavs @mcuban #mffl",
    "868": "@Mavs_Facebook @dallasmavs @Chime well that escalated quickly",
    "869": "@dallasmavs @Chime Pass it to the man who’s 0-5 from deep for the OT shot @sgaHardawayJr",
    "870": "@dallasmavs @Chime Terrible shit team lol....+17 advantatge to trash",
    "871": "The Dallas Mavericks aren’t a good basketball team. If it wasn’t for Luka, this team wouldn’t even sniff the playoffs. #Mavericks",
    "872": "Our reaction to that Brooklyn #Nets victory over the Dallas #Mavericks: https://t.co/kitZgYcyUx",
    "873": "@Mah_0018_ Dallas Mavericks",
    "874": "@dallasmavs @Chime The 3 point shooting was a disgrace. THJ can’t create looks for himself and then finally gets an open look and fucks it. Up at 3am in the UK to witness the same shit again https://t.co/hlFKM56c7g",
    "875": "@dallasmavs @Chime @mcuban fix it you fuck, bet you would like to have seth rn smh",
    "876": "@dallasmavs @Chime Sell the fucking team, Cuban",
    "877": "@dallasmavs @Chime Garbage team. Cuban needs to blow it up. Trade everyone besides Luka",
    "878": "@dallasmavs @Chime This Dallas team is pretty awful. A bunch of dudes out there I've never heard of jacking up bad shots and no defense whatsoever.",
    "879": "@dallasmavs @Chime At least this loss was watchable was a fun game",
    "880": "@dallasmavs @Chime Why y'all never can make good addictions for this piece of shit called roster?",
    "881": "@lamibackup @dallasmavs @Chime Reggie has been disappointing ngl like he is better than this but he wont show it whats his problem",
    "882": "@dallasmavs @Chime Please never let Josh Green see the floor, send him to the gleague where he belongs. Or send him to OKC for Favors.",
    "883": "The Gang Slanders the Dallas Mavericks",
    "884": "@dallasmavs @Chime Time fuleiro",
    "885": "@dallasmavs @Chime reggie bullock out",
    "886": "The Dallas Mavericks need better defense. Myles Turner would help.",
    "887": "@dallasmavs go ahead and get Turner already smh",
    "888": "@mcuban @dallasmavs is it time to panic. Change is needed a person with impaired vision can see that...#next #bad",
    "889": "@AndresFCBi @dallasmavs @Chime Still shooting 3s 3% &gt; Doncic.",
    "890": "@dallasmavs Jason Kidd is Mavs' Jason Garrett. Awful coach. Just a yes man to the owner. More talent than any team yet worst offense I've seen in 10 years. @luka7doncic  is a whining baby that can't shoot free throws or 3's yet he gets to run the team. Will be bad for a long time",
    "891": "@dallasmavs @Chime How tf do you go 9-46 from 3??!!!",
    "892": "@YoungWood609 @dallasmavs Yeahh i know they are the stars, but hardaway needs to step up if they cant score. He must prove that he deserves all of the money that mavs pay him at the off season",
    "893": "@dallasmavs @Chime Luka is playing alone trade KP and finney smith for a players can help Luka",
    "894": "FINAL: \nNETS 102, MAVS 99\n\n➡️ Luka Doncic\n28 pts, 6 reb, 9 ast\n\n➡️ Kevin Durant\n24 pts, 7 reb, 3 ast\n\n➡️ For the first time the Mavericks are below .500 with a 11-12 record. \n\n📸 @_BOneal/D210SPORTS\n\n#dallasmavericks #dallasmavericksbasketball #mavs #mavsnation #mffl #mavsstrong https://t.co/NhnIqCzbCL",
    "895": "#DallasMavericks - #BrooklynNets 99:102\n#NBA\n🇺🇲🏀🇺🇲🏀🇺🇲🏀\n\nMore info: https://t.co/5KPXEJ9UzX https://t.co/AsBCCHFnme",
    "896": "NBA @BrooklynNets at @dallasmavs, Tuesday, December 7, 2021 @NBA @NBAstats #gamecharts #dataviz #nft https://t.co/lGCB5L1CcT",
    "897": "@dallasmavs @Chime I’m glad I couldn’t see the game",
    "898": "@dallasmavs @Chime yall had one job bruh",
    "899": "@nizcomix @notorioustei @dallasmavs @Chime This is the goated one https://t.co/FiUk9gUHoj",
    "900": "What a collapse by the Dallas Mavericks. Luka has a lot to learn. That last possession was horrible. Nets came back from 17 down to win on the road. KD, who had been struggling all night, comes up with 11 4th quarter clutch points to steal the game. KD in that MVP conversation.",
    "901": "@icetraelatte @dallasmavs @Chime You’re not a Mavs fan you’re a Luka hater",
    "902": "#Nba | FT: \nDallas Mavericks 99-102 Brooklyn Nets\nFor more games, visit our site! https://t.co/OlA5fCKyfe",
    "903": "@dallasmavs \"J.Kidd\" my in stupid ass \"Cubes\" voice, cant coach! He sucks!!!!! Holy shit blowing a 17 point lead is garbage, at least we don't have a woman beater for a coach..........ooops, well at least 2011 was a cool year!",
    "904": "@dallasmavs @Chime When y'all going to learn how to make 3's? 😂",
    "905": "@oscaaargalla @rubenfaz214 @dallasmavs @Chime Could be that? https://t.co/cbiUQVlMdS",
    "906": "@dallasmavs @Chime blow this team up",
    "907": "@dallasmavs @Chime Wait so we gave contracts to Brown, Bullock and THJ aka good 3pt shooters and noone can do their job??",
    "908": "@dallasmavs @Chime 2-8 in the last 10 games. Time to blow it up and get luka some help",
    "909": "@JJ_Burr5 @dallasmavs I hate watching them. They refuse to stop shooting 3s no matter how cold they are.",
    "910": "@dallasmavs @Chime Hardaway choked all 4th",
    "911": "@dallasmavs @Chime Hate this team ! Especially everyone that’s not KP or Luka!!",
    "912": "@NBA Wow! 🍻\n\n@BrooklynNets rally from a 17-point deficit to beat @dallasmavs .",
    "913": "@dallasmavs @Chime As an honest mavs fan I can shoot better than hardaway. Sign me 💯",
    "914": "@dallasmavs @Chime Offff...after half time big Lead..then L",
    "915": "@dallasmavs @Chime What is the plan when you have hardaway as your spot up shooter",
    "916": "@dallasmavs @Chime I think im done watching this team unless they make trades. 9-46 from 3.",
    "917": "@imthatdude69420 @dallasmavs Lol ok",
    "918": "@dallasmavs @Chime Pathetic",
    "919": "@dallasmavs @Chime Biggest fish in FA you got was 0-6 from three",
    "920": "@dallasmavs @Chime Clax owns Fluka🤡",
    "921": "@dallasmavs @Chime You just lost to a bath water connoisseur 😹😹😹",
    "922": "@dallasmavs @Chime Hardaway: 0-7 FG 3 pts\nBullock: 0-6 FG 3 pts \n3 points specialists 😂\nTrade all without Luka/KP/Brunson",
    "923": "@dallasmavs @Chime Choke artist",
    "924": "@dallasmavs @Chime Clippers own you",
    "925": "@NBAonTNT Got a love how the @BrooklynNets win by mid range and @dallasmavs gave the game away by bricking 3pts https://t.co/atg9SXJaqD",
    "926": "@dallasmavs @Chime Seriously don’t know how to fix this shooting other than just hope they start falling 🤷‍♂️",
    "927": "@manny__xo @dallasmavs Yea you’re right the other foul on KD no call is another 2 points",
    "928": "@dallasmavs @Chime Get rid of everybody but Luka in Brunson and yes that includes Hardaway and KP",
    "929": "@dallasmavs @Chime deactivate",
    "930": "@dallasmavs mediocre coach players all of you FU pathetic, stupid decisions, intent of 3pts you are really a supreme idiot coach",
    "931": "@dallasmavs @Chime Stop shooting 3 dammit",
    "932": "@dallasmavs @Chime Shut up admin",
    "933": "@dallasmavs @Chime I blame Luka for this L https://t.co/Gcn8URlj5C",
    "934": "Dwight Powell - Dallas Mavericks\n10 PTS\n6 RBD\n[FD(17.2) DK(17.5)]",
    "935": "Kristaps Porzingis - Dallas Mavericks\n17 PTS\n12 RBD\n5 AST\n1 BK\n1 STL\n2 TO\n[FD(42.9) DK(44.5)]",
    "936": "Dorian Finney-Smith - Dallas Mavericks\n15 PTS\n6 RBD\n2 AST\n3 STL\n1 TO\n[FD(33.2) DK(33)]",
    "937": "@dallasmavs @Chime Funny but even with the lead i knew we would choke late game.",
    "938": "@dallasmavs @Chime Why opt for 3 when you can drive and get a possible and-1?",
    "939": "@dallasmavs @Chime This was as bad a loss since blowing that giant lead to the lakers 20 years ago",
    "940": "@dallasmavs @Chime Shooters shoot. However, dont expect them to make any in Dallas. L Bullock. L Hardaway.",
    "941": "Tough loss @dallasmavs",
    "942": "#Nba | FT: \nDallas Mavericks 99-102 Brooklyn Nets\nFor more games, visit our site! https://t.co/QPPoKgHl4e",
    "943": "@dallasmavs @Chime Embarrassing game. Mavs looked so shooked during the 4th quarter. Also Mavs are and will always be a mid/lower team.",
    "944": "@mr_polymath @NBA @dallasmavs stop being a hater",
    "945": "@dallasmavs @Chime Explain yourselves.",
    "946": "@dallasmavs @Chime *Mavs not shooting good from 3 in the 4th\n\nFans: Stop shooting 3s!!\n\nMavs: https://t.co/D3sAGzMQR0",
    "947": "@dallasmavs @Chime Well satans fart hole, I thought they were going to pull it off!",
    "948": "@dallasmavs @Chime Fucking trade someone, Mark https://t.co/Tlhzdid5wg",
    "949": "@dallasmavs @Chime Damn it",
    "950": "@dallasmavs @Chime I would like to point out that we were 8-13 last year. Just saying. I’m really disappointed in this team, but just saying.",
    "951": "Dallas Mavericks will never win a ring with Luka as the best player",
    "952": "sucumbam dallas mavericks",
    "953": "@dallasmavs 13 points in the 4th sorry af 🤦‍♂️",
    "954": "@dallasmavs @swish41 Sat his age probably better than 3/4 of current team",
    "955": "@realonlinejack @dallasmavs @Chime Bye!! Diehards stick around through it all.",
    "956": "@dallasmavs just ain’t that good! Over paid tim n then did absolutely nothing to help Luka!!! @mcuban is at fault too thinks new coach n bullock was enough to help team. 🤦🏽‍♂️",
    "957": "@dallasmavs @Chime I hate you",
    "958": "@dallasmavs @Chime Just blew a 17 point lead 🤦‍♂",
    "959": "@dallasmavs @Chime Cut bullock👍",
    "960": "Idk if I’m more disgusted by James Harden playing on my TV or the type of coaching @dallasmavs are led by right now.",
    "961": "@dallasmavs @Chime WE NEED SHOOTERS",
    "962": "@dallasmavs @Chime Embarrassing. @mcuban",
    "963": "Dallas Mavericks throwbacks are sick, shout-out to Rolando Blackman Mark Aguirre, NBA legends",
    "964": "@dallasmavs @Chime We suck!",
    "965": "@WisconsinWan03 @NBA @BrooklynNets @dallasmavs no you couldn't sadly",
    "966": "@dallasmavs @Chime Y’all really cannot be this bad. It’s unbelievable. 9/45 from 3. All those open looks and y’all are putting up bricks.",
    "967": ".@dallasmavs why yall embarrass @swish41 like that?",
    "968": "@dallasmavs @Chime No 3PA in the tweet... I can´t believe that.",
    "969": "@mcuban @dallasmavs @MavsPR get sabonis/turner noww pleaseere🙏🏻🙏🏻🙏🏻😭😭😭 https://t.co/7KcLkowYvH",
    "970": "@dallasmavs @Chime I'm getting tired of this. The FO needs to really look into trades this coming February for a \"true\" center and 3 &amp; D wing defender.",
    "971": "@dallasmavs @Chime And the King of Bricks award goes to!!!!Its a close one between Hardaway and Bullocks but Hardaway has the edge as his been the king of bricks since he came in Mavs aside from last postseason",
    "972": "@dallasmavs let’s try shooting at least 60 more attempts from threes next game maybe we’ll sink 10.",
    "973": "@BallySportsSW @dallasmavs We suck, we know",
    "974": "THIS YOU? @dallasmavs https://t.co/ZvVuBJNoKD",
    "975": "@dallasmavs @Chime 9-46. NINE FOR FORTY-SIX.",
    "976": "@maarten_g @dallasmavs Yup. Defeat from jaws of victory. Not sure what the plan is.",
    "977": "The @dallasmavs are terrible, and I’m a huge fan. They need to tank now. Jason Kidd has turned one of the most efficient offenses in the @NBA into poop. Where is Carlisle when you need him?",
    "978": "@Mavs_Win @dallasmavs @Chime Nico better get his ass on the phone",
    "979": "@Mavs_Win @dallasmavs @Chime Hello play in game.  Smh.   No finishers on the mavs team right now.",
    "980": "@dallasmavs @Chime Another blown lead. Things need to change. I’m still a #MFFL but man, these are getting hard to watch.",
    "981": "@dallasmavs @Chime Half of our players are trash and we won’t do anything to fix it. Luka is going to leave and it’s back to the lottery.",
    "982": "@dallasmavs @Chime FUCK'ALL",
    "983": "@rubenfaz214 @dallasmavs @Chime 4-1 that year 💀💀💀 get a bettee picture next time",
    "984": "@ultralightbeam @dallasmavs @Chime First piece would be to trade for a nutritionist",
    "985": "@dallasmavs @Chime Just let Luka leave he doesn't deserve to be going through this shit.",
    "986": "@dallasmavs @Chime Us today https://t.co/gGzOj9S6V3",
    "987": "@dallasmavs @Chime We haven’t won at home since November 15th.",
    "988": "Miami will gladly take the overweight Slovenian out of your hands 👍🏼👍🏼👍🏼👍🏼👍🏼 @dallasmavs",
    "989": "@dallasmavs @Chime Unfuckingbelievable",
    "990": "@dallasmavs @Chime This team sucks truck juice",
    "991": "@dallasmavs @Chime WE OWN YALL 🗽 https://t.co/gjZurI5dP1",
    "992": "@dallasmavs @Chime Nice 13 point quarter lmao",
    "993": "@imthatdude69420 @dallasmavs Look for a different excuse. 13 points in the 4th came down to more than this play. Collapse.",
    "994": "@dallasmavs @Chime We needed luka to score a buzzer",
    "995": "Getting embarrassed on national TV, the Dallas Mavericks way. #MFFL",
    "996": "@dallasmavs @Chime Sold me again smfh",
    "997": "@dallasmavs @Chime The 4th quarter was not the time for Jason kidd to try out his, “get the ball out of luka’s hand quickly strategy”.  Such a bad coach, the only quality thing about him is the nets and bucks got better directly after he left",
    "998": "@dallasmavs @Chime Ship out everyone but Luka",
    "999": "@dallasmavs @Chime It’s been downhill since we traded Seth for Josh Brickson",
    "1000": "9-46 from three\n\n19.6% \n\n@dallasmavs https://t.co/pLvs1cRTXW",
    "1001": "@dallasmavs @Chime Do you know how many open shots you guys had?",
    "1002": "@dallasmavs @Chime Just fucking trade them all. It's over",
    "1003": "@Mavs_Win @dallasmavs @Chime Gotta start hitting these open 3’s. Especially in crunch time 🤦🏼‍♂️",
    "1004": "@NBA @BrooklynNets @dallasmavs Derozan and lavine better🤡🤡🤡 Caruso too",
    "1005": "@dallasmavs @Chime We must lead the league in missed open shots, terrible.",
    "1006": "@dallasmavs @Chime this one hurt",
    "1007": "@dallasmavs @Chime Never seen sooooo many missed open shots in my LIFE in one game",
    "1008": ".@BrooklynNets just trying to keep pace with the @chicagobulls. Good thing @dallasmavs @T_HardJR clanked that triple. #NetsWorld #MFFL #NBA #NBATwitter",
    "1009": "@dallasmavs @Chime Losing sucks",
    "1010": "@suburbangolfdad @dallasmavs @Chime Trade Luka &amp; delete the franchise",
    "1011": "Right on cue @dallasmavs had a 17 point lead and lost in the end \n\n11-12 record 🙄 #MFFL",
    "1012": "@dallasmavs @Chime Sell the team mark.",
    "1013": "@dallasmavs @Chime GET SOME REAL SHOOTERS MISSING OPEN SHOTS THE REASON WE LOST",
    "1014": "Name a more iconic duo\n\nThe Dallas Mavericks\nand \nCollapsing in the 4th quarter",
    "1015": "@dallasmavs @Chime BLOW THE WHOLE TEAM!",
    "1016": "Not gonna beat many teams shooting 19% from 3. @dallasmavs",
    "1017": "Dallas Mavericks that was some worst 4th quarter basketball and its been regularly bad",
    "1018": "@dallasmavs why can’t our “shooters” shoot?",
    "1019": "@dallasmavs @Chime This team is complete trash good bye Luka won’t be long before he demands a trade from this piece of shit roster @mcuban built",
    "1020": "@dallasmavs @Chime Why Just why",
    "1021": "@dallasmavs @Chime I HOPE A SINKHOLE HAPPENS IN MARK CUBAN NEW TOWN",
    "1022": "@dallasmavs @Chime This team as currently constructed won’t make it past the first…again 🙄",
    "1023": "@dallasmavs @Chime This team always choke in the end",
    "1024": "@dallasmavs @Chime This team needs some help. Need a big. https://t.co/iLPXbcYIjB",
    "1025": "@dallasmavs @Chime Claxton clamped Luka 😂😂 https://t.co/0UdEJ6Khb0",
    "1026": "@dallasmavs @Chime Nice choke boys",
    "1027": "@dallasmavs @Chime Fire Kidd immediately https://t.co/eL0bydj6vV",
    "1028": "@rubenfaz214 @dallasmavs @Chime bio says dallas tx 💀💀💀💀 gtfo",
    "1029": "@dallasmavs just went 9-46 from 3’s. 27-44 from 2’s. Solid game plan.",
    "1030": "@dallasmavs @Chime 19.6% from three. If Mark Cuban makes zero moves by the trade deadline, this team is going nowhere. Prob will lose in the play-in, not even the first round of the playoffs.",
    "1031": "@dallasmavs @Chime I’ll go first : 9-46 3P will lose you ANY game, it’s that simple",
    "1032": "@Mavs_Win @dallasmavs @Chime we suck",
    "1033": "@dallasmavs @Chime Y’all are worse than the pistons",
    "1034": "@dallasmavs @Chime Ratio admin",
    "1035": "13 FUNKY ASS POINTS IN THE 4th!!!!! @dallasmavs fucking embarrassing.",
    "1036": "@yoshuas @dallasmavs This is on luka and KP they are the stars on the team they have to close it out. Up 17 points no excuse !",
    "1037": "Kp6 is so soft @dallasmavs",
    "1038": "@dallasmavs @Chime Tim really missed that omg",
    "1039": "@dallasmavs @Chime I’ve been a lifelong Mavs fan since 2002 and I can say this is the most embarrassing moment of my life. I’m ashamed right now so I’m turning in my fan card. Goodbye Dallas. I won’t miss you. I’ll be rooting for no one now because I'm a die hard NBA fan. FCK IT MCUBAN SELL THETEAM",
    "1040": "@dallasmavs @Chime Trade that bum bullock out..I mean how can you call yourself a sniper when you can't even make one 3 for life? That too open?",
    "1041": "@dallasmavs @Chime 8-46 from 3. We had no business losing this game. Damn shame. #makeatrade",
    "1042": "@dallasmavs @Chime 10/10 choke job 🗑",
    "1043": "@dallasmavs @Chime Nice one.",
    "1044": "@dallasmavs @Chime TRADE EVERYONE (not named luka)",
    "1045": "@dallasmavs @Chime sell the team @mcuban",
    "1046": "Good shit @dallasmavs 😎",
    "1047": "@dallasmavs @Chime Tim Hardaway Jr. robbed us",
    "1048": "@JayTC07 @dallasmavs He was inconsistent when they resigned him tho. They knew what they were signing up for and we just gotta suffer the headaches as fans. It's such a beating!",
    "1049": "@dallasmavs @Chime Been a mavs fan for 20 years. What a sad, sorry team.",
    "1050": "@CancunDurant @dallasmavs how much help does kd need from refs? Always had help since the warriors days",
    "1051": "@dallasmavs @Chime Lose a 17 point lead and miss a open 3 - deserve to lose !",
    "1052": "@dallasmavs plz change something, we suck",
    "1053": "Hey @NBAonTNT Fifteen years ago, @SteveNash battled @TeamJasonKidd on the court through two overtimes with Nash and the Suns finally winning 161-157. Tonight they battled from the sidelines as coaches of the @BrooklynNets and the @DallasMavs, respectively. https://t.co/SxEcqSNUyJ",
    "1054": "@dallasmavs @Chime Embarrassing",
    "1055": "What a game! Nets pull off a 17-point comeback to win 102-99 in Dallas. The Mavericks went cold in the 4th, right as Durant got hot and took over. Nets improve to 17-7 with a gutsy, if not sloppy, victory. @DrTudor77",
    "1056": "@dallasmavs @Chime we can trade tim and reggie? THANKS",
    "1057": "The Dallas Mavericks are so aggressively unclutch lmao.",
    "1058": "@dallasmavs @Chime 0/7 Hardaway",
    "1059": "@dallasmavs @Chime Trade Luka and start the rebuild",
    "1060": "@dallasmavs @Chime Wow never seen such clowns",
    "1061": "@dallasmavs @Chime 9-46 from 3. Have some shame",
    "1062": "13 pts in the 4th... good job boys @dallasmavs smh.. fuckin trash",
    "1063": "@dallasmavs @Chime MAKE AN OPEN 3 YOU USLESS FUCKS",
    "1064": "@dallasmavs @Chime Biggest reactions from the loss ⬇️",
    "1065": "@dallasmavs @Chime Maybe you should of jacked up 95 3’s just maybe you make enough to win",
    "1066": "@dallasmavs @Chime how many open 3’s we gonna miss…",
    "1067": "@dallasmavs @Chime I hate you I swear",
    "1068": "@mcuban @dallasmavs please make some fuckin moves!!",
    "1069": "@dallasmavs really 13 pts in the 4th....we are leading the whole fucking game! Yikes thats so embarrassing",
    "1070": "@dallasmavs @Chime Trade Bullock and Hardaway",
    "1071": "@dallasmavs @Chime Absolute fucking joke , I'm sorry ... even with awful call overturned this Mavs team is just atrocious shooting the ball . Someone PLEASE get Reggie BROKElock off this team as well , dude is absolutely worthless",
    "1072": "@dallasmavs @Chime KD still owns the Mavericks nothing new 🥱 https://t.co/iv0mLJFsky",
    "1073": "@dallasmavs @Chime Just pain",
    "1074": "@dallasmavs @swish41 This version of Mavs suck ! Please clean out this sorry team !!!",
    "1075": "@dallasmavs @Chime get luka help NOW",
    "1076": "Start the rebuild @dallasmavs",
    "1077": "@dallasmavs @Chime Certified sellers",
    "1078": "@redditmavericks I’ve never gone from all in to 99% out on a team than I have on the 2021 Dallas Mavericks. They stink.",
    "1079": "@dallasmavs @Chime Oh boy",
    "1080": "Final.\n\n@Chime | #MFFL https://t.co/u5uszxic3f",
    "1081": "@dallasmavs 13 points in the last quarter this team is a joke",
    "1082": ".@dallasmavs—YIKES",
    "1083": "Tim Hardaway Jr is Garbage.\n\n#Mavericks \n#Dallas",
    "1084": "9 for 46 from 3 and goofed a 17 point lead, at one point 9-4 now 11-12\n\nYour 2021 Dallas Mavericks folks\n#MFFL",
    "1085": "@mcuban @dallasmavs y’all really stink. Go make some trades damn",
    "1086": "Mavericks couldn’t help bulls get back the #1 seed. You suck Dallas",
    "1087": "4th quarter comeback @BrooklynNets ! Outscore those @dallasmavs 27-13 for the win! #NBA75 #NBAonTNT",
    "1088": "Fix it before the trade deadline @dallasmavs",
    "1089": "Time to get better @dallasmavs ….",
    "1090": "9-46 from three. Yet @dallasmavs kept shooting it 😩😩🤦🏻‍♂️ I don’t get it",
    "1091": "Shout out to Tim JR for the missing the shot 👏🏽👏🏽 @BrooklynNets @dallasmavs",
    "1092": "We deserve that L and shows we have a long way to go! Hope @mcuban makes a move #MFFL @dallasmavs",
    "1093": "I play the long game. Not the short term fickle one based on the last 48 mins of basketball like 95% of our fans. And usually win.\n\nJason Kidd is bad for the Dallas Mavericks. Time will prove this.  1000% confident on that and my mind won’t change.\n\nHope this helps",
    "1094": "@dallasmavs gonna get it going soon it won’t be too long",
    "1095": "That was an interesting ending between The Brooklyn Nets vs The Dallas Mavericks\nIt was an entertaining game too",
    "1096": "Y’all sad as hell @dallasmavs",
    "1097": "@dallasmavs lol losers https://t.co/KkOmteiImn",
    "1098": "Trade everyone. @dallasmavs",
    "1099": "@maarten_g @dallasmavs Wasting prime Luca years…",
    "1100": "Dallas mavericks is trash 🗑 😒 😪",
    "1101": "@dallasmavs are an embarrassing dumpster fire with zero leadership on or off the floor. They drive to the basket for an open shot but all are worried about a highlight pass so they kick it out for a missed 3, 163 times a game....",
    "1102": "Trash team @dallasmavs",
    "1103": "Appointing Kidd as our head coach is the worst decision made this season. @dallasmavs",
    "1104": "What. The. Fuck. Mavs. @dallasmavs",
    "1105": "Damn @dallasmavs  there is no way y’all should’ve blew that lead and Tim you make too much money to be missing like that",
    "1106": "STOP PLAYING HARDAWAY RN PLEASEEEEEE @dallasmavs HE DOESNT DO SHIT BESIDE RUNNING AROUND THE COURT!!! PAINFUL TO WATCH😭😭",
    "1107": "Nothing like blowing a 17 point lead.. wtf @dallasmavs pull your heads out.",
    "1108": "@iAmDjEastwood @dallasmavs Nets defense looks legit",
    "1109": "The Brooklyn nets have defeated the Dallas mavericks",
    "1110": "Kevin Durant vs Dallas Mavericks. https://t.co/q4RU9ub4Dk",
    "1111": "That fucking hurt! @dallasmavs",
    "1112": "Blow it up @dallasmavs @mcuban",
    "1113": "Nets come back from down 17 to beat the Mavericks. Nets start their 4-game road trip with an ugly win in Dallas.",
    "1114": "@dallasmavs not surprised one bit from these losers. Need stop watching this garbage!",
    "1115": "🏀 Final Score 🏀\nBrooklyn Nets 102 - 99 Dallas Mavericks\n\nHarden 54.8 DK, 49.8 FD\nDoncic 50.0 DK, 47.7 FD\nPorzingis 44.5 DK, 42.9 FD\n\nhttps://t.co/IIuYCTQkL5",
    "1116": "Smfh @dallasmavs TRADE THE WHOLE TEAM!!!",
    "1117": "Y’all ass! @dallasmavs",
    "1118": "Are you guys SKUNKED!!!!! @dallasmavs",
    "1119": "PLEASE SOMEONE TEACH THE @dallasmavs HOW TO SHOOT 3'S. PLEASEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEE",
    "1120": "@dallasmavs wow blowing a 17 point lead?!?!?! Lmfao then lose by 3!?!?!!!! Y'all are killing me",
    "1121": "The Dallas Mavericks exist",
    "1122": "@dallasmavs u had one job",
    "1123": "@dynamic_voltage @dallasmavs hardaway lost this game. useless useless player",
    "1124": "What a comeback! Brooklyn Nets stun Dallas Mavericks 102-99 at American Airlines Center!",
    "1125": "Game 24 \n@ Dallas Mavericks https://t.co/O1jjSafz7E",
    "1126": "@dallasmavs They said this wasn't a foul. FUCK THESE REFS https://t.co/y4OL30hMPa",
    "1127": "@dallasmavs can’t shoot",
    "1128": "@dallasmavs @swish41 TRADE TIM HARDWAY BRICK",
    "1129": "@dallasmavs y’all mfs suck",
    "1130": "They took 46 3s? LMAO who the fuck y'all think y'all is? @dallasmavs",
    "1131": "@dallasmavs Lmao",
    "1132": "@dallasmavs can’t lose that game.",
    "1133": "Dallas Mavericks are awful in the 4th lmao  #BKNvsDAL",
    "1134": "NOOO WHYYYY @dallasmavs WHYYYY",
    "1135": "@dallasmavs @swish41 Hoping to get tickets to January 5 somehow. Dirk is my favorite player. Was upset I didn’t get to go to his final game. #MFFL",
    "1136": "Losers @dallasmavs",
    "1137": "dam tough lose @dallasmavs",
    "1138": "We suck again @dallasmavs",
    "1139": "Y’all make it so hard to love y’all man @dallasmavs",
    "1140": "@dallasmavs Sorry motherfuckers  drive the ball",
    "1141": "@ChrisAnstey13 @dallasmavs @BrooklynNets @NBA Nash is probably the worst MVP of the league all time, how many MVPs have never made the finals.  Kidd superior defender by some distance as well",
    "1142": "The Nets come from down 17 points in Dallas to beat the Mavericks 102-99. Kevin Durant goes for 24 PTS and 7 REB, James Harden with 23 PTS, 9 REB and 12 AST, Patty Mills with just 10 PTS but all coming in bit moments late in the game.\n\nMavs have now lost 8 of their last 10 games.",
    "1143": "I like the DALLAS on these Mavericks uniforms, with the cowboy hat behind the D, but it feels like the font size is too small.",
    "1144": "@RLopez04193767 @dallasmavs In the NBA hand is apart of the ball",
    "1145": "Hey @dallasmavs I am pretty sure I can hit some of these open 3’s for ya for a lot cheaper.",
    "1146": "@dallasmavs how do you guys stand hardaway. rooting for you guys but TH just fkx everything up. Dude is useless.\nRefs favoring Harden again. That was a foul. You can't grab someone's wrist even after you get ball. Doncic wasn't able to regain ball because of hold.",
    "1147": "@dallasmavs Hardaway sucks",
    "1148": "Porzingas used to EAT on the Knicks he just been subpar on The Mavs smh #DallasMavericks",
    "1149": "@AustinPlanet @NBA @BrooklynNets @dallasmavs Only reason it happens cause it’s Luka. Refs are too obvious in their bias against him. It’s stupid.",
    "1150": "The Dallas Mavericks make me sick",
    "1151": "Having to spend another year watching the @dallasmavs have horrible 3 point shooters around Luka &amp; KP because @mcuban won’t listen to “Mavs Twitter” https://t.co/gHiLjbu0Vc",
    "1152": "@dallasmavs this is hard to watch for 82 games a year. Something has to give.",
    "1153": "@dallasmavs FU super loosers",
    "1154": "@mcuban Is @tonyromo name on the basketball court as well since he played for the @dallasmavs?",
    "1155": "@NBA @BrooklynNets @dallasmavs Goat",
    "1156": "@dallasmavs   And why again did we get rid of James Johnson for pretty much nothing?  Sure would like to have him back tonight.",
    "1157": "@NBA @dallasmavs Luka Doncic you are a wonderful player and a strong leader so stop messing with the referees - 🤩 keep the team focused.",
    "1158": "Don’t really understand these last two foul calls in the @dallasmavs game. Harden clearly fouled Luka… but whatever we will go fuck ourselves",
    "1159": "Watching the @dallasmavs play the @BrooklynNets in Dallas where their respective coaches spent time during their playing careers. Debate we’re having here: who has the better @NBA career?",
    "1160": "@girldadNFT @TopShotGiftGoat @BrooklynNets @dallasmavs @TopShotDadMoves @etchedNFT @TheOfficialHDA And actually even though I was first... the \"1st\" person didn't RT... so... 😉",
    "1161": "Miss my team @dallasmavs",
    "1162": "@girldadNFT @TopShotGiftGoat @BrooklynNets @dallasmavs @TopShotDadMoves @etchedNFT @TheOfficialHDA And actually even though I was first... the \"1st\" person didn't RT... so... 😉",
    "1163": "This Dallas Mavericks team ain't good enough. THANKS @mcuban",
    "1164": "THJ really isn’t the smartest player. Im 100% down for trading him. @dallasmavs",
    "1165": "@dallasmavs Trade Luka and start over no other superstars wants to come and play with him and Dallas all he does is bitch and complain shoot three pointers dribble out the clock and blame others and hey Dallas how about rebounding ever fucking once in a while",
    "1166": "@nba cheated tonight against the @dallasmavs Most egregious wrong call after a review I've ever seen.",
    "1167": "@dallasmavs blew that shit",
    "1168": "Great 2nd half collapse @dallasmavs 🙄",
    "1169": "@dallasmavs FU all",
    "1170": "Finally get to watch a game and the refs fuck the @dallasmavs once again! Fucking Dirty NBA refs",
    "1171": "@NBA @BrooklynNets @dallasmavs There is no defending that man",
    "1172": "@NBA @BrooklynNets @dallasmavs lebron would pass out of that",
    "1173": "@NBA @BrooklynNets @dallasmavs I can’t believe Harden got that call just now.",
    "1174": "@girldadNFT @TopShotGiftGoat @BrooklynNets @dallasmavs @TopShotDadMoves @etchedNFT @TheOfficialHDA @girldadNFT @TopShotGiftGoat @TopShotDadMoves I know I'm not the first but I got some with the sign &amp; standing up. As well as video https://t.co/nSVNXFEFWc",
    "1175": "@NBA @BrooklynNets @dallasmavs Best player in the league",
    "1176": "@girldadNFT @TopShotGiftGoat @BrooklynNets @dallasmavs @TopShotDadMoves @etchedNFT @TheOfficialHDA @girldadNFT @TopShotGiftGoat @TopShotDadMoves I know I'm not the first but I got some with the sign &amp; standing up. As well as video https://t.co/W92VHrpRvI",
    "1177": "Luka out here to his teammates after Harden burns by him. \n\n#BKNvsDAL #NBA75 \n@dallasmavs https://t.co/H2H7UFcrbL",
    "1178": "KD. CASH 💰\n\n@BrooklynNets 102\n@dallasmavs 99\n\nFinal minute on TNT! https://t.co/NfbVWjAcAW",
    "1179": "@dallasmavs What happened!!!",
    "1180": "@dallasmavs only super mediocre can loose a game after winning by ten",
    "1181": "@NBA @dallasmavs Not at buzzer tho .. trash tweet",
    "1182": "the Dallas Mavericks, once again https://t.co/WPhj7Yb8qb",
    "1183": "Should went to @dallasmavs  and @BrooklynNets  game. I passed on it. https://t.co/e65XouwIt6",
    "1184": "This @dallasmavs Vs @BrooklynNets Good AF",
    "1185": "The @dallasmavs are giving me @AtlantaFalcons vibes with blowing leads like that",
    "1186": "Kristaps is the most frustrating player in the #nba to watch. If i was a @dallasmavs fan it would drive me crazy",
    "1187": "Dallas Mavericks make a field goal (any kind) challenge",
    "1188": "Can anybody on this team hit open threes? @dallasmavs #MFGL",
    "1189": "Too many fucking jump shots. 🤦🏻‍♂️ #MFFL @dallasmavs",
    "1190": "@XeinWins @dallasmavs @swish41 is your book up your butthole",
    "1191": "Stop double teaming y’all fucking professionals @dallasmavs",
    "1192": "@newyscruggs @dallasmavs need a miracle. Cannot shoot. Bad team defense. And more. Hopefully they get the miracle.",
    "1193": "This game has the feel of the entire season so far: a Dallas Mavericks roster hanging on for dear life.",
    "1194": "@DestroyLoosers @dallasmavs Please stop!!! Ridiculous",
    "1195": "The amount of open shots that have been missed is so extremely frustrating #Mavs #MFFL @dallasmavs",
    "1196": "@dallasmavs super idiots to insist 3pts in a tight game super mega idiots, the super mediocre team winning by ten and then lose by 2 pts fire the stupid players and coaches bunch of loosers",
    "1197": "@dallasmavs why this team do this stupid shit over and over. Wide open lane for Luka and nope let's take a lower percentage three????? I mean come on Mavs who are you guys?",
    "1198": "MAKE A FUCKING WIDE OPEN 3 @dallasmavs",
    "1199": "TIMEOUT DALLAS MAVERICKS \n1:22 4Q \n\n#MFFL 97\n#Netsworld 100",
    "1200": "@dallasmavs this team is fucking horrible",
    "1201": "Stop double teaming KD you whores @dallasmavs",
    "1202": "@dallasmavs Most overrated franchise in the nba",
    "1203": "@dallasmavs y’all better not….",
    "1204": "Nothing makes my heart happier than Jason Kidd and Steve nash coaching on the same sideline while Dirk sits in the stands watching Luka play\n\n#MFFL || @dallasmavs",
    "1205": "@dallasmavs Lmao that KD block was all hand, wtf are these refs smoking",
    "1206": "@dallasmavs I’ll miss open 3s for half Bullock’s salary.",
    "1207": "Watching this Nets v Mavericks game. Its pretty good. Rooting for Dallas!",
    "1208": "Dallas Mavericks - Brooklyn Nets\nSan Antonio Spurs - New York Knicks\n\nBet slip link: https://t.co/E3mNGgUrVK https://t.co/8M5OVczrf1",
    "1209": "@dallasmavs WHY ARE WE SO BAD AT FREE THROWS?!?!",
    "1210": "@dallasmavs Hey Luca try passing more and quit bitchin constantly",
    "1211": "God I love Luka @dallasmavs @luka7doncic",
    "1212": "Hell of a 4th From the @dallasmavs \n\nWinning the whole game and now this",
    "1213": "@dallasmavs Can we stop shooting fucking 3’s Jesus every game for years drive the fucking ball already why have a 7 footer in the game if your not going to play in the paint",
    "1214": "The Nets are playing the Mavericks tonight. In Dallas. FML. I coulda went (not really but I can dream). I’m at like 15 NBA arenas and this woulda been a great game to knock off my list. Welp. Just gotta come back. https://t.co/FYwf3xRqr5",
    "1215": "@NBA @dallasmavs Is it me or does Luca look like he gained some weight?",
    "1216": "@dallasmavs This team really sucks. They give up so many wide open shots. No one misses those in today's NBA - well the Mavs do, the rare time they're not jacking up a contested shot. Just not a good team at all.",
    "1217": "@dallasmavs to much settling",
    "1218": "@xn6ii__ @dallasmavs Cannoh believe this man, we had a 17 pt lead at a time",
    "1219": "The @dallasmavs have 4 points in the quarter vs a defensively porous @BrooklynNets team… lol #MFFL #joke",
    "1220": "@NBA @dallasmavs everyone doing the penny hardaway move lol",
    "1221": "DALLAS MAVERICKS https://t.co/ydW5lfNf9w",
    "1222": "We sold this game 😭😭fuck you @dallasmavs",
    "1223": "Dallas Mavericks kkkkkkkkkkkkkkkkk",
    "1224": "HOWWWW TF DID YOU SELL SO HARDD @dallasmavs",
    "1225": "@dallasmavs do NOT fall apart in the 4th. We need this WIN!",
    "1226": "@dallasmavs look @DBane0625 !!! you bullied Cuban and the mavs FO",
    "1227": "@dallasmavs What a time for KP to go artic ice cold",
    "1228": "I think I’m a better shooter than half the Mavs roster. Give me a tryout @dallasmavs",
    "1229": "@dallasmavs It really is baffling how these guys can brick so many open 3s",
    "1230": "Fresh out the shower!!!#Netsworld v #DallasMavericks\n#NBA75 #NBATwitter let's go!",
    "1231": "@dallasmavs nets winning this",
    "1232": "Nets should be upset they’re not blowing the Mavericks out. Dallas is not a good team",
    "1233": "Dallas Mavericks be like “our threes aren’t going in and we have 34 seven footers on our team but we will NOT try to score in the paint”",
    "1234": "I’ll say it again. The @dallasmavs miss more open shots than any team in the @nba.",
    "1235": "man Dallas Maverick sucks!",
    "1236": "@dallasmavs @SteveNash @RealJasonKidd All I see are Suns point guards idk what you talking about",
    "1237": "@dallasmavs How was that not a and 1 with Klieber?",
    "1238": "ALERT: New high roller bet posted!\nA bet has been placed for $12,847.22 on Dallas Mavericks - Brooklyn Nets to win $22,482.64.\nTo view this bet or copy it https://t.co/bwj0sv8cA2 https://t.co/dfSKR11cZr",
    "1239": "@dallasmavs Its 88-85 now..\nNets making a comeback..",
    "1240": "Dallas Mavericks - Brooklyn Nets\n\nBet slip link: https://t.co/RVOOMalmpf https://t.co/Eqa2uxfZpv",
    "1241": "Said it already but it bears repeating.  Sean Heath coming back has been the best addition to the @dallasmavs this season.   #PAannouncer",
    "1242": "it would be a shame if @dallasmavs let @BrooklynNets come back from behind.",
    "1243": "JG goin' coast 2 coast https://t.co/b3Idzidstz",
    "1244": "@Manny_III @dallasmavs Because we suck.",
    "1245": "@retiredc_o @dallasmavs @NBA @NFL As soon as I hear them start playing social justice commercials I’m out. Get out of bed with commies then you can complain about our beautiful country.",
    "1246": "@dallasmavs CALL A TIMEOUT!! The spider getting hot in the 4th is the last thing this losing streak needed.",
    "1247": "First time at a game in 2 years and I'm READY!!! 🏀 @dallasmavs https://t.co/o7txdsfLDF",
    "1248": "@MKlebao Aiai Dallas Mavericks Basketball Club...",
    "1249": "@dallasmavs this game is over they have all the momentum",
    "1250": "@qwalterB @cynful103 @cavs @dallasmavs @evanmobley @Mavs @utahjazz Yeah, agree its been good banter. \nAlso will agree to rescind my casual comment.",
    "1251": "Mavericks' Jason Kidd has fond memories of time as Nets coach (New York Post)\n\nDALLAS - No matter how much rancor there might have been when Jason Kidd bolted Brooklyn aft...\n\nAdd your highlights:\nhttps://t.co/0MLdbNDwHs\n #Brooklyn_Nets",
    "1252": "TIMEOUT DALLAS MAVERICKS \n9:32 4Q\n\n#MFFL  88\n#NetsWorld  85",
    "1253": "@dallasmavs Give Josh Green 2 pts on the scoreboard",
    "1254": "From an 11 point game to a 3 point game in a blink of an eye, that's what happens when you start sleeping thinking the job is done, another game sold @dallasmavs",
    "1255": "@FortDietz @dallasmavs @NBA @NFL Have one of my dads buckles 🥰",
    "1256": "Dallas Mavericks! Don’t you do me like this! Don’t you do it!",
    "1257": "10-2 run for the Nets in the 4th? That’s Dallas Mavericks basketball if I’ve ever seen it!",
    "1258": "@dallasmavs @swish41 GOAT 🐐",
    "1259": "@jonyaney @BrooklynNets @Pacers @dallasmavs Im not a mavs fan lol?",
    "1260": "@StarsCountdown @dallasmavs @swish41 Reminded me of the rockets announcer doing the warriors intro",
    "1261": "I am a fan of @dallasmavs just for 2.5 hours. Let's go Mavs! #BullsNation",
    "1262": "AGAINST BROOOOOOKLYNNNNN!!!!  DONT FORFET ABOUT THE MANIACS!!! @BrooklynNets @dallasmavs #MFFL https://t.co/OvXdw9sv9g",
    "1263": "So continuation rules don't apply to the @dallasmavs , got it. #MFFL",
    "1264": "Man @luka7doncic ain’t playing with these boys! #nba #NBATwitterLive #NBA75 #NBATwitter #Dallas #Mavs @dallasmavs",
    "1265": "please don't blow this lead @dallasmavs",
    "1266": "@NBAonTNT @dallasmavs Luka looking thicker than Harden here",
    "1267": "Into the 4th Q. Let's kill this game brother. Please @dallasmavs",
    "1268": "The Throwback Maverick Jerseys are Fun. @dallasmavs",
    "1269": "Nets trail the Mavericks 75-86 heading into the fourth. \n\nHarden stepped it up a bit in the last period, but the team still looks a step behind Dallas. Losing all the 50-50 balls and struggling to get timely stops. \n\nDurant: 13/5/3\nHarden: 17/7/10\nAldridge: 15 PTS, 5 REBS",
    "1270": "@dallasmavs The Board op at tonight’s game is way behind on stats when substitutions are made",
    "1271": "@KafcTg @Plebiathan_Haui @peppersquad @OfficialEvanAZ @dallasmavs @SteveNash @RealJasonKidd He tried it 😭",
    "1272": "@dallasmavs @BallySportsSW @SkinWade @MFollowill any chance you guys know where I can get some tickets to January 5? @swish41 is my all time favorite player. I was not able to make his final game I had to watch at home. Would love to see his retirement ceremony in person",
    "1273": "@dallasmavs @swish41 I prefer his hood name... ghostface drilla!",
    "1274": "@NyyFanSince97 @BrooklynNets @Pacers @dallasmavs Porzingis has so much less value than Mavs fans think he does 😂😂😂",
    "1275": "The only thing preventing 22 year old @dallasmavs superstar Luka Dončić from being an @NBA MVP is his baby 🍼 fat? 😂 @NBAonTNT",
    "1276": "after 3 quarters, your mavericks lead the nets 86-75.  luka leads dallas with 22-points.",
    "1277": "@dallasmavs @swish41 Thank you for not complaining like Doncic every possession. I mean every possession. He just pushed a man outside of play  and is arguing the technical foul. It’s worse than euro soccer players. Unwatchable.",
    "1278": "@dallasmavs @swish41 DIIIIIIIIIIIRK ᴺᵒʷᶦᵗᶻᵏᶦ",
    "1279": "@ @dallasmavs kleber really that much of a bum",
    "1280": "@dallasmavs How is that a foul🤦‍♂️",
    "1281": "@dallasmavs @swish41 My goat 🐐",
    "1282": "@dallasmavs @swish41 The owner of miami in da building!!",
    "1283": "@dallasmavs becomin my fav team right now",
    "1284": "nah fr lmao he was getting happier and happier \n\n“the mavs have lost two in a row overall”\n\n“…the mavericks have lost FOUR of FIVE”\n\n“THE DALLAS MAVERICKS HAVE LOST 7 OF 9”\n\n😭😭😭 https://t.co/S0Ce3T5Z1L",
    "1285": ".@jalenbrunson1 with the crafty finish for the @dallasmavs 🔥\n\nKeep watching the game LIVE on @Vh1India, @VootSelect, and @OfficialJioTV! 📺\n \n#NBATwitter #NBAonVh1 #NBAonVootSelect #NBAonJioTV #NBALiveinIndia https://t.co/1csMRmobWe",
    "1286": "@dallasmavs @swish41 Need to get him in the celebrity game this year just for the one legged fadeaways",
    "1287": "@dallasmavs @swish41 Dirk get your ass out there we got a game to win!!!",
    "1288": "This would be a perfect lead to blow @dallasmavs ☺😉 #MFFL",
    "1289": "Quality post @dallasmavs social media team. Way to do better https://t.co/Hmp6IhYyNO",
    "1290": "@XeinWins @dallasmavs @swish41 And burn your book",
    "1291": "Dirk is in the building! 🙌 #MFFL \n\n(via @dallasmavs)\nhttps://t.co/RjEcKoT3Sq",
    "1292": "is it me. or does Luka act tough like he had a part in EASTERN PROMISES?? \n\n#BKNvsDAL #NBA75 \n@dallasmavs",
    "1293": "No lie this @BrooklynNets @dallasmavs game is wicked rn",
    "1294": "@XeinWins @dallasmavs @swish41 Delete this",
    "1295": "@dallasmavs @swish41 The Goat!!!",
    "1296": "Mavericks (+110) have been pacing the Nets all evening, but we have Brooklyn for a live ML price of +280.\n\nDallas up 80-72 👀 https://t.co/flBVRhxk8A",
    "1297": "@dallasmavs @swish41 Sean heath is exhausting and terrible",
    "1298": "@dallasmavs @swish41 Not a GOAT in my book",
    "1299": "NBA 🏀 Follow live: The Brooklyn Nets take on the Mavericks in Dallas https://t.co/YNujHWuj6t ►  https://t.co/0I4IIflkwI  √ https://t.co/pepOIA2iLW",
    "1300": "@NBA @dallasmavs He’s a hooper.",
    "1301": "THE 🐐 IS HERE!\n\n@swish41 | #MFFL https://t.co/lSyaAKtdzN",
    "1302": "2:27 left in the 3rd quarter!\n\nThe @dallasmavs take control and jump out to a 10-point lead over the @BrooklynNets!\n\nContinue watching the game LIVE on @Vh1India, @VootSelect, and @OfficialJioTV! 📺\n \n#NBATwitter #NBAonVh1 #NBAonVootSelect #NBAonJioTV #NBALiveinIndia https://t.co/GAvAWHkXgh",
    "1303": "@NBA @dallasmavs Get these foul merchants KD and Harden outta here man",
    "1304": "@dallasmavs Congratulations on your huge win against the Nets. You won because of me the Bad Bet Guru. I curse anytime I bet money on. Your GODGOD makes sure the team he bets on loses.\n#Badbetguruhasspoken \n#sportsbets \n#NBA75",
    "1305": "@NBA @dallasmavs underrated.",
    "1306": "Random thought - I really like the socks the @dallasmavs are wearing. \n#MFFL",
    "1307": "I'm probably one of the highest on the TL on both the Brooklyn Nets and Dallas Mavericks.\n\nI guess it could backfire, but I believe in both offenses long-term.",
    "1308": "@NBA @dallasmavs Nets be flopping lmao",
    "1309": "Harden has 12 points on 64 TS% and 50 FG%, 8 assists to 3 turnovers, more points than the KD, but for you 100% the reason the Brooklyn Nets can’t beat the 500. Dallas Mavericks.\n\nShut up\n\n*Data by @eurostepgod https://t.co/BxJU1MHe9X",
    "1310": "@girldadNFT @TopShotGiftGoat @BrooklynNets @dallasmavs @TopShotDadMoves @etchedNFT @TheOfficialHDA There he is! @girldadNFT @TopShotGiftGoat https://t.co/Ao8M9Dzaei",
    "1311": "This Jalen Brunson bucket 👏\n\nThe crafty finish extends the @dallasmavs lead on TNT! https://t.co/DY0m0Gj81g",
    "1312": "Doncic ↗️ Powell = 💣💣💣\n\n📽️ @dallasmavs https://t.co/GiimyAdskt",
    "1313": "Random thought - I really like the socks the @dallasmavs are wearing. \n#MFFL #LetsGoMavs",
    "1314": "@Aqqtic @NBA @dallasmavs JB MY MVP 😍😍😍",
    "1315": "Shoutout to the @dallasmavs organization for awesome tickets for @__KayyBabyyy to celebrate with her aunt &amp; cousin for her mom’s birthday. HBD Helena 🎁 🎂! #GoMavs #MavsVsNets #NBAFamily 🤞🏽 @NBAonTNT https://t.co/21axzMu8uq",
    "1316": "Four Mavs greats in one building tonight: Dirk Nowitzki, Steve Nash, Jason Kidd, &amp; Luka Doncic.\n#MFFL #DallasMavericks",
    "1317": "#BKNvsDAL @dallasmavs leading 71/61. https://t.co/9fLqf48IKK",
    "1318": "Luka ➡️ KP on the inbound 👌\n\nDoncic: 20 PTS, 8 AST, 5 REB\nPorzingis: 15 PTS, 11 REB, 5 AST\n\n@dallasmavs up 12 on TNT. https://t.co/gy0MOEjnMm",
    "1319": "Ayooo @dallasmavs  I’ve been dancing all night in section 307 trying to get on the jumbo screen! Somebody help me out!! 😩",
    "1320": "@mr_polymath @NBA @dallasmavs He's 22 chill he still has a lot of time to get in shape and anyways he always looks better around all star break and is in top shape by the time the playoffs come around.",
    "1321": "I hate that #NBA games have become free throw contests. BORING. On @NBAonTNT Nets @dallasmavs, they actually called it 'good defense' for fouling on a layup attempt.  Take a foul away - 5 for disqual. Pick up the pace!",
    "1322": "@Ljadakiss1976 @dallasmavs They should give me a deal on tix at this point!!! 😂😂",
    "1323": "🚨 UPDATE: Kristaps Porzingis - Dallas Mavericks has a Double Double\n6:19 3rd\n15 PTS\n10 RBD\n5 AST\n1 BK\n1 STL\n[FD(39.5) DK(40.5)]",
    "1324": "@Troy50542659 @NBA @dallasmavs He's potentially all-time great. I hope he puts in that work.",
    "1325": "@DorothyJGentry @AACenter @WNBA @cgray209 @dallasmavs @BrooklynNets Two legends",
    "1326": "@RuthlessEchoz @NBA @dallasmavs I want him to do well, but lbvs l, how many 35 y/o guys his size do you see out there? 0!",
    "1327": "Denied his shit!!! @dallasmavs",
    "1328": "@dallasmavs love you but banks closed bruh",
    "1329": "You NEVER know who’s going to show up to the @AACenter. The one and only @wnba @cgray209 @dallasmavs vs @BrooklynNets #tuesdayvibe https://t.co/HFgn6J3AkU",
    "1330": "Dawg who’s out there hooping in Yeezys 🤣👀 @dallasmavs @BrooklynNets",
    "1331": "@YeoStyles @CFC806Z @NBA @dallasmavs @ReggieMillerTNT Basically called him fat lol",
    "1332": "@mr_polymath @NBA @dallasmavs He doesn't rely on athleticism of anything he's set to have a very long career",
    "1333": "@Koten_MFFL @RealJasonKidd @SteveNash @dallasmavs Do you have any Giannis stuff?",
    "1334": "@mr_polymath @NBA @dallasmavs Then Just imagine , how dominant he’d be if he got in shape and stayed healthy!  Now that would be scary!",
    "1335": "@CryptoClaytana My guy! Cheers dude #DallasMavericks https://t.co/mkGKHOKwV8",
    "1336": "@dallasmavs @ModeloUSA Bullock is so bad",
    "1337": "Trade Reggie Bullock now! #DallasMavericks",
    "1338": "NBA Live Stream\n\nBrooklyn Nets v Dallas Mavericks\nSan Antonio Spurs vs New York Knicks\nLos Angeles Lakers vs Boston Celtics\nFree Streaming link Mavs \n\n....\nWatch Live On 👉 @GoalsTV9",
    "1339": "@dallasmavs Shout out to whoever made the office video",
    "1340": "@TheMartsy_01 @MavsPR @dallasmavs Kiss me where it hurts Martian 👽",
    "1341": "NBA Live Stream\n\nBrooklyn Nets v Dallas Mavericks\nSan Antonio Spurs vs New York Knicks\nLos Angeles Lakers vs Boston Celtics\nFree Streaming link \n\n....\nWatch Live On 👉 @GoalsTV9\nWatch Live On 👉 @GoalsTV9\n\n#NBA",
    "1342": "@dallasmavs KEEP YOU FOOT IN IT!",
    "1343": "Mavs have hilarious timeout videos, can they post them somewhere? @dallasmavs 🥺🙏 I still think about this one vid where KP just goes OFF about aliens",
    "1344": "@dallasmavs PORZINGOD IS BACK BAY BAY!",
    "1345": "@dallasmavs @luka7doncic @gxxrra__ thebest",
    "1346": "@dallasmavs We own nets",
    "1347": "@dallasmavs Keep Frank on James Harden plz",
    "1348": "I love this game.\n@dallasmavs - @BrooklynNets \n#NBA #MFFL https://t.co/h5uVXtkjno",
    "1349": "Dallas Mavericks - Brooklyn Nets\nSan Antonio Spurs - New York Knicks\nLos Angeles Lakers - Boston Celtics\n\nBet slip link: https://t.co/lb5tY8I2ee https://t.co/jqs9QArqx3",
    "1350": "@dallasmavs A block, rebound and assist all in one by KP.",
    "1351": "@dallasmavs GIMME YOUR HALFTIME THOUGHTS BECAUSE IM HAVING A GREAT TIME",
    "1352": "@dallasmavs Finish them",
    "1353": "@NBA @dallasmavs He's overweight and injured. Gonna be a short career.",
    "1354": "@dallasmavs Step back deadly.",
    "1355": "@dallasmavs Will the Mavs hold on to their lead and win?",
    "1356": "@dallasmavs Halftime reactions:\n⁃OH MY KP WITH THE BLOCK AND THE LOB🤩🔥🦄\n⁃THIS WAS THE LUKA AND KP HALF WE NEEDED😤\n⁃We see you @doefinney_10 with 3 1Q 3’s🎯\n⁃7 players over 5 points, a TEAM effort💪\n⁃James Johnson revenge?🙃\n⁃Would this be the best win of the season?🧐",
    "1357": "Foot on the gas ⛽\n\n#Lexus | #MFFL https://t.co/6I84FtIXXp",
    "1358": "@dallasmavs thank you",
    "1359": "@dallasmavs WE MIGHT WIN 😳",
    "1360": "@dallasmavs luka could sense these fools talking smack about his weight",
    "1361": "@dallasmavs A 7'3 point guard cmon!",
    "1362": "@CFC806Z @NBA @dallasmavs @ReggieMillerTNT what did he say?",
    "1363": "Lets Go Mavs !! @dallasmavs",
    "1364": "@dallasmavs @SteveNash @RealJasonKidd Nash then Kidd",
    "1365": "Stepback. Bank. BUZZER ✨\n\nA little Luka Magic to end the half on TNT! \n\n@dallasmavs lead at the break. https://t.co/Wntkl97Tfl",
    "1366": "@NBA @dallasmavs Love watching nets get clapped 😂",
    "1367": "Don’t blow it @dallasmavs",
    "1368": "@NBAonTNT @dallasmavs KD IN THE BUSHING HIS HAIR , HE'S ABOUT TO SHOW OUT",
    "1369": "Luka MAGIC to beat the buzzer ✨\n\n18 PTS - 6 AST - 30.8 FPTS\n\n@dallasmavs lead at half on TNT\n\nhttps://t.co/E33aFJGmHH",
    "1370": "Could’ve Went To School In Dallas &amp; Played For The Mavericks … Instead I Adapted To Essex &amp; Stayed W The Savages 🦅 #MavsGame https://t.co/aGd1mbdId4",
    "1371": "@_Talkin_NBA @NBA @dallasmavs Same. https://t.co/BmkMeR9sT3",
    "1372": "@NBA @dallasmavs what were you saying about Luka ? @ReggieMillerTNT ????? We can’t hear you 😂😂😂😂😂😂😂😂",
    "1373": "@dallasmavs please don’t score.\n\n@BrooklynNets Please score.\n\nThx",
    "1374": "Every single time the Dallas Mavericks play on TNT I gotta listen to Chuck and Shaq bashing Porzingis. It don't matter if he hoopin on having a bad game, they never have anything good to say about my guy KP.",
    "1375": "The NBA's Boy. RT @NBA: Stepback. Bank. BUZZER ✨\n\nA little Luka Magic to end the half on TNT! \n\n@dallasmavs lead at the break. https://t.co/fnRrdhYvbm",
    "1376": "@dallasmavs Luka and KP should play more together",
    "1377": "@Life2Short2Mean @NBAonTNT @dallasmavs After Giannis",
    "1378": "@dallasmavs Nice @kporzee",
    "1379": "@NBAonTNT @dallasmavs I think I speak for everyone when I say the Nets are frauds and first round exits",
    "1380": "@NBA @dallasmavs He didn't know that was going in.",
    "1381": "@luka7doncic went off first half!\n@dallasmavs up by 12 over the @BrooklynNets \n#NBA75",
    "1382": "@NBAonTNT @dallasmavs Nets poverty",
    "1383": "@NBA @dallasmavs Luka just meated them up with a buzzer beater right up in there mouth",
    "1384": "1 - That’s the number of turnovers the @dallasmavs have had in the first half.   Good things happen when you don’t turn the ball over.   #mavs #beatthenets",
    "1385": "Luka Doncic called glass! 📞🪟\n\nHe's got 18 points, and the Mavericks lead the Nets 62-50 at the half.\n\nDallas +1 (1H) 💵\nUnder 113.5 pts (1H) 💵\n\n#NetsWorld | #MFFL \n\nhttps://t.co/8SmyeaP0g9",
    "1386": "Sabonis for KP PLEASE!!!!! @dallasmavs https://t.co/KsVEJjtvuu",
    "1387": "The @dallasmavs take a 62-50 lead into the half 💪 https://t.co/BnvRhJ3J7X",
    "1388": "Love seeing so much confidence from the @dallasmavs. Great first half. #MFFL",
    "1389": "@NBA @dallasmavs It's routine these days",
    "1390": "@NBA @dallasmavs MY MVP",
    "1391": "@NBA @dallasmavs nets washed",
    "1392": "@NBA @dallasmavs WHAT A SHOT 🔥🔥🔥",
    "1393": "@NBA @dallasmavs Overrated so it doesn’t really count",
    "1394": "@NBA @dallasmavs Luka got like 50 of those",
    "1395": "Dallas Mavericks Giving Brooklyn The Business #NBA #TNT",
    "1396": "ALERT: New high roller bet posted!\nA bet has been placed for $6,540.47 on Dallas Mavericks - Brooklyn Nets to win $8,502.62.\nTo view this bet or copy it https://t.co/i0ujCrew54 https://t.co/ot0spTfb6Q",
    "1397": "Stepback. Bank. BUZZER ✨\n\nA little Luka Magic to end the half on TNT! \n\n@dallasmavs lead at the break. https://t.co/PBuPoJWTHJ",
    "1398": "Luka looks good out their @dallasmavs   🏀",
    "1399": "The Maverick’s postgame victory song needs to be “Dicked Down in Dallas”….sorry it HAS TO BE",
    "1400": "Are the 2021-2022 Dallas Mavericks the new 2018-2019(really other years too) Dallas Stars and those years they were really good against the best teams Texas Rangers?",
    "1401": "Dallas Mavericks - Brooklyn Nets\n\nBet slip link: https://t.co/MdiJZbIUea https://t.co/TXENHsmS6K",
    "1402": "@colby_burner @dallasmavs Unless it’s a top pick, Mavs worst team ever at drafting",
    "1403": "@dallasmavs FEAR THE LUKA MAGIC",
    "1404": "NBA Games Today: 🔥🔥🔥\nBrooklyn Nets vs Dallas Mavericks\nNew York Knicks vs San Antonio Spurs\nLos Angeles Lakers vs Boston Celtics",
    "1405": "@dallasmavs goddamn",
    "1406": "Luka Doncic (Dallas Mavericks) with a Last Basket of The Period vs. Brooklyn Nets, 12/07/2021 https://t.co/lWW5jwQh7Y",
    "1407": "Brooklyn Nets @ Dallas Mavericks (7:30 PM ET)\nSelection: Brooklyn Nets -3.5",
    "1408": "@dallasmavs THE BIGGEST FUCKING ONE, THERE ARE STILL PEOPLE WHO SAY THAT JAMES HARDEN IS BETTER \n\nMY DICK FOR JAMES HARDEN",
    "1409": "Nets trail the Mavericks at the break 62-50. \n\nLuka banked in a shot several feet beyond the arc at the buzzer. Dallas looks a million times better than Brooklyn right now in every aspect of the game. \n\nDurant: 8 PTS, 4-8 FGs\nJohnson: 12 PTS, 5-6 FGs\nAldridge: 13 PTS, 6-9 FGs",
    "1410": "Do it again for 2 more quarters, please. @dallasmavs",
    "1411": "@bossmanfat4 @dallasmavs @luka7doncic Bro they’re getting humiliated.",
    "1412": "Doncic with the step-back PLINKO. Dallas lead 62-50 over Brooklyn at the half. The Mavericks were +6 (35-29) in the 2nd Quarter and are currently shooting 50 percent. Doncic with 18 on 7-12. The Nets are shooting 51 percent. Aldridge with 13 on 6-9 for Brooklyn.",
    "1413": "@NBA @dallasmavs Nobody: \nReggie on national TV: https://t.co/BoGfKSMtiN",
    "1414": "@dallasmavs Better than ADavis",
    "1415": "@NBA @dallasmavs Overrated",
    "1416": "@dallasmavs He takes the pain away",
    "1417": "@dallasmavs That made me hard ngl",
    "1418": "@dallasmavs I LOVE HIM",
    "1419": "Do the same thing 2nd half @dallasmavs",
    "1420": "Whoa, watching Luca is so much fun! @NBAonTNT @dallasmavs",
    "1421": "@billboardhoward @dallasmavs Season Ticket Holder??",
    "1422": "@dallasmavs I LOVE THAT MAN ADMIN",
    "1423": "@dallasmavs Ruthless!",
    "1424": "Just Hammered Nets ML @dallasmavs are fraudulent",
    "1425": "@dallasmavs @luka7doncic for threeeeeeeeeeeeeee",
    "1426": "@dallasmavs Yes admin",
    "1427": "Somebody talk to luka at half about that haircut @dallasmavs",
    "1428": "Follow live: The Brooklyn Nets take on the Mavericks in Dallas #TheBasketballFans #NBA https://t.co/bC0Mhz1PPO",
    "1429": "Kristaps gets the block, leads the break and sets up the Hardaway Jr. SLAM 🦄\n\n@dallasmavs lead in Q2 on TNT! https://t.co/FOPO23W38D",
    "1430": "HALF: Nets 50, Mavericks 62\n\nLaMarcus Aldridge (13 PTS), James Johnson (10 PTS, 5 REBS) &amp; the Nets are shooting well at 51%. However, they’re getting exposed in the interior defensively. A lack of pressure overall on that end is making Dallas a little bit too comfortable.",
    "1431": "@leehuiling98 @NBA @dallasmavs Dm this ratio",
    "1432": "DALLAS MAVERICKS 22 NBA CITY EDITION '47 CLEAN UP \n➡️$32⬅️\n\n#MFFL #BKNvsDAL \n\nhttps://t.co/eiEJkos3KW",
    "1433": "Let’s go @dallasmavs 😈😈😈😈 #DaBulls",
    "1434": "@dallasmavs @luka7doncic Luka is putting on weight you can tell in face",
    "1435": "Doncic dimes 👀\n\n12 PTS and 5 AST for Luka as the @dallasmavs lead late in Q2 on TNT. https://t.co/lI1CHa7O5k",
    "1436": "Great play from Dallas at both ends of the floor 🐴 \n\nMavericks (+1.5) looking sharp early 👀 \n\n(via @NBAonTNT)\n https://t.co/4DquqvZUJ9",
    "1437": "THJ finishes the alley-oop!\n\n@T_HardJR | @dallasmavs https://t.co/AjrB6fODGu",
    "1438": "It took me 14-minutes to notice this...\n\n...which makes me think I'm losing my focus.\n\nOr maybe it was the Brooklyn Nets vs. the Dallas Mavericks game?",
    "1439": "@dallasmavs I’m loving the unis!!",
    "1440": "@dallasmavs @AcmeBrick That nearly blew my speakers lol",
    "1441": "@SporTV Dallas Mavericks",
    "1442": "@dallasmavs Give and go,great",
    "1443": "@arinettamb @dallasmavs lol doing good so far lol",
    "1444": "@dallasmavs @AcmeBrick That’s hot",
    "1445": "@dallasmavs @luka7doncic Carried the ball.",
    "1446": "Dallas #Mavericks looking good. Luka &amp; the #Knicks old timers. Definitely getting a contribution from Porzingis, Hardaway Jr., Bullock &amp; Ntilikina.",
    "1447": "The Mavericks lead the Nets 52-44 with 2:10 left in the 2nd Quarter. Doncic with 10 on 4-8 for Dallas. Aldridge with 11 on 5-8 to pace Brooklyn.",
    "1448": "Mavericks lead the Nets 52-44 with 2:10 to play in the first half. \n\nFeels like Brooklyn should be down way more. Dallas is destroying them inside. They haven't turned it over once. James Johnson is the only one who looks like he wants to be on the court right now.",
    "1449": "Run that back 〽️🦄\n\n@AcmeBrick | #MFFL https://t.co/HPyoKHXjGo",
    "1450": "@dallasmavs @luka7doncic &amp; Reggie Miller on the broadcast hating on him smh lol",
    "1451": "@dallasmavs Nice",
    "1452": "3rd game in 5 days!! Shoutout @dallasmavs 🗣🗣!!",
    "1453": "Thank Kevin Harlan @NBAonTNT re: athletic training staff of @dallasmavs. All of us @NATA1950 always appreciate it when all broadcasters get it right. Stay well my friend and hello to @ReggieMillerTNT @TurnerSportsEJ @KennyTheJET_ @SHAQ &amp; Charles 👍🏀",
    "1454": "@ShamsCharania @dallasmavs idc what it takes just get myles turner",
    "1455": "@NBAonTNT show a comparison of how the offense moves for the @dallasmavs when @luka7doncic is out and Kristaps Porzingis is in and vice versa?",
    "1456": "Dallas Mavericks: Follow live: Nets take on the Mavericks in Dallas https://t.co/cCsLthWzo0",
    "1457": "This @dallasmavs @BrooklynNets game is NICE",
    "1458": "Brooklyn Nets vs. Dallas Mavericks: Play-by-play, highlights and reactions https://t.co/XOo5JZQ5TI",
    "1459": "Let’s Go @dallasmavs \nLet’s Go @luka7doncic \n\nDon’t let that Durant flop stop you! Beat the @BrooklynNets \n\n#nbaontnt",
    "1460": "WoW! That was freakin awesome! @dallasmavs @mcuban #MFFl https://t.co/bzsXVNhNVs",
    "1461": "@dallasmavs Had him on skates ⛸",
    "1462": "@kenny_817 @dallasmavs You should’ve stayed at the crib",
    "1463": "Sheeeesh 🤧 https://t.co/TpxgB6XQdZ",
    "1464": "@MikeAScotto @PG_Rated_R @hoopshype @usatodaynba @usatodaysports @Original_Turner @ScottAgness @C2_Cooper @IndyCornrows @INPacerNation @PacersNationCP @AravantinosDA This is the Dallas Mavericks head coach that said low post basketball is dead……Rick Carlisle",
    "1465": "@dallasmavs @AHeinrich12 making sure you see #mffl",
    "1466": "With 5:14 remaining in the half, Dallas leads Brooklyn, 42-37. Seven Mavericks have scored so far.",
    "1467": "The Unicorn earns his name, gets the block, leads the break! 🦄🔥\n\n(🎥: @dallasmavs)\n\n https://t.co/G0qz9DtHRu",
    "1468": "Follow live: The Brooklyn Nets take on the Mavericks in Dallas https://t.co/fxWhwpxWXC #sports #feedly",
    "1469": "Follow live: The Brooklyn Nets take on the Mavericks in Dallas https://t.co/MIjbryaysq https://t.co/KOlLqPMHUS",
    "1470": "\"Hey, Siri, what do Unicorns look like?\" 🦄\n\n(via @dallasmavs)\nhttps://t.co/pEXfhgFofZ",
    "1471": "@dallasmavs @luka7doncic Why so many empty seats.",
    "1472": "@codderrs @dallasmavs Great game so far",
    "1473": "Dawg, calling the Dallas Mavericks the Oak Cliff Knicks is hilarious 😂😂😂",
    "1474": "Welcome back @theseanheath Please don’t ever leave us again.   Chris Arnold couldn’t hold your jock strap while you were gone. @dallasmavs #damngoodPAannouncer",
    "1475": "@NBAIndia @BrooklynNets @dallasmavs @Vh1India @VootSelect @OfficialJioTV Poor quality live streaming, must have a HD Live streaming for better video quality &amp; fun. \nSo sad 😭 in the morning.😖",
    "1476": "@dallasmavs Porzingod game incoming",
    "1477": "@NBA @dallasmavs AWESOME",
    "1478": "KP and Timmy goin' CRAZY 🔥🔥🔥 https://t.co/d3QQeOj131",
    "1479": "@NBA @dallasmavs Harden looking for a foul like always",
    "1480": "ALERT: New high roller bet posted!\nA bet has been placed for $34482.76 on Dallas Mavericks - Brooklyn Nets to win $50,689.66.\nTo view this bet or copy it https://t.co/yJZglLVOUq https://t.co/HWv5Ipc6NJ",
    "1481": "@NBA @dallasmavs Point Porzingis is alive",
    "1482": "@girldadNFT @etchedNFT @TopShotGiftGoat @BrooklynNets @dallasmavs @TopShotDadMoves @TheOfficialHDA Okay I know nothing about basketball but it would mean the world to me to have a HDA NFT…currently watching the game and hoping an Etched shirt/hat will catch my eye!!! 🙏",
    "1483": "@BallySportsSW @luka7doncic @dallasmavs It did and it does",
    "1484": "Kristaps gets the block, leads the break and sets up the Hardaway Jr. SLAM 🦄\n\n@dallasmavs lead in Q2 on TNT! https://t.co/3yI038aYBS",
    "1485": "…watching the Dallas Mavericks https://t.co/5PA3poz6ng",
    "1486": "I cheer for the Dallas Mavericks whenever I can because that's my buddy's team @seanseanclan 🙌🏼",
    "1487": "@mcuban @dallasmavs Oh cool.  One of the like 3 or 4 Mavericks games that people in the north Texas area are allowed to watch this year is on right now.",
    "1488": "ALERT: New high roller bet posted!\nA bet has been placed for $11,500.74 on Dallas Mavericks - Brooklyn Nets to win $18,056.17.\nTo view this bet or copy it https://t.co/DzrI5Qh8ZK https://t.co/wZgzw0fT1M",
    "1489": "Dallas Mavericks - Brooklyn Nets\n\nBet slip link: https://t.co/XnrMOyjfP3 https://t.co/l4crIbiLoC",
    "1490": "@kporzee with the big block on Harden and the alley to THJ, let’s gooo!!! @dallasmavs @MavrelloB @NBA",
    "1491": "hey @dallasmavs can you beat the nets so the @chicagobulls can be 1st in the east pls",
    "1492": "@dallasmavs @thabigtuck @mcuban this is insane https://t.co/FPpXJbD4jb",
    "1493": "@dallasmavs KP is a beast for us rn this is the guy we needed",
    "1494": "KP on the way for a triple double!!!! Let’s go #Mavs @kporzee @dallasmavs #mffl",
    "1495": "Letssssss Goooooooooooooooo @dallasmavs",
    "1496": "The way @dallasmavs just stole the ball 3 times in a row 🥵😮‍💨",
    "1497": "@dallasmavs @luka7doncic KP is better and better 💪",
    "1498": "We turnt right now @dallasmavs",
    "1499": "Dallas Mavericks - Brooklyn Nets\n\nBet slip link: https://t.co/4GdKPzCwMh https://t.co/vbRNVBDWyM",
    "1500": "Someone explain to me this European player fetish the Dallas Mavericks have",
    "1501": "We are so hard to watch @dallasmavs",
    "1502": "Let’s go MAVS!!!! @dallasmavs",
    "1503": "@YouTubeTV Now if only you offer @BallySports so I could watch my @dallasmavs 🙏",
    "1504": "Follow live: The Brooklyn Nets take on the Mavericks in Dallas - #sports #betting #news - https://t.co/FfdZBaA7TD"
}