{
    "0": "@StephCurryArg @nascrap @hornets @CrumblCookies And idk if you watched hornets last year with LaMelo but he started off getting like 10 minutes a game no matter how good he did and he still sometimes will be balling and just get like 25 min. I don’t like the way the coach does the substitutions",
    "1": "@xochurch @nascrap @hornets @CrumblCookies i'm sad",
    "2": "@StephCurryArg @nascrap @hornets @CrumblCookies Bouk just reminds me of graham",
    "3": "@jaynftbeliever @TopShotShamanJ 1. New York Knicks\n2. Charlotte Hornets\n3. Boston Celtics\n4. Chicago Bulls\n5. Memphis Grizzlies\n6. San Antonio Spurs\n7. Phoenix Suns\n8. Utah Jazz\n9. Sacramento Kings",
    "4": "@StephCurryArg @nascrap @hornets @CrumblCookies Ish is just better for the LaMelo led team. He passes and keeps the pace up and sometimes seems like doesn’t even want to shoot and will only look for others. Bouk is rightfully looking for his own success so it’s just a better transition I feel like. It’s like graham last year",
    "5": "RELISTED-2020 Panini Select, Premier Level, Charlotte Hornets, LaMelo Ball 9.5 Graded Rookie Card #AllFly \n\nhttps://t.co/m8lOVCc8K0\n\n@OnReplin",
    "6": "Scary Terry was back in full effect! \n\n@T_Rozzay3 | @hornets | #AllFly https://t.co/FK8XUE4Pyd",
    "7": "@hornets @CrumblCookies Also leave plumlee",
    "8": "@hornets @CrumblCookies Leave hayward and take turner",
    "9": "@hornets @CrumblCookies Easy w @Pacers y’all ain’t ready",
    "10": "What an all around team performance in the win on Monday! \n\n#AllFly | @hornets https://t.co/bzTVkczrO4",
    "11": "\"Doing what he's done all season long.\"\n\n@ashahahmadi and @realdellcurry take a look at the all around numbers of @MELOD1P and some of the elite company that he is a part of! \n\n#AllFly | @hornets https://t.co/tS1y1dOTXB",
    "12": "@SpookyKestrel I too had a Charlotte Hornets jacket. I should have thought ahead and got a much larger size. 😔",
    "13": "This 90s episode of IASIP S15 is so weird and amazing and hits me right in the nostalgia\n\nI had the same Charlotte Hornets jacket as Mac, for the same reason",
    "14": "Last game of 2021!\n\n@hornets on the road to take on the @Pacers! \n\nGet your night started with @ashahahmadi and @realdellcurry right now on Hornets LIVE! Only on @HornetsOnBally! \n\n#AllFly https://t.co/s37NbTsiM7",
    "15": "@StephCurryArg @hornets @CrumblCookies For sure, and thats why I want him in the rotation. Ish is just a better ball handler/distributor than bouk so it makes sense for him to get PG minutes over Bouk.",
    "16": "Detroit Pistons - New York Knicks\nIndiana Pacers - Charlotte Hornets\nBoston Celtics - Los Angeles Clippers\nMemphis Grizzlies - Los Angeles Lakers\n\nBet slip link: https://t.co/RVEcro9aI6 https://t.co/s1XIr0m3mY",
    "17": "@nascrap @hornets @CrumblCookies But seeing Bouk is precious, he has a lot of potential and having a pick 11 on the bench that plays for 3 minutes only hurts me",
    "18": "Currently the Charlotte Hornets have the most points scored as a team.\n#NBATopShotThis  \n\nLink to Top Shot Profile: https://t.co/TXHg5B1mCA\n\nMy Squad @chicagobulls https://t.co/hyVYZiSADX",
    "19": "@hornets @CrumblCookies Will Leo get over 30 minutes tonight or nah?",
    "20": "@hornets @CrumblCookies Get it guys! Do that thing!!! \nBuzz 'em 🐝🐝\n#AllFly",
    "21": "@StephCurryArg @hornets @CrumblCookies I love bouk, but ish has been a spectacular spark off the bench of us. Hopefully we can find a way to just force him into the rotation without taking anyone else out",
    "22": "The Charlotte @hornets \n@nyknicks #NewYorkForever \n\nhttps://t.co/GTo0CY96dP\n\n@jahmin22 @StaffyStephen https://t.co/DDjuf92DbF",
    "23": "@hornets @CrumblCookies give the Ish minutes to Bouknight please, thank you",
    "24": "Tonight's starting lineup for the Charlotte Hornets: Ball, Rozier, Hayward, McDaniels, Plumlee https://t.co/bVWH4AMCA2",
    "25": "@hornets @CrumblCookies Miss u https://t.co/C98DUSIXi8",
    "26": "@NBA @utahjazz All Hornet answers will be accepted as well - Charlotte does lead the league in total points, with 2 more games played.",
    "27": "@hornets @CrumblCookies Let’s hope that game wasn’t a one night wonder for Plumlee.",
    "28": "CHARLOTTE HORNETS VS INDIANA PACERS LAMELO AND ALLSTAR? WATCH LIVE https://t.co/CHox7XyX11 via @YouTube live in #thelithouse Hornets Vs Pacers 🔥 https://t.co/NLz9Nh9KJp",
    "29": "The first on the floor. ⚡️\n\nhttps://t.co/ogyvkEMqyP | @CrumblCookies https://t.co/nOkHE1nkqo",
    "30": "Charlotte Hornets have the most total points.\nUtah Jazz have the most points per game.\nTS: YouAreSignedIn\nhttps://t.co/GutfVIDle2 \n#NBATopShotThis \n@aexdNFT https://t.co/iCSSXqrb2c",
    "31": "#NBATopShotThis \nJazz lead in ppg but @hornets lead in total points!!\nhttps://t.co/41qSQ4UXya https://t.co/SMwb7B1Rer",
    "32": "Charlotte @hornets \n\nhttps://t.co/QvyURfj7Hb\n\n#NBATopShotThis https://t.co/g32wBp7hlt",
    "33": "Charlotte Hornets for total but Utah Jazz in points per game #NBATopShotThis https://t.co/tDdksdwiX3 @nyknicks https://t.co/XyiCz0rmTD",
    "34": "@ratiothen___ @hornets nah they gotta at least seem like they’re trying",
    "35": "Charlotte Hornets\n@cr4stock @gold35rush \n\n#NBATopShotThis  \n\nTS: 13edm\n\nhttps://t.co/5xWT6Ri3wE https://t.co/cbaAqp2Gmn",
    "36": "The Hornets have the most points scored. The Jazz have the most points per game (but have played 2 fewer games than Charlotte).\n\n#NBATopShotThis \n\nhttps://t.co/Aq32AQIlgm\n\n@Lakers https://t.co/eCsRgWz4QY",
    "37": "Charlotte hornets - Ts: nbatopsh0tter and my team @lakers #NBATopShotThis https://t.co/rqV3RlpoQL",
    "38": "EUA - NBA 🇺🇸🏀\n\n📺 Charlotte Hornets x Indiana Pacers\n🏀 Handicap +5.5 - Charlotte Hornets\n⏰ 21:10\n💱 1.620\n💰 Stake 2⃣ https://t.co/7Ft0xtxKfP",
    "39": "Just over 30 minutes till tip off in Indianapolis!\nIndiana native @gordonhayward warming up in the background for the @hornets \n@TBoneWFNZ is anchoring the pregame show right now and I’ll have the call at 7 on @wfnz the Hornets Mobile App and the Hornets Radio Network! https://t.co/m0ehNAGcII",
    "40": "NBA CHARLOTTE HORNETS LARRY JOHNSON JERSEY MINT VTG 90S AUTHENTIC SIZE 44 https://t.co/LQiINjMrvD eBay https://t.co/a14BcosYiS",
    "41": "Let’s Go @hornets @HornetsOnBally !!!! https://t.co/78xYuQOaSV",
    "42": "Look what I found @hornets @HugoTheHornet 👀 https://t.co/S80QAXglkx",
    "43": "INJURY REPORT vs IND\n\nMiles Bridges (H&amp;S Protocols) is out.\nScottie Lewis (H&amp;S Protocols) is out.\nPJ Washington (H&amp;S Protocols) is out.\n\n#AllFly | @NovantHealth https://t.co/SLIiCZO3op",
    "44": "Consensus Line Move:\n2021-12-29 Charlotte Hornets at Indiana Pacers from 227.00 to 225.50\nUnder almost there\n#NBA #sports #statistics #stockmarket",
    "45": "Consensus Line Move:\n2021-12-29 Charlotte Hornets at Indiana Pacers from -3.50 to -2.50\n#AllFly hold the line\n#NBA #vegas #deeplearning #crypto",
    "46": "WEDNE$DAY💥🆓FREEBIES🆓💥\n\n🏒New Jersey/Buffalo Under 6\n🏀Charlotte Hornets +3.5\n🏉Oregon/Oklahoma Over 63\n\nPLZ RT🔃 | LIKE💙 | GL if tailing!🍀\n\n💙🔃💙🔃💙🔃💙🔃💙🔃💙🔃💙\nREST OF 2021 $PECIAL = 19.99\n💙🔃💙🔃💙🔃💙🔃💙🔃💙🔃💙\nhttps://t.co/hzGlwQgRey\n\n#JeetsSheetsCheatSheets ✌️ https://t.co/UvJp2eri6z",
    "47": "Of course it’s over the @hornets https://t.co/KH0NHtXfxu https://t.co/dCl7OmryIZ",
    "48": "Today year's old when my native Chicagoan, basketball crazy @$$ learned #MichaelJordan played 2 seasons w/the #WashingtonWizards. Watching Dec. 29, 2001 game vs. the #CharlotteHornets on @NBATV. I'm not sure if or how I'll be able to carry on, but thank u #NBATV doing God's work. https://t.co/TimF7oYQSu",
    "49": "The Hornets should bring this back @hornets https://t.co/A1TaNo3uix",
    "50": "Indiana Pacers Predictions and Preview for 12/29/2021 hosts Charlotte Hornets.  Find out who we are taking in this matchup. #SportsBetting #NBATwitter https://t.co/5NMWwfCNvZ",
    "51": "🏀 Charlotte Hornets visit the Indiana Pacers\n\nThe Pacers have lost two games to the Hornets already, but @GirlWhoBets sees them playing extra hard and getting that win at home tonight! \n\n#GoldBlooded #SportsPicks https://t.co/bVD6mBwCOF",
    "52": "@hornets The Charlotte Horn3ts https://t.co/DfbQC0UFRn",
    "53": "OTD in 2001, two months shy of his 39th birthday, the GOAT hung 51 on the Charlotte Hornets in a 17-point Wizards win. Two nights later, he dropped 45-10-7-3 on the Nets as the Wizards won by 22. MJ and @JCrossover are the only players in NBA history to score 50+ at age 38+. https://t.co/Dla5y3WXR7",
    "54": "scouts from the Dallas Mavericks, Houston Rockets, Minnesota Timberwolves, Oklahoma City Thunder, Charlotte Hornets, Utah Jazz, Washington Wizards, Toronto Raptors and Atlanta Hawks (2x) are credentialed for Auburn-LSU tonight",
    "55": "@skyl0ve_ january 28 lakers vs charlotte hornets 😭 it was one of his bday gifts.",
    "56": "Looking for a value bet?  See if the Charlotte Hornets-Indiana Pacers Predictions and Preview for 12/29/2021 is one in our preview.  No crazy hype just a prediction and preview. #SportsBetting #NBATwitter https://t.co/5NMWwflcEr",
    "57": "@OmDey11 @EdMiroslav please @EdMiroslav give us the newcastle money i want to lose it on Charlotte Hornets",
    "58": "please @EdMiroslav give us the newcastle money i want to lose it on Charlotte Hornets",
    "59": "Don't forget to check out today's Hornets Hive Cast!\n\n@WillKunkelFOX host of @CSLFOX46 on @FOX46News joins to talk @hornets power rankings and preview tonight's final game of 2021 against Indiana.\n\n#AllFly \n\nhttps://t.co/OqDLGfQBZi",
    "60": "The correct answer is 0! Your Hornets have drained 10+ 3PM in 38 consecutive games dating back to last season, which is the 7th-longest streak in NBA history. 🔥 https://t.co/BzNnw7jIxR",
    "61": "-wearin 17s and smokin charlotte lol... he was prez of basketball ops for the wizards at the time and by looks of it was trying out for hornets front office next https://t.co/50lWpnQVoB",
    "62": "Yooooo my dad just gave me a late Christmas gift OMG #AllFly @hornets 🔥🔥 https://t.co/FcnA7tDnS2",
    "63": "College football, Charlotte Hornets, and #MAFS tonight https://t.co/8fozdlRjlj",
    "64": "The total has gone UNDER in 10 of Charlotte's last 11 games when playing on the road against Indiana.\n\nFind more trends 🔽\n\nhttps://t.co/lskv6zZqas\n\n#NBAPicks #NBA75 #Hornets #Pacers https://t.co/c5g1DvGzVc",
    "65": "Idk why every time I try to say \"Charlotte Hornets,\" I call them dudes the Harlots 😭",
    "66": "Charlotte Hornets vs. Indiana Pacers ‘Best Bet’ https://t.co/5MRmrYxTgs",
    "67": "NBA Betting Picks: Charlotte Hornets vs Indiana Pacers preview, prediction and picks https://t.co/J8IlFB2ug8",
    "68": "#NBA Tips 29/12/21:\n\nNew York Knicks -7.5\nCharlotte Hornets +3.5\nSacramento Kings +2.5",
    "69": "Let’s Go @hornets @HornetsOnBally https://t.co/3JfbGgC2uO",
    "70": "Hornets head to Indy tonight 👀\n\nCharlotte holds the 7 seed in the East by .5 game.\n\n#AllFly #Pacers #SmallMarketInsecurities",
    "71": "@EvanBirchmore @OhmaTokita45 @MeIoWRLD @hornets @socios Being wrong is great sometimes!!! I ain’t mad , thanks for posting the stats!",
    "72": "@ESPNNBA Don’t the @hornets need a hardship exception guy atm. Just for history sake can we see @Jumpman23 lace them up on a 10 day??",
    "73": "Detroit Pistons - New York Knicks\nIndiana Pacers - Charlotte Hornets\nChicago Bulls - Atlanta Hawks\nPhoenix Suns - Oklahoma City Thunder\n\nBet slip link: https://t.co/G8aIgLo8Zg https://t.co/P8i3Dr0CmL",
    "74": "12/29 NBA\n@nyknicks ML\n@hornets +3.5\n@memgrizz ML\n@okcthunder +14.5\n\nWe use @BetMGM for the best odds!",
    "75": "Check out VINTAGE CHARLOTTE BOBCATS HORNETS ADIDAS ADULT ADJUSTABLE CAP NEW WITH TAGS  #adidas https://t.co/24AQ5IN3kT via @eBay",
    "76": "A @hornets fan since 92, from New York so you already know, I had to trash talk with all my Knick fan friends, can I get a follow?",
    "77": "Do the #Hornets need to make a trade in order to win a playoff series?\n\n@rodboone from the @theobserver joined @TheRush730 to discuss their options in addition to Charlotte's improved depth\n\nListen: https://t.co/zl2bMmjE6B https://t.co/7TIrIa1DLI",
    "78": "@BENJAYLATREZ @hornets @T_Rozzay3 @MELOD1P they still haven't done one it lmao there's definitely something fishy going on",
    "79": "@sakatierney45 @mad_ant No at the end of the day I like the Hornets and Panthers because I am from Charlotte I don't care about sports like that. There is so much more important than sports, entertainment and other distractions to keep us focus from what truly going on especially as a Blk person.",
    "80": "📰 Indiana Pacers vs Charlotte Hornets Picks and Predictions Dec 29!\n👉 https://t.co/xnRfrGj2vF @wagertalk",
    "81": "** Reduced: $19.49 - Save $10.50 ** Charlotte Hornets Mitchell &amp; Ness Team Ground Snapback Hat - Teal https://t.co/r74roHGQTW https://t.co/UF01jPW642",
    "82": "@OhmaTokita45 @MeIoWRLD @hornets @socios Nope regular , I’ll find out which game, I remember telling my daughter “that can’t win with only 9 3’s”",
    "83": "@BodogCA @Bucks @Giannis_An34 @JabariDavisNBA @WalderSports @Cavsanada @Hebsyman @AWalksOfficial @gregbradyTO @hoopshype @MELOD1P   and the @hornets coming to the for front when everyone laughed at me when I told them that he would make people take notice in the draft and the card market.",
    "84": "Don't worry Charlotte the Hornets will be playing the Suns on Sunday and that's what I'll be giving my energy to https://t.co/uGht3hqRa8",
    "85": "@antjams @mad_ant That’s not how these teams run their social media accounts. Those people that are hired are hired by the team and usually in close contact with the team or live in the same city. Google search ‘Charlotte Hornets Social media linkedin’",
    "86": "Analyzing Wednesday’s Charlotte Hornets at Indiana Pacers and lines, with NBA expert picks, predictions and best bets.  https://t.co/98AFy6V3QU",
    "87": "Charlotte Hornets at Indiana Pacers odds, picks and prediction https://t.co/4c8Xkz6XDB",
    "88": "On this day in sports history December 29, Washington Wizards Shooting Guard Michael Jordan recorded 51 Points, 7 Rebounds, 4 Assists, and 3 Steals in a 107-90 win against the Charlotte Hornets in 2001.",
    "89": "@LaurynnnG And I already know that you might watch the best team in Charlotte, the Hornets play at 7:00 p.m. on Sunday, right?",
    "90": "Ende #Basketball Herren #NBA \n99:123 HoustonRockets vs #CharlotteHornets \n130:118 #ChicagoBulls vs AtlantaHawks \n103:108 BostonCeltics vs #MinnesotaTimberwolves \n110:104 #UtahJazz vs SanAntonioSpurs \n114:113 #MemphisGrizzlies vs PhoenixSuns",
    "91": ".@hornets HC James Borrego joined @wilson_norfleet to talk about his team ahead of their game tonight against the Pacers. JB talks about his team's defensive effort from the other night, &amp; updates you on the development of James Bouknight &amp; Kai Jones.\n\n🎧: https://t.co/ntP8nEIjIS",
    "92": "Detroit Pistons - New York Knicks\nIndiana Pacers - Charlotte Hornets\nSan Antonio Spurs - Miami Heat\n\nBet slip link: https://t.co/DCZxtVk0bm https://t.co/25ZGmJeslA",
    "93": "@LaurynnnG I for one will not watch the 4:25 game on Sunday Lauryn. I will be enjoying my Sunday at \"The Hive\" watching THE best team in the Carolinas, the Charlotte Hornets.",
    "94": "In the final hour of the show, @hornets HC James Borrego stops by to talk about his team ahead of their game tonight, @NickWilsonSays gets back into the upcoming game on Sunday at New Orleans, &amp; the guys finish up with Watcha Burning On\n\n🎧: https://t.co/2KMmk8SiM3",
    "95": "@ishsmithfan @hornets That should be cheating",
    "96": "GAME DAY. #AllFly @hornets https://t.co/BBndQyqhFM",
    "97": "@johnhollinger Why are the Charlotte Hornets never mentioned in these conversations? City lost the team once and are the only franchise (apart from N.O. which formerly were the Hornets) to never make a conference finals and have been consistently bad (until recently) since 2001",
    "98": "@hornets @socios 0. They’ve made at least 10 in every game (they’ve made exactly 10 in 8 games). https://t.co/87CsSQFdMY",
    "99": "@MeIoWRLD @hornets @socios I remember 1 game was only 9, but I can’t remember who they played 😩",
    "100": "The Charlotte Hornets, I mean Michael Jordan, is planning to sign SG Michael Jordan himself to a 10-day (non-covid related) hardship deal, just to beat LeBron up at the age of 58 and show him who the real goat is, sources tell Picho.",
    "101": "@hornets @socios 0 fashooo",
    "102": "TRIVIA TIME! 📝 How many games this season have the Hornets NOT recorded 10+ 3PM?\n\n#AllFly | @socios",
    "103": "Consensus Line Move:\n2021-12-29 Charlotte Hornets at Indiana Pacers from 227.50 to 226.50\nUnder pushing weight\n#NBA #handicapper #technology #investments",
    "104": "Charlotte Hornets vs Indiana Pacers - NBA League\n📺📱Live Here➠  https://t.co/AEHsUlYCxv\nWednesday, December 29, 2021 @ 7:00 PM",
    "105": "Charlotte Hornets vs Indiana Pacers - NBA League 2021\n📺📱Live Here➠  https://t.co/i1XiewypcM\nWednesday, December 29, 2021 @ 7:00 PM",
    "106": "NBA Betting Preview: Charlotte Hornets vs. Indiana Pacers https://t.co/UQAubgMHKi",
    "107": "@PacersJJ @hornets @Pacers @BallySportsIN So he don't play",
    "108": "Check out 1998-99 Upper Deck Game Dated Glen Rice Charlotte Hornets 16 Basketball  https://t.co/O9SCNaIueE via @eBay",
    "109": "@Ballislife Thank u Mr. Jordan 4 coming back those yrs n making tht shitty franchise relevant. Furthermore giving me the opportunity 2 watch u Live 4 the 1st time n Tha Chi n 01'. Was the best game I've EVER been 2. Thank you 🐐. @Jumpman23 @hornets",
    "110": "@BreakClubNFT @Pacers @hornets  First NBA game in a couple years. Can’t wait.",
    "111": "Check out 1995-96 Upper Deck Building A Winner Rice Divac Charlotte Hornets 138 Basketball  https://t.co/JkVRWGV1Sw via @eBay",
    "112": "I'm not a sports guy, but this gave me pause. It seems like the Charlotte Hornet has more swagger, and the Chicago Bull has more determination. But, who wins? https://t.co/q4r3qHetmZ",
    "113": "Check out 1993-94 Upper Deck NBA Playoffs Larry Johnson Charlotte Hornets 194 Basketball  https://t.co/LSqsLUU3NM via @eBay",
    "114": "Malcolm Brogdon (achilles) is listed as questionable tonight vs @hornets. Jeremy Lamb (wrist) is not on the injury report. This is what Brogdon told us after Monday's practice. @Pacers Pregame coverage 6:30 @BallySportsIN https://t.co/MdSjouSGzT",
    "115": "@hornets @LendingTree Kight as well have been giving him regular minutes so he can keep his stats up with all star game coming soon",
    "116": "The Charlotte Hornets are signing SG @MMonteil11 of the Châteauroux Trashtalkers to a 10-day hardship deal, sources tell ESPN.",
    "117": "The @Pacers are favored by 3 over the @hornets tonight and I’m offended.",
    "118": "Up next, @hornets HC James Borrego joins the show ahead of tonight's contest at the Indiana Pacers \n\n🎧: https://t.co/kTAe4v2y5l",
    "119": "THE CHARLOTTE HORNETS PLAY BASKETBALL TODAY",
    "120": "Charlotte hornets look like a joke rn",
    "121": "@marlonplayzalot @hornets @LendingTree Just One game bro don't jinx it☠️",
    "122": "Has the @hornets played a team hampered by Covid yet???",
    "123": "@hornets @LendingTree You got this guys! #AllFly\nSting 'em! 🐝 Buzzzzz\nAll gas, no brakes! https://t.co/0QdXn3Ol8y",
    "124": "@hornets @LendingTree I hope lamelo plays 30min tonight 💯",
    "125": "Looking for our third win vs IND this season! 😤\n\n#AllFly | @LendingTree https://t.co/sPtLxLDlLf",
    "126": "TIP: Indiana Pacers - Charlotte Hornets, Sabonis 19,5 +, 1.85 by #tipster stefan009 (profit this month: +89.00)\n  #betting #Basketball #Indiana #Pacers #Charlotte #Hornets",
    "127": "20 years ago today, Michael Jordan scored 51 points against the team he now owns, the Charlotte Hornets. \n\nJordan did this on 21/38 (55%) shooting. \n\nThis game was the final 50+ point scoring performance of Jordan’s career.\n\n https://t.co/wsxfO5zmAp",
    "128": "@Nataliew1020 @NHRunningLady @Venmo @hornets If you contact customer service they have ability to do a “one time courtesy” refund. It happened for me but with only a $20 transaction. Can’t hurt to try. I’m sorry this happened.",
    "129": "@visuaIsbyandy @KingJames @carmeloanthony @AhmadMonk @Lakers Carolina Panthers like with Cam Newton and a Charlotte Hornets one too",
    "130": "@rodger Charlotte Hornets fans before Lamelo",
    "131": "The Indiana Pacers host the Charlotte Hornets for their penultimate game of the calendar year. Here are the latest odds, injury report, and predictions.\n\nhttps://t.co/SWZP95udqm",
    "132": "New post (Charlotte Hornets vs Indiana Pacers NBA Pick – December 29) has been published on The Sports Geek - https://t.co/3VF3q8eTmB https://t.co/86DgAJm0xg",
    "133": "@undisputed @RealSkipBayless Why the hell you keep saying \"At Charlotte\" @hornets",
    "134": "On this day in 2001, Michael Jordan scored 51 points in a 107-90 win over the Charlotte Hornets, the final 50-point game of his career and his only 50-pointer with the Wizards",
    "135": "@theScore @NBATV This is why he bought the Charlotte Hornets.",
    "136": "I had 2 throwback Charlotte hornets starter jackets. I kinda want em back 😂",
    "137": "Draft Parker White @hornets https://t.co/iYqxWiSGsD",
    "138": "@MELOD1P see you in Indy tonight! Might be the only hornets fan there🤪🏀 @hornets",
    "139": "You are the Charlotte Hornets on 12/29/2001. Michael drops 51 on your head as a minority owner of the Wizards.",
    "140": "Thank goodness we have the Charlotte Hornets.",
    "141": "I was and STILL am PISSED the @hornets didn't draft him when he was right there in their hands. My brother in law said \"nobody knew he would be that great.\" I told him GODDAMNIT I DID!!  I know greatness when I see it! I reign from Louisville, KY, the home of the GREATEST!! https://t.co/Az4lGvfcN0",
    "142": "Noah’s latest video commentary… proud of him, his passion for basketball and the Charlotte Hornets! \n\nThe GENIUS of the Charlotte Hornets Farm System https://t.co/0FEANCI6hi via @YouTube",
    "143": "@NBAHistory @NBA @WashWizards Jordan OWNS the Charlotte Bobcats/Hornets",
    "144": "Charlotte missed the Hornets. After 17 days away, this is why they’ve excited a city. | The Charlotte Observer https://t.co/KVTalfVtKh",
    "145": "As part of #NBACares #SeasonofGiving @hornets @T_Rozzay3, hosted his annual Merry Terry Christmas. Surprising a family with gifts, giving welcome baskets to Charlotte Family Housing, homework kits to Classroom Central &amp; care packages to Hemby children's Hospital. https://t.co/73CBTZJbAi",
    "146": "Consensus Line Move:\n2021-12-29 Charlotte Hornets at Indiana Pacers from 228.50 to 227.00\nUnder market flood\n#NBA #bettingpicks #machinelearning #wallstreet",
    "147": "@NBAHistory @WashWizards owner of Charlotte Hornets for 20 years",
    "148": "/r/CharlotteHornets: Covid question? #AllFly https://t.co/fCUQGxYBdp",
    "149": "@HatClub Plan a trip I’ll show you around the great city catch a hornets or knights game plan a possible store down here Charlotte has a great fitted community",
    "150": "NBA Betting Picks: Charlotte Hornets vs Indiana Pacers preview, prediction and picks https://t.co/uB8JK066Ca",
    "151": "@WashedJaden @hornets Follow me back then bro",
    "152": "@WashedJaden @hornets Why are you begging for followers here?",
    "153": "Last game of the year — LET'S GO! 🕺 \n\n#AllFly https://t.co/eLxx7ne0cX",
    "154": "Because when you're the goat it doesn't matter. He said he wasn't going to play any more of the Charlotte Hornets we're talkin trash during the lead-up thank you should just retire blah blah blah. That's what happens when you poke the bear https://t.co/Szw3oZI4Xi",
    "155": "Hornets are playing the 14-20 Pacers tonight in Indiana. \n\nPacers are favored by 3, Hornets are going to be without both Miles Bridges and PJ Washington. \n\nThis is Charlotte’s final game of 2021.",
    "156": "When the fans have to do most of the promotion for all star for a player that’s wrong idc what anyone says and the fact I watch charlotte fans have to fight to defend the organization and say stuff like “regardless I’m a hornets fan” is sad the org works for you not the other way",
    "157": "Hey @hornets fans! Let’s show our team’s social media person how to “properly” promote our star PG ⁦@MELOD1P⁩ for #NBAAllstar #PutSomeRespectOnHisName #allfly https://t.co/F4kBzldsFP",
    "158": "I still wanna know who’s idea it was for Charlotte to change the Hornets name to the Bobcats🤣😂 they should be banned from the state.",
    "159": "Revenge Game: Jeremy Lamb plays Charlotte tonight.  He played 287 games in his career for the Hornets.",
    "160": "@hornets @MELOD1P # NBA all star",
    "161": "Statement Edition concept for @hornets. Boldly reenergizing the Association/Icon template with a vibrant salute to the franchise's iconic multi-colors pinstriping. #AllFly #BuzzCity #Charlotte #Hornets #CLT #NC #NBA #NBA75 #NBATwitter #NBATwitterLive #Jordan #AirJordan @MELOD1P https://t.co/lLmMPEy3vu",
    "162": "#LaMeloBall #NBAAllStar Lamelo should be an easy vote! Best PG in the #EasternConference #NBA @hornets",
    "163": "First game post-Wanamaker era.\n\n🆚️ Charlotte Hornets\n🕛 Midnight\n\n#Pacers #GoldBlooded https://t.co/AqcmScpZhC",
    "164": "@hornets @masonplumlee I’m sorry but ur serious 🤣🤣",
    "165": "#MilesBridges deserves to be an All Star! #NBAAllStar \n@hornets",
    "166": "@PickDawgz 564 CFB Oregon Ducks vs Oklahoma Sooners [O 60 ]\nNBA Charlotte Hornets vs Indiana Pacers O 228.5 \nNBA Memphis Grizzlies vs LaL Lakers [Mem -6]",
    "167": "Today on the Hornets Hive Cast:\n\nWe preview tonight's @hornets game against the Pacers and talk about the late great John Madden with @WillKunkelFOX . Podcast host, @FOX46News sports anchor and host of @CSLFOX46 \n\nhttps://t.co/OqDLGfQBZi",
    "168": "@NBA @hornets He carried",
    "169": "On this day in 2019, the Grizzlies beat the Charlotte Hornets 117-104.\n\n(@jarenjacksonjr - 14 PTS, 12 REB, 2 BLK\n@brandonclarke23 - 18 PTS, 5 REB, 3 BLK) https://t.co/00LJCXy5iu",
    "170": "Coming up on today's show:\n\n10:00 - Panthers/Saints Scene Set\n\n10:40 - @Sapakoff \n\n11:00 - Honoring John Madden\n\n11:40 - Charming or Chach\n\n12:00 - @JasonLaCanfora \n\n12:40 - Run Down\n\n1:00 - @hornets HC James Borrego\n\n1:40 - Watcha Burning On\n\n🎧: https://t.co/kTAe4v2y5l https://t.co/dmV5BJXCvK",
    "171": ".@nbatopshot strategy for 2022 - full sets where I can, continue to increase my @hornets CS (currently ranked 3!) - stacking $5/$6 S2 Hornet commons (36 CS per momie!), queue for all pack drops, be ready for flash challenges by owning cheapest moment of most players.",
    "172": "Consensus Line Move:\n2021-12-29 Charlotte Hornets at Indiana Pacers from 227.50 to 228.50\nOver undervalued\n#NBA #bettingonline #datascientist #investing",
    "173": "Keyshawn Strachan from athletics prevailed with 26 points, Charlotte Hornets rookie forward Kai Jones finished second with 25 points and Izaak Bastian rounded out the top three with 24 points. https://t.co/2IbYmQ7QJ0",
    "174": "@DavidKyle @HornetsOnBally @hornets @nbatopshot @roham *Also I wish I just saw that while watching live; would’ve gotten so fired up.",
    "175": "@DavidKyle @HornetsOnBally @hornets @nbatopshot @roham 🙌The OG #NLL jersey! ❤️",
    "176": "Proof that MJ owns the #Hornets. #AllFly #BuzzCity #Jumpman23 #Charlotte #NBA75 https://t.co/fW5XK4tvQu",
    "177": "The Charlotte Hornets visit the Indiana Pacers tonight for their final game of 2021. \n\nPJ Washington and Miles Bridges remain OUT for Charlotte. \n\nTJ McConnell and TJ Warren remain OUT for Indiana. \n\nMalcolm Brogdon is listed as day-to-day with achilles soreness. \n\n#allfly https://t.co/BqAGCpPNFq",
    "178": "@chancegambles Would much rather take all that money and bet it on the Charlotte Hornets and Memphis Grizzlies tonight...",
    "179": "The @hornets, @Lowes. and CrossRoads Corporation recently unveiled renovations to the Grier Heights Community Center (GHCC) as part of the Hornets Legacy Project Powered by Lowe’s: https://t.co/etCqIOYo1O",
    "180": "2020/21 Panini NBA Hoops Lamelo Ball Rookie Card #223 Charlotte Hornets STAR RC! #thehobby #whodoyoucollect https://t.co/BhLWOtdliB",
    "181": "2020 Lamelo Ball RC Rookie Card! #2 -  Charlotte Hornets - Mint Condition! #thehobby #whodoyoucollect https://t.co/VVfIX8fqMg",
    "182": "2020-21 NBA Hoops LaMelo Ball RC Base Card #223 Charlotte Hornets Rookie #thehobby #whodoyoucollect https://t.co/dEQvJsOWp7",
    "183": "@hornets @masonplumlee hahahahahahaha",
    "184": "Congratulations to danthaman1 who moved up 225 spots to take #165 on the Charlotte Hornets team leaderboard.\n\nhttps://t.co/dYEEwV7pFm",
    "185": "/r/CharlotteHornets: Charlotte Hornets @ Indiana Pacers [12/29/21 - 7:00 PM ET] #AllFly https://t.co/AcIuWXGKqN",
    "186": "Indiana Pacers vs. Charlotte Hornets\n NBA LIVE \n📲 :  https://t.co/CMIJDhy490\nToday @ 7:00 pm EST\nFree For Subscription",
    "187": "@SeanWillis44 @NBAUK To make things a little easier pick a team in the East Coast. Games are on a more reasonable time so more chance of watching them live on Sky. I watched a few games and went with Charlotte Hornets, purely for their style of play and jersey",
    "188": "@NBA @hornets Nice moves",
    "189": "Charlotte Hornets vs. Indiana Pacers- 12/29/2021 Free Pick &amp; NBA Betting Prediction https://t.co/MGBJ3gLxaB\n.\n#Betting #FreePicks https://t.co/q0T9bNcjUX",
    "190": "Congratulations to Kcjay3000 who moved up 66 spots to take #320 on the Charlotte Hornets team leaderboard.\n\nhttps://t.co/dYEEwV7pFm",
    "191": "@hornets @masonplumlee Pls stop",
    "192": "Detroit Pistons - New York Knicks\nIndiana Pacers - Charlotte Hornets\nMemphis Grizzlies - Los Angeles Lakers\nChicago Bulls - Atlanta Hawks\nSan Antonio Spurs - Miami Heat\nPortland Trail Blazers - Utah Jazz\n\nBet slip link: https://t.co/ss86CSZXSX https://t.co/YppujqMHYn",
    "193": "Congratulations to BigRigballin22 who moved up 153 spots to take #159 on the Charlotte Hornets team leaderboard.\n\nhttps://t.co/dYEEwV7pFm",
    "194": "Thought it was interesting that DEN coaching staff showed some film from a Charlotte game (I assume Hornets/Warriors from November which was a close game?) to prep for the final GSW possession. \n\nAnyone have any insight? https://t.co/nQRhSWXsPs",
    "195": "Congratulations to mattyice14 who moved up 210 spots to take #136 on the Charlotte Hornets team leaderboard.\n\nhttps://t.co/dYEEwV7pFm",
    "196": "Congratulations to susmad who moved up 154 spots to take #457 on the Charlotte Hornets team leaderboard.\n\nhttps://t.co/dYEEwV7pFm",
    "197": "Congratulations to Sir_this_is_a_Wendys who moved up 52 spots to take #265 on the Charlotte Hornets team leaderboard.\n\nhttps://t.co/dYEEwV7pFm",
    "198": "Congratulations to trifling_moorhead who moved up 228 spots to take #184 on the Charlotte Hornets team leaderboard.\n\nhttps://t.co/dYEEwV7pFm",
    "199": "Congratulations to burima who moved up 169 spots to take #54 on the Charlotte Hornets team leaderboard.\n\nhttps://t.co/dYEEwV7pFm",
    "200": "THT would be great on the Hornets I think they should swap Miles Bridges for a possible game changer please consider it @hornets",
    "201": "@hornets @masonplumlee Melo come to Bulls with your brother",
    "202": "New Charlotte Hornets Nike 2021/22 City Edition Essential Logo Pullover Hoodie https://t.co/AaLAWhcTtd eBay https://t.co/mOmWUdye0U",
    "203": "@hornets @masonplumlee HAHAHA You cant make this shit up man. This team dont deserve nothin. 😂😂😂😂😂😂😂",
    "204": "@hornets @masonplumlee Maybe he is turning a corner .  I hope he does Richard’s still not ready",
    "205": "@hornets @masonplumlee You trolling your own fans? Wtf is going on here in Charlotte???? https://t.co/7MM8QKF8Sg",
    "206": "@LakersReporter They beat the @HoustonRockets who lost by 24 last night to then @hornets \n\n\"Big Deal\"",
    "207": "\"Kings fan here. After watching a replay of last noght’s Game, I have even more respect …\"\n\nhttps://t.co/1LtTYMWvGm\n\n[via r/charlottehornets Dec 29, 2018 #Hornets]",
    "208": "@DavidKyle @HornetsOnBally @hornets @nbatopshot @roham NLL going Hollywood!",
    "209": "@chrismhunt @Boosh_TK @HornetsOnBally @hornets @nbatopshot @roham Got #1 last night!  https://t.co/AGNnI4kV1r",
    "210": "@hornets @masonplumlee WHAT?? 🤣😂 HELL NO !! https://t.co/zUN1qGRqiK",
    "211": "@hornets @masonplumlee Excuse me???",
    "212": "@chrismhunt @DavidKyle @HornetsOnBally @hornets @nbatopshot @roham Boommmmmm https://t.co/we6v1OETIN",
    "213": "@Boosh_TK @DavidKyle @HornetsOnBally @hornets @nbatopshot @roham Was there last night. No wonder those hornets nfts sold out so quick",
    "214": "@hornets @masonplumlee 😭😭 yall posted about plumlee for all star before your franchise player ain’t no way 💀",
    "215": "Check out LaMelo Ball 2020-21 Panini Chronicles Prestige Rookie Charlotte Hornets RC https://t.co/qJE0MJuNPb @eBay",
    "216": "Check out LaMelo Ball RC 2020-21 Panini Chronicles Classics Base Charlotte Hornets Rookie https://t.co/H46pMcbpI0 @eBay",
    "217": "@DavidKyle @HornetsOnBally @hornets @nbatopshot @roham Too much sauce",
    "218": "@hornets @masonplumlee there should be 0 retweets",
    "219": "@hornets @masonplumlee All star for one good game lmao",
    "220": "The Charlotte Hornets https://t.co/O7t7advHx8",
    "221": "@hornets sign this man! https://t.co/ABb1IVsxr7",
    "222": "@hornets @masonplumlee Now ... can we turn a page, and play like this EVERY night ??!",
    "223": "Thanks for taking a picture with my 12 year old son!  The hotel manager came to us shortly after and told him he wasn’t allowed to approach players.  We didn’t know that.  @hornets is his favorite team!  Sorry 😬 Thanks again @gordonhayward https://t.co/LKfNXetFX8",
    "224": "Hornets fans: \n\nWith Russell Westbrook’s struggles so far with the Lakers, don’t forget that the Hornets were rumored to be a trade suitor for Westbrook.\n\nThe rumors were put to rest when LaMelo Ball was available for Charlotte to take with the 3rd pick in the draft. https://t.co/vwnLnptn2P",
    "225": "Wes Bryant (@WesGotRange) joined @KyleBaileyClub today on the @ClubhouseKB as he recapped the @hornets dominating win over the @HoustonRockets, and Wes looks at how he thinks James Borrego has really embraced the challenges of the last month.\n\nListen Here: https://t.co/Mo6jm7HDtX",
    "226": "@hornets @masonplumlee How are you posting about everyone but YOUR TWO ALL STAR CANDIDATES YOU ARE NOT SEEING HEAVEN",
    "227": "@hornets @buzz_szn @masonplumlee LMFAO 😭",
    "228": "@hornets @masonplumlee @MELOD1P look what ur team is doing to you 😂😂😂",
    "229": "@hornets @masonplumlee Yes, he had a good game but there’s no chance in hell he’s an all star.",
    "230": "GSN-Not only did Houston Rockets center Christian Wood commit a turnover against the Hornets in Charlotte Monday night, he unwittingly committed assault on a Hornets fan in the process.\nhttps://t.co/VXjMBCwZVL",
    "231": "@hornets @masonplumlee White Shaq 🙏",
    "232": "@hornets @masonplumlee Y’all not seeing heaven https://t.co/T8S1OwGcM8",
    "233": "@hornets @masonplumlee Yall are trolling",
    "234": "@hornets @masonplumlee This is a joke right?",
    "235": "@hornets Nah y’all set him up with this 😭",
    "236": "@hornets @masonplumlee THERES NO WAY YALL ARENT DOING THIS ON PURPOSE",
    "237": "@hornets @masonplumlee Was this tweet really necessary?",
    "238": "@hornets @masonplumlee Massive troll",
    "239": "@hornets @masonplumlee gotta retweet my goat 🙏🏾",
    "240": "@hornets @masonplumlee Hell nah😂😂😂post miles bridges for the all star team",
    "241": "@hornets @masonplumlee No mc fucking way",
    "242": ".@masonplumlee got it done on both ends of the court last night! 👊\n\n✅ 15 pts\n✅ 9 reb\n✅ 3 blk \n✅ 3 ast\n✅ 2 stl\n✅ 7-for-7 FG\n\nRT &amp; Vote for Mason! #NBAAllStar ⭐️\n\n#AllFly https://t.co/MQ9rSOq8VH",
    "243": "@On3Recruits @THEUNCFAMILY He'll/they'll graduate as 3 or 4 star players....3rd-6th round draft choices or worse.  Work your magic Mack in front of 32,000 fans that don't give a crap about football.  Support the Charlotte Hornets and the worst ownership in professional sports!",
    "244": "#youtube James Borrego REACTS to Charlotte Hornets DEFEATING Houston Rockets in front of Michael Jordan https://t.co/5wM6aNrCAh",
    "245": "The short-handed Rockets were missing six rotation players on Monday in Charlotte, but young prospects Trevelin Queen and Daishen Nix were bright spots in a loss to Terry Rozier and the Hornets.  https://t.co/41Ka0HCLnz",
    "246": "@Timberwolves @theantedwards_ @hornets real teams make individual posts for their all stars.",
    "247": "@hornets @KELLYOUBREJR @Kia You really think oubre  is gonna be the all star of this team? https://t.co/9vCgnhDZhU",
    "248": "@hornets @KELLYOUBREJR @Kia u gonna make posts for our actual all stars or not https://t.co/pEM7tJEGPP",
    "249": "@KeepItCanadiann @hornets @MELOD1P We bought tix for the bobblehead night.",
    "250": "@hornets @MELOD1P We were there last night FOR A BOBBLEHEAD! NO bobblehead.  Kids are sad.",
    "251": "@hornets @KELLYOUBREJR @Kia what in the hell?",
    "252": "@SamFarberLive @Rob_Longo @hornets First pod of the day!!!",
    "253": "@hornets @KELLYOUBREJR @Kia Nah that’s actually crazy promoting a bench player at an allstar and your franchise player can’t even get a post, how cheap as an organization can you be😂",
    "254": "Our @ShamsCharania sat down with @hornets' LaMelo Ball. #AllFly https://t.co/VK2qtoPMW1"
}