{
    "0": "The #IndianaPacers are trading SG/SF Caris LaVert to the Cleveland #Cavaliers for Point guard Ricky Rubio, a lottery protected first round pick and two second-round picks, per @wojespn &amp; @espn. \n\n#NBATwitter #nbatrade #clevelandcavaliers #Pacers",
    "1": "Sources - Cleveland Cavaliers acquire Caris LeVert in trade with Indiana Pacers https://t.co/TKwxatOlTA",
    "2": "Cleveland Cavaliers acquire Caris LeVert in trade with Indiana Pacers https://t.co/5Q9YFJYY8e",
    "3": "Cleveland Cavaliers - Indiana Pacers\nOrlando Magic - Boston Celtics\nDallas Mavericks - Atlanta Hawks\nHouston Rockets - New Orleans Pelicans\nLos Angeles Clippers - Milwaukee Bucks\n\nBet slip link: https://t.co/OCGaoNWiz4 https://t.co/dCS7dDrd3S",
    "4": "\"[Indiana] Pacers coach Rick Carlisle informed [Caris] LeVert in the late afternoon that the trade was happening.\" (via @wojespn) https://t.co/0EvManKwFk",
    "5": "@DPGSpurs @1Tavarius @poundingtherock @EricSal_7 @thehalestone @bouncepassos @CT24305 @TrevorWrites @JeffGSpursZone @SiriusXMNBA @spurs @ChrisRobertsNBA @RealQuintonMayo The Washington Wizards have zeroed in on Indiana Pacers 2x All-Star Domantas Sabonis. Washington recently submitted an offer for the 25-year-old and are waiting to hear back, per source.\n\nThe trade deadline is four days away.",
    "6": "NBA Trade Deadline: Caris LeVert joining Cleveland Cavaliers from Indiana Pacers | NBA News https://t.co/q9tFRtNfSi",
    "7": "Cleveland Cavaliers acquire Caris LeVert in trade with Indiana Pacers https://t.co/WEycGwcuRm",
    "8": "Tonight's starting lineup for the Indiana Pacers: Sykes, Duarte, Holiday, Craig, Sabonis https://t.co/bVWH4AMCA2",
    "9": "The Indiana #Pacers have traded Caris LeVert to the Cleveland Cavaliers for Ricky Rubio and a handful of picks. A look at the trade and impacts to the Pacers’ season:\nhttps://t.co/xvOkPx2GHe",
    "10": "Breakdown of the @cavs trade with the Indiana @Pacers that brings Caris LeVert to the Cavaliers. https://t.co/3lUkJLWQL8",
    "11": "I would like to officially welcome myself upon to the @Pacers bandwagon.  May GOD help me and Ricky Rubio. #Indiana #Pacers https://t.co/qqwzqfAOov",
    "12": "Cleveland Cavaliers trade for Indiana Pacers wing Caris LeVert, per report – NBA News https://t.co/Nk6DMtn2HQ",
    "13": "The Washington Wizards have zeroed in on Indiana Pacers 2x All-Star Domantas Sabonis. Washington recently submitted an offer for the 25-year-old and are waiting to hear back, per source.\n\nThe trade deadline is four days away.\n\nI reported Washington’s deadline approach in January: https://t.co/YFB1nbGvYy",
    "14": "3 more Indiana Pacers trade scenarios ahead of NBA trade deadline – NBA News https://t.co/WprA6HNauJ",
    "15": "Cleveland Cavaliers trade for Indiana Pacers wing Caris LeVert, per report – https://t.co/JMej0jYoB8",
    "16": "@PatMcAfeeShow in today’s Indiana Pacers news… Game in Cleveland tonight at oh ya know - 6pm. Just getting reported Caris Levert of the Cer’s has been traded to the Cavs LMFAO",
    "17": "The Cavs (-6) are favorites against the Indiana Pacers.\n\nCaris LaVert in town 👀 \nhttps://t.co/7znvBDnyvN",
    "18": "NEW: The Indiana #Pacers have traded Caris LeVert to the Cleveland Cavaliers, who they play tonight. A look at the trade and my initial thoughts to the news:\nhttps://t.co/1WgUVlPUym",
    "19": "The Indiana Pacers are hard set on going into a rebuild and the Washington Wizards are keen on improving their roster in hopes of convincing Bradley Beal to stay in Washington. It is widely believed that Jayson Tatum has been recruiting his friend hard in the past year. https://t.co/523RjsnWPE",
    "20": "The Los Angeles Lakers are in discussions with the Indiana Pacers to aquire Jeremy Lamb at the trade deadline, Talen Hourton-Tucker are in the talks and a future first round pick, tells @TheAtlEducation",
    "21": "Today's NBA Picks: 6:10 PM ET - Indiana Pacers vs. Cleveland Cavaliers - 27 PICKS AVAILABLE: https://t.co/1ArENZ39uD #nba",
    "22": "Sources: The Indiana Pacers have made significant progress in trade talks involving Myles Turner and Domantas Sabonis. The Knicks, Spurs, Kings, Mavericks, and Pistons have been aggressive in their approach. However, the team that has been most truculent are the Wizards.",
    "23": "Reports: Cleveland Cavaliers will send Ricky Rubio, draft picks to Indiana Pacers for Caris LeVert https://t.co/BYZ9VZq1W6",
    "24": "Cavaliers GM Koby Altman made another move to try to keep Cleveland among the top six in the Eastern Conference before Sunday’s home game against the Indiana Pacers. https://t.co/W5tVOyNzJ6",
    "25": "Ricky Rubio to Indiana Pacers. I feel sorry for him. He deserves a good team.",
    "26": "🏀 | 𝙁𝙄𝙈 𝘿𝙊 𝙌𝟯:\n\nChicago Bulls - 81\nIndiana Pacers - 89\n\n#BullsNation",
    "27": "🏀 Ricky Rubio, traspassat als Indiana Pacers\n\n✍️ @AlexGozalbo_ https://t.co/kT36rlJgyD",
    "28": "3 more Indiana Pacers trade scenarios ahead of NBA trade deadline https://t.co/riyX4jCGq0 #NBA #IndianaPacers",
    "29": "Cleveland Cavaliers vs. Indiana Pacers gamethread https://t.co/iZhVKIIhZ7 https://t.co/HGqQlJF4YY",
    "30": "Cleveland Cavaliers Reportedly Aquire Caris LeVert from the Indiana Pacers\nhttps://t.co/BEzh1FiYTY",
    "31": "Report: Caris LeVert Traded to Cavaliers from Pacers for Ricky Rubio, Draft Picks: The Indiana Pacers are trading shooting guard Caris LeVert to the Cleveland Cavaliers, Adrian... https://t.co/qzRpjaWmu9 #BNTNBA #ClevelandCavaliers #IndianaPacers #NBA",
    "32": "#Cavs point guard Darius Garland remains out tonight against the Indiana Pacers due to his ongoing back issues.",
    "33": "The Indiana Pacers will receive. #Cavaliers #Pacers \n \nRicky Rubio\nLottery-protected 2022 pick\nFirst -round pick\nTwo second round picks",
    "34": "Caris LeVert with the Indiana Pacers #Indiana #Pacers #NBA https://t.co/fmKfNgoesh",
    "35": "Trade number one is the first trade made by the Indiana Pacers, and it is the trade they made before any other trades.",
    "36": "JUST IN: #Cavs acquire Caris LeVert from Indiana Pacers, according to reports https://t.co/ght9N5tEit",
    "37": "The #Cavs have agreed to acquire Indiana Pacers swingman Caris LeVert in exchange for Ricky Rubio, Cleveland’s lottery-protected 2022 first-round pick, and a pair of second-rounders, sources tell https://t.co/Hu25cO2vcT. https://t.co/4xJyWIkTMD",
    "38": "🚨 Line Change 🚨\n\nIndiana Pacers @ Cleveland Cavaliers\nSun 6:10 PM EST\n\nFrom:\nCLE -5.5 -110\n\nTo:\nCLE -6.5 -110",
    "39": "The Cavs have agreed to acquire Indiana Pacers swingman Caris LeVert in exchange for Ricky Rubio, Cleveland’s lottery-protected 2022 first-round pick, and a pair of second-rounders, sources tell https://t.co/a4YA4W2Cro. https://t.co/eRhePyaubi",
    "40": "TRADE ALERT 🚨:\nCavs trade Ricky Rubio, a 2022 protected lottery first round pick, a 2022 second round pick via Houston, and a 2027 second round pick from Utah for Caris LeVert and a 2022 second round pick via Miami from the Indiana Pacers. Welcome to Cleveland @CarisLeVert!",
    "41": "THE INDIANA PACERS TRADE CARIS LEVERT TO THE CLEVELAND CAVALIERS FOR RIC... https://t.co/s451Mhtade via @YouTube",
    "42": "Consensus Line Move:\n2022-02-06 Indiana Pacers at Cleveland Cavaliers from 216.50 to 215.50\nUnder sharps say\n#NBA #bettingadvice #artificialintelligence #realestate",
    "43": "Consensus Line Move:\n2022-02-06 Indiana Pacers at Cleveland Cavaliers from -5.50 to -6.50\n#LetEmKnow squares...?\n#NBA #NBATwitter #datascience #forex",
    "44": "The Cleveland Cavaliers have acquired Caris LeVert from the Indiana Pacers in exchange for Ricky Rubio, a 2022 second-round pick from Miami, a lottery-protected 2022 first-round pick, a 2022 second-round pick from Houston and a 2027 second-round pick from Utah, per @wojespn.",
    "45": "TIP: Cleveland Cavaliers - Indiana Pacers, I.Okoro 10,5 - , 1.85 by #tipster drose25 (profit this month: +90.88)\n  #betting #Basketball #Cleveland #Cavaliers #Indiana #Pacers",
    "46": "That Caris LeVert trade is such an Indiana Pacers move.",
    "47": "The Indiana Pacers NBA Basketball Organization is a poverty Franchise and I will perish before they ever win a championship https://t.co/RDOdGLT5F1",
    "48": "#Cavs to acquire Caris LeVert from Indiana Pacers \n\nhttps://t.co/7b0Q7KOIJ7",
    "49": "Sources: Cleveland Cavaliers acquire Caris LeVert in trade with Indiana Pacers https://t.co/cX7lrddIoS",
    "50": "Cavs have acquired G Caris Levert from the Indiana Pacers.  Pacers Coach Rick Carlisle says deal is being finalized.\nCavs host Pacers 6pm.                       @wtam1100",
    "51": "The Cleveland #Cavaliers are acquiring guard  #CarisLeVert in a trade with the Indiana #Pacers, sources tell ESPN's Adrian Wojnarowski. 🏀 #NBATwitter #NBA  #2022NBATradeDeadline https://t.co/K0HkF2EAri",
    "52": "Caris LeVert traded to the Cleveland Cavaliers from the Indiana Pacers https://t.co/6tcvp1Rclv #NBA #ClevelandCavaliers #IndianaPacers",
    "53": "As always, NTC has the quickest cap sheet updates in the business.\n\nIndiana Pacers with R. Rubio:\nhttps://t.co/ho2LTwPVqa\n\nCleveland Cavaliers with C. LeVert:\nhttps://t.co/pocwdrs1o0 https://t.co/2iM8Pcquwq",
    "54": "Nice to see the indiana pacers can rebuild just fine. The Washington wizards on the other hand…",
    "55": "The Indiana Pacers are blowing it up",
    "56": "Love the Draft picks for Indiana Pacers. Love Caris LeVert for the Cavs. It’s a win win",
    "57": "So it seems that Indiana Pacers are sellers at this trade deadline, rebuilding by trading valuable pieces (Lavert) for ending contracts (Rubio's contract in this case) and getting draft picks. #NBAfi But a great trade by Cleveland! Happy that Lavert is a Cavalier",
    "58": "NBA TRADE ALERT 🚨: Cleveland #Cavs are acquiring Caris LeVert from the Indiana #Pacers for Ricky Rubio, a lottery-protected 2022 first round pick and 2 future second round draft picks. #NBA #NBATrades #CarisLeVert",
    "59": "The Indiana Pacers cleaned up in this deal. https://t.co/SD4Br68Tkw",
    "60": "#IESRSN BREAKING: Cleveland Cavaliers are acquiring SG Caris Lavert from the Indiana Pacers. The Pacers will receive G Ricky Rubio and picks. The Cavs and Pacers play tonight #GoldBlooded #LetEmKnow #IESRSN #NBA #NBATwitter \n\nSource: (@wojespn)",
    "61": "@ChrisFedor @clevelanddotcom All points bulletin out on Koby Altman..suspect is believed to have committed armed robbery on the Indiana Pacers",
    "62": "Breaking: The Cleveland Cavaliers are acquiring Caris LeVert in a trade, sources tell Adrian Wojnarowski.\n\nThe Indiana Pacers will receive Ricky Rubio, a 2022 lottery-protected first-round pick and two second-round picks, per Wojnarowski.",
    "63": "Monta Ellis still collecting checks from the Indiana Pacers. Outstanding",
    "64": "BREAKING 🚨: The Cavs are acquiring SG Caris Lavert from the Indiana Pacers. The Pacers will receive G Ricky Rubio and picks. Cavs play the Pacers tonight #LetEmKnow #GoldBlooded #NBA #Trade\n\nSource: (@wojespn)",
    "65": "The Indiana Pacers has traded Caris LeVert to the Cleveland Cavaliers for Ricky Rubio, a 2022 1st round pick &amp; 2 2nd round picks (via @wojespn) https://t.co/HC4j57qyHk",
    "66": "@xBBKx @wojespn Lance Stephenson from the Indiana pacers",
    "67": "#BREAKING The Indiana Pacers are trading Caris LeVert to the Cleveland Cavaliers for Ricky Rubio, a first-round pick &amp; two second-round picks, per @ShamsCharania.",
    "68": "Even more interesting, the Indiana Pacers, who traded Caris to Cleveland, plays the Cavaliers at 6 p.m. today 😳 https://t.co/DTJf0XpF76",
    "69": "Breaking News; The Cavaliers have traded for Indiana Pacers shooting guard Caris LaVert. \n\nCavs are trading Ricky Rubio’s expiring contract and a lottery-protected 2022 and first-round pick and two second round picks. @Malutic_Live",
    "70": "The Cleveland #Cavaliers are acquiring Caris LeVert from the Indiana #Pacers via trade, per @wojespn \n\n#NBA75 https://t.co/28dSU9jBUA",
    "71": "Ricky Rubio has been traded to the Indiana Pacers, per @wojespn.",
    "72": "Breaking: The Cleveland Cavaliers are trading for Indiana Pacers guard Caris Levert, sources tell @Vengeance_NN. More trade details to come as the trade is finalized. https://t.co/264UJa7ZYn",
    "73": "TRADE: The Cleveland Cavaliers are acquiring Caris LeVert from the Indiana Pacers, per @wojespn.\n\nCavs currently sit 4th in the East.",
    "74": "NBA Basketball Game Betting Picks Simulator: 6:10 PM ET - Indiana Pacers vs. Cleveland Cavaliers - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/eXBq0fPl4N #nba #sportsbetting #freepicks #cappertek",
    "75": "Per @wojespn The Cleveland Cavaliers are receiving Caris LaVert from the Indiana Pacers!",
    "76": "BREAKING: The Indiana #Pacers are trading G Caris LaVert to the Cleveland #Cavaliers. #NBA https://t.co/yh8ye6bGQC",
    "77": "Looking for a value bet?  See if the Indiana Pacers-Cleveland Cavaliers Predictions and Preview for 2/6/2022 is one in our preview.  No crazy hype just a prediction and preview. #SportsBetting #Picks https://t.co/zXljLROYkt",
    "78": "Cleveland Cavaliers Predictions and Preview for 2/6/2022 hosts Indiana Pacers.  Looking for betting action?  Find out if there is any value in our preview. #SportsBetting #Picks https://t.co/zXljLROYkt",
    "79": "The @cavs return home for two games, facing the Indiana Pacers tonight.  \n\nCleveland has won a season-high tying 5 straight games at @RMFieldHouse. A win over Indiana would mark their longest home win streak since March 5-April 5, 2018 (8 straight wins at home). #LetEmKnow",
    "80": "💎 HUGE 20 ODDS COMBO 💎\n\n1️⃣ Cleveland Cavaliers - Indiana Pacers (-3.5) @ 1.67\n2️⃣ Dallas Maverics - Atlanta Hawks (-2.5) @ 2.25\n3️⃣ LA Clippers - Milwaukee Bucks (-3.5) @ 1.87\n\n..and 2 more picks in the video below. 🍀👇\n\n🔒 Total odds: 20.89 #SportsBets\n\nhttps://t.co/VOCrii7O4e",
    "81": "NBA Basketball Game Betting Picks Simulator: 6:00 PM ET - Indiana Pacers vs. Cleveland Cavaliers - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/eXBq0fPl4N #nba #sportsbetting #freepicks #cappertek",
    "82": "Opening Line: Indiana Pacers (217) vs. Cleveland Cavaliers(-6) - Linemoves Since: (8) #Pacers #Cavaliers  Full odds at https://t.co/nUn5OcMhOI",
    "83": "Terry Taylor's last 3 games:\n\n20 PPG\n12.7 RPG\n60% 3PP\n\nUndrafted. He plays both SG and C.\nGood pickup for the Pacers.\n\n#NBA #IndianaPacers",
    "84": "i could’ve played for the Indiana Pacers but i was too busy slangin Reggie",
    "85": "@Jbortoli @ColdAirKalina Or root for the Indiana pacers(John)",
    "86": "Today's NBA Picks: 6:00 PM ET - Indiana Pacers vs. Cleveland Cavaliers - 24 PICKS AVAILABLE: https://t.co/1ArENZ39uD #nba",
    "87": "ATLANTA HAWKS +2\nINDIANA PACERS +5.5\n2/6",
    "88": "If I'm the Cavs, I would simply not let Chris LeVert leave the hotel to the arena as a member of the Indiana Pacers https://t.co/aSpgjUytyI",
    "89": "🇺🇸NBA Picks\n\nBoston Celtics -4.5\nIndiana Pacers +7.5 \nAtlanta Hawks +5.5\nPelicans ML\nClippers +7.5\n#nba #nbapicks #NBA75 #NBATwitter #bettingpicks #bettingtwitter https://t.co/q0MjV5ptcZ",
    "90": "@MSPLAYSPORTS1 Erick Dampier’s Son  ,wow #1 6th grader in the country !father ED played at Mississippi State  Drafted by the Indiana Pacers",
    "91": "Indiana Pacers vs. Cleveland Cavaliers- 2/6/22 Free Pick &amp; NBA Betting Prediction https://t.co/VlAkOTTRpm\n.\n#Betting #FreePicks https://t.co/s4o9qGLmLx",
    "92": "Indiana Pacers at Cleveland Cavaliers odds, picks and predictions https://t.co/Zapkk3tps5",
    "93": "Evan Mobley and the Cleveland #Cavaliers take on Caris LeVert and the Indiana #Pacers today in a midwest battle at 6pm EST! What team has the edge?\n\nMy latest NBA preview for @TWSN___ \n\n#GoldBlooded #LetEmKnow\n\nhttps://t.co/rZTIbf9MjL",
    "94": "🔴Live ~ Indiana Pacers vs. Cleveland Cavaliers - NBA League 2022 🏀💯\n🔗 🔴Watch Live Fullᴴᴰ 👉 : https://t.co/Qu9T2DIqpb ✅\n📆 :On Sunday. February 06 /2022\n⏰ : 6:00 PM\nDONT FORGET TO SHARE AND FOLLOW FOR MORE INFO AND UPDATE.",
    "95": "@Liljimmywillis @eddie_evanosky @workingmomblog Thats basically it. The Indiana Pacers could be the best team in the league and they aren’t televising a game vs Dallas or Sacramento nationally.",
    "96": "A mock trade has the Philadelphia 76ers moving Furkan Korkmaz to the Indiana Pacers.  https://t.co/8KTcpZcD01",
    "97": "Underdog Sundaze:\n\nI like..\nChicago Bulls ML\nOrlando Magic ML\nIndiana Pacers ML\nAtlanta Hawks ML\n\n#GamblingTwitter #BetWithLeek",
    "98": "As equipes que tem interesse em Ben Simmons:\n\nAtlanta Hawks\nCleveland Cavaliers\nToronto Raptors\nIndiana Pacers\nDetroit Pistons\nMinnesota Timberwolves\nSacramento Kings\nPortland Trail Blazers \n\n📰Fonte :@TheNBACentral\n\n#NBA75 https://t.co/2PoFQoMTfe",
    "99": "@csladddems @mitchmac2012 @barstoolsports Former INDIANA PACERS center 😂",
    "100": "Report: The indiana pacers front office is being ran by an actual special ED classroom. I think my dog might be smarter. https://t.co/OQVlCNeK8r",
    "101": "Analyzing Sunday’s Indiana Pacers at Cleveland Cavaliers odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/6E5UO05plN",
    "102": "Indiana Pacers at Cleveland Cavaliers odds, picks and predictions https://t.co/d2T9GP1yZH",
    "103": "Gameday!\nCleveland Cavaliers (4º / 32-21)\n\n🆚 Indiana Pacers (13º / 19-35)\n🏠 Rocket Mortgage FieldHouse\n📍 Cleveland, Ohio\n⏰ 20:00 (Brasília)\n🖥 NBA League Pass / @nbalinksbrasil\n\n#LetEmKnow https://t.co/xmREoDo0Un",
    "104": "Indiana Pacers vs  Cleveland Cavaliers Prediction 2/6/22 -  Free NBA Picks https://t.co/S9Og7bx4PP via @YouTube \n\n#NBA #NBAPick #NBAPrediction #Basketball #Pacers #Cavs #Cavaliers",
    "105": "I really hope that the Indiana Pacers will destroy the Minnesota Timberwolves this season #GoldBlooded #RaisedByWolves",
    "106": "Good Morning Cleveland fans! Tonight your Cleveland Cavaliers take on the Indiana Pacers so it's time to #LetEmKnow who you got.",
    "107": "Consensus Line Move:\n2022-02-06 Indiana Pacers at Cleveland Cavaliers from 216.00 to 217.00\nOver steam engine\n#NBA #parlay #analytics #makemoney",
    "108": "#LetEmKnow 6:00 PM Cavaliers vs. Indiana Pacers | Get tickets here ➡️https://t.co/tLGAQKKXRM",
    "109": "Darius Garland is questionable tonight for the #Cavs against the Indiana Pacers.",
    "110": "NBA Trade deadline in 4 days, I just hope to see my Indiana Pacers actually make roster moves that matter.\nWe aren’t winning , we won’t beat any team in playoffs and we aren’t losing enough to get good draft pick . Blow this shit up and get picks / star player",
    "111": "The Indiana Pacers face the upstart Cleveland Cavaliers for the second time this season. Here are the latest odds, injury report, and predictions.\n\nhttps://t.co/M8zYhW5cUs",
    "112": "Indiana Pacers Suffer Injury Woes with the Trade Deadline Approaching https://t.co/enwA4zJrVt",
    "113": "NBA Basketball Game Betting Picks Simulator: 6:00 PM ET - Indiana Pacers vs. Cleveland Cavaliers - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/eXBq0fPl4N #nba #sportsbetting #freepicks #cappertek",
    "114": "Los nueve equipos que han mostrado cierto interés por Ben Simmons‼️\n\nAtlanta Hawks\nCleveland Cavaliers\nToronto Raptors\nIndiana Pacers\nDetroit Pistons\nMinnesota Timberwolves\nSacramento Kings\nPortland Trail Blazers\nWashington Wizards\n\nℹ: @KyleNeubeck\n\n#NBA #bensimmons https://t.co/BwGaS0WCIc",
    "115": "@JCMacriNBA Which first quarter from RJ was better: Against Indiana Pacers or against Los Angeles Lakers?",
    "116": "Lance Stephenson Inks Deal With Indiana Pacers For Remainder Of Season https://t.co/DaLEuOvu5c",
    "117": "How Reggie Perry went from G League to starting at center for Pacers #Indiana #Pacers #NBA https://t.co/6cA31tSjsw",
    "118": "Loved « Untold: Malice at the Palace », felt quite sorry for Artest after watching the whole thing, and crazy again how media turns things around, making the Indiana Pacers look like « thugs ». Who wouldn’t have gotten angry if a full cup came flying in your face? #SDSUJMS416",
    "119": "Congratulations to ArchdukeAwesomesauce who moved up 2 spots to take #24 on the Indiana Pacers team leaderboard.\n\nhttps://t.co/O74GedAEqq",
    "120": "Cleveland Cavaliers v \nIndiana Pacers\n07.02.2022 - 00:00\nhttps://t.co/shGGvo4d4D\n\n@NBA \n#basketball https://t.co/f4slNPu6wW",
    "121": "Indiana Pacers vs. Boston Celtics https://t.co/3WKtfDHHpg",
    "122": "@N8TheCre8tive wait... is this kid the son of Eric Dampier of my beloved Indiana Pacers?",
    "123": "INDIANA PACERS vs\nCLEVELAND CAVALIERS, 7:00PM.",
    "124": "NBA Basketball Game Betting Picks Simulator: 2/6/2022 6:00 PM ET - Indiana Pacers vs. Cleveland Cavaliers - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/eXBq0fPl4N #nba #sportsbetting #freepicks #cappertek",
    "125": "TJ McConnell 2020-21 Obsidian Lightning Strike Auto Purple Etch /75 \nTag a @pacers fan!\nhttps://t.co/IBsOki1Eqn\n#thehobby #indiana #pacers #nba #basketball #basketballcard #autograph #TCMcConnell #collect",
    "126": "9 tim yang berminat mendatangkan Ben Simmons: \n\nAtlanta Hawks\nCleveland Cavaliers\nToronto Raptors\nIndiana Pacers\nDetroit Pistons\nMinnesota Timberwolves\nSacramento Kings\nPortland Trailblazers\nWashington Wizards\n\n(Sumber: Kyle Neubeck)",
    "127": "Lance Stephenson Inks Deal With Indiana Pacers For Remainder\nOf Season   https://t.co/be36BwDQY0    #Diamante #Blockchain #DiamCircle",
    "128": "Indiana Pacers in the building TONIGHT at 29 NOVI…",
    "129": "@Warreneta_ @ClinicalAspas @Francszk_ June 23, 2011: (Kawhi Leonard) Drafted by the Indiana Pacers in the 1st round (15th pick) of the 2011 NBA Draft.\n\nJune 23, 2011: Traded by the Indiana Pacers with Dāvis Bertāns and Erazem Lorbek to the San Antonio Spurs for George Hill.\n\n¿Aún pesa, Warri? https://t.co/OV5MXP73rp",
    "130": "Nove times tem demonstrado um grande interesse em Ben Simmons!\n\nAtlanta Hawks\nCleveland Cavaliers\nToronto Raptors\nIndiana Pacers\nDetroit Pistons\nMinnesota Timberwolves\nSacramento Kings\nPortland Trailblazers\nWashington Wizards\n\n(@KyleNeubeck) https://t.co/2XODDOliAd",
    "131": "🇺🇲 NBA - 10/01 🗓\n\nBoston Celtics 101-98 Indiana Pacers",
    "132": "Pacers coach Rick Carlisle remembers Bill Fitch, the coach who gave him his first shot #Indiana #Pacers #NBA https://t.co/pjegMnvs4V",
    "133": "The nine teams to register some level of interest in Ben Simmons: \n\nAtlanta Hawks\nCleveland Cavaliers\nToronto Raptors\nIndiana Pacers\nDetroit Pistons\nMinnesota Timberwolves\nSacramento Kings\nPortland Trailblazers\nWashington Wizards\n\n(Via @KyleNeubeck ) https://t.co/kwkQ9hvMgI",
    "134": "The Cleveland Cavaliers are in a deal with the Indiana Pacers, trading Ricky Rubio, Dylan Windler, a 2024 first round pick, and a future second round picks in exchange for Caris LeVert and Justin Holiday, sources say.",
    "135": "Report: #Cavs targeting Indiana Pacers' Caris LeVert before next week's trade deadline https://t.co/8AXpy1M0Su",
    "136": "God i cannot wait till this man is on the Indiana Pacers https://t.co/63An4m0TiD",
    "137": "Hello, AJ Griffin. \n\nThe Indiana #Pacers could really use a wing like this! https://t.co/aWhon5qEDv",
    "138": "🚨BREAKING: The Cleveland Cavaliers are in a deal with the Indiana Pacers, trading Ricky Rubio, Dylan Windler, a 2024 first round pick, and a future second round picks in exchange for Caris LeVert and Justin Holiday. https://t.co/IkXJnRiqjL",
    "139": "The Cavaliers are finalizing a deal that would send Kevin Pangos, Isaac Okoro, Dylan Windler and future first-round pick to the Indiana Pacers for Caris Levert, sources tell ESPN.",
    "140": "Reggie Perry was playing video games, then the Pacers called because they needed height #Indiana #Pacers #NBA https://t.co/zBOuG8PEbx",
    "141": "🏀 Indiana Pacers (@Pacers) #GoldBlooded\n🆚 Cleveland Cavaliers #LetEmKnow #INDvsCLE\n✈️ N649DL | DAL8927 | B752\n🛫 IND - 3:32 pm ET\n🛬 CLE - 4:17 pm ET\n📡 Tracking: https://t.co/icMGpiwips https://t.co/l1DoavtCKH",
    "142": "Lance Stephenson Inks Deal With Indiana Pacers For Remainder Of Season https://t.co/KuKkpbEeSc #followback #news #sdv #siguemeytesigo",
    "143": "@TimLarsonSports Is Isaac Okoro on the table for Indiana #Pacers",
    "144": "Resultados NBA\nCharlotte Hornets 101-102 Cleveland Cavaliers\nDetroit Pistons 93-102 Boston Celtic\nIndiana Pacers 115-122 Chicago Bulls\nToronto Raptors 125-114 Atlanta Hawks\nSan Antonio Spurs 131-106 Houston Rockets \nDenver Nuggets 105-113 New Orleans Pelicans"
}