{
    "0": "#NBA75 | Dallas Mavericks vs San Antonio Spurs is about to begin!\nBet here:\n\nhttps://t.co/IT7pYFdaVg https://t.co/5BnWL2A5nv",
    "1": "#NBA75 | Dallas Mavericks vs San Antonio Spurs is about to begin!\nBet here:\n\nhttps://t.co/0rTJpgSrdP https://t.co/wVbSGZDBXF",
    "2": "It's time now for some NBA action this morning. And it features the San Antonio Spurs and the Dallas Mavericks #NBA75",
    "3": "Quinteto de los Dallas Mavericks para enfrentar a San Antonio Spurs: \n\nPG: Luka Doncic\nSG: Tim Hardaway Jr.\nSF: Reggie Bullock\nPF: Dorian Finney-Smith\nC:  Dwight Powell\n\n- Primera titularidad -de muchas, seguramente- para Reggie Bullock\n\n#MFFL \nhttps://t.co/H0WjQrt9d3",
    "4": "🏀 Dallas vs San Antonio Spurs\n🏆 NBA\n🗓 28/oct.\n⏰ 21:30\n📺 NBA LEAGUE PASS",
    "5": "@CoachBrindle @cougars25 @JesseGavin1 San Antonio Spurs for this guy!!",
    "6": "#RealTalkSports | The Mavs are looking to get their second home win tonight against the San Antonio Spurs, take a quick look at how they got their 1st home win of the season!⤵️ #MFFL \nhttps://t.co/NtLeygv5Ls",
    "7": "San Antonio Spurs’ Keldon Johnson is OK with fourth-quarter benching https://t.co/q23VE9AgSf",
    "8": "#NBA #NBATwitter Today's Lineups\n\n#PorVida\nSan Antonio Spurs Starting 5:\nDejounte Murray\nDerrick White\nLonnie Walker IV\nKeldon Johnson\nJakob Poeltl\n\n#MFFL\nDallas Mavericks Starting 5:\nLuka Doncic\nTim Hardaway Jr\nReggie Bullock\nDorian Finney-Smith\nDwight Powell",
    "9": "2012. \nIngram Park Mall. \nSan Antonio Texas. \nBulls looked great. \nRose had won MVP the year before. \nI was in middle school. \nStranger came up to me and shouted GO SPURS GO. https://t.co/I3c9YsPTJK",
    "10": "San Antonio Spurs: NAACP urges pro athletes not to sign with Texas teams https://t.co/rpyNobawL2",
    "11": "Anyone who wants to watch the game tonight to see if they speak about the voyager partnership  catch the game here https://t.co/c6vla2369t click on the nba symbol scroll down and you will see San Antonio Spurs versus Dallas Mavericks click on that $vgx https://t.co/DSk7PPTISc",
    "12": "Free Pick 10/28\n\nNBA🏀\n\nSan Antonio Spurs +6.5 (-105)\n\nThrow a like if you’re tailing🔥⬇️ https://t.co/wtE8qchKyk",
    "13": "🏀 san antonio spurs 121 x los angeles lakers 125. 🏀\n\n26/10/2021",
    "14": "GAME THREAD: Dallas Mavericks vs San Antonio Spurs  https://t.co/OYkqUHVRHw https://t.co/DB8hHisuvu",
    "15": "Tonight's starting lineup for the San Antonio Spurs: Murray, White, Walker, Johnson, Poeltl https://t.co/bVWH4Av1bs",
    "16": "San Antonio Spurs Starters:\n\nDejounte Murray\nDerrick White\nLonnie Walker\nKeldon Johnson\nJakob Poeltl\n\nPlayers out:\nZach Collins\nDoug McDermott\n#PorVida #NBA #NBATwitter #NBA75",
    "17": "🏀Spurs vs. Mavericks🏀  \n\nThe San Antonio Spurs and the Dallas Mavericks face off today as the hosts @kateconstable, @punt_school, @ChrisRFarley1  look to make it a three-game winning streak. 🔥  \n\n📺 WATCH NOW👉  https://t.co/ddpmltSCNP\n\n#nbaodds #nbapicks https://t.co/2TzRtswA8B",
    "18": "Today's NBA Picks: 8:40 PM ET - San Antonio Spurs vs. Dallas Mavericks - 26 PICKS AVAILABLE: https://t.co/yjnQPFdeRj #nba",
    "19": "Thursday night locks :: Chicago Bulls -1 and ocer215 total points, Detroit Pistons +9.5 and over 212 total points, Green Bay Packers -6 and over 50.5 total points, Houston Rockets +9.5, San Antonio Spurs +6 and Coastal Carolina -17 .",
    "20": "It's Gameday Friday! Abangan ang laban ng San Antonio Spurs at Dallas Mavericks sa #NBA75! LIVE at 8:30AM on @OneSportsPHL!\n\n#NBAonOneSports #AlwaysAFan #GameTayo #OKtoBERsaIba https://t.co/dqryWWiD6e",
    "21": "@spurs got a good chance of getting this win tonight #PorVida #GoSpursGo things to watch for when the Mavericks clash with the San Antonio Spurs https://t.co/CUOAfdraDK",
    "22": "I like this San Antonio spurs squad… McDermott gotta find his shot tho",
    "23": "IT’S GAME DAY: Dallas Mavericks (2-1) vs San Antonio Spurs (1-3). Who you got?",
    "24": "TIP: Dallas Mavericks - San Antonio Spurs, J. Poeltl 10.5 Over , 1.93 by #tipster Eazy (profit this month: +156.76)\n  #betting #Basketball #Dallas #Mavericks #San #Antonio #Spurs",
    "25": "San Antonio #Spurs: hug someone ...\n \nhttps://t.co/enOHb04nck\n \n#NBASouthwest #NBASouthwestDivision #NBAWestern #NBAWesternConference #NBAWesternConferenceSouthwest #NBAWesternConferenceSouthwestDivision #SanAntonio #SanAntonioSpurs #SanAntonio #SanAntonioSpurs #Southwest https://t.co/7gFoESY7A2",
    "26": "#bFb Dallas Mavericks vs San Antonio Spurs Post Game Show LIVE in studio tonight. @carolinateague_ from the Spurs will zoom into the show #MFFL #GoSpursGo https://t.co/tZwKYlLGXb",
    "27": "@Jcredette @nbatopshot @PackripEwing Lmaooo I may be from San Antonio but I’m not a Spurs fan 🤣🤣🤣",
    "28": "bFb Dallas Mavericks vs San Antonio Spurs Post Game Show LIVE in studio tonight. @carolinateague_ from the Spurs will zoom into the show #MFFL #GoSpursGo https://t.co/URuWBWme5O",
    "29": "With Porzingis OUT, the Mavericks line is -6 vs the Spurs. 16 of the last 20 meetings between these teams were decided by 7 points or less. However, this is the worst roster San Antonio has had in that timeframe.\n#NBAtwitter #sportsbetting https://t.co/KL0Uv5Pynq https://t.co/eP2XPVx4dr",
    "30": "New round same locks, taking to the south tonight…San Antonio Spurs vs the Dallas Mavericks little Texas two step 1st quarter over 26.5 team points for the Spurs https://t.co/DRt8Rrh0Pr",
    "31": "2u Spurs +6\n(-110 on DK)\n\nSan Antonio heads to Dallas who are without Porzingis. The Spurs are shooting 47.6% (3rd) while Dallas ranks last in the league, shooting 40.4%. San Antonio averages 107.4 possessions per game (6th) and rank first in assists per game with 29.5",
    "32": "There are no airballs in @Spurs #marketing. 🏀 The #OracleRoadTrip visits San Antonio to see how the Spurs score every time by ensuring they get the right messages to the right fans at the right time. https://t.co/NRXwhMLWP5 https://t.co/jLIJD8FHgn",
    "33": "Pulled a Michael Finley @nbatopshot but it’s from when he was with the San Antonio Spurs 👎🏽 #mffl https://t.co/cF9uXRIdfZ",
    "34": "@realDailyWire Athletes will sign where the money is. \n\nHouston Rockets, Texans and Astros, Dallas Mavericks, Stars and Texas Rangers. San Antonio Spurs. \n\nThis is a begging and pleading that will go ignored.",
    "35": "@TheSchnabs @Patrick120879 @KillerSwisher @Kicksandtee @MattFinessin_ @__Thirst22 @SKOLVikingz33 @GabeGoBig1 @Shanndogg12 @Torylangley1992 @Hope4Once @DK__DFS @ADREAM11USERR @HadoukenSZN @Erock24915618 @Matthewp07 @koontz91 @StephBoyarthree @aadri111 @EmacDFS I think since Derozan is outta of San Antonio ..Murray Poetlt are the new Cp3 and Ayton for the Spurs",
    "36": "🚨NEW ARTICLE OUT NOW🚨\n\nThe San Antonio Spurs are taking on a new look: No more older veterans. In their stead, younger players will be looking to take a major step forward.\n\nBy our newest writer, @FayBuckets !\n\nRead it only on https://t.co/ewrhsVqGL7 https://t.co/PKrwFyGV16",
    "37": "San Antonio Spurs: San Antonio Spurs:  vs. Dallas Mavericks: Spread, Line, Odds, Predictions, and Algorithm Picks\u0085 https://t.co/kO9EReU1h3",
    "38": "#Spurs @ #Mavericks Free NBA Betting Prediction, and Odds For Tonight. https://t.co/WGyuqRrg9Q #SanAntonio will be looking to snap a three game skid tonight in #Dallas #LukaDoncic #AmericanAirlinesCenter #DejounteMurray",
    "39": "#016 ➡️ SAN ANTONIO SPURS\n🎯2,98 0,5%\n📕BETCLIC https://t.co/srDdb35fkd",
    "40": "Analyzing Thursday’s San Antonio Spurs at Dallas Mavericks odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/aHa5xItF3b",
    "41": "Spurs @ Mavs\n- San Antonio Spurs +6.0 @ $1.91 (-109) \n\nFinal add for today. Join us on the @BetUS_NBA show in 30 minutes for some breakdowns on the games 🍻 https://t.co/z0gnBvcOsf",
    "42": "TIP: Dallas Mavericks - San Antonio Spurs, 2&amp; 221,5-, 6.00 by #tipster lapidarius7 (profit this month: +94.02)\n  #betting #Basketball #Dallas #Mavericks #San #Antonio #Spurs",
    "43": "10/28 NBA… here’s what I’m on:\n\nHouston Rockets 1Q +3.5\nSan Antonio Spurs 1Q +2\nGolden State Warriors 1Q -1.5\n\nWarriors -6\nHawks/Wizards under 222.5\n\n#Rockets #GoSpursGo #DubNation",
    "44": "San Antonio Spurs: Mavericks’ Kristaps Porzingis (back) sidelined vs. Spurs https://t.co/F7TWAM2yFz",
    "45": "Philadelphia 76ers vs Detroit Pistons\nMemphis Grizzlies vs Golden State Warriors\nDallas Mavericks vs San Antonio Spurs\nUtah Jazz vs. Houston Rockets live\nChicago Bulls vs New York Knicks\nWashington Wizards vs Atlanta Hawks https://t.co/996EmtW9B0",
    "46": "Mavs Kristaps Porzingis has officially been ruled OUT (Low Back Tightness) for tonight against the San Antonio Spurs #MFFL",
    "47": "There are no airballs in @Spurs #marketing. 🏀 The #OracleRoadTrip visits San Antonio to see how the Spurs score every time by ensuring they get the right messages to the right fans at the right time. https://t.co/nZ9Iw09jEv https://t.co/QdrgHKvsk3",
    "48": "Dallas Maverick and San Antonio Spurs game tonight 🔥🔥🔥",
    "49": "The 2-1 #Mavs are set to face off with the 1-3 #Spurs tonight at 7:30pm CST. Preseason MVP-favorite Luke Doncic is averaging 23.7 PPG this season. Will that be enough to beat San Antonio without the help of the injured Kristaps Porzingis?",
    "50": "Funny sports announcers and players downplay the San Antonio @spurs as though they are not NBA level. The likes of @ShannonSharpe @undisputed @FirstTake Your Sith mind tricks won't work. Trust the process. Bad news for @dallasmavs tonight @BallySportsSW \n\nhttps://t.co/T28nUrz1mp",
    "51": "Kristaps Porzingis will miss tonight’s matchup with the San Antonio Spurs, per Mavs PR.",
    "52": "🏀San Antonio Spurs @ Dallas Mavericks\n⏰03.30 TSİ\n✈️American Airlines Center\n❌Zach Collins, Doug McDermott https://t.co/4IVTHD1gMw",
    "53": "We’re back again with another weekly edition of Alamo City Limits with our guy @DABartonek!\n\nGive us a listen as we discuss San Antonio's rotations and the opening week of Spurs basketball! https://t.co/YyQDgxGjBg",
    "54": "Succession      San Antonio Spurs\n                     🤝\n               Key figure \n              named Greg(g)\n            involved in questions\n          about an aging leader's future",
    "55": "Naturally, one of our top picks for Sports Bars in San Antonio is hosting the @spurs Official Watch Party! Tonight 7pm @ Little Woodrow’s Stone Oak, be there to cheer on our guys! 👇🏼✨\n\nhttps://t.co/0FJYyMDw55\n\n#UNATION #stufftodoinsanantonio #GoSpursGo #PorVida",
    "56": "Game Day!!! Game #4: 🌵San Antonio Spurs (1-3) @ 🐴Dallas Mavericks (2-1): 🏟️American Airlines Center in Dallas, Texas. 📺🏀⛹🏿🎫🤜🤛\n\n#PorVida #MFFL https://t.co/AacuFjZ54j",
    "57": "The San Antonio Spurs will visit the Dallas Mavericks tonight as the team will look to snap a three-game losing streak. Here's what you need to know. https://t.co/ThCwnCVzbD",
    "58": "he San Antonio Spurs nearly defeated the Los Angeles Lakers but ended up losing the game in overtime to drop to 1-3 on the season. Here are the grades! https://t.co/pYg8ZV0O0p",
    "59": "Concerns over 1-3 Start for the Spurs #Spurs #SanAntonio #NBA https://t.co/ENIWoi7YDL via @YouTube\n\n@1Tavarius @N_Magaro @Lore_spurs @DylanHCarter @AirAlamo",
    "60": "San Antonio Spurs: Mavericks odds: How to bet the Dallas vs San Antonio game https://t.co/vg2K2nUjpI",
    "61": "GAMEDAY\n\n🆚 San Antonio Spurs\n🏟️ American Airlines Center, Dallas\n⌚21:30🇧🇷\n📺 League Pass e Links\n\n#MFFL https://t.co/c4ZwU3tiCq",
    "62": "Culinary Experience Senior Coordinator - San Antonio Spurs (San Antonio · TX) https://t.co/nYSELUje2R",
    "63": "Spurs Lane will host the Austin Spurs training camp through Sunday. Waiting to chat with Josh Primo, San Antonio Marshall grad Jordan Burns and others. https://t.co/uhpkkrIXuy",
    "64": "Which #Spurs legend below did they sign via Free Agency?\n\n'11 - Kawhi (via IND)\n'01 - Tony Parker\n'99 - Ginóbili\n'97 - Duncan\n'89 - Sean Elliot\n'87 - The Admiral\n\nSan Antonio's extraordinary 22-year playoff streak ended because they haven't drafted an All-Star in a decade. #NBA https://t.co/XCKZVEWrY3",
    "65": "@BigChrizzle Yeah I mean that’s a close one to me but I wouldn’t be mad either way. Timmy is underrated by a lot of folks but then again there’s a lot out there that respect his game. I’m a little bias bc I’m a spurs fan since Admiral was ballin. Saw him and MJ ball out in San Antonio in ‘89",
    "66": "San Antonio: Have you registered for UpbringGolf? Join us for a day of impact benefiting our life-changing programs. What's more, prizes from @spurs, @SF_FiestaTexas, @ChipotleTweets, Merit Coffee Co. &amp; more will be up for grabs. Join us:🔗 https://t.co/Yhs6BfHnCV https://t.co/bc5jifVsBw",
    "67": "@TheFadeawayPod @Lore_spurs @thehalestone And we all knew draft night that he was going to spend time in the GLeague. But instead you rather he take Bryn's 8.5 minutes as a roleplayer instead of 30+ in Austin developing his game further in a lead ball handler role. A role he wouldn't get in San Antonio to start",
    "68": "@Lore_spurs @TheFadeawayPod @thehalestone Also, Manu Ginobili didn't play for San Antonio until four seasons after he was drafted as he was playing in Italy still. Which you could even consider as him developing further in another league.\n\nEven our most beloved player had spent time elsewhere to develop",
    "69": "🤠 Otro duelo Tejano\n\n🆚 San Antonio Spurs\n🕢 7:30 PM CT\n📺 Bally Sports Southwest\n📻 Mavs App y 99.1 FM https://t.co/a4mGDFBV8E",
    "70": "Revenge Game: Boban Marjanovic plays San Antonio tonight.  He played 54 games in his career for the Spurs.",
    "71": "@thebradbecker San Antonio doesn't have those minutes to give out nor that role compared to the rest of the roster. And this team is still in the mindset to win games and doing that isn't going to make them competitive like they have been so far. Spurs know how to develop their players",
    "72": "@LakersReporter Same 1st Unit Center, DeAndre Jordan as in the San Antonio Spurs game the night before and against head coach Greg Popovich. 😌😌😌 Why less interior scoring against a group of very young OKC Thunder players programmed to lose games?",
    "73": "San Antonio is 15-6-1 ATS in its last 22 road games.  The Spurs are 18-8-1 ATS in their last 27 games as road underdogs.  Dallas is 0-5 ATS in its last five home games.  The Mavericks are 11-22 ATS in their last 33 games vs. a team with a losing record.  Bet the Spurs Thursday.",
    "74": "Thursday's Free Pick: San Antonio Spurs +7\n\nThe San Antonio Spurs opened their season with a 123-97 win over the Orlando Magic.  They have gone 0-3 since with three competitive losses to three of the best teams in the NBA in the Nuggets by 6, the Bucks by 10 and the Lakers by 4.",
    "75": "@GuruLakers @_MarcusGuy Shortly after the disaster that was GM/Coach ML Carr in Boston, the GM of the San Antonio Spurs hired himself as coach. “Who is this 🤡 Gregg Popovich &amp; who does he think he is hiring himself as coach” pretty much sums up my sentiments at the time. Turns out I was the 🤡 https://t.co/o7H0C8DAji",
    "76": "🏀 #NBA\n\nSan Antonio Spurs 🆚 Dallas Mavericks\n📆 Vie 29 oct 02:40\n\n#Raspibets #FreePicks #FreeTips #StatBets #SportsBetting #BettingTipster #GoSpursGo #MFFL\n🆓🔎📈⬇ https://t.co/UdPHt9U7J0",
    "77": "San Antonio Spurs: Weekend Recruiting Preview: Buckeyes, Spartans and Baylor with big opportunities, Clemson hosts \u0085 https://t.co/U4C7mARsQ7",
    "78": "Mavs vs Spurs tonight \n\nit’s no Dirk vs Duncan rivalry anymore\n\nbut here are some of my favorite Dallas vs San Antonio moments…\n\n#MFFL https://t.co/7tfh0rfToA",
    "79": "if i’m the Dallas Mavericks, i thoroughly beat the shit out of the San Antonio Spurs tonight. just a thought!",
    "80": "San Antonio Spurs vs Dallas Mavericks 10/28/2021 Picks Predictions Previews\n\nhttps://t.co/PTugJrYO8e\n\n#NBApicks #NBAprediction #NBAparlay #NBAbetting #NBA #expertpicks #sportsbetting #freepick #freepicks #sportspicks #handicapper #odds #picks #basketballpicks #Spurs #Mavericks https://t.co/ylMSB4JgjR",
    "81": "NBA Day 1️⃣0️⃣ 🏀🏀🏀\nDetroit Pistons vs Philadelphia 76ers\nAtlanta Hawks vs Washington Wizards\nNew York Knicks vs Chicago Bulls\nUtah Jazz vs Houston Rockets\nSan Antonio Spurs vs Dallas Mavericks\nMemories Grizzlies vs Golden State Warriors\n#NBA2022",
    "82": "San Antonio Spurs 1997-98 @2K_Rosters @NBA2K @spurs \nCompleted Classic Teams Project\nhttps://t.co/f5TohP21hM https://t.co/rbXjZgmBYm",
    "83": "Blazers, Pacers, Spurs three team trade\n\nSabonis and Thad to Portland\nRoCo and filler to Indiana\nNurk is to San Antonio",
    "84": "Blazers, Pacers, Spurs three team trade\n\nMyles and Thad to Portland\nRoCo and filler to Indiana\nNurk is to San Antonio https://t.co/7HdtHiOw4W",
    "85": "Shop #PorVida  frames, prints, posters, mugs, puzzles, phone cases and more @ &gt;&gt; https://t.co/cNDkDB09EN &lt;&lt; #NBA #NBATwitter #NBA75 #SanAntonio #Spurs #SpursTwitter #SpursNation #GoSpursGo",
    "86": "2021-22 #NBA75 Regular Season: San Antonio Spurs vs. Dallas Mavericks\n\n📅 October 29\n⏰ 8:30 a.m. LIVE\n📺 One Sports\n\n#AlwaysAFan #NBAonOneSports https://t.co/PpGZnbWVBI",
    "87": "The Mavs are favored by 7 tonight against the Spurs.\n\nDallas enters 2-1 \n\nDallas offense 1.013 PPP (25th), SA defense 1.067 PPP (17th)\n\nSan Antonio enters 1-3\n\nSan Antonio offense 1.082 PPP (10th), Dallas def 1.040 PPP (11th)",
    "88": "NBA Picks Revealed For San Antonio Spurs Vs. Los Angeles Lakers\n#NBA #SanAntonioSpurs #LosAngelesLakers #news #thenexthint \nhttps://t.co/fepDzIsZPR",
    "89": "IT’S GAME DAY! #MFFL   \nDallas Mavericks vs San Antonio Spurs https://t.co/VA4i4gm8YF",
    "90": "Dont miss tonight's action as the Mavs look for their 3rd straight win against the San Antonio Spurs at 7:30pm on Bally Sports Southwest. \n#MAVSCONTENTCRAZY \n\nPhoto via- https://t.co/FIBupdMW3W https://t.co/gzmCQYoTln",
    "91": "San Antonio Spurs: Channing Frye Asks Why Tim Duncan Isn't In People's Top 5 Players Of All Time: \"If Tim Duncan Is The Greatest PF Of All \u0085 https://t.co/8p4MBzblpX",
    "92": "Lakers Game Preview: The San Antonio Spurs https://t.co/FrGtzsFqk8 https://t.co/PnxKEUyHSn",
    "93": "Houston should abolish the Rockets and adopt the Spurs as its NBA team in a concession to the Austin/San Antonio region which is naturally aligned with South Texas against the North but is under constant influence from the landed Northern/Western rancher class.",
    "94": "@TheLakersReview Only thing that matters is how you finish. I predicted this much that these 3 players as a trio will be tougher competition than the San Antonio Spurs, of course I was hoping the Lakers would still win:\nSGA\nJosh Giddey\nLou Dortz",
    "95": "@TheLakersReview 6 hours before this game I told Laker fans that OKC Thunder would play better than the San Antonio Spurs the previous night.",
    "96": "Dallas Mavericks: San Antonio Spurs vs Dallas Mavericks: : Live Stream, Score Updates and How to Watch NBA Match https://t.co/Jgp4OF73n0",
    "97": "San Antonio Spurs: San Antonio Spurs:  vs Dallas Mavericks: Live Stream, Score Updates and How to Watch NBA Match https://t.co/MvOWZWpQzM",
    "98": "Alright so for Thursday Night we will have two different games to bet your hard-earned shrimp on.\n\nNFL: Green Bay Packers (+6.5) vs The Arizona Cardinals (-6.5)\nNBA:  Dallas Mavericks (-6.5) vs San Antonio Spurs (+6.5)\n\nIf you love 6.5 point spreads, these are for you.",
    "99": "For @mavsmoneyball: 3 things to watch for when the Mavericks clash with the San Antonio Spurs https://t.co/ptIRALTkli https://t.co/On7bfIZQVc",
    "100": "3 things to watch for when the Mavericks clash with the San Antonio Spurs https://t.co/VkuxLFxr5A https://t.co/feE1GLauIw",
    "101": "@thehalestone @PorVida5x @ChiChiandPato Eh I wouldn’t say that. Spurs drafted for best available, so if their best available player was a 4, I’d bet money he’d be in San Antonio right now. One of the major reasons Primo is now in Austin is because he’s a guard, and there’s just so little room for another atm",
    "102": "Spurs vs Lakers game at San Antonio 😩 it was stressful, never in my life have I ever felt so many different things in not even an hour #LakersWin #SanAntonio https://t.co/rF6NdJgZ2v",
    "103": "@Sinfulskin2 Spurs vs Celtics in San Antonio 1979-80",
    "104": "The Lakers that has two \"MVP-candidate level players\" in Russ and AD barely beat the 'who the fuck is still there' San Antonio Spurs and lost to the 'literally kids' OKC Thunder.\n\nDoesn't matter if LBJ ain't playing. It shouldn't be this bad.",
    "105": "I use to Love my San Antonio Spurs, but when our coach, turned on our own FLAG, AND  loves the CCP..this thing is a traitor,,, and he went to the USAF SCHOOL,,so now i back up any team that plays the spurs,,,we need to fired pop,,and send him to wu-ham,with faci another traitor",
    "106": "@mcten Better than the San Antonio Spurs",
    "107": "@TheVolumeSports Growing up in San Antonio when Spurs were in the ABA, it was George Gervin, aka “The Iceman.”",
    "108": "Some more from the ABA: Utah Stars, Dallas Chaparrals (now the San Antonio Spurs), Carolina Cougars and Memphis Sounds. https://t.co/Cubc7ifBH1",
    "109": "Los Angeles Lakers vs San Antonio Spurs Full Game Highlights | October 26 | 2022 NBA Season https://t.co/nH3as16IoI"
}