{
    "0": "@samdubs0 @DogSurfRoadshow @warriors Right now I get having Wiggins in for scoring but they also need more defensive tenacity -- been lacking on that front for weeks",
    "1": "@warriors A great rest for Kevon. Love it",
    "2": "The Golden State Warriors are set to play @ATLHawks today at 6:30 p.m. Jordan Poole aims to continue his hot streak while the Hawks strive to clinch a spot in the East.",
    "3": "@TrixzyInsane @warriors Or Wiggins off the bench and run curry poole klay kuminga and dray",
    "4": "@samdubs0 @DogSurfRoadshow @warriors I think this is a transition I moreso want when lineup is fully healthy Curry-Thompson-Poole-Kuminga-Green imo will be our highest net rating lineup.",
    "5": "@warriors I think we are kinda fucked.",
    "6": "@jvhein2 @Neferpi74723512 @warriors Then he has a better chance to recover. He'll still be younger than most lottery draft picks this year",
    "7": "@49ersPolitics @DogSurfRoadshow @warriors If he comes of the bench do you reduce his minutes?",
    "8": "@DogSurfRoadshow @warriors I like the lineup, small ball it’s great and scary lineup for the league",
    "9": "@Trell707 @warriors I told niggaz lol . @RobAndreacchi22 how long I been sayin wiseman was ass ?",
    "10": "@Trell707 @warriors Embid missed two years, Wiseman is only 20",
    "11": "@warriors How much help does LeBron need?",
    "12": "@warriors @NBCSAuthentic speaking of dubs that’s what y’all gon get tonight 💯",
    "13": "@warriors Best wishes to James Wiseman for a complete recovery.",
    "14": "@samdubs0 @DogSurfRoadshow @warriors can contribute off the bench perhaps even better given he's been struggling as a starter",
    "15": "Hawks / Warriors ... Tip in about 8 mins .. \n\nNot gonna lie, it looks like Golden State South in here right now.",
    "16": "@DogSurfRoadshow @warriors With 80 year old legs! Haha",
    "17": "ESPN Sources: Golden State Warriors center James Wiseman has been ruled out for the rest of the season and will continue rehabilitating his right knee. Wiseman has been recovering from a meniscus repair last April, and the team has been cautious to protect him for the long-term. https://t.co/gA2hLylhjO",
    "18": "@warriors @NBCSAuthentic Wiggins has the same contract as Beal, Kat Towns, Jokic, Booker and Embid.",
    "19": "@Moonorchid @warriors Looney’s young! 😂",
    "20": "@TagYourIt_18 @mercihoops @niallmcgirr1 @dshih199 @AshuLeRat @warriors not what I was asking, but even then you're still wrong",
    "21": "@49ersPolitics @DogSurfRoadshow @warriors You realistically need his scoring surely?",
    "22": "@warriors And you continue to refuse to sign a center.\n\nWhy?",
    "23": "@warriors The best player that never was 😔",
    "24": "@warriors This has happened to so many teams that drafted the big man over the talented guy. Ugh hopefully he gets it turned around like the Process",
    "25": "@warriors Then he’ll be well rested before next season starts😀👍",
    "26": "@DogSurfRoadshow @warriors We have to mix up old and young legs",
    "27": "@DogSurfRoadshow @warriors Matchup based??",
    "28": "@alexandernev I remember it well. Golden State Warriors game. He had played 2 shows a few days before at a theater in Oakland, which I attended. A few days later he played 2 concerts in the very same venue where he was watching the game. Then the next month he was gone.",
    "29": "@warriors Damn 🤦🏽‍♂️",
    "30": "@warriors without a real center we are 1st round exit",
    "31": "🏀 GAME ANALYSIS 🏀\n\n🏟 Golden State Warriors vs Atlanta Hawks\n\n▶️ BET THE NBA ▶️ https://t.co/odroCYfQFJ\n\n#NBA #GamblingTwitter \n\nhttps://t.co/eDGiOY9cxX",
    "32": "@warriors Get well soon big fella",
    "33": "@DogSurfRoadshow @warriors shoulda pulled Wiggs instead imo but we'll see",
    "34": "Interesting starting lineup for the @warriors. I don’t know if I like Looney being pulled. https://t.co/L7d1PTfOGq",
    "35": "@warriors Ohhh different huh 👀",
    "36": "@warriors @NBCSAuthentic Trae getting ready to add the warriors to his portfolio sadly",
    "37": "So i have this new habit of saying a prayer for the @warriors each time my NBA notification pops up to remind me of a match😅\n\nGood luck tonight y'all, God speed",
    "38": "@TagYourIt_18 @mercihoops @niallmcgirr1 @dshih199 @AshuLeRat @warriors ok, tell me then, at what age has poole been better than lamelo?",
    "39": "@Ionsmurff @warriors @NBCSAuthentic I'm willing to give him away for anything that'll play basketball",
    "40": "@warriors Wow.. Looney not starting .\nWhat a streak",
    "41": "@mnbr2000 @honestGSWfan @warriors Half the warriors fanbase now are casuals who switch up you hate to see it",
    "42": "Golden State Warriors vs Atlanta Hawks Live\nGo Live🔴►https://t.co/aYLIgv3BMP https://t.co/es0Y5qB3P3",
    "43": "@Uncle_Alchemy do you think the @warriors will relentlessly attack Young while he’s on the court? He’s their biggest defensive liability and Klay could get some easy shots over him all night.",
    "44": "@warriors @NBCSAuthentic Don't win",
    "45": "@Trell707 @SadNinersFan_ @warriors Would not have made a difference with Jimmy at QB",
    "46": "@warriors #WisemanOut #SteveKerrOut Enough is enough!!!!",
    "47": "@missionarymelo @warriors @NBCSAuthentic Heck no. We need an actual center.",
    "48": "@warriors Trade him smh",
    "49": "@warriors @NBCSAuthentic Trade James Wiseman for Josh Giddey",
    "50": "Dubs. Hawks.\n\nStream the game live, next on @NBCSAuthentic 📺",
    "51": "NEW with @dieter &amp; @DogSurfRoadshow!\n\n—Would Dray miss a game for scoring record?\n—Maverick Carter insults Steph\n—Steph on criticism of his defense\n—Influence of shoe industry\n—@warriors-@ATLHawks (brief) preview\n—And more!\n\n📻: https://t.co/JeUzRXXIo0\n📺: https://t.co/SeiVbT8rzx",
    "52": "@hufangaburner @SadNinersFan_ @warriors Exactly. Instead of some dude who couldn't start on a D1 school. 5 players other than lance could've helped get a ring last year",
    "53": "@warriors Fake allstar in the mix I see",
    "54": "@scaffoldingklay @warriors Yeah it’s a bummer he’s been solid all year for us.  But he needs to rest and this is a perfect time where he can get three - four days off",
    "55": "@warriors @KlayThompson your so cute 😍😍🎂",
    "56": "OUR #NBA75 NBA PLAYER SPECIAL PICK FOR ATLANTA HAWKS VS GOLDEN STATE WARRIORS IS LIVE⚡⚡⚡\n\nBET9JA COUPON CODE- 6F3773K\n\nGAMBLE RESPONSIBLY🔞🔞 https://t.co/4j75tGRZ13",
    "57": "@warriors My son is at the game and would love to get his Autism Warriors shirt signed! 💙🧩 https://t.co/g9ZiMXjFJo",
    "58": "James Wiseman won’t rejoin Golden State Warriors this season https://t.co/gdDgBBAKSH https://t.co/vP5QyTWUwl",
    "59": "@warriors GREEEEEEEEEN @Money23Green ❤️❤️❤️❤️🤩🤩🤩🤩🤩🤩🤩🤩",
    "60": "@Trell707 @SadNinersFan_ @warriors \"if i was GM, I would just draft all the best players\"",
    "61": "@warriors Oh Lord! This is terrible news",
    "62": "@ana203xx @warriors Yeah till probably the first he’ll be back in if everything goes well https://t.co/VhFh1jCfNV",
    "63": "@zach_warriors12 @warriors Or they could do steph Poole klay wiggins dray",
    "64": "@EminehMan @warriors That's why you're always lost, I literally said he's not a bust. Reading comprehension, please.",
    "65": "@bacxnnn @warriors Yeah, I’m guessing looney may come off the bench in the playoffs just so either he or draymond will always be in the game",
    "66": "@warriors Kevon starting streak is over, kinda sad, he commits to start all year",
    "67": "@warriors need a big!!!",
    "68": "#NBATicket #NBA75 Start your weekend off with a 🔥 doubleheader on NBA TV!\n\n@warriors vs. @atlhawks // 7:30pm ET\n@sixers vs. @laclippers // 10:30pm ET https://t.co/YhI2JnloIp",
    "69": "NBA Defensive GOAT?! Golden State Warriors' James Wiseman Ruled OUT for Rest of the Season https://t.co/Rq2VhNPbFq https://t.co/xi7MsffwYo",
    "70": "@ana203xx @surfnsoii @warriors Ignore that guy he rude af",
    "71": "GOLDEN STATE WARRIORS CONFIRMADO:\n\n• Jordan Poole\n• Klay Thompson\n• Andrew Wiggins\n• Jonathan Kuminga\n• Draymond Green\n\n#DubNation",
    "72": "@warriors Small ahh lineup but I like it",
    "73": "@warriors Dray at the 5💪",
    "74": "@surfnsoii @warriors Dude i dont watch a lot of basketball i'm just interested",
    "75": "@GorgoVidal @mercihoops @niallmcgirr1 @dshih199 @AshuLeRat @warriors Of course you’ll hear that because you’ll hear what you want",
    "76": "@warriors Rare W",
    "77": "@BenjmainMonday @warriors Ok... You are the boss",
    "78": "@DRR124kta @warriors I never said we wasn’t it but it’s looking like a bad pick now with wiseman done nothing going into year 3 next season unproven and Injury prone",
    "79": "@mlucey13 @Neferpi74723512 @warriors Embiid had more serious injury. Torn meniscus isn’t that bad. Meniscus is just cartiledge.",
    "80": "@warriors W lineup\n\n#KumTime",
    "81": "@wardellspoole @mercihoops @niallmcgirr1 @dshih199 @AshuLeRat @warriors very convenient to assume linear development for poole over the next 2 years while simultaneously assuming lamelo won't also improve",
    "82": "@bacxnnn @warriors FACTS!!!!",
    "83": "@warriors Could realistically run a lineup like this in the playoffs just Steph at point and poole as 6 man",
    "84": "@warriors Curry still injured???",
    "85": "@RCtweeted @warriors You know I was hot bout this pick smh I didn’t mind a big man but I wanted OkongwU imagine us w the African combo him and kuminga 🤦🏻‍♂️ let me run the front office 🎰🎰",
    "86": "@warriors DRAY AT 5 = PLAYOFFS COMING SOON",
    "87": "@warriors Where Kevon looney",
    "88": "@warriors Some FUCK SHIT MANNN WE NEED THAT MANN YALL MFS CRAZY",
    "89": "@YesIEatAssBitch @warriors The moon",
    "90": "@warriors Very nice and exciting starting 5👌👌",
    "91": "@warriors Dray and Loon need to carry in the playoffs. There is Jokic, KAT, Ayton, Giannis, and Embiid. 🤯",
    "92": "@warriors Not a bad lineup just let Klay guard Young and we good",
    "93": "@warriors Glad he didn’t want to play for MN. Shouldn’t be out that long with a torn meniscus",
    "94": "@warriors Let’s go the boys are back let’s get this W",
    "95": "@warriors Where Steph",
    "96": "LETS GO @warriors 💙💛💙💛🔥 @ State Farm Arena https://t.co/7kMy2Jz75L",
    "97": "@warriors smart",
    "98": "First 5⃣ https://t.co/lNsF26RN82",
    "99": "Atlanta Hawks going to destroy Golden State Warriors. \n\nTrae Young Gon feast over Poole.",
    "100": "@TagYourIt_18 @mercihoops @niallmcgirr1 @dshih199 @AshuLeRat @warriors what I'm hearing is that lamelo has been better than poole at literally every point in their respective careers",
    "101": "@ATLHawks an @warriors my two favorite teams play each other today an I got tickets but work called https://t.co/ipfSpgruY8",
    "102": "@drehuss @warriors That nigga is a fuckin bum",
    "103": "@Neferpi74723512 @warriors That is why Gon beat your ass, how he a bust he didnt even play yet 😩😩😩",
    "104": "@JB5894 @warriors Beli is listed a Center. Looney is a PF though.",
    "105": "@warriors @SteveKerr well so much 4 the idiocy of depending a unproven rookie center and not@getting a proven vet like @boogiecousins to shore up the de tee position and provide depth. Dubs r not going anywhere this season",
    "106": "Let’s go @warriors!!! Let’s get this W!!! #DubNation",
    "107": "If you're over the height of 6'7 you're chances of getting signed by the Golden State Warriors are 0.00%",
    "108": "@GuinepoZz @warriors I say warriors in 7. Only because we’re 1-3 against them this season. After that the rest mind be a sweep. But then again, we were without Draymond for 3 of 4 of those matchups. Now we have him back and that might help so really it’s warriors in 6. 🗣",
    "109": "@mlucey13 @warriors Should've drafted someone else,that's a fact",
    "110": "Golden State Warriors Starters:\n\nJordan Poole\nKlay Thompson\nAndrew Wiggins\nJonathan Kuminga\nDraymond Green\n\nPlayers out:\nStephen Curry\nAndre Iguodala\n#DubNation #NBA #NBATwitter #NBA75",
    "111": "@mlucey13 @warriors I'll bet dude never plays a full season ever",
    "112": "@warriors trade him already mygod. too late now",
    "113": "@DRR124kta @aspecgod @warriors Embiid rookie year shits on Wiseman rookie year 🤣🤣🤣",
    "114": "@ButtCrackSports @WarriorsMuse @warriors He might be a good role player and win 6MOY a couple of times",
    "115": "🏀 GOLDEN STATE WARRIORS @ ATLANTA HAWKS 🏀 \n\nGame starting shortly, who are you with? \n\nAnalysis and betting strategy below... 👇  #NBA  https://t.co/DXKqDdGIyy",
    "116": "ALERT: New high roller bet posted!\nA bet has been placed for $14021.35 on Atlanta Hawks - Golden State Warriors to win $30,145.89.\nTo view this bet or copy it https://t.co/fOY2qV59fH https://t.co/Sr3rTQ0Tjw",
    "117": "We're here! Excited to watch the @warriors! https://t.co/cTe30NYWCG https://t.co/TMqgvFyqzt",
    "118": "James Wiseman won’t rejoin Golden State Warriors this season, sources say https://t.co/SihWqgHbZC",
    "119": "@Swaggerboyplayz @warriors Blie is PF not a canter",
    "120": "@honestGSWfan @warriors You’re a warriors fan too or did u steal that account",
    "121": "@warriors Of course… Should have known 🤦🏾‍♂️ https://t.co/oDVbsgnNMq",
    "122": "@mercihoops @niallmcgirr1 @dshih199 @AshuLeRat @warriors I’m a warriors fan and this is all cap, Lamelo gonna be a superstar in 2 years",
    "123": "@ace_slayton @SadNinersFan_ @warriors How would u be stuck? Could've just drafted a qb this year and u wouldn't be trippin off jimmy if we had a ring last year",
    "124": "Atlanta Hawks - Golden State Warriors\n\nBet slip link: https://t.co/4uEaQIiWgx https://t.co/w0JdrvW9Tl",
    "125": "Jackson’s birthday wish is coming true! Hoping he will be able to give his autism warriors shirt to @StephenCurry30 or meet some of his heroes from the @warriors team to sign his autism awareness shirt! @ToddJStafford https://t.co/NqOtcbb6rN",
    "126": "@killerhudz @warriors ur weird",
    "127": "Took my mom to see the @warriors play tonight in Atlanta https://t.co/5mIC6gB2OG",
    "128": "Tonight's starting lineup for the Golden State Warriors: Poole, Thompson, Wiggins, Kuminga, Green https://t.co/bVWH4AMCA2",
    "129": "@warriors Damn",
    "130": "@warriors Awwwww chaley, this really hurt me to the core",
    "131": "@YoB1ank @warriors yea sadly 😔",
    "132": "@Swaggerboyplayz @warriors Warriors in 5",
    "133": "@dshih199 @AshuLeRat @warriors Do you want more good players on your team or not, sheesh",
    "134": "@wardellspoole @GorgoVidal @mercihoops @niallmcgirr1 @dshih199 @AshuLeRat @warriors Do u understand how much development Lamelo can do in 3 years under the warriors regime???",
    "135": "Golden State Warriors Vs Atlanta Hawks | Live Reactions And Play By Play https://t.co/v41nOYJwkl via @YouTube",
    "136": "@warriors Bron talking",
    "137": "@mercihoops @niallmcgirr1 @dshih199 @AshuLeRat @warriors You’re right, BUT it means that he’s played at a higher level at a younger age and has a higher ceiling.",
    "138": "@warriors Well…starting to enter into Greg Oden territory",
    "139": "Uniforms for Golden State Warriors vs Atlanta Hawks at 4:30 PM on NBA TV.\n\n#DubNation #TrueToAtlanta https://t.co/fRFNWSRWQk",
    "140": "@warriors First round Matchup though😰😬 https://t.co/ZIXMGm8smo",
    "141": "@NoahFer39948346 @_klaynation_ @warriors @anthonyVslater ppl like u are so dumb😂😂😂",
    "142": "@Neferpi74723512 @warriors He's played 30 games and is 20 years old. Embid missed two years. Chill",
    "143": "Great job @klacobprime @warriors @SteveKerr ! Imagine thinking youbwere fooling the fan base with how you handled Wiseman and the rest of the offer. Salute! #joelacob #bobmyers",
    "144": "Atlanta Hawks - Golden State Warriors\nLos Angeles Clippers - Philadelphia 76ers\n\nBet slip link: https://t.co/SV0Ql3v9Rc https://t.co/nO7bnvRqDH",
    "145": "@mercihoops @niallmcgirr1 @dshih199 @AshuLeRat @warriors LaMelo already has an ASG appearance and he won RoTY 😂",
    "146": "@FRDYeth @LazyLionsNFT @SacramentoKings @warriors @AshurNFT @NineNft @AR_ON_tweets @WoozyPelican @DirectorJayC Grats King 🦁",
    "147": "@warriors Bruh just call Embiid ask him how to cure this bs",
    "148": "@iammellzz @warriors Only if the open up a roster spot.",
    "149": "@warriors Is he though",
    "150": "@warriors So did he get surgery last time or was it a cleaning if not they just playing with the dude career should have got surgery from the beginning",
    "151": "@Neferpi74723512 @warriors He’s a bust, fans are to afraid to say it. He’s oden 2.0",
    "152": "@Trell707 @SadNinersFan_ @warriors and be stuck with Jimmy lol nah",
    "153": "@xDcentric @warriors let’s hope",
    "154": "@3bycurry @warriors Sucks. Huge one too, will go down in the history books. He’s Greg oden 2.0",
    "155": "@_klaynation_ @warriors @anthonyVslater He’s a bust, tit disappointing pick. Just awful. Oden 2.0, and he was taken over KD. We took wiseman over Ball",
    "156": "@warriors It’s OK to pass the ball every now and then Klay",
    "157": "@dshih199 @AshuLeRat @warriors Such a fuccin dip sht mind to think that. You can trade Poole or Ball then. And get a great center in return. Or just deal with it and play with great players.",
    "158": "@ISAAC4O8 @warriors Yeah. I don’t see why they couldn’t do it. Wiseman is cooked. Chiozza don’t deserve that last roster spot IMO. Banking on Looney, Beli and Dray 😵‍💫",
    "159": "Imagine if the @warriors would have drafted Melo instead of wiseman🤦🏽‍♂️…somebody shoulda lost they job for that one..",
    "160": "@warriors Headband klay bout to cook these birds",
    "161": "@warriors TRADE HIM",
    "162": "@warriors Pls take the headband off",
    "163": "@PimpinMikeLowry @Dubsln4 @baby_face_goat @warriors they only have like two other player that are out",
    "164": "@warriors he bout go off tonight, I feel it.",
    "165": "@warriors Klay about to prove these trolls wrong calling him washed",
    "166": "@warriors Win mf",
    "167": "@warriors Form so good",
    "168": "@warriors Hopefully he's warming up his body language also",
    "169": "@warriors Ready to ratioooo",
    "170": "@warriors Bust",
    "171": "@dshih199 @AshuLeRat @warriors I mean u could try to trade him later",
    "172": "#clouddoor  #SoftwareStartups NBA Network - Golden State Warriors' James Wiseman Ruled OUT for Rest of the Season - https://t.co/AkgDbBgiNs",
    "173": "@warriors Announce Wisebust traded",
    "174": "Golden State Warriors center James Wiseman won't play this season: https://t.co/wLLOzQWiTW",
    "175": "@warriors Wtf bro why",
    "176": "@aspecgod @warriors No it's not,it's bob myers fault for believing in Wiseman over every other player that could've helped the team get a ring.",
    "177": "@warriors Pain https://t.co/CP2CpdseoC",
    "178": "Golden State Warriors' James Wiseman Rule OUT for Rest of the Season - https://t.co/N8jzHmDUbN",
    "179": "@warriors We really wasted a number 2 pick ffs",
    "180": "@ChillAssDRe @warriors Oh that’s right, forgot he signed pretty late that one season",
    "181": "@SadNinersFan_ @warriors He’s exactly like Greg Oden. Just like him. What a disappointing pick.",
    "182": "@warriors Trade him",
    "183": "@warriors y’all should sign a 7’2” filipino as your big 🤷🏽‍♂️😄\n\n🇵🇭 https://t.co/L5kg2LinXG https://t.co/fU94jAZ87Y",
    "184": "@warriors We need a back up big!💯🤷🏾‍♂️",
    "185": "Atlanta hawks vs golden state warriors and Argentina vs Venezuela playing at the same time. https://t.co/wlaKDm6qaN",
    "186": "@warriors y’all better sign a center to make up for this bullshit of waiting for him",
    "187": "Warriors center James Wiseman ruled out for season #GoldenState #Warriors #NBA https://t.co/12yAdMytUY",
    "188": "@911denial wears golden state warriors merch go meet up with putin",
    "189": "@mercihoops @niallmcgirr1 @dshih199 @AshuLeRat @warriors Agree",
    "190": "The @andre rehab’s looking great. His comeback’s scheduled for this roadtrip and what a massive boost that would be for this starved roster. He remains so underrated in terms of his overall impact on the @warriors. https://t.co/xzBlayjyQo",
    "191": "@AllDayRodgers @warriors Discipline bana. That's his biggest issue",
    "192": "Warriors, Come Out &amp; Play: Golden State Warriors vs. Atlanta Hawks (@SportsbyShayla &amp; @eldorado2452 Preview)\n\nWatch the full preview on https://t.co/J5bUDTDn8u \n\n🎥 @livehiphopdaily \n\n#dubnation #truetoatlanta https://t.co/EOMUH1PUnU",
    "193": "@warriors Good.  Dude not 21 yet.  Heal up",
    "194": "@jackson49411211 @MikeFitzTire @warriors True",
    "195": "@warriors What a draft fail",
    "196": "@warriors Hope he scores 50",
    "197": "@957thegame @DamonBruce @RattoIndy @warriors @ATLHawks @DamonAndRatto Welcome to Atlanta where the Playas play and we riddin on dem thangs lyk ereeyday",
    "198": "A view of @statefarmarena before tonight’s @atlhawks vs @warriors game. #nba#sports#basketball#gameday @ State Farm Arena https://t.co/4TDQAnVkht",
    "199": "@warriors Trade this nigga",
    "200": "@warriors People are forgetting that we signed Bejalica who’s a center. Not the type of center we needed but works nonetheless.",
    "201": "@ChaseCenter @StephenCurry30 @warriors G.o.a.t=s.t.e.p.h",
    "202": "Golden State Warriors vs Atlanta Hawks Picks and Predictions 3/25/2022 https://t.co/Jy6OCo8mNi",
    "203": "@BleacherReport @wojespn @warriors please trade him for a decent center",
    "204": "@CaliBloodLine81 @warriors Just wait.",
    "205": "@warriors Don't care + sign a big from the g league",
    "206": "@warriors There was a possibility for this all season long, yet we did not sign a backup center. FO light years??? 🙂",
    "207": "@harry69925610 @Warriorsnin3rs @kazerodriguez1 @baby_face_goat @warriors They did sign another center. Just not the type we needed.",
    "208": "@warriors Booo y’all front office sucks https://t.co/LzcYPoc5xS",
    "209": "@ISAAC4O8 @warriors I thought we did something similar with Bogut that one year we brought him back. Not sure how it all necessarily works though",
    "210": "@warriors I feel  so bad for him but hopefully he’ll got better soon",
    "211": "@YoB1ank @warriors Forget about him",
    "212": "Jordan Bell is a free agent @warriors #DubNation",
    "213": "@warriors Saw this coming. Well here’s what you can expect to see when he returns https://t.co/PsIXs6Srlq",
    "214": "@JaidenBunch1 @warriors really that sucks",
    "215": "@warriors Man. I hate to say it but this gives me Greg Oden vibes",
    "216": "@Fitzmagic_Fan @RatiodbyJordan @warriors Fuk Naw",
    "217": "@steph_burner @warriors All mid sadly",
    "218": "@YoB1ank @warriors he’s out for the rest of season",
    "219": "@warriors Go warriors！！！",
    "220": "@ChillAssDRe @warriors Could be wrong but don’t think he’d be able to play in postseason anyway",
    "221": "@warriors Yeah yeah let's go\nLet's lead the scores one more time 🔥\nMay God be with you 💯%🙏",
    "222": "@warriors oh my fucking god..",
    "223": "Golden State Warriors sophomore centre James Wiseman will miss the rest of the NBA season and all of the playoffs due to an ongoing right knee injury. \n\nhttps://t.co/Xf1D6VqwHH",
    "224": "@warriors Poole Party🤑",
    "225": "@warriors No Wiseman 😪",
    "226": "friday night https://t.co/JJByl7uGRQ",
    "227": "@TTODDitsISO Not responsible for that but you can easily mute the phrase “golden state warriors”",
    "228": "Golden State is in Atlanta tonight but will be without their best player Steph Curry. We like Trae Young to have his way with the Warriors, and for the Hawks to get the home win. Find out more in our Warriors vs. Hawks NBA betting picks.\n\nhttps://t.co/2i2SanWqYY",
    "229": "@warriors Let's go mates God is with us 🙏",
    "230": "@warriors The process pt.2 , but please let James show his worth after all these unfortunate injuries and set back",
    "231": "Call Marc Gasol @warriors 😩",
    "232": "@warriors Bruh looney gotta retire after this szn",
    "233": "@warriors I knew it",
    "234": "@warriors Bust",
    "235": "#Hawks PG Trae Young warms up as 'Ice Tray' plays inside State Farm Arena 🔥\n\nAtlanta hosting the Golden State Warriors tonight at 7:30. @11AliveNews https://t.co/VOaRWGNHPq",
    "236": "@GorgoVidal @mercihoops @niallmcgirr1 @dshih199 @AshuLeRat @warriors do you see the amount of improvement jp has had in the past 3 years?",
    "237": "@warriors He's a one man wrecking crew in the paint",
    "238": "@warriors I honestly believe Wiseman is very important",
    "239": "@aryh21 @MikeFitzTire @warriors It isn’t. But all that shit I listed can’t be a coincidence.",
    "240": "What's #Best on https://t.co/wNwLoFi3qW ?\nBest Of Jordan Poole's Historic Scoring Streak : 2021-22 Highlights\nhttps://t.co/W0SBFFy5cx\n#sports #goldenstatewarriors #goldenstate #warriors #gsw #dubs #dubnation https://t.co/ACFtSVKOu9",
    "241": "@warriors Remember joel also missed two seasons before playing, just continue improving young kid, come back stronger 🙏💪",
    "242": "#Best of the day on https://t.co/mk8w5UtFhL\nBest Of Jordan Poole's Historic Scoring Streak : 2021-22 Highlights\nhttps://t.co/JZSPNyb6qq\n#sports #goldenstatewarriors #goldenstate #warriors #gsw #dubs #dubnation",
    "243": "What's #Best on https://t.co/NQOcMymrqQ ?\nBest Of Jordan Poole's Historic Scoring Streak : 2021-22 Highlights\nhttps://t.co/P8rEiv9J7s\n#sports #goldenstatewarriors #goldenstate #warriors #gsw #dubs #dubnation",
    "244": "@Trell707 @warriors yeh man its his fault he got injured",
    "245": "@warriors bust",
    "246": "@warriors Oh no, this can't be",
    "247": "ESPN Sources: Golden State Warriors center James Wiseman has been ruled out for the rest of the season and will continue rehabilitating his right knee. Wiseman has been recovering from 8... #mobilsocial https://t.co/St15A2WMcK",
    "248": "@warriors Wishing for a full recovery of Wiseman! Haters will always hate. Focus on your recovery to come back  strong!! https://t.co/tA3SOXUXgh",
    "249": "@warriors You lot played yourselves.. should have signed a C… @StephenCurry30 should be fuming .. u lot cost him another championship..",
    "250": "Game-Time Decisions: Wizards (30-42) Vs. Golden State Warriors (48-25) Sunday, March 27, 2022. \n\nRead More: https://t.co/pOoW4RTHkU https://t.co/xCyA6lkCtg",
    "251": "@3bycurry @warriors He’s 20, chill",
    "252": "@warriors Wishing for a full recovery of Wiseman! Haters will always hate. Focus on your recovery to come back strong. https://t.co/dvvw6vw0eG",
    "253": "@warriors It’s his strength and conditioning.  Can’t believe he’s missing an entire year. Dude should have bad working out furiously after 6 months to get in game shape.",
    "254": "James Wiseman won't rejoin Golden State Warriors this season, sources say\nhttps://t.co/VM8V3nu24n",
    "255": "@GorgoVidal @mercihoops @niallmcgirr1 @dshih199 @AshuLeRat @warriors Like 28th pick vs 3rd pick Poole  was developmental guy and he’s showing it",
    "256": "@warriors Kerr and Myers useless.",
    "257": "@warriors “first 73”",
    "258": "@warriors Sign Gasol",
    "259": "@WashDCWiz @dshih199 @AshuLeRat @warriors It was right there",
    "260": "@warriors shut up. centers will turn Shaq against us",
    "261": "@SadNinersFan_ @warriors Niners should've drafted parsons instead of lance",
    "262": "@warriors Here come these stupid ass statements",
    "263": "@Trell707 @dshih199 @AshuLeRat @warriors That would be interesting to see",
    "264": "@mercihoops @niallmcgirr1 @dshih199 @AshuLeRat @warriors poole's 2 years older than lamelo and has been in the league longer. why would waiting another two years HELP jordan poole here?",
    "265": "Report: Warriors C James Wiseman out for season #GoldenState #Warriors #NBA https://t.co/bSXKdG2UzH",
    "266": "🚨#NBA Matchups of the Night🚨\n\n🌉Atlanta #Hawks vs. Golden State #Warriors: https://t.co/nkooZj9Ifr\n\n🐺Dallas #Mavericks vs. Minnesota #Timberwolves: https://t.co/eZ5jQHBGQg\n\n🏀 Philadelphia #76ers vs. LA #Clippers: https://t.co/8SAByPJg6T https://t.co/fGcnvbvN8t",
    "267": "@warriors Oh you got to be shitting me",
    "268": "@warriors What’s new! Bob Myers now what?",
    "269": "@warriors BUST unfortunately😢",
    "270": "@warriors just sign Jordan bell back",
    "271": "@warriors Damn, that sucks. Hope he gets to play a full year next year. Can't imagine how frustrated he must feel.",
    "272": "@warriors I been telling y’all this fool is a bust",
    "273": "@ThomasW75634076 @warriors Agreed",
    "274": "@warriors Full ratio",
    "275": "@megbleachers @MJudahBrave @BlissCameron_ @warriors Fuck it robin lopez 😂",
    "276": "@warriors lol we all saw this coming right",
    "277": "@warriors They need to get rid of him",
    "278": "@WashDCWiz @dshih199 @AshuLeRat @warriors Exactly,Poole and lamelo would've been splash 2.0",
    "279": "@warriors Ffs 🤦‍♂️ is Willie Cauley-Stein still available??? We need any big we can get😭😭",
    "280": "@jackson49411211 @Con_Chron @warriors The chart doesn’t include this year but given the incredible amount of profit they earned during the Finals runs you’d think they were smart enough to save it for years like this.",
    "281": "@warriors Shit!",
    "282": "@dshih199 @AshuLeRat @warriors Nobody thinks that Poole is better than Lamelo lmao",
    "283": "@mercihoops @niallmcgirr1 @dshih199 @AshuLeRat @warriors lol Poole will never be on Lamelos level",
    "284": "@warriors Certified bust",
    "285": "@warriors Should’ve got Lamelo 🤷🏽‍♂️",
    "286": "@warriors Injury prone so far damn it",
    "287": "@warriors Looney and Dray gonna hold against the Jokics and Aytons of the world! They got your back big man! Stay safe and heal fully!",
    "288": "we only have one center in the g league his name is Mawugbe @warriors oh please get him.",
    "289": "@warriors Prob the best for his health gotta make sure he good",
    "290": "@jackson49411211 @MikeFitzTire @warriors How is stephs foot the wariross doctors fault",
    "291": "@warriors Bust",
    "292": "@PimpinMikeLowry @baby_face_goat @warriors He’s a nba player on a contender. He has to be ready for this moment.",
    "293": "@warriors Rest and get back 💪 next szn JWise! 🙏",
    "294": "🏀LIVE ~ Golden State Warriors vs Atlanta Hawks - NBA League 2022 🇺🇸\n📆 : On Friday. March 25 /2022 ⏰ : 6:30 PM\n🔴🎥𝑳𝒊𝒗𝒆 𝒔𝒕𝒓𝒆𝒂𝒎 𝒉𝒆𝒓𝒆 ➡️ https://t.co/Xu3gGnxcMl ✅",
    "295": "@warriors wasn’t a need to go after a big huh https://t.co/YhxpbgA73v",
    "296": "@FalyRoku @warriors Nah, Looney is a good defender, we're gonna be fine",
    "297": "@warriors Sad, so sad…🤦🏽‍♂️. Are we gonna get a big now or are we tanking?",
    "298": "@dupsidedown11 @warriors Stfu 3 seed with 3 all stars and a solid young core not to mention tonnes of trade capital. I can’t imagine what your reaction would be if you were a Thunder or Pistons fan.",
    "299": "@warriors trade him, i'm tired of this shit @warriors",
    "300": "Ngl I laughed off @MikeFitzTire when he said fire the doctors. But kd achilles, klay acl, steph hand, klay achilles, wiseman meniscus, dray back, now steph foot. U can’t tell me all this is a coincidence, the @warriors medical staff has failed. https://t.co/Qm4snuIxaG",
    "301": "@warriors bruh moment",
    "302": "JUST IN: Warriors center James Wiseman has been ruled out for the rest of the season as the team is focused on a long-term approach to his recovery, Golden State announced on Friday.\nhttps://t.co/4GkRFFlkVr",
    "303": "@mercihoops @niallmcgirr1 @dshih199 @AshuLeRat @warriors He probably better now , melo is inconsistent",
    "304": "@warriors Damn. What a disappointing season!",
    "305": "TIP: Atlanta Hawks - Golden State Warriors, T.Young 27.5+, 1.85 by #tipster wrmm (profit this month: +75.84)\n  #betting #Basketball #Atlanta #Hawks #Golden #State #Warriors",
    "306": "Won’t be watching but please win @warriors",
    "307": "@warriors Fucking",
    "308": "Woj 💣!!!!!!!!!! Warriors James Wiseman, out for the season (knee) @warriors @CBSNBayArea @KPIXtv @BigTicket_JW https://t.co/7uFWaOn3Lx",
    "309": "@warriors Oh shit",
    "310": "Golden State Warriors James Wiseman has been ruled out for the rest of the season due to a right knee injury. Source @wojespn #Warriors https://t.co/yE3ZT0MnTU",
    "311": "@warriors Bust",
    "312": "@MJudahBrave @BlissCameron_ @warriors It’s not about great, it’s about having a big period. We have no size.",
    "313": "@warriors Just",
    "314": "@warriors Iconic Error....\n\nImagine Lamelo and Kuminga on the break for a decade. https://t.co/XNwiz5CRDv",
    "315": "@warriors But ya could have went after boogie but nah. Stubborn ass ppl...that gm and Kerr",
    "316": "@warriors So can we add another big man to replace him? @GSWReddit",
    "317": "Thank God y’all passed on Lamelo @warriors https://t.co/WhCA1K7qGE",
    "318": "@warriors I'm not gonna say he's a bust yet since I can see his potential, but what I can say is that he's overhyped and he didn't live up to that hype, which resulted in him being a disappointment.",
    "319": "@warriors Hopefully Wiseman recovers in time for Vegas Summer League. I’d like see what he can do against this year’s top draft picks in Vegas. Holmgren, Duren and Banchero vs. Wiseman.",
    "320": "@SeanP_Small @warriors thank you so much!! 😁🙏",
    "321": "@warriors We could’ve had LaMelo 🤦🏿‍♂️",
    "322": "@warriors get well soon 🙏 (SO WE CAN TRADE U )",
    "323": "@warriors Kevon looney https://t.co/l5qlGkBKbH",
    "324": "@warriors It’s getting hard to be a Warriors fan. 3 consecutive years and counting w/out a healthy roster… it can’t all be bad luck…",
    "325": "@warriors And our FO decided not to find a big man https://t.co/cqZS4PemHn",
    "326": "@dshih199 @warriors Yeah you’re right",
    "327": "@warriors Waived him!! Warriors need bigman in playoffs just sign big man in remaining of season! Wtf!",
    "328": "@warriors What a shocker… if only we had a back up plan",
    "329": "Pregame with @warriors Head Coach Steve Kerr. The Warriors visit the @ATLHawks tonight in Atlanta. He was asked about shutting down James Wiseman for the year. Kerr stated, “We are protecting his future.” @FortyEightMins #DubNation #NBA75 https://t.co/HHV5wEXArO",
    "330": "@warriors There goes the championship dream, we all saw this coming and yet they refused to sign a center.",
    "331": "@dshih199 @AshuLeRat @warriors Who cares warriors would have had lamelo 😂",
    "332": "@warriors Soo sorry to hear this.  💔   Get him healthy for next season. He has a bright 🌞 future ahead of him. 🏀\n\n#DubNation",
    "333": "@warriors Come back stronger young gun💪🙏",
    "334": "@warriors Man Wtf https://t.co/RKjnUfwls6",
    "335": "@warriors @SteveKerr trade wiseman !",
    "336": "@warriors Y didn’t we sign a BIG LIKE WE TOLD U TO 😭",
    "337": "@warriors Warriors version of Dee Ford",
    "338": "@warriors Draft Timme!",
    "339": "@warriors Wow, very disappointing news considering they DON'T HAVE ANY SIZE!!!! 1st round exit. Dam",
    "340": "@tru3azy @warriors Uhm well I have no better question if I’m on the court and living my dreams. I had box seats with full buffet. Oh and we had court side seats to watch them warm up.",
    "341": "@warriors You know what I'm gonna stick with this team till the end even without steph! I believe this group of players can still achieve alot of success and go far without our key players!!",
    "342": "@RhysBigDog @warriors They might try to run him out there during summer league. If wiseman looks good against this year’s top draft picks maybe they keep him. It could increase his trade value if he plays well.",
    "343": "@warriors Could have had lamelo",
    "344": "@warriors Damn! They’re really hoping he turns it around like Embiid if not he’ll go down as a bigger draft day bust in W’s history \nTodd fuller at least had a couple of decent years 😂",
    "345": "@3bycurry @warriors I still believe in him🤷‍♂️",
    "346": "@BlissCameron_ @warriors Who?  \n\nWho is this great back up big thats just sitting there that will play for cheap?",
    "347": "@warriors Huge gamble by Myers not making deadline trades ..... a gamble that we all lost.",
    "348": "@warriors Get well soon bro ♥️",
    "349": "@warriors All behind a meniscus? Must be more to this injury. This really sucks I’m still hoping for the best for the young man.",
    "350": "@warriors Get well soon❤",
    "351": "@warriors @Flight23White thoughts",
    "352": "The Golden State Warriors officially announced that center James Wiseman is out for the season.",
    "353": "@warriors hoping he gets better and gets right for next season. he’s gonna be special. shame on the front office for not getting some help for him and looney.",
    "354": "@warriors Good, get him fully healthy for his first summer league and first preseason.",
    "355": "@warriors Sad. But I'm glad that they are being cautious with the young man. He has a bright future if they don't push him.",
    "356": "@warriors Oh shoot. Should have traded  or bought out another big. Now what?",
    "357": "@warriors FUCK",
    "358": "@warriors Don’t forget how long it took Embid to get on the floor…",
    "359": "@RhysBigDog @warriors Highly doubt it.",
    "360": "@warriors @anthonyVslater SIGN A GLEAGUE BIG MAN",
    "361": "@warriors I would say give it a run this year and really work for next year, get everyone healthy and get the rotations down. Maybe do some stuff in free agency too",
    "362": "@warriors @anthonyVslater y'all need to rest looney tunes until the playoffs we need to preserve him ! 🫠",
    "363": "@baby_face_goat @warriors Loon dog built for this🙌🏾",
    "364": "@warriors We actually drafted a bust man https://t.co/F0qoUog4qX",
    "365": "@warriors The ramping up is over",
    "366": "@warriors Now THIS dude needs to go to Mark Jackson’s church @AndyKHLiu",
    "367": "@wojespn Should’ve traded the pick for an all star veteran like Bradley Beal…congrats @warriors",
    "368": "@AshuLeRat @warriors If we got lamelo instead of wiseman, who knows what that could have done to jordan pooles career…",
    "369": "@warriors @anthonyVslater We ain’t winning shut",
    "370": "@warriors Man I really really hate that",
    "371": "@warriors 100% sidelining him to try and maintain some value in him. Scared to play him and expose for what he is. Almost guaranteed to be traded in the off season",
    "372": "@warriors @anthonyVslater Looney and Draymond will be out for the 2022-2023 season as well (back).",
    "373": "@warriors Speedy recovery Wise",
    "374": "@wojespn @warriors Also, if Wiseman is not ready to go by game 1 next season…we need to have a conversation about his future. By that, I mean him being on a different team. #DubNation",
    "375": "@warriors @dannyTundra77 I can take it down the lane to the hole against the dubs non existent inside presence …",
    "376": "@baby_face_goat @warriors They don’t care if they did we would of been had another center 🤦‍♂️",
    "377": "@warriors God is punishing us for making that super team, we can never get healthy anymore",
    "378": "@warriors Who is a good fit for the DUBS",
    "379": "@baby_face_goat @warriors don't jinxed it 😭",
    "380": "@honestGSWfan @warriors If losing “you guys” if winning “we”💀",
    "381": "@warriors Sucks. Waste of a pick",
    "382": "@warriors bust",
    "383": "@warriors But y'all didn't want to get a big man, right? Man, fuck this shit",
    "384": "@warriors We need size !!",
    "385": "@warriors Prayers up. Kuminga clears anyways",
    "386": "@warriors Lmao now we have no backup center if looney gets hurt 😂",
    "387": "@warriors If we play against denver in first round playoff we are in big big trouble",
    "388": "@warriors guess I'll die https://t.co/eKFKfo1hCl",
    "389": "@warriors We knew this bitch",
    "390": "@warriors Bust🥱",
    "391": "@warriors I read the first part and I was expecting it to say he’s gonna play tonight😭",
    "392": "@warriors We need a big",
    "393": "@warriors Still have high hopes for you 🙏🏾",
    "394": "@warriors @Uncle_Alchemy Time to trade his ass",
    "395": "@warriors Bro. Is it too late to hit up Marc Gasol or somebody lmao",
    "396": "@warriors now we lose in the playoffs thanks bust bustman",
    "397": "@warriors Damn… I was hoping he would play this year.",
    "398": "@warriors FUCK FUCK FUCK https://t.co/DlvbGH0SDw",
    "399": "@warriors das wron",
    "400": "@warriors PLAYOFFS?!",
    "401": "@warriors omfg",
    "402": "@warriors I hate life",
    "403": "@warriors Being a warriors fan is pain right now",
    "404": "@warriors Definition of a bust 💀",
    "405": "@warriors Shitter",
    "406": "@warriors SIGN A BACK UP BIG RN",
    "407": "@warriors B U S T",
    "408": "@warriors Life cant get any worse",
    "409": "James Wiseman, who has missed the first 73 games of the 2021-22 season after undergoing surgery to repair a meniscal tear in his right knee, will be sidelined for the remainder of the season, including the 2022 NBA Playoffs. https://t.co/ebv6ILitHy",
    "410": "@SteveBermel @warriors @ATLHawks I’m landing this one!",
    "411": "the golden state warriors select james wiseman https://t.co/Geq4x3ZslY",
    "412": "@JimmySportPicks @warriors @ATLHawks I’ve been ice cold. I need one to hit today!",
    "413": "Golden State Warriors big man, C James Wiseman has been ruled out for the remainder of the 2021-22 season (playoffs included). He’s continuing his rehab from his torn meniscus in his right knee #NBA #Warriors",
    "414": "@wojespn So we are gonna go the whole season with Kevon Looney as our ONLY Center 😂😂😂 we couldn’t have dropped Chiozza or Lee to pick up a big man on the vet minimum? Thought our FO was lightyears ahead…guess not. @warriors #DubNation",
    "415": "@DurrellMorris @warriors @ATLHawks Shall I drop it?",
    "416": "oh y’all better pay looney UP this off season @warriors",
    "417": "@warriors Can’t be serious https://t.co/mqmBimuNfn",
    "418": "How do y’all feel about a SAME GAME PARLAY for @warriors vs @ATLHawks?\n\nEnough interest and I’ll get it done ✔️",
    "419": "Get a center or consequences @warriors",
    "420": "The Atlanta Hawks host the Golden State Warriors and it's tonight's NBA system with a success rate of 77% ATS the past five seasons, tip time is 7:30 ET. Tonight's comp on this game is also noted by clicking onto the NBA link at the top of the Home Page @ https://t.co/d8xZ5Sor6K.",
    "421": "Pregame with @ATLHawks Head Coach Nate McMillan. The Hawks face the @warriors tonight at home in Atlanta. @FortyEightMins #TrueToAtlanta https://t.co/oXe27gKnOz",
    "422": "Bay Area sports fans are horrible on ideas &amp; decision making 😂 y’all make no damn sense. Everyone thinking their a manager. All I’m hearing is “I think they should do this” lol thats why y’all spectators and not GMs. @49ers @SFGiants @warriors",
    "423": "@_NFTU @TheFirstMint @KlayThompson @RecurForever @WSUCougars @WSUCougarMBB @warriors Boomin lololol",
    "424": "#NBA75- #NBA: #GoldenStateWarriors/#AtlantaHawks; Who U got-#Hawks/#Warriors?\n@warriors \n@ATLHawks  \n@NBATV   \n@NBA",
    "425": "Just get rid of james wiseman @warriors smh",
    "426": "Breaking: Golden State Warriors center James Wiseman will be shut down for the remainder of the NBA season. (Per @wojespn)",
    "427": "@ChaseCenter @StephenCurry30 @warriors Nice",
    "428": "@gotmeadadbod @JonathanKuming6 @BizzyBones11 @nbatopshot @roham @Eisenberg43 I believe Kuminga since I’m ranked #303 in the @warriors leaderboard but sadly I finished RS too late to get Bones 😞 https://t.co/NvmJ0iHHW8",
    "429": "Thank you @warriors https://t.co/2VlQ1dqLAu https://t.co/wPdEquPyw0",
    "430": "@warriors y'all gonna try to get a big lol https://t.co/OHju3fHl2p",
    "431": "Thank you @warriors for gift wrapping Lamelo to the hornets 😎",
    "432": "Ok\n\nSign a big now @warriors https://t.co/F0AuBGG9dW",
    "433": "The Golden State #Warriors have ruled C James Wiseman out the rest of the season and will continue knee rehab following meniscus surgery per ESPN. #NBA https://t.co/VIBXxilZgH",
    "434": "@rayalmeda @warriors oof sry man",
    "435": "@wojespn Can we finally go after a Center @warriors",
    "436": "ABDOLUTE WASTE OF TIME @warriors https://t.co/U2aEyIbQyM",
    "437": "An absolute blow for the @Warriors. We keep on trucking. Yes, our title hopeS - still a chance - will rest on health and small ball… https://t.co/mXtEosLgTD",
    "438": "#Warriors center James Wiseman has been ruled out for the rest of the season and will continue rehabilitating his right knee. Wiseman has been recovering from a meniscus repair last April, and Golden State has been cautious to protect him long-term. https://t.co/By0BU5SXWj",
    "439": "Golden State Warriors player James Wiseman has been ruled out for the rest of the season and will continue rehabilitating his right knee.",
    "440": "@DemocratWit Watch the @StanfordWBB play on or the @warriors play.  Can’t watch &amp; keep thinking about toxic stuff",
    "441": "ESPN Sources: Golden State Warriors center James Wiseman has been ruled out for the rest of the season and will continue rehabilitating his right knee. Wiseman has been recovering from a meniscus repair last April, and the team has been cautious to protect him for the long-term.",
    "442": "🏀NBA🏀\nAtlanta Hawks vs Golden State Warriors\n\nComing off a much-needed 118-104 win against the Miami Heat, the Golden State Warriors snapped a three-game losing streak.💪 https://t.co/S15kxRbgGB",
    "443": "Can the #Warriors follow up the win in Miami with another in ATL? Back to full strength (Steph excluded) should mean yes. No one resting tonight. \n\n@warriors LIVE from 3-4 PM on @957thegame! \nhttps://t.co/1hQ0NML2zL",
    "444": "Warriors, Come Out &amp; Play: Golden State Warriors vs. @ATLHawks (@SportsbyShayla &amp; @eldorado2452 Preview)\nhttps://t.co/iJf3dTSEIH",
    "445": "Warriors, Come Out &amp; Play: Golden State Warriors vs. Atlanta Hawks (Preview) https://t.co/BRGyJ8zggp #TUT",
    "446": "@warriors These really the worse fits ever 🥴",
    "447": "Miami Heat vs Golden State Warriors Game Thread\n\n⬇️ ⬇️ ⬇️",
    "448": "Warriors, Come Out &amp; Play: Golden State Warriors vs. Atlanta Hawks (@SportsbyShayla &amp; @eldorado2452 Preview) #TrueToAtlanta\n\nhttps://t.co/cYFJn2HanJ via @theseurbantimes @Livehiphopdaily",
    "449": "@Trysta_Krick just said the @warriors are going to go out in the 1st round because teams will blitz Curry and make Wiggins beat them “which he can’t, clank/clank/clank” she says. Guess she forgot who the 2nd&amp;3rd option is. Keeping this for future reference 😂 #DubNation",
    "450": "NBA:🏀\nCharlotte Hornets +4 -110 [1]\n\nDetroit Pistons -4.5 -110 [1]\n\nGolden State Warriors +2.5 -110 [1]\n\nDallas Mavericks +3.5 -110 [1]\n\nMiami Heat -8 -110 [1]\n\n#apuestas #apuestasdeportivas",
    "451": "@pooleparty_3 @warriors not wiggs",
    "452": "@warriors it's our god",
    "453": "@KingCarterMomon @basketballreelz @NBATV @warriors @ATLHawks @sixers @LAClippers Facts poole been going crazy",
    "454": "Interesting note: 24 years ago this week, the Arkansas women's basketball team defeated Duke in the Elite Eight at the Golden State Warriors' old home arena in Oakland. \n\nThe Razorbacks' men will try to do the same tomorrow at the Warriors' new arena in San Francisco.",
    "455": "On our way to @StateFarmArena @ATLHawks @warriors #fridayvibes #nba",
    "456": "Great article on the why @Buddy_Franklin is so unique for our great game. I have always thought his ability to covert 45m+ is much like Steve Curry’s game changing 3 scoring zone and what @warriors did to spread the defensive zone of the opposition https://t.co/iVQZLu3kF9",
    "457": "@bacxnnn @warriors i’ll come back to this. ur right",
    "458": "@colinwe49573922 @warriors Bro what",
    "459": "@warriors poole masterclass🙏",
    "460": "@warriors Poole party bitches",
    "461": "@warriors curry is overrated",
    "462": "@warriors Poole finna drop 40 on their heads",
    "463": "@warriors Poole and wiggins 30+ incoming",
    "464": "@warriors Post Poole",
    "465": "📅 26-03 at 23:30 UTC\n🏀 Atlanta Hawks - Golden State Warriors\n🎯 J. Poole under 3,5 rebounds \n💸 1,90\n💰 3 (0,6%)\n📗 betFIRST\nℹ️ Hannes\n\nArgumentatie: https://t.co/lLbpY3VabE",
    "466": "@SanYEGcisco @warriors @JonathanKuming6 @nbatopshot Damn",
    "467": "Donate in March and you’ll be entered to win one of TWO pairs of tickets to see the Golden State Warriors play Lebron James and the LA Lakers at the Chase Center on April 7!\n\nLearn more about our Spring Drawing at https://t.co/PDRBnM6Puk.\n\n#givebloodSBC https://t.co/vf8tOM8lrq",
    "468": "The Golden State Warriors were the winning pick this Wednesday, can they do it again tonight against the Atlanta hawks? 🔥 \n\n🏀 #DubNation vs. #TruetoAtlanta\n\n#NBA75 #RXPicks \nhttps://t.co/vLO8Ewfc8p",
    "469": "3:25:22 5:00 P.M. ISSA @warriors KINDA DAY.....COME ON LET'S GOOOOOOOOOOOOOOO #KINGS 👑🙏🏾🧘🏾‍♀️💯💝💫💛💙💛💙💛💙💛💙💛💙💛💙💛💙💛💙💫💫💫💫💫💫💫💫🌠🌠🌠🌠🌠🌠🌠🌠🌅🌅🌅🌅🌅🌅🌅💯💯💯💯💯💯💯‼️‼️‼️‼️🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾 https://t.co/9TUQInySnr",
    "470": "At State Farm Arena ahead of #Hawks vs Warriors tonight in Atlanta \n\nGolden State on the floor getting warm. @11AliveNews https://t.co/But46UdXT5",
    "471": "@warriors Bench the Vets! We are only interested with the Rookies lead By JP3",
    "472": "@hoodiedoms This is 🔥🔥🔥, been telling everybody @warriors are coming this year. Nobody wants to see us in the playoffs",
    "473": "Need wins from @hornets , @warriors and @Timberwolves",
    "474": "5-Leg, low entry builder for Hawks - Golden Stat game. #GamblingTwitter #Hawks #goldenstatewarriors https://t.co/xtJYyVLBoR",
    "475": "Joe Lacob, owner of the @warriors, wants you to know that Journey and John Mayer are playing at SF’s @ChaseCenter REALLY BAD",
    "476": "@KlayThompson @warriors My son Riggins is the biggest Klay Thompson fan and asked for tickets to see him play for his 8th birthday.  We will be there on Sunday against the Wizards. It would mean the world to him to be able to meet Klay or be able to take a picture with him.",
    "477": "@warriors Now make the shots during the game..👏🏿👏🏿👏🏿",
    "478": "March 25th: Full card is posted\nhttps://t.co/F1tJRXiabe\n\nFREE PLAY OF THE DAY:\nNBA: Golden State Warriors +3 (7:40PM) EST",
    "479": "@_marioorozco @warriors @NBCSAuthentic @NBATV @957thegame @betwayusa come on brother, miami lost to the sixers without embiid and harden, you talk as if they were the 96 bulls, they played like trash",
    "480": "@warriors @ChaseCenter @mosesmoody @RazorbackMBB LET's go 🔥",
    "481": "@warriors @futurefitapp @KlayThompson Make it happen guys.",
    "482": "Without Curry, Poole and other young Warriors step up - The San Fra... (The San Francisco...)\n\nWithout Curry, Poole and other young Warriors step upGolden State should stick with what's w...\n\nAdd your highlights:\nhttps://t.co/A0JZJLiof5\n #GoldenStateWarriors",
    "483": "@warriors Jonathan Kuminga flight day!",
    "484": "Andre Iguodala 'getting closer,' won't play in Warriors game vs. Hawks (East Bay Times)\n\nATLANTA - Forward Andre Iguodala is &amp;quot;getting closer&amp;quot; to being cleared to play and ...\n\nAdd your highlights:\nhttps://t.co/zBeyWnuXBT\n #GoldenStateWarriors",
    "485": "@warriors He tried to tell him 🤷‍♂️",
    "486": "@warriors İ rave for more Jordan Poole!",
    "487": "1-2 vs the @warriors so I get what he’s saying… #Dubs https://t.co/WwLVFUyRPE",
    "488": "Adding Warriors ML to my picks tonight #NBAPicks #NBATwitter #goldenstatewarriors",
    "489": "@rahupnext20 @ATLHawks @ChickfilA @warriors @StateFarmArena @BallySportsSO @NBATV @929TheGame Jordan Poole been balling so y’all better lock my man up 💯",
    "490": "@ATLHawks @ChickfilA @warriors @StateFarmArena @BallySportsSO @NBATV @929TheGame Jordan Poole time",
    "491": "Golden State Warriors fans need these City Edition bobbleheads – NBA News https://t.co/HqbiWQLGZV",
    "492": "@FRDYeth @zxckblxck @LazyLionsNFT @SacramentoKings @warriors @AshurNFT @NineNft @AR_ON_tweets @WoozyPelican @DirectorJayC So awesome!!! 🦁📈",
    "493": "@warriors @Clorox Poole playing like young Curry..like two Kumingas post-up shots it change everything if he can make that as a weapon",
    "494": "@reesetheone1 However people feel about the MJ vs. LeBron debate, MJ clearly played in the more physical era. \n\nGolden State Warriors don’t make their run in MJ’s era, either. Allowable defense was just too rugged.",
    "495": "Steve Kerr might be the greatest hindrance to the Golden State Warriors' 2021-22 championship hopes.\n\nActually, its the championship hopes of Bay Area Sports since the Niners lost that NFC Championship game at SoFi.",
    "496": "One would argue @Money23Green is that same person for the @warriors but I think if his coach was more outspoken we wouldn’t need to be. #DankerThoughts https://t.co/Y6nq3fExk8",
    "497": "@warriors @ChaseCenter @mosesmoody @RazorbackMBB Great Moody..!!! Continue to try 3pts shots, you are good on that.👍",
    "498": "The Golden State Warriors are trading George Hill to the Pelicans for two first-round picks.",
    "499": "Finally they combined two sports that I actually care about football and basketball, only that am a Chelsea fan who is a fan of Steph Curry and the Golden state Warriors! https://t.co/VV0f2TjfCL",
    "500": "@FRDYeth @LazyLionsNFT @SacramentoKings @warriors @AshurNFT @NineNft @AR_ON_tweets @WoozyPelican @DirectorJayC congrats!",
    "501": "@warriors @ChaseCenter @mosesmoody @RazorbackMBB Wooo pig Moses!!!",
    "502": "New kicks came in time to go to the @ATLHawks and @warriors game tonight. #Jordan1s #SneakerHead #DaddyDaughter #TrueToAtlanta https://t.co/kHwmtNZWwR",
    "503": "@DogSurfRoadshow @Con_Chron @warriors I’m ps those #s r without tax. I think this years total payroll is 330Mil. They still making a FAT profit tho",
    "504": "Andre Iguodala ‘getting closer,’ won’t play in Warriors game vs. Hawks #GoldenState #Warriors #NBA https://t.co/KqlehcyN8b",
    "505": "@jackson49411211 @Con_Chron Those figures supposedly include it, the @warriors were lucky so many of the big three’s initial contracts were on a bargain.",
    "506": "@warriors @ChaseCenter @mosesmoody @RazorbackMBB Appreciate the love! Awesome we are getting to experience this feeling again, and at such an amazing venue!",
    "507": "@FirstTake all due respect but u missed the obvious @warriors *started* 2 nineteenth y/o’s (thts the hook) &amp; sent @MiamiHEAT into a mental breakdown. U guys made Dray/KD arguing in 2018 a big deal but this, ohh nothin to see here 🤔..well, okay 👍🏽",
    "508": "NBA Player Props: Golden State Warriors vs Atlanta Hawks - @GumbyVreeland is planning on lots of threes flying tonight when the #warriors face the #Hawks \n\nhttps://t.co/rfyHGcU79i\n\n#nba #sportsbettingadvice #SportsGambling https://t.co/lbrnhmMPjZ",
    "509": "The Atlanta Hawks look to advance their playoff bid when they host the Golden State Warriors at the State Farm Arena tonight 🤩 \n\n#NBA #Forever404 #DubNation\nhttps://t.co/i5vaOcKKWb",
    "510": "@warriors JP plays today 😫😫",
    "511": "@NBAMEX @warriors @juanonjuan10 Ha de ser la de can't touch this",
    "512": "@SanYEGcisco @FabolousNft @warriors @JonathanKuming6 @nbatopshot I was 1 day off for the rising stars snapshot... 😭",
    "513": "@Brahim_7_ @GoIdenState Golden state warriors need to go get Dwight Howard from the Lakers. Dwight and Dramon would be awesome. Take the pressure off Wiseman!!!!",
    "514": "THE GOLDEN STATE WARRIORS ARE WINNING THE CHIP",
    "515": "@carlwoodson0505 @ScottyMuir_ @PaulTweetz2Much Teams Defense | Stats | https://t.co/tWy5S9WqWO\n\nTEAM\nGP\nW\nL\nMIN\nDEF RTG\nDREB\n1\nPhoenix Suns\n74\n60\n14\n48.1\n106.6\n35.6\n2\nMemphis Grizzlies\n74\n51\n23\n48.2\n108.8\n35.3\n3\nGolden State Warriors\n73\n48\n25\n48.1\n106.2\n35.8\n\nGSW are # 3 and he dropped 56, keep trying",
    "516": "Today we go against the @warriors at home.\n\nThe last time we faced them, Steph Curry dropped 50 points. However, he is out tonight.\n\nAgainst the Warriors:\n\nTrae Young: 28 PTS | 9 AST | 4 3PM\nBogdan Bogdanovic: 17 PTS | 3 3PM\nDelon Wright: 7 PTS | 5 REB | 2 AST | 2 STL https://t.co/Zi0jyTY5SU",
    "517": "@PWSuver @NBA @warriors Oooh naa,with God all things are possible my Brother",
    "518": "@warriors Still don't know, quit jiving!!!!!!!!!😆, Com on'",
    "519": "@FRDYeth @LazyLionsNFT @SacramentoKings @warriors @AshurNFT @NineNft @AR_ON_tweets @WoozyPelican @DirectorJayC Congrats King",
    "520": "@warriors @Oracle Sign a huge contract for him. Don’t let that fly away.",
    "521": "Check out this listing I just added to my #Poshmark closet: Golden State Warriors Flexfit Snapback Hat. https://t.co/GppnyCG88I #shopmycloset @poshmarkapp",
    "522": "@Cohen_CFC @VintageDidier @MadMontana He bought clippers in 2014 and they are noway near golden State warriors and Lakers",
    "523": "@GuyFieri @DJsClamShackKe1 Cool hat Guy. #GoWarriors @warriors",
    "524": "Today's NBA Picks: 8:40 PM ET - Golden State Warriors vs. Atlanta Hawks - 28 PICKS AVAILABLE: https://t.co/GIcgzvnRiW #nba",
    "525": "Anyone want 2 tickets for April 3rd 2022 Kings Vs. Warriors in Sac Town Row #109 for 400.00 total??? #SacramentoProud #Warriors #goldenstatewarriors thank you @LazyLionsNFT community 🙏 i wish i could go but am thankful to be a part of a communtiy that gives back to it's holders.",
    "526": "@CharleyCass @warriors @memgrizz @StephenCurry30 @JaMorant That’s why I strongly encourage kids to play football!!",
    "527": "@coasthawk If we find out that @moonsofmarsnft was the most elaborate guerilla marketing campaign for the Golden State Warriors… Imma be disappointed and mad impressed.",
    "528": "Stephen Curry Poster, Golden State Warriors Print, Kids gift, Gym, Man Cave Decoration, Basement, Boys Playroom Decor, Basketball Poster https://t.co/mc61Lo71Ln via @Etsy",
    "529": "Klay Thompson Poster, Golden State Warriors Print, Kids gift, Gym, Man Cave Decoration, Basement, Boys Playroom Decor, Basketball Poster https://t.co/JLOCBga0As via @Etsy",
    "530": "@HardenFinalsMVP @warriors Harden song?",
    "531": "Warriors: #Warriors G Jordan Poole is having an absurd season - Golden State Of Mind https://t.co/FRD6LYgcj3",
    "532": "Warriors: Atlanta Hawks vs Golden State #Warriors: Match Prediction, Injury Report... - Media Referee https://t.co/QV3EY3K26K",
    "533": "#Warriors @ #Hawks Free 2021-22 NBA Betting Prediction, Odds for Tonight. https://t.co/WGyuqRrg9Q #GoldenState will be without #StephenCurry tonight in #Atlanta. #KlayThompson #Tipster #TraeYoung #StateFarmArena #PeachState #FreeNBAPicks #SportsHandicapper",
    "534": "7:30pm ET; Fri, Mar 25\n\nGolden State Warriors\nAtlanta Hawks\n\n📺: NBA TV, \nBally Sports SE-ATL, NBC Sports Bay Area\n\n#LEGENDoftheMiamiHEAT #NBA75",
    "535": "@gillee @warriors @UniWatch @bjarmstrong @unstoppablebaby I cant imagine the jerseys for @Giannis_An34 @shaiglalex 🤔",
    "536": "@warriors @UniWatch @bjarmstrong @unstoppablebaby H/T to this Youtube Vid... https://t.co/TbBAFcWrg6",
    "537": "@warriors Please tell Steve to give JTA more minutes... we are also fans of the warriors and JTA @juanonjuan10",
    "538": "The mid-90s were tough for the @warriors but The City jerseys with the name on top (rounded!?!) might be the worst. @UniWatch @bjarmstrong #dubnation @unstoppablebaby https://t.co/K7hhmzQHkr",
    "539": "@PRADA00 1. New York Knicks\n• Value: $5.8 billion\n2. Golden State Warriors\n• Value: $5.6 billion\n3. Los Angeles Lakers\n• Value: $5.5 billion\n4. Chicago Bulls\n• Value: $3.65 billion\n5. Boston Celtics\n• Value: $3.55 billion\n6. Los Angeles Clippers\n• Value: $3.3 billion",
    "540": "Atlanta Hawks – Golden State Warriors | AI Analysis https://t.co/QASFtIFtct",
    "541": "@FRDYeth @LazyLionsNFT @SacramentoKings @warriors @AshurNFT @NineNft @AR_ON_tweets @WoozyPelican @DirectorJayC Congrats and enjoy King! Have fun 🦁",
    "542": "@warriors Buy U A Drank",
    "543": "@warriors THE SONG IIIIIIIISSSSS... KISS ASS . LOL .",
    "544": "AI-analys: Atlanta Hawks – Golden State Warriors https://t.co/1X8BdB45So",
    "545": "@warriors @ChaseCenter @mosesmoody @RazorbackMBB Jordan Poole plays Basketball tonight",
    "546": "@30Tamim @StephenCurry30 Hi Stephen curry number 30 I am your number 1 fan and I really like golden state warriors basketball game",
    "547": "Warriors fans were really mad when Steph Curry first came to Golden State 😂\n\n\"We really questioned the Monta Ellis trade. Who’s going to be our point guard? The little kid with the weak ankles? People was mad.” — @TooShort https://t.co/aHMVj4Cm2C",
    "548": "@Patch03805438 @warriors We really did 🤦🏽‍♀️. I’m so glad we could still listen to old hits though",
    "549": "@raiderman94 @warriors sorry to disappoint u",
    "550": "gotta show love, catch the action tomorrow at @ChaseCenter\n\n@mosesmoody x @RazorbackMBB https://t.co/GL0xsO6Lzq",
    "551": "@warriors Dray funny ash 🤣🤣",
    "552": "@FRDYeth @LazyLionsNFT @SacramentoKings @warriors @AshurNFT @NineNft @AR_ON_tweets @WoozyPelican @DirectorJayC congrats - wish you an amazing experience with the pride #ROAR",
    "553": "Golden State Warriors: What is Jordan Poole's ceiling? – NBA News https://t.co/8wm7QgRdFt",
    "554": "Alissa Rooney using the Easyrig &amp; Kong Quick Release Adapter from 16x9 Inc. to film the Golden State Warriors game 🏀⛹️👍\nPicture Credit: Alissa Rooney\n#easyrig #KongAdapter #16x9Inc #cameragear #cinematography #bts https://t.co/3Ih2voziWe",
    "555": "@mrclarkinc Yeah.  We got 2 young dudes that really pass that eye test.  So excited both for the present and future of the @warriors",
    "556": "@Dubs6x @warriors @NBCSAuthentic @NBATV @957thegame @betwayusa I agree except with the bay jerseys (yellow) but white and blue&gt;&gt;&gt; every jersey",
    "557": "@GuinepoZz @warriors @NBCSAuthentic @NBATV @957thegame @betwayusa They nice but not as good as the white, blue and the bay jerseys",
    "558": "@warriors Suprised hes not wearing a lakers jearsey",
    "559": "@ChiLocks @hatchermax18 @ChrisForsberger @isaachatcher311 Good morning! Sadly, the warriors wake up today the 3-seed, slated to play against the Nuggets. Unfortunately, Golden State is to lose this series to King Jokic and Daddy Bones",
    "560": "Analyzing Friday’s Golden State Warriors at Atlanta Hawks and lines, with NBA expert picks, predictions and best bets.  https://t.co/k3a8XJrCK7",
    "561": "@Dubs6x @warriors @NBCSAuthentic @NBATV @957thegame @betwayusa It's the best jersey",
    "562": "Golden State Warriors at Atlanta Hawks odds, picks and predictions https://t.co/Ps36JI31Y5",
    "563": "@GuinepoZz @warriors @NBCSAuthentic @NBATV @957thegame @betwayusa Well yea we have a positive record in every jersey, just seems we lose in bad fashion in these",
    "564": "@omar74416608 @warriors @futurefitapp @KlayThompson Let's have confidence will win\nBut Klay Thompson should be just patience with the ball",
    "565": "@Dubs6x @warriors @NBCSAuthentic @NBATV @957thegame @betwayusa We have a positive record with the black jersey bro",
    "566": "@FRDYeth @LazyLionsNFT @SacramentoKings @warriors @AshurNFT @NineNft @AR_ON_tweets @WoozyPelican @DirectorJayC Congrats 🎊 well deserved!!!",
    "567": "@GuinepoZz @warriors @NBCSAuthentic @NBATV @957thegame @betwayusa We tend to lose in horrible ways when wearing these",
    "568": "@Dubs6x @warriors @NBCSAuthentic @NBATV @957thegame @betwayusa These jerseys? Why",
    "569": "CONT:\n-Collectors who own a Legendary Golden State Warriors Moment, one airdrop per Legendary Warriors Moment owned\n-Collectors who own a Jonathan Kuminga 3-Star Rookie Moment\n-Collector who owns the Golden State Warriors 1/1 All-Star NFT",
    "570": "@JuanIsidro @warriors @NBCSAuthentic @NBATV @957thegame @betwayusa Only steph",
    "571": "📰 Atlanta Hawks vs Golden State Warriors Prediction and Odds | March 25!\n👉 https://t.co/z2xiiNP5KL @wagertalk",
    "572": "@warriors You knew basketball was good when the best players wore XXXL size jerseys",
    "573": "@FRDYeth @LazyLionsNFT @SacramentoKings @warriors @AshurNFT @NineNft @AR_ON_tweets @WoozyPelican Have fun King! 👏",
    "574": "Game-Time Decisions: Wizards (30-42) Vs. Golden State Warriors (48-25) Sunday, March 27, 2022. \n\nRead More: https://t.co/QlnsQMnVyC https://t.co/D0B0RKCzSO",
    "575": "Yeah, @warriors, we should have traded for Ben Simmons.",
    "576": "@warriors @NBCSAuthentic @NBATV @957thegame @betwayusa Get iiiiit!",
    "577": "@BMizener @BurnsieOriginal But the way he’s coached the Golden State Warriors to those championships. 😂\n\nI’ll show myself out.",
    "578": "@JoeandBullish @warriors @SFGate Get rid of your life",
    "579": "Game-Time Decisions: Wizards (30-42) Vs. Golden State Warriors (48-25) Sunday, March 27, 2022. \n\nRead More: https://t.co/pOoW4RTHkU https://t.co/Vvk7e0dlYO",
    "580": "God….bring back this golden state warriors 😭 https://t.co/kfwnSa8voN",
    "581": "@warriors Good luck to y’all",
    "582": "@CoreyB08 @celtics Typo Golden State Warriors sear licensing fees are $15,000 per seat. If you have 2 seats that’s $30k up front! 4 seats $60k. $200 may seem like a lot but paying over the tax line for Jaylen &amp; Jayson and more talent comes at a cost.Opening day Bleacher tickets at Fenway $172 Tix",
    "583": "@Money23Green SOLD YOUR SOUL TO THIS GUY😂😂😂 @StephenCurry30 @KlayThompson @warriors https://t.co/HMA4XG64q5",
    "584": "@ChaseCenter @StephenCurry30 @warriors Curry 🤓",
    "585": "@warriors trade this clown. Kuminga can be our 4 next year.",
    "586": "@Shibafox22 @Babolex @snoop @SnoopDogg @warriors @StephenCurry30 Shuttttt 🤫😅😂😂 https://t.co/8TiE4St6h4",
    "587": "🏀 The Atlanta Hawks host the Golden State Warriors in a fun Friday night NBA showdown.\n\n🏟 Warriors-Hawks pick by @SpreadAstaire \n\n#DubNation #TrueToAtlanta #NBATwitter\nhttps://t.co/yzZNgAErcZ",
    "588": "I smell a W for the @warriors 💙💛 https://t.co/rEFokHwUxz",
    "589": "@warriors I give up, what is the song?????",
    "590": "Golden State Warriors vs Atlanta Hawks NBA Pick and Prediction NBA Betti... https://t.co/eeOGv2FUBe via @YouTube",
    "591": "@warriors Look at Poole man, so inspirational. The next leader of this team younger generation",
    "592": "Musselman reaches into @NBA  bag of tricks to win in his former pro-ball town. \n@RazorbackMBB @ArkRazorbacks @EricPMusselman  @warriors @ZagMBB @SEC @SECNetwork \n#wps #allHogs #DubNation #MarchMadness \nhttps://t.co/eQlTAQW9je",
    "593": "@warriors Y’all niggas are miserable lmao. Get off y’all knees 😂😂😂😂",
    "594": "Analyzing all the chaos in the Miami Heat's scuffle during the timeout | The Hoop Collective #GoldenState #Warriors #NBA Video: https://t.co/gLcrpwbBFV",
    "595": "@warriors And there's still time...",
    "596": "@Jordan096066245 @warriors @googlecloud Agreed 👍",
    "597": "Check out this listing I just added to my #Poshmark closet: $5 SALE Adidas Golden State Warriors Durant Tee Shirt. https://t.co/u2l5WVkQBh #shopmycloset @poshmarkapp",
    "598": "@warriors Only to come in and drop 4-5-3 😪",
    "599": "@pooleparty_3 @warriors He's a star in my book now. Deadly confidence. The bb gods are crowning a new All Star  🌟",
    "600": "@warriors prob something that name dropped lebron",
    "601": "@warriors @futurefitapp @KlayThompson Headband Klay is back!",
    "602": "@rvsseldn @warriors Circus shot Showtime!  🌟🔥",
    "603": "@omar74416608 @warriors @futurefitapp @KlayThompson but wen he goes off, you got a fatass smile on yo face",
    "604": "@CHlGABOO @warriors @futurefitapp @KlayThompson Injured..",
    "605": "@warriors Jermaine Dupri, Welcome to Atlanta",
    "606": "@Swaggerboyplayz @warriors The scene with Steph jumping sidewise in full \"mafia man\" velour track suit will live in my mind forever. 😹",
    "607": "@warriors @futurefitapp @KlayThompson pls score 20+ each",
    "608": "Today's matchup is live:\n⚔️ Golden State Warriors @ 🦅 Atlanta Hawks (ATL -2.5)\nMake your pick before 7:30 PM EDT!\nhttps://t.co/vk5NH6RGTR",
    "609": "@warriors @futurefitapp @KlayThompson follow back please",
    "610": "@warriors @futurefitapp @KlayThompson Klay play. We will lose",
    "611": "@warriors @futurefitapp @KlayThompson Where is curry",
    "612": "morning prep \n\n@futurefitapp || Road Reps https://t.co/nqmT5Bv6fK",
    "613": "@warriors Kerr knows how to push JP buttons - don't settle for 6th man, shoot like an All Star! 🔥",
    "614": "🔴Live▶ Golden State Warriors vs. Atlanta Hawks - NBA League 2022\n🔴Live Here➠ https://t.co/Gf1Hcj83FI\n📅 : Friday, March 25, 2022\n⏰ : 7:30 PM",
    "615": "@warriors Big steppin",
    "616": "All 4 thugs released &amp; put on home detention. This is not progress…this is progressive policies. What if this was you or your kids who were attacked?  #sanfrancisco #londonbreed #chasecenter #recallchesaboudin #California #goldenstatewarriors #safersfwithoutboudin #gavinnewsom https://t.co/B92a8OW0c3",
    "617": "@warriors please lose",
    "618": "NBA 🏀 Temporada: 95-100\n\nViernes 25/3:\n\nGolden State Warriors vs Atlanta Hawks O220.5 (-110)\nHouston Rockets vs Portland Trail Blazers O234 (-110)\nMinnesota Timberwolves -3 (-110)\nJalen Green - Houston Rockets O19.5 (+137)",
    "619": "@warriors “Lebron’s Bitch”? Only joking",
    "620": "Going to ATL for @warriors game with my boy! Hate that @StephenCurry30 is out, but I know the struggle. I had to wear my boot for 6 weeks, but I'm out of mine just in time for the game! 🙌🏀 https://t.co/Acte3ZPjtv",
    "621": "The Golden State Warriors play basketball today against the Atlanta Hawks!",
    "622": "@warriors LEAN WITH IT ROCK WITH IT",
    "623": "@snom_zone @warriors why he wearin that tiny a** sweatshirt?",
    "624": "@warriors Crank that Soulja Boy",
    "625": "@warriors Juan didn't lipsync it. 🤔",
    "626": "@warriors Harden.",
    "627": "okay okay here’s a clue 🎶 https://t.co/g2SHSc9z8e https://t.co/3wCEK1jamb",
    "628": "@warriors Kash 4 Kars theme song",
    "629": "@warriors Anything bron is listening to",
    "630": "@warriors This one  https://t.co/gz4X3R90as",
    "631": "Warriors: Game Preview: #Warriors at Hawks - 3/25/22 | Golden State #Warriors - https://t.co/LGh5zS7nRT https://t.co/QGKUJl9BEU",
    "632": "Warriors: Golden State #Warriors still have a fighters chance at the title - Blue Man Hoop https://t.co/YpL4U0CFpa",
    "633": "@warriors I though he was in La going to watch LeFraud",
    "634": "@warriors probably denzel the goat curry",
    "635": "@warriors Prolly that\nhttps://t.co/ul5dZZJ4F0",
    "636": "@warriors I’m in love with the c*co",
    "637": "@warriors PLEASE CHANGE THE JERSEYS",
    "638": "@warriors It's a good thing there isn't a Lakers game on tonight, who would wanna play when LeBron is playing.",
    "639": "@warriors Probably whatever Lebron loves at the moment",
    "640": "@warriors Dray said https://t.co/7DTkqzZ1M2",
    "641": "@warriors Don’t post that traitor",
    "642": "@warriors something from thug, gunna, baby, or future",
    "643": "@warriors We gon be shampionship - LB",
    "644": "@warriors surprised he’s not watching the Laker game",
    "645": "@warriors Suprised dray not at bron house",
    "646": "shootaround in atlanta, guess the song 🎶 https://t.co/Ddbu6jNBpW",
    "647": "Visit us this Sunday!  We will be in front of the Chase Center celebrating Women’s History Month! See post for details to RSVP #PoundBizness @ Chase Center - Home of the Golden State Warriors https://t.co/dYpOuuwgN0",
    "648": "@boyabebuffalo14 @ESPNNBA @warriors I appreciate it but they really did go out first round. People forget 🤷🏾‍♀️ but they did win a couple more games than we did. https://t.co/2elklsLpEV",
    "649": "@warriors @NBCSAuthentic @NBATV @957thegame @betwayusa Rooting for my baby Poole and Andrew",
    "650": "@basketballreelz @NBATV @warriors @ATLHawks @sixers @LAClippers JP Vs Trae will be good",
    "651": "@ChaseCenter @StephenCurry30 @warriors He’s so pretty I want to cry😭",
    "652": "@NBA @warriors please start him over Wiggins/Thompson. It's not about how much you are paying a player it's about winning games.",
    "653": "#miamiheat players #udonishaslem and #jimmybutler get into heated exchange last night against #goldenstatewarriors. Udonis letting Jimmy know he’d beat his ass. #nba #erikspoelstra https://t.co/lABG7NwKiZ",
    "654": "@NBATV @warriors @ATLHawks @sixers @LAClippers Steph vs Trae match up would’ve been so fun to watch 😪",
    "655": "Start your weekend off with a 🔥 doubleheader on NBA TV!\n\n@warriors vs. @atlhawks // 7:30pm ET\n@sixers vs. @laclippers // 10:30pm ET https://t.co/g5eAK0S6rb",
    "656": "@warriors @NBCSAuthentic @NBATV @957thegame @betwayusa Poole, Klay, Draymond and Payton are playing basketball tonight",
    "657": "@CHawks901 @ESPNNBA the @warriors had reached the 2nd round of the playoffs prior to the 1st round exit the following year, but i get what you saying tho.",
    "658": "@DukeNation89 @WavyCrockett8 @joshuaemberlin @TheNBACentral Ok but when lebron gets jumped by 4 hall of famers alone it’s a different story? He should’ve won right ? Jordan couldn’t even beat the pistons until they dried out of age. Jordan never faced a golden state warriors dynasty nor did he face a spurs. Keep the same energy.",
    "659": "🏀NBA\nWarriors (48-25) @ Hawks (36-37)\n⏰7:30 pm EST\n📺NBA TV\nSpread: ATL: -2.5 (@FDSportsbook)\n\nEven without Steph, Klay, or Draymond, the Warriors managed to take down the top-seeded Heat in their last game\n\n(📽️ @warriors) https://t.co/gdD10zmcPC",
    "660": "@ChaseCenter @StephenCurry30 @warriors Damn bae don't be cheesing so hard you only do tht for me🥰🥰",
    "661": "@warriors @NBCSAuthentic @NBATV @957thegame @betwayusa Are Steph, Klay and Dray missing today’s game too?",
    "662": "@warriors @NBCSAuthentic @NBATV @957thegame @betwayusa Win It Im Betting My House On You",
    "663": "@warriors @NBCSAuthentic @NBATV @957thegame @betwayusa man if we lose this game with Klay and Dray after beating the #1 seed without our starters, imma lose my shi",
    "664": "@warriors @NBCSAuthentic @NBATV @957thegame @betwayusa Hope we can still get that 50 wins",
    "665": "@warriors @NBCSAuthentic @NBATV @957thegame @betwayusa Please stop wearing these man",
    "666": "@warriors @NBCSAuthentic @NBATV @957thegame @betwayusa Stop trae we win",
    "667": "Touched down in A-Town\n\n🏀 GSW at ATL\n🕖 4:30pm PT\n📺 @NBCSAuthentic &amp; @NBATV \n📻 @957TheGame\n📱 https://t.co/ZkjPJjiF76\n📝 https://t.co/JnfUD2dBjm\n\n@betwayusa || #DubNation https://t.co/Hf3B07mo3o",
    "668": "NBA Player Props: Golden State Warriors vs Atlanta Hawks - @GumbyVreeland is planning on lots of threes flying tonight when the #warriors face the #Hawks \n\nhttps://t.co/9DAgz6RjMt\n\n#nba #sportsbettingadvice #SportsGambling https://t.co/D8qdOVbVxz",
    "669": "@ChaseCenter @StephenCurry30 @warriors Curry",
    "670": "@currybuu @warriors Goodluck to y'all",
    "671": "Georgia... Are you looking for something to do this weekend? There is so much to do from the Atlanta Hawks vs Golden State Warriors, the Atlanta Science Fair, Georgia Food + Wine Festival, 70s Party at the Georgia Aquarium, Bad Bunny Concert, and more. https://t.co/FkXKtaB91z",
    "672": "Today's NBA Picks: 8:40 PM ET - Golden State Warriors vs. Atlanta Hawks - 11 PICKS AVAILABLE: https://t.co/GIcgzvnRiW #nba",
    "673": "Warriors allow an average of 29.2 PPG to guards, and Trae when he is on is an elite shooter....after a disappointing loss and performance against Detroit he should be dialed in for the Golden State\n@Lloyds_Locks @MeganMakinMoney @stoolpresidente @TrellJSports @BookitWithTrent",
    "674": "@ThadCapper @LeBronGoCrazyy @warriors Guy clears steph on any ranking easily lmao, does that make steph overrated?",
    "675": "The Detroit Pistons and Golden State Warriors, recently similar teams, as we all would expect. https://t.co/IzKX5AN2Og",
    "676": "@warriors Steph curry rehab day🤞🤞🤞",
    "677": "@BobRathbunTV @HawksOnBally @ATLHawks @warriors @DWilkins21 @mrvincecarter15 @laurenjbara @TreavorScales @ReneeMontgomery Good afternoon Unk Bob!!!!!💯💯💯💯💯",
    "678": "We bought my son tickets for Christmas to see the @warriors at the @memgrizz Monday night.  @StephenCurry30 and @JaMorant, his favorites, are injured and he won't get to see them play...  and his bracket got busted when Arizona got beat.  Basketball can be tough on a kid. https://t.co/jzRoeKAQgD",
    "679": "What's #Best on https://t.co/wNwLoFi3qW ?\nInside The Training Room : Damion Lee\nhttps://t.co/aDsJDBUa1s\n#sports #goldenstatewarriors #goldenstate #warriors #gsw #dubs #dubnation #dubnation https://t.co/ursRWI4g6m",
    "680": "What's #Best on https://t.co/NQOcMymrqQ ?\nInside The Training Room : Damion Lee\nhttps://t.co/McuvimyleE\n#sports #goldenstatewarriors #goldenstate #warriors #gsw #dubs #dubnation #dubnation",
    "681": "@CL13_Sebas @Money23Green @warriors @mavcarter Tbf they’re really close friends off the court. Let’s say you had a best friend and he was about to make a big achievement. Obviously you would play against him but you’d be happy for him at the same time. I still think he’s a great leader. We saw how GSW played when he was out",
    "682": "@Sherman721 I dunno man....I think the Suns come outta the West. Everyone below them has major question marks, including the Warriors. Golden State's beaten them 2 outta 3 times so there's a shot, but I just don't buy into the Warriors much right now",
    "683": "game day😈 @warriors",
    "684": "@warriors Sadly Draymond won't be at attendance, he's too busy sucking Lebron's dick",
    "685": "DasHaus made a bet!\n\nEvent: Golden State Warriors vs Atlanta Hawks #NBA\nBet: Atlanta Hawks TO WIN -2.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "686": "DasHaus made a bet!\n\nEvent: Golden State Warriors vs Atlanta Hawks #NBA\nBet: Golden State Warriors TO WIN +2.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "687": "Game-Time Decisions: Wizards (30-42) Vs. Golden State Warriors (48-25) Sunday, March 27, 2022. \n\nRead More: https://t.co/pOoW4RTHkU https://t.co/MVPB9YnsyU",
    "688": "Game-Time Decisions: Wizards (30-42) Vs. Golden State Warriors (48-25) Sunday, March 27, 2022. \n\nRead More: https://t.co/QlnsQMnVyC https://t.co/oG8ao6HtAH",
    "689": "@warriors Poole 30 piece incoming...",
    "690": "@warriors It's gonna be hard to take Jordan out of the starting line up when Steph comes back but y'all should just keep him in the line up he definitely deserves it he scored 30 points against the heat like that definitely means something other than the fact hes  good not good he is great",
    "691": "@jasontbattle The Warriors are 15-15 without Draymond Green, i’ll say it again Draymond Green is the heart and soul of the Golden State Warriors and it’s not even close",
    "692": "@warriors The Warriors are defeating the number 1 seed teams as if its nothing! Something is up! We are winning the championship",
    "693": "Hey, @StephenCurry30! This is a half court shot with eyes closed, but my best friend's son lost his dad last fall, and is celebrating his first birthday without him tomorrow. His name is Jordan. He'll be 11. He is a huge Curry and @warriors fan. Could he get a bday shoutout? https://t.co/72G9dmhc4k",
    "694": "@justanotburner @warriors I got scared after hearing about his recent knee swelling.",
    "695": "@warriors Go play your hearts out gents",
    "696": "@ChaseCenter @StephenCurry30 @warriors 👋 steph",
    "697": "Golden State Warriors vs. Atlanta Hawks - 3/25/22 Free Pick &amp; NBA Betting Prediction https://t.co/XhDNUrYC1Z\n.\n#Betting #FreePicks https://t.co/hadLjPQsxc",
    "698": "@warriors We losing by 30",
    "699": "@Money23Green @warriors @NBAonTNT when you skip a game to see and talk about someone else tells me you are done.",
    "700": "@warriors Champ🙌",
    "701": "GOLDEN STATE WARRIORS vs\nATLANTA HAWKS, 7:30PM.",
    "702": "@BitSler @Bitsler_Indo @Bitsler_Brasil Orlando Magic - Golden State Warriors",
    "703": "@warriors Tell draymond dont show up",
    "704": "@warriors Rest the core 3. We have a higher chance of winning this game. 🤣",
    "705": "@CurryIsMyDaddy @warriors time to ratio day",
    "706": "@warriors ANOTHER POOLE PARTYY TIME",
    "707": "@HardenFinalsMVP @warriors is trash",
    "708": "@warriors That's DL, right?!?✅️",
    "709": "NBA Atlanta Hawks - Golden State Warriors https://t.co/1n6acFLJ19",
    "710": "@Asensii20 @warriors Hawks",
    "711": "@steph_burner @warriors hope this will age well",
    "712": "GOLDEN STATE WARRIORS 118-104\nMIAMI HEAT, Final.",
    "713": "@warriors Remember this tweet. If Dlee scores more than 10 points I will stick my penis at a shredding machine",
    "714": "@warriors Pls win",
    "715": "@warriors (48-25)-@ATLHawks (36-37)\n📺NBA LEAGUE PASS📺\n#DubNation \nhttps://t.co/ki1HQTqPbg",
    "716": "GOLDEN STATE WARRIORS 90-94\nORLANDO MAGIC, Final.",
    "717": "@warriors Poole party",
    "718": "@warriors Can’t wait for this guy to return https://t.co/suGc9wu0Tw",
    "719": "@warriors Go warriors",
    "720": "@warriors Win pls",
    "721": "@warriors TIME TO LOSE DAY",
    "722": "@warriors Poole day https://t.co/h0T1A4aMoA",
    "723": "@warriors Your going to get exposed again",
    "724": "@warriors Who we playing",
    "725": "GAME DAY https://t.co/KbQucqh7IT",
    "726": "@jpmeireles08 Golden state warriors",
    "727": "Game-Time Decisions: Hawks (36-36) Vs. Golden State Warriors (48-25) Friday, March 25, 2022. \n\nRead More: https://t.co/QlnsQMnVyC https://t.co/viun6ArjzE",
    "728": "Post-Game Review: Heat - (104) Vs. Golden State Warriors- (118) Wednesday,  March 25,  2022.\n\nRead More: https://t.co/QlnsQMnVyC https://t.co/jY5jc8JTP1",
    "729": "Game-Time Decisions: Hawks (36-36) Vs. Golden State Warriors (48-25) Friday, March 25, 2022. \n\nRead More: https://t.co/pOoW4RTHkU https://t.co/QiJOencO2Y",
    "730": "Post-Game Review: Heat - (104) Vs. Golden State Warriors- (118) Wednesday,  March 25,  2022.\n\nRead More: https://t.co/pOoW4RTHkU https://t.co/enlZ07uupo",
    "731": "TODAY\n⏰ 7:30 PM ET \n🏀 @warriors at @atlhawks\n🏀 #8 Davis, #39 Ford, #47 Adams\n📺 @nbatv\n #NBA #NBAReferees #GSWvsATL #DubNation #TrueToAtlanta https://t.co/QCJHek7eYr",
    "732": "#AggiePride...@ncatmbb alum Al Attles #16 among the retired jerseys hanging up inside the Chase Center, home of the Golden State @warriors ..@WFMY #wfmysports @NCATAGGIES @ncatsuaggies https://t.co/6nxlGIPYeL",
    "733": "@NBCSWarriors Is this guy a @warriors announcer or the nba’s",
    "734": "On this day in sports history March 25, Denver Nuggets Center Dikembe Mutombo recorded 21 Points, 16 Rebounds, and 10 Blocks in a 99-88 win against the Golden State Warriors in 1993.",
    "735": "Consensus Line Move:\n2022-03-25 Golden State Warriors at Atlanta Hawks from 221.50 to 220.50\nUnder spot the sucker\n#NBA #sportsbets #innovation #realestateagent",
    "736": "🔥HIGHEST 🏀 ODDS🔥\n\nPlay Now 👉 https://t.co/ipQ1RJKLIJ \n\nThe Heats are looking bounce back to victory following a defeat to the Golden State Warriors on Wednesday.\n\nCan the hosts smoke 🔥 the Knicks? Boost your winnings and bet now 🥳\n\n#HiyoBetKingFeeling https://t.co/82DUj7lKeW",
    "737": "@RCFOX4KC Golden State Warriors have the Splash Brothers and the @KC_Chlefs now introduces the Dash Bros",
    "738": "Golden State Warriors vs Atlanta Hawks: Injury Reports, Starting 5s, Betting Odds, Tips &amp; Spreads - March 25th, 2022 | NBA Season 2021-22 https://t.co/x7LyJlFm1J #Basketball",
    "739": "@Chris_Broussard Were the Golden State Warriors recently banned from the NBA sir???!! There is no way a fully loaded Warriors team is losing the NBA Western Conference Finals😑",
    "740": "On this day in sports history March 25, Golden State Warriors Small Forward Rick Barry recorded 55 Points, 9 Rebounds, 9 Assists, and 3 Steals in a 133-123 win against the New York Knicks in 1978.",
    "741": "On this day in sports history March 25, the Golden State Warriors set an NBA record for most steals recorded by a team in a single game, recording 25 steals in a 139-122 win against the Los Angeles Lakers in 1975.",
    "742": "@dubwarriorss @warriors @Oracle plays like a vet. Definitely a steal. If he played for any other bad team he’d be the ROTY. BOOK IT",
    "743": "Good Luck 2 my Atlanta Hawks 2night against the Golden State Warriors 🏀🏀🏀 https://t.co/NkJhO4Ga5i",
    "744": "@SafyaKhadija @nbatrend And it was against everyone’s beloved Kevin Durant and the golden state warriors. \nThink about this. That team needed THAT much help from the refs to stop Harden and his second best player Eric Gordon in a game 7 of the WCF. Hear the commentary, read the reports from that game.",
    "745": "@schwartzmatt79 @warriors @JackWynn912 Mostly a flopper",
    "746": "@kobokanaeru I'm not really sure but I think it started when he joined the Golden State Warriors https://t.co/GETErCsRtu",
    "747": "📲⚽ TOP 3 american sports teams with the highest social media engagement during february 2022!\n\n1.@Flamengo 60,7M\n\n2.@Corinthians 39,7M\n\n3.@warriors 37,7M\n\n#instagram #twitter #facebook #youtube #tiktok https://t.co/YwfxeKmChi",
    "748": "@ATLHawks @ChickfilA @warriors @StateFarmArena @BallySportsSO @NBATV @929TheGame take it easy on us please we love trae",
    "749": "@ATLHawks @ChickfilA @warriors @StateFarmArena @BallySportsSO @NBATV @929TheGame We finna get blown out by 40",
    "750": "@ATLHawks @ChickfilA @warriors @StateFarmArena @BallySportsSO @NBATV @929TheGame no curry damn i wanna see curry and trae",
    "751": "Back at home tonight for a #Forever404 Night presented by @ChickfilA!\n\n🆚: @warriors \n⏰: 7:30 PM ET\n📍: @StateFarmArena \n📺: @BallySportsSO &amp; @NBATV \n📻: @929TheGame \n🎟️: https://t.co/bengRCmrui https://t.co/cVIZToJPKu",
    "752": "Duke knocked off @TexasTechMBB 78-73, advanced to Elite 8, are going to face @RazorbackMBB @ChaseCenter home of the @warriors of the @NBA 🏀 Saturday with opportunity to advance to final four\nCheckout article I wrote about @DukeMBB's 😈🔵🏀mentioning @stevewisemanNC article! https://t.co/UEWf6URBLY",
    "753": "@warriors Is playing in Atlanta tonight?! PLEAAAAASSSEEE",
    "754": "Duke Knocked Off Texas Tech 78-73, Advanced To Elite 8, Are Going To Face Arkansas At Chase Center Home Of The Golden State Warriors Of The NBA Saturday With Opportunity To Advance To The Final Four https://t.co/jfIx7pyLqV",
    "755": "@ChaseCenter @StephenCurry30 @warriors Bro look depressed",
    "756": "Golden State Warriors vs  Atlanta Hawks Prediction 3/25/22 -  Free NBA P... https://t.co/CrvGFHPpMI via @YouTube",
    "757": "@warriors Now that Poole and Kuminga are shining, its time GSW trade Klay. Klay is needed before to divert attention from Curry. We dont need that now. Klay is a liability in everything if he is not shooting well",
    "758": "NBA Basketball Game Betting Picks Simulator: 8:40 PM ET - Golden State Warriors vs. Atlanta Hawks - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/5xewoVS0fH #nba #sportsbetting #freepicks #cappertek",
    "759": "Rookie Kuminga developing before Warriors’ eyes: ‘Every game he’s getting better’ #GoldenState #Warriors #NBA https://t.co/wYbUAC6WzR",
    "760": "@BroskiNba @warriors Or Monta Ellis and David Lee? Both times us fans were screaming and yelling at the FO. But FO was right, fans knows nothing. Fans are too attached to make the right move.",
    "761": "Social Update: G-Eazy Guarantees His Beloved Warriors Will Win NBA Title Despite Recent Slump. Cancel the rest of the NBA season ... Warriors superfan G-Eazy thinks it's a foregone conclusion his Golden State squad will win the... https://t.co/VlNK5L6CQg #tmz #theartsandus https://t.co/u4C1EpID6d",
    "762": "Ever wonder what powers the tech at places like @Dodgers Stadium, @warriors Chase Center and @ FrostScience Museum? Wonder no more: via @BizTechMagazine https://t.co/Ds3Zb8k0FJ",
    "763": "#FanFavoriteFriday 🤩\n\nGolden State Warriors 🆚 Atlanta Hawks | Which color combo are you choosing?\n\n#NBA | #WeDeliverQuality | #LegendFitnessUSA 🇺🇸 https://t.co/bdUsXl5NWe",
    "764": "2021-22 #NBA75 Regular Season: Golden State Warriors vs. Atlanta Hawks\n\n📅 March 26\n⏰ 9 a.m.\n📺 TV5\n#AlwaysAFan #IBAsa5 https://t.co/eT1qQhtCFz",
    "765": "More Basketball action coming your way!🏀🔥\n\nGolden State Warriors travel to Atlanta to take on the Hawks, Who will be victorious?🏆⚔️\n\nAtlanta Hawks(0.80) vs Golden State(1.10)✅\n\nBet On It:https://t.co/RH7e8a8ZBV\n\n#WorldOfSport\n\n#NBA https://t.co/M0mriBpKYI",
    "766": "@CPTrey3 @ChaseCenter @warriors @StephenCurry30 best* not greatest",
    "767": "I’m so mad! Ugh. I supposed to be on the way to Atl rn to see the @warriors / @StephenCurry30 .. play tonight 😡. But sb wanna b injured 🙄",
    "768": "@CPTrey3 @ChaseCenter @warriors @StephenCurry30 Magic Johnson clears so bad",
    "769": "@CrouchRomeo @ERAUMBasketball @elijahjenkins_4 Where Steph &amp; Klay at?!? @warriors Who want smoke 💨💨 😂 Nice work Fellas! 🙌🏾🙌🏾",
    "770": "The Hawks are currently 2.5-point home favorites against the Warriors tonight… if you enjoy that sort of thing.\n\nJohn Collins is out for Atlanta.\n\nSteph Curry is out for Golden State.\n\nhttps://t.co/uj78UlE2xU",
    "771": "This Team Has The Most Underrated Young Core In The NBA https://t.co/u0vCLwPouo via @YouTube\n\n#nba #basketball #bball #sports #espn #podcast #warriors #goldenstatewarriors #youtube #youtuber",
    "772": "The Golden State Warriors will win the 2022 NBA Championship 💙💛 #DubNation",
    "773": "@ChaseCenter @StephenCurry30 @warriors Terry Crews with hair! 😱",
    "774": "I'm just going to leave this tweet here for when the Golden State Warriors win the 2022 NBA Finals... Unless they don't. In which case this tweet will be promptly deleted @NBA @warriors @StephenCurry30 @KlayThompson @Money23Green",
    "775": "The @warriors are 3 games away from clinching a playoff spot, as the third best team in the West (48–25) https://t.co/J2WaWduhJ1",
    "776": "Check out Steph Curry Golden State Warriors NBA Holographic Engraved 11”x14” Framed https://t.co/uKpZa1iflt @eBay",
    "777": "Check out Steph Curry Golden State Warriors NBA Holographic Engraved 11”x14” Framed https://t.co/FTBCYJiAiy @eBay",
    "778": "Check out Steph Curry Golden State Warriors NBA Holographic Engraved 11”x14” Framed https://t.co/GPTEPOn565 @eBay",
    "779": "“My Warriors will win NBA title” Dubs Superfan G-Eazy issues bold claim on Stephen Curry and Co. Championship ambitions  https://t.co/dbChosZgLU #GoldenStateWarriors #NBA",
    "780": "@Trevor_Lane Schedule difficulty gap is very big: Pels got Spurs, Blazers(2), Kings\nWe got @Mavs, @Jazz, @Nuggets, @Suns, @Warriors",
    "781": "•Golden State Warriors Updated Injuries As of now March 25\n\nPLAYER POSITIONUPDATEDINJURY STATUS\n\n•A. IguodalaSGThu, Mar 24Back(Game Time Decision)\n\n•J. WisemanCSat, Mar 19Knee(Expected to be out until at least Mar 30)\n\n•S. CurryPGFri, Mar 18Foot\n🧚‍♀️",
    "782": "Good morning all! It’s the @ATLHawks ands the @warriors tonight @HawksOnBally! Coverage 7e/6c with @DWilkins21 @mrvincecarter15 @laurenjbara @TreavorScales @ReneeMontgomery",
    "783": "Really need the Hawks to beat the Warriors tonight! Hawks are a 2.5pt favorite but you never know what you’re going to get with that team. They are super Jekyll &amp; Hyde-ish! Hawks win would put the #Grizzlies 3gms up on the Golden State.",
    "784": "ESPN reporting: Golden State Warriors have agreed to a contract extension with Anthony Davis, league sources tell ESPN.",
    "785": "Chiefs fina be stacked like the 2018 Golden State Warriors 🥷🏾🦹🏾‍♀️😈",
    "786": "@warriors @SociosUSA It's just a three so Jordan poole",
    "787": "@opptercopter @warriors have the best time 😤🕺🏼 !!!",
    "788": "@Mundy1017 @RubyYoungPSA @desotoisdengage @chicagobulls @warriors @Lakers @memgrizz Yes Ma’am. He’s an AMAZING Eagle Scholar. Thank you so much!🦅♥️💯",
    "789": "@AllenMathROCKS @RubyYoungPSA @desotoisdengage @chicagobulls @warriors @Lakers @memgrizz My baby (Terry) is working hard. We love @RubyYoungPSA 😍",
    "790": "@ChaseCenter @StephenCurry30 @warriors Thats the one n only  Stephen Curry. One of the best players in the NBA currently.",
    "791": "Montrezl Harris will sign a five-year maximum contract with the Golden State Warriors.",
    "792": "The @warriors are 15-4 SU in their last 19 matchups against the @ATLHawks 👀\n\n@MCrosson_VI has you covered with his prediction and top bets to place as they face off today 🔗 https://t.co/CEpdbQ8DRr https://t.co/fEFLb2XVem",
    "793": "Musselman reaches into @NBA  bag of tricks to win in his former pro-ball town. \n@RazorbackMBB @ArkRazorbacks @EricPMusselman  @warriors @ZagMBB @SEC @SECNetwork @SInow @si_ncaabb \n#wps #allHogs #DubNation #MarchMadness \nhttps://t.co/eQlTAQEyrG",
    "794": "@Omar_gswFAN @piarree_pablo @ChaseCenter @StephenCurry30 @warriors It's off there are pics with him walking without it",
    "795": "@CL13_Sebas @Money23Green @warriors I think he’s joking 😂😂😂",
    "796": "It's a Friday edition of #TM5 @BillyLindahl &amp; @BryceS89 got @ATLHawks v @warriors tonight, @USMNT get a point in Mexico and #MarchMadness continues! https://t.co/HWTFxh0xKD",
    "797": "Draymond Green Says He's Leaving Golden State Warriors for LeBron James.\nhttps://t.co/oI7gVNu6PD\nhttps://t.co/0fO0GKb5Sj\n\n#basketballlovers \n\n#basketballgames \n\n#ballabloc https://t.co/A6PBzBuA5b",
    "798": "Injured respectively in the foot and back, Stephen Curry (Golden State) and Ben Simmons (Philadelphia) should return just before or at the start of the play-offs, in a month.\n\nA big blow for Golden State Warriors fans, they probably won’t see Stephen Cur… https://t.co/cta0TuiQUW",
    "799": "The Golden State Warriors plan to sign Damion Lee, league sources tell ESPN.",
    "800": "@warriors If curry comes up with minutes restrictions then, you'll suck ❌👎",
    "801": "ESPN reporting: The Sixers are trading Pascal Siakam to the Golden State Warriors for two second-round picks, league sources tell ESPN.",
    "802": "@samesfandiari Looks like they already back for Dubs (picture courtesy of @warriors  insta) https://t.co/XrOkmGkPTb",
    "803": "Warriors: Golden State #Warriors vs Atlanta Hawks 3/25/22: Starting Lineups, Matchup Preview, Betting ... https://t.co/N9gAti5uZ7",
    "804": "Warriors: Golden State #Warriors vs Atlanta Hawks 3/25/22: Starting Lineups, Matchup Preview, Betting ... https://t.co/CMDMLvsntf",
    "805": "@WINkorg777 @warriors @MiamiHEAT Wink shit coin delist Binance",
    "806": "G-Eazy Guarantees His Beloved Warriors Will Win NBA Title Despite Recent Slump: Cancel the rest of the NBA season ... Warriors superfan G-Eazy thinks it's a foregone conclusion his Golden State squad will win the championship this year, despite its… https://t.co/rhyYZNJwf6",
    "807": "@warriors @Garydwayne @nbacares As a parent of a child who is dyslexic: endless thanks @Garydwayne ! https://t.co/boDOa8oJ2I",
    "808": "@warriors @NBCSAuthentic Thats indeed an incridible defense by Young glove GP2❤...",
    "809": "@MvulaKunengwa 😂so we know my nephews will be The Golden State Warriors’ future players.",
    "810": "@ChaseCenter @StephenCurry30 @warriors THE GOAT",
    "811": "@Chiozza11 @warriors Good defense there at the end???……wtf",
    "812": "What don't you @warriors  play \"Manowar - Warriors of The World United\" at 4th quarters?",
    "813": "What's #Best on https://t.co/DVTf2jd2ZR ?\nClorox Clutch : Warriors Fourth Quarter Run Fuels Win In Miami - March 23 2022\nhttps://t.co/aPjrmHW6kY\n#sports #goldenstatewarriors #goldenstate #warriors #gsw https://t.co/C2YXEu3Jjp",
    "814": "#Best of the day on https://t.co/MqmlMsmdvk\nClorox Clutch : Warriors Fourth Quarter Run Fuels Win In Miami - March 23 2022\nhttps://t.co/IMlJ2j84sW\n#sports #goldenstatewarriors #goldenstate #warriors #gsw",
    "815": "What's #Best on https://t.co/VfZu3jgOen ?\nClorox Clutch : Warriors Fourth Quarter Run Fuels Win In Miami - March 23 2022\nhttps://t.co/UwyzQfQGFG\n#sports #goldenstatewarriors #goldenstate #warriors #gsw",
    "816": "Fri, 25th Mar: #AtlantaHawks vs #GoldenStateWarriors - ODD @ 1.97\nMore details on: https://t.co/jfhc2g3jaA\n#baskettips #basketprediction #basketballbets #nba #usabasket",
    "817": "NBA : Atlanta Hawks vs Golden State Warriors - Picks, Predictions &amp; Odds\nhttps://t.co/WXqpoQKBNT",
    "818": "@ChaseCenter @StephenCurry30 @warriors looking very inspirational",
    "819": "#365dias365canastas365jugadores\n84) Mario Elie.\n🏅 NBA Playoffs 1ª Ronda 4º partido (30-04-1992).\n🏀 Golden State Warriors 116- Seattle Supersonics 119. https://t.co/HprUSOD3LJ",
    "820": "@warriors  should get tacko fall now! Player development and we will win the ship lol",
    "821": "Still crazy the @warriors went 73-9 😭",
    "822": "@warriors That’s what the Heat was ... M. I. A.",
    "823": "@demas6Basket Golden State Warriors 💛💙",
    "824": "So Golden State Warriors made the Memphis Grizzlies qualify before them?🤣🤣",
    "825": "Game-Time Decisions: Hawks (36-36) Vs. Golden State Warriors (48-25) Friday, March 25, 2022. \n\nRead More: https://t.co/pOoW4RTHkU https://t.co/O7UM7cOV1d",
    "826": "Post-Game Review: Heat - (104) Vs. Golden State Warriors- (118) Wednesday,  March 25,  2022.\n\nRead More: https://t.co/pOoW4RTHkU https://t.co/yh65JsLyql",
    "827": "Game-Time Decisions: Hawks (36-36) Vs. Golden State Warriors (48-25) Friday, March 25, 2022. \n\nRead More: https://t.co/QlnsQMnVyC https://t.co/Z9U4lsL3Bi",
    "828": "Post-Game Review: Heat - (104) Vs. Golden State Warriors- (118) Wednesday,  March 25,  2022.\n\nRead More: https://t.co/QlnsQMnVyC https://t.co/ORfFkAmFje",
    "829": "G-Eazy is predicting his favorite team, the Golden State Warriors, will win the NBA title this season, despite Steph Curry's injury. https://t.co/EhXqAD68HO",
    "830": "G-Eazy is predicting his favorite team, the Golden State Warriors, will win the NBA title this season, despite Steph Curry's injury. https://t.co/zNnO7rOO63",
    "831": "NBA Basketball Game Betting Picks Simulator: 7:40 PM ET - Golden State Warriors vs. Atlanta Hawks - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/5xewoVS0fH #nba #sportsbetting #freepicks #cappertek",
    "832": "@ChaseCenter @StephenCurry30 @warriors Golden State warriors 🐐 GOAT STEPH curry 🏀🔥🔥🏀🏀",
    "833": "The Atlanta Hawks and Golden State Warriors look to improve their respective playoff positions in weekend matchup in Atlanta. #NBA #DubNation #TrueToAtlanta  https://t.co/O9kfgNhTei",
    "834": "@steph_burner @warriors They only look a like.",
    "835": "The more @Money23Green speaks the more you have to question his loyalty to this @warriors season. I swear this new generation of athletes are hella weird. Athletes Betting on games have to be at a all time high at this rate!! https://t.co/6HgUHOSNQF",
    "836": "@DogSurfRoadshow @MattWinerTV @Suns @NBA @warriors Them being Phoenix, yes of course. No team has dominated the rest of the league like this in decades.  They have a better road record than anyone's home record.\n\nWarriors must work hard go get ready to play playoff-level basketball before anyone's thinking about them",
    "837": "The Golden State Warriors left one of the the loudest, most diverse and passionate fanbases in basketball to move in with the Silicon Valley Techbros. That's rough.",
    "838": "@warriors This is how you play from now on, Dee Lee!!!!",
    "839": "@warriors @NBCSAuthentic Kuminga didn’t foul-out of the game...he was fouled out of the game. JK is a Warrior!",
    "840": "@Joviel_kun @ChaseCenter @StephenCurry30 @warriors I know",
    "841": "Bucket list item checked off tomorrow. Going to see @warriors #DubNation in the ATL.",
    "842": "ESPN reporting: The Golden State Warriors are trading JR Smith to the Clippers for two first-round picks.",
    "843": "@DogSurfRoadshow @MattWinerTV @Suns @NBA @warriors Might be brash but Warriors will need to make it past Memphis first.",
    "844": "@ChaseCenter @StephenCurry30 @warriors Terry crew",
    "845": "@Omar_gswFAN @ChaseCenter @StephenCurry30 @warriors Could've worded it better",
    "846": "@NBAJPN @WashWizards @warriors Can’t wait to see this 🔥🔥🔥",
    "847": "@ChaseCenter @StephenCurry30 @warriors Squint in the buildingggg",
    "848": "@TrotoTrini @CPTrey3 @ChaseCenter @warriors @StephenCurry30 You're entitled to your opinion.",
    "849": "Golden State Warriors / Mexico Edition Black - Stephen Curry •30\n\nConsultar Tamanhos\n\nPedidos via WhatsApp: (21) 968615122 https://t.co/PrY0hWP4mC",
    "850": "Which Golden State warriors player should I edit?",
    "851": "Suns 60–14 &amp; Grizzlies 51–23, with 8 games to go. Dubs 48–25, with 7 games to go @warriors #NBA75",
    "852": "@terrinh73 NFL - NFC: @AtlantaFalcons AFC: @steelers\nMLB - NL: @Braves AL: @Athletics \nNCAA - @GeorgiaTech \nNBA - East: @ATLHawks West: @warriors \nNHL - @SanJoseSharks \nPremier League - 🤞🏻@FulhamFC \nMLS - @ATLUTD\nInternational soccer - @USMNT @USWNT",
    "853": "Steve Kerr @SteveKerr \nGolden State Warriors @warriors \nLearn from this WIN..play everyone until they foul out. Train and trust your players, no arguing, complaining, play tough and take the game/ball to the paint/basket\nand do not keep players on the bench..who are ready.",
    "854": "@johnjohn5133 @nbatopshot @warriors @juanonjuan10 @Garydwayne @22wiggins I got a few moving parts... too many pots on the stove... but im right behind you. Great moments #dubnation",
    "855": "@KentuckyCards Mr. Golden State Warriors",
    "856": "Post-Game Review: Heat - (104) Vs. Golden State Warriors- (118) Wednesday,  March 25,  2022.\n\nRead More: https://t.co/QlnsQMnVyC https://t.co/5upnQwyIp8",
    "857": "Game-Time Decisions: Hawks (36-36) Vs. Golden State Warriors (48-25) Friday, March 25, 2022. \n\nRead More: https://t.co/QlnsQMnVyC https://t.co/smpVfK5LYd",
    "858": "@MattWinerTV @Suns @NBA Such a shame for them that all that regular season effort goes to waste the moment they lose a home playoff game to the @warriors.\n\nRegular season’s pure amateur hour. 😂 \n\nMight be brash but I know most of the NBA community and fanbase is worryingly thinking about them.",
    "859": "@ChaseCenter @MarissaT1998 @StephenCurry30 @warriors You guys know @Shawnsieck ?",
    "860": "@DrNiravPandya @warriors PAY THAT MAN 🔥",
    "861": "@warriors @Oracle I said this 3 months ago....said Kerr needed to play the kid!!!",
    "862": "@CPTrey3 @ChaseCenter @warriors @StephenCurry30 I think he's the greatest shooter of all time not pg",
    "863": "@Didieralain66 @warriors U tell em girl",
    "864": "@piarree_pablo @ChaseCenter @StephenCurry30 @warriors Want to see if he has the boot on. I don’t have a foot fetish",
    "865": "Post-Game Review: Heat - (104) Vs. Golden State Warriors- (118) Wednesday,  March 25,  2022.\n\nRead More: https://t.co/QlnsQMnVyC https://t.co/FwOXAENi9L",
    "866": "Game-Time Decisions: Hawks (36-36) Vs. Golden State Warriors (48-25) Friday, March 25, 2022. \n\nRead More: https://t.co/QlnsQMnVyC https://t.co/UNMTj62v4I",
    "867": "I’ll never understand how people from Indiana end up liking teams such as: \n\nDallas Cowboys \nDuke basketball \nNew York Yankees\nGolden State Warriors\nLos Angeles Lakers\n\nY’all really just pick the teams that win/have won all the time? 🤔",
    "868": "@dhrobins @TruthMatters32 @jonpeng @Whitebird480 @NBAonTNT @SHAQ Yea and the Golden State Warriors were the best team too. They had a historic season achieving the best win record in NBA history that year. Still lost to a fully healthy Cavs squad led by Lebron James.",
    "869": "duke making free throws in the clutch let’s sign everyone @warriors",
    "870": "@warriors @SociosUSA I go for Juan hahahahah",
    "871": "@Suns you guys have to do this year. As much as I would love to see the @warriors to get a 4th-- I want @CP3 to hoist up that 🏆",
    "872": "Any team that place all of a sudden becomes golden state warriors! This team can not shoot for shit but today hitting every shot",
    "873": "We need a healthy @warriors team vs a healthy @Suns team in the Western Conference Finals ‼️",
    "874": "@ChaseCenter @StephenCurry30 @warriors Who is that",
    "875": "@ChaseCenter @warriors @StephenCurry30 Hey Steph!😁",
    "876": "@lancem69 @ChaseCenter @StephenCurry30 @warriors To see if his boot is actually gone, or he still uses it sometimes",
    "877": "@ChaseCenter @StephenCurry30 @warriors The Chairman of the Chase Center @StephenCurry30",
    "878": "CHAMPIONS 👉🏽 @warriors https://t.co/iytvDI5eRt",
    "879": "@ChaseCenter @StephenCurry30 @warriors We miss u very much",
    "880": "Golden State Warriors Chris Mul #autographed https://t.co/lf3zSfZ62G",
    "881": "Just saw the hugely entertaining KING JAMES @SteppenwolfThtr, a delightful &amp; funny 2-hander about the pleasures and perils of sports fandom and how it brings people together &amp; drives them apart. (And I say this as @warriors fan.) https://t.co/ycMnAdNEdQ",
    "882": "Detroit Pistons - Washington Wizards\nAtlanta Hawks - Golden State Warriors\n\nBet slip link: https://t.co/n3AnwmN79w https://t.co/NBXSN0e6tL",
    "883": "@ChaseCenter @StephenCurry30 @warriors Go duke",
    "884": "Imagine. it’s the sweet 16. You’re playing in chase center home of the @warriors. You beat the number one ranked team overall. Your coach used to coach at golden state. You meet @StephenCurry30 pre game. He is there in the crowd watching you play. Pure bliss.I mean..  🤯#Bayhogs",
    "885": "@jokiccenter go to the @warriors",
    "886": "@ChaseCenter @warriors @StephenCurry30 missyouuu",
    "887": "Warriors: Player grades: #Warriors vs. #Heat - Golden State of Mind https://t.co/YpL4U0CFpa",
    "888": "Warriors: Player grades: #Warriors vs. #Heat - Golden State of Mind https://t.co/t6svubBHmq",
    "889": "@ChaseCenter @StephenCurry30 @warriors Representing the family! Imagine he's  cheering Duke on..",
    "890": "@ChaseCenter @warriors @StephenCurry30 I see you :))👀👀 https://t.co/6Jh0DtkRwe",
    "891": "@ChaseCenter @StephenCurry30 @warriors To be fair, he built the place. 🐐",
    "892": "@ChaseCenter @StephenCurry30 @warriors THE GOAT",
    "893": "@ChaseCenter @warriors @StephenCurry30 Idk him",
    "894": "Got the shoes, got the tickets, just wish @StephenCurry30 wasn’t injured and our boy could see him play in person. He’s still fired up to see the #goldenstatewarriors #DubNation #DubNation24/7\nHappy 14th Birthday Cooper! https://t.co/ZYo7h5pMHi",
    "895": "@IiveInCurryWrld @RatiodbyJordan @warriors I am not talking anything away from Poole lol but to think Klay is threatened my Poole’s good plays is absolutely false.",
    "896": "@afoyle3131 @EricPMusselman Congrats #Razorbacks and @EricPMusselman !!  Hey @afoyle3131 Can you share a memorable moment from your time with Coach at @warriors ?",
    "897": "Draymond Green says he'd skip Warriors game to watch LeBron James become NBA's all-time leading scorer #GoldenState #Warriors #NBA https://t.co/aO1k8JmFe4",
    "898": "NBA Basketball Game Betting Picks Simulator: 3/25/2022 7:40 PM ET - Golden State Warriors vs. Atlanta Hawks - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/5xewoVS0fH #nba #sportsbetting #freepicks #cappertek",
    "899": "@warriors The sky is the limit.  Love his confidence.",
    "900": "@ChaseCenter @warriors @StephenCurry30 When did @terrycrews grow out his hair?",
    "901": "@IMAGP13 @warriors We’ve gone through a lot as a team and so many different rotations people can’t find there spot on this team and we have so many players that can go get us 20+ here and there when you don’t have to you start to force things but I get where you coming from it sucks losing",
    "902": "@ChaseCenter @warriors @StephenCurry30 Very cool.  @StephenCurry30 #basketball  @warriors",
    "903": "@weareround21 @warriors @cavs @Raptors Yo, you got @warriors paddles?  Hook an Ape up!  Where do I cop?",
    "904": "@ChaseCenter @warriors @StephenCurry30 Oh the goat pg",
    "905": "Musselman reaches into @NBA bag of tricks to win in his former pro-ball town. \n@RazorbackMBB @ArkRazorbacks @EricPMusselman  @warriors @ZagMBB @SEC @SECNetwork @SInow @si_ncaabb \n#wps #allHogs #DubNation #MarchMadness \nhttps://t.co/ku1IXGXWOG",
    "906": "@ChaseCenter @StephenCurry30 @warriors The guy in the front looks familiar I. Guy smiling looks weird. Bet he plays golf",
    "907": "The @memgrizz just secured a playoff spot. The @warriors need to win 3 games to clinch a playoff berth. The next 3 games are against the Hawks, Wizards, and the Grizzlies. Y’all think we can do it #DubNation ?",
    "908": "@ChaseCenter @warriors @StephenCurry30 Oh that woman with the phone",
    "909": "@ChaseCenter @warriors @StephenCurry30 The greatest pg of all time",
    "910": "@ChaseCenter @StephenCurry30 @warriors Which guy?",
    "911": "@EricPMusselman @mosesmoody @StephenCurry30 @ChaseCenter @warriors Great job coach…WPS!!!!",
    "912": "Golden State Warriors’ Steph Curry attends the Texas Tech-Duke Sweet 16 game, Thursday, March 24, 2022. https://t.co/zsBUNChBCg",
    "913": "@EricPMusselman @Athletics @warriors @49ers @SFGiants @RazorbackMBB Looks like good old Bay Area group",
    "914": "@EricPMusselman @mosesmoody @StephenCurry30 @ChaseCenter @warriors @StephenCurry30 must be so honored",
    "915": "@HPbasketball Postseason is fine. There’s a clear difference between postseason and playoffs if you give it a moments thought…HOWEVER, may I also suggest “Purgatory” for teams who fail to make it to the playoffs?\n\nThe Golden State Warriors were stuck in purgatory to end the 2020-21 season",
    "916": "Musselman reaches into @NBA  bag of tricks to win in his former pro-ball town. \n@RazorbackMBB @ArkRazorbacks @EricPMusselman  @warriors @ZagMBB @SEC @SECNetwork \n#wps #allHogs #DubNation #MarchMadness \nhttps://t.co/0gD13XimCJ",
    "917": "Musselman reaches into @NBA  bag of tricks to win in his former pro-ball town. \n@RazorbackMBB @ArkRazorbacks @EricPMusselman  @warriors @ZagMBB @SEC @SECNetwork \n#wps #allHogs #DubNation #MarchMadness \nhttps://t.co/eQlTAQEyrG",
    "918": "@warriors @Oracle Poor man’s Giannis🤔",
    "919": "@MarchMadnessMBB @Chiozza11 @GatorsMBK That’s the same @Chiozza11 who plays wit the @warriors??? 🤣🤣 why he doesn’t do something similar in the @NBA? 🤦🏻‍♂️🤦🏻‍♂️",
    "920": "@warriors bring Kyle and waive Chiozza https://t.co/6En9cwzKur",
    "921": "Post-Game Review: Heat - (104) Vs. Golden State Warriors- (118) Wednesday,  March 25,  2022.\n\nRead More: https://t.co/pOoW4RTHkU https://t.co/MxewHpw2I9",
    "922": "Game-Time Decisions: Hawks (36-36) Vs. Golden State Warriors (48-25) Friday, March 25, 2022. \n\nRead More: https://t.co/pOoW4RTHkU https://t.co/8l6zHihpQN",
    "923": "@OIThirty10 a healthy denver will lose to the phoenix suns or golden state warriors significantly more times than they will win — that’s a dark horse, not a championship contender.\n\nand philly remain very much second fiddle to a healthy and whole bucks or nets.",
    "924": "Trade him @warriors https://t.co/j4XRp1oTxV",
    "925": "81. golden state warriors 118 x 104 miami heat \n\njordan e wiggins decidindo, reservinhas ajudando e dubs win em miami.\n https://t.co/6dazlinNQc",
    "926": "In dominant fashion, the Memphis Grizzlies are heading to the playoffs for the second straight year!\n\nStill more work to be done as they extend their lead on the Golden State Warriors for the second seed! https://t.co/v9E8XkNOWn",
    "927": "@felix_suen - I don't think she'd been to Oakland to hear #dubnation. @warriors https://t.co/og8jGZs9Er",
    "928": "Congratulations to bigskybear (@bigskybear) who moved up 1 spot to take #9 on the Golden State Warriors team leaderboard.\n\nhttps://t.co/W6VN3LlptP",
    "929": "We want the @warriors https://t.co/8Eo0MywryI",
    "930": "@EricPMusselman @mosesmoody @StephenCurry30 @ChaseCenter @warriors This is awesome!!  Way to go Coach. Arkansas is so proud of y’all. WPS!!!",
    "931": "@warriors Steph will always be known as a great guy, and an amazing basketball player. The fans will shut down once he retires",
    "932": "@warriors @SociosUSA My celebration is definitely Damion",
    "933": "Yo @warriors we need Kyle Guy back on the squad to replace Chiozza ASAP https://t.co/9yvFwJvzDX",
    "934": "Yep...@EricPMusselman is kinda person you just never forget after you meet him and first met Eric about 20 years ago when he Head Coach @warriors\n\nIt was Brilliant Hire by Hofs AD @HunterYurachek hire Eric from Nevada where so obvious he could coach College Game which not easy! https://t.co/wJRXLYbsdU https://t.co/kIyDz7BGwb",
    "935": "With Golden State outside of the Orlando Bubble, Warriors Wire took a look at some of Steph Curry’s top numbers and stats from the playoffs  https://t.co/1yc0exYert",
    "936": "Klay Alexander Thompson is an American professional basketball player for the Golden State Warriors of the National Basketball Association. He is credited as one of the greatest shooters in NBA history. 🏀\n#qua #quaquiz #quaapp #letsqua #nbaplayoffs #nbafinals #nbabasketballcards https://t.co/D1LRM1nmL0",
    "937": "@EricPMusselman @mosesmoody @StephenCurry30 @ChaseCenter @warriors Yes!  I didn’t see @StephenCurry30’s red. It would have looked fab, Steph!",
    "938": "@andre @abc7newsbayarea @warriors U guys are getting paid $millions for absolutely doing nothing in return for NBA. Havent seen Iggy playing since forever. Real workers work 3 jobs and can barely make a living. What a world! SMH",
    "939": "My guy @StephenCurry30 had to show the @warriors some love with my gameday promo! #415 https://t.co/rZ8GQm57qZ",
    "940": "the next head coach of the Golden State Warriors. the 🐐 Shaheen Holloway!!! https://t.co/qjwnlkWjgo",
    "941": "Post-Game Review: Heat - (104) Vs. Golden State Warriors- (118) Wednesday,  March 25,  2022.\n\nRead More: https://t.co/pOoW4RTHkU https://t.co/I1jEVDEoLN",
    "942": "Game-Time Decisions: Hawks (36-36) Vs. Golden State Warriors (48-25) Friday, March 25, 2022. \n\nRead More: https://t.co/pOoW4RTHkU https://t.co/ufF0b3TxlB",
    "943": "@anthonyVslater Keep him out until the playoffs please 🙏🏻🙏🏻 @warriors @SteveKerr we need @andre",
    "944": "Post-Game Review: Heat - (104) Vs. Golden State Warriors- (118) Wednesday,  March 25,  2022.\n\nRead More: https://t.co/QlnsQMnVyC https://t.co/d7bKbESaDv",
    "945": "Game-Time Decisions: Hawks (36-36) Vs. Golden State Warriors (48-25) Friday, March 25, 2022. \n\nRead More: https://t.co/QlnsQMnVyC https://t.co/r1LGuumWjj",
    "946": "@andre @abc7newsbayarea @warriors 11:16pm bro",
    "947": "@Sheridanblog Fame, money , relevance is a hell of a drug . Some sell their soul for it . At the end of the day , I usually pray that the @warriors would find his replacement because he is too unpredictable and expensive to maintain . No one wants to admit that though.",
    "948": "@EricPMusselman @Athletics @warriors @49ers @SFGiants @RazorbackMBB Coach, bring the team to Alamo Square while you’re still in SF. You’ll get the best instragramable photos of the city from there.\n\nAs a Texan and the brother of a @UArkansas alumnus, I am happy for yall! https://t.co/PhXOe1O0k4",
    "949": "@warriors K.Klay will be back and shooting 🔫 threes 🔫 🎄 👫 🏀 he is a fighter 💪🏻 👏🏼 😉 💙 ❤️ ❤️ 💦💦🏆🙏🙏🌞ka.pai bless you klay.K",
    "950": "@andre @warriors Of course, @andre ! We appreciate YOU chatting with us and @KumasiABC7  earlier this morning! Take care and talk to you soon!",
    "951": "@andre @abc7newsbayarea @warriors Obviously you don’t have to and I’ll still be a fan but when you’re desperate you’re desperate. I’m trying everything I can, working 10 to 12 hour days, trying to pay for her home care, we had a roof leak I’m dealing with that and there’s dry rot. Can’t. Make. This. Up.",
    "952": "@andre @abc7newsbayarea @warriors Bro I would appreciate if you shared my go fund me to help my mom who coincidentally just had another stroke two days ago called a TIA event. I wish I was joking. Love your steez bro. Always have. My fam is in the abyss.",
    "953": "@warriors @Oracle Yep and uve been in d league what like 8 yrs, and u still couldn't be as productive as him, give him half or ur salary",
    "954": "@EricPMusselman @mosesmoody @StephenCurry30 @ChaseCenter @warriors Congratulations, Coach",
    "955": "@abc7newsbayarea @warriors Appreciate the time this am!",
    "956": "how fitting for the former Golden State Warriors head coach to lead his team to victory in the Warriors' new arena",
    "957": "The Big 3 of the @warriors: @Stephencurry30 @Klaythompson and @Money23green took several years and several drafts to form. Patience paid off!",
    "958": "@warriors Admin you need to start putting JK’s face instead of this guy. I’m sorry but this dude has 1 good game and 2 months ghost business.",
    "959": "@warriors Andy wings!",
    "960": "@EricPMusselman @mosesmoody @StephenCurry30 @ChaseCenter @warriors CLOUT!!!!",
    "961": "Three young patients in clinic today said their favorite Golden State Warrior was Jordan Poole. 👀",
    "962": "I hate how many threes are taken in basketball these days. This is simply not the basketball I grew up with. I blame Steph Curry and the Golden State Warriors. If another guy passes out of a layup for a 3 I’m going to lose it",
    "963": "@BABOGAMIN @DSnow2030 @warriors I like looney! Wiseman has great talent but he just can not play the tactics well. Warriors may be out of the Western Conference semifinals this year.",
    "964": "@UnitedWeZag This is 2018 Golden State Warriors vibes to me right now.  Every shot that goes up seems like it’s going in for Arkansas",
    "965": "@KDTrey5 was really on the @warriors",
    "966": "If Dray doesn't get injured, he is DPOY. @warriors fans who want him gone because of his support for Bron are acting FOOLISH",
    "967": "Guyana Amazon warriors this year \nBrazil this year \nLewis Hamilton this year\nGolden state warriors this year \nRCB this year",
    "968": "@abdul72108 @warriors Gotchu",
    "969": "@BrentofDPlaine @scottycatt @EricPMusselman @Athletics @warriors @49ers @SFGiants @RazorbackMBB HAHAHA you said in “the Any Area” DEAD💦🤣💦 https://t.co/Uik5f40B81",
    "970": "Golden State Warriors Playbook https://t.co/wDoxi9Chn7",
    "971": "@KwikWarren My wife is a hard core @warriors fan too. I just read her your tweet.\nShe laughed, and then said OMG he's right. She was on pins &amp; needles during last game.\nLol.",
    "972": "Russ for Dray @warriors https://t.co/R6tSrANM3r",
    "973": "Palmview vs Victoria West Texas High School Girls Soccer \nLink Here : https://t.co/rvDAVkHgZT\n\n@Lobos\n@Warriors\n\n6p.\nSchedule For : March 24, 2022\n\nThe Victoria West (Victoria, TX) varsity soccer team has a neutral playoff game",
    "974": "@PFleeceman 2015 Game 2 Championship in the company suite with a client. The game went into overtime, unfortunately we lost by 2, but won the 🏆! I met colleagues that flew in with their clients from Australia, definitely top 5 experiences of my life🔥💯 #GoWarriors @warriors #DubNation",
    "975": "Dallas Jesuit vs Martin Texas High School Boys Soccer \nLink Here : https://t.co/t8CRdyiDWW\n@Rangers\n@Warriors\n7:30p.\nSchedule For : March 24, 2022\nThe Martin (Arlington, TX) varsity soccer team has a home playoff game vs. Dallas Jesuit (Dallas, TX) on Thursday, March 24 @ 7:30p.",
    "976": "Warriors: Player grades: #Warriors vs. #Heat - Golden State of Mind https://t.co/QV3EY3K26K",
    "977": "Warriors: Jimmy Butler goes off on coach and teammates during Miami #Heat's loss to Golden State https://t.co/LzrudgXny2",
    "978": "The Memphis Grizzlies or Golden State Warriors? Grizz have made 9 triples in the first quarter alone tonight. There's still 2 minutes left to play",
    "979": "@goatedwok @LockedOnDubs @StephenCurry30 He’s just such a great human being. #DubNation is lucky he’s on the @warriors and a huge reason why I gripe on Lacob &amp; Co. when they make pennypinching decisions is because they’re depriving Steph of the glory he deserves.",
    "980": "May be signed by the @warriors for the remainder of the season and the playoffs https://t.co/LWUAlwHs5Z",
    "981": "@warriors @SociosUSA Damion… I’ll be going wild",
    "982": "@BSarver35 Even though Curry isn't playing due to a foot injury warriors still got Klay Dray Wiggins and Jordan Poole. Actually Golden State beat Miami yesterday without Steph Klay or Dray",
    "983": "@EricPMusselman @mosesmoody @StephenCurry30 @ChaseCenter @warriors Coach, your shirt is the bomb! What brand is it?",
    "984": "@IiveInCurryWrld @RatiodbyJordan @warriors He hasn’t played in 2.5 years what do you expect?",
    "985": "#GOLDENSTATEWARRIORS at HEAT | FULL GAME HIGHLIGHTS | March 23, 2022\n🏀https://t.co/9Vd6og1Yvs\n\nMore news: https://t.co/U90svrE7cH\n\n#LEAGUEPASS \n@warriors @NickCWilder  #NBA #basketball https://t.co/fiBIIFe6DS",
    "986": "220° Jogo - Golden State Warriors 102 x 109 Milwaukee Bucks \n\n37 MIN\n26 PTS\n2 REB\n7 AST\n1 STL\n8-19 FG (42.1%)\n5-9 3PT (55.6%)\n5-5 FT (100.0%)\nDerrota ❌ (96-124)\n\n#DubNation https://t.co/jkpnd0bCr9",
    "987": "219° Jogo - Golden State Warriors 87 x 103 Chicago Bulls \n\n37 MIN\n21 PTS\n1 REB\n1 AST\n7-18 FG (38.9%)\n3-7 3PT (42.9%)\n4-4 FT (100.0%)\nDerrota ❌ (96-123)\n\n#DubNation https://t.co/pu9AIz8XGS",
    "988": "golden state warriors te amo",
    "989": "@EricPMusselman @mosesmoody @StephenCurry30 @ChaseCenter @warriors Damn you’re short lol",
    "990": "@Andyistoofunny @warriors I too will join in",
    "991": "215° Jogo - Golden State Warriors 105 x 116 Denver Nuggets \n\n41 MIN\n29 PTS\n0 REB\n7 AST\n1 STL\n11-18 FG (61.1%)\n7-9 3PT (77.8%)\nDerrota ❌ (93-122)\n\n#DubNation https://t.co/C7rvR1Hb08",
    "992": "@warriors @SociosUSA Double OK3’s all the way",
    "993": "@warriors Warriors are hilarious you loss to a non playoff team but you beat the heat w/o curry klay green iggy otto 😂",
    "994": "213° Jogo - Golden State Warriors 87 x 94 Memphis Grizzlies \n\n41 MIN\n24 PTS\n4 REB\n4 AST\n2 STL\n10-22 FG (45.5%)\n4-8 3PT (50.0%)\n0-1 FT (0.0%)\nDerrota ❌ (92-121)\n\n#DubNation https://t.co/QYQJY1jUpa",
    "995": "@warriors @SociosUSA I'm a mix between JTA and D-Lee LMAO",
    "996": "212° Jogo - Golden State Warriors 89 x 115 Los Angeles Clippers \n\n29 MIN\n10 PTS\n0 REB\n5 AST\n4-11 FG (36.4%)\n1-5 3PT (20.0%)\n1-1 FT (100.0%)\nDerrota ❌ (92-120)\n\n#DubNation https://t.co/UHCc9ZTF43",
    "997": "@Money23Green do us a favor and ask for a trade, because clearly you’re more loyal to LeBron than the @warriors.",
    "998": "@BraydenCLE @warriors @SociosUSA Understandable, solid 3 fingers up. Would be my choice, but i gotta hype them tf up with a scream",
    "999": "@YTJosiahGaming @warriors @SociosUSA Yea aii https://t.co/PR3Ek2dZwA",
    "1000": "@Dope2KBoss @warriors @SociosUSA Poole for me",
    "1001": "@warriors @SociosUSA Damion lee for sure, raise the 3 fingers with a solid screem"
}