{
    "0": "@TommyG105 Brooklyn Nets vs Denver Nuggets a better alternative right now",
    "1": "FREE STREAM: Brooklyn Nets @ Denver Nuggets LIVE! | NBA News https://t.co/y0Jcwcmk9q",
    "2": "League leader in the MVP race Nikola Jokic and the Denver Nuggets about to host the KD and Harden -less Brooklyn Nets. We're live on @RuutuUrheilu! #NBAfi",
    "3": "@BrooklynNets Let. Cam. Cook. \n\n🚶‍♂️🪣",
    "4": "@vicecity4life @BrooklynNets It’s the profile pic",
    "5": "Brooklyn Nets about to put up another disappointing L!",
    "6": "James Harden trade? Brooklyn Nets coach Steve Nash says no – NBA News https://t.co/uqEqiYXzLi",
    "7": "Brooklyn Nets vs Denver Nuggets - NBA Live Stream\nWatch Here : https://t.co/mzrXNTR4nV\nVenue : Ball Arena (Denver)\n#NetsWorld #Nuggets #NBA #Live https://t.co/Am3VpqyquB",
    "8": "Give me Brooklyn Nets +8 in the under in points just because",
    "9": "@BrooklynNets please hire @MarkJackson13 and Mark Jackson please bring in a balanced staff that’s young experience and hungry. Every time he tries to play small ball he take the enjoyment out of watching the #nets",
    "10": "NBA Live Thread: Brooklyn Nets at Denver Nuggets, 3:30 PM EST https://t.co/IPxBK6j3Kc https://t.co/CsfUDzeHo8",
    "11": "@BrooklynNets STOP PLAYING JAMES JOHNSON HE SUCKS",
    "12": "NBA Live Scores: Game open! Follow to get updates as CHI hosts PHI.  @chicagobulls @sixers #NBAGame open! Follow to get updates as DEN hosts BKN.  @nuggets @BrooklynNets #NBA",
    "13": "I know us Rockets fans want Harden out of Brooklyn, but this is actually a good thing. \n\nIt’s better for us if Harden just leaves Brooklyn in the off-season, instead of forcing a trade and allowing the Nets recoup some of the lost value. https://t.co/OdoT1examO",
    "14": "@ACfor_3 @BrooklynNets Trying to go to Kyrie first game back bro🙏🏽",
    "15": "*Brooklyn Nets em crise\n\nKevin Durant: https://t.co/Y83wSzxRqX",
    "16": "Greetings from Denver. Nets-Nuggets tip shortly. Brooklyn looking to end its road trip with a win. Aaron Gordon is back for the Nuggets. James Harden is out for the Nets along with Nic Claxton. Steve Nash says Harden isn't getting traded. Do we see more Cam Thomas today?",
    "17": "@BrooklynNets Trade Kyrie Irving For Jarret Allen Or Someone Else I Miss Jarret Allen Wearing A Nets Jeresy😔",
    "18": "Nets have no plans to trade James Harden, says Steve Nash - The Bro... (The Brooklyn Game)\n\nSteve Nash made the most definitive statement during the ongoing saga with James Harden and ...\n\nAdd your highlights:\nhttps://t.co/J6T2nPBw0r\n #Brooklyn_Nets",
    "19": "Nets aren't trading James Harden, Steve Nash says (https://t.co/5AvbMDzwqY)\n\nDENVER - With absolute language, Steve Nash tried to squash the idea of trading James Harden...\n\nAdd your highlights:\nhttps://t.co/irR0I3at6M\n #Brooklyn_Nets",
    "20": "@thekingoftimbs brooklyn nets",
    "21": "FREE STREAM: Brooklyn Nets @ Denver Nuggets LIVE! | NBA Information https://t.co/FE95UwyrYq",
    "22": "Brooklyn Nets vs Denver Nuggets live Basketball\n\n🔴𝙇𝙄𝙑𝙀 𝙇𝙞𝙣𝙠👉ᴴᴰ📱✅⏩https://t.co/14IjLgymKV\n🔴𝙇𝙄𝙑𝙀 𝙇𝙞𝙣𝙠👉ᴴᴰ📱✅⏩https://t.co/14IjLgymKV",
    "23": "@Southern_Philly ***nets don’t read this*** I do like the ones that talk about how good of a fit Simmons would be in Brooklyn when he’s going to have them playing 4 on 5 when Kyrie is still running the offense",
    "24": "@laquantis1 @BrooklynNets Millsap is washed are you serious",
    "25": "@BrooklynNets @KyrieIrving @blakegriffin23 Let's go！！！",
    "26": "Denver Nuggets vs Brooklyn Nets is not working. @hesgoalme",
    "27": "@BrooklynNets Harden is absent ?",
    "28": "@kaiishome @BrooklynNets We gotta catch a game at the clays",
    "29": "@Arun30384 @JayLGK @Rob24282840 @BrooklynNets Your next chance to win a chip is in the staples arena😂😂",
    "30": "@BrooklynNets Why James Johnson man.",
    "31": "@BrooklynNets +8 they gonna show up without harden",
    "32": "@BrooklynNets @blakegriffin23 That's my guy @blakegriffin23 https://t.co/SC7R81AHLy",
    "33": "@Hargoat13 @WashedSlim7 @BrooklynNets Harden not even top 5 this season \nKD \nMills \nKyrie \nKessler\nCam",
    "34": "@BrooklynNets Jj in this bitch, no one watch the game is gonna be by 50 tn",
    "35": "@BrooklynNets @SteveNash Cam Thomas should be in the starting lineup.",
    "36": "Nash: Nets Not Trading Harden: Brooklyn head coach says James Harden isn't going anywhere https://t.co/Y2eUg0aJgB",
    "37": "@BrooklynNets Harden is really not playing. 🤔 I’m wondering if he will ever play another game as a Net. #BrooklynNets",
    "38": "@GiannisNewEra @WashedSlim7 @BrooklynNets Nets 2 best players aren’t playing",
    "39": "Love you guys no matter how dysfunctional we are right now 😂😂😂😂 @BrooklynNets",
    "40": "@BrooklynNets Why would he not start Sharpe smh this staff is terrible there is no excuse for this I’m starting to think this guy is there just to get a check and an excuse to get out of the house smh we can’t win a championship with them not taking accountability and adjustments",
    "41": "@BrooklynNets Are we tanking 🥴 Houston's picks are looking good 😂",
    "42": "@BrooklynNets wonder how many plays our coach gonna play thru James Johnson start the game of again.. 🤡",
    "43": "@BrooklynNets @blakegriffin23 The Nets are playing with fire if they don’t trade Harden before the trade deadline. He is not to be trusted.",
    "44": "I like the OVER 226 in the @nuggets @BrooklynNets game.. the over has hit 8 of the last 9 Nuggs/Nets game after a loss. Look for both teams to fill it up.",
    "45": "🇺🇲 NBA\n🏀 Denver Nuggets 🆚️ Brooklyn Nets\n⏰ 23:30\n📺 @ssporttr\n💻📱 @ssportplustr\n🎙 @ugurozan &amp; @kaankural",
    "46": "🏀 NBA\n🇺🇸 Brooklyn Nets vs Denver Nuggets\n👉 Denver Nuggets -5.5 @ -175\n\n#FreePick #ApuestaGratis #NBA https://t.co/NHEA8yPClG",
    "47": "@burntcebolla @BrooklynNets but if we going 1/11 he get da whole quarter 😔",
    "48": "@impulse020 He is a Brooklyn Net",
    "49": "@BrooklynNets @KesslerEdwards LETS GOOOOO",
    "50": "@BrooklynNets 8 straight losses 🔥🔥🔥",
    "51": "@DownwiththeMets @Nightwatch4115 They still are. So are the Brooklyn Nets.",
    "52": "I love all these guys and respect them. But this starting lineup is not the BROOKLYN NETS and people have to understand that",
    "53": "@1of1saint @BrooklynNets plus look at our injury chart and tell me why we’ve been losing so much",
    "54": "@BgSniper6ft7 @BrooklynNets Someday you’ll thank me when you finally get that job.",
    "55": "@notjmorant @BrooklynNets It's okay bro 😂👍",
    "56": "@1of1saint @BrooklynNets I mean he still was the best out of all of them meanwhile derobum not winning a ring ever",
    "57": "Nets aren’t trading James Harden, Steve Nash says #Brooklyn #Nets #NBA https://t.co/ujzJVmPWg9",
    "58": "@BrooklynNets More James Johnson. Wooo",
    "59": "@vicecity4life @BrooklynNets You funny asl every time I see you i laugh I don’t what it is 😂😂",
    "60": "@BrooklynNets Oh Deus",
    "61": "@BillyReinhardt #Nets SMH THIS STAFF IS CLUELESS WHY WOULD YOU NOT START SHARPE!!!???? I hate this small ball mess  @BrooklynNets @NetsKingdomAJ",
    "62": "@BrooklynNets This team has a big problem: Steve Nash. Time to ship him out, let's go!",
    "63": "@BgSniper6ft7 @BrooklynNets Good. Maybe it’ll get you grammar lessons.",
    "64": "@BrooklynNets @blakegriffin23 Blake is such a handsome man. Too bad he is with the #Nets. https://t.co/FR5TioEIrk",
    "65": "@Superbowlfifty2 @BrooklynNets @KyrieIrving @blakegriffin23 And then Netflix for a week, right?",
    "66": "@BrooklynNets not watching",
    "67": "@burntcebolla @averagenetsfan @BrooklynNets Am I wrong? https://t.co/WubdDfHOTG",
    "68": "@BrooklynNets @KyrieIrving @blakegriffin23 Part timer",
    "69": "@BrooklynNets Nuggets is definitely winning. good for me. I’m betting will Barton to go 15pt with a w",
    "70": "James Harden trade? Brooklyn Nets coach Steve Nash says no https://t.co/pm9G8z2NGJ #NBA #BrooklynNets",
    "71": "Nuggets playing the nets who are desperate for a win, take Brooklyn and the points man",
    "72": "🏀 Denver Nuggets - Brooklyn Nets\n⏰ 23.30\n📺 S Sport\n🎙 @ugurozan &amp; @kaankural",
    "73": "@BolWrld @BrooklynNets Ratio",
    "74": "May I remind you all\n\nSteve Nash is the same Nets coach that denied the Harden rumors and said that the team was together and no unexpected changes were going to be made. Kevin Durant is also the same Nets player that firmly denied that Brooklyn was of any interest in Harden.",
    "75": "CALLING ALL NETS FANS!\n\nGear up for today's matchup vs the Nuggets and get FREE SHIPPING on all Brooklyn Nets gear with @Fanatics latest offer: https://t.co/0a3KXi2I6O🏆\n\nDEAL ENDS SOON! 😤 https://t.co/ffzWd8woMK",
    "76": "@BrooklynNets the spacing is going left...😬",
    "77": "@BrooklynNets Wtf is this cringe I’m not watching",
    "78": "@BrooklynNets black ruim Griffin?¿???????",
    "79": "@RamadanKYRlE @BrooklynNets Cam from the Bench",
    "80": "@1of1saint @BrooklynNets i say we because i’m the nets assistant coach",
    "81": "@BrooklynNets Fire nash",
    "82": "NBA PLays\nBoston Celtics -9.5 (A+)\nMil Bucks -3.5 (A-)\nN.O Pel -5.5 (B+)\n\nParlay Plays\nMinn -12 (B-) buy pts if can.\nNets 8+ (C+)\nCavs -5.5 \n\n@celtics @BrooklynNets   #JamesHarden @ATSstats #Bol",
    "83": "@BrooklynNets How you on a 7 game losing streak and watch how james Johnson playing and still start him ?? this is ridiculous",
    "84": "@BrooklynNets Poverty",
    "85": "@BrooklynNets Keep Fighting! Resist! Kevin Durant will return after the all star, f*ck Harden and fire Nash!",
    "86": "@1of1saint @BrooklynNets we beat them by 40",
    "87": "@BrooklynNets This looks worse every week ffs",
    "88": "@BrooklynNets Y’all reallly expect Kyrie to win when his second leading scorer about to be James Johnson",
    "89": "@BrooklynNets Why is JJ starting fam",
    "90": "@BrooklynNets fix the depth pls",
    "91": "@BrooklynNets why do you plan on ruining my day this early",
    "92": "Tonight's starting lineup for the Brooklyn Nets: Irving, Mills, Edwards, Johnson, Griffin https://t.co/bVWH4AMCA2",
    "93": "@BrooklynNets KD and Harden def playing video games rn they not watching this no way",
    "94": "@averagenetsfan @BrooklynNets Usually when a player has a career game Nash benches him",
    "95": "@BrooklynNets ??? James Johnson ?",
    "96": "@BrooklynNets Jokic gonna feast",
    "97": "@BrooklynNets Y'all cannot use this gif rn y'all actually boutta be in the lottery with this shit",
    "98": "@BrooklynNets bruh wtf",
    "99": "@BrooklynNets James Johnson better be gone by the deadline",
    "100": "@BrooklynNets PLEASE TAKE OUT JAMES JOHNSON PLEASE WAIVE HIM PLEASEEEE",
    "101": "@BrooklynNets Bro WHY DO YALL KEEP PLAYING JAMES JOHNSON I’ll rather play milsap over him",
    "102": "@BrooklynNets JJ? We lost",
    "103": "@BrooklynNets hope nash plays cam thomas bro went off yesterday",
    "104": "@BrooklynNets 8 loss it is 🤦‍♂️🤦‍♂️",
    "105": "@BrooklynNets JJ starting AGAIN?",
    "106": "@BrooklynNets Just fire Nash already!!! He’s really awful with rotations!!",
    "107": "Looking back through some oldies today; who would’ve thought? While Kyrie stayed in Brooklyn, he’s been this season’s main source of strife. Plus, the Nets already missed their window. We’re not getting past any of the East’s big men. https://t.co/6qbcz1yQvs",
    "108": "@BrooklynNets wonder if nash wants jj to take the first 8 shots???",
    "109": "@BrooklynNets there’s no hope",
    "110": "@BrooklynNets Like what do we see in james johnson",
    "111": "@BrooklynNets This line up get more sorry everytime the nets play",
    "112": "@BrooklynNets Not watching",
    "113": "@BrooklynNets @blakegriffin23 Y’all we are fine, Steve Nash and them are thinkin ahead!!! https://t.co/d5lrABU42j",
    "114": "Brooklyn Nets\n@ Denver Nuggets\nSun 3:30 PM EST\n\n🏀 Bet of the Game 🏀\n\n🟡 BKN +8.0 -110",
    "115": "@BrooklynNets Oh god",
    "116": "@BrooklynNets griffin is ass tell him to stop taking threes",
    "117": "@BrooklynNets God help us 🙏🙏",
    "118": "@BrooklynNets hargoat is a clipper",
    "119": "@BrooklynNets TF IS THIS",
    "120": "@BrooklynNets dismantle the team",
    "121": "New group to start ⤵️ https://t.co/501L7B59Es",
    "122": "@VicLombardi @nuggets @BrooklynNets Is it that empty?",
    "123": "#NBATicket #NBA75 Sunday doubleheader on NBA TV Basketball\n@BrooklynNets vs. @nuggets\n 3:30pm ET https://t.co/P1JMQLAGY0",
    "124": "@RobCerda My Teams. AFTER the New Jersey Nets left to go to Brooklyn I don't have a basketball team. https://t.co/45mbJLXoxp",
    "125": "I still believe in yall boys @BrooklynNets get it done!",
    "126": "@BrooklynNets @KyrieIrving @blakegriffin23 @KyrieIrving with the paper shopping bags as luggage is all-time",
    "127": "Brooklyn Nets coach Steve Nash denies that James Harden will be traded amid the Philadelphia 76ers rumors.  https://t.co/6ncmwZtpxc",
    "128": "@BrooklynNets @blakegriffin23 he’s repping headband Joe tonight 🧔🏻",
    "129": "@BrooklynNets put Simmons in the right position feed him with positivity and support he’ll help the #Nets win them chips don’t forget about his stats 6’10 point forward defensive menace offensive play maker and finisher around the basket smh",
    "130": "OFICIAL\n\nChicago Bulls acerta troca com Brooklyn Nets por James Harden https://t.co/AEVJ1dhIOp https://t.co/nUMKPTm3yQ",
    "131": "Here we go! Still daylight outside @BallArenaDenver for out matinee vs the @BrooklynNets Let's go @nuggets time to end our losing streak &amp; keep theirs going. #MileHighBasketball in the house. https://t.co/Y4sMD0IKwe",
    "132": "Ready for @nuggets vs @BrooklynNets too hyped😤😤😤",
    "133": "Afternoon game between the @nuggets and @BrooklynNets. \n\nIt pays to be a small man. https://t.co/ndgM9RbuST",
    "134": "@BrooklynNets - We NEED a big man. Looks like Portland is throwing in the towel…go get Jusuf Nurkic.",
    "135": "Steve Nash Says Nets Aren't Trading James Harden amid 76ers, Ben Si... (Bleacher Report)\n\nBrooklyn Nets coach Steve Nash had a one-word answer when asked if the team is considering t...\n\nAdd your highlights:\nhttps://t.co/xN3XLMDeSv\n #Brooklyn_Nets",
    "136": "Steve Nash Says Nets Aren't Trading James Harden amid 76ers, Ben Simmons Rumors #Brooklyn #Nets #NBA https://t.co/36vewVnKWD",
    "137": "@KDTrey5 This is funny you will never win another ring while you’re a Brooklyn net because of Kyrie Irving",
    "138": "Love that we get the Nets at 9:30am Brooklyn time. Ill take every advantage I can",
    "139": "@BrooklynNets @blakegriffin23 @ManofNets LETS GOOOOO",
    "140": "@IsaiahMoejones @AshleyBaker_21 The Brooklyn nets organization been weird, I told someone Blake griffin was holding back when he played for Detroit so he can be on that team and no one believed me.",
    "141": "@Arun30384 @JayLGK @Rob24282840 @BrooklynNets We talking about the nets not GSW and he’s showed up to play every time so far🤷🏾‍♂️",
    "142": "I’m not sure how this is possible but @blakegriffin23 has shrunk by 5 inches since being on the @BrooklynNets",
    "143": "@BrooklynNets @blakegriffin23 So? Win a game",
    "144": "RT NYPost_Lewis: Steve Nash says James Harden’s absence has nothing to do with trade rumors swirling around him. Adds he’s had multiple ta… #BrooklynNets",
    "145": "@VollmayerOnFire @TheMarkHenry would be a beast in the paint for the @BrooklynNets be sweet if he was part of the #NBACelebGame this year during #AllStarWeekend",
    "146": "@BrooklynNets @KyrieIrving @blakegriffin23 New coach is needed. Nash makes the most questionable decisions.",
    "147": "NBA Rumors: James Harden To Philly, Ben Simmons &amp; Tyrese Maxey To Brooklyn In Proposed Sixers-Nets Trade – NBA News https://t.co/2YFQ2aojUu",
    "148": "@KDTrey5 @Michael8easley @NationAfrica He not the real owner @BrooklynNets he can’t front yalll what he get fronted… to front shortie lol and wait on all that back.. and pay you your contract.. that’s why the owner don’t fw y’all @AlibabaGroup always talking deals just like the artist.. meant you need their money 😔 https://t.co/ICtFtt3Ij9",
    "149": "@BrooklynNets There is no purpose in playing this game",
    "150": "Brooklyn head coach Steve Nash says the Nets are not trading James Harden. https://t.co/VMrtiJMg1u",
    "151": "Kevin Durant &amp; Stephen A. Smith Get Into Heated Twitter Exchange About KD’s Legacy Source: Tim Clayton – Corbis / Getty Kevin Durant and his Twitter fingers were very active. The Brooklyn Nets superstar decided to address... - https://t.co/M9TTX67jIF #digitalmusiczone https://t.co/WF6Q1TVXEX",
    "152": "@BrooklynNets @HSpecialSurgery Claxton is always injured or sick, he is a lite weight. Nets should trade him and upgrade that position",
    "153": "@BrooklynNets @blakegriffin23 Yikes those legs💪💪💪💪",
    "154": "Kevin Durant &amp; Stephen A. Smith Get Into Heated Twitter Exchange About KD’s Legacy Source: Tim Clayton – Corbis / Getty Kevin Durant and his Twitter fingers were very active. The Brooklyn Nets superstar decided to... - https://t.co/M9TTX67jIF #onmygrind #ghettomogul https://t.co/kudtEHP2jb",
    "155": "@Coco_Mch13 @NO_EXTENDO @PlayboiClaxton He is only being slandered because he wants out. Nets fans would love him if he wants Brooklyn. Show &amp; tell!",
    "156": "Damn, the Brooklyn Nets have aged Steve Nash. https://t.co/fRB8RzVgRJ",
    "157": "@BleacherReport Mine as well trade him get something out of him while you can @BrooklynNets Once free agency hit he’s gone😭",
    "158": "Kyrie Irving - Brooklyn Nets need to face reality but not push 'panic button' after 7-game skid\nhttps://t.co/fpgcHKiARX\nhttps://t.co/fpgcHKiARX",
    "159": "THE Brooklyn Nets will not trade James Harden.🚨",
    "160": "the whole situation in brooklyn is just karma on nets fans for calling james harden the mvp of the team. we ain’t forget",
    "161": "@KDTrey5 Stephen A. was actually spittin here. You left Steph and the warriors for kyrie and the nets. You don’t get a ring in Brooklyn then the narrative will be Steph got you those rings. Peace.",
    "162": "@BleacherReport If u think Steve Nash has any say into anything regarding the Brooklyn Nets your sadly mistaken https://t.co/V3aAXCsUje",
    "163": "@BrooklynNets @KyrieIrving @blakegriffin23 We have no chance blow the team up",
    "164": "Nikola Jokic, the #NBA’s leader this season with 13 triple-doubles, has had a triple-double against 27 of the other 29 teams.\n\nThe Brooklyn Nets are the only team of the 27 that the #Nuggets don’t have at least one win against when he has a triple-double (0-1).\n\n#Serbia 🇷🇸 #MVP",
    "165": "@BrooklynNets @HSpecialSurgery Damn🤦🏿‍♂️",
    "166": "@BrooklynNets @blakegriffin23 Win a game first",
    "167": "@BrooklynNets @blakegriffin23 Can we just get a W",
    "168": "@BrooklynNets @blakegriffin23 Good on him, its so shit right now ,might as well have a laugh. https://t.co/iaToz4N7JL",
    "169": "Kevin Durant calls Stephen A. Smith a ‘flat out hater’ #Brooklyn #Nets #NBA https://t.co/LRQfai1Jgl",
    "170": "@BrooklynNets @blakegriffin23 pls win",
    "171": "“It sounded like you guys are not trading James Harden.\"\n\nSteve Nash: \"Yes, that's correct.\"\n\nLooks like James Harden will stay in Brooklyn 😳 #Nets \n https://t.co/4LSqqwkwBf",
    "172": "Nash: Nets Not Trading Harden: Brooklyn head coach says James Harden isn't going anywhere https://t.co/lGDEdxySDv",
    "173": "@BrooklynNets @KyrieIrving @blakegriffin23 block every thing out today and let’s get buckets",
    "174": "@BrooklynNets @blakegriffin23 Headband Blake will drop 30+",
    "175": "@BrooklynNets @blakegriffin23 Here’s a guy on a minimum contract, shows up every game. Gotta love him",
    "176": "@RookieRocc @BrooklynNets @blakegriffin23 No he aint",
    "177": "@BrooklynNets @blakegriffin23 Go Nets!! @BrooklynNets",
    "178": "@BrooklynNets @blakegriffin23 wait this might be clutch….",
    "179": "@hardensgotnext @BrooklynNets @blakegriffin23 Free someone who wants to stay how that work😂",
    "180": "NBA Rumors: James Harden To Philly, Ben Simmons &amp; Tyrese Maxey To Brooklyn In Proposed Sixers-Nets Trade\nhttps://t.co/Dbo5nYtN0f",
    "181": ". @WinamaxSport possible de rajouter denver nuggets x brooklyn nets sur votre book plz",
    "182": "Brooklyn Nets Coach Steve Nash confirms James Harden will not be traded by the deadline.\n\n\"I've talked to James. He wants to be here.\" https://t.co/TtrX3BJTKe",
    "183": "@BrooklynNets @blakegriffin23 dropping 5 points",
    "184": "@BrooklynNets @blakegriffin23 Plz win today for my health",
    "185": "@BrooklynNets @blakegriffin23 Cool he’s gonna drop 2 points",
    "186": "Headband Blake 👀 https://t.co/gtTJERnbw6",
    "187": "@BrooklynNets @KyrieIrving @blakegriffin23 When y’all trading Kyrie finally?",
    "188": "@Arun30384 @JayLGK @Rob24282840 @BrooklynNets Then the ONLY person that could get your team a chip left now yall sad 😂 just give us pascal we need a good defender rn and y’all wasting his future at lest with us he’ll have a Chance to get a ring cuz y’all ain’t winning shit",
    "189": "Brooklyn Nets reporters and beat writers just as weak as the fans lmao. They just wanted harden to be traded 10 hours ago",
    "190": "@nbamlb @CoachMcCartan Great call today Kevin as always, I'll have buzz in to Lori to her views on my suggestions for the Knicks, James Harden needs to stay in Brooklyn he needed seriously by the Nets right at the monument, Ben Simmons is terrible!",
    "191": "Steve Nash ahead of Brooklyn vs Denver today said he’s talked to James Harden and “he wants to be here. And he wants to be here long term.”\n\nConfirmed the Nets are NOT trading James Harden.",
    "192": "@BrooklynNets @KyrieIrving @blakegriffin23 Don’t lose https://t.co/WyiJ3z3HFJ",
    "193": "Steve Nash said nothing has changed with James Harden and his desire to be in Brooklyn except \"noise from the outside world.\"\n\nThat outside noise is coming from Philadelphia, where the 76ers have made their attempts to poach Harden from the Nets very clear.",
    "194": "Steve Nash says James Harden’s absence has nothing to do with trade rumors swirling around him. Adds he’s had multiple talks with the All-Star, and Harden wants to be in Brooklyn &amp; the #Nets want him. #NBA",
    "195": "@BrooklynNets Harden going to be traded to @sixers it’s a obviousness , he is supposedly injured when the rumors about a trade begin i find it very strange, for me there is no injury of @JHarden13 it’s just a diplomatic injury to prepare the team for a future without him !!",
    "196": "Yes I’m a degen in every which way #denvernuggets #brooklynnets #jokic4MVP https://t.co/9vVXOuVmie",
    "197": "@Arun30384 @JayLGK @Rob24282840 @BrooklynNets The big three we’ve been talking about for TWO DAYS I come to find out your team can’t win again just ONE of them 😂",
    "198": "@Arun30384 @JayLGK @Rob24282840 @BrooklynNets And they ain’t winning a chip bozo😂they got beat by KD paddy and g league players they ain’t winning with home court no home court fully Healthily NOTHING god forbid they see us in the playoffs easy sweep",
    "199": "I love @KDTrey5 but if the Nets lose both Harden and Kyrie (self inflicted) mans is gonna be alone in Brooklyn.",
    "200": "I really hate the position that the Brooklyn Nets are in....really really hate it. I don't really see any positives out of it, short-term or long-term\n\n#NetsWorld",
    "201": "@varun_garg21 @thambukishan @BrooklynNets Ok this one’s good 😂",
    "202": "@Arun30384 @JayLGK @Rob24282840 @BrooklynNets Well we know the raptors ain’t doing it 😂",
    "203": "@BrooklynNets @KyrieIrving @blakegriffin23 Haters blame Harden for everything but in same time wants him trade for Simmons, Carry  and Harris.\nHow come orribile, as they said is him, player has that value?🤓\nTurn the off TV and turn on brain,  if you have it.\nKYRIE broke chemistry,  as he did before, and Nets made 4/11",
    "204": "@BrooklynNets @KyrieIrving @blakegriffin23 get the w we need it, also its only gonna get tougher at barclays without kyrie and possibly no harden",
    "205": "@KDTrey5 this all comes down to the fact that @stephenasmith is butt hurt that you chose the #BrooklynNets over the #nyknicks … https://t.co/rNxps4s5Je",
    "206": "#optimusq&amp;a Who is your favorite nba team and what do you think of the Brooklyn nets",
    "207": "My #nets KD Kyrie Mills Kess Thomas Sharpe LMA Simmons Bembry Griffin Thybulle Trent Jr Korkmaz Turner Curry Maxey(fingers crossed) and Nikola Milutinov and coach Mark Jackson🏆🏆🏆🏆🏆🏆🏆 @BrooklynNets",
    "208": "@Arun30384 @JayLGK @Rob24282840 @BrooklynNets Idk why you act like just because that is we’re doomed 😂 no bro I’m not gonna say a team that has two of the greatest offense players of this generation of basketball is doomed because of no home court advantage that’s silly. Especially with playoffs months away",
    "209": "@BrooklynNets @KyrieIrving @blakegriffin23 Blake carry us to the win!",
    "210": "@BBallUnraveled @4zxmo @BrooklynNets @KyrieIrving @blakegriffin23 Only thing stopping this trio is injuries and Ky.",
    "211": "(THU.FEB.17) NBA:WSH-BKN PICK:The Wizards visit the Nets in Brooklyn! The Nets win this one @ home thanks to G James Harden:NETS 119-112",
    "212": "@stephenasmith @KDTrey5 I'll say it, dude you ain't gonna win SQUAT with the @BrooklynNets . You @JHarden13 &amp; @KyrieIrving are never on the floor together and everybody else on the team are scrubs. Wise up and take your ass somewhere else.",
    "213": "@MattBrooksNBA The Brooklyn Nets we all want back",
    "214": "@BrooklynNets @KyrieIrving @blakegriffin23 Hurry up and trade harden Simmons maxey and Seth we move.",
    "215": "@kingdj_5297 @BrooklynNets Appreciate the love family 🙏 thank you",
    "216": "Bra..KD came back from an achilles injury\nWas literally 2inches away from sending home the bucks with a game winning shot or put THE BROOKLYN NETS in the finals.\nAnd now he is leading the team without Kyrie. \nWhhhhhy do people go out of their way to discredit @KDTrey5 https://t.co/6MsiKR7NHk",
    "217": "@alanhahn @TyDButler Or “Stay off the Weed.” The stuff ppl are saying are off the charts. Did you catch @gordondamer show yesterday? He was on fire 🔥 excellent stuff on the @nyknicks as well as the @BrooklynNets #knicks #knicksnation",
    "218": "@BrooklynNets @KyrieIrving @blakegriffin23 Isn’t patty out with personal reasons",
    "219": "@BrooklynNets @24_camthomas @Patty_Mills @BrooklynNets Where can I buy what @24_camthomas is wearing? 🤔",
    "220": "@BrooklynNets @KyrieIrving @blakegriffin23 Kyrie got my Grandpa Jeans on!",
    "221": "@BrooklynNets @KyrieIrving @blakegriffin23 Where Kd ? If he ain’t playing y’all not winning.",
    "222": "Second #LayOfTheDay @nuggets x @BrooklynNets  SGP bet heavy up front end up almost 1000 profit on almost guaranteed Legs 🤑🤷🏾‍♂️ #TailAtYoOwnRisk #Lockit 🔒 🥼🧪 #Retweet https://t.co/K97BEXQJyG",
    "223": "@BrooklynNets @KyrieIrving @blakegriffin23 Get rid of Claxton fragile ass",
    "224": "@BrooklynNets @KyrieIrving @blakegriffin23 Trading harden would be the worst decision possible. Nets twitter that wants a worse/more disgruntled star (Simmons) instead are fools",
    "225": "Brooklyn Nets might be the biggest “what if” in history",
    "226": "@BrooklynNets @KyrieIrving @blakegriffin23 What do you call a fake superstar?\nJames harden 😂",
    "227": "@BrooklynNets @KyrieIrving @blakegriffin23 the man who killed the nets and blake griffin",
    "228": "@BrooklynNets @KyrieIrving @blakegriffin23 This would be a quality win to get back on track. Need this W.",
    "229": "@BrooklynNets @24_camthomas @Patty_Mills Let’s go nets",
    "230": "@4zxmo @BrooklynNets @KyrieIrving @blakegriffin23 Trio already a bust",
    "231": "@BrooklynNets @KyrieIrving @blakegriffin23 Where is Day'Ron",
    "232": "@BrooklynNets @KyrieIrving @blakegriffin23 don’t lose this time",
    "233": "@BrooklynNets @KyrieIrving @blakegriffin23 Harden on the trading block 😂😂",
    "234": "@BrooklynNets @KyrieIrving @blakegriffin23 Ben Simmons",
    "235": "@BrooklynNets @KyrieIrving @blakegriffin23 Only W today",
    "236": "@BrooklynNets @KyrieIrving @blakegriffin23 Showtime",
    "237": "@BrooklynNets @KyrieIrving @blakegriffin23 if harden gets traded then the kyrie, kd, harden, trio would be a bust",
    "238": "We want to win today @BrooklynNets",
    "239": "@SeanTPendergast I'd be supportive if James Harden came back to the Rockets in free agency. I never stopped liking him. Just the way he forced his way to Brooklyn and quit on the team. The Nets draft picks will soon pay off. I'm not hating on Harden like some are. Unfair or not it's a business.",
    "240": "@KDTrey5 Nothing but Respect on that right there KD . I still see Brooklyn Nets and either The Suns or Lakers competing for NBA CHAMPIONSHIP this year 💪💯🏆🔥",
    "241": "@BrooklynNets What do you call a fake superstar? \nJames harden",
    "242": "@HardenHesi @BrooklynNets That is sad",
    "243": "@J_Santino13 Harden is out in Brooklyn. Either they do it now, and get Simmons. Or he does it after the season and nets get nothing. Sixers in the drivers seat here. Maybe sixers throw in Danny Green. Just to be nice.",
    "244": "If the @BrooklynNets get Simmons I suggest everyone go to YouTube listen to the podcast with shaq and Isaiah Thomas then go listen to the podcast with Shannon Sharpe and Mark Jackson both hall of fame’rs have a logical positive take on Simmons #Nets",
    "245": "@god @BrooklynNets 8Ls in a row :( https://t.co/FwPYMvvfX8",
    "246": "@Tony994445271 @varun_garg21 @BrooklynNets and they still got locked up by rudy gobert",
    "247": "@_cumtopapi @BrooklynNets Harden say he want lef😂",
    "248": "@BrooklynNets vs @nuggets DELAYED at 9 am on @OneSportsPHL. @Bucks vs @LAClippers LIVE at 10 am on @CignalTV. https://t.co/rOF7jLQwbg",
    "249": "@IsmaTraoreS @BrooklynNets More like Simmons and Green",
    "250": "Nets' James Harden (hamstring) out vs. Nuggets #JamesHarden #NBA\n #BrooklynNets #BrooklynGrit  https://t.co/mFOQYIHHEg",
    "251": "@BrooklynNets Man I hope @KDTrey5 heals quickly. WE NEED YOU BRO",
    "252": "The Brooklyn #Nets have announced that star  #JamesHarden will miss Sunday's game against the Denver Nuggets due to \"hamstring tightness.\" 🏀 🤕 #NBATwitter #NBA  https://t.co/6zd2YWCbO5",
    "253": "@BrooklynNets Cam Thomas for 6TH Man",
    "254": "ever seen django? \n\nnotice how @stephenasmith never mentions @SteveNash when critical of @BrooklynNets ? https://t.co/tHBRpguxW2",
    "255": "🏀 The #NBA trade deadline is less than a week away, and a report has indicated that the @BrooklynNets are open to trading James Harden for Ben Simmons. https://t.co/SURUNsOSqI",
    "256": "@BrooklynNets Can Steve try this line UP\n1. Irving\n2. Harden/Mills\n3. Edwards\n4. Griffin\n5. Sharpe\n6. Thomas\n7. Bembry",
    "257": "Nets Gameday: Brooklyn tries to end ugly road trip with win in Denv... (The Brooklyn Game)\n\nThe Nets need a win, and they need one bad to break the current seven-game slump they've fou...\n\nAdd your highlights:\nhttps://t.co/XoLyzyU4CW\n #Brooklyn_Nets",
    "258": "@TheNBACentral @BrooklynNets get Jakob Poeltl",
    "259": "Dang it @JHarden13 is out again and now @_claxton33 is added to the list 😔 😟 🙁 @BrooklynNets c'mon guys, I know we can come together and get out of this slump 🤞🏻",
    "260": "@joey_buckets3 @Cheezery203 @Alec_Sturm Can you imagine if it goes Game 7 and it happened to be in Brooklyn and Kyrie doesn't play and Nets end up losing? LOL",
    "261": "In the Tattoo shop waiting to get this Tattoo done and then it’s home to watch the Brooklyn Nets .. Hopefully it don’t take forever and I end up missing the game",
    "262": "Brooklyn Nets vs. Denver Nuggets- 2/6/22 Free Pick &amp; NBA Betting Prediction https://t.co/loYgynhESH\n.\n#Betting #FreePicks https://t.co/RXaiMNLRdk",
    "263": "@BrooklynNets This is embarrassing... 6 game losing streak",
    "264": "The Brooklyn nets should trade James harden for Ben Simmons and then try to get Jeremy Grant so they would have Jeremy Grant Kevin Durant Ben Simmons Kyrie Irving that's a hell of a team to me better than what they have the Lakers will still win the championship this year.",
    "265": "@BrooklynNets  Damn this is not out year too many people are injured 😔😔😔😔",
    "266": "@evan_williams_ @JimmyKa72471426 @mhc_76 Harden doesn’t want to return to Brooklyn. Nets either trade him now, execute a sign and trade, or let him walk for nothing. Philly has Ben under contract for 3 more years and is performing well when the lineup is healthy.",
    "267": "Bro the Brooklyn Nets Championship parade is gonna be so much better with no werido Harden stans showing up 🙏",
    "268": "🔴Live ~ Brooklyn Nets vs. Denver Nuggets - NBA League 2022 🏀💯\n🔗 🔴Watch Live Fullᴴᴰ 👉 : https://t.co/KLt0tc3ZoA ✅\n📆 :On Sunday. February 06 /2022\n⏰ : 3:30 PM\nDONT FORGET TO SHARE AND FOLLOW FOR MORE INFO AND UPDATE.",
    "269": "@KDTrey5 Nah you don’t win with the @BrooklynNets you are a flop son. Super team my ass.",
    "270": "🤣😂😅  AGAIN??? Lol why?? Rodney King Said It Best...“Can’t We ALL Get Along!” Hmmmm.... @stephenasmith @FirstTake @BrooklynNets @NBA @NBAalumni @NBATV https://t.co/ii95AQ40Ea",
    "271": "Yea I didn’t think of it like that but if you guys wanna hold out hope James is gonna stay guys im praying your right but reality is sinking in at this point @BrooklynNets https://t.co/U5nTjLIuMJ",
    "272": "@SpencerKeele @sixers @BrooklynNets @Lakers In. your. dreams. Must be a Laker fan. No one wants Westbrook. Irving only plays away games depending on Covid rules. Lakers aren't trading LeBron.",
    "273": "@BrooklynNets OK but trade Harden for Simmons Thybulle and Curry @joetsai1999 https://t.co/v3YDZhypRb",
    "274": "Consensus Line Move:\n2022-02-06 Brooklyn Nets at Denver Nuggets from 229.00 to 226.00\nUnder get on board\n#NBA #sportspicks #deeplearning #investors",
    "275": "Consensus Line Move:\n2022-02-06 Brooklyn Nets at Denver Nuggets from -6.50 to -8.00\n#MileHighBasketball apple of my eye\n#NBA #betting #artificialintelligence #daytrading",
    "276": "The Brooklyn Nets try to avoid an eighth straight loss when they face the equally cold Denver Nuggets…\n\n#NetsWorld #MileHighBasketball #NBA #NBATwitter #GamblingTwitter \nhttps://t.co/dlpeyOFcuA",
    "277": "@BrooklynNets Trade Harden for Simmons Thybulle and Curry https://t.co/Tkh1Qk8Djp",
    "278": "@BrooklynNets Remember kids, when things aren’t going your way, just don’t show up to work.",
    "279": "NBA Trade Rumors: Nets Want to Deal Paul Millsap 'For a Shooter' by... (Bleacher Report)\n\nThe Brooklyn Nets are shopping around veteran forward Paul Millsap ahead of Thursday's NBA t...\n\nAdd your highlights:\nhttps://t.co/wHtEVf8AKF\n #Brooklyn_Nets",
    "280": "James Harden Out for Nets vs. Nikola Jokic, Nuggets Due to Hamstrin... (Bleacher Report)\n\nBrooklyn Nets guard James Harden will miss Sunday night's game against the Denver Nuggets be...\n\nAdd your highlights:\nhttps://t.co/WRO50bgfT2\n #Brooklyn_Nets",
    "281": "@jh13szn @BrooklynNets I never asked you bro",
    "282": "@stephenasmith @KDTrey5 I thought Stephen A's comments were a little harsh. But as a Rockets fan all I see are Brooklyn's three unprotected 1's in 2022, 2024 and 2026. The one this year may be late teen range. The other two may be lottery picks. Plus our own top three picks. Keep losing Nets @a_duckett",
    "283": "@blay_09 @BrooklynNets No \nAdey blame the coach and harden \nThem two Dey fool",
    "284": "Sunday doubleheader on NBA TV 🏀\n\n@BrooklynNets vs. @nuggets // 3:30pm ET \n@Bucks vs. @LAClippers // 9pm ET https://t.co/jRguxBJWCo",
    "285": "I need it, do the deal. @BrooklynNets",
    "286": "@_cumtopapi @BrooklynNets You too you dey blame Kyrie?",
    "287": "@BrooklynNets Guys please dont lose",
    "288": "@BrooklynNets Bring dlo and RHJ back those were the fun days",
    "289": "@BMACK_3 @BrooklynNets Do you have parents.",
    "290": "@LBJALLTHEWAY6 @BrooklynNets Nvm he’s out",
    "291": "TIP: Denver Nuggets - Brooklyn Nets, N. Jokic 25.5 vise , 1.9 by #tipster Sale187 (profit this month: +64.88)\n  #betting #Basketball #Denver #Nuggets #Brooklyn #Nets",
    "292": "The Brooklyn Nets are going to beat the Denver Nuggets today. Kyrie masterclass🔜",
    "293": "@LBJALLTHEWAY6 @BrooklynNets I’m pretty sure it’s questionable but okay.",
    "294": "Nets Gameday: Brooklyn tries to end ugly road trip with win in Denver – NBA News https://t.co/eH8nScqqMF",
    "295": "Nets Gameday: Brooklyn tries to end ugly road trip with win in Denver – https://t.co/QG9xkZHWX3",
    "296": "@BrooklynNets Whose ready to lose by 12 points or more ??? We are !!!",
    "297": "@TVMoviefan30 @PHLSixersNation @BrooklynNets I would love to know the same thing",
    "298": "@BrooklynNets @HSpecialSurgery fire nash and trade frauden @joetsai1999",
    "299": "RT therealmikekb: The #Sixers will not include Tyrese Maxey in any potential deals with the #Nets for James Harden prior to the trade dead… #BrooklynNets",
    "300": "@DavidEnglander @BrooklynNets Thanks David!!",
    "301": "@Pickswise @BrooklynNets Another damn L, god damn",
    "302": "@blay_09 @BrooklynNets Ataya them sef hm",
    "303": "For how quiet and vague the Brooklyn Nets are about injuries in general, they've outdone themselves with these recent Nic Claxton and James Harden injuries, which is why I'm not buying it",
    "304": "Brooklyn Nets vs. Denver Nuggets https://t.co/tkiuS1gegg",
    "305": "🏀 Brooklyn @ Denver\n\nThis is a pure contrarian play.\n\nGiven how James Harden has looked over the past couple weeks, I legitimately think the Nets are better off without him in the lineup for this game. I like BKN to win, but I like them to cover an inflated spread.\n\n🔒 Nets +8",
    "306": "@ChrisBHaynes Brooklyn Nets star Ben Simmons",
    "307": "Nets Gameday: Brooklyn tries to end ugly road trip with win in Denver https://t.co/vXVK1k6LB1",
    "308": "🔴 Live▶ Brooklyn Nets vs Denver Nuggets - NBA League 2022\n🔴Watch Live📺📱:  https://t.co/dZqesADET0\nDate : 2/6/2022 - Time : 3:30 PM",
    "309": "@BrooklynNets @HSpecialSurgery I wonder why we are losing?",
    "310": "@BrooklynNets Make this possible https://t.co/5zP72HB522",
    "311": "Sea salt is getting expensive in Brooklyn these days. #Nets #Durant #ESPN https://t.co/rkQU7oM0ED",
    "312": "@mignaci0 @BrooklynNets Happy bday Lino!!",
    "313": "@BrooklynNets Harden afraid (OUT) (Possible trade against Ben Simmons) (KD and Kyrie are enough)",
    "314": "Brooklyn Nets Kevin Durant talks about his most memorable Dunk Ever (Peep who was the first teammate to run to him)😅 #NetsWorld https://t.co/AwXGmNP7wo",
    "315": "🚨 Line Change 🚨\n\nBrooklyn Nets @ Denver Nuggets\nSun 3:30 PM EST\n\nFrom:\nDEN -6.5 -110\n\nTo:\nDEN -8.0 -110",
    "316": "Please win today on my birthday @BrooklynNets I’m begging you",
    "317": "@BrooklynNets ,trade this Dumbass ASAP !! https://t.co/yzLtUDSKit",
    "318": "Brooklyn heads to Denver to take on the #Nuggets with both teams on losing streaks. No James Harden today so it'll be the Kyrie Irving show\n\nWill Irving leads the #Nets to a win? Find out in my newest NBA preview @TWSN___ \n\n#NetsWorld #MileHighBasketball \n\nhttps://t.co/SN27k19Y2x",
    "319": "@PHLSixersNation Is he really hurt or is the @BrooklynNets just sitting him?",
    "320": "@BrooklynNets I thought Harden would be on the court today. He was always on the court in Houston. I’m curious about this Harden situation. #Nets #NetsWorld https://t.co/iMtOm8biWJ",
    "321": "@BrooklynNets What is with Claxton? He’s got problems every other 2 games",
    "322": "@BrooklynNets Why is this happening?",
    "323": "@BrooklynNets Harden (afraid to lose) - OUT",
    "324": "@Pickswise @BrooklynNets The trade is happening!!!!!",
    "325": "@BrooklynNets @HSpecialSurgery Nets again have 4 of their starting 5 out, literally cannot catch a break",
    "326": "No Harden for the Nuggets matinee game against Brooklyn today… Denver will just have to focus on slowing down the Nets trio of Patty Mills, Cam Thomas, and Kyrie Irving https://t.co/J7hAhx0KV6",
    "327": "@BrooklynNets Will this pain ever end?",
    "328": "@BrooklynNets Harden OUT (wants to leave)",
    "329": "@BrooklynNets Harden as soon as he gets traded https://t.co/xDOUu1EDuN",
    "330": "@HardenHesi @BrooklynNets its fine, we're gonna get defenders who can defend soon. still no shooters though https://t.co/qndtlwT39g",
    "331": "@BrooklynNets Yeah he’s def waiting for KD to get back",
    "332": "@BrooklynNets Fat ass",
    "333": "NBA Trade Rumors: Nets Want to Deal Paul Millsap 'For a Shooter' by 2022 Deadline #Brooklyn #Nets #NBA https://t.co/HxPpaW1S4C",
    "334": "@BrooklynNets You Dey vex me pass",
    "335": "@neuf4i @BrooklynNets Summons, Curry, Thybule + 1st round pick &gt; Harden",
    "336": "@Arun30384 @JayLGK @Rob24282840 @BrooklynNets No need we have a MVP candidate who averages 29.3 and when he plays makes us 8-10 holding it down at home idk why your acting like I said we ain’t gone win at home away is just a guaranteed victory",
    "337": "@BrooklynNets @HSpecialSurgery James harden - trade",
    "338": "@BrooklynNets He not playing until KD back😭",
    "339": "@StachesFaction Like I said, Brooklyn can do a sign and trade and sign him to the supermax. Can you not read? \n\nAlso, he clearly has no interest in playing with the Nets or this wouldn’t even be a topic. Don’t think the “supermax” is what’s gonna stop him from trying to win his first ring.",
    "340": "@Pickswise @BrooklynNets Sixers 👀",
    "341": "James Harden is OUT Sunday vs the Nuggets\n\n(Per @BrooklynNets) https://t.co/zEZwjTAboO",
    "342": "Updates to the Status Report for today’s game at Denver:\n\nClaxton (left hamstring tightness) - OUT\n\nHarden (left hamstring tightness) - OUT",
    "343": "The Brooklyn Nets ruled James Harden OUT for tonight's game at the Denver Nuggets. Harden is out with left hamstring tightness.",
    "344": "Hamstring injuries are more contagious around the Brooklyn Nets than Coronavirus.",
    "345": "Brooklyn Nets say star James Harden (being traded to Philadelphia) is out tonight against the Denver Nuggets https://t.co/4EvdYqtHeV",
    "346": "James Harden is out Sunday vs the Nuggets, per @BrooklynNets https://t.co/r1zn10RXuZ",
    "347": "@BrooklynNets Loose again!!",
    "348": "Brooklyn Nets say star James Harden (want to get the shit outta here) is out tonight against the Denver Nuggets.",
    "349": "Yeah he wants out of @BrooklynNets https://t.co/6LKNh9Qh8z",
    "350": "@ChrisBHaynes Brooklyn Nets say star James Harden (traded to Philadelphia) is out tonight against the Denver Nuggets.",
    "351": "🇺🇸 James Harden won’t play for the Nets at Nuggets today, his 2nd straight absence with a sore left hamstring. Tip-off at 3:30pm ET \n\n🇮🇹 James Harden salta Denver-Brooklyn delle 21:30 italiane: seconda assenza di fila per un problema al bicipite femorale sinistro \n\n#NBA75",
    "352": "@ChrisBHaynes Brooklyn Nets say star James Harden (On Flight to Philadelphia) is out tonight against the Denver Nuggets.",
    "353": "@ChrisBHaynes Brooklyn Nets say star James Harden (upcoming trade) is out tonight against the Denver Nuggets.",
    "354": "Brooklyn Nets say star James Harden (left hamstring tightness) is out tonight against the Denver Nuggets.",
    "355": "If the Brooklyn Nets lose today the Toronto Raptors will move into a tie for 6th place with Brooklyn. https://t.co/yHJJ0ECytb",
    "356": "Just come out and play and keep the dam game close against the Nuggets @BrooklynNets",
    "357": "The guy who commits a foul every time he shoots:\n\nJames Harden Is Reportedly Frustrated With The Brooklyn Nets: \"He Came To Brooklyn Expecting To Be Part Of A Three-Headed Monster, Yet Has Played A Similar Role To What Was Required Of Him In Houston.\" https://t.co/pWMWc5KOBk",
    "358": "NBA - 06.02.2022 23:30\n\nDenver Nuggets\nBrooklyn Nets https://t.co/E9DFnvTekd",
    "359": "@Hargoat13 Marks better get some shooters or he should be fired or something. How is harris still a brooklyn net.",
    "360": "Benny The Butcher, Funkmaster Flex &amp; More To Honor Black History Month During Brooklyn Nets Home Games\nhttps://t.co/EaaClNQ3g9",
    "361": "📅GAME DAY📅\n\n🏀 @BrooklynNets at 3:30pm\n🖥️ @DignitasLoL at 4:30pm\n🏀 @wcknicks at 7:30pm\n\n#NetsWorld #DIGWIN #WatchUsRise https://t.co/NdIBq19wIa",
    "362": "The 6-foot-11 Brooklyn Nets big joins Jakob Poeltl, Myles Turner, Robert Williams III, Jusuf Nurkic, Daniel Theis, and Danilo Gallinari as bigs the Raptors have reportedly expressed interest in leading into the Feb. 10 deadline\n\n#WeTheNorth #nba #toronto \n\nhttps://t.co/7RYU0GFREY",
    "363": "@jpclmnt97 @BrooklynNets You seem to have good basketball knowledge",
    "364": "@KDTrey5 Free agency gives players the right to move around.  KD has more than held his part for the Nets.  Whether he left GS for Brooklyn is his choice, and he is held up his end of the bargain.  KD's legacy will not be defined if he can't win a title in Brooklyn.",
    "365": "@BrooklynNets Not watching",
    "366": "I honestly ain’t even worried about Kevin Durant or the Nets if Harden and Kyrie leave. It’s Brooklyn. It’s Kevin Durant. Plenty of talent will wanna come play there that are \n\n1. Actually in shape \n2. Vaccinated \n\nKD gone be just fine",
    "367": "@BrooklynNetBlog just not playing good at all with so many talent players and so much money spent this can’t be acceptable on no counts, time to start getting long winning streak going and playing better ball. #GoNets @BrooklynNets",
    "368": "@BrooklynNets Love KD and want to support the Nets but can you guys just trade Harden already? He doesn't fit on that team and he's not aging well into his game. Just move on. That team still has a shot when KD gets back. Go get some good pieces for Harden and make it better!",
    "369": "The 76ers have a t2-game lead over the Nets, yet Brooklyn is currently the favorite to win the Atlantic Division. As the trade deadline approaches, @JonMetler examines the NBA Atlantic Division futures market. https://t.co/09nG3FpIHg",
    "370": "@BrooklynNets Is Harden playing?",
    "371": "@HardensBetta @BrooklynNets Pls do and give us Ben Simmons and Seth curry 🤷🏾‍♂️ you can have patty mills too",
    "372": "@BrooklynNets No thanks, team sucks",
    "373": "“Athletes have always played a role. Athletes are role models.” \n\nNets legends Buck Williams and Otis Birdsong discuss the importance of celebrating #BlackHistoryMonth and standing up for what is right. https://t.co/o86JCOVYaF",
    "374": "@utdrobbo @statmuse I feel like the bucks can do it and the nets if they're healthy, but its a big if for brooklyn",
    "375": "@BrooklynNets @HSpecialSurgery L8 already",
    "376": "@NETSCHIPSZN2022 @dakilla1500 @stephenasmith @KDTrey5 This is a shared opinion among almost everyone who isn’t a nets or KD fan. It’s okay to admit it. I hope he does win with Brooklyn but if he doesn’t then he’ll always be known as the guy who took the easy way out",
    "377": "Brooklyn Nets, Sixers and the Los Angeles Clippers can still work a monster trade that puts them all in a better position.\n\nSean Marks and Steve Nash are sure to get fired this off-season if the Nets do not make the NBA Finals. There is no chance they wi… https://t.co/dfAkL42dkA https://t.co/ougUNKdJpd",
    "378": "Didn’t this same man say if the Brooklyn Nets win a championship it would be a disgrace to basketball? He is actively rooting against the Nets, but flip flops when called out by KD &amp; people are defending screaming A. https://t.co/K1gCrTXubr",
    "379": "@jpclmnt97 @BrooklynNets If you blame Harden for everything you can’t after that ask trade with three good players for him.",
    "380": "@BrooklynNets pain",
    "381": "@cavs have a better record then the @Lakers and @BrooklynNets 😂😂😂 Superteams don’t work anymore you bums 😅✌🏻❤️",
    "382": "If he wants out bench him until you make a deal @BrooklynNets #NetsWorld Put someone out there who is hustling.  FYI again this is effing Kyrie’s fault and nobody can tell me it isn’t @NBA @NBAOfficial. \n\n#Beard #BeardTalk https://t.co/oG86UvQbUb",
    "383": "Newest ep out now! Give it a listen #Nets #brooklyn #NBA https://t.co/OXuAW1EZ4k",
    "384": "Girlfriend is working today, so I did what all smart boyfriends would do and scooped a ticket to see @nuggets vs @BrooklynNets…\n\nGot an awesome deal via Ticketmaster’s resell option, too. $145 ticket for $58 🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻\n#LetsGoNuggs\n#GamblingTwitter https://t.co/hQanCuFKUR",
    "385": "@KDTrey5 Steve A, just acknowledged what he said was egregious so he agreed, he also directly pointed out how media works and how the media is going to look at the Brooklyn Nets if they don't win a championship. He acknowledges you as being one of the greatest basketball players. No hate",
    "386": "The @BrooklynNets at @utahjazz | #NBA75 FULL GAME #HIGHLIGHTS | February 4, 2022 https://t.co/xYN3Mvt2Re via @YouTube  &amp; @NBA  \n#TakeNote, #BlackHistoryMonth, #CharityWork, @MarcusRashford's World, #MyWorld, #NetsWorld",
    "387": "In an alternate universe:\n\n-Rockets Trade John Wall for Westbrook (Exercise Westbrook’s buy out)\n-Philadelphia trade Ben Simmons for Harden\n-Westbrook signs a low deal in search of a ring with the Brooklyn Nets to re-unite with friend turned foe Kevin Durant.",
    "388": "@archilab_io @RTFKTstudios Check out this 🤩🤩 Netaverse, Where Brooklyn Nets Players Can Be Seen in a Whole New (3D) Light",
    "389": "@BrooklynNets Arm sleeve Kyrie byke and this a bounce back game, this a dub",
    "390": "Deutsche Brooklyn Nets https://t.co/sJwWfDtelq",
    "391": "@stephenasmith and the media will yip and cry no matter what KD’s decision is. But you can’t tell me that Nets team is better than Warriors when all healthy and able to play without government mandates. KD made the right decision to play in Brooklyn (pre-pandemic decision).",
    "392": "@KDTrey5 If the @BrooklynNets don't win it all this year, no big deal. I'm gonna remember you saying \"If you can't beat 'em, join 'em.\" And thus taking your talents to Oakland, CA to win your 2 championships. The \"Super Team\" concept isn't working this time for you. That's karma!",
    "393": "Nets at Nuggets: Prediction, point spread, odds, over/under, betting picks #Brooklyn #Nets #NBA https://t.co/X0wGdZwGwO",
    "394": "@BrooklynNets @joetsai1999 @KDTrey5 \n\nFriendly reminder Simmons + pieces would be a much better fit than Harden. Make the trade happen!",
    "395": "@BrooklynNets Fire Steve Nash and Kyrie ！",
    "396": "@JeffreyBatt18 🤣The Brooklyn Nets are in such a pickle which is why they leaked the news about Harden trade talks.\n\nThey have 3 choices:\n\nA) Trade Harden for Simmons now\nB) Trade Harden for Tobias in the off-season\nC) Get zero compensation for \nHarden\n\nThat’s what we call a Morey… #CheckMate https://t.co/kJZUx4tkzj",
    "397": "Anchor: What can the Nets do better or do to improve from here\n\nSAS: KD will be known, not as the MVP, but as the guy that left Steph and GSW to team up with Kyrie and Harden in Brooklyn.\n\nPlease how does his answer relate to the question or the future of this Nets team? How?!",
    "398": "@APOOCH happy birthday brotha!Shout out to you for being an elite reporter and repping the squad even when it wasn’t popular to, enjoy your day my guy!! Also @BrooklynNets get my guy on the beat ASAP! The people need it https://t.co/8CoMs9Nsq4",
    "399": "@BrooklynNets Let’s make it 8 🔥",
    "400": "@BrooklynNets Centers\nAldridge\nSharpe\nClaxton\nBlake Griffin is not a Center 🤦🏽\nHow can they get rebounds or blocks using Blake as a Center?",
    "401": "James Harden Is Reportedly Frustrated With The Brooklyn Nets: \"He Came To Brooklyn Expecting To Be Part Of A Three-Headed Monster, Yet Has Played A Similar Role To What Was Required Of Him In Houston.\" https://t.co/jvpuT8tjCc",
    "402": "NBA AI Analysis: Brooklyn Nets – Denver Nuggets https://t.co/qhplgfFFXv",
    "403": "@EnetricRealGM @KDTrey__SZN 🤣The Brooklyn Nets are in such a pickle which is why they leaked the news about Harden trade talks.\n\nThey have 3 choices:\n\nA) Trade Harden for Simmons now\nB) Trade Harden for Tobias in the off-season\nC) Get zero compensation for \nHarden\n\nThat’s what we call a Morey… #CheckMate https://t.co/tHPmgnOZ88",
    "404": "@BrooklynNets Let's gooo",
    "405": "The Boston Celtics could head into Monday having won more games this season than the Brooklyn Nets. Each team enters tonight’s action having won 29 games.",
    "406": "Tonight the Brooklyn Nets (29-23) visit the Denver Nuggets (28-24) at 3:30 🕞 @YESNetwork #Brooklyn #Nets #NBA #BrooklynTogether",
    "407": "I seriously have to apologize to @BillSimmons for his statements about @KyrieIrving when he first came to Brooklyn. I thought he just being a hater because Kyrie left. Everything he said was correct. Seriously hope this dude is gone next week #kyrieirving #kyrie #brooklynnets",
    "408": "@BrooklynNets @HSpecialSurgery Y’all if hardens questionable he’s probably with the team",
    "409": "@BrooklynNets @HSpecialSurgery Claxton always hurt",
    "410": "@BrooklynNets @JHarden13 Better be afraid of this beard.",
    "411": "AI-analys basket: Brooklyn Nets – Denver Nuggets https://t.co/YNwyv9MuLY",
    "412": "Idk why everyone so worried about .@BrooklynNets for.. I see them dropping to 8th seed and winning it ALL.. their opponent gonna have to get by all big three with Kyrie going for road games.. magic of a plan.",
    "413": "\"What does Brooklyn want? They're not going to pivot towards a rebuild.\" \n\n@hpbasketball talks with league execs about unfolding drama between the Nets and 76ers, plus more deadline chatter from around the NBA:\n\nhttps://t.co/b1a0xmZ8J7",
    "414": "@BrooklynNets 8 L in a row Let’s go!!",
    "415": "@BrooklynNets @HSpecialSurgery We lost already",
    "416": "@BrooklynNets Congrats on making it an eight or nine game losing streak… i cant even keep count anymore",
    "417": "@BrooklynNets @HSpecialSurgery You forgot, Kyrie Irving - Brain Damage",
    "418": "@BrooklynNets @HSpecialSurgery Pain",
    "419": "@BrooklynNets @HSpecialSurgery our players are almost becoming doctors",
    "420": "@BrooklynNets trade Kyrie",
    "421": "@BrooklynNets @HSpecialSurgery pain",
    "422": "Brooklyn Nets vs  Denver Nuggets Prediction 2/6/22 -  Free NBA Picks https://t.co/hqohV6Qj5K via @YouTube \n\n#NBA #NBAPick #NBAPrediction #Basketball #NetsWorld #Nuggets",
    "423": "@BrooklynNets We continuing the streak 🌚",
    "424": "@titanlmao @kwilly462 @BrooklynNets Nah nah cause he’s got “LeFt HaMsTrInG tIgHtNeSs",
    "425": "Nets @HSpecialSurgery Status Report for today’s game at Denver https://t.co/NUbCLGC0Zq",
    "426": "@kwilly462 @BrooklynNets Mf acting like we running a team full of 6 year olds until the end of the season",
    "427": "@BrooklynNets Gotta being this “W” home today",
    "428": "@IsmaTraoreS @BrooklynNets Sixers are not that dumb https://t.co/lLyY4BLMcl",
    "429": "@mattmcfc_ @BrooklynNets We won't win a game for the rest of the season",
    "430": "@BrooklynNets another L....I'm sorry, BK is my team for now as it pays my favorite player @KDTrey5 but these loses are bad, some not even close",
    "431": "@BrooklynNets Another L",
    "432": "Analyzing Sunday’s Brooklyn Nets at Denver Nuggets odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/FsbsFG7waf",
    "433": "Analyzing Sunday’s Brooklyn Nets at Denver Nuggets odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/9Jmz0h8WNN",
    "434": "Brooklyn Nets at Denver Nuggets odds, picks and predictions https://t.co/OaE8awFUQA",
    "435": "@Ddelliponti08 @BrooklynNets No kd means no win",
    "436": "@TheHoopCentral Future Brooklyn nets player",
    "437": "All this chaos within the Brooklyn Nets organization brings me peace.\n\nNot one black coach was interviewed for the job 🤷🏾‍♂️🤷🏾‍♂️",
    "438": "@JClarkNBCS @NBCPhiladelphia @NBCSPhilly @Ike58Reese @Jacko2544 If no one has cap space, where is Harden going? And how can any credible member of the media act like the Nets are the ones who are trading from weakness? Harden is telling everyone he wants to be in Brooklyn, Simmons has refused to show up for 8 months. Philly is full of it. https://t.co/2oTlP5URpM",
    "439": "@BrooklynNets Let's go for the 8 straight L. 🙌",
    "440": "@BarnesCohen @HardensBetta @BrooklynNets Lol he aint even playing",
    "441": "@BrooklynNets 8 in a row baby",
    "442": "@KeithSmithNBA @BrooklynNets Brooklyn Nets have to do what is best for them\n\nYou cannot give Houston Rockets all this asset to get James Harden then only to watch Harden walk-out to 76ers two years later \n\nPlease pull the trigger\n\n#Nets #BrooklynNets #NetsWorld",
    "443": "@BrooklynNets Trade Harden for Simmons Thybulle and Seth! https://t.co/xHxMOBbrAi",
    "444": "@LRubinson One more thing Lori, the Nets absolutely under Noo Circumstances should they trade James Harden, for as much Bitching and Belly aching he does they cannot trade him James Harden is much of an important piece to the Brooklyn Nets especially right now at the moment!",
    "445": "Kevin Durant sounds off on Stephen A. Smith for saying the media will remember KD for leaving Steph Curry to join Kyrie Irving, if Golden State wins the NBA Championship and not the Brooklyn Nets. https://t.co/NtW74j78ze",
    "446": "@KeithSmithNBA If James Harden told Kevin Durant &amp; #Nets Management that he wants stay Brooklyn than Harden play &amp; body language does not reflect that\n\nIf I'm @BrooklynNets - I pull the trigger\n\nDurant told Westbrook he wanted stay OKC only turnaround &amp; join Warriors - So Please\n\n#BrooklynNets",
    "447": "@BrooklynNets don’t lose",
    "448": "@BrooklynNets Must win!!!",
    "449": "@mattmcfc_ @BrooklynNets poverty 😹",
    "450": "James Harden reportedly hopes to stay in Brooklyn through trade deadline https://t.co/0DRAcI7r7r #NBA #BrooklynNets",
    "451": "@BrooklynNets Fire nash",
    "452": "@BrooklynNets This game will probably put us in the playins. . .",
    "453": "@BrooklynNets We need harden",
    "454": "@BrooklynNets Can we break this streak ffs been 2 weeks without a win smh",
    "455": "@BrooklynNets Fire nash",
    "456": "The Brooklyn Nets visit the Denver Nuggets at 3:30pm ET this afternoon featuring a battle between two struggling teams.\n\nIn my latest for @SBD, I preview the game, outline who I think will end their losing streak and provide my best bet of the afternoon: https://t.co/HA0U9MPFzp",
    "457": "@BrooklynNets Simmons/Drummond/Matyse=Harden",
    "458": "@mibRSean @BrooklynNets how do u know he’s out?",
    "459": "@BrooklynNets 8th L in a row innit",
    "460": "@BrooklynNets 8 game losing streak. Trade for Ben Seth and maxey rn",
    "461": "@BrooklynNets We gonna make it 8?",
    "462": "@orlandoupnext @BrooklynNets Ya probaly",
    "463": "@BrooklynNets Let’s get some energy back in here y’all. If this isn’t something to get our energy back up idk what will https://t.co/JHFFZQe8mN",
    "464": "@BrooklynNets Nash out",
    "465": "@BrooklynNets More pain.",
    "466": "Sunday matinee in Denver https://t.co/HMFDQsqEhf",
    "467": "@BrooklynNets @CanonUSA And Ben can carry a team while KD is out or home games. Plus he's young, so you have him for a while! Will play immediately, trust me. All that's missing is a leader. Get a true veteran. Maybe Rondo on buyout for the year? Rubio next year. You'll figure it out. Juwan Howard type",
    "468": "@BrooklynNets @CanonUSA Btw, the trade you guys are working on is genius! Daryl gets the guy he's always wanted. James is finally happy and you don't need to worry about his uncertainty. Fans don't love him. And we get Defense, Size, and Passing/Playmaking Ability! Plus someone who is happy to be here!",
    "469": "I am sorry but the @BrooklynNets can’t win a title with Kyrie playing just road games. Ain’t happening. @NBATV I don’t believe they are winning the East.",
    "470": "Brooklyn Nets @ Denver Nuggets\nPick : Brooklyn Nets.\nBasketball. NBA",
    "471": "I don’t think the Woj report refutes that a trade isn’t happening. If anything it gives Nets a little leverage, and tells the fan base we wanted to keep Harden but If he isn’t committed then he’s out. Durant only wants players fully committed to winning a title in Brooklyn.",
    "472": "Pronostic Denver Nuggets – Brooklyn Nets 06/02/2022 NBA - LeFigaro Paris Sportifs\n\nhttps://t.co/deR47gYmit",
    "473": "@NBA @JHarden13 @BrooklynNets Why are ESPN keep clout chasing Westbrook all player's have a on/off night then play more defense ,but keep competing shooting too.",
    "474": "@BrooklynNets @CanonUSA Trade Harden for Simmons Thybulle and Curry",
    "475": "RT neerajmpatel: ATTN BROOKLYN RESIDENTS:\n\nStay indoors and do your stretches.\n\nA hamstring tightness epidemic is ravaging the borough.\n\n#… #BrooklynNets",
    "476": "@BrooklynNets Trade Harden for Simmons Thybulle and Maxey !",
    "477": "@BrooklynNets @socios Find them\nFool them\nFleece them\nForget them",
    "478": "Sun, 6th Feb: #DenverNuggets vs #BrooklynNets - ODD @ 1.63\nMore details on: https://t.co/E91pDbjB8L\n#baskettips #basketprediction #basketballbets #nba #usabasket",
    "479": "Nets at Nuggets: Lineups, injury reports and broadcast info for Sunday #Brooklyn #Nets #NBA https://t.co/VyolBgZpJG",
    "480": "2021-22 #NBA75 Regular Season: Brooklyn Nets vs. Denver Nuggets\n\n📅 February 7\n⏰ 9 a.m. \n📺 One Sports\n\n#AlwaysAFan #NBAonOneSports https://t.co/a5IQujfMTG",
    "481": "Denver's Nikola Jokic: \n✅ Reigning MVP\n✅ Reigning 'most charming player in the NBA' according to @bjarmstrong\n\nCan the Brooklyn Nets stop him tonight?\n\nNets @ Nuggets | 8:30PM | Sky Sports Arena\n+ FREE on YouTube at the link below 👇",
    "482": "@suns @bucks @warriors @heat @BrooklynNets \nplz trade someone for Rose so he can get a ring",
    "483": "The Brooklyn Nets’ metaverse tech puts players on the virtual court - Input https://t.co/qYoT0yFuA4",
    "484": "@ChaszJohnson Trying to keep up with the Brooklyn Nets Big-3 narrative.😭😭😭 Chasing BIG NAME PLAYERS instead of most natural fit. Point  guard position is not even a Top 2 Priority for trades. As long as you got Lebron, a free agent guard is adequate.",
    "485": "The @BrooklynNets need to bring him back they surely need him… https://t.co/jx03ho7qiZ",
    "486": "The Brooklyn Nets are listening to offers for GM/Owner Saire Davis to find a new home. Lakers, Suns, Warriors, Sixers, Bucks, and whoever are legit contenders are favorites. Saire has stated he wants to join a championship staff, to troll more extensively on Twitter… https://t.co/ixji3bwynq",
    "487": "@bish_empty @BrooklynNets I can like what I want muffin",
    "488": "Me thinking about all the struggles the @BrooklynNets are going through... But then I remember that we have @KDTrey5 for the long term... https://t.co/MSCWMv6WXe",
    "489": "For Brooklyn, Durant, Harden, Kyrie could never find quite find the Net(s) https://t.co/xoXTYLKRrZ https://t.co/5obCqETeAP",
    "490": "Here’s a great thought of helping each other @lakers @BrooklynNets . Let’s trade Russ for Irving 🤞🏼🤙🏼🤙🏼",
    "491": "Hey @BrooklynNets, if you need a scout that specializes in Big Ten players, my DMs are open https://t.co/1fGL4gvA1X",
    "492": "@KingHardenJr @BrooklynNets @JHarden13 James he just want to win but Kyrie not",
    "493": "NBA Sundays: Denver Nuggets-Brooklyn Nets LIVE alle 21.30 su Sky Sport Uno | Sky Sport https://t.co/st5sGKcUWS",
    "494": "@KenyonJohn @BrooklynNets @utahjazz Nice bro good job",
    "495": "NBA Sundays: Denver Nuggets-Brooklyn Nets LIVE alle 21.30 su Sky Sport Uno\n#SkyNBA #NBA\nhttps://t.co/nvwdYza81p",
    "496": "Companies exploring the Web3 space:\n\n• Meta\n• Sony\n• Apple\n• Nvidia\n• Adidas\n• Samsung\n• Brooklyn Nets\n\nProbably nothing.",
    "497": "NBA - Brooklyn Nets' Joe Harris might need second surgery on left ankle, agent says https://t.co/xPAYPqCQF5",
    "498": "A new mock trade has the Philadelphia 76ers acquiring James Harden in a 3-team deal with the Brooklyn Nets.  https://t.co/V9JYugHIK8",
    "499": "🏀#NBA ‼️\n1.Minnesota Timberwolves Vs Detroit Pistons\n2.Chicago Bulls Vs Philadelphia 76ers\n3.Denver Nuggets Vs Brooklyn Nets\n4.Dallas Mavericks Vs Atlanta Hawks\n5.Orlando Magic Vs Boston Celtics ...\n-------\n⭐️Free #livescore &amp; #livestream 👉https://t.co/z8cdc9BY9Y 😉 https://t.co/lEHtiCBbo3",
    "500": "Report: KD wants @JHarden13 to stay in @BrooklynNets\nhttps://t.co/lzNmJwdCxR",
    "501": "@in_nici @HardensBetta @BrooklynNets Fuck no😂",
    "502": "Harden is 32 years old let’s stop treating him like Jordan or Shack Fu???!!!\n\nKyrie has created a beard issue. \n\n@BrooklynNets #NetsWorld \n@NBA",
    "503": "Harden is 32 going on 65 F that homey. \n\n@BrooklynNets #NetsWorld \n\n https://t.co/3HesFcNBTx",
    "504": "DUNKED: Basketball\n\n\"Whats at stake for Kevin Durant if the Brooklyn Nets dont win a championship? | NBA Countdown\"\n\nGIVE IT A WATCH: https://t.co/VkXrUqXZYD\n\n#NBA\n#NBATwitter\n#Basketball\n#PullUpAChair",
    "505": "Give the beard a bus ticket to Philly yo @BrooklynNets #NetsWorld \n\n https://t.co/RQRsTactf4",
    "506": "NBA Basketball Game Betting Picks Simulator: 3:30 PM ET - Brooklyn Nets vs. Denver Nuggets - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/qpxqDwZffw #nba #sportsbetting #freepicks #cappertek",
    "507": "@HardensLefty Brooklyn Nets have no foundation. No culture. No identity. New Jersey had all of that. Brooklyn since it’s inception has been throwing their money around to get stars and praying and it’s blown up every time so far.",
    "508": "James Harden Is Reportedly Frustrated With The Brooklyn Nets: \"He Came To Brooklyn Expecting To Be Part Of A Three-Headed Monster, Yet Has Played A Similar Role To What Was Required Of Him In Houston.\" https://t.co/nAjsoJqd1A via @aikansh03",
    "509": "@DozManDark @ATLHawks @chicagobulls @MiamiHEAT @cavs @sixers @BrooklynNets @Suns @warriors @utahjazz @memgrizz @dallasmavs @nuggets @Timberwolves @Raptors @celtics @Lakers Keep that man away from the Cavs",
    "510": "F Kyrie @BrooklynNets @nbcsnl @NBA \n\n#NetsWorld",
    "511": "NBA - Brooklyn Nets' Joe Harris might need second surgery on left ankle, agent says https://t.co/tEd1KKW9sH",
    "512": "next up: do the Brooklyn Nets have the spine to do the same for Kyrie Irving?",
    "513": "@RealSkipBayless @KendrickPerkins @stephenasmith @undisputed @maxkellerman @McNuttMonica @undisputed @RealMikeWilbon @BrooklynNets @KyrieIrving @NetsAllBall HONESTLY REALLY, IT'S ONLY ONE THING LEFT TO DO BY KD? I THINK WITH THE BACK-TO-BACK INJURIES AND DEALING WITH KYRIE??? https://t.co/y1VvxkEMSh",
    "514": "I will never wear a Brooklyn Nets anything, sorry ! Shit gives me NASA clothing vibes.",
    "515": "Crooklyn b having issues but we move on @BrooklynNets #NetsWorld \n\n https://t.co/RQRsTactf4",
    "516": "Kevin Durant doesn't want Nets to trade James Harden? #Brooklyn #Nets #NBA https://t.co/LYV1dqM0lT",
    "517": "@aalho_3 Nah he hyped leaving Boston @BrooklynNets @celtics",
    "518": "@SunDevilHoops @JHarden13 @BrooklynNets stay in  nets   Please，trust  KD",
    "519": "@StoolGreenie He went to Brooklyn and all the talk was oh here come the rings Nets are the favorite, now we talking about him being disgruntled! 🤦🏻‍♂️😂",
    "520": "Brooklyn Nets need a break from this embarrassing losing back to back",
    "521": "@BrooklynNets \n\nEveryone wants to be dancing around the Kyrie 💩F that shit we here and can read between the lines. \n\n@BrooklynNets no way you beat @nuggets tomorrow. \n\nKyrie forced the beard out let’s talk facts.",
    "522": "James Harden has told Nets management he wants to stay in Brooklyn: report https://t.co/EhYi92Xt3p",
    "523": "#Harden #James #Sports\nJames Harden has advised Nets administration he needs to remain in Brooklyn: report \nhttps://t.co/08Gh2iAfXY",
    "524": "@RedNinetyFour Its bad but not that bad as you indicated 😂\n\nEssentially  if that happens then @HoustonRockets gave Harden on 2 yrs rental to Nets instead of selling to @BrooklynNets i.e. rent Harden from us @ 2 first rnd pick/yr rental charge 😂.\nRenting might b a great idea for teams!",
    "525": "At this point the New Jersey Nets are far better than the Brooklyn Nets will ever be.",
    "526": "Nerlens to the Nets @BrooklynNets make it happen 🤝😐 https://t.co/WKqyuFBGX7",
    "527": "RT DonBellonCBS3: Ben Simmons can’t handle pressure in Philly. Soooo… the solution is to play in NEW YORK?! #sixers #nets #SixersOutsiders… #BrooklynNets",
    "528": "@mamba4evaeva @SamQuinnCBS @JHarden13 @BrooklynNets thats 16 games over 2 seasons lol",
    "529": "For Brooklyn, Durant, Harden, Kyrie could never find quite find the Net(s) https://t.co/CNHch3NP5G https://t.co/FBHzf8U4du",
    "530": "#brooklyn_nets do not trade for ben simmons. A point guard who does not and  can not shoot jumpers or free throws will never be a championship player.",
    "531": "He’s not wrong though lol. Fair or not,  if the Nets don’t win, people will talk about how KD left a potential dynasty in GS to join Kyrie in Brooklyn. That was the perfect basketball situation for him. KD, Steph, Klay and Dray was unstoppable. https://t.co/6EXsgldaLw",
    "532": "@DozManDark @ATLHawks @chicagobulls @MiamiHEAT @cavs @sixers @BrooklynNets @Suns @warriors @utahjazz @memgrizz @dallasmavs @nuggets @Timberwolves @Raptors @celtics @Lakers @SacramentoKings y’all don’t need Halliburton, Hied, or Barnes",
    "533": "Wear the grey jerseys today @BrooklynNets",
    "534": "@DozManDark @ATLHawks @chicagobulls @MiamiHEAT @cavs @sixers @BrooklynNets @Suns @warriors @utahjazz @memgrizz @dallasmavs @nuggets @Timberwolves @Raptors @celtics @Lakers 100% from 3 tonight 🔥🔥",
    "535": "@CodexCT @Lakers @BrooklynNets @russwest44 @KyrieIrving You praying for brooklyns downfall or what??",
    "536": "@DozManDark @ATLHawks @chicagobulls @MiamiHEAT @cavs @sixers @BrooklynNets @Suns @warriors @utahjazz @memgrizz @dallasmavs @nuggets @Timberwolves @Raptors @celtics @Lakers Best 3 point shooter on the team👍🏽",
    "537": "@Arun30384 @JayLGK @Rob24282840 @BrooklynNets Home court*",
    "538": "@Arun30384 @JayLGK @Rob24282840 @BrooklynNets Also keeping the kai situation in mind they we not looking for hole court anyway I’m sure we’ll gladly take a seed where we can have all three and push ahead then just worry about KD holding it down at home",
    "539": "@Arun30384 @JayLGK @Rob24282840 @BrooklynNets Because unlike you he sees that we have talent MEANT for the playoffs they came to Brooklyn to play together and be great together they ain’t the experiment Brooklyn is so why waste ANY years or time in general if they all healthy come post season no matter where we at",
    "540": "@TheNBACentral @KyleNeubeck Harden literally saying he’s good in Brooklyn. If y’all not gonna offer the Nets what they want they just gonna shut the door dumbasses 🤣",
    "541": "@KvngPke I feel like i remember a certain bearded, fat, Brooklyn nets player putting up this same statline just last week 🤔",
    "542": "@RedHourBen And then lose the game Ben. We’ll welcome u across the bridge tho @BrooklynNets",
    "543": "@BrooklynNets @CanonUSA Why hasn't Nash resigned yet?",
    "544": "Hey @MarkJackson13 Would you be interested in being the new coach for The @BrooklynNets???",
    "545": "Hey @joetsai1999 &amp; Sean Marks As much as I hate saying this we need to fire Steve Nash and hire Mark Jackson? RT #BrooklynNets fans if agree with this decision. @BrooklynNets #BrooklynNets #Nets #NetsLevel",
    "546": "@Lakers the Brooklyn Nets win the championship",
    "547": "@BleacherReport @peterdewey2 Maybe LeBron James and Bronny team up with The Brooklyn Nets or The New York Knicks the future only knows wins and Championships ,money talks .",
    "548": "@BleacherReport @peterdewey2 Just imagine, LeBron ,Irving ,Durand ,   Harden, all playing for The Brooklyn Nets those are winning games ,maybe ?",
    "549": "Ball Don’t Stop says the Brooklyn Nets Should go after Bradley Beal or Jaylen brown  in a three team deal instead of Ben Simmons #NetsWorld  Thoughts? https://t.co/BdOXCzC826",
    "550": "@BleacherReport @peterdewey2 I’m not  surprise of LeBron James may play  for The Brooklyn Nets or The New York Knicks",
    "551": "The Brooklyn Nets reportedly view Seth Curry as the ‘perfect shooter’ to play alongside Kevin Durant and Kyrie Irving, sources tell me and @TheAthletic",
    "552": "Stephen A Smith needs to stop talking about Kyrie Irving &amp; the Brooklyn Nets.",
    "553": "@tjbey2000 @RealCodyMallory @BrooklynNets @KyrieIrving Absent a statement that speaks directly to prohibiting that option all I've heard is the speculation of reporters",
    "554": "We not worried about a D@mn thing @BrooklynNets https://t.co/fSvAWVaspI",
    "555": "@ImPaoloMendoza @CignalTV @TV5manila @MiamiHEAT @BrooklynNets Not yet",
    "556": "@jamesbondty @CignalTV @TV5manila @MiamiHEAT @BrooklynNets Are the last NBA games before the ALL-STAR BREAK? if it does, then waiting for Coaching for TEAM DURANT tomorrow between the BULLS vs. SIXERS, crucial for ERIK SPOELSTRA and BILLY DONOVAN for this position.",
    "557": "@ImPaoloMendoza Next Sunday Lakers vs GSW on @CignalTV. @TV5manila will air @MiamiHEAT vs @BrooklynNets.",
    "558": "The Brooklyn Nets are now on a 7 game losing streak.",
    "559": "The @Lakers and @BrooklynNets need to trade @russwest44 for @KyrieIrving",
    "560": "Rookie Cam Thomas giving Nets a big boost off the bench (New York Post)\n\nCam Thomas outscored the Nets' entire starting five on Friday night at Utah, which is wonder...\n\nAdd your highlights:\nhttps://t.co/jvIRXY0DC3\n #Brooklyn_Nets",
    "561": "i'll never forgive brooklyn nets management for trading away their core for just James Harden 😡",
    "562": "@BrooklynNets Who tf calls him “kai”",
    "563": "@Arun30384 @JayLGK @Rob24282840 @BrooklynNets Nigga you below me shut up🤡 we beat you with g league players",
    "564": "Rookie Cam Thomas giving Nets a big boost off the bench #Brooklyn #Nets #NBA https://t.co/8GN6YGi9m7",
    "565": "@BrooklynNets @KDTrey5 @SteveNash Make the trade happen",
    "566": "@Arun30384 @JayLGK @Rob24282840 @BrooklynNets Just like you don’t understand knowing what it’s like to be a top seed AT ALL this season 🤡",
    "567": "@RespeckMySixers Future Brooklyn net",
    "568": "@Arun30384 @JayLGK @Rob24282840 @BrooklynNets Nigga you caught you a raptors fan you REALLY can’t talk to me😂",
    "569": "@ta__mka How y’all doin @BrooklynNets",
    "570": "@NukeSZN @Horty87 @exhaustedBS @flybuc76OU @DeanScorpion_ I want to agree to disagree bcuz you can't comprehend what is happening or have an intellectual debate. Bottom line is harden can be a free agent and join another team. If the nets are confident he won't leave then sure. Ur point makes sense. But he's unhappy in Brooklyn",
    "571": "Nft Highlight #NicolasClaxton #nbatopshot #Brooklynnets #shorts https://t.co/eDPJk3izxu via @YouTube",
    "572": "@SirEMBIID @BrooklynNets y’all seein this⁉️",
    "573": "What’s at stake for Kevin Durant if the #Brooklyn Nets don’t win a championship? | #NBA Countdown - https://t.co/NQRElP8baE - #ESPN #JamesHarden",
    "574": "@erikslaterNR Horrible take. Hating playing with Kyrie and not liking Nash is a great reason to find greener pastures when you’re approaching your opt-out. Players get to decide their career path and his isn’t with the @BrooklynNets.",
    "575": "Final hours❗️ If you are in the #NYC area or willing to travel, we are giving away some awesome seats the #BrooklynNets game❗️ https://t.co/U5rvGvEHS1",
    "576": "NBA Basketball Game Betting Picks Simulator: 2/6/2022 3:30 PM ET - Brooklyn Nets vs. Denver Nuggets - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/qpxqDwZffw #nba #sportsbetting #freepicks #cappertek",
    "577": "@exhaustedBS @NukeSZN @Horty87 @flybuc76OU @DeanScorpion_ Exactly people aren't comprehending the shitty situation Brooklyn is in. Everyone keeps saying oh we can do a sign and trade. Well harden has to agree to that. Swapping simmons and harden is the nets best option Or risk losing him for nothing. Well even throw in Danny Green",
    "578": "I LOVE the #Knicks &amp; #BrooklynNets but man do they disappoint me EVERY chance they get. Last good thing to happen to #Knicks was #PatrickEwing, now #Nets looks like #PaulPierce &amp; #KevinGarnett years all over again, so close but still lose over &amp; over $$$ doesn't buy championships",
    "579": "Faites le trade ! @BrooklynNets - @sixers https://t.co/mtDgxW92ut",
    "580": "sounds like things are falling apart in brooklyn it’s time for the nets to rebuild starting with a goran dragic for kevin durant trade",
    "581": "Kevin Durant wants James Harden to stay with Nets? #Brooklyn #Nets #NBA https://t.co/Rvkceqfuml",
    "582": "James Harden has told Nets management he wants to stay in Brooklyn: report https://t.co/Wu8tc5HLrJ #sports #feedly",
    "583": "See I can’t even enjoy this collapse cause you’re just as ass right now, @BrooklynNets",
    "584": "I only believe what Woj says when it comes to “Sources”. Nets fans about to look dumb ass hell slandering Harden like he really quit on Brooklyn.",
    "585": "@thejuiceisgood The @HoustonRockets missed 47 one time against the @BrooklynNets in ‘19",
    "586": "Hoje tem Brooklyn Nets!!\nVs Denver Nuggets\nBall Arena\n17:30",
    "587": "@BrooklynNets  you need Ayton. Who can pick and roll, Alley oop with Harden like he did in Rockets so it will give more flexibility for harden on the offense end. Also a Champion team wins by defense. You need a tall swift strong guy  under rim. It is not cost effective defend",
    "588": "Brooklyn Nets,… is it really worth it, you know ain’t No Mike!",
    "589": "I love the Brooklyn Nets but New York is forever a L state for ever having those dictator ass mandates",
    "590": "Here are some \"Sports Takes Sure To Be Wrong (Although We Know The Majority Of These Will Be Right). @BrooklynNets @MiamiDolphins @Chiefs @BuffaloBills https://t.co/rvBLGyBNG6",
    "591": "Woj said a week ago the Nets wouldn’t listen to James Harden trades, it’s all Brooklyn trying to get everything out of Philly, well as much as they can",
    "592": "@joetsai1999 &amp; Sean Marks Let's just get this out the Kyrie Irving will never get vaccinated, so when season's over were need to look for another PG? My suggestions are Is Patrick Beverly for 2 years, Goran Dragic for 2 years, Or maybe you guys have someone in mind? #BrooklynNets",
    "593": "@elr3yd3rd @MMS0272 @EddieBNYC @BrooklynNets He’ll be out. If he plays, his effort/body language will be terrible.",
    "594": "@LegionHoops @BrooklynNets Kevin Durant is the same person who told Russell Westbrook that he wanted remain OKC Thunder only to turn-around and sign with Steph Curry Golden State Warriors\n\nIs Harden playing KD the way KD play Westbrook &amp; Harden sign 76ers - I'm just saying\n\n#BrooklynNets #Nets #NetsWorld",
    "595": "Jesus Christ bro @spidadmitchell &amp; whole @utahjazz team stunted on @BrooklynNets so hard last night bro goddamn they should've just surrendered🏳️, if that's even a thing😅 lol but what better way than to defend home than like that🗣️🤌🏽",
    "596": "A depiction of James Harden reassuring the Nets he wants to be in Brooklyn instead of Philadelphia… https://t.co/BMjCRnX7bH",
    "597": "The Brooklyn Nets Have Lost 7 Consecutive Games. No NBA Team Has Won A Championship After Suffering Such A Losing Streak. https://t.co/bf10meT0O1",
    "598": "Cuts the @BrooklynNets lead to *checks notes*\n\n17 https://t.co/9gViFG49Fm",
    "599": "@MMS0272 @elr3yd3rd @LaDeric @BrooklynNets I have my own problems 😂🤣 #Knicks",
    "600": "@elr3yd3rd @EddieBNYC @LaDeric @BrooklynNets Yeah, that’s the public line but Harden’s body language says differently and if he doesn’t play against Denver tomorrow, it’s more of a sign that he wants out in my opinion because he should be able to play tomorrow",
    "601": "The Brooklyn Nets Have Lost 7 Consecutive Games. No NBA Team Has Won A Championship After Suffering Such A Losing Streak. https://t.co/uiBDcPmUs0",
    "602": "@StephenCurrysB2 @Lakers @sixers @BrooklynNets @trailblazers @JHarden13 @Dame_Lillard @russwest44 @24_camthomas @nunnbetter_ @tobias31 @JoeHarris4 blazers are giving away all of their good assets left for nothing ur delusional",
    "603": "@JayLGK @Arun30384 @Rob24282840 @BrooklynNets This your man BAHHAHAH https://t.co/7CIx2WSGay",
    "604": "@JayLGK @Arun30384 @Rob24282840 @BrooklynNets Bro you literally have Westbrook 😂 when we play we PLAY no one laughs at us while you guys have a walking gag reel melo is y’all last hope stop it",
    "605": "@Tony994445271 @Arun30384 @Rob24282840 @BrooklynNets At the end of the day the nets will always have zero rings and their big 3 will go down as the most embarrassing failure in sports history. And that’s all that matters🤝🤝\n\nHave a good day sir\n\nBAHAHAHAHAHAHAA LMAOOOOOO",
    "606": "@JayLGK @Arun30384 @Rob24282840 @BrooklynNets Lakers are an embarrassment bro NO ONE and I mean NO ONE is worst than them when it comes to super team story’s lie if you want",
    "607": "@wraith_W13 @RealCodyMallory What makes you honestly think James Harden is happy and wants to stay in Brooklyn??? He's testing FA in the summer and it's very unlikely he's gonna stay. Only way he stays is if the Nets win the title. Where there's smoke, there's fire.",
    "608": "@Tony994445271 @Arun30384 @Rob24282840 @BrooklynNets At the end of the day the nets will always have zero rings and their big 3 will go down as the most embarrassing failure in sports history. And that’s all that matters🤝🤝",
    "609": "@JayLGK @Arun30384 @Rob24282840 @BrooklynNets Lebron will be remembered for making a failed super team the nets are a super team when Heathly time just hasn’t been good to them there’s a HUGE difference between not being able to play together and playing and being ass",
    "610": "i can’t wait til tomorrow @BrooklynNets breaking this damn losing streak &amp; starting an even better winning streak #NetsWorld",
    "611": "@Tony994445271 @Arun30384 @Rob24282840 @BrooklynNets Lebron has more rings in the last 5 years than the nets have in their entire 55 year history. I promise you nobody is worried ab his downfall😂.\n\nlike I said KD, Harden, and Kyrie will forever go down as the most embarrassing flop in sports history and it won’t even be close🤣🤣",
    "612": "@JayLGK @Arun30384 @Rob24282840 @BrooklynNets Nigga I first got into with you on a nets vs jazz post and you a lakers fan😂 I don’t live for this shit like you just looking to hate watch your team play bro",
    "613": "Win an game please!!!! @BrooklynNets https://t.co/bf2SZ7pkp4",
    "614": "@sixers fans, who would you send to @BrooklynNets for @JHarden13? \n\n@RTRSPodcast",
    "615": "Woj: Kevin Durant Wants James Harden to Remain with Nets amid 76ers... (Bleacher Report)\n\nBrooklyn Nets star Kevin Durant reportedly wants James Harden to remain with the franchise a...\n\nAdd your highlights:\nhttps://t.co/C3IKt6ekz1\n #Brooklyn_Nets",
    "616": "Yahoo! Sports:  James Harden has told Nets management he wants to stay in Brooklyn: report https://t.co/zNOJuaTWtp",
    "617": "@Arun30384 @JayLGK @Rob24282840 @BrooklynNets Ight see you",
    "618": "@JayLGK @Arun30384 @Rob24282840 @BrooklynNets Not bigger then Lebrons downfall I’ll tell you that.",
    "619": "@Arun30384 @Tony994445271 @Rob24282840 @BrooklynNets He’s been arguing on twitter for the last 22 hours that’s how you KNOW his feelings are hurt🤣",
    "620": "@Tony994445271 @Arun30384 @Rob24282840 @BrooklynNets Too bad y’all will never be healthy💀\n\nKD, harden, and Kyrie will forever go down as the biggest flop in sports history😂😂😂😂hilariously embarrassing",
    "621": "Kevin Durant and the Brooklyn Nets want James Harden to remain with the Nets. #Nets https://t.co/Hx17Gy5pWn",
    "622": "@JayLGK @Arun30384 @Rob24282840 @BrooklynNets Fully Heathly we winning that’s all I gotta say I’m done I’ll see y’all in the finals. Oh wait y’all will barley be in the play ins foh",
    "623": "@JayLGK @Arun30384 @Rob24282840 @BrooklynNets You wanna talk about the gutter try even in our biggest slump of TWO seasons we still only 6th seed and fully Heathly y’all 9th wtf I gotta prove to YOU 😂",
    "624": "@Tony994445271 @Arun30384 @Rob24282840 @BrooklynNets I promise you Kevin Durant, James Harden, and Kyrie not winning a ring is the biggest flop in nba history and it’s not even close bro💀\n\nBut like I said keep talking ab the lakers if it truly makes you feel better. You just know I’m right🤣🤣so keep going",
    "625": "@JayLGK @Arun30384 @Rob24282840 @BrooklynNets With just ONE of our big three yes because anyone would look and say “shit with a full team that would have been it” your talking shit when your team is the biggest flop in the nba ig you just trying to feel better who knows",
    "626": "🇺🇲 NBA - 13/01 🗓 \n\nChicago Bulls 112-138 Brooklyn Nets",
    "627": "@Tony994445271 @Arun30384 @Rob24282840 @BrooklynNets You are celebrating losing the warriors by 4…understand that you are literally celebrating ALMOST beating a team💀that’s how i know for a fact you guys are in the gutter😂",
    "628": "Brooklyn Nets ‘Open’ To Trade James Harden For Ben Simmons https://t.co/YSo1T4ipQF https://t.co/QsX4xUagFP",
    "629": "@wraith_W13 @RealCodyMallory Have you read the reports??? Harden is unhappy in Brooklyn and clearly wants out. Harden at this point in his career seems to care more about winning. The Nets messed up with the trade and the 76ers have ALL the leverage.",
    "630": "@JayLGK @Arun30384 @Rob24282840 @BrooklynNets I ain’t switching shit I’ve Said the Same Thing Heathly we are unbeatable if we dogged the Bulls when people were saying “we can’t beat good teams” wtf do you think would have happened if Heathly and we seen the warriors who we only out by 4 with just one smarten up please",
    "631": "@JayLGK @Arun30384 @Rob24282840 @BrooklynNets This is what wtf is a lakers fan talking about who run NY for stay in your line bro especially if you a lakers fan🤮 https://t.co/VjlmuexsVC",
    "632": "@Tony994445271 @Arun30384 @Rob24282840 @BrooklynNets You are absolutely right our big 3 is ass. But this is a conversation about the nets. You are switching this conversation to the lakers as copium bc you can’t handle what we are saying bc you know it is true😂\n\nNets can’t stay healthy and can’t beat good teams. Simple.",
    "633": "@JayLGK @Arun30384 @Rob24282840 @BrooklynNets WHOA no body is scared but we busted your ass in YOUR home with ONE of our big three🤨. Your big three can’t win shit then they together we’ve gone on win steaks with just two you really can’t sit with me lil bro",
    "634": "10\nBrooklyn Nets https://t.co/EGoCKM5jeN",
    "635": "@TheNBACentral @KyleNeubeck Brooklyn Nets",
    "636": "@SamQuinnCBS And @JHarden13 wants to quit now. #soft @BrooklynNets",
    "637": "@Tony994445271 @Arun30384 @Rob24282840 @BrooklynNets I’m a lakers fan. I don’t know where you even got the idea that I’m a Knicks fan. And this is a conversation about the nets. Don’t get mad bc we are talking ab the nets. You guys are never healthy and can’t beat good teams. Nobody is scared of you guys. It’s that simple.",
    "638": "@JayLGK @Arun30384 @Rob24282840 @BrooklynNets Unhealthy none last year we swept  teams but I ain’t gon go into last year live I’ve said with idiot one we’ve been unhealthy so we ain’t get to show our worth. And aren’t you that Knicks fan I shut up yesterday Nigga get past the first round and watch your team get dogged by LB",
    "639": "Report: James Harden has told Nets management that he wants to stay in Brooklyn, and Kevin Durant also reportedly wants Harden to stick around https://t.co/22goUz5rbf https://t.co/Zu1OkA2gzW",
    "640": "@Tony994445271 @Arun30384 @Rob24282840 @BrooklynNets “We take down top teams all the time” is what you said right. Well shit let’s see. Want a updated list? Y’all are 3-12 Vs top 8 teams this year.\n\nSo what top teams do you guys take down all the time like you claim https://t.co/dzpWVdNvLP",
    "641": "same thing happened in Brooklyn when i went to Heat vs Nets a few months ago hahaha https://t.co/ejxgjKdrCj",
    "642": "James Harden: The Endlessly Unhappy NBA Superstar #NetsWorld #Brooklyn #Nets #Harden #JamesHarden \nhttps://t.co/lKqIJMA3am via @spinnablesports",
    "643": "@Tony994445271 @Arun30384 @Rob24282840 @BrooklynNets “We take down top teams all the time”\nOnly thing that changed ab this list is that one win agains the Bulls. But yeah y’all take down top teams all the time😂. https://t.co/zFf9JsCKgC",
    "644": "@BrooklynNets @joetsai1999 @KDTrey5 \n\nDO NOT fall for any of James' bs. Get rid of him ASAP.\n\nHis mind clearly isn't where it should be. He wants to win yet leaks rumors on him not being happy &amp; ruining the current state of our team because of unfortunate situations. LOL",
    "645": "@elr3yd3rd @EddieBNYC @MMS0272 @BrooklynNets Or… Saying all the right things in the media",
    "646": "@JayLGK @Arun30384 @Rob24282840 @BrooklynNets No body worried until we show up and bust they ass like the Celtics or Chicago. We take down top teams all the time and y’all mfs stay quiet as soon as we slow down even a little then y’all pop up im trynna see this Energy on streaks like just before with KD was injured",
    "647": "@Tony994445271 @Arun30384 @Rob24282840 @BrooklynNets Key word healthy. The problem is y’all are never healthy. That’s why nobody in the league is worried.",
    "648": "@Arun30384 @Rob24282840 @JayLGK @BrooklynNets HEATHLY none of us is worried bro idgaf about who you can’t stand I said it I’ll say it again NO ONE can touch us healthy we don’t need shit this deadline but a defender and depth for situations like rn and we’ll be unstoppable period https://t.co/BN24El7FiF",
    "649": "What if I told you that the @BrooklynNets didn’t have any of these problems until the team was sold ……",
    "650": "The Brooklyn Nets Are Reportedly Open To Trading This Superstar https://t.co/InNCXkghbe via @@BenStinar",
    "651": "NBA Rumors: Why is James Harden Frustrated With Brooklyn Nets? https://t.co/W2do7wPOLa via @@JGrasso_",
    "652": "@BrooklynNets tell me again the leverage James Harden has in a trade now or in the Summer. Sean Marks needs to get everything he wants. @brooklynsbeat https://t.co/1eVYLVU2EP",
    "653": "Then I will wish @BrooklynNets &amp; @NYRangers win the ship but until Portugal qualifies I cant think straight",
    "654": "@Arun30384 @Rob24282840 @JayLGK @BrooklynNets If you can’t stand them cool but don’t talk about it with a nets fan 😂 you act like you gon bully me into saying we suck or something we one of the best teams in the nba Heathly you don’t see me on lakers shit talking stop being a hater and do something productive",
    "655": "@uncommoncurtis @dmay706 remember the wording of shams article wasn’t that harden wants to be traded, it was the sixers want to pursue a deal and Brooklyn would listen. Sounds like a team that knows harden leaves at the end of the season. Nets Want something for him rather than nothing",
    "656": "RT BoobaDjoudi: get account canva PRO  free 👉https://t.co/mZQPL3ducW\n\n#Kinzinger #Ronaldoday   #Harden #freecodefridaycontest #Middlesbrou… #BrooklynNets",
    "657": "Kevin Durant wants James Harden to remain with Nets, via ESPN.\n\nHarden has also reiterated to KD and Brooklyn that he wants to stay. https://t.co/WVTbOemYZx",
    "658": "@Arun30384 @Rob24282840 @JayLGK @BrooklynNets KD has been playing MVP caliber basketball no one is concerned that’s your want for us to fail. Kai is too if he almost beat the Warriors by himself and harden is harden like I’ve BEEN saying depth is our only issue and why we can’t carry while he’s gone we have that and boom.",
    "659": "What’s at stake for Kevin Durant if the Brooklyn Nets don’t win a championship? | NBA Countdown https://t.co/wSpbTvm6ti",
    "660": "@miketoothman @N0t_dumb @BrooklynNets Yeah most definitely",
    "661": "What’s at stake for Kevin Durant if the Brooklyn Nets don’t win a championship? | NBA Countdown\n https://t.co/uSqhXbmDbz",
    "662": "@JHarden13 @KyrieIrving @KDTrey5 Karma a B!tch. The @BrooklynNets SUCK @NBA @NBATV #NBA #NBA75",
    "663": "Kyrie Irving hasn't given Nets a lift since his return (New York Post)\n\nThe season has devolved rapidly for the Nets, whose crash since Kevin Durant left the lineup...\n\nAdd your highlights:\nhttps://t.co/cywh1Ayx7B\n #Brooklyn_Nets",
    "664": "Kevin Durant wants James Harden to remain with Nets, via ESPN.\n\nHarden has also reiterated to KD and Brooklyn that he wants to stay. https://t.co/x6AjNwUwnD",
    "665": "Brooklyn Nets Losing Streak Continues https://t.co/gxpO6U0Ypp",
    "666": "Durant Calls Stephen A. Smith's Comments on His Legacy If Nets Don't Win Championship 'Egregious,' Stephen Responds https://t.co/CnxKMnlB2X via @YahooEnt @Complex @espn @nbatoday @BrooklynNets  @warriors @TheAthletic @TheAthleticNYC @TheAthleticSF @TheAthleticNBA",
    "667": "@EddieBNYC @LaDeric @MMS0272 @BrooklynNets Not going anywhere https://t.co/puJl0dxEwh",
    "668": "A healthy @Lakers team and a healthy @BrooklynNets team are unstoppable and all the other @NBA teams know it.😂",
    "669": "Woj report  Brooklyn Nets Kevin Durant wanting James Harden to Stay with the Nets https://t.co/MgH7FvOOXt",
    "670": "Are the Brooklyn Nets still a championship contender? 🏆",
    "671": "I can’t think of a bigger finger in the eye to the NY Knicks organization than the ESPN pregame panel talking about the Brooklyn Nets in the lead up to their game.",
    "672": "On NBA Countdown, Woj said Kevin Durant wants James Harden to stay in Brooklyn. Also added that Durant wants everyone in Brooklyn as committed to winning a title as he is.\n\nWoj said Harden continues to tell Durant and Nets management that he wants to be in Brooklyn.",
    "673": "@Arun30384 @Rob24282840 @JayLGK @BrooklynNets Your issue is because you want us to fail so bad your acting like it’s the last month before the playoffs like it’s not a whole all star break and three months of regular seasons games left more TIME for players to heal and more PLAYING to get it right for the post season but ok",
    "674": "On NBA Countdown, Woj said Kevin Durant wants James Harden to stay in Brooklyn. Also added that Durant wants everyone in Brooklyn as committed to winning a title as he is.\n\nWoj said Harden continues to tell Durant and Nets management that he wants to be in Brooklyn.",
    "675": "Simmons for Harden is more than enough for the Nets. \n\n1) Harden is not Harden of 2017\n2) Harden is a FA and likely won't resign in Brooklyn because of the dumpster fire they caused\n\nNets take what you can get and move on.",
    "676": "@Arun30384 @Rob24282840 @JayLGK @BrooklynNets KD and kai WILL be there and say this point I’m banking on them more than harden and either. Harden is harden and as a hater your speaking for joe it’s not confirmed he’s out for the season and I’m sure they wouldn’t tease that that’d be straight.",
    "677": "Brooklyn Nets Kevin Durant”s Mom calls out Stephen A smith https://t.co/6OWnPpv1sJ",
    "678": "@BrooklynNets Nash and Boss Cai look like a joke, and the whole Nets look like a joke.",
    "679": "It's time @Sixers @BrooklynNets @Pacers https://t.co/MQD8ar5zV2",
    "680": "The latest news and videos about #BrooklynNets https://t.co/zeNMXgH1iR #NBA https://t.co/F93cCDlsLd",
    "681": "Kyrie Irving hasn’t given Nets a lift since his return #Brooklyn #Nets #NBA https://t.co/W1xG0lcLke",
    "682": "So the @BrooklynNets wanna trade @JHarden13 (Lexus)\n\nFor @BenSimmons25 (Ford Taurus)😂\n\nTrade @SteveNash😳",
    "683": "@Pickswise Brooklyn Nets.",
    "684": "Gilbert Arenas says the Brooklyn Nets shouldn’t trade James Harden for Ben Simmons.  https://t.co/LD85yEMECE",
    "685": "@joetsai1999 hear me out bring in Mark Jackson. @stephenasmith @MarkJackson13 @BrooklynNets #brooklynnets",
    "686": "@shan0506 @RealCodyMallory @BrooklynNets @KyrieIrving Yea  I’m not saying I agree, I just saw the nba said they won’t allow it",
    "687": "The current state of the Brooklyn Nets @TheJoeFerro https://t.co/QGNayZxvbK https://t.co/imjLGuRVfH",
    "688": "@tjbey2000 @RealCodyMallory @BrooklynNets We'll see...I get it, the NBA negotiated for exemptions for visiting players BUT let's be clear, that affects the COMPETITIVE BALANCE of the league...it is sad it appears the union is not advocating on the behalf of .@KyrieIrving but he deserves the same exemption afforded others",
    "689": "@agresh01 @TheAthletic @ShamsCharania @BrooklynNets @stephenasmith @KendrickPerkins @mspears96 Your nuts 76ers in driver seat here",
    "690": "Brooklyn Nets Enlist Benny The Butcher &amp; Funkmaster Flex For Black History Month Performances https://t.co/RCsEOq8jiS",
    "691": "ATTN BROOKLYN RESIDENTS:\n\nStay indoors and do your stretches.\n\nA hamstring tightness epidemic is ravaging the borough.\n\n#Nets #NetsWorld https://t.co/tp1UNKVKQk",
    "692": "@KDTreeey5 @TheNBACentral @KyleNeubeck Dudes speaking like he’s the nets gm, sit yo ass down you a nobody Brooklyn fan, lol you have no say in this deal",
    "693": "@tjbey2000 @RealCodyMallory @BrooklynNets They are already allowing unvaccinated players to enter New York arenas to play in New York",
    "694": "@tjbey2000 @RealCodyMallory @BrooklynNets You think team buses don't speed if they are going to be late to an arena or because they may do so with a police escort that means the speeding is allowed. Kinda like allowing the visiting unvaccinated players to play. Paying the fine is compliance with the law.",
    "695": "The Brooklyn Nets are expected to pursue both Ben Simmons and Tobias Harris ahead of the NBA trade deadline and the Philadelphia 76ers open to discussing a deal, per @BallsackSports @TheAthletic.",
    "696": "KD and the Brooklyn nets fans got fooled by Harden and his toxic behavior. Hate to see it",
    "697": "@TheSteinLine Nets geting Harden ready for a trade?\n\n@BrooklynNets was my 2nd team in the east, thats before cancer kyrie came. Trade the cancer guy instead!",
    "698": "How dumb would the Nets be to hand Harden over to an East rival for a player who can't score and hasn't played all year? What is the motivation for Brooklyn? I don't get it. https://t.co/H7AiQ8gJOL",
    "699": "@Jo_GotGame @BrooklynNets @shoptier At this point they doing bad too so ima go head and cop up lmao",
    "700": "🏀 Brooklyn Nets (@BrooklynNets) #NetsWorld \n🆚 L @ Utah Jazz #TakeNote #BKNvsUTA\n⏭️ Denver Nuggets #MileHighBasketball #BKNvsDEN\n✈️ N650DL | DAL8920 | B752\n🛫 SLC - 3:21 pm MT\n🛬 DEN - 4:24 pm MT\n📡 Tracking: https://t.co/CZcN17V5td https://t.co/znT7mHPJI6",
    "701": "@JHarden13 let the @BrooklynNets know Houston will take you back, but we keeping the draft picks.",
    "702": "Kyrie Irving - Brooklyn Nets need to face reality but not push 'panic button' after 7-game skid\nhttps://t.co/Es1190pTc8\nhttps://t.co/Es1190pTc8",
    "703": "@IamKDiddy so is Brooklyn Nets going do trade or what? Why do I think Kings are going be side chick 😂 I mean third team in this deal.",
    "704": "Where are the Brooklyn Nets fans? https://t.co/DWjOlhJfbO",
    "705": "@shan0506 @RealCodyMallory @BrooklynNets The nba won’t allow it",
    "706": "@PajtimIbraimi1 @BlondeBrunson_ @BrooklynNets Dont even make sense.  You mean, WON?",
    "707": "The Brooklyn Nets are the favourites to win the 2022 season, can they go all the way?\n\nBrooklyn Nets $3.50\nGolden State Warriors $5.75\nPhoenix Suns $7.50\nMilwaukee Bucks $8.00\n\nBet now: https://t.co/m5tP9u1Oxj",
    "708": "@EddieBNYC @LaDeric @MMS0272 @BrooklynNets But that’s how it is with every team that has a star player",
    "709": "@elr3yd3rd @LaDeric @MMS0272 @BrooklynNets That’s my problem. And this is way the situation is what it is",
    "710": "Brooklyn Nets potential starting 5 😂naw who made this tho Internet undefeated #NetsWorld https://t.co/i365RS8Iig",
    "711": "eita brooklyn nets 😶",
    "712": "The Brooklyn nets are imploding ? 👀",
    "713": "Nets have legit interest in Ben Simmons, and Harden seems to prefer to head somewhere else it seems.\n\nLittle bit of a mess in Brooklyn right now. They need KD back and my boy to play every game possible. https://t.co/2hVjUCJdhB",
    "714": "@braverpixel @elr3yd3rd @MMS0272 @BrooklynNets This is just another example of a player trying to construct a team. Look at the Lakers.",
    "715": "@EddieBNYC @LaDeric @MMS0272 @BrooklynNets They have to run it through him though. Get his opinion",
    "716": "Austin Rivers @AustinRivers25 is probable for Sun vs  the @BrooklynNets  due to right hip flexor tightness!\n\nRivers has struggled lately, as he's shot just 28.6 percent from the field for 4.0 P across the past 4 gms\n\n#CreamGetsTheMoney #nbaDFS\n\nhttps://t.co/LFLWJ6homZ https://t.co/BkR0H8xa6w",
    "717": "optic is the lakers of the cdl and faze is the brooklyn nets of the cdl",
    "718": "@Yankeelibrarian @BrooklynNets I make silly decisions 🙃",
    "719": "@elr3yd3rd @LaDeric @MMS0272 @BrooklynNets You got to the root of the problem @elr3yd3rd A player can’t be the GM",
    "720": "Why James Harden is suddenly so frustrated with Nets #Brooklyn #Nets #NBA https://t.co/Ccn8AkhDBp",
    "721": "@elr3yd3rd @EddieBNYC @MMS0272 @BrooklynNets It’s over. If KD wouldn’t allow it, the Nets wouldn’t be taking Philly’s calls right now. Harden isn’t who he used to be. Let him go. Addition by subtraction.",
    "722": "@braverpixel @elr3yd3rd @MMS0272 @BrooklynNets Facts Boogie. Rock and a hard place",
    "723": "@LaDeric @EddieBNYC @MMS0272 @BrooklynNets KD won’t allow it",
    "724": "The Brooklyn Nets Have Lost 7 Consecutive Games. No NBA Team Has Won A Championship After Suffering Such A Losing Streak. https://t.co/dFfv5Tfle9 https://t.co/jt9jhvxsGa",
    "725": "James Harden Is Reportedly Frustrated With The Brooklyn Nets: \"He Came To Brooklyn Expecting To Be Part Of A Three-Headed Monster, Yet Has Played A Similar Role To What Was Required Of Him In Houston.\" https://t.co/DFGVOU8Abb https://t.co/XGd0VDamo2",
    "726": "@EddieBNYC @MMS0272 @elr3yd3rd @BrooklynNets Harden clearly wants out. The Nets wouldn’t even be entertaining the thought of trading him if that weren’t true. The big 3 is  over, but you get better by adding Simmons + another scorer, with Simmons playing a Draymond type role. Better on defense, ball movement, less turnovers",
    "727": "@elr3yd3rd @EddieBNYC @MMS0272 @BrooklynNets Odd how both fan bases feel they have leverage here - neither does.",
    "728": "@LaDeric @MMS0272 @elr3yd3rd @BrooklynNets If they trade Harden, the #Nets will be set back years. The Big 3 experiment is over.",
    "729": "@thoughtsnbball @robinlundberg The point is that he don’t want to be in Brooklyn. So the Nets have to make moves to get their future back. We still have KD, we have to build around him. Not sure what is going to happen with Kyrie, if he doesn’t eventually change his stance this season, then he need to go also",
    "730": "@kingdj_5297 @BrooklynNets We need to exchange those ****** jerseys, please let us @BrooklynNets",
    "731": "@kingdj_5297 @BrooklynNets Same.",
    "732": "@sigalit31 @BrooklynNets @NetsOnYES @YESNetwork @sarahkustok @Grady @floodgater @bklyndafna @bart_fraser My disappointment actually began long before last night's game...\nI tried too keep my positive passion for the Nets up until the 2nd half of the Clippers game then my 1Fan spidey sence kicked in",
    "733": "@LaDeric @MMS0272 @elr3yd3rd @BrooklynNets Nets were a toe away. Harden, Kyrie, and KD can do it, if they ALL play every game together.",
    "734": "@BrooklynNets can I exchange em for Sharpe and Mills please🙏🏾😭😭 https://t.co/bw18hqGQuy",
    "735": "Hey @BrooklynNets, maybe just trade them all at this point and get a whole bunch of draft picks back.",
    "736": "@EddieBNYC @MMS0272 @elr3yd3rd @BrooklynNets He disrupts the flow offensively and is clearly beyond disgruntled. He Single-handedly blew the game against SAC with turnovers and piss poor effort. He’s folded every year in the playoffs, even at his peak. If they don’t move him now, the situation only grows more cancerous.",
    "737": "@braverpixel @elr3yd3rd @MMS0272 @BrooklynNets I don’t think Philly giving up Maxey. I wouldn’t. I saw it early. But hey, you never know. Philly might go all in with Harden. Simmons ain’t playing for Philly regardless",
    "738": "@LaDeric @MMS0272 @elr3yd3rd @BrooklynNets I disagree. If he can get on the court with both KD and Kyrie they have a chance at a chip. The problem is can they all get on the court consistently. No need to offer him any contact.",
    "739": "@braverpixel @EddieBNYC @MMS0272 @BrooklynNets So no deal",
    "740": "@TheSteinLine He dosn't want to play for the @BrooklynNets any more",
    "741": "@Arun30384 @Rob24282840 @JayLGK @BrooklynNets Did we have nearly the caliber of players that we have now🤔 no Brooooklyn is what we was chatting while we were beating the brakes off the bucks and whatever team you like I’m sure while we was Heathly and when we gonna be against stop playing with me little boy #NetsWorld",
    "742": "@EddieBNYC @elr3yd3rd @MMS0272 @BrooklynNets Outside of Embiid and Simmons, Maxey is the most valuable asset to Morey - no way BKN gets him and a pick along with Simmons.",
    "743": "@Richsports7 I'm a SA Spurs fan. Even though Nets are in my Brooklyn.",
    "744": "@MMS0272 @elr3yd3rd @EddieBNYC @BrooklynNets They should absolutely trade him. He’s lazy, a turnover machine, dribbles the shot clock out and gives minimal effort on defense. That won’t change. They’d be foolish to keep Harden and offer him the supermax. Get Simmons &amp; Tobias + picks and the Nets are in great shape.",
    "745": "“Did the Brooklyn Nets just give up on James Harden?”: NBA Insider reveals that the Nets are open to discussing a deal, possibly trading the Beard for Ben Simmons https://t.co/oyTvINV9yJ",
    "746": "@elr3yd3rd @MMS0272 @BrooklynNets If Brooklyn can get Maxey and Curry with Simmons and maybe a pick…I think do it",
    "747": "Harden (and entire organization) has every right to be super pissed off at Kyrie I sure would be. \n\nBut bro cmon don’t come in to camp like 30 pounds over weight. \n\n@BrooklynNets #NetsWorld @NBA",
    "748": "The Nets says James Harden (soft &amp; bad teammate) is questionable to play anymore for Brooklyn. https://t.co/wsMBT6s31I",
    "749": "BrooklynNETS really need to try and make that Orlando trade if nothing else [TERRENCE ROSS] (1)HARDEN (2)TERRENCE ROSS (3)KD(4)Aldridge(5)Claxton....SOLID....then trade for Gallinari or Eric Gordon or both...but TERRENCE ROSS would be a great piece added",
    "750": "@Nets1fan @BrooklynNets @NetsOnYES @YESNetwork @sarahkustok @Grady @floodgater @bklyndafna @bart_fraser 😲😯😮\nCan't say I blanton you after last night's game.",
    "751": "Trade him for Simmons and Seth fucking Curry @BrooklynNets https://t.co/DQjxFt7UcE",
    "752": "Benny The Butcher, Funkmaster Flex &amp; More To Honor Black History Month During Brooklyn Nets Home Games https://t.co/tmoZRCncAx https://t.co/kmx5wQGUw4 https://t.co/79QgSoTeOH",
    "753": "@elr3yd3rd @MMS0272 @BrooklynNets I say keep Harden and try and go for it this year (Part time Kyrie is a major problem) If Harden wants to go free agent ✌🏼",
    "754": "Ben Simmons &amp; A top-5 protected 2027 FRP saves you all of the luxury tax in the world @BrooklynNets https://t.co/rj1ZGuQxc7",
    "755": "The Brooklyn Nets are not interested in trading James Harden for only a disgruntled star in Ben Simmons, source tells me. https://t.co/a65KmTFhL1",
    "756": "@MMS0272 @EddieBNYC @BrooklynNets I’d give it 50/50 chance",
    "757": "@elr3yd3rd @EddieBNYC @BrooklynNets I am hopeful they could run it back next season with Kyrie, KD and Harden, assuming there will no longer be any Covid vaccine mandates in NYC by October of this year and assuming all 3 could finally play around 70 games together in a season.",
    "758": "@OMcconnor @BrooklynNets I’m just wishful thinking at this point 😭",
    "759": "The Chicago sky 🤝 the Brooklyn nets https://t.co/S6AGMlBA4l",
    "760": "Utah Jazz 125-102 Brooklyn Nets\nDallas Mavericks 107-98 Philadelphia 76ers \nPortland Trail Blazzers 93-96 Oklahoma City Thunder",
    "761": "I sell 2 tickets for the Brooklyn Nets vs. Toronto Raptors NBA game at Barclays Center in #NewYork on February 28th. Section 227, row 8. If somebody is interested, please tell me 🙏🏼 #NBA #BrooklynNets #TorontoRaptors #NetsWorld https://t.co/NKg7bTL93J",
    "762": "hey friends, don't forget that some of our #NFTs come with physical prizes too!\n\nFrom some generous friends like @BrooklynNets @LYDIAPANG @marketsocialguy and more.\n\nUse our easter egg key to find them in our NFT collection here: https://t.co/gIqD6NjZbS\n\n#NFTCommunity #SolanaNFTs https://t.co/lm4lacoK63",
    "763": "@MMS0272 @EddieBNYC @BrooklynNets They’re not gonna trade Harden",
    "764": "@EddieBNYC @elr3yd3rd @BrooklynNets Not a fan of the idea, but if they do trade Harden to Philly, they need to get back far more than Simmons.  Draft picks, Tobias Harris, Thybulle and Maxey or Curry or Green. Nothing less than that to make up for the great mistake the Harden trade was initially and has become. https://t.co/VyLYgpbngw",
    "765": "@jaytatum0 , time to come to the @BrooklynNets !! Celts might want something the Nets have…",
    "766": "Ben Simmons &amp; any mix of Maxey, Thybulle, Seth will be Brooklyn Nets\n\nBen Simmons &amp; any mix of Maxey, Thybulle, Seth will be Brooklyn Nets\n\nBen Simmons &amp; any mix of Maxey, Thybulle, Seth will be Brooklyn Nets\n\nBen Simmons &amp; any mix of Maxey, Thybulle, Seth will be Brooklyn Nets",
    "767": "Brooklyn Nets [AwayBench Rotation] while KDinjured&gt;(1)Mills(2)K.Irving(3)C.Thomas(4)P.Millsap(5)Aldridge[Home Bench]&gt;(1)Mills(2)C.Thomas(3)B.Brown(4)Millsap can shoot 3 at times he's pretty good from there..(5)Aldridge can shoot the 3 at times also",
    "768": "@JJHeavvy @A_A_Autographs @BrooklynNets @sixers No one is going to take on 90 million yearly salary.",
    "769": "@casualtakeking Funny if it was true.\nOnly way that would be true is if Russell Westbrook was playing for the Brooklyn Nets.",
    "770": "@raptorsIn6ixx @BrooklynNets So THIS is where we are now?😭😭😭",
    "771": "@NoTwiterName @BrooklynNets Idk if they letting them boys go! 😂😂😂",
    "772": "how about making history @BrooklynNets https://t.co/fLCmhwK5L5",
    "773": "@SteveNash @BrooklynNets so you fellas planning on starting this kid yet? https://t.co/Ti1Imx8XNg",
    "774": "I still love @BrooklynNets with my heart and sou…❤️🏀 https://t.co/xsFOvQrXDI",
    "775": "@BrooklynNets we still love you with all our heart and soul 🏀❤️ https://t.co/xsFOvQsvtg",
    "776": "@HardensBetta @BrooklynNets Harden to the lakers in the offseason",
    "777": "@TheRealest1968 @BrooklynNets @KDTrey5 @JHarden13 @KyrieIrving Harden play 4 games without kd stop talking",
    "778": "Which deal involving James Harden and Ben Simmons makes the most sense? #76ers #Nets @BrooklynNets @sixers",
    "779": "The @BrooklynNets are lost without @KDTrey5 and I can’t believe I’m saying that even with @JHarden13 and @KyrieIrving playing 🤦🏾‍♂️🤦🏾‍♂️🤦🏾‍♂️",
    "780": "James Harden &amp; the Brooklyn Nets was always a temporary union!\nThe fellas @LetsTalkHoopsTV, Domo &amp; I discuss…  #AboveTheRimPod \n👉🏽 https://t.co/9oRhpsG7tf\n🎥: https://t.co/FX8VMIghqv https://t.co/Rw0nlA6u6U",
    "781": "@TheNBACentral @KyleNeubeck @sixers Are attempting to trade the @BrooklynNets  a disgruntled employee aren’t they?? And @sixers disgruntled employee has been in this state longer right? @BrooklynNets need a true negotiate, you can hire me &amp; I’ll get her done! @Camille_UR71 🤷🏽‍♂️🧑🏽‍💻🗣👀🌟👏🏽",
    "782": "Hey, @MMS0272 @elr3yd3rd not busting balls at all, just want to know your thoughts as die hard @BrooklynNets fans, what do think about this Harden to Philly for Simmons talk? #Brooklyn #Nets #BKNets",
    "783": "BROOKLYNNETS[STARTERS](1)Harden (2)Bembry(3)K.Edwards(4)B.Griffin(5)Claxton&lt;Harden,Bembry,Blake &gt;main go to guys on this starting line up while KD injured,pick/roll Claxton/Blake all day,let Blake post low Block,pick and pop med range shot and3on some plays",
    "784": "RT BOSSportsGordo: Since Kyrie Irving stomped on Lucky:\n\n🔺 Sprains ankle in 2nd round.\n🔺 Bounced in second round.\n🔺 Nets turns him away du… #BrooklynNets",
    "785": "@BrooklynNetcast I Brooklyn Nets is wasting time having Kylie Irving on the team. Why hold onto to a player who has no interest in helping his team.",
    "786": "@Coco_Mch13 @NO_EXTENDO @PlayboiClaxton Nets fans no longer trust him, because he has always shown that he doesn’t want to be in Brooklyn",
    "787": "@ImanGoated @appis_this @JohnnyH004 @BrooklynNets No really it’s almost as if that series was the only series nets were heathy",
    "788": "@Marcee3 @jJayAyeGarcia @SeanG8319 @JClarkNBCS @NBCPhiladelphia @NBCSPhilly @Ike58Reese @Jacko2544 Brooklyn might need up with nothing cuz it is pretty obvious Harden has told them trade me cuz I am leaving. Harden has ALL he leverage and wants to play in Philly.Ben will be like Draymond Green with the Nets. Nets will be tough if Ben gets his head back and can handle fan base",
    "789": "@BrooklynNets jaden and Ben for harden going up https://t.co/20FZQpXqkk",
    "790": "Brooklyn Nets, 7 losing streak. 2-8 last ten games. Harden is supposed to be the star player to carry on...",
    "791": "@JLin7 It's not over yet. The Brooklyn Nets are a DISASTER right now and could use your presence. You should reach out to Joe Tsai, Sean Marks, and Kevin Durant about making a return to Brooklyn!!",
    "792": "@ImanGoated @appis_this @JohnnyH004 @BrooklynNets He beat the hospital Celtics congrats to him I guess",
    "793": "Brooklyn Nets;[STARTERS](1)HARDEN(2)K.EDWARDS (3)KD(4)ALDRIDGE(5)CLAXTON..[BENCH](1)Mills(2)K.IRVING(3)C.Thomas (4)P.Millsap(5)B.Griffin[3rdSTRING](1)J.Carter(2)D.Duke(3)BruceBrown(4)Bembry(5)Johnson or Sharp,Should be the player rotation when all present",
    "794": "@mhc_76 if the news is out that Harden wants out of Brooklyn the Nets don’t have a ton of leverage if he really wants to go to Philly and it’s clear they can’t re-sign him but I can see the Nets looking in on Beal or McCollum and seeing what the Sixers could include for them",
    "795": "I standby my claim of the @BrooklynNets would have been a more entertaining/stable franchise with\n\nDLo, Levert, Allen, Dudz, Chapo, Dinwiddie etc…\n#culturechangers #youngguns https://t.co/Duo7NCE3ty",
    "796": "How come every time the Brooklyn Nets play a good team the Point Guard outplays Kyrie Irving?\n\n#donovanmitchell \n#dariusgarland \n#tradekyrie\n#tradeharden",
    "797": "@NBAAllStar @NBA @BrooklynNets @JHarden13 Harden broke record for most missed three pointers 🤣",
    "798": "The @BrooklynNets are struggling because they will not allow Kyrie Irving to play home games unless vaccinated.",
    "799": "@ilikebiscuits_ @BrooklynNets Steph's constant adjustments to his own game for the sake of new teammates getting them comfortable with the system is the point.\nSteph could've gone full Monta Ellis but he's found ways to play alongside JP. LeBron &amp; KD will either push a trade or leave in dire situations.",
    "800": "Nevermind the fact the Brooklyn Nets were dysfunctional WITH him still (because they were only good when beating up on lottery teams) and dysfunctional without him because Harden and Kyrie are barely even able to play together lmao",
    "801": "@Coco_Mch13 @NO_EXTENDO @PlayboiClaxton Nets fans no longer trust him, because he has always shown that he doesn’t want to be in Brooklyn",
    "802": "Things are looking grim for the @BrooklynNets. https://t.co/lGKvgXMnPV",
    "803": "@A_3_0_2 @RayBill2 @ESPNNBA @BrooklynNets As much as I hate to say this. But, no team can stop the nets from winning in the east except for the bucks and the heat.",
    "804": "@TrillBroDude @BrooklynNets I’m getting ready to put springer on the maxey pedestal, when the trade goes through",
    "805": "Brooklyn Nets get your shit together &amp; James Harden shut yo trap &amp; just ball out!!!!\n-Love Christine",
    "806": "@BrooklynNets Guys what’s going on 7 lose straight",
    "807": "@Dagaustin2000 @brooklynsbeat Which is why I think this ultimately about Morey and Co catering to him in away that Brooklyn will not. I think he needs his ego stroked and the Nets are too laid back for that.",
    "808": "Just a brutal stretch for the Brooklyn Nets\n\n7-straight loses, and @ DEN, vs. BOS, @ WAS, @ MIA, vs. SAC, @ NYK, vs. WAS entering the all-star break https://t.co/D2LwswloUP",
    "809": "@ta__mka How y’all doing @BrooklynNets",
    "810": "@Kloebowin1 @JordanCoblin @BrooklynNets Y’all need Jesus to save that franchise😂",
    "811": "@ChurchBoy_32 @JordanCoblin @BrooklynNets Actually forget harden. Trade Steven Adams back to us",
    "812": "How the @BrooklynNets got beat down tonight with no answer at all. @SteveNash should be fired. Rrttt ppl",
    "813": "@ChurchBoy_32 @JordanCoblin @BrooklynNets We’ll treat him better this time around!!",
    "814": "@Kloebowin1 @JordanCoblin @BrooklynNets Y’all don’t deserve him after what y’all did to him in 2012 😒",
    "815": "Nets ain’t shit ion care what Spivey tombout 😂  -&gt; RT @_JTizzle_: KD went down, shit went bad in Brooklyn..",
    "816": "🏀 The @utahjazz outclassed the out-of-form @BrooklynNets, and Donovan Mitchell played out of this world, according to his teammate. #TakeNote \n#NBA https://t.co/dXz7JGiX76",
    "817": "It’s amazing the Brooklyn Nets destroyed a team of young, fun and capable NBA players for the pipe dream disaster that is their current “big 3”. #nets #NBA75",
    "818": "Harden is overrated and aging... Ben (despite his flaws) is still a defensive ace all star with loads of untapped potential... There's no reason to include anything with Ben to secure harden in fact @BrooklynNets need to sweeten the deal to get ben #bensimmons #jamesharden",
    "819": "@JamesHuntley27 i think the nets want a young guy too but the sixers don’t want to package them with Ben. i earnestly don’t think this trade gets it done for brooklyn though",
    "820": "@TheNBACentral @KyleNeubeck 🙃The Brooklyn Nets are not interested in giving up ‘James Harden’ for a disgruntled star in Ben Simmons.🙃",
    "821": "@magu_souto @TrillBroDude @BrooklynNets Exactly",
    "822": "@baxter4133 @TrillBroDude @BrooklynNets He's like Wilt",
    "823": "@DeathbyCeltics @BrooklynNets I don’t believe in small samples unless they fit my narrative",
    "824": "Big thanks to @MikeDeliversPod for joining the episode today. Think we both got a lot off our chests that will put things into perspective for a lot of Brooklyn #Nets fans. #Netsworld https://t.co/Gj1c5woQ86",
    "825": "@TrillBroDude @BrooklynNets Coming off a 1-10 performance",
    "826": "Paul George IS BACK PRACTICING For Los Angeles Clippers &amp; Could Make His Comeback Soon!\nhttps://t.co/636f5i0SWp\nLuka Doncic LeBron James Joel Embiid Lakers Warriors NBA Stephen Curry Klay Thompson Kawhi Leonard James Harden Kyrie Irving Brooklyn Nets Julius Randle Stephen A Smith",
    "827": "No team in NBA history has won the title while losing 7 games straight in a season.\n\nDo you still like the Brooklyn Nets as betting favorites at +310?\n\n#bettingtips #NetsWorld https://t.co/Xu2Y4Kxg0R",
    "828": "@TrillBroDude @BrooklynNets I don’t believe jaden Springer actually exists",
    "829": "@Anthonysmdoyle @BrooklynNets Correct",
    "830": "Two weeks ago, the Brooklyn Nets (29-16) was 1st in the Eastern Conference. My Toronto Raptors (22-21) were 7 games behind the Nets.\n\nThe Nets have been 0-7 since.\n\nThe Raptors have been 6-2 in that span and are now half a game behind the Nets😊 https://t.co/9mPSNUyoBm",
    "831": "@TrillBroDude @BrooklynNets We're like 2 days from you saying that your limit is Ben + a top 59 protected 2028 2nd.",
    "832": "@Orenbrooklyn @nykskip RJ is a future all-star. He's the prince of New York. As for Brooklyn the Nets are a disaster with Harden out the door.",
    "833": "He’s off the table too btw @BrooklynNets https://t.co/CyvV98kp5n",
    "834": "He’s a Brooklyn Net https://t.co/cDIkqvxWDv",
    "835": "the more I read about the Brooklyn Nets’ current situation, the more I have to laugh.\n\nthey were building a decent team, traded everyone I liked to speedrun a super team, and it’s gonna end after this season is over with no draft picks, one superstar out of three, and no titles.",
    "836": "@Jo_GotGame @BrooklynNets @shoptier Damn well I be unloyal for grabbing one of these ?lol",
    "837": "Please @BrooklynNets https://t.co/MyGDxBe0fU",
    "838": "@BrooklynNets Nets s fvcked up 😏",
    "839": "The Brooklyn Nets Have Lost 7 Consecutive Games. No NBA Team Has Won A Championship After Suffering Such A Losing… – NBA News https://t.co/YBWZ3JN4tO",
    "840": "The Brooklyn Nets Have Lost 7 Consecutive Games. No NBA Team Has Won A Championship After Suffering Such A Losing… – https://t.co/WIXslriGG0",
    "841": "#PressReleases Global Hero Foundation USA’s Gary Kong, NY Knicks, &amp; Brooklyn Nets Pla…:  Source: Global Hero Foundation USA’s Gary Kong, NY Knicks, &amp; Brooklyn Nets Pla… Discovered on: 2022-02-04 23:08:24 Taj Gibson, NY Knicks, James Johnson, Brooklyn… https://t.co/Vm0dKKNEJE https://t.co/mcZ1kxboD2",
    "842": "Skidding Nets seek answers entering matinee with Nuggets https://t.co/g4VfQ4pPRB #NBA #BrooklynNets #DenverNuggets",
    "843": "Brooklyn Nets Word Search: Amazing Word Search Games To Help You Relax, Forget Your Tiredness And Make Your Eyes Sharper.\nhttps://t.co/HLohTajTNo",
    "844": "Waiting for #BrooklynNets vs #UtahJazz…. #NetsWorld always!",
    "845": "James Harden waking up to play basketball for the Brooklyn Nets  https://t.co/p8MAHUZ0a6",
    "846": "@gordondamer @RealMichaelKay @DonLagreca @Hardestyespn @alanhahn if you are not listening to Gordon Damer, you are missing out his excellent analysis on the @nyknicks rumors, the state of affairs and he will also dive into the @JHarden13 situation with the @BrooklynNets. #knicks #Nets",
    "847": "@zKYLOx @iamtrav904 @WhoDatBron @kc_the1 @ShamsCharania @TheAthletic It's only about what the Nets choose to do, and the assets they get back for him, or if they just let him walk and take less money. And, I believe, it's been reported Brooklyn doesn't want to pay him the supermax anyways.",
    "848": "@BleacherReport Haha jokes on you Bleacher Report. There are no real Brooklyn Nets fans.",
    "849": "@BrooklynNets FIRE STEVE NASH…NOW!!! #firenash",
    "850": "The Brooklyn Nets’ form since the injury to KD has been abysmal for lack of a better word. How can a roster with James Harden, Kyrie Irving, Blake Griffin and co struggle so badly in the absence of its star player?",
    "851": "Skidding Nets seek answers entering matinee with Nuggets  #NBA\n #Nuggets #MileHighBasketball #BrooklynNets #Brookly https://t.co/INAz7aongF",
    "852": "@StephenCurrysB2 @Lakers @sixers @BrooklynNets @trailblazers @JHarden13 @Dame_Lillard @russwest44 @24_camthomas @nunnbetter_ @tobias31 @JoeHarris4 This is atrocious 😭😭",
    "853": "@JHarden13 you a bitch. Go to Philly and dick ride meek and them.. you think you a rapper anyway @BrooklynNets make that trade. “Offensive load” with 4pts in 37mins. Yea pack him up https://t.co/PnRjRef9sj",
    "854": "@TheNBACentral @sam_amick Otherwise, he's looking at the top 4 teams on each of the conference, or any team he deems legit contenders with the ideal team construct to try and push the envelope for a trade. #NBA #BrooklynNets",
    "855": "@DurgoatB @Yasuke1886 @BrooklynNets @CanonUSA Plus two 1st rd draft picks",
    "856": "The Brooklyn Nets are interested in a trade with James Harden The Houston Rockets would welcome back Harden could sounds like Harden could be going back to Houston stay turned on February 10th 2022",
    "857": "James Harden Is Reportedly Frustrated With The Brooklyn Nets: \"He Came To Brooklyn Expecting To Be Part Of A Three-Headed Monster, Yet Has Played A Similar Role To What Was Required Of Him In Houston.\" https://t.co/As5VjWPB9I https://t.co/tozjFEYxq4",
    "858": "@BrooklynNets @CanonUSA Harden for Simmons &amp; curry or Simmons and Tobias is good! No sure about how the contracts fit!",
    "859": "Would Brooklyn want Caris LeVert back? Curious if #Pacers could get involved w/ Nets and Sixers or if Nets would simply prefer Ben Simmons for Harden trade? https://t.co/zoZc2xb9vO"
}