{
    "0": "Yes yess yesssss I’m ready for another WIN 💙🧡  #NYKvsDAL @nyknicks #NewYorkForever",
    "1": "@KnicksMSGN @WaltFrazier @nyknicks Unmatched",
    "2": "🏀NEW YORK KNICKS VS DALLAS MAVERICKS LIVE🎙️️ PLAY BY PLAY &amp; 🍿WATCH-ALONG KNICK Follow Party #NYKvsDAL https://t.co/Ssh8FKTymF",
    "3": "@KnicksMSGN @IQ_GodSon @nyknicks Still has to come off the bench tho apparently",
    "4": "@ReavoWRLD @tyknickstape @nyknicks We beat the hapless kings, let’s slow it up a bit",
    "5": "@SBondyNYDN Lol. So you're suggesting that The New York Knicks are so much better than all the other NBA teams that they are the one and only team to escape defeat in Dallas? You're a funny dude.",
    "6": "@dmorey @BrooklynNets @JoelEmbiid •Most free throws made in a game\n•28 by Wilt Chamberlain, Philadelphia Warriors (vs. New York Knicks) on March 2, 1962 (28/32)[4][30]",
    "7": "The @NBATV game on Saturday morning between the @nyknicks and @memgrizz is delayed on @CignalTV at 11:30 am after @dallasmavs vs @HoustonRockets. @WashWizards vs @Lakers is not televised in the Philippines.",
    "8": "@nyknicks Glad to see Mitch is playin",
    "9": "Uniforms for New York Knicks vs Dallas Mavericks at 5:30 PM. \n\n#NewYorkForever #MFFL https://t.co/B0151HJJRJ",
    "10": "Big game tonight let’s work fellas!!! @nyknicks @KnicksTape #KnicksNation",
    "11": "@hhpthebook @nyknicks Go NY, Go NY, Go NY, Go!",
    "12": "@nyknicks So many fans crying about him not starting. He’s thriving in his role rn and has been closing games at point. Who cares if he starts?",
    "13": "@nyknicks THEN START HIM",
    "14": "@KnicksMSGN @IQ_GodSon @nyknicks Free throws 🎯",
    "15": "@nyknicks lmaoooooo This video started with a video ad of chicken wings for Buffalo Wild Wings and I SWEAR I thought it was a play on Kendra's 40 piece chicken dinner tweet!!! 🤌🤣🤣🤣🤣🤣😂😂😂😂😂",
    "16": "@nyknicks Bad Template Thibs",
    "17": "@dmorey @BrooklynNets @JoelEmbiid NBA record – Most field goals Made in a Half (22 in the 2nd half vs. the New York Knicks on March 2, 1962)\n\nThink he can do this on a hot night",
    "18": "If the Mavs want to prove that they’re for real this season they’ll beat the New York Knicks tonight 😂 #MFFL",
    "19": "@nyknicks Even admin knows he should start coming Thibs",
    "20": "@nyknicks Start him",
    "21": "@nyknicks Yet he not starting",
    "22": "@nyknicks why isn’t he starting",
    "23": "@nyknicks Why not start him then lmfao",
    "24": "@nyknicks So start him",
    "25": "Quick over his last 5 games:\n◾️ 18.6 PPG\n◾️ 6.0 RPG \n◾️ 3.0 APG \n◾️ 52.0% 3P https://t.co/DDRcAaGSEv",
    "26": "Alright over mlb for now\n\nLets go win a ball game @nyknicks",
    "27": "Certainly, I’m taking advantage of the Mavs/Knicks match to wear my coveted Kristaps Porzingis shirt.  \n\nThe Ghost of KP lives on in Dallas and New York City, forever!",
    "28": "@nyknicks @IamJulito they didn’t listen to you",
    "29": "@nyknicks Someone relieve Thibs. Clueless!",
    "30": "@nyknicks @EvanFourmizz @J30_RANDLE @RjBarrett6 @RyArch15 Walker and I also instead of Kemba meant Nerlens Noel",
    "31": "@nyknicks He's the only coach in NBA history who wants to coach this lineup knowing he could be down by 15 before the first quarter ends",
    "32": "Promising Knicks rookie Quentin Grimes ramping up for return after injury #NewYork #Knicks #NBA https://t.co/mHO4mwbx7V",
    "33": "@dallasmavs @nyknicks @BallySportsSW @theeagledallas Let's Go Mavs! #MFFL",
    "34": "@KnicksMSGN @IQ_GodSon @nyknicks 50 40 90 quick",
    "35": "@nyknicks @EvanFourmizz @J30_RANDLE @RjBarrett6 @RyArch15 It feels good when you're Winning even the fumbling and bumbling usually grumpy and losing the ball Julius is walking confidently yet hopefully still your sorry azz is out of here at the end of the year as well as Fournier Walker Burks Kemba and most of all the Lousy Coach Thibs",
    "36": "@Iukeswanson @nyknicks Cam out",
    "37": "If the @nyknicks lose tonight, we would lose the momentum that has been building.  I'm not ready to let go of this winning vibe we have. None of us hate eachother,  we're all getting along, life is beautiful.  I need this win tonight. We need this win tonight. https://t.co/Z5NqhDpZ6f",
    "38": "@nyknicks burks at starting point guard... https://t.co/XDgZo03SK4",
    "39": "@nyknicks Lol why is Thibs so god damn stubborn",
    "40": "@dmorey @BrooklynNets @JoelEmbiid NBA record – Most points scored in a game (100 vs. the New York Knicks on March 2, 1962)",
    "41": "#Knicks #Mavs Lets go @nyknicks",
    "42": "@nyknicks Why couldn’t the lakers just take Alec Burks off our hands at the deadline",
    "43": "@nyknicks WHY IS BURKS STARTING",
    "44": "@nyknicks no one watching this blowout",
    "45": "@joeimparato0 @nyknicks we have to play the vets were in win-now mode!",
    "46": "Tonight's starting lineup for the New York Knicks: Burks, Fournier, Barrett, Randle, Robinson https://t.co/bVWH4AMCA2",
    "47": "@nyknicks Maybe start these 5 https://t.co/Di8G8H1AKU",
    "48": "New York Knicks Starting Lineup 3/9\n PG: Alec Burks\n SG: Evan Fournier\n SF: RJ Barrett\n PF: Julius Randle\n C: Mitchell Robinson\nhttps://t.co/o75oZ8vnE8",
    "49": "@nyknicks YES ALEC BURKS",
    "50": "@nyknicks #NewYorkForever Let’s go 🗽🏀💪",
    "51": "@nyknicks We’ve won two games in a row. What did you expect from Thibs",
    "52": "@nyknicks Burks at pg again LETS GOOOOO https://t.co/oH6sO0Tv4y",
    "53": "@nyknicks Run it up gentlemen!",
    "54": "@nyknicks burks and fournier https://t.co/5kwaL3UJId",
    "55": "@nyknicks Start quickley plz",
    "56": "@nyknicks Alec Burks https://t.co/vzQSiRulzP",
    "57": "@nyknicks Logical to go with Alec Burks at the point, he’s worked well in that position all season and quick is cold as ice right now! #ExtendThibs https://t.co/zAXzpx5402",
    "58": "@nyknicks Alec Burks starting at point guard should be a sin https://t.co/I8EdEnxUnQ",
    "59": "@nyknicks Tonight’s ratio",
    "60": "@nyknicks Sit Mitchell Robinson",
    "61": "@nyknicks Ratio",
    "62": "@nyknicks Fuck",
    "63": "Tonight’s five 👇 https://t.co/0BUlbb3cqj",
    "64": "@NY_KnicksPR @nyknicks He’s available just to leave the game",
    "65": "@nyknicks @RjBarrett6 @deucemcb11 @IQ_GodSon Can’t believe we have that sorry Big East tournament taking up OUR building",
    "66": "@NY_KnicksPR @nyknicks No sit his ass",
    "67": "@utahjazz @WorldWideWob he is not a jazz fan when we are against new york knicks.",
    "68": "@nyknicks @MSGNetworks @BetMGM Knicks are playing pretty fast and furious… IQ took it to another level, as did RJB…. leaving JR to take it up as well…. there’s a reason they build dble digit leads against anyone these days… unstoppable!!!!",
    "69": "@dmorey @BrooklynNets @JoelEmbiid Most Free Throws made in a game (Currently Wilt with 28 vs. the New York Knicks in 1962)\n\nEmbiid being the most unstoppable force in the league + lights out from the free throw line makes this one the most doable. #MVPiid",
    "70": "@nyknicks @RjBarrett6 @deucemcb11 @IQ_GodSon Does anyone watch you anymore",
    "71": "@nyknicks @EvanFourmizz @J30_RANDLE @RjBarrett6 @RyArch15 RJ rocking the Canadian Tuxedo. Gotta love the commitment to his Homeland 🇨🇦",
    "72": "Views from the hardwood. 📸 https://t.co/obxOjYNXKc",
    "73": "Charlotte's J.R. Reid collects 6 points in blowout win against @nyknicks. #NBA #NBA9798",
    "74": "•NBA record – Most Free Throws Made in a Game (28 vs. the New York Knicks on March 2, 1962)\n•Record shared with Adrian Dantley https://t.co/aJoNqomZ2W",
    "75": "New York Knicks: Theo Pinson reveals heartbreaking details about leaving Knicks last year https://t.co/J0wQ6nFCwP",
    "76": "@dmorey @BrooklynNets @JoelEmbiid NBA record – Most Free Throws Made in a Game (28 vs. the New York Knicks on March 2, 1962).  There is a “chance” it happens vs nets (with me and my son watching live 😉)",
    "77": "@nyknicks @EvanFourmizz @J30_RANDLE @RjBarrett6 @RyArch15 Too bad drip can’t save the Knicks from a Luka game winner",
    "78": "@nyknicks @EvanFourmizz @J30_RANDLE @RjBarrett6 @RyArch15 Julius Jacket is fly ❄️",
    "79": "Lots of line-ups news and an important game for the @nyknicks @KnicksMSGN join @wallyball @alanhahn and I. https://t.co/CUh9Pwl5nL",
    "80": "@natemarroquin @JonHeyman @NFLDraft @nyknicks @MLB @MLBPA This isn’t 1993-1994. Today’s society,people move on to the next thing.  The only people sitting around waiting for them to make a deal are the die hard fans.  In addition, because of COVID, people figured out how to spend their time doing other things when sports were shut down.",
    "81": "@dmorey @BrooklynNets @JoelEmbiid Clearly.... NBA record – Most Free Throws Made in a Game (28 vs. the New York Knicks on March 2, 1962\n\nBut since plenty of other people have guessed this, as a tie breaker I say he'll do it in the playoffs",
    "82": "@nyknicks @EvanFourmizz @J30_RANDLE @RjBarrett6 @RyArch15 Julius styling like a mf!",
    "83": "@dmorey @mike_greger @BrooklynNets @JoelEmbiid NBA record – Most Free Throws Made in a Game (28 vs. the New York Knicks on March 2, 1962)\n\nThis seems to be the most likely imo.",
    "84": "[Live] 2022 NBA Basketball Dallas Mavericks Vs New York Knicks 👉 ▶️ : https://t.co/xDDzbjybKC | 9-Mar-22 @ 20:30 | New York Knicks | Dallas Mavericks | NBA | Basketball https://t.co/zmuTx0IcTE",
    "85": "GAME THREAD: Dallas Mavericks vs New York Knicks https://t.co/wf3k54RGds https://t.co/CQHHuYUe4H",
    "86": "@nyknicks @EvanFourmizz @J30_RANDLE @RjBarrett6 @RyArch15 The new guy with the purse getting play… What a difference a week makes",
    "87": "@MBrownsville @JonHeyman @NFLDraft @nyknicks @MLB @MLBPA Old news?!? NO FREAKING WAY!!!",
    "88": "March 9, 1988\n\nLos Angeles Lakers coach Pat Riley recorded his 400th career victory in a 104-99 win over the Knicks in New York, reaching the 400 victory plateau faster (540 games) than any other coach in NBA history. 🐐 https://t.co/ANpAWcGmL7",
    "89": "@dmorey @BrooklynNets @JoelEmbiid Most Free Throws Made in a Game (28 vs. the New York Knicks on March 2, 1962)\nRecord shared with Adrian Dantley",
    "90": "@nyknicks @EvanFourmizz @J30_RANDLE @RjBarrett6 @RyArch15 Who gives a shit?",
    "91": "@nyknicks @EvanFourmizz @J30_RANDLE @RjBarrett6 @RyArch15 Ev butter soft flight jacket 🔥",
    "92": "There’s only one team Luka Doncic has never beaten in Dallas:\n\nThe New York Knicks",
    "93": "@JonHeyman Who cares!! Waiting for the @NFLDraft and the ridiculous hope that the @nyknicks can make some type of run to sneak into the playoffs.  @MLB @MLBPA are old news.",
    "94": "@dmorey @BrooklynNets @JoelEmbiid NBA record – Most points scored in a half (59 in the 2nd half vs. the New York Knicks on March 2, 1962)\n-Kobe Bryant is second with 55.\n\nThis is one of the most achievable records and Embiid can have a monstrous half similar to Kobe (RIP)\n\nAlso, I’ll be in Philly tomorrow night!",
    "95": "@StacyPatton89 @dan_ny_b @nyknicks @EvanFourmizz @J30_RANDLE @RjBarrett6 @RyArch15 And my my",
    "96": "@dan_ny_b @nyknicks @EvanFourmizz @J30_RANDLE @RjBarrett6 @RyArch15 The coolest motherfuckers on the planet",
    "97": "@nyknicks @EvanFourmizz @J30_RANDLE @RjBarrett6 @RyArch15 I need that Julius Randle jacket",
    "98": "@nyknicks @EvanFourmizz @J30_RANDLE @RjBarrett6 @RyArch15 How y'all got a pick of Ryan Arcirrelevant and not Duece or IQ",
    "99": "@nyknicks @EvanFourmizz @J30_RANDLE @RjBarrett6 @RyArch15 FRENCH LEATHER",
    "100": "@nyknicks @EvanFourmizz @J30_RANDLE @RjBarrett6 @RyArch15 @J30_RANDLE 's jacket! I want one! 🔥🔥🔥🔥🔥🔥",
    "101": "@papa_gardner11 @nyknicks @EvanFourmizz @J30_RANDLE @RjBarrett6 @RyArch15 Arch looks like he’s selling real estate",
    "102": "@nyknicks @EvanFourmizz @J30_RANDLE @RjBarrett6 @RyArch15 Literally listening to the song as you posted this",
    "103": "@nyknicks @EvanFourmizz @J30_RANDLE @RjBarrett6 @RyArch15 Arch is probably gonna get real minutes tonight so 💀",
    "104": "@nyknicks @EvanFourmizz @J30_RANDLE @RjBarrett6 @RyArch15 our boys drippin no cap",
    "105": "So fresh. So clean. \n\n#UltraDrip https://t.co/WHoygFlt6e",
    "106": "A #NewYork view!!!\n\n@nypost @nytimes @nyknicks @univisionny  @jochyfersobe en NYC https://t.co/81cLhTCLmT",
    "107": "I mean I’ve never been to a New York Knicks game but I imagine that every song played over the PA is “Hey Mr. Knickerbocker boppity bop! I like-a the waaaay that you boppity bop!”",
    "108": "@bungalsrback It’s gotta be like the New York Knicks in return, right?",
    "109": "On this day(March 9) in 2004 @RandyOrton &amp; Evolution were at the New York Knicks v Boston Celtics NBA game at Madison Square Garden to hype WrestleMania. https://t.co/HhDhGW2ddU",
    "110": "@AlienHere2Love Other day someone accused me of being a alien invader I said if I wasn't from New York why the fuck would I be a Knicks fan",
    "111": "@NBA_NewYork I don’t think since he joined the Knicks, I ever heard this guys voice…..",
    "112": "@statmuse New York Knicks and lakers..",
    "113": "THIS JUST IN: Jalen Brunson (foot) returns tonight against New York Knicks. https://t.co/DmUJLhTHn2",
    "114": "New York Knicks: Celtics midseason turnaround began with Ime Udoka ripping his team after loss to Knicks: ‘I\u0085 https://t.co/tA6uuZTAsQ",
    "115": "There are two wins I want to see this week: my beloved @nyknicks beating the Dallas Knicks, and BN winning #PRNJohor.\n\nI'll settle for one win, honestly.",
    "116": "ALERT: New high roller bet posted!\nA bet has been placed for $6123.3 on Dallas Mavericks - New York Knicks to win $11,205.64.\nTo view this bet or copy it https://t.co/yBedarKDgb https://t.co/DkSqpZ5wcA",
    "117": "Lakers fans deadass disgusting for threatening Westbrook family y’all JUST WON A CHIP IN 2020, can’t win em’ all.\n\n( The only fans that should be allowed to issue death threats to anyone is the fans of the @nyknicks last chip was damn near 50 years ago. )",
    "118": "@Jukebox3331 @nyknicks facts",
    "119": "@LariatNLakeLife @wojespn Send him to the knicks for their mascot the fans in New York will treat him more like he deserves",
    "120": "@justinsuntron @verge @ChelseaFC bruh buy the @nyknicks but owning @ChelseaFC would be sick!",
    "121": "@KeepClmStayMe7o @NBA_NewYork I mean If that pic doesn't summarize the knicks previous drafts idk what does lmao. Baker and Early but not FVV🤣",
    "122": "@DaveZenon Toppin’s impact on the Knicks can be seen in his Net Rating, which sits at 6.3 when on the court, which is the best of all New York rotational players with Quickley being next best at 5.2. \n\nWhen the energetic big man sits, the Knicks NetRtg is -5.8, totaling a swing of 12.1.",
    "123": "@Farbod_E @ALLAN_HOUSTON @nyknicks @J30_RANDLE Where's the \"Billion likes\" button 😭😭😭🧡💙",
    "124": "@hhpthebook @CPTheFanchise @nyknicks i don't support espn but i always hit that thumbs up button for my boys after every Knicks win.  i still can't handle Knicks losses, sorry.  Salute CP https://t.co/MctOMkQUfK",
    "125": "@NBA_NewYork Worst record in the league with 17 wins, picked 3rd. NOP and Memphis both won 33 games, picked 1 and 2. Ewing was the only time the Knicks moved up. 4 of the last 6 drafts they have moved down. 5 of the last 10. Love RJ.",
    "126": "@NBA_NewYork Need him on the Knicks!",
    "127": "@Jdrzej22858627 @PANDAisLIVE_YT @nyknicks @MSGNetworks @BetMGM Robinson playing great and so is Barrett and quickley plus no one on mavs can guard randle",
    "128": "11/1/9(46) 1st #nba game @nyknicks beat Toronto huskies  68-66 (1)(34) total (34) years after the debut of the phony #piltdown evolution human. \n\n(34) years later @MagicJohnson 1st ring #nba (34th) season. #RussiaUkraineConflict #nba https://t.co/HKgZxiX94w",
    "129": "@nyknicks Can you make Kenny Payne your head coach so he doesnt come to coach Louisville ? I dont want him fucking up our program anymore than it already is . THanks",
    "130": "We now learn \"soon\" is 3 years from now.\n“I feel I can work three more years at least, but cutting back on the road...” -Clyde.\n@nyknicks, we have a mission. Let's bring a 🏆 to NY while giving Clyde a beautiful retirement gift. MAN! What a glorious day that will be.🥲 https://t.co/XSH5bOZw6c",
    "131": "New York Knicks",
    "132": "Retired NBA player Charles Oakley asked the Second Circuit to reinstate his assault claims against New York Knicks owner James Dolan, saying the trial court should have allowed a jury to weigh his claims.\n\nhttps://t.co/tUGrTsM4hn",
    "133": "@nyknicks 3 wins in a row ?",
    "134": "@Knicks_SNOB @nyknicks @statline_ and we are a losing team. There is enough talent to be a .500+ team. No chemistry. Little ball movement. Poor defense and no player's talents are optimized.",
    "135": "Oklahoma City Thunder. Utah Jazz. New York Knicks of the 90s. Brooklyn Nets. Any team that  Doc Rivers coaches https://t.co/MXwx6YvqF1",
    "136": "Three in a row tonight @nyknicks ??",
    "137": "@NBA_NewYork I remember being excited AF when the knicks drafted him . Before Wichita he went to the community College 20 minutes from me and I was screaming for the knicks to draft him. Disappointed he didn't pan out",
    "138": "Busy NBA pxp schedule for me 🎤 this week:\n\n▪ Tuesday - @LAClippers at @warriors \n▪ Wednesday - * @trailblazers at @utahjazz \n▪ Thursday - @BrooklynNets at @sixers \n▪ Sunday - * @nyknicks at @BrooklynNets \n\n* Assignments added today.",
    "139": "@ginachron @plbdkb69 @SuzanneSugar The shelters are full. Rescues needed!\n@newyorkcity @newyorkcitynext @NYCPride @NYCPridePower @NewYorkRedBulls @NewYorker @nyphospital @newyorkerunion @newyorklivetv @BrooklynNets @nyknicks @NJDevils @NYCFC @NYCFCHelp @GothamFC @NYIslandersPR @WFAN660 @BigBoxRadio @wrhuradio",
    "140": "@PasionBasketNBA New York Knicks",
    "141": "@nyknicks He gonna go off again tonight Lego randle",
    "142": "Back NEW YORK KNICKS to BEAT Dallas Mavericks tonight in the @NBA (Game Starts at 01.40 GMT) #NBA #Basketball",
    "143": "@captianstruggle @Steph_Quatorze @SDinwiddie_25 @nyknicks The fact that this tweet is still true is hilarious",
    "144": "@DailyMavsNews @nyknicks I think it’s efficiency this year, but yeah they normally wilding for no reason.",
    "145": "New York Knicks vs. Dallas Mavericks - 3/9/22 Free Pick &amp; NBA Betting Prediction https://t.co/GXM08iF7Z9\n.\n#Betting #FreePicks https://t.co/Mf8o66qWUf",
    "146": "Happy birthday to darrell walker of the New York Knicks #darrellwalker #newyorkknicks #denvernuggets #washingtonbullets #detroitpistons #chicagobulls https://t.co/1B1SImxi11",
    "147": "@MavsTracker @dallasmavs @nyknicks @jalenbrunson1 Yeah to keep the white theme they just straight switched Classics to Association.",
    "148": "@dallasmavs @nyknicks @BallySportsSW @theeagledallas Yes yes Yes yes",
    "149": "New York Knicks visits Dallas Mavericks Predictions and Preview for 3/9/2022 today.  Who are we taking in this game?  Find out now. #Sportsbook #Picks https://t.co/OEMNtD6mUu",
    "150": "@KnicksUniTrack @dallasmavs @nyknicks @jalenbrunson1 Over half??? Wow. I guess the numbers are increased since they dumped the Classics right?",
    "151": "@MavsTracker @dallasmavs @nyknicks @jalenbrunson1 It crazy we still have another 12 games wearing the Association. 43 games total",
    "152": "@nyknicks take notes https://t.co/jOrds1WGpH",
    "153": "@camilacamfam @nyknicks @NY_KnicksPR the guy above speaks no Lies. Burks &amp; Fournier was a mistake. Either get rid of them or bench them",
    "154": "@KnicksMSGN @WaltFrazier @nyknicks Love it. Looks like one of those colorblind tests when I was younger. I kept looking for numbers.",
    "155": "@NYPost_Berman Very well deserved. Watching the Knicks won’t be the same without Clyde. All I’m saying is the New York Knicks BETTER win a championship before Clyde retires. Period.",
    "156": "@NYPost_Berman Toppin’s impact on the Knicks can be seen in his Net Rating, which sits at 6.3 when on the court, which is the best of all New York rotational players with Quickley being next best at 5.2. \n\nWhen the energetic big man sits, the Knicks NetRtg is -5.8, totaling a swing of 12.1.",
    "157": "Dallas Mavericks Predictions and Preview for 3/9/2022 hosts New York Knicks.  Find out who we are taking in this matchup. #Sportsbook #Picks https://t.co/OEMNtD6mUu",
    "158": "@statmuse @nyknicks, always with ambitions and without global success for 50 years.",
    "159": "@nyknicks Toppin’s impact on the Knicks can be seen in his Net Rating, which sits at 6.3 when on the court, which is the best of all New York rotational players with Quickley being next best at 5.2. \n\nWhen the energetic big man sits, the Knicks NetRtg is -5.8, totaling a swing of 12.1.",
    "160": "@TheStrickland @FrankBarrett119 Toppin’s impact on the Knicks can be seen in his Net Rating, which sits at 6.3 when on the court, which is the best of all New York rotational players with Quickley being next best at 5.2. \n\nWhen the energetic big man sits, the Knicks NetRtg is -5.8, totaling a swing of 12.1.",
    "161": "@statmuse New York Knicks @SergioACNBA",
    "162": "@KnicksUniTrack @dallasmavs @nyknicks @jalenbrunson1 Y’all have worn the Association 31 games?? 🤯",
    "163": "#Mavericks conclude their home stand with their second game of the season against the Knicks. New York has taken 2 straight and seven of the last 11 meetings. Who you got for the 'W' tonight? \n\n#MFFL",
    "164": "@SDinwiddie_25 @nyknicks DROP 50 TONIGHT CRYPTO KING",
    "165": "Drafting Lebron's son to sign Lebron really feels like a New York Knicks move to me \n@adamclanton @AdamJWexler @JoeGeorgeRadio",
    "166": "@statmuse New York Knicks",
    "167": "@Knicks_SNOB @nyknicks @statline_ Maybe.",
    "168": "THE NEW YORK NECKS &gt; THE NEW YORK KNICKS https://t.co/qmGtoSCgyw",
    "169": "New York Knicks. Bottler of the season. https://t.co/qcwkwpG3Ea",
    "170": "If you're a betting person. Madrid won tonight.......carry Luka Doncic to score more than 35points against NewYork Knicks",
    "171": "@statmuse New-York Knicks https://t.co/WRzjia9tmA",
    "172": "New York Knicks https://t.co/K5ebIU7uTk",
    "173": "@Knicks_SNOB @nyknicks @statline_ I guess this proves that having 4 different guys who have scored 40+ is not that helpful",
    "174": "@statmuse New York Knicks",
    "175": "@statmuse New York knicks",
    "176": "@JulieanneGilch1 @tripleMwassup @NBA_NewYork @IQEnjoyer I would have preferred that they lost too. Hell I don't want them to win another game. But there's a huge difference between that and expecting the team to lose on purpose. And what schedule are you looking at? The Knicks are only favored in maybe 2-4 of the last 17 games.",
    "177": "New York Knicks: Knicks missing former guard, who has shined for Mavericks https://t.co/F75xGrpIET",
    "178": "@nyknicks have 7 games remaining against the 4 teams currently ahead of them in the playoff rankings.  I think we need to see 5-2.",
    "179": "Knicks missing Reggie Bullock, who continues to shine for Mavericks #NewYork #Knicks #NBA https://t.co/UCsPzz8jTA",
    "180": "@IQEnjoyer @NBA_NewYork @tripleMwassup Its not a guarantee but i truly think the top 7 fit the knicks perfectly and the guys after are worse than all the guys we have. I believe in our FO drafting. So yeah. I want another opportunity to get that guy at 7 or 8. But of course. Whatever happens happens.",
    "181": "@Knicks_SNOB @nyknicks @statline_ Maybe Thibs isn't the issue",
    "182": "This the type of energy I like to see we need more professional franchises to step up and help out right now 🇺🇦🇺🇦🤞🏼🤞🏼 @nyknicks @Mets @nyjets   #StandWithUkraine https://t.co/zNKTuBoCk3",
    "183": "I really  don't understand why all @nyknicks fans are hating on Julius Randle ,when he is leading in ppg , rpg and apg ?\nBy the way Luka's stats are from another planet ,this guy is insane!\n#Mffl https://t.co/WJdYnRFkzv",
    "184": "\"The Vibes in the AAC will be Immaculate tonight\"! Jalen Brunson is BACK! @dallasmavs vs @nyknicks @jalenbrunson1 https://t.co/iLM4GSnIgn",
    "185": "God bless the fans of the New York Knicks. https://t.co/wyGiE2vOrJ",
    "186": "@nyknicks He can stay.",
    "187": "@IQEnjoyer @NBA_NewYork @tripleMwassup How has that worked the last 20 years for us. We cant do anything about it. But i will no longer cheer blindlessly for wins fod the giants and knicks that dont carry over to the next year and help our team. I have some faith in this team because of rj and Iq but I've lost too muc",
    "188": "@IQEnjoyer @NBA_NewYork @tripleMwassup We arent a great organization. We've proven that. And i never said tank. I want to lose to por and sac. Thats it. If winning 2 less game so get the 8th pick in a weird draft then yeah so be it. And its not the only way. But it has been for the knicks last few years.",
    "189": "@dallasmavs @nyknicks @BallySportsSW @theeagledallas Taking our son to his first #mavs game tonight! Any suggestions on making it the best one ever??😉😬",
    "190": "The NFL has the Washington Commanders, the NBA has the New York Knicks, and MLB has the Colorado Rockies. The worst run organizations in all of American sports https://t.co/pLVsWPPMkT",
    "191": "Source: The #Knicks are expected to pursue Jalen Brunson in free agency this upcoming offseason. \n\nNew York has been interested in Brunson for quite some time and their interest in him from this past trade deadline is expect to carry over into the offseason.",
    "192": "New piece up and running on the blog:\nhttps://t.co/MaJidrlHZS\n\n#Knicks #RJBarrett #JuliusRandle #TomThibodeau #NBA #NewYork",
    "193": "Jalen Brunson, who did not play Monday due to a right foot contusion, has been upgraded to probable for Wednesday's game against the Knicks.\n\nSounds like Mitch Rob (illness) will be a game-time decision for New York",
    "194": "#NYI #isles NYI have been New York's NHL team since 1972, we will never be Knicks little brother NHL team who survive off a tax exemption with corporations, concerts with half tickets as a tax write off. Only thing that kept Knicks hockey out of NJ by 1982. NYI never got handouts",
    "195": "@IQEnjoyer @NBA_NewYork @tripleMwassup Clearly and I dont either. As long as rj and IQ  are here, i will enjoy every knicks win. I just know we'll never have a consistent winner for the foreseeable future. Oh well. Here's to 2025",
    "196": "📅 On this day in 1985, the @nyknicks Bernard King had 42 points, 10 rebounds, 13 assists, and four steals in a 131-129 win over the Sixers.\n\nKing is one of only two players in franchise history to record a 40-point triple-double. The other is Richie Guerin, who did so twice. https://t.co/2zWV0n7sBB",
    "197": "New York City would get some amazing PR clearing Kyrie by the Knicks game 👀",
    "198": "@DannyFumbles @nyknicks @MSGNetworks @BetMGM We already tanked. Now let’s make sure we finish it. I know we will. Fans are still hopeful for playoffs?!?!? Why?  Did everybody see what I witnessed this season? We don’t have the right coach or top players to do anything. Inconsistent role players",
    "199": "Today's NBA Picks: 8:40 PM ET - New York Knicks vs. Dallas Mavericks - 21 PICKS AVAILABLE: https://t.co/WYvtKpIRVp #nba",
    "200": "New York Knicks: Knicks Injury Update: Will Cam Reddish Play Against Mavericks? https://t.co/teP5fXMYa1",
    "201": "Since the Mavs lost to the Knicks on Jan 12, Dallas has lost just six games.\n\nNew York has won just six games.\n\nWhat is your prediction for tonight? #MFFL",
    "202": "@jacobwindell But the knicks own yall 😌 New York dubbing tonight",
    "203": "NBA:🏀\nAtlanta Hawks +4.5 -110 [1]\n\nOrlando Magic +8 -110 [3] MAX PLAY🔥 \nSan Antonio Spurs Over 228.5 -110 [3] MAX PLAY🔥\n\nMiami Heat -4.5 -115 [1]\n\nNew York Knicks +8.5 -110 [1]\n\n#apuestas #deportes #apuestasnba",
    "204": "The @nyknicks, exploring trades with the @warriors in the offseason:\n\nIs Obi-Juan a thing",
    "205": "@RowanABarrett @nyknicks i was talking for randle",
    "206": "Letting ‘unsung hero’ Reggie Bullock walk is yet another Knicks what-if #NewYork #Knicks #NBA https://t.co/E6awBdAKi1",
    "207": "@nyknicks Miss you PE! Thank you for those hard fought battles on the court! Those games were epic! 😊❤️💪🏾🏀👑",
    "208": "@dallasmavs @nyknicks @BallySportsSW @theeagledallas Let's GOOOOOO",
    "209": "@NBA_NewYork @tripleMwassup We're talking about going from about a 15% chance to about a 30% chance to move up. For that you want the Knicks to make an organizational decision to throw games? Really?",
    "210": "@PANDAisLIVE_YT @nyknicks @MSGNetworks @BetMGM Now they have Dinwiddie who's playing great, Porzingis wasn't a good fit for them",
    "211": "Check us out tonight at 8 on YouTube. And definitely on Monday the 14th at 8 est. We will have Heisman Trophy winner, National Champion, College Football HOF @RealCharlieWard #floridastateseminoles #NewYorkKnicks #NBA #heisman #floridahighseminoles #sports https://t.co/WyfgynT2Qg",
    "212": "Look @nyknicks #WeThePeople https://t.co/6GFL1bi7Sz",
    "213": "Then we all get laced \ntelevisions, Versace heaven\nWhen I’m up in em\nThe shit she kicked\nAll her shits legit\nShe get dick from a player off the #NewYorkKnicks #BiggieDay",
    "214": "Lisa Willis, New York Knicks’s first female coach, talks leadership, values, opportunities\nhttps://t.co/86NeyTWpMo",
    "215": "@tripleMwassup @JulieanneGilch1 @IQEnjoyer @NBA_NewYork These people are a waste of time bro. Small amount of people with a real opinion on Knicks Twitter.\n\nThe people who yell \"tank, tank, tank!\" were the same folks who slandered people who thought this team would win less than 50 after the 5-1 start.",
    "216": "Since the Mavs lost to the Knicks on Jan 12 Dallas has lost just six games while New York has won just six games. Pregame Show starts at 7pm @theeagledallas",
    "217": "@nyknicks Leave him there.",
    "218": "@iHateShaun Hello Shaun,\n\nI work for the New York Knicks and would like to offer you the head coaching job. \n\nDo you accept?",
    "219": "@SpoonOfZeke @nyknicks It's tough.",
    "220": "@NBA_NewYork They will, the problems on this team still exist. but ppl really tripping that knicks have won last two games with youth leading the way lol we m not gonna lose 18 games in a row can’t bash every win. This team has talent.2018 we did not",
    "221": "@PatrickHaggan @nyknicks Respect ✊",
    "222": "@SpoonOfZeke And I don't like the @nyknicks it's an unreasonable love..",
    "223": "@SpoonOfZeke New York Knicks.",
    "224": "@NBA_NewYork So then what is your suggestion for the Knicks? How are you going to split up the playing time? If we’re up at the end of a game with the young kids are you just going to pull them or tell them to stop trying? What’s your plan?",
    "225": "im very sorry mrs randle feels that way im a fan of @KnicksFanTv and i dont see what @KendraRandle_ see and as a fan of bball and a life time fan of the @nyknicks i wish good heath and great basketball to all nba players and there familys god bless everyone ,,,,",
    "226": "@Michael16237217 @nyknicks I know you’re a big basketball fan and Dolan has been awful. I’ve been a Knicks fan since the early’70’s (Clyde, Reed, Monroe, Bradley, Jackson…).",
    "227": "@cedricshine @NBA_NewYork That's exactly it. Play the kids is not the same as tanking and Knicks already have a 21 year old cornerstone improving by the hour. This is not a traditional tank situation. You have to make sure you're developing RJ 1st. That might come at the expense of a \"tank\".",
    "228": "@nyknicks @MSGNetworks @BetMGM not saying it’s gonna happen, but this does feel like a very winnable game for us. if RJ, Julius and Quickley keep it up we could win this game even if Luka goes off.",
    "229": "@nyknicks Randle for Luka straight swap, who says no?",
    "230": "Analyzing Wednesday’s New York Knicks at Dallas Mavericks odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/EXyQvXTHzG",
    "231": "Check out the Kith Wilson for New York Knicks Ball Pump Black available on StockX https://t.co/6JPETZ8QYN",
    "232": "Check out the Kith Wilson for New York Knicks Ball Pump Black available on StockX https://t.co/6JPETZ8QYN",
    "233": "@nyknicks Another big game from @J30_RANDLE tonight 💪🏾",
    "234": "Big insider buy in Madison Square Garden Sports $MSGS (New York Knicks &amp; Rangers).. $1M 👀 https://t.co/WRmkZBBb7J",
    "235": "Im honestly interested on why @nyknicks fans would want to fire Thibs, specifically @RGT_85.",
    "236": "@GunnaCapone Born into it. Boston New York thing. Jets Yankees knicks.",
    "237": "@nyknicks Not a team player. Knicks will never win with julius. Seems like the knicks organization is tine deaf. The fans hate julius. He didnt play hard for 60 games, came to camp over weight. Doesnt play any defense! Give the team to RJ already!",
    "238": "@NekiasNBA Let them choose. We moved to atlanta from new york. Im a knicks fan but my daughters are hawks fans. Why? Because they like the color red. Its not that deep to them. Lol",
    "239": "@nyknicks Another 40 piece would be crazy but I’ll be content with the 30 😆",
    "240": "@SDinwiddie_25 @nyknicks Prove it tonight king",
    "241": "I still have mine, from 1990, New York Knicks, Patrick Ewing, it don't fit anymore but I recently bought a newer version of it. https://t.co/L5Ljw4CxqX",
    "242": "@nyknicks Leave his ass in Dallas",
    "243": "It’s been 3,232 days since the New York Knicks last won a playoff series #bingbong 🤡",
    "244": "@nyknicks We run NY 🤎💙",
    "245": "@JoeYRages909 @nyknicks aren’t you a lakers fan",
    "246": "@nyknicks Stay there pls",
    "247": "@nyknicks hoodie tuff i need it",
    "248": "@nyknicks Trade him",
    "249": "📍 Hometown kid https://t.co/7v0Dn0NaEN",
    "250": "@NBA_NewYork @Arifromanhattan Such a crap shoot the year the Knicks got third pick and got Barrett they had 17 wins and the 2 teams who picked ahead of them both had 33 wins, almost double their total.",
    "251": "NBA suspends Kings center Domantas Sabonis for bumping official in loss to New York Knicks. Watch the video, see how the league described the sequence of events and hear what Sabonis had to say ⬇️\n\nhttps://t.co/xZ1MWkkd6U",
    "252": "@ericadamsfornyc @BrooklynNets @nyknicks @nyliberty @KyrieIrving can help u og",
    "253": "@ericadamsfornyc @BrooklynNets @nyknicks @nyliberty Mr Irving has a lot of free time during home games..... Because of You. \nHe's a nice man, he'll help you out. \nGotta do a favor for him tho.",
    "254": "@ericadamsfornyc @BrooklynNets @nyknicks @nyliberty You should ask Kyrie",
    "255": "@ericadamsfornyc @BrooklynNets @nyknicks @nyliberty U can do all dat but can’t let kyrie play home games 🤦🏾‍♂️",
    "256": "@coco_002 New York knicks is gonna trash Dallas",
    "257": "@FortyEightMins @J30_RANDLE @nyknicks @dallasmavs @nbatopshot @NBA TS onay7 good luck everyone's",
    "258": "🚨 Line Change 🚨\n\nNew York Knicks @ Dallas Mavericks\nWed 8:40 PM EST\n\nFrom:\nDAL -8.0 -115\n\nTo:\nDAL -9.0 -105",
    "259": "@BradDressler24 @DailyKnicksFS @nyknicks Yeah, I agree he's probably got more playmaker upside than IQ.  Quick has been really good lately, but he's not necessarily a lead guard.  TyTy has probably been the primary ball handler his whole life too.\nI'm really looking forward to the Tourney to see what's available.",
    "260": "Sacramento Kings center Domantis Sabonis was suspended by the NBA for tonight's game, after he made contact with an official during Monday night's contest against the New York Knicks. https://t.co/LkHjYEu3Yg",
    "261": "Sacramento Kings center Domantis Sabonis was suspended by the NBA for tonight's game, after he made contact with an official during Monday night's contest against the New York Knicks. https://t.co/XJ0PVFzOUB",
    "262": "@yawgeezmusic @hhpthebook @DP_RUwithme @johnnyjohnjon83 @KendraRandle_ @Hospey @CPTheFanchise @nyknicks if youre aware of the situation how can you seriously say she left willingly? She was bombarded by Knicks twitter. For saying her FACT, as she is media &amp; behind the scene info. That some FA dont come to NY because of the Fan Base. Homeboy spit on Trae Young during a pandemic",
    "263": "Views from the Dallas Mavericks new practice facility close to the AAC. The Mavs take on the New York Knicks tonight, looking to extend their win streak to six games.\n.\n.\n.\nEmil Lippe | The Dallas Morning News (@dallasnews @SportsDayDFW @dmn_mavericks) | Tuesday, March 8, 2020 https://t.co/uQT4SKGouo",
    "264": "@ThaRealDBreezy @hhpthebook @DP_RUwithme @johnnyjohnjon83 @KendraRandle_ @Hospey @CPTheFanchise @nyknicks Definitely aware of what happened....  Just seems like u let ur the “homer” side of u to get in the way of what is actual and factual",
    "265": "@Doncic007 @MavsTracker @BallySportsSW @AACenter @dallasmavs @nyknicks @KnicksUniTrack Dm me",
    "266": "@yawgeezmusic @hhpthebook @DP_RUwithme @johnnyjohnjon83 @KendraRandle_ @Hospey @CPTheFanchise @nyknicks Lol You sound like you have no idea on the topic. Just enjoy your day.",
    "267": "@Metr0_76 @nyck37 @NBA_NewYork The Mavs were reinvigorated long before Theo signed (see also Luka). Plus, they had roster spots, especially now. So: Where do you find the cap space &amp; who do you cut from the Knicks so that they can have a cheerleader at the end of the bench who'll rarely see the floor?",
    "268": "GAMEDAY\n\n🆚 New York Knicks\n🏟️ American Airlines Center, Dallas\n⌚ 22:30 🇧🇷\n📺 League Pass e Links\n\n#MFFL https://t.co/4cG0TQSVqr",
    "269": "@nyknicks two words.......\nI'm Goonne!!",
    "270": "@JrLawrenceG @nyck37 @NBA_NewYork and now the Knicks are suffering. Pinsons value is now being demonstrated more than ever with a reinvigorated Mavs team.",
    "271": "@dallasmavs @nyknicks @BallySportsSW @theeagledallas How we feeling MFFL’s?",
    "272": "@dallasmavs @nyknicks @BallySportsSW @theeagledallas Y’all better beat the Knicks",
    "273": "Anyone interested in this rare NEW YORK KNICKS x JOSE CUERVO HARD WOOD EDITION tequila? Only 100 ever made with this special box made from the Knicks court floor. \n\nThis one was originally owned by @kporzee and is now out of his hands obviously. DM if interested or for info https://t.co/b4ZCVRurkG",
    "274": "@dallasmavs @nyknicks @BallySportsSW @theeagledallas It’s beautiful",
    "275": "Let's close out this home stand 💪\n\n🆚 @nyknicks\n⌚️ 7:30PM CT\n📺 @BallySportsSW\n📻 @theeagledallas &amp; 99.1 FM https://t.co/ymZRMZit26",
    "276": "@nyknicks Y’all still not in the playoffs 😂😂 season highlight",
    "277": "Was thrilled that the New York Knicks’ @juniorknicks League came to our Saturday Night Lights program at the Bronx YMCA on Castle Hill Avenue on Saturday. Was great to meet former Knicks player John Wallace, who inspired the kids. https://t.co/G4f4RJykPC",
    "278": "@Pass1st11 @BrooklynNets It’s not on the floor.  I’m very upset @BrooklynNets You can’t do this to fans who have been loyal regardless of sucking or having star players.  #IDGAF it’s our hard earn money that we pay each season and you do this? Nahhhh maybe it’s better at @TheGarden with the @nyknicks",
    "279": "@KnicksFanTv And the dark cloud continues to loom over the @nyknicks. We can’t catch a break at all. We should be called The New York - Cant Catch a Breaks 😩",
    "280": "@nyknicks @MSGNetworks @BetMGM But they ain’t making the playoffs.  They don’t even have regular season experience.  Thibs been riding these bums starting since day one. Fournier, Robinson, Burks and Randle can sit tonight. Lol",
    "281": "ALERT: New high roller bet posted!\nA bet has been placed for $7,505.67 on Dallas Mavericks - New York Knicks to win $14,113.18.\nTo view this bet or copy it https://t.co/5vPOzGb1Fw https://t.co/pxwy6PsNWp",
    "282": "📺 Dallas Mavericks vs New York Knicks Daily Preview | WagerTalk Sports Betting Minute for March 9 https://t.co/5fY0iPuQw0 @wagertalk",
    "283": "ALERT: New high roller bet posted!\nA bet has been placed for $5003.78 on Dallas Mavericks - New York Knicks to win $8,838.88.\nTo view this bet or copy it https://t.co/bueP752Bzx https://t.co/1y3ELJJ1R2",
    "284": "@MavsTracker @BallySportsSW @AACenter @dallasmavs @nyknicks @KnicksUniTrack I need a Los Mavs Luka Jersey. Come on with it. @dallasmavsshop",
    "285": "@ThaRealDBreezy @hhpthebook @DP_RUwithme @johnnyjohnjon83 @KendraRandle_ @Hospey @CPTheFanchise @nyknicks lmaoo. You sound like a herb....  Ash left willingly.... she wasn’t forced off anything",
    "286": "@gerardrusso10 @nyknicks @MSGNetworks @BetMGM what😂 just play the youth and hope we win there’s no point in tanking these youngins need playoff experience",
    "287": "@MavsTracker @BallySportsSW @AACenter @dallasmavs @nyknicks @KnicksUniTrack Got 2 tickets for tonights Section 113 row S trying to sell at that good price!",
    "288": "@Iukeswanson @nyknicks @MSGNetworks @BetMGM Then you woke up from your dream huh",
    "289": "Dewan needs to be called up to the @nyknicks before another team steals him. https://t.co/XvzaJCZk2N",
    "290": "@BallySportsSW @dallasmavs @nyknicks @ChoctawCasinos That’s youngggg Jalen",
    "291": "Last one in the AAC before the Mavs hit the road!\n\n@dallasmavs vs @nyknicks\n⏰ 7:00 pm\n📺 Bally Sports Southwest\n📲 Bally Sports App\n#MFFL\n \n@ChoctawCasinos | #StakesRaised https://t.co/JZnCzbu2Y4",
    "292": "It helps that @IQ_GodSon is FINALLY getting some real minutes to prove himself.... #knicks @nyknicks \n\nImmanuel Quickley emerging from slump can have key impact on Knicks https://t.co/XTNCZURxEN via @nypostsports",
    "293": "#OTD 09.03.61: #philadelphiawarriors 135-126 #newyorkknicks \nWilt Chamberlain: 67pts, 31rebs, 27/37 FG, 13/17 FT, 48MP\nWillie Naulls: 41pts, 15rebs, 3ast, 17/30 FG, 7/8 FT\n#wiltchamberlain #willienaulls https://t.co/7XN7sLgPQ5",
    "294": "Good afternoon. Today's match-up r between da \n@nyknicks vs @dallasmavs at 8:30 pm at AAA. Last night was outstanding 4 da @nyknicks, especially after how da #Knicks r, playoff team. #steady #pace #tempo #chemsity #toughness #compete #livelife #27wins #offense #fullcurttraps #77",
    "295": "@nyknicks @MSGNetworks @BetMGM Start Quickley",
    "296": "@macexmets @nyknicks @DKSportsbook Once a Knick ALWAYS A Knick....Frank definitely deserves more respect than that..... He never got the chance..With that being said, Tonight We Beating Dallas ass with or without Frank playing!!! #Knicks4Life",
    "297": "@nyknicks @MSGNetworks @BetMGM Definite loss.  Let’s just play our young core to build towards next season. Wasting time trying to make the play in is dumb. Thibs is dumb",
    "298": "@nyknicks everybody was quiet after last game and there is good reason. We all know 2 wins in a row is a hoax.  We all know a five game losing streak is bout to happen.  Major problems with this roster and coach",
    "299": "@nyknicks listen knicks don’t have a chance of winning tonight.  They are really short handed agaiNst a tough Mavericks team. Mavs are giving 8 points.  So if u want to make some extra cash bet the house against the Knicks.  I did!!",
    "300": "Cam Reddish is not in Dallas with the Knicks. He’s back back in New York getting his shoulder re-evaluated, Tom Thibodeau said. Reddish hurt his shoulder on a bad fall Monday in Sacramento.",
    "301": "@NBA_NewYork @EvanFourmizz @drose Can they just throw the towel in so the Knicks can draft a PG?",
    "302": "My favorite player in the 2018 NBA draft is former Kentucky Wildcat Kevin knox he's the ninth overall pick taken by the new York Knicks and he currently plays for the Atlanta hawks right now cuz of that cam reddish trade https://t.co/i6813DwalO",
    "303": "@macexmets @nyknicks @DKSportsbook Lol Dallas Knicks",
    "304": "The New York Knicks play basketball today. Rejoice accordingly 🙌🏾",
    "305": "@SpoonOfZeke New York Knicks 😔",
    "306": "@PadgettGene @DailyKnicksFS @nyknicks The sweet 16 changes peoples lives so we shall see, it’s an early mock. TyTy has the upside of being a 6+ APG type of guy in my opinion. Even more upside than Quickley as a playmaker.",
    "307": "Did you know... Ernie Vandeweghe ’49 was the University’s first All-America basketball player. After graduation, Vandeweghe played six seasons between 1949 and 1956 with the New York Knicks. https://t.co/r3kwi1Fzjl",
    "308": "@nyknicks @DKSportsbook Just had to call in sick for work today. It’s a very special day, I get to see my king Frank Ntilikina on tv today👑🔥🔥 He will set a career high against the Knicks today with 7 points and 3 assist 😤",
    "309": "@nyknicks @DKSportsbook Show the world who the better 3rd pick is",
    "310": "Tale of the tape 📊\n\n@DKSportsbook | #NewYorkForever",
    "311": "@nyknicks @MSGNetworks @BetMGM Bad day for you boys i’m afraid @ChaunceyGolston @BillOBrienHater",
    "312": "@hhpthebook @KnicksFanTv @CPTheFanchise @nyknicks bring bk ash mannn....",
    "313": "Consensus Line Move:\n2022-03-09 New York Knicks at Dallas Mavericks from 215.00 to 216.00\nOver what did I miss\n#NBA #handicapper #developer #investingtips",
    "314": "Consensus Line Move:\n2022-03-09 New York Knicks at Dallas Mavericks from -8.00 to -9.00\n#MFFL steam engine\n#NBA #sportsgambling #coding #success",
    "315": "@okcthunder vs. @Timberwolves \n@OrlandoMagic vs. @PelicansNBA \n@nyknicks vs. @dallasmavs \n@Raptors vs. @spurs \n@trailblazers vs. @utahjazz \n@nuggets vs. @SacramentoKings \n@WashWizards vs. @LAClippers",
    "316": "@FleelixTrinidad @CPTheFanchise @nyknicks Facts",
    "317": "@purpledinocast The New York Knicks are one.",
    "318": "New York Knicks: Walt Frazier ‘Shocked’ At Being A Rare Two-Time Hall of Famer https://t.co/TutX9y6TKF",
    "319": "@nyknicks can someone message ABurks wife to rant on Twitter today. NY needs 40+ from him tonight with players being injured. Please! 😝",
    "320": "Today's NBA Picks: 8:40 PM ET - New York Knicks vs. Dallas Mavericks - 13 PICKS AVAILABLE: https://t.co/WYvtKpIRVp #nba",
    "321": "Hoy a las 02:30 h. Dallas Mavericks vs New York Knicks.",
    "322": "@hhpthebook @CPTheFanchise @nyknicks heavy who wears the crown",
    "323": "@nyknicks Just had to call in sick for work today. It’s a very special day, I get to see my king Frank Ntilikina on tv today👑🔥🔥 He will set a career high against the Knicks today with 7 points and 3 assist 😤",
    "324": "@hhpthebook @CPTheFanchise @nyknicks Love CP the undisputed voice of Knicks nation in my opinion 💯",
    "325": "Knicks (27 - 38) @ Mavericks (40 - 25)\n🚨Buzzer Moment Watch\n⏰8:30 pm EST\n📱Buzzer⚡️, NBA LP\nSpread: DAL: -8 (@FDSportsbook) \n\nNew York is coming off a 20-point comeback victory over Sacramento thanks to a career-high 46 points from Julius Randle\n\n(Via @NBATV) https://t.co/9zqiwOv4Wq",
    "326": "@nyknicks @MSGNetworks @BetMGM Start IQ over Burks.",
    "327": "@CPTheFanchise has been nothing but a class act. If you don't follow him, please do. We always support ESPN and they have no connection to us. Here we have a homegrown guy that will always make his show, for the @nyknicks fan. Please support this brother. https://t.co/8mRPthIpbK",
    "328": "@nyknicks We love that Julius https://t.co/2wBiNLIQ4n",
    "329": "good morning.  \n\nthe new york knicks are in dallas tonight where they are 3-0 vs. luka.  i’ve been there for two of those losses, the last one being so bad that @bobbykaralla banned me 😂",
    "330": "@nyknicks keep it up ju",
    "331": "@nyknicks Stop promoting him and trade him. He’s not good",
    "332": "@nyknicks Thank you. Now I have clips for my tt",
    "333": "@nyknicks I just want to make the playoffs man",
    "334": "@nyknicks Show me some of this tonight",
    "335": "ICYMI. 46 points. New career-high for No. 30. https://t.co/166Vm80y1m",
    "336": "Game Day!!! Game #66: 🗽New York Knicks (27-38) @ 🐴Dallas Mavericks (40-25): 🏟️American Airlines Center in Dallas, Texas. 📺🏀⛹🏿🎫🤜🤛\n\n#NewYorkForever #MFFL https://t.co/YX9YqaflbE",
    "337": "Revenge Game: Tim Hardaway Jr. plays New York tonight.  He played 254 games in his career for the Knicks.",
    "338": "Revenge Game: Frank Ntilikina plays New York tonight.  He played 178 games in his career for the Knicks.",
    "339": "@DailyKnicksFS @BradDressler24 Not sure I'd take Tyty as the solution to the PG.  Wheeler is the facilitator at UK.  Tyty plays off the ball. @nyknicks don't need another player like that.  I like Nembhard at Gonzaga.  Big PG, 36% from 3pt and 87% FT and 6 ast/gm. Keep an eye on him in the NCAA tourney",
    "340": "Fake news \n\nNew York Knicks rumors: B/R proposes Kemba Walker/Cam Reddish trade for former No. 1 draft pick https://t.co/ZIb0ebWHAF",
    "341": "@ChaMomaYT I played with a New York knicks player",
    "342": "@bridgetDginley @nyknicks Excellent film reference",
    "343": "@jacksettleman @nyknicks @MSGNetworks @BetMGM I’m pretty sure that what they did last time. RJ was primary defender and the rest of the guys did well helping.",
    "344": "@VancouverEye @nyknicks should have won against @Suns if @J30_RANDLE calm down. He scored 25pts",
    "345": "OTD 3/9/1961 Wilt Chamberlain scores 67 points\n\n67 Points\n31 Rebounds\n48 Minutes \n27/37 fg 13/17 ft\n1 of 15 games with 65+ pts\n1 of 135 games with 30/30 double double\n\nNew York Knicks 126\nPhiladelphia Warriors 135\nat Philadelphia Civic Center\n\n#NBA #Warriors #Knicks #NBATwitter",
    "346": "@nyknicks @MSGNetworks @BetMGM We destroyed the mavs when they didn’t have porzingis, I’ve got a good feeling about this game.",
    "347": "NBA Picks March 13: Knicks and Nets Battle for New York Supremacy - NFL Picks | NHL Picks | Hockey Predictions | Winning Sports Picks | MLB Predictions | NBA picks | MLB picks | Soccer PicksNFL Picks | NHL Picks | Hockey Predictions | Winning ...  - https://t.co/VcFq40xX7E https://t.co/RX0tvIlM8u",
    "348": "New post: NBA Picks March 13: Knicks and Nets Battle for New York Supremacy https://t.co/yTjqfATfhR",
    "349": "@nyknicks @MSGNetworks @BetMGM The Pacers are doing some next level tanking. The play in push recommences!",
    "350": "@nyknicks @MSGNetworks @BetMGM Why not double Luka and make literally anyone else beat you. Praying Thibs comes up with a fun defensive game plan tonight.",
    "351": "@nyknicks @MSGNetworks @BetMGM Randle 45 points Quick 22",
    "352": "Can #JackieMoon please buy the @nyknicks ? #DolanOut",
    "353": "@nyknicks @MSGNetworks @BetMGM Quickly droppin 25 rj droppin 40 Randle droppin 30",
    "354": "Back to work.\n\n🏀: vs. Mavericks\n🕣: 8:30 PM ET\n📺: @MSGNetworks | MSG GO\n@BetMGM | #NewYorkForever https://t.co/nSjP7mxNkq",
    "355": "I’ve got Immanuel Quickley fever—and so do the @nyknicks. \n\nLatest for @HeavySan:\n\nhttps://t.co/LFOGCKFM7C",
    "356": "This is dope. And not to mention he has Thibs who knows nothing about basketball anymore as his coach. In spite of the FO screw ups this young dude still rises! @nyknicks https://t.co/ekq56A0950",
    "357": "Toppin’s impact on the Knicks can be seen in his Net Rating, which sits at 6.3 when on the court, which is the best of all New York rotational players with Quickley being next best at 5.2. \n\nWhen the energetic big man sits, the Knicks NetRtg is -5.8, totaling a swing of 12.1.",
    "358": "Knicks rumors: ESPN's latest mock draft has New York picking the Big Ten Player of the Year – NBA News https://t.co/k9RpFLD7vh",
    "359": "Thanks @espn for finally airing a NBA game tonight including the number 1 team in the East the @MiamiHEAT facing an actual good team not named the New York Knicks",
    "360": "I still support the @nyknicks \n            #MyTeam \n            #Knicks",
    "361": "@23savage____ I know you gotta look out for you so I will never be mad which I way you chose to take but I am holding out hope that you extend with the @nyknicks you are a key piece to this team’s success. One love and bless up! #knicks",
    "362": "📅GAME DAY📅\n\n🏀 @LongIslandNets at 11am\n🖥️ @DignitasLoL at 6pm\n🏀 @nyknicks at 8:30pm\n\n#NYC #CatchUsFromTheJump #Digi #NewYorkForever https://t.co/WQxGTCKO7a",
    "363": "@NBA_NewYork The Knicks do not tank they work until the end",
    "364": "【Stock information】NEW YORK KNICKS / CAP / https://t.co/SmFVYQ1GaO",
    "365": "@jasongay @AaronNagler The fun part is, you could insert almost any New York team and position… Knicks Center? Sure!  Mets second baseman? Why not!  Giants GM? It all works!",
    "366": "New York Knicks vs  Dallas Mavericks Prediction 3/9/22 -  Free NBA Picks https://t.co/vR6NbYv4Z6 via @YouTube",
    "367": "@RebeccaHaarlow @nyknicks Wally is the man !!!!",
    "368": "@avlev124 @luka7doncic @nyknicks ohh okok.",
    "369": "NBA Basketball Game Betting Picks Simulator: 8:40 PM ET - New York Knicks vs. Dallas Mavericks - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/0BA9Umz9Ze #nba #sportsbetting #freepicks #cappertek",
    "370": "@avlev124 @luka7doncic you a @nyknicks fan?",
    "371": "@NBA_NewYork @EvanFourmizz @drose I hope it would be interesting cause it seems the Knicks last few gms have had that fight in their eyes to make a run for the play in which would monumental w only 16 gms left w 4 1/2 back.",
    "372": "he is beautiful he plays on the New York  knicks",
    "373": "Wednesday's #NBA75 #BettingPicks from \n@SpreadAstaire\n\n🏀Dallas Mavericks vs. New York Knicks: Banker at -110 (1.91)\n\n+Parlay at +265 (3.65)\n👇👇👇\nhttps://t.co/wLl2wNCBt9",
    "374": "8:30pm ET, Wed, Mar 9\n\nNew York Knicks\nDallas Mavericks\n\n📺: Bally Sports SW-DAL, MSG\n\n#LEGENDoftheMiamiHEAT #NBA75",
    "375": "New York Knicks Small Forward Willie Naulls recorded 41 Points and 15 Rebounds in this game.",
    "376": "On this day in sports history March 9, Philadelphia Warriors Center Wilt Chamberlain recorded 67 Points and 31 Rebounds in a 135-126 win against the New York Knicks in 1961.",
    "377": "New York Knicks: Knicks Morning News (2022.03.09) https://t.co/yrWhyKWPr1",
    "378": "Barcode is a performance-oriented beverage company started by Mubarak Malik, former Head of Performance for the New York Knicks.\n\nMalik last month secured a $2.2M funding round to fuel the next stages of growth for the company.\n\nBack to Deja.",
    "379": "@SilverGreg78 Silver do you like Earthbound or Mother 3 at all? It's not for everybody but the community is faithful. Us Earthbound/Mother fans are almost as faithful as New York Knicks fans.",
    "380": "New York derby day #Knicks vs #Nets, no more need be said!\n#Celtics vs #Mavericks is sure to be a thriller with both teams looking to advance their respective conference standings i before playoffs. Dont miss the #NBA action this Sunday on #espn #azamtvzw #entertainment4everybody https://t.co/YzyxjeIyDT",
    "381": "New York Knicks Basketball Team LED Neon Sign home decor craft display gift fans https://t.co/uB2gEhat1w",
    "382": "New York Knicks LED Neon Sign Light Basketball sports team NBA https://t.co/3Ys8hxdeiA",
    "383": "@FrankieHoxha @23savage____ @nyknicks Why would i care about the game before the one i bet ? 🤣🤣🤣🤣🤣",
    "384": "@_JoeyC_ @RjBarrett6 @WME_Sports @BDA_Sports @nyknicks Cleaaaaan work",
    "385": "IT’S GAME DAY! ##MFFL       \nDallas Mavericks vs New York Knicks\nDallas, TX - 7:30pm CT https://t.co/5LhXKvs3Vp",
    "386": "New York #Knicks vs. Dallas #Mavericks  | 3/9/22  | NBA Free Picks and Predictions | NBA Betting tips.           \n\nWatch: https://t.co/6nH7caLO52\n\n#NBA #NBAPick #NBAPredictions #knicksvsmavs",
    "387": "NEW YORK KNICKS vs\nDALLAS MAVERICKS, 9:30PM.",
    "388": "@IcyEmbeast @BleacherReport I’m just messing with u lol but I mean Ik the lakers, Brooklyn(probably) well actually any of them but I think Philly(no offense), New York knicks and lakers are the worst imo",
    "389": "@nyknicks Gameday! Let's Go!\n\n#NewYorkForever #Knicks #KnicksTape #NBA #NBA75 #NBATwitter",
    "390": "The Mavs look to pay back the Knicks for ending their 6 game win streak back on the 12th of January at @TheGarden \n\nThe @dallasmavs play the @nyknicks at the @AACenter at 7:30PM CT tonight!",
    "391": "@NickHassan10 @410Jelly @Jari2Fly @KOT4Q The New York Knicks have a little bit more cache than a “lottery team “. They can sign a star.",
    "392": "Good morning New York Knicks fans. \n\nSmile! Miles McBride plays basketball today. 🙂 https://t.co/MM1VYmKqwh",
    "393": "The worst team in the East next year... The New York Knicks?",
    "394": "The New York Knicks play basketball tonight 🔥 https://t.co/9HwW8gQ7fE",
    "395": "Today's NBA Picks: 8:40 PM ET - New York Knicks vs. Dallas Mavericks - 1 PICK AVAILABLE: https://t.co/WYvtKpIRVp #nba",
    "396": "@NobbyTrumpet @fnafilms @b3v My personal fave is Winning Time: Reggie Miller vs. the New York Knicks. \n\nGive it a go if you haven’t already watched it already!",
    "397": "@DailyKnicksFS THE NEW YORK KNICKS",
    "398": "New York Knicks vs Sacramento Kings Full Game Highlights | March 7 | 202... https://t.co/3HAiMOGGAr @YouTube",
    "399": "Check out this listing I just added to my #Poshmark closet: New York Knicks Converse Mens High Top Canvas 11 Medium. https://t.co/kvonJ4lHx0 #shopmycloset @poshmarkapp",
    "400": "@NBAHistory @nyknicks being these unis back!",
    "401": "Congratulations to zackhuan who moved up 97 spots to take #63 on the New York Knicks team leaderboard.\n\nhttps://t.co/KTWpkQN2U1",
    "402": "@Farbod_E @ALLAN_HOUSTON @nyknicks @J30_RANDLE This is awesome!",
    "403": "@Batdogduke64 @pencilstatue Earthbound fans are almost as loyal as New York Knicks fans",
    "404": "@NintendoAmerica @EB_Recast Better question is when have I not played Earthbound? Earthbound fans are almost as loyal as New York Knicks fans. That's facts.",
    "405": "New York Knicks: 3 things to watch for as the Mavericks take on the Knicks https://t.co/4kHr76naCA",
    "406": "I wish I could go back and tell teenage me, seeing Rudy at @nyknicks practice at SUNY Purchase in the early 90s, that one day he'd block me on the internet. 😅😅",
    "407": "@IamHagel @nyknicks Thank you so much for this — honored to know you enjoyed that much!",
    "408": "You can’t hide in your office and let your players and coach suffer the slings and arrows while you stay silent. Not in New York, not as president of the Knicks. Leon Rose doesn’t get it. Cowardly.  https://t.co/fENwGs33Aj",
    "409": "@KnicksMSGN @WaltFrazier @nyknicks Clyde show you how to do it",
    "410": "@MRKNOWITALLSPO1 @nyknicks I never have until it just became legal in NY. Got a free $25 deposit and now it’s up to 1.3k. I think I may take the money and run lol",
    "411": "@23savage____ @MiKeBoTz_ @nyknicks Mitch a dawg stop playin with him https://t.co/2ZtmuqF4Ht",
    "412": "God bless the  @nyknicks #KnicksTape #Knicks #NYK https://t.co/xF5Pbo5coD",
    "413": "@MrChuckD @nyknicks yeah.",
    "414": "@MVisuaIs @nyknicks Actually it took a min for RJ and IQ to get up to speed - now with two other scorers Randle  can’t be dble teamed …. he still grinding though …. when DRose comes back they’re going to have a time!!",
    "415": "NBA Basketball Game Betting Picks Simulator: 3/9/2022 8:40 PM ET - New York Knicks vs. Dallas Mavericks - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/0BA9Umz9Ze #nba #sportsbetting #freepicks #cappertek",
    "416": "New York Knicks: New York Knicks:  vs Dallas Mavericks: Live Stream, Score Updates and How to watch NBA Game https://t.co/NWAEnwnMoo",
    "417": "Happy birthday to buck Williams of the Portland Trail Blazers #buckwilliams #buckwilliams52 #charleslinwood #portlandtrailblazers #newjerseynets #newyorkknicks #nbaallstar https://t.co/tYxg32wou3",
    "418": "@nyknicks I would keep both players because they both are only going to get better in stead of chasing old legs at a high price. PGs come a dime a dozen. Go after a big man down low who can score. Mitch is too inconsistent and he hurts the team in scoring.",
    "419": "@nyknicks Trade value.",
    "420": "@KinG_Easy @nyknicks Nope. Camp's a keeper.",
    "421": "The New York Knicks will never win a championship",
    "422": "@chad_patrick1 @nyknicks Na. I never bet. Ya never win in the end. But congrats 👏",
    "423": "@kckorcoran @nyknicks As his agent, Calvin will only accept if it’s a package deal with his dad Tracy “T-Time” Reynolds",
    "424": "@EliteGil The New York Knicks will never win a championship",
    "425": "@William57790761 @Btruetolife @Knicks_SNOB @nyknicks @IQ_GodSon So that makes it okay to assume someone is tense over a simple response? Lol",
    "426": "The Clipper offense looks how it did against the New York Knicks, which is how it looked when they were horrible offensive team and losing games. Gotta make some shots, or get easier looks at the rim. Too much ISO too.",
    "427": "the Knicks should consider giving Calvin Cambridge a 10-day @nyknicks",
    "428": "@MumuAFC23 @nyknicks @RjBarrett6 @IQ_GodSon @J30_RANDLE We gave JB and IQ a pass till they figured it out - now Randle is figuring the best way to win with them ….. the plus is that with two other dependable scorers dble teaming anyone fails, plus the pace of play and good D means the team is a handful…. jus took a min.",
    "429": "@ReavoWRLD @nyknicks From ur tweet to God’s ears!!!!",
    "430": "@nyck37 @NBA_NewYork #51 is undefeated as a Knick Every game he had playing time the Knicks win!",
    "431": "@snkrfrq @nyknicks @KendraRandle_ Was there for the clippers game, same thing. He prolly feels as if every fan is gon troll him or say sutin bad lol smh. We support our own regardless 💯",
    "432": "@EvanRobertsWFAN @NYCMayor The @NYCMayor is a @nyknicks fan",
    "433": "@nyknicks im happy we got him",
    "434": "New York Knicks: Cam Reddish ruled out against Mavericks https://t.co/RhvXpYU0m2",
    "435": "Knicks’ Cam Reddish ruled out against Mavericks with sprained shoulder #NewYork #Knicks #NBA https://t.co/poWOYqOxVC",
    "436": "@nagy_stephen @nyknicks That’s what I’m talking about",
    "437": "@sportyoatlanta @nyknicks Solid day no doubt https://t.co/w1YKcICzrm",
    "438": "@barstoolsports @nyknicks didn’t need him because they got Kevin Knox",
    "439": "U see this @nyknicks https://t.co/R5WCKAwZnU",
    "440": "@Traticaster101 @KnicksFanTv @JDSportsTalkNY I love Duece ! I’ve been hoping he’d get some more burn 🔥 @deucemcb11 @IQ_GodSon @nyknicks",
    "441": "In Nobu with the New York Knicks",
    "442": "The New York Knicks Podcast - A rare winning streak https://t.co/xIbsLkY8or",
    "443": "@KyrieIrving saw @J30_RANDLE dropping 40+ last night and said hold my beer. I hope he gets to 50 and more before it’s over and this is coming from a @nyknicks fan. @RealMichaelKay @alanhahn @gordondamer @Hardestyespn",
    "444": "Going to Dallas to support the @nyknicks tomorrow. Let’s get it 😤 #Knicks",
    "445": "@BrianErisca @Yaaah_Yaaah @nyknicks I don’t need him as much as Brisky do lol.",
    "446": "@NBA_NewYork In 18 years of lottery picks, the Knicks have gotten in the top 3, THREE times.",
    "447": ".#NP: #TheOpenRun, Ep. 66 - The Hope That Kills You feat. @ProfessorDaddyO \n\nhttps://t.co/lP8OXrxPr0\n\n@NYKnicks Or @BrooklynNets, @BrittneyGriner, Best Rap Release Year Ever, Edutainment x More!\n\nTap In.\n\nMove With Minimal Caution.\n#NBA #WNBA #NCAA #FC21CA #GetBusy #DoWork https://t.co/j8DGB85eKR",
    "448": "🚨🚨🚨LESS THAN 48 HOURS REMAINS!!!!🚨🚨🚨\n\nCheck out NEW YORK KNICKS 2020-21/2021-22 Basketball 8 Box Case Break Mixer Immac #NBA https://t.co/4F5CGHtWSW via @eBay",
    "449": "@BrianErisca @Saveoursouls360 @nyknicks Dam mall…. Brisky being a hoe again my bad",
    "450": "New York Knicks: Ex-Knicks Star Tells 2nd Circ. Jury Should Hear Assault Suit https://t.co/1QqIpjmAv7",
    "451": "@Saveoursouls360 @nyknicks I’m done lol you need him 👀👀",
    "452": "Knicks rumors: New York Post report suggests team could land this veteran center https://t.co/DcmpIMSHcF"
}