{
    "0": "Washington Wizards vs Cleveland Cavaliers  LIVE REACTION/Play-By-Play https://t.co/7RB7oca5Vl via @YouTube",
    "1": "@NBAwizardry Those recent Washington Wizards draft picks not progressing as fast as advertised.",
    "2": "Game Thread: Washington Wizards (27-32) at Cleveland Cavaliers (35-24) Feb 26 2022 8:00 PM https://t.co/rjv8pjtFXL",
    "3": "Are there any fans out there with a more tortured combo of favorite sports teams?\n\nWashington Commanders\nWashington Wizards\nOakland A’s\nNew Jersey Devils\nEverton (EPL)",
    "4": "@LamarsGoat8 Washington Wizards and Washington Commanders 👊👊👊\n\nI’m an A’s fan though bc I love misery and the Nationals weren’t a team when I grew up",
    "5": "Cavs win tonight in a close game that no one really expects. I mean Wizards are tired from a double OT game, but I think Cleveland even with Garland out is better than Washington.",
    "6": "Cleveland Cavaliers vs. Washington Wizards gamethread https://t.co/SPkpWj3Dn5 https://t.co/Mkz5Jd7KLp",
    "7": "#Washington #Wizards: This family thought they were ...\n \nhttps://t.co/C4kyFpgqIK\n \n#DC #EasternConference #EasternConferenceSoutheast #EasternConferenceSoutheastDivision #NBAEastern #NBAEasternConference #NBAEasternConferenceSoutheast #NBAEasternConferenceSoutheastDivision https://t.co/Z4hiqP7Tyq",
    "8": "How to watch Washington Wizards vs. Cleveland Cavaliers: The Wizards look to get back to winning ways in Cleveland on Saturday. Here's how to watch. https://t.co/H8Led0kpux #FutureStarr #Shopping #News #Celebrity #Sports https://t.co/ge18CvxRrD",
    "9": "Black Owned DMV: Mahogany Books #Washington #Wizards #NBA Video: https://t.co/hcPQCJBJTc",
    "10": "Only 🏀 play I’ll put out tonight. I love Jarrett Allen OVER boards tonight. 🧠:\n\nWizards coming off an exhausting 2OT game vs. Spurs last night, so tired legs for today. Washington’s leading rebounder is Kyle Kuzma, so Allen should feast. LFG! 🛵💨🛵💨 https://t.co/SpbM22fMtx https://t.co/7bSdg3XQ1u",
    "11": "How to watch Washington Wizards vs. Cleveland Cavaliers https://t.co/1tePDFDPys",
    "12": "@HunterCruse14 @BryceHendrick14 @H00P_Talk @NBATradeGuy @qkhoops @Alley_Oop_Coop @HawksDraftNerd @RocketsfanSid @report_court @tankathon With the 12th pick in the 2022 NBA Draft, the Washington Wizards select Shaedon Sharpe. The dynamic 6’6” Canadian wing is the ‘mystery box’ of the class w/ his lack of playing time but the upside he provides is a rare commodity this late into the lottery and it’s worth a swing on https://t.co/105gy06Ldm",
    "13": "I dislike the Sato signing. \n\nI dislike trading for KP. \n\nI dislike giving Beal a supermax. \n\nA team going nowhere w/ the worst collection of young assets in the league. Your Washington Wizards are hopeless.",
    "14": "Washington Wizards Starters:\n\nRaul Neto\nCorey Kispert\nKentavious Caldwell-Pope\nKyle Kuzma\nDaniel Gafford\n\nPlayers out:\nKristaps Porzingis\nTomas Satoransky\n#DCAboveAll #NBA #NBATwitter #NBA75",
    "15": "@SuspendedTommy @SpecificNY The Washington wizards btw",
    "16": "The most popular spread pick in the NBA tonight is the Cleveland Cavaliers (-7.5) against the Washington Wizards. \n\nThey are taking on 87% of the handle at @DKSportsbook. https://t.co/yMflGosAxG",
    "17": "Thread (1/7)\nLooks like we’re split on the Cavs vs. Wizards game. Coming into tonight the game Washington lost its opening game after the ASG in a 2OT. Kyle Kuzma leads the team I. Scoring with 16.7 ppg. https://t.co/p656cVDOtD",
    "18": "Tonight's starting lineup for the Washington Wizards: Neto, Caldwell-Pope, Kispert, Kuzma, Gafford https://t.co/bVWH4AMCA2",
    "19": "Wizards to honor tallest NBA players ever, former Bullets Bol, Muresan with bobbleheads #Washington #Wizards #NBA https://t.co/lWeWeJPM9u",
    "20": "Washington Wizards Daniel Gafford Rocking Immortal Worldwide.\n#NBA\n#WashingtonWizards https://t.co/IrJPa30fJa",
    "21": "Resultados NBA\nCharlotte Hornets 125-93 Toronto Raptors \nIndiana Pacers 125-129 Oklahoma City Thunder (pro)\nOrlando Magic 119-111 Houston Rockets \nWashington Wizards 153-157 San Antonio Spurs (2ª pro) \nNew York Knicks 100-115 Miami Heat\nMinnesota Timberwolves 102-133 Philadelphia",
    "22": "NCAAB:\nWashington State -4 (-110) v. Washington\n1 U\n \nNCAAB:\nWestern Kentucky v. Middle Tennessee State ML(-125)\n2 U\n \nNHL:\nCanadiens v. Senators ML(-160)\n1 U\n \nNCAAB:\nKansas v. Baylor ML(-160)\n1 U\n \nNBA:\nWizards v. Cleveland -7(-110) \nBuy .5\n1 U\n \nNBA:\nNets +9(-110) v. Bucks\n1 U",
    "23": "@blinkinriley Washington Wizards all time legend Michael Jordan. https://t.co/g6BN2ysgGj",
    "24": "🔴Live ~ Washington Wizards vs. Cleveland Cavaliers - NBA League 2022\n🔗 🔴Watch Live Fullᴴᴰ 👉 : https://t.co/h8KAaGKnTv ✅\n📆 : On Saturday. February 26 /2022\n⏰ : 8:00 PM",
    "25": "We travel up to the Midwest to battle against the Cavaliers. Gametime is 8:00pm. Paul Neto, Kentavious Cadwell Pope, Corey Kispert, Kyle Kuzma,Daniel Gafford. Watch live on NBC sports Washington or with the NBA subscription app. Stream on https://t.co/WrUIteNogV. #Wizards",
    "26": "Free play #1: 1U Jarret Allen O16.5 pts \n\nWashington wizards allow 5th most points to centers. He averages 20 points against the wiz. Last time he played against wizards he racked up 28 pts. Wizards are small and Allen is just too big for them \n\nLike if tailing 💥👲 https://t.co/wprPXTvpmo",
    "27": "@njstags @WorldWideWob When we gonna talk about MJ's tenure with Washington as a bust? At least Bron got Lakers a ring, something MJ couldn't do with the Wizards",
    "28": "I'm a fan of the Washington Wizards and myself.",
    "29": "🏀Chicago Bull - Home winner\n🏀Denver Nuggets -1.5 Winner\n🏀San Antonio Spurs +17.5 Winner\n🏀Washington Wizards +13.5 Winner \n\n5.09 Odd\nMsport - B2VDTLJ\n🤞🤞🤞🤞",
    "30": "@WitMiBBall @casualtakeking I know Russell Westbrook wishes he played back with the Washington Wizards now. 😭😭😭\nNo additional FORMER point guards on the 1st Unit. 3 shooters dedicated to Westbrook’s assist total and a tall Center for lob dunks.",
    "31": "Bets in \n1\n[530] Milwaukee Bucks\nMoney Line -495 for Game\n[524] Miami Heat\nMoney Line -357 for 1st Half\n2\n[523] (San Antonio Spurs)l\n 12½ -105 for the Game\n3\n[530] (Milwaukee Bucks)\n-9 -105 for the Game\n4: \n[525] (Washington Wizards)\nOver 104½ -105 for 1st Half",
    "32": "Russell Westbrook made the Washington Wizards relevant he easily top 3 https://t.co/fwbZgxILgI",
    "33": "The Wizards have listed Kristaps Porzingis as out for tonight's game in Cleveland. The only other player on the conventional roster listed on Washington's injury report is Bradley Beal, so Daniel Gafford should be good to go tonight after he tweaked an ankle last night.",
    "34": "🏀\nWashington Wizards +8 (-110)\n\nThis should be too much points against Cavs without Garland, LeVert and Rondo… they are 4-2 without Garland this season and all of the wins was by 7 points or less. I dont mind they are terrible at covering on the road. Good luck who tails🙏🏼🔥",
    "35": "Every single thing the Washington Wizards do is with the aim to simple “make” the playoffs at any cost. From now. Until infinity.\n\nWhat a disgusting way to grind out profitable mediocracy",
    "36": "Cleveland Cavaliers Predictions and Preview for 2/26/2022 hosts Washington Wizards.  Find out who we are taking in this matchup. #SportsBetting #Basketball https://t.co/SNh515lyqL",
    "37": "IC NBA\n\n4 unit - Cleveland Cavaliers -7.5 over Washington Wizards",
    "38": "Uniforms for Washington Wizards vs Cleveland Cavaliers at 5:00 PM. \n\n#DCAboveAll #LetEmKnow https://t.co/ZWg1ZYhAiR",
    "39": "Looking for a value bet?  See if the Washington Wizards-Cleveland Cavaliers Predictions and Preview for 2/26/2022 is one in our preview.  No crazy hype just a prediction and preview. #SportsBetting #Basketball https://t.co/SNh515lyqL",
    "40": "This evening at 8pm, the Washington Wizards play the Cleveland Cavaliers! Tune in to WLEC starting at 7:30pm to hear pregame. https://t.co/ZQrq5XdOFy",
    "41": "Analyzing Saturday’s Washington Wizards at Cleveland Cavaliers odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/exHRXObiGD",
    "42": "Napier, 30, has played for six NBA teams, including the Washington Wizards last season.",
    "43": "@CurmickeySucks @TheHoopCentral Because he wasn’t provided a role supporting his skill sets. See while Washington has as many wins as the Lakers, the ball moves  with the wizards while the lakers watch LBJ pound the ball, we stand and can’t defend",
    "44": "@therocketplays Washington played 2 ots last night. Cleveland is gonna smoke em... and I'm a wizards fan",
    "45": "Tomas Satoransky reportedly returning to Washington Wizards  https://t.co/hpR2rTfuta",
    "46": "🔴 Live▶ Washington Wizards vs. Cleveland Cavaliers - NBA League 2022\n🔴Watch Here➠ https://t.co/IcRA5rmx90\n📅 : Saturday, February 26, 2022\n⏰ : 8:00 PM",
    "47": "Indian Cowboy\n\n4 - Cleveland Cavaliers -7.5 over Washington Wizards",
    "48": "@tomstakes @RealMamaEagle They are about to miss the play in, man. What a shame that would be. That’s a good team getting edged out by the tanking Washington Wizards",
    "49": "Tomas Satoransky to return to Wizards after agreeing to buyout with Spurs #Washington #Wizards #NBA https://t.co/Y5TYUTOhcH",
    "50": "BRO WHY ARE THE WASHINGTON WIZARDS MORE ACTIVE IN THR BUYOUT MARKET THAN THE CELTICS?!?! https://t.co/kMVERtvt06",
    "51": "@washedwiz Another reactive move. They didn’t have any size at PG so you go out and sign Sato. Even tho it probably means nothing long term….reactive not proactive. The Washington Wizards.",
    "52": "@SliMagik @StarBoyiBz Well one, Kuz isn’t “gone” He’s in Washington and doing fucking great.\n\nTwo, my loyalty followed Kuz. I still watch the Lakers but I make sure to watch the Wizards. There’s no logic in turning to someone else lol\n\nAnd Reeves? Great player. Hella vanilla. Bad hair. 🙅🏻‍♀️",
    "53": "Highlights: Kentavious Caldwell-Pope scores 24 vs Cavaliers - 2/25/22 #Washington #Wizards #NBA Video: https://t.co/VLJyE7S0oy",
    "54": "The Los Angeles Lakers and the Washington Wizards have the same record, 27-32. One team has LeBron James, Anthony Davis, and Russell Westbrook on it, and the other team is led by a guy who dresses like a Dr. Seuss character. Westbrook DOES. NOT. IMPACT. WINNING. https://t.co/B4GHhgX5KI",
    "55": "[Woj] ESPN Sources: The San Antonio Spurs and point guard Tomas Satoransky have agreed to a contract buyout, clearing the way for him to sign a free agent deal with the Washington Wizards. https://t.co/GGt75kt0IL",
    "56": "Tomas Satoransky is re-joining his first NBA team, the Washington Wizards, as a free agent ✍️\n\nHis tenure in San Antonio was extremely short-lived.\n\nhttps://t.co/L9JTXz0Mf3",
    "57": "Tomas Satoransky is returning to the Washington Wizards\nhttps://t.co/gFM8UrWRsp",
    "58": "Source confirms that Tomas Satoransky will return to the Wizards following a buyout with the San Antonio Spurs. (@wojespn 1st).\n\nThe point guard spent his first three NBA seasons in Washington. First the Ish Smith reunion. Now Sato.",
    "59": "I….I don’t understand the Washington Wizards. Perhaps it was folly to think I ever could",
    "60": "🇺🇸 Tomas Satoransky and the Spurs have agreed to a buyout and the Czech PG is expected to sign with the Wizards after he clears waivers, per @wojespn \n\n🇮🇹 Tomas Satoransky divorzia da San Antonio: dovrebbe firmare con Washington una volta diventato free agent (ESPN) \n\n#NBA75",
    "61": "Had a blast at our first @nba game cheering on the @washwizards. Floor seats, double overtime, hot players. 😍🔥🏀 #nba #washingtonwizards #wizardsvsspurs #basketball #capitalonearena @ Capital One Arena https://t.co/XgDA6T2kGb",
    "62": "@gabbgoudy Michael Jordan would lead the wizards to a championship. Washington sports are cursed",
    "63": "@ChaseHughesNBCS @NBCSWashington This explains it! \n\nESPN Sources: The San Antonio Spurs and point guard Tomas Satoransky have agreed to a contract buyout, clearing the way for him to sign a free agent deal with the Washington Wizards.",
    "64": "The San Antonio #Spurs have bought out G Tomas Satoransky and he will sign with the Washington #Wizards. #NBA https://t.co/x89wxt6dft",
    "65": "The Washington Wizards face the Cleveland Cavaliers in Saturday's NBA Basketball Action. Get Trending Rabbit's NBA Basketball Pick and Prediction for this game https://t.co/v25ObCfXCX via @YouTube #NBA #NBAPick #NBAPredictions #NBAOdds #Wizards #DCAboveAll #Cavaliers #BeTheFight",
    "66": "Satoransky returns to the Wizards where he played three seasons through 2018. Washington has minutes to offer Satoransky in their backcourt for the rest of season.",
    "67": "@SkyedOKC @wojespn The San Antonio Spurs and point guard Tomas Satoransky have agreed to a contract buyout, clearing the way for him to sign a free agent deal with the Washington Wizards.",
    "68": "@SkyedOKC @wojespn The San Antonio Spurs and point guard Tomas Satoransky have agreed to a contract buyout, clearing the way for him to sign a free agent deal with the Washington Wizards.",
    "69": "ESPN Sources: The San Antonio Spurs and point guard Tomas Satoransky have agreed to a contract buyout, clearing the way for him to sign a free agent deal with the Washington Wizards.",
    "70": "Today I've got a treat for you! \n\nBet big, win big -- easy as that.\n\nWizards will make some money magic happening tonight!\n\nWashington Wizards ML (+250)\n\n#gamblingtwitter #sportsbetting #freepicks #sportspicks #bettingpicks #sportsbettor #NBAPicks https://t.co/Ufww3A21nT",
    "71": "Washington Wizards vs. Cleveland Cavaliers- 2/26/22 Free Pick &amp; NBA Betting Prediction https://t.co/OjXBiiNQex\n.\n#Betting #FreePicks https://t.co/AKmT3LUTOR",
    "72": "The Cavs will beat the Washington Wizards tonight.",
    "73": "Sistema #NBA75     🏀\n\nWashington Wizards vs Cleveland Cavaliers\n7:10 P.M. \n\nCAVALIERS -7.5\n\nMomio: -110\n\n#LetEmKnow              @cavs \n \n #WASvsCLE \n\n#FreePick https://t.co/WsVCVgLMvY",
    "74": "Cristiano Ronaldo at Manchester United in 2022 kinda reminds me a bit of when Michael Jordan played for the Washington Wizards.\n\nSure, there were moments. But not close to the level of brilliance you were accustomed to seeing during their career.",
    "75": "@hidubiwn @clickthatfollow @RealSkipBayless If it was easy to make the finals ..MJ would have made it every year..not just six time.. what did he do at Washington Wizards tho.. not making the playoff and he was the same age as lebron. But but he had 6 rings ..lol Jordan Jordan invented bringing the tongue out.. that's it",
    "76": "Dejounte Murray, Spurs outlast Wizards 157-153 in double overtime #Washington #Wizards #NBA https://t.co/IS9rNTpX31",
    "77": "NBA Player DD. Date: 02-26 Jarrett Allen\nWashington Wizards vs Cleveland Cavaliers. 0.93%\nDraftKings. Yes @ -130\nKambi. No @ +135\n#arbitrage #bettingtwitter #bettingpicks #sportsbets #freepicks #freemoney #mlb",
    "78": "NBA Player DD. Date: 02-26 Evan Mobley\nWashington Wizards vs Cleveland Cavaliers. 1.87%\nKambi. Yes @ +240\nDraftKings. No @ -220\n#arbitrage #bettingtwitter #bettingpicks #sportsbets #freepicks #freemoney #mlb",
    "79": "With a double-overtime victory over the Washington Wizards. Final 157-153. The San Antonio Spurs advance to 24-36. #SAvsWAS \n\nHC Greg Popovich is now 2 wins away from passing Don Nelson for most wins by a head coach in NBA history! \n\nNelson - 1,335\nPopovich - 1,334* https://t.co/Ok4mfQ536c",
    "80": "DasHaus made a bet!\n\nEvent: Washington Wizards vs Cleveland Cavaliers #NBA\nBet: Cleveland Cavaliers TO WIN -7.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "81": "DasHaus made a bet!\n\nEvent: Washington Wizards vs Cleveland Cavaliers #NBA\nBet: Washington Wizards TO WIN +7.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "82": "Consensus Line Move:\n2022-02-26 Washington Wizards at Cleveland Cavaliers from 207.50 to 204.00\nUnder has books scared\n#NBA #NBATwitter #technology #sharemarket",
    "83": "Gameday!\nCleveland Cavaliers (5º / 35-24)\n\n🆚 Washington Wizards (11º / 27-32)\n🏠 Rocket Mortgage FieldHouse \n📍 Cleveland, Ohio\n⏰ 22:00 (Brasília)\n🖥 NBA League Pass / @nbalinksbrasil\n\n#LetEmKnow https://t.co/jAuQXJJQ3k",
    "84": "🏀 Washington Wizards (@WashWizards) #DCAboveAll\n🆚 Cleveland Cavaliers #LetEmKnow #WASvsCLE\n✈️ N654DL | DAL8945 | B752\n🛫 IAD - 12:11 am ET\n🛬 CLE - 1:01 am ET\n📡 Tracking: https://t.co/MPAatHDtvn https://t.co/yYfaG2PmXd",
    "85": "NBA Viernes 25/2: 1-2 Temporada: 87-78\n\nSan Antonio Spurs vs Washington Wizards O224 (-110) ✅\nToronto Raptors vs Charlotte Hornets O226 (-110) ❌\nPhiladelphia 76ers vs Minnesota Timberwolves U229 (-110) ❌",
    "86": "NBA Basketball Game Betting Picks Simulator: 8:10 PM ET - Washington Wizards vs. Cleveland Cavaliers - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/KAPoGLDg2D #nba #sportsbetting #freepicks #cappertek",
    "87": "Spurs escape Washington with narrow double-overtime win over Wizards https://t.co/TcYxvKHRre",
    "88": "There wasn't a ton of defense played in the Wizards' loss to the Spurs.\n\n@Andrew_Gillis70 on Washington's reaction to giving up 157 points🔽 https://t.co/Ej17sRK75h",
    "89": "@WinsNLosses_ @RealSkipBayless Because MJ went to a Wizards team with zero hall of famers or top 75 players. LeBron playing with 4-6 future hall of gamers a year. 3 top 75 guys of all time. MJ didn't call Kobe and Shaq to join him in Washington",
    "90": "SpeakeasyForSports Discussion\n\nWho: Washington Wizards Assistant General Manager, Brett Greenberg\n\nTopic:Navigating A Career In Basketball\n \nWhere: https://t.co/zSVgaw8cMr\n\nWhen: Sunday, Feb 27 at 7pm EST\n\n#SpeakeasyForSports",
    "91": "#LetEmKnow 8:00 PM Cavaliers vs. Washington Wizards | Get tickets here ➡️https://t.co/tLGAQKKXRM",
    "92": "@TheKidd205 @BBack2021 @AllenSliwa Why do I hear people keep saying this incorrect 40 million ? 😄😄😄 The Washington Wizards found themselves a sucker to take Russell Westbrook's remaining 91 million dollar salary = 44 million dollars this season and 47 million next season.",
    "93": "For the 2nd time this whole NBA season, the Washington Wizards have scored more than 125 points in a game. What does this mean for the DMV area?\n\n50% off a regular priced pizza at Papa John's with WIZ50 #DMV",
    "94": "@luxconduct Bet all on Washington Wizards tonight and get $70 back.",
    "95": "@ChrisBeCappinn Trying to remember for later to see what the second half spread looks like for Cavs/Wizards. Washington might be a bit tired after playing two OTs",
    "96": "Yo that San Antonio spurs and Washington wizards game was lit they literally dropped 310 points combined my man @kylekuzma dropped 36 points but still lost 😞",
    "97": "Over the past 10 games, Lebron is averaging 29.1 points. If he stays on this pace,\n\nHe'll pass Malone in 12 games on Mar 19, 2022 against the Washington Wizards.\n\nHe'll pass Kareem in 63 games which would be around Jan 7, 2023.",
    "98": "Consensus Line Move:\n2022-02-26 Washington Wizards at Cleveland Cavaliers from 209.00 to 207.50\nUnder pouring in\n#NBA #bettingsports #technology #binaryoptions",
    "99": "Washington #Wizards vs. Cleveland #Cavaliers  | 2/26|22 | NBA Free Picks and Predictions | NBA Betting tips.      \n\nWatch: https://t.co/AFLf3vpuyT\n\n#NBA #NBAPick #NBAPredictions #cavsvswizard",
    "100": "San Antonio Spurs spurns Washington Wizards 157-153 Overtime Keldon Johnson 32points 7rebounds 2assists and Dejounte Murray 31points 13rebounds 14assists 3D.",
    "101": "Cleveland Cavaliers - Washington Wizards İddaa Tahmini 27.02.22\nhttps://t.co/iDsv89756G",
    "102": "Highlights: San Antonio Spurs 157, Washington Wizards 153 | 2.25.2022 https://t.co/5OfDoF9zVy @YouTubeより",
    "103": "🏀NBA🏀 #NBA \n🏀Saison régulière🏀\n\nCharlotte Hornets 125-93 Toronto Raptors\nIndiana Pacers 125-129 Oklahoma City Thunder\nOrlando Magic 119-111 Houston Rockets\nWashington Wizards 153-157 San Antonio Spurs\nNew York Knicks 100-115 Miami Heat",
    "104": "WASHINGTON WIZARDS vs\nCLEVELAND CAVALIERS, 9:00PM.",
    "105": "SAN ANTONIO SPURS 157-153\nWASHINGTON WIZARDS, Final/2OT.",
    "106": "Heard little about wild Spurs-Wizards game last night. Washington scores 153 and loses! Jacob Poelti 28 points, 12-15 FG, 11 rebounds, eight assists. Popovich found a good one.",
    "107": "🏀 Today's free pick WAS @ CLE Washington Wizards Total Points Under 101.5\n\nFind more about it on telegram channel: https://t.co/Su9BEO9CKS\n\n#bets #bettingtips #bettingtipster #nbabets #tipster #FreePicks #GamblingTwitter",
    "108": "Washington Wizards gave up 157 points last night 🤣🤣🤣🤣🤣🤣🤣🤣😅😅😅😅 they play no defense",
    "109": "The Night King had 2 rebounds against the Wizards of Washington. Hand of the King Jeff Van Gundy commentated \"night gathers, and now they're watch begins\"",
    "110": "Washington Wizards (27-32, 11th in the Eastern Conference) vs. Cleveland Cavaliers (35-24, fifth in the Eastern Conference) https://t.co/nAghS9Z6hg",
    "111": "#Wizards at Cavaliers preview: Washington faces Cleveland in second game of back-to-back https://t.co/QNnYDiNXAy",
    "112": "Spurs: #Spurs escape Washington with narrow double-overtime win over Wizards - Pounding The Rock https://t.co/6OH035K8gq",
    "113": "Video Producer - Wizards of the Coast Contract/Temporary - Washington State https://t.co/XDNtnf1peF",
    "114": "Washington Wizards 1️⃣5️⃣3️⃣ - 1️⃣5️⃣7️⃣ San Antonio Spurs\n\nObie ekipy postanowiły zrobić małe All Star Game 🏀🔥❗\n\n#NBA75 #NBApl https://t.co/W48MSLH7Gn",
    "115": "San Antonio Spurs: Highlights: San Antonio #Spurs 157, Washington Wizards 153 | 2.25.2022 - YouTube https://t.co/EnetvDBFBE",
    "116": "🏀NBA🏀 #NBA \n🏀Saison régulière🏀\n\nCharlotte Hornets - Toronto Raptors\nIndiana Pacers - Oklahoma City Thunder\nOrlando Magic - Houston Rockets\nWashington Wizards - San Antonio Spurs\nNew York Knicks - Miami Heat",
    "117": "Highlights: Dejounte Murray 31 PTS, 14 AST &amp; 13 REB | San Antonio Spurs vs. Washington Wizards\nhttps://t.co/leF1zFOJ9g\nhttps://t.co/leF1zFOJ9g",
    "118": "Spurs escape Washington with narrow double-overtime win over Wizards https://t.co/Wotrdwcb59",
    "119": "⭐️FREE #livestream here👉https://t.co/2c6Ltz5wlw 😉\n——\n🏀#NBA ‼️\n1.Detroit Pistons Vs Boston Celtics\n2.Atlanta Hawks Vs Toronto Raptors\n3.Cleveland Cavaliers Vs Washington Wizards\n4. Miami Heat Vs San Antonio Spurs\n5.Chicago Bulls Vs Memphis Grizzlies ... https://t.co/Fs4uSJIANs",
    "120": "Video Producer - Wizards of the Coast Contract/Temporary - Washington State https://t.co/GfloEu5m0i",
    "121": "San Antonio Spurs vs Washington Wizards Full Game Highlights | February ... https://t.co/TDguMfuZ8p @YouTube",
    "122": "Highlights: Jakob Poeltl career-high 28 PTS, 11 REB, 8 AST | San Antonio Spurs vs Washington Wizards\nhttps://t.co/CUvXa3Hvcr\nhttps://t.co/CUvXa3Hvcr",
    "123": "San Antonio Spurs vs Washington Wizards - Full Game Highlights | Februar... https://t.co/RWEh3D4JeZ @YouTube",
    "124": "Wizards to celebrate Latinx Heritage Night on March 1 - https://t.co/tuF80EXnMr: The Washington Wizards will celebrate Latinx Heritage Night presented by Verizon on Tuesday, March 1, when the team hosts the Detroit Pistons at ... https://t.co/UT5y9R4uGW",
    "125": "@Russellmania621 @PeteMedhurst I feel much better now about KP😱\n\nCheck out Washington Wizards's video! #TikTok https://t.co/FE3wok6w4L",
    "126": "Keldon Johnson, Dejounte Murray Top Plays vs Washington Wizards! #February252022. https://t.co/AHA9IlflVI",
    "127": "Highlights: Keldon Johnson career-high 32 PTS &amp; 7 REB | San Antonio Spurs vs. Washington Wizards\nhttps://t.co/e16ZfmtYSk\nhttps://t.co/e16ZfmtYSk",
    "128": "The Ringer's Bill Simmons reported Thursday on his podcast that Embiid \"really wanted\" Washington Wizards star Bradley Beal \"and was pushing really hard for it.\"",
    "129": "Spurs escape Washington with narrow double-overtime win over Wizards https://t.co/Kp82pWOr0J",
    "130": "San Antonio Spurs vs Washington Wizards \n\n= \n\n🏀 310 points combinés \n⌚️ 2 prolongations\n2️⃣1️⃣ joueurs utilisés https://t.co/TfstiqOV09",
    "131": "@TeamGaston3 @DCgetaRing You mean the Michael Jordan who came out of retirement and played for the Washington Wizards in 2001?",
    "132": "@coco_002 Who wowed you\nShey na Washington wizards abi Orlando magic",
    "133": "Highlights: San Antonio Spurs 157, Washington Wizards 153 | 2.25.2022\nhttps://t.co/qrxTWJBG6w\nhttps://t.co/qrxTWJBG6w",
    "134": "Dejounte Murray scored 31 points along with 14 assists and 13 rebounds as the San Antonio Spurs beat the Washington Wizards 157-153 (OT) #SSBasketball",
    "135": "@Saulstice @footonh @JakeAndHoops If you wanna talk GOAT twilight years, I’ll give you one air ball if you google “Michael Jordan Washington Wizards”.",
    "136": "Washington Wizards 153:157 San Antonio Spurs 🔥🔥🔥 crazy scores",
    "137": "This loss sums it up lol we have no heart last years Washington wizards team had 10x more heart than this lakers squad and we have multiple champions on this team and veterans but we still can’t find a way win win games. A week long break and we come out the same way we went in.",
    "138": "NBA\n\nFT.\n\nCharlotte Hornets 125 - 93 Toronto Raptors\n\nIndiana pacers 125 - 129 Oklahoma city Thunder\n\nOrlando magic 119 - 111 Houston Rockets\n\nWashington Wizards 153 - 157 San Antonio Spurs\n\nNew York Knicks 100 - 115 Miami Heat\n\n#TheGamePlan",
    "139": "San Antonio Spurs: Spurs escape Washington with narrow double-overtime win over Wizards https://t.co/gjpsQFb0lA",
    "140": "San Antonio Spurs vs Washington Wizards Full Game Replay 2022 Feb 25 NBA Replay HD\nhttps://t.co/5PQRxEquq7 https://t.co/0x31EGaspF",
    "141": "Spurs escape Washington with narrow double-overtime win over Wizards https://t.co/K136UBpcBI",
    "142": "WHAT A GAME 🍿\n\nThe San Antonio Spurs and Washington Wizards scored a combined 310 points as Spurs got the W in 20T! https://t.co/erNECN6iTZ",
    "143": "@washwizardsjp @rui_8mura The Washington Wizards Ace Player Mr. Rui Hachimura Amazing Shoot Skill🇯🇵🇨🇦🇺🇸🇨🇦🇺🇸🇯🇵🇨🇦🇺🇸🏀🏀🏀😉😉😉 https://t.co/GdvqOOK1i8",
    "144": "WASHINGTON (AP) — Dejounte Murray had 31 points, 14 assists and 13 rebounds and the San Antonio Spurs outlasted the Washington Wizards on Friday night in the highest-scoring game in the NBA this season, 157-153 in double overtime. https://t.co/C6Ovnhqz8L",
    "145": "Keldon Johnson and Jakob Poeltl had career-high scoring games, Dejounte Murray produced his 12th triple-double and the San Antonio Spurs needed all of it to beat the host Washington Wizards 157-153 in double overtime. https://t.co/zxsMpb5doS",
    "146": "Encerrado/2OT:\n\nWashington Wizards (27-32) 153 x 157 (24-36) San Antonio Spurs\n\nSAS 📊\nKeldon Johnson: 32PTS/7REB/2AST\nDejounte Murray: 31PTS/13REB/14AST\n\nWAS 📊\nKyle Kuzma: 36PTS/8REB/7AST/2STL/1BLK\nKentavious Caldwell-Pope: 24PTS/1REB/4AST/2STL\n\n#NBA https://t.co/6Lmn3jigQT",
    "147": "In the double-overtime matchup of the Spurs and Wizards, both teams set season highs in scoring but Washington ran out of gas at the end. San Antonio won 157-153.\n\nhttps://t.co/A6AevrzGzA",
    "148": "San Antonio at Washington, Final Score: Spurs outlast Wizards in double overtime thriller, 157-153 https://t.co/Sr1B9uH1rw",
    "149": "Keldon Johnson and Jakob Poeltl had career-high scoring games, Dejounte Murray produced his 12th triple-double and the San Antonio Spurs needed all of it to beat the host Washington Wizards 157-153 in double overtime on Friday. https://t.co/PjuT8NENGp",
    "150": "Wizards vs. Spurs final score: Washington suffers first overtime loss to San Antonio, 157-153 #DCAboveAll https://t.co/if8Y9SPHlE",
    "151": "San Antonio Spurs vs Washington Wizards Full Game Highlights | February 25 | 2022 NBA Season #Washington #Wizards #NBA Video: https://t.co/qK8AY9k7pZ",
    "152": "San Antonio Spurs vs Washington Wizards - Full Game Highlights | February 25, 2022 NBA Season\nhttps://t.co/lFEqo7o272\nhttps://t.co/lFEqo7o272",
    "153": "Wizards vs. Spurs final score: Washington suffers first overtime loss to San Antonio, 157-153 https://t.co/6bm2RxaQtd",
    "154": "You score 153 points and still lose. Washington Wizards for you folks.",
    "155": "GO SPURS GO!🎉\nSan Antonio Spurs outlasted the Washington Wizards 157-153 in double overtime Friday night.🏀\n\nhttps://t.co/7HVeB6q36B",
    "156": "SPURS WIN! Dejounte Murray had 31 points, 14 assists and 13 rebounds and the San Antonio Spurs outlasted the Washington Wizards 157-153 in double overtime Friday night.\nhttps://t.co/AIs8EywYRp",
    "157": "Dejounte Murray had 31 points, 14 assists and 13 rebounds and the San Antonio Spurs outlasted the Washington Wizards on Friday night in the highest-scoring game in the NBA this season. https://t.co/B9KGg53jvj",
    "158": "Dejounte Murray had 31 points, 14 assists and 13 rebounds and the San Antonio Spurs outlasted the Washington Wizards 157-153 in double overtime Friday night. https://t.co/r1lx2oZxn4",
    "159": "Post Game Thread: The San Antonio Spurs defeat The Washington Wizards 157-153 https://t.co/Xuv2a49XNt",
    "160": "Dejounte Murray and Kyle Kuzma put on prolific performances as Spurs beat Wizards 157-153 in overtime!\n\nMurray: 31 PTS, 13 REB, 14 AST (triple double)\nKyle Kuzma: 36 PTS, 8 REB, 7 AST\n\n#kylekuzma #dejountemurray #spurs #washingtonwizards https://t.co/K9fMXoljyy",
    "161": "@HofMcLaurin @BeccaMVP The Washington Wizards basketball franchise is sad 😂 losing to a team Becca said was trash my boy",
    "162": "The #Cavs host Washington tomorrow at home after the Wizards just lost this evening in 2OTs at home.\n\nI know we have injuries but you can't lose tomorrow evening. Washington on a back to back double OT after a long layoff for All-Star break #LetEmKnow",
    "163": "San Antonio @ Washington, Final Score: Spurs outlast Wizards in double overtime thriller, 157-153 https://t.co/LZ0m8gcwRY",
    "164": "Orlando Magic 119 (Wendell Carter 24 pts, 12 rebs) Houston Rockets 111 (Christian Wood 21 pts, 11 rebs), Washington Wizards 153 (Kyle Kuzma 36 pts) San Antonio Spurs 157 (DeJounte Murray 31 pts, 14 asists, 13 rebs, Keldon Johnson 32 pts)",
    "165": "San Antonio at Washington, Final Score: Spurs outlast Wizards in double overtime thriller, 157-153 https://t.co/OB1Qoq8NC7",
    "166": "ENCERRADO/2OT: O San Antonio Spurs (24-36), fora de casa, venceu o Washington Wizards (27-32) por 157 a 153. #PorVida\n\nMURRAY: 31PTS, 13REB &amp; 14AST.\nJOHNSON: 32PTS (career-high), 7REB &amp; 2AST.\n\nKUZMA: 36PTS, 8REB &amp; 7AST.\nRaulzinho: 22pts, 4reb &amp; 9ast.\n\n#NBA75 https://t.co/djiGoyXDEI",
    "167": "🤖 #SofiAlert \n📅 25-02-2022 \nSan Antonio Spurs - Washington Wizards \n🛋 4.4/5 Sofis https://t.co/DxsG1PdAhK",
    "168": "OVERTIME ALERT: NBA - Washington and San Antonio are tied up at 150 going to Double Overtime at Capital One Arena #TieGameAlert #Overtime #NBA #DCAboveAll #Wizards #GoSpursGo #Spurs",
    "169": "What a missed opportunity by the Wizards after losing to the Spurs 157-153 in double OT \n\nThis is Washington’s first OT loss of the season \n\nDejounte Murray 31 pts 13 reb 14 ast, Keldon Johnson 32 pts, and Jakob Poeltl 28 pts 11 reb 8 ast \n\nKyle Kuzma 36 pts 8 reb 7 ast",
    "170": "SPURS WIN!\n\nA equipe de San Antonio bateu o Washington Wizards por 157 a 153.\n\nMurray: 31PTS/13REB/14AST\nKeldon Johnson: 32PTS/7REB\nPoeltl: 28PTS/11REB/8AST\n\nKuzma: 36PTS/8REB/7AST\nCaldwell-Pope: 24PTS\nRaul Neto: 22PTS/9AST\n\n📷 Rob Carr\n\n#PorVida #NBA75 https://t.co/M1Om8ds6G4",
    "171": "Ish Smith - Washington Wizards\n10 PTS\n3 RBD\n5 AST\n1 STL\n4 TO\n[FD(20.1) DK(21.25)]",
    "172": "Raul Neto - Washington Wizards\n22 PTS\n4 RBD\n9 AST\n1 STL\n1 TO\n[FD(42.3) DK(44)]",
    "173": "Daniel Gafford - Washington Wizards\n17 PTS\n6 RBD\n3 AST\n1 BK\n1 TO\n[FD(30.7) DK(30.5)]",
    "174": "Kyle Kuzma - Washington Wizards\n36 PTS\n8 RBD\n7 AST\n1 BK\n2 STL\n1 TO\n[FD(64.1) DK(63.5)]",
    "175": "Kentavious Caldwell-Pope - Washington Wizards\n24 PTS\n1 RBD\n4 AST\n2 STL\n1 TO\n[FD(36.2) DK(36.75)]",
    "176": "Hogs great &amp; Wizards C Daniel Gafford @Dan_G33 started &amp; had 17 pts (8-9 FGs &amp; 1-2 FTs), 6 rbs, 3 asts, 1 blk in 29 mins in Washington's 157-153 home loss in 2OT against the San Antonio Spurs on Friday ... https://t.co/mNXI6erRwj",
    "177": "Any wizards loss is a hawks win , praying for Washingtons downfall🙏",
    "178": "🏀 Final Score 🏀\nSan Antonio Spurs 157 - 153 Washington Wizards\n\nDejounte Murray 70.3 DK, 61.6 FD\nKyle Kuzma 63.5 DK, 64.1 FD\nJakob Poeltl 58.8 DK, 58.2 FD\n\nhttps://t.co/IIuYCTQkL5",
    "179": "San Antonio Spurs 157 Washington Wizards 153 (final/2ot) - #Wizards #NBA",
    "180": "Dejounte Murray records his 17th career triple-double (31 PTS, 13 REB, 14 AST) as the Spurs take down the Wizards 157-153 in 2OT.\n\nJakob Poeltl also had a big night for the Spurs with 28 PTS, 11 REB, 8 AST.\n\nKyle Kuzma continues to impress in Washington with 36 PTS, 8 REB, 7 AST.",
    "181": "Being a Washington Wizards fan can be stressful at times. I wouldn’t wish this type of pain on anyone. #SoWizards #DCAboveAll",
    "182": "The Washington Wizards will forever be poverty",
    "183": "Took two OTs, but per @Stathead, San Antonio-Washington is the first NBA game where both teams hit 150 points since the Wizards and Houston in October 2019 and just the 17th in NBA history: https://t.co/35Q1KU4LDx",
    "184": "Daniel Gafford of the Washington Wizards is one big clumsy monkey",
    "185": "Washington Wizards indeed they magically hitting the weirdest shit today lmao",
    "186": "WHAT A GAME! THE WASHINGTON WIZARDS HAVE 150 points. 🚨",
    "187": "@Wizards_Forever Respect the tank lol. We need TyTy Washington",
    "188": "🚨#BuzzerMoment\n\nDOUBLE OT in Washington!! The Spurs and Wizards trade baskets in OT as both squads are tied at 145. Kyle Kuzma (36 points) is on pace to record a career high in scoring. \n\nWatch the finish live on Buzzer ⚡️\n\nhttps://t.co/VesceV7ceU",
    "189": "It'll be double overtime in Washington, with the Wizards and Spurs knotted at 145-145.",
    "190": "Spurs: How to Watch San Antonio #Spurs vs. Washington Wizards Game Live Online on February 25, 2022 https://t.co/VGMuWJ5Iii",
    "191": "Do the Washington Wizards have the worst uniforms in the nba? Yes. The answer is yes",
    "192": "Washington Wizards Basketball &amp; Shuki Shabbat 🤝🤝",
    "193": "Congratulations to joeswam (@joeswam) who moved up 2 spots to take #23 on the Washington Wizards team leaderboard.\n\nhttps://t.co/yEBg4vL1Td",
    "194": "The Wizards and Spurs will go to overtime with the score tied 130-130. Kyle Kuzma has 34 points, 7 rebounds and 7 assists. Dejounte Murray has 24 points, 11 rebounds and 11 assists. Washington has tied a season high with 34 assists.",
    "195": "THE MOTHER F****** WASHINGTON WIZARDS BABY",
    "196": "Wiz get the stop. Timeout Washington. Wiz down 130-128 with 24 seconds left #TheFocusTV #NBA #Wizards #DCAboveAll",
    "197": "@Ericb1980 Washington and they’re called the wizards. What’d you expect? Ugh. 🙄🤦🏻‍♂️",
    "198": "Poeltl misses both FT's. Gaff scores inside. Washington down 126-120 #TheFocusTV #NBA #Wizards #DCAboveAll",
    "199": "Hack a Poeltl going on by Washington. He shoots 46% on the season #TheFocusTV #NBA #Wizards #DCAboveAll",
    "200": "Washington Wizards Over 225 -110 [1]💰 https://t.co/qY9WsfDRk0",
    "201": "Ish Smith jumper makes it a 3 point deficit for Washington, They trail 107-104 early in the 4th #TheFocusTV #NBA #Wizards #DCAboveAll",
    "202": "the Washington wizards aesthetic is awful. They need more frank frazetta style fantasy imagery",
    "203": "Thomas Bryant cleans up Neto's miss and dunks it home. Bates-Drop responds. 94-93 Washington #TheFocusTV #NBA #Wizards #DCAboveAll",
    "204": "it’s crazy to me that the washington wizards logo is just a basketball",
    "205": "Michael Jordan Authentic Washington Wizards Nike Jersey Sewn Size 56 3XL XXL A1 https://t.co/yxyb18nkRS eBay https://t.co/RbNPJx0MSV",
    "206": "Good adjustment from Washington. They're trapping Murray hard when he comes off the screen and he's a bit rattled now. All 3 of his turnovers have come here in the 3rd. Wiz back on top 92-91 #TheFocusTV #NBA #Wizards #DCAboveAll",
    "207": "Neto 3 makes it a one point game for Washington, 91-90 #TheFocusTV #NBA #Wizards #DCAboveAll",
    "208": "Washington Wizards vs San Antonio Spurs\nWatch Live streaming:\nhttps://t.co/bIYTy32eDb",
    "209": "Washington Wizards vs San Antonio Spurs\nWatch Live streaming:\nhttps://t.co/bIYTy32eDb https://t.co/fgg5lP8MJn",
    "210": "Kuz with a fadeaway from 20. Raul Neto comes back and scores. Seven point deficit for Washington, 88-81. 8:27 left in the third #TheFocusTV #NBA #Wizards #DCAboveAll",
    "211": "The Washington Wizards are comprised of a lot of players you know the names of, but are also like “why are all these people on the same roster?”",
    "212": "Devin Vassell 3-point play makes it a 7 point deficit for Washington, 78-71   #TheFocusTV #NBA #Wizards #DCAboveAll",
    "213": "Washington Wizards vs San Antonio Spurs Live Streaming \n\n#NBA\n\nhttps://t.co/cc0nBaEOmE",
    "214": "@john_wall_ontop @WashWizards @CapitalOne TyTy Washington gon look great in a wizards jersey",
    "215": "🍿Popcorn's Pick (Live bet )\n\n(#NBA)\nWashington Wizards Vs San Antonio Spurs\nUnder 256.5@1.86\n\n*2 Units*\n\n#GamblingTwitter https://t.co/8D3jbn84uF",
    "216": "The Wizards trail the Spurs 75-71 at halftime. Washington had 20 assists in the first half. Their top-assist game this season is 34, accomplished twice."
}