{
    "0": "Denver Nuggets vs Los Angeles Lakers\nLos Angeles Lakers vs Denver Nuggets\nLIVE: https://t.co/N2y3r5Phgp\n((LIVE NOW)) Los Angeles Lakers Vs Denver Nuggets - 4/10/2022 https://t.co/uMBw7LEhkm",
    "1": "Check out 2004-05 Bowman - Chrome #23 LeBron James Los Angeles Lakers Graded PSA 9!!!!!!! https://t.co/byBnsIruuo @eBay",
    "2": "Should the Los Angeles Lakers trade Anthony Davis in the offseason?",
    "3": "https://t.co/brsNamHkvr Los Angeles Lakers Lanyard Yellow #LosAngelesLakers #LA #LosAngeles #Lakers https://t.co/o3QGSmGzkH",
    "4": "Denver Nuggets vs Los Angeles Lakers\nLos Angeles Lakers vs Denver Nuggets\nLIVE: https://t.co/F4npH5ltL6\n((LIVE NOW)) Los Angeles Lakers Vs Denver Nuggets - 4/10/2022 https://t.co/DJifiZJRkP",
    "5": "Young fellas taking the opening shift.  \n\n#SuitingUpTogether | @ToyotaSoCal https://t.co/j0Zx45a2hr",
    "6": "Denver Nuggets - Los Angeles Lakers\n\nBet slip link: https://t.co/8WQB4xbhUY https://t.co/15GZU0IbJ8",
    "7": "Los Angeles 2022 \nOnly in LA a fully dyed pikachu pup\nKids loved the Lakers game and had a ball in Little Tokyo #springbreak #thegroveLA #Lakers vs Nuggets #littletokyola https://t.co/e4EMN2z0xn",
    "8": "Return of the Mac\n\n#LakeShow x @DWS_Group https://t.co/qtfX8Ygp5J",
    "9": "Uniforms for Los Angeles Lakers vs Denver Nuggets at 6:30 PM. \n\n#LakeShow #MileHighBasketball https://t.co/MC3qLiX9NM",
    "10": "@mevvybear Or the Los Angeles Lakers are world champions",
    "11": "Denver Nuggets (-6) vs. Los Angeles Lakers! #MileHighBasketball #LakeShow #NBA #NBATwitter #NBA75",
    "12": "Los Angeles Lakers Starters:\n\nTalen Horton-Tucker\nMalik Monk\nAustin Reaves\nStanley Johnson\nWenyen Gabriel\n\nPlayers out:\nCarmelo Anthony\nAnthony Davis\nDwight Howard\nRussell Westbrook\n#LakeShow #NBA #NBATwitter #NBA75",
    "13": "Thank you for the championship, Rob and Frank! Forever grateful for that. However, it is time to move on. I would like to officially announce that starting tomorrow, I am taking the job as the GM and head coach of the Los Angeles Lakers 🙏 #LakeShow see y’all on 2K!",
    "14": "Los Angeles Lakers Starting Lineup 4/10\n PG: Talen Horton-Tucker\n SG: Malik Monk\n SF: Austin Reaves\n PF: Stanley Johnson\n C: Wenyen Gabriel\nhttps://t.co/o75oZ8vnE8",
    "15": "Welcome to Watches of the Week, where we'll track the rarest, wildest, and most covetable watches spotted on celebrities.Well, it’s not the season LeBron James and his Los Angeles Lakers hoped for. But!  # # # # # #\n\nhttps://t.co/kneEyWvnvh https://t.co/7Ovim4bOrP",
    "16": "Finishing up our weekend of sports. (@ Ball Arena for Denver Nuggets vs Los Angeles Lakers in Denver, CO) https://t.co/RscJxh38pk https://t.co/NU9h6TZUz1",
    "17": "[LIVE] USA NBA Basketball Denver Nuggets vs Los Angeles Lakers | Watch Live Stream &amp; On Demand 👉 ▶️ : https://t.co/ZTZuq6Rpzv | 10-Apr-22 | 9:30 PM | USA | NBA | Basketball | Basketball | Denver Nuggets | Los Angeles Lakers https://t.co/M6Ba5H15X2",
    "18": "Game 82 https://t.co/X9ohLN4ZO8",
    "19": "A HOUSE DIVIDED \nLos Angeles Lakers / Chicago House AC https://t.co/ZeD2UHzFBh",
    "20": "#Basketball\n#Nba (Usa)\nDenver Nuggets - Los Angeles Lakers\n#888sport\ninfo: https://t.co/hU5mZWElF0 https://t.co/SlIHOMeeB7",
    "21": "i want a banner for this at staples \"2021-22 los angeles lakers averaged a new starting lineup every two games\" https://t.co/UxYq72EFsP",
    "22": "@ejt___ They were Originally a Vancouver team so “Grizzlies” made more Sense.\n\nThe Los Angeles “Lakers” 🙄\n\nThe Utah “Jazz”😂\n\n...etc...",
    "23": "Closing the season on a Sunday. \n\n#LakeShow x @bibigoUSA https://t.co/yJdQHKpbw5",
    "24": "Frank Vogel says LeBron James did not make the final trip of the Lakers season because he had an MRI on his left ankle scheduled in Los Angeles. When asked if the team had the results of the MRI available, a team spokesperson said, “No.”",
    "25": "🚨 Line Change 🚨\n\nLos Angeles Lakers @ Denver Nuggets\nSun 9:40 PM EST\n\nFrom:\nDEN -10.0 -110\n\nTo:\nDEN -6.0 -110",
    "26": "@dolfanshow Miami Dolphins\nHamilton Tiger-Cats(CFL)\nBuffalo Sabres\nToronto Raptors\nToronto Blue Jays\nLos Angeles Lakers (80's Showtime era)",
    "27": "Check out 2019-20 MOSAIC #8 LeBRON JAMES PSA 9 LOS ANGELES LAKERS  https://t.co/kb25lfOOwx via @eBay",
    "28": "@TheNBACentral @SeanDeveney Why would anybody want to coach that train wreck of a team that is the Los Angeles Lakers.",
    "29": "MAJESTIC NBA Los Angeles Lakers Kobe Bryant Jersey Youth Size L Black RARE EUC - https://t.co/6VlEgTE6S1\n\n#lebron #lebronjames #lakers #nba \nhttps://t.co/DTN6M3238b",
    "30": "Los Angeles Lakers Could Trade Russell Westbrook For Buddy Hield And Malcolm Brogdon, Suggests NBA Analyst https://t.co/vO2xfIMBHO",
    "31": "@Qubanga @aidan__mcmurry @CarmichaelDave @LAClippers I have a few Lakers shirts I got for free from volunteering at the Los Angeles Regional Food Bank just from wearing my Clippers swag. I’ve never made a big deal about having to wear their shirts at their own events. It is what it is.",
    "32": "GAMEDAY!📍\n-\nThe Los Angeles Lakers take on the Denver Nuggets tonight at 6:30 PM PST inside of the Ball Arena. 💜💛\n-\nWho do you think will win this game tonight? 🤔 \n- \n📸: ( @adampantozzi &amp; @gwephoto) \n- \nFollow @lalakersquad for more! 🔥 https://t.co/kv60mJBQGl",
    "33": "“I’m the point guard. Give me that s—. Everybody get out the way.”\n\n\"What happened?” one late-season opponent wondered. “They stink.”\n\n@DanWoikeSports and @BA_Turner talked to 20 coaches, players, scouts &amp; execs to examine what sunk the Lakers’ season. \n\nhttps://t.co/5JmzjFqeIA",
    "34": "Check out 2019-20 MOSAIC PURPLE PRIZM #196 RAJON RONDO 9/49 PSA 10 LOS ANGELES LAKERS  https://t.co/rBLOQqHLFp via @eBay",
    "35": "LeBron James is not with the Lakers at tonight’s game in Denver, the team said.\nJames had a medical appointment in Los Angeles with team physician Dr. Kris Jones yesterday regarding his left sprained ankle and was excused by the Lakers.\n#LakeShow\n#LakersNation",
    "36": "NBA Basketball Game Betting Picks Simulator: 9:30 PM ET - Los Angeles Lakers vs. Denver Nuggets - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/eF1nlcolvs #nba #sportsbetting #freepicks #cappertek",
    "37": "LeBron James is not with the Lakers at tonight’s game in Denver, the team said.\nJames had a medical appointment in Los Angeles with team physician Dr. Kris Jones yesterday regarding his left sprained ankle and was excused by the Lakers.",
    "38": "https://t.co/DwPoFewtQR Los Angeles Lakers Grill Cover Economy #LosAngelesLakers #LA #LosAngeles #Lakers https://t.co/BLI4NTWQgj",
    "39": "By @ramonashelburne  RT   Why this Los Angeles Lakers season was doomed from their first team outing in October https://t.co/syXD2CxbjZ",
    "40": "there has to be a 30/30 on the 2022 Los Angeles Lakers",
    "41": "@wandxrs Shot clock at 7, Westbrook 2 defenders on him. Pass To Anthony Davis. AD throws it back up top to LeBron! LeBron puts up the three, OH IT’S GOOD!!! LEBRON JAMES FROM DOWNTOWN!!  THE LOS ANGELES LAKERS ARE YOUR 2022 CANCUN CHAMPIONS!!!",
    "42": "@sportingroars @LakerFanSince73 @Legodrules @shendy456 @TrolledByJimmy @ShamsCharania Dude, I’d seriously consider taking this back. Unc has run the streets of LA since at LEAST the 70’s. You’re talking to one of the most respected lakers and Los Angeles residents of all time. He was voted top 10 on both these lists",
    "43": "Denver Nuggets Predictions and Preview for 4/10/2022 hosts Los Angeles Lakers.  Find out who we are taking in this matchup. #Sportsbook #NBATwitter https://t.co/lUbavoB9KQ",
    "44": "Delve into the glitz and glamour of the rise of 1980s Los Angeles Lakers, Dr. Jerry Buss and Magic Johnson. Now streaming on HBO Max, the next episode airs tonight at 9:00 PM EST! \n\n#balancenow #balance #winningtime #hbo #original #magicjohnson #losangeles #lakers #diversity https://t.co/Kzi1YOKaov",
    "45": "Looking for a value bet?  See if the Los Angeles Lakers-Denver Nuggets Predictions and Preview for 4/10/2022 is one in our preview.  No crazy hype just a prediction and preview. #Sportsbook #NBATwitter https://t.co/lUbavoB9KQ",
    "46": "14× NBA All-Star Jerry West Signed Los Angeles Lakers Basketball Jersey (JSACOA) https://t.co/eH1ssvB7Tj eBay https://t.co/nKvsXfiSnb",
    "47": "New post (Los Angeles Lakers vs. Denver Nuggets Pick - NBA April 10, 2022) has been published on The Sports Geek - https://t.co/j3vxrO12Og https://t.co/9Yba4ko1AQ",
    "48": "@KingJames It just hit me that the @cavs #cavaliers will be in the playoffs when the @Lakers #losangeleslakers will not be. I think that stat is a 1st time ever in the @NBA #NBA75 @NBAHistory . 💯🏀❤️🌎",
    "49": "Today's NBA Picks: 9:30 PM ET - Los Angeles Lakers vs. Denver Nuggets - 16 PICKS AVAILABLE: https://t.co/Ltxq4OCGrT #nba",
    "50": "Where Do LeBron James and the Los Angeles Lakers Go from Here? | Bleacher Report | Latest News, Videos and Highlights https://t.co/LKACzkKxhR",
    "51": "@DoubleTechTZ1 @NateDuncanNBA I didn't see it that way. They were clearly better than the Lakers, and if you're trying to win fans in Los Angeles what could be more impactful than beating the Lakers in the playoffs?",
    "52": "Longest NBA playoff streaks of all-time\n\n22- Philadelphia 76ers\n22- San Antonio Spurs\n21- Portland Trailblazers\n20- Utah Jazz\n19- Boston Celtics\n17- Los Angeles Lakers\n16- Minneapolis/Los Angeles Lakers",
    "53": "Less than eighteen months ago, the Los Angeles Lakers won their 17th NBA championship in the bubble by surrounding superstars LeBron James and Anthony Davis with a roster with great length and size at every position.\nhttps://t.co/v2WrlYjDkm",
    "54": "1996 STADIUM CLUB #R12 KOBE BRYANT ROOKIE CARD RC LOS ANGELES LAKERS - https://t.co/KB9WI2IIeE\n\n#lebron #lebronjames #lakers #nba \nhttps://t.co/T8x8nv7gnM",
    "55": "#LA #Lakers #LeBron James #LeGoat is the Los Fallen Angeles #Fakers LeChina Blames phony #GOAT𓃵. FLEX on these #bandwagon #LakeShow fans aka #LeBum jockstrap sniffers who would sniff it if he talks to them. \nThese shirts are flying fast \n$20 free ship\n https://t.co/mTN9PM86Jr",
    "56": "Final time of 2022.\n\n⏰: 6:30 p.m. PT\n📺: @SpectrumSN \n📻: ESPN LA 710 &amp; 1330 KWKW\n\n#LakeShow x @SociosUSA \nhttps://t.co/wdY573wST4",
    "57": "@SagED_UP Any Los Angeles team too. Rams, Chargers, Dodgers, Lakers, Clippers, Angels, Kings, Ducks, Trojans, and Bruins. NorCal forever. Goodbye!!",
    "58": "@cobey3 @aidan__mcmurry @Qubanga @CarmichaelDave @LAClippers Nope. It was the ownership of the Los Angeles Kings that built the arena for hockey. It’s the House That Wayne Gretzky Built.\n\nThey adapt it for basketball for when the Clippers and Lakers play.",
    "59": "@LukaUpdates Los Angeles has to be co stantly talked about so he'd be super popular. All my childcare kids would have 77 Lakers tshirts instead of LeBron and I wouldn't have to explain who he is to any of them😕🙄",
    "60": "The 32-49 Los Angeles Lakers will face the Denver Nuggets in their last regular-season game of the season. #LALvsDEN https://t.co/HZVhsSpu5E",
    "61": "@seejoshgo @DEADLINE @MAXBORENSTEIN @jovanbuha @Lakers @TheAthletic When I first moved to Los Angeles, I was barely 20 and I worked at a private disco in Beverly Hills. Dr.Buss was there a lot as were LA Lakers",
    "62": "@NBALatam Los Angeles Lakers 😪😪😭",
    "63": "Andy Vermaut shares:John C. Reilly Says ‘Winning Time’ Celebrates Lakers Owner Jerry Buss’ Leadership In Integration – Contenders TV: John C. Reilly plays Los Angeles Lakers owner Jerry Buss in the HBO series Winning Time: The Rise of the… https://t.co/OFFtFUM7CA Thankyou. https://t.co/fGtlGeeAhU",
    "64": "https://t.co/wwXzA5vTAb Los Angeles Lakers Can Cooler Slim Can Design #LosAngelesLakers #LA #LosAngeles #Lakers https://t.co/7UwRjTwEN4",
    "65": "“LeBron James is my guy but nobody was ever scared of him” Shaquille O’Neal believes players are confident in facing the Lakers stars  https://t.co/eNnZq9l8Tz #LosAngelesLakers #NBA",
    "66": "Los Angeles Lakers 75th Anniversary Diamond 🏀 NBA\nLebron James - Anthony Davis - Carmelo Anthony - Westbrook https://t.co/BXxlveR9hZ",
    "67": "The Los Angeles Lakers. https://t.co/yBJ666spMf",
    "68": "Top story: Big Fail: Inside Lakers' most disappointing season in history - Los Angeles Times https://t.co/hVxzUD6mSN, see more https://t.co/nMJjubafwW",
    "69": "Top story: Big Fail: Inside Lakers' most disappointing season in history - Los Angeles Times https://t.co/4rgHY3RfIC, see more https://t.co/cLQDEVJxaz",
    "70": "Top story: Big Fail: Inside Lakers' most disappointing season in history - Los Angeles Times https://t.co/aV5wNZvUNv, see more https://t.co/nDAorQ4HOg",
    "71": "Top story: Big Fail: Inside Lakers' most disappointing season in history - Los Angeles Times https://t.co/SdhcArr1vT, see more https://t.co/EKKTyvCoHH",
    "72": "This is what Los Angeles Lakers reporters tweets are tweeting about right now Hmm.Rumor floating that Juwann Howard being considered? One caveat is that Rajon Rondo be part of a package? I like the idea.",
    "73": "@aidan__mcmurry @Qubanga @CarmichaelDave @LAClippers The Lakers pay rent to the owner of the Los Angeles Kings hockey team to play there until 2041. They can’t afford their own arena like the Clippers. Casual NBA fans like @Qubanga wouldn’t know, @aidan__mcmurry. https://t.co/VX4Hlw966O",
    "74": "@kelwright The Los Angeles Lakers",
    "75": "@Como_te_llamaz @TheNBACentral @SeanDeveney @SteveBHoop Ofc, they are the Los Angeles Lakers",
    "76": "Los Angeles Lakers Players Were Reportedly Texting During Games Even With Frank Vogel Standing In Front of Them – NBA News https://t.co/1nI5aBkDQS",
    "77": "Los Angeles Lakers Players Were Reportedly Texting During Games Even With Frank Vogel Standing In Front of Them – Lakers News https://t.co/zwphbpTOJm",
    "78": "The Nuggets will take on the Los Angeles Lakers at Ball Arena at 7:30 p.m. Sunday night with their playoff opponent still up in the air. https://t.co/ubWtZlaBmI",
    "79": "Inside the #Lakers’ fall: Problems arose behind closed doors in training camp, team personnel seeing their worst fears realized before the team played a real game. \n\n“Russ never respected Frank from Day 1,” said one person with knowledge of the situation. https://t.co/5JmzjF8Dk0",
    "80": "@VladBilik @RatiodbySteph_ Good thing you said The Lakers and not The Los Angeles LeBrons. I 100% agree with you 🔥💯",
    "81": "DasHaus made a bet!\n\nEvent: Los Angeles Lakers vs Denver Nuggets #NBA\nBet: Denver Nuggets TO WIN -10\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "82": "DasHaus made a bet!\n\nEvent: Los Angeles Lakers vs Denver Nuggets #NBA\nBet: Los Angeles Lakers TO WIN +10\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "83": "Three Things to Know: Lakers at Nuggets - 4/10/22 | Los Angeles Lakers (Los Angeles Lakers)\n\nThe Lakers (32-49) will take the court for the final time this season with a visit to the Mi...\n\nAdd your highlights:\nhttps://t.co/WQ1MQyW3I9\n #LA_Lakers",
    "84": "GAMEDAY.\n\n🏀 LOS ANGELES LAKERS 🆚 Denver Nuggets.\n\n🏟️: Ball Arena.\n\n⏱️ 22:30 (🇦🇷/🇧🇷/🇺🇾)\n⏱️ 21:30 (🇨🇱/🇵🇾/🇧🇴/🇻🇪/ 🇩🇴/🇵🇷)\n⏱️ 20:30 (🇨🇴/🇵🇪/🇪🇨/🇵🇦/🇨🇺)\n⏱️ 19:30 (🇲🇽)\n⏱️ 03:30  (🇪🇸)\n\n📺: Star+.\n💻/📱 NBA League Pass. https://t.co/T6u7Lj3RKD",
    "85": "NBA Los Angeles Lakers Reversible Full Snap Fleece Jacket JHD 2 Front Logos https://t.co/OcZ1NWNLNU eBay https://t.co/JWtMP1LJCA",
    "86": "@TheReturn84 @BillfromBoynton I wasnt a jordan fan when he played as a Lakers fan from LOS ANGELES, he was our rival , i do appreciate his greatness to the game Now tho.",
    "87": "Watching #WinningTimeHBO? \n\nCheck out our companion podcast, \"Binge Sesh,\" where we give you a behind-the-scenes look at the real-life Lakers stories that inspired the show. https://t.co/1DjgWBF38x",
    "88": "5 offseason moves the Los Angeles Lakers need to make (via @hwalterwarner)\nhttps://t.co/RWjubceGqr",
    "89": "😂 $25-Million Palimony Suit Filed Against Lakers' Owner Jerry Buss - Los Angeles Times https://t.co/1hvinTgXis",
    "90": "HOY JUEGA DENVER ⚒️\n\nvs Los Angeles Lakers. \n\n⏰ 22:30 hs (ARG)\n🏟️ Ball Arena\n📺 STAR+ \n\n🚑 Jamal y Porter OUT.\n\n🚨 \n\nJokic CUESTIONABLE\nBarton CUESTIONABLE\nGordon CUESTIONABLE\nMorris CUESTIONABLE \nNnaji CUESTIONABLE\nCancar CUESTIONABLE https://t.co/ih9uKwKQbI",
    "91": "Los Angeles Lakers Could Trade Russell Westbrook For Buddy Hield And Malcolm Brogdon, Suggests NBA Analyst #LakeShow #GoldBlooded #NBATwitter \n\nRead more - https://t.co/NFtrR9YG3r https://t.co/78vdZijnAR",
    "92": "Hello Twitter People.  What are most people interested in?  The Los Angeles Lakers, the tension between The Ukraine &amp; Russia, Tiger Woods making a comeback, the New Orleans Pelicans making the playoffs &amp; maybe winning the 2022 NBA Championship, high prices of gas, food, &amp; everyth",
    "93": "The Los Angeles Lakers and Lebron James always get a lot of sports media attention.  The sports analysts love Lebron James because he is a good person.  So far, Lebron James has never tried to defend himself against negative news stories that are posted about him. NBA; ESPN;",
    "94": "@musicmovieshoop Mine? It was when the New Orleans pelicans swept the Los Angeles Lakers. And sent them boys season too hell annnnnd got their top 10 unprotected pick. Annnnnnnnd made the play in tournament after starting 0-13.",
    "95": "@HausersW0RLD @TheNBACentral @SeanDeveney @SteveBHoop Shot clock at 7, Westbrook 2 defenders on him. Pass To Anthony Davis. AD throws it back up top to LeBron! LeBron puts up the three, OH IT’S GOOD!!! LEBRON JAMES FROM DOWNTOWN!!  THE LOS ANGELES LAKERS CUT THEIR LEAD FROM 28 TO 25!!!!!!!!!!!!!",
    "96": "Los Angeles Lakers Expected To Ask About Nick Nurse In The Offseason – NBA News https://t.co/UwTp4iCuFO",
    "97": "Los Angeles Lakers Expected To Ask About Nick Nurse In The Offseason – https://t.co/rttwidInmk",
    "98": "Los Angeles Lakers Expected To Ask About Nick Nurse In The Offseason – Lakers News https://t.co/mxoviNUQZU",
    "99": "ICYMI: We break down the Los Angeles Lakers' offseason ✍🏼\n\n👀 What to do with Russell Westbrook \n🤝 LeBron James' extension \n📝 Filling out the rest of the roster\n💰 Salary situation\n\nhttps://t.co/AeH4u439d1",
    "100": "Shaquille O'Neal Blasts Los Angeles Lakers For Missing 2022 Playoffs: 'You Can't Have Four Top 75 Guys On The Same Team … – NBA News https://t.co/Ck8MIjj0ZG",
    "101": "#News Shaquille O’Neal Blasts Los Angeles Lakers For Missing 2022 Playoffs:… https://t.co/fqw23jm7n4",
    "102": "Shaquille O'Neal Blasts Los Angeles Lakers For Missing 2022 Playoffs: 'You Can't Have Four Top 75 Guys On The Same Team … – Lakers News https://t.co/Z5Pl550KIV",
    "103": "@SnoopDogg i love snoopy dogg and elvantis\n#elvantis\n#Los Angeles Lakers https://t.co/iiniBHRmwb",
    "104": "4.10.22\nLos Angeles #Lakers vs Denver #Nuggets\nSacramento #Kings vs Phoenix #Suns\nUtah #Jazz vs Portland #Trailblazers\n\nToday's #NBAPredictions: https://t.co/hltNwEZVnD\nBet on NBA:  https://t.co/ArbfnziqHj\n#Draftkings #Fanduel #sportsbook #BetMGM #WilliamHillUS https://t.co/xVZNsY9w8J",
    "105": "LOS ANGELES LAKERS vs\nDENVER NUGGETS, 9:30PM.",
    "106": "@TheNBACentral @SeanDeveney @SteveBHoop Shot clock at 7, Westbrook 2 defenders on him. Pass To Anthony Davis. AD throws it back up top to LeBron! LeBron puts up the three, OH IT’S GOOD!!! LEBRON JAMES FROM DOWNTOWN!!  THE LOS ANGELES LAKERS ARE YOUR 2022 NBA CHAMPIONS!!!",
    "107": "Lakers star LeBron James evicts Kent Bazemore from his seat; Leaves him hanging  https://t.co/YGAYzdzmtt #LALakers #LosAngelesLakers",
    "108": "Coach K is going to be the next head coach of the Los Angeles Lakers … you heard it here first",
    "109": "https://t.co/AOqhUV0IRL Los Angeles Lakers Coffee Mug 14oz Mocha Style #LosAngelesLakers #LA #LosAngeles #Lakers https://t.co/mwMvRxaMNz",
    "110": "#SINDIKATREADY\nLos Angeles Lakers Vintage Bootleg\n- fits S/M\n__________________\n- Details\n🐙 Good in shape\n🐙 No defects, or stain\n\n#jualtopi\n#capforsale\n#vintageforsale\n#vintagestyle\n\nhttps://t.co/OdRnwjeI9o",
    "111": "Los Angeles Lakers Memes https://t.co/KPZPVxBqRn",
    "112": "🚨 Line Change 🚨\n\nLos Angeles Lakers @ Denver Nuggets\nSun 9:40 PM EST\n\nFrom:\nDEN -8.5 -115\n\nTo:\nDEN -10.0 -110",
    "113": "Consensus Line Move:\n2022-04-10 Los Angeles Lakers at Denver Nuggets from 229.00 to 228.00\nUnder this just in\n#NBA #bettingexpert #data #invest",
    "114": "Consensus Line Move:\n2022-04-10 Los Angeles Lakers at Denver Nuggets from -8.50 to -10.00\n#MileHighBasketball gonna eat\n#NBA #handicapper #ai #bitcoin",
    "115": "Los Angeles Lakers executive Rob Pelinka to ‘remain in power’ through 2022 https://t.co/irSgZLWHL3",
    "116": "Los Angeles Lakers executive Rob Pelinka to ‘remain in power’ through 2022 https://t.co/kOXNOZ4u9v",
    "117": "Los Angeles Lakers executive Rob Pelinka to ‘remain in power’ through 2022 https://t.co/RVGYIySsQq",
    "118": "Los Angeles Lakers executive Rob Pelinka to ‘remain in power’ through 2022 https://t.co/imGjim57PE",
    "119": "Los Angeles Lakers executive Rob Pelinka to 'remain in power' through 2022 – Lakers News https://t.co/V7MqHW8Oto",
    "120": "@MegaTJP You know the difference between TJP and the Los Angeles Lakers? TJP will be in action this Saturday!!! See you in Chicago, sir!",
    "121": "Los Angeles Lakers Could Trade Russell Westbrook For Buddy Hield And Malcolm Brogdon, Suggests NBA Analyst – NBA News https://t.co/QLGwZcLI7h",
    "122": "Los Angeles Lakers Could Trade Russell Westbrook For Buddy Hield And Malcolm Brogdon, Suggests NBA Analyst – Lakers News https://t.co/fwaRWvhRWL",
    "123": "🔴LIVE ~ Los Angeles Lakers vs. Denver Nuggets - NBA League Pass\n🔴Live Streaming➠ https://t.co/vgl4a75fby\n📅 : Sunday, April 10, 2022\n⏰ : 9:30 PM",
    "124": "🔴LIVE ~ Los Angeles Lakers vs. Denver Nuggets - NBA League 2022\n🔴Live Streaming Now➠ https://t.co/TRxq8agGzG\n📅 : Sunday, April 10, 2022\n⏰ : 9:30 PM",
    "125": "Los Angeles Lakers LeBron James #23 Nike NBA Hardwood Classic Swingman Jersey - https://t.co/XdzWUxNw5a\n\n#lebron #lebronjames #lakers #nba \nhttps://t.co/DKzY4lIxBx",
    "126": "After the Los Angeles Lakers’ disappointment in missing this season’s NBA play-offs, I picked five great teams to miss out on post-season basketball for ⁦@PlanetSportcom⁩. https://t.co/tfmoHzZVyn",
    "127": "Check out this video in the NBA app!\n 1, 2, 3 ... Cancun! Banana boat time for Lakers\n https://t.co/nFdrkwaf9C.  Los Angeles Lakers going Cancun.",
    "128": "5 offseason moves the Los Angeles Lakers need to make\nhttps://t.co/er0QCcvGOm",
    "129": "I would like to be the next coach of the Los Angeles Lakers. Where and how can I fill out an application?",
    "130": "Why this Los Angeles Lakers season was doomed from their first team outing in October https://t.co/0mdK7y2FFw",
    "131": "Apr.10, Sun.\n🏀#NBA continue👇\n11.Denver Nuggets Vs Los Angeles Lakers\n12.Phoenix Suns Vs Sacramento Kings\n13. New Orleans Pelicans Vs Golden State Warriors\n14.Portland Trail Blazers Vs Utah Jazz\n15.Los Angeles Clippers Vs Oklahoma City Thunder https://t.co/kSxH58WB3e",
    "132": "“It’s fair to wonder if individual greatness is enough for him if the Lakers are going to be mediocre” Bill Orams questions the primary desire and goal of LeBron James  https://t.co/0nexAmxkVw #LALakers #LosAngelesLakers",
    "133": "NBA Basketball Game Betting Picks Simulator: 9:30 PM ET - Los Angeles Lakers vs. Denver Nuggets - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/eF1nlcolvs #nba #sportsbetting #freepicks #cappertek",
    "134": "Sz XL NBA Authentic #6 Lebron James Jersey 2022 Los Angeles Lakers Purple Away - https://t.co/WiPuf3Jul6\n\n#lebron #lebronjames #lakers #nba \nhttps://t.co/Vu3pW6zKuo",
    "135": "The Nuggets will finish off their regular-season schedule against the Los Angeles Lakers at Ball Arena at 7:30 p.m. Sunday night with their playoff opponent still up in the air. https://t.co/rMG5O7K0pw",
    "136": "🏀NBA🏀 #NBA \n🏀Saison régulière🏀\n\nBrooklyn Nets - Indiana Pacers\nCharlotte Hornets - Washington Wizards\nCleveland Cavaliers - Milwaukee Bucks\nDallas Mavericks - San Antonio Spurs\nDenver Nuggets - Los Angeles Lakers\nHouston Rockets- Atlanta Hawks",
    "137": "https://t.co/za4JKGYyNp Los Angeles Lakers Travel Tumbler 20oz Ultra #LosAngelesLakers #LA #LosAngeles #Lakers https://t.co/meuUhc4FtS",
    "138": "Check out 2022 Panini Nba Sticker &amp; Card Collection Lebron James #65 LOS ANGELES LAKERS https://t.co/vVcBQDtYgG #eBay via @eBay",
    "139": "Congratulations to Scrip (@ScripGames) who moved up 1 spot to take #6 on the Los Angeles Lakers team leaderboard.\n\nhttps://t.co/7jbi1baNWE",
    "140": "After Sunday, everybody in their chairs, court, coaching staff, upper management will be gone except 2 people for the Los Angeles Lakers…guess who that is?? https://t.co/TJ72heoOIW",
    "141": "Los Angeles Lakers 32-49",
    "142": "Los Angeles Lakers 31-49",
    "143": "Los Angeles Lakers 31-48",
    "144": "Los Angeles Lakers 31-47",
    "145": "Los Angeles Lakers 31-46",
    "146": "Los Angeles Lakers 31-45",
    "147": "Check out 2000-01 Upper Deck Los Angeles Lakers Basketball Card #403 Shaquille O'Neal MVP https://t.co/gZrq5pinB3 #eBay via @eBay",
    "148": "Rumors: Lakers to possibly engage with Raptors’ Nick Nurse for team’s head coaching helm #LosAngelesLakers #NickNurse #TorontoRaptors https://t.co/kGk6XeeQzq",
    "149": "NOW: @BernieFratto breaks down the ongoing debacle with the Los Angeles Lakers and much more!\n\nLISTEN: https://t.co/WOHUhodY9f https://t.co/lRK9igUBsE",
    "150": "Alliteration is a powerful way to be memorable ( Los Angeles Lakers, Coca Cola, Dunkin Donuts)",
    "151": "Took the train to Los Angeles for a @LAClippers game vs Sacramento. It was a delight to watch LA don their powder blue throwbacks! I also like the mural of the team in place of the Lakers’ banners. Always a unique challenge redecorating a shared venue. 🏀⛵️ #ClipperNation https://t.co/OzL5U62xed",
    "152": "The 2021-22 Los Angeles Lakers won the title of 'Most Disappointing Team' in NBA history\n\nLet's hope things change for the better in near future for Lakers.\n#BTC365 #NBAPlayoffs https://t.co/JBwNUuT1jB",
    "153": "Nike Los Angeles Lakers Diamond Icon Edition LeBron James Jersey Men's XL #6 NBA - https://t.co/KRkbA3sr9Q\n\n#lebron #lebronjames #lakers #nba \nhttps://t.co/l39j8yO7er",
    "154": "😍 LeBron James Los Angeles Lakers 23 Jersey 😍 \nShop now 👉👉 https://t.co/GaeXZtpSnd\n.\n#sportsfans\n#sportsjerseys\n#sportswearstor\n#nflfans\n#nbafans\n#mlbfans\n#nhlfans https://t.co/bpfasF2Ikm",
    "155": "We're bringing you the true stories behind HBO's #WinningTime\n\nSubscribe to “Binge Sesh,” the @latimes’ new podcast, for more behind-the-scenes looks at the \"Showtime\" Lakers.  https://t.co/1DjgWBWEx7",
    "156": "@PyeparFaisal Ah, weak games were on the cards. \n\nPlus the beloved/behated Los Angeles Lakers are eliminated so basketball takes have reduced on the timeline for now until playoffs",
    "157": "Check out Kobe Bryant NBA Los Angeles Lakers 12”x15” Engraved Plaque https://t.co/3aQiATbTpn @eBay",
    "158": "Check out Kobe Bryant NBA Los Angeles Lakers 12”x15” Engraved Plaque https://t.co/3OjW6QaGWJ @eBay",
    "159": "Check out Kobe Bryant Michael Jordan NBA Los Angeles Lakers Bulls 12”x15” Engraved Plaque https://t.co/IRRcTE5uoP @eBay",
    "160": "Check out Kobe Bryant NBA Los Angeles Lakers 12”x15” Engraved Plaque https://t.co/XvdiXfYIiM @eBay",
    "161": "LeBron Raymone James Sr. is an American professional basketball player for the Los Angeles Lakers of the National Basketball Association.\n\n#MotivationalQuotes #StartupStories #Quotes #SundayMotivation #American #Basketball #SS https://t.co/NraXpEfawv",
    "162": "New Study Says Lakers Fan Complain the Most About NBA Officiating – NBC Los Angeles https://t.co/FUtznKUo3d",
    "163": "How to fix the youth problem of the Los Angeles Lakers lmao. https://t.co/52tWZxR3NN",
    "164": "It seems like most NBA bb analysts care more about the Los Angeles Lakers than they care about any of the other 29 NBA teams.  All of them want to talk about Lebron James.  Lebron James is always headline news.  They all love Lebron James.  Lebron James is their money-maker.",
    "165": "Former Gate City standout Mac McClung has signed a two-way NBA contract with the Los Angeles Lakers, according to a tweet from the team on Saturday https://t.co/BgFrYABv9S",
    "166": "Poverty? Sir, I believe you’re looking for the small business loan Los Angeles Lakers. https://t.co/DVBwLwJCgh",
    "167": "Listen to \"Entertainment Podcasting Sports\" by @Dramatizeradio1 via #spreaker https://t.co/t9kNIk9efT Winning Time Series #WinningTime #basketballmovies #LosAngelesLakers",
    "168": "Check out this listing I just added to my #Poshmark closet: Vintage Los Angeles Lakers Authentic Nike Reversible Mesh Shorts With Logos XL. https://t.co/xtvO1B1vWe #shopmycloset @poshmarkapp",
    "169": "Flea - National Anthem (Los Angeles Lakers vs Denver Nuggets) (April 03,... https://t.co/uL9DGIiI6i @YouTubeより",
    "170": "New Study Says Lakers Fan Complain the Most About NBA Officiating – NBC Los Angeles https://t.co/gdWaovXzyk",
    "171": "@artemiis19 San Francisco shock is alliteration, technically s and sh counts as sibilance.\nBut other than that yea. Probs cuz there are big teams in other sports that are: Los Angeles Lakers, New York Knicks, Cleveland cavaliers, San Antonio Spurs.\nBut most don't, even in that.",
    "172": "ICYMI: #HBO series #WinningTime: The Rise of the #Lakers Dynasty, chronicling the 1980s #LosAngelesLakers, has been picked up for a second season. https://t.co/DK7jHMIjEg",
    "173": "Los Angeles Lakers Fail To Qualify For Play-In Tournament, NBA Twitter Rewards Them With Jokes Source: Christian Petersen / Getty The Los Angeles Lakers’ once-promising season is officially a failure after the team failed... - https://t.co/bLK97OJOU9 #digitalmusiczone https://t.co/DxeGEHTZAU",
    "174": "This is the most-read sports @latimes sports story today for a reason. @DanWoikeSports and @BA_Turner explain exactly what went wrong for the #Lakers. \n\nThe Big Fail: Inside the Lakers’ most disappointing season in franchise history  \n\nhttps://t.co/IZERuyToAJ",
    "175": "LeBron James to miss Los Angeles Lakers' final 2 games because of sprained ankle - ESPN https://t.co/Yi1gb79Y8W"
}