{
    "0": "@BrooklynNets Why yall want Simmons on the nets so bad?",
    "1": "@BrooklynNets Simmons is a problematic guy",
    "2": "Time to watch some NBA action.\n@utahjazz\n@brooklynNets\n#takenote https://t.co/MBG8YZraOQ",
    "3": "@BrooklynNets Pls do not trade harden",
    "4": "@PBAinsider I think the Nets should include Kyrie Irving to that deal. I mean, his talent is needed yes but his lack of consideration towards others especially in the issue of vaccine is completely unprofessional. Brooklyn will find someone who's less talented but much better in general.",
    "5": "You’ll get Ben and Thybulle and you’ll LIKE IT @BrooklynNets https://t.co/8Wwd1bIJtp",
    "6": "@bubblefraud @chuucle @BrooklynNets Suspended",
    "7": "@BarnesCohen @BrooklynNets Simmons is a problematic guy. He has brain damaged.",
    "8": "@BrooklynNets Need Sharpe to play some decent minutes",
    "9": "@BrooklynNets Wow @KyrieIrving play lets watch",
    "10": "@Home_Brodie @BrooklynNets Please leave we tired of the dribble the shit out the ball on offense then pass with 3 seconds left or if not the lame stepback 3 that he rarely makes nowadays.",
    "11": "Watch a live broadcast in high quality without cutting\n\nUtah Jazz  .X. Brooklyn Nets\n\nhttps://t.co/RwcJPoBWA3\n\n#Utah #Brooklyn99",
    "12": "@BrooklynNets trade him to Portland",
    "13": "@BrooklynNets This is NOT about @JHarden13 this is all due to Kyrie! No Simmons!! Bring him in &amp; u discredit the organization and disrespect the fans! https://t.co/GzGZGGDMbj",
    "14": "@YoDaveeexx @BrooklynNets I can imagine it alright 🗑🔥🔥🔥",
    "15": "@backcourtv Brooklyn Nets fans https://t.co/trKK39lBqf",
    "16": "@bubblefraud @chuucle @BrooklynNets yeah he’s good",
    "17": "@BrooklynNets Kevin Durant can never be compared to Lebron James, James will keep the team together, and Durant can't deal with the conflicts of Irving, Harden and Nash",
    "18": "@chuucle @RJCamsavedme @BrooklynNets Ben is a good player",
    "19": "My poor little @BrooklynNets have been losing because I haven't been watching them for the past few games. So sorry my loves, I was sick. I'm watching tonight. Cheers! #Brooklyn\n#BrooklynNets https://t.co/upFZa0KeS8",
    "20": "Harden for ben straight (unless we talking picks and shake or furk) it’s happening now or in the summer you bitches choose when @BrooklynNets",
    "21": "@BarnesCohen @BrooklynNets Down bad 😹😹",
    "22": "It appears Brooklyn is asking for Seth Curry and Matisse Thybulle too. That’s tough.\n\nPhilly would really have to insist on Cam Thomas + assets to compensate for those valuable pieces.\n\nNets aren’t really operating on a position of strength since Harden can be a free agent.",
    "23": "The Brooklyn Nets will trade James Harden &amp; Jevon Carter to the Philadelphia 76ers for Ben Simmons, Tyrese Maxey, &amp; Seth Curry and there's no other way to spin it. It's going to happen.",
    "24": "@BillyReinhardt Either way you look at it every time the Brooklyn Nets build any sort of draft picks there's always a superstar that wants to come here for those draft picks and then leave within two seasons\n that pattern has been going on for the last 20 seasons",
    "25": "@RJCamsavedme @bubblefraud @BrooklynNets my bam hate isn't shameless or deep enough to call him ben simmons",
    "26": "@BrooklynNets L incoming + announce harden to Philly",
    "27": "Brooklyn Nets vs  Utah Jazz | NBA Basketball LIVE | 2/4/2022 https://t.co/dhkqfeLjdV via @YouTube",
    "28": "I see the Brooklyn Nets and James Harden going 0-6 after this game with the Utah Jazz. They need Kevin Durant. https://t.co/B49HDRl2dA",
    "29": "🇦🇺 @Patty_Mills gets the start today as the @BrooklynNets look to snap their losing skid in Utah. \n\n#NetsWorld #NBA75 \n\n📲💻 Watch LIVE on League Pass: https://t.co/7kdyNBOB84 https://t.co/awTXUhyf2u",
    "30": "@TheLeadSM @BrooklynNets you gave away this btw. You got too greedy https://t.co/gW4HqRfmZS",
    "31": "@chuucle @BrooklynNets LMAOOOOOO",
    "32": "@BrooklynNets Call up DDJ tf wrong with y’all",
    "33": "@bubblefraud @BrooklynNets praying for the day you get suspended again",
    "34": "@WideBackDeebo @JesusKristo2 @BrooklynNets Ok dedmon",
    "35": "RT YESNetwork \"RT @BrooklynNets: First 5⃣ on the floor https://t.co/gVh7INS6mO\"",
    "36": "@JesusKristo2 @bubblefraud @BrooklynNets Imagine being a Yurt truther… bros a poor mans Whiteside/Drummond",
    "37": "How did the Brooklyn Nets let Jarrett Allen get away? Dude is a baller! One of primary reasons Cavs are competitive this season. #HookEm!",
    "38": "@BrooklynNets should have never traded harden for allen and levert",
    "39": "Maxey sucks Shake is really good I promise @BrooklynNets https://t.co/pvQtzXVtbc",
    "40": "@Whatshis40 @BrooklynNets Only took 8 hours to get 4 made shots on video",
    "41": "@WideBackDeebo @BrooklynNets Lowry\nHarden\nJimmy\nPJ\nYurt\n\nHeat in 5",
    "42": "@mel__danger @mignaci0 @BrooklynNets He’s celebrating with an extra wordle obviously",
    "43": "@ShamsCharania @TheAthletic Why wouldn’t the @BrooklynNets call the @chicagobulls, @nuggets, @ATLHawks or so many other teams that want to win this year and have better prices then a guy who refuses to play.",
    "44": "🏀 Utah Jazz vs Brooklyn Nets\n🏆 NBA\n🗓 04/feb.\n⏰ 23:00\n📺 NBA LEAGUE PASS",
    "45": "@BrooklynNets Why is Johnson playing???????",
    "46": "BREAKING: Philadelphia 76ers will pursue James Harden through a trade ahead of next week’s trade deadline &amp; the Brooklyn Nets are open to the idea, according to Shams Charania. \n\nThe deal would include Ben Simmons. \n\n@OfficialNBABuzz https://t.co/LY1gu9akeL",
    "47": "@BrooklynNets Kyrie, I will be happy if you carry us to a win tonight. Not suprised tho if we lose cause this team sucks",
    "48": "I know stats aren't the most fun in sports, but, if literally, a loose shoe is the difference between a team being considered a success or failure, no take on that team is \"statistically significant\" #BrooklynNets",
    "49": "@dpcoon1 @RuFan130 @BrooklynNets Wouldn't be mad. Would just really enjoy trolling him.",
    "50": "@BrooklynNets What’s Simmons number going to be?",
    "51": "Watch Brooklyn Nets at Utah Jazz Live.\nLive here👉👉 https://t.co/Cwyg4JS2aH https://t.co/oG1lXH8pro",
    "52": "Love your tie @Grady!  #BrooklynNets",
    "53": "@utahjazz Watch Brooklyn Nets at Utah Jazz Live.\nLive here👉👉 https://t.co/Cwyg4JS2aH",
    "54": "@bubblefraud @BrooklynNets You are shameless",
    "55": "Watch Brooklyn Nets at Utah Jazz Live.\nLive here👉👉 https://t.co/Cwyg4JS2aH https://t.co/IHmwkJ9fVJ",
    "56": "@BrooklynNets Let. Cam. Cook. \n\nAnd tell the Sixers he’s not available. https://t.co/hG0PSgK4ca",
    "57": "Heat got a darker Ben Simmons @BrooklynNets just sayin",
    "58": "Yo! @BrooklynNets don't trade James Harden for Ben Simmons. That's my word!",
    "59": "Harden stans and actual Brooklyn Nets fans going at it. Gonna be funny as hell if he’s not dealt next week",
    "60": "The Cavs won the Jarrett Allen trade, sorry @BrooklynNets",
    "61": "@CaroussoEnter @nyknicks @BrooklynNets @JHarden13 @derekfutterman This is the worst picture of Derek ive ever seen I love it",
    "62": "@heatsznszn @BrooklynNets Yea when you were born 🤡",
    "63": "@BarnesCohen @BrooklynNets lol, Simmons? dude it’s idea is fucking shit",
    "64": "@BrooklynNets FIRE NASH!",
    "65": "@BrooklynNets The hell is Johnson doing there",
    "66": "@BrooklynNets @YESNetwork When is Simmons playing?",
    "67": "@BrooklynNets We need Simmons, he will fit better with KD and irving. Imagine kd, irving, simmons, clax and bembry as starting 5🔥💯",
    "68": "@BrooklynNets Oh boy",
    "69": "@juicyintake @BrooklynNets lmaoo😭😭😭",
    "70": "@BrooklynNets @Patty_Mills @KesslerEdwards We need Simmons, he will fit better with KD and irving. Imagine kd, irving, simmons, clax and bembry as starting 5🔥💯",
    "71": "@BrooklynNets 🤷🏿‍♂️we almost beat golden state with the same lineup.",
    "72": "@BrooklynNets post ben simmons",
    "73": "Tonight's starting lineup for the Brooklyn Nets: Irving, Mills, Edwards, Johnson, Claxton https://t.co/bVWH4AMCA2",
    "74": "The @BrooklynNets starting Irving, Mills, Edwards, Johnson, Claxton on Friday. #BrooklynGrit #NBA",
    "75": "@BrooklynNets yea James def gone 😂😂😭✌️ https://t.co/KeCB8AWv2h",
    "76": "@BrooklynNets Brudda wtf is this",
    "77": "Brooklyn Nets Starting Lineup 2/4\n PG: Kyrie Irving\n SG: Patty Mills\n SF: Kessler Edwards\n PF: James Johnson\n C: Nicolas Claxton\nhttps://t.co/o75oZ8vnE8",
    "78": "@BrooklynNets @JHarden13 Please stay",
    "79": "@BrooklynNets Where’s Simmons?",
    "80": "The starting five for the Brooklyn Nets\n\nKyrie Irving\nPatty Mills\nKessler Edwards\nJames Johnson\nNicolas Claxton",
    "81": "@BrooklynNets James Johnson omg, at this point are we losing on purpose?",
    "82": "@BrooklynNets Kyrie is literally playing today!",
    "83": "@BrooklynNets Can't wait til ben simmons and seth curry are in here omg",
    "84": "@BrooklynNets Trade harden for Simmons and curry",
    "85": "@BrooklynNets wheres ben and maxey?",
    "86": "@BrooklynNets i hope this motherfuckers win today..",
    "87": "@BrooklynNets where’s ben simmons",
    "88": "@BrooklynNets Who tf is johnson",
    "89": "@BrooklynNets Sorry bro we can't focus on this game",
    "90": "@BrooklynNets where’s Ben?",
    "91": "@BrooklynNets Kessler mmm",
    "92": "@BrooklynNets Cares?",
    "93": "@BrooklynNets plz trade harden",
    "94": "NBA Live Thread: Brooklyn Nets at Utah Jazz, 9:00 PM EST https://t.co/u3lJE4gT7g https://t.co/BVAQX0QjVq",
    "95": "First 5⃣ on the floor https://t.co/Pj2U3RT0yJ",
    "96": "The Philadelphia 76ers – one of the most aggressive teams in the market and an eager suitor for Brooklyn's James Harden – have ended pursuit of a deal with the Nets and turned elsewhere in trade talks, sources tell @FOXSports and @BallsackSports",
    "97": "@fredz_7 @kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz y'all gonna be rent free in cancun after the play in game",
    "98": "Covering the Jazz-Nets game for @ESPN700. On paper it's definitely a winnable game for the Jazz. No Harden and no KD for Brooklyn and Donovan Mitchell is available for the Jazz",
    "99": "@ShamsCharania @TheAthletic @BrooklynNets for ben and Seth for sure",
    "100": "Will the Brooklyn Nets trade James Harden to the Philadelphia #76ers at the deadline? Only time will tell, but Harden can certainly help to influence a deal one way or another.\n\n[@MattyBreisch]\nhttps://t.co/VH8O8z25MI",
    "101": "@RuFan130 @BrooklynNets Harden played through injury in last years playoffs so I gotta respect that. If he wins a title with Philly though it’s him lmao",
    "102": "The Brooklyn Nets situation is trash. How u recruit him to pull up, pitch the idea of a big 3, he kums, now u the only nigga on da team not tryna get vaccinated so u miss half the szn, he gotta do all da work, KD hurt, u kan only play away games and we losing those? Dats Crazy 😭 https://t.co/pT6G6GHsHY",
    "103": "@JHarden13 Brooklyn nets fans will lose all respect for you if you leave just because you’re experiencing a bump in the road to a championship",
    "104": "@DaveyJones45 @dmorey Brooklyn would be getting at a minimum a 25 year old all star on a multi year deal. Nets should be sweetening the deal for Harden’s old chunky butt on an expiring contract.",
    "105": "🏀@JohnRyanSports1 and @you_capper break down the anticipated Brooklyn Nets vs Utah Jazz matchup with tip off at 9 PM EST. The Nets are in desperate need of ending their six game losing streak before they fall too far back in the standings.\n\n➡️https://t.co/x0vQcudc8X https://t.co/IXzh1n528k",
    "106": "KD gets injured and the Brooklyn Nets collapse like a house of wet cards in a hurricane’s path 🤦🏾‍♂️",
    "107": "So instead of having one guy who causes team drama, the @BrooklynNets want two? #smh https://t.co/iSaggRIuBV",
    "108": "@uselesstinsel @kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz lol we stay rent free in your head",
    "109": "Sixers 'mocked' James Harden-Ben Simmons trade report?  #Brooklyn #Nets #NBA https://t.co/GNjbv2hxCn",
    "110": "@BrooklynNets We lost already",
    "111": "With that gold /10 from yesterday here’s my updated rainbow of @BrooklynNets @Patty_Mills @CardPurchaser https://t.co/bwCwcBHo51",
    "112": "OKC decided they weren’t ever going to pay him, he gave his everything in Houston, he didn’t sign the extension Brooklyn offered him because he wasn’t sure about it long term. How’s that quitting in any scenario. The Nets issues are with Kyrie first and foremost. https://t.co/wUfcCIl0o0",
    "113": "@fredz_7 @kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz i'm gonna laugh when your schedule gets tougher and y'all start losing again and wonder what happened",
    "114": "Day 5 of Mega Showtime Lock ⭐️⭐️⭐️⭐️⭐️\n🏀The Brooklyn Nets +6 (-120) I love how Harden is not playing. Let’s start a streak here 🤠\n#GamblingTwitter #NBAPicks",
    "115": "What? @BrooklynNets",
    "116": "I would rather have Ben Simmons anyways honestly .. Trade Harden Ass 💯✌🏽 @BrooklynNets",
    "117": "@peakedin2009 Kyrie Irving can’t play in Brooklyn and the Nets lack offense outside of KD.\n\nSaying the Sixers would be guaranteed to lose to the Nets is an overreaction to say the absolute least.",
    "118": "So Joe Tsai owner of the @BrooklynNets &amp; Sean Marks General Manager of the @BrooklynNets  Are we gonna make this deal trading James Harden, Paul Millsap maybe a future pick for @BenSimmons25 &amp; @TyreseMaxey RT #BrooklynNets fans to make it happen YES YES YES #Nets #NetsLevel 🏀🏆",
    "119": "Will James Harden still be a Brooklyn Net after the deadline?",
    "120": "Harden for Simmons @BrooklynNets",
    "121": "🏀 Utah Jazz - Brooklyn Nets\n⏰ 05.00\n📺 S Sport\n🎙️ @ugurozan",
    "122": "@BrooklynNets @KyrieIrving @KesslerEdwards @blakegriffin23 @Patty_Mills Yall not winning.",
    "123": "@brooklynnets85 @BrooklynNets Bro Harden never said he wants to go",
    "124": "@BrooklynNets ya better fucking not trade harden idgaf what they offer",
    "125": "Ummmm? Why would Brooklyn want this?! Harden’s a nice fit next to KD, I don’t see why the Nets would prefer Simmons. https://t.co/PkRqIHBDgd",
    "126": "@BrooklynNets @Patty_Mills @KesslerEdwards So ...Harden gone ? To 76er?",
    "127": "@N0t_dumb @BrooklynNets don’t drag us into your mess, y’all keep Harden we’re good on this side",
    "128": "Just last week Brooklyn wasn’t open to discussing any Harden deal then Simmons got vaccinated so now we’re here.\n\nNets are doing this knowing Harden is not re-signing with them &amp; won’t risk losing him for nothing.\n\nEmbiid &amp; Harden gonna be the best in-out duo since Shaq &amp; Kobe. https://t.co/9OpCAY6R8E",
    "129": "It’s looking like the mandate in New York will be the end of the Brooklyn nets big three 😂",
    "130": "Waiting for #BrooklynNets vs #UtahJazz…. #NetsWorld always!",
    "131": "The @BrooklynNets will have two of the most toxic players in the NBA.  Both have histories of letting their fans and teammates down. But @JHarden13 and @JoelEmbiid may be the best duo in basketball today. Advantage: @sixers https://t.co/ySdr8sNCRx",
    "132": "the 2020-22 brooklyn nets may go down in sports history as the greatest team to literally never do anything",
    "133": "@NetsDaily Do Nets fans really want Harden out? I think everyone had enough with Brooklyn's loss last match. Everyone said crap and shit about Harden (I can understand), but Brooklyn is a team. If Harden is the problem, then that is a team problem and everyone else's.",
    "134": "@RuFan130 @BrooklynNets This is a blessing in disguise",
    "135": "@BrooklynNets we better not trade @JHarden13",
    "136": "@brooklynnets85 @BrooklynNets rip to who has one 💀 https://t.co/kD39WXBHsv",
    "137": "@brooklynnets85 @BrooklynNets I'm so mad I got the Harden City Edition jersey from this year smh",
    "138": "😂 @cavs fans tried to tell us @celtics fans and Celtics fans tried to tell @BrooklynNets fans! Can only blame ourselves people 🤷‍♂️ 🤣 https://t.co/6sAKE57qvz",
    "139": "@NYPost_Lewis Imagine if Harden ends up staying. All the shit they have say to him, people talking about unrealistic trade scenarios. Oh my, Brooklyn fans should trust more on their players. Harden aint done yet, Nets are just heating up!!",
    "140": "Chicago (Zoom Action) Wrinkle from the Brooklyn Nets\n\nThey set up a Chicago elbow action with Blake Griffin and James Harden and instead of running the split action out of the corner they ducked in Kevin Durant in the mid post.\n\nApp used: \n@luceosports\n\n#XandOBreakdown https://t.co/DKpfE9vQk1",
    "141": "@BKGlueGuys @BrooklynNets @APOOCH I blame Kyrie for all of this!! Harden asked to be traded to the Nets bc of KD &amp; Kyrie, not Part-time Kyrie BS. All I want is Sean Marks to do what he does best💪 #InSeanMarksWeTrust",
    "142": "I am so thankful that Kevin Durant is a Brooklyn Net",
    "143": "@3OclockRoc @JoshJwells61813 @Dolan_J_Trump But the Nets traded their future for a guy whose washed, unhappy and seems to be on the way out. Brooklyn didn't learn from 2014. I said this when the trade happened it was a mistake and I was right.",
    "144": "@KrispySaiyan @SLAMonline @Pacers @BrooklynNets Being stupid",
    "145": ". @sidrosenberg informs Justin Ellick on all things sports this morning…\n\n#SidRosenberg #Sports #brooklynnets #morningshow #nyc #ny #nysports https://t.co/JhfFGtiW9y",
    "146": "Consensus Line Move:\n2022-02-04 Brooklyn Nets at Utah Jazz from 230.50 to 229.00\nUnder there's a pulse\n#NBA #sportsbettingadvice #technology #trader",
    "147": "Both Kyrie Irving &amp; Klay Thompson have been back on the court for less than a month. Are the @BrooklynNets doomed without Kyrie? Or do the @warriors need Klay to win it all. \n\n#NBA75 | #NBA | #BrooklynTogether | #DubNation | #WarriorsGround\n\nWATCH: https://t.co/q7sWYUX6N2 https://t.co/EVUBEXE2ea",
    "148": "harden didn't like the brooklyn strip clubs mannn😵‍💫😭😭 @BrooklynNets",
    "149": "[Wojnarowski] James Harden has been traded to Burlington; Scott Pavek, known for once dribbling a ball, now starting SG for Brooklyn Nets.",
    "150": "@dmorey @sixers make it happen. Maxey is not available. @BrooklynNets https://t.co/sOXgBNH2LK",
    "151": "NBA Basketball Game Betting Picks Simulator: 9:10 PM ET - Brooklyn Nets vs. Utah Jazz - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/diYBhgDpIs #nba #sportsbetting #freepicks #cappertek",
    "152": "stealing james harden from the brooklyn nets is a victimless crime",
    "153": "This Nets-Rockets Trade Lands Christian Wood In Brooklyn - NBA Analysis Network https://t.co/z7dLlNpogm",
    "154": "@BleacherReport @ShamsCharania Hairy ass is willing to go whenever he can smell a ring. Keep his ass in Brooklyn with Durant and Kyrie. #Nets #NetsWorld #Harden #JamesHarden https://t.co/EvwexiQNyz",
    "155": "@bookerjordan87 @BrooklynNets @Patty_Mills @KesslerEdwards Not if he is only scoring 4 points",
    "156": "@mike_inago I just want Harden out of Brooklyn and Ben Simmons to stay in Philly 😂🤷🏽‍♂️ I need that Nets team to implode",
    "157": "@BrooklynNets and @sixers what we need to get this deal done ? Asap",
    "158": "Tonight @utahjazz Vs. @BrooklynNets \n\nPregame 6pm with @JakeScottZone @tlacomb \n\nTipoff 7pm\n\n@kslsports @ZoneSportsNet https://t.co/0VLZqV9MWb",
    "159": "@Alex__Schiffer @Krisplashed Nets shoulda been got rid of that PG everyone loves in brooklyn @KyrieIrving. Now Harden wants out and we all pissed.",
    "160": "@BrooklynNets @24_camthomas @blakegriffin23 Swagger and style love that jacket",
    "161": "Guys I think everybody in Brooklyn is forgetting how good Ben Simmons is at basketball. He’s super, super good. As a lifelong Nets fan, he’s always owned us",
    "162": "@fargo880115 @RitmoNba @BrooklynNets Lebron James y Giannis",
    "163": "Both the Brooklyn Nets and Utah Jazz are slumping right now. The visiting Nets have tumbled down the Eastern Conference standings with six straight losses 🏀 \n\nFULL ARTICLE ➡️ https://t.co/w4uoElM1cG\n\n#NBA #NetsWorld #TakeNote",
    "164": "@RuFan130 @BrooklynNets harden beating dwill is wild man 😭😭😭",
    "165": "@BrooklynNets He sorry!",
    "166": "RT AriA1exander: Talked to James Harden today and asked him what #Nets fans can look forward to:\n\n“Healthy James Harden…it’s scary, SCARY… #BrooklynNets",
    "167": "@BrooklynNets This man dance with the basketball, I watch a lot of nba players and haven't seen a better handler!",
    "168": "I have to experience a Brooklyn Nets game!! Buttttt Kyrie has to be playing that night.😒",
    "169": "Brooklyn Nets, Philadelphia 76ers Open To Discussing A James Harden-Ben Simmons Trade: ‘The Ball Is In The Nets’ Court’ https://t.co/rpHyQVztWU https://t.co/ze9v9patdS",
    "170": "@brooklynnets85 @BrooklynNets I am wearing my 130 dollar city edition James harden jersey rn",
    "171": "Damn why trade harden if u can trade kyrie the retard for a bunch of defense/penetration players @BrooklynNets yall wildin mane",
    "172": "Brooklyn Nets, in turmoil. https://t.co/Z8ELT4a2Dg",
    "173": "@uselesstinsel @kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz noooo about the celtics beating a bunch of sorry teams and the kings by 53 dummy",
    "174": "@SLAMonline @Pacers @BrooklynNets What is yall doing!!!",
    "175": "I am very proud and fortunate to call @sarahkustok a dear friend she is an amazing analyst, and an even more amazing person! I am so glad we crossed paths my friend! @NetsOnYES @BrooklynNets @FOXSports @RyanRuocco @SportsBcastCamp @DavePopkin https://t.co/rXNeQMhUXC",
    "176": "Brooklyn Nets vs. Utah Jazz | USA: NBA\nThis match will start at 09:00 PM, February 04, 2022\n📺 Watch Live Here =&gt; https://t.co/dWAshmqwTK\nVenue: Vivint Smart Home Arena (Salt Lake City)\nPlease Like and share, thank you https://t.co/2UyGwM6wd1",
    "177": "Brooklyn Nets vs. Utah Jazz | USA: NBA\nThis match will start at 09:00 PM, February 04, 2022\n📺 Watch Live Here =&gt; https://t.co/dWAshmqwTK\nVenue: Vivint Smart Home Arena (Salt Lake City)\nPlease Like and share, thank you https://t.co/DGFQxkV9nu",
    "178": "@SplashJordan19 @WillNetsFan @RuFan130 @BrooklynNets Exactly.  And the trade with Portland that netted them Lillard.",
    "179": "James Harden, Ben Simmons Trade Rumors Shift 76ers' NBA Title Odds ... (Bleacher Report)\n\nThe Philadelphia 76ers' NBA championship odds have gone from +1800 ($100 bet to win $1,800) ...\n\nAdd your highlights:\nhttps://t.co/mwN8sA4W5W\n #Brooklyn_Nets",
    "180": "Nets could be open to James Harden-Ben Simmons blockbuster at trade... (New York Post)\n\nSALT LAKE CITY - Could the Harden honeymoon be over?\n\nAdd your highlights:\nhttps://t.co/KeXkTHNcga\n #Brooklyn_Nets",
    "181": "Brooklyn Nets vs. Utah Jazz | USA: NBA\nThis match will start at 09:00 PM, February 04, 2022\n📺 Watch Live Here =&gt; https://t.co/dWAshmqwTK\nVenue: Vivint Smart Home Arena (Salt Lake City)\nPlease Like and share, thank you https://t.co/JX6getIIys",
    "182": "@BrooklynNets @JHarden13 I think people are loving the beard not the free throws and three pointers 🤔",
    "183": "@BrooklynNets @Patty_Mills @KesslerEdwards I don't think the dudes able to keep their concentration after such a whirlwind day",
    "184": "@SplashJordan19 @Dagaustin2000 @RuFan130 @BrooklynNets Lots of newer fans, I would suspect.",
    "185": "@klockrey11 @jaciaiino @Harrison_Grimm He literally said multiple times he loves playing in brooklyn and likes living here and he also has business here in new york, he wont leave the nets in free agency but if he gets traded before the deadline then its whatever",
    "186": "@fredz_7 @kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz about what, my team being better than yours?",
    "187": "@imSincere1223 @975TheFanatic @devong975 Yeah I don't want to see Simmons in Brooklyn. Besides the lack of health for KD, Harden, &amp; Harris, a better defense is their biggest need. If he did stay can you imagine the Nets high powered offense supported by Simmons &amp; maybe Thybulle excellent D for the near term future.",
    "188": "@dannygamboa33 @BrooklynNets It is.",
    "189": "@Nzoc_6 @KingTechnical08 @BrooklynNets @Patty_Mills @KesslerEdwards He’s better than Burrow by far",
    "190": "@StarkLines @BrooklynNets That’s fair",
    "191": "Brooklyn Nets, Philadelphia 76ers Open To Discussing A James Harden-Ben Simmons Trade: ‘The Ball Is In The Nets’ Court’ https://t.co/MWrBpFLgum",
    "192": "@Nzoc_6 @KingTechnical08 @BrooklynNets @Patty_Mills @KesslerEdwards I don't watch the nfl apart from the playoffs I was for the chiefs",
    "193": "All in all the bad talk abt the @BrooklynNets we are ensure of having @KDTrey5 on our team bcause he did the right thing &amp; signed the extension BEFORE the season started to block out all the noise from him ! KD the goat 💪🏻 https://t.co/J2mOu2I2Ab",
    "194": "@RuFan130 @Dagaustin2000 @BrooklynNets i don’t hate james he’s pretty justified, but deron really got injured and fell off, nothing really you can do about that",
    "195": "@Nzoc_6 @KingTechnical08 @BrooklynNets @Patty_Mills @KesslerEdwards Cringe + burrow is overrated",
    "196": "James Harden showed up in Brooklyn &amp; balled his ass off. Played like a Top 3 guy for months, watching KD &amp; Kyrie get all the load management, while he was going 42 min a night. They broke him, he got very hurt, &amp; still, the Nets catered to Kyrie. James has a right to be pissed.",
    "197": "@RuFan130 @BrooklynNets Based on his post game interviews anyone could tell he wasnt happy with 11’s situation, “leaks” or not. Lets not forget all 3 were supposed to sign their extensions come training camp. Hard to predict 11’s mindset, hes a wild card 😂. Just an unfortunate situation overall man",
    "198": "@BrooklynNets @Patty_Mills @KesslerEdwards Harden.gone y'all and y'all really need him lol",
    "199": "@BrooklynNets get rid of Harden if y’all want but don’t pick up Simmons that man’s not a winner either",
    "200": "@Nzoc_6 @KingTechnical08 @BrooklynNets @Patty_Mills @KesslerEdwards ⚽️ is the real football",
    "201": "@BrooklynNets YALL NOT A REAL HOOP TOWN",
    "202": "@BrooklynNets Here we go",
    "203": "@KDTreeey5 @BrooklynNets @24_camthomas @blakegriffin23 You won't get curry and maxey. You will also lose mills, Griffin and aldridge at the end of season.",
    "204": "@KingTechnical08 @Nzoc_6 @BrooklynNets @Patty_Mills @KesslerEdwards Not a real sport",
    "205": "I feel for Kevin Durant but then I also don’t because he made that decision to stay in Brooklyn. Idk what’s going on with the team and why it went from the Nets weren’t listening to trade offers for Harden to now they are but it seems as there is some drama behind the scenes",
    "206": "@BittahBanditt Simmons provides the defensive anchor the Nets desperately need. They are gonna get a secondary piece back. Thybulle Seth or Maxey will be a Brooklyn Net. The trade will work.",
    "207": "@BrooklynNets don’t be Dumb",
    "208": "@WillNetsFan @RuFan130 @BrooklynNets At least we can still recoup assets for Harden.    Deron is the reason we forked up top draft picks to Boston.",
    "209": "Will the @BrooklynNets trade @JHarden13 at the Trade Deadline? #NBA #NetsWorld #JamesHarden",
    "210": "@RuFan130 @BrooklynNets Deron not leading this poll by a wire margin let's me know we have a lot of new fans",
    "211": "@RuFan130 @BrooklynNets To be fair, Deron was never a top 10 player in his career. Nor did he play on a championship contending team. But the poll is lopsided",
    "212": "Brooklyn Nets @ Utah Jazz\nPick : Brooklyn Nets.\nBasketball. NBA",
    "213": "@Nzoc_6 @GiannisNewEra @BrooklynNets @Patty_Mills @KesslerEdwards then back to burrow",
    "214": "Brooklyn Nets, Philadelphia 76ers Open To Discussing A James Harden-Ben Simmons Trade: ‘The Ball Is In The Nets’ Court’ https://t.co/spdQM7TIY2",
    "215": "@RuFan130 @BrooklynNets Probably Harden because he wasn’t liked before he got here and the Nets had a better chance to win with him. Personally I don’t care for hating any Nets player ever besides CJ Watson for that missed dunk",
    "216": "@BrooklynNets @Patty_Mills @KesslerEdwards I love u nets fans",
    "217": "@RuFan130 @BrooklynNets Harden, considering we lost Jarrett Allen &amp; LeVert in order to trade for him.",
    "218": "@RuFan130 @BrooklynNets We actually got a shot at something legendary with Harden so this one hurts.",
    "219": "@dannygamboa33 @BrooklynNets Your points are fair but then this should’ve waited til summer. Harden started leaking a few weeks ago. That’s garbage",
    "220": "@ShamsCharania @TheAthletic Recently #JamesHarden denied Bleach Report that Harden was not happy Brooklyn &amp; does not like HC Steve Nash lineup rotation &amp; Harden does not read Rpt &amp; follow what was been reported - Really\n\nNow #BrooklynNets &amp; 76ers are discussing trade involving Ben Simmons &amp; Harden\n\n#Nets",
    "221": "Brooklyn Nets, Philadelphia 76ers Open To Discussing A James Harden-Ben Simmons Trade: 'The Ball Is In The Nets' Court' – NBA News https://t.co/MXwVxpW8Fz",
    "222": "@BrooklynNets @Patty_Mills @KesslerEdwards fire nash",
    "223": "@BrooklynNets @Patty_Mills @KesslerEdwards Patty 💧",
    "224": "@ESPN_WomenHoop @espnW So were the Brooklyn Nets",
    "225": "@W4RSAME @BrooklynNets Definitely and a lot of younger fans",
    "226": "@KingTechnical08 @BrooklynNets @Patty_Mills @KesslerEdwards what is this pfp",
    "227": "@BrooklynNets @Patty_Mills @KesslerEdwards mid af",
    "228": "@RuFan130 @BrooklynNets depends on how the season ends",
    "229": "The @BrooklynNets don’t need Simmons and Maxey. They need Simmons and superstar in the making Isaiah Joe. That’s who they should trade for!",
    "230": "@RuFan130 @BrooklynNets Feel like recency bias playing apart in the results, but it’s close for me",
    "231": "@RuFan130 @BrooklynNets “The worst trade of all time” wouldn’t have been “the worst trade of all time” if Deron could carry a team after PP left.",
    "232": "@BrooklynNets @Patty_Mills @KesslerEdwards Harden update or ratio",
    "233": "@coinbase @NBA #CoinbaseNBASweepstakes  Brooklyn nets and atom plz",
    "234": "@BrooklynNets @Patty_Mills @KesslerEdwards dress better",
    "235": "@BrooklynNets @Patty_Mills @KesslerEdwards Give us kai",
    "236": "@BrooklynNets @Patty_Mills @KesslerEdwards Pls trade James",
    "237": "@BrooklynNets @Patty_Mills @KesslerEdwards Trade the fat guy to a real NBA team",
    "238": "@BrooklynNets @Patty_Mills @KesslerEdwards Kyrie masterclass to shut up the haters today",
    "239": "@BrooklynNets @Patty_Mills @KesslerEdwards Is James at the game with the team?",
    "240": "@RuFan130 @BrooklynNets Deron was here a few years at least..",
    "241": "@BrooklynNets @Patty_Mills @KesslerEdwards trade harden i don’t care no more",
    "242": "@BrooklynNets @Patty_Mills @KesslerEdwards a 6/10 at the most",
    "243": "@BrooklynNets @Patty_Mills @KesslerEdwards What’s goin on wit Harden",
    "244": "@BrooklynNets @Patty_Mills @KesslerEdwards Where’s Simmons?",
    "245": "@BrooklynNets @Patty_Mills @KesslerEdwards Come to Ben Simmons",
    "246": "@SplashJordan19 @BrooklynNets Deron didn’t run from a championship team",
    "247": "@BrooklynNets @Patty_Mills @KesslerEdwards Free harden",
    "248": "@BrooklynNets @Patty_Mills @KesslerEdwards Trade harden I guess",
    "249": "@BrooklynNets @Patty_Mills @KesslerEdwards Lmao don't tweet",
    "250": "Friday Fits 💧 https://t.co/MBi7CLWpsA",
    "251": "@dpcoon1 @BrooklynNets Id still be petty lol",
    "252": "@dannygamboa33 @BrooklynNets Why don’t you get it",
    "253": "@RuFan130 @BrooklynNets How is Deron not dominating this poll? Lol",
    "254": "Former Brooklyn Nets Norvel Pelle has checked in (No. 9) https://t.co/Tr7zx3M8dU",
    "255": "@RuFan130 @BrooklynNets Depends if we win without him. If we win a championship without Harden how can you be mad at him lol",
    "256": "@RuFan130 @BrooklynNets I personally don’t understand the Harden slander wbu. But majority of Nets twitter looks like they have a clear answer lol",
    "257": "@RuFan130 @BrooklynNets James Harden got the beloved Jarrett Allen traded, I don’t see D Will topping that 😂",
    "258": "The Sixers' pursuit of James Harden just got a shot in the arm, as the Brooklyn Nets are ready to talk about a trade involving Harden and Ben Simmons. @PompeyOnSixers has the latest details: https://t.co/Bvvyw0M4aC",
    "259": "@RuFan130 @BrooklynNets Not even close",
    "260": "@RuFan130 @BrooklynNets 13 for SURE (if this trade happens)",
    "261": "@RuFan130 @BrooklynNets Can I pick both?",
    "262": "@corn_sports @jakenisse @brooklynnets85 @BrooklynNets He was loyal to the money. Now he’s sitting on it over a sprained ankle",
    "263": "VIDEO: The @nyknicks are sinking and the @BrooklynNets are considering shipping @JHarden13 out of town. 🏀 @derekfutterman &amp; @thejoeyrinaldi have some apparently not-so-wild trade proposals #OnTheCall. https://t.co/86jUKlNI33 https://t.co/5zXfT2BV8z",
    "264": "@brooklynnets85 @BrooklynNets He’s not getting traded this season",
    "265": "@imchrismonte @brooklynnets85 @BrooklynNets Yeah lol",
    "266": "@jakenisse @corn_sports @brooklynnets85 @BrooklynNets Just claim it's a Devin Harris tribute. Nobody mad at that.",
    "267": "Plot twist: James Harden is faking to be unhappy. Nets trade him for Ben Simmons. Harden test free agency. Re-signs with Brooklyn to form the Big 4🤯🤯🤯",
    "268": "Brooklyn Nets did all that to acquire 3 stars just to watch Miami and Milwaukee play in the ECF",
    "269": "@markmcc134 @brooklynnets85 @BrooklynNets Durant is the only safe play.",
    "270": "Who will end up being the more hated @BrooklynNets ?",
    "271": "KD and Kyrie are besties, they're going to throw their third wheel under the bus. It's not a new thing under the sun though but it's coming at the right time and this will destabilize the Brooklyn Nets come this post season. https://t.co/qx3Yz2OF6s",
    "272": "Alhamdulillah, just interviewed the team dentist of the Brooklyn Nets as well as UFC &amp; Bellator 😁 posting to the page after I edit in the next couple of days, follow it if you’re interested!! https://t.co/KcYdEfqP3D",
    "273": "@brooklynnets85 @BrooklynNets Durant was always the only safe jersey play.",
    "274": "Sending Simmons to the Nets might be the best fit.\n\nPhilly strip clubs gotta be more lit than Brooklyn tho if you want it to work lol https://t.co/YhQ6cK2WoK",
    "275": "Still remember Nets fans clowning Celtics fans that they got Kyrie, and he would work in Brooklyn. https://t.co/H6srh6mahN",
    "276": "@corn_sports @brooklynnets85 @BrooklynNets I know I have a Harris Jersey im saying haha",
    "277": "@BrooklynNets whatever any team offers you for harden just take the deal https://t.co/oFSvEZoeCZ",
    "278": "Nets could be open to James Harden-Ben Simmons blockbuster at trade deadline #Brooklyn #Nets #NBA https://t.co/6hyJtO67K3",
    "279": "Things to look out for Tonight if James Harden is not with the team on the bench that could be a sign he is truly gone &amp; quitting on the Brooklyn Nets",
    "280": "Brooklyn Nets, Philadelphia 76ers Open To Discussing A James Harden-Ben Simmons Trade: ‘The Ball Is In The Nets’ Court’ https://t.co/dob0qDGH3N https://t.co/YXvaE8N6df",
    "281": "Brooklyn Nets, Philadelphia 76ers Open To Discussing A James Harden-Ben Simmons Trade: ‘The Ball Is In The Nets’ Court’ https://t.co/CPWPOSprXU",
    "282": "The Athletic's Shams Charania reported on Friday that the Brooklyn Nets are open to discussing a trade ahead of the deadline where James Harden would be sent to Philly in exchange for Ben Simmons.\n\n📸: Kevin C. Cox/ Christian Petersen/ GettyImages https://t.co/DAwlTaCmwa",
    "283": "Live look at the Brooklyn Nets https://t.co/V9HwXpl61J",
    "284": "Brooklyn Nets wanna be stupid so let’s get DUMB 😂😂",
    "285": "@ybdshizz @kpotter15 @StoolGreenie A Sixers/Nets series would be great for Philly because Kyrie wouldn't play the games in Brooklyn and Simmons wouldn't play when in Philly. It's just hard to muster up any level of fear for Ben Simmons in the playoffs.",
    "286": "@BrooklynNets should move the beard. He’s just gunna bounce anyways. #Harden",
    "287": "James Harden 🔜 @sixers \nBen Simmons 🔜 @BrooklynNets",
    "288": "@DurgoatB @Ddelliponti08 @BrooklynNets Deal!",
    "289": "I've been waiting for the @BrooklynNets to implode and it seems like the time has come! Listen to my arguement of why James Harden going to the @sixers would be great for the NBA season on my @pulseradio100 podcast! #NBA #NBATwitter https://t.co/Fwr7ZGdDJh",
    "290": "@TalkinNets Nets fans do not deserve harden anymore. Get him to philly. So underrated in Brooklyn. He deserves an actual fan base",
    "291": "@BrooklynNetcast Basketball God is not with the @BrooklynNets. Its like someone just gets hurt each and every time someone get healthy among the Big 3. And its really crazy to think that 1 injury to Kai is the reason @BrooklynNets loss last season. We are left w alot of what ifs…",
    "292": "#NBA,\n\n#Basketball,\n\n#NBATwitter,\n\n#WeGoHard, #Nets, #BrooklynNets, vs. #JazzNation, #TakeNote, #UtahJazz, #GoJazz, Get your best odds - fast at https://t.co/Ohl03KWAVe https://t.co/9i5Ip9WmUI",
    "293": "Wooo future Brooklyn Net Tyrese Maxey",
    "294": "Can already see eastern conference finals @sixers vs @BrooklynNets game 7 fourth quarter tied and Ben actually dunks it. https://t.co/9ErpufMLwZ",
    "295": "The Harden Brooklyn Net era was a short one 😂😂😂😂 https://t.co/AJjoyiL7yl",
    "296": "Are the Brooklyn Nets still the NBA title favorites despite their six-game losing streak!? #NetsWorld\n\nFull #NBA Finals odds:\n\nhttps://t.co/RvX0Vvft1H https://t.co/KoxMw1N0b4",
    "297": "Friends spin-off “Joey” lasted as many seasons as James Hardens’ Brooklyn Nets career. Tough day for Nets fans.",
    "298": "@ChrisAmos717 @NBAKrell Yes that makes sense but I think the nets best return for harden will be Simmons. Harden also free agent in the off-season. Also have you seen his body language on the court? He doesn’t want to be in Brooklyn. Also Kyrie is a bozo",
    "299": "Finally‼️ A place that I can talk about nothing but how my team is doing‼️ @TalkinNets @BrooklynNets Now let's kick some Jazz ass tonight and end this losing streak🤞🏻 #NumberOneFan",
    "300": "I know I should be covering this Harden business but my fiancé made us a homemade spa in our bathroom and honestly, it sounds like a much better option right now. Go #Nets and just remember, Kevin Durant will be back and playing for Brooklyn. P3ACE &amp; LOV3 to all #NetsWorld https://t.co/3CXaue9vYc",
    "301": "NOW - It's @OddCoupleFSR LIVE on FOX Sports Radio!\n\n@Chris_Broussard and @RobParkerFS1 discuss if the Brooklyn Nets should explore trading James Harden, and much more!\n\nLISTEN: https://t.co/WRKh0qsSiC https://t.co/a798jn4zPj",
    "302": "Simmons por Irving por favor @sixers @BrooklynNets",
    "303": "James Harden to the 76ers? Here's how it could happen (https://t.co/5AvbMDzwqY)\n\nThere's something funny about the term &amp;quot;rock bottom:&amp;quot; It implies the current situa...\n\nAdd your highlights:\nhttps://t.co/IkJtRbwN80\n #Brooklyn_Nets",
    "304": "Brooklyn Nets and PSG give me so much stress",
    "305": "My birthday is on Sunday, I thought I was gonna get a surprise full-time Kyrie. Instead I’m getting Harden forcing his way to Philly. Worst gift ever @BrooklynNets",
    "306": "@BrooklynNets please don’t😑🤦🏾‍♂️ https://t.co/ez8ZDonBrK",
    "307": "DO NOT TRADE HARDEN TO PHILLY @BrooklynNets",
    "308": "Brooklyn Nets crumbling?? The content I'm here for https://t.co/QlxvNUJhld",
    "309": "@TrillBroDude @btoporek Listening to this now and it’s even more true in light of this evening’s event but… Brooklyn Nets…sneak tank!?",
    "310": "@NBAComedy2 @BleacherReport @ShamsCharania Why did someone photoshop Jamie Foxx head on a Brooklyn Nets player?",
    "311": "@BrooklynNets figure it out",
    "312": "@brooklynnets85 @BrooklynNets Me that bought a kyrie jersey instead of a harden one: https://t.co/ZtBux57mEI",
    "313": "@rajonrondos nah but you making brooklyn unbeatable and i rather watch the sixers win than the nets win",
    "314": "It's crazy how this Brooklyn core went to garbage like that. I'm not gonna say the nets are done because if they get ben they could definitely win a title but KD Harden and Kyrie couldn't work for even a year? That's crazy",
    "315": "Ben Simmons is perfect for Brooklyn because he’s going to be in the big market which he probably wants, but he’ll only have to deal with the pressure from all 17 Nets fans.",
    "316": "@jakenisse @brooklynnets85 @BrooklynNets Harris at least was loyal to this org for a couple seasons",
    "317": "If the Brooklyn Nets decide to trade James Harden to the Philadelphia 76ers I want six first-round lottery picks because that's what we gave up to get him @NBA \nIf not Philadelphia can keep their problem child in Ben Simmons https://t.co/vsrJgvMknp",
    "318": "In #NBA news, the @BrooklynNets have reportedly softened their stance on trading James Harden ahead of the trade deadline. @sixers are interested in renewing talks of a Ben Simmons deal.",
    "319": "Nobody knows if this is true (time will tell), but it’s plausible. Nets fans can at least talk ourselves into believing this today.\n\nHas Harden even been a Top-25 player this season? If this is the best/youngest version of him left, it could be a blessing in disguise for Brooklyn https://t.co/as9TUWuPA8",
    "320": "@brooklynnets85 @BrooklynNets Ditto for Harris if he gets traded too… or is that just me 😬",
    "321": "I have said this many times about @NBA players.....\nThey are the biggest cry babies and should renounce themselves as athletes. @JHarden13 has been headache from the time he showed up with the @BrooklynNets &amp; @BenSimmons25 \"REFUSES\" to take the court.\n\n#NBA #NBAAllStar https://t.co/3JzYFSseFr",
    "322": "@brooklynnets85 @BrooklynNets All gear. I just bought a $30 Harden T-Shirt. If Harden gets traded, I should be able to swap that.",
    "323": "Jesus, @BrooklynNets please don't do this! We never got to see our trio out @KDTrey5, @JHarden13 and @KyrieIrving in savage mode! Save Harden, I beg you! We will win this season if everyone is healthy! PLEASE DO NOT CHANGE ANYONE OF THE TRIO! #NetsWorld #Nets #nba WE DO THIS! Yo!",
    "324": "Allow Nets fans to swap their Harden jerseys @BrooklynNets",
    "325": "@BrooklynNets please trade the real team cancer for someone who will play and try in the games, Ben Simmons. 25 year old multi time all star is the defensive stopper we NEED. Kyrie and him will be UNSTOPPABLE on the floor with all the games they play in",
    "326": "NBA plays:\n\nCleveland Cavaliers +6       (-110)     1u\nChicago Bulls +1.5               (-110)     1u\nBrooklyn Nets +6                 (-110)     1u\n\n#BullsNation  #NetsWorld #Cavaliers",
    "327": "@YoungBoyHeavy The Brooklyn nets ??????",
    "328": "@JHarden13 is committed to the @BrooklynNets",
    "329": "The Brooklyn Nets are reportedly open to discussing a blockbuster trade with the Philadelphia 76ers that would reshape the conference.  https://t.co/6lnJlGOkvN",
    "330": "@MarcosJBrenes @losnbafreaks @ShamsCharania @sixers @BrooklynNets Brad Beal",
    "331": "Pretty hilarious in retrospect that the Cavs got the Nets pick (that became Sexton) in the Kyrie trade and then basically got Jarrett Allen for free because Harden wanted to play with Kyrie in Brooklyn",
    "332": "BROOKLYN vs. UTAH - Totals Prediction = 40.71% going UNDER #Nets #Jazz  Full odds at https://t.co/nUn5OcMhOI",
    "333": "Extra pieces like Thybulle, picks, etc, for Harden, sure. But I just don't think Maxey will/should need to be included in a deal, if Harden is unhappy and the Nets are worried he'll want to leave in the summer. I don't see Brooklyn having enough leverage to get Maxey. https://t.co/dAlHbAEOGg",
    "334": "@RealCodyMallory And to achieve that success, @BrooklynNets has to part w the questionable coaching of Nash.",
    "335": "Harden has played more minutes in 1 season for BKN last year than Kyrie has in 3 years, fyi \n\nI love that Nets fans put their faith in an anti-vaxxer and completely abandon the one man that has been a consistent in this Big 3 Brooklyn era https://t.co/YqppzE69EB",
    "336": "Report: Nets open to discussing James Harden for Ben Simmons trade before deadline #Brooklyn #Nets #NBA https://t.co/dybKVl5auK",
    "337": "@M2qestro @gxdlxix @kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz I’m using games that he played in dumbass and there have only been 2 games this season where most of the starters sat so stfu😂 even over the last 10 games they have a worse defensive rating than when Draymond plays🤡",
    "338": "RT NYPost_Lewis: Joe Harris says in his mind he’s confident he can come back this season. Adds he needed to be patient through this. #nets #BrooklynNets",
    "339": "Ben Simmons for harden do it @BrooklynNets",
    "340": "@Hassanweliyo @piggypanda123 @kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz I’m not saying they’re mid mid LOL I meant they were mid in the charts. I’m a Hawks fan too and it’s been so frustrating that we never got any games suspended even tho we were playing guys like Cat Barber",
    "341": "Wow, Davion shut down James Harden so bad on Wednesday that @BrooklynNets wants to trade him",
    "342": "@BrooklynNets @Patty_Mills 🙏🏼🙏🏼🙏🏼🙏🏼Nets must be so very thankful for Mills! Plays with heart❤️",
    "343": "Now on @ForbesSports \n\nBrooklyn Nets, Philadelphia Sixers Open To Discussing A James Harden-Ben Simmons Trade: ‘The Ball Is Is in The Nets' Court'\nhttps://t.co/z1EdXubT9M",
    "344": "The Brooklyn Nets are the biggest embarrassing in the NBA and niggas gonna let that shit slide but nope… not me",
    "345": "After this @NewYorker cover came out last year and @JHarden13’s @nyknicks dis… I LOVE seeing the @BrooklynNets fail… especially 🧔🏾‍♂️ #TheBeard! Lol! https://t.co/8kJDlpzzdd",
    "346": "Should the @BrooklynNets swap prima donna stars with the @sixers? (@JHarden13 for @BenSimmons25 )\n\n#NBA #NBAAllStar #NetsWorld",
    "347": "76ers flipping Simmons for Harden was always the #1 trade option to them. It changed when Houston sent him to Nets, and their Big 3 formed.\n\nNow w/rumors of Harden being unhappy in Brooklyn (whether it be the city/Kyrie playing part-time/whatever) it only ⬆️ 76ers hope of +Harden",
    "348": "@BrooklynNets make that trade happen!",
    "349": "It’s been said but it’s funny the Nets got no actual fans from Brooklyn and it’s jus Kyrie/KD/Harden stans on twitter",
    "350": "Nets fans are forcing James Harden out of Brooklyn!",
    "351": "Not so easy to build a big 3 now is it? @BrooklynNets",
    "352": "Nets fans defending Ben Simmons once he gets to Brooklyn https://t.co/rj3gSEP0S8",
    "353": "NBA Trade Deadline is in less than 1 week\n\nThe Brooklyn Nets are willing to discuss a potential James Harden trade with the Philadelphia 76ers...\n\nAre the @sixers NBA Championship favourites if they can acquire @JHarden13?\n\n#NBA #jamesharden #NBATradeDeadline https://t.co/5qfMt0C4Oy",
    "354": "James Harden hasn't even been in Brooklyn 14 months, and the Nets already are thinking about unloading him.\nhttps://t.co/W2oQn9gi3I",
    "355": "@samtrayter @BrooklynNets You were right about Kyrie lmao",
    "356": "Fuck it I'm a fake Brooklyn Nets fan now 😭 https://t.co/Nk6RuIeOKK",
    "357": "NBA Game Preview: The Utah Jazz have a forecast 55% chance to win against The Brooklyn Nets with a spread of -1.5/1.5 and an over/under of 224. The Utah Jazz are 0 - 0 against The Brooklyn Nets in the 2021-22 Season.\n#betthetrend",
    "358": "The Brooklyn Nets are an NFT",
    "359": "@BillyReinhardt This is not true. Last January was terrible for the Brooklyn Nets.",
    "360": "Nets Open to Harden Trade 😱: Here. We. Go. Brooklyn and Philly are expected to discuss Ben Simmons-James Harden trade before deadline (Shams)\n\nhttps://t.co/TVby1QkSbF",
    "361": "I was actually starting to like Harden as a Nets player - dug the Mills-Beard backcourt. Interestingly, Brooklyn could end up with 3 Australian-born players. #nbatrade",
    "362": "Although his tenure with the Clippers was short, I'll never forget seeing @EBled2 lead one of #ClipperNation to one of its best comebacks against the Brooklyn Nets. No Paul George, no Kawhi Leonard, no Luke Kennard, no Marcus Morris, no problem. \n\nEric Bledsoe, everyone. https://t.co/IYvhmndxZQ",
    "363": "The 76ers are expected to \"pursue\" Nets' James Harden ahead of Thursday trade deadline, per @ShamsCharania\n\nBrooklyn is reportedly open to discussing a deal.",
    "364": "How KD and Kyrie are doing James Harden to bring Ben Simmons to the Brooklyn Nets https://t.co/8zVYDpnk2Y",
    "365": "@Jo_GotGame @shoptier @BrooklynNets Congrats!!!!",
    "366": "@Reidsjustvibin Anyways, In his Brooklyn Net’s Debut, Kyrie Irving put up:\n\n▪️50 Points\n▪️7 Assists\n▪️8 Rebounds\n▪️0 Turnovers\n▪️51-50-90 splits\n\nNearly Hit a Circus Shot Game Winner in OT! https://t.co/wWQ9vzRMQ0",
    "367": "Brooklyn Nets vs Utah Jazz Either Team 8pts or Less (+100) #nba #sportspicks #gamblingtwitter #nfts #nftcollectors https://t.co/eifcLuMmln",
    "368": "@i94podcast @PhoenixMercury @WNBA Bang or bust. If they can’t get the players to glue … they will be like the Brooklyn nets…",
    "369": "@bostonsbestkyle @kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz We have been in the last 15 games we’re 10-5 had a bad start to this year missing a bunch of guys but we’ve shown up over the last 15 hopefully we keep the momentum we’ve been playing with",
    "370": "James Harden leaving the Brooklyn Nets big three? That would be a headline because they were made to be in the Finals.",
    "371": ". @BrooklynNets yo can you take Tobias too?",
    "372": "NBA Trade Rumors: Brooklyn Nets open to trading James Harden ahead of trade deadline https://t.co/69Bth34ipn",
    "373": "The @BrooklynNets “Big Three” have only played in 16 games together… 😬\n\nVia @statmuse https://t.co/XUIuDQHXa3",
    "374": "@JHarden13 @KyrieIrving @KDTrey5 @BrooklynNets @KWorkhard Missing piece 🙏🏾🕊⏱👑 https://t.co/JAQsb3n3Lp",
    "375": "All those Brooklyn Nets fans who blocked me last year because I said your team were frauds are all sick to the stomach.\n\nHarden about to dip.\n\nServes you right you a-holes",
    "376": "I am going to love watching this Brooklyn Nets super team implode lmao",
    "377": "Manutd doing bad, Brooklyn Nets, currently d worst NBA team, Omo.... Who make me like sports sef?",
    "378": "@BrooklynNets don’t trade harden!!! Trade that mf Kyrie!!!",
    "379": "@mhc_76 Everything about the nets since the Brooklyn move has been forced and weird",
    "380": "@ChrisKirschner Many may call me crazy, but originally the Nets were strongly against any trade of Harden and then the Hawks get healthy and go on this streak. Truthfully the only team that can stop Philly and Brooklyn are the Hawks. They were watching TNT last night 👀",
    "381": "Nets should just not trade him if that’s the package only 3 teams besides Brooklyn can sign him anyway and their all lottery teams lmao https://t.co/jfpAU9bcbL",
    "382": "I am not sure if a Sixers-Nets trade will materialize but if Harden wants out of Brooklyn, Daryl Morey won't pay a bounty to acquire him. It's probably Simmons + Shake or Kork, and some draft capital",
    "383": "idey support this finished club eno dey pick, idey support brooklyn nets too eno dey pick ei😂",
    "384": "Excited for a Sixers-Nets playoff series after this ttade in which Kyrie Irving doesn’t play in any of the games in Brooklyn and Ben Simmons doesn’t play in any of the games in Philly",
    "385": "I personally hate the Nets because when the FIRST got to Brooklyn back in 2012 or whatever they came in talking hot shit how “they’re the real NY team” &amp; “NY finally has a team to root for” when they haven’t done shit themselves… I’ll forever pray on their downfall fr https://t.co/l7yGxglrM8",
    "386": "The Brooklyn nets won’t win a championship with Kevin durant. I thought this even if harden didn’t want out this year. We just cannot get the pieces to fall.",
    "387": "@BrooklynNets you better leave 76ers trades alone let's go to Portland and save @Dame_Lillard",
    "388": "Will the Sixers really deplete their team for a guy like Harden who can become spaced out at any second while also looking like he’s lost a step? If you are Brooklyn it’s a no brainer to get the depth of talent back from Philly in a deal. #NBA #Harden #Sixers #Nets",
    "389": "Brooklyn Nets, Philadelphia 76ers to discuss blockbuster James Harden, Ben Simmons trade https://t.co/Jzold5alnA #NBA #BrooklynNets #Philadelphia76ers",
    "390": "@DovinAustin @BrooklynNets Yuuup... It's unfortunate, really.",
    "391": "gone be so funny when brooklyn play the 76ers in the first round and patty mills gone be the best option for the nets😭😭😭",
    "392": "Things have been rocky since James Harden got to Brooklyn. Kyrie part-time, injuries, COVID, and his own inconsistency this season.\n\nHe’s frustrated and he’s a free agent this summer. The Big 3 has hardly played together… Nets would be foolish if they didn’t field calls.",
    "393": "@BrooklynNets DONT AND I MEAN DONT FUCCIN TRADE HARDEN TO PHILLY... WHY MAKE YOUR RIVAL STRONGER!!!!",
    "394": "@M2qestro @gxdlxix @kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz What the fuck are you talking about https://t.co/HMuxHeWviI",
    "395": "@sadt0m_ How can I cut ties with dis club they way I did with Brooklyn nets",
    "396": "Two players the Clippers could pick up if the Brooklyn Nets blow it up:\nJames Harden and Kevin Durant. Harden is a free agent so it would have to be a sign and trade",
    "397": "Ben Simmons analysis, 2019: The Point Big Man https://t.co/Fv7ugXVJic via @YouTube\n\nMake it happen @BrooklynNets",
    "398": "Will Utah jazz beat the Brooklyn Nets?\n@TheKemi_Y",
    "399": "The Brooklyn Nets have 6 fans https://t.co/AkRbBRru3B",
    "400": "Please don't do this @BrooklynNets https://t.co/PfP043Xnms",
    "401": "DOES ANYBODY WANT RUSSELL WESTBROOK FROM US @ATLHawks @Clippers @memgrizz @BrooklynNets @nyknicks @sixers @PelicansNBA @hornets @DetroitPistons @trailblazers @utahjazz @Suns @cavs @Twolves @celtics @warriors @Bucks @MiamiHEAT @HoustonRockets @Raptors PLEASE HELP.",
    "402": "The premium, if you’re Brooklyn, is doing this now vs. summer. Nets should hold out for a shooter. https://t.co/QlPT1JgJ9r",
    "403": "🤦🏻‍♂️ but also 🤩 @sixers @BrooklynNets https://t.co/cHtW8XL3B4",
    "404": "The Brooklyn Nets gave up Caris LeVert and Jarrett Allen for Slim Mark Henry with a 4PF chain??? https://t.co/wbXIM9QvkY",
    "405": "@peemanor @dotfag Eeyah....\nNo be say e go better for Ole sha but still on still he's a bastard but tonight is not for him.. His time will come again eventually, but for now my focus is on whether Utah jazz will beat Brooklyn Nets",
    "406": "Apparently James Harden is being shopped by the Brooklyn Nets… So much for the big 3 with Durant and Irving. I guess it’s best that they get something in return if he was planning to leave during free agency anyway. #NetsWorld",
    "407": "@MrChuckD @BrooklynNets @SiriusXMNBA @TermineRadio @Jumpshot8 Please. In the end the dude cave to the pressure of the playoffs. Wishful thinking at best. #Sixers",
    "408": "@BlazersArgento @BrooklynNets 18 millones Bledsoe  y no es expiring. https://t.co/rpvHYNGO69",
    "409": "Nets now open to trading James Harden, according to reports\n\nJames Harden of the Brooklyn Nets reacts during action against the Los Angeles Lakers at Barclays Center on January 25, 2022 in the Brooklyn borough of New York City.\n\nMichelle Farsi/Getty Imag… https://t.co/LRdrGrDsXB",
    "410": "Really hope this Ben Simmons deal clicks! Brooklyn Nets should get Christian Woods too asap",
    "411": "Brooklyn nets are one the biggest disappointments of all time",
    "412": "I care for JH but I like him in the Nets with KD, Kyrie, and LaMarcus. 76ers have nothing to help Brooklyn https://t.co/o7xPJqeD3S",
    "413": "🏆$1000 Risk Free Bet on ANY Brooklyn Nets wager with FanDuel🏆\n\nTonight. Only. 😤\n\n1️⃣ Claim your EXCLUSIVE Free Bet https://t.co/G2cmMzcAj7\n2️⃣ Bet on ANY Nets wager 💪\n3️⃣ Win $1000 if your bet hits, no harm if it doesn’t 🥱\n\nT&amp;Cs Apply. https://t.co/zJwg67tu8J",
    "414": "The 2021 Brooklyn Nets…👀 https://t.co/AYVraLBx48",
    "415": "Another Eagle flashback to when @EagleBronx played at the @barclayscenter in Brooklyn. Check them out tonight at the home of the @BrooklynNets against Albany’s own @GreenTechHigh. 🦅🦅 https://t.co/R29ZqYICy8",
    "416": "@therealmikekb matisse thybulle you are a Brooklyn Net",
    "417": "@rchahal19 @sixers @BrooklynNets I just know you going through it now",
    "418": "@Reidsjustvibin Jarrett Allen is an American professional basketball player for the Cleveland Cavaliers of the National Basketball Association. He played college basketball for the Texas Longhorns. Allen was selected 22nd overall by the Brooklyn Nets. In January 2021, he was traded to the Cavs. https://t.co/hwP4hVCgg2",
    "419": "Nets fans calling themselves a championship organization has me DYING I’m so sorry @PodThorn I know you love Brooklyn but you might have to get out while you can your fanbase doesn’t understand logic",
    "420": "@Bonbra2 @JTGatlin @ShamsCharania @TheAthletic Cause his current team didn't work with there 2nd best player. If the Brooklyn nets are dumb enough to do the same thing then u have a point. Then I would just counter they just do the same what Morey is doing now. Trade him for another good player lol. Again it's about the asset",
    "421": "NBA Trade Rumors: Brooklyn Nets open to trading James Harden ahead of trade deadline | PhillyVoice 👀 #nbatwitter https://t.co/4C0Y51Pv1j",
    "422": "Harden on the Sixers &gt; Nets, but Brooklyn is also stupid if they get rid of him lol",
    "423": "it makes no logistical sense for the Brooklyn Nets, in a very winnable eastern conference, to trade James Harden to Philly… Like why would you trade him to another team competing in the east",
    "424": "@kurt_holt6 @Nocanthear @BrooklynNets I want it to happen at this point",
    "425": "“Brooklyn Nets are willing to trade James Harden at the deadline?”: NBA Twitter and Reddit moved hard by Nets superstar seemingly wanting to join Joel Embiid in Philadelphia https://t.co/wgMBMeYkGt",
    "426": "Actually, this is more fair for Harden and Simmons - Both teams get some depth + upside from Cam Thomas  @sixers @BrooklynNets https://t.co/NbqGrDXfho",
    "427": "Watching the Brooklyn Nets melt down in real time",
    "428": "@DovinAustin @BrooklynNets He has been pretty public about being unhappy in Brooklyn. Apparently he doesn't like living in Brooklyn and he isnt happy with the coaching. He scored 4 points against the Kings a couple days ago. Not happy = no effort.",
    "429": "@Ben__Nadeau @dbearak Bro, he told the nets org that he’s committed to winning in Brooklyn and the nets are NOT listening to offers . Why is this even a discussion? https://t.co/vFfz2zBeX4",
    "430": "NBA Trade Rumors: Brooklyn Nets open to trading James Harden https://t.co/M62QH5oixB",
    "431": "Brooklyn is “enamored” by #Celtics center Al Horford, and a deal between the two centered around #Nets guard James Harden is being described as “a done deal”, league sources tell AFSN.",
    "432": "Sean marks bout to play chest😎😎. Who knows what Daryl Morrey will give us to get his white whale😎😎 @BrooklynNets",
    "433": "Praying for the Brooklyn Nets https://t.co/u4O7iiWKnA",
    "434": "Brooklyn gonna want Seth and Ben lol Harden will be a net until the offseason",
    "435": "Don’t ever compare the Brooklyn Nets to the #Rockets lmao what da hell do y’all be smokin? https://t.co/2r1nZXwoBn",
    "436": "James Harden on Trading block  and #Sixers  front runner as per @ShamsCharania\n\n@BrooklynNets Big 3  Harden, Kevin Durant, and Kyrie Irving  just play 16 games together if James Harden is gone before trade deadline .\n#NBAAllStar #NBATradeDeadline #Nets https://t.co/qBKR2yythA",
    "437": "If #Sixers Morey trades Simmons to #Nets, he will have given them the missing piece they need to win championships. Brooklyn doesn't Ben to handle or score. All he needs to do is be an All-NBA Defender that he already is and grab boards. Morey, trade Simmons to the west coast.",
    "438": "I need nick wright to do a take like Ben Simmons, as an act of penance, is purposely getting himself traded to Brooklyn to sabotage the nets",
    "439": "🏀 BREAKING: Philadelphia 76ers will pursue James Harden through a trade ahead of next week’s deadline &amp; the Brooklyn Nets are now open to discussing a deal, according to Shams Charania. \n\n👉 The deal would include Ben Simmons. \n\n🤔 Thoughts?\n\n#nba #basketball https://t.co/D49cVTfLFi",
    "440": "@gxdlxix @kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz 101.9 Drtg (1st) w/ Draymond\n109.1 Drtg (12th) w/o Draymond\n\nPlease do research before you say shit",
    "441": "Brooklyn Nets also about to stress me. God what have I done to deserve all this torture, even in sports? 😭😭😭😭😭😭 https://t.co/n8Fz7DruYr",
    "442": "If the @sixers get @JHarden13 and the @BrooklynNets get @BenSimmons both teams are going to the eastern conference finals, go argue with a horse https://t.co/TXgl4GH08u",
    "443": "@BrooklynNets man dont trade that dude we tryna win not get a dude that clog the paint🤬🤬🤬",
    "444": "@brooklynnets85 the Nets don't have 4 shooters. that's why Harden hasnt been able to get wins for brooklyn either",
    "445": "The last Brooklyn Net might be Jevon Carter, James Johnson or DeAndre Bembry",
    "446": "News flying around the #NBA about Harden's seemingly imminent departure from the #BrooklynNets.\nWould not be surprised if the Nets also find a trade partner for Irving, if they can move him. His stance on the vax mandate could continue next season, final year of his Nets contract",
    "447": "@Jmoney20 @BrooklynNets Come on harden for Simmons. Harden Embid would love it",
    "448": "I don’t understand why Philly would trade Ben to Brooklyn. They do realize Brooklyn’s one problem is DEFENSE! You’d be making your completion unstoppable. Idk about this one Daryl Morey. #76ers #Harden #BenSimmons #Nets",
    "449": "alright @KangzDraft and I agree, the package for james harden will be similar to this\n\nBrooklyn Nets Receive\nBen Simmons, Danny Green, Furkan Korkmaz, 2 firsts\n\nPhiladelphia 76ers Receive\nJames Harden, Paul Millsap, Jevon Carter https://t.co/3lgMsgjDRv",
    "450": "@loscontrarian I’d do it in a heartbeat though if I’m the Nets. It’s just risky for this year. Ben will love Brooklyn and NY.",
    "451": "According to Shams Charania, The Sixers and the Brooklyn Nets are discussing a James Harden trade for the disgruntled forward Ben Simmons ahead of the trade deadline which is on Thursday next week. #sixers67 https://t.co/iHfIaL6kdB",
    "452": ".@BrooklynNets win please.",
    "453": "Is James Harden's time in Brooklyn coming to an end?\n\n@bennyhorowitz1 &amp; @deny_gallagher discuss the guard's role with the Nets and what his future is with the organization on Episode 118. \n\n🟩 https://t.co/m1atcreNGH https://t.co/mtNwtTABoR",
    "454": "@BrooklynNets do the trade! Im sick of James Harden",
    "455": "Also wonder if the Joe Harris news drop by Bartlestein is partly because they heard of a possible Harden deal that brings Seth Curry to Brooklyn.  And after getting Curry, the Nets send Harris out somewhere else for another piece.",
    "456": "Dude wants out of Brooklyn , Ben out of Philly.. Easy decision I don’t understand anything the 76ers or the Nets do as a franchise. Throw part time Kyrie in. It’s funny the 2 best teams in East have players who don’t “feel like playing” Fans don’t matter / we just pay the check. https://t.co/laWs58ODgO",
    "457": "@BrooklynNets @JHarden13 Please stick out the season. Wait for a fully healthy roster… change up the spacing and hire a new coach. I can’t see one of my favourite players leave my favourite team 🙏",
    "458": "@The_PhifthQ Harden has likely told Brooklyn he doesn't plan to re-sign\n\nso we have leverage\n\na generous offer would be Simmons, Thybulle, Green, and a first round pick. That gives the Nets flexibility and a guy on a 4 year extension, and the chance to re-sign Tisse with Bird rights",
    "459": "According to @ShamsCharania Brooklyn @Nets are open to trade discussions with the Philadelphia @sixers for a possible deal for Guard James Harden...\n\n... will the two sides get a deal done before the NBA Trade deadline??? (Feb 10.) https://t.co/H4NrANWV2r",
    "460": "Kyrie Irving refusing to get a needle being the end of a Brooklyn Nets dynasty and the end of James Harden Nets career is an All time NBA DYK",
    "461": "@Keith_McPherson praying 🙏for a miracle 🙏✨BROOKLYN NETS MIRACLE..PRAYING FOR AN UPSET...",
    "462": "Sixers to pursue Harden before deadline; Nets open to talking #Brooklyn #Nets #NBA https://t.co/NAEmHWHhe3",
    "463": "[📺LIVE - 03H00] 🏀 #NBA\nBrooklyn #Nets @ Utah #Jazz en direct sur beIN SPORTS 1\n#NBAextra",
    "464": "@ShamsCharania @TheAthletic We gave up @_bigjayy_ for nothing……..@BrooklynNets your kidding right",
    "465": "This is nuts.\n\nThe Brooklyn Nets should be all over this.\n\nI would swap James Harden for Ben Simmons any day. https://t.co/ddertEh90o",
    "466": "Ummhmm RT @ShamsCharania Sources: The Philadelphia 76ers are expected to pursue Brooklyn's James Harden ahead of NBA trade deadline Thursday – and the Nets are now open to discussing a deal.\n\nDetails on @TheAthletic: https://t.co/UmCJpfcOF6",
    "467": "In this episodthe homies are joined by special guest @DatDude_X to discuss the state of the New York Knicks and Brooklyn Nets, Julius Randle's trade value, and Brian Flores lawsuit against the NFL\nhttps://t.co/0jF4SG7Ues\nhttps://t.co/OHGzExY5Bd",
    "468": "@Keith_McPherson it's going to take a miracle from God for the Brooklyn NETS to get a win against the UTAH JAZZ...this sterch is a way for Steve Nash to see what the NETS HAVE AND WHAT THEY DON'T HAVE going for the championship..wait n see like you said last night..",
    "469": "@TrellHunch00 @BrooklynNets I don’t want that. Catch me next game. ✌🏽",
    "470": "The Top 10 Plays From The Brooklyn Nets Big 3 From The 2020-21 Season\nhttps://t.co/AtypNdLEAH",
    "471": "@nicolhay I don't disagree necessarily.\nJust think it's funny we would never get to see the Nets Big Three together go for a playoff run after all the buzz and anticipation.\nI think whether it's a definite positive for Brooklyn probably depends on wtf the plan is for Kyrie?",
    "472": "Ben Simmons to the Brooklyn Nets is the best kind of situation for him to be in.",
    "473": "@aydenfranco_ @greenbean3742 @BrooklynNets Hell no",
    "474": "@BrooklynNets I heard Kyrie is back on the court plying road games !",
    "475": "@JeremyDavisNY @BrooklynNets Wait what happened?",
    "476": "@TheAverageJohn5 Brooklyn Nets, we hardly knew ya",
    "477": "No HARDEN...Is it mental or physical?? Quit mode. #BrooklynNets",
    "478": "@coach_thomp @BrooklynNets U get 10 🤷🏾‍♂️ u was a know show for our big bet against the warriors and no show for the suns I didn’t get a text at all🤦🏾‍♂️🤦🏾‍♂️",
    "479": "Brooklyn Nets. Where stars career go to die.",
    "480": "@TrellHunch00 @BrooklynNets He was by himself. Do I look like a fool. All the other 4 starters didn’t play. Do we have a bet? You still 5 in the hole",
    "481": "@BrooklynNets Really,,",
    "482": "i remember when mfs was talking \" Scary hours😂😂😭💀💀💀 with Brooklyn Nets dont make me laugh brooo.",
    "483": "@BrooklynNets need to make this Harden for Simmons deal quickly!",
    "484": "@TrellHunch00 @BrooklynNets $20 or no bet",
    "485": "@coach_thomp @BrooklynNets Played the suns warriors u a no show 😭😭",
    "486": "@TrellHunch00 @BrooklynNets I want the $20",
    "487": "If the playoffs started today. Eastern conference 3-6 matchup:\nThe Philadelphia 76ers and the Brooklyn Nets",
    "488": "@coach_thomp @BrooklynNets U get a lil 10 from lying to me saying I get all the action when he back I talked u into this bet it’s good.",
    "489": "@NyxRockets @TeeLowLoreman @olmann_p @AguerosRolando @citadelleleit @JTGatlin @ShamsCharania @TheAthletic These dudes really believe the BROOKLYN NETS will be a perennial contender for 6 years in a row lmao I’m not sure if they’re trolling or genuinely believe that bullshit",
    "490": "Please DO NOT trade for Simmons ☹️ @BrooklynNets",
    "491": "@PazTjt @BrooklynNets Giving/ collecting… same thing.. no different that Nigerian email scams…ministries, preachers, fancy houses , clothes on the backs of the church folks is still a hustle",
    "492": "@TrellHunch00 @BrooklynNets Bet good or not? Or you just want to argue? lol",
    "493": "What a sad day @BrooklynNets",
    "494": "ta foda torcer pro brooklyn nets https://t.co/sueUx3xFXX",
    "495": "@coach_thomp @BrooklynNets Somebody must not be playing or cus I called u out on u telling me I had all the action when he back which one😭😭?",
    "496": "@TrellHunch00 @BrooklynNets We don’t respect him and neither do the Rockets. You different lol https://t.co/5N08EfzLBq",
    "497": "I think the Nets and Sixers should make the Harden for Ben deal asap. Obviously Brooklyn is easily going to get Maxey and some picks in addition but yeah both sides need to get it done. Neither play wants be on their current team and it would help out both sides.",
    "498": "@BrooklynNets  @Giants  and @MiamiDolphins  take huge hits this week.  Great stuff @EvanRobertsWFAN",
    "499": "@TrellHunch00 @BrooklynNets Bet good tonight. What you wanna do?",
    "500": "Brooklyn doesn’t care about the Nets lol https://t.co/kjY8uemjcR",
    "501": "@EdgeofSports And the nets have Morey by the neck on this trade.  Can Morey legitimately refuse a Simmons +Tybulle or Maxey trade? Brooklyn will get Simmons and their pick of role players off the sixers",
    "502": "@Bluvny @BrooklynNets We give electronically so do you have anything better than that?",
    "503": "@coach_thomp @BrooklynNets Ain’t looking like it The beard want out 🤦🏾‍♂️ he ain’t got time for part time players.",
    "504": "@SeanDZWalsh @BrooklynNets Official store of the Bro.",
    "505": "once the brooklyn nets are mentioned in rumors–it's bound to happen",
    "506": "The Brooklyn Nets are looking to trade Harden in the coming hours. Harden reportedly choked Irving in the locker room for not playing in home games. Nash was furious and kicked Harden out of practice, sources tell @HVNHOOPS",
    "507": "@BrooklynNets I say +25 @utahjazz it’s impossible to win tonight we lack too many important players to win !!",
    "508": "@coach_thomp @BrooklynNets 6 games ain’t looking good buddy dribble dribble then Lose it look good🔥😭 u said I could get all the action when Kyrie back that aged well .",
    "509": "@TreyBallJays @kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz keep up that same energy!! us real celtics fans been here since day one",
    "510": "Trade kyrie too @BrooklynNets",
    "511": "@TrellHunch00 @BrooklynNets They can. What you talking about? Yea you just want to argue. You looking bad out here my boy lol",
    "512": "@rodimusprime It's obvious...\"Brooklyn\" sucks not the Brooklyn nets...but Brooklyn it's cold and grimey... Ain't a lot of bitches in NY either.... And quiet as kept KD fragile",
    "513": "the brooklyn nets is reportedly open to discussing a trade deal after the 76ers are expected to \"pursue\": james harden and ben simmons(?)\n\nthe nets' captain, kevin durant: https://t.co/HA4kiMbuQR",
    "514": "NBA LIVE TODAY🔴 Brooklyn Nets vs Utah Jazz - 4th February 2022 | NBA Ful... https://t.co/zrRabBRMvh",
    "515": "@BrooklynNets trade for @buddyhield if ya get benjamin",
    "516": "Not now, @BrooklynNets https://t.co/TknmtR8POz",
    "517": "Ben Simmons, Seth curry, and Thybulle for harden make it happen🤝 @BrooklynNets",
    "518": "A little #flashback to when @EagleAcademyBK played at the @barclayscenter on Nov. 28th, during The Sunday Service. Tonight, they will be playing at the home of the @BrooklynNets once again, against @ecsnyc at 7:45 PM. https://t.co/6AxdYDS17o",
    "519": "The Brooklyn Nets hired a coach who has zero experience and refuse to sack him because he's a friend of the GM. Kyrie refuses to get a simple vaccination and KD can't stay healthy. \n\nJames Harden has every right to be frustrated and want out.",
    "520": "#Nets now open to a trade for #JamesHarden and #76ers are in pursuit!!\nWOW!!\nHopefully #Brooklyn gets #bensimmons and another player(s) in the deal to sweeten the package(Seth Curry,Tyrese Maxey,Matisse Thybulle).\nStay tuned!!\nThursday is the trade deadline.\n#NBA #NBATwitterLive https://t.co/HDcEZLQSXl",
    "521": "@coach_thomp @BrooklynNets Nigga please for the trigger squeeze u said they could play together😭😭.",
    "522": "Taking Brooklyn Nets tonight + 6 for 20 Units - taking this puppy to pound town https://t.co/2P0URbs0AV",
    "523": "@BrooklynNets Yes we going to lose a match again tell us just who is available we’ll save time it’s unbelievable , Harden , Durant , Harris and Aldridge are out !!",
    "524": "Not one Brooklyn Net’s fan better be on twitter begging Ben Simmons to shoot… nah, if his man leaves him to go double Kyrie or KD… sprint yo 6’10 ass to that paint and go get that rebound my boi…",
    "525": "I’ll gladly take Simmons, Curry, Thybulle and some draft picks for Harden. I wouldn’t even blinks @BrooklynNets",
    "526": "Has James Harden played his last game as a Brooklyn Net?",
    "527": "@BrooklynNetcast How is this fanbase going to react making harden an all star ? He probably got many KD and Kyrie  fan base votes and he possibly won't be a brooklyn Net soon enough.",
    "528": "Harden for Simmons that would be dumb! @BrooklynNets",
    "529": "@SpencerKeele @BrooklynNets @utahjazz Speak it into existence🙏🙏🙏",
    "530": "@kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz all the “Celtics fans” who were negative/degrading this team at the beginning of the year, just keep that same energy",
    "531": "Maya Jama in a Brooklyn nets shirt? https://t.co/5GOkZ9b9oS",
    "532": "@Pauu_IR Brooklyn Nets",
    "533": "🏀 Big 9 game #NBA slate to sink our teeth into today. Our #NBA expert @MattAbrahams1 previews three of the biggest games including \n@cavs x @hornets \n@BrooklynNets x @utahjazz \n@sixers x @dallasmavs \n\n📝 Preview: https://t.co/8av1dJAmjX\n📈 Markets: https://t.co/YE2UkAAurV https://t.co/UTnEtmf9AN",
    "534": "@Shxilind @BrooklynNets @sixers They also need to you know actually negotiate it\n\n*Ahem* MLB",
    "535": "@Ddelliponti08 @BrooklynNets He don’t want play for this team so you have to trade him",
    "536": "@Shxilind @BrooklynNets @sixers This tye of trade doesn't happen until the morning of the deadline sadly",
    "537": "Potential starting lineup for the Brooklyn nets \n\nBen Simmons \nKyrie Irving \nJoe Harris \nKD\nClaxton \n\nBench - Seth curry, tyrese maxey, patty mills Kessler Edwards, cam Thomas, LMA,",
    "538": "@TrellHunch00 @BrooklynNets Harden fucking up his 4th team. We been off Harden this season. Where you been at?",
    "539": "@UVaHoopsRiffs @BrooklynNets @joeharrisbball Now that's a man.",
    "540": "@darealjlaw @SacramentoKings The KD only nets in Brooklyn? I think we got a shot lol",
    "541": "Disagree. Nets would play with a ton of pace. Kyrie Irving’s ability to play off-ball would help.\n\nBen Simmons would be able be himself in Brooklyn. https://t.co/FpehdvpYtM",
    "542": "@coach_thomp @BrooklynNets Yeah u said u was harden fan now he with nets and changed his game yo words😭😭 now this cus Kyrie fucking up his 3 rd team😭",
    "543": "I am over the @BrooklynNets. Trade Kyrie. Trade Harden. Build around KD.",
    "544": "The Nets completely falling apart makes me so happy. I needed a little extra happiness rn. Thanks @BrooklynNets  🙏",
    "545": "YA KNOW HES NOT COMINT BACK, MIGHT AS WELL DEAL HIM @BrooklynNets",
    "546": "@perrylander_ The Rockets own the Nets picks until 2027.\n\n I will say, the best case scenario is for Harden to walk in  this upcoming FA, but the trade Houston made with Brooklyn looks a lot better with Harden leaving the Nets this soon.",
    "547": "The Brooklyn Nets FIRED Kenny Atkinson to appease Kevin Durant and Kyrie Irving \n\nThe Brooklyn Nets traded for James Harden to appease Kevin Durant.\n\nSteve Nash is a HORRIBLE Head Coach \n\nJames Harden QUIT on the Brooklyn Nets and will be traded shortly \n\n🤔",
    "548": "@theBKbig3 Dark day for the Brooklyn Nets.",
    "549": "@TrellHunch00 @BrooklynNets Nets still in 4. We don’t need him. You know how I felt about him 🤷🏽‍♂️",
    "550": "So if Harden is traded once more is he gonna get the Russ treatment same narrative? 2 years 2 teams although Russ didn’t underperform until LA \nOne can argue Harden has been a disappointment in Brooklyn 👀👀👀\nEither Rest In Piss to the Nets",
    "551": "@BrooklynNets if y’all trade James for Ben, I swear https://t.co/F2voVDxSlM",
    "552": "Beyond ECSTATIC to announce I will be joining the crew @TheBKGame as a contributor where I will continue to learn and pursue my dreams of becoming a Brooklyn Nets reporter\n\nThank you for everyone who has/will continue to rock with me, none of this happens without you\n\n#NetsWorld",
    "553": "The Harden leak means one of two things:\n\n1. Brooklyn knows he's gone this summer.\n\n2. The Nets want to fuck with a rival and keep them in a holding pattern until February 10",
    "554": "@MrChuckD @sixers @BrooklynNets I’m praying 🙏 for @BenSimmons25  I hope he moves on soon. Great talent. 🏀⛹🏽‍♂️",
    "555": "How likely is a trade between #BrooklynNets and #Philadelphia76ers involving The Beard? \n\n\"....a possibility.\" says @ShamsCharania https://t.co/O9ry4eso7G",
    "556": "The sixers are in the driver seat with this one. They can literally offer with little as possible with Simmons and nets got no choice but to say yes. Harden a FA this season and he won’t be around for another winter in Brooklyn. https://t.co/bqnQFJsiBI",
    "557": "I follow @JHarden13. I wanted him to go to the @sixers when he was still with the @HoustonRockets. My thought process was he needs a really good big. I thought @AntDavis23 should’ve gone to HOU instead of the @Lakers. I just hope this drama with the @BrooklynNets end soon.",
    "558": "@RooshWilliams overall i think it’s a positive. thinking that #13 was going to leave brooklyn for nothing is incredibly naive. better to have ben simmons (a limited star) alongside part-time kyrie and injury prone kd, surrounded by g-leaguers than #13. #13 going to philly means nets never win",
    "559": "If the Nets got Lil Baby to move to Brooklyn, James Harden would play a lot better....",
    "560": "@BrooklynNets come to think about it harden for simmons and say we got Tobias Harris. I think that makes the nets really really good. People forget before ben simmons was a crybaby he was a really good defender. Sure he can’t make shots but he could get to the layup and all.",
    "561": "Curry is off the table hoes @BrooklynNets",
    "562": "If the @BrooklynNets big 3 is blown up year 2 without even reaching a finals it’s the biggest collapse in sports known to mankind.",
    "563": "Free @KyrieIrving, he doesn’t need a vaccine down in Houston!! Let that man go already @BrooklynNets #Rockets https://t.co/ZUSjR7k8gh",
    "564": "A vegan diva and a snake that couldn’t win a piece without the greatest 3 point shoota of all time, ya fucking punks @BrooklynNets",
    "565": "I want this so badly. Also cracking up thinking of a Sixers-Nets playoff series in which Kyrie has to miss all the games in Brooklyn and Simmons sits out all the games in Philly. https://t.co/c3t3utQjhX",
    "566": "@BrooklynNets if we make this deal I’m not a fan nomore https://t.co/vJ1K72jyc3",
    "567": "@NatanelWRLD Owning the future of the Brooklyn Nets through 2027 making me feel real happy right about now",
    "568": "@Xavier_Shane Ben Simmons go to the nets and harden becomes Free agent then goes back to Brooklyn 😂😂😂 3 peat and kyrie gets vaccinated or leaguer changes vaccinated rules",
    "569": "At this point.. do it. He appears to be done with the @BrooklynNets. \n\nReport: Nets, 76ers will discuss Simmons-Harden trade before deadline\nhttps://t.co/dOOISU8s1k",
    "570": "The real question is whether or not the Nets fans bring back this gem when Ben Simmons lands in Brooklyn https://t.co/5ieQrtWzPn",
    "571": "@BrooklynNets I'm going to my first NBA game Sunday in about 25yrs my lady is a Nuggets fan I'm BK all day I would like a Game Ball 🏀\n#thankyouinadvance",
    "572": "#Sources — The Philadelphia 76ers are expected to pursue Brooklyn's James Harden ahead of NBA trade deadline Thursday – and the Nets are now open to discussing a deal. #NBA",
    "573": "@FlyRy7 @BrooklynNets Neta ain’t that stupid😂😂😂",
    "574": "@BillyReinhardt And this really pisses me off tho i mean harden basically gave up on Brooklyn and the nets should try to hang in there and keep him",
    "575": "@JucheMane Brooklyn may be ideal, no one really cares about the nets like the bing bong lunatics. We’re far tougher on him here in Philly than nets writers would be",
    "576": "Brooklyn fan and Sixers fan right now. \n\nSixer and nets are reportedly are in talks for james harden.\n\n😭😭😭😭😭 https://t.co/04oeQfJaVH",
    "577": "If Philly trade more than Ben Simmons to Nets then Brooklyn wins the trade..",
    "578": "@RooshWilliams I think it could go either way. There’s a world where Simmons gets his stuff together and makes Brooklyn really solid, and then there’s a world where Simmons is the version of himself that we’ve seen in the past and the Nets fall apart.",
    "579": "James Harden must want this and the Nets have no choice but to recover some of the assets they lost trading for him\n\nBad bad day for the Brooklyn Nets",
    "580": "@BrooklynNets don’t give up Harden without getting Simmons &amp; Drummond",
    "581": "@BACCENDCHlLD @BrooklynNets Would love to hear how he's not efficient and Tatum benefits because having 2 all star level players on your team is a good thing, something we have not had since Kemba's knee turned to dust",
    "582": "👀  RT @ShamsCharania: Sources: The Philadelphia 76ers are expected to pursue Brooklyn's James Harden ahead of NBA trade deadline Thursday – and the Nets are now open to discussing a deal.\n\nDetails on @TheAthletic: https://t.co/4pSVV2cHSH",
    "583": "Utah Jazz Predictions and Preview for 2/4/2022 hosts Brooklyn Nets.  Find out who we are taking in this matchup. #Punters #Basketball https://t.co/Jxw42EvtSh",
    "584": "James I really you stay just till the end of the season man. This perception of you is becoming wild and it’s getting hard to defend 😔😔😔 @BrooklynNets https://t.co/qIdKUEzNSh",
    "585": "BREAKING: The Brooklyn Nets have traded James Harden to the Philadelphia 76ers in exchange for Ben Simmons and multiple future first round draft picks, per @wojespn https://t.co/aFFqPuTe6X",
    "586": "What kinda of strippers they got out in Brooklyn? Harden not happy. Ladies done let the town down. Get right, get tight. Simmons on the way. P.S.  he’s a bit shy @sixers  @BrooklynNets",
    "587": "Wow @BrooklynNets you better do this swap before Morey comes to his senses https://t.co/1QBvKwPI06",
    "588": "Okay, Ben comes to Brooklyn &amp; then what? Kyrie still missing half the games lol Ben ain’t played in months, season is half over. I don’t think this changes things for the Nets as much as people saying. As for Philly, that team gonna be unbearable but Harden-Embiid gon’ be nice.",
    "589": "I hope Nets fans enjoyed the 1.75 seasons of relevancy because whew boy it could be getting real ugly, real quick in Brooklyn.",
    "590": "so uh if matisse thybulle is a brooklyn net next week, then ima have to become a nets fan 😭",
    "591": "The demise of the brooklyn nets will be celebrated to the absolute MAXIMUM. I DO NOT CARE.",
    "592": "@EricPincus is that 1 \"any 1 but the 1 i'm on\" or is it \"the brooklyn nets\"? lol.",
    "593": "James Harden for Joel Embid make it happen @BrooklynNets",
    "594": "Demar for KD  in the summer see you soon @BrooklynNets @chicagobulls",
    "595": "Nets whatever you do, do not trade James harden for anybody especially Ben Simmons that would be a terrible trade real disrespectful if y’all do something like that. @BrooklynNets #NetsWorld @JHarden13 @BenSimmons25 @NBA @SportsCenter",
    "596": "🔥NBA Finals preview tonight🔥\n\n(Both teams are missing key players but still will be a good game)\n\n@BrooklynNets \n@utahjazz",
    "597": "Why don't the @sixers and @BrooklynNets just go ahead make the trade and settle it in the eastern conference finals.... #jamesharden #bensimmons #NBATradeDeadline",
    "598": "you will take ben and shake and you will like it @BrooklynNets",
    "599": "The sixers cannot give up thybulle in the harden trade @BrooklynNets @SeanMarksNetsGM",
    "600": "@BACCENDCHlLD @BrooklynNets You’re right. An efficient 23/10/8 is bad actually.",
    "601": "Y’all hurry up @sixers @brooklynnets https://t.co/iGgN7DEaA7",
    "602": "If Harden gets traded, how are we feeling about the Nets picks? Does Ben Simmons make Brooklyn better long term and decrease the value of the picks? Does this increase the likelihood that Kyrie walks? Not sure where I am on this yet.",
    "603": "@MrChuckD @BrooklynNets @SiriusXMNBA @TermineRadio @Jumpshot8 I actually think that that would be a great situation for Ben. No pressure scoring.",
    "604": "Are you kidding me I'm saying no if I was in Brooklyn nets I'm sorry but they do it 👇 https://t.co/D8Y4RxOzTu https://t.co/vKiXoR6wc4",
    "605": "Tyrese Maxey, Matthew Thubulle, The guy who wears 25, Betsy Ross’ house and a 1st for James Harden @BrooklynNets",
    "606": "@MrChuckD @BrooklynNets @SiriusXMNBA @TermineRadio @Jumpshot8 It should work for 76ers as well, just don't know if Morley will pull this deal. Too close to philly",
    "607": "@CartonRoberts @EvanRobertsWFAN @craigcartonlive IS JAMES HARDEN THE JULIUS RANDLE OF THE BROOKLYN NETS?...you think guys...",
    "608": "@BACCENDCHlLD @BrooklynNets A top 12 player in the association",
    "609": "James Harden Rumors: 76ers to Pursue Star at Trade Deadline; Nets Open to Deal #Brooklyn #Nets #NBA https://t.co/NgGEL9MV0C",
    "610": "It would be a fire war @sixers @BrooklynNets in playoffs post trade",
    "611": "ben simmons being a brooklyn net is way more surprising then james harden being a sixer",
    "612": "@Whatshis40 @BrooklynNets I wish he’d play for us again😕",
    "613": "These James Harden trade rumors are troubling. The Brooklyn Nets usually known for doing things right or at least keeping things in house. \n\nThe fact that the rumors continue to swirl and the recent poor play of Harden, the big 3 era could be coming to an end in BK.",
    "614": "@BrooklynNets or this trade https://t.co/qKOEhTOO70",
    "615": "@Dolan_J_Trump @EvanRobertsWFAN he's surely pissed off JAMES HARDEN THE JULIUS RANDLE OF THE BROOKLYN NETS HOW ABOUT THAT...",
    "616": "@MessiLaker @BrooklynNets Hahahahaha",
    "617": "Ben simmons would be a great fit for the NETS…. Lets make that happen @BrooklynNets",
    "618": "@aydenfranco_ @BrooklynNets Too much for this version of Harden.",
    "619": "@JhostfaceKilla @BrooklynNets @sixers Should’ve put Danny Green in there 👀",
    "620": "Please get him off the team 🙏🏽@BrooklynNets",
    "621": "Good. Nets need to trade Harden asap. His mind isn't on playing for Brooklyn. https://t.co/oU8LhLiXmI",
    "622": "If the Nets can land Simmons, Maxey (picks or Thybulle/Curry) you do it. \n\nRegardless, it’s a tough spot for Brooklyn. https://t.co/OrfUsL50LS",
    "623": "@robinlundberg @NYK_NYR_NYJ Harden has no leverage I still think he’d stay in Brooklyn \nRather then give up cash. You play it out this year and try to win a title and see how it goes. You don’t hand the east to the Sixers. The nets window is only a short period anyway try to win now",
    "624": "let’s talk. @BrooklynNets https://t.co/BQFhr2AdmH",
    "625": "Additionally, it goes without saying, but Kyrie Irving refusing to get vaccinated seemingly derailed this entire era for the Brooklyn Nets.\n\nJust one death blow after another to Nets fans. https://t.co/AEujzyBbDI",
    "626": "SOURCE: @BrooklynNets definitely trying to trade Harden. It never worked. @Knicks trying to trade Alec Burks as well for controllable assets.",
    "627": "@BrooklynNets make sure they include thy in that trade!!!",
    "628": "@Whatshis40 @BrooklynNets the next lebron the nets gotta do it",
    "629": "Should the @BrooklynNets and @sixers be open to a harden for Simmons trade? #nba #76ers #NetsWorld",
    "630": "HERE WE GOOOOO! 👀\n-\n-\n-\n#jamesharden #bensimmons #brooklynnets #philadelphia76ers #nba2022 https://t.co/X5tQ90rMYm",
    "631": "Brooklyn Nets Are Reportedly Open To Discussing James Harden For Ben Simmons Trade Amid Concerns About Harden's Playing Style Affecting Team https://t.co/ehFY2mDktg",
    "632": "It’s gonna work well Ben and KD imo @BrooklynNets @SiriusXMNBA @TermineRadio @Jumpshot8",
    "633": "@RealBisi @BrooklynNets @sixers Replace Kormaz with Curry",
    "634": "@JacksonH_52 Harden wants out and Brooklyn knows he won’t resign. Nets need to decide if they want get a return or lose him for free. A core of Simmons Kyrie (when he ends up playing normally) and Durant is scary scary. Simmons another player and 2 firsts will get the ball rolling at least.",
    "635": "The Nets are believed to be open to discussing a Ben Simmons deal with the Sixers, per @TheAthletic.\n\nThere's an expectation that both Brooklyn and Philadelphia will engage in trade discussions as the deadline nears. https://t.co/WG4vfy46od",
    "636": "@BlazersArgento @BrooklynNets Trust the process",
    "637": "Brooklyn Nets should tell the Sixers you can have Harden for Ben Simmons, Thybulle + 2 first rounders. \nHarden clearly don’t wanna be there &amp; the Sixers brass keep tampering, might as well make them pay top $.\nWould also like to see Ben w/ two superstar scorers\n#nba",
    "638": "@BrooklynNets TRADE JAMES HARFATASS RIGHT NOW FOR BEN SIMGOAT",
    "639": "Russ would look ABSOLUTELY FANTASTIC in a Brooklyn Nets Jersey! Also would look great in a 6ers Jersey! https://t.co/5WbmOPCNk7",
    "640": "Let’s get it done @BrooklynNets https://t.co/6uOyxSbFZR",
    "641": "@Anthony_Thomxs @StoolGreenie right so philly would need to send stuff to brooklyn anyways. they need the nets to cooperate if they are to land harden",
    "642": "As a #Rockets fan with tickets for Knicks @ Nets in March…\n\nDo NOT trade James Harden please @BrooklynNets 🤣🤣🤣",
    "643": "The fact the @BrooklynNets  are now open to trade @JHarden13  is so fkn comical to me..lol",
    "644": "NBA 2/4 ADDS\n1U\nDallas Mavericks -1.5 -110 (MGM)\nBrooklyn Nets +6 -108 (FD)\n\n.25U\nDeJounte Murry Triple Double +310 (MGM)\nIf you want less juice just do O9.5Ast at -105.\n\nMurray was an all-star snub. I see him going off tonight. \n#NBA #GamblingTwitter https://t.co/zu6ybvGy3V",
    "645": "Ben Simmons will flourish in Brooklyn, Nets fans aren't real",
    "646": "Les Brooklyn NETS https://t.co/cmss6hE22N",
    "647": "Should the @BrooklynNets trade @JHarden13? It does make sense for the @BrooklynNets to trade @JHarden13 since he can opt out of his current deal (rumor has it he will) but it would take other than Ben Simmons to get this deal done. #NBA #NBA75 #JamesHarden #NetsWorld #Sixers https://t.co/gnNEahQHPW",
    "648": "Please @god @dmorey @BrooklynNets https://t.co/H2sPYML9sE",
    "649": "The Nets traded away Jarrett Allen, Caris Levert and more just for James Harden to chill in Brooklyn for a year  😂 https://t.co/aVTR6lzTUu",
    "650": "@BrooklynNets Yall was 1 in the east now yall asses 6 or 7 all them games yall lost back to back",
    "651": "BREAKING NEWS❗️\n\nJames Harden could be leaving Brooklyn. The 76ers want him and the Nets are willing to discuss a deal.\n\nAn absolute BOMBSHELL.",
    "652": "2022 NBA Championship Odds\n\nBrooklyn Nets +210\n\nLos Angeles Lakers +450\n\nhttps://t.co/G8RMBRwGss",
    "653": "Have to believe that if the Nets are truly willing to entertain deals now, it's less about playing style and more an acknowledgment that noise coming out that Harden will seriously pursue other opportunities was more than just noise, and Brooklyn is pessimistic on retaining him.",
    "654": "Looking for a value bet?  See if the Brooklyn Nets-Utah Jazz Predictions and Preview for 2/4/2022 is one in our preview.  No crazy hype just a prediction and preview. #Punters #Basketball https://t.co/Jxw42EvtSh",
    "655": "B*n, Kork and picks. Take it or leave it @BrooklynNets",
    "656": "@BrooklynNets It be fck up if all 4 leave then what yall fuck again quit acting an do something let the team play together fuck taking this one that one out let them play",
    "657": "@SiriusXMNBA @TermineRadio @Jumpshot8 I think Ben Simmons works great with @BrooklynNets",
    "658": "@dswift34 @BleacherReport @BrooklynNets @sixers No joke. This could just make the nets and sixers that much stronger. And now with the potential of Poeltl to the to the @chicagobulls... This may be the strongest #easternconference in the last 15 years",
    "659": "Is Ben Simmons even vaccinated? @BrooklynNets",
    "660": "@Ddelliponti08 @BrooklynNets Nets have no future if they don’t",
    "661": "Makes sense for Harden and the #BrooklynNets as well as for Ben Simmons and the #76ers Assuming both squads are healthy should be an interesting playoffs. I may actually watch. https://t.co/xzNFcalLOt",
    "662": "Imagine that cunt Ben Simmons coming to Brooklyn\n\nGod fucking hates me #Nets #NetsTwitter",
    "663": "@yossyol If it happens and the Sixers knock out the Nets Harden is about to be the most hated person in Brooklyn 😂😂😭😭",
    "664": "@BrooklynNets Fire the fuckn coach cause he don't know how to coach an won't even let yall feel one another what the he'll he there for yall keep on darant leaving yall if yall don't get him some help",
    "665": "NBA Trade Rumors: 76ers trying to trade for Nets’ James Harden before trade deadline, might send Ben Simmons to Brooklyn https://t.co/nnxcQo797I",
    "666": "The Nets and 6ers both need to do this trade this is a W for both teams like I said when Harden first got traded to Brooklyn 😌 https://t.co/ZYRJldOyvp",
    "667": "Pull the trigger @BrooklynNets @sixers https://t.co/8oET7ViYM9",
    "668": "Do the trade before the deadline lol @BrooklynNets",
    "669": "While Ben Simmons (and potentially Tyrese Maxey and/or Seth Curry) would be a return for Brooklyn fans to get excited about, there’s no other way to spin this development.\n\nThis is a terrible day for the Brooklyn Nets.",
    "670": "If the @BrooklynNets trade @JHarden13, that’s going to be the biggest mistake ever.",
    "671": "RT @ShamsCharania: Sources: The Philadelphia 76ers are expected to pursue Brooklyn's James Harden ahead of NBA trade deadline Thursday – and the Nets are now open to discussing a deal.\n\nDetails on @TheAthletic: https://t.co/EE8rRGEmOQ",
    "672": "??????? DON'T DO IT @BrooklynNets https://t.co/RJv4PGSg9h",
    "673": "Ben Simmons fits way better in Brooklyn lets just make that clear \n\nNets biggest issue is defense and Simmons is one of the best defenders in the whole league and can switch 1-5 which is Nash’s defensive scheme",
    "674": "@BrooklynNets Man yall losing to many games an yall sucken coach won't let yall play together to get the feel of yall he needs to be fire",
    "675": "@PaulCalvisi @sixers - \"We'll take Harden and...\"\n@BrooklynNets - \"The beard stays with us...\"\nSixers - \"Eh?\"",
    "676": "Well it does make sense for the @BrooklynNets to trade @JHarden13 since he can opt out of his current deal (rumor has it he will) but it would take other than Ben Simmons to get this deal done. #NBA #NBA75 #JamesHarden #NetsWorld #Sixers",
    "677": ".@BrooklynNets @JHarden13 about to ruin another franchise. Not that @sixers have their shit together, but The Beard isn’t the answer to the Ben Simmons situation. #NetsWorld #Sixers #NBA #NBATwitter https://t.co/xCfWWHheIR",
    "678": "@BrooklynNets Make this trade https://t.co/oWvujD6Hvt",
    "679": "@kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz @DrHoodieMaddog we coming",
    "680": "Basketball icon Shaquille O'Neal criticized Covid vaccine mandates despite previously slamming Brooklyn Nets star Kyrie Irving Read Full Article at https://t.co/mT6dz3eW2c  https://t.co/IiNooS7wBY #NEWS4W #WorldNEWS",
    "681": "I’m one of the rare nets fans that’s been asking for this ben Simmons trade all season. Make it happen Brooklyn pls.",
    "682": "@Pauu_IR @BlazersArgento @BrooklynNets A Philadelphia*",
    "683": "Brooklyn nets with Kyrie Simmons and Durant gonna be  the most incredibly dysfunctional team in the league. Like Sopranos/Six Feet Under/Devil's Reject style dysfunctional. Someone's going to look at someone wrong and then Barclays centre will be reduced to ash. I'm so excited. https://t.co/QrbYTglFhI",
    "684": "come get Russ instead please @BrooklynNets https://t.co/rG9ZpR2Fyj",
    "685": "@BrooklynNets if you want to trade Harden bc he doesn’t want to be here fine. But Cam is off the table!\n\n#NetsWorld",
    "686": "Aaannnnddddd like I said after harden was ruled out tonight... @BleacherReport says that trade talks between @BrooklynNets &amp; @sixers are heating up. https://t.co/EYZQXcByF5",
    "687": "👀 RT @ShamsCharania: Sources: The Philadelphia 76ers are expected to pursue Brooklyn's James Harden ahead of NBA trade deadline Thursday – and the Nets are now open to discussing a deal.\n\nDetails on @TheAthletic: https://t.co/JWlRgpwHqK",
    "688": "Sources: The Los Angeles Lakers could also be a team are expected to pursue Brooklyn's James Harden ahead of NBA trade deadline Thursday – and the Nets are now open to discussing a deal. Russell Westbrook could be a key piece of the talks.\n\nDetails on @TheAthletic",
    "689": "Imagine you’re gonna regret trading Bum Simmons to the Nets. Dude’s gonna have to take a number on when to touch the ball like he’s waiting at the deli.\n\nGlad he ended up in a small market of Brooklyn, NY so he can “make mistakes”",
    "690": "WHY ARE WE DISCUSSING TRADING HARDEN FOR SIMMONS… I MEAN SERIOUSLY THIS IS BEN FUCKING SIMMONS WE’RE TALKING ABOUT @BrooklynNets",
    "691": "Damn, can’t wait for the Nets vs. Sixers ECF playoff series. Kyrie won’t play in Brooklyn and Ben Simmons won’t play in Philly",
    "692": "Ben Simmons helps Brooklyn a lot lol. And harden certainly helps the sixers \n\nWould be a good swap imo. (Nets obviously getting other stuff too)",
    "693": "IF the Brooklyn Nets were to trade James Harden to the Philadelphia 76ers… what package would you want the Nets to get back??",
    "694": "@BrooklynNets GO FOR BRADLEY BEAL @KDTrey5",
    "695": "Report: the Philadelphia 76ers will pursue James Harden at the trade deadline, and the Brooklyn Nets are reportedly open to offers per @ShamsCharania. \n\nScary hours in Philly? 👀 https://t.co/ZhOMv0c9bL",
    "696": "@ShamsCharania @TheAthletic Haha! @BrooklynNets “culture” 🤣",
    "697": "With the #NBATradeDeadline looming, it is expected that the @sixers will pursue @BrooklynNets @JHarden13. In addition, the @BrooklynNets are open to trade talks and Ben Simmons could be in the deal. #BrooklynTogether #Nets #Sixers #NBA75 #NBA https://t.co/4cBBkXVANx",
    "698": "@call_me_pumpkin @BleacherReport @ShamsCharania @BrooklynNets Daryl Morey will make this happen.",
    "699": "Harden agent leaked that he might leave this summer to get him out of Brooklyn cause Kyrie got the Nets as his part time job",
    "700": "As a @BrooklynNets fan I’m open to trading Harden to Philly for “Simmons, Curry and a 2nd rounder but @KyrieIrving has to play full time(No Vax) Nets need to stand by him and pay all fines",
    "701": "@Slowgrind247 @BrooklynNets It’s happening idk if it’s for Simmons but it’s being worked out",
    "702": "Friendly reminder the Houston #Rockets own the Brooklyn Nets first round picks until 2027.",
    "703": "Sixers better give the nets tyrese maxey Seth curry Danny green and first round pick for harden surround KD with shooters if harden is leaving and don’t you dare send Ben fuckin Simmons to Brooklyn",
    "704": ".@BrooklynNets please don't be dumb",
    "705": "@ShamsCharania @TheAthletic @BrooklynNets IF YOU TRADE CAM THOMAS WE’RE ALL DONE https://t.co/nfeFU3WFVu",
    "706": "while y'all trading scrubs let us gone head and take kyrie off ur hands @BrooklynNets",
    "707": "@BrooklynNets @JHarden13 And deservingly so",
    "708": "The Philadelphia 76ers and the Brooklyn Nets will now engage in James Harden trade talks before the deadline.  https://t.co/0R9hta49Nw",
    "709": "The Brooklyn Nets are currently on top of the #NBA table, can they go all the way?\n\nBrooklyn Nets $3.50\nGolden State Warriors $5.75\nPhoenix Suns $7.50\nMilwaukee Bucks $8.00\n\nBet now: https://t.co/m5tP9u1Oxj",
    "710": "Get Harden outta here man that guy is a loser @BrooklynNets",
    "711": "Do it @BrooklynNets @sixers https://t.co/diDDaog5pO",
    "712": "WOW RT @ShamsCharania: Sources: The Philadelphia 76ers are expected to pursue Brooklyn's James Harden ahead of NBA trade deadline Thursday – and the Nets are now open to discussing a deal.\n\nDetails on @TheAthletic: https://t.co/DOERvKzH6q",
    "713": "Nets Open to Harden Trade 😱: Here. We. Go. Brooklyn and Philly are expected to discuss Ben Simmons-James Harden trade before deadline (Shams) https://t.co/SgCi9sZthf 👀👀",
    "714": "The Brooklyn Nets Big 3 never being healthy enough to consistently play together and only lasting 2 half’s of a season? \n\nWould be wild af.",
    "715": "@LegionHoops Make it happen @BrooklynNets https://t.co/GHZrvxH7Oh",
    "716": "@BleacherReport @ShamsCharania Don't do this @BrooklynNets",
    "717": "@KOT4Q The Brooklyn nets are fucked unless they fleece Philadelphia or get Ben for harden",
    "718": "I will never watch Brooklyn nets basketball ever again https://t.co/VMzsJGDBBb",
    "719": "Brooklyn Nets New Era All Black/Gray Bottom With NBA Patch 9FIFTY Adjustable Snapback #Milwaukee #Bucks #NBA #myhatstop ⁠ https://t.co/vQWho6L5UI",
    "720": "We're proud to announce we've partnered with @dear_fathers on their #DearFathersNight with the Atlanta Hawks on April 2nd for a pregame Men's Den panel discussion about Fatherhood and Mental Health; then the game vs the Brooklyn Nets. \nLINK FOR TICKETS https://t.co/BlTH0Zu9Dd https://t.co/b8ABmZg8I1",
    "721": "Those poor @BrooklynNets fans.. it’s a never ending cycle for them of trading the farm for overrated stars and underachieving.",
    "722": "Simmons and Seth. Get it done @BrooklynNets https://t.co/VB3ktVoyR3",
    "723": "If the Nets opened up to the idea, James Harden wont be in Brooklyn after the deadline",
    "724": "Do it do it do it do it do it @BrooklynNets https://t.co/hywfwSmxhR",
    "725": "@BrooklynNets ben &amp;seth or tobi pls thank you https://t.co/GJDDzxD5j0",
    "726": "The Philadelphia #76ers will pursue Brooklyn #Nets G  James Harden prior to the #NBA trade deadline per the Athletic. The Nets are willing to discuss a deal surrounding Harden. https://t.co/rtKfbDBgr3",
    "727": "The Philadelphia 76ers will pursue a James Harden trade package before the trade deadline. The Brooklyn Nets are reportedly interested. Source @ShamsCharania #Sixers #Nets https://t.co/TmNl4mYyt4",
    "728": "@BrooklynNets save melo https://t.co/He2ydobzgE",
    "729": "RIP brooklyn nets superteam, 2021-2022",
    "730": "🏀 Brooklyn are in the midst of a six-game losing streak as they head into Utah to play their third game in four nights.\n\n🏟 Nets-Jazz pick by @TehSharp \n\n#NetsWorld #TakeNote #NBATwitter\nhttps://t.co/oYZruTrQr0",
    "731": "@ShamsCharania @TheAthletic What? Seriously?  @BrooklynNets are you crazy?",
    "732": "That Brooklyn Nets trio folded after a half a season 🤣🤣🤣🤣",
    "733": "@BrooklynNets youre ruining my life",
    "734": "just so we’re clear, tyrese maxey is, has always been, and will continue to be off the table @BrooklynNets",
    "735": "WOW... SO Ben Simmons to the @BrooklynNets??? https://t.co/PXEo7u2Tjc",
    "736": "Brooklyn Nets are a shit show",
    "737": "Brooklyn immediately is the title favorite after they get Simmons + stuff from Philly.\n\nSmart of the Nets FO to realize:\n\n• A long-term Harden marriage isn't smart\n• Simmons is a better fit\n• They actually have to play defense\n• They can't risk a poor Harden S&amp;T return",
    "738": "No Embiid no maxey take whatever else u want @BrooklynNets",
    "739": "Nets only trade Harden if they have been told directly by Harden and his camp that he is not coming back next year. Pretty significant situation in Brooklyn.",
    "740": "BREAKING: The #Sixers are expected to make a serious trade offer for James Harden before next Thursday #NBATradeDeadline \n\nThe Brooklyn Nets are now open to discussing a deal. (Via @ShamsCharania) \n\nMorey won’t stop till he lands Harden again eh? https://t.co/UZF9B8Utqk",
    "741": "Duncan Robinson for Harden would be pretty solid tho @BrooklynNets",
    "742": "@BleacherReport @ShamsCharania Do KYRIE for SIMMONS @BrooklynNets",
    "743": "Da Brooklyn Nets’ (da fake team here in New Yawk) project widda Big 3 has been a colossal failure. https://t.co/Joo8ttoOIS",
    "744": "Simply put, Harden wants out and will be leaving after this season and the Nets would be FOOLISH to just let him walk. If I’m Brooklyn, I’d pull the trigger. But I also get why you won’t because you’re desperate to see if this could end in a chip, which it probably won’t. https://t.co/c6Kzm7QAHM",
    "745": "ben and seth you are brooklyn nets",
    "746": "To all the James Harden Defenders; he QUIT on the Houston Rockets, he QUIT on the Brooklyn Nets.\n\nFollow him to the Philadelphia Sixers! \n\nI GUARANTEE the Sixers will implode in the Playoffs, hopefully it comes against my Brooklyn Nets!",
    "747": "Brooklyn always made the most sense. Harden or Kyrie. Nets make away like bandits if it’s a package featured with Harden IMO. https://t.co/BKxPJSWDxi",
    "748": "@Demydeee Yes please 🙏🏾 with KD &amp; Kryrie Brooklyn Nets will win it all obviously if Kyrie get the vaccine.",
    "749": "If James Harden has played his last game as a member of the Brooklyn Nets, the Big Three of Harden, Kevin Durant, and Kyrie Irving will have only played 16 games across two seasons together.\n\nWould go up there among the biggest “What Ifs” in NBA History. https://t.co/AFWEe9Y3ge",
    "750": "@TheHoopCentral @ShamsCharania Time to BURY the Brooklyn nets 💀",
    "751": "Wtf are y’all doing @BrooklynNets https://t.co/uv4M4ftUAR",
    "752": "🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣\n\n*DEEP BREATH*\n\n🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣\n\nTo be clear I'm mostly laughing at the Nets. But also Harden and Morey. And also Simmons. \n\nOK maybe I'm laughing at everything and everyone.\n\nThose Brooklyn draft picks are looking that much better for the Rockets. https://t.co/YiGtMxp8fK",
    "753": "This makes no sense for  @BrooklynNets or @JHarden13 imo https://t.co/NgcTMfZORc",
    "754": "The 76ers are expected to pursue Brooklyn's James Harden ahead of the NBA trade deadline on Thursday – and the Nets are now open to discussing a deal, per @ShamsCharania https://t.co/7zFsjXWoXA",
    "755": "This is very, very interesting. It might be good for the status of the Nets draft pick this season but I think it may help Brooklyn long term. https://t.co/dm1YjnxruV",
    "756": "Uh oh. Listen I need to see what Brooklyn gets. If they fail, Philly straight up wins. Cause y'all offered the whole ship for Harden and you might lose him. Plus I wanted Harden in Philly over Nets in the first place. https://t.co/xi4nNn2ssT",
    "757": "The 76ers are expected to \"pursue\" Nets' James Harden ahead of Thursday trade deadline, per @ShamsCharania\n\nBrooklyn is reportedly open to discussing a deal https://t.co/jQxkiddU3k",
    "758": "BREAKING: Philadelphia 76ers will pursue James Harden through a trade ahead of next week’s trade deadline &amp; the Brooklyn Nets are open to the idea, according to Shams Charania. \n\nThe deal would include Ben Simmons. \n\nThoughts? Should Brooklyn trade for Simmons? 🤔",
    "759": "Brooklyn Nets dodging the finals yet again. https://t.co/kkwFaSMkdK https://t.co/Kwb7iFf3NV",
    "760": "BREAKING: The #Sixers are expected to pursue Brooklyn #Nets James Harden ahead of #NBA trade deadline Thursday and the Nets are now open to discussing a deal.\n\n#NetsWorld",
    "761": "Ben Simmons and Shake Milton, you are now Brooklyn Nets",
    "762": "@BrooklynNets @BKN_NETSPR \n\nWhatever needs to be done…let’s make it REAL\n\n#76GNG https://t.co/Rc0Ln3oNDv",
    "763": "Man this Brooklyn Nets shit worse than when they had KG and Pierce 😂",
    "764": "Why does Harden want out of Brooklyn. Tell you this much, Simmons ain't gonna shoot like Harden or get to the line with the same frequency. I don't know if this is a good move for the Nets, Harden to me at least seams like a good fit.",
    "765": "Don’t do it @BrooklynNets wait until the offszn https://t.co/ojTrzQbZEC",
    "766": "@ShamsCharania @TheAthletic GET JAMES HARDEN OFF MY BROOKLYN NETS NOW!!!!!!!!!!!!!",
    "767": "@WarriorsLatam_ @ShamsCharania @TheAthletic Sources: The Philadelphia 76ers are expected to pursue Brooklyn's James Harden ahead of NBA trade deadline Thursday – and the Nets are now open to discussing a deal.",
    "768": "Nets gave us JA for nothing other than James Harden and they’re already about to trade him away. Yikes. 🤷🏼‍♂️ \n\nThanks Brooklyn",
    "769": "Simmons, Harris, Korkmaz bout to be in Brooklyn Net jerseys next week. https://t.co/IbddA8GlLZ",
    "770": "Philadelphia 76ers are expected to pursue Brooklyn's James Harden ahead of NBA trade deadline Thursday – and the Nets are now open to discussing a deal\n\nPer @ShamsCharania https://t.co/CyotXz9POt",
    "771": "According to @ShamsCharania the Brooklyn Nets are listening to offers for James Harden from the 76ers",
    "772": "👍 Sixers expected to pursue Brooklyn Nets star James Harden ahead of NBA trade deadline Thursday per @ShamsCharania https://t.co/efWbEk9GWv",
    "773": "The Philadelphia @sixers are expected to pursue Brooklyn @BrooklynNets James Harden ahead of NBA trade deadline Thursday. The Nets are now open to discussing a deal.",
    "774": "Ya’ll dumb as hell @BrooklynNets https://t.co/h8ZvxbQUWy",
    "775": "Sources: The Philadelphia 76ers are expected to pursue Brooklyn's James Harden ahead of NBA trade deadline Thursday – and the Nets are now open to discussing a deal.\n\nDetails on @TheAthletic: https://t.co/asdsGS0Sht",
    "776": "@SirEMBIID 76ers don’t get to pick and chose, either agree with Brooklyn for a reasonable asking price or let Nets give Harden the supermax",
    "777": "Nets in Utah tonight, 4th game on this 5 game road trip, looking to snap their 6 game losing steak. James Harden is out for Brooklyn &amp; Utah will be missing Rudy Gobert so it will be the KAI &amp; Spider show tonight in Salt Lake City. #Nets vs #Jazz Preview. #NetsWorld #NBA #TakeNote https://t.co/QG6YZQoSs1",
    "778": "@BrooklynNets You guys are losing",
    "779": "@kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz Need to cross reference this with strength of schedule over these past 15 games, too.",
    "780": "Interesting items in the Nets' game notes packet: stats on the [does quick math] 364 minutes Brooklyn's big 3 have ever played together. https://t.co/qE4WxrEHmt",
    "781": "Brooklyn Nets injury update: James Harden out vs. Jazz #Brooklyn #Nets #NBA https://t.co/fdW8MXXQoo",
    "782": "@BrooklynNets Without a doubt my least favorite \"superstar\"",
    "783": "@BrooklynNets @KyrieIrving for the love of god, don’t let me drive 10 hours to make it 7 straight.",
    "784": "@CancunDurant @BrooklynNets I’ll take the gamble on Simmons least he’s good on D",
    "785": "@Collin_Gaveck The Brooklyn Nets",
    "786": "@BallsackSports 😭 I thought he was the king of NYC @nyknicks @BrooklynNets",
    "787": "@Krisplashed @CertifiedBckts Am taking this if am the Brooklyn Nets",
    "788": "All this harden speculation and he'll stay in Brooklyn.  If harden shows up, the nets will win. We know what kd will be. This all falls on harden. Kd and a actual james harden is enough to get it done even with part time ky",
    "789": "@BrooklynNets @JHarden13 FYI ...47w : 15l, Nets score  with Harden\nJust Harden  4:2\nJust  KD.        2:2\nJust. Kyrie.    3:4",
    "790": "@BrooklynNets FYI ...47w : 15l, Nets score  with Harden\nJust Harden  4:2\nJust  KD.        2:2\nJust. Kyrie.    3:4",
    "791": "@TonyMon96589802 @BrooklynNets FYI ...47w : 15l, Nets score  with Harden\nJust Harden  4:2\nJust  KD.        2:2\nJust. Kyrie.    3:4",
    "792": "@Nocanthear @kurt_holt6 @BrooklynNets Regular season it would make us better but playoffs it would make us worse",
    "793": "A new mock trade has the Philadelphia 76ers acquiring James Harden in a 3-team deal with the Brooklyn Nets.  https://t.co/tShQeeFd5W",
    "794": "@BrooklynNets @HSpecialSurgery What happened ton Millsap",
    "795": "God why is @BrooklynNets playing tonight, this is not a day to cry 😭😭 https://t.co/tXhyybI2yZ",
    "796": "@bkhh93 @ImBino__ @HoopsReference If he wants out of brooklyn he’s gonna get himself out, and the nets will have zero leverage, that’s the argument. Clearly that’s contingent on harden wanting out…",
    "797": "Joe Harris ‘confident’ he’ll be back for Nets with injury frustration mounting #Brooklyn #Nets #NBA https://t.co/8IfprpaNvJ",
    "798": "@Canes_Nets @brooklynnets85 Harden to Philly\nBen to Portland\nLillard to Brooklyn",
    "799": "The Brooklyn Nets at Atlanta Hawks matchup on Saturday, April 2nd will now be televised by \n@NBATV \n\n#TrueToAtlanta",
    "800": "The #Nets’ Friday March 18 game vs. the #Trailblazers has been dropped by #NBA TV, but Brooklyn’s April 2 tilt at the #Hawks will be picked up.",
    "801": "@digitalomundo dunk low NBA 75th anniversary Brooklyn nets",
    "802": "@BrooklynNets Please put the city edition in the custom shop. I’m just trying to get a Sam Cassell or Kerry Kittles city edition thanks in advance.",
    "803": "@KyrieSZNlegit @JamesHarden305 @BrooklynNets Trade Harden for Ben Simmons already, and Kyrie for a legitimate pf.  We have Mills, Edwards and Harris; we don't need Kyrie.  KD slides back to small forward. Nash goes to school for coaches. #BrooklynNets https://t.co/U9p4BIKqpl",
    "804": "Brooklyn Nets collab dropping Feb 24 🍿 https://t.co/tZNexDbB1P",
    "805": "@FoxNews O’Neal was very critical of Brooklyn Nets star Kyrie Irving for refusing to get vaccinated. The legendary player told USA Today in October that \"sometimes you have to be selfless.\" - So which is it, @SHAQ ?",
    "806": "@RooshWilliams @dat_plug So what you’re saying is James Harden caused the Nets all these draft picks and young talent just to look down bad in Brooklyn.",
    "807": "Brooklyn Nets to lead by 12 vs Utah Jazz @ 2.9 Odds 🧐",
    "808": "@GargerJake @BrooklynNets Love it",
    "809": "@BrooklynNets_b It’s time @jj_redick https://t.co/LLfOl3iEEs",
    "810": "@KingPapiSolo What do you think about this trade? Make it happen? @BrooklynNets https://t.co/9GHNwRHJJI",
    "811": "Joe Harris' lingering ankle uncertainty has Nets in bind (https://t.co/5AvbMDzwqY)\n\nWeeks after Joe Harris sought a second opinion on his surgically-repaired left ankle last mo...\n\nAdd your highlights:\nhttps://t.co/ejnYa8l78S\n #Brooklyn_Nets",
    "812": "Nets Harris (New York Post)\n\nSALT LAKE CITY - Joe Harris can't guarantee he'll be able to avoid a second ankle surgery or...\n\nAdd your highlights:\nhttps://t.co/gcV3FX4tv6\n #Brooklyn_Nets",
    "813": "@BrooklynNets Thank fucking god.",
    "814": "@hoopzjunkie1 @BrooklynNets @JHarden13 But he put in the effort. That's a whole lot more than what Beardman did in that game.",
    "815": "@kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz The Boston Celtics.",
    "816": "@HoodieBev He is a Brooklyn net",
    "817": "0-3 and with limited options out there, we’re going with the\n 🚨Brooklyn Nets +5.5 🚨\nUtah Jazz are 0-10 there last 10 games covering the spread at home\n#Brooklyn #NetsWorld #NBAonTNT",
    "818": "@BrooklynNets  vs @utahjazz \n\n-5.5 - most people are throwing the ML into they parleys - 76 % on the ML \n\n228.5 now 229.5 whole world is on the over - I don’t see how but let’s see\n\nRefs: \nRay A. 210 PPG\nDerek R. 205.2 PPG \nZACH Z. 201.3 PPG",
    "819": "Brooklyn’s favs not wanting Joe out while he’s clearly broken is just as kind boggling to me as the fact that Kyle Kuzma isn’t currently a Net…",
    "820": "Por favor trade for Damian Lillard @BrooklynNets https://t.co/uH50rUhhdp",
    "821": "Opening Line: Brooklyn Nets (228.5) vs. Utah Jazz(-5) - Linemoves Since: (4) #Nets #Jazz  Full odds at https://t.co/nUn5OcMhOI",
    "822": "@BrooklynNets @HSpecialSurgery recover faster",
    "823": "@SantiiBlazers The Trail Blazers are trading his 2022 first-round pick to the Brooklyn Nets for Blake Griffin and Patty Mills, sources tell ESPN.",
    "824": "@EvanRobertsWFAN The @BrooklynNets are getting hamstrung by him. He clearly wants out.",
    "825": "@RTIIINFT @KDTrey5 @BrooklynNets @WeatheReportNFT Great job on this!!",
    "826": "@RTIIINFT @KDTrey5 @BrooklynNets @WeatheReportNFT drip to hard!!!",
    "827": "What utter bullshit all this is.  The Nets losing streak has coming with KD out with an injury.  He was criticized for chasing titles when we went to Golden State, and now he gets criticized for doing the complete opposite in trying to build something in Brooklyn??? https://t.co/NHmpiEkFVs",
    "828": "Nets star James Harden ruled out vs. Jazz #Brooklyn #Nets #NBA https://t.co/4J4nB8zdwu",
    "829": "Brooklyn Nets star James Harden will miss Friday night's matchup with the Utah Jazz because of left hamstring tightness, the team announced. \n#NBA #NBATwitter https://t.co/T6m5ceD5Of",
    "830": "@Alec_Sturm Nets don't really have a lot of leverage in this situation. They traded their future for a superstar who is unhappy in Brooklyn. While the Sixers don't really feel that Ben in gone on the court. Time is running for the Nets",
    "831": "Kevin Durant is responding to recent criticism of his move to Brooklyn.\n\n@BrandonLondonTV looks at whether or not KD's legacy would take a hit if he can't win a title with the Nets: https://t.co/kxnbjFUS97 https://t.co/DPBPP9CCon",
    "832": "Man we can’t catch a break @BrooklynNets 🤦🏽‍♂️",
    "833": "Will the Brooklyn Nets end their 6️⃣-game losing streak tonight against the Utah Jazz?\n\n#NetsWorld +157\n#TakeNote -4\n📊 230.5 Total\n\n(Odds presented by @betonline_ag) https://t.co/vqmRf5OOLz",
    "834": "My favorite hooper @KDTrey5 on my favorite team @BrooklynNets as a @WeatheReportNFT KD wanted to be a weatherman if he wasn’t a a hooper, but he’s the greatest scoring forward of all time, and currently the best player in the world https://t.co/AGOs1TciO2",
    "835": "Matter fact fuck all these harden trades. Once KD comes back he will cure everything and harden will be happy. Nets in 4 #NetsNation #BrooklynNets",
    "836": "If nets fans and the Brooklyn Nets don’t want James Harden anymore, then we move. https://t.co/E0quuz11hk",
    "837": "@GothamCityCrew @BrooklynNets @Mets @NewYorkRedBulls @NJDevils @NYCFC @nyknicks @NYIslanders @NYRangers @Yankees Might be up for a Yankee game this year",
    "838": "@kurt_holt6 @BrooklynNets Harden for Simmons alone fuck no but if we get Simmons and maybe curry green or tybulle then yes",
    "839": "@kurt_holt6 @BrooklynNets Giv'em Millsap and we get Maxey",
    "840": "@don_lytle @kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz this guy gets it",
    "841": "@CancunDurant @BrooklynNets Contracts to big. Also hate him for some reason 🤣",
    "842": "Who are the Fan Supporter Clubs for other NY Metro area teams? We’d love to collaborate &amp; do a game outing with your Crew. Bring fans together\n\nListing in alphabetical order\n\n@BrooklynNets \n@Mets \n@NewYorkRedBulls \n@NJDevils \n@NYCFC \n@nyknicks \n@NYIslanders \n@NYRangers \n@Yankees https://t.co/ik4liB9eZS",
    "843": "@kurt_holt6 @BrooklynNets Add Tobias Harris in there and I say make it a deal",
    "844": "@BrooklynNets trade KD back to warriors pls",
    "845": "@BrooklynNets I will watch but i know the outcome of this",
    "846": "Brooklyn Nets star James Harden will miss Friday night's matchup with the Utah Jazz because of left hamstring tightness, the team announced. \n#NBA #NBATwitter https://t.co/T6m5ceVf2n",
    "847": "Brooklyn Nets star James Harden will miss Friday night's matchup with the Utah Jazz because of left hamstring tightness, the team announced. \n#NBA #NBATwitter https://t.co/7bGHpqo0W7",
    "848": "Harden for Simmons let’s get it done @BrooklynNets",
    "849": "Consensus Line Move:\n2022-02-04 Brooklyn Nets at Utah Jazz from 232.00 to 229.50\nUnder never wait\n#NBA #bettingpicks #analytics #property",
    "850": "Consensus Line Move:\n2022-02-04 Brooklyn Nets at Utah Jazz from -3.50 to -5.50\n#TakeNote with respect\n#NBA #NBATwitter #tech #crypto",
    "851": "Brooklyn Nets G James Harden out Friday vs. Utah Jazz because of left hamstring tightness https://t.co/oPDaJ3jAYl",
    "852": "@TermineRadio Both the Boston Celtics and Brooklyn Nets rosters will require offseason shakeups",
    "853": "Analyzing Friday’s Brooklyn Nets at Utah Jazz odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/onG3Em4bm1",
    "854": "@ThaStreetsKnowl @KingJames @neymarjr @uninterrupted @netflix @sixers @BenSimmons25 @Lakers @russwest44 @BrooklynNets @KyrieIrving @dallasmavs @kporzee wtf no. why would dallas accept this???",
    "855": "Today's NBA Consensus (So Far):\n\nSan Antonio Spurs 76%\nDenver Nuggets 73%\nChicago Bulls 72%\nBoston Celtics 65%\nToronto Raptors 64%\nOklahoma City Thunder 61%\nCharlotte Hornets 56%\nDallas Mavericks 55%\nBrooklyn Nets 51%",
    "856": "@BrooklynNets it’s time to make a move",
    "857": "@Kevin_Kyle_Pod \n\nThe Brooklyn Nets - A Failed Experiment Once Again https://t.co/81UQybpdJq via @YouTube",
    "858": "@Devil694612 @BrooklynNets maybe be he actually would be 10x better if he played more games than i can count on my hands",
    "859": "Brooklyn Nets at Utah Jazz odds, picks and predictions https://t.co/VjALrJoPP8",
    "860": "Harden for Russ. Reunion let’s do it @BrooklynNets https://t.co/QwMNDqxRwm",
    "861": "@smokerr__ @BrooklynNets @JHarden13 Nets need points, James didn't get a championship in okc or houston and he had good players, so nets need to play Kyrie more!",
    "862": "@BrooklynNets Good he is not there win without him now if you cannot don’t talk about trade anymore",
    "863": "DAME @Dame_Lillard \n\nTHIS TIME TO YOU. DESTINY. @BrooklynNets https://t.co/SSxU5T9HfM https://t.co/dbe5RufcxH",
    "864": "@BillyReinhardt @BrooklynNets we need to do something",
    "865": "Who's dick do I gotta suck for the Brooklyn Nets to make a hard hitting trade like the Clippers just did 🤔",
    "866": "Jerami is like four RoCo’s so….\n\nI formally request KD @BrooklynNets @DetroitPistons https://t.co/ApNGpUOzJz",
    "867": "yea @BrooklynNets please make some trades",
    "868": "Serge Ibaka on a buyout? That's a fantastic idea @BrooklynNets",
    "869": "1st play I am sharing w/ you folks is Brooklyn Nets +185. Got this one at a better # (+190) early morning. In light of my twitter journey’s beginning, if I am able to reach 50 followers by tonight I will reward 1 follower w/ $50. Best of luck! #GamblingTwitter #FYP #NBAonTNT",
    "870": "@BrooklynNets I will not be watching",
    "871": "@doublecertified Is That's James Harding .BROOKLYN NETS.? Just saying",
    "872": "Yo @BrooklynNets why didn’t you do this? https://t.co/97CQtfk4PO",
    "873": "@BrooklynNets try to finesse Philly for Ben Simmons, give up Claxton.",
    "874": "Shaq PIVOTS from BOLD Stance on Kyrie Irving and NBA Mandates (Does It Matter?) Right-wing media celebrates Shaquille O'Neal's recent comments on Brooklyn Nets Kyrie Irving and mandates. What do you think? Here are the details. \n► Join Tim Black on P… https://t.co/sDJttiMZKf",
    "875": "@Chris_Broussard If Kyrie only plays road games in the playoffs the Nets could be out 1st round. Chemistry, culture, Harden mentally checked out. The East 1-6 is very well balanced. I’d put Philadelphia and Cleveland right behind Brooklyn and Milwaukee assuming Kyrie is vaccinated.",
    "876": "The Brooklyn Nets are up sh!t creek without a paddle. #nets",
    "877": "Nets' James Harden Won't Play vs. Jazz Because of Hamstring Injury (Bleacher Report)\n\nBrooklyn Nets guard James Harden will miss Friday's game against the Utah Jazz due to a hams...\n\nAdd your highlights:\nhttps://t.co/8yehHIRlsD\n #Brooklyn_Nets",
    "878": "👀 Sean Marks working some deal or simply just rest for Harden?\n#Nets have said publicly they are not taking calls, but I do not believe they want to/will throw this season away just because is Harden is not happy in Brooklyn. https://t.co/rODjJSlZGS",
    "879": "All season people have been talking about breaking up 23-year-old Jayson Tatum and 25-year-old Jaylen Brown.\n\nYet they're just 2 games behind the fading Nets...  Maybe Brooklyn should be the one getting broken apart.",
    "880": "@BobbyMarks42 @BrooklynNets take note, and please hire a better coach, Steve Nash is wack",
    "881": "Trade for Dame Lillard you cowards @BrooklynNets",
    "882": "@AmyElnoraZ Brooklyn likely isn't going to move him at the deadline. If we get him it's likely going to be in the summer via a sign and trade (Simmons to Nets, Harden to Sixers). Similar to when Butler went to the Heat, the Sixers got Josh Richardson in that sign and trade.",
    "883": "Utah Jazz sits 4th in the Western Conference and their opponents Brooklyn Nets is at position 6 in the Eastern Conference. \nWill Jazz keep going up the ladder?\n\nVisit👉 https://t.co/i5UmONmmIS PLAY &amp; WIN! \n#TotalEnergiesAFCON2021\n#nba\n#betnabora https://t.co/auB56xdqtN",
    "884": "@HardensSizeUp @BrooklynNets yeah, having a star who has  more turnovers than points makes us worse !!!",
    "885": "@BrooklynNets @Lakers trade rus for kyrie. Reunion for bron and kyrie. Reunion rus, harden, and kd\n\n🤯🤯🤯",
    "886": "Release Milsap @BrooklynNets https://t.co/1SnELRYJON",
    "887": "@JayMoneyIsMoney That man KFCing it again!! Told Kyrie I’m using all PTO now. I’m from Brooklyn bro. Nets sold their soul 😂😂😂. DLO nets had me hype 🤣🤣🤣. These nets are like Chia Tea ☕️!!",
    "888": "@Devil694612 @BrooklynNets yall so much worse than sixers fans...again, oblivious.",
    "889": "@HardensSizeUp @BrooklynNets we wouldn't treat him like those sixers fans..........",
    "890": "Nets' James Harden (hamstring) ruled out vs. Jazz #JamesHarden #NBA\n #BrooklynNets #BrooklynGrit  https://t.co/9DqIF3j8ZF",
    "891": "@Danners1998 @BrooklynNets I hate this team why did we let jefyf Green leave and we signed all these non shooting role players bembery jevon carter bruce brown https://t.co/cOrepAvSTg",
    "892": "@WebullGlobal @BrooklynNets I mean I luv BK but is NYK available? 😞 😪",
    "893": "@evan_williams_ @BrooklynNets Yeah makes sense",
    "894": "@Devil694612 @BrooklynNets \"at least he would play for us\" LMAO you're as oblivious as the flat earther",
    "895": "Harden just spat on the Brooklyn Nets logo",
    "896": "Nets' James Harden Won't Play vs. Jazz Because of Hamstring Injury #Brooklyn #Nets #NBA https://t.co/EErVJUvKDP",
    "897": "Trade him. Pls. @BrooklynNets https://t.co/jQxZRtT4E2",
    "898": "@kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz Bulls need Lonzo and Caruso back badly",
    "899": "ONE HAMMY, in SEMIS PLAYOFF, 3-GAMES SPAN (game 5-6-7) with exact 130 minutes (include TO)\n\nsay his name: James Edward Harden jr\n\nget well soon @JHarden13  🥺🥺🥺🥺😭😭😭🙏🙏🙏 @BrooklynNets need you in 100% https://t.co/mOdy0lbLs6",
    "900": "#Nets @ #Jazz Free NBA Betting Prediction, and Odds for tonight. https://t.co/WGyuqRrg9Q #Brooklyn has dropped five consecutive. #KyrieIrving, and #JamesHarden will take on #Utah in #SaltlakeCity #FreeNBAPicks #DonovanMitchell",
    "901": "@olis3h @BrooklynNets They’ve been losing with him. Get him healthy for the winnable games after the west coast trip",
    "902": "even i think is happened since 3rd game lose.\n\nat least 4-games span Harden forced himself to play, just beacuse he love @BrooklynNets https://t.co/PkeDh6SbI7",
    "903": "@HardensSizeUp @BrooklynNets why,kiddo ??!!! At least,he would play for us !!Go ,be the bi*ch of Joel !!!",
    "904": "I don’t know who needs to hear it but James Harden is a Brooklyn Net and he will continue to be for a long time. So take him out of your stupid mock trades https://t.co/WcueyH0Cuc",
    "905": "maybe since 3rd lose, Harden feel very painful, and still forced himself to play, whatever cost, because HE LOVE @BrooklynNets \n\nwhatever bullshit trade Ben Simmons x Harden https://t.co/B79jcWtyqQ",
    "906": "make the deal @BrooklynNets, please get rid of that fat asshole. would be a great birthday gift",
    "907": "@BrooklynNets I mean even if he played we still gonna lose.",
    "908": "@BrooklynNets Genial",
    "909": "Brooklyn Nets star James Harden (strip club) is out tonight against the Utah Jazz, team says.",
    "910": "@BrooklynNets Advantage Nets",
    "911": "@BrooklynNets Lmao we’ve lost then",
    "912": "@bookerjordan87 @BrooklynNets Lol yeah \nHow you doing...",
    "913": "@BrooklynNets TRADE HIM",
    "914": "@DubsNets @steph_burner @Hargoat13 Brooklyn has no fans fr😭😭 Are you sure you're a nets fan?",
    "915": "@Jo_GotGame @shoptier @BrooklynNets Tough!",
    "916": "@Devil694612 @BrooklynNets you're not getting simmons bucko",
    "917": "@BrooklynNets Trade this fat donut so we get someone in return, he not interested in this team no more you can tell come summer chip or not he walking for free",
    "918": "Why can’t the Brooklyn Nets have nice things?? https://t.co/Y4yrrfRgh8",
    "919": "@olgrymtree77 @BrooklynNets Yeah ☺️\nHow you doing",
    "920": "@BrooklynNets @HSpecialSurgery All the team 😂😂😂🤷🏽‍♂️",
    "921": "@BrooklynNets Trade him",
    "922": "@Jo_GotGame @shoptier @BrooklynNets Congrats my brother! 💪🏾",
    "923": "@BrooklynNets Harden (afraid to lose) - OUT https://t.co/BbHPLhyLm7",
    "924": "@BrooklynNets The Nets are frauds",
    "925": "Hey @BrooklynNets , trade harden ASAP !!!",
    "926": "Brooklyn #Nets G James Harden is OUT tonight due to left hamstring tightness. #NBA https://t.co/6lvb55dV0c",
    "927": "@BrooklynNets --&gt; 7 games skid",
    "928": "Brooklyn Nets vs. Utah Jazz - 2/4/22 Free Pick &amp; NBA Betting Prediction https://t.co/CZX3nLtInD\n.\n#Betting #FreePicks https://t.co/5OrKGrGGNN",
    "929": "still any time to join @BrooklynNets , Bro Spida @spidadmitchell https://t.co/Z33ExHhboW https://t.co/uYYX6HZjc9",
    "930": "Brooklyn Nets say that James Harden will miss tonight's game against the Utah Jazz because of left hamstring tightness",
    "931": "@BrooklynNets He shoulda sat the last game too smdh",
    "932": "https://t.co/C3Wc7pBJj8🏀🏀🏀 Hard for Brooklyn Nets to win a championship with a part-time players.",
    "933": "@ChrisBHaynes @BrooklynNets trade this MF",
    "934": "James Harden is out vs the Jazz, Brooklyn Nets injury reports are undefeated https://t.co/keycCkazZn",
    "935": "Brooklyn is sitting on 2 trade exceptions: \n\n$11.5 and $6.3M\n\nHowever, there is a $70M+ cost toward the tax if Brooklyn uses the big TE.\n\nThe Nets payroll and tax bill currently stands at $282M https://t.co/ikOHViMcIL",
    "936": "Why should harden keep playing through injuries? Clearly showing up as a member of the Brooklyn Nets is very voluntary. If I had a coworker that played half time I’d take days off too. Who’s gonna tell me no? Can’t hold one person to one standard and everyone else to another",
    "937": "@BrooklynNets Amazing",
    "938": "@BrooklynNets So when's the Simmons trade going through?",
    "939": "@BrooklynNets Ratio",
    "940": "Update to the Status Report for tonight’s game at Utah:\n\nHarden (left hamstring tightness) - OUT",
    "941": "Brooklyn Nets star James Harden (hamstring) is out tonight against the Utah Jazz, team says.",
    "942": "@MlKETETS @BrooklynNets Don’t expect to see Harris anytime soon, perhaps never again in a Nets uniform",
    "943": "@SamuelLachow @BrooklynNets wrong take bro, game flows better with ky. problem: harden needs 3&amp;d tall bigs. doesn’t have it. harden needs tall cutters and 3. jj cut and dunked on 3 passes from harden last game. seems harden needs a different lineup. more aggressive more cutters. don’t know man",
    "944": "@kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz Look at the wolves man",
    "945": "To all BROOKLYN NETS FANS! In the words of @AaronRodgers12  \nR-E-L-A-X 🤣. This is clearly why @KDTrey5 is the best player n the world! When he comeback things will be looking up again.",
    "946": "@Patty_Mills - we’ve just touched down in Brooklyn from Melbourne and were hoping for some local tips please!\nWe’re coming to see you play on 3rd March against the Heat, Go Nets!",
    "947": "🔴Live Basketball ~ Brooklyn Nets vs. Utah Jazz - NBA League | 2022 🏀💯\n🔗 🔴Watch Live Fullᴴᴰ 👉 : https://t.co/w8OGnPY74C ✅\n📆 :On Friday. February 04 /2022\n⏰ : 9:00 PM\nDONT FORGET TO SHARE AND FOLLOW FOR MORE INFO AND UPDATE.",
    "948": "NBA 04/02\n\n🏀Mitchel( Utah Jazz) over 24,5 points🏀1unit\n\nEasy 1vs1 with Brooklyn,bad defence Nets\nUsage rate big,20+ shots and FT\n24,5??goooood\n\n🏀Irving(Nets) 25,5 over points🏀\n\n1vs1 with Conley easy,no Gobert in rocket\nUsage rate big,20+ shots and FT\n25,5?goood value",
    "949": "Congratulations to BKNets who moved up 2 spots to take #17 on the Brooklyn Nets team leaderboard.\n\nhttps://t.co/8yzss9CSSP",
    "950": "@kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz Would be really interesting to see an animated version of this showing how teams have changed over the season.",
    "951": "@thehill The same man that said \"Get his As-up out of here!\" When asked, what should the @BrooklynNets do with Kyrie, since He chose not to get vaccinated.\nThe same black man that aligns himself with Law enforcement.\nCelebrities are a problem for the everyday black American community",
    "952": "I said trade kyrie the beginning of the year 😂🤦🏾‍♂️ now look at y’all ass @BrooklynNets",
    "953": "@nvmpq @BrooklynNets He is incapable",
    "954": "@WGM_Lund @kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz How much a team score vs points they let in. So if Suns win a game 105-100, the net rating for that game would be 5.",
    "955": "@BrooklynNets don't leave KD hanging. Smmfh",
    "956": "@BluejayMBB @MZegarowski1 That man is so talented @BrooklynNets call him up",
    "957": "Brooklyn Nets NBA Women’s Tie Dye Shorts Grey Size Medium New With Tags #eBay🇺🇸 #Women #Shorts https://t.co/VY6BHS6cTG",
    "958": "In all honesty there’s plenty of things in NYC that cost a lot of money and shouldn’t exist besides a gold cube that we should be outraged over. A list:\n\n- Times Square\n- That tall giant cube building \n- The Brooklyn Nets\n- Trump Tower (all of them)\n- Catch",
    "959": "@NBAKrell 🤣 I call that bluff. Harden is going to walk this summer. They NEED Ben Simmons. Beal may be real possibility for the Sixers and the Nets would be out BOTH Harden and Simmons. With no real assets after giving them all away for Harden....complete disaster. Go kick rocks Brooklyn",
    "960": "@KingTechnical08 @NBAAllStar @BrooklynNets @JHarden13 He should be over Wiggins",
    "961": "Utah Jazz vs Brooklyn Nets odds + more\nhttps://t.co/31MsOacJad\nhttps://t.co/31MsOacJad",
    "962": "Draft Bronald @BrooklynNets https://t.co/88ixivG7xp",
    "963": "👀 John Abbamondi, who was hired in July 2020 by Joe and Clara Wu Tsai, to run their Brooklyn sports holding company, including the Nets, has resigned, BSE Global announced in a surprise press release Tuesday.👀\nhttps://t.co/tNjsQo2jCk",
    "964": "@kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz WOLVES 😰",
    "965": "Just don’t get how a sports analyst could hate the Brooklyn Nets so much 😂",
    "966": "@Rosenbergradio @DonLagreca @RealMichaelKay Watch \"UNDISPUTED | Skip Bayless reacts Kyrie Irving reportedly views NBA career as a 9-to-5 job\" on YouTube - https://t.co/bFMz1atG5D\nThe Brooklyn NETS Big 3: Kevin Durant, James Harden &amp; Dolly Parton 😐",
    "967": "The Brooklyn Nets are looking to end their 3-game losing streak by taking on the Utah Jazz tonight! Tune in at 9PM ET! #BrooklynNets -Josh B. https://t.co/GUfgJgRDtJ",
    "968": "@BrooklynNets Lol 7 Ls in a row! Sheesh went from 1st seed to 5th seed",
    "969": "@jJayAyeGarcia @statmuse Yeah, really trying to stick it to the two Nets fans who actually live in Brooklyn.",
    "970": "Brooklyn Nets vs Utah Jazz NBA Pick and Prediction NBA Betting Tips 2/4/2022 https://t.co/1mBlwetL52 via @YouTube #NBA #NBAPick #NBAPredictions #NBAOdds #Jazz #Nets #NetsWorld #TakeNote #JazzVsNets",
    "971": "@neerajmpatel One of the only informed takes out there. Maybe Joe or the @BrooklynNets should call you!",
    "972": "@BrooklynNets @KyrieIrving @RealDealBeal23 Savage Nets season! Send Kyrie to Wizards for Dinwiddie&amp;+. Nets can always resign KI n summer. KI goes to a team he can play all gms dis season. Nets get a player who desires to b n Brook/took Nets to bubble/can play all gms. Make sense?",
    "973": "Companies exploring the #metaverse\n\n- Apple\n- Meta\n- Sony\n- Nike\n- Adidas\n- Nvidia\n- Disney\n- Puma\n- Microsoft\n- Samsung\n- Walmart\n- Warner Music\n- Brooklyn Nets",
    "974": "The Brooklyn nets situation makes me sick.\n\nI grew up loving two sports.\n\nPRO WRESTLING AND NBA!\n\nWhat's going on with Kyrie Irving is ridiculous.\n\nKevin Durant only signed with Brooklyn because of kyrie Irving.\n\nAn now he basically doesn't give a dam about the game anymore.🤬",
    "975": "@BrooklynNets Another L incoming can’t wait for KD to be back I’ll watch then",
    "976": "Consensus Line Move:\n2022-02-04 Brooklyn Nets at Utah Jazz from 230.50 to 232.00\nOver steam engine\n#NBA #betting #python #btc",
    "977": "NBA’s @BrooklynNets are entering into the #Metaverse. The League has trademarked the term “Netaverse” and implemented #VR and #AR technologies. Check out their video made by over 100 high-resolution cameras creating life-like 3D renderings. \nhttps://t.co/lzVO8GkzCG",
    "978": "Despite their recent skid, the Brooklyn Nets are still the favorites to win the Championship @BetMGM 👀 https://t.co/LXypS3Y41H",
    "979": "@doc_singing I would go upstairs and say 'get (Kyrie) up out of here. ... Get him up outta here'…” O'Neal said when asked what he would say if he was Irving's teammate on Tiki and Tierney Wednesday. “Whoever owns the Brooklyn Nets, get his ass up outta here.”Sep 29,",
    "980": "Longest loss streak in #NBA now belongs to Brooklyn #Nets, who nonetheless are a good play in Utah tonight. Here's why: https://t.co/ePsGfGEb36",
    "981": "@BrooklynNets So smooooth!",
    "982": "James Harden is to blame for the Nets struggles. Look at the number of games he's scored less than 20 points over the last 4 years.\n\nLast 2 Years in Houston\n10 out of 146 (7%)\n\nFirst Two Years in Brooklyn\n31 out of 88 (35%)\n\n#nba #NetsWorld #jamesharden #KyrieIrving #KevinDurant",
    "983": "@BrooklynNets \nCAN I MAKE A SWAMP DRAGONS HOODIE??!🙏",
    "984": "NBA Betting Trend: Brooklyn Nets are 10 - 21 when the total is greater than or equal to 220 this season\n#bettingadvice",
    "985": "@kirkgoldsberry @KeithSmithNBA @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz Celtics boutta get the 4th seed soon maybe 3rd",
    "986": "The Brooklyn Nets experiment is looking like it’ll be over by the end of this year. Tough.",
    "987": "@kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz Jeez @Pacers, we really gotta change something here.",
    "988": "@Evan_Newell @greenbean3742 @kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz Him and Marcus are partners in time",
    "989": "\"Barbra Streisand Net Worth: Barbra Streisand is an American singer, songwriter, actress and filmmaker from Brooklyn, New York who has a net worth of $400 million...\" It is interesting that it is only artists with $50-500 million dollars who can't stand freedom of speech. https://t.co/xW9GmzWCbF",
    "990": "@uselesstinsel @W4k3up_ @kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz blew them out in miami when they had all those dudes available",
    "991": "@BrooklynNets @JHarden13 Well deserved ‼️",
    "992": "@NBAKrell Yeah. So make the trade today then @BrooklynNets 🤦🏾‍♂️",
    "993": "@kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz Nature is healing https://t.co/MxfXuEb8l6",
    "994": "@kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz Warriors 👀😤",
    "995": "@DaChowder @Christi91883608 @I_AmPharaoh @KDTreeey5 @RealCodyMallory Harden isn’t getting traded at the deadline imo. Philly has no incentive. They can wait for a straight up S&amp;T for Simmons in the off-season. That’s the absolute best case scenario for Brooklyn I’m afraid. Worst case, Morey makes cap room by off-loading Tobias and Nets get nothing",
    "996": "@BrooklynNets another day - another L, nice.",
    "997": "Good Friday morning,\n\nThe Brooklyn Nets have 1 win against a team with a record over .500 since December 16th.\n\nEnjoy your day.",
    "998": "@BrooklynNets Steve NASH preach all about start how we start Me I preach it not about how you start but it is about how u finished as A coach find ways to make adjustments along the way but always finish strong finish each quarter strong that way you finish the game strong we can win tonight",
    "999": "@mattmcfc_ @BrooklynNets We literally lost at kings 🙂🙂🙂🙂",
    "1000": "@BrooklynNets Trade kyrie and fire nash",
    "1001": "2 team teaser.. Bulls played in OT last night Lavine questionable hoping he doesn’t play.. Brooklyn should be able to cover and possibly win outright tonight. \n#GamblingTwitter \n#sportsbettingpicks \n#FreePicks \n#Bulls \n#Pacers\n#Nets\n#Jazz https://t.co/ZhvbTw9hMH",
    "1002": "@BrooklynNets Win for @yourfavballer7 sake",
    "1003": "Will the @utahjazz 👀 you at tonight's game vs. the @BrooklynNets? Let us know in the comments below! https://t.co/8RzrrasLNK",
    "1004": "@BrooklynNets Win the game. If harden wants out trade him before the deadline so we can get assets",
    "1005": "@BrooklynNets Can't wait to take another L tonight 🙌",
    "1006": "@EriqAllen @Realjasmoc @KDTrey5 @ESPNNBA @stephenasmith How is it weak the man was a FA which means he can go anywhere . But playing with Kyrie and Harden being traded to @BrooklynNets for a bag of cookies and a snicker bar wasn’t weak . You MF crack me you can’t have both ways 🤡.",
    "1007": "@BrooklynNets Fire Steve Nash.",
    "1008": "@PazTjt @BrooklynNets Probably busy counting the collection from the suckers in his congregation.. .. now THAT is beyond selfish.. that’s a con aka preacher man",
    "1009": "@BrooklynNets We def losing 💀😭",
    "1010": "@BrooklynNets @HSpecialSurgery JOE PLEASE! WE WAIT EAGERLY YET IMPATIENTLY FOR YOUR RETURN",
    "1011": "@nvmpq @BrooklynNets @HSpecialSurgery He’s fine",
    "1012": "Report: Nets sharpshooter Joe Harris may require second surgery on injured ankle #Brooklyn #Nets #NBA https://t.co/Hj8ZDs5aSV",
    "1013": "@BrooklynNets Please win",
    "1014": "@nvmpq @BrooklynNets Racially motivated",
    "1015": "@BrooklynNets So are y’all gonna wake up Or just keep playing pathetic? Is James harden going to keep playing victim? Or is he finally going to shut up and do what a superstar is supposed to do? Will Steve nash finally coach the team? Or continue to be a deer in the headlights.Let’s see",
    "1016": "Love being a season ticket holder of the @BrooklynNets https://t.co/cDPY7lqgqO",
    "1017": "@nvmpq @BrooklynNets @HSpecialSurgery Why should he rest ?",
    "1018": "@KDTreeey5 @BrooklynNets Let’s go you finally realized brooklyn is ass",
    "1019": "@NBA @BrooklynNets losing streak about to end.",
    "1020": "@BrooklynNets Oh great more disappointment incoming",
    "1021": "@BrooklynNets get that first pick baby https://t.co/WNCGqQJfDt",
    "1022": "@BrooklynNets You better win ffs",
    "1023": "@BrooklynNets We're losing",
    "1024": "Nets @HSpecialSurgery Status Report for tonight’s game at Utah https://t.co/L7MbYvuQDz",
    "1025": "The Brooklyn Nets could be without Joe Harris for even longer than expected.  https://t.co/FzRJ3Oyqd4",
    "1026": "@BrooklynNets another defeat incoming",
    "1027": "@BrooklynNets About to lose 7 in a row, not even watching this BS anymore to painful",
    "1028": "@BrooklynNets Plz win",
    "1029": "@BrooklynNets Please win a game",
    "1030": "@BrooklynNets Let's get a win please",
    "1031": "@BrooklynNets😊😊we gat this https://t.co/9uquqlU2kK",
    "1032": "@MlKETETS @BrooklynNets not watching till Steve gets fired. *",
    "1033": "@BrooklynNets please fire nash man",
    "1034": "@BrooklynNets one more L",
    "1035": "This @shoptier + @BrooklynNets collab just made me so happy! 🖤 \n\nIt’s only up from here💫",
    "1036": "The College Network Nick Wright: ‘The Brooklyn Nets have no shot in the East’ I FIRST THINGS FIRST https://t.co/EzMkXNoXYb",
    "1037": "@BrooklynNets Don’t lose 🙂",
    "1038": "@BrooklynNets Please win ffs",
    "1039": "@BrooklynNets ask your pg if he gives a fuck today",
    "1040": "@BrooklynNets Hoods not watching",
    "1041": "@BrooklynNets please just fucking win. if this losing streak goes on idk what ill do.",
    "1042": "@BrooklynNets Cant wait to be on a 7 game losing streak",
    "1043": "Gameday in Salt Lake City 🏔️ https://t.co/EHxMUZrtOH",
    "1044": "NBA Betting Preview:  Brooklyn Nets vs. Utah Jazz - Friday, February 4, 2022 https://t.co/VFWPHgv6AY",
    "1045": "Vegas usually knows but I have no idea what they see right now in the Brooklyn Nets that makes them NBA Finals favorite 🤷🏻‍♂️ I hope they are right but man #NetsWorld",
    "1046": "@hoop_power @Giannis_An34 @Bucks @KDTrey5 @BrooklynNets @KingJames @Lakers @JoelEmbiid @sixers @nuggets No Draymond.... shocking 🙄",
    "1047": "If true he's gonna be a Brooklyn Net https://t.co/g4SzpQctGL",
    "1048": "Announcement: I am not just a Nerd anymore i like sports to \nSoccer: @ManUtd ,@orlandopirates\nBasketball: @BrooklynNets \nRugby:@AllBlacks \nWish me well in pretending i know what I'm talking about",
    "1049": "Nah this Tier x Brooklyn Nets collab is everything they’re going crazy over there.",
    "1050": "@kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz embarrassing",
    "1051": "@MargsMT Brooklyn Nets ain’t that much better either G.",
    "1052": "@kirkgoldsberry @SullyLDS @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz I want lonzo and Caruso back maaaan",
    "1053": "Our Model's Current Picks to make the #AllNBA First Team\n\n1 @Giannis_An34 (@Bucks)\n2 @KDTrey5 (@BrooklynNets)\n3 @KingJames (@Lakers)\n4 @JoelEmbiid (@sixers)\n5 #Jokic (@nuggets)\n\n#NCAABasketball #NBAAIIStar #NBATwitter #StatsTwitter #DataScience #PredictiveAnalytics https://t.co/V5ZuuVWwIJ",
    "1054": "@Alec_Sturm Cool....it's gonna help Philly for Brooklyn to be saddled with a $270M investment in Harden. Especially with the engine of #Nets offense, Joe Harris in jeopardy. Without his shooting/gravity....",
    "1055": "@cocker_as @gothgar666 @BLKRZN @kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz the hawks are 8-3 since getting rid of our worst player, against a much tougher schedule than the celtics have played. check back in a couple of weeks. in the meantime https://t.co/FBSkYDA889",
    "1056": "Brooklyn Nets Defense Down Bad Without Kevin Durant in the Lineup #Netsworld https://t.co/zbscpOfHU0",
    "1057": "(MON.FEB.14) NBA:SAC-BKN PICK:The Valentine's Day slate of NBA Games begins w/a good one as the Kings visit the Nets in Brooklyn! The Nets win this one @ home:NETS 123-120",
    "1058": "@kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz My Celtics 🍀",
    "1059": "@connor15owens @kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz @mattchaggaris They keep pulling out the Efficiency Landscape....",
    "1060": "Nets at Jazz: Prediction, point spread, odds, over/under, betting picks #Brooklyn #Nets #NBA https://t.co/aTMlzuWEPh",
    "1061": "@BrooklynNets may be the dumbest franchise in history. Yall about to let @JHarden13 walk out without compensation.",
    "1062": "Need to hit a Brooklyn Nets game before the season over!",
    "1063": "@gothgar666 @BLKRZN @kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz my team beat the mid celtics by 16 last week, because my team is actually good. wtf am i supposed to be coping about?",
    "1064": "Niggas really got a Brooklyn Nets collab… Gotta let Ni, Vic and E tell the story one day.",
    "1065": "@BLKRZN @kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz if you want to delude yourself into thinking the celtics are not extremely average because they beat the kings by 53, go right ahead. it will be that much funnier when y’all lose in the play in",
    "1066": "@kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz Rockets aren’t the worst defense anymore :)",
    "1067": "@shooter_spike @kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz they are very mid without gordon hayward, yes",
    "1068": "Nah that Tier x Brooklyn Nets collab 🔥",
    "1069": "Shouts to @shoptier &amp; @BrooklynNets for that opportunity!",
    "1070": "@BrooklynNets @clovercommerce Kess!!!",
    "1071": "@kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz We da ones Jack",
    "1072": "His performance at Brooklyn nets has been underwhelming",
    "1073": "@kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz Suns defense without Ayton and Crowder",
    "1074": "Nick Wright: ‘The Brooklyn Nets have no shot in the East’ I FIRST THINGS FIRST https://t.co/Wss8KZkV4h",
    "1075": "In light of the Nets’ constant attrition, Kessler Edwards has emerged as a consistent rotation player for Brooklyn after being a second round pick last year. On the rookie’s demeanor and path from Malibu to NYC, which has served him well this year: https://t.co/n63exz5oBb",
    "1076": "How much trouble are the Nets in?\n\n\"They look bad but the silver lining for the Nets: who in the East looks terrific? Milwaukee is probably the only team in the East that can beat Brooklyn in a playoff series. Brooklyn's far from out of contention.\" — @Chris_Broussard https://t.co/lPUnjJWVyg",
    "1077": "Imagine if Brooklyn Nets drafts Bronny James. https://t.co/TRj4se3FI9",
    "1078": "Y’all KNOW I’m a Knicks fan, through and true, but I am beyond grateful to be a part of this collaboration with my TIER family.\n\n@shoptier X @BrooklynNets — We are the Throughest Borough. From the Streets, to Barclays.\n\n2/8/22 🏀 https://t.co/8Hs4FjxVTZ",
    "1079": "@kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz Suns slipping on defense, glad we have some of our defensive anchors back in Ayton, Jae, McGee",
    "1080": "@uselesstinsel @kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz Why doesn’t every team just beak the kings by 53 then?",
    "1081": "60% OFF the Pro Standard NBA Brooklyn Nets Joggers\n\nSHOP HERE: https://t.co/82MW3eHyJy https://t.co/Ek5eL3qZK3",
    "1082": "TIER x Brooklyn Nets ✅\n\nWhat’s next? 😅 https://t.co/gdFIMaaOPF",
    "1083": "@uselesstinsel @kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz Hornets are a sorry team?",
    "1084": "@kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz Hawks' defense improved",
    "1085": "i know @BrooklynNets team like @EricSpyroNBA &amp; @itsjkav can create same wild video (allstars) like this\n\n#Netsworld https://t.co/fNRhrkf1WG",
    "1086": "@mysticabysss I would go upstairs and say 'get (Kyrie) up out of here. ... Get him up outta here'…” O'Neal said when asked what he would say if he was Irving's teammate on Tiki and Tierney Wednesday. “Whoever owns the Brooklyn Nets, get his ass up outta here.”Sep 29,",
    "1087": "Nick Wright: ‘The Brooklyn Nets have no shot in the East’ I FIRST THINGS FIRST https://t.co/ikCtEs1v13",
    "1088": "Nets at Jazz: Lineups, injury reports and broadcast info for Friday #Brooklyn #Nets #NBA https://t.co/7Y9Zueuac6",
    "1089": "@kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz Defense just gotta come around now",
    "1090": "Nick Wright: ‘The Brooklyn Nets have no shot in the East’ I FIRST THINGS FIRST https://t.co/sVRj0DSxLB",
    "1091": "@CjKash20 @BrooklynNets nothing i just wanna see if harden id questionable again or nah",
    "1092": "@manjothree @kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz Makes sense.",
    "1093": "Nick Wright: 'The Brooklyn Nets have no shot in the East' I FIRST THINGS FIRST https://t.co/grQEYwR74Y",
    "1094": "Nick Wright: 'The Brooklyn Nets have no shot in the East' I FIRST THINGS FIRST https://t.co/DyVBkUgEQC",
    "1095": "Brooklyn Nets' James Harden Selected for 2022 NBA All-Star Game | B... (Brooklyn Nets)\n\nJames Harden has joined Kevin Durant as a 2022 NBA All-Star.Harden's selection among the Eas...\n\nAdd your highlights:\nhttps://t.co/KicDte7ajF\n #Brooklyn_Nets",
    "1096": "@kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz Warriors starting to figure things out on offense again.",
    "1097": "Brooklyn Nets to Honor Black History Month with Series of United Ga... (Brooklyn Nets)\n\nBROOKLYN - The Brooklyn Nets will celebrate Black History Month during each of the team's fi...\n\nAdd your highlights:\nhttps://t.co/WqA4V6AzAF\n #Brooklyn_Nets",
    "1098": "@W4k3up_ @kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz without lowry butler or tucker",
    "1099": "@BrooklynNets let’s give the Knicks milsap for Randle https://t.co/EMnKJNEfIa",
    "1100": "@kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz The Blazers are now just bad at defense instead of terrible.",
    "1101": "@BrooklynNets post the injury report pls fam!!!",
    "1102": "nets finally beating the heat this season, in the latter half of a back to back after traveling from milwaukee to brooklyn https://t.co/oSbc6vFSTh",
    "1103": "Revenge Game: Bojan Bogdanovic plays Brooklyn tonight.  He played 212 games in his career for the Nets.",
    "1104": "@BrooklynNets @shoptier Winning games should be a great way to celebrate",
    "1105": "@kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz boston played a bunch of sorry teams and beat the kings by 53",
    "1106": "This is how the #BrooklynNets are gonna try and bring back Kyrie for the rest of the season. https://t.co/M8jpnczgTp",
    "1107": "@kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz Warriors are back",
    "1108": "@BrooklynNets @shoptier If the Doomsday clock was today I think it would be the best thing for this Nets team! They don't want to do what needs to be done no matter how many people say you need stronger D, OFF rebounds and holding teams under 100!",
    "1109": "@kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz So the Warriors dont need Draymond? I feel like the media has some explaining to do...",
    "1110": "@BrooklynNets @shoptier gonna need some of this fit",
    "1111": "@BrooklynNets @shoptier Fire Steve Nash",
    "1112": "Fuck Kyrie and the nets fans who insist on making excuses for him. \n\nKyrie was a problem in Cleveland \nKyrie was a problem in Boston\nKyrie is a problem in Brooklyn \n\nWe gave him the benefit of the doubt here and he’s made us look stupid.",
    "1113": "From the streets to Barclays Center.\n\nIn celebration of #BlackHistoryMonth, we’ve collaborated with @shoptier on an exclusive merchandise line that will be available starting Tuesday at the Nets Team Store at Barclays Center. \n\n➡️ https://t.co/np0C2MbEzr https://t.co/OjIi5079ji",
    "1114": "Brooklyn Nets to Honor Black History Month with Series of United Games Throughout February  - https://t.co/lulBRASVGV #Nets",
    "1115": "East 👇🏾\n• Jimmy Butler - Miami Heat\n• Darius Garland - Cleveland Cavaliers\n• James Harden - Brooklyn Nets\n• Zach LaVine - Chicago Bulls \n• Khris Middleton - Milwaukee Bucks\n• Jayson Tatum - Boston Celtics\n• Fred VanVleet - Toronto Raptors\n\n#NBA \n#NBA75 \n@hooptalk918",
    "1116": "@kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz @AtlHawksTurkey hunter effect",
    "1117": "@bweeek @kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz But they’re an embarrassment to the league, and everyone in charge should be fired… 😏",
    "1118": "@kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz The Celtics! Alright!",
    "1119": "@kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz This graph is going to be my new pfp",
    "1120": "Two wounded teams will meet tonight when the Utah Jazz host the Brooklyn Nets. Is either side a good fit for your NBA picks?\n\n#TakeNote vs. #NetsWorld\n#NBA #NBA75\n\nRead picks and odds for tonight's game ⤵️⤵️⤵️ \nhttps://t.co/bU7ZW7RneY",
    "1121": "@kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz How are the blazers positive in defense? I dont believe in this",
    "1122": "@RealCodyMallory Real Brooklyn Nets fans are getting frustrated by the theoretical big three that can’t get on the court together. Nets gave up everything for this…. Two of three can be FA this off-season.",
    "1123": "@kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz it just took a little bit for all the new pieces to integrate and jell💚",
    "1124": "@kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz A #6 net with a #20 defense is crazy. Same with Denver",
    "1125": "Brooklyn Nets' James Harden Selected for 2022 NBA All-Star Game - https://t.co/z6gF3KhVHJ #Nets",
    "1126": "@kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz Most of that Suns number is without Ayton too.",
    "1127": "Do you know who the Nets could use? Jarrett Allen. #NBA #BrooklynNets",
    "1128": "@kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz Chris Finch one of the best coaches in the league easily",
    "1129": "#RIP to long time @NBA coach Bill Fitch, I had a chance to try out for his @BrooklynNets (New Jersey back then) in the early 90s and he was a really nice guy. https://t.co/6dLi2Etfhf",
    "1130": "@john_keim Team mascots always need an adjustment but almost always end up sounding normal. The silliest one of all time, by far, is Brooklyn Nets (imagine if Snyder et al had gone with Washington Goalposts), but at this point nobody even bats an eye at it",
    "1131": "@BrooklynNets @JHarden13 You guys cant win without Durant",
    "1132": "@kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz @mef285 here we come",
    "1133": "@kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz Defense so good we almost off the chart",
    "1134": "@kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz Just a matter of Time https://t.co/WOHw4Nu7BW",
    "1135": "Brooklyn Nets Big 3 Poster Basketball Painting Hand Made Posters Canvas Print Kids Wall Art Home Man Cave Gift Decor (36\"x24\" Ready to Hang)\nhttps://t.co/589dciB6KR",
    "1136": "Consensus Line Move:\n2022-02-04 Brooklyn Nets at Utah Jazz from 228.50 to 230.00\nOver this just in\n#NBA #gambling #coder #investingtips",
    "1137": "James Harden says the #BrooklynNets must \"push forward\" after their sixth straight defeat 👊 https://t.co/Evovy7lih3",
    "1138": "The Utah Jazz and the Brooklyn Nets will have a crunch showdown in the NBA Regular Season when they meet at the Vivint Smart Home Arena in Salt Lake City, Utah on the morning of Saturday 5 February 2022.\n\nRead more about it in our blog 👉 https://t.co/RmVzl3hS3i https://t.co/ZLkrdDLs5U",
    "1139": "@qudah_khaled @N0t10fThem @Veto_Roan @SportsCenter We had an off night if we played like how we did against the Brooklyn nets then you’d lose",
    "1140": "@gReenbean_26 @kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz Bacon Tatum",
    "1141": "@RealCodyMallory All Brooklyn Nets fans want Harden to succeed. He plays well, the Nets win. Simple as that. Unfortunately, they're going to lose a lot more before winning much. That's a fact. That's not negativity",
    "1142": "@kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz We here https://t.co/L5TEoaw9jB",
    "1143": "@NajeeForSix @kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz ofc 3PM EST 💯💯",
    "1144": "@BrooklynNets @JHarden13 Will get you stats but no chips.",
    "1145": "@kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz @ZO2_ @ACFresh21 we need you back",
    "1146": "@NajeeForSix @kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz 💀💀💀 you better!",
    "1147": "Brooklyn Nets vs  Utah Jazz Prediction 2/4/22 -  Free NBA Picks https://t.co/IfX0oiYzS4 via @YouTube \n\n#NBA #NBAPick #NBAPrediction #Basketball #NBATWitter #NetsWorld #UtahJazz",
    "1148": "@BrooklynNets @JHarden13 Sorry he doesn’t deserve to be an all-star this year. Gives about 70% effort every year.  Fact is he is an actual loser. Can’t win with this guy.  I wish it wasn’t so…",
    "1149": "@NajeeForSix @kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz you already know 🤝😂",
    "1150": "@kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz We here!",
    "1151": "@kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz Twolves👀",
    "1152": "@BrooklynNets trade for Derrick Jones Jr please. We need a wing defender",
    "1153": "Bid now to win! Jason Kidd Game-Worn Jersey 2002-03 Fleer Flair New Jersey #Nets HOF # CK-JK #TheHobby #NBA #Brooklyn #Collect https://t.co/1NrMTUY7if @eBay",
    "1154": "#DYK -The #Brooklyn @BrooklynNets started out as the #New Jersey Americans in 1967!",
    "1155": "@kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz The Pacers should have kept Dan Burke.",
    "1156": "@kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz This is a crazy one",
    "1157": "@RealCodyMallory I get the frustration, but he is a Brooklyn Net, we need to support our players.",
    "1158": "https://t.co/t3hwcsqJtO\n\n@spidadmitchell and @mconley11 taking on James Harden and Kyrie Irving, that’s a showdown worth the price of admission as the @utahjazz look to keep its momentum when it hosts the @BrooklynNets on Friday night\n#TakeNote",
    "1159": "@kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz Celtics on a roll! No one wants to play a healthy C's in the first round, let's be real.",
    "1160": "Welcome to the Netaverse, Where Brooklyn Nets Players Can Be Seen in a Whole New (3D) Light https://t.co/vhUtde5Z2R",
    "1161": "RT NYPost_Lewis: According to Joe Harris' agent Mark Bartelstein, the sharpshooting wing could need a second procedure \"that would fix the… #BrooklynNets",
    "1162": "@kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz OKC has no business being where they are defensively and Mark Daigneault is coaching his ass off",
    "1163": "@BrooklynGuy2021 VEM PRO BROOKLYN NETS TY LUE",
    "1164": "@kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz Orlando is out of the quadrant of woe!!!",
    "1165": "@kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz @ryenarussillo I know you only like to talk about brown/Tatum when there’s negative things to say",
    "1166": "@NBAAllStar @JHarden13 @BrooklynNets And 4 points",
    "1167": "@kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz I would've thought that the Hawks would be better.  \n\nCelts are finally healthy and have started to beat up on an easier schedule.",
    "1168": "@kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz Warriors need a center!",
    "1169": "@kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz Thibs wake up!",
    "1170": "@kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz Mavs offense literally doesn’t exist lol",
    "1171": "@kirkgoldsberry @celtics @Suns @nuggets @dallasmavs @Timberwolves @Lakers @warriors @BrooklynNets @chicagobulls @utahjazz the rockets are on the chart!!",
    "1172": "Steve Nash coaches the Brooklyn Nets tonight 🔥🔥🔥 https://t.co/GTHtQbGt0B",
    "1173": "Ben Simmons will be a Brooklyn Net\n\nBen Simmons will be a Brooklyn Net\n\nBen Simmons will be a Brooklyn Net\n\nBen Simmons will be a Brooklyn Net\n\nBen Simmons will be a Brooklyn Net https://t.co/5SYADRF7KJ",
    "1174": "🏀@BrooklynNets at @utahjazz🏀\n\nNets has lost six straight, including the last two. Jazz, meanwhile, will be getting a boost by seeing @spidadmitchell return.\n\n#InsidersMag #SportsBetting #BettorsAlly #ExpertPicks #BettingNews #BettingPicks \n\n▶Read more: https://t.co/Oi2nJN2Swl",
    "1175": "Real Brooklyn Nets fans still want James Harden to succeed\n\nHe is a vital part of the Nets success",
    "1176": "🔴 Live▶ Brooklyn Nets vs. Utah Jazz - NBA League 2022\n🎟️🎥Watch Live Game➠  https://t.co/zEgOG2pnLb\n📅 : Friday, February 04, 2022\n⏰ : 9:00 PM",
    "1177": "The @BrooklynNets shouldn't be allowed to wear throwbacks #Jersey https://t.co/TV7YYApUzL",
    "1178": "@Browntime3 @BallsackSports @BrooklynNets Haha nice try",
    "1179": "The Brooklyn Nets need a win like _____ needs a _____ ??",
    "1180": "@Browntime3 @BallsackSports @BrooklynNets Bro this page tweets fake stuff on purpose 🤦🏾‍♂️",
    "1181": "Loons try gas me with court side tickets to watch the basket ball, I’m trying to explain to him London lions ain’t like the Brooklyn nets g lol",
    "1182": "Keys to a Brooklyn Nets victory tonight in Utah\n\n-Get Harden and Irving going early (both struggled last game combined 7-26 from field)\n\n-Play with a sense of urgency/desperation\n\n-Defend without fouling and end defensive possessions (rebounding)\n\n-Contain Donovan Mitchell 25PPG",
    "1183": "2022 #NBAAllStar Reserve @JHarden13 of the @BrooklynNets in action! https://t.co/eTZBSxNDuW",
    "1184": "Brooklyn Nets Sign Paul Millsap https://t.co/ggRxV3mNzt",
    "1185": "@BrooklynNets_Fr and @TrashTalk_fr  family. This one might be for you!https://t.co/FzWp2HxIi9",
    "1186": "I do not ask for a lot, all I ask for is a Brooklyn Nets win tonight",
    "1187": "Tonight the Brooklyn Nets (29-22) visit the Utah Jazz (31-21) at 9:00 🕘 @YESNetwork #Brooklyn #Nets #NBA #NetsWorld",
    "1188": "Brooklyn #Nets guard #JoeHarris might need a second procedure on his left ankle, a decision that will be based on his progress over the next one to two weeks, his agent, Mark Bartelstein of Priority Sports, told ESPN on Thursday. 🏀  🤕 #NBATwitter \nhttps://t.co/ic7n58mUUM",
    "1189": "@BallsackSports @BrooklynNets Miswell trade Couple draft picks",
    "1190": "The Nets may be a mess, but they're still rightfully the NBA title ... (New York Post)\n\nIt has been two weeks since the Nets won a game.\n\nAdd your highlights:\nhttps://t.co/koC6vGOKHx\n #Brooklyn_Nets",
    "1191": "2 hours left! Jason Kidd Game-Worn Jersey 2002-03 Fleer Flair #NewJersey #Nets HOF # CK-JK #TheHobby #NBA #Brooklyn https://t.co/1NrMTUY7if @eBay",
    "1192": "The Nets should have moved to Atlantic City and not Brooklyn",
    "1193": "@_adam_jansa_ @Seby76335955 @BrooklynNets Did kai not win against him in there prime or no? Does kai not lock him up when he has help or no? Kai is known as the best one on one player of ALL TIME curry flings the damn ball down the court and makes it some how don’t even get me started on klay curry is the best one sure",
    "1194": "@BrooklynNets @JHarden13 Love",
    "1195": "Brooklyn #Nets vs. Utah #Jazz  |2/3/22 | NBA  Free Picks and Predictions | NBA Betting Tips  \n\nWatch: https://t.co/DQlslrX57f\n\n#NBA #NBAPick #NBAPredictions #netsvsjazz",
    "1196": "NBA preview: Utah Jazz v Brooklyn Nets as Denver Nuggets hosts Brooklyn Nets  https://t.co/3dTCLeXtuB",
    "1197": "Brooklyn Nets: Harden and Irving’s excuses advance the end of their Big Three? https://t.co/Zlm2AvXBLM",
    "1198": "Your Friday lineup on The Zone:\n\n6-10 am: DJ &amp; PK in the Morning\n\n10 am-12 pm: Jake Scott &amp; Ben Anderson\n\n12-3 pm: Hans &amp; Scotty G at @VWSouthtowne\n\n3-6 pm: Unrivaled with Alex &amp; Scott at The @WarehouseSLC\n\n6 pm: @utahjazz vs. @BrooklynNets\n\n📻 97.5-FM/1280-AM\n📱 Download our app https://t.co/MvVinbbRnR",
    "1199": "it’s about to go down,,, Feb-18-22  @BrooklynNets  @nyknicks  @NYCMayor not evenn mayor Adams can't stop it, the trill of the game, @thegardengarden @barclayscenter see you at the game, all fan out , day!!! https://t.co/iJ02Yc0X7n",
    "1200": "What's #Best on https://t.co/DVTf2jd2ZR ?\nDevin Booker Recaps The Suns' Win Against The Nets : Nba On Espn\nhttps://t.co/tPVbXGafvC\n#sports #brooklynnets #phoenixsuns #devinbooker #walkoffinterview https://t.co/weCQxVq0jq",
    "1201": "#Best of the day on https://t.co/MqmlMsmdvk\nDevin Booker Recaps The Suns' Win Against The Nets : Nba On Espn\nhttps://t.co/DzhWmQfaAA\n#sports #brooklynnets #phoenixsuns #devinbooker #walkoffinterview",
    "1202": "What's #Best on https://t.co/VfZu3jgOen ?\nDevin Booker Recaps The Suns' Win Against The Nets : Nba On Espn\nhttps://t.co/XEFWSDalQw\n#sports #brooklynnets #phoenixsuns #devinbooker #walkoffinterview",
    "1203": "@BrooklynNets @JHarden13 Son DEFF DONT DESERVE THAT SPOT , sorry not sorry",
    "1204": "hey, @BrooklynNets dont lose tn pls thanks in advance",
    "1205": "Hard work , Beats Talent\nWhen Talent Doesn‘t Work hard\n\n-KD\n\n#Kevindurant @KDTrey5 @NBA @BrooklynNets",
    "1206": "This Brooklyn Nets team was so fun to watch https://t.co/MI8pHSyX5R",
    "1207": "@matthmathis @usatodaysports hes got Barclays centre ... basketball .. Brooklyn Nets",
    "1208": "@boxingscene The same Brooklyn Nets should do win a Championship without a Coach #NBA #BrooklynNets",
    "1209": "@BrooklynNets @Barclays Jessica is a caring and wonderful person. Thanks Brooklyn Nets for honoring our essential workers",
    "1210": "@LisaCol86334315 @BrooklynNets @JHarden13 Maybe watch his 10 assists per game casual?",
    "1211": "E o nosso Brooklyn Nets hein??????",
    "1212": "Lmao can’t buy rings @BrooklynNets https://t.co/zYkWocfZtU",
    "1213": "@tylerrunyan4 @MiahMarvelous @devinbookerphx1 @kingyoshi_13 @somehowjacob Yeah, Brooklyn Nets were hurt last year (one of them hurt by Giannis).\nIs any of that false?",
    "1214": "#597 Kyr1e Irv1ng - Brooklyn Nets. 2021/2022 Season. \n\nJersey: Away.\nProject for basketball fans. Get your NFT now. @opensea \nhttps://t.co/vhEtg1cKLP\n\n#nft #NFTs #NFTCommunity https://t.co/LdP3Fs9SJv",
    "1215": "@NBAAllStar @BrooklynNets @JHarden13 Not deserved",
    "1216": "@MILBucksARG Los Brooklyn What if Nets 2021 nba champions😂😂",
    "1217": "@cyanshsharma007 @houston__13 @BurnerSpida @BrooklynNets @JHarden13 Ironic coming from a Curry fan",
    "1218": "@BrooklynNets @JHarden13 But couldn’t get double digit point last night.",
    "1219": "James Harden looks disinterested! – Jalen Rose on Brooklyn Nets | NBA Countdown https://t.co/eWklvQZoT0",
    "1220": "@AhmadMonk Come to Brooklyn nets bro",
    "1221": "NBA - Brooklyn Nets' Joe Harris might need second surgery on left ankle, agent says https://t.co/ueCqn5lGYk",
    "1222": "NBA Basketball Game Betting Picks Simulator: 9:10 PM ET - Brooklyn Nets vs. Utah Jazz - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/diYBhgDpIs #nba #sportsbetting #freepicks #cappertek",
    "1223": "@_adam_jansa_ @Seby76335955 @BrooklynNets Ight cool then he got the fire power they just gotta be heathy. Shit kai already better than Steph so it is what it is",
    "1224": "@NetsKingdomAJ Is Jamese Harden still the most valuable Brooklyn Nets' player? The KD disrespect must stop and never come up again ever ever👌",
    "1225": "RT @AGORACOM: News... @gameonfanapp $GET $GMETF Appoints Katrina Palanca to Board of Directors\n\n✅ Prior Corporate Partnership Experience with: @BrooklynNets @Twitch @TeamLiquid @Honda and @Verizon \n\n$GMETF $HIVE $HBLK\n\n#web3 #gamification #GamingSoci… https://t.co/Z8wg3El6h7",
    "1226": "I want a Brooklyn Nets vest 😠✨",
    "1227": "@PropGodRob @Cherif163 @BrooklynNets Aye u gave me a lot of then picks bro🔥appreciate it fr💯",
    "1228": "@LertLou @Cherif163 @BrooklynNets Good shit family ❤️❤️",
    "1229": "It’s Orlando, San Antonio, and Houston. James Harden will not leave the Brooklyn Nets especially for Philadelphia due to cap space restrictions because the Nets would have to agree to a sign a trade for Ben Simmons",
    "1230": "@BrooklynNets @JHarden13 Harden is perfect for the All Star game as nobody defends",
    "1231": "@Cherif163 @PropGodRob @BrooklynNets YESSIRRR🔥🔥🔥big win💰",
    "1232": "@idkhaveanameok @BrooklynNets @JHarden13 At least he plays unlike DurMadeOfGlass",
    "1233": "The Brooklyn nets have just landed in palm springs 🔥",
    "1234": "NBA Basketball Game Betting Picks Simulator: 2/4/2022 9:10 PM ET - Brooklyn Nets vs. Utah Jazz - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/diYBhgDpIs #nba #sportsbetting #freepicks #cappertek",
    "1235": "@NATERERUN This How I’m Pulling Up To The @BrooklynNets Game Valentines Day Nite❤️&amp;🏀",
    "1236": "Congratulations to Sircano91 (@Ccano91) who moved up 4 spots to take #6 on the Brooklyn Nets team leaderboard.\n\nhttps://t.co/8yzss9CSSP",
    "1237": "Brooklyn Nets aint play tonight yet after the TNT games are done the talk is the Brooklyn Nets lmao",
    "1238": "@BrooklynNets you’re welcome, you’ll thank me later just do it https://t.co/1zbTxkuW7o",
    "1239": "@houston__13 @BurnerSpida @BrooklynNets @JHarden13 4 points in 37 mints against one of worst team😭 https://t.co/L4oIOYihBU",
    "1240": "East Pool: Reserves\nJimmy Butler (Miami Heat)\nDarius Garland (Cleveland Cavaliers)\nJames Harden (Brooklyn Nets)\nZach LaVine (Chicago Bulls)\nKhris Middleton (Milwaukee Bucks)\nJayson Tatum (Boston Celtics)\nFred VanVleet (Toronto Raptors)",
    "1241": "East Pool: Starters\nKevin Durant (Brooklyn Nets) [captain]\nGiannis Antetokounmpo (Milwaukee Bucks)\nJoel Embiid (Philadelphia 76ers)\nTrae Young (Atlanta Hawks)\nDeMar DeRozan (Chicago Bulls)",
    "1242": "is Randle beg to join @BrooklynNets ? https://t.co/nZQxizPooU",
    "1243": "Massive Happy 13th Birthday to my daughter Alana 🎈✨🎉🧡4/4/22\nShe plays ball 🏀 for her middle school team &amp; her favorite team is the @brooklynnets 🖤 So her first gift 🎁 are Courtside Seats to an upcoming game in Orlando! So proud of her.\n#HBD #GirlDad #Love #NYC #Streetstyle https://t.co/Ce4bhRigwA",
    "1244": "@BrooklynNets @Patty_Mills What the hell is this!! These Ramapough people should be celebrating Black History month instead of pretending to be connected to us.   They are NOT Lenape or Muncey!! Strictly Pretendians!!",
    "1245": "@FrankiesTwoLoud You a Knicks fan .. think you need to focus on the Brooklyn nets",
    "1246": "brooklyn nets  https://t.co/tbOJ0pt5Wf",
    "1247": "#SacramentoKings - #BrooklynNets 112:101\n#NBA\n🇺🇲🏀🇺🇲🏀🇺🇲🏀\n\nMore info: https://t.co/hRWOd5VOdI https://t.co/Wj22Y4FL4Z",
    "1248": "Nobody fucks You more than the @BrooklynNets",
    "1249": "@BrooklynNets @JHarden13 i hope you win a chip 🙏",
    "1250": "Can we get Joe Harris healthy some point this season please @BrooklynNets",
    "1251": "Lowkey the Nets been looking like the Lakers recently. 2 superstars on the court but can't win games. The only reason Brooklyn got more wins is cuz of KD.",
    "1252": "James said he’s starting to realize that THE TIME IS NOW! 🤯👔🏀🤝 @JHarden13 @BrooklynNets 🗽📊🏆 #NetsWorld https://t.co/2rPgda6ouG",
    "1253": "Monday on @OneSportsPHL: @BrooklynNets vs @nuggets delayed at 9 am.",
    "1254": "So when do we get to see KD back 😢 #BrooklynNets #NetsWorld #Nets #NBA @BrooklynNets @NetsDaily @KDTrey5",
    "1255": "60% OFF the Pro Standard NBA Brooklyn Nets Joggers \n\nSHOP HERE: https://t.co/82MW3eHyJy https://t.co/Oc3hPAfcgW",
    "1256": "@BrooklynNets @JHarden13 Rockets fan here.....I don't know if Harden on the wrong side of his prime but he was beast mode for Houston.....he definitely ain't the same Beard for the Nets not even close.....he  not hooping like an allstar this year....plus he a reserve....he normally be a starter",
    "1257": "@MegaMohsi @jw8c @thehill So he called out Kyrie for not taking the Vax &amp; even went as far as saying the the Brooklyn Nets should get rid of him, I think that's forcing Kyrie. I wonder what changed.",
    "1258": "Brooklyn Nets upcoming 5 games\n\nBOS\n@ WAS\n@ MIA\nSAC\nNYK\n\nPredict their record throughout this span",
    "1259": "Tervis Made in USA Double Walled NBA Brooklyn Nets Insulated Tumbler Cup Keeps Drinks Cold &amp; Hot, 24oz, Primary Logo\nhttps://t.co/6QCL0P8zP9",
    "1260": "This all gonna be funny when the Brooklyn Nets win the chip in a few months https://t.co/LVvzIrEkaV",
    "1261": "The Moment it went bad for Brooklyn Nets Joe Harris Smhh #NetsWorld https://t.co/W38k7MzCq8",
    "1262": "@BrooklynNets @JHarden13 Lamelo better",
    "1263": "James Harden is making his 10th #NBAAllStar apperance. Drafted as the 3rd overall pick in the 2009 NBA Draft out of Arizona State, Harden was named #KiaMVP for the 2017-18 season. This season, he's averaging 22.5 PPG, 8.0 RPG and 10.2 APG for the Brooklyn Nets. https://t.co/OAYpeEC0Vs",
    "1264": "Toronto has won 6 of their last 8 games to move to 27-23 on the season. \n\nThe Raptors are now just 1.5 games back from the 6-seeded Brooklyn Nets.",
    "1265": "@BrooklynNets @JHarden13 4️⃣ points",
    "1266": "RT JeriTsaiNets: The BrooklynNets YESNetwork &amp;amp; NBA introduces the new tech called The Netaverse. \n\n#Nets &amp;amp; Barclays is the first arena… #BrooklynNets",
    "1267": "@wojespn Another star player choosing to return against the @BrooklynNets 😆. What's new 🙄",
    "1268": "@BrooklynNets @JHarden13 Please.",
    "1269": "@BrooklynNets @JHarden13 Amazing....",
    "1270": "@HoodieBev @BrooklynNets @warriors @ATLHawks @Timberwolves @nuggets @DetroitPistons @PelicansNBA @memgrizz @Suns @MiamiHEAT @Bucks @trailblazers @SacramentoKings @cavs @celtics @nyknicks @dallasmavs @HoustonRockets @utahjazz @okcthunder @OrlandoMagic @Raptors Got too many bigs already 🤷‍♂️",
    "1271": "You hear that? @BrooklynNets @warriors @ATLHawks @Timberwolves @nuggets @DetroitPistons @PelicansNBA @memgrizz @Suns @MiamiHEAT @Bucks @trailblazers @SacramentoKings @cavs @celtics @nyknicks @dallasmavs @HoustonRockets @utahjazz @okcthunder @OrlandoMagic @Raptors https://t.co/4IEfx0C44M",
    "1272": "win-win trade imo @BrooklynNets https://t.co/eiNa8Di7Gm",
    "1273": "New podcast: https://t.co/nJhKoF8YXK Love the #kobebryant #allstargame MVP trophy. @brooklynnets 6th straight loss. #nhlallstarweekend in #vegas and skill competitions on the strip tomorrow is going to be exciting. @unc_basketball @DukeMBB #TRINITYRODMAN @NWSL $1M contract https://t.co/ZzXUgJ0uDs",
    "1274": "@BrooklynNets Well well... More one year without title..",
    "1275": "I need the Brooklyn nets to trade for serge ibaka, shooting and rim protection is what we need, and kd and harden go way back with serge",
    "1276": "@NBAAllStar @BrooklynNets @JHarden13 My goat 🥰",
    "1277": "@BrooklynNets @JHarden13 Plays like garbage this season and still gets nominated 🤦🏽‍♂️ Jarret Allen deserves it over him",
    "1278": "Some personal news: I’ve not come to this decision lightly, but after lengthy consideration and much consultation with loved ones, I’ve decided it’s time for a change. \n\nWhile the Brooklyn Nets will always have a place in my heart, I am now a full-time Phoenix Suns fan.",
    "1279": "@BullsGotNext U can't hate on james but before I kinda was having on him but him on the Brooklyn nets is beautiful.",
    "1280": "Jarrett Allen should know why he's being snubbed from the #NBAAllStar game\n\nIt's the same reason why he got dissed and then later dismissed by the @BrooklynNets https://t.co/TqRKJSEf4E",
    "1281": "@BurnerSpida @BrooklynNets @JHarden13 Harden owns the jazz https://t.co/vrwSLXT4D6",
    "1282": "@stephenasmith @nba @Lakers @BrooklynNets @SHAQ @ESPNNBA @NBAonTNT hey how about a trade straight up @JHarden13 for @russwest44",
    "1283": "@KY_PDX As a raptors fan but also Kenny Atkinson Brooklyn nets fan, seeing kris middletons name hurt. I’ve watched way more raptors games so I know how dominant siakam has been, but I rlly wish Allen made it he’s a hell of a player.",
    "1284": "Listen to \"Brooklyn Nets struggles | Latest NBA Trade Rumors | NBA All Star Reserves | Episode  #15 @SwooshHoopsPod \n\nhttps://t.co/JYwOTCbVmI",
    "1285": "@BrooklynNets @JHarden13 Maybe if I turn over the ball a billion times a game maybe I can make it to the reserve all-star team too!!!",
    "1286": "@ChefTrillie_ Imagine that while playing with KD and Harden 🤐 @BrooklynNets",
    "1287": "Brooklyn Nets Trade Deadline Preview with Mike Scotto https://t.co/LescIq4MTo",
    "1288": "Tonight is a good night for @BrooklynNets fans… We didn’t lose",
    "1289": "@Keith_McPherson The #BrooklynNets experiment is a failure. The results do not match \nthe high expectations. You cannot have a team with a P/T player and one who never plays a full season.",
    "1290": "Just a thought… If the #Raptors happen to play the Nets in the first round after the playoffs, Brooklyn would be without Kyrie Irving for the entire series.  \n\n #WeTheNorth",
    "1291": "@BrooklynNets @JHarden13 Better start making some roster moves or it might be his last All Star as a Brooklyn Net",
    "1292": "@NBAAllStar @BrooklynNets @JHarden13 LaMelo more deserving 😏",
    "1293": "@_HisAirness Nets don’t play defense, Kyrie only playing road games and harden don’t wanna be there no more😂. Plus joe Harris gotta get surgery again. A lot going on in Brooklyn right now lol",
    "1294": "Fatigue, hand strain some reasons for James Harden's Nets struggles (New York Post)\n\nSALT LAKE CITY - The Nets claim James Harden's dip in form was about fatigue, not injury.But...\n\nAdd your highlights:\nhttps://t.co/7GMlBB3Qzu\n #Brooklyn_Nets",
    "1295": "Fatigue, hand strain some reasons for James Harden’s Nets struggles #Brooklyn #Nets #NBA https://t.co/8F4JBKai5p",
    "1296": "Brooklyn Nets struggles | Latest NBA Trade Rumors | NBA All Star Reserves | Episode #15 https://t.co/4aZQQkHh46",
    "1297": "Brooklyn nets hopefully ya start picking up the pieces but just like the lakers for rn. Ya niggas stink 🤣",
    "1298": "News... @gameonfanapp $GET $GMETF Appoints Katrina Palanca to Board of Directors\n\n✅ Prior Corporate Partnership Experience with: @BrooklynNets @Twitch @TeamLiquid @Honda and @Verizon \n\n$GMETF $HIVE $HBLK\n\n#web3 #gamification #GamingSociety #Gaming\n\nhttps://t.co/EAxw1YGdIj https://t.co/UhzvyxVHEl",
    "1299": "The Motto for the Brooklyn Nets:\n“We Dread Home Games” https://t.co/t4VXsXqVoO",
    "1300": "Nets' Harris might need second surgery on ankle (https://t.co/qWWHLlWR34)\n\nAdrian WojnarowskiSenior NBA Insider Close Host of The Woj Pod Joined ESPN in 2017Adrian Woj...\n\nAdd your highlights:\nhttps://t.co/n1xsgI7Twp\n #Brooklyn_Nets",
    "1301": "📣 New Podcast! \"Que pasa con Brooklyn Nets?#NBA\" on @Spreaker #nba https://t.co/bJJOM0M3Ox",
    "1302": "@BrooklynNets You see how Atlanta is playing Phoenix? That’s how Nets should have played them",
    "1303": "@BrooklynNets Till he can't play the next game. You should of stood your ground",
    "1304": "@BrooklynNets @JHarden13 Wish he played like one",
    "1305": "@flasportsbuzz Still more games than the Brooklyn nets trio in 2 years",
    "1306": "Nets' Joe Harris may need another ankle surgery #Brooklyn #Nets #NBA https://t.co/VNxFb5cjYW",
    "1307": "Nets next two road games are at Utah and Denver. 0-2 written all over it.\n\nNets should just fly back to Brooklyn and get ready for the Celtics.",
    "1308": "Congratulations to clegainz (@clegainz) who moved up 1 spot to take #6 on the Brooklyn Nets team leaderboard.\n\nhttps://t.co/8yzss9CSSP",
    "1309": "@haileyaleah2 @BrooklynNets @Giants Yessir",
    "1310": "@haileyaleah2 But if the @BrooklynNets or @Giants would fb that would be amazing",
    "1311": "@BrooklynNets @JHarden13 I don't know why anyone would like watching Harden just shot three pointers and free throws🤔",
    "1312": "@BKBN1979 @BrooklynNets Omalley is the best of the best. That's why he went for a 2nd &amp; 3rd opinions. Could it be posturing too cuz he doesn't want to be traded?",
    "1313": "@JalenRose could Brooklyn Nets Be dropping games on purpose to better position themself for playoffs with “Kyrie” in mind. If your lower seed that means not home court. 4 games with Kyrie vs 3 games without him. Better chance to win that way, they don’t fear any team in the East",
    "1314": "@BrooklynNets Not that successful",
    "1315": "@AllymissLove @BrooklynNets @YESNetwork Ally, I took your 30 min “Feel Good” class &amp; ummm it did not feel good 😜",
    "1316": "@Irtyu1 @BrooklynNets Tbf, Harden did deserve the MVP that year imo. Bron was phenomenal but Harden was terrific too and led his team to more wins. Nash benefited from D’Antoni’s system tremendously. He never averaged 10 assists until he got with Amar’e and Marion despite having Dirk all those years",
    "1317": "Good time to remind everyone. The Brooklyn Nets this season (per game):\n\nWith Joe Harris: 13/35 39% from three\nWithout Joe Harris: 10/30 33% from three",
    "1318": "N633JB, Brooklyn Nets special livery, Airbus A320-232 operating as JetBlue B6189 landing KSAN runway 27 on 2 February 2022. #avgeek #planespotting https://t.co/TkY8jYTBJs"
}