{
    "0": "🔴 San Antonio Spurs Vs Orlando Magic🏀 | Live Reaction &amp; Play-By-Play 🔴 https://t.co/NxCmSIwumt via @YouTube",
    "1": "San Antonio Spurs (-3.5) visit Orlando Magic tonight 🏀\n\nThe Magic are 0-3 ATS at home this year. \n\nWill the Spurs cover tonight ⁉️\n\nFind All NBA Odds Here ⬇️\nhttps://t.co/LMjKLA7b2J",
    "2": "The Magic host the Spurs in a rematch of the season opener for both. Can Orlando gain revenge and earn its first home win by taking down favored San Antonio. This was my opinion on the NBA Tip-Off Show at @WagerTalk \n#PorVida #MagicTogether https://t.co/cdS6JnxupR",
    "3": "Another play 🚨 this is a ONE unit play. San Antonio Spurs -3. Let’s get this money. https://t.co/A640j6JiS8",
    "4": "#NBA #NBATwitter Today's Lineups\n\n#PorVida\nSan Antonio Spurs Starting 5:\nDejounte Murray\nDerrick White\nDoug McDermott\nKeldon Johnson\nDrew Eubanks\n\n#MagicTogether \nOrlando Magic Starting 5:\nCole Anthony\nJalen Suggs\nFranz Wagner\nWendell Carter Jr\nMo Bamba",
    "5": "San Antonio Spurs (-3.5) @ Orlando Magic! #MagicTogether #PorVida #NBA #NBATwitter #NBA75",
    "6": "23:30 ESPN 2 – Portland Trail Blazers vs Los Angeles Lakers\nDomingo 7\n21:00 NBA TV – Oklahoma City Thunder (Deck) vs San Antonio Spurs \nLunes 8\n21:00 DirecTV – Philadelphia 76ers vs New York Knicks",
    "7": "San Antonio Spurs Starters:\n\nDejounte Murray\nDerrick White\nDoug McDermott\nKeldon Johnson\nDrew Eubanks\n\nPlayers out:\nZach Collins\nJakob Poeltl\n#PorVida #NBA #NBATwitter #NBA75",
    "8": "Tonight's starting lineup for the San Antonio Spurs: Murray, White, Johnson, McDermott, Eubanks https://t.co/bVWH4Av1bs",
    "9": "Spurs, Manu Ginobili visit S.A. Food Bank to learn more about San Antonio https://t.co/aazKSHeh1j #nba75 #porvida #nbatwitter @safoodbank",
    "10": "\"On top of having a lot of green space, the campus is expected to have the largest dog park in all of Bexar County.\"\n\nI am sold. \n\nKSAT San Antonio: Future San Antonio Spurs campus on the Northwest Side has environmentally-friendly goals.\nhttps://t.co/hwWXmWN2hH\n\nvia @GoogleNews",
    "11": "The bench for Orlando in the season opener vs the Spurs had the following +/-\n-32\n-30\n-22\n-19\n-11\n\nNot having extreme negatives across the bench will make tonight's rematch between Orlando &amp; San Antonio much more interesting, as well as likely having Cole &amp; Suggs being better",
    "12": "San Antonio Spurs 1999 Championship cap concept.  Have a great weekend everyone https://t.co/hsB1Y7tb7n",
    "13": "#TimDuncan #SanAntonioSpurs #TradingCards #UpperDeck 2000-01 UD Black Diamond Tim Duncan Gold Parallel 308/500 San Antonio Spurs NMMT https://t.co/HUm2oCMepj @eBay",
    "14": "#NBA \n#GamblingTwitter \nSan Antonio Spurs @ Orlando Magic \nSpurs are 5-1 ATS in their last 6 games as a favorite.\nMagic are 7-18-1 ATS in their last 26 games overall.\nSpurs are 5-1 ATS in the last 6 meetings.\nOver is 6-1 in the last 7 meetings.",
    "15": "@TheHoopCentral This man was having games and performances like this all the time during his time in San Antonio. I rarely ever saw posts like this, even when the spurs were the 4 seed in the West at one point.",
    "16": "San Antonio Spurs: Orlando Magic vs. San Antonio Spurs:  (Nov. 5, 2021): 3 Things To Watch, Odds and Prediction https://t.co/iMJkXQrx9S",
    "17": "Spurs, Manu Ginobili visit S.A. Food Bank to learn more about San Antonio https://t.co/aazKSHvRSR #nba75 #porvida #nbatwitter @safoodbank",
    "18": "@kofoworola__a @oka4or @oreoluwa_exx Come to San Antonio spurs .. well welcome you properly",
    "19": "Orlando Magic Predictions and Preview for 11/5/2021 hosts San Antonio Spurs.  Looking for betting action?  Find out if there is any value in our preview. #Punters #NBATwitter https://t.co/O7ptonclLN",
    "20": "San Antonio Spurs 💕\nIf you like it pls support with ❤\n\n#Sanantoniospurs https://t.co/wJmCUzxmpM",
    "21": "So San Antonio! LOL\n\n@spurs https://t.co/uOv5mvm0ul",
    "22": "@GioLamour Lmao I love how you supply an Orlando game with more attendance than the Dallas game and then act like you said something. Truly amazing. Perhaps instead of shitting in San Antonio fans, you should worry about your Nets, and why they are pulling less fans than Spurs games? 🤷🏻‍♂️ https://t.co/E7nUG6Fi2b",
    "23": "Future San Antonio Spurs campus on the Northwest Side has environmentally-friendly goals\nhttps://t.co/8AGuXkLAKy",
    "24": "San Antonio Spurs -3.5\nTwolves/Clippers Over 215 \nPacers/Trail Blazers Over 223.5\n\nFor my beloved twitter followers here you have my full NBA slate (I might add something to the premium group) for now. Thats my gift. Good luck and don't forget to play responsibly as always🏀🙏🔥",
    "25": "For @MavericksSI, I wrote about Jalen Brunson's recent play as a starter over the last two games — averaging 28.0 points, 8.5 rebounds, and 3.0 assists.\n\nHe scored 12 of his 31 points in the final 4:09 of the 109-108 win over the San Antonio Spurs. https://t.co/cyJ5btFEAS",
    "26": "Orlando Magic vs San Antonio Spurs NBA Picks, Odds, Predictions 11/5/21 https://t.co/rvLilPPkC7",
    "27": "Brooklyn Nets\nSan Antonio Spurs\nMemphis Grizzlies\nNew York Knicks\nToronto Raptors\nLos Angeles Clippers\nGolden State Warriors\nIndiana Pacers\nCharlotte Hornets\n\nokay bro.... den er 13/18 de sidste to dage men......................... det ser wonky ud........... alle er underdogs",
    "28": "Kings –Hornets. Bet: Sacramento to win odds 1,77 2 units. \nTimberwolves –Clippers. Bet: Clippers to win at odds 1,72 \nOrlando – San Antonio Spurs. Bet: San Antonio Spurs to win at odds 1,63 \nBucks –Knicks. Bet: Milwaukee to win at odds 1,6 \nAll Kambi",
    "29": "Kings –Hornets. Bet: Sacramento to win odds 1,77\n2 units. \n Timberwolves –Clippers. Bet: Clippers to win at odds  Orlando – San Antonio Spurs. Bet: San Antonio Spurs to win at odds 1,63 \nMilwaukee Bucks – New York Knicks. Bet: Milwaukee to win at odds 1,6  at Kambi",
    "30": "Premium Bet\nMatch: Orlando Magic – San Antonio Spurs. Bet: San Antonio Spurs to win at odds 1,63 at Leo Vegas.\nIt is different times for the Spurs, but the young team still has some options. It should be enough to beat Orlando tonight.",
    "31": "Spurs and AT&amp;T Center to showcase local restaurants, expand culinary lineup: Fans will notice other food and beverage changes and upgrades inside the East San Antonio arena. &gt;&gt; https://t.co/bQFkVtCSgD",
    "32": "ICYMI: Check out the newest NBA Future Watch from @TheFDHLounge featuring Joshua Primo, San Antonio Spurs #TheHobby https://t.co/5fZL1jLskz",
    "33": "New AT&amp;T Center food and drink options make space for minority-owned San Antonio restaurants. \n\nYou can get gumbo, stir fry, a smoked mezcal old fashion and more at Spurs games and events. \n\nYour guide to upping your game time experience: https://t.co/ct5rWyZ7mh @mySA #PorVida https://t.co/E9ld5x8Usk",
    "34": "San Antonio Spurs: The young Spurs are still learning how to finish close contests https://t.co/ojbzdzYGzA",
    "35": "San Antonio Spurs vs Orlando Magic 2021-22 NBA Season Preview, Predictions and Picks | SportsNus https://t.co/J7ij1EqiFe",
    "36": "The San Antonio Spurs (2-6) will visit the Orlando Magic (2-7) tonight as the team will look to shake off a terrible loss versus the Mavericks. \n\nSan Antonio is 1-0 against Orlando this season. https://t.co/7isb9fWLTD",
    "37": "San Antonio Spurs vs Orlando Magic 11/5/2021 Picks Predictions Previews\n\nhttps://t.co/c9j5ERR8Zg\n\n#sportspicks #NBA #NBApicks #NBAprediction #NBAparlay #NBAbetting #expertpicks #sportsbetting #basketballpicks #odds #picks #freepick #freepicks #handicapper #Spurs #Magic https://t.co/oBJx3n9k0Y",
    "38": "Yooo Spurs fans, check out the latest episode of Alamo City Limits! Noah and I discuss all things Spurs hoops from Lonnie Walker’s play on the court to San Antonio’s Fiesta jerseys off the court. Hope you all enjoy it! \n\n#PorVida #GoSpursGo https://t.co/isE1jXts67",
    "39": "@valem1962 @spurs @DejounteMurray It will be a magical moment for you (no pun intended). Im excited for you - I hope you have the time of your life! Rooting for the Spurs while they're on the road is so fun. Your next game, go see them in San Antonio &amp; experience the city. It's better than you can imagine.",
    "40": "Orlando Magic was already dismantled by San Antonio once this year and now they even got more injuries in their squad.\n\n#BMRPicks: Spurs ML -170\n\nChoose a trusted sportsbook here 👉 https://t.co/6REkYKnFY4\n\n#PorVida #Magic #NBA75 https://t.co/JtwcnYF6z8",
    "41": "Let's see how we matchup against the San Antonio Spurs Tonight.\n\n#PorVida\nvs\n#MagicTogether \n\n#OrlandoMagic #MagicTogether  #WeGotAlotPopping #MagicSzn2021\nWE💥G O T💥ALOT💥P O P P I N G https://t.co/5nQbqosqD6",
    "42": "The one and only @DABartonek once again stopped by to talk San Antonio Spurs basketball with us!\n\nTune in as we discuss their struggles closing games, early rotations, and the loss of Jakob Poeltl! https://t.co/e2qzggI6vA",
    "43": "Consensus Line Move:\n2021-11-05 San Antonio Spurs at Orlando Magic from 212.00 to 213.00\nOver who's in\n#NBA #bettingpicks #tech #stocks",
    "44": "Braxton Key returns to the Delaware Blue Coats (76ers affiliate).  Key played with Delaware in the short G league season earlier in 2021.  They start tomorrow.\n\nJoshua Primo has been assigned by San Antonio to the Austin Spurs, and will be part of its opening roster.",
    "45": "San Antonio Spurs: The Spurs’ depth is largely theoretical so far https://t.co/Rf9EPgnE5U",
    "46": "Save on 2021-22 San Antonio Spurs Basketball #Tickets for Center Court, https://t.co/CLhlvwvEyH #cheaptickets #buytickets #ticketsonsale",
    "47": "Today's NBA Picks: 7:10 PM ET - San Antonio Spurs vs. Orlando Magic - 1 PICK AVAILABLE: https://t.co/qLBEgUJYV6 #nba",
    "48": "Game Preview: San Antonio Spurs at Orlando Magic https://t.co/PwXWDMa7Ap",
    "49": "Game Preview: San Antonio Spurs at Orlando Magic https://t.co/K7VxIJvJEb",
    "50": "NBA ML. Date: 11-05\nSan Antonio Spurs vs Orlando Magic. 0.32%\nFanDuel. Spurs @ -148\nDraftKings. Magic @ +150\n#arbitrage #bettingtwitter #bettingpicks #sportsbets #freepicks #freemoney #mlb",
    "51": "NBA Day 1️⃣8️⃣ 🏀🏀🏀\nBrooklyn Nets vs Detroit Pistons\nSan Antonio Spurs vs Orlando Magic\nMemphis Grizzlies vs Washington Wizards\nNew York Knicks vs Milwaukee Bucks Cleveland Cavaliers vs Toronto Raptors\nLos Angeles Clippers vs Minnesota Twolves",
    "52": "[NBA] San Antonio Spurs Hightlights vs. Los Angeles Lakers Jan 12 2010 https://t.co/i0md5uX7Qp",
    "53": "Newly added bets:\n\n⚽️St Patricks @ 2.30\n⚽️Falkirk @ 2.00\n⚽️New York City FC @ 1.8\n⚽️Dumbarton @ 2.38\n⚽️Chivas @ 2.55\n⚽️Colorado Rapids @ 2.26\n\n🏀San Antonio Spurs -4 @ 1.97",
    "54": "Thunder Win! Thunder Win!! Thunder Win!!! For the second time in 8 days, the Thunder has come back to beat the Lebron-less Lakers... This team using a 35-24 4th quarter to win 107-104 at STAPLES Center. Thunder host the San Antonio Spurs at Paycom Center on Sunday at 6 pm CT..",
    "55": "Spurs guard Dejounte Murray is looking like the superstar San Antonio needs as he leads the way for the franchise 💪🏿\n\nhttps://t.co/VmQ7j9m3Tz",
    "56": "San Antonio Spurs vs Los Angeles Lakers | November 25 2019 https://t.co/uVqlk8LVuF",
    "57": "What's #Best today on https://t.co/DVTf2jd2ZR ?\nHeb X San Antonio Spurs' 2021-22 Team Line-up Hype Video\nhttps://t.co/6eg9rDVjZ6\n#sports https://t.co/XFXC2X2AIk",
    "58": "#Best of the day on https://t.co/MqmlMsmdvk\nHeb X San Antonio Spurs' 2021-22 Team Line-up Hype Video\nhttps://t.co/F2m1C0WAgB\n#sports",
    "59": "Los Angeles Lakers Vs. San Antonio Spurs Live Play By Play &amp; Reaction https://t.co/6rFxVigsJe",
    "60": "#NBA 🏀\n\n  • San Antonio Spurs -3.5 (-115)\n\nRisk: 0.6u\nWin: 0.52u\n\n🍀🍀🍀\n\n#GamblingTwitter https://t.co/YuaKLJvzZx",
    "61": "Analyzing Friday’s San Antonio Spurs at Orlando Magic odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/UO6OZtkwBr",
    "62": "I know it's still early, but what exactly are the San Antonio Spurs going after with this roster? #NBA",
    "63": "Man @ChicanoBatman just put on the best party in San Antonio. Also shoutout to whoever yelled puro pinche Spurs during the like 5 seconds it was quiet I love this city lol",
    "64": "Spurs and AT&amp;T Center to showcase local restaurants, expand culinary lineup - San Antonio Business Journal https://t.co/lGinVmcVdH",
    "65": "@quesarahsarah__ I once told Matt Bonner how much I hated the Spurs while we were watching a Thunder game before a Deer Tick show in San Antonio",
    "66": "@RealSkipBayless Shouldn't you be worrying about your San Antonio Spurs?",
    "67": "What's #Best today on https://t.co/DVTf2jd2ZR ?\nHighlights: Devin Vassell's 21 Pts 3 Reb 1 Ast Vs. Dallas : 2021-22 San Antonio Spurs Season\nhttps://t.co/GM5nMPHC15\n#sports https://t.co/kwugo1C1fh",
    "68": "#Best of the day on https://t.co/MqmlMsmdvk\nHighlights: Devin Vassell's 21 Pts 3 Reb 1 Ast Vs. Dallas : 2021-22 San Antonio Spurs Season\nhttps://t.co/UYBDZGyAFv\n#sports",
    "69": "Hey @Mayor_Nirenberg don’t the Spurs owe San Antonio $5 million for the failed Msl bid? Asking for a friend.",
    "70": "The #Heat have a player named Duncan Robinson. That man was destined to play for the #Spurs. #nba #miami #sanantonio @MiamiHEAT @spurs #timduncan #davidrobinson",
    "71": "1) I cannot help but notice the San Antonio spurs are in town for a marquee matchup against the Orlando magic tomorrow night. I will not support anything this far liberal, white guilt all star team member and white apologist Greg Poppovich does. “Pop” is a pinko liberal with his https://t.co/xiULoUxTe8",
    "72": "Josh Primo will be playing with the Austin Spurs tomorrow against the Rio Grande Valley Vipers. You can watch the game on the NBA G League website at 7:30pm.\n\nThe San Antonio Spurs will also be playing against the Magic at 6pm on Friday.",
    "73": "Check it out! NBA Future Watch: Joshua Primo Basketball Cards, San Antonio Spurs #TheHobby https://t.co/5fZL1jLskz https://t.co/Fen1Ea2AZo",
    "74": "If this happened, the San Antonio Spurs would have nothing on this: https://t.co/1QKG8PtHO8",
    "75": "Also coming soon.\n\nAfter four seasons as Manchester United head coach, Gregg Popovich returns to the NBA and the San Antonio Spurs in a bid to become the most winning-est coach in the NBA. Kicking off the season against the Orlando Magic.\n\nMusic provided by @NCSounds https://t.co/SZssWoDpSP",
    "76": "#NBA🏀 (Temporada Regular) - Encerrados:\n\nBrooklyn Nets 117 x 108 Atlanta Hawks\nMemphis Grizzlies 108 x 106 Denver Nuggets\nMinnesota Timberwolves 115 x 126 Los Angeles Clippers\nSan Antonio Spurs 108 x 109 Dallas Mavericks",
    "77": "Jalen Brunson (31 points) Highlights vs. San Antonio Spurs - Dallas Mavericks\nhttps://t.co/TjsEUGG68A"
}