{
    "0": "@PeakMelo @hornets @LAClippers @HornetsOnBally @wfnz Football",
    "1": "Check out the hat! \n\nThe @hornets and @realdellcurry being represented well tonight in the Staples Center! \n\n#AllFly https://t.co/Y5SWWfAkgL",
    "2": "@hornets @LAClippers @HornetsOnBally @wfnz Time to Ball?",
    "3": "Team is looking ready in warmups. Hoping for some solid defense to own the game. #Hornets #AllFly #charlotte #NBA https://t.co/vD1hKKmG0E",
    "4": "@hornets @LAClippers @HornetsOnBally @wfnz Can’t grab mine until you guys send me one 😉",
    "5": "Very special to be back in Staples Center, lot of great memories. Thankful to catch up with some wonderful friends.\nNow it’s time to make some new memories!\n@hornets ready to tip off against the Clippers at 9 eastern on @wfnz the Hornets Mobile App and the Hornets Radio Network! https://t.co/zMywpwCUH6",
    "6": "Los Angeles Clippers - Charlotte Hornets, over 224.5 2.0 57% 3u #Sukkelat",
    "7": "\"We've gotta respond tonight.\"\n\n@hornets Head Coach James Borrego talks with Eric Collins about the defensive side of the ball and his team needing to bounce back tonight against the Clippers. \n\n#AllFly https://t.co/aclc4BpVxi",
    "8": "Hey @hornets , I want my “Team Borrego” shirt. https://t.co/nTe0edZkH6",
    "9": "@hornets @LAClippers @HornetsOnBally @wfnz Be dissapointed in Mason Plumlee or watch Snf https://t.co/FgstkO4rKJ",
    "10": "@NBABrasil @hornets @LAClippers @BandTV @Gaules @TNTSportsBR Clippers",
    "11": "@hornets @LAClippers @HornetsOnBally @wfnz Common W",
    "12": "Grab your jerseys - it's almost GAME TIME! 🕺\n\n📍 - Los Angeles, CA\n🆚 - @LAClippers \n⏰ - 9PM EST\n📺 - @HornetsOnBally \n📻 - @WFNZ 610 AM/102.5 FM https://t.co/UiK1X2Q3SF",
    "13": "@hornets @CrumblCookies get plumlee out of the starting 5",
    "14": "NBA\n\nCharlotte Hornets +7 $1.80",
    "15": "@hornets @GEICO 💯% Agree. JB is a solid coach and it is clear he has a plan. It’s a young team that got diluted after the drafts, but you can see that it keeps growing. \nNot bad at all, especially for a small franchise compared to most of the NBA.",
    "16": "Let’s go @hornets!!!!!! https://t.co/jV2RJQSwr9",
    "17": "#NBA #NBATwitter Today's Lineups\n\n#AllFly \nCharlotte Hornets Starting 5:\nLaMelo Ball\nTerry Rozier\nGordon Hayward\nMiles Bridges\nMason Plumlee\n\n#ClipperNation\nLos Angeles Clippers Starting 5:\nReggie Jackson\nEric Bledsoe\nPaul George\nNicolas Batum\nIvica Zubac",
    "18": "@sugamama316 @hornets @NovantHealth Who else would they start? PJ is out too...",
    "19": "@mad_ant @maliikawalker @hornets I hear you and the fans are already speaking. Go look under all the social media posts here, IG, Facebook, etc. It’s bad.",
    "20": "Silver lining of the Mason Plumlee deal for the #Hornets - the trade netted Charlotte the pick that they used for JT Thor, who has been excellent in Greensboro so far https://t.co/8NYcviCUkl",
    "21": "@hornets @CrumblCookies Trade Plumlee for capela",
    "22": "@hornets @CrumblCookies Buzz Lightyear is starting wtf",
    "23": "Today's NBA Picks: 9:10 PM ET - Charlotte Hornets vs. Los Angeles Clippers - 25 PICKS AVAILABLE: https://t.co/fOAfM3X0UP #nba",
    "24": "HORNETS BASKETBALL !!!!!!!!!!!!! @HornetsOnBally @hornets #AllFly",
    "25": "\"He's gotta get going offensively. He knows that and the team knows that.\"\n\n@ashahahmadi and @realdellcurry discuss Terry Rozier getting back up to speed after the early season injury.\n\n#AllFly | @hornets https://t.co/ADGneICvE3",
    "26": "🏀 The Clippers will look to make it four straight wins when they welcome LaMelo Ball &amp; the Charlotte Hornets to town\n\nLine: 6.0\nTotal: 223.5 points\n\nCan the road team steal a win in LA?\n\nCheck out all our NBA markets here 👉https://t.co/PDBO6Rs5cq\n\nGamble Responsibly. 18+",
    "27": "@hornets @CrumblCookies Sit plumlee",
    "28": "@jtorr79 @hornets @CrumblCookies No he’s playing opponents with agressive bigs now.",
    "29": "@maliikawalker @Eternity9 @hornets When those losees start piling up and the fans speak out he will change his mind. Trust him.",
    "30": "Sunday Funday continues! Back to back games at the Staples Center. Hoping for some better results. Who’s gonna be up all game watching? #AllFly #Hornets #NBA #charlotte https://t.co/h8RLSFRwyd",
    "31": "@hornets @CrumblCookies Sum times I just feel like this coaches blind ass hell 💀🤦🏽‍♂️",
    "32": "@hornets @GEICO If Borrego focused on himself and how he could get better, the team would follow suit",
    "33": "Match: Los Angeles Clippers - Charlotte Hornets\n\nBet slip link: https://t.co/J1dMNbvu6z\n\n#LosAngelesClippers #CharlotteHornets #chiliz #chz #slotmachine https://t.co/SHE1b8djxv",
    "34": "@HornetsOnBally @hornets @LAClippers @ashahahmadi @realdellcurry Need a win badly tonight",
    "35": "The road trip continues! \n\n@hornets in L.A. to take on the @LAClippers! \n\nGet your night started with @ashahahmadi and @realdellcurry on Hornets LIVE! Only on @HornetsOnBally! \n\n#AllFly https://t.co/d0cqCo0l56",
    "36": "According to basketball reference the Charlotte Hornets allow the 2nd highest FG% at the rim (0-3 feet away.) Today would be a good game for Eric Bledsoe and TMann to be in attack mode.",
    "37": "@svwhit @Confuciusss551 @hornets @CrumblCookies They had him listed as questionable, so we were hoping he wasn’t playing lol",
    "38": "Los Angeles Clippers (-6) vs. Charlotte Hornets! #AllFly #ClipperNation #NBA #NBATwitter #NBA75",
    "39": "Tonight’s starting lineup for the Charlotte Hornets: Ball, Rozier, Hayward, Bridges, Plumlee https://t.co/VCt3Hehgea",
    "40": "How come there's no Charlotte-Rice highlights? I was looking for highlights and all I could find was the marching band highlights, highlights from when we played Rice in like 2015 or 2016, and Charlotte Hornets highlights.",
    "41": "Los Angeles Clippers to beat Charlotte Hornets @1.40",
    "42": "@Confuciusss551 @sugamama316 @hornets @CrumblCookies What did he do?",
    "43": "@hornets @CrumblCookies Look, y’all, you may not like mason, but because we took on his contract, we were able to draft Thor. Paciencia y fe",
    "44": "Los Angeles Clippers to beat Charlotte Hornets @1.40",
    "45": "This is me every time the @hornets are on! #AllFly \n\nhttps://t.co/pGCQQKLcYz",
    "46": "@sugamama316 @hornets @CrumblCookies Plumlee didn’t do anything at Duke &amp; he doesn’t make the Hornets a better team! https://t.co/L4YamYblsn",
    "47": "Charlotte Hornets Starters:\n\nLaMelo Ball\nTerry Rozier\nGordon Hayward\nMiles Bridges\nMason Plumlee\n\nPlayers out:\nP.J. Washington\n#AllFly #NBA #NBATwitter #NBA75 #DCAboveAll #NBA #NBATwitter #NBA75",
    "48": "@hornets @CrumblCookies NOT PLUMDOG",
    "49": "@hornets @CrumblCookies at guantanamo bay they make you watch mason plumlee play ball",
    "50": "@toinebaby @hornets @GEICO Exactly",
    "51": "@hornets @CrumblCookies WHY BUMLEE",
    "52": "@ebiscits @hornets @CrumblCookies 1st minute 😂😭😭😂",
    "53": "@ashtonfoxemoji @hornets @CrumblCookies yeah we done for",
    "54": "@hornets @CrumblCookies At what point do y’all think we’ll be down by 20???",
    "55": "@HornetsPR @hornets Oh boy...",
    "56": "@AndyFromCLT @hornets @CrumblCookies serge back too sheesh",
    "57": "@hornets @CrumblCookies say sike right now https://t.co/by6UHcpgpa",
    "58": "@hornets @CrumblCookies lil moser",
    "59": "INJURY UPDATE: @hornets center Mason Plumlee (L Rib Contusion) was questionable and has been upgraded and will be available to play vs LAC #AllFly",
    "60": "@ashtonfoxemoji @hornets @CrumblCookies he gets cooked every damn game",
    "61": "@hornets @CrumblCookies Oh lord. Plumlee is a no. Terry needs to get it together this week or I have serious concerns.",
    "62": "@AndyFromCLT @hornets @CrumblCookies oh my god hes gonna get cooked",
    "63": "@hornets @CrumblCookies Anyone else mad when they saw Plumlee’s face 🤦🏻‍♀️🤦🏻‍♀️🤦🏻‍♀️",
    "64": "@hornets @CrumblCookies NOO NOT PLUM",
    "65": "@hornets @CrumblCookies Welp https://t.co/PoURzqr9zJ",
    "66": "@hornets @CrumblCookies Noo bumlee",
    "67": "@hornets @CrumblCookies NOOOOOO WHY IS PLUMLEE STARTING",
    "68": "Tonight's Starting Five 👇 \n\n#AllFly | @CrumblCookies https://t.co/rWF7o5v4Xg",
    "69": "Keep Miles Bridges in #BuzzCity #AllFly #Jumpman23 #NBA #Hornets #Charlotte https://t.co/zPyhOAEDGl",
    "70": "@hornets @NovantHealth Clippers got ibaka back today🤦🏾‍♂️",
    "71": "Charlotte Hornets Vs Los Angeles Clippers LaMelo Ball Vs Pg13 watch live!!! https://t.co/YzXl0OI2ri via @YouTube",
    "72": "@A_MH94 @hornets @GEICO Oh gosh yes, embarrassing. We gotta fix that and stop getting behind by 15 points in the first quarter.",
    "73": "@hornets @NovantHealth Maybe Kai Jones can get some playing time now...",
    "74": "Let’s go @hornets https://t.co/kSb4cst0tl",
    "75": "@toinebaby @hornets @GEICO Hell yeah our defense versus the Kings was atrocious",
    "76": "@hornets @NovantHealth That injury looked really bad honestly he should rest for the whole season.",
    "77": "Charlotte Hornets Vs Los Angeles Clippers LaMelo Ball Vs Pg13 watch live!!! https://t.co/Ux2liNIaB4 via @YouTube we live f with us it’s the #lithouse https://t.co/Dh0llJCyIA",
    "78": "@AshNicoleMoss These aren't your same old Cavs. They've beaten the Hawks, Nuggets in Denver, Clippers in LA, Hornets in Charlotte, Portland, and Raptors in Toronto. The problem with you is you think the Knicks are better than they actually are. Knicks defense has been poor this season.",
    "79": "@A_MH94 @hornets @GEICO Man do we. That Heat game broke us.",
    "80": "@hornets @NovantHealth Keep Plumlee out!",
    "81": "@ryansnuggs @BoredApeYC @MELOD1P @LAClippers @hornets Utility!",
    "82": "@hornets @NovantHealth Please no plumdog",
    "83": "@hornets @NovantHealth Where’s plumlee stay at? Just asking for a friend 😈",
    "84": "@hornets @NovantHealth 🙏🏽don’t play plumlee",
    "85": "@hornets @NovantHealth DONT PUT PLUMLEE",
    "86": "@hornets @GEICO @toinebaby we need this one tonight",
    "87": "@hornets @NovantHealth PLEASE don’t play Mason Plumlee",
    "88": "INJURY UPDATE vs LAC\n\nMason Plumlee (L Rib Contusion) is questionable. \nPJ Washington (L Elbow Hyperextension) is out.\n\n#AllFly | @NovantHealth https://t.co/m3BRwFFM5e",
    "89": "@JerichoSpriley @hornets @GEICO Can try richards. The center position is so poor",
    "90": "@cv171210 @TheStrickland These aren't your same old Cavs dude. They've beaten the Hawks, Nuggets in Denver, Clippers in LA, Hornets in Charlotte, Portland, and Raptors in Toronto. The problem with you is you think the Knicks are better than they actually are.",
    "91": "@imchasey123 @Famguy52 @hornets Please do😩",
    "92": "@AFCPasha @hornets You tricked me",
    "93": "@AlexLARams I agree. The @Titans should give the Oilers name to the @HoustonTexans (just like what happened with the @hornets).",
    "94": "@bigyacster @hornets @GEICO He'll be a COTY candidate. You clowns that have followed the Hornets for a year are so funny.",
    "95": "I’M SEEING MY FAVORITE TEAM AT STAPLES CENTER TONIGHT 💙💜 LETS GO HORNETS @hornets",
    "96": "To all the amazing talent who performed at Hornets Music Industry Night and the Afterparty………THANK YOU! This mixtape drops Friday, Nov. 12th exclusively on @LiveMixtapes! @ Charlotte, North Carolina https://t.co/1NTqwOZuOL",
    "97": "@HornetsOnBally ILL BE AT TODAYS GAME HERE IN LA!!! Section 301 ROW 13 SEATS 23&amp;24! WOOOO! @hornets",
    "98": "@Jaerii45 @hornets @GEICO Whose a good pivot for plumlee?",
    "99": "the warriors play the hornets in charlotte next week and i wanna go so bad ☹️",
    "100": "@hornets @GEICO Don't play plumlee",
    "101": "@bigyacster @hornets @GEICO Him and mitch need to go",
    "102": "@hornets just win is all I ask tonight",
    "103": "@Eternity9 @hornets These two games are very winnable if the coach is serious",
    "104": "…and it would be nice if the @Hornets win. #allfly https://t.co/CHNjttNRf2",
    "105": "@HappySpursFan @DejounteMurray notice how none of these players are charlotte hornets",
    "106": "It is mighty chivalrous of the Charlotte @Hornets to spot every team they play 20 points before the Hornets start playing, but it may be time to show a little less hospitality and play even from here on out.",
    "107": "@SenorPompo @hornets @GEICO Hater 😒",
    "108": "@maliikawalker @hornets All good. One love!",
    "109": "@maliikawalker @hornets For the record, I like Mitch and feel he’s done well minus getting a starting Center and for the record, MJ wanted LaMelo, not Mitch. So we have MJ to thank for where the team can potentially be.",
    "110": "@Eternity9 @hornets Ok we will forever disagree here.  #AllFly..  One love….",
    "111": "@maliikawalker @hornets Means nothing. Mitch can be fired too like Cho was. He better get a center quick! MJ ain’t trying to loose this money he’s getting from LaMelo’s presence. If this team doesn’t produce this year, it’s a failure. Front office and the players already said that. Look it up.",
    "112": "boy do I love the charlotte hornets as my only true team I follow in the vast world of sports",
    "113": "Just booked tickets to my first ever Hornets game … LFG!! 🔥🔥 #AllFly \n\n12/27 Hornets vs Rockets\n\n@hornets @MilesBridges @T_Rozzay3 @gordonhayward @KELLYOUBREJR @MELOD1P @masonplumlee @PJWashington https://t.co/YoEyvyEtU8",
    "114": "@Eternity9 @hornets Kupchak believes in Borrego..",
    "115": "@maliikawalker @hornets Okay. Players over coaches all day everyday. No one is coming to see Borrego.",
    "116": "@lameloverse @MELOD1P @hornets @LAClippers You know when I don't root for @trailblazers I root for my boy @MELOD1P! I will see you in there! @hornets https://t.co/bggGXlObTz",
    "117": "@Eternity9 @hornets I doubt it but we disagree on Borrego…",
    "118": "@maliikawalker @hornets Don’t mean a thing. He can be fired and will be. ⏳",
    "119": "@Eternity9 @hornets He literally just signed an extension.  He’s not going anywhere….",
    "120": "@hornets @GEICO It’s a long season.  82 games..  agree 100% with this quote!  Let’s go Hornets!",
    "121": "@SexIandCAVS The clippers will beat the Charlotte Hornets Tonight.",
    "122": "@hornets You as a coach need to get it together or leave. It ain’t the players, it’s your incompetent coaching.",
    "123": "@MilesBridges @espn @hornets @nba this what yall represent?",
    "124": "Charlotte Hornets @ LA Clippers \n\nCharlotte Hornets Player Points Projections \n\nhttps://t.co/4MKd2jDEDC",
    "125": "@hornets @GEICO Trade for Marvin Bagley problems solve..",
    "126": "RARE Vintage Starter Charlotte Hornets Zip Pullover Waffle Knit Sweat Shirt 90s https://t.co/cQmRsUiaZd eBay https://t.co/hHiFZQnIVo",
    "127": "IT'S GAME TIME!!! .. I Love Me Some @MELOD1P Ball But NOT During these 48 Minutes!!! @LAClippers vs @Hornets at 6pm Live on @BallySportWest!!! #LETSGO #FANTRUTH #CLIPPERDARRELLCARES #FROMAFANSPOINTOFVIEW https://t.co/42RVXkIghy",
    "128": "@ryansnuggs @BoredApeYC @MELOD1P @LAClippers @hornets Love this! 🍻\n\nHave a great time",
    "129": "@hornets @GEICO James “resiliency” borrego",
    "130": "ANYBODY ELSE FIRED UP FOR SOME @hornets BASKETBALL TONIGHT!? Back-to-back nights for a hornets staples center takeover! LETS GO BOYS!",
    "131": "@hornets @GEICO Facts! Let’s get a dub tonight 💯🐝",
    "132": "@hornets @GEICO Start Richards",
    "133": "Staying Together 🤜🤛\n\n#AllFly | @GEICO https://t.co/Y21I9ulngO",
    "134": "Charlotte Hornets visits Los Angeles Clippers Predictions and Preview for 11/7/2021 today.  Who are we taking in this game?  Find out now. #Sportsbook #SportsBetting https://t.co/AhTsQwmmh2",
    "135": "Nick Richards and Kai Jones will have a big opportunity for the #Hornets tonight if Plumlee can’t go. Charlotte would really benefit if one (or both) of them can gain some steam for long-term purposes. https://t.co/ux1XIAFaVf",
    "136": "My sons first NBA game! #sackings vs #charlottehornets https://t.co/lkjOohwZFE",
    "137": "Hey @RexChapman look what I stumbled across today. I always followed you career. @hornets \nI really hope that's your autograph. Lol https://t.co/rfdHS0MsVI",
    "138": "Los Angeles Clippers Predictions and Preview for 11/7/2021 hosts Charlotte Hornets.  Looking for betting action?  Find out if there is any value in our preview. #Sportsbook #SportsBetting https://t.co/AhTsQwmmh2",
    "139": "Please brighten my day @hornets !!!! #AllFly",
    "140": "Miles Bridges with multiple 30pt games! Charlotte Hornets\nhttps://t.co/Tddqlo93uR",
    "141": "@D1am0ndHandz @TitanXBT @Portals_Art Old school Charlotte hornets feel 🔥",
    "142": "@HornetsPR @hornets hear me out: this may help us win",
    "143": "@Panthers and @hornets have some really negative fans. Sheeeesh",
    "144": "@DubWorld_Music @hornets I definitely have to check out a game this year they looking good⛹🏾⛹🏾⛹🏾",
    "145": "@HornetsPR @hornets Has he played the past 2 games?",
    "146": "Tell Sam Halloween was last week @Panthers @chosen1ra @idjmoore @CMC_22 @BankofAmerica @hornets @northcarolina https://t.co/qDk3F9gw2F",
    "147": "@hornets You guys might need to lend the @Panthers Bridges and Melo to get this offense going because sheesh 😷🤢🤮",
    "148": "This crappy week of Charlotte sports continues... Hornets Clippers at 9 PM....",
    "149": "@hornets @sam_perley @LendingTree PLEASE WIN",
    "150": "@CrownClubCLT @roaringriot @hornets If those are season tickets move on and sell them. Shift your attention. Be a man if your word.",
    "151": "@DaddyRNoz @roaringriot @hornets Nobody is dismissing them. We are here and so is Roaring Riot. However, at someone point you shift your attention to the other team in the city that actually still has a chance. https://t.co/uLOYFcXOr3",
    "152": "@CrownClubCLT @roaringriot @hornets My expectations were also a losing season with year 3 of the plan a real winner. But all i see from this Twitter feed is negative bullshit. They aren’t there yet.",
    "153": "@DaddyRNoz @roaringriot @hornets Rich have you had a pulse during this Panthers season? Being fan doesn’t mean you accept bull shit.",
    "154": "@roaringriot @hornets @CrownClubCLT Sometimes I wonder if this is a legit Panther fan club. Bandwagoneers.",
    "155": "@roaringriot @hornets @CrownClubCLT Sometimes I wonder why we put ourselves thru this every single week",
    "156": "Let's go @hornets \n\n@CrownClubCLT",
    "157": "@zaid_o @CrownClubCLT @hornets Oh yea them too we’ve never had to worry bout them 🤷🏾‍♂️",
    "158": "@_Newwavess @CrownClubCLT @hornets How you gonna act like the Canes in Raleigh arent at the top of the NHL right now?",
    "159": "@CrownClubCLT Literally on same damn page 🤦🏾‍♂️🤦🏾‍♂️only hope we got in Carolina’s is @hornets",
    "160": "@HornetsPR @hornets Oh darn, no Plumlee?  What do we do now?🙄",
    "161": "@HornetsPR @hornets That’s fine, let Richards get the start and see what happens",
    "162": "@cullenlasso @BallySportsSO @HornetsOnBally @hornets @YouTubeTV I’m just saying that maybe you and Jaclyn should come see the Hornets in Denver on the 23rd, and we will both finally get to see our teams in a legal manner.",
    "163": "@HornetsPR @hornets Take the season off plumlee you need the rest my guy💯",
    "164": "@HornetsPR @hornets Hey if he’s hurt he doesn’t have to play tonight or the rest of the season if he wants",
    "165": "UPDATE: @hornets center Mason Plumlee has been downgraded from probable to questionable for tonight’s game \n#AllFly https://t.co/gbM1Yf5MSE",
    "166": "If any verified @BoredApeYC members are in LA and want 2 tix to go see fellow ape @MELOD1P play tonight at the @LAClippers vs. @hornets game tag me in the BAYC discord. (Must own an ape). Mutants and previous winners eligible after 30 min.",
    "167": "@pelotembar @BallySportsSO @HornetsOnBally @hornets @YouTubeTV So what you’re saying is Day 730 awaits me",
    "168": "Thank god my @Braves won and my @hornets are fun to watch and have a ton of potential. Cause that other team I love for some reason is goin absolutely nowhere for a long fuckin time https://t.co/nGhKoXqaDC",
    "169": "Hey, @hornets , could we borrow @MELOD1P for a few snaps? #KeepPounding",
    "170": "@LAClippers @hornets @BallySportWest @AM570LASports @TuLigaRadio Let’s Get It Boys… We’re Finally getting healthy 😈😈 WIN #InJesusName 🙏🙏☝️☝️",
    "171": "@LAClippers @hornets @BallySportWest @AM570LASports @TuLigaRadio See you soon!!❤",
    "172": "🏀 #NBA\n\nCharlotte Hornets 🆚 Los Angeles Clippers\n📆 Lun 8 nov 03:10\n\n#Raspibets #FreePicks #FreeTips #StatBets #SportsBetting #BettingTipster #AllFly #ClipperNation\n🆓🔎📈⬇ https://t.co/0PCwTb6r2o",
    "173": "@LawlersLawYo @LAClippers @hornets I’ll be there LFG",
    "174": "@SwarmnSting i'm not sure the hornets are going to be the answer the city of charlotte needs",
    "175": "@hornets Lets get that win tonight, Buzz Boys! #AllFly",
    "176": "@ClipsUniTracker @hornets @LAClippers @STAPLESCenter It looks like we’re wearing the Association jerseys as our Sunday Home Whites now",
    "177": "Y'all tellin' me you mf's will fill a stadium to watch Sam Darnold but you can't go to the Hive to watch @MELOD1P and the @hornets ? C'mon Charlotte get with it 😂",
    "178": "Sunday night hoops!\n\n🕕 6:00PM PT\n🆚 @hornets \n📺 @BallySportWest\n📻 @AM570LASports, @TuLigaRadio https://t.co/f046zEUv7m",
    "179": "Happy game day #ClipperNation! The boys are back in town as the @LAClippers try to keep their streak going tonight against the @Hornets.\n\nWho’s coming to cheer them on? If you are, be loud &amp; show them some love as they continue to make the fanbase proud. GO CLIPPERS! https://t.co/u13oVOsd8t",
    "180": "@CanWeWinASeries @hornets Thank you!!!",
    "181": "@cullenlasso @BallySportsSO @HornetsOnBally @hornets @YouTubeTV This is a noble cause. Nuggets and Avs fans haven’t been able to watch their teams since September 2019.",
    "182": "Today on the Hornets Hive Cast:\n\nWe get you ready for tonight's @hornets game in LA and recap the opening games of the @greensboroswarm season. That plus The Athletic graded the City Edition uniforms, high marks for the Hornets!\n\nhttps://t.co/OqDLGg8cQQ",
    "183": "Gameday! Let’s Go @Hornets! https://t.co/PJIZY52dca",
    "184": "@xochurch @luxembourgman @camutdforever @hornets @sam_perley @LendingTree The Hornets should go get Zubac he fits well with them.",
    "185": "Charlotte hornets +6 or ML https://t.co/MhusZDOW5S",
    "186": "@hornets @sam_perley @LendingTree Hopefully won't allow the Clippers to set a record for number of 3's made..😒",
    "187": "@SportsDespair @Patriots @Panthers @LAClippers @hornets Both spreads seem very generous towards the Carolina teams",
    "188": "@hornets Feel free to actually show up to this game fellas.",
    "189": "@Panthers I need some @Panthers gear, went to my first game and had to rep @hornets because I didn't have anything else to wear.",
    "190": "@hornets @sam_perley @LendingTree Let’s not let zubac look like prime Shaq against us",
    "191": ".@sam_perley's got you covered with what to watch for in tonight's game &amp; our key matchup of the night! ✍️\n\n#AllFly | @LendingTree https://t.co/HHEriG15Vb",
    "192": "@mattthebroski @McBreeezzy @hornets @HusqvarnaUSA @MELOD1P @MitchKupchackFD @Jumpman23 How many shots hes taking a game? He receives the ball almost every play why he has only 12-13 shots? Because he struggles to create for himself dude",
    "193": "@mattthebroski @McBreeezzy @hornets @HusqvarnaUSA @MELOD1P @MitchKupchackFD @Jumpman23 Is he Avg 20 pts per game this year hell no i think u still playing last year + its possible klay Thompson doesnt create shots and his years AVG 20+ its possible if the team creates plays for you.",
    "194": "@mattthebroski @McBreeezzy @hornets @HusqvarnaUSA @MELOD1P @MitchKupchackFD @Jumpman23 Idk if u watch games but majority of his shots re of catch and shoot and when he drives is usually to pass out",
    "195": "@hornets release lamelo t shirt jerseys thanks",
    "196": "@hornets Get a real center",
    "197": "@MaryGlazersOut Charles Barkley had the balls to ruin a friendship with Michael Jordan by saying that the latter was doing a poor job running the Charlotte Hornets (which was true). Owen had to say it because all pundits who are friends with Ole don't have the balls to call him out.",
    "198": "The best bets for the game between the Charlotte Hornets and Los Angeles Clippers for Sunday’s game.  https://t.co/otLLS3ksc6",
    "199": "@marino13882 @Patriots @Panthers @LAClippers @hornets this is accurate",
    "200": "Here’s what you need to know as the Charlotte Hornets take on the Los Angeles Clippers on Sunday.  https://t.co/GbF9g0rgOQ",
    "201": "Day 9 of tweeting at @BallySportsSO @HornetsOnBally @hornets @YouTubeTV until this TV deal gets fixed",
    "202": "@hornets Mitch and Borrego out. Don't play plumlee",
    "203": "Charlotte has the worst defensive rating so far. The Memphis D when Morant is on the court is worse than The Hornets. https://t.co/pZetprAzEm",
    "204": "@Hornets Throwback Memory!  \n\nNovember 7, 2014 \n\n7 yrs ago tonight, former #Charlotte guard Lance Stephenson hit a 3pt bank shot for the 2OT win over the #Hawks (122-119).  Here is my video of the shot &amp; replays.\n\nhttps://t.co/dogiXG9ovn \n\n#Hornets #BuzzCity #NBA75 #AllFly",
    "205": "This is pretty cool! My dad, Ray Shoup, when he got a Silver Glove with the Charlotte Hornets… and Jake yesterday at his @SouthernMissBSB official visit. @OhioStateBASE anyone have a picture of Ray Shoup freshman year baseball pic?  1966/1967. Both outfielders and get on base! https://t.co/Ka63dcHuP5",
    "206": "@hornets Get Jalen Smith",
    "207": "@hornets The battle of the .500 teams",
    "208": "@hornets Send Bumlee to the GLeague.",
    "209": "Revenge Game: Nicolas Batum plays Charlotte tonight.  He played 308 games in his career for the Hornets.",
    "210": "@hornets Start Nick",
    "211": "@HornetsPR @hornets Keep plumlee out",
    "212": "@hornets i’ll be there!",
    "213": "@SportsMatt12 It’s super ignorant to prop up Malik Monk as some kind of perimeter defender now. 😀😀😀\nDespite his 4-years with Charlotte Hornets, Monk is behind rookie Austin Reaves in the rotation now because of the defensive side of the ball.",
    "214": "@hornets Go get Mo Bamba",
    "215": "@hornets You better win",
    "216": "The Buzz Boyz are ready to battle in LA! 😤\n\n#AllFly https://t.co/VAsLGZgQRJ",
    "217": "GAMEDAAAAAY!!!!\n\n🏀 Charlotte Hornets vs Los Angeles Clippers\n⏰ 23:00\n📺 League Pass\n🏟️: Staples Center https://t.co/l5sA28KW21",
    "218": "Analyzing Sunday’s Charlotte Hornets at Los Angeles Clippers odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/IcTPiEigPL",
    "219": "Analyzing Sunday’s Charlotte Hornets at Los Angeles Clippers odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/JMvKXeKfk7",
    "220": "@khloegarnel @MSuppasit @Msuppasitstudio Charlotte Hornets\n\nMew Suppasit\n\n#SPACEMAN @MSuppasit\n#MewSuppasit\n#มิวศุภศิษฏ์\n\n#MewSuppasitStudio\n@Msuppasitstudio",
    "221": "@SportsDespair @Patriots @Panthers @LAClippers @hornets 5.5 seems low considered how the Hornets have played this week",
    "222": "4-4 @Patriots favored by 3.5 @ 4-4 @panthers\n4-4 @LAClippers by 5.5 vs 5-5 @hornets \n\nI can’t even be mad at this.",
    "223": "THE CHARLOTTE HORNETS PLAY BASKETBALL TODAY",
    "224": "Uniforms for tonight's matchup between the Clippers and Hornets\n@hornets Statement 🟣\n@LAClippers Association ⚪️\n🕕 6:00 PM PT \n🏟️ @STAPLESCenter \n📺 Bally Sports SoCal\n#ClipperNation https://t.co/nkrO3JYlBD",
    "225": "@ABlaze919 @hornets Always one of my favorite things to do.",
    "226": "Little late but had great seats for the @hornets home opener. I'm sure we will stop the slide tonight!!!\n#AllFly https://t.co/vpk8I8lmV0",
    "227": "Charlotte Hornets basketball today https://t.co/bRaLytuW6Q",
    "228": "Oh how quickly things can change if you’re a Charlotte sports fan. Exactly a week ago I was talking about how much more excited I was for the Hornets game instead of the Panthers. With CMC back and PJ hurt….yeah you can flip that right back.",
    "229": "Charlotte Hornets @ Los Angeles Clippers\nPick : Charlotte Hornets.\nBasketball. NBA",
    "230": "Charlotte Hornets vs Los Angeles Clippers 11/7/2021 Picks Predictions Previews\n\nhttps://t.co/KvaZEIxbCu\n\n#NBA #NBApicks #NBAparlay #NBAprediction #NBAbetting #basketballpicks #expertpicks #handicapper #sportsbetting #freepick #freepicks #odds #picks #sportspick #Hornets #Clippers https://t.co/zbgCrwlf14",
    "231": "@ryanbutler704 @hornets You know JB slow to let the youngest loose but I’m like why not lol can’t be much worse than Plumlee",
    "232": "@hornets @Peggza__ Hey😁 do you like reading?",
    "233": "Just read in @axioscharlotte that the Hornets established the annual Rick Bonnell Memorial Scholarship for journalism students across NC. Cheers to the @Hornets for honoring Rick’s lifelong passion for mentoring journalists. \n\nApplications open until 11/30\nhttps://t.co/BG7aqQcHON",
    "234": "@hornets need to consider trading Toronto for Chris Boucher. Judging by his lack of playing time, it might not be difficult to pull off.  I suggested him or Mo Bomba last season. Train left the station on Bomba. Too late now. https://t.co/HiqUDILn6L",
    "235": "@professorIocks @DonV757_ Why not?  Virginia is full of Braves fans and the Niners had lots of nationwide fans at one time.  Virginia Tech and Charlotte hornets seem pretty self explanatory",
    "236": "Spilforslag:  LA Clippers - Charlotte Hornets: Over 6,5 Rebounds af M. Bridges https://t.co/mhUcBYNAh7 #betxpert #betdk https://t.co/B1IToZdDeW",
    "237": "@piusmwilson @Elgio_70 @bruno_akampa @Owakitagwenda Charlotte Hornets the 1st rated offensive team incoming 🤗",
    "238": "@AndyNeal19 @Nickyboy4581 @British_Buzz @britishhornet @ivanupex @HornetsPR @hornets @SteveSmith_13 @HornetsFansUK @RichKingston73 Going to be worse for me the next 6 weeks, currently on my way to Germany for work…which is an extra hour ahead 🤦‍♂️",
    "239": "@Nickyboy4581 @British_Buzz @britishhornet @ivanupex @HornetsPR @hornets @SteveSmith_13 @HornetsFansUK @RichKingston73 @Carto_The_Hero Morning my sleepless hero's 😅",
    "240": "@British_Buzz @britishhornet @ivanupex @HornetsPR @hornets @SteveSmith_13 @HornetsFansUK @RichKingston73 @Carto_The_Hero @AndyNeal19 Thanks @British_Buzz 👍🏻\n\nGood morning fellow U.K. Hornets 👋🏻",
    "241": "@britishhornet @ivanupex @HornetsPR @hornets @SteveSmith_13 @HornetsFansUK And more:\n\n@Nickyboy4581 \n@RichKingston73 \n@Carto_The_Hero \n@AndyNeal19",
    "242": "@hornets I always thought everyone was underrating @MilesBridges. The big surprise was finding out I was part of \"everyone\". Dude is a flat out baller.",
    "243": "@CommonS37481141 @SportsCenter @FlaPanthers I'm from new Orleans and we didn't have a basketball team when I grew up \n\n Since the jazz went to Utah\n Then we got hornets from Charlotte.\nNow we have the pelicans now .",
    "244": "Charlotte Hornets vs. LA Clippers - 11/7/2021 Free Pick &amp; NBA Betting Prediction https://t.co/8HjBvicriT #FreePicks ... https://t.co/2y2hH4FoYB",
    "245": "@hornets might as well pull Gelo up y’all need a spark off the bench cause y’all bench ass af",
    "246": "@antzfamily Well I've seen Portland a few times, tonight was them being hyped up against the Lakers as usual. But I've seen Charlotte also. They're better built than Portland. Big on the wings, big at guard, physical forwards. If AD don't play, it's a blowout for the Hornets",
    "247": "The LA Lakers have the same record as the Charlotte Hornets. (5-5) https://t.co/oSbLxBpEmW",
    "248": "@Lakers How @Lakers coming into next game against @hornets 💯🏀💪🏾😎🌴 https://t.co/gS7ZQ76x8q",
    "249": "Gordon Hayward, forward for the Charlotte Hornets, who is also the top laner for HUPU Esports, sends his regards to the #Worlds2021 Champion EDG.\n\n@EDG_Edward @gordonhayward \n\n#LPL #Worlds2021 https://t.co/ZjGamNhFGE",
    "250": "@PranavSriraman The Charlotte hornets because that is what they do best",
    "251": "@BishopWTBz @hornets We need one of these young rookie centers to step up. Until we get our Big Man situation figured out, we’re gonna have to win shootouts.",
    "252": "Check out 2021 Panini Prism Basketball Charlotte Hornets Riller Carey Richards #NBA  https://t.co/cdLXBcmJtF via @eBay",
    "253": "NBA Viernes 5/11: 0-3 Temporada: 19-18\n\nMemphis Grizzlies +2 (-110) ❌\nBrooklyn Nets vs Detroit Pistons O211 (-110) ❌\nCharlotte Hornets +2 (-110) ❌",
    "254": "Listening to any NBA broadcaster other than the @hornets Eric Collins is just plain BORING. Am I right @ashahahmadi ?? #AllFly",
    "255": "@William34709703 @hansonwu2002 @HoopMixOnly LeBron was in the eastern conference when the Charlotte Bobcats won 9 games and the Philadelphia 76ers won 10 games for an entire season, that is no different from an expansion era.\n\nExpansion teams actually took off during the ‘90s. Heat, Hornets, Magic, all great teams.",
    "256": "@GFuelEnergy From Charlotte so you know I have to rep the Hornets💪🏻💪🏻 @hornets",
    "257": "So fly!!!! @hornets @CrownClubCLT https://t.co/hiCFOkaiWR",
    "258": "/r/CharlotteHornets: G League was less impressive today #AllFly https://t.co/FacY2XZBBR",
    "259": "/r/CharlotteHornets: The inexplicable woes of Mason's free throws #AllFly https://t.co/QqoXBYIPoI",
    "260": "@BismackStan @HornetsPR @hornets You want to trade for Cody?",
    "261": "@HornetsPR @hornets i wonder who could play center",
    "262": "Brick in the truck headed to Charlotte where the hornets at.™️#TRUF",
    "263": "Married Couple Behind Smile Savvy Cosmetic Dentistry Is Now A Proud Partner Of The Charlotte Hornets\nhttps://t.co/jAzaG6Z3DY",
    "264": "@CAPTAINKCX @MiamiHEAT @Suns and @hornets look best",
    "265": "@hornets @thorrjt @greensboroswarm What about Liangelo?, your franchise guard and the rest of mainstream basketball fans gonna be pissed",
    "266": "@Ballislife @nbagleague @hornets here’s yourself a perfect scorer off the bench that is so desperately needed.",
    "267": "I wanna go to a Charlotte hornets game… I’ll be someone’s date 👀😂",
    "268": "Its easy, when I was younger I became a Virginia Tech, Atlanta Braves, San Francisco 49ers and Charlotte Hornets fan. https://t.co/GYu18zmuXP https://t.co/iItu3xHIa7",
    "269": "@DonV757_ how the fuck does someone become a Virginia Tech, Atlanta Braves, san francisco 49ers, and Charlotte Hornets fan that just dont add up",
    "270": "@hornets @LendingTree Favorite memories were: the year was 1988 when the best team came to Charlotte to blow us away and also when the best player in the NBA came to own the best team in the league! #NBA75",
    "271": "Hornets Sandstone Car Coasters, 2 Piece Coaster Set, Unique Charlotte Basketball Fan Gift for Dad, Boyfriend, Groomsmen, Graduate https://t.co/skPzERHuIo #giftlist #christmasshopping #christmasgift #SignsofTimeDesigns #Etsy #BasketballFanGift https://t.co/TevprRa2Uq",
    "272": "@NickDePaula @hornets @MELOD1P @PUMAHoops @boardroom @TheUndefeated @ESPNNBA Still hideous.",
    "273": "@obvious_shirts It’s only on each team’s statement Jerseys. Charlotte Hornets are the only team that has the jump on all jerseys not just the statement jersey. #funfact",
    "274": "@hornets Damnit",
    "275": "The unadulterated truth about the @hornets &amp; Coach JB’s coaching. #RawTruth has YET to be wrong. https://t.co/zbiJMlhBtR #allfly"
}