{
    "0": "📝 Gli starting five del match tra Memphis Grizzlies e Los Angeles Lakers\n\n🏀 Russell Westbrook, Avery Bradley, Malik Monk, LeBron James e Dwight Howard\n\n⛹️‍♂️ Ja Morant, Desmond Bane, Kyle Anderson, Jaren Jackson e Steven Adams\n\n💜💛 Let's go Lakers!\n\n#LakeShow #GrindCity  #NBA75 https://t.co/KqwOs8IPso",
    "1": "Los Angeles Lakers vs Memphis Grizzlies | Live Play-By-Play &amp; Reactions https://t.co/FQKiodG3wY via @YouTube",
    "2": "Los Angeles Lakers Vs Memphis Grizzlies Live Play By Play &amp; Reactions e https://t.co/dZkm1iWlSf",
    "3": "Suckafree Sports Live - Los Angeles Lakers Vs Memphis Grizzlies (Watch-Along &amp; Play By Play) 🏀 https://t.co/8SK5V56m2o",
    "4": "Dwight Howard returns to Lakers starting lineup vs the Grizzlies #DwightHoward #LosAngelesLakers #MemphisGrizzlies https://t.co/uuRLQmvd5w",
    "5": "Memphis Grizzlies starting 5️⃣ vs. the Los Angeles Lakers:\n\nJa Morant 🥷\nDesmond Bane 🎯\nKyle Anderson 🦥\nJaren Jackson Jr. 🦄\nSteven Adams 🥝\n\n#GrizNxtGen https://t.co/Upn1ycvx2E",
    "6": "A beginner's guide to cryptocurrency | The Los Angeles Lakers' home game on Christmas Day against the Brooklyn Nets will be a coming-out party for https://t.co/D94VXBGNrQ Arena, the new name fo #cryptocurrency\n\nhttps://t.co/hcSewkgkwI",
    "7": "Lakers interim coach calls Ja Morant ‘a true superstar’ #JaMorant #LosAngelesLakers #MemphisGrizzlies https://t.co/RpxPhB2jM5",
    "8": "Los Angeles ML parlay +770\n\nClippers Lakers\n\nBoth teams they’re playing are out a lot of guys.\n#SoloLocks",
    "9": "The Los Angeles Lakers will start Russell Westbrook, Avery Bradley, Malik Monk, LeBron James and Dwight Howard in their game against the Grizzlies on Wednesday. For Fantasy Analysis Click Here: https://t.co/bGHf5fhUHf",
    "10": "Starting for your Los Angeles Lakers...\n\n#SuitingUpTogether | @ToyotaSoCal https://t.co/QxkWd2ub5b",
    "11": "Los Angeles Lakers | Horns Ghost Boston Fan https://t.co/KWKenzQ3a7",
    "12": "UPDATE: Due to unforeseen Parlay issues The Memphis Grizzlies will win tonights game VS the Los Angeles Lakers! Ja Morant Will go for 30 and 10! Bane will add great shooting that Lebron and the Lakers won’t be able to stop! https://t.co/R1b9dLgVi6",
    "13": "Los Angeles Lakers Starters:\n\nRussell Westbrook\nAvery Bradley\nMalik Monk\nLeBron James\nDwight Howard\n\nPlayers out:\nTrevor Ariza\nKent Bazemore\nAnthony Davis\nKendrick Nunn\nAustin Reaves\nRajon Rondo\n#LakeShow #NBA #NBATwitter #NBA75",
    "14": "I was having a reasonable day and then I remembered that the Los Angeles Lakers play basketball today. Here goes nothing!",
    "15": "Dallas to sign Isaiah Thomas, per sources; G recently finished 10-day contract with Los Angeles | #NBA 🏀 #Mavs #Lakers \n\nvia @TheAthletic  https://t.co/hXAkXvcCnH",
    "16": "RelentlessSports:\nNBA VIP PACKAGE\n12/29/2021 NBA Card:\n\n1. Los Angeles Lakers +6 (0.5 bought) (NBA) 🏀 5:00 PM PST\n\n2. Los Angeles Clippers +7 (0.5 bought) (NBA) 🏀 4:30 PM PST - im on this one. love it\n\n3. Utah Jazz vs Portland Trailblazers OVER 228  (NBA) 🏀 - also good",
    "17": "LEBRON ISNT HUMAN! #LosAngelesLakers vs Houston Rockets Final Minutes! 2021 NBA Season\n🏀https://t.co/B22IhQHtJn\n\nRumors, news: https://t.co/0Tc4IbKXF1\n\n@Lakers  #NBA #basketball https://t.co/mFwoO7eRPT",
    "18": "Live Stream 🏀 \n\nDetroit Pistons vs New York Knicks\nIndiana Pacers vs Charlotte Hornets\nBoston Celtics vs Los Angeles Clippers \nMemphis Grizzlies vs Los Angeles Lakers \n...\nFree NBA Streaming link \nWatch on 👉 [https://t.co/6t9UvMD8Dt]\n\n..\nEnjoy😉\n#NBA",
    "19": "Can the struggling Los Angeles Lakers find a way to get back-to-back road victories for the first time this season? \n\n@tyschmidt4 provides his two bets bets for Lakers-Grizzlies: https://t.co/YpYr3nZ1GT",
    "20": "#youtube Russell Westbrook SAYS Houston Rockets will be a GOOD team in the FUTURE | Los Angeles Lakers https://t.co/fy01Zfom3R",
    "21": "#youtube LeBron James on STARTING at center for the Los Angeles Lakers in WIN over Houston Rockets https://t.co/vlzzk3SzaO",
    "22": "According to Shams Charania, Isaiah Thomas will sign with the Dallas Mavericks after his 10-day trial with the Los Angeles Lakers. https://t.co/5k7NF1dUl6",
    "23": "Consensus Line Move:\n2021-12-29 Los Angeles Lakers at Memphis Grizzlies from 225.50 to 224.00\nUnder mousetrap\n#NBA #sportsbettingadvice #dataanalysis #finance",
    "24": "Lakers Finally Get A Win! \"Los Angeles Lakers vs Houston Rockets Full Ga... https://t.co/UUrfCheAfQ via @YouTube",
    "25": "Invest in sweat equity💧\n\n#LakeShow x @DWS_Group https://t.co/QrnEM5jrff",
    "26": "Austin Reaves, Kent Bazemore return to Lakers lineup after clearing protocols #AustinReaves #KentBazemore #LosAngelesLakers https://t.co/mwRsvN8CDL",
    "27": "Detroit Pistons - New York Knicks\nIndiana Pacers - Charlotte Hornets\nBoston Celtics - Los Angeles Clippers\nMemphis Grizzlies - Los Angeles Lakers\n\nBet slip link: https://t.co/RVEcro9aI6 https://t.co/s1XIr0m3mY",
    "28": "Los Angeles Lakers Vs. Memphis Grizzlies Live Play By Play &amp; Reaction https://t.co/20uqxT8C1a",
    "29": "EUA - NBA 🇺🇸🏀\n\n📺 Memphis Grizzlies x Los Angeles Lakers\n🏀 Over 28.5 Pontos - Lebron James\n⏰ 22:00\n💱 1.860\n💰 Stake 2⃣ https://t.co/2hBan9UHos",
    "30": "Reports say Isaiah Thomas will sign with the Dallas Mavericks after his 10-day trail with the Los Angeles Lakers 👀 \n\n#NBA #NBATwitter #MFFL #LakeShow https://t.co/0tUrT0rq9a",
    "31": "Bron and Brodie, Back to Back https://t.co/eETGngSD0X",
    "32": "Resultados NBA\nOrlando Magic 110-127 Milwaukee Bucks \nMiami Heat 119-112 Washington Wizards \nToronto Raptors 109-114 Philadelphia 76ers \nHouston Rockets 123-132 Los Ángeles Lakers\nMinnesota Timberwolves 88-96 New York Knicks\nNew Orleans Pelicans 108-104 Cleveland Cavaliers",
    "33": "The Memphis Grizzlies go for a third straight win when they host the Los Angeles Lakers tonight 🏀 \n\nFIND OUT MORE ➡️ https://t.co/qx1SpiqLLn\n\n#NBA #LakeShow #GrindCity",
    "34": "Los Angeles Lakers star LeBron James got one step closer to becoming the NBA’s all-time leading scorer.  https://t.co/xhVhc9uj4j",
    "35": "Via @Forbes/@ForbesSports \n\nRussell Westbrook has had a rough season for the Los Angeles Lakers, and he's under fire for his poor play.\n\nBut should the finger be pointed elsewhere?\n\nhttps://t.co/vPyqa7fJNf",
    "36": "New tumblr post: \"#NBA2K22 Sacramento Kings vs. Los Angeles Lakers MyLeague PS4...\" https://t.co/Wp5dDKJQGg ifttt, youtube",
    "37": "The Los Angeles Lakers, who are currently the 7th seed in the Western Conference with a record of 17-18, have the 2nd hardest remaining strength of schedule in the league for the rest of the NBA season. Up to this point, they’ve played the 3rd easiest schedule in the league. https://t.co/qtdspzx4wI",
    "38": "Red Hot Chili Peppers’ Flea Addresses His Toxic Relationship With Los Angeles Lakers \n\nhttps://t.co/eL5mGnSN7P https://t.co/t3uiLytRtJ",
    "39": "#518 K0be Bry@nt - Los Angeles Lakers. Jersey: Reserve. Season: 2012/2013. @opensea \n\n#NFTs #NFTCommunity #NFTartist https://t.co/nusLcBFyVU",
    "40": "LeBron James became just the third player to reach 36,000 career points in the NBA as the Los Angeles Lakers beat the Houston Rockets 132-123.",
    "41": "LeBron James reaches 36,000 career points as Los Angeles Lakers beat the Houston Rockets 132-123.\n\n#NBA",
    "42": "The Los Angeles Lakers play tonight. https://t.co/c8nLWzMcsY",
    "43": "Hoje : NBA 2021/2022\n22:00 Chicago Bulls x New York Knicks / Canal 1\n22:00 Memphis Grizzlies x Los Angeles Lakers / Canal 2",
    "44": "NEW Los Angeles CityCast presented by @BetRivers ! ⤵️\n\n😬 Holiday Bowl canceled reaction\n\n🏈 Preview Rams at Ravens and Broncos at Chargers \n\n🏀 NBA Wednesday night: Lakers at Grizzlies and Clippers at Celtics \n\nhttps://t.co/HdDyvy0bUW",
    "45": "Don't miss the newest episode of Backstage: Lakers, where we take a look back at the season up to now.\n\n⏰: 8:30 p.m. PT\n📺: @SpectrumSN https://t.co/FQhLrRt0lt",
    "46": "Detroit Pistons - New York Knicks\nBoston Celtics - Los Angeles Clippers\nMemphis Grizzlies - Los Angeles Lakers\n\nBet slip link: https://t.co/Y1gLZidIdP https://t.co/BR7Hv4lMzT",
    "47": "Three Things to Know: Lakers at Grizzlies - 12/29/21 | Los Angeles ... (Los Angeles Lakers)\n\nThe Lakers (17-18) head to Memphis (21-14) on Wednesday evening for the tail end of a back-t...\n\nAdd your highlights:\nhttps://t.co/h6CNu46wTj\n #LA_Lakers",
    "48": "Los Angeles Lakers at Memphis Grizzlies odds, picks and prediction https://t.co/omc0u1aiW4",
    "49": "Memphis Grizzlies Predictions and Preview for 12/29/2021 hosts Los Angeles Lakers.  Looking for betting action?  Find out if there is any value in our preview. #NBATwitter #GamblingTwitter https://t.co/yETS0uVTOu",
    "50": "Los Angeles Lakers",
    "51": "Los Angeles Lakers visits Memphis Grizzlies Predictions and Preview for 12/29/2021 today.  Who are we taking in this game?  Find out now. #NBATwitter #GamblingTwitter https://t.co/yETS0uVTOu",
    "52": "Memphis Grizzlies vs Los Angeles Lakers Betting Preview Dec 29 – Wagertalk News https://t.co/MWyHrncLgx",
    "53": "Three Things to Know: Lakers at Grizzlies - 12/29/21 | Los Angeles Lakers https://t.co/6SO2d6VmJq",
    "54": "Tipping off in Tennessee.\n\n⏰: 5 p.m. PT\n📺: @SpectrumSN \n📻: 710 ESPN &amp; 1330 KWKW\n\n#LakeShow x @socios https://t.co/s0FlDq3qtk",
    "55": "The story of the Los Angeles Lakers dynasty comes to HBO Max https://t.co/fg9tuPuHcO",
    "56": "@TupacAG The One and that would mean he can defeat more teams than in the NBA like Jordan who was the Alaskan Bull riders and the King James with also Steph Curry for one is The King of Los Angeles Lakers with Curry being the three point winners of Seas",
    "57": "@Larryk520 My lawyer just needs to find Lakers fans in Los Angeles. Can’t be too hard right? 😂",
    "58": "Memphis Grizzlies vs. Los Angeles Lakers Game Preview https://t.co/fqQ7yL1jQS",
    "59": "This Lakers Team Brings Back Bad Memories.... https://t.co/SVv24W3OAh\n\n#NBA #LeBronJames #LosAngelesLakers #Basketball #LakeShow https://t.co/1iiZn15znu",
    "60": "Los Angeles Lakers vs. Memphis Grizzlies https://t.co/JV8rjwcZA7",
    "61": "The best betting pick and odds for the NBA game between the Memphis Grizzlies and the Los Angeles Lakers. Here is our NBA Dec 29 Preview.\n\n#NBA #Odds #Lakers #LebronJames #Grizzlies #Basketball\n\nHere is our NBA Dec 29 Preview🔽\nhttps://t.co/tPjEREJF1N",
    "62": "waiting on an official “the los angeles lakers have released center deandre jordan” tweet",
    "63": "@KaiFrenchFry Yes! I was 7/8 and I’m going to tell ya Mikai! If you wanna win big tonight don’t bet on the favorites! Bet on the Los Angeles Lakers! #LakeShow",
    "64": "The Los Angeles Lakers will defeat The Memphis Grizzlies on their Home court tonight!",
    "65": "Soaring dunks. Acrobatic layups with either hand. Buzzer beaters from half court.\n\nHere are some of Malik Monk's best buckets of the season. https://t.co/aPqQwwmpeQ",
    "66": "That \"The Los Angeles Lakers have released Center DeAndre Jordan\" tweet is going to hit different 😂",
    "67": "It’s the Los Angeles Lakers. If y’all don’t want this shit go play for the Sacramento Kings. Stop that soft shit. Russ gotta step that shit up. In fact we only hold him to the standard that we do because WE KNOW RUSSEL WESTBROOK IS A KILLER. Kobe said it himself. I’m done now.",
    "68": "LeBron James became just the third player to reach 36,000 career points in the NBA as the Los Angeles Lakers beat the Houston Rockets on Tuesday to end a five-game losing streak. https://t.co/6sYWlrwlrj",
    "69": "On this day in sports history December 29, Los Angeles Lakers Shooting Guard Kobe Bryant scored 58 Points against the Charlotte Bobcats in 2006.",
    "70": "The other 2 teams that had previously retired Wilt’s number were the Philadelphia 76ers and the Los Angeles Lakers.",
    "71": "The Los Angeles Lakers broke their 5 games losing streak with a 132-123 victory over the young Houston Rockets. #LALvsHOU \n\nLeBron James and Westbrook finished with a triple-double. \n\nJames 32P/11R/11A \nWestbrook 24/12R/10A https://t.co/s9WZg6Nmy2",
    "72": "On this day in sports history December 29, Philadelphia Warriors Center Wilt Chamberlain recorded 60 Points and 26 Rebounds in a 123-118 win against the Los Angeles Lakers in 1961.",
    "73": "On this day in sports history December 29, Los Angeles Lakers Small Forward Elgin Baylor recorded 52 Points and 16 Rebounds against the Philadelphia Warriors in 1961.",
    "74": "@joereedy You have to fight for your fans in Los angeles.  There's so many options. you got the Lakers, Clippers, Kings, Angels, Sierra Canyon, and many more.",
    "75": "\"Showtime: Magic, Kareem, Riley, and the Los Angeles Lakers Dynasty of the 1980s\" by Jeff Pearlman. If the upcoming HBO show is anywhere near as entertaining as the book, it'll be a true hit. https://t.co/SJmZUAh3aJ",
    "76": "@TraskTrask500 Oh fr I love dem Clippers as well to me dey da real team of Los Angeles No Bap &amp; Kawhi Leonard He’s Literally &amp; Figuratively one of my favorite NBA players of all time in da top 10 &amp; MJ Is my favorite but Kawhi reminds me of MJ &amp; yea dem Celtics &amp; Lakers fans hate each other🤦🏽‍♂️💯",
    "77": "Detroit Pistons - New York Knicks\nMemphis Grizzlies - Los Angeles Lakers\nPortland Trail Blazers - Utah Jazz\n\nBet slip link: https://t.co/elCkTJs1Q2 https://t.co/9zx6Rg4giI",
    "78": "Added \nNBA \nLos Angeles Lakers + 6",
    "79": "Kaiser Permanente Lancaster, CA is refusing to keep their Covid-19 testing facility open during the posted hours of 8-4:30PM. They are turning the community away.#9News #GavinNewsom #abc7 #LosAngelesLakers #SpectrumNews #7NEWS #CDCRecommends #WHO #Palmdale #Lancaster",
    "80": "GAMEDAY!📍\n-\nThe Los Angeles Lakers take on the Memphis Grizzlies today at 5:00 PM in the FedExForum. 💜💛\n-\nWho do you think will win the game today? 🤔 \n-\n📸: (@loganrielyphoto &amp; @noahgphotos)\n-\nFollow @lalakersquad for more! 🔥 https://t.co/xPXDQ17nXD",
    "81": "The guy with the lowest salary in the Los Angeles Lakers is Laker ka fakeer. #NBA",
    "82": "LeBron James and Russell Westbrook both had triple-doubles and the Los Angeles Lakers snapped a season-high, five-game skid with a 132-123 victory over the Houston Rockets on Tuesday night.\n\nhttps://t.co/buaf01k9Zw",
    "83": "Congratulations to Dyhalto who moved up 1 spot to take #10 on the Los Angeles Lakers team leaderboard.\n\nhttps://t.co/7jbi1baNWE",
    "84": "LeBron James' first career start at center could be a sign of things to come for the Los Angeles Lakers' superstar.\n\n#LeBronJames | #LakeShow | @BigTimeTimJim  https://t.co/UWFFzmi6tc",
    "85": "The Atlanta Hawks have signed a forward from the Los Angeles Lakers’ G League team.  https://t.co/jhvTywl4JQ",
    "86": "The Memphis Grizzlies look to win their third straight against the Los Angeles Lakers 🏀🍿\n\n📺: 8pm ET https://t.co/3vBBVBylWX",
    "87": "Updated NBA Title Odds🏆\n\n-Brooklyn Nets: +260\n-Golden State Warriors: +525\n-Phoenix Suns: +600\n-Milwaukee Bucks: +800\n-Utah Jazz: +1000\n-Los Angeles Lakers:+1100\n-Miami Heat: +1300\n-Los Angeles Clippers: +2000\n\n#NBATwitter #NBAXmas #SportsBetting",
    "88": "“Jerami Grant is not going to put the Lakers at the front of the Western Conference” — Shannon Sharpe #JeramiGrant #LosAngelesLakers https://t.co/UuWRGHQg5m",
    "89": "\"LeBron James makes first start at center as Los Angeles Lakers beat Houston Rockets to snap skid - ABC News\" https://t.co/LY0UcSMBSh",
    "90": "The Los Angeles Lakers went to Houston and beat the Rockets in a game that included 2 Lakers triple-doubles! Devon Zobatar has the recap #Lakeshow \n\nhttps://t.co/B4mMev6BdH https://t.co/pPcCf9T29a",
    "91": "May my enemies be as confused as the Los Angeles Lakers https://t.co/HRan7IAEoA",
    "92": "The Cowboys seem all set to clinch the NFC East. Former Cowboy Everson Walls chimed in with thoughts on their exciting young core, comparing them with the \"Showtime Lakers\" of the 1980s.\nThoughts?\n\n#NFL\n#CowboysNation #DallasCowboys\n#LosAngelesLakers\n\nhttps://t.co/tdqph6pOhy",
    "93": "📰 | Latest NBA Odds: James stars as Lakers snap losing streak\n\n🏀 | LeBron James was the star of the show as Los Angeles Lakers snapped a five-game losing streak by beating Houston Rockets 132-123 at the Toyota Center. #NBA\n\nRead More 👇",
    "94": "Los Angeles is 3-12 ATS in its last 15 games vs. a team with a winning record.  The Grizzlies are 11-5 ATS in their last 16 games overall.  Memphis is 5-1 ATS in its last six home meetings with the Lakers.  Bet the Grizzlies Wednesday.",
    "95": "Wednesday's Free Pick: Memphis Grizzlies -5.5\n\nThis is a tough spot for the Los Angeles Lakers tonight.  They will be playing the 2nd of a back-to-back after a 132-123 shootout win in Houston last night. LeBron James played over 39 minutes and Russell Westbrook played 35 minutes.",
    "96": "The dunk. The reaction. The King. \n\n@KingJames x #NBAAllStar https://t.co/M7qZSIfX0F",
    "97": "Here is what you need to know as the Los Angeles Lakers face the Memphis Grizzlies Wednesday.  https://t.co/mUHjV8WIVr",
    "98": "#Grizzlies NBA -- Memphis Grizzlies vs Los Angeles Lakers Pick and Prediction https://t.co/HCOwsrUien",
    "99": "@TheHoopCentral Los Angeles Lakers",
    "100": "LeBron James reaches 36,000 career points as Los Angeles Lakers beat the Houston Rockets | In Hindi. https://t.co/HkYJugW8Fk",
    "101": "2018-19 Donruss Optic Basketball Retro Series Magic Johnson Autographed BGS 10 Authenticated Autograph Los Angeles Lakers https://t.co/zDi5PJOsob via @Etsy \n#NewYear #Sales #NewYears #Magic",
    "102": "Lakers' LeBron James declines to respond to Kareem Abdul-Jabbar's criticism - Los Angeles Times\nKobe would’ve NEVER have disrespected Kareem. Just saying. https://t.co/kK4VgTCWuU",
    "103": "Free Agents Andrew Bogut, OJ Mayo, Richard Hamilton, and Yao Ming have come to terms with the Los Angeles Lakers for 10-Day Contracts. Per Sources.",
    "104": "Memphis Grizzlies vs. Los Angeles Lakers Game Preview https://t.co/MBN4rFy23M",
    "105": "Kareem Abdul-Jabbar has criticised Los Angeles Lakers star LeBron James for posting a meme about Covid-19 on his Instagram account",
    "106": "@latimes Lebron, you’re legacy is sealed. You do not need to respond to the legendary former Lakers center.",
    "107": "LeBron James reaches 36,000 career points as Los Angeles Lakers beat the Houston Rockets https://t.co/U1p07jKKAi",
    "108": "LeBron James and Russell Westbrook both had triple-doubles and the Los Angeles Lakers . . . https://t.co/viwSCPriUJ",
    "109": "Watch Los Angeles Lakers star LeBron James drop 32 points to help beat the Houston Rockets.  https://t.co/3Xll1SUaLF",
    "110": "🏀 Houston Rockets vs Los Angeles Lakers\n\n🔝 LeCenter e gli M&amp;M's\n⬇️ Evil Westbrook e la crisi infinita di THT\n\n📊 I nostri consueti Plus &amp; Minus by @LucaNovo76\n\n#LakeShow #Rockets #NBA75\nhttps://t.co/lK16fSh6xZ",
    "111": "Consensus Line Move:\n2021-12-29 Los Angeles Lakers at Memphis Grizzlies from 227.50 to 226.50\nUnder there's a pulse\n#NBA #bettingadvice #coding #personalfinance",
    "112": "Lakers' LeBron James declines to respond to Kareem Abdul-Jabbar's criticism - Los Angeles Times\nLebron’s disrespect of Kareem casts a pall on all the Lakers team players right now.  Lebron is not a leader. https://t.co/kK4VgTCWuU",
    "113": "Lakers' LeBron James declines to respond to Kareem Abdul-Jabbar's criticism - Los Angeles Times\nShame on Lebron. No respect 4 his elders. Then he should expect that &amp; more once he’s not playing. 😡 https://t.co/kK4VgTCWuU",
    "114": "Everything ready today 29 at 7:00 P.M do not stop enjoying the match between Memphis Grizzlies vs. Los Angeles Lakers at the FedExForum, Memphis, TN,  and remember if you want to connect visit us at  https://t.co/wtcj1nSuDR\n#basketball #basketballneverstops #basketballislife https://t.co/WJkG6mxxEn",
    "115": "#LosAngelesLakers x #WallpaperWednesday \n\n👑 x 👌 x ✈️\n\n❤️’s and ♻️’s are appreciated ☺️\n\n#LakeShow https://t.co/HsDa99tAPt",
    "116": "Lakers' LeBron James declines to respond to Kareem Abdul-Jabbar's criticism - Los Angeles Times\nLebron’s been rebuked by the foremost elder statesman of the Lakers. He needs 2 bow his head. Geez. https://t.co/kK4VgTlTsU",
    "117": "Lakers' LeBron James declines to respond to Kareem Abdul-Jabbar's criticism - Los Angeles Times\nLebron: U messed up.\nU need 2 admit U made a mistake or it doesn’t matter ur stats, U will b tainted. https://t.co/kK4VgTCWuU",
    "118": "Lakers' LeBron James declines to respond to Kareem Abdul-Jabbar's criticism - Los Angeles Times\nWhen The Great One speaks, it’s best 2 b silent. https://t.co/kK4VgTlTsU",
    "119": "Over the last couple of years, the Los Angeles Lakers have remained reluctant to move Talen Horton-Tucker due to his potential. The 21-year-old has shown flashes of promise as a two-way factor. \n\n#Lakers | #LakeShow | @bgarciaivsports  https://t.co/j4t24Go2lI",
    "120": "From Minneapolis to Los Angeles\n\nFrom George Mikan to Magic to Kobe and now LeBron. \n\nCheck out now the greatest Lakers of all-time. \n\nLink in the Bio 🔗\n\n#LakeShow https://t.co/fi6HvnEIpM",
    "121": "DasHaus made a bet!\n\nEvent: Los Angeles Lakers vs Memphis Grizzlies #NBA\nBet: Memphis Grizzlies TO WIN -6\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "122": "DasHaus made a bet!\n\nEvent: Los Angeles Lakers vs Memphis Grizzlies #NBA\nBet: Los Angeles Lakers TO WIN +6\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "123": "Los Angeles Lakers 👇🏻👇🏻👇🏻👇🏻 https://t.co/5g6NHoUq7j",
    "124": "Houston Rockets guard Kevin Porter Jr. had high praise for Los Angeles Lakers star LeBron James after the two faced off.  https://t.co/eKPxZFE9Ap",
    "125": "Consensus Line Move:\n2021-12-29 Los Angeles Lakers at Memphis Grizzlies from -4.50 to -6.00\n#GrindCity adjust quickly\n#NBA #sports #dataanalysis #forexlifestyle",
    "126": "LeBron James became just the third player to reach 36,000 career points in the NBA as the Los Angeles Lakers beat the Houston Rockets 132-123 on Tuesday to end a five-game losing streak. We are witnesses to his greatness. G.O.A.T of his era. #PushLetsGo",
    "127": "Los Angeles Lakers forward LeBron James (@KingJames), Golden State Warriors gunner Stephen Curry (@StephenCurry30) and Brooklyn Nets star Kevin Durant (@KDTrey5) have a different battle among themselves off the court.\nhttps://t.co/yloR100CIO",
    "128": "Gotta know the rules to get those tacos.\n\n#LakeShow x @JackBox https://t.co/lkkEVypYhj",
    "129": "LeBron James declined to respond to an essay written by Lakers legend Kareem Abdul-Jabbar that criticized James for a social media post about COVID-19.\n\nhttps://t.co/rMsD3eb11Y",
    "130": "Good morning to everyone but especially to LeBron James and the Los Angeles Lakers.",
    "131": "The Los Angeles Lakers continue to tumble down the Western Conference table, sitting ninth in the Western Conference. 👀\n\nGet the latest Lakers vs Grizzlies game predictions, here! 👇\n\n#NBA #LakeShow \n\nhttps://t.co/ASLHvwvGZq",
    "132": "Consensus Line Move:\n2021-12-29 Los Angeles Lakers at Memphis Grizzlies from 225.50 to 227.00\nOver invested\n#NBA #sportsbettingadvice #ai #binaryoptions",
    "133": "GAMEDAY. BACK TO BACK.\n\n🏀 LOS ANGELES LAKERS 🆚 Memphis Grizzlies.\n\n🏟️: Fedex Forum.\n\n⏱️ 22:00 (🇦🇷/🇧🇷/🇺🇾/🇨🇱/🇵🇾)\n⏱️ 21:00 (🇧🇴/🇻🇪/ 🇩🇴/🇵🇷/🇨🇺)\n⏱️ 20:00 (🇨🇴/🇵🇪/🇪🇨/🇵🇦)\n⏱️ 19:00 (🇲🇽)\n⏱️ 02:00 (🇪🇸)\n\n💻/📱 NBA League Pass. https://t.co/qtupZ5G0Lg",
    "134": "LeBron James reaches 36,000 career points as Los Angeles Lakers beat the Houston Rockets https://t.co/IixKaFaC1E",
    "135": "Lots of familiar faces in attendance as the Los Angeles #Lakers defeated the Houston #Rockets to improve their record to 17-18. 🙄 https://t.co/XLkx5nojZu",
    "136": "Like him or not, he is one of the greatest basketball 🏀 players ever. LeBron James reaches 36,000 career points as Los Angeles Lakers beat the Houston Rockets https://t.co/OU0zBStTlK",
    "137": "LeBron James reaches 36,000 career points as Los Angeles Lakers beat the Houston Rockets https://t.co/tVE1Ved7Tc",
    "138": "LeBron James reaches 36,000 career points as Los Angeles Lakers beat the Houston Rockets https://t.co/9XVxmAKYRx",
    "139": "LeBron James reaches 36,000 career points as Los Angeles Lakers beat the Houston Rockets https://t.co/k7TaO9leH8 https://t.co/4aImhtbsnI",
    "140": "LeBron James reaches 36,000 career points as Los Angeles Lakers beat the Houston Rockets https://t.co/EcjKyo9N8V",
    "141": "@null LeBron James reaches 36,000 career points as Los Angeles Lakers beat the Houston  https://t.co/XuaFMBQTrt",
    "142": "@null LeBron James reaches 36,000 career points as Los Angeles Lakers beat the Houston  https://t.co/jemL32tBMs",
    "143": "LeBron James reaches 36,000 career points as Los Angeles Lakers beat the Houston Rockets https://t.co/mdx0dlx7wH #mustread #feedly",
    "144": "LeBron James reaches 36,000 career points as Los Angeles Lakers beat the Houston Rockets https://t.co/W5TiLjwpnX",
    "145": "Los Angeles Lakers star LeBron James got one step closer to becoming the NBA’s all-time leading scorer.  https://t.co/AdEtnygT2Z",
    "146": "LOS ANGELES LAKERS vs\nMEMPHIS GRIZZLIES, 9:00PM.",
    "147": "#NBA Big Odds!\n\n⏰ Thu,4:00 a.m\n\n🏀 Memphis Grizzlies vs Los Angeles Lakers\n\n⚪️ #Grizzlies have won their last 2 games. \n🟡 #Lakers have once in their last 6 games.\n\nCheza na M-Bet leo ushinde https://t.co/bYFGK4TIzM au Piga *798# https://t.co/AMN5Xaicw9",
    "148": "Memphis Grizzlies vs. Los Angeles Lakers Game Preview - @NotTheGolfer dives in to LeBron vs. Memphis Part Deux  https://t.co/GSEfds46e1 https://t.co/KPeyB2gTq7",
    "149": "LOS ANGELES LAKERS 132-123\nHOUSTON ROCKETS, Final.",
    "150": "@Lakers The Los Angeles Lakers Let The Houston Rockets Score 123 Points But I’m Supposed To Be Impressed Right? I Fell Asleep Around Either Halftime Or The Third Quarter And Woke Up To 4 Lakers Scoring Over 20+ Points And I’m Still Not Impressed Cause It’s The Rockets😂",
    "151": "L.A. Lakers 132 Houston 123\nDenver 89 Golden State 86\nSacramento 117 Oklahoma City 111\n\n*NHL* \nTampa Bay 5 Montreal 4 (overtime)\nSan Jose 8 Arizona 7 (shootout)\nVegas 6 Los Angeles 3\n\n@RompebancaDeporte  Unete a Telegram \nhttps://t.co/5b1Sf507M8",
    "152": "Los Angeles Lakers forward LeBron James said he had no response to NBA great Kareem Abdul-Jabbar, who criticized James for a social media post in which he appeared to question the difference between COVID-19 and the flu and common cold.\n\n https://t.co/yqNdQFkkZ2",
    "153": "Starting at center for not only the first time of his 19-year career, but for what he said was the first time in his life, #LeBronJames keyed a 132-123 victory for the Los Angeles #Lakers over the Houston Rockets.  🏀 #NBATwitter  https://t.co/XQRm5jASBL",
    "154": "Im gonna need this individual to start hooping. The Los Angeles Lakers needs you https://t.co/mAYbAmLXQD",
    "155": "NBA Leader: 27.4 PPG Los Angeles Lakers vs Houston Rockets Full Game Highlights | 2021-22 NBA Season… https://t.co/AwsOYS5ggj",
    "156": "LeBron James reaches 36,000 career points as Los Angeles Lakers beat the Houston Rockets\nhttps://t.co/ykeowS81sE",
    "157": "#LakeShow with 132 spot in houston? Lol keep it rolling in Memphis tonight! #losangeleslakers",
    "158": "Teams that lost customers the most money on DraftKings included the Los Angeles Lakers, Seattle Seahawks, Buffalo Bills and Clemson in college football https://t.co/tvViSbvsXW",
    "159": "1 - LeBron James reaches 36,000 career points as Los Angeles Lakers beat the Houston Rockets...\n... #overallnews #lebron #james #reaches #career #points https://t.co/jggRVspKLh",
    "160": "🏀 Los Angeles Lakers (@Lakers) #LakeShow\n🆚 W 132-123 @ Houston #Rockets #LALvsHOU\n⏩ Memphis Grizzlies #GrindCity #LALvsMEM\n✈️ N649DL | DAL8929 | B752\n🛫 HOU - 11:40 pm CT\n🛬 MEM - 12:45 am CT\n📡 Tracking: https://t.co/N9OnkaPULD https://t.co/8A0LJzrxn5",
    "161": "Isaiah Thomas had a few good moments with the Los Angeles Lakers but the team has decided not to bring him back for a second 10-day stint. #long https://t.co/x4RYVrduC3 https://t.co/6DuIesyfGu",
    "162": "NEWS: LeBron James reaches 36,000 career points as Los Angeles Lakers beat the Houston Rockets https://t.co/hZwD4zaVkl Via @CNN https://t.co/gBisN3yYmU",
    "163": "LeBron James reaches 36,000 career points as Los Angeles Lakers beat the Houston Rockets\nhttps://t.co/tv18Sxuy8P",
    "164": "LeBron James reaches 36,000 career points as Los Angeles Lakers beat the Houston Rockets – NBA News https://t.co/su4XSc168j",
    "165": "LeBron James reaches 36,000 career points as Los Angeles Lakers beat the Houston Rockets – Lakers News https://t.co/H0BUbhMRZM",
    "166": "LeBron James reaches 36,000 career points as Los Angeles Lakers beat the Houston Rockets https://t.co/HasFj4IG6g",
    "167": "LeBron James reaches 36,000 career points as Los Angeles Lakers beat the Houston Rockets – https://t.co/wamLo961wh",
    "168": "LeBron James reaches 36,000 career points as Los Angeles Lakers beat the Houston Rockets\n\nhttps://t.co/JiUXwxjPWi",
    "169": "Minnesota Timberwolves star Karl-Anthony Towns said Los Angeles Lakers star Russell Westbrook chases stats while praising his play.  https://t.co/yxNID4Ct6a",
    "170": "Los Angeles Lakers vs Houston Rockets Full Game Highlights | 2021-22 NBA... https://t.co/mAXSMOhEGe @YouTubeより",
    "171": "LeBron James reaches 36,000 career points as Los Angeles ... - https://52.6.110.3/lebron-james-reaches-36000-career-points-as-los-angeles-lakers-beat-the-houston-rockets/ #VIXC #LatestComments #Commentary #eWeatherNews https://t.co/te7PaBwTnS",
    "172": "Magic Johnson Signed Los Angeles Lakers Jersey (Beckett COA) 5xNBA Champion https://t.co/oMhNVzH0u2 eBay https://t.co/GfmdNB9dE3",
    "173": "LeBron James reaches 36,000 career points as Los Angeles Lakers beat the Houston Rockets",
    "174": "LeBron James reaches 36,000 career points as Los Angeles Lakers beat the Houston Rockets https://t.co/85yDLzPoNF",
    "175": "LeBron James reaches 36,000 career points as Los Angeles Lakers beat the Houston Rockets https://t.co/bOCLSNq1ca",
    "176": "#LosAngelesLakers: LeBron James praises Stanley Johnson after promising debut. https://t.co/vqw4PDu1uH",
    "177": "NBA: LeBron James scores 32 points as Los Angeles Lakers beat Houston Rockets https://t.co/91WLS4x0Xc",
    "178": "HIGHLIGHTS: Los Angeles Lakers @ Houston Rockets https://t.co/LHuHmmF4MS @YouTube",
    "179": "Los Angeles Lakers vs Houston Rockets - Full Game Highlights | December ... https://t.co/O2JzO9TnLC @YouTube",
    "180": "LEBRON ISN'T HUMAN! Los Angeles Lakers vs Houston Rockets Final Minutes!... https://t.co/N9kipTI6ts @YouTube",
    "181": "Los Angeles Lakers @ Memphis Grizzlies. Team Stats This Season: https://t.co/WZb1rmY34O",
    "182": "Los Angeles Lakers vs Houston Rockets Full Game Highlights | Dec 28, 202... https://t.co/c4VNvXsO5T @YouTube",
    "183": "Lakers' LeBron James declines to respond to Kareem Abdul-Jabbar's criticism https://t.co/rMsD3esCqy",
    "184": "Los Angeles Lakers vs Houston Rockets Full Game Highlights | December 28... https://t.co/GV5Ogb6o9g @YouTube",
    "185": "Los Angeles Lakers vs. Houston Rockets Full Highlights 4th QTR | Decembe... https://t.co/xEeMu7c8jC @YouTube",
    "186": "Los Angeles Lakers vs. Houston Rockets Full Highlights 3rd QTR | Decembe... https://t.co/WGaoz87sK7 @YouTube",
    "187": "Los Angeles Lakers vs. Houston Rockets Full Highlights 2nd QTR | Decembe... https://t.co/d3Q3DbLIbi @YouTube",
    "188": "Los Angeles Lakers vs. Houston Rockets Full Highlights 1st QTR | Decembe... https://t.co/xUkjWW0wLD @YouTube",
    "189": "Los Angeles Lakers Last Game: W https://t.co/pRhMx8DwCD",
    "190": "Los Angeles Lakers vs. Houston Rockets Full Game Highlights | December 2... https://t.co/38Fwd2RArj @YouTube",
    "191": "Memphis Grizzlies vs Los Angeles Lakers Predictions &amp; Odds\n\nhttps://t.co/ZBtQl1F9Gn\n\n#NBA #NBAPicks #bettingtwitter https://t.co/KEeiVtQrhI",
    "192": "LeBron James' 32-point triple-twofold leads Los Angeles Lakers past Houston Rockets\nFor more article : https://t.co/Es1EHFEoyB\n#LeBronJames #32pointtriple https://t.co/WjXPCORWdg",
    "193": "LeBron James (32p/11r/11a) and Russell Westbrook (24p/12r/10a) posted triple-doubles for the Los Angeles #Lakers, who snapped a five-game skid with a 132-123 road win over the host Houston #Rockets. #NBA https://t.co/TKCPlsyrpq",
    "194": "Memphis Grizzlies vs Los Angeles Lakers - NBA Prediction https://t.co/j1ue7JJRhr",
    "195": "LeBron James, Russell Westbrook triple-doubles propel Los Angeles Lakers over Houston Rockets https://t.co/ZOjo7VLUV3",
    "196": "LeBron James plays big with a triple-double and the Lakers end losing streak https://t.co/HU06lHYlzf",
    "197": "The Los Angeles Lakers look to break five-game losing streak as they take on the Houston Rockets / Twitter https://t.co/OynPwRyFPL",
    "198": "Los Angeles Lakers vs. Houston Rockets Full Game Highlights | December 2... https://t.co/10FE2eyjhU @YouTubeより",
    "199": "MILESTONE FOR THE NBA SUPERSTARS 🥳🏀\n\nLos Angeles Lakers' LeBron James accumulated his 36,000th and counting career points, the third player in NBA history to achieve it behind legends Kareem Abdul-Jabbar and Karl Malone. https://t.co/noI7CDAPvg",
    "200": "🏀NBA🏀 #NBA \n🏀Saison régulière🏀\n\nOrlando Magic - Milwaukee Bucks\nMiami Heat - Washington Wizards\nToronto Raptors - Philadelphia 76ers\nHouston Rockets- Los Angeles Lakers\nMinnesota Timberwolves - New York Knicks\nNew Orleans Pelicans- Cleveland Cavaliers",
    "201": "Memphis Grizzlies vs. Los Angeles Lakers\n NBA LIVE \n📲 :  https://t.co/CMIJDhy490\nToday @ 7:00 pm CST\nFree For Subscription",
    "202": "NBA: LeBron James scores 32 points as Los Angeles Lakers beat Houston Rockets https://t.co/LK7RKrE2lC",
    "203": "\"The Los Angeles Lakers look to break five-game losing streak as they take on the Houston Rockets\" #LALvsHOU https://t.co/2fe8bFn2fc",
    "204": "NBA: LeBron James scores 32 points as Los Angeles Lakers beat Houston Rockets – ZellaNews https://t.co/jCa5LyYfmO",
    "205": "LeBron James (@KingJames) notched a 32-point triple-double on Tuesday to help the Los Angeles Lakers snap a five-game National Basketball Association (@NBA) skid with a 132-123 victory over the Houston Rockets.\n\nREAD MORE: https://t.co/yVekRg27L8\n\n#NBA \n#DailyTribune https://t.co/E5v1fG1xmf",
    "206": "LeBron James (@KingJames) notched a 32-point triple-double on Tuesday to help the Los Angeles Lakers snap a five-game National Basketball Association (@NBA) skid with a 132-123 victory over the Houston Rockets.\n\nREAD MORE: https://t.co/TQMGArHI09\n\n#NBA \n#DailyTribune https://t.co/P5Vu6rcGn6",
    "207": "LeBron James, Russell Westbrook Triple-doubles Propel Los Angeles Lakers Over Houston Rockets https://t.co/O2T52sglqD",
    "208": "LeBron James, Russell Westbrook triple-doubles propel Los Angeles Lakers over Houston Rockets https://t.co/eN2poj0eEE",
    "209": "LeBron James *32-11-11* and the Los Angeles Lakers beat Jalen Green *24-2-4* and the Houston Rockets 132-123 (2021-12-28)",
    "210": "James Worthy reacts to Lakers’ win over Rockets #HoustonRockets #JamesWorthy #LosAngelesLakers https://t.co/c9pRa3XP5Z",
    "211": "LeBron James, Russell Westbrook Triple-doubles Propel Los Angeles Lakers Over Houston Rockets #basketballnews #lalakers #LeBronJames #losangeleslakers #nba https://t.co/vg30PasH8d\nhttps://t.co/vg30PasH8d",
    "212": "ALERT: New high roller bet posted!\nA bet has been placed for $5,009.56 on Memphis Grizzlies - Los Angeles Lakers to win $9,417.97.\nTo view this bet or copy it https://t.co/eZwKIZoIh3 https://t.co/jnxGzynkhV",
    "213": "LeBron James notched a 32-point triple-double on Tuesday to help the Los Angeles Lakers snap a five-game NBA skid with a 132-123 victory over the Houston Rockets\n\n#NBA #Lakers\n\nhttps://t.co/EpvY2nK12u",
    "214": "Los Angeles Lakers guard Russell Westbrook voiced his frustration about his playstyle.  https://t.co/7HVy5ssEmb",
    "215": "#RT @NGSCSports: #RT @NGSCSports: #RT @NGSCSports: #RT @NGSCSports: #RT @NGSCSports: #RT @NGSCSports: #RT @NGSCSports: #RT @NGSCSports: Los Angeles Lakers: Is it Time to Make a Move? @NGSCSports @NBA @Lakers \n\nhttps://t.co/rxvmbgXVyq",
    "216": "Los Angeles Lakers (17-18, seventh in the Western Conference) vs. Memphis Grizzlies (21-14, fourth in the Western Conference) https://t.co/EeiGwogF4C",
    "217": "NBA Basketball Game Betting Picks Simulator: 8:10 PM ET - Los Angeles Lakers vs. Memphis Grizzlies - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/JeR0ho1mSl #nba #sportsbetting #freepicks #cappertek",
    "218": "LeBron James, Russell Westbrook Triple-doubles Propel Los Angeles Lakers Over Houston Rockets https://t.co/hl43wKixEU",
    "219": "LeBron James makes first start at center as Los Angeles Lakers beat Houston Rockets to snap skid https://t.co/zcXr3FEOjm",
    "220": "Fixtures and Results In December 2021 by Los Angeles Lakers\n\n17/12 ✈️ Timberwolves : 110-92 (L)\n19/12 ✈️ Bulls : 115-110 (L)\n21/12 🏠 Suns : 90-108 (L)\n23/12 🏠 Spurs : 110-138 (L)\n25/12 🏠 Nets : 115-122 (L)\n28/12 ✈️ Rockets : 123-132 (W)",
    "221": "Los Angeles Lakers forward LeBron James said he had no response to NBA great Kareem Abdul-Jabbar, who criticised James for a social media post in which he appeared to question the difference between COVID-19 and the flu and common cold. https://t.co/p6qup2FBxL",
    "222": "#LosAngelesLakers: James, Westbrook have triple-doubles, Lakers&amp;#92' skid ends at 5. https://t.co/X4boTZHNva",
    "223": "NBA roundup: Los Angeles Lakers get two triple-doubles, top Houston Rockets https://t.co/aG0pvhv30F",
    "224": "LeBron James makes first start at center as Los Angeles Lakers beat Houston Rockets to snap skid - via @ESPN App.  #NBA.    #Lakers.    https://t.co/pmbNCTkWbr",
    "225": "Los Angeles Lakers (17-18, seventh in the Western Conference) vs. Memphis Grizzlies (21-14, fourth in the Western Conference) https://t.co/5r5NiIjkm9",
    "226": "Los Angeles Lakers vs Houston Rockets Full Game Highlights | Dec 28, 202... https://t.co/wkw1NGwTwI via @YouTube",
    "227": "The Los Angeles Lakers https://t.co/5VChzy7JDM",
    "228": "@TheHoopCentral Los Angeles Lakers",
    "229": "▶ Houston Rockets (10-25) 123:132 Los Angeles Lakers \n🧮 Daniel Theis: DNP.\n\nhttps://t.co/jKC0Pqoh5b",
    "230": "#RT @NGSCSports: #RT @NGSCSports: #RT @NGSCSports: #RT @NGSCSports: #RT @NGSCSports: #RT @NGSCSports: #RT @NGSCSports: #RT @NGSCSports: Los Angeles Lakers: Is it Time to Make a Move? @NGSCSports @NBA @Lakers \n\nhttps://t.co/yTpq7dgteO",
    "231": "@MukanzaShamirah The Los Angeles Lakers? Your winning team https://t.co/7GvymD0L0u",
    "232": "The young duo of Jalen Green and Kevin Porter Jr shines against Los Angeles Lakers. https://t.co/KzPQPB1HjA",
    "233": "Happy 20th birthday to my beloved sister Isabella today!! 💜🥳\nFor my sister’s birthday today, I am giving the gift of this women’s Los Angeles, California Lakers sweatshirt. \nWe have matching attires, bc I wear the men’s Lakers clothing apparel. 🏀💜💛\nI love you, sis. 💘 https://t.co/jvTPKXGvTA",
    "234": "LeBron James’ 32-point triple-double leads Los Angeles Lakers past Houston Rockets https://t.co/Qjhnf5QsVd",
    "235": "#RT @NGSCSports: #RT @NGSCSports: #RT @NGSCSports: #RT @NGSCSports: #RT @NGSCSports: #RT @NGSCSports: #RT @NGSCSports: #RT @NGSCSports: Los Angeles Lakers: Is it Time to Make a Move? @NGSCSports @NBA @Lakers \n\nhttps://t.co/r9KiO15dD0",
    "236": "Los Angeles Lakers vs Houston Rockets Full Game Replay 2021 Dec 28 NBA Replay HD\nhttps://t.co/b3saKy9u6G https://t.co/UlRLYJhD6C",
    "237": "36K for The King 👑\n\nCatch the reply of the game between the Los Angeles Lakers and Houston Rockets TONIGHT at 6 p.m. on NBA TV Philippines! \n\n#NBA75 #AlwaysAFan https://t.co/K2DAqI79rJ",
    "238": "How did LeBron James and the Los Angeles Lakers snap their five-game losing streak? @KainaniStevens gets @KamBrothers, @woodleysean, @AmNotEvan and more of our Locked On NBA hosts to give you all the info from the night's NBA action on Locked On NOW!\n\nhttps://t.co/4vinU01sbf https://t.co/WLKEPEfzt1",
    "239": "Houston Rockets: LeBron James makes first start at center as Los Angeles Lakers beat Houston Rockets:  to snap skid https://t.co/0KK5Lp5d8u",
    "240": "Congratulations to @kingjames of the Los Angeles Lakers on becoming the third player in NBA history to eclipse 36,000 points scored 👑\n\n#lakers #lakersnation #nba \n#basketball🏀 #basketballfans \n\nGLBSports https://t.co/RTYyzoWkJ8",
    "241": "LeBron James notched a 32-point triple-double on Tuesday to help the Los Angeles Lakers snap a five-game NBA skid with a 132-123 victory over the Houston Rockets. | @manilabulletin\n\nhttps://t.co/Fjr9eZz1Qx",
    "242": "LeBron James makes first start at center as Los Angeles Lakers beat Houston Rockets to snap skid - ESPN https://t.co/uoP5X1RNm9 https://t.co/Li1Tc5STVj",
    "243": "The Memphis Grizzlies intend to continue in the fourth position in the Western Conference and for that they will have to beat the Los Angeles Lakers, whose season is being well below expectations. See more: https://t.co/nRad2oFxFf\n.\n.\n#PNXBET\n#NBA\n#Lakers\n#Grizzlies https://t.co/pWBbq9n8uq",
    "244": "Lakers' LeBron James declines to respond to Kareem Abdul-Jabbar's c... (Los Angeles Times)\n\nLeBron James declined to respond to an essay written by NBA Hall of Famer and Lakers legend ...\n\nAdd your highlights:\nhttps://t.co/PABLcQxLQG\n #LA_Lakers",
    "245": "BREAKING: The CDC has just announced that Los Angeles Lakers PG Russell Westbrook needs to get his entire shit together.",
    "246": "LeBron James posted a 30-point triple-double and paced four 20-point scorers for the Los Angeles Lakers, who snapped a five-game skid with a 132-123 road win over the host Houston Rockets on Tuesday. https://t.co/vaZa5xQQ46",
    "247": "LeBron James makes first start at center as Los Angeles Lakers beat Houston Rockets to snap skid - via @ESPN App https://t.co/YnSYslp6cD",
    "248": "@LakersNation LEBRON was for he loved his Celvand hometown which was the Cavs for it was that he wanted to win one for his loving team and now you can find on The Troopers of the Los Angeles Lakers of that time of Shoots from the Yellow Gel Flesh lol",
    "249": "Los Angeles Lakers @ Houston Rockets Four Factors (12/28/2021)\n\nVia Cleaning the Glass https://t.co/dpxHV6Gvcm",
    "250": "[Game OTD Thread] Los Angeles Lakers (17-18) @ Memphis Grizzlies (21-14) - December 29, 2021, 07:00 PM",
    "251": "Detroit Pistons - New York Knicks\nIndiana Pacers - Charlotte Hornets\nMemphis Grizzlies - Los Angeles Lakers\nChicago Bulls - Atlanta Hawks\nSan Antonio Spurs - Miami Heat\nPortland Trail Blazers - Utah Jazz\n\nBet slip link: https://t.co/ss86CSZXSX https://t.co/YppujqMHYn",
    "252": "I decided to to be a fan of the Los Angeles Lakers who knows how to win games shame on you SteHitler Curfraud and JonaBust KumingFraud",
    "253": "#LosAngelesLakers: Lakers player grades: Four Lakers score over 24 points in win vs. Rockets. https://t.co/XkJFiizCao",
    "254": "I am proudly a part of our Lakers Nation family.\n💜💛\nLos Angeles, California is my home city.\n♥️ https://t.co/uZARFGPWsW",
    "255": "(Reuters) - LeBron James posted a 30-point triple-double and paced four 20-point scorers for the Los Angeles Lakers, who snapped a five-game skid with a 132-123 road win over the host Houston Rockets on Tuesday. https://t.co/Pkhi5hyzPW",
    "256": "It’s been difficult to sort who is in health and safety protocols lately, so LeBron Wire has you covered for the Los Angeles Lakers.  https://t.co/nEkz7bz72N",
    "257": "LeBron James’ triple double (32 Points, 11 Assists &amp; 11 Rebounds) guided the Los Angeles Lakers to a 132-123 win over the Houston Rockets #SSBasketball",
    "258": "LeBron James posted a 30-point triple-double and paced four 20-point scorers for the Los Angeles Lakers, who snapped a five-game skid with a 132-123 road win over the Houston Rockets.\n\nhttps://t.co/DivJwQpO8F",
    "259": "Check out Magic Johnson Los Angeles Lakers NBA Engraved 12\"x15\" Plaque https://t.co/Oj05aiZF4W @eBay",
    "260": "Congratulations to misha_lemonwood who moved up 3154 spots to take #177 on the Los Angeles Lakers team leaderboard.\n\nhttps://t.co/7jbi1baNWE",
    "261": "Congratulations to woollytrunkdunk13 who moved up 2 spots to take #37 on the Los Angeles Lakers team leaderboard.\n\nhttps://t.co/7jbi1baNWE",
    "262": "Wed, 29th Dec: #HoustonRockets vs #LosAngelesLakers - ODD @ 2.09\nMore details on: https://t.co/PE5pfUqfic\n#baskettips #basketprediction #basketballbets #nba #usabasket",
    "263": "“This is pissing me off. Fuuuuuuuuuuuuuuuck” – a reporter on Lakers’ postgame zoom #LosAngelesLakers https://t.co/7WRonaJi6V",
    "264": "📣 New Podcast! \"Shoot the J: The state of LA Basketball, Knicks, Nets, and more\" on @Spreaker #brooklynnets #cancellations #losangeleslakers #nba #newyorkknicks https://t.co/GSVzueeJVw",
    "265": "LeBron James and Russell Westbrook BOTH put up triple-doubles in the Los Angeles Lakers win 🔥\n\n🏀 LeBron: 32 Pts, 11 Reb, 11 Ast\n🏀 Russ: 24 Pts, 12 Reb, 10 Ast https://t.co/f2VgvZfku1",
    "266": "NBA Basketball Game Betting Picks Simulator: 12/29/2021 8:10 PM ET - Los Angeles Lakers vs. Memphis Grizzlies - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/JeR0ho1mSl #nba #sportsbetting #freepicks #cappertek",
    "267": "Lakers With Full Team Effort to End 5-Game Skid | Los Angeles Lakers (Los Angeles Lakers)\n\nFollowing their Christmas Day loss to Brooklyn, the Lakers (17-18) snapped their longest los...\n\nAdd your highlights:\nhttps://t.co/fRu1RY5EzT\n #LA_Lakers",
    "268": "👍🏀  Los Angeles Lakers vs Houston Rockets Full Game Highlights | December 28... https://t.co/tIiu6hHTQR via @YouTube",
    "269": "No Context Los Angeles Lakers https://t.co/YaOJZNpmkv",
    "270": "Congratulations to LeBron James of the Los Angeles Lakers on becoming the third player in NBA history to eclipse 36,000 points scored 👑 https://t.co/BXOCdDkya9",
    "271": "When it comes to HBO’s upcoming series about the Los Angeles Lakers’ 1980s glory years, Magic Johnson is going to pass https://t.co/rL9kR8bvKo",
    "272": "Lakers set to play ‘a ton of small-ball’ moving forward, says interim head coach #DavidFizdale #LosAngelesLakers https://t.co/GyUdIhoReK",
    "273": "The Los Angeles Lakers won 🙌",
    "274": "Mookie &amp; Dream on deck for the #LakersWin https://t.co/khKBAyPIOS",
    "275": "Pool Report on the Overturned Goaltending Call in the Fourth Quarter of Tonight’s Los Angeles Lakers at Houston Rockets Game https://t.co/Xt9wOKFDoQ",
    "276": "Pool Report on the Overturned Goaltending Call in the Fourth Quarter of Tonight’s Los Angeles Lakers at Houston Rockets Game\n\nhttps://t.co/kWoqZ7NvXk",
    "277": "Los Angeles Lakers consigue ganar a Houston Rockets (123-132): https://t.co/gaDjt4hp7Z",
    "278": "I suspect Stanley Johnson has played his last game for the South Bay Lakers. I bet LA Lakers get rid of someone and keep him around. Started in just his second game with Los Angeles. Former lottery pick who is still just 25. The wing defender Lakers needed.",
    "279": "Houston Rockets Highlights vs Los Angeles Lakers #NBA12282021 https://t.co/FWDXfMtThw",
    "280": "New @DreamShakeSBN: Jalen Green, Kevin Porter Jr. and Christian Wood scored a total of 68 points for the Houston #Rockets, but it was not enough to overcome LeBron James and the Los Angeles #Lakers. \n\nhttps://t.co/WxK1OGDQcX",
    "281": "THREAD: RESULTADOS 28/12\n\nEncerrado:\n\nHouston Rockets (10-25) 123 x 132 (17-18) Los Angeles Lakers\n\nLAL 📊\nLeBron James: 32PTS/11REB/11AST/1STL/2BLK\nRussell Westbrook: 24PTS/12REB/10AST/1STL/2BLK\n\nHOU 📊\nJalen Green: 24PTS/3REB/4AST/2STL\nChristian Wood: 22PTS/6REB/3AST/3STL/1BLK https://t.co/xpQumEkfUa",
    "282": "HOUSTON (AP) — LeBron James and Russell Westbrook both had triple-doubles and the Los Angeles Lakers snapped a season-high, five-game skid with a 132-123 victory over the Houston Rockets on Tuesday night. https://t.co/eiyAsEVPJw",
    "283": "LeBron James plays big with a triple-double and the Lakers end losi... (Los Angeles Times)\n\nNever in LeBron James' career has it looked quite like this.\n\nAdd your highlights:\nhttps://t.co/hxQ4hKzAiG\n #LA_Lakers",
    "284": "@nsitto2 @donaldvmitch more than jus their talent… it’s the culture. culture wins you games. you see that with phoenix. talent can’t jus win you a championship, as you have seen in los angeles with the lakers. sure talent wise he’s expendable but you can’t break this cultute we have grown.",
    "285": "Memphis Grizzlies vs Los Angeles Lakers: Predictions, and how to watch or live stream free 2021/2022 NBA regular season in the US https://t.co/UWXDAamqJI",
    "286": "DOUBLE TRIPLE-DOUBLE 💯\n\nLeBron James (32-11-11) and Russell Westbrook (24-12-10) posted triple-doubles to lift the Lakers past the Rockets and snap their 5-game losing streak. \n\n📷 Los Angeles Lakers\n\n#NBA75 #AlwaysAFan https://t.co/wXFl6zidVE",
    "287": "David Fizdale compares Malik Monk to Lou Williams after 25-point game vs Rockets #DavidFizdale #LosAngelesLakers #LouWilliams #MalikMonk https://t.co/JIrTxCapLZ",
    "288": "HOUSTON (AP) — LeBron James and Russell Westbrook both had triple-doubles and the Los Angeles Lakers snapped a season-high, five-game skid with a 132-123 victory over the Houston Rockets on Tuesday night. https://t.co/oLNf0SNI3B",
    "289": "LeBron James officially hits 36k career points after his 32-point, triple double performance through a 132-123 Los Angeles Lakers win against the Houston Rockets. | @explained_ph https://t.co/k7t9pakDvW",
    "290": "LeBron James puts on a show in a big win over the Houston Rockets that ends a 5-game slide for the Los Angeles Lakers. \n\n#lakeshow #nba #NBA75 https://t.co/G40rSYBkCC",
    "291": "Our King 💜💛\n\n@KingJames x #NBAAllStar https://t.co/BxG2JIqagB",
    "292": "The Los Angeles Lakers lost the final game at Staples Center and now they lose the 1st game at Cryptocom Arena 122-115 to the Brooklyn Nets\n@Lakers @cryptocomarena \nhttps://t.co/mz2ppPvBJV",
    "293": "Here is how the Los Angeles Lakers graded individually in the road win against the Houston Rockets.  https://t.co/VDk8nchs0i",
    "294": "ENCERRADO: o Los Angeles Lakers (17-18), fora de casa, venceu o Houston Rockets (10-25) por 132 a 123. #LakeShow \n\nLEBRON: 32PTS, 11REB &amp; 11AST.\nWestbrook: 24pts, 12reb &amp; 10ast.\n\nPorter Jr: 22pts, 5reb &amp; 9ast.\nGreen: 24pts, 2reb &amp; 4ast.\n\n#NBA75 https://t.co/2NWcAxtJVe",
    "295": "All hail Los Angeles Lakers my Basketball team. Prayers answered. We won tonight game. More wins coming to Lakers way I pray. As above so below.  So mote it be.",
    "296": "A 36 year old man should not be carrying the Los Angeles Lakers",
    "297": "We should file a class action lawsuit against the Los Angeles Lakers if they throw him at the 5 against that behemoth.. https://t.co/5HaWt3HGre",
    "298": "Congratulations to the Los Angeles Lakers 👏👏",
    "299": "🤖 #SofiAlert \n📅 28-12-2021 \nLos Angeles Lakers - Houston Rockets \n🛋 4.3/5 Sofis https://t.co/0SvLx0gHtN",
    "300": "Fantastic Four #LakersWin https://t.co/yScwzt1kPv",
    "301": "Check out this listing I just added to my #Poshmark closet: Los Angeles Lakers Men's Pullover 2020 Champions Hoodie Size XXL Black and Yello. https://t.co/5bHcEj5247 #shopmycloset @poshmarkapp",
    "302": "The lakers started in 1947, when businessman Ben Berger and entertainment mogul Morris Chalfen, both of Minneapolis, purchased the disbanded Detroit Gems of the National Basketball League for $15,000. The team would relocate to Los Angeles before the start of the 1960-61 season. https://t.co/ayWAdfhwtF",
    "303": "Houston Rockets 123 (Jalen Green 24 pts) Los Angeles Lakers 132 (Lebron James 32 pts, 11 rebs, 11 asists, Russell WestBrook 24 pts, 12 rebs, 10 asists), Orlando Magic 110 (Franz Wagner 38 pts) Wendell Carter 19 pts, 10 rebs) Milwaukee Bucks 127 (Jrue Holiday 18 pts, 10 asists)",
    "304": "Losing streak is over @lakers win!!! @ Los Angeles, California https://t.co/y0or1U7NDG",
    "305": "\"The Los Angeles Lakers look to break five-game losing streak as they take on the Houston Rockets\" #LALvsHOU https://t.co/852ODstZKQ\nLA Lakers defeat HTOWN Rockets",
    "306": "Lakers snap their 5-game losing streak #LosAngelesLakers https://t.co/nPxK8ew0UX",
    "307": "If i make the nba, I WILL NEVER PLAY FOR THE LOS ANGELES LAKERS.",
    "308": "Offense in overdrive. #LakersWin https://t.co/Wn4Q4VXOhU",
    "309": "Russell Westbrook - Los Angeles Lakers\n24 PTS\n12 RBD\n10 AST\n2 STL\n7 TO\n[FD(52.4) DK(60)]",
    "310": "Avery Bradley - Los Angeles Lakers\n14 PTS\n4 RBD\n2 STL\n[FD(24.8) DK(24)]",
    "311": "LeBron James - Los Angeles Lakers\n32 PTS\n11 RBD\n11 AST\n2 BK\n1 STL\n3 TO\n[FD(67.7) DK(72.75)]",
    "312": "Stanley Johnson - Los Angeles Lakers\n9 PTS\n5 RBD\n2 AST\n1 STL\n[FD(21) DK(20.25)]",
    "313": "LAAAAAAAAAAAAAAAAKKKKKKKKKKKKKKKEEEEEEEEEEEEEEERRRRRRRRRRRRRRSSSSSSSSSSSS WIIIIIIIIIIIIIIIIIIIINNNNNNNNNNNN\nLOS ANGELES LAKERS 132 X 123 HOUSTON ROCKETS",
    "314": "#NBA | FULL-TIME!\nHouston Rockets 123 - 132 Los Angeles Lakers\nFor more games, visit our site! https://t.co/CSFjqJlk2K",
    "315": "@Lakers @russwest44 @KingJames Extend LeBron James to a lifetime contract deal with the Los Angeles Lakers",
    "316": "EVERYBODY LOVES THE LOS ANGELES LAKERS WINNING",
    "317": "@RealSkipBayless @ShannonSharpe What are your thoughts on the Los Angeles Lakers tonight? Just asking for a friend.",
    "318": "The Los Angeles Lakers snap their 5-game losing streak after beating the Houston Rockets! #NBA75\n\nVisit https://t.co/K9jJDOXjil for other updates. https://t.co/7p77VgGsMb",
    "319": "Los Angeles Lakers 17-18",
    "320": "#NBA | FULL-TIME!\nHouston Rockets 123 - 132 Los Angeles Lakers\nFor more games, visit our site! https://t.co/BAfnnYKpxG",
    "321": "🏀 Final Score 🏀\nLos Angeles Lakers 132 - 123 Houston Rockets\n\nJames 72.8 DK, 67.7 FD\nWestbrook 60.0 DK, 52.4 FD\nPorter Jr. 46.3 DK, 43.5 FD\n\nhttps://t.co/IIuYCTQkL5",
    "322": "los angeles lakers: o time do triplo duplo\n\nlebron 🤝 broodie. | #lakeshow\n\n https://t.co/kMkKuQEUf0",
    "323": "The Lakers finally get back in the win column with a 132-123 victory over the Rockets.\n\nLeBron James (32 PTS, 11 REB and 11 AST), Russell Westbrook (24 PTS, 12 REB and 10 AST) and Carmelo Anthony (24 PTS, 9 REB) carry the load for Los Angeles tonight.",
    "324": "@vedant_iyer27 the Los Angeles lakers are winning the nba championship 🙏🙏🙏",
    "325": "🚨 UPDATE: Russell Westbrook - Los Angeles Lakers has a Triple Double\n23.0 4th\n22 PTS\n12 RBD\n10 AST\n2 STL\n[FD(50.4) DK(58)]",
    "326": "🚨 UPDATE: LeBron James - Los Angeles Lakers has a Triple Double\n23.0 4th\n32 PTS\n10 RBD\n11 AST\n2 BK\n1 STL\n[FD(66.5) DK(71.5)]",
    "327": "Double Triple-Double https://t.co/G6fatyVhbi",
    "328": "Russ just shut up everyone posting that he can’t play with the Lakers.  Nothing like some @latimes inspiration.",
    "329": "@ShamsCharania @TheAthletic @Stadium who else saw los angeles and immediately thought it was the lakers💀",
    "330": "LEBRON",
    "331": "Sad sad day for Los Angeles Lakers man I refuse to call them the LakeShow until they fix this shyt is sick and overall bad for the game smh",
    "332": "Houston Rockets vs Los Angeles Lakers was on Spectrum SportsNet. Reporter is Mike Trudell.  For more details see https://t.co/0nm2Dnui4S #HoustonRockets #LosAngelesLakers #SpectrumSportsNet",
    "333": "I just placed one $500 bet on Los Angeles Lakers vs. Houston Rockets on 12/28/21 @ U252.5 (-105) with 5:35 left in the game.",
    "334": "Los Angeles Lakers basketball https://t.co/JftbLkSICd",
    "335": "@AndersonNelfred @casualtakeking Before Wizards and Lakers completed a trade Thursday night sending Russell Westbrook to Los Angeles for three players and a first-round pick in the 2021 NBA Draft, the star guard met with LeBron James and Anthony Davis to discuss such a possibility, according to the LA Times.",
    "336": "Seven Grizzlies players out for Wednesday’s clash with Lakers #LosAngelesLakers #MemphisGrizzlies https://t.co/b66xD3UwdR",
    "337": "🚨 UPDATE: LeBron James - Los Angeles Lakers has a Double Double\n7:37 4th\n20 PTS\n6 RBD\n10 AST\n1 BK\n1 STL\n[FD(46.2) DK(48.5)]",
    "338": "This perfectly sums up your 2021 Los Angeles Lakers https://t.co/RcwdFZtuNP",
    "339": "went to the restroom with a 11 point lead\ncame back with a 3 point lead\n\nstory of the 2021-2022 Los Angeles Lakers",
    "340": "los angeles lakers. https://t.co/glUvP8Vy9O",
    "341": "The Atlanta Hawks have signed a forward from the Los Angeles Lakers’ G League team.  https://t.co/e6BnjBQwJo",
    "342": "Cotton Bowl 2021: Cincinnati Bearcats CB Coby Bryant honoring Los Angeles Lakers legend Kobe Brya... - via @ESPN App https://t.co/sUGp9P2QK4",
    "343": "los angeles lakers 21-22. https://t.co/iiQb7gwLAN",
    "344": "One quarter to determine it. \n\n@AhmadMonk: 21 pts, 2 blk\n@russwest44: 20 pts, 11 reb\n@KingJames: 18 pts, 8 ast\n@carmeloanthony: 17 pts, 7 reb https://t.co/46iLxcRnE8",
    "345": "Los Angeles Lakers needs to keep the lead, can't keep letting em catch up 🤦",
    "346": "The Los Angeles Lakers don’t own their first round pick for the 2022 NBA Draft.",
    "347": "ALERT: New high roller bet posted!\nA bet has been placed for $5,004.79 on Houston Rockets - Los Angeles Lakers to win $8,758.39.\nTo view this bet or copy it https://t.co/M6xOxXduS0 https://t.co/IeA4m8HdK5",
    "348": "Live Stream Free 🏀\n\nWatch via 🔴&gt;&gt; @JayJayPeace2\nWatch via 🔴&gt;&gt; @JayJayPeace2 \n\nLos Angeles Lakers vs Rockets \nBucks vs Magic\nHeat vs Wizards\nRaptors vs Sixers (76ers)\nPelicans v Cavaliers\nTimberwolves vs Knicks\nGolden State Warriors vs Nuggets \nKings vs Thunder\n!!\nNBA Streaming",
    "349": "December 28, 1979: Boston #Celtics superstar F Larry Bird and Los Angeles #Lakers superstar G Magic Johnson faced each other for the 1st time in their historic NBA careers that began an all-time NBA rivalry\nhttps://t.co/4REgZJKkVN",
    "350": "SPIKE 🏐\n\n(📺: @SpectrumSN) https://t.co/Gr6Xz8M7tP",
    "351": "#PS4live (NBA 2K22) Ep 43: THE NBA FINALS: Orlando Magic Vs. Los Angeles Lakers    live at https://t.co/Fm3FALKgHn",
    "352": "🚨 UPDATE: Russell Westbrook - Los Angeles Lakers has a Double Double\n6:01 3rd\n17 PTS\n10 RBD\n4 AST\n2 STL\n[FD(35) DK(38.5)]",
    "353": "Jack Nicholson @Los Angeles Lakers with a Beautiful woman https://t.co/TrXRKDtUj6 via @YouTube",
    "354": "when do you think Ben Simmons will join the los angeles lakers via trade of westbrook ? i’m guessing mid january first week in february 🏀",
    "355": "I feel like this is the same but different with the Los Angeles Lakers rn 🙃 https://t.co/NMKT10S6Z1",
    "356": "NBA - Los Angeles Lakers vs. Houston Rockets. Follow the game at  https://t.co/Rh9DVYMgWX",
    "357": "KEVIN PORTER JR TO JALEN GREEN !!!!\n\n🚀🏀🚀🏀🚀🏀🚀🏀🚀🏀\n\n@HoustonRockets vs Los Angeles Lakers\n\n#Rockets #LightTheFuse https://t.co/0wW4cdgyM6",
    "358": "@thekaiky @Fm_AnaClara Los Angeles Lakers*",
    "359": "The Los Angeles Lakers are 12-11 when Russell Westbrooks makes at least one 3-pointer. Meaning, they aren't any better with him making or missing them.",
    "360": "Los Angeles Lakers up 67-59 against the Houston Rockets at half #Lakeshow https://t.co/1WqmvNYla7",
    "361": "Watch the 2nd Quarter Highlights from Houston Rockets vs. Los Angeles Lakers, 12/28/2021 https://t.co/VRUE6lCbzq",
    "362": "Trae the Truth wearing a shirt that says Los Angeles on it while performing at a Rockets vs Lakers game is very disappointing",
    "363": "HALFTIME!\n\nLos Angeles Lakers 67, Houston Rockets 59.\n\n https://t.co/gVW1gbeakn",
    "364": "The 🚀 Houston 🚀 Rockets are kicking ass for the underdog card against the Los Angeles Lakers",
    "365": "What a half.\n\n@KingJames: 18 pts, 5 reb, 4 ast\n@AhmadMonk: 16 pts\n@russwest44: 15 pts, 8 reb, 4 ast, 2 stl\n@carmeloanthony: 13 pts https://t.co/9QT84wgDSM",
    "366": "@TheHoopCentral Dark horse team gotta be the los angeles lakers",
    "367": "Have no fear, Malik Monk is here to save the Los Angeles Lakers",
    "368": "Lik off the launchpad! 💥 https://t.co/1gi06GkleX",
    "369": "Live Stream Free 🏀\n\nWatch via 🔴&gt;&gt; @JayJayPeace2\nWatch via 🔴&gt;&gt; @JayJayPeace2 \n\nLos Angeles Lakers vs Rockets \nBucks vs Magic\nHeat vs Wizards\nRaptors vs Sixers (76ers)\nPelicans v Cavaliers\nTimberwolves vs Knicks\nGolden State Warriors vs Nuggets \nKings vs Thunder\n!\nNBA Streaming",
    "370": "I wish the Los Angeles Lakers play defense like the Magnolia Pambansang Manok Hotshots.",
    "371": "Lakers vs. Rockets prediction, odds, line: 2021 NBA picks, Dec. 28 best bets from model on 48-24 run \n \n#LosAngelesLakers #HoustonRockets #RussellWestbrook https://t.co/VnSvIlD7dq",
    "372": "Los Angeles Lakers https://t.co/eWedF2L25p",
    "373": "Get 'em, Stanley. https://t.co/2T9qTwjBbk",
    "374": "LeBron James 😤😤 IMPARABLE\n\n#TiempoExtraRD\n#LeBronJames #Lebron #KingJames #James #NBA #Lakers #LosAngelesLakers \nhttps://t.co/rAjMyLFX48",
    "375": "WE ARE LIVE RIGHT NOW! \n\nLos Angeles Lakers Vs Houston Rockets | NBA Live Game https://t.co/M31Xh27L9r \n\n#Lakers #LakeShow #Rockets #NBA #NBATwitter  #Sports #NBABasketball",
    "376": "GSN-HBO’s upcoming mini-series on the Los Angeles Lakers is churning up plenty of interest. Just not from Magic Johnson. The basketball icon and centerpiece of the 1980s “Showtime” Lakers who won five NBA championships got caught by TMZ’s cameras on Sunday https://t.co/SqAinZCdpH",
    "377": "Match: Houston Rockets - Los Angeles Lakers\n\nBet slip link: https://t.co/cibnE9sD07\n\n#HoustonRockets #LosAngelesLakers #0x #zrx #roulette https://t.co/ATj7kwjIUa",
    "378": "THT= just not good enough 😞 #NBA #LosAngelesLakers #Lakers #Lakeshow",
    "379": "the los angeles lakers are a disgrace to basketball",
    "380": "Lots of offense. https://t.co/gN3jj90fet",
    "381": "Big Man Strength 💪\n\n(📺: @SpectrumSN) https://t.co/mXZFS7E1CZ",
    "382": "I dare the Los Angeles Lakers to lose tonight",
    "383": "Los Angeles Lakers. #LakeShow https://t.co/VT5LoW12EB",
    "384": "WELCOME BACK KEVIN PORTER JR !!!!\n\n@HoustonRockets vs Los Angeles Lakers\non AT&amp;T SportsNet\n\n#Rockets #LightTheFuse https://t.co/tRlX3ppGyz",
    "385": "Live Stream Free 🏀\n\nWatch via 🔴&gt;&gt; @JayJayPeace2\nWatch via 🔴&gt;&gt; @JayJayPeace2 \n\nLos Angeles Lakers vs Rockets \nBucks vs Magic\nHeat vs Wizards\nRaptors vs Sixers (76ers)\nPelicans v Cavaliers\nTimberwolves vs Knicks\nGolden State Warriors vs Nuggets \nKings vs Thunder\n\nNBA Streaming",
    "386": "Live Stream Free 🏀\n\nWatch &gt;&gt; https://t.co/XR2J4m4JQ2\n\nLos Angeles Lakers vs Rockets \nBucks vs Magic\nHeat vs Wizards\nRaptors vs Sixers (76ers)\nPelicans v Cavaliers\nTimberwolves vs Knicks\nGolden State Warriors vs Nuggets \nKings vs Thunder\n\nNBA Live Streaming\n#NBA #Lakers",
    "387": "ALERT: New high roller bet posted!\nA bet has been placed for $17,788.78 on Houston Rockets - Los Angeles Lakers to win $25,260.07.\nTo view this bet or copy it https://t.co/oIdgCqM6Bl https://t.co/x5mhwCwXNe",
    "388": "Live Stream Free 🏀\n\nWatch &gt;&gt; https://t.co/XR2J4m4JQ2\n\nLos Angeles Lakers vs Rockets \nBucks vs Magic\nHeat vs Wizards\nRaptors vs Sixers (76ers)\nPelicans v Cavaliers\nTimberwolves vs Knicks\nGolden State Warriors vs Nuggets \nKings vs Thunder\n\nNBA Live Streaming\n#NBA https://t.co/dUrlE0tvtl",
    "389": "ALERT: New high roller bet posted!\nA bet has been placed for $5,979.36 on Houston Rockets - Los Angeles Lakers to win $8,490.69.\nTo view this bet or copy it https://t.co/Vpuy5aM0rj https://t.co/DXx3vRzHQD",
    "390": "Center Stage https://t.co/AqJ2LEX6dL",
    "391": "@Lakers @ToyotaSoCal Get Fizdale out of Los Angeles. This lineup is stupid.",
    "392": "@TheHoopCentral Chicago Bulls and Los Angeles lakers",
    "393": "📷 Are the Lakers going to get their season turned around or no? 🤔 #nba #lakers #lebron #scottycameron (at Los Angeles, California) https://t.co/7pxVARMmMB https://t.co/dVvYP8pa7T",
    "394": "Are the Lakers going to get their season turned around or no? 🤔 #nba #lakers #lebron #scottycameron @ Los Angeles, California https://t.co/mcUDKWRuM4",
    "395": "@PennyChirps If you look at the season like a comedy, you’ll find a new appreciation for the roster coaster that is the Los Angeles Lakers.",
    "396": "@fraud_kevin is she a fan of the los angeles lakers??? 🤔",
    "397": "Houston Rockets vs Los Angeles Lakers Live Stream NBA Streaming game v link free\n\n... \n. \nWatch Live On 👉 @TheTammy5.\nWatch Live On 👉 @TheTammy5.",
    "398": "Today's NBA Picks: 8:10 PM ET - Los Angeles Lakers vs. Houston Rockets - 23 PICKS AVAILABLE: https://t.co/U9qnDnHz0U #nba",
    "399": "📝 Gli starting five del match tra Houston Rockets e Los Angeles Lakers\n\n🏀 Russell Westbrook, Avery Bradley, Malik Monk, Stanley Johnson e LeBron James\n\n⛹️‍♂️ Jalen Green, Kevin Porter JR., Eric Gordon, David Nwaba e Christian Wood\n\n💜💛 Let's go Lakers!\n\n#LakeShow #Rockets #NBA75 https://t.co/dLbOOZSGU2",
    "400": "Game Time https://t.co/y38hPnIkPl",
    "401": "Houston Rockets vs Los Angeles Lakers Live Stream NBA Streaming game v link free \n\n... \n. \nWatch &gt;&gt; https://t.co/JFcbFkhJLg",
    "402": "Watch Live Stream of Los Angeles Lakers vs Houston Rockets\nhttps://t.co/4XDByi5AoG",
    "403": "NBA #NBATwitter Today's Lineups\n\n#LakeShow\nLos Angeles Lakers Starting 5:\nRussell Westbrook\nMalik Monk\nAvery Bradley\nStanley Johnson\nLeBron James\n\n#Rockets\nHouston Rockets Starting 5:\nKevin Porter Jr.\nJalen Green \nEric Gordon\nDavid Nwaba\nChristian Wood",
    "404": "Minnesota Timberwolves star Karl-Anthony Towns said Los Angeles Lakers star Russell Westbrook chases stats while praising his play.  https://t.co/GJs620GTR9",
    "405": "Consensus Line Move:\n2021-12-28 Los Angeles Lakers at Houston Rockets from 225.50 to 227.00\nOver sharps say\n#NBA #bettingadvice #machinelearning #bitcoin"
}