{
    "0": "@BallySportsCLE @SerenaWinters @cavs Congratulations Serena!\nWe miss you in Philly but you will be great by the lake",
    "1": "@cavs GET US TACKO FALL IN RETURN",
    "2": "@cavs @firstenergycorp Why don't we play Nembhard?",
    "3": "@Outkick Really @cavs",
    "4": "Rondo to the Cavs, makes great sense! Committed to a playoff run! @cavs",
    "5": "@CavsJMike @cavs @DreKnott @BallySportsCLE Andre is the Swiss Army knife of Cleveland sports!  I know Bruce Drennan retired today so I’m going to repeat what I said a month ago.  @BallySportsCLE if you want a Cleveland sports show @DreKnott is the man!",
    "6": "@RajonRondo LETS GET IT!!! We are ready for you and will value your court presence with the @cavs!! #letemknow https://t.co/ffbM7zcNoO",
    "7": "The Cleveland Cavaliers are in serious talks on a deal to acquire Lakers guard Rajon Rondo, sources tell _TheAthletic _Stadium. In wake of Ricky Rubios season-ending ACL injury, Clevela2... #mobilsocial https://t.co/3ZWhnvBEvp",
    "8": "Cleveland Cavaliers in \"serious talks\" to acquire Rajon Rondo from the Los Angeles Lakers https://t.co/jyTxeKRwx9 https://t.co/pGrGCOpjOa",
    "9": "It’s beginning. RT @wojespn: The Cleveland Cavaliers are nearing a trade to acquire Los Angeles Lakers guard Rajon Rondo -- and an agreement is expected to be reached as soon as Friday, sources tell ESPN. Rondo would be able to join Cleveland as soon as he clears Covid protocols.",
    "10": "*BREAKING NEWS*\n\nThe Cleveland Cavaliers have traded Darius Garland, Kevin Love, Cedi Osman and 2 First Round Picks for Lebron James. \n\nThe King returns to his home for the third time 🔥 https://t.co/fi6LDR1aX3",
    "11": "@CavsJMike @cavs @DreKnott @BallySportsCLE He the best!!!",
    "12": "@Bradyhas7ringz @cavs @Lakers Rondo pack https://t.co/DGw9eRB12k",
    "13": "We need this veteran PG but pls don’t get hustled @cavs  🤔 https://t.co/HH1qJbqFoC",
    "14": "\"It was a great marriage.\"\n\nJ.B. Bickerstaff tells @CavsJMike about his most recent conversation with Ricky Rubio and discusses the necessary adjustments to be made to the @cavs' rotation.\n\n#LetEmKnow https://t.co/cZobIcU6zs",
    "15": "Interesting. This is an indication the @Cavs are all-in this season. #LetEmKnow https://t.co/ot5y6BB9W0",
    "16": "Pray for Cleveland Cavaliers fans.",
    "17": "@BallySportsCLE @SerenaWinters @cavs Wow what an upgrade!",
    "18": "Let’s go great pick up @cavs https://t.co/lAF78dTDcU",
    "19": "@glennconsor @cmillsnbcs @WashWizards @cavs @NBCSWashington Let’s gooooo!!!!!",
    "20": "@robindahood3187 @cavs @RMFieldHouse No one give a shit what you do lol",
    "21": "Take Russ too, give us Garland and Okoro @cavs https://t.co/EiAI7JGbzY",
    "22": "Cleveland Cavaliers in \"serious talks\" to acquire Rajon Rondo from the Los Angeles Lakers (@AmNotEvan) https://t.co/tVW3w4h45i https://t.co/aFrZxFRNAZ",
    "23": "BREAKING: The Los Angeles #Lakers and the Cleveland #Cavaliers are nearing a deal centered around Rajon Rondo going to Cleveland. The Cavs lost G Ricky Rubio to a torn ACL earlier in the week. #NBA https://t.co/hAdxQV4ZUJ",
    "24": "@wojespn Makes perfect sense for both teams. @RajonRondo wasn’t getting any minutes and he’ll actually be in a good situation at @cavs.",
    "25": "BREAKING: Cleveland #Cavaliers are nearing a trade to acquire Los Angeles #Lakers guard Rajon Rondo \n\nAn agreement is expected to be reached as soon as Friday. \n\nRondo would join Cleveland as soon as he clears COVID protocols.\n\n#LakeShow\n#LetEmKnow",
    "26": "Perfect pickup !!!! @cavs https://t.co/G3WLBAGEtP",
    "27": "@jamesgre6 @cavs @KingJames @Lakers Dam i didn't even know that yea that's definitely going to be a blow!!!",
    "28": "@cavs @firstenergycorp What about the bench",
    "29": "@cavs send us Mobley https://t.co/knQJ2qS5cD",
    "30": "@Mobley_For_ROTY @NBAStatNerd @cavs @firstenergycorp Have to include one of the 15 rostered players. Hopefully it's Valentine and San Antonio's 2nd.",
    "31": "Yall dont want westbrook? @cavs https://t.co/PLAQRRHkqI",
    "32": "This just in the Cleveland Cavaliers will be sending Guard/forward Cedi Osman to the Los Angles Lakers for guard Rajon Rondo and a second round pick sources say per @wojespn https://t.co/2Ug2TE5jRc",
    "33": "@33643pts The Cleveland Cavaliers are nearing a trade to acquire Los Angeles Lakers guard Rajon Rondo -- and an agreement is expected to be reached as soon as Friday, sources tell ESPN. Rondo would be able to join Cleveland as soon as he clears Covid protocols.",
    "34": "send us Garland for Westbrook @cavs https://t.co/x12s7wdYiA",
    "35": "@cavs @firstenergycorp Who the fuck is kevin pangos 🤷🏻‍♂️",
    "36": "@cavs @firstenergycorp Injuries and Covid are about to derail this amazing season😢",
    "37": "In position and ready @cmillsnbcs @WashWizards @cavs @NBCSWashington \n#DCAboveAll https://t.co/t6f6HCtAn3",
    "38": "@CavsJMike @cavs @DreKnott @BallySportsCLE I loved Dre!  Isn't he staying on??!!",
    "39": "@CavsJMike @cavs @DreKnott @BallySportsCLE I will miss you @DreKnott but I know @CleHotDogs 🌭 are happy to have you back 🤣🤣🤣",
    "40": "@LaVinesBurner @cavs Oh wait nevermind we’re getting Rondo",
    "41": "#RT @ShamsCharania: The Cleveland Cavaliers are in serious talks on a deal to acquire Lakers guard Rajon Rondo, sources tell @TheAthletic @Stadium. In wake of Ricky Rubio’s season-ending ACL injury, Cleveland has need for backcourt help and is working on the potential move.",
    "42": "@BallySportsCLE @SerenaWinters @cavs Get a good look. Won’t see her without a mask for a while.",
    "43": "Ah yes, the Cleveland Cavaliers",
    "44": "@DrNiravPandya @KlayThompson Will be back on court on January the 9th at Chase Center!\nGame @Warriors Vs. @cavs",
    "45": "@BallySportsCLE @cavs Even if he’s washed thanks for getting a pg",
    "46": "I’m bored do the trade now @cavs @Lakers",
    "47": "BREAKING: The Lakers are expected to trade Rajon Rondo to the Cleveland Cavaliers, via ESPN.",
    "48": "The Cleveland Cavaliers are nearing a trade to acquire Los Angeles Lakers guard Rajon Rondo -- and an agreement is expected to be reached as soon as Friday, sources tell ESPN. Rondo would be able to join Cleveland as soon as he clears Covid protocols.",
    "49": "@CavsJMike @cavs @DreKnott @BallySportsCLE Dre is literally the goat!!!! I’ve always been a huge fan of Dre but seeing how he transitioned was next level!! \n\nAlso, Best of luck to the AMAZING @SerenaWinters on this next chapter!!!  CLE got a great one!!! 🥳",
    "50": "Westbrook is available too guys @cavs https://t.co/85qwW42L9u",
    "51": "@Lookits_Jae @cavs @firstenergycorp With his 1st start at the 5, he's easily the best stretch 5!!!!",
    "52": "@Welcome2Sexland @SlickShotzz13 @cavs @firstenergycorp Rather have a pg out there over Valentine playing pg",
    "53": "@LakersChill @cavs He’s a knock down 3pt shooter and has been playing well recently",
    "54": "@cavs @firstenergycorp In pangos we trust",
    "55": "Happy 37th Birthday to LeBron James! The professional basketball player for the Cleveland Cavaliers, the Miami Heat, and the Lakers of the NBA and the actor who played himself in Square Roots, Trainwreck, and Space Jam: A New Legacy and voiced Gwangi in Smallfoot. #LeBronJames https://t.co/HICNY8lhtO",
    "56": "@CavsJMike @cavs @DreKnott @BallySportsCLE He was fantastic!!",
    "57": "@CavsJMike @cavs @DreKnott @BallySportsCLE Coupe of great pros",
    "58": "@cavs @firstenergycorp Good lineup. Will be real nice when Jarrett Allen gets back. Sometimes it’s all about opportunity. Enter Kevin Pangos. And let’s go Cavs!",
    "59": "@JohnTelich8 @ShamsCharania @cavs He's only 54 years older than you, JT. Think he still has anything at all left in the tank?",
    "60": "@LaVinesBurner @cavs Plz no, plz",
    "61": "@BallySportsCLE @SerenaWinters @cavs How about that streaming app so we can watch the @cavs and @CleGuardians",
    "62": "@TheKennyRoda @STVMAthletics @NBA @cavs @KingJames That dude hated u!! SMH because u asked solid questions",
    "63": "Cleveland #Cavaliers, 20-14\nLos Angeles #Lakers, 17-19",
    "64": "@ShamsCharania @TheAthletic @Stadium Dude just come get John Wall @cavs",
    "65": "@kirca_san @cavs You guys should trade for Denzel. He’s a knock down shooter",
    "66": "LOVE THIS. DO IT @cavs https://t.co/UnXFyzFAx8",
    "67": "The Cleveland Cavaliers are in serious talks on a deal to acquire Los Angeles Lakers guard Rajon Rondo, according to The Athletic's Shams Charania.\n\nhttps://t.co/92C1GPmPi7",
    "68": "@DudeOfTheHouse @dariusgarland22 @cavs I am not COVID-19 list expert. I wonder if anyone is since rules change all the time.",
    "69": "@cavs @firstenergycorp PANGOS THE STARTER i hate my lige",
    "70": "@Fadeaway_Chef @cavs facts 😤",
    "71": "RAJON FOR K LOVE @cavs https://t.co/EYwDGgQcXK",
    "72": "Send him to the Lakers @cavs https://t.co/2MCc7QMoYl",
    "73": "@Mobley_For_ROTY @cavs @firstenergycorp Hopefully nothing more than a second rounder maybe hopefully not two",
    "74": "@KOT4Q BREAKING: Veteran Rajon Rondo has been traded to the Cleveland Cavaliers for Jarret Allen’s headband. Per Woj",
    "75": "@cavs see if Kris Dunn wants to be back in the NBA. @CantGuardM3_",
    "76": "@cavs @firstenergycorp So love and mobley are just switching positions",
    "77": "@Lookits_Jae @GloveKevin @cavs @firstenergycorp Mobley is versatile enough to guard PFs where Love can just plant his feet in the paint on defense",
    "78": "I VOTED!!!\n#LetEmKnow \n@cavs https://t.co/sr7OrfpP7k",
    "79": "@cavs @firstenergycorp Next man up. You got this, @kevinlove!",
    "80": "#NOW Following a non-contact injury in Tuesday night’s loss at New Orleans, the Cleveland Cavaliers received devastating news on Wednesday afternoon. https://t.co/Ux9rUZK9Te",
    "81": "@Lookits_Jae @GloveKevin @cavs @firstenergycorp Imagine not wanting him at PG 😒",
    "82": "Y’all could come get Augustin and Gordon @Cavs",
    "83": "Brunson for Allen @cavs",
    "84": "@cavs @firstenergycorp Gonna be a tough stretch 😬😤🙌",
    "85": "Kevin Love reflects on the season-ending injury of Ricky Rubio, whom he considers \"the true lifeblood\" of the @cavs.\n\n#LetEmKnow https://t.co/vJRos3ooyX",
    "86": "Send them Valentine @cavs https://t.co/LHOoja7Bn0",
    "87": "@cavs @firstenergycorp Yea! Get wade’s ass outta there",
    "88": "@SlickShotzz13 @cavs @firstenergycorp ik whats really going on, but i mean we could start someone over Pangos and put Mobley at the 5 and Kevin at the 4",
    "89": "@cavs @firstenergycorp Sign Richard Jefferson to a ten day",
    "90": "GIVE US MOBLEY @cavs https://t.co/BJVtYvPLo2",
    "91": "Per @ShamsCharania   The Cavaliers are in serious talks on a deal to acquire Lakers guard Rajon Rondo.  In wake of Ricky Rubio’s season-ending ACL injury, The @cavs clearly have the need.",
    "92": "The Washington Wizards are 3-7 in their last 10 games with several players in protocol. The surprisingly good Cleveland Cavaliers just lost the steady hand of Ricky Rubio for the season. But, the games go on! @bnguyen_45 has the preview here #DCAboveAll \n\nhttps://t.co/hNC77D288R https://t.co/nIQW4aEKT3",
    "93": "@GloveKevin @cavs @firstenergycorp i just would rather have mobley at the c",
    "94": "Russ would look fire next to Mobley @cavs make the move !",
    "95": "@cavs @firstenergycorp Plz don’t overwork Love we don’t need him getting hurt too😭",
    "96": "@Welcome2Sexland @cavs @firstenergycorp Everybody either hurt or in covid protocols",
    "97": "@cavs @firstenergycorp Gonna be a challenge with no PG’s. The ball died in NO when Rubio went down.",
    "98": "@Lookits_Jae @cavs @firstenergycorp How so? He was center all 2018 season and was an all star lol",
    "99": "How to Watch Cleveland Cavaliers vs. Washington Wizards: Live Stream, TV Channel, Start Time https://t.co/RTdvKeqi44 This report is not current as Garland is inelligible to play until January 4 2022.",
    "100": "Me, getting ready for tonight’s Rubioless @cavs game:\n\nhttps://t.co/icdwr3C7Jo",
    "101": "@cavs @firstenergycorp What are we giving up for rondo?",
    "102": "@cavs @ZeroDarkSexland @firstenergycorp Get rondo",
    "103": "[Game Thread] Washington Wizards (17-17) vs Cleveland Cavaliers (20-14) - 7PM [NBCSW] https://t.co/Lg21gZzjVj",
    "104": "@cavs @firstenergycorp Incoming Pangos masterclass tonight",
    "105": "@cavs @firstenergycorp kevin love at center is crazy",
    "106": "@KendrickPerkins @cavs @dariusgarland22 thanks for showing the cavs national media love perk, slowly becoming one of my fav journalists.",
    "107": "@cavs @firstenergycorp Like love starting but rather have Denzel at point lmao",
    "108": "@cavs @firstenergycorp Rondo coming baby?",
    "109": "@ShowMeGoodNews @CavsJMike @cavs @BallySportsCLE Nope I’ll be here getting ready for baseball season",
    "110": "Report: The Lakers are in \"advanced talks\" to trade Rajon Rondo to the Cleveland Cavaliers, potentially opening up a roster spot that could let them keep Stanley Johnson or Darren Collison. https://t.co/142IEfodcT",
    "111": "Tonight's starting lineup for the Cleveland Cavaliers: Pangos, Okoro, Markkanen, Mobley, Love https://t.co/bVWH4AMCA2",
    "112": "@cavs @firstenergycorp Mobley at the 4, Love at the 5? Pangos starting? what is going on here",
    "113": "@cavs @firstenergycorp this mans gonna save us https://t.co/WVkzYBZOQv",
    "114": "@cavs @firstenergycorp good god were ab to get cooked I feel",
    "115": "@cavs @firstenergycorp MOBLEYYYYYYY",
    "116": "@JoshEberley Josh Bomb:\n\nThe LA Lakers have traded veteran guard Rajon Rondo to the Cleveland Cavaliers for a used washing machine, the rights to the song “Love Me Sexy”, and cash considerations.",
    "117": "@cavs @firstenergycorp How long is allen out for?!",
    "118": "@cavs @firstenergycorp Get Pangos the fuck outta there",
    "119": "@cavs @firstenergycorp For the love of god I don’t want to see Kevin Pangos in another one of these after tonight",
    "120": "@cavs @firstenergycorp WE GETTING RONDO https://t.co/gZXmAerCBY",
    "121": "@cavs @firstenergycorp GET RONDO NOW",
    "122": "@cavs @firstenergycorp Oh god",
    "123": "Tonight's Starting Five 🖐️ #LetEmKnow https://t.co/DAlTx61ezC",
    "124": "We got a in 25 minutes \n\n@cavs vs Washington \n\n#LetEmKnow #NBA",
    "125": "give us dean wade for rondo you cowards @cavs",
    "126": "While we celebrate the hiring of Serena Winters to our @Cavs and #CavsTV family, I also want to take a moment to celebrate someone else. \n\nThis guy walked into a tricky situation a few weeks ago &amp; handled it like a pro….\n\nIt’s been a pleasure, @DreKnott…keep doing your thing. https://t.co/El8tzGGdGU",
    "127": "As a Cavs season ticket holder we should trade for Davis Bertans instead. Bertans would thrive as a pg. The poverty Wizards coaching staff haven’t figured it out yet. Just imagine a 6’10 pg with elite shooting… He would be like a Ben Simmons/Steph Curry hybrid 😳 @cavs https://t.co/gc9yfj1q4U",
    "128": "@cavs give my #LakeShow a draft pick since we lack draft capital 💜💛✝️🙏🏼",
    "129": "We might as well grab him. Rubio down, lakers only used him 4 of the last 10 games. He’s only shot the ball 8x total in those games. Bring hun to a team that can use him right now. @cavs @cavsdan @PDcavsinsider @CavsNationCP https://t.co/vfvIixRE9u",
    "130": "I got a 6’10 Rondo with a higher ceiling to sell you @cavs https://t.co/9RPwWo6RKc",
    "131": "Give us K Love or no deal @cavs https://t.co/tlZMpJgQJs",
    "132": "@gabbgoudy Best of luck to you and your fellow Cleveland Cavaliers fans tonight vs. my Washington Wizards",
    "133": "@HollywoodJetEra @ShamsCharania @TheAthletic @Stadium Put some respect on the Cleveland Cavaliers.",
    "134": "The Cleveland Cavaliers are in serious talks on a deal to acquire Rajon Rondo, sources tell @ShamsCharania.\n \nIn wake of Ricky Rubio’s season-ending ACL injury, Cleveland has a need for backcourt help and is working on the potential move. https://t.co/A5oSTutSLf",
    "135": "REPORT: Cleveland Cavaliers &amp; LA Lakers are discussing a deal based around guard Rajon Rondo. \n\nCleveland needs guard help in wake of Ricky Rubio’s ACL injury. \n\nWho should each team trade? 🤔 https://t.co/Az4P7BRaCc",
    "136": "I love my @cavs",
    "137": "The Cleveland Cavaliers are engaged in serious talks to acquire Rajon Rondo from the Los Angeles Lakers.\n\n(via @TheAthletic) https://t.co/eLIpjlESd6",
    "138": "Cleveland Cavaliers GIGANTE https://t.co/trb9onRyp9",
    "139": "Why The Cleveland Cavaliers Trading For Ben Simmons Or Caris LeVert — Or Anyone Else — Is Complicated https://t.co/JvZyoSeuuD",
    "140": "@KendrickPerkins @cavs @dariusgarland22 Werkins",
    "141": "@cavs can we please get Ben to Cleveland ?",
    "142": "@cavs  Do yall need Jevon Carter too ?? https://t.co/68lIixQLu8",
    "143": "@YAnunoby @cavs Cheaper to get too",
    "144": "The .@cavs are in serious talks on a deal to acquire .@Lakers guard .@RajonRondo. In wake of Ricky Rubio’s season-ending ACL injury, Cleveland has need for backcourt help and is working on the potential move. (Shams) https://t.co/VvMJBuuk0P",
    "145": "Hold the fuck on…….. WHO. ARE. YALL. TRADING?!????? @CAVS https://t.co/MOrCCFScX9",
    "146": "The Cleveland #Cavaliers are in serious talks to acquire Rajon Rondo from the #Lakers.\n\nI don’t think this rules out the Cavs as a potential trade partner for the #Celtics in a Dennis Schroder trade, but they are far less desperate at this point. https://t.co/eHOINumWm4",
    "147": "@cavs for you my friend, i’ll give u jevon carter for free https://t.co/9jH3OEpyP1",
    "148": "Better than Rondo hein @cavs https://t.co/H0XwaTkDJU",
    "149": "@ShamsCharania @TheAthletic @Stadium He's all yours @cavs. We'll even throw in Deandre Jordan for free",
    "150": "Don’t send back no bums ! @cavs",
    "151": "Evan Mobley for Rondo guys @cavs 🤷🏽‍♂️ #LakeShow https://t.co/mGZYf04TJI",
    "152": "Goran Dragic is available. Just letting y'all know. @cavs https://t.co/T0mz782aRD",
    "153": "Hey @Cavs Goran Dragic has been a more impactful player than Rondo this year and he’s been chillin on the beach for the last 2 months. https://t.co/igRrfQhHzh",
    "154": "@ShamsCharania @TheAthletic @Stadium Don’t do it @cavs look how he played with the clippers. Expect that, maybe even worse.",
    "155": "Trade for LeBron instead @Cavs!!! #Cavs #Lakeshow https://t.co/sMdvbo5WU9",
    "156": "BREAKING: In wake of Ricky Rubio’s injury, the Cleveland Cavaliers are in talks to acquire Rajon Rondo from the Lakers, per @ShamsCharania.",
    "157": "#Sources — The Cleveland Cavaliers are in serious talks on a deal to acquire Lakers guard Rajon Rondo. #NBA",
    "158": "The Cleveland Cavaliers are in serious talks on a deal to acquire Lakers player Rajon Rondo.",
    "159": "Garland and a first @cavs https://t.co/J0mCkVfTLM",
    "160": "That’s not going to help @cavs https://t.co/7DCLF9OrN9",
    "161": "The Cleveland Cavaliers are in serious talks on a deal to acquire Lakers guard Rajon Rondo, sources tell @TheAthletic @Stadium. In wake of Ricky Rubio’s season-ending ACL injury, Cleveland has need for backcourt help and is working on the potential move.",
    "162": "All my students are Wizards fans but today we’re gonna #LetEmKnow @kevinlove @cavs https://t.co/xYTW2fQtw7",
    "163": "@cavs you guys need to offer Ricky an ext. Dude was huge this season and complimented DG perfect. Injury or not cant just let him walk",
    "164": "Hey @cavs fans, you got a good one.\nOne of the nicest and hardest working in the NBA. Congrats @SerenaWinters!!! ☺️ https://t.co/YCBLO7oEcN",
    "165": "@BallySportsCLE @SamStaff18 @SerenaWinters @cavs Congrats!  You guys got a good one there.",
    "166": "@cavs @kevinlove He’s having fun!",
    "167": "@cavs @SerenaWinters Serena, Welcome to Cleveland from one of their biggest supporters BP in Pepper Pike\n(a suburb of Cleveland)\nAs a kid I lived in Philly and I used to be a 76ers fan! Go Cavs! 🏀🏀",
    "168": "Im finally feelin some type of fatigue I wanna go to sleep and wake up to 45k okay @cavs @WashWizards @sixers @BrooklynNets @OrlandoMagic @Bucks",
    "169": "@cavs @RMFieldHouse I don’t care, I will still watch them at the arena no matter what.",
    "170": "@BallySportsCLE @SerenaWinters @cavs Serena, Welcome to Cleveland from one of their biggest supporters BP in Pepper Pike\n(a suburb of Cleveland)\nAs a kid I lived in Philly and I used to be a 76ers fan! Go Cavs! 🏀🏀",
    "171": "I'm at @CapitalOneArena for @WashWizards vs @cavs in Washington, DC https://t.co/i71EzHnzUR",
    "172": "Congratulations to Mbrick03 who moved up 1 spot to take #7 on the Cleveland Cavaliers team leaderboard.\n\nhttps://t.co/BM2rGP6EdD",
    "173": "NEW SUPERTEAM IN TOWN! CLEVELAND CAVALIERS REBUILD #NBA2K22\n\nFeaturing @Kay_2wice\n\n#NBA\n#NBATwitter\n#bethefight\n#Cavs\n\nhttps://t.co/M8PhcndICY",
    "174": "@Hajjiieee @cavs @RMFieldHouse I saw",
    "175": "In honor of his 37th birthday which is today, this is a throwback of Lebron James trying to get his first ring in a mini movie called “Journey To The Ring” https://t.co/C5fQgvQqNR  \n#LebronJames #HappyBirthdayLeBronJames #LosAngelesLakers #ClevelandCavaliers",
    "176": "@DreKnott @sixpak1175 @BallySportsCLE @SerenaWinters @cavs I love u w/ the tribe (guards) now. I watch almost every game and u have a solid personality w the players. Loved u with the Cavs too. But I kinda love the walk offs and Gatorade pours and the mustard rivalry. I think u need bobble head w mustard. Keep killing it.U got my support",
    "177": "Are you ready for the @cavs (+152) vs @WashWizards (-147) game tonight??\n\nPlace your bets - https://t.co/HYYYaqMqf4\n\n#NBA #NBAPicks https://t.co/i7mBzPHIqI",
    "178": "Gonna box out and join Carmen Angelo with @frankparkison on @mrhero Cavs Now presented by @brewkettle 6p-6:30p on your home for @cavs  basketball THE BIG ONE @WTAM1100!  Try to outrebound us...it won't happen!\nHAPPY NEW YEAR!",
    "179": "@CavsFRA @cavs Et sinon @matthewdelly c’est possible ou pas possible ? https://t.co/T6PaRMZYCT",
    "180": "@ShastorTS @isaacokoro303 @nbatopshot Cleveland Cavaliers in the playoffs",
    "181": "CLEVELAND CAVALIERS(@GazetaGSW) vs MEMPHIS GRIZZLIES(@BrOlajuwon)\na final do quiz! https://t.co/JRXPFmcYPZ",
    "182": "@OGDAD_B @cavs @rickyrubio9 Me and you the recipe for a playoff run",
    "183": "@cavs @RMFieldHouse Cases are going up but deaths are going down i just felt like sharing that",
    "184": "@Milan_98O @ogkore3 @cavs @keybank I bet Valentine gets some PG run lol",
    "185": "Congratulations to Mbrick03 who moved up 2 spots to take #8 on the Cleveland Cavaliers team leaderboard.\n\nhttps://t.co/BM2rGP6EdD",
    "186": "@CavsJMike @cavs @SerenaWinters So you fired the other lady why because  she is black?",
    "187": "@ShannonSharpe hey Unc @ShannonSharpe were you at the @MiamiHEAT parade or was that the @cavs championship parade?",
    "188": "@TheNBACentral JB bickerstaff @cavs",
    "189": "@evan_CTOWN @cavs @RMFieldHouse I will wear a mask if I have to but these masks most definitely gators and cloth masks do nothing to stop the spread. Heck all the masks won’t stop it. I will wear a mask but it will not stop anything.",
    "190": "BROOKLYN NETS -5\nCLEVELAND CAVALIERS +4.5\n12/30",
    "191": "@Miggy_Official2 @jmbyler @cavs @RMFieldHouse I will wear a mask if I have to but these masks most definitely gators and cloth masks do nothing to stop the spread. Heck all the masks won’t stop it. I will wear a mask but it will not stop anything.",
    "192": "Why The Cleveland Cavaliers Trading For Ben Simmons Or Caris LeVert — Or Anyone Else — Is Complicated https://t.co/P2pKXAo3LJ",
    "193": "Cavaliers' Ricky Rubio Carried Off Floor After Suffering Knee Injury vs. Pelicans\nDavid Liam Kyle/NBAE via Getty Images\nCleveland Cavaliers guard Ricky Rubio appeared to suffer a left knee injury during h... https://t.co/atFLdAav7L https://t.co/qlvRqcVy7z",
    "194": "Five of our customers are ending 2021 or starting 2022 with a spectacular bash! Check out these events from @cavs, @The9CLE, @LagoEastBank, @EdwinsCLE, @clevemetroparks! ✨🍾https://t.co/orYeMhnZJO",
    "195": "@bluntfudge @robindahood3187 @cavs @RMFieldHouse Instead of just throwing around insults, maybe explain to my man why its not silly to wear a mask with holes in it magnitudes bigger than the thing you are trying to block.  \n\nEveryone is breathing the same recycled air that is still going to have micrometer sized particulate.",
    "196": "All set just a few hours before #HappyNewYear today 30 at 7:00 P.M be sure to enjoy the game between Washington Wizards vs. Cleveland Cavaliers at Capital One Arena, Washington, DC, and remember if you want to connect visit us at https://t.co/wtcj1nSuDR\n#basketball #5Gsfor5G https://t.co/ZfTiLSALL0",
    "197": "@metromarsh @cavs @SerenaWinters @DreKnott Can’t do both once his baseball duties start.",
    "198": "The Washington Wizards play the Cleveland Cavaliers at 6 p.m. tonight. You won't be able to watch it, unless you have NBA League Pass.\n\nEchenique would also be the seventh former Shocker to reach the NBA in the last decade, joining Mekel, Murry, Early, Baker, VanVleet &amp; Shamet. https://t.co/1EpixSE69y",
    "199": "@azwwanna @robindahood3187 @cavs @RMFieldHouse It does seem a bit silly when you are still breathing the same recycled air thru a mask that has holes in it magnitudes larger than the thing you are trying to block.",
    "200": "@WashWizards Game at 7:00pm vs @cavs!\nMy 3 Predictions:\n-Bradley Beal will score 30+ points and have 6+ assists\n- Deni Avdija will score 16+ points and have 9+ rebounds\n- Daniel Gafford will score 15+ points and have 8+ rebounds \n(The Wizards Will Win 112-106!)\n#DCAboveAll",
    "201": "Can you imagine if @KingJames had retired after his 2020 championship, and with all the Covid-19 struggles in the @NBA, a team like the @MiamiHEAT or @cavs signed him to a 10-day contract.",
    "202": "@CavsJMike @cavs @SerenaWinters I imagine she will be great but I will miss @DreKnott. Dude is just so knowledgeable about any sport you put him in. Anyway, looking forward to hearing Serena Winters",
    "203": "@GreggPackovich @isaacokoro303 @nbatopshot @cavs It truly blows my mind how well the Cavs are playing",
    "204": "Best PG I think we can get for a great fit like Rubio is Goran Dragic @cavs #LetEmKnow #Cavs Cory Joseph is out there too",
    "205": "@BallySportsCLE @SerenaWinters @cavs Congrats!",
    "206": "Heard @KyrieIrving wants to come back to the land and the @cavs want him back well what the hell are we waiting for make a move already let's get the real king of t he land back",
    "207": "@verbosca @DreKnott @sixpak1175 @BallySportsCLE @SerenaWinters @cavs i chuckled.",
    "208": "Cleveland Cavaliers at Washington Wizards odds, picks and predictions https://t.co/UFUZEX3YKP via @sportsbookwire Best lineup for Cavs December 30 2021: Okoro, Valentine, Wade, Markkanen, Mobley: bench Love, Davis, Stevens, Windler, Pangos, Kornet. Thin without key players.",
    "209": "@Patty_Mills @Joeingles7 Bring him to the @cavs",
    "210": "@Pucky22 @cavs In a week from now, the same thing will be said for over 5’4”",
    "211": "Nuggets voided \nSo easier for me to win $210(from $10) so please @cavs(🤢) @BrooklynNets and Giannis and bucks please https://t.co/fpu0yUPKaQ",
    "212": "@JohnnyGoodberry @wear_athletic @msshawnt @HammerNation19 @cavs LMAO",
    "213": "@TheKennyRoda @STVMAthletics @NBA @cavs @KingJames \"Something weird about you Kenny... Why you only ask questions when we lose\" 😂😂",
    "214": "@BallySportsCLE @cavs @SerenaWinters Now if only people who stream can watch her and the @cavs.  @cavsdan - you have an awesome product - use your influence so we can see it and get closer to this team.",
    "215": "Rocket Mortgage FieldHouse will begin requiring face masks at all events starting Dec. 31 with the Cleveland Cavaliers versus Atlanta Hawks game, according to an announcement by the downtown Cleveland venue. https://t.co/ej7JFE8IHm",
    "216": "🏀 Cleveland Cavaliers(+3.5) @ Washington Wizards(-3.5)\n\n⌚ 7 PM ET\n\nO/U: 212\n\n📋 Over is 3-0-1 in Wizards last 4 home games.\n\nBet BTC ➡️ https://t.co/spMiJIy3iL\n\n#NBATwitter #NBAPicks #SportsBetting #GamblingTwitter https://t.co/2sbpFYm6TQ",
    "217": "we need to sign Boobie Gibson @cavs https://t.co/3DuEOOGGzF",
    "218": "@BallySportsCLE @SerenaWinters @cavs Congrats @SerenaWinters so well deserved and miss you on the Sixers sidelines!!!",
    "219": "@GABESPIEGEL @fox8news My Dude , The Song , \"Return Of The Mack\" ... Did U Say U Can't Wear Gaiter Face Covering @ A @cavs Game ... Happy New Year ...  I LUV U ... BE SAFE ... I ADORE U ... https://t.co/FpF3INuhWQ",
    "220": "I'm stuck between a rock and a hard place. I want to watch the Washington Wizards vs. Cleveland Cavaliers with @JustinKutcher and @DrewGooden. On the other hand, I want to watch the Saint Joseph's Hawks @ Richmond Spiders men's basketball game on The Plus.",
    "221": "@KendrickPerkins @cavs @dariusgarland22 ya big Perk calling it. like it is!!!! as usual!!!",
    "222": "Happy 37th Birthday to this guy, who’s exceeded all the enormous expectations that were placed on him coming out of HS at  @STVMAthletics &amp; going straight to the @nba as the #1 overall pick by the @cavs &amp; he’s still going strong as the 3rd all-time leading scorer &amp; 4 #NBA titles. https://t.co/JFRxlm4Lwk",
    "223": "Give me some thicc soles and I'm there @cavs https://t.co/FKw76PREop",
    "224": "Two days of non-stop walking while taking in all that is Washington &amp; Virginia. Quick pit stop to rest the legs  &amp; cheer on the @Vol_Football before heading to my first @cavs game this eve. 🇺🇸🏈🍑🍊🏀 https://t.co/nB3xg4r0x5",
    "225": "Voici les matchs correspondant aux différents paris : \n\n1️⃣ Washington Wizards - Cleveland Cavaliers\n\n2️⃣ Brooklyn Nets  - Philadelphie 76ers \n\n3️⃣ Orlando Magic - Milwaukee bucks \n      Brooklyn Nets - Philadelphie 76ers",
    "226": "@dylanatl325 @Milan_98O @R98Paul @cavs @dariusgarland22 @KendrickPerkins And George hill",
    "227": "@CopyPasteProfit @BleacherReport @BrooklynNets @cavs @KingJames Dude shut up about the vaccine. He has every right to do this, good for him not backing down under the pressure. He, nor anyone cares what you or other people have to say lol.",
    "228": "@BallySportsCLE @SerenaWinters @cavs Well deserved! Congratulations!",
    "229": "@BallySportsCLE @SerenaWinters @cavs Accepted!! Feeling the love ☺️\nWe love you back 😻\nGoooo Cavs!!!!!!!",
    "230": "If the Heat can bring Chalmers back then the @cavs can bring back JR https://t.co/f0Mu6ojRAB",
    "231": "Been feeling the Love ❤️ #LetEmKnow https://t.co/TUNgZ1V79H",
    "232": "@cavs bring back Boobie Gibson if this how we coming https://t.co/SXPjOz1Y6a",
    "233": "Sign norris cole @cavs",
    "234": "Podcast: We recap the @cavs 2021 off season &amp; surprising start to the season, #Cavs potential All Stars, as well as losing Ricky Rubio to injury &amp; more with the radio play-by-play voice of the Cavaliers Tim Alcorn @cavsalcorn. https://t.co/LufP2IlsHW",
    "235": "@cavs @SerenaWinters Go sixers!",
    "236": "Ende #Basketball Herren #NBA \n104:108 ClevelandCavaliers vs #NewOrleansPelicans \n89:86 #DenverNuggets vs GoldenStateWarriors \n111:117 OklahomaCityThunder vs #SacramentoKings",
    "237": "@BallySportsCLE @SerenaWinters @cavs Hell yeah, Serena! Good luck in Cleveland, fun young team.",
    "238": "@cavs @SerenaWinters So ... does that mean Ben Simmons is on the way too?  🤔😆 https://t.co/1uA3rsjKN7",
    "239": "@BallySportsCLE @SerenaWinters @cavs Take better care of her than NBCSPORTS Philly did",
    "240": "@BallySportsCLE @SerenaWinters @cavs Let me be your second Luv, no regrets❤️❤️🍷",
    "241": "@BallySportsCLE @SerenaWinters @cavs Now let’s all be able to watch it together!!!!",
    "242": "Washington Wizards Predictions and Preview for 12/30/2021 hosts Cleveland Cavaliers.  Find out who we are taking in this matchup. #Punters #Sportsbook https://t.co/yTzRHaqJvf",
    "243": "@TenaciousDV @BallySportsCLE @SerenaWinters @cavs @DreKnott He probably wants time with his family because he already a long baseball season",
    "244": "Cleveland Cavaliers vs. Washington Wizards - 12/30/2021 Free Pick &amp; NBA Betting Prediction https://t.co/RsNODB9Nve\n.\n#Betting #FreePicks \nhttps://t.co/RsNODB9Nve",
    "245": "@BallySportsCLE @SerenaWinters @cavs Get ready to “Throw the hammer down!”",
    "246": "Washington Wizards Predictions and Preview for 12/30/2021 hosts Cleveland Cavaliers.  Looking for betting action?  Find out if there is any value in our preview. #Punters #Sportsbook https://t.co/yTzRHaqJvf",
    "247": "@BallySportsCLE @SerenaWinters @cavs SIGNMANSAYS LETS GET CRACK-N https://t.co/t83ILygRMW",
    "248": "NBA ML. Date: 12-30\nCleveland Cavaliers vs Washington Wizards. 0.93%\nBetMGM. Cavaliers @ +135\nKambi. Wizards @ -130\n#arbitrage #bettingtwitter #bettingpicks #sportsbets #freepicks #freemoney #mlb",
    "249": "@cavs @dariusgarland22 @KendrickPerkins A mfing Lie. @MELOD1P is",
    "250": "Damn @SerenaWinters! Just as we were getting to know you again. Congratulations!  You have a fun team to cover. @cavs should be stoked.",
    "251": "@cavs @WashWizards @BallySportsCLE @betwayusa Too bad u won’t be able to play against the worst player in the NBA https://t.co/UGcqy0F4CA",
    "252": "@BallySportsCLE @SerenaWinters @cavs Welcome to Cleveland, Serena!",
    "253": "@bluntfudge @NotoriousPunk23 @cavs @RMFieldHouse They also said it when the TSA was established.",
    "254": "@thugaliers @cavs @RMFieldHouse Never mentioned any of that.  Just pointing out that you’re using masks as an excuse to dictate rules to people you don’t even know.  Hence calling you a petty tyrant.",
    "255": "@PhillyBuckets1 @cavs @RMFieldHouse Nope! How about you?",
    "256": "@JJetsSZNN @jakep316 @BallySportsCLE @SerenaWinters @cavs Nah you big mad now 👹",
    "257": "TIM ALCORN – THE VOICE OF THE CLEVELAND CAVALIERS / @CavsAlcorn  https://t.co/C4soRRlAcO",
    "258": "@elthsu @ramonashelburne @BallySportsCLE @SerenaWinters @cavs Literally won a championship",
    "259": "@BallySportsCLE @SerenaWinters @cavs Hey, can you please ask your new boss to work out a deal with streaming services so fans who cut cable can watch the team?",
    "260": "Consensus Line Move:\n2021-12-30 Cleveland Cavaliers at Washington Wizards from -4.00 to -3.00\n#LetEmKnow feeling frisky\n#NBA #sportsbook #python #marketing",
    "261": "@BallySportsCLE @SerenaWinters @cavs No Zum . No Serena . Had a great team there for a while",
    "262": "@JJetsSZNN @jakep316 @BallySportsCLE @SerenaWinters @cavs Yeah they had to make a new definition of clown up when they saw your comment on this post.",
    "263": "@KendrickPerkins @cavs @dariusgarland22 Nice words Perk!!!",
    "264": "@TheNBACentral I don’t know his name but clearly the Cleveland Cavaliers coach right?",
    "265": "@overtime @NBATV The moment @heydb is interviewing him(@KingJames) after they come back 3-1 to beat the 73-9 warriors. First title in Cleveland Cavaliers history. A promise a kid from Akron Ohio made. 👑",
    "266": "@cavs @WashWizards @BallySportsCLE @betwayusa Please update me on injury",
    "267": "@BallySportsCLE @SerenaWinters @cavs Congrats Serena on your new role, you did awesome on the sidelines with the Sixers",
    "268": "@cavs @BallySportsCLE @wtam1100 @wmms @Power891 @RocketMortgage Win it for Ricky",
    "269": "@RonnieBobonny @mcfaddenpick6 @KendrickPerkins @cavs @dariusgarland22 Tru, I honestly think it’s a fight between garland and FVV for the reserve spot",
    "270": "Teams that's should get more media recognition the chicago bulls Cleveland Cavaliers Memphis Grizzlies solely because all three of these teams are phenomenal basketball and  it's not talk about enough",
    "271": "@cavs @dariusgarland22 @KendrickPerkins Ricky for ALL star",
    "272": "@DreKnott @sixpak1175 @BallySportsCLE @SerenaWinters @cavs We were worried if they forgot about Dre",
    "273": "@NotoriousPunk23 @robindahood3187 @cavs @RMFieldHouse They definitely said this in the time when seatbelts became law lol",
    "274": "@cavs @WashWizards @BallySportsCLE @betwayusa Hopefully JB gives some min to Malik Newman to see what he can do.",
    "275": "@robindahood3187 @cavs @RMFieldHouse I mean I get it. We’re playing into the hand of big pharma. But this is dumbest fucking time to draw the line. Fight for policy but don’t discriminate against the actual vaccination and recommendations. I don’t see how masks offer incentive towards a hidden agenda",
    "276": "@robindahood3187 @cavs @RMFieldHouse Good we don't want plague rats in the building possibly infecting our players, staff and fans",
    "277": "@216kobraEli @cavs We need playmaking more than anything",
    "278": "@cavs if you need a motivated team player, who brings enthusiasm, joie de vivre, and an iffy 2-foot jumper, I'm in town and can suit up. https://t.co/xfF5I9hmbd",
    "279": "@Mobley_For_ROTY @cavs @WashWizards @BallySportsCLE @betwayusa it’s me",
    "280": "@okudah_szn @cavs @WashWizards @BallySportsCLE @betwayusa At all",
    "281": "Back in Washington, DC now for @cavs vs @WashingtonWizz tonight!🏀",
    "282": "@BallySportsCLE @SerenaWinters @cavs Too bad your not available to us who suscribe to Hulu. Rumor has we are missing something, but we don’t know for certain.",
    "283": "@BallySportsCLE @SerenaWinters @cavs Welcome to Cleveland!",
    "284": "@cavs @SerenaWinters take care of her, she’s a great one",
    "285": "@cavs @WashWizards @BallySportsCLE @betwayusa I was in CLE for the 45 point blowout of the Raptors a few days ago. Bringing that luck with me to DC tonight!",
    "286": "@cavs @WashWizards @BallySportsCLE @betwayusa Cavs play Basketball! https://t.co/6sPlHPk1mS",
    "287": "@Mobley_For_ROTY @cavs @WashWizards @BallySportsCLE @betwayusa The goat in the graphic",
    "288": "@cavs @WashWizards @BallySportsCLE @betwayusa In pangos we don’t trust",
    "289": "The Cleveland Cavaliers were the NBA's most unexpected surprise. I hope that won't change after losing one of their most valuable players in Ricky Rubio\nhttps://t.co/Y6nfcNrIEc",
    "290": "@ZTD08 @jakep316 @BallySportsCLE @SerenaWinters @cavs It’s a different meaning of clown",
    "291": "@DreKnott @sixpak1175 @BallySportsCLE @SerenaWinters @cavs Damn Andre, we need you in that role...",
    "292": "Bounce back opportunity!\n\n🆚 @WashWizards\n🕖 7:00PM ET\n📺 @BallySportsCLE\n\n@betwayusa | #GetItLocked https://t.co/pItvhUZEYE",
    "293": "@SYKsports @cavs Horrible. CJ, although hometown boy, id not on the Cavs timeline.",
    "294": "@resing @kirkgoldsberry @spurs @cavs No worries.",
    "295": "@BenchTalk__ @cavs Hell no why you want to lose cavs trying to break the playoffs without lbj curse",
    "296": "@resing @kirkgoldsberry @spurs @cavs Cavs are to the left of the Spurs. https://t.co/oCXV60oInY",
    "297": "@JJetsSZNN @jakep316 @BallySportsCLE @SerenaWinters @cavs Horny 🤡",
    "298": "@NothiNg_2_L0se @cavs @RMFieldHouse Lol that would require them to use logic. And nobody has done that since Covid began",
    "299": "@terrypluto One thing you didn't mention is how long @dariusgarland22 is likely to be out? That plays into whatever the @cavs do. Also, Quinn Cook has more championship rings than the entire Cavs roster combined.",
    "300": "@confidence_CM @cavs Simmons is not the answer at all we need buckets from our backcourt  something Simmons can't do plus he would cost us a lot of games at the ft line. Hard pass",
    "301": "@shabrielle_ @cavs @dariusgarland22 @KendrickPerkins I have faith that you’ll make the right choice",
    "302": "@curlyheadedfugg @cavs @dariusgarland22 @KendrickPerkins If I undo the retweet it will the vote not count 😰",
    "303": "@sixpak1175 @BallySportsCLE @SerenaWinters @cavs Umm no",
    "304": "@mattjhill71 @cavs @evanmobley @keybank Mobley defense is so far ahead of Cade it’s not even funny. Offensively Cade doesn’t even have that much of a advantage over Mobley.",
    "305": "@cavs @shabrielle_ @dariusgarland22 @KendrickPerkins That would be Jrue Holiday. Nice attempt though.",
    "306": "@TracyEMorse1 @cavs @SerenaWinters Do you really have to be from Ohio to do a job lol your logic https://t.co/6iqCYAvdBM",
    "307": "@nelly_lll @cavs @BallySportsCLE @wtam1100 @wmms @Power891 @RocketMortgage Pangos gonna go 0/16 from 3 lmao",
    "308": "@cavs best trade to make\n#LetEmKnow https://t.co/FzbiCf7ksP",
    "309": "@BallySportsCLE @SerenaWinters @cavs Congratulations. Philly blew it letting you leave.",
    "310": "@cavs I heard that @imanshumpert is interested in playing still! Let’s bring him back home!",
    "311": "@BallySportsCLE @SerenaWinters @cavs Sixers should have never gotten rid of her",
    "312": "@jive_turkey69 @NickCaminoWKYC @KingJames @cavs Lol reality will set in soon enough",
    "313": "@hardstyleblvnts @JacobRobert0806 @cavs @RMFieldHouse I see you are hurt personally 😆",
    "314": "@HipsterTito @JFull78 @Emetz0916 @DreKnott @cavs Lol what??",
    "315": "@hardstyleblvnts @JacobRobert0806 @cavs @RMFieldHouse Lol twitter is real life? \n\nMove on son",
    "316": "@BallySportsCLE @SerenaWinters @cavs Let’s go!",
    "317": "@Charmader6 @cavs @BallySportsCLE @wtam1100 @wmms @Power891 @RocketMortgage Oh dear lord 😩",
    "318": "@Johnjoh15685768 @hardstyleblvnts @JacobRobert0806 @cavs @RMFieldHouse What the fuck is a mastache? \n\nIs that what your girl gets when she eats her clients b-hole?\n\nWere you trying for mustache? https://t.co/rVNkyAz7vf",
    "319": "@BallySportsCLE @SerenaWinters @cavs Damn @DreKnott got canned already.",
    "320": "@thugaliers @cavs @RMFieldHouse I never claimed to be serving the ‘greater good’.  You might, but you’re really just playing the part of the petty tyrant.",
    "321": "@Arya57053423 @mcfaddenpick6 @KendrickPerkins @cavs @dariusgarland22 I agree with that but I also think Garland heavily contributes to the success of our bigs at least on offense. He may be in a better situation than FVV but is still an enormous part of our success. Tough to compare them because of their situations though",
    "322": "@BallySportsCLE @SerenaWinters @cavs Don't know who she is...but @BallySportsCLE has been doing a great job of finding the next one to move on to bigger and better things, so I figure this is also a great hire.",
    "323": "@evan_CTOWN @cavs @RMFieldHouse Imagine being so ignorant that you think the number is that low.  Look at their post half the comments are people saying they won’t go.  You would have gone either way.  There was no gain here for them.  Only loss.  It’s an awful business move.",
    "324": "@hardstyleblvnts @JacobRobert0806 @cavs @RMFieldHouse Ok Mr 1100 follower gamer bro. What a shitty inconsequential life.",
    "325": "@cavs @SerenaWinters WELCOME!!!",
    "326": "Why The Cleveland Cavaliers Trading For Ben Simmons Or Caris LeVert — Or Anyone Else — Is Complicated https://t.co/GzawCWhDVq",
    "327": "@robindahood3187 @cavs @RMFieldHouse If you were a billion dollar business you’d want to hear from 0.00001% of your customers on Twitter about how they think their opinion is greater than the majority?",
    "328": "@robindahood3187 @jaymesbawned @cavs @RMFieldHouse Okay let’s hear your 5-head take on COVID",
    "329": "@robindahood3187 @cavs @RMFieldHouse And you’re serving the greater good? Nah you’re serving yourself and your own putrid agenda with absolutely no base or deliberation",
    "330": "Explore the full FW21 / Cleveland Cavaliers Team Issued Collection at the @CavsTeamShop on 12.31.21 at Rocket Mortgage FieldHouse https://t.co/sxtizG3h9h",
    "331": "@Benshu03 @cavs @RMFieldHouse So wear a mask?",
    "332": "@bulldurham60 @BallySportsCLE @SerenaWinters @cavs No thanks",
    "333": "@NotoriousPunk23 @cavs @RMFieldHouse So you can take it off if you want?",
    "334": "@cavs @KendrickPerkins @dariusgarland22 Inspired by the best #NBA team🔥 https://t.co/g3x0A9QCKm",
    "335": "@Johnjoh15685768 @jaymesbawned @cavs @RMFieldHouse Her O face is a cringe!  How’d you know!?",
    "336": "@Johnjoh15685768 @hardstyleblvnts @JacobRobert0806 @cavs @RMFieldHouse Did you just create a sock to talk shit?\n\nChildren these days. https://t.co/qDlcXNpZVt",
    "337": "@ToneTone21 @cavs @rickyrubio9 Lol they could use you too.",
    "338": "Bally Sports Ohio welcomes new Cleveland Cavaliers sideline reporter, @SerenaWinters  https://t.co/BzdwTb4EcM",
    "339": "Spend your evening listening to the Cleveland Cavaliers vs. the Washington Wizards game!  Pregame is at 6:30pm and the game starts at 7pm.  Tune in to WLEC then! https://t.co/PTT46hddyI",
    "340": "@BallySportsCLE @SerenaWinters @cavs 😭😭😭😭😭😭😭😭😭😭😭😭😭😭 CONGRATS!!! 😭😭😭😭😭😭😭😭😭😭😭😭😭",
    "341": "@Spas_tik_ @jmbyler @cavs @RMFieldHouse You think cavs fans are the mighty ducks or something?  Weird you get so mad about me not coming to the game.  Like an angry ex gf or something.",
    "342": "@ShotZz1_ @jk2512131 @cavs @BallySportsCLE @wtam1100 @wmms @Power891 @RocketMortgage mobley’s gonna have to put up 40 points 25 rebounds 15 assists for us to have a chance at winning",
    "343": "@BallySportsCLE @SerenaWinters @cavs @SerenaWinters you cant get away from Turkish NBA fans. After @FurkanKorkmaz, now @cediosman. It’s nice to be able to see you again.",
    "344": "@PRlMEWINDLER @nvmpq @stlaxstla @kidnamed_matty @twithersAP @cavs I know.. very weird",
    "345": "@Johnjoh15685768 @jaymesbawned @cavs @RMFieldHouse No your mom does.",
    "346": "@DanillevanVeen1 @jk2512131 @cavs @BallySportsCLE @wtam1100 @wmms @Power891 @RocketMortgage he was averaging 18 points and 4 assists in the g league this season, worth a shot, at least we have mobley and okoro 😂",
    "347": "@robindahood3187 @nvmpq @stlaxstla @kidnamed_matty @twithersAP @cavs Yeah im a cheerleader for a person I’ve never met",
    "348": "Why The Cleveland Cavaliers Trading For Ben Simmons Or Caris LeVert — Or Anyone Else — Is Complicated https://t.co/feFfefBTnk https://t.co/1nFkmy48aq",
    "349": "#SportsMoney #sportsmoney Why The Cleveland Cavaliers Trading For Ben Simmons Or Caris LeVert — Or Anyone Else — Is Complicated: In theory, the Cleveland Cavaliers make sense as a team that could be buyers before February’s trade deadline. But it's… https://t.co/M1dmQkuqCH",
    "350": "@robindahood3187 @jmbyler @cavs @RMFieldHouse And we don't care about yours now either. We also are happy that you won't be at any other Cavs games.  You're not wanted.  You aren't a real fan anyway.  Fans band TOGETHER. You think you're special.  You're NOT. Sorry that you're not strong enough to wear a mask. #RealCavsfans",
    "351": "Sistema #NBA75 🏀\n\nCleveland Cavaliers vs Washington Wizards\n6:10 P.M. \n\nCAVALIERS +3.5\n\nMomio: -110\n\n#LetEmKnow    @cavs \n\n#CLEvsWAS \n\n#FreePick https://t.co/ChEfV16w8k",
    "352": "@BallySportsCLE @SerenaWinters @cavs 🖕🏽🖕🏽 you Bally still doesn’t matter when half of Cleveland can’t watch 🤷🏽‍♂️",
    "353": "Never comply to Insanity! RT @ClayTravis: If you’re going to a Cleveland Cavaliers game — why would you? — all fans ages two and up —TWO! — have to wear masks now. It’s simply amazing how many people in sports continue to embrace failed covid policies... https://t.co/fSRsivLo0q",
    "354": "@Spas_tik_ @cavs @RMFieldHouse Why do you hate freedom of speech so much?",
    "355": "@hardstyleblvnts @JacobRobert0806 @cavs @RMFieldHouse Lol bitch I'm a fine looking man with beautiful offspring.  \n\nAnd what the fuck is up with your tats? Did Michael j fox do them?",
    "356": "have 11 teams left for Break\n\nBoston Celtics - 12\nChicago Bulls - 15\nCleveland Cavaliers - 12\nHouston Rockets - 6\nIndiana Pacers - 6\nLos Angeles Lakers - 15\nNew Orleans Pelicans - 12\nOklahoma City Thunder - 12\nPhiladelphia 76ers - 22\nSacramento Kings - 22\nSan Antonio Spurs - 10 https://t.co/ZPug8A9G2a",
    "357": "@JJetsSZNN @ZTD08 @BallySportsCLE @SerenaWinters @cavs By horny I don't think he is referring to you being covered in horns. \n\nI think he is referring to the fact that you saw a picture of a lady and then posted about how she is turning you on (the other definition of horny)",
    "358": "@ramonashelburne @BallySportsCLE @SerenaWinters @cavs Just throwing this out there: the lakers haven’t been dominant since @SerenaWinters left…",
    "359": "@cavs @SerenaWinters Welcome to Cleveland.",
    "360": "@BallySportsCLE @SerenaWinters @cavs Great hire by Bally!",
    "361": "@BallySportsCLE @SerenaWinters @cavs Phenomenal hire!  Congrats!",
    "362": "@justinbennett12 @JacobRobert0806 @cavs @RMFieldHouse Have you seen your picture.  You are the last person who should ever talk about someone's appearance",
    "363": "@BallySportsCLE @SerenaWinters @cavs Congratulations!!! Well deserved. We will miss you!",
    "364": "@JacobRobert0806 @hardstyleblvnts @cavs @RMFieldHouse Meth don't fuck around",
    "365": "@BallySportsCLE @SerenaWinters @cavs You’re getting a good one!! @NBCSPhilly your loss because you’re to damn cheap!!!!!",
    "366": "@Johnjoh15685768 @jaymesbawned @cavs @RMFieldHouse Why would I be pretending?  And yes you took 5 seconds out of your day to comment.  If you didn’t care you’d have used those 5 seconds differently.",
    "367": "@BallySportsCLE @SerenaWinters @cavs Oh no! - what about our man @DreKnott",
    "368": "@BallySportsCLE @SerenaWinters @cavs Should be @sixers but congrats anyway",
    "369": "@BallySportsCLE @SerenaWinters @cavs I still miss having @SerenaWinters as the Sixers sideline reporter. Congratulations on your new gig Serena. Cavs are getting a good one",
    "370": "@BallySportsCLE @SerenaWinters @cavs Talking about bittersweet...",
    "371": "Thrilled to welcome this incredible talent into our @Cavs family!!!\n\nCan’t wait to get started, @SerenaWinters….  Let’s GO!!!! https://t.co/HrwVmrSlwR",
    "372": "@truth21666 @cavs @RMFieldHouse Don't forget the eating/drinking loophole.\n\nAs long as you are continously drinking beer you have nothing to fear",
    "373": "@cavs @keybank Can the team sign someone like Jeremy Lin or something? A cheap NBA caliber backup PG",
    "374": "@ZTD08 @BallySportsCLE @SerenaWinters @cavs How’s that make horny",
    "375": "@RaTeD_RMN @NickCaminoWKYC @KingJames @cavs No I think they can beat any team right now. Once they get Allen and Garland back.",
    "376": "Do not blow this up @cavs",
    "377": "@BallySportsCLE @SerenaWinters @cavs .@Cavs are so lucky to have you, @SerenaWinters! Huge congrats! See you on the sideline soon 🤩🏀",
    "378": "Cleveland Cavaliers Roster https://t.co/VxK0cIOCgN",
    "379": "@cavs @SerenaWinters Congratulations Serena!",
    "380": "The partnership between @TRRFoundation and Prayers From Maria highlights the importance of supporting children battling cancer.\n\n A heartfelt thank you to you, Ricky, we wish a you speedy recovery. \n\nVisit https://t.co/LuN1n3YwAK to read our interview with @cavs @rickyrubio9 https://t.co/cWTBsjL44j",
    "381": "@NotoriousPunk23 @cavs @RMFieldHouse Never thought freedom could be so hard for some people.  Seems especially hard for anyone with a anime character in their profile picture.",
    "382": "@BallySportsCLE @SerenaWinters @cavs cavs really the best team wow",
    "383": "@cavs @SerenaWinters Congrats, @SerenaWinters so happy for you!! Crush it, lady!",
    "384": "@resing @kirkgoldsberry @spurs @cavs Spurs are clearly the second best offense on the chart. Charlotte is a tick behind them and then comes the Cavs.",
    "385": "@BallySportsCLE @SerenaWinters @cavs Congratulations!",
    "386": "@BallySportsCLE @SerenaWinters @cavs Can she play PG?",
    "387": "@Johnjoh15685768 @jaymesbawned @cavs @RMFieldHouse Then why are you commenting?",
    "388": "@BallySportsCLE @SerenaWinters @cavs Yay for @SerenaWinters !!",
    "389": "The @cavs have scored 100+ PTS in 17 consecutive games, averaging 113.9 PPG over that stretch (since Nov. 22). \n\nIt is tied for the 5th longest streak of 100+ points in team history and is their longest since Nov. 1-Dec. 21, 2017 (26 games). #LetEmKnow",
    "390": "It’s the final game of 2021 for the Wizards as they look to get back above .500 hosting the surprising team in the NBA the Cleveland Cavaliers #DCAboveAll https://t.co/mVXM2mZ7Fd",
    "391": "The @cavs will wrap up their 2-game road trip tonight against the Wizards. Cleveland won their most recent visit at Capital One Arena, a 116-101 victory on Dec. 3.\n\nGame Notes 12/30/21 - #CavsWizards: Overall Game #35, Road Game #18\nhttps://t.co/8VyZuvYhre",
    "392": "@robindahood3187 @cavs @RMFieldHouse “You damn people, stop trying to take away my freedom by telling me to wear a seatbelt while driving. It should be my choice if I wanna hit a post and fly though my windshield” - guy butthurt cause he has to wear a mask at a sporting event 🤷‍♂️",
    "393": "@cavs @SerenaWinters Welcome to Cleveland!",
    "394": "📰 Washington Wizards vs Cleveland Cavaliers Preview Dec 30!\n👉 https://t.co/wdPBFjaKsx @wagertalk",
    "395": "@nelly_lll @cavs @BallySportsCLE @wtam1100 @wmms @Power891 @RocketMortgage Probably pangos",
    "396": "@BallySportsCLE @SerenaWinters @cavs Best in the business",
    "397": "@BallySportsCLE @SerenaWinters @cavs Congrats Serena! You're awesome and Cleveland got a great one",
    "398": "@BallySportsCLE @SerenaWinters @cavs Serena is the best! We miss her in Philadelphia!",
    "399": "Analyzing Thursday’s Cleveland Cavaliers at Washington Wizards odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/N4Ny1ex0t7",
    "400": "@JJetsSZNN @BallySportsCLE @SerenaWinters @cavs Bruh why you so horny",
    "401": "@DreKnott do you have any information on what @cavs might do at PG now?  I assume Valentine will start.",
    "402": "@ShotZz1_ @jk2512131 @cavs @BallySportsCLE @wtam1100 @wmms @Power891 @RocketMortgage idk much about him, but he can’t be much worse than what we have available now",
    "403": "@BallySportsCLE @SerenaWinters @cavs Lucky you.    Philly was too damn cheap to keep her.   Best of luck to you.",
    "404": "@cavs @keybank Anyone coming back tonight",
    "405": "@cavs @keybank We need him back https://t.co/J16Z22kaCo",
    "406": "@swanks08 @BethHMcLeod @KingJames @CavsFredMcLeod @cavs @RealAClifton @channingfrye @Rjeff24 The pleasure Cavs fans get watching the Cavs beat the Chicago Bulls, in any era.",
    "407": "@Tommy_Sco @cavs @dariusgarland22 @KendrickPerkins No God please no he sucks sexton is way better I'd rather pay sexton the money that Simmons is making and he would probably sign for a bit less",
    "408": "Tier 2: \nMiami Heat\nBrooklyn Nets\nIndiana Pacers \nToronto Raptors\nCleveland Cavaliers \nMilwaukee Bucks\nWashington Wizards\nPhoenix Suns\nUtah Jazz\nHouston Rockets\nLos Angeles Clippers\nDenver Nuggets\nPortland Trailblazers \nSan Antonio Spurs\nAtlanta Hawks",
    "409": "@ogkore3 @cavs @keybank Never saw him play. I think this will be a very hard game today",
    "410": "@OGDAD_B @cavs @rickyrubio9 What they really need is me out there shiiii",
    "411": "@BallySportsCLE @SerenaWinters @cavs massive W",
    "412": "Clay: Add the Cleveland Cavaliers to the list of those forcing failed policies on their paying fans. https://t.co/8cflo6MuWN",
    "413": "@RonnieBobonny @mcfaddenpick6 @KendrickPerkins @cavs @dariusgarland22 Lauri, love , osman, wade. Not saying raptors don’t have better wings cause they do (not being bias) but having 2 solid centres helps space the floor which helps ur wings flourish. Raptors don’t have any good bigs so we’re always running through our wings which makes it tough.",
    "414": "@Milan_98O @cavs @keybank we should play RJ nembhard, good solid PG/SG who can handle the ball and attack the basket well, haven’t seen him play much d this season",
    "415": "@TA4Trey @cavs @SerenaWinters I know right 😂😂",
    "416": "@BallySportsCLE @SerenaWinters @cavs Eh. Idk about this one. Doesn't feel like it's real enough or She isn't Cleveland enough. Y'all can drool all you want but I don't hear nor see that passion from her so... idk.",
    "417": "@BallySportsCLE @SerenaWinters @cavs Woah she’s bad 😍😍😍",
    "418": "@BallySportsCLE @SerenaWinters @cavs Congratulations 🍾",
    "419": "@cavs @SerenaWinters Welcome and happy for you",
    "420": "There's a new @cavs sideline reporter on @BallySportsCLE. @SerenaWinters, who most recently produced and hosted Locked on 76ers, a daily podcast in Philadelphia focused on the @sixers, starts Sunday, Jan. 2, for the @cavs/@Pacers game.\nhttps://t.co/1gCnJRw45U",
    "421": "@cavs @keybank I need him and jarrett Allen back",
    "422": "@cavs @keybank Do we have a point guard today beside pangos who is not nba Level?",
    "423": "@BallySportsCLE @SerenaWinters @cavs Lucky break. Welcome to the land!  Tell them to get a deal done with YouTube tv",
    "424": "@cavs @keybank Need him to carry tonight😈",
    "425": "@Arya57053423 @mcfaddenpick6 @KendrickPerkins @cavs @dariusgarland22 “Nice wing players” like who?? Markkanen? The raptors are much more fit at the wing than Cleveland",
    "426": "@BallySportsCLE @DreKnott @SerenaWinters @cavs Nice!",
    "427": "The rook #EvanMobley is ready for more 😤\n\n@KeyBank | #NBAAllStar",
    "428": "@BallySportsCLE @SerenaWinters @cavs Welcome to Cleveland!! @SerenaWinters",
    "429": "Goran Dragic to the Cleveland Cavaliers makes a whole lot of sense right about now.",
    "430": "@BallySportsCLE @SerenaWinters @cavs Nice intro and welcome aboard!",
    "431": "@BallySportsCLE @SerenaWinters @cavs Actually, you're covering the most talented and exciting NBA team in the league. When it gets warm and back in NBA Playoffs( spring)... the world of basketball will be here. Your profile should explode.",
    "432": "2003-2010 Cleveland Cavaliers\n2010-2014 Miami Heat\n2014-2018 Cleveland Cavaliers\n2018-Present Los Angeles Lakers\n\nAll these teams he’s been on he has won an NBA Title at least once.\n\nHappy Birthday King https://t.co/Bz7uukHkMY",
    "433": "I'm not completely against the @cavs going after Ben Simmons or John Wall.  I also wouldn't mind just going after a cheaper option.  What is Jeff Teague doing these days?",
    "434": "Ricky Rubio of the Cleveland Cavaliers has a torn ACL in his left knee and will miss the rest of the season.\nSNKRS\n14K\nNotifications\n115K\nHappy New Year\n514K\n#MayoBowl\nSouth Carolina\nSam Howell\nJaheim Bell\nBart Scott\n#LoveSTAY\n207K\nMack Brown https://t.co/B7xanxLukK",
    "435": "@CBrowns79 @cavs @RMFieldHouse I am in tears over you saying fkn on Twitter.",
    "436": "@CSS1491 @BallySportsCLE @SerenaWinters @cavs They really did.  She is so talented.",
    "437": "@NBAStatNerd @TommyTwoguns7 @cavs @BallySportsCLE @wtam1100 @wmms @Power891 @RocketMortgage Yeah but he might not play tonight due to conditioning",
    "438": "@BallySportsCLE @SerenaWinters @cavs She's the best!  Y'all are lucky, Cleveland.  Miss you in Philly @SerenaWinters",
    "439": "@BallySportsCLE @SerenaWinters @cavs Keep Andre knott",
    "440": "@BallySportsCLE @SerenaWinters @cavs CavsLand welcome @SerenaWinters’ @OhioGreatLakesBallySports'\n\nhttps://t.co/SbsSgOri6Q",
    "441": "@CBrowns79 @cavs @RMFieldHouse You can spell fucking here, child, it’s okay it won’t offend me.",
    "442": "Happy birthday Lebron James. #LeBronJames #LosAngelesLakers #clevelandcavaliers #miamiheat #nbachampion https://t.co/IWsnYMqiMS",
    "443": "@hardstyleblvnts @SMS61916 @JacobRobert0806 @cavs @RMFieldHouse For working so much you sure do have a lot of time to argue with strangers on the internet",
    "444": "@cavs @SerenaWinters Congrats Serena!!!! Cleveland is a special place 😊",
    "445": "@BallySportsCLE @SerenaWinters @cavs Justice for @DreKnott",
    "446": "Ricky Rubio of the Cleveland Cavaliers has a torn ACL in his left knee and will miss the rest of the season. Ricky Rubio of the Cleveland Cavaliers has a torn ACL in his left knee and will miss the rest of the season. SNKRS 14K Notifications... https://t.co/6295XiCNnl",
    "447": "@CBrowns79 @cavs @RMFieldHouse How dare I not comply!?",
    "448": "@BallySportsCLE @DreKnott @SerenaWinters @cavs Welcome aboard Serena! You have big shoes to fill? (#askinJackson)",
    "449": "Ricky Rubio of the Cleveland Cavaliers has a torn ACL in his left knee and will miss the rest of the season. Ricky Rubio of the Cleveland Cavaliers has a torn ACL in his left knee and will miss the rest of the season. SNKRS 14K Notifications... https://t.co/2qF0iEVbT1",
    "450": "@Jacob_DiPietro1 @cavs @RMFieldHouse Jacob: I’m NoT GoInG nOw!!!\n\nAlso Jacob: *wasn’t going anyway",
    "451": "@hardstyleblvnts @CoryFromPreble @JacobRobert0806 @cavs @RMFieldHouse How much \"safer\" can you be alone in Mom's basement playing video games on Twitch all day?",
    "452": "@BallySportsCLE @SerenaWinters @cavs Congratulations Serena!",
    "453": "@moviematt85 @cavs @RMFieldHouse Them: I’m NoT GoInG nOw!!!\n\nAlso them: *wasn’t going anyway",
    "454": "@Tim_K79 @cavs @SerenaWinters Lmao, okay bud. I’m sure you say the same when you feel like too many dudes are being hired?",
    "455": "@Faazzla @WashWizards @cavs They're both listed as questionable for this game. I guess it will depend on the test they'll have today but there is a possibility they play.",
    "456": "@SKIPdaZIP @cavs @RMFieldHouse Thanks for keeping us safe by staying home.",
    "457": "@BallySportsCLE @SerenaWinters @cavs I would love to watch a @SerenaWinters and @Angel_Gray1 Sideline 2 Sideline chat on IG. #LetEmKnow #NBATwitter",
    "458": "@KingJames ruined his legacy by bringing his personal politics into the game and now his uneducated views on #Omicron. Sad to see but love the @cavs without him. 🏀 https://t.co/FjVOoXXiur",
    "459": "@duclerZ @WashWizards @cavs Ducler, you got intel that Beal and KCP are playing?",
    "460": "@cavs @SerenaWinters Congrats Serena! Will miss your Sixers coverage.",
    "461": "@TommyTwoguns7 @cavs @BallySportsCLE @wtam1100 @wmms @Power891 @RocketMortgage Allen is out of protocols",
    "462": "@Process___That @cavs @SerenaWinters Really miss her in LA.\n\nCavs, you got a great one.",
    "463": "@OHsportsballfan @robindahood3187 @cavs @RMFieldHouse Slave",
    "464": "@cavs @SerenaWinters Congrats",
    "465": "@BallySportsCLE @SerenaWinters @cavs Congrats Serena! Miss you on the sidelines in Philadelphia",
    "466": "@cavs @SerenaWinters Honestly you should just keep @DreKnott . The man is the 🐐",
    "467": "It b hilarious watching people make excuses for not being able to Guard me instead of jus complimenting my Game. I literally don’t even try, nor train. @cavs honestly need me now that @rickyrubio9 is out. Speedy recovery tho, speedy recovery.",
    "468": "@BallySportsCLE @SerenaWinters @cavs Welcome to Cleveland!!! @SerenaWinters",
    "469": "Welcome to #TheLand! Shoutout to my dude @DreKnott - he killed it, as usual. @cavs https://t.co/AlaWWNHHyo",
    "470": "@BenSteeleMJS Cavs could probably use him with Ricky Rubio going down &amp; Garland in the Covid protocols @cavs",
    "471": "@BallySportsCLE @SerenaWinters @cavs Please Cleveland take Ben Simmons.  We’ll take Serena, straight up for him",
    "472": "@cavs @BallySportsCLE @wtam1100 @wmms @Power891 @RocketMortgage So who's running the point? 😂",
    "473": "@BallySportsCLE @SerenaWinters @cavs Welcome to Cleveland!! Best wishes!! 🏀📺🥳",
    "474": "Cleveland Cavaliers Basketball e Regatas https://t.co/AjUOBo2gaT",
    "475": "@BallySportsCLE @SerenaWinters @cavs Good luck, @SerenaWinters! We'll miss you in Philly.",
    "476": "@LaurenMRosen @cavs @SerenaWinters Sure did!",
    "477": "@BallySportsCLE @SerenaWinters @cavs So happy for you Serena! Congrats! Great news going into the new year!",
    "478": "@BallySportsCLE @SerenaWinters @cavs Welcome!",
    "479": "@cmillsnbcs @WashWizards @cavs @NBCSWashington @RealDealBeal23 I see the label, but dont recognize the figure standing there.",
    "480": "Love this so much. \n\nThe @cavs got a good one!\n\nCongrats, @SerenaWinters 💙❤️ https://t.co/uOrHPNgfvM",
    "481": "@BallySportsCLE @SerenaWinters @cavs good job, Bally Sports",
    "482": "NBA Games Today: 12/30/2021\n🥇| Philadelphia 76ers vs Brooklyn Nets\n🥈| Milwaukee Bucks vs Orlando Magic\n🥇| Washington Wizards vs Cleveland Cavaliers\n🥇| Golden State Warriors vs Denver Nuggets\nNOTE: All Ratings Are Calculated By PCT",
    "483": "the @cavs have two paths in their quest to find someone who can pass the ball to kevin love https://t.co/4Rwemq5Gxm",
    "484": "Thank you @DreKnott for pinch hitting with the @Cavs.  I hope we see you sooner than later at Spring Training. #HappyNewYear",
    "485": "@BallySportsCLE @SerenaWinters @cavs Greatly missed in PHI.\nAnd don’t underestimate her ability to do play-by-play, as well.",
    "486": "@cavs @SerenaWinters Congrats @SerenaWinters ! They’re lucky to have you!",
    "487": "@cavs @RMFieldHouse howd i know there would be a bunch of cry babies in the comments",
    "488": "@BallySportsCLE @cavs @SerenaWinters Welcome to Cleveland! Joining at just the right time!! GO CAVS! #LetEmKnow",
    "489": "@BallySportsCLE @SerenaWinters @cavs Congrats @SerenaWinters well deserved!!! Sixers legend always",
    "490": "Bally Sports Cleveland has a new sideline reporter for Cavs games. That's a shame because I've really enjoyed watching Andre Knott do his thing. \n\nHopefully, you continue to cover the team in some way @DreKnott \nRegardless, thanks for your excellent work!\n\n@cavs @BallySportsCLE",
    "491": "@BallySportsCLE @SerenaWinters @cavs Congratulations Serena!!!",
    "492": "@cavs @SerenaWinters Treat her well",
    "493": "@BallySportsCLE @SerenaWinters @cavs Let’s go Serena!!",
    "494": "@BallySportsCLE @SerenaWinters @cavs Go cavs",
    "495": "@BallySportsCLE @SerenaWinters @cavs Serena...Welcome to Cleveland! Love your energy.  It truly comes through, &amp; I can tell you're genuinely excited. Quick note. No one from Cleveland actually calls it \"The Land\". I know its out there and it floats about in the media, but those from here...really don't say it.",
    "496": "@BallySportsCLE @SerenaWinters @cavs Welcome Serena! Can’t wait to hear you during games!",
    "497": "@BallySportsCLE @SerenaWinters @cavs Welcome ❤️",
    "498": "@BallySportsCLE @SerenaWinters @cavs Sixers dropped the ball here but good luck in Cleveland",
    "499": "@ClayTravis @cavs I identify as a 1 year old. I’m exempt. Thanks.",
    "500": "The Cleveland Cavaliers announce @SerenaWinters as the new sideline reporter. Congrats to Serena, and welcome to Cleveland!\n\n#LetEmKnow",
    "501": "@BallySportsCLE @SerenaWinters @cavs Welcome to the Cavs family! 🙌",
    "502": "@cavs @RMFieldHouse Even dumber decision than extending Kevin Love",
    "503": "@BallySportsCLE @cavs @SerenaWinters she single?!?",
    "504": "@BallySportsCLE @SerenaWinters @cavs Congratulations, Serena!",
    "505": "@resing @kirkgoldsberry @spurs @cavs that’s not true Tom",
    "506": "@BallySportsCLE @SerenaWinters @cavs AMAZING @SerenaWinters!!!\n\n💙❤️",
    "507": "@BallySportsCLE @SerenaWinters @cavs Cavs got a good one. She was fantastic with the Sixers.",
    "508": "@BallySportsCLE @SerenaWinters @cavs Not only was she taken away from us sixers fans, now she’s gone for good. Congrats Serena and best of luck in Cleveland! https://t.co/dTb9xplYCX",
    "509": "@BallySportsCLE @SerenaWinters @cavs Congratulations @SerenaWinters!",
    "510": "@cavs @RMFieldHouse ThEy’Re GoNnA wOrK tHiS tImE!",
    "511": "@cavs @SerenaWinters @SerenaWinters is the best in the business. Really miss her in Philly. \n\nCavs, you got a great one.",
    "512": "@SnoopyHo_ @cavs @SerenaWinters Serena winters",
    "513": "@BallySportsCLE @SerenaWinters @cavs Congrats Serena, you killed locked. To the booth soon.",
    "514": "@BallySportsCLE @SerenaWinters @cavs Welcome @SerenaWinters!",
    "515": "@BallySportsCLE @SerenaWinters @cavs Congrats",
    "516": "@BallySportsCLE @SerenaWinters @cavs Serena is the best!",
    "517": "@BallySportsCLE @SerenaWinters @cavs Hello @SerenaWinters - welcome to #LetEmKnow 🏀’s",
    "518": "@BallySportsCLE @cavs @SerenaWinters Rather have Andre",
    "519": "@BallySportsCLE @SerenaWinters @cavs Welcome to the team!!",
    "520": "@cavs @SerenaWinters Trade for a point guard",
    "521": "@iLived_iLoved_ @BallySportsCLE @SerenaWinters @cavs He was just an interim",
    "522": "@BallySportsCLE @SerenaWinters @cavs Congrats Serena! Welcome to Cleveland!",
    "523": "@BallySportsCLE @SerenaWinters @cavs Congrats!!! Welcome to the team!",
    "524": "@BallySportsCLE @SerenaWinters @cavs Damn Andre was that bad? Lol",
    "525": "@cavs @SerenaWinters She gonna be our backup point guard?\n\nIn all seriousness, welcome @SerenaWinters!",
    "526": "@RealPeterBalla @NBAPaint1 @cavs @Lakers @MiamiHEAT @dallasmavs @memgrizz Fingers crossed that I don’t get crossed",
    "527": "@cavs @SerenaWinters Can she play point guard?",
    "528": "@BallySportsCLE @cavs @SerenaWinters Congratulations Serena 👊",
    "529": "@BallySportsCLE @SerenaWinters @cavs Welcome! https://t.co/3raUKy3dUA",
    "530": "@CLETalkingHeads @923TheFan \nThe @cavs should go after the #Bulls #AlexCaruso he would be the perfect fit for the #Rubio spot\n#LetEmKnow \n@Thesportsfeller",
    "531": "Welcome to The Land, @SerenaWinters! 👋 https://t.co/UPlcSdEzev",
    "532": "@BallySportsCLE @SerenaWinters @cavs Oh yeahh. Welcome serena !!! @SerenaWinters !!!",
    "533": "Important Game tonight. \n@WashWizards @cavs \n#nba\n#nbcsportswashington\n#DCAboveAll \n#TVparty https://t.co/005bEnS5RC https://t.co/K1xaILoG9w",
    "534": "@AlexWaffleGibbs @NBAPaint1 @cavs @Lakers @MiamiHEAT @dallasmavs @memgrizz I think you’re in for a job, mate.",
    "535": "@JacobRobert0806 @cavs @RMFieldHouse You saved a picture of me in a crop top to your phone. Good Job. Smooth brain is smooth brained.",
    "536": "@thugaliers @jaymesbawned @cavs @RMFieldHouse You listen to the experts you’re told to listen to without questioning it for two years straight.  I’m not an expert on vitality I just know how to think for myself which is apparently rare.",
    "537": "@JacobRobert0806 @jaymesbawned @robindahood3187 @cavs @RMFieldHouse Lmfao keep trying",
    "538": "@ihatetw58671168 @Zaknoble @cavs A 10-day contract is alot of money?",
    "539": "Wanted some @NBA action before the end of the year? We got you covered 😉 tonight @WashWizards will face @cavs and here is the preview of this game.\n\nWho you got?\n\nhttps://t.co/ovFF4URJFr\n\n#NBAXmas #Cavs #Wizards",
    "540": "If you’re going to a Cleveland Cavaliers game — why would you? — all fans ages two and up —TWO! — have to wear masks now. It’s simply amazing how many people in sports continue to embrace failed covid policies that don’t work at all. https://t.co/9KsqNfHWxm",
    "541": "@rickyrubio9 @cavs fans behind you long road ahead, rehab can be draining but I’ve been there too.  Stay strong!  We want you back.",
    "542": "@NBAPaint1 I’m 6’3 and a half with a long wingspan and have been vaccinated due to work @cavs @Lakers @MiamiHEAT @dallasmavs @memgrizz y’all need a Pg?",
    "543": "@cmillsnbcs @NBCSWashington @WashWizards @cavs @RealDealBeal23 You cover a lot of bases, I see... and do it well! They (and viewing audience) are lucky to have you.",
    "544": "@robindahood3187 @jaymesbawned @cavs @RMFieldHouse I listen to experts??? You must be a pro on virality when it comes to COVID please break it down for me",
    "545": "@BallySportsCLE @SerenaWinters @cavs What Up Serena! Welcome to the Land! @Angel_Gray1 left some big 👠 s to fill and @DreKnott brought some of that dugout feel to the hardwood. Cant wait to have you fall in love with this team.",
    "546": "@BallySportsCLE @SerenaWinters @cavs Welcome!",
    "547": "Here’s @SerenaWinters’ message to @cavs fans https://t.co/gjF7kjTKxe",
    "548": "@BallySportsCLE @SerenaWinters @cavs Be happier if you announced a deal w @hulu",
    "549": "🔮 NBA ELO Win Probabilities for December 30\n@cavs 59.7% @washwizards 40.3%\n@Bucks 84.8% @OrlandoMagic 15.2%\n@sixers 28.5% @BrooklynNets 71.5%\n@warriors 67.8% @nuggets 32.2%\n https://t.co/vl7BzxxIbc",
    "550": "Happy to announce @SerenaWinters as our @cavs sideline reporter. Welcome to #TheLand Serena! #LetEmKnow \n\nMORE: https://t.co/SUxYqpzEc2 https://t.co/gP7zIXUANh",
    "551": "@evan_CTOWN @cavs @RMFieldHouse No clearly they don’t.  Might as well let them know they lost a customer though.  I’d want to know if it was my business.",
    "552": "@NOHYPEJUSTBALL @cavs @cavsdan @ChrisFedor @SpinDavies @RickNoland @SportsBoyTony @egoldie80 @ClevelandClone5 @Richard10178246 @RonRevr2 @andy_baskin @JCrossover @cutsbyemanuel I’m excited to see who they grab",
    "553": "@NBAPaint1 I need that 10 day @cavs 🤣😂",
    "554": "@thugaliers @jaymesbawned @cavs @RMFieldHouse ‘Wear a mask you fucking pussy!’ - guy who does whatever people tell him to.",
    "555": "@thugaliers @cavs @RMFieldHouse Am I going to pay to wear a mask for three hours? No.  If you want to that’s your prerogative.  Not sure why all you people think the cavs needed you to speak for them.",
    "556": "@KendrickPerkins @cavs @dariusgarland22 Worse than lamelo",
    "557": "@SadleyBeal @cavs @RMFieldHouse Clearly.  So neither will I.",
    "558": "@robindahood3187 @cavs @RMFieldHouse Also yes you are still going to watch the Cavs so this is literally a wasted series of words",
    "559": "Cleveland Cavaliers vs. Washington Wizards Free NBA Picks 12/30/21\n\nToday’s NBA Prediction: https://t.co/RqpGxG2FzB\n\nBet on Basketball: https://t.co/gATumMKeIT\n\n#Draftkings #Fanduel #Pointsbet #Basketballpicks #Sportsbook #NBAPredictions #NBATwitter #GamblingTwitter #ESPN https://t.co/hdyqDrXeai",
    "560": "@cavs @RMFieldHouse Cue all the “not gonna go now” folks who legitimately believe their one ticket is going to affect a multi-million dollar business lmao",
    "561": "@cavs @RMFieldHouse Not going now",
    "562": "@robindahood3187 @cavs @RMFieldHouse You people still think businesses give a shit you aren’t going 😂 😂",
    "563": "@cavs @RMFieldHouse Smart move.  I was gonna mask up regardless but now I feel even better.  👍🏻",
    "564": "@PeppaPike @cavs Thankful it wasn't Isiah Thomas, too.",
    "565": "@robindahood3187 @cavs @RMFieldHouse Clearly not you😹👎",
    "566": "@coachk6463 @cavs Not many backup point guards you can sign off the street",
    "567": "@mcfaddenpick6 @KendrickPerkins @cavs @dariusgarland22 Low record… yes but all those wins are from him. Garland got 2 twin towers to help him out along with nice wing players. Anyways we still got like a month of games left. Only 2-4 games back from 6th",
    "568": "@somehowjacob @nizcomix @cavs im also 6’4 and available conditioning wise…",
    "569": "@KendrickPerkins @cavs @dariusgarland22 Jarrett Allen should get in also",
    "570": "Evan Mobley and the Cleveland Cavaliers play basketball tonight!",
    "571": "@cavs @RMFieldHouse Didn’t the CDC just say that the cloth masks didn’t do anything?",
    "572": "@TheDeliveryUnd1 @cavs @rickyrubio9 100% the culture move. He’s not too reliant on explosiveness and can contribute and bring value being a vet on this team going forward. Plus Cavs have little pressure to win now this season and shouldn’t go to huge lengths to sneak into the playoffs or try to make 2nd round IMO.",
    "573": "@cooljay__2 @cavs @RMFieldHouse People shouldn't be bringing babies and toddlers to sporting events anyway.",
    "574": "@masonic_boom @jaymesbawned @robindahood3187 @cavs @RMFieldHouse I’m sure you’re very oppressed, old man! 🤣🤣 https://t.co/kgMk1fou6C",
    "575": "@cavs @KendrickPerkins @dariusgarland22 What about Lamelo Ball!! Putting up just as good numbers. The Hornets have been missing pieces throughout the season. But Lamelo a baller",
    "576": "Dear @cavs, \n\nBring our boy home! @zaviersimpson_3 #OhioBornNBred #nfl_ #LetEmKnow https://t.co/5uf66z18I4",
    "577": "@AmNotEvan @cavs Will there be a miraculous resurgence...No! Thats what we are looking for...nothing more...nothing less..",
    "578": "@PeppaPike @cavs That's a good idea. All joking aside, he would fit. My fear is this injury will panic Cavs into getting serious about bringing Ben Simmons to town. That would be a huge mistake!",
    "579": "@NBAPaint1 @cavs I'm 6'5\" &amp; can shoot hmu",
    "580": "@GugliottiJames @cavs His leadership was huge for this team and ran the offense to perfection.   They didn't skip a beat when Garland was out of the game because of him.",
    "581": "@robindahood3187 @cavs @RMFieldHouse You learn something new every day I guess",
    "582": "@AmNotEvan You are smoking drugs...we dont want to win it this year...do you get it..We will wait ..keep the garbage players...We're good..no chemistry...none...All of the @Cavs were together all Summer...they knew each other...It was a resurgence..",
    "583": "Hey @cavs!!! Here’s your guy! @zaviersimpson_3 #CaptainHook🪝#LetEmKnow https://t.co/apLIF9XNwh",
    "584": "Thank you @cavs https://t.co/caHbGHwNet",
    "585": "@JacobRobert0806 @jaymesbawned @robindahood3187 @cavs @RMFieldHouse Land of the Free.. Unless you aren’t like me!",
    "586": "@JTK1985 @ReportPants @FrobleyCAVS @cavs @RMFieldHouse Oh for sure.",
    "587": "@jaymesbawned @ReportPants @FrobleyCAVS @cavs @RMFieldHouse Fair. But the point remains this policy wont do anything. Its safety theater.",
    "588": "@robindahood3187 @cavs @RMFieldHouse Y’all is literally a contraction for you all. You just did the same thing as correcting someone for using “It’s” instead of “It is.”",
    "589": "@jmbyler @cavs @RMFieldHouse Right imagine complaining? Lol if this stops you from going to see this young exciting team play live thats on you!",
    "590": "@jaymesbawned @masonic_boom @robindahood3187 @cavs @RMFieldHouse 🤣🤣🤣 poor kid! Bye freak show “scientist”!",
    "591": "@KendrickPerkins @cavs @dariusgarland22 Perk with the big W!",
    "592": "@OHsportsballfan @cavs @RMFieldHouse You all*",
    "593": "@SexIandCAVS I dont play but I think this offense is better than all past offenses..2K here comes the @cavs !",
    "594": "@bV2510_ @cavs @RMFieldHouse Speak for yourself.  Some of us actually brush and floss.",
    "595": "@JTK1985 @ReportPants @FrobleyCAVS @cavs @RMFieldHouse Yeah, if he said they should have mandated k/n95s or supplied them at the door then I would have agreed.",
    "596": "@robindahood3187 @cavs @RMFieldHouse It’s literally so easy to wear a mask. I wear one daily for 8 hours and forget I have it on. I swear y’all are just dramatic",
    "597": "@cavs @RMFieldHouse I guess I'll just watch from home now. https://t.co/HJRU0PixLN",
    "598": "@jaymesbawned @masonic_boom @robindahood3187 @cavs @RMFieldHouse Wow. I feel bad for your child! Does he have a gender yet?",
    "599": "@masonic_boom @JacobRobert0806 @robindahood3187 @cavs @RMFieldHouse I honestly think some people want gender to be binary so they can easily tell if they can allow themselves to be attracted to them.  Once it gets on a spectrum they get scared they might be attracted to someone they aren't \"supposed\" to be.",
    "600": "@jaymesbawned @ReportPants @FrobleyCAVS @cavs @RMFieldHouse So the better point would be the masks that people actually wear dont work. No one has n95 masks.",
    "601": "@JTK1985 @ReportPants @FrobleyCAVS @cavs @RMFieldHouse Not my point.  He said masks don't work.  He was wrong.",
    "602": "#CavsTradeForTyus should be a thing. @1Tyus @cavs Just sayin’. Get well soon, Ricky. https://t.co/p0R1oUBxgF",
    "603": "@robindahood3187 @cavs @RMFieldHouse I just think it's funny.  You can complain all you want, just don't be surprised when you get called out on it.",
    "604": "@JacobRobert0806 @jaymesbawned @robindahood3187 @cavs @RMFieldHouse Why does it bother you so much how people live their lives?",
    "605": "@KendrickPerkins @cavs @dariusgarland22 Perk knows all",
    "606": "@mattpie0011 Man, he was playing well. I think he provided a bit of leadership, as well.  Maybe he resigns with @cavs nxt yr.  I agree w/ u..he'll be missed",
    "607": "@ShastorTS @isaacokoro303 @nbatopshot TS GreggPackovich I’m looking forward to the @cavs making the playoffs!",
    "608": "@JacobRobert0806 @robindahood3187 @cavs @RMFieldHouse False, go away.",
    "609": "@jaymesbawned @ReportPants @FrobleyCAVS @cavs @RMFieldHouse What do you think 99.9% of the people going will be wearing? Probably whimsical masks with either a message or a logo on it made out of cloth...",
    "610": "@jaymesbawned @cavs @RMFieldHouse But you had to reply to let me know I shouldn’t complain? A bit hypocritical",
    "611": "@ElalcaldeRafa @cavs @RMFieldHouse Should have been masking all month, tbh.",
    "612": "@JBJBJB1982 @cavs @RMFieldHouse Dude that is so fucking original. Holy shit. You are hilarious. I bet you’re a riot at parties.",
    "613": "@jaymesbawned @robindahood3187 @cavs @RMFieldHouse There’s only 2 genders Mr Scientist!",
    "614": "@JacobRobert0806 @robindahood3187 @cavs @RMFieldHouse I am a scientist.  I do trust the science.  It doesn't say what you think it does.",
    "615": "@robindahood3187 @cavs @RMFieldHouse I promise you nobody cares if RobinHood3187 isn’t going to the games",
    "616": "@JacobRobert0806 @jaymesbawned @cavs @RMFieldHouse Science isn’t supposed to be something you ‘trust’.. should’ve paid attention in class.",
    "617": "@hardstyleblvnts @CoryFromPreble @cavs @RMFieldHouse Aweee keep me safe daddy government!! https://t.co/l9t4axj4z4",
    "618": "@robindahood3187 @cavs @RMFieldHouse You won't be missed, is what I'm saying.  Business can make these decisions for the health and safety of their guests and employees, you don't have to whine about it and announce your dislike about every little thing.  Nobody cares.",
    "619": "@jmbyler @cavs @RMFieldHouse Well for the record I couldn’t give less of a shit about your health and safety.   Enjoy being a pussy though and worrying about a cold.",
    "620": "@CoryFromPreble @JacobRobert0806 @cavs @RMFieldHouse Good for them. Still keeps me safer when mouth breathers in my face.",
    "621": "Hey @cavs family and friends, let's continue do our part!!!!!  See you at @RMFieldHouse tomorrow night. https://t.co/2dE852ghqW",
    "622": "@cavs give Pangos a run #LetEmKnow and then decide",
    "623": "@cavs @NDiem1988 @evanmobley Put this man in the rising star game as a starter",
    "624": "@alanbarcoff @the4040club @KingJames @Lakers @LakersReporter @LakersCommunity @Jon4Lakers @Nike @WNBA @mellentuck @MiamiHEAT @cavs What year was that?",
    "625": "@jaymesbawned @cavs @RMFieldHouse Great point man!  Faces, chests, feet - all basically the same thing!  Well enjoy paying to breathe through a mask for 3 hours.  I’ll spend my money elsewhere.  Apparently you don’t think I should be able to spend my money as I please?  Not sure what point you’re making.",
    "626": "@jaymesbawned @robindahood3187 @cavs @RMFieldHouse Pronouns in the bio!! Shocker. Govern me harder daddy!!!!",
    "627": "@robindahood3187 @cavs @RMFieldHouse As someone who *is* going, I appreciate your commitment to our health and safety by staying home #LetEmKnow",
    "628": "@ReportPants @FrobleyCAVS @cavs @RMFieldHouse You started off saying \"masks don't work\". You were wrong. You shared an article you thought proved your point but it didn't. Cavs should be requiring K/N95s, but  there's no way that would fly, unfortunately.  They should hand them out at the gate.",
    "629": "@cavs @NDiem1988 @_bigjayy_ @CavsMoondog Allen and garland are possible all stars let’s go caves",
    "630": "Sports while i'm asleep \n\nWashington Wizards Vs Cleveland Cavaliers (NBA Matchday 35 of 82)\n\nTip-off: 1 A.m Swedish \n12 P.m British \n7 P.m Eastern \n4 P.m Western \n\nCarolina Hurricanes Vs Montreal Canadiens (NHL Game 33 of 82)\n\nFace-Off: 1 A.m Swedish \n12 P.m British",
    "631": "@cavs @RMFieldHouse What if I identify as a 1 year old?",
    "632": "@SpinDavies @cavs Should definitely bring in Teague. I'd still explore trades and such but something is needed immediately.\n\nThey should be able to get a disabled player exception for Rubio also, shouldn't they?",
    "633": "@cavs @RMFieldHouse Dang what about the babies tho. That can be more vulnerable to the virus than we are  🤔",
    "634": "@cmillsnbcs @WashWizards @cavs @NBCSWashington @RealDealBeal23 Yo Chris my brother you were excellent on the mike the other night really happy you and glen are back on tonight 💯",
    "635": "@ReportPants @FrobleyCAVS @cavs @RMFieldHouse CLOTH masks don't work anymore, she says. Read the article before you post.",
    "636": "old enough to remember when the cleveland cavaliers petitioned to remain open during the early days of the pandemic because of their \"state of the art ventilation system\"",
    "637": "@cavs @RMFieldHouse I was planning to go tomorrow regardless, but this honestly makes me way more comfortable. Thank you Cavs; looking forward to the W!",
    "638": "@robindahood3187 @cavs @RMFieldHouse How dare they tell me that I have to cover my feet and chest, too!",
    "639": "@cavs @RMFieldHouse Yall mfs breathe must stink if yall complain about a mask",
    "640": "@chlaforet @JLew1050 His kids probably more up to date with Raptors defense than the team we had playing the @cavs",
    "641": "@cavs @RMFieldHouse Won’t be going to games then.  Probably won’t bother watching either.  Fucking mandating I cover my face when I pay to come in your venue?  No thanks.",
    "642": "@hardstyleblvnts @JacobRobert0806 @cavs @RMFieldHouse Even the most Covid cult members are now saying the masks don’t work https://t.co/qlJHiiPmC3",
    "643": "@ReportPants @cavs @RMFieldHouse You have a PhD and can confirm?",
    "644": "@shouvley @cavs @RMFieldHouse Nope. All you can swallow is the muddled air under your mask. TRUST THE SCIENCE ELLEN!!",
    "645": "@cavs @RMFieldHouse protect the team 🙏🏼",
    "646": "@cavs @RMFieldHouse Sign IT man cmon we need some1",
    "647": "@cavs @RMFieldHouse Cool👍",
    "648": "@cavs @RMFieldHouse Good.",
    "649": "@cavs @RMFieldHouse Hahaha. That ought to help.",
    "650": "@cavs @RMFieldHouse Any time you can mandate your fans to wear useless pieces of cloth over their face you HAVE to do it! Well done Cavs!!!",
    "651": "@ReportPants @cavs @RMFieldHouse I’m not at all surprised you would tweet this lmao",
    "652": "@stlaxstla @EarsMcGee11111 @cavs @RMFieldHouse Right. Smh",
    "653": "@cavs @RMFieldHouse the first game of the season im going to is tommrow 😐😐😐",
    "654": "tbf I think I can shoot jumpshots and have somewhat decent court vision @cavs if you need a body",
    "655": "@xDopeBoyMagik @isaiahthomas @cavs The Mavericks just signed him to a 10 day contract",
    "656": "Starting tomorrow 12/31 with #CavsHawks, all fans age 2 &amp; up are required to wear a mask while inside @RMFieldHouse.\n\nDETAILS: https://t.co/L03kc0nMKr",
    "657": "@wear_athletic @msshawnt @HammerNation19 @cavs Just stupid folks",
    "658": "@msshawnt @HammerNation19 Get him \"T\"...Why do sports pundits and fans want to blow it up the @Cavs when they careless in Nov..why?  When the results are normally catastrophic ...! Why @hiramboyd",
    "659": "@ChargeCLE @MiamiHEAT @nbagleague @NBA @kylejguy @cavs should have jumped on this…we kind of have a need for guards right now",
    "660": "@matthewdelly we need ya back in Cleveland buddy! @cavs @923TheFan let’s do this!",
    "661": "Get it? Cause he kills the wizards 🤣🤣🤣🤣🤣 Follow For More Cleveland Cavaliers Humor",
    "662": "@KendrickPerkins @cavs @dariusgarland22 Much love Perk",
    "663": "@cavs @dariusgarland22 @KendrickPerkins \"2nd Best\" won't get him on that team",
    "664": "#NBA Eastern Conference Power Rankings as of today IMO:\n\n1 Chicago Bulls #BullsNation \n2 Milwaukee Bucks #FearTheDeer \n3 Miami Heat #HEATCulture \n4 Brooklyn Nets \n5 Cleveland Cavaliers #LetEmKnow \n6 Charlotte Hornets #AllFly\n7 Philadelphia 76ers \n8 Washington Wizards #DCAboveAll",
    "665": "@WhistleSports @HoopMixOnly @KingJames @cavs He’s been to 10 finals",
    "666": "@KendrickPerkins @cavs @dariusgarland22 Thank you !!",
    "667": "@MchipsM @confidence_CM @cavs No not even he's just worth a second round pick and a bag of chips as of right now. (From the way he last played)",
    "668": "@cavs @dariusgarland22 @KendrickPerkins Good for him",
    "669": "In our year-end series, writers Doug Guth and @dana_shugrue look forward to the NBA All-Star Game coming to Cleveland in February and what the @cavs ,@Browns and @CleGuardians have in store for fans in the new year.https://t.co/UskfgSmXYP",
    "670": "@KendrickPerkins @cavs @dariusgarland22 Big Perk appreciate the awareness bro. ✊🏿\n\n Any thoughts on how we carry on sans Rubio? \n\nI’m starting a Bring Back Z campaign for @zaviersimpson_3. Ohio native, Michigan PG, led @okcblue to showcase, competent PG without the big price tag 🏷.",
    "671": "@WashedTraruso @KendrickPerkins @cavs @dariusgarland22 Ignorance, don't disrespect someone who's helped win a ring. Perk was an enforcer, an did something you'll never do. Stop the hate, show some love.",
    "672": "@Milan_98O @R98Paul @cavs @dariusgarland22 @KendrickPerkins And Zach",
    "673": "@xDopeBoyMagik @isaiahthomas @cavs Broooooooo I just said that",
    "674": "NBA Match Preview -- Washington Wizards vs Cleveland Cavaliers https://t.co/LzaAys9A0z",
    "675": "@cavs @dariusgarland22 @KendrickPerkins Can we get the picture without the tweet this picture is tough asf",
    "676": "NBA Betting Preview: Washington Wizards vs. Cleveland Cavaliers https://t.co/ph8C1tR1Xq",
    "677": "@cavs @KendrickPerkins @dariusgarland22 @FredVanVleet has entered the chat #NBAAllStar",
    "678": ".@Cavs lets go and trade for Dennis Schröder!!! Boston blows and will want to duck the tax (over by $3 million)… won’t cost too much to get him… maybe 2 non-guaranteed contracts like Stevens &amp; Valentine and a future 2??? #LetEmKnow",
    "679": "@KendrickPerkins @cavs @dariusgarland22 Can’t *",
    "680": "@KendrickPerkins @cavs @dariusgarland22 Kendrick u can disrespect Fred vanvleet. He’s having an impact on the raptors like Jokic has a impact on the nuggets. Garland is a stud but Freddy is just so calm and collected and knows how to control the game. He’s truly playing at all-star level.",
    "681": "Never forget that 2007 run to the Finals from @KingJames &amp; the @cavs https://t.co/Les1AGF2Le",
    "682": "@utdrobbo @cavs @dariusgarland22 @KendrickPerkins Rubio tore his ACL and Secton is out for the season.",
    "683": "@KendrickPerkins @cavs @dariusgarland22 Stop dickriding everyone bruh.",
    "684": "@R98Paul @cavs @dariusgarland22 @KendrickPerkins No Trae and de rozan are better this season",
    "685": "@bwill628 @cmillsnbcs @WashWizards @cavs @NBCSWashington @RealDealBeal23 Andray Blatche",
    "686": "@bjturrner @cavs Shit happens all the time in basketball and to all teams tho. I get your sadness, Iam sad too, since that team was a contender to me, but don't act like only Cleveland is unlucky when it comes to injuries.",
    "687": "@KendrickPerkins @cavs @dariusgarland22 Yeah Perk! He's already better than u all time!",
    "688": "@cavs @dariusgarland22 Oh he’s getting in!!! I think it’s going to be an All- Star reserve but it will be a great starting point for this young Stud! Carry on…",
    "689": "@utdrobbo @cavs @dariusgarland22 @KendrickPerkins Been trying to tell ppl man Simmons and Garland would be so deadly",
    "690": "@rickyrubio9 Please get well and run the east next year with the @cavs",
    "691": "I’m really sad for Rubio man… As a @cavs fan of course it sucks but he’s been having a hell of season and is such a crucial part of this teams success! W/ Sexton out and now Rubio it’s gonna be interesting to see the impact on this team! #LetEmKnow",
    "692": "@rayjr216 @cavs Ppl that seriously believe, that IT is helping and not hurting a team should simply switch sports. Try hockey or football or learn to play an instrument or something, but please stay away from basketball",
    "693": "The @Cavs Team Issued Collection by @SwishAuthentics\n\nIn-Store Exclusive only at @CavsTeamShop in @RMFieldHouse on 12.31 to ticketed fans. \n\nGet your tix now at https://t.co/oJVPrLKqtx\n\n#LetEmKnow  | #CavsStyle https://t.co/MDx3Hj0Jht",
    "694": "@scottie48337264 @cavs I’m more referring to two knee ending injuries, just not fair, doesn’t happen often in Basketball, if it was the NFL I’d accept it",
    "695": "@cmillsnbcs @NBCSWashington @WashWizards @cavs @RealDealBeal23 Need this game,especially with Cleveland missing Garland and Rubio.",
    "696": "@PRlMEWINDLER @nvmpq @stlaxstla @kidnamed_matty @twithersAP @cavs This u? https://t.co/8t9bfLFzxK",
    "697": "@bjturrner @cavs But that this shit happens only to the Cavs is straight bs tho. Half the league is missing keyplayers. Last year beside Phoenix quasi every good team had serious injury issues in the playoffs. It's truly sad, because Cleveland and Ricky were doing great, but shit happens in sport",
    "698": "@nvmpq @stlaxstla @kidnamed_matty @twithersAP @cavs Damn maybe you can’t fill that finance role.  You think 3 tweets took me all day they took about 3 minutes.  Guess things are harder for some people 🤷‍♂️",
    "699": "@TheKennyRoda One player who I would like the @cavs to make a play for \nwould be Brandon Ingram. Love, Markkanen, and Okoro for Ingram and Josh Hart. Ingram would give them that wing scorer while Hart be a 3 &amp; D guy.",
    "700": "Gameday!\nCleveland Cavaliers (5º / 20-14)\n\n🆚 Washington Wizards (8º / 17-17)\n🏠 Capital One Arena\n📍 Washington, D.C\n⏰ 21:00 (Brasília)\n🖥 NBA League Pass / @nbalinksbrasil / @BasqueteTV19\n\n#LetEmKnow https://t.co/dKkBmp15pT",
    "701": "@RaTeD_RMN @bjturrner @cavs For sure... how? Top 5 defense, top 5 netrating. Excellent unit. Shooting, playmaking, good inside bigs, good floor stretching bigs. Very deep team, excellent bench. They had a shot at least this year.",
    "702": "@nvmpq @robindahood3187 @stlaxstla @kidnamed_matty @twithersAP @cavs Own that bozo https://t.co/zEVU5odZKq",
    "703": "@HipsterTito @JFull78 @Emetz0916 @DreKnott @cavs It's not a championship core if they never won a championship.",
    "704": "NBA Basketball Game Betting Picks Simulator: 7:10 PM ET - Cleveland Cavaliers vs. Washington Wizards - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/WEcU27bVBR #nba #sportsbetting #freepicks #cappertek",
    "705": "@nvmpq @robindahood3187 @stlaxstla @kidnamed_matty @twithersAP @cavs You are my spirit animal",
    "706": "@cmillsnbcs @WashWizards @cavs @NBCSWashington @RealDealBeal23 Whose face did they use to make this?",
    "707": "One thing amazing about the CLE is how some people get so excited about the @cavs @Browns and @CleGuardians but don't say shit about us not having a recycling program. How the hell is pro sports more important that saving the planet? Y'all need to get it together FAST.",
    "708": "@cavs @dariusgarland22 @KendrickPerkins AMEN",
    "709": "@cavs I don't care what ppl say, but this Cavs team was a ring contender this yr. They had the excellent D, the playmaking &amp; shooting,top zone bigs, top stretch bigs &amp; been a real unit That team would've been the heck of a matchup for anyone in the playoffs, but not w/o Colin and Ricky",
    "710": "@CavsRfrauds @cavs @dariusgarland22 @KendrickPerkins you’re mad https://t.co/vQJzthZEzf",
    "711": "📅 On this day in 2009, the @cavs LeBron James celebrated his 25th birthday by scoring 48 points in a 106-101 win over the Hawks.\n\nIt's the third-highest point total in NBA history by a player on his birthday, trailing only Shaquille O'Neal (61) and Dominique Wilkins (53). https://t.co/3w1Oubj9pY",
    "712": "It might finally be time for the Cleveland Cavaliers to trade for Ben Simmons.\n\n#LetEmKnow | #NBATwitter | #Sixers | @DavidWysong_  https://t.co/B0yK35ZUjo",
    "713": "@cavs @dariusgarland22 @KendrickPerkins Forget All Star reserve man should be straight up starting in the All Star game",
    "714": "Consensus Line Move:\n2021-12-30 Cleveland Cavaliers at Washington Wizards from 210.00 to 211.00\nOver blast away\n#NBA #espn #programming #lifestyle",
    "715": "@cmillsnbcs @WashWizards @cavs @NBCSWashington @RealDealBeal23 Do fans get that tonight ??",
    "716": "@cavs @dariusgarland22 @KendrickPerkins Farthest thing from an all star. This tweet is disrespectful to those who actually deserve it",
    "717": "@JMcCrae35 @FOCOusa @Browns @cavs Cleveland power!!!! https://t.co/I134B8M30F",
    "718": "🗣️🗣️🗣️\n\nRETWEET to send @dariusgarland22 to #NBAAllStar! https://t.co/P3aLB5YftF",
    "719": "@jive_turkey69 @NickCaminoWKYC @KingJames @cavs So you're content losing close games against contenders and making the playoffs for the first time since 2018 to still be watching the Finals in June? Got it.",
    "720": "@SpinDavies @cavs This was a great article.",
    "721": "@RealistCLEFan @BallySportsCLE @DreKnott @cavs SAM AMICOs LATEST POST ONE GOOD READ! https://t.co/rjolELP2TM",
    "722": "I’m 5’10. Letting the @NBA know now I only need 2 weeks to get back in shape. @cavs you need a PG right? https://t.co/ER0jEBm6Lg",
    "723": "@cmillsnbcs @WashWizards @cavs @NBCSWashington @RealDealBeal23 Let’s go Chris!",
    "724": "Back on the call tonight with Glenn Consor for @WashWizards @cavs. Will this guy be back in the starting lineup? Pregame coverage starts tonight at 6:30 on @NBCSWashington #DCAboveAll #LetEmKnow https://t.co/P5MYDea0FW",
    "725": "@nvmpq @stlaxstla @kidnamed_matty @twithersAP How hard did you have to work to come up with that number?  Maybe the @cavs will hire you to their finance team if you keep it up.  Dream big homie.",
    "726": "@cavs extend ricky",
    "727": "Where I send my highlights at! YMCA MVP 6 ppg, .5 assist, 8 rebounds per game🤣 get at me @cavs https://t.co/m1Yeoi8pU7",
    "728": "While it won't be Ricky Rubio, there are ways for the @cavs to provide relief at backup point guard on the floor (and enough off of it). ICYMI: Thought out loud about the subject. #LetEmKnow https://t.co/H2r3U6JQ4b",
    "729": "@cavs @NBA @BallySportsCLE @DreKnott @chones22 @MrCavalier34 SIGNMANSAYS CAVS BE LIKE ! ITS MANDATORY ! PUT ONE ON! OR KEEP YOUR ASS AT HOME! https://t.co/97rXrodt71",
    "730": "@kirkgoldsberry @cavs @memgrizz @utahjazz @warriors @Suns very surprised to Cav",
    "731": "I really feel for @rickyrubio9 . His season-ending injury is so unfortunate given how huge a role he has played for the surging @cavs . Hope he makes full recovery quickly. Meantime the young cavs need to keep it together.",
    "732": "Over the 500 mark! 🏀\n\nWith 536 made free throws to date, we've raised $13,400 for the @CleFoodBank from our friends at @GiantEagle to help fight food insecurity in Northeast Ohio! https://t.co/GmBy6bMlOu",
    "733": "@cavs fans would you take @kingjames back?",
    "734": "@cavs Sign Jeremy Lin",
    "735": "Can you believe the Cleveland Cavaliers  are sitting 5th in the East.",
    "736": "I tip my hat to the @cavs they 5th in the east &amp; @KingJames Is long gone wouldn't it be funny if the @cavs make the playoffs &amp; the @Lakers don't  🤔 https://t.co/aS1nVMBa6Y",
    "737": "@cavs @BallySportsCLE @wtam1100 @wmms @Power891 @RocketMortgage Start me as PG",
    "738": "@BallySportsCLE @cavs Imagine if everyone in the network could watch the games…",
    "739": "@cavs what are the chances we can bring @zaviersimpson_3 back home to the OH? We need a dynamic PG that can create, he has roots in the state, and he is more than capable. Officially starting the Z-Campaign. #CaptainHook🪝#LetEmKnow",
    "740": "@RMFieldHouse @cavs @monstershockey Let us show you how to make your space safe against all germs. We can reduce 99.9999% of Covid from surfaces and 99.9% from the air. Ask us how ?\nInfectious control and prevention\nExperts since 2017.\nAnd no harmful chemicals.\nSafe and sustainable\nEPA N List.",
    "741": "Fuck it, we’re down a point guard. Let’s do it. @cavs https://t.co/kUnCqQ3mIW",
    "742": "DasHaus made a bet!\n\nEvent: Cleveland Cavaliers vs Washington Wizards #NBA\nBet: Washington Wizards TO WIN -3.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "743": "@CLECLOTHINGCO @GVartwork I know we are in the heat of football season, but any new @cavs apparel coming soon?! 👀👀",
    "744": "DasHaus made a bet!\n\nEvent: Cleveland Cavaliers vs Washington Wizards #NBA\nBet: Cleveland Cavaliers TO WIN +3.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "745": "Consensus Line Move:\n2021-12-30 Cleveland Cavaliers at Washington Wizards from 212.00 to 210.00\nUnder what did I miss\n#NBA #sportsbettingadvice #ml #ethereum",
    "746": "Cleveland Cavaliers veteran guard Ricky Rubio will miss the remainder of the season after tearing his ACL in his left knee.\nhttps://t.co/FxX69eXvd4\n#Fastbreak #HoopSnoop \n@rickyrubio9",
    "747": "@cavs boy do we have the guard for you https://t.co/fYqbGX3x9a",
    "748": "Never thought I'd say this but, Ricky Rubio's injury is going to hurt us at least short term. @cavs",
    "749": "@cavs @BallySportsCLE @wtam1100 @wmms @Power891 @RocketMortgage When is Allen going to be back? Also, we gotta trade for a backup PG now. Pangos isn't going to be practical in the long run",
    "750": "@_mcflyboi_ @confidence_CM @cavs He worth at minimum 2 first",
    "751": "▪︎HBD @KingJames 🥳🥳🥳🥳🥳🥳🥳\n\n- 4× @NBA champion\n(2012 and 2013 with @MiamiHEAT, 2016 with @cavs and 2020 with @Lakers)\n- 4× NBA Finals MVP\n- 4× NBA MVP\n- 17× NBA All-Star\n- 3× NBA All-Star Game MVP\n- 13× All-NBA First Team\n- 3× All-NBA Second Team ...\n- 2× Olympic Games🥇 https://t.co/vAmIh7uu95",
    "752": "@russell74232789 @cavs You’re weird",
    "753": "@cavs @BallySportsCLE @wtam1100 @wmms @Power891 @RocketMortgage Let's go Canton chargers!",
    "754": "🏀 Atlanta Hawks (@ATLHawks) #TrueToAtlanta\n🆚 L 131-117 @ Chicago Bulls #BullsNation #ATLvsCHI\n⏭️ Cleveland Cavaliers #LetEmKnow #ATLvsCLE\n✈️ N666DN | DAL8918 | B752\n🛫 MDW - 11:46 pm CT\n🛬 CLE - 1:30 am ET\n📡 Tracking: https://t.co/H37L60d42L https://t.co/IKIBvRxX62",
    "755": "@rickyrubio9 Best vibes for your recovery! Let’s go! And we expect to see you in @cavs attire next season!!!",
    "756": "El camino hacia la leyenda: \n\n1999-2003: St.Vincent-St.Mary\n2003-2010: Cleveland Cavaliers\n2010-2014: Miami Heat\n2014-2018: Cleveland Cavaliers\n2018-2021: LA Lakers https://t.co/jD4whJDkNS",
    "757": "Rubio is a huge lost for the @Cavs been playing well all season and the Cavs lost another ball handler",
    "758": "@SpinDavies Man I like that Jeff Teague idea! If we can pull it off then let’s go!!! I don’t see Kemba Walker happening &amp; I’m concerned about everything else we’d have to give up. \n\nAll in all this article was the glimmer of hope I needed. There’s a chance for the @Cavs to avoid implosion.",
    "759": "@DreKnott Get Some Rest and Help is On the Way.. the Wine 🍷 and Gold 📀 is Capable of Fielding a Warrior 👊🏾💥💯% Cleveland Cavaliers 🏀🙌🏾",
    "760": "@cavs @BallySportsCLE @wtam1100 @wmms @Power891 @RocketMortgage Lets gooooo!!!! Im gonna bring the energy tonight at Capital One! Last time i went to a Cavs-Wiz game, Lebron dropped 57 here. Tonight its Mobley's turn! Brandon Jennings is the last rookie to drop 50 (in 09). Lets goooo!!!",
    "761": "THREAD\n#OTD LeBron James (Dec 30, 1984), NBA forward known as “King James”. Widely considered one of the greatest players in NBA history, he is only player to have won NBA championships with 3 franchises: Cleveland Cavaliers, Miami Heat &amp; Los Angeles Lakers\n#History #NBA https://t.co/OMPWYQXn4U",
    "762": "Congratulations to EEL_LIQUID (@seth827) who moved up 102 spots to take #92 on the Cleveland Cavaliers team leaderboard.\n\nhttps://t.co/BM2rGP6EdD",
    "763": "@cavs @rickyrubio9 @kevinlove I'm Sick of Watching the Cavalier Opponents On Many MANY Occasions ,  Especially On the Road 🛣️☝🏽 and I Mean the Pelicans of N O 👈🏾 Playing Dirty Ball 🏀 and the Refs ALWAYS Allowing it to make it Harder than it Ought to Be 🤬⁉️ and Now Ricky Rubio is Out",
    "764": "Hey @cavsdan @cavs can we please sign @TheRealJRSmith to the roster especially since Rubio is out.  He can get a quick flight to DCA from NC for the game tonight. I swear he won't make the same mistake as before lol #LetEmKnow #Cavs https://t.co/oyH3V8FO3Z",
    "765": "I had a blast at work this week. I actually get paid for this?? \n\nHey @cavs let me know if you ever need someone for game night!! https://t.co/GfbgQiJPWP",
    "766": "@JohnTelich8 @cavs Tough loss. Prayers for a speedy recovery.",
    "767": "@RaTeD_RMN @NickCaminoWKYC @KingJames @cavs How do you know? The Cavs have been playing good basketball against teams like the bucks and nets... Definitely don't need lebron.",
    "768": "@8Crawdaddy3 @cavs 100% they will. They’ve been a resilient bunch all year. Next man up mentality.",
    "769": "@jive_turkey69 @NickCaminoWKYC @KingJames @cavs Still won't win. Cavs have never been relevant without LeBron on the roster. Making the playoffs just to be home before June doesn't change that.",
    "770": "@RaTeD_RMN @cavs Sadly. 😭",
    "771": "@cavs @BallySportsCLE @wtam1100 @wmms @Power891 @RocketMortgage Who plays PG?",
    "772": "@BallySportsCLE @cavs Ratings = money and if you want ratings make a deal with streaming services. I’m sure your CFO would enjoy making the company more money.",
    "773": "@NoahSE_ @cavs @BallySportsCLE @wtam1100 @wmms @Power891 @RocketMortgage He is but he’ll miss todays game due to him conditioning",
    "774": "@JFull78 @Emetz0916 @DreKnott @HipsterTito @cavs Those 90's Cavs teams didn't win anything tho.",
    "775": "@cavs @BallySportsCLE @wtam1100 @wmms @Power891 @RocketMortgage is jarrett back?",
    "776": "@cavs @BallySportsCLE @wtam1100 @wmms @Power891 @RocketMortgage Should be interesting to see who starts.",
    "777": "@cavs @BallySportsCLE @wtam1100 @wmms @Power891 @RocketMortgage When will @cediosman start playing",
    "778": "@bjturrner @cavs Your season to do what? Make the playoffs? Cavs wasn't getting to the Finals that's for sure",
    "779": "Last roadie in 2021!\n\n🕖 7:00PM ET\n📺 @BallySportsCLE\n📻 @wtam1100, @wmms, @Power891\n\n@RocketMortgage | #LetEmKnow",
    "780": "My @cavs better beat the @WashWizards tonight https://t.co/olA4rx0jcW",
    "781": "vote for...  @rickyrubio9 \n\n★★★★★\n\n#NBAAllStar  #Rickyrubio \n@NBAspain @Cavs #LetEmKnow https://t.co/b9XRnxp3TJ",
    "782": "Happy Birthday #LeBronJames! He Is 37 Today! #KingJames #LALakers #MiamiHeat #ClevelandCavaliers https://t.co/Hb2uRu8sXt",
    "783": "#Basketball\n#Nba (Usa)\nWashington Wizards - Cleveland Cavaliers\n#bwin\ninfo: https://t.co/RW8eqDty7G https://t.co/55HLU9AcoH",
    "784": "@cavs @ Koby Altman extend this man’s contract right now https://t.co/zDZLT2n8Xv",
    "785": "@trailblazers @cavs 🚨 Collusion 🚨",
    "786": "🎂🎈🎂🎈🎂\nHappy Birthday #LeBronJames! He Is 37 Today! #KingJames #LALakers #MiamiHeat #ClevelandCavaliers 👑 @KingJames https://t.co/coIj21AHlR",
    "787": "@BallySportsCLE @cavs Probably because everyone was home, visiting their parents, who still have cable. You'd have these kind of numbers all season if your channel was available to everyone.",
    "788": "@ShannonSharpe This 2021 Lakers team is worse than the 2004 Cleveland Cavaliers squad.",
    "789": "NBA 31/12/21\n\n07:00 Cleveland Cavaliers+3.5\n07:00 Brooklyn Nets*Over-217.5\n07:00 Milwaukee Bucks-12.5",
    "790": "@bellesvibes @BleacherReport @KingJames @ADBPhotoInc @cavs doesnt know you",
    "791": "@BleacherReport @KingJames @ADBPhotoInc Happy Birthday @KingJames !! 🥳You’ve made a fan out of me from when I first watched you and @cavs win that 2016 championship! 💪🏼💪🏼💪🏼#goatjames",
    "792": "Consensus Line Move:\n2021-12-30 Cleveland Cavaliers at Washington Wizards from 213.50 to 212.50\nUnder shhhh...\n#NBA #bettingtips #machinelearning #forextrader",
    "793": "@wear_athletic @Gbush91 @cavs @CollinSexton02 Preach",
    "794": "@Gbush91 @cavs @CollinSexton02 Second the idiots thinking that Mobley can do it by himself..must stop the self medication..again this is chess not checkers..getting rid of players just bcs..Koby &amp;  Bickerstaff know what they are doing..Add the two PG from the G-League to the team &amp; a good veteran @hiramboyd",
    "795": "@Gbush91 Now for the @Cavs...The way the fan base went after @CollinSexton02 when he was injured is sad...Yet it is different with Rubio..The trio is needed (Garland) in Cleveland to win. \"Has Been Fans\" you dont trade a player when he is injured..why..because who would want to come here?",
    "796": "@nonbiasednbafan @cavs Bring back Delly as a back up",
    "797": "With Ricky Rubio out, I wonder if @cavs will go after Ben Simmons.",
    "798": "@YoBoyPo @cavs Love the pic",
    "799": "Jogos #NBA hoje 30/12:\n21h\nBrooklyn Nets x 76ers\nOrlando Magic x Milwaukee Bucks\nWashington Wizards x Cleveland Cavaliers\n22:30h\nDenver Nuggets x Golden State Warriors",
    "800": "@Mike__Schreiner Having seen what Rubio did here, knowing it’s only ’til the end of the season, and with the Slovenian community here, let alone how well the team is playing and how much they absolutely will need him, I think the @cavs have a strong pitch.",
    "801": "@Circilo_ @NBAPaint1 6'6, don't remember the last time I even had the flu. @cavs 10 day me😂😂",
    "802": "NBA ML. Date: 12-30\nCleveland Cavaliers vs Washington Wizards. 1.46%\nDraftKings. Cavaliers @ +140\nKambi. Wizards @ -132\n#arbitrage #bettingtwitter #bettingpicks #sportsbets #freepicks #freemoney #mlb",
    "803": "Cleveland Cavaliers: How loss of Ricky Rubio could impact th https://t.co/EeDuyOPsvC",
    "804": "Cleveland Cavaliers: How loss of Ricky Rubio could impact the Cavs – NBA News https://t.co/1uXQLjLRtA",
    "805": "Cleveland Cavaliers: How loss of Ricky Rubio could impact the Cavs – https://t.co/TVPHdx3gxc",
    "806": "Tot el meu suport @rickyrubio9\nTorna aviat.\n🙏💪.\n@cavs it's necessary to extend his contract.",
    "807": "@Bailey97388879 @cavs @ATLHawks @Pacers Say no?",
    "808": "@cavs 🙁🙁get well",
    "809": "@JESUSCHRlST1 @cavs @rickyrubio9 @kevinlove See you in hell.",
    "810": "@cavs @iamsusej99 Iconic",
    "811": "@crfhenriqux 1- Atlanta Hawks\n2- Cleveland Cavaliers\n3- Houston Rockets\n4- Utah Jazz",
    "812": "@CleSportsTwist @cavs Ben Simmons is garbage...",
    "813": "@JPsAllDay1990 @Armentro1Landon @Kevin_Dasd @cavs A dog licking his own balls 😅",
    "814": "Cavaliers' guard, Ricky Rubio to miss the rest of the season  – Cleveland Cavaliers guard Ricky Rubio will miss the rest of the season with a torn ACL, the team announced Wednes... https://t.co/rbIvfJzbVg https://t.co/zNyQ03npFv",
    "815": "@cavs Ricky jumped at 3:22 and knew his knee was failing!! 😭😔 https://t.co/7JV6vqgwqH",
    "816": "@CoryJ2216 @jth006 @cavs Ira Newble?",
    "817": "TW :  The Cleveland Cavaliers were mocked for bucking the NBA's small ball trend -- now they're contending...: ...time. This is his 18th season in the league, but he was a ball boy and sponge as a child next to his father, longtime NBA coach and… https://t.co/ZLukIQOS0M https://t.co/0ghU7MF7it",
    "818": "2/\n\nAnd for the worst game this week we have a tie between @DetroitPistons when they took on the @spurs and by @Raptors when they played the @cavs, both on 12/26/2021.\n\nWhich games do you consider the best and worst this week?",
    "819": "1/\n\nIn week 14:\n\nThe best game by a team this week was by the @cavs when they took on the @Raptors on 12/26/2021.",
    "820": "The Cleveland Cavaliers announced that guard Ricky Rubio tore the ACL in his left knee and will miss the remainder of the 2021-22 NBA season. \n\nREAD: https://t.co/6JLTUJKmJ9 https://t.co/QsovuwbGLs",
    "821": "Cleveland Cavaliers @ Washington Wizards\nPick : Cleveland Cavaliers.\nBasketball. NBA",
    "822": "@JKCleveland1 @tjfeeman I’ll buy tickets now. Before I wouldn’t.\n\nThanks, @cavs",
    "823": "December 30, 1984 LeBron James, American basketball forward (NBA C'ship &amp; MVP 2012, 2013, 2016, 2020; 16 × NBA All-Star; Olympic gold 2008, 12; Cleveland Cavaliers, Miami Heat, LA Lakers), born #Today #People #OnThisDate #History #Event #Now #PR ― site: https://t.co/CSDYFKmU9Y https://t.co/SePauUlD0X",
    "824": "🏀 Cleveland #Cavaliers guard Ricky Rubio will miss the rest of the #NBA season with a torn ligament in his left knee, the team said on Wednesday\n\nhttps://t.co/I6fvz0n8XI",
    "825": "@wojespn Call @daanteee now @cavs perfect replacement and is back to playing quality ball.",
    "826": "@LifeMessiah @KendrickPerkins @KingJames @cavs @Pacers @Lakers I say this as someone who watched almost every game of Russ’ MVP season-I dont think there is a single team in the league that would trade for Westbrook rn in any capacity unless another team took on most or all of his contract",
    "827": "Cleveland Cavaliers’ Ricky Rubio has torn ACL in left knee, done for season https://t.co/PFig2oLslC",
    "828": "Lebron James\nCleveland Cavaliers 2014/15 #panini https://t.co/GhJzGIywQN",
    "829": "- 1984 Sunday: LeBron James, future NBA star with the Cleveland Cavaliers, the Miami Heat, and the Cavaliers once more was born in Akron, Ohio.\n- 1993 Thursday: Vatican City recognizes the state of Israel.",
    "830": "@cavs @denzelvalentine Shooter ready 🙇🏽‍♂️",
    "831": "@JPsAllDay1990 @TylerEPalisin9 @cavs @rickyrubio9 Well well, we can’t all be James Turner Jr the actor.",
    "832": "@_W1II_ @cavs Dragic would be perfect replacement for Ricky. Or even Rondo",
    "833": "@cavs Never too high never too low, #RickyRubio`ll be back much more stronger",
    "834": "Get @KingJames to the @cavs ! https://t.co/ppUd2SaH0A",
    "835": "@cavs Sad to hear this. :,(",
    "836": "BOUNCE BACK STRONGER, RICKY 🙏🏻\n\nCleveland Cavaliers' Ricky Rubio will miss the remainder of #NBA75 after being diagnosed with a torn ACL in his left knee. \n\n📷 Instagram/ruuufio https://t.co/6mQVelXi8Q",
    "837": "@GachoManGil @justa_renegade @cavs He’s a superstar",
    "838": "cdc recommends putting the NBA season on hold until Ricky Rubio comes back @cavs",
    "839": "The Cleveland Cavaliers announced on Wednesday that guard Ricky Rubio tore the ACL in his left knee and will miss the remainder of the 2021-22 NBA season.\n https://t.co/GB5VCAEWZi",
    "840": "@rickyrubio9 @cavs thank you for the joy this year. It’s refreshing to see the team playing well and looking like your finally having fun out there again. Thank you to Ricky Rubio for being a part of the turnaround. I always enjoyed watching your game. A true distributor.",
    "841": "@Kiel1718 @big_boi_TopShot @ElDumboTS @cavs @nbatopshot Go cavs ❤️",
    "842": "@Kiel1718 @ElDumboTS @cavs @nbatopshot Keep it going! Losing Rubio last night was crushing but I’m stoked to watch our big 3 ball out over the next decade @_bigjayy_ @evanmobley @dariusgarland22",
    "843": "@clefan4lyfe @CleveHub @cavs zero chance it happens without garland involved",
    "844": "@PickDawgz #274 \nNBA Brooklyn Nets -3.5\nNBA Cleveland Cavaliers +2.5\nNBA Golden State Warriors -3.5\n#PickDawgzCapperContest",
    "845": "@big_boi_TopShot @ElDumboTS @cavs @nbatopshot Nice!! Fellow Cavs fan here in the Top 50 in Cavs leaderboard.",
    "846": "@statmuse @jalenbrunson1 @dallasmavs @cavs heard y’all need a guard",
    "847": "@ChargeCLE @cavs @iammaliknewman @nbagleague @NBA Felicitations to Jackson, MS’s Own!",
    "848": "@ElDumboTS @cavs Thanks for the shout out @ElDumboTS! Pumped to be part of #TheFutureOfFandom with @nbatopshot reppin the NBA’s best team - the Cleveland @Cavs. Keep an eye on that #1 spot 👀",
    "849": "@cavs Everytime. Everytime Cleveland has something going for us, the curse on the lake comes back to us 😭",
    "850": "@trishdish24 @astephens13 @cavs @deanwade3232 @mbruck_7 Love it😤",
    "851": "When it comes to this King you know him on the court from the #ClevelandCavaliers to the #Lakers and you can catch his movie #SpaceJamANewLegacy in streaming or on DVD and Blu-Ray and despite what the haters say he is still dope to us all #HappyBirthdayLeBronJames https://t.co/SSNBWHLnFN",
    "852": "@cavs @trishdish24 @deanwade3232 @mbruck_7 @Sergio_255 👀 who he dunks on 😈",
    "853": "What is really cool though is both of these collectors have over 95% of their Collector Score in @cavs Moments. And over 85% of their Moments are @Cavs Moments. That's pretty cool, but I guess to be expect from #TheFutureOfFandom",
    "854": "The #1 spot, who I believe is @WestGGirl73, isn't even holding a FULL team set for the @cavs. The image is @WestGGirl73 above and @big_boi_TopShot on underneath. \n\nIf the #1 spot completed Series 1 and Series 3, I think their CS would 🚀\n\nSo grab some popcon, this could get fun🍿 https://t.co/1JpRKwmefL",
    "855": "@cavs @rickyrubio9 @kevinlove Missing Rubio already 😔\n                                     🙏",
    "856": "@cavs just out of curiosity; how many Machine Gun Kelly bobbleheads are being given away at the game Jan. 31st? Thinking about making the trek from NY, and want to see what the chances of getting one are!",
    "857": "The @cavs looked so promising at 20-13 even without leading scorer G Collin Sexton lost for season. Then devastation as G playmaker leader Ricky Rubio tearing ACL and he’s done. Rubio was key part of turnaround from 22-50 last season. Future clouded now.",
    "858": "Congratulations to brockstar1 who moved up 18 spots to take #24 on the Cleveland Cavaliers team leaderboard.\n\nhttps://t.co/BM2rGP6EdD",
    "859": "Another day another @FOCOusa BRXLZ @Browns @cavs #Browns #LetEmKnow https://t.co/5zSOuZ0Dbr",
    "860": "@_mcflyboi_ @cavs @egoldie80 Run the system J.B. Created… defend the perimeter.",
    "861": "@Eldin_TheOg @cavs Damn near at this point",
    "862": "@obeychantii_17 @cavs Idk, guess I'm not on their radar",
    "863": "@HipsterTito @cavs Again his current situation has nothing to do with his skills his mindset sure his skill no because if he were on the court with this team they would be a better team without doubt",
    "864": "Sources are telling me that in light of the Ricky Rubio injury, the Cleveland Cavaliers are interested in a deal for a starting caliber point guard.\n\nOne name to keep an eye on: Boston Celtics PG Dennis Schröder.",
    "865": "@cavs Cavs fans appreciate you Ricky. Hope you feel better soon 🙏",
    "866": "Congratulations to big_boi (@big_boi_TopShot) who moved up 1 spot to take #2 on the Cleveland Cavaliers team leaderboard.\n\nhttps://t.co/BM2rGP6EdD",
    "867": "@rickyrubio9 Loved your play and attitude and approach to the game this season, and wish you all the best in your recovery. May it be quick…we loved you as a part of the @cavs! You really #LetEmKnow this season.",
    "868": "Imagine @KingJames putting up the same numbers with the @cavs",
    "869": "@cavs I’m just #LetEmKnow https://t.co/CuCbFAGCV0",
    "870": "NBA League In 3 Years:\n1. Memphis Grizzlies\n2. Cleveland Cavaliers\n3. Charlotte Hornets\n4. Boston Celtics\n5. Minnesotta Timberwolves\n6. Atlanta Hawks\n7. Phoenix Suns\n8. New Orleans Pelicans\n9. Dallas Mavericks\n10. Toronto Raptors",
    "871": "@cavs pain",
    "872": "Ricky Rubio of Cleveland Cavaliers suffered a season-ending torn ACL injury. Praying for his successful and quick recovery. 🙏 #NBA",
    "873": "Cleveland Cavaliers guard Ricky Rubio has been diagnosed with a torn ACL in his left knee and will miss the remainder of the 2021-22 season, the team announced on Wednesday.",
    "874": "Ricky Rubio of Cleveland Cavaliers suffered a season-ending torn ACL injury. Praying for his successful and quick recovery. 🙏 #NBA",
    "875": "@DJuggin_ Needs to come back to @cavs",
    "876": "@stev_ftw @cavs Hmm how r u not in twitter jail for this ?",
    "877": "@BleacherReport Speedy recovery, my dude. Rubio has been running this @cavs ‘ offense so perfectly thus far this season.",
    "878": "This feels very @cavs to me. #NBATwitter https://t.co/zefquOGXiZ",
    "879": "@statmuse @kevinlove @cavs fg% is 4% better than last year where he just played 25 gms tho and is quasi at his career avg. But if he keeps up his career highs in 3pt and ft as well btw, he has a case at least. It's nice to see in general that both parties kept it professional after a buyout didnt happen.",
    "880": "@stuartadams70 @NBA @cavs @BenSimmons25 Sexton, Markkanen, Osman &amp; their 2022 first rounder. Good deal both sides I reckon.",
    "881": "MSN has not seen a single Cleveland Cavaliers game this season making comments like this one: https://t.co/YVdr1hgljN https://t.co/a3TtxNwS0b",
    "882": "Get well soon @rickyrubio9 😔 \nLet’s go @cavs ! #Cavs https://t.co/xXJUa3mKDn",
    "883": "NOW do the @Cavs trade for Ben Simmons? 🤔",
    "884": "10. Ricky Rubio\n\n📊 Detailed Stats: https://t.co/8FZOUPRBJv\n📰 News Related:\nESPN: Cleveland Cavaliers' Ricky Rubio has torn ACL in left knee, done for ...\nhttps://t.co/sXFci61Jsm",
    "885": "@CleSportsTwist @cavs Anyone but dog shit Simmons",
    "886": "@confidence_CM @cavs Yeah your right on that 2.",
    "887": "Awful.\n\nCleveland Cavaliers' Ricky Rubio has torn ACL in left knee, done for season https://t.co/dPT51fPSDu",
    "888": "@Karthik36629770 @mothron111 @cavs Hope he keeps that in mind with Love",
    "889": "@cavs I’m ready https://t.co/5YIcVxuX3E",
    "890": "@_mcflyboi_ @cavs I wouldn’t trade players for him. Chemistry too good",
    "891": "@confidence_CM @cavs Yeah I guess you're right but who would we trade for him. Like who would you?",
    "892": "@BrianVamos @cavs Minor setback for a major comeback 🔛🔝🔜",
    "893": "@cavs can you have Koby go ahead and give this man an extension now? Please and thanks! #LetEmKnow https://t.co/PNVUfKUiuP",
    "894": "@cavs @nick_cas1 get well soon 😔",
    "895": "@cavs Gutted.",
    "896": "@CleSportsTwist @cavs Dragic",
    "897": "@ProvideContext For me its the THT and Westbrook parts that got me fuming. THT must have touched a \"monstars\" basketball, his skills are zapped. And Westbrook with all those missed layups. Im telling you, it really gives me 2018 Cleveland Cavaliers vibes and its frustrating beyond.",
    "898": "@cavs prayers up for a quick recovery🙏",
    "899": "Good thoughts to @rickyrubio9. You’ll come through this stronger. @cavs @nba https://t.co/wB0QSuLARn",
    "900": "@cavs @rickyrubio9 say it ain’t so, I need you to rub some dirt on it and get back out there. Speedy recovery.",
    "901": "@cavs Bring back LeBron please",
    "902": "@_mcflyboi_ @cavs I just want a ball handler. I really don’t care who it is but we can’t do much with only garland then pangos",
    "903": "@ShannonSharpe Time to rebuild @Lakers Lebron going back to @cavs",
    "904": "Crying get Lebron back to the @cavs ASAP, let him play PG",
    "905": "@confidence_CM @cavs He's worth just a second round pick and a bag of chips as of right now. But Philly is going to over ask and want a TON. So I don't see it happening but maybe Portland might work.",
    "906": "@timcorr @NBA @cavs @BenSimmons25 Who they going to trade for him?",
    "907": "Cleveland Cavaliers' Ricky Rubio has torn ACL in left knee, done for season\nhttps://t.co/Zc6RBgluwq",
    "908": "Cleveland Cavaliers guard Ricky Rubio suffers a season-ending injury: https://t.co/ijdWSRx16L",
    "909": "@YoBoyPo @cavs Why Sexton there? He out for the whole season too",
    "910": "Alright let's get this thing rolling @cavs 10 day the man https://t.co/BdVXkQL9h3",
    "911": "Dear @JoNosuchinsky: YOUR @chicagobulls just bitch-slapped the @ATLHawks for the 2nd time in a week, are on a 5 game winning streak &amp; behind the @BrooklynNets for best record in the East. (Save the @cavs, we're the best kept secret in the @nba &amp; u can't keep a secret. Go blab.) https://t.co/PgVrW8ADYw",
    "912": "@rickyrubio9 Get well soon. Thanks for everything you’ve done to turn the @Cavs around. Looking forward to watching you play again next season.",
    "913": "Damn, I miss Kobe. Love what Rubio has done for the @Cavs this year.  Hopefully, we see more in Cleveland next year. https://t.co/Ri3U0moQSh",
    "914": "@cavsfan_421 I heard from a source that he could be headed to the Cleveland Cavaliers for Cedi Osman and Kevin Pangos",
    "915": "@ArnellScott2 @cavs @egoldie80 Philly is asking for a TON so for what?",
    "916": "@Zachary90416743 @ArnellScott2 @CleFrownsFan @cavs @egoldie80 @PF Thomas just got signed but either way he has already been here before back then and it never worked out so signing him again to me is just like wearing the same dirty underwear after taking a shower.",
    "917": "@Mark25Price Any chance you can give the @Cavs 10-15 minutes a night off the bench?",
    "918": "@_mcflyboi_ @cavs Yes please. We don’t need picks sadly",
    "919": "@confidence_CM @cavs 3 FIRST ROUND PICKS FOR SIMMONS?!",
    "920": "@cavs Fs hope this wasn’t his last cavs game please somehow pick up a vet pg eg..Brandon Knight would of been solid",
    "921": "@Anthony_layup @BiBigGuy911 @cavssebastian2 @statmuse @kevinlove @cavs Danny Granger won once but honestly could have won the season he went from 13 to 20 points a game the year before, you can improve twice IMO but if you have already had better stats in another season probably not.",
    "922": "With one of my favourite @NBA players Ricky Rubio tragically tearing his ACL yesterday, it makes even more sense for the @cavs to aggressively go after @BenSimmons25 now. Just gotta’ make it happen!",
    "923": "@CleSportsTwist @cavs don't want Simmons!!!",
    "924": "This absolutely sucks! The Cleveland Cavaliers are such a great story rn, fighting for a top 4 finish in the East. Having already lost Collin Sexton too… https://t.co/6lTRDaFeoZ",
    "925": "@cavs We love you Ricky get well",
    "926": "@statmuse @kevinlove @cavs Completely agree",
    "927": "Ricky Rubio was having a great year and had an amazing Olympics and of course 2021 takes away his ACL. Probably one of the guys I was most psyched for when got drafted in 2009. @Timberwolves @cavs",
    "928": "@BillSimmons Crazy how the Cleveland Cavaliers are a better team with a better future than Boston.  If someone said that 3 months ago they would be put into an insane asylum",
    "929": "@beez_plug @cavs Wow. Really? No kidding 🙄",
    "930": "With Ricky Down they need to go get Ben Or Cam now…@cavs",
    "931": "I wanna see Ben Simmons on the @cavs",
    "932": "@cavs I know someone that fits this parameter @Matt_Lafka https://t.co/HjnjgANkwV",
    "933": "@CleSportsTwist @cavs No thank you",
    "934": "@cavs now i saw about Rubio, i mean, you guys should really start considering my offer",
    "935": "@SportsCenter @cavs have. Better record",
    "936": "If the @cavs don’t get Simmons, who should they go after next? #LetEmKnow",
    "937": "Rubio out for year is just the luck for CLEVELAND FANS. 4 months ago I would have never thought a Rubio injury would be so critical but that man has been BALLING this year, plus his veteran presence on the court. Hope @cavs make some midseason moves",
    "938": "If you need depth, she’s available @cavs",
    "939": "@TheCrossover @SIChrisMannix @cavs damn vaccine",
    "940": "@Jon_Vasey77 @cavs If the Sixers made a trade NOT involving them though they’d all get fired!… I’m thinking more like TJ McConnell, E’twaun Moore, Cory Joseph as the guy to go get",
    "941": "@cavs still sad",
    "942": "@apre44 @cavs I agree 100%. If we could keep those two guys it’s totally worth it.",
    "943": "@Jon_Vasey77 @cavs In a heartbeat and even before this injury… despite looking like my grandma when he shoots he’s still a Top 20 guy… not sure how we do that though w/out trading DG or Mobley and for them I wouldn’t",
    "944": "@Zachary90416743 @CleFrownsFan @cavs @egoldie80 @PF I like this a lot! We’d be huge and hard to score on.",
    "945": "@apre44 @cavs Would you trade for Ben Simmons?",
    "946": "@KeithSmithNBA I think @cavs should chill re this season. Leverage Sexton into getting into the '22 Lottery.",
    "947": "give me my 10 day @cavs https://t.co/UXI6vYh4Kb",
    "948": "I’m not gonna undersell how big of a loss Ricky Rubio is for the @cavs but if his injury is the reason this goes South and we miss the playoffs that’s a real problem",
    "949": "Free agency… Jeff Teague would be an interesting fit. I also think DJ Augustin would thrive and be a solid trade worthy of draft stock. I think you call Teague first. @cavs",
    "950": "@Coach__KB24 @cavs Nahhhhhhhhh lol 😆",
    "951": "Cleveland Cavaliers trade Lauri Markannen to Sacramento for Buddy Hield. Who says no?",
    "952": "@intheairimaging @rayjr216 @cavs Thought it was a 10 day or is it for the rest of the season?",
    "953": "Blessing in disguise? @cavs  #Lotto",
    "954": "Aww Man Ricky Rubio has suffered a Season ending torn ACL Damn Thats wack For The Cavs Prayers up 🙏🏽🙏🏽 @rickyrubio9 @cavs",
    "955": "@omieg89 @confidence_CM @cavs Well we are going right back down the table like last year if that’s what you think",
    "956": "Cleveland Cavaliers Signed Malik Newman\nSigned guard Malik Newman to 10 day contract.\n\nVia NBA Hardship Exception  \n\nWas with Cleveland Charge in 13 games (4 Starts) \n\n#cleveland #Ohio #Cavaliers #NBA #nbagleague #toledo https://t.co/SlLjCSuQkE",
    "957": "@ArnellScott2 @blakematthew361 @cavs @egoldie80 Clearly",
    "958": "Cleveland Cavaliers trade Kevin Love and Colin Sexton to Portland for C.J. McCollum. Who says no?",
    "959": "@JDaukausJr @wojespn @cavs FACTS send them Kevin Love and Sexton",
    "960": "@cavs Dang shame. He was playing outstanding. We are up against it w/o Ricky and Sexton. What will GMKA do?????",
    "961": "@GCam1 thanks for recording my basketball video, I’m signing a 10 day contract with the @cavs",
    "962": "@cavs \n@rickyrubio9 \n#letemknow \nHeal soon.....#getwellsoon https://t.co/fka7oMZba7",
    "963": "@cavs damn.",
    "964": "@cavs I’m so sorry Ricky you are in our prayers.",
    "965": "@statmuse @kevinlove @cavs Can get unfollowed for shit like this lol",
    "966": "@rickyrubio9 thanks for an #incredible 1st half of the season! @cavs Nation is grateful!!!!!! Heal well! 🙏🏽",
    "967": "@rickyrubio9 sending you the best vibes on recovery ❤️ Thank you for your dedication and we can’t wait to see you in @cavs gear next year 💪 https://t.co/eFJjfcblp5",
    "968": "Dang it!   @cavs #nextman up https://t.co/xiS8sP6UXL",
    "969": "@cavs I have excellent court vision and am not going to shoot a single 3. Vet minimum will suit me well.",
    "970": "@cavs Prayers up 🙏",
    "971": "oh shit big loss @cavs ricky rubio out  the  season ,,, I know how ACL feel... and this 2nd times he go ACL on the same knee , speed recovery https://t.co/7LHMeTwWj6",
    "972": "@lebrondecelta @okudah_szn @cavs Justin Silva Jr",
    "973": "@CleFrownsFan @cavs @egoldie80 I understand that getting Ben Simmons may interrupt our team and it might ruin somethings we good at, but with Rubio and Sexton out… we have to make a move to help this great season we are having…",
    "974": "@CleFrownsFan @cavs @egoldie80 Garland… do you not understand Ben Simmons is 6’10.. our team is about height and defense.",
    "975": "@betonthegame @cavs That’s a great one! I’m surprised as well. Might be a good get for Cavs.",
    "976": "@cavs Literally have 2 players out for the season cause of injuries.\nBasketball gods lowkey hates the Cavs",
    "977": "@ArnellScott2 @cavs @egoldie80 Yes but we need the PG to have an outside shot as well which he blows ass at.",
    "978": "With all these 10-day contracts flying around, why hasn’t Kris Dunn been picked up?\n\nHe’s an elite on ball defender who can provide bench scoring. Why not him over half of these guys?\n\n@Zaknoble @cavs https://t.co/wMuijdjEnu",
    "979": "@CleFrownsFan @cavs @egoldie80 The Cavs is a defensive team.. what is Ben Simmons good at?? Okay then..",
    "980": "@trailblazers @cavs can you guys send CJ home plz",
    "981": "With Rubio being out, I wouldn't be mad if the @cavs gave @isaiahthomas a 10 day contract, ....we could honestly use the scoring help .... Don't think they can survive with Valentine and Pangos for that long",
    "982": "@blakematthew361 @cavs @egoldie80 We don’t need him to score.. you clearly don’t know basketball",
    "983": "@CleFrownsFan @cavs @egoldie80 We don’t need him to do what Philly asked him to do.. we just need him to dribble and run the system",
    "984": "Bring on Ben Simmons &amp; keep us in contention @Cavs! #ReloadNotRebuild.",
    "985": "Off night for my @Cavs so I’ll watch Bron/JA with this Lakers/Grizz match up.",
    "986": "@cavs Go CAVS !!!",
    "987": "@cavs are going to be just fine.",
    "988": "Oh no! A huge loss for @cavs. Rubio was a huge part of their great start to the season. Between Covid and injuries, the Cavs have a huge uphill battle. #Cavs https://t.co/00npw78d22",
    "989": "@RMFieldHouse @cavs @monstershockey Why not start immediately ?",
    "990": "@cavs Wishing Rubio a speedy recovery, so disappointing, a big loss!",
    "991": "@cavs Ah, man.  You were ballin' out there this season, Ricky. Get well.  We miss you already.",
    "992": "@cavs Was afraid of that when he went down… we will all miss him on the floor!",
    "993": "@JohnTelich8 @cavs Heart and soul. I hope the young guys have learned enough from him to keep the torch going",
    "994": "🚨 injury report: \n\nRicky Rubio out for remainder of the season with a torn ACL\n\nMajor blow for Cleveland Cavaliers\n\nStats: 13.1 PTS per game \n            6.6 Assist per game https://t.co/ZpZJhnV3xP",
    "995": "@CoryJ2216 @cavs What would you give up for him to match salaries.",
    "996": "@cavs This hurts",
    "997": "@cavs Man that’s a total bummer. https://t.co/38VEK3ZKP5",
    "998": "@cavs Bummer",
    "999": "Cleveland Cavaliers Guard Ricky Rubio's Season Ends Due To Torn ACL – NBA News https://t.co/yMsDpSLIZQ",
    "1000": "To be honest, I could say my heart sank for Rubio when the @cavs released the news 5:33.. but truth be told my ticker dove to the basement when I saw him go down Tues night.  #notadoctor",
    "1001": "Cleveland Cavaliers Guard Ricky Rubio's Season Ends Due To Torn ACL – https://t.co/41ENgpyWL2",
    "1002": "@cavs Wishing Ricky a speedy and complete recovery. He really was the spark the Cavs needed. Loved watching him play. 😢",
    "1003": "@cavs @cavsdan @CavsFredMcLeod @CavsLegionGC @CavsSirCC @CavsJoeG @CavsNotes @CavsNationCP @CavsMoondog @Usher rubio is out for the season and so is sexton so just gunna throw this out there we need to sign @imanshumpert and @isaiahthomas",
    "1004": "@JPsAllDay1990 @cavs @rickyrubio9 You realize every team has injuries right?",
    "1005": "@cavs  we do not want Ben Simmons",
    "1006": "@jth006 @cavs You take Ira. I'll take Kyrie!!",
    "1007": "lets get dragic @cavs",
    "1008": "@camijustice @KaylynHlavaty Could this push the @cavs to make a trade for Ben Simmons?",
    "1009": "Cleveland Cavaliers Guard Ricky Rubio’s Season Ends Due To Torn ACL https://t.co/YEdCyPsoUz",
    "1010": "@cavs Man oh man oh man I am so so SO fucking bummed right now everything just totally sucks suddenly 😞",
    "1011": "Congratulations to big_boi (@big_boi_TopShot) who moved up 1 spot to take #3 on the Cleveland Cavaliers team leaderboard.\n\nhttps://t.co/BM2rGP6EdD",
    "1012": "Ricky Rubio injury update: How long is Cleveland Cavaliers guard out? https://t.co/OxFFR2Mx3G",
    "1013": "@cavs This hurts so much :(",
    "1014": "Cleveland Cavaliers' Ricky Rubio has torn ACL in left knee, done for the season https://t.co/vr8BiuDatY",
    "1015": "🥲 Get well @rickyrubio9! Go @cavs https://t.co/qWkgZ0ILTA",
    "1016": "Is @ShaunLivingston available? The \"fun\" @cavs could use you right now",
    "1017": "@cavssebastian2 As CLE fans, we’re not allowed to have nice things. Rubio was a key piece the @cavs needed.",
    "1018": "@cavs Not my favorite cav 🙁",
    "1019": "Check out LeBron James,  ROOKIE McFarlane Figure NBA Series 5, Cleveland Cavaliers https://t.co/HOr3APi5wQ @eBay ⁦@eBay_retweeter⁩",
    "1020": "Give Barry Brown a call and reunite him with Dean Wade @cavs",
    "1021": "@cavs Damn he was playing so good this season",
    "1022": "@cavs Life as a Cavs fan is not fair",
    "1023": "@PeppaPike @cavs I was just thinking the same thing",
    "1024": "@crfhenriqux 1 - New Orleans Pelicans \n2 - Portland Trailbrazers \n3 - Atlanta Hawks \n4 - Cleveland Cavaliers",
    "1025": "@cavs Ugh. Rubio was elite this year. They will still be fun to watch, but this is a major blow.",
    "1026": "Check out LeBron James, eTopps Canvas Poster Rookie Year 2003, Cleveland Cavaliers, Scarce https://t.co/oOeM1c47Yv @eBay ⁦@eBay_retweeter⁩",
    "1027": "@ConorKilbane6 @cavs Bold you assume they’d agree to that",
    "1028": "@ConorKilbane6 @cavs Yea I’m not willing to throw away any chemistry we still have",
    "1029": "@I_am_Caden @cavs Probably not going to be enough, we could also maybe throw in Dean Wade or someone close",
    "1030": "@I_am_Caden @cavs Dylan Windler, Denzel Valentine, and a 2nd",
    "1031": "@ConorKilbane6 @cavs I’m just wondering what we’d give up for him",
    "1032": "The duo of Ricky Rubio and Darius Garland took the @Cavs from good to great this season\n\n After suffering a torn ACL last night, how will they look without Rubio going forward? 😔 https://t.co/SjKB38SIrD",
    "1033": "@xKayoss @fraudulentjimmy there is not one current player on the cleveland cavaliers that could lick the boot of Stephen Curry",
    "1034": "@cavs PHX fans sending love, @rickyrubio9",
    "1035": "Check out Cleveland Cavaliers 2016 Champions T Shirt Size Large #NBA #ClevelandCavaliers https://t.co/dSSQkxmeld via @eBay",
    "1036": "@I_am_Caden @cavs Nah, Dragic is 35 and on the back end of his career. Schroder would give us a dangerous option off the bench and he’s in his prime",
    "1037": "@cavs Bummer",
    "1038": "Cleveland Cavaliers Guard Ricky Rubio’s Season Ends Due To Torn ACL https://t.co/wmNjl0zrbM https://t.co/8RStHpl8yL",
    "1039": "#SportsMoney #sportsmoney Cleveland Cavaliers Guard Ricky Rubio’s Season Ends Due To Torn ACL: Ricky Rubio, a key figure in the Cleveland Cavaliers’ turnaround this year, is now done for the year. https://t.co/sKWXu4Qbsc",
    "1040": "@cavs @rickyrubio9 @kevinlove @kevinlove million prayers for @rickyrubio9 🙏🏼🙏🏼🙏🏼",
    "1041": "@Sam_Scharfeld @cavs Who is playing backup point guard ?",
    "1042": "@cavs @rickyrubio9 @kevinlove This is devastating news. Sending Ricky healing prayers .",
    "1043": "@cavs not ricky man https://t.co/QTyJqDebnI",
    "1044": "@cavs sign IT as a Rubio replacement",
    "1045": "Cmon #Cavs fans!!  This is about me!   Vote yes!  I’m drinking beer with a Houston radio DJ and he says no. Don’t let Houston beat us! #Cleveland #CLE @cavs https://t.co/cYSrXIgrJE",
    "1046": "@TheCrossover @SIChrisMannix @cavs Start drinking heavily Chris! https://t.co/irOVPIDr8m",
    "1047": "@cavs The basketball gods hate Cleveland.",
    "1048": "4 ideal Cleveland Cavaliers trade scenarios following Ricky Rubio injury https://t.co/AIDlFb6i9i",
    "1049": "@ConorKilbane6 @cavs Kinda hoping Dragic gets a buyout, that way we don’t give up any assets",
    "1050": "T’s and P’s to Ricky. @cavs There is a solution: Jimmer time @jimmerfredette see you soon https://t.co/iFAalxZHaj https://t.co/rkka9NBgFg",
    "1051": "@cavs Why do both of my favorite teams always suffer from injuries so much 😔 https://t.co/6zg2CN9Z17",
    "1052": "@cavs Get well soon Rubio! 🙏🙏",
    "1053": "@CoryJ2216 @cavs Fuck that, I’d rather have Ira Newble",
    "1054": "@Karthik36629770 @mothron111 @cavs Should have gotten a better third guard than Pangos in the offseason. The guy is just good at bringing the ball up the court. That’s it.",
    "1055": "@cavsalcorn @cavs @rickyrubio9 Sucks.",
    "1056": "Y’all need an all star pg? @cavs jsut need y’all got give up Lauri and Sexton we be good. https://t.co/ovezeGm5sj",
    "1057": "@confidence_CM @cavs It doesn’t require that dramatic of a move.",
    "1058": "@mothron111 @cavs My same thought.",
    "1059": "@cavsalcorn @cavs @rickyrubio9 Brutal setback",
    "1060": ".@cavs' @rickyrubio9 out for season with torn ACL in left knee\nhttps://t.co/FvE9o9FGwg",
    "1061": "Cleveland Cavaliers Guard Ricky Rubio’s Season Ends Due To Torn ACL https://t.co/boDhZqRBhr #followback #news #sdv #siguemeytesigo",
    "1062": "@okudah_szn @cavs fair enough",
    "1063": "$41.99 - CLEVELAND CAVALIERS TWO-TONE HOOPS 59FIFTY FITTED https://t.co/onq2eLMtFV https://t.co/5zoA1XO8n0",
    "1064": "Rubio may be out but this @cavs team isn’t #Cavaliers",
    "1065": "@nizcomix cavs have no backup point guard. i’m 6’2 and available @cavs",
    "1066": "@manskyjoey @cavs Yeah with Rubio going down",
    "1067": "@wojespn @ESPNNBA Man, this sucks. He was playing great this season, @cavs were doing well. Prayers to @rickyrubio9, I hope you will come back better than ever. 😑🤦🏻‍♂️🙏🏼 https://t.co/totBim4M2P",
    "1068": "@JenHale504 @PelicansNBA @cavs @SrDavidWesley4 @adaniels33 @BallySportsNO Attagirl. Go get em.",
    "1069": "@Amerifinn67 @cavs Dunno, but you’ve been signed to a 10-day contract.",
    "1070": "@cavs hey im here sign me, i can pass the ball and i wont attempt a shot",
    "1071": "@SYKsports @cavs @ATLHawks @Pacers Hawks quickly",
    "1072": "@God_Son80 Cleveland Cavaliers basketball!!",
    "1073": "@cavs This is very sad",
    "1074": "@cavs world cant stand mighty Cavaliers",
    "1075": "Bad news for @cavs fans as Ricky Rubio tore his ACL and will miss the reminder of the season. Just as they were surprisingly playing excellent basketball.",
    "1076": "@cavs @JCrossover still got some gas in the tank",
    "1077": "Mobley for sure. He has the @cavs playing like a way different team.  #NBATopShotThis https://t.co/yNFrUk6un9 https://t.co/9BSpv7VBtv",
    "1078": "@BleacherReport I don’t know how to say “prayers” in Spanish bro but damn 😕 @rickyrubio9 @cavs @FIBA_es 💛🤍",
    "1079": "Cleveland Cavaliers star Ricky Rubio will miss the rest of the NBA regular season after suffering a season-ending ACL tear to his left knee.\n\n#LetEmKnow https://t.co/OLpI4w2WWH",
    "1080": "@neorsd @cavs Sounds good!",
    "1081": "@ohokvontae @statmuse @kevinlove @cavs Nah D. Murray winning it, dude is killin it this year",
    "1082": "Evan Mobley’s Offensive Potential Was On Full Display In His Return To The Cleveland Cavaliers https://t.co/r787679KKE #followback #news #sdv #siguemeytesigo",
    "1083": "@cavs @rickyrubio9 @kevinlove Fast recovery RR🙏🙏",
    "1084": "@cavs 😢 Do it for him, the ring 💍 You knew you could, you know you can #LetEmKnow Force Cavs and ánimo Ricky! @rickyrubio9"
}