{
    "0": "@x_a_3_z_x_4_x_ @the_picketfence @advogado_lucas @trailblazers Lmao. That’s funny. “The raptors are one of the best teams in the past decade” They only won a championship cause Durant got hurt. It was basically a joke. And kawhi left that joke of a franchise after a year.",
    "1": "Wow really? 😒 what about the @trailblazers ? @Dame_Lillard https://t.co/WMlJB4Uicq",
    "2": "@memyselfI18339 @ArnavjFvv @advogado_lucas @trailblazers Is he? So ur argument is other teams have bad contracts, so that makes his contract ok? He’s not better than Westbrook lol.",
    "3": "☀️The Phoenix #Suns go for win No. 6 in a row vs. the Portland Trail Blazers at 7 p.m.🏀\n\nListen live on 98.7 FM. #ValleyProud https://t.co/H32zfJL7Jc",
    "4": "Future @trailblazers starting center 🙌🏽🔥 https://t.co/x4koYvzlcR",
    "5": "@Davedaviddave12 @UTDFuckingSuck @advogado_lucas @trailblazers What's delusional about what I said? Why would the Raptors give up its young core for a 30 year old dame? And even if we did, were giving up our depth, so who would he play with?? Plz dont talk about delusional, lol. Not sure who you think Dame is.",
    "6": "The @TrailBlazers starting Lillard, McCollum, Powell, Covington, Nurkic on Wednesday. #RipCity #NBA",
    "7": "Portland Trail Blazers (+5) @ Phoenix Suns #ValleyProud #RipCity #NBA #NBATwitter #NBA75",
    "8": "Portland Trail Blazers Starters:\n\nDamian Lillard\nCJ McCollum\nNorman Powell\nRobert Covington\nJusuf Nurkic\n\n#RipCity #NBA #NBATwitter #NBA75",
    "9": "#NBA #NBATwitter Today's Lineups\n\n#RipCity\nPortland Trail Blazers Starting 5:\nDamian Lillard\nCJ McCollum\nNorman Powell\nRobert Covington\nJusuf Nurkic\n\n#ValleyProud \nPhoenix Suns Starting 5:\nChris Paul\nDevin Booker\nMikal Bridges\nJae Crowder\nJaVale McGee",
    "10": "Tonight's starting lineup for the Portland Trail Blazers: Lillard, McCollum, Powell, Covington, Nurkic https://t.co/bVWH4Av1bs",
    "11": "This just happened. \n\nI turned down tickets to see the @trailblazers at @Suns so I Can watch @AEW Dynamite. \n\nThat’s how Good AEW is.",
    "12": "@Davedaviddave12 @advogado_lucas @trailblazers 11 with 3 min to go in the first half",
    "13": "The Phoenix Suns look to get revenge on the Portland Trail Blazers | PHNX Suns Pregame Show https://t.co/npUJGxMEc0",
    "14": "@timelord_ts @nbatopshot @trailblazers @NBAHistory Anytime brother !! Was just asking for this to be a moment 2-3 days ago and you made my wish come too 🔥🏀🙏🏼 Looks awesome !! Especially as an RIB 😎",
    "15": "@Nardelli_M @nbatopshot @trailblazers @NBAHistory Thanks!!!",
    "16": "Today's NBA Picks: 9:10 PM ET - Portland Trail Blazers vs. Phoenix Suns - 18 PICKS AVAILABLE: https://t.co/aOsPTsKPav #nba",
    "17": "@trailblazers @Suns @ROOTSPORTS_NW @RipCityRadio620 Give us Dame plz",
    "18": "@trailblazers @Suns @ROOTSPORTS_NW @RipCityRadio620 Ayton is nice playin we could win this",
    "19": "@advogado_lucas @Davedaviddave12 @trailblazers Ahhh. No thank you.",
    "20": "Portland Trail Blazers de local\n\nRecord: 5-1\n114.1 OFF RTG (1° NBA)\n100.5 DEF RTG (3° NBA)\n\nPortland Trail Blazers de visitante\n\nRecord: 0-5\n103.8 OFF RTG (24° NBA)\n116.3 DEF RTG (30° NBA) https://t.co/HemvcgyfMG",
    "21": "@trailblazers please get back on @hulu",
    "22": "@trailblazers @Suns @ROOTSPORTS_NW @RipCityRadio620 Brutal schedule but still love game days!🙌🙌❤🖤",
    "23": "Los Angeles Clippers vs Portland Trail Blazers was on TNT (SAP). With commentary from José Medellin. Co-commentator is Marcelo Godoy.  For more details see https://t.co/VbhJE4r5SD #LosAngelesClippers #PortlandTrailBlazers #TNTSAP",
    "24": "@trailblazers @Suns @ROOTSPORTS_NW @RipCityRadio620 LETS GET THIS DUB WDMIN",
    "25": "@trailblazers @Suns @ROOTSPORTS_NW @RipCityRadio620 Lets get it",
    "26": "🏀 #RipCity  at @Suns \n⌚️6PM\n📺 @ROOTSPORTS_NW |https://t.co/yBftNpfldh\n📻 @RipCityRadio620 https://t.co/hfmjwkjr2b",
    "27": "@Davedaviddave12 @Alphabizzle @ProlificRomo @CanadianFreak @advogado_lucas @trailblazers You keep bringing up random points, did anyone say the Raptors are better after losing Lowry?",
    "28": "@Davedaviddave12 @Alphabizzle @ProlificRomo @CanadianFreak @advogado_lucas @trailblazers Please tell me why you think the Raptors roster is a mess 🤦🏽‍♂️. Go watch KD’s post game interview on Nov 7 before you speak such nonsense. If Dame ever wanted to come to the Raptors, its because we have a ring, championship experience, and made it farther than Portland has",
    "29": "@Davedaviddave12 @ProlificRomo @CanadianFreak @advogado_lucas @trailblazers I remember winning a championship. Which is something the Blazers haven't done in decades. Let alone I can't even remember when the Blazers were considered serious contenders coming out of the west.",
    "30": "@Davedaviddave12 @sirius1atplay @advogado_lucas @trailblazers I don’t think u get that we don’t want same unless it’s straight up for siakam. OG and or Barnes are not worth it for a 31 yo pg",
    "31": "@Davedaviddave12 @advogado_lucas @trailblazers Sorry. I’m not one of those types of fans. And in the end it doesn’t matter. Toronto won.",
    "32": "@Davedaviddave12 @kev1nwashere @advogado_lucas @trailblazers He’s currently the odds on favourite to win Rookie of the Year by about every betting agency. Are you seriously not following basketball at all?",
    "33": "@Davedaviddave12 @ImNotBrownImTan @ProlificRomo @CanadianFreak @advogado_lucas @trailblazers Raptors roster is not a mess. We have way more balance and potential across the board. Wonder why you can't make trades to build around Lillard? It's because the rest of your roster is trash outside of Dame and Cj lol",
    "34": "@Davedaviddave12 @ProlificRomo @CanadianFreak @advogado_lucas @trailblazers I spit facts. You just trolling at this point. Good luck having to watch the Trailblazers going forward. Gonna need more burners to defend that squad.",
    "35": "@Davedaviddave12 @xRALJR @ChasingMyCROWN_ @KaranT0078 @trailblazers Was his foot broken against the pelicans too? Or was dames? Cos these numbers are flat out embarrassing 😂 (he got swept as well) https://t.co/xjchAiPufA",
    "36": "@ImNotBrownImTan @Alphabizzle @ProlificRomo @CanadianFreak @advogado_lucas @trailblazers I was talking about a hypothetical trade cause the raptors roster is a mess like the blazers. I ever said dame would go to Toronto, he would quit before he went to Canada to play for a 27-45 team. He wants to win, not crawl into the 8th seed in the east.",
    "37": "@Davedaviddave12 @sirius1atplay @advogado_lucas @trailblazers If u think raptors are giving up Scottie and siakam for ANYONE on Portland ur smoking something strong. Scottie is by far the best rookie rn and has a ceiling as high as giannis. We don’t want a 31 yo pg who can’t shoot anymore if the team is looking to the future",
    "38": "@Davedaviddave12 @Alphabizzle @ProlificRomo @CanadianFreak @advogado_lucas @trailblazers So your only come back is that Portland makes the playoffs every year? Are we giving participation trophies? Nobody is scared of Portland. You’re talking about Raptors record but then you want 3 of our main players? Do you even think before speaking?",
    "39": "@crtrlndn Portlandtrailblazers",
    "40": "@suns vs @trailblazers today!!\n\n#ValleyProud",
    "41": ".@jwquick honestly, do you think the @trailblazers get out of the first round this year? sincerely asking",
    "42": "@Davedaviddave12 @xRALJR @ChasingMyCROWN_ @KaranT0078 @trailblazers Yep that’s why they lost to the Murray-less nuggets in the first round, who then went on to get swept by the suns team you speak so lowly of 💀💀💀",
    "43": "@Alphabizzle @ProlificRomo @CanadianFreak @advogado_lucas @trailblazers Simons is better than any guard on the raptors. Just plays behind McCollum and dame, who are better than any guard in raptors history. Portland makes the playoffs every year in the west, raptors can’t win 30 games in the east. Lmao. 27-45",
    "44": "@BlazersBetta Bigger name? Lol yer lookin at one of the biggest names the NBA has .. #ripcity @trailblazers",
    "45": "@sirius1atplay @advogado_lucas @trailblazers Not like dame would even want to go to a 27-45 team lol. It would be a 3 team trade where raptors could get rid of siakims contract. SMH, u think players want to go and waste away in toronto, geez. The stupidity of the raptors fan base is legendary",
    "46": "@Davedaviddave12 @advogado_lucas @trailblazers Hahaha, you haven’t the slightest",
    "47": "@trailblazers Russ &amp; THT for DAME?",
    "48": "@digitalpoet @ArnavjFvv @advogado_lucas @trailblazers It was just hypothetical. Raptors would be like a 3rd team involved, cause dame wouldn’t want to even go there. He wants to win not miss playoffs completely. Pascal would be the hardest to move cause of his contract, so would have to be packaged with Barnes.",
    "49": "What an Evening of Basketball we get treated with Tonight\nWe got the @Bucks v @nyknicks : Giannis in the Garden\n@dallasmavs v @chicagobulls : Luka Magic taking on a hot bulls team\n@hornets v @memgrizz : LaMelo vs Ja!! Need I say more?\n@trailblazers v @Suns : Dame time in Phoenix",
    "50": "@meloferg has made a pick for @Suns vs. @trailblazers\n\nMatchup Performance:\nOverall: 78-60-3 (57%) \n\n#PhoenixSuns | #PortlandTrailBlazers\n    \nhttps://t.co/vvE3FIBMuA",
    "51": "@Davedaviddave12 @advogado_lucas @trailblazers except he didnt score in the whole 4th quarter and was in serious foul trouble all game so wasnt aggressive at all. but you know",
    "52": "@trailblazers Another L",
    "53": "@rapsfan902 @advogado_lucas @trailblazers Last game he didn’t, most of his points and stats came in garbage time",
    "54": "@Davedaviddave12 @advogado_lucas @trailblazers well see in a few hours",
    "55": "@Davedaviddave12 @advogado_lucas @trailblazers hell get that on put backs without a single play run for him",
    "56": "@Davedaviddave12 @advogado_lucas @trailblazers super super super easy over lol",
    "57": "@Davedaviddave12 @advogado_lucas @trailblazers He’s too good to play for a poverty franchise like that anyway. They can’t even afford a G league team lmao",
    "58": "🏀Phoenix Suns-Portland Trail Blazers\n🔹Chris Paul\n📎Plus de 9,5 Passes\n💰1,70\n\n#TeamParieur #NBA https://t.co/O03pC59s9L",
    "59": "The Phoenix Suns try to extend their five-game winning streak when they play host to the Portland Trail Blazers on Wednesday night 🏀 \n\nREAD ALL ABOUT IT HERE ➡️ https://t.co/RHTVqs0c3F\n\n#NBA #RallyTheValley #RipCity",
    "60": "@Davedaviddave12 @advogado_lucas @trailblazers oh i thought we were just doing fantasy trades with zero basis in reality so i partook",
    "61": "@BALLYSPORTSAZ @Suns @trailblazers My eight year old daughter was so excited to watch the game tonight. I had to tell her that we, along with majority of @Suns fans, won't be able to watch the game. She had a simple solution: \"maybe the TV channel should be nice and let people who want to watch the game watch it\"",
    "62": "🇺🇸#NBA\n🏀Phoenix Suns - Portland Trail Blazers\n📝Jusuf Nurkic: Duplo Duplo\n🔪1.98 | Pinnacle | 1%\n❤️Gostou? Dá um like!",
    "63": "@Davedaviddave12 @xRALJR @ChasingMyCROWN_ @KaranT0078 @trailblazers Best team in nba history is the kd-less warriors?",
    "64": "@trailblazers Let's gooooo!! 🙌❤🖤🙌❤🖤",
    "65": "@trailblazers @ROOTSPORTS_NW The ill will I feel towards the team and Root from this whole idiotic thing is not worth whatever stubborn negotiations you're doing with the platforms. And I'm a 10-game ticket holder! Get it together.",
    "66": "@hulu_support also @trailblazers @TrailBlazersPR @ROOTSPORTS_NW at some point you should come into the current millennium rather than going backwards with your ridiculous broadcasting deal by making a reasonable proposal to streaming platforms to be included.",
    "67": "@YodaRaptor @PhoenixGolf55 @advogado_lucas @Davedaviddave12 @trailblazers Perhaps I overreacted. My apologies 🙏🏽",
    "68": "Portland is in a back-to-back spot tonight at Phoenix &amp; the Trail Blazers are 0-5 both SU &amp; ATS in five road games this season. Suns, who are five-point favorites, have won five in a row &amp; covered in four straight (&amp; not in a back-to-back situation) w/ lone non-cover coming by 1.",
    "69": "@Davedaviddave12 @advogado_lucas @trailblazers Toronto don’t want your garbage",
    "70": "YALL HAVE TO GUARD THIS MAN TONIGHT AHAHAHAHA 😏 @trailblazers #Suns #DevinBooker https://t.co/RYWLIeZCFy",
    "71": "@hulu_support customer feedback FYI: we love y'alls service. Would've happily stayed a customer. We're canceling and moving to Xfinity (blah) because they have Root Sports and you don't. It's obnoxious the @trailblazers have made this a thing, but it is so here we are.",
    "72": "@trailblazers @CJMcCollum is this a joke?",
    "73": "@advogado_lucas @Davedaviddave12 @trailblazers Keep dreaming",
    "74": "@advogado_lucas @Davedaviddave12 @trailblazers toronto would prefer to trade those players in a three team for lebron AD and giannis tho",
    "75": "@advogado_lucas @Davedaviddave12 @trailblazers so essentially why don't you just cheer for the Toronto Raptors because you want to see Powell, Pascal, OG back together with Barnes. That trade makes no sense for Toronto.",
    "76": "@NBA @TonySnell21_ @trailblazers HAPPY BIRTHDAY GOAT\n@Menino_rola @mateusliminha @felpitcho @As_tall_as_cp3",
    "77": "@trailblazers As everyone should be!!!!!",
    "78": "@Iminsearchof 2021 Orlando Magic Lot $30 OBO\n2021 Philadelphia 76ers Lot $25 Shipped \n2021 Phoenix Suns Lot $25 OBO\n2021 Portland Trail Blazers Lot $25 Shipped https://t.co/zb8iU5hfkG",
    "79": "@Davedaviddave12 @MedosRunsitBack @PhoenixGolf55 @advogado_lucas @trailblazers Barnes has a higher ceiling then dame",
    "80": "@trailblazers @npowell2404 @CarMax Nooorrrrrmmmm!!!!!",
    "81": "Portland Trail Blazers vs Phoenix Suns\n\n26.00 https://t.co/wKOX2NtQkC",
    "82": "@Davedaviddave12 @jamal1122335 @PhoenixGolf55 @MedosRunsitBack @advogado_lucas @trailblazers If he's such a bum then why do so many teams want him? You're lying to yourself if you think he's bad",
    "83": "USO Northwest has been chosen as the non-profit partner for the 50/50 raffle during Monday's @trailblazers game. At the @ModaCenter, find the USO volunteers and purchase your raffle tickets!  #BeTheForce #MoreThanThanks #RipCity https://t.co/QetasT9WBD",
    "84": "@Davedaviddave12 @jamal1122335 @PhoenixGolf55 @MedosRunsitBack @advogado_lucas @trailblazers He can’t shoot but you also called him a 3&amp;D player. You been drinking?",
    "85": "@the_picketfence @Davedaviddave12 @advogado_lucas @trailblazers Lmfao he takes 1 three a game and this clown calls him 3&amp;D. At least try to act like you watch a little bit.",
    "86": "@Davedaviddave12 @CanadianFreak @advogado_lucas @trailblazers This has to be the dumbest thing I've ever read. Just because his usage is up doesn't mean he magically starts putting up good numbers. U still need to be good to put up good numbers.",
    "87": "@Davedaviddave12 @the_picketfence @advogado_lucas @trailblazers They swept you without KD, so what difference does it make?",
    "88": "@trailblazers please I’m begging https://t.co/Y4rDMb2O4I",
    "89": "@Dakodas_Dad @Suns @trailblazers Loved it.",
    "90": "@JERrrrrrrico @trailblazers They can have Flynn and Yuta for Dame although I’d be hesitant to include Yuta given how trash Dame has looked this year",
    "91": "@DannyDinerooo Phoenix suns vs Portland Trail Blazers \n\nI got bread on suns",
    "92": "@Darth_Sweydr @trailblazers Lmao Shush",
    "93": "@BALLYSPORTSAZ @Suns @trailblazers Too bad I can't watch it.",
    "94": "@Davedaviddave12 @advogado_lucas @trailblazers one its siakam not siakim \ntwo, we wouldnt even want dame rn... we're supposed to be retooling lmao",
    "95": "@MedosRunsitBack @PhoenixGolf55 @advogado_lucas @Davedaviddave12 @trailblazers Fair. I wasn't trying to. \n\nAnyways. Enjoy the game tonight",
    "96": "@MedosRunsitBack @PhoenixGolf55 @advogado_lucas @Davedaviddave12 @trailblazers Is this what all man Child do, lose it when arguments don't go their way. Keep it classy buddy \n\nNow time for a Block",
    "97": "@advogado_lucas @Davedaviddave12 @trailblazers Unless Portland has another top 25 player to go with Lillard, there's no way anything remotely like that is happening.",
    "98": "I’ve got just the guy for you @trailblazers https://t.co/ivO7hptP9T",
    "99": "@Davedaviddave12 @CanadianFreak @advogado_lucas @trailblazers Bookmark this",
    "100": "Oh my god! This is an amazing wallpaper. You guys rock for this @trailblazers https://t.co/Clv2W2fRr1",
    "101": "@trailblazers Gotta give it to POR... this was clever. But thanks for the dub last night.",
    "102": "Trail Blazers Game Notes: Portland Trail Blazers (5-6) vs. Phoenix Suns (6-3) https://t.co/GIKuS8tJhu https://t.co/Hcxx3zTyRK",
    "103": "@Suns @USAA @trailblazers @BALLYSPORTSAZ @FootprintCNTR @AZSports @az_mejor Let's go suns 🌞",
    "104": "@BALLYSPORTSAZ @Suns @trailblazers Who remembers the last time they were able to watch a suns game that wasnt a nationally broadcast game? I sure cant since Bally sports is literally carried on direct tv and cox only because of sinclairs greedy ass!",
    "105": "@advogado_lucas @Davedaviddave12 @trailblazers Trippin https://t.co/lao3sfjNh5",
    "106": "@MedosRunsitBack @PhoenixGolf55 @advogado_lucas @Davedaviddave12 @trailblazers Entertain yourself learning about Pascal and what he does for this team which OG is nowhere close to doing.\n\nhttps://t.co/F26Pywb7o2",
    "107": "@trailblazers So your not Intuit?",
    "108": "@isaackanye_DJT @trailblazers Damn. . . .I ain't shit",
    "109": "@Davedaviddave12 @advogado_lucas @trailblazers Barnes isn’t remotely a 3 and D rookie. First of all, he doesn’t shoot the three, so your analogy doesn’t even make sense. Secondly, you don’t seem to have a clue what my argument is, do you?",
    "110": "@vngSen @PhoenixGolf55 @advogado_lucas @Davedaviddave12 @trailblazers yeah for real, calling him \"mediocre\" after a slow start is more than a little ridiculous. but just because he's valuable doesn't mean it makes any sense at all for the Raps to carve out all of the talent on our team for the privilege of adding him",
    "111": "@Davedaviddave12 @jamal1122335 @PhoenixGolf55 @advogado_lucas @trailblazers You obviously have know fucking clue about the Raptors of you consider Pascal or Scottie 3 and D players my friend. You’re starting to sound like a bot",
    "112": "Thanks @trailblazers https://t.co/hZza56qOue",
    "113": "@Darth_Sweydr @trailblazers You could have told me something 29 mins ago 😢",
    "114": "@isaackanye_DJT @trailblazers I just got invited 30 mins ago and said yes.",
    "115": "@Davedaviddave12 @advogado_lucas @trailblazers Buddy what game are you watching. RAPS do not need guards. They have a team of guards that are 6'8\"",
    "116": "Wednesday Night NBA Free Play Portland Trail Blazers vs Phoenix Suns.  Check me out at:\nhttps://t.co/BsxPIWXKvw",
    "117": "@isaackanye_DJT @trailblazers Yessir",
    "118": "It's a new epsidoe of @trailblazers Courtside!\n\nHear from Norman Powell &amp; how he has managed to improve every year. Also, get to know new Assistant Coach, Edniesha Curry! Plus learn the finer details of the new “City” uniforms.\n\nTune in tonight at 5:00 PM PT on ROOT SPORTS 📺 https://t.co/idNcvGzRvo",
    "119": "@gotmeadadbod @timelord_ts @PackripMedia @nbatopshot @trailblazers @NBAHistory They're so similar!?!? Never quite appreciated that - almost the same spot on the floor and score... also, sorry, that is brutal!",
    "120": "@Darth_Sweydr @trailblazers Are you there tonight?",
    "121": "@Davedaviddave12 @ProlificRomo @CanadianFreak @advogado_lucas @trailblazers Your big acquisition this summer was Cody Zeller and Larry Nance JR. And your best prospect is Anfernee Simons who is another guard like Dame, CJ, and Norm. Portland needs to go full OKC, your roster is garbage.",
    "122": "@isaackanye_DJT @trailblazers . . . .or y'all could lose when I'm there. That would be cool",
    "123": "@trailblazers Please win I’m gonna be there",
    "124": "Con el Pick 5 Portland Trail Blazers selecciona a @JSblazers https://t.co/DJ0brOIGKf",
    "125": "@Davedaviddave12 @PhoenixGolf55 @MedosRunsitBack @advogado_lucas @trailblazers Your a Portland fan, am I correct? Let's just look at the guard position. Forget the sentimental shit, if you can trade Dame for Trae, lamelo, Shai or Morant you'd do it in a heartbeat.",
    "126": "@Davedaviddave12 @ProlificRomo @CanadianFreak @advogado_lucas @trailblazers All for Ariza lol",
    "127": "@Davedaviddave12 @ProlificRomo @CanadianFreak @advogado_lucas @trailblazers You guys traded what eventually became Isaiah Stewart to Houston, who flipped him for Christian Wood from Detroit.",
    "128": "@Davedaviddave12 @PhoenixGolf55 @MedosRunsitBack @advogado_lucas @trailblazers Bum, we can't call someone we're discussing, with generational wealth a bum. He literally a champion, had big games in the biggest moments. You tripping, People only hating on him because people thought he'd become a top 10 player after the chip.",
    "129": "@Davedaviddave12 @ProlificRomo @CanadianFreak @advogado_lucas @trailblazers That was last year being on the road the whole year and dealing with guys getting covid. And your team's problem is your entire cap is centered around 3 scoring guards. You have no room to get any wings or bigs. And you guys suck on draft night.",
    "130": "@trailblazers For us fans ..we have to acknowledge that is a fact. Go Simons👍",
    "131": "@Davedaviddave12 @advogado_lucas @trailblazers Thank you for showing you don’t know a whole lot about basketball. No need to continue this discussion.",
    "132": "The @Suns will face the @trailblazers tonight at 8 pm CT in Phoenix. (Sydney K) #gosuns #westsports",
    "133": "@Davedaviddave12 @xRALJR @ChasingMyCROWN_ @KaranT0078 @trailblazers Blazers didn’t even win a conference finals game and choked multiple double digit leads every game",
    "134": "@Davedaviddave12 @PhoenixGolf55 @advogado_lucas @trailblazers You are the one who is out to lunch. SF and wings are so much more valuable to winning championships than PG it’s not even close. Outside the Warriors in 2015 when was the last time a PG was the best player on a championship team? The bad boy pistons? Let’s get serious",
    "135": "With the way Dame is shooting this season - this would be an absolute steal for the @trailblazers organization! https://t.co/ChYmbLNJZH",
    "136": "@Alphabizzle @ProlificRomo @CanadianFreak @advogado_lucas @trailblazers Trent is a scrub, only would play mins on a team that wins 30% of their games like the raptors. 27-45 right?",
    "137": "@Davedaviddave12 @the_picketfence @advogado_lucas @trailblazers Barnes is the clear ROTY. You’re on drugs or delusional or both.",
    "138": "@Davedaviddave12 @advogado_lucas @trailblazers name a trio of young wings with more upside than OG, Scottie and Pascal, dime a dozen my ass foh, raptors are also making the playoffs",
    "139": "@Davedaviddave12 @ProlificRomo @CanadianFreak @advogado_lucas @trailblazers Trent's leading the league in def and stl. I love Powell but it's not even close this year. And if this team isn't making the playoffs why do you want our core for Dame? And why would the Raptors do the deal? We would only have FVV, Dame, fillers? lol",
    "140": "@trailblazers I know he won't unless he absolutely has to, but Dame should sit for a bit, get that abdomen right and let Ant cook meanwhile",
    "141": "@trailblazers Fix Dame jumpshot",
    "142": "@CanadianFreak @advogado_lucas @trailblazers Barnes ain’t going to be rookie of the year. His numbers are inflated cause of injuries. U must not understand usage and how it works. Like tonight jokic is out, so will Barton will go off, doesn’t mean Barton is an all star. It’s called usage. And SBs usage is about to plummet",
    "143": "Visiting the Valley 🏜️\n\n#RipCity https://t.co/7nPQWulEE9",
    "144": "@Davedaviddave12 @advogado_lucas @trailblazers This has nothing to do with who and who is not my favourite player. If you know ANYTHING about me it’s that I’m not sentimental.  The Raptors wouldn’t trade EITHER Barnes OR Anunoby for Dame, let alone both. Also, suggesting they need a PG shows 0 understanding of the team.",
    "145": "@trailblazers @npowell2404 @CarMax Sooooo Scott Foster ain't the prob?",
    "146": "@Davedaviddave12 @CanadianFreak @advogado_lucas @trailblazers Lmfao u really think Masai is moving Pascal. Yea u must be on fenty",
    "147": "@richierich_23 @Davedaviddave12 @advogado_lucas @trailblazers 😂😂😂😂 trainers",
    "148": "@Davedaviddave12 @CanadianFreak @advogado_lucas @trailblazers Tell me where the blazers rank defensively in the league…… yall sorry asf i feel bad for coach billups he got set up 🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣",
    "149": "@Davedaviddave12 @CanadianFreak @advogado_lucas @trailblazers Whats powell doing on defence? Is his play contributing to wins?You sound ridiculous. Lmao only good thing about the blazers is yall gonna have a real good chance at emoni Baites 22’ nba draft 🤣🤣🤣‼️lmao yall gonna be so ass just move to Seattle and start fresh as a franchise",
    "150": "@ProlificRomo @CanadianFreak @advogado_lucas @trailblazers Powell is banging 3s and putting dudes on posters on a nightly basis. He averages 3 more points and shoots 3 less shots than Trent a night. Trent would play like 15 mins a game if he was on the blazers.",
    "151": "@Rickonia Upper Darby High School, in a Philly suburb.\n\nLikely Tina Fey. Also have Jim Croce (musician) and Dr. Jack Ramsay (basketball coach, won NBA title with the Portland Trail Blazers.)",
    "152": "@YodaRaptor @MedosRunsitBack @advogado_lucas @Davedaviddave12 @trailblazers OG is becoming a much better go to guy than Siakam has ever shown. A lot of guys would look better than Siakam if they had a guy like Kawhi taking all the clutch shots &amp; the pressure off the team. Don’t let the championship blue your vision on who those players are",
    "153": "@Davedaviddave12 @CanadianFreak @advogado_lucas @trailblazers Ik its hard being a blazers fan, lillard is about to ask out 🤣🤣🤣🤣 Raptors are going to have homecourt in the playoffs you’ll see. Theres a reason why everyone wants our players.",
    "154": "@Davedaviddave12 @Dylanger8 @advogado_lucas @trailblazers Guess you haven't seen Trent play this year. That's understandable. You may not get Canadian TV over there in Oregon lol. Just checked the standings, those 20+ teams better than the Raptors. Portland is not one of them. But hey, best wishes. See you in the finals.",
    "155": "@PhoenixGolf55 @MedosRunsitBack @advogado_lucas @Davedaviddave12 @trailblazers All due respect, anyone that brings up the bubble to measure Pascal's performance has already lost their argument. \n\nI am not going there.",
    "156": "@Davedaviddave12 @CanadianFreak @advogado_lucas @trailblazers U must not watch basketball at all if you’re confidently saying this. Powell isnt better than trent. Norm is 6 years older than trent, trent is the starting sg how would injuries effect his defensive stats?",
    "157": "@MedosRunsitBack @PhoenixGolf55 @advogado_lucas @Davedaviddave12 @trailblazers Sure. I would love for both of them to be, after all I am a Raptor fan but it is obvious they are not. \n\nOG is not an All STAR, OG wasn't second option when we won the championship and OG was nowhere near Pascal last year. \n\nHe will get there, but right now he is not.",
    "158": "If y’all don’t win tonight with me sitting in the nosebleeds I’ll never forgive y’all @trailblazers",
    "159": "@advogado_lucas @Davedaviddave12 @trailblazers That Oregon weed really slaps huh? Cuz you're definitely high with this shit. Hilarious 🤣",
    "160": "@advogado_lucas @Davedaviddave12 @trailblazers Keep our team’s name out of your mouths. We have probably the smartest front office in the league and you guys still involve us in ridiculous trade ideas. We don’t want Simmons or Dame. You didn’t learn anything from Powell for GTJ? https://t.co/kRTX74oxa8",
    "161": "@Scotland9991 @Dylanger8 @advogado_lucas @trailblazers After 11 games he leads the league in steals, wow! U act like he’s a favorite for defensive player of the year. Trent is ok, but to say he’s better than Powell in anyway is dumb. Powell is way more athletic and efficient. Time will tell.",
    "162": "Portland Trail Blazers x Phoenix Suns\nNBA LEAGUE PASS\n00:00 – Minnesota Timberwolves x GS Warriors\nNBA LEAGUE PASS \nMiami Heat x Los Angeles Lakers\nESPN, WATCH ESPN, STAR+ e NBA LEAGUE PASS\n\n00:00 – 🏒NHL\nMinnesota Wild x Arizona Coyotes\nSTAR+",
    "163": "@khloe $STMX @stormxio Crypto partner of the @trailblazers. Stackable crypto cashback on purchases, debit card coming to US where you can add money to your card at Walgreens, 7 elevens to spend anywhere for crypto back on purchases. Solid team focused on utility. Institutional investors",
    "164": "@advogado_lucas @Davedaviddave12 @trailblazers Why not ask for KD, Harden, LeBron...?\n\nI mean, that's just as unlikely to happen as what you proposed, but as long as you're wishing, wish big.",
    "165": "#PDX #Portland!\nMeet the newest #TrailBlazer Neil Everett from @espn and check out all the cool #Blazer lingo I taught him, HERE: https://t.co/lVEfpY3PCF\n\n@trailblazers @blazersedge @BlazerFansLA @TRILLBLAZIN @trueblazerfan https://t.co/WvBmmTXDhu",
    "166": "@Scotland9991 @Dylanger8 @advogado_lucas @trailblazers Wrong lol, the reason blazers even made the trade was for defense. I’m starting to realize the only televised games in Canada are raptors games, there are 20+ nba teams just as good or better than the raptors, it’s like they don’t realize that.",
    "167": "@Dylanger8 @Davedaviddave12 @advogado_lucas @trailblazers As it turned out, they both signed contracts for the same value $18m. Powell is better offensively, Trent is better defensively. I love Powell but Trent is only 22 and he is leading the league in steals.",
    "168": "@ArnavjFvv @advogado_lucas @trailblazers To get rid of one of the worst contracts, siakim, in the NBA. I can tell a lot of raptor fans don’t understand the logistics of nba rosters. The blazers will get a lot more than OG or Barnes for dame. They already turned down better.",
    "169": "@Davedaviddave12 @PhoenixGolf55 @MedosRunsitBack @advogado_lucas @trailblazers Awful contract? 22 7 and 5 was considered a bad season for Siakam. He's a proven secondary star on a championship team. He a two way star, if it weren't for the redundancy between him and Barnes, I wouldn't consider the trade. Good guards are plentiful.",
    "170": "@xRALJR @ChasingMyCROWN_ @KaranT0078 @trailblazers Lol, I know u want to talk about the clippers all day, but they aren’t ever getting to a finals. How they made it to the conference finals was a joke, jazz just played bad. The blazers made it that far as well in the past 5 years.",
    "171": "Eastside Distilling Signs Three-Year Sponsorship Deal with the Portland Trail Blazers at the Moda Center\nhttps://t.co/rJddj9PO8K\n #industrynews #sports #News #IndustryNews #LatestNews #LatestIndustryNews #PRNews https://t.co/ZrXTnNrX2L",
    "172": "@Davedaviddave12 @Scotland9991 @advogado_lucas @trailblazers getting a good piece back wasnt the point of trading him. We had to clear him for contact soace because he was gonna ask for a lot. Gary trent turned out to be better than expected so it paid off.",
    "173": "@ProlificRomo @CanadianFreak @advogado_lucas @trailblazers Powell is way better than Trent. Trents numbers up just cause of injuries. Raptors haven’t really played many good teams yet this year, and still overachieving at 6-5. Sorry, they aren’t getting in the playoffs with that roster.",
    "174": "@Davedaviddave12 @ChasingMyCROWN_ @KaranT0078 @trailblazers If that's your argument for him being washed you need to just give up 😂",
    "175": "@Davedaviddave12 @advogado_lucas @trailblazers Exactly bro! 😂 OG nice but he’s a role player not a star and the rookie is still unproven they acting like they got two top 10 players on their team 🤦‍♂️",
    "176": "@timelord_ts @nbatopshot @trailblazers @NBAHistory ❤️ B Roy! UW Huskies!",
    "177": "@Scotland9991 @advogado_lucas @Davedaviddave12 @trailblazers amen",
    "178": "@Davedaviddave12 @WColumbus60 @advogado_lucas @trailblazers so you want to get OG by your Damian?",
    "179": "@whytefolks1 @advogado_lucas @trailblazers @whytefolks1 holy sh*t!!! I see what u mean. Reading all these comment about how “great” Barnes and OG is lmao. It’s like they never have seen a nba game outside of Toronto and they have the only 3 and d guys in the nba. I was being hypothetical.",
    "180": "@advogado_lucas @Davedaviddave12 @trailblazers ??????????????????????????? LMAOOOOOOOOOOOOO",
    "181": "@trailblazers I forgot to tag u'in",
    "182": "@kokisuren @advogado_lucas @trailblazers They would in a heartbeat. 6’ 9” sf are a dime a dozen in the nba. There’s a reason the raptors suck this year.",
    "183": "@WColumbus60 @advogado_lucas @trailblazers Cause they need guards. Why u think they drafted Barnes? So they can sit siakim on the bench? No, so they can trade him or OG",
    "184": "@moelaarag0 @NBA @trailblazers @TonySnell21_ A business move obviously for wilson",
    "185": "@advogado_lucas @Davedaviddave12 @trailblazers i finally understand being ratiod.   thank you",
    "186": "@advogado_lucas @Davedaviddave12 @trailblazers 😂 why you gassing the raptors for? Now you got their fans thinking they got Kawhi, Lebron on their team! 😝 Dame will snap back from his slump bro just give it time season is very young still.",
    "187": "The @trailblazers travel to the desert! 🌵\n\nTune in tonight at 5:30 PM PT as the Portland Trail Blazers take on the Phoenix Suns on ROOT SPORTS #RipCity https://t.co/60cb1sHuBh",
    "188": "@advogado_lucas @Davedaviddave12 @trailblazers What kind of dirt do you have on Masai to make this happen?!?!? https://t.co/tvaIJ8furL",
    "189": "@MedosRunsitBack @PhoenixGolf55 @advogado_lucas @Davedaviddave12 @trailblazers If a trade like that gets through, you figure out how to get Myles Turner out of Indiana and you got a solid 5. Barnes would be the only Subpar 3 point shooter.",
    "190": "@Davedaviddave12 @ChasingMyCROWN_ @KaranT0078 @trailblazers lol ok https://t.co/5WxrVRfM1l",
    "191": "Ok, this pisses me off more regarding the suspension \"Jokic's suspension will also end his streak of consecutive regular-season games played at 157. The last time he didn't play was on April 7, 2019, against the Portland Trail Blazers.\"#MileHighBasketball https://t.co/DH190K6DVI",
    "192": "@jamal1122335 @PhoenixGolf55 @advogado_lucas @Davedaviddave12 @trailblazers I could see this possibly",
    "193": "@SalvadorCabezn2 @raptorstings @advogado_lucas @Davedaviddave12 @trailblazers Thank god that's settled.",
    "194": "@Dylanger8 @advogado_lucas @Davedaviddave12 @trailblazers Ad thank you for Trent Jr.  He is working out just fine.",
    "195": "@CanadianFreak @Davedaviddave12 @advogado_lucas @trailblazers You took the words out my mouth “ are you delusional “ im reading these tweets like make this make sense. We stole gary trent from yall last szn and yall think we owe u sb4 pascal or og 🤣🤣🤣 u got norm like yall wanted. Dont cry and say u wanna trade with Toronto again🤣🤣",
    "196": "@BALLYSPORTSAZ @Suns @trailblazers Are you a cable channel",
    "197": "@PhoenixGolf55 @MedosRunsitBack @advogado_lucas @Davedaviddave12 @trailblazers I could see Siakam and Fred for Dame, Nassir Little and maybe simons",
    "198": "@johncanzanobft If the @trailblazers keep Olshey they will lose fans, me included. I have lost interest over the last 9 years mainly due to Olshey and his BS.",
    "199": "@Davedaviddave12 @xRALJR @ChasingMyCROWN_ @KaranT0078 @trailblazers This was the worst argument I’ve ever read, Dave, educate yourself",
    "200": "@blazer_beavis @NBA @trailblazers @TonySnell21_ Fr like what was even the point in changing the ball?",
    "201": "Native American Heritage Month x #WallpaperWednesday https://t.co/ZMwkan4JZy",
    "202": "@WumpySpeaks @advogado_lucas @Davedaviddave12 @trailblazers Lol my bad",
    "203": "@Davedaviddave12 @advogado_lucas @trailblazers Oh dear.... smh...\n\nfor who?!??!?!",
    "204": "@FedExBlows @Samsinfire @trailblazers L reply",
    "205": "@advogado_lucas @Davedaviddave12 @trailblazers Good luck with that.  Signed, Toronto",
    "206": "No Bron on Saturday but seeing Westbrick shoot 1-13 was well worth the time spent. @ Portland Trail Blazers https://t.co/glSMfD0Ynu",
    "207": "School &amp; Family Nights with the Portland Trail Blazers! https://t.co/fF1vu2tnON",
    "208": "We lit tonight in PHX @Dame_Lillard @trailblazers !",
    "209": "🏀 #NBA\n\nPortland Trail Blazers 🆚 Phoenix Suns\n📆 Jue 11 nov 03:10\n\n#Raspibets #FreePicks #FreeTips #StatBets #SportsBetting #BettingTipster #RipCity #WeAreTheValley\n🆓🔎📈⬇ https://t.co/3GxZilAD2t",
    "210": "@SDQFlightCrew Portland Trail Blazers 1999 ... if they won I wouldn't have to see Pipen selling himself out like a streetwalker. His legacy would have been different and I had a soft spot for my dude Steve Smith. https://t.co/W4YTanduVM",
    "211": "@trailblazers @Nike Fund girls sports the same way we do boys sports. My HS dance team was designated an \"activity\" instead of a sport so that the school wouldn't have to fund it. We had to practice at the middle school and pay for competitions ourselves which made it prohibitive for many.",
    "212": "@advogado_lucas @Davedaviddave12 @trailblazers Why would we give up Barnes, Anunoby and Siakam? One…MAYBE. \n\nYou get Dragic/Boucher and shit load of picks from us. Take it or leave it. :P",
    "213": "Tonight's predictions (2/2)\n\n@SacramentoKings beat @spurs \n@nuggets beat @Pacers \n@Suns beat @trailblazers \n@warriors beat @Timberwolves \n@MiamiHEAT beat @Lakers \n\nWhat do yall think? Am I going 13/13? Who are you predicting? \n\n#NBA #NBA75 #NBATwitter #NBAonTNT \n@NBARealTalk75 https://t.co/TxxkhekW3J",
    "214": "@advogado_lucas @Davedaviddave12 @trailblazers 😂😂 if only you knew the slander coming your way",
    "215": "@MedosRunsitBack @PhoenixGolf55 @advogado_lucas @Davedaviddave12 @trailblazers Pascal just came back. What are you comparing?\n\nNo sense having this chat, we can revisit in a couple of months or at the end of the season. \n\nThere isn't a single person that knows basketball that thinks OG is ahead of Pascal, Pascal does everything for this team technically",
    "216": "@advogado_lucas @Davedaviddave12 @trailblazers I see a few of these takes and they piss me the hell off because you’re being serious.\n\nNo way in hell.",
    "217": "@Aun_Drea @advogado_lucas @Davedaviddave12 @trailblazers This is the response. 🇨🇦🇨🇦🇨🇦🔥🔥🔥",
    "218": "@NBA @TonySnell21_ @trailblazers What the hell? Is he actually still injured? I haven't seen him play once as a Blazer?",
    "219": "Who remembers the last time these two teams met in Phoenix?\n\n🏀 @Suns vs @trailblazers \n⏰ 6:30PM pregame\n📺 Bally Sports Arizona https://t.co/YKwN4EgOhf",
    "220": "@raptorstings @advogado_lucas @Davedaviddave12 @trailblazers Done",
    "221": "@NBA @TonySnell21_ @trailblazers Happy birthday 🐌",
    "222": "@MedosRunsitBack @PhoenixGolf55 @advogado_lucas @Davedaviddave12 @trailblazers We don't know what it will happen in the future we know now and now Pascal is better. \n\nLove OG, he is not better or close to Pascal.",
    "223": "@advogado_lucas @Davedaviddave12 @trailblazers 1 All-Star\n2 future All-Stars\nAll in their primes\n\nFor washed up Dame?",
    "224": "@advogado_lucas @Davedaviddave12 @trailblazers oh would you? that's nice.",
    "225": "@WumpySpeaks @advogado_lucas @Davedaviddave12 @trailblazers In no world the raps are trading there best player and potential future best player for any of the scrubs on Portland. Go take a nap",
    "226": "@timelord_ts @nbatopshot @trailblazers @NBAHistory man, B Roy was special..",
    "227": "@YodaRaptor @PhoenixGolf55 @advogado_lucas @Davedaviddave12 @trailblazers Currently sure. Barely better than OG rn though and OG is going to be better. Scottie is a rookie… and hes going to be better than either of them. Already is in some ways.",
    "228": "@advogado_lucas @Davedaviddave12 @trailblazers i thinks its funny you would even imagine this. you got norman thats all you get 🥱",
    "229": "@Davedaviddave12 @advogado_lucas @trailblazers 🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣..deep breath..🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣",
    "230": "@IanRGillespie @advogado_lucas @Davedaviddave12 @trailblazers Oh this doesn't get done from the Portland side ? https://t.co/2P8C921uBf",
    "231": "@UTDFuckingSuck @advogado_lucas @Davedaviddave12 @trailblazers Giving up Siakam right now even seems unlikely. The potential our starting line up has with Fred GTJ OG Scottie and Siakam is too mouth watering to fuck with right now. The defense is no joke.",
    "232": "@dougiejays @advogado_lucas @Davedaviddave12 @trailblazers Seems like it 😂😂😂😂😂😂😂😂😂",
    "233": "@azeofloat @timelord_ts @nbatopshot @trailblazers @NBAHistory I’m DM you 👍",
    "234": "@advogado_lucas @Davedaviddave12 @trailblazers And who are you trading to get 3 of toronto's 4 best players?",
    "235": "@PhoenixGolf55 @advogado_lucas @Davedaviddave12 @trailblazers I wouldn't say mediocre 😂😂😂 But hes definitely less effective. Give him time to find a rythm. But as a Raptors fan, all these trades are just stupid 😂😂😂",
    "236": "@Davedaviddave12 @advogado_lucas @trailblazers What you smoking sir? Just become raps fan and done. Or dame for Malachi Flynn and 1 week trial with our trainers.🤣🤣🙏🏿🙏🏿",
    "237": "@NBA @TonySnell21_ @trailblazers The obscure stat goat",
    "238": "NBA ML. Date: 11-10\nPortland Trail Blazers vs Phoenix Suns. 0.34%\nFanDuel. Blazers @ +198\nKambi. Suns @ -195\n#arbitrage #bettingtwitter #bettingpicks #sportsbets #freepicks #freemoney #mlb",
    "239": "@advogado_lucas @Davedaviddave12 @trailblazers I’m sure you WOULD like to see those guys in Toronto. And Toronto wants to keep them in Toronto. \n\nAlso, Cleveland wants to keep Evan Mobley, Jarret Allen and Darius Galand and Atlanta wants to keep Trae Young, John Collins and Clint Capella. Stop asking for dumb trades.",
    "240": "@advogado_lucas @Davedaviddave12 @trailblazers Just cheer for the #Raptors https://t.co/sJHYQfDqUv",
    "241": "Portland Trail Blazers vs. Phoenix Suns Preview: Photo by Cameron Browne/NBAE via Getty Images Will the Blazers continue to struggle on the road? Portland Trail Blazers (5-6) vs. Phoenix Suns (6-3) The Portland Trail Blazers move on to face the… https://t.co/QZbDmQJ6Z9 #RipCity https://t.co/bTVU2P1xLt",
    "242": "@jeffmac23 @advogado_lucas @Davedaviddave12 @trailblazers Lol and to think on he’s gonna give up Scottie the absolute steal of the draft? Too funny",
    "243": "@NBA @trailblazers @TonySnell21_ That Wilson logo looks so bad on an nba ball",
    "244": "@theterpyone @ryansnuggs @LAClippers @trailblazers @BoredApeYC Amazing",
    "245": "@Raptorswave @advogado_lucas @Davedaviddave12 @trailblazers Uh...no",
    "246": "@advogado_lucas @Davedaviddave12 @trailblazers Why would the Raptors even do a trade?",
    "247": "@jamesdillonbond @timelord_ts @nbatopshot @trailblazers @NBAHistory Where does one find this Rip City Server?",
    "248": "@Davedaviddave12 @advogado_lucas @trailblazers Are Portland fans down this bad? No hate, just asking. If it's time to rebuild then trade everyone. CJ, DAME, NURK everyone. Run it back next year with the young guys and draft picks",
    "249": "@advogado_lucas @Davedaviddave12 @trailblazers lol this is a ridiculous trade offer, no way toronto gives up either one of barnes or og for dame, siakam, picks and roster pieces would be the most",
    "250": "Join us as our @Suns take on the Portland Trail Blazers for Military Appreciation Night!\n\n🤝 @USAA \n\n⌚️7PM\n📺 @BALLYSPORTSAZ \n📻@AZSports | @az_mejor \n🎟 link: https://t.co/VFW3zuU6Sk https://t.co/0pMGdfRUMS",
    "251": "Tonight! 15 minutes after the end of @trailblazers  at @Suns, join us for another edition of the post game show. https://t.co/YruhW0wd0H",
    "252": "@fullmuntion @DAZN_ES I love Satou Sabally, she played in my Oregon Ducks, like @maitecazorla5 &amp; @ainaayus  At child I was supporter of the Portland Trail Blazers, but we need in the ripcity a team in wnba https://t.co/bnOh4NYFSE",
    "253": "@trailblazers @Suns @FootprintCNTR @ROOTSPORTS_NW @RipCityRadio620 Another back to back!? How many do we have this year",
    "254": "@Davedaviddave12 @advogado_lucas @trailblazers Lmfao yeah we are just going to give a ROTY candidate for Slumping CJ and Dame . Only in your dreams .",
    "255": "Portland Trail Blazers vs Phoenix Suns Predictions &amp; Odds\n\nhttps://t.co/wvt7y5weRy\n#NBA #bettingtips #bettingtwitter https://t.co/pdMwvHRV77",
    "256": "@trailblazers @Suns @FootprintCNTR @ROOTSPORTS_NW @RipCityRadio620 Highest scoring team takes the floor 👀",
    "257": "Nov 10, 1987 - The @trailblazers signed former Blazer Maurice Lucas today.  His number 20 was retired by the Blazers on Nov. 4, 1988, while he was an assist. coach with the team.\n\n#Blazers #RipCity #thisdateBlazersHistory https://t.co/CnbPMwj0Kr",
    "258": "@Suns @USAA @trailblazers @BALLYSPORTSAZ @FootprintCNTR @AZSports @az_mejor They beat us by 29 points the last game. We have to win this one",
    "259": "@trailblazers @Suns @FootprintCNTR @ROOTSPORTS_NW @RipCityRadio620 Ant will be  most improved player this season.",
    "260": "@advogado_lucas @Davedaviddave12 @trailblazers Are you High?",
    "261": "@trailblazers @Suns @FootprintCNTR @ROOTSPORTS_NW @RipCityRadio620 First road victory tonight",
    "262": "@advogado_lucas @Davedaviddave12 @trailblazers Bruh. It’d be easier if you just became a Raptor’s fan…cause that’s the only way you’re going to get to cheer for our starters on your team.",
    "263": "@NBA @trailblazers @TonySnell21_ The blazers are really good at throwing money away",
    "264": "@trailblazers @CHold @Suns @FootprintCNTR @ROOTSPORTS_NW @RipCityRadio620 Root sucks",
    "265": "@advogado_lucas @Davedaviddave12 @trailblazers Oh god…maybe if u ask nicely u can have gtj back too🤡🤡🤡",
    "266": "@advogado_lucas @Davedaviddave12 @trailblazers Keep dreaming! 🛌",
    "267": "@trailblazers @Suns @FootprintCNTR @ROOTSPORTS_NW @RipCityRadio620 Please win",
    "268": "@trailblazers @Suns @FootprintCNTR @ROOTSPORTS_NW @RipCityRadio620 Lets not troll today shall we",
    "269": "@trailblazers @Suns @FootprintCNTR @ROOTSPORTS_NW @RipCityRadio620 @trailblazers  if dame scores 30 tonight,  you have to fb. Bet?",
    "270": "@trailblazers @Suns @FootprintCNTR @ROOTSPORTS_NW @RipCityRadio620 My god another road game maybe this can be a W?",
    "271": "@trailblazers @Suns @FootprintCNTR @ROOTSPORTS_NW @RipCityRadio620 Let's have a good win Portland. #ripcity 🖤❤🏀",
    "272": "@trailblazers @Suns @FootprintCNTR @ROOTSPORTS_NW @RipCityRadio620 lets get this win wdmin 😴",
    "273": "@trailblazers @Suns @FootprintCNTR @ROOTSPORTS_NW @RipCityRadio620 Let’s bounce back",
    "274": "@NBA @trailblazers @TonySnell21_ Happy Birthday!",
    "275": "@NBA @trailblazers @TonySnell21_ Happy birthday Mr Snell",
    "276": "@trailblazers @Suns @FootprintCNTR @ROOTSPORTS_NW @RipCityRadio620 Win please?",
    "277": "@trailblazers @Suns @FootprintCNTR @ROOTSPORTS_NW @RipCityRadio620 This will be the game! We’re getting a W!",
    "278": "Game day in PHX. \n\n🏀 #RipCity  vs @Suns \n🏟 @FootprintCNTR \n🕰 6pm\n📺 @ROOTSPORTS_NW \n📻 @RipCityRadio620 https://t.co/tAwX1XG7aN",
    "279": "Portland  trail blazers  not playing  like playoff  team , up and down",
    "280": "@trailblazers Happy birthday wish you wishes🎂🥳",
    "281": "@RealSlimBrady13 @advogado_lucas @Davedaviddave12 @trailblazers No one would be stupid enough to trade OG or Scottie for a 1 dimensional player like Dame (he plays no defense) plus not being able to get 7-10 free throws in today’s game makes him less valuable",
    "282": "@advogado_lucas @Davedaviddave12 @trailblazers Portland can rebuild their team with some other players. Toronto is fine right now, thanks!",
    "283": "@MedosRunsitBack @advogado_lucas @Davedaviddave12 @trailblazers I could see them giving up Siakam but no one is their right mind would trade away OG or Scottie for a one dimensional player such as Dame (he plays no defense). Today’s game where is not getting 7-10 free throws makes him even less valuable",
    "284": "@advogado_lucas @Davedaviddave12 @trailblazers You're definitely on drugs",
    "285": "@timelord_ts @nbatopshot @trailblazers @NBAHistory If only moments came with sound! I love your work but it reminds me of what we’re currently missing with no audio. It feels so much more impactful with great announcing, crowd noise and the buzzer! Even squeaks of the shoes on the court add depth and place you back in the moment",
    "286": "@Davedaviddave12 @advogado_lucas @trailblazers Dame plays no defense so only a loosing team looking for a big name player would want him",
    "287": "@advogado_lucas @Davedaviddave12 @trailblazers There is absolutely no way the Taptors would give up Scottie &amp; OG because of their defense. Dame plays zero defense &amp; the way the game is called today makes him mediocre on offense since he not getting 7-10 free throws a game. Dame is all offense &amp; no defense",
    "288": "@timelord_ts @nbatopshot @trailblazers @NBAHistory What’s crazy is that if this shot happened in a @trailblazers game now, it might’ve possibly NOT COUNTED…? The Ref could’ve called the new Offensive Foul &amp; said Roy’s leg going forward was an “unnatural movement”. smh @Dame_Lillard @frdchikin @PackripEwing",
    "289": "@timelord_ts @nbatopshot @trailblazers @NBAHistory Amazing edit as always TL! Loved me some Brandon Roy. Will always remember him scoring 18pts in the 4th quarter against the 2011 Mavs in the playoffs. Srsly one of the best individual playoff performances I've seen https://t.co/kMz17zzZTU",
    "290": "@trailblazers Bizzy Banks - Outro",
    "291": "@Great_BallShow @advogado_lucas @Davedaviddave12 @trailblazers Not getting Siakim, better look at Precious, Slim Duck, and Dragic https://t.co/TowSdixguj",
    "292": "@Suns @USAA @trailblazers @BALLYSPORTSAZ @FootprintCNTR @AZSports @az_mejor Booker going insane today",
    "293": "Encerrado:\n\nLos Angeles Clippers (6-4) 117 x 109 (5-6) Portland Trail Blazers\n\nLAC 📊\nPaul George: 24PTS/9REB/7AST/1STL\nReggie Jackson: 23PTS/2REB/6AST/1STL\n\nPOR 📊\nDamian Lillard: 27PTS/5REB/6AST\nNorman Powell: 23PTS/3REB/3AST/1STL\n\n#NBA https://t.co/UfXXHR0tCm",
    "294": "Get tips from @trailblazers @CJMcCollum and his mom, Kathy, on what you can do to reduce your risk of diabetes. https://t.co/GFTbXE4UtK",
    "295": "@timelord_ts @PackripMedia @nbatopshot @trailblazers @NBAHistory As a rockets fan, to have 2 of the best game winners against my team hurts my soul. This and the lillard one ( I was in the building for) were just crushers",
    "296": "@advogado_lucas @Davedaviddave12 @trailblazers Steep asking price, not likely 😂",
    "297": "@jamesdillonbond @timelord_ts @nbatopshot @trailblazers @NBAHistory This is for sure an \"I remember where I was when this happened moment\". I was at the Spirit Mountain poker room.",
    "298": "@advogado_lucas @Davedaviddave12 @trailblazers You mustn’t know to much about the Raptors if you think there is any chance in hell they give up either of those three for Dame let alone all three. It’s not happening ever.",
    "299": "@timelord_ts @nbatopshot @trailblazers @NBAHistory Brandon Roy 3 pointer or Steve Blake Assist???",
    "300": "@trailblazers 30?? Wtf I thought he was 25",
    "301": "@NBA @TonySnell21_ @trailblazers Happy birthday 🎊",
    "302": "@advogado_lucas @Davedaviddave12 @trailblazers are you dumb?\nToronto is trading any of those players to Portland let alone all of them....",
    "303": "@timelord_ts @nbatopshot @trailblazers @NBAHistory Def shared this on Rip City Fans server.  I’ll always remember watching this in my dorm room my freshman year!  Rip City!!!",
    "304": "@advogado_lucas @Davedaviddave12 @trailblazers Is this meant to be serious? Masai doesn’t get fleeced, he DOES the fleecing. 🤣🏀",
    "305": "@Suns @USAA @trailblazers @BALLYSPORTSAZ @FootprintCNTR @AZSports @az_mejor Happy Birthday Marines! https://t.co/9gbHA90blM",
    "306": "@timelord_ts @nbatopshot @trailblazers @NBAHistory This is one of mine for sure",
    "307": "@xuaco_ @trailblazers This is a clear case of racism.",
    "308": "🎂 Tony Snell - Portland Trail Blazers has a birthday today",
    "309": "@NBA @TonySnell21_ @trailblazers Happy birthday!",
    "310": "@Suns @USAA @trailblazers @BALLYSPORTSAZ @FootprintCNTR @AZSports @az_mejor Let’s keep going y’all and get this W 🙏🏻",
    "311": "I don´t get why the @trailblazers CM doesn´t want to follow me... its maybe because im black???",
    "312": "@timelord_ts @nbatopshot @trailblazers @NBAHistory Mine would 100% be Iverson stepping over Ty Lue https://t.co/S1fMKOLMIp",
    "313": "@advogado_lucas @Davedaviddave12 @trailblazers lmao good luck with that one",
    "314": "@advogado_lucas @Davedaviddave12 @trailblazers why would raptors, in any world, or in any universe give you either barnes or anunoby.",
    "315": "@timelord_ts @nbatopshot @trailblazers @NBAHistory Brandon Roy was special!",
    "316": "@PopWonderNFT @RangerDave10 @trailblazers s'niiice! props",
    "317": "Join us for @USAA Military Appreciation night!\n\n🆚 @trailblazers \n🕖 7PM \n📺 @BALLYSPORTSAZ \n📍 @FootprintCNTR \n📻 @AZSports | @az_mejor \n🎟 https://t.co/Y8jIRtxtR5 https://t.co/y8eJZni5Hr",
    "318": "We recently celebrated the 13-year anniversary of Brandon Roy’s 0.8 seconds on the clock legendary game-winning three vs the Rockets. Here is my @nbatopshot-inspired Dream Moment. All I have to say is... YES HE DID! @trailblazers @NBAHistory #NBAVault  #NBA75 https://t.co/7h6lW1I55N",
    "319": "Oklahoma City Thunder vs New Orleans Pelicans\nDallas Mavericks vs Chicago Bulls\nCharlotte Hornets vs Memphis Grizzlies\nSacramento Kings vs San Antonio Spurs\nIndiana Pacers vs Denver Nuggets\nPortland Trail Blazers vs Phoenix Suns\nMiami Heat vs Los Angeles Lakers\nGrizzlies vs GSW",
    "320": "In reviewing Dwight Howard's career, I was reminded of an underrated playoff series:\n\nThe Portland Trail Blazers vs Houston Rockets in 2014.\n\nLast hurrah for the old-look Blazers (Dame, Wes, Batum, LMA, RoLo), last peak season for Dwight, four games decided by &lt;= 5 points.",
    "321": "@advogado_lucas @Davedaviddave12 @trailblazers You don’t have any assets. You’d have to trade dame",
    "322": "@trailblazers Trade cj and powell at sg",
    "323": "@trailblazers Happy Birthday Tony!🥳🥳",
    "324": "@advogado_lucas @trailblazers 5 rebs and 6 asists though",
    "325": "@advogado_lucas @Davedaviddave12 @trailblazers Siakam for Dame swap straight up",
    "326": "Portland distillery reaches 3-year deal with Trail Blazers #sponsorship https://t.co/yvNDMvXvV0",
    "327": "@trailblazers back to back Blazers Legends Birthdays",
    "328": "@dpshow as a suffering @trailblazers fan, @ScottiePippen should be asked more about his career outside of Chicago. How did those years in Houston and Portland go without Jordan?",
    "329": "@NBA @TonySnell21_ @trailblazers Blazers legend",
    "330": "@NBA @TonySnell21_ @trailblazers They grow up so fast.",
    "331": "@SnellSeason @trailblazers He deserves a shot at that!",
    "332": "Consensus Line Move:\n2021-11-10 Portland Trail Blazers at Phoenix Suns from 223.00 to 225.00\nOver squares...?\n#NBA #bettingsports #computerscience #businessowner",
    "333": "@trailblazers Future 3 point contest participant and winner tony snell",
    "334": "@SunsFansUK @trailblazers @Suns Lets win guys! I will watch live as always @ 3 am with a cup of coffee :) \n\nEven without DA i hope we will win 6 in a row. We need ne regular season Tank again!💜🧡🤓",
    "335": "@Davedaviddave12 @trailblazers I didn’t say 3 months bud",
    "336": "@advogado_lucas @Davedaviddave12 @trailblazers Lol for players who haven’t won a championship? Do they know what it feels like to even play in the conference finals?!? Nope. I’m good. Chris Boucher, Dragic and a couple picks maybe for CJ/Dame. If not, keep dreaming.",
    "337": "@advogado_lucas @Davedaviddave12 @trailblazers Do you also want KD and Harden for Norm?",
    "338": "As long as the @Suns do these three things, they'll be able to take revenge on the Portland Trail Blazers tonight. https://t.co/9UxoMmK9nH",
    "339": "@nurknturk @trailblazers If y’all get Simmons for him and move Norman to the 2 y’all going make some noise",
    "340": "@sfrankowski18 @NBA @TonySnell21_ @trailblazers Absolutely not",
    "341": "@advogado_lucas @Davedaviddave12 @trailblazers Haha",
    "342": "@advogado_lucas @Davedaviddave12 @trailblazers On drugs.",
    "343": "@NBA @TonySnell21_ @trailblazers Have a Happy Birthday Tony.",
    "344": "WATCH: Los Angeles Clippers fend off Portland Trail Blazers for 5th straight win https://t.co/4X5H9AVfDB",
    "345": "WATCH: Los Angeles Clippers fend off Portland Trail Blazers for 5th straight win https://t.co/K5TiGd9dEn",
    "346": "@Davedaviddave12 @advogado_lucas @trailblazers lmao why would they trade Siakam AND Barnes for anyone on the Blazers?",
    "347": "@CamPaynCampaign @trailblazers No I want valley dark time 😩",
    "348": "@Will_l_Was @trailblazers A lot better than Olsh*y",
    "349": "🏀NBA🏀\n\n15* Toronto Raptors +2\n15* Detroit Pistons +4\n15* Charlotte Hornets +5 (-120)\n15* Portland Trail Blazers +5\n15* Minnesota Timberwolves +7\n15* Los Angeles Lakers +5",
    "350": "@NBA @TonySnell21_ @trailblazers Happy BD 🎂",
    "351": "@Davedaviddave12 @ChasingMyCROWN_ @KaranT0078 @trailblazers I guess this is considered choking when your co-star is consistently getting outscored by CJ McCollum weirdo 😂 https://t.co/aR50CMspyZ",
    "352": "WATCH: Los Angeles Clippers fend off Portland Trail Blazers for 5th straight win https://t.co/XqQrAeefJY #GameScores #NBA #LosAngelesClippers",
    "353": "Consensus Line Move:\n2021-11-10 Portland Trail Blazers at Phoenix Suns from 221.00 to 223.00\nOver squares...?\n#NBA #bettingtips #datascience #sharemarket",
    "354": "@Dakodas_Dad @Suns @trailblazers Six in a row let’s go!",
    "355": "Portland Trail Blazers vs. Phoenix Suns - 11/10/2021 Free Pick &amp; NBA Betting Prediction https://t.co/4V3hXG2EYR #FreePicks ... https://t.co/4jzBpkAXmY",
    "356": "Portland Trail Blazers vs. Phoenix Suns odds, picks, predictions: Who wins NBA game? https://t.co/zSFv2TR9H7",
    "357": "Huge THANK YOU to @ryansnuggs for the tickets to the @LAClippers vs @trailblazers game last night! \n\n@BoredApeYC was in the building for the home team win!! #BAYC #ApeStrong https://t.co/BNZ30XJIoG",
    "358": "Portland Trailblazers really are content with being a play off team \n@trailblazers you should of been got Dame another star over there,\nMcCollum really should be the 3rd best option on your team if yall want to win a chip, get dame a star",
    "359": "Portland Trail Blazers vs. Phoenix Suns odds, picks, predictions: Who wins NBA game? https://t.co/QZU93JK3WI",
    "360": "@CityMadeGoat @trailblazers @npowell2404 @CarMax You’re waffling",
    "361": "#PaulGeorge scored 24 points, #NicolasBatum added a season-high 22 points, #ReggieJackson added 23 and the Los Angeles #Clippers extended their winning streak to five Tuesday night, beating the Portland Trail #Blazers 117-109.  🏀 #NBATwitter  https://t.co/uhR1aFz6X5",
    "362": "@trailblazers Great team loss guys 👏👏👏",
    "363": "@CPFCChris19 @trailblazers @npowell2404 @CarMax Not the whole game but the ending",
    "364": "@KillingRoofed @McDonalds @trailblazers @BurgerKing If I block you I win",
    "365": "Game Day baby💜🧡💜🧡 @Suns vs @trailblazers #ValleyProud #BadNews #DakodaKnows #NBA75 https://t.co/EBySv9diDL",
    "366": "@SIRIUSXM @ScottiePippen @SiriusXMNBA If Scottie want to be equal to MJ, why wasn't he heard of when he played for the Houston Rockets and the Portland Trail Blazers.",
    "367": "I JUST WANT CLIPPERS PLAYING @trailblazers FOR 25 GAMES MORE!!!\nCan we do it? @NBA \nJust do someting Adam Silver!! https://t.co/nL2Ng7cBb8",
    "368": "@trailblazers Nurk almost had a triple double. Bosnian Beast for real 😤😤",
    "369": "@NBA @TonySnell21_ @trailblazers Happy Birthday Tony!",
    "370": "Damian Lillard takes shot at NBA officiating after Blazers’ loss to the Clippers #DamianLillard #PortlandTrailBlazers https://t.co/m86M307PjH",
    "371": "@dallasmavs vs. @chicagobulls \n@hornets vs. @memgrizz \n@okcthunder vs. @PelicansNBA \n@SacramentoKings vs. @spurs \n@Pacers vs. @nuggets \n@trailblazers vs. @Suns \n@Timberwolves vs. @warriors \n@MiamiHEAT vs. @Lakers",
    "372": "@NBA @TonySnell21_ @trailblazers Happy Birthday #buckforlife",
    "373": "@NBA @TonySnell21_ @trailblazers Look like he could be boosie cousin",
    "374": "@SlingshotCap @trailblazers @ModaCenter and $EAST chart looks nice also 😀",
    "375": "Join us in wishing @TonySnell21_ of the @trailblazers a HAPPY 30th BIRTHDAY! #NBABDAY https://t.co/Yo3bzBjbeS",
    "376": "Once the balance sheet is fixed, it is amazing to see what the mgmt of $EAST did/could do. \n\nAnnouncements:\n26 Oct - joint promotion with Frito-Lay North America\n10 Nov - 3-Year Sponsorship Deal with @trailblazers at @ModaCenter.\n\nSuper happy to be their shareholder.",
    "377": "Analyzing Wednesday’s Portland Trail Blazers at Phoenix Suns odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/YqGv7Z6pbi",
    "378": "Portland Trail Blazers at Phoenix Suns odds, picks and prediction https://t.co/Bu8aggCk1E",
    "379": "@marquesdaryl @NBA @TonySnell21_ @trailblazers Unfortunately ratio failed.",
    "380": "@NBA @TonySnell21_ @trailblazers He’s that one guy!",
    "381": "@NBA @TonySnell21_ @trailblazers I didn't know he still play in the NBA",
    "382": "@NBA @TonySnell21_ @trailblazers MR statline",
    "383": "@NBA @TonySnell21_ @trailblazers Happy Birthday Blessings",
    "384": "@HamTheMan12 @NBA @TonySnell21_ @trailblazers Try not to disrespect this ratio",
    "385": "#Los Angeles Clippers - Portland Trail Blazers ★ #Partido finalizado: 117 - 109 by: #SofaScore",
    "386": "#Los Angeles Clippers - Portland Trail Blazers ★ #3er cuarto terminado: 83 - 79 by: #SofaScore",
    "387": "#Los Angeles Clippers - Portland Trail Blazers ★ #3er cuarto empezado: 56 - 55 by: #SofaScore",
    "388": "@NBA @SnellSeason @TonySnell21_ @trailblazers Happy Birthday! 🥳 \nWishing you a wonderful day! 💓",
    "389": "@NBA @TonySnell21_ @trailblazers I thought bro was Bron age",
    "390": "@NBA @TonySnell21_ @trailblazers Happy Birthday to \"Mr Statline\" Tony Snell!",
    "391": "@marquesdaryl @NBA @TonySnell21_ @trailblazers He got into the court for cardio",
    "392": "@marquesdaryl @NBA @TonySnell21_ @trailblazers LMAO",
    "393": "@marquesdaryl @NBA @TonySnell21_ @trailblazers This is the real image. Don't ever disrespect the goat like that again! https://t.co/oBhDQPF6B4",
    "394": "The Portland Trail Blazers have not won a game on the road this year yet (0-5). https://t.co/y8Ql8YJAKF",
    "395": "I Can’t Wait For THE PHOENIX SUNS TO Play THE PORTLAND TRAIL BLAZERS Tomorrow!!!! THE PHOENIX SUNS Are Going To Smash Them.. 💜🧡💜🧡💜🧡💜🧡☀️☀️.",
    "396": "I Can’t Wait For THE PHOENIX SUNS TO Play THE PORTLAND TRAIL BLAZERS Tomorrow!!!! THE PHOENIX SUNS Are Going To Smash Them.. 💜🧡💜🧡💜🧡💜🧡☀️☀️",
    "397": "@marquesdaryl @NBA @TonySnell21_ @trailblazers I came here looking for this graphic",
    "398": "@marquesdaryl @NBA @TonySnell21_ @trailblazers I knew someone was gonna post this 💀",
    "399": "@NBA @TonySnell21_ @trailblazers GOAT efficiency",
    "400": "@NBA @TonySnell21_ @trailblazers Had the most legendary game",
    "401": "@NBA @TonySnell21_ @trailblazers Is he still playing?",
    "402": "@NBA @TonySnell21_ @trailblazers Happy birthday",
    "403": "@NBA @TonySnell21_ @trailblazers Overrated",
    "404": "@NBA @TonySnell21_ @trailblazers Bulls legend",
    "405": "Join us in wishing @TonySnell21_ of the @trailblazers a HAPPY 30th BIRTHDAY! #NBABDAY https://t.co/lQu2hq6z2D",
    "406": "for the first time ever i didn’t sleep at all thank you @trailblazers @Dame_Lillard 💚🤙🏽",
    "407": "@trailblazers find a way. https://t.co/PvPbhYlb5E",
    "408": "#Sports #TopStories Trail Blazers Loses To Los Angeles: Trail Blazers have been one of the best teams in the NBA. The team has been one of the consistent teams over the years. The team has its origin from Portland, Oregon. They belong to the Northwest… https://t.co/ueHu0A72xE",
    "409": "Paul George, Reggie Jackson Power Clippers to Win vs. Damian Lillard, Trail Blazers #sports\n\nPaul George's 24-point, nine-rebound, seven-assist evening led the Los Angeles Clippers to a 117-109 win over the visiting Portland Trail Blazers on Tuesday at\n\nhttps://t.co/hN6SqCgH2i",
    "410": "@Davedaviddave12 @Dwaiders @trailblazers cj isn’t a leader, i realize dame forced a couple shots up but cj leading the team is a big nono.",
    "411": "🏀GAME DAY🏀 🏠\n\n🆚 @trailblazers\n🕑 2:00am 🇬🇧\n🎽 🟣\n\n📊 Record\nSuns: 6-3\nBlazers: 5-6\n\n⚔️ Season Series\nSuns 0-1 Blazers\n\nWho's winning tonight?\nComment your predictions 👇\n\n#Suns #SunsUK #RallyTheValley #ValleyProud\n@Suns #NBA75 #NBATwitter #RipCity",
    "412": "Utah Jazz 110 (Donovan Mitchell 27 pts) Atlanta Hawks 98 (Kevin Huerter 28 pts, Clint Capela 13 pts, 12 rebs), Los Angeles Clippers 117 (Paul George 24 pts, 9 rebs) Portland Trail Blazers 109 (Damian Lillard 27 pts, Jusuf Nurkic 15 pts, 13 rebs)",
    "413": "@CityMadeGoat @trailblazers @npowell2404 @CarMax Norm????",
    "414": "Eastside Distilling Inks Sponsorship Deal With Portland Trail Blazers At Moda Center $EAST https://t.co/fS2zDOkKWi",
    "415": "@trailblazers Norm !!!! Look after our star !! 💪🙏🔥🇨🇦 So awesome",
    "416": "@trailblazers If we don’t move cj by the deadline all hope is lost.",
    "417": "#Briefs #EAST Eastside Distilling Inks Sponsorship Deal With Portland Trail Blazers At Moda Center https://t.co/aw3neiuT0t https://t.co/jtwRzKVkRV",
    "418": "Eastside Distilling Inks Sponsorship Deal With Portland Trail Blazers At Moda Center https://t.co/6e0c6kZoBk",
    "419": "@trailblazers Norm don’t deserve this",
    "420": "Ende #Basketball Herren #NBA \n118:109 #MilwaukeeBucks vs Philadelphia76ers \n98:110 AtlantaHawks vs #UtahJazz \n109:117 PortlandTrailBlazers vs #LosAngelesClippers",
    "421": "NBA - LA Clippers Make it Five Straight Wins, Defeat Portland Trail Blazers 117-109 https://t.co/g9V2yReYNE",
    "422": "NBA - LA Clippers Make it Five Straight Wins, Defeat Portland Trail Blazers 117-109 https://t.co/8BypmLqUKB",
    "423": "@trailblazers I’m Intuit",
    "424": "Portland Trail Blazers vs LA Clippers Full Game Highlights | November 9 | 2022 NBA Season - https://t.co/UkUDAZKjuN",
    "425": "Portland fuccin SUCC @trailblazers  @CJMcCollum you been playing like fuccin dirt BUMASS mad me lose bread",
    "426": "Anfernee Simons says 👋 to the rim!\n\n@trailblazers 71\n@LAClippers 72\n\nLate third quarter on TNT https://t.co/jqUHSwxjad",
    "427": "@trailblazers Blazers were unfortunately not Intuit tonight 😂☠",
    "428": "@NBA @trailblazers @LAClippers I'm better",
    "429": "Anfernee Simons says 👋 to the rim!\n\n@trailblazers 71\n@LAClippers 72\n\nLate third quarter on TNT https://t.co/pIIg9j7PpK #NBA",
    "430": "ℕ𝔹𝔸-𝕌𝕡𝕕𝕒𝕥𝕖: 🇺🇸🤝🇩🇪 | 09.11.2021\n\n▶ L.A. Clippers (6-4) 117:109 Portland Trail Blazers \n🧮 Isaiah Hartenstein: 17:25 Minuten, 14 Punkte, 3 Assists.\n\nhttps://t.co/i0f77ubEH3",
    "431": "@trailblazers Nice to know we that bitch ass team out west. JFC. Does anyone care at this point?  Seems like the core group and the front office are at a standoff. Some basic ass lame shit. Bout to be a bucks fan. At least it’s a winning small market franchise.",
    "432": "@CityMadeGoat @trailblazers @npowell2404 @CarMax It’s the butterfly effect from oden",
    "433": "Portland Trail Blazers vs. Phoenix Suns - 11/10/2021 Free Pick &amp; NBA Betting Prediction https://t.co/9Y53x9EPWp #FreePicks ... https://t.co/DSk6LMGn7P",
    "434": "Paul George finished with 24 points, nine rebounds and seven assists, and Reggie Jackson added 23 points as the Los Angeles Clippers extended their winning streak to five games with a 117-109 victory Tuesday over the visiting Portland Trail Blazers. https://t.co/PflqrjVH4d",
    "435": "Paul George finished with 24 points, nine rebounds, and seven assists and Reggie Jackson added 23 points and six assists as the Los Angeles Clippers dropped the Portland Trail Blazers 117-109 Tuesday night at Staples Center. https://t.co/Eep4h7ie4d",
    "436": "@xRALJR @ChasingMyCROWN_ @KaranT0078 @trailblazers He washed",
    "437": "@Davedaviddave12 @ChasingMyCROWN_ @KaranT0078 @trailblazers He played 5 less games than he did with the Raptors and doesn't play because his ACL is kinda fucked right now ??",
    "438": "@xRALJR @ChasingMyCROWN_ @KaranT0078 @trailblazers George had his first half decent playoffs since he was a rookie last year, he is known for choking in the playoffs. U do know this right?",
    "439": "@Davedaviddave12 @ChasingMyCROWN_ @KaranT0078 @trailblazers While Russ was getting outscored by CJ McCollum and had a +/- of like -10 or worse every game but koo",
    "440": "@xRALJR @ChasingMyCROWN_ @KaranT0078 @trailblazers Star player? He never plays. He was a star with the raptors and spurs. He doesn’t even play for the clippers. Clippers got expired goods. Kawhi has easiest job in the world, get paid max doing nothing.",
    "441": "@Davedaviddave12 @ChasingMyCROWN_ @KaranT0078 @trailblazers One of our star players got injured and we got worse ? For real? No way ! 😮",
    "442": "@xRALJR @ChasingMyCROWN_ @KaranT0078 @trailblazers 5 game win streak wow! Beat the twolves 2 times, congrats. Clippers are worse than last year lol. But they did pull off the biggest upset in recent nba history beating the jazz last year. That was kinda a miracle. Mann was making 3s lol",
    "443": "Paul George scored 24 points with nine rebounds and Reggie Jackson added 23 points as the Los Angeles Clippers extended their winning streak to five games with a 117-109 victory over the visiting Portland Trail Blazers. | @Reuters https://t.co/D4P5XOsyRB",
    "444": "@Davedaviddave12 @ChasingMyCROWN_ @KaranT0078 @trailblazers Clippers have more wins with PG and Bobby Shmurda and are on a 5 game win streak. We are not the same bozo",
    "445": "@trailblazers @npowell2404 @CarMax One wY to Get Better Dont Let Norm Just sit in the Corner please",
    "446": "@77Blazers @trailblazers @nyknicks LaRue \"who\"? !!!!!",
    "447": "Blazers can’t cool off Clippers in 117-109 loss: LOS ANGELES — Paul George scored 24 points, Reggie Jackson added 23 and the Los Angeles Clippers extended their winning streak to five Tuesday night, beating the Portland Trail Blazers 117-109. https://t.co/P6Z8Btdk8t #RipCity https://t.co/DtVcj6tiso",
    "448": "@trailblazers Awesome Anfernee!!",
    "449": "@trailblazers Gonna be another season you go 41-41 and get swept in the first round? 🤣🥶🤡",
    "450": "@PeayKyle I think as usual The @trailblazers make it in again some how. But this eight is highly possible. @Dame_Lillard will do anything and everything he can to be in the #NBA #Playoffs https://t.co/7BDZOdoEYN",
    "451": "This Team Has the Fight and Determination and Not Afraid to Challenge Themselves Nor they Opponent!!! as the @LAClippers Beat the @Trailblazers 117-109!!! #LETSGO #FANTRUTH #CLIPPERDARRELLCARES #FROMAFANSPOINTOFVIEW https://t.co/3uGEieDSX2",
    "452": "@trailblazers Wasting Dame career. Trade him so he can win a ring. He deserves it like Clyde",
    "453": "Blazers ALL IN bet tomorrow. Thanks in advance @trailblazers SURE MONEY",
    "454": "@midrangehoops @trailblazers @nyknicks Yes he did",
    "455": "@itbeHootie @ClipperNation16 @trailblazers own him",
    "456": "@Rockies @Mariners @Dbacks @Braves @trailblazers @Suns  help us pursue our dream and get on @CoorsLight page!!!",
    "457": "@trailblazers @npowell2404 @CarMax When we get a couple solid players for dame, the sky is the limit. Like imagine a starting lineup of CJ Brown Powell horford Nurkic. Or Maxey CJ Powell Simmons nurkic. I think Neil is afraid to trade fame cause the fan base is obsessed with him.",
    "458": "@trailblazers @npowell2404 @CarMax Another blowout loss tomorrow, forfeit tomorrow game. We're losing by 20",
    "459": "@trailblazers @npowell2404 @CarMax Norm: 8/13 and good defense — 23 pts.\n\nCJ: 6/15 and horrible defense — 13 pts.\n\n“Us.”",
    "460": "@ClipperNation16 @trailblazers Didn't you literally just lose to Portland like a week ago? People are delusional, lmao",
    "461": "@trailblazers please get Ben Simmons so we can be contenders",
    "462": "@FedExBlows @mookburner @trailblazers Exactly. The only thing I noticed from having billups as a coach is CJ got a lot better on defense. But at least when we trade dame, billups will have a say in the personnel we get for him. And then we can see how the team looks after.",
    "463": "@trailblazers @npowell2404 @CarMax It’s the roster. Your GM has failed you.",
    "464": "@trailblazers How was that not a foul",
    "465": "@trailblazers @npowell2404 @CarMax Another loss tomorrow night",
    "466": "@EMSavvy @LAClippers @trailblazers That’s all of them.",
    "467": "@trailblazers ...To fire Olshey? You can do that any day now.",
    "468": "The @LAClippers show @trailblazers what #teamspirit smells like. 117-109 @latimessports @AndrewGreif https://t.co/feEv76LMtT",
    "469": "@trailblazers @npowell2404 @CarMax Can’t forget ant",
    "470": "@trailblazers @npowell2404 @CarMax Norm and Roco and CJ sold us",
    "471": "@xRALJR @ChasingMyCROWN_ @KaranT0078 @trailblazers Clippers are trash this year. In the same boat as blazers. Exceot blazers have players they can trade for a complete team. Players other teams would want. Imagine if ur best young player were kennard and mann lol.",
    "472": "Another chance tomorrow. https://t.co/HUiweexA8z",
    "473": "@Davedaviddave12 @trailblazers In 3 years buddy",
    "474": "Paul George drills 3 in from LA Clippers vs. Portland Trail Blazers https://t.co/m7qwKmaCPC \nThe road to the Western Conference Finals between the #Clippers and the #Lakers continue!",
    "475": "The LA Clippers powered to their 5th win in succession following a 117-109 victory against the Portland Trail Blazers #SSBasketball",
    "476": "@chase_conwell @trailblazers He’s been playing great defense this year. If ur talking about last year in the playoffs, yes, but he broke his foot and was playing hurt. I doubt u been watching the games. That’s the one good thing about billups so far I noticed, is cj got a lot better on d.",
    "477": "@trailblazers Simply not good enough. Where the hell is this team going  with this lineup",
    "478": "#NBA - Results:\nPhiladelphia 76ers 109-118 Milwaukee Bucks\nUtah Jazz 110-98 Atlanta Hawks\nLA Clippers 117-109 Portland Trail Blazers\n#SSBasketball",
    "479": "@xDavidXtreme @Dwaiders @trailblazers Trade cj, our best player lol. U do realize the games we won, are the games dame doesn’t shoot a lot and cj does right? Tonight was just dame trying to shoot himself out of a slump, it ain’t happening. Great players have bad games, not bad months.",
    "480": "@trailblazers Lame time is trash asf needs to quit will never be better than jokic",
    "481": "🏀 10/11/2021 🇺🇸 ⌚ 4h\nLos Angeles Clippers - Portland Trail Blazers   117-109\n▶️ Paul George + 7,5 R @ 1.70  ✅\n▶️ Nicolas Batum + 5,5 R @ 1.70  ✅",
    "482": "It wasn’t a typical Trail Blazers loss. @DaveDeckard explains several contributing factors to Portland dropping a winnable 117-109 game against the Clippers, praising several players who made good in spite of the final result. https://t.co/7k0PRBuQSE",
    "483": "@trailblazers have been Olshey’d into purgatory. #RipCity https://t.co/PNDTnhgNcb",
    "484": "Paul George scored 24 points with nine rebounds and Reggie Jackson added 23 points as the Los Angeles Clippers extended their winning streak to five games with a 117-109 victory over the visiting Portland Trail Blazers. #NBA75 https://t.co/LseAyzFynr",
    "485": "Reggie Jackson with a deep 3 vs the Portland Trail Blazers https://t.co/P9AnyTvhC5 https://t.co/gJhvDhTV9z #nba #sportsnews #basketball https://t.co/CWGADPkv7T",
    "486": "Isaiah Hartenstein with an alley oop vs the Portland Trail Blazers https://t.co/jeeqs5yZpL https://t.co/gJhvDhTV9z #nba #sportsnews #basketball https://t.co/9mwb4XIG0Q",
    "487": "Justise Winslow with a 2-pointer vs the Portland Trail Blazers https://t.co/PXP0qLzbGd https://t.co/gJhvDhTV9z #nba #sportsnews #basketball https://t.co/wBzXhmAIpz",
    "488": "Paul George with an and one vs the Portland Trail Blazers https://t.co/rSuFqQYL5y https://t.co/gJhvDhTV9z #nba #sportsnews #basketball https://t.co/3cCsDLmmOs",
    "489": "Top dunks from LA Clippers vs. Portland Trail Blazers https://t.co/IfJWgYFqAe https://t.co/gJhvDhTV9z #nba #sportsnews #basketball https://t.co/9wDMyHnKRZ",
    "490": "@Crispybits01111 @trailblazers Cj has won games for us single handily. Imagine trying to play with dame chucking 13 3s trying to find himself. Not getting the ball and going 0-2 isn’t really trash.",
    "491": "@FactsandTruth_ @trailblazers What am I watching 😭😭",
    "492": "@NBA @trailblazers @LAClippers Yeeeesh",
    "493": "@RoseCityFTW @KaranT0078 @trailblazers Trade offer failed sadly",
    "494": "@trailblazers Waaaat...\n\nNurkic had more points than CJ?????",
    "495": "@clankk @Davedaviddave12 @DiogenesMadlad @trailblazers im pretty convinced that dudes a philly fan who thinks his terrible takes on twitter is going to sway the value of dame so that we trade him to them for some god awful haul",
    "496": "@Dwaiders @TwiztidPikachu @trailblazers We gon mathematically eliminate ourselves from playoffs by the All-Star break at this rate",
    "497": "@Davedaviddave12 @trailblazers Dame not a free agent until 2024 lil bro",
    "498": "@Samsinfire @trailblazers Gon lose anyways with Chauncey coaching, might as well as look good while losing.",
    "499": "@trailblazers Really baffled at home Billups offense has eliminated “Dame Time”. Why are we not putting the ball in his hands in the 4th?! Have some faith in your superstar",
    "500": "@mookburner @trailblazers For all the knock on Stotts, he at least understood that his roster needed to outscore the other team to win.\n\nBillups using mostly the same roster and trying to get them to play help D... We don't have the personnel for that shit, Chauncey. Look at all the open 3s we give up.",
    "501": "@_jximer @trailblazers Watch who tf you're calling a stinky Frenchman",
    "502": "@trailblazers Dame just come on over to the Clips and let's get this chip",
    "503": "@nurknturk @trailblazers I thought we played them 4x? 🤔 well shit.. I guess we don't",
    "504": "@Dwaiders @TwiztidPikachu @trailblazers Right. Idk how they are going to win in Phoenix tomorrow. It’s a mess. Dame trying to find himself in games isn’t going to turn out well. If anything he’s going to throw off everybody else. We actually won the games dame takes less shots.",
    "505": "@theycallmechckb @trailblazers It's just starting fam 🥲",
    "506": "@trailblazers I still think we look so good, just gotta wake up a bit get loose with it",
    "507": "@FuckIngles2 @Clappedhoodiepg @trailblazers @whyarewesoshit @BazHoopz Who did you own? Not me because I’m not a him",
    "508": "@AaronNicholas10 @nurknturk @trailblazers Bad takes? How? I’ve been saying trade lillard after game 1. Are they going to wait til nobody wants him?\nIt’s really disappointing. He’s not a leader. I hope they trade him or CJ. Cause either way, Cj is going to excel. Imagine how hard it would be to average over 20 with dame.",
    "509": "@johncanzanobft nance was touted as the best sign for @trailblazers he is averaging 16 min 4 pts 1 TO 1 ast 4.6 reb Pres is under investigation. Bring back the jail blazers!",
    "510": "@trailblazers seasons over guys hand dame over",
    "511": "@trailblazers We will get em back at home! #RipCity",
    "512": "@trailblazers another game and PG still owns yall 🥱 nuthin new",
    "513": "Batum, George Lead Clippers Past Battling Blazers: Gary A. Vasquez-USA TODAY Sports Damian Lillard tried to take over the game in the fourth but L.A. had other ideas. The Portland Trail Blazers and Los Angeles Clippers has already met twice on… https://t.co/Eya9Q6llVQ #RipCity https://t.co/Y1vWb0mDjK",
    "514": "@trailblazers we're intuit",
    "515": "@mookburner @trailblazers Simons? Lmao",
    "516": "@clankk @DiogenesMadlad @trailblazers Lol, that’s cause dame bricks everything, how can anybody else get an assist if he can’t make a shot. And there’s a stat called usage. Whoever has the ball in their hands the most (usage), will get the most stats. Dame proved he can’t win with this team. CJs turn.",
    "517": "@Davedaviddave12 @nurknturk @trailblazers I went through your tweets, your account is just made to make bad takes about Dame lol. Your concept of dames trade value is awful",
    "518": "@trailblazers Why CJ standing the corner 😂 run some plays bums",
    "519": "@trailblazers We're Intuit",
    "520": "@trailblazers Thank You Norm Powell for missing those two crucial free throws",
    "521": "@Davedaviddave12 @DiogenesMadlad @trailblazers Yet somehow Dame has more assists than CJ?? How exactly is he a ball hog lmao",
    "522": "@juniperJones0 @trailblazers Heal up what? His jump shot is broke, not his body.",
    "523": "@charluevv4 @trailblazers I agree. He’s pretty pathetic.",
    "524": "@trailblazers love this man",
    "525": "@ChasingMyCROWN_ @KaranT0078 @trailblazers yeah, NBA caliber players can't play defense ? Sounds like a personal problem https://t.co/GUFcTH1bhc",
    "526": "Ay @trailblazers we are in Intuit too lol",
    "527": "they already made my night better!😭 thank you @trailblazers   Y’all are they best!!❤️ https://t.co/5KqSJ61cwc",
    "528": "@SedinRockEdo @StonePage14 @trailblazers @ChadinRipCity I don’t blame cj. Dame needs to get him more looks. Dame is the one who is slumping hard and has the ball in his hands the whole time. I get blazers fans like lillard, but he hasn’t got it done. He acts stoic, he’s not a leader. CJ deserves a chance to be that guy.",
    "529": "Paul George and Reggie Jackson both had huge games, as the LA Clippers won at home against the Portland Trail Blazers. 💪\n\nMake that 5 straight wins now for them, and are tied with the Golden State Warriors for the longest active winning streak. 🔥 https://t.co/e982Swb3zS",
    "530": "@SDumbass12 @trailblazers Dame is playing terrible.",
    "531": "@Alex__Urquhart @trailblazers Idt so. Just need to trade lillard. Sooner the better. People who are saying trade CJ aren’t watching the games. CJ got a lot better. How he only had 2 3pt attempts is a joke. Just so dame can chuck bricks and try to find himself so he can be in more commercials.",
    "532": "@trailblazers RIP Rip City 🥲",
    "533": "@trailblazers Trade CJ and what ever else it takes for Ben….. NOW!!!!! I’m sick of this",
    "534": ".@trailblazers y’all can’t handle MVPG 😤 https://t.co/L7l8JYF9n3",
    "535": "@trailblazers Get Dame some more hep",
    "536": "@trailblazers \"not a product of roster construction\" https://t.co/Zhr6DWVhHp",
    "537": "@AaronNicholas10 @nurknturk @trailblazers It’s not a hate account. I don’t mind dame, but blazers need to trade him now or they will waste a chance to do something great. Trade him for Simmons, if Simmons wants to come to portland. Trade him for Brown, if he wants to come to portland. The longer they wait the worse",
    "538": "@trailblazers Awww hell me too!!!!",
    "539": "@trailblazers How do we beat the Lakers but not the clippers? How is that possible",
    "540": "@madoccassia @trailblazers Thank you",
    "541": "#NBA .@NBA .@trailblazers \nPOR:\nD. Lillard: 27 PTS, 6 AST, 5 REB\nN. Powell: 23 PTS, 3 REB, 3 AST\nJ. Nurkic: 15 PTS, 13 REB, 6 AST",
    "542": "@trailblazers Barkley and Smith clowning Blazers on TNT",
    "543": "@qqsummo @nurknturk @trailblazers Actually it does matter, some players get better. Cj is, dame isnt. Dame has had his chances leading this team, he failed. CJ has proved he can take over games. He won that playoff series vs nuggets for us 3 years ago. Last year he broke his foot, came back and wasn’t 100%.",
    "544": "@hallthesame @FuckIngles2 @trailblazers 2019 playoffs. Sga bev lou 2 wins vs kd warriors. Dame vs no kd warriors 0 wins 🤷‍♂️",
    "545": "@Clappedhoodiepg @hallthesame @trailblazers @whyarewesoshit @BazHoopz No worries I owned him 🥱",
    "546": "@trailblazers play larry more!!!",
    "547": "@nurknturk @trailblazers Nah u lost to the Clippers",
    "548": "@SmokeGTza @trailblazers Lakers blazers western conference finals  calling it lol",
    "549": "@trailblazers roco shouldn’t be playing 39 minutes under any circumstances",
    "550": "@uziair @FuckIngles2 @trailblazers Hahahahhahahahahahaaaa",
    "551": "@trailblazers I want to see some 20/20 games out of nurk. Assert his will a bit more. He’s got it in him, we’ve seen it before🤞",
    "552": "@trailblazers I’m Intuit",
    "553": "@BestLoliShinobu @clankk @trailblazers the whole team is like that one game we look like finals contenders the next we look like the pistons",
    "554": "@trailblazers It’s Time To Blow It Up",
    "555": "@KaranT0078 @trailblazers Lillard is literally the reason that man is in that jersey 😐",
    "556": "@trailblazers I'm done watching the games",
    "557": "@trailblazers Dame just take the time and heal up.",
    "558": "@trailblazers Pain",
    "559": "@Dancoviss @nurknturk @trailblazers Right now, of course he is. What games have u been watching? Imagine how hard it would be playing with lillard. If CJ wasn’t playing so good we would be 3-8. He won the clippers and pacers games for us.",
    "560": "Clippers continue their winning streak as they defeat Trail Blazers, 117-109. Portland are now 0-5 on the road. 👀\n\nNicolas Batum: 22 PTS, 6 REB, 6 3PT\nReggie Jackson: 23 PTS, 6 AST\nDamian Lillard: 27 PTS, 5 REB, 6 AST\n\n#laclippers #trailblazers #paulgeorge #damianlillard https://t.co/2EikFYOVHn",
    "561": "@PinwheelEmpire I do not enjoy him as a Portland Trail Blazers",
    "562": "@trailblazers wE’rE iNtUiT 😂😂😂",
    "563": "@TwiztidPikachu @trailblazers Says blazer fans that can't see the writing on the wall and after game one, game two, game 3, and so on and so on.",
    "564": "@trailblazers Imagine a wholesome results tweet from all of the Portland fans...\n\nNope, you can legit confuse haters from other teams, troll and fan accounts all in one tweet and it's disgusting.\n\nUnlucky team, next one.",
    "565": "PG-13 continues to play at an MVP level as the @LAClippers take care of business at home against the @trailblazers 🤩🤩\n\n24 Points\n9 Rebounds\n7 Assists\n3-7 3PT\n\n#ClipperNation #NBA #NBATwitterLive \nhttps://t.co/lGNHH0tmXL",
    "566": "@trailblazers another L https://t.co/cQUNsIoe5Y",
    "567": "@chrislema @Zengy Get you someone who believes in you as much as I believe in the @trailblazers #RipCity - now I'm going to rage eat some ice cream brb.",
    "568": "@Ayodos11 @trailblazers First round bwhahahaha this team ain't making the playoff",
    "569": "@trailblazers Regretting letting melo and trent go now . We are just bad this year … our bench is trash . And honestly need we need a true center Nurk soft",
    "570": "@DollaIgnited @trailblazers Fr I rather them give up a tough 2 than a wide open 3 but cj ain’t smart",
    "571": "@Ayodos11 @trailblazers Not even making the playoffs 😂",
    "572": "@CHold Lol you would think they might listen to the things @Dame_Lillard had said over and over. He isn’t leaving the @trailblazers and the national media will not influence that choice. I am convicted the entire @NBA national media has a learning disability",
    "573": "@trailblazers Can we just win one away game?",
    "574": "@trailblazers Dame deserves a better team and he isn’t gonna get it in Portland unfortunately as much as he wants it to be.",
    "575": "@matheusf_30 @trailblazers to vendo uma lose pro golden state ali hein",
    "576": "@T_Rev33 @trailblazers Yeah, we’ve seen this movie. As Charles just said, blow it up. https://t.co/OoJDuywDg8",
    "577": "@trailblazers Ben Simmons can put 13 point plus good defense.",
    "578": "@FuckIngles2 @trailblazers Come at me all you want with your persona insults wtf. I don’t hate the clips, just PG.",
    "579": "@KaranT0078 @trailblazers Didn't lillard knock him out of playoffs.",
    "580": "ENCERRADO: o Los Angeles Clippers (6-4), em casa, venceu o Portland Trail Blazers (5-6) por 117 a 109. #ClipperNation\n\nGeorge: 24pts, 9reb &amp; 7ast.\nJackson: 23pts, 2reb &amp; 6ast.\n\nLillard: 27pts, 5reb &amp; 6ast.\nPowell: 23pts, 3reb &amp; 3ast.\n\nFIM DA RODADA! #NBA75 https://t.co/P8X1s1Ahdh",
    "581": "@Davedaviddave12 @nurknturk @trailblazers Oooh this is a Dame Hate account very cool",
    "582": "@username1442 @nurknturk @trailblazers It’s not even that bad of a game. Not like lillard gets him good looks. CJ only got to shoot 2 3s, meanwhile lame time shot 13. CJ also got a lot better on defense.",
    "583": "@TriggaThirty @trailblazers Well lillard doesn't have half the team he has are the defense that warriors play.  He has cj and nurk.  So quit trolling.",
    "584": "@trailblazers Final:\n\nWe\nAre\nGoing \nTo\nMiss \nThe \nPlayoffs",
    "585": "Alright that @trailblazers loss was unbearable. I have no choice but to turn to a documentary about Four Seasons Total Landscaping or I’m about to snap.",
    "586": "@trailblazers CJ for Ben Simmons right now.",
    "587": "Congratulations @LAClippers on your 117-109 win over the Portland Trail Blazers 2021-2022NBASeason",
    "588": "I won a lot of money today and I am just livid over these idiot @trailblazers",
    "589": "@trailblazers Pain",
    "590": "@BestLoliShinobu @BlowLeads @trailblazers Nah Nurk is the epitome of inconsistency lmao",
    "591": "@trailblazers Blow it up already",
    "592": "@Davedaviddave12 @nurknturk @trailblazers you can’t be serious thinking cj is a better player than dame…",
    "593": "@trailblazers Real talk, stop playing in those Statement jerseys. They look good, but as long as I can remember our W/L record with them is abyssal",
    "594": "@Dwaiders @trailblazers nassir was wide open up the court in transition and cj didn’t pass to him. i felt that disappointment in nassir, i would demand a trade now or publically beg neil to trade cj",
    "595": "@trailblazers Choke City",
    "596": "@EthanVarga5 @trailblazers Ummmm.... if your gameplan has Nance Jr on the pick&amp;pop that's a coaching problem",
    "597": "@DollaIgnited @trailblazers What about him standing there after rebound on a ft plus the awful passes he had.",
    "598": "@trailblazers Shitty asf another 1st round exit",
    "599": "@trailblazers Throwback to when CJ could hit footers/layups",
    "600": "Trade Powell, Cj, Covington, and Olshey for Jaylen Brown and Pritchard. @trailblazers @celtics",
    "601": "@trailblazers Rlly ant",
    "602": "@Dame_Carrying @hallthesame @trailblazers I just saw it somebody just quoted it",
    "603": "@trailblazers Wtf major fall off",
    "604": "Another tough loss on the road. Another solid outing by Norm and back to normal shooting by Dame. See you tomorrow in Phoenix. \n\n📸 @trailblazers \n\n#RipCity https://t.co/YGGQY0QwIJ",
    "605": "@TupacHomie0of @trailblazers I’ll never understand the mindset of leaving someone who’s made 5+ threes already wide open. Same situation with Harrison Barnes",
    "606": "@trailblazers Why does CJ have like 5 ridiculously good games at the start of every year then turn so trash afterwards",
    "607": "@FuckIngles2 @hallthesame @trailblazers why so late",
    "608": "@trailblazers free Dame at this point. we had some good years, but this team is embarrassing to watch now.",
    "609": "Final 📊\n\nDame: 27p/6a/5r\nNorm: 23p/3r/3a\nNurk: 15p/13r/6a\nCJ: 13p/3r/3a\nCody: 8p/8r\nRoCo: 6p/6a/5r\nLarry: 5p/4r\nAnt: 5p/2a\nNas: 4p/2r/2b\nTony: 3p",
    "610": "@trailblazers Give nassir more of the ball plz",
    "611": "@BlowLeads @clankk @trailblazers Yes, but he’s been the epitome of inconsistency",
    "612": "@trailblazers Can we please win a road game https://t.co/5h1R66juMG",
    "613": "@trailblazers You let batum shoot like that you deserve to lose.  Sorry season is over they don't have the pieces.  Teams will just pick and roll the hell out of us you saw what happened this game.  Where the hell was Powell and cj in the second half.  Can't stand cj.",
    "614": "@hallthesame @trailblazers @whyarewesoshit @Clappedhoodiepg @BazHoopz 🧃 this account is poverty I need u guys",
    "615": "@trailblazers This team stinks",
    "616": "@trailblazers CJ is just robbing the org at this point lmfao. Trade now",
    "617": "@trailblazers Goddammit and I hate Paul George so fucking much. Of course I wanted to win but I also wanted PG to lose.",
    "618": "Cody Zeller - Portland Trail Blazers\n8 PTS\n8 RBD\n1 AST\n1 TO\n[FD(18.1) DK(19)]",
    "619": "Jusuf Nurkic - Portland Trail Blazers\n15 PTS\n13 RBD\n6 AST\n1 STL\n2 TO\n[FD(40.6) DK(43.25)]",
    "620": "Norman Powell - Portland Trail Blazers\n23 PTS\n3 RBD\n3 AST\n1 STL\n[FD(34.1) DK(35.75)]",
    "621": "@trailblazers Powell bricking free throws late, that was the end.",
    "622": "@trailblazers Look what happens when you run it back @ChrisDMcGowan @neilolshey teams a fucking joke. FUCKING TRADE CJ ALREADY U CLOWNS. You can’t win a game on the road, how the fuck do y’all expect to make a deep run in the playoffs. Let’s run it back again next year plz! #mediocrecity",
    "623": "@hallthesame @trailblazers Fuck this ratio lil bro",
    "624": "I can’t wait till @trailblazers release Covington. Dude is a 🤡",
    "625": "@trailblazers Batum was trash for Blazers...of course he destroys them.",
    "626": "@trailblazers Snell 100% shooting…. Need more of that",
    "627": "@trailblazers Roco and CJ sold in the clutch, nothing new.",
    "628": "@Doubledown_A @DollaIgnited @trailblazers And norms 3 before the free throws*",
    "629": "@nurknturk @trailblazers To Lakers",
    "630": "Ben Simmons is sitting at home and doing the same work tonight that @CJMcCollum did today. @trailblazers trade cj or trade dame",
    "631": "🏀 Final Score 🏀\nPortland Trail Blazers 109 - 117 Los Angeles Clippers\n\nGeorge 47.8 DK, 45.3 FD\nLillard 43.3 DK, 40.0 FD\nNurkic 43.3 DK, 40.6 FD\n\nhttps://t.co/IIuYCTQkL5",
    "632": "@nurknturk @trailblazers just stop! we were all praising him last week and now that he’s had like 2 bad games in a row y’all want to say trade him again!",
    "633": "@CompDepths @trailblazers Will be 8-1 after our final game",
    "634": "@KaranT0078 @trailblazers W + I’m depressed",
    "635": "@RoseCityFTW @trailblazers That was him the whole fkn game",
    "636": "@trailblazers These refs ain't giving no foul calls for us",
    "637": "@venus69717 @trailblazers What a gorgeous dog!",
    "638": "@RoseCityFTW @trailblazers *most of the game*",
    "639": "@trailblazers Booooo we suck",
    "640": "@Doubledown_A @DollaIgnited @trailblazers Then a wide open 3",
    "641": "@trailblazers Batum owns ur franchise",
    "642": "@trailblazers CJ really let Batumn light us up",
    "643": "@trailblazers Please play nassir more Chauncey",
    "644": "@DollaIgnited @trailblazers We lost when cj refused to guard batum from 3",
    "645": "@trailblazers This team can’t buy a road win.",
    "646": "Entertaining game but a huge no finish for the @trailblazers https://t.co/7TqjrpYdLu",
    "647": "@RoseCityFTW @trailblazers Ehhhh mines better. Eat the L",
    "648": "LA Clippers clips Portland Trail Blazers 117-109 Paul George 24points 9rebounds 7assists.",
    "649": "@TupacHomie0of @trailblazers cj mccollum more like quit the nba mccollum 😂 😂 this is why he was 5’2 in high school",
    "650": "@YoungSimba2000 @trailblazers RoCo sold me on that missed layup 😐",
    "651": "@trailblazers He needs to cut more. He'd probably get a lot more dunks.",
    "652": "@trailblazers never gonna win on the road",
    "653": "@trailblazers always finding ways to fold the easy wins smh.",
    "654": "@trailblazers Was a fun game. Still early in the season.",
    "655": "@trailblazers trade dame he deserves better",
    "656": "@trailblazers lost",
    "657": "@agame_19 @trailblazers Please🙏🏽",
    "658": "@BestLoliShinobu @clankk @trailblazers cjs been better then dame all season",
    "659": "@trailblazers We really bout to miss the playoffs this year huh 😕",
    "660": "@trailblazers Should’ve kept melo since no one can score in the 4th",
    "661": "@DollaIgnited @trailblazers Powell missed free throws, then the layup…meh",
    "662": "@trailblazers Execution down the strech is non-existent.",
    "663": "@trailblazers Larry Nance Jr. should be getting double the minute he's getting",
    "664": "@trailblazers Get a road win https://t.co/aLWoAEnRz5",
    "665": "@trailblazers Wow. Wow. Just wow. I’ve been a Blazers fan for the last 41 years. Never, ever, EVER have I seen a performance this despicable. We need to trade Lillard and Simons and BRING BACK TERRY STOTTS.  I’ve had enough.   I’m going to be a Clippers fan. They can win championships.",
    "666": "@trailblazers Blazer legends I won’t sleep peacefully tonight https://t.co/FsbNCI42IO",
    "667": "Once again, the problem with the Portland Trail Blazers is obvious, they didn’t score enough points.",
    "668": "The Clippers win their fifth game in a row, beating the Portland Trail Blazers, 117-109. It was a complete team effort. Paul George led the charge with 24 pts, 7 assists and 9 rebounds. Reggie Jackson had 23 points and Nico Batum added 22.",
    "669": "@trailblazers Neil you have to make some trades. Keep Dame and make everyone else available",
    "670": "@trailblazers + PG owns Dame https://t.co/lEocHyHBfy",
    "671": "Go to hell @trailblazers",
    "672": "@k_azo_o @trailblazers calling own team poverty",
    "673": "@trailblazers I’m so done 😐",
    "674": "@trailblazers @Holla_At_Rob33 you’re a disappointment to man kind",
    "675": "@trailblazers Bruh omg imma Portland fan but it’s so hard rn we cannot excite and finish close games",
    "676": "@trailblazers PLEASE TRADE CJ IM BEGGING YOU GUYS PASS THIS ON TO THE ORGANIZATION PLEASE",
    "677": "@trailblazers Choke city",
    "678": "@trailblazers Cj the second half https://t.co/BLmaz77Yb1",
    "679": "@trailblazers and dames hurt for sure now🙂🙂🙂🙂 kms a",
    "680": "@trailblazers When will the suffering end",
    "681": "@trailblazers Wow. Wow. Just wow. I’ve been a Blazers fan for the last 41 years. Never, ever, EVER have I seen a performance this despicable. We need to trade Lillard and Simons and BRING BACK TERRY STOTTS.  I’ve had enough.  I’m going to be a Clippers fan. They can win championships. \n￼",
    "682": "@trailblazers We lost the second 6’8 Robert Covington missed a wide open layup",
    "683": "@trailblazers Not everyone is built to beat the clippers. Curry would have dropped 45 and 10 with the W. 🥱",
    "684": "@trailblazers sigh",
    "685": "@trailblazers dame brick💀💀",
    "686": "@trailblazers GG GUYS https://t.co/fDfaIhhH7u",
    "687": "@trailblazers Let’s face it. We’re just not good enough this year.",
    "688": "Robert Covington &amp; Jusef Nurkic are terrible basketball players… a 3 guard lineup will never work w/ that front court\n\nsomeone need to fix this shit &amp; quickly. @trailblazers",
    "689": "@Stanley96527445 @Comics_Lamar @trailblazers oh you got a 2nd account to defend yourself too 🤣🤣🤣",
    "690": "@trailblazers stop wasting my fucking time. Make a trade, fire Olshey… GET DAME SOME FUCKING HELP OR LET HIM GO WHERE HE CAN WIN. Fucking assholes.",
    "691": "@trailblazers Aaaaand, they lost 🤣",
    "692": "@trailblazers That’s fantastic, the other members of the team going to arrive as well?",
    "693": "I absolutely guarantee the Portland Trail Blazers WILL win a road game this season. Book it.",
    "694": "Actually me right now. You suck @trailblazers https://t.co/zH6LVw6lKd",
    "695": "@BlowLeads @clankk @trailblazers Well Dame actually played today but CJ was nowhere to be found",
    "696": "Nighty night, @trailblazers 😴",
    "697": "The @trailblazers should just give up and blow this team up. Mediocre at best and getting destroyed by Nic Batum #NBA #Blazers #freelillard",
    "698": "@BestLoliShinobu @clankk @trailblazers its dames fault he hasnt been playing like a superstar even norman has played and shot the ball better",
    "699": "I really do hate you you ruin my life @trailblazers",
    "700": "@trailblazers Pathetic basketball down the stretch how y’all let battum cook y’all https://t.co/didQV1PbIq",
    "701": "@trailblazers you all suck and I’m so tired of being born into the blood line of RipCity #frustrated",
    "702": "the @trailblazers are so trash rn. holy shit.\nIf they're gonna keep like this I would rather see Dame leave now, while he has a shot at a ring.",
    "703": "@trailblazers lmao we can never win if only dame didnt brick",
    "704": "I LOVE BEATING THE PORTLAND TRAIL BLAZERS RUN FROM THE GRIND DAME",
    "705": "@trailblazers CLIPS WINNING",
    "706": "@trailblazers No one is wearing a smile. So yeah. Looks like you’re joking.",
    "707": "@trailblazers gonna Blaze. Folding like a lawn chair. 🤬🤦🏾‍♂️ #RipCity",
    "708": "@pnwblazers @trailblazers Heating up? He’s such a scrub fr. Blazers would be better if he didn’t play. That’s how bad he’s been. Imagine if we used that money we pay him for good players, would have best record in nba.",
    "709": "#NBA75 on @TV5manila \nSaturday: @trailblazers vs @HoustonRockets Live 9 am\nSunday: @MiamiHEAT vs @utahjazz Delayed 9 am (Tip-off time 6 am)",
    "710": "The @trailblazers are trash.",
    "711": "@VRTX_Novak @Comics_Lamar @trailblazers Good job roco even better job norm #portlandsucks#freedame",
    "712": "@trailblazers A SHIT TEAM",
    "713": "@trailblazers y’all are sorry. Shit ass team",
    "714": "@trailblazers We're awful, I'm about to cry lmao",
    "715": "@trailblazers Bad news bears",
    "716": "@pnwblazers @trailblazers Nuh leave that to Curry, Dame got his own \"Dame ⌚\"",
    "717": "Hey @trailblazers you bum ass bitches still Intuit? 😂😂😂 #Clippernation",
    "718": "blow it up @trailblazers",
    "719": "@trailblazers is dame okay?",
    "720": "With 1:42 to go in the fourth quarter, the LA Clippers lead the Portland Trail Blazers, 108-100.",
    "721": "@trailblazers TNT halftime reporters were pretty brutal.. just sayin. Let's prove them wrong. Dame is happy we just started and he is adjusting",
    "722": "What is Robert Covington’s purpose?? Why do the Portland Trail Blazers bring back these fucking clowns every year??? NO DEFENSE!!! Guy is 6’7” and as soft as they come….🗑🗑",
    "723": "@Comics_Lamar @trailblazers Dude you got a twitter account no one interacts with yet here you are, on Portlands timeline 🤣",
    "724": "NURK FOR #McNuggets!!\n\nPortland enjoy your 6 FREE #McNugets tomorrow courtesy of the @trailblazers! https://t.co/uGTCMk5Ir9 https://t.co/90lbn8TTre",
    "725": "@trailblazers  is the ish. Thank you for engaging. May we have more dunks to disagree on (and yes, Ant’s dunk was 🥱). #RipCity",
    "726": "@trailblazers @ChadinRipCity Powell missing 2 free throws? smh... Waste of millions in cap space.",
    "727": "@trailblazers Wtf norm",
    "728": "@trailblazers Better than the hawks",
    "729": "@trailblazers Whatta game! Go Blazers #RipCity",
    "730": "@trailblazers Is Cj playing?",
    "731": "@trailblazers trade cj and start norm and little",
    "732": "Nurk Drills it for 3!!!!!!😮😮😮😮 #Blazers  @trailblazers @bosnianbeast27",
    "733": "@trailblazers shit my pants when he shot that not gonna lie",
    "734": "It’s getting down to the wire here in Staples. With 3:20 left @LAClippers lead @trailblazers 105 - 100. #LAClippers",
    "735": "With 3:20 to go in the fourth quarter, the LA Clippers lead the Portland Trail Blazers, 105-100.",
    "736": "NURK FOR 3",
    "737": "I need this @trailblazers game to go into O.T. 😈",
    "738": "@trailblazers @InevGaming Blazer fan here. Not a fanatic though. #RipCity",
    "739": "Welp. There goes that abdominal injury for @Dame_Lillard FUUUUUUUUU@$ @trailblazers #RipCity",
    "740": "@leaguepassnba12 @trailblazers Wow that would be sweet!",
    "741": "Does anyone know an actual @LAClippers fan? I’m at the @trailblazers game tonight and there are about 7 of them here. #PORvsLAC",
    "742": "@trailblazers We need dame time! pls don’t lose",
    "743": "@trailblazers finally it’s been scary",
    "744": "@trailblazers @Alexancooper Love that man",
    "745": "@trailblazers Lame time",
    "746": "@trailblazers let’s go",
    "747": "@trailblazers took him long enough",
    "748": "@trailblazers I couldn’t contain my excitement",
    "749": "Dame's heatin' up https://t.co/KMap9VhsIC",
    "750": "ALERT: New high roller bet posted!\nA bet has been placed for $26,961.86 on Los Angeles Clippers - Portland Trail Blazers to win $49,879.45.\nTo view this bet or copy it https://t.co/k3EHLV4eZ7 https://t.co/E3UbVa3wyK",
    "751": "@Blazer_Gang Of course we can, we're the Portland Trail Blazers 😂",
    "752": "🚨 UPDATE: Jusuf Nurkic - Portland Trail Blazers has a Double Double\n6:17 4th\n12 PTS\n10 RBD\n5 AST\n1 STL\n[FD(32.5) DK(34.5)]",
    "753": "@trailblazers A beauty 😉",
    "754": "With 6:17 to go in the fourth quarter, the LA Clippers lead the Portland Trail Blazers, 99-93.",
    "755": "@Yxsir0 @trailblazers I wouldn’t say that, not like he beat us in the playoffs.",
    "756": "I’m tellin ya man. @AnferneeSimons has scary potential, and it’s starting to show. Been behind him since day 1. He’s someone to build around with @Dame_Lillard for sure. Just a straight dude. @trailblazers #RipCity",
    "757": "@trailblazers @trailblazers can we get a petition going to trade dame?",
    "758": "@trailblazers @CJMcCollum Good god Portland needs a new coach ASAP why in the world in the fourth quarter with Paul George in and your runnin your second unit billups what are you thinking man get Norman Lowell and Damian lillard back in the dang game you had it close now you are just throwing this game",
    "759": "@InevGaming @trailblazers Yeah. I get the year is young. But that wasn’t a “shit-in-ya-face” dunk. 😂😂😂",
    "760": "These Portland Trail Blazers bro 😒",
    "761": "@Dwaiders @trailblazers And last game Vs Lakers",
    "762": "Sooooooo when's Ant becoming a starter? @trailblazers",
    "763": "With 9:01 to go in the fourth quarter, the LA Clippers lead the Portland Trail Blazers, 91-82.",
    "764": "@InevGaming @Illek10 thanks for not calling us interns 🥰",
    "765": "ALERT: New high roller bet posted!\nA bet has been placed for $7,055.50 on Los Angeles Clippers - Portland Trail Blazers to win $12,347.13.\nTo view this bet or copy it https://t.co/kOudTGTdl1 https://t.co/pEku94BTf9",
    "766": "@Illek10 @trailblazers That the social media team seriously thinks this is the dunk of the year.",
    "767": "@GaryGoatJr @trailblazers Don't give him any ideas now...",
    "768": "@InevGaming @trailblazers What’s the sad part?",
    "769": "@trailblazers Let's go 🐜 https://t.co/ctNRFJdz2U",
    "770": ".@trailblazers i own u lil bro https://t.co/86jnFFWao6",
    "771": "@trailblazers @Illek10 Thats the sad part",
    "772": "@trailblazers Not even close.",
    "773": "@trailblazers Imagine. Its the start of the 4th and Nurkic has more pts than @CJMcCollum lmfao. Thats ur 2nd best?",
    "774": "@trailblazers Would have been if only he had been able to get the wet willy in with that off hand.....lol",
    "775": "@trailblazers ant man the slam dunk champion 🐜",
    "776": "@trailblazers It's a great dunk but JA might not let it be dunk of the week",
    "777": "@trailblazers Still have faith in Dame. He’s going to have a monster 4th and take it home!",
    "778": "@trailblazers The dunk happened this year, making it of this year, so yes!! https://t.co/uzFhixfBNA",
    "779": "@trailblazers Good dunk but not better than cantwi",
    "780": "@trailblazers @Illek10 ratio",
    "781": "@DramaticGambler @trailblazers If only he had his surgery in summer",
    "782": "@trailblazers @_Talkin_NBA Stop the cap",
    "783": "@GalSaucisse @trailblazers Tonight ?",
    "784": "@trailblazers Calm down",
    "785": "@CHold @trailblazers Casey, don't use that word. My 3 year old daughter is on this website. What would you say if she saw that kind of language?",
    "786": "@trailblazers Come on let’s win this",
    "787": "@NBA @trailblazers @LAClippers Literally nobody cares about any game the Clippers are involved in....except their 7 or 8 fans. 😆 ...Even fans of the team they're playing would rather forfeit than see their team share the court with that silly \"franchise\".",
    "788": "@trailblazers Do I think you’re serious?",
    "789": "@trailblazers Team is so mistake prone",
    "790": "@NBA @trailblazers @LAClippers Simons making sure his presence is felt, I love the energy of that young man, he got a bright career ahead.",
    "791": "@trailblazers dame always bricking 10 3s a game💀💀💀",
    "792": "@NBA @trailblazers @LAClippers And 1??? Refs ain't been calling shit lately",
    "793": "@trailblazers can't wait for Chauncey to bench Ant for no reason at all",
    "794": "@trailblazers save us Norm",
    "795": "@trailblazers Cj is awful to watch tonight...",
    "796": "@trailblazers dame is so bad",
    "797": "@trailblazers It was definitely nice 👍",
    "798": "@trailblazers Nic was torching us",
    "799": "@trailblazers bruh pls dont lose",
    "800": "To the 4th \n\n#RipCity https://t.co/GDtIaUagI2",
    "801": "ALERT: New high roller bet posted!\nA bet has been placed for $5,006.65 on Los Angeles Clippers - Portland Trail Blazers to win $9,512.64.\nTo view this bet or copy it https://t.co/SJockV1SF2 https://t.co/Hm3cgnveOn",
    "802": "Match: Los Angeles Clippers - Portland Trail Blazers\n\nBet slip link: https://t.co/6DfszYq11b\n\n#LosAngelesClippers #PortlandTrailBlazers #nucypher #nu #roulette https://t.co/eSQhrtOeIu",
    "803": "Fighting @trailblazers https://t.co/d0pJbYg257",
    "804": "@Illek10 do we look like we're joking",
    "805": "@NBA @trailblazers @LAClippers Right on zubac cap lol",
    "806": "With only the 4th left to play, the @LAClippers lead the @trailblazers 83 - 79. #LAClippers",
    "807": "@trailblazers It was nice, but seriously asking if this is the dunk of the year?! 😂😂",
    "808": "@trailblazers It wasn’t that tight",
    "809": "@DAMETIMESZNN @trailblazers Not sure that you get how that works",
    "810": "@NBAonTNT @nba @trailblazers @Dame_Lillard tell the world &amp; fans that your retiring as a Trailblazer.",
    "811": "@NBA @trailblazers @LAClippers Maybe dude is finally coming around",
    "812": "@trailblazers You have you make this a moment @nbatopshot #topshotthis",
    "813": "Anfernee Simons says 👋 to the rim!\n\n@trailblazers 71\n@LAClippers 72\n\nLate third quarter on TNT https://t.co/kIQGp2PrfK",
    "814": "@trailblazers Giannis opening night dunk&gt;&gt;&gt;",
    "815": "“It’s hard to play basketball when you’re not all in… He’s got to leave, or [Portland] has to bring in some help.”\n\n- Charles Barkley on Damian Lillard and the Trail Blazers https://t.co/dUJ6ZBoV0a",
    "816": "@trailblazers @CHold 0% chance!",
    "817": "@trailblazers it was smooth but let’s not get ahead of ourselves here",
    "818": "@trailblazers We have waited this moment",
    "819": "@trailblazers Facts",
    "820": "@trailblazers It won’t get talked about because we’re Portland 😔 fye ass Dunk Simons",
    "821": "@trailblazers Love Anfernee but no",
    "822": "@trailblazers Gotdamn that was filthy!",
    "823": "@DAMETIMESZNN enjoy the video.",
    "824": "@trailblazers The Anfurnace 🔥🔥",
    "825": "@trailblazers This is the best ever tipster that Twitter has never had @footybetts \nIs the best person around https://t.co/YBcNzVsz1I",
    "826": "DUNK OF THE YEAR!??! https://t.co/RsBXzMjGP3",
    "827": "@trailblazers YESSIR @AnferneeSimons https://t.co/gHYSkCna4y",
    "828": "@trailblazers Dunk of the year",
    "829": "@trailblazers Need video now",
    "830": "@trailblazers And the replay by TNT 🧨",
    "831": "@trailblazers NEED THAT CLIP",
    "832": "@trailblazers Ant chose violence",
    "833": "@trailblazers @CJMcCollum If billups needs a back up center tell them they can call up okc and get Derrick favors for a little of nothing and favors is a big upgrade over Cody zellar",
    "834": "Gonna need that replay of that @AnferneeSimons dunk @trailblazers !",
    "835": "@trailblazers need this easy win tonight got a hard one tomorrow finish this strong",
    "836": "@DRob214 @trailblazers @NBAonTNT If I was a coach I would’ve got ejected in the Cleveland game after this no call https://t.co/QjjDgtSLO0",
    "837": "@trailblazers WE NEED THAT HIGHLIGHT #RIPCITY",
    "838": "@trailblazers ???? ohhhh ant?",
    "839": "THE SLAM DUNK CHAMP HAS ARRIVED WOW",
    "840": "@trailblazers @CJMcCollum If billups doesn’t find someone to take the center spot in that second unit they will get killed this game zubac will eat him alive he can’t even get a dang easy dunk I’m sorry he barely got hit and still can’t finish off a dunk he is a horrible back up center",
    "841": "@trailblazers @CJMcCollum Its been 8yrs and u guys still cant see that CJ aint the guy",
    "842": "@TupacHomie0of @trailblazers @NBAonTNT Man he might with these new rules not called everything he gon lose his s$#t one game",
    "843": "@trailblazers @CJMcCollum Portland just needs to give Norman Powell the ball seems like he is the only one that can score consistently Portland is playing to much iso ball if they would move the ball around they would get more wide open shots but zellar in that second unit kills them at the center spot",
    "844": "ALERT: New high roller bet posted!\nA bet has been placed for $19,625.29 on Los Angeles Clippers - Portland Trail Blazers to win $28,849.18.\nTo view this bet or copy it https://t.co/rOSuLAVpA8 https://t.co/JK9KxFyel6",
    "845": "@trailblazers @CJMcCollum Portland is not gonna win very many games this year not with Cody zellar in that second unit he is a horrible center I would hate to know that I had him as my backup center",
    "846": "With 7:00 to go in the third quarter, the LA Clippers lead the Portland Trail Blazers, 70-64.",
    "847": "@trailblazers @CJMcCollum Stalwart",
    "848": "@trailblazers @RoCoXBlazersSZN @CJMcCollum Givin PG em clamps",
    "849": "@Johnnyboi237 @trailblazers @Dame_Lillard yeah i’m in a completely different country bro, just a blazers fan",
    "850": ".@CJMcCollum defense appreciation post https://t.co/FIIattrSYv",
    "851": "@HiveCards @GLBreaks_ @UniqueFinds09 Portland Trail Blazers lot of 12. $35 shipped paypal https://t.co/0MnV2mt4ly",
    "852": "@trailblazers Finally....all the NBA TV games are blocked out here and I don't have Root network.  Who makes these dumb contracts that don't allow the local people to actually see the games on TV.  #rootsucks",
    "853": "@trailblazers @raptorsstufff hello, fb",
    "854": "@DRob214 @trailblazers @NBAonTNT I’m tryna see him get a tech",
    "855": "@CHold @trailblazers You love to see a young man work hard, be successful, get paid, and not be satisfied with anything.",
    "856": "With 9:55 to go in the third quarter, the LA Clippers lead the Portland Trail Blazers, 60-59.",
    "857": "@trailblazers Love this for him!!!🥺🔥🔥🔥🥺",
    "858": "@trailblazers The fact that Norm is really good at basketball makes me happier",
    "859": "@trailblazers Hmm, true, our tax brackets *are* right about 25% 😬",
    "860": "@trailblazers When Portland decides to move the ball everything goes well. For some reason there’s addiction to take tough shots and iso.",
    "861": "@trailblazers So happy for him♥️",
    "862": "@trailblazers absolutely dominating at half. Pitching a shutout! @espn still giving the Clippers 59.1% chance to come back from a 55 point deficit and steal one from the Trailblazers. 2nd half coming up next after these messages from your local stations. 😂😂😂😂 https://t.co/v0P83EuR14",
    "863": "@trailblazers Barkley starting some 🔥",
    "864": "@NBAonTNT FLYER ON MARVIN BAGLEY PLEASE @trailblazers 🙏🏽🙏🏽",
    "865": "@trailblazers Hmm interesting discussion about Dame on Inside the NBA halftime-",
    "866": "@PopWonderNFT @trailblazers worried about Dame Time? or too early?",
    "867": "@Johnnyboi237 @trailblazers @Dame_Lillard ANFERNEE SIMONS",
    "868": "@Johnnyboi237 @trailblazers @Dame_Lillard please tell me you a troll",
    "869": "Love the @NBAonTNT cast but they are talking crazy about Dame. They don’t know our point guard like we do. @trailblazers",
    "870": "@trailblazers lmaooo u da goat https://t.co/6yfvGMAADN",
    "871": "Get my boy some help mann @trailblazers",
    "872": "Portland Trail Blazers at Los Angeles Clippers: Live updates https://t.co/hkL0Vn6lYI https://t.co/EPKtS9a4mA",
    "873": "@scarygaryjr @charluevv4 @trailblazers What",
    "874": "@Johnnyboi237 @trailblazers @Dame_Lillard we got simons we will be good",
    "875": "thanks for the like @trailblazers fb bestie 🤍 https://t.co/zOqVmdUzsc",
    "876": "@Johnnyboi237 @trailblazers @Dame_Lillard troll",
    "877": "ALERT: New high roller bet posted!\nA bet has been placed for $26,578.07 on Los Angeles Clippers - Portland Trail Blazers to win $58,471.76.\nTo view this bet or copy it https://t.co/m2bAbmlJCQ https://t.co/81EmJj3Sci",
    "878": "@Dame_Carrying @trailblazers @RoCoXBlazersSZN Ratio",
    "879": "@trailblazers @RoCoXBlazersSZN Owns paul george",
    "880": "@trailblazers WTG Norm!! 💪🏻",
    "881": "@trailblazers @bruceely @gb3elite @CodyZeller @2ez_nassie Love these!",
    "882": "Portland Trail Blazers @ Los Angeles Clippers (10:00 PM ET)\nSelection: Los Angeles Clippers -3",
    "883": "@bruceely @trailblazers @AnferneeSimons @Dame_Lillard @Holla_At_Rob33 @gb3elite Incredible photography! 😁",
    "884": "@Blake_Jnsn Blake.........idk about this one........",
    "885": "@trailblazers Can we get some official recognition of the (Nurkic/Norman) combo widely known as: NORK",
    "886": "@trailblazers Norm on a mission #RipCity",
    "887": "@trailblazers Over his son PG13 as well!",
    "888": "@DamesLover @RoCoXBlazersSZN @trailblazers Indeed but shooting early in the clock with 2 people on him isn’t the best thing for him either",
    "889": "@trailblazers he’d have more if dame actually passed him the ball",
    "890": "@trailblazers Dame forcing a bit to much. Got the defend the 3's. Powell is smoking hot 🔥",
    "891": "16 points in 15 minutes, 4-4 from 3. \n\nHave yourself a half, Norm! https://t.co/HYT1r90KS1",
    "892": "#Los Angeles Clippers - Portland Trail Blazers ★ #Partido empezado by: #SofaScore",
    "893": "@trailblazers Tell dame to wake up",
    "894": "@clankk @trailblazers he got smallest hand in nba history",
    "895": "The Clippers lead the Trail Blazers 56-55 at the half. 14/4/3 for George to lead Los Angeles. Powell has 16 on 5-7 for Portland. As always, @Alaforce is an insightful and valuable sideline reporter. She asks useful questions.",
    "896": "Loving the @trailblazers effort. https://t.co/fbdO8uuXA6",
    "897": "@trailblazers Good game so far 💪",
    "898": "@trailblazers Blazers legends play some offense",
    "899": "@clippers lead 56-55 at the half. Feels like @trailblazers have executed better on defense and their PnR game is working well. Clips have just made some high degree of difficulty shots to stay in. Gonna need to pick up the D in the 2nd half &amp; they have to get Mann/Kennard going.",
    "900": "@trailblazers Dame stop ruining your 3 pt percentage, play off ball",
    "901": "@trailblazers Gotta play defense",
    "902": "@trailblazers Absolutely!!! 🙌💥💥💥🙌",
    "903": "Fun first half.\n\n#RipCity https://t.co/q4yxZUI4ev",
    "904": "@trailblazers He gives me Clyde Drexler vibes. Go Blazers 🖤♥️",
    "905": "All those runs and everything's basically back to square one here. Clippers 46.7% overall, Portland 43.5%. Trail Blazers made 5 of their 9 tries from deep in the second quarter. Clippers racked up 12 paint points in the second frame.",
    "906": "At the half, the @LAClippers lead the @trailblazers 56 - 55. #LAClippers",
    "907": "@trailblazers Unloved the way were using NORM RN",
    "908": "@77Blazers @trailblazers @nyknicks The much-maligned LaRue Martin had a great night against the Knicks.",
    "909": "@trailblazers Nurk simply cannot handle the ball smh.",
    "910": "@trailblazers hoopin tonight!",
    "911": "@trailblazers NORM GOING CRAZYY 🔥",
    "912": "@trailblazers Goat",
    "913": "@trailblazers Love that guy",
    "914": "@trailblazers Yes we are!💪❤🖤",
    "915": "@Johnnyboi237 @trailblazers your name says it all",
    "916": "@trailblazers POW3lllllll MY GUY",
    "917": "@TupacHomie0of @trailblazers @NBAonTNT I seen him get heated at the refs.",
    "918": "@Johnnyboi237 @blazersfaithful @trailblazers What?",
    "919": "NATIONAL TV NORM",
    "920": "@DRob214 @trailblazers @NBAonTNT Oh yeah definitely. i just wanna see how fired up he gets",
    "921": "@trailblazers Then put him at the 2 where he belongs",
    "922": "@texasd3731 Tonight's Trail Blazers game has been picked up nationally by TNT. The Portland Trail Blazers will be back on ROOT SPORTS tomorrow in Phoenix.",
    "923": "@trailblazers Another excellent Olshey trade that his haters will ignore. They are seething.",
    "924": "@trailblazers he makes it look so easy.",
    "925": "@trailblazers I too am a big fan of Norm",
    "926": "@trailblazers Oh yeah we won the trade",
    "927": "@ROOTSPORTS_NW @trailblazers Can you contractually not play it when TNT picks it up? This is not good",
    "928": "@SunilTh78704069 @trailblazers On that pookie huh? https://t.co/KK62mOTyi6",
    "929": "@trailblazers what a pass by cj as well",
    "930": "@trailblazers man i love this man",
    "931": "@trailblazers The biggest!!!",
    "932": "@trailblazers NORMMMMM",
    "933": "@TupacHomie0of @trailblazers @NBAonTNT Thats a good thing he keeps neutral like he does.",
    "934": "@KrishGraphics same krish, same",
    "935": "@trailblazers yes. norm is so so so so so so so so good at basketball. makes me very happy",
    "936": "@trailblazers the best player on the Blazers💯💯",
    "937": "We are big fans of Norm. https://t.co/aYshhw3V19",
    "938": "@DavyGoneWild @trailblazers Yep. The anguish and anxiety are ever present.",
    "939": "@nastynotary @fuboTV @trailblazers Yeah this really blows! Why is it so hard to watch our team play!?!?",
    "940": "With 2:31 to go in the second quarter, the LA Clippers lead the Portland Trail Blazers, 49-47.",
    "941": "@trailblazers @NBAonTNT I want to see him get really upset he always has the same look 😂",
    "942": "@CHold @trailblazers Damn near!",
    "943": "@pannie_ko thanks for the support! ❤️",
    "944": "@trailblazers Cheering for you guys from Calgary .. let’s go RIp city",
    "945": "Coach Billups mic'd up 🎤\n\n@NBAonTNT | #RipCity https://t.co/w9iI5O1rpq",
    "946": "Clippers are 2-of-8 from the field in the second quarter while Portland has gone 5-of-9. Three LA turnovers have resulted in four Trail Blazers points here in the second. But, on the bright side, Clippers are up 9-0 in fast break points.",
    "947": "@NBAonTNT How about you guys call the @trailblazers game instead of all the jabbering?",
    "948": "Virginia Cavaliers - Navy Midshipmen\nUtah State Aggies - UC Davis Aggies\nLos Angeles Clippers - Portland Trail Blazers\nLoyola Marymount Lions - Chattanooga Mocs\n\nBet slip link: https://t.co/deGaxAQZ6Y https://t.co/AZoKxietZU",
    "949": "@trailblazers Let’s go blazers  👍",
    "950": "With 6:27 to go in the second quarter, the LA Clippers lead the Portland Trail Blazers, 41-39.",
    "951": "I will be broadcasting @Lakers vs @trailblazers via @NBA2K #myleague playoff push 11pm on @Twitch https://t.co/pWoXGpFENm",
    "952": "@ROOTSPORTS_NW @trailblazers What about the Seattle Kraken!!",
    "953": "@trailblazers Then we give up 15 back",
    "954": "@cameramancarlos @trailblazers Perfect! @Lakers vs @trailblazers on 12/31/21 will be yet another house divided moment. https://t.co/ofrjpGRKqP",
    "955": "@trailblazers looking at the tweets i thought we was up by a lot💀💀",
    "956": "@PrincipalMsRobs @trailblazers Officially official.",
    "957": "@trailblazers Money 💰",
    "958": "@trailblazers Advice: Dont let roco dribble man",
    "959": "@trailblazers Can we defend the 3 ball ? Just asking",
    "960": "@trailblazers We rlly suck at ending quarters Yk",
    "961": "@notPFTbot @trailblazers I'm a Vikings fan, but please STFU about it I know",
    "962": "@trailblazers Goated",
    "963": "@trailblazers We gotta close quarters better",
    "964": "@trailblazers hit a shot imo💯",
    "965": "@trailblazers Roco is so shit",
    "966": "@trailblazers We suck",
    "967": "1 quarter down at Staples.\n\n#RipCity https://t.co/aQJHQYYecU",
    "968": "@trailblazers You jinxed US!! After that tweet it’s been downhill",
    "969": "@trailblazers played a tough 1st quarter, taking it to the Clips on D and made shots, but a late @LAClippers flurry led by Reggie, PG, and T-Mann combined with a series of missed shots by Portland (and better D from the Clips) gives them a 33-26 lead after Q1. https://t.co/qsyaAlrTcS",
    "970": "@trailblazers Roco with some serious momentum-killing turnovers and missed shots. Cant have it.",
    "971": "@fablos22 @trailblazers It’s on TNT",
    "972": "At the end of the 1st, the @LAClippers lead the @trailblazers 33 - 26. #LAClippers",
    "973": "ALERT: New high roller bet posted!\nA bet has been placed for $9,429.51 on Los Angeles Clippers - Portland Trail Blazers to win $15,558.70.\nTo view this bet or copy it https://t.co/0n3jPjyuE7 https://t.co/VsLbpX5nZx",
    "974": "@trailblazers And Blazers bench bricking wide open shots and Lillard letting Mann shoot a wide open 3 for no reason",
    "975": "@richrojas602 @trailblazers Bro what",
    "976": "@trailblazers Tell Roco to hit a shot please",
    "977": "@NBA @Bucks @sixers @trailblazers @LAClippers didn’t know the sizers g league team was playing tonight",
    "978": "@trailblazers Live feed of Norm and Cody https://t.co/C1JN5EjwF9",
    "979": "Death, taxes &amp; Dame being tough to guard https://t.co/NJhxQumn4n",
    "980": "ALERT: New high roller bet posted!\nA bet has been placed for $7,400.00 on Los Angeles Clippers - Portland Trail Blazers to win $11,298.74.\nTo view this bet or copy it https://t.co/pRFAQIUYE5 https://t.co/9BrRTd4P4A",
    "981": "@cameramancarlos @trailblazers Is this official?",
    "982": "@rownieeeeee @trailblazers Ratio",
    "983": "@trailblazers @kdplus_3 I would like a Mcflurry, thank you @trailblazers 😁",
    "984": "@trailblazers Norm-GOATy",
    "985": "@richrojas602 @trailblazers casual + ratio",
    "986": "We're liking this Norm/Cody chemistry 👀",
    "987": "GO BLAZERS!!! 🤣 #Trailblazers #RipCity\n@trailblazers @LAClippers #ClipperNation https://t.co/hFalf5cPXo",
    "988": "Match: Los Angeles Clippers - Portland Trail Blazers\n\nBet slip link: https://t.co/ldThy50ewJ\n\n#LosAngelesClippers #PortlandTrailBlazers #decred #dcr #sportsbets https://t.co/Si6enozsPf",
    "989": "Better yet, I would like the bozos at @ROOTSPORTS_NW and @YouTubeTV to come to an agreement here so I can watch the dang @trailblazers",
    "990": "@trailblazers Hey, somebody’s gotta hype up the set up man on this play 🤷‍♂️",
    "991": "Hey @trailblazers .. I’m out and about and would love to watch the game tonight on my phone. What are my options? 🙏🏽",
    "992": "@EugeniusGup @DrVivien2U @trailblazers @Nike And you’re the exact reason girls don’t want to play sports🤦‍♀️",
    "993": "@joewhalen ok Joe",
    "994": "@trailblazers To be fair, Shaq coulda hit that. Nobody within 20 feet of him. A+ assist",
    "995": "DAME! @trailblazers",
    "996": "I would love if the @trailblazers and @fuboTV were better",
    "997": "@trailblazers *the not they 🤦🏽‍♀️",
    "998": "Not only does it suck that I had to subscribe to @fuboTV to watch the @trailblazers on Root Sports, but now I can’t watch the national games because Fubo doesn’t have TNT and there is no simultaneous broadcast on Root",
    "999": "@trailblazers 😂 hopefully they machine is working, butttt we can settle for McNuggets tonight 😝",
    "1000": "@trailblazers WE MASSIVE",
    "1001": "Con el pick 12 Portland Trail Blazers seleccionan @gswvicente https://t.co/V2s0jQdb4H",
    "1002": "@RussPlsWin @trailblazers Tell him to fire our gm pls",
    "1003": "@kdplus_3 now we're craving a McFlurry!",
    "1004": "That’s a good answer by the @trailblazers and the run included a 3 from @Dame_Lillard. #RipCity https://t.co/Fecfg6IaFv",
    "1005": "@trailblazers nice run",
    "1006": "LETS GOOOO @trailblazers",
    "1007": "@trailblazers Norms shot 😮‍💨",
    "1008": "10-0 run by the squad!",
    "1009": "That was a good time out Portland took @trailblazers",
    "1010": "With 7:04 to go in the first quarter, the LA Clippers and Portland Trail Blazers are tied, 13-13.",
    "1011": "@trailblazers on pace to let up 312 points this game let’s go",
    "1012": "I could quit smoking, drinking, eating red meat—I could do any number of things to help my heart health, but it won’t fucking matter so long as I remain a @trailblazers fan.",
    "1013": "@bruceely @trailblazers @AnferneeSimons @Dame_Lillard @Holla_At_Rob33 @gb3elite Looks like you still ain't ready 13-3",
    "1014": "@Dame_Lillard is gonna get hot @trailblazers no worries , he’ll drop like 25 on them clippers . Just takes time to turn it to the dame",
    "1015": "VEGAS GOLDEN KNIGHTS 🏒 -$120 PORTLAND TRAIL BLAZERS 🏀 +3 #NHL #NBA",
    "1016": "Portland Trail Blazers vs LA Clippers. https://t.co/JbxjTlXyCU",
    "1017": "@Tonyatwork @bjornwarloe @msginnywalters Portland Trail Blazers because of L&amp;C Trail \nSeattle Sounders because of the Puget Sound",
    "1018": "With 9:07 to go in the first quarter, the LA Clippers lead the Portland Trail Blazers, 13-3.",
    "1019": "ALERT: New high roller bet posted!\nA bet has been placed for $9,474.18 on Los Angeles Clippers - Portland Trail Blazers to win $17,053.53.\nTo view this bet or copy it https://t.co/zxPXpTkw4c https://t.co/Hl2lZHHlKk",
    "1020": "NBA 1st Half ML. Date: 11-09\nPortland Trail Blazers vs Los Angeles Clippers. 5.06%\nPointsBet. Blazers @ +165\nDraftKings. Clippers @ -135\n#arbitrage #bettingtwitter #bettingpicks #sportsbets #freepicks #freemoney #mlb",
    "1021": "My First Tome This Year Watching My Fav Player @Yg_Trece In Action On @NBAonTNT Vs The @trailblazers Let’s Goo #PG13 😤",
    "1022": "ALERT: New high roller bet posted!\nA bet has been placed for $7,105.64 on Los Angeles Clippers - Portland Trail Blazers to win $15,277.12.\nTo view this bet or copy it https://t.co/tD4sJPQNaS https://t.co/weZ5cZ5RTM",
    "1023": "Finally  going to sit and watch my new team the @trailblazers for the first time this season.",
    "1024": "Hey uh @trailblazers\n\n@bosnianbeast27 is still on the floor. Trade him?",
    "1025": "@trailblazers @Dame_Lillard @CJMcCollum @npowell2404 @Holla_At_Rob33 @bosnianbeast27 @stormxio Dang it I don’t have TNT",
    "1026": "Portland Trail Blazers have won the opening tip.",
    "1027": "@trailblazers @Dame_Lillard @CJMcCollum @npowell2404 @Holla_At_Rob33 @bosnianbeast27 @stormxio Umm anyone know where to watch the game? It’s not on Roots",
    "1028": "Watch Live Stream of Portland Trail Blazers vs Los Angeles Clippers\nhttps://t.co/8V7nPYBv47",
    "1029": "@trailblazers @Nike Look at Gresham highschool softball field and you'll see why girls chóse other things to do. Set next to nice baseball fields is the softball filed/sandbox complete with its own pond when it rains",
    "1030": "🏀 NBA ACTION! \n\nThe @Trailblazers are ready to take the court against the @LAClippers in Los Angeles…\n\nCan Dame pull off another win in LA? 🤔\n\n#MakeAPlay ➡️https://t.co/qUPBOzx6EM #RipCity #ClipperNation https://t.co/TR3fSBgAW2",
    "1031": "Nov. 9, 1975 - LaRue Martin grabbed a career-high 22 rebs in @trailblazers 115-96 win over @nyknicks. Martin added 18 points in the win while Larry Steele had 8 steals.\n\n#Blazers #RipCity #thisdateBlazersHistory https://t.co/FRchChjm9J",
    "1032": "ALERT: New high roller bet posted!\nA bet has been placed for $5003.34 on Los Angeles Clippers - Portland Trail Blazers to win $8,733.97.\nTo view this bet or copy it https://t.co/Mf1mE1pYRq https://t.co/2e031oUTxz",
    "1033": "@trailblazers @Dame_Lillard @CJMcCollum @npowell2404 @Holla_At_Rob33 @bosnianbeast27 @stormxio Blazers will lose tonight and tomorrow",
    "1034": "Thinking about betting on Portland Trail Blazers at LA Clippers (NBA)?  Find out what pick Pine member @JuiceGod locked in for the game.\n\nhttps://t.co/1frvFS49Y0",
    "1035": "@McTannerV1 @trailblazers @Dame_Lillard @CJMcCollum @npowell2404 @Holla_At_Rob33 @bosnianbeast27 @stormxio Blazers Legend McTannerV1",
    "1036": "@trailblazers lets get this money!",
    "1037": "Portland Trail Blazers vs. LA Clippers 10:00 on TNT https://t.co/0sK2keNN2G",
    "1038": "@trailblazers @Dame_Lillard @CJMcCollum @npowell2404 @Holla_At_Rob33 @bosnianbeast27 @stormxio START GOATY https://t.co/Dn1JMO4XJk",
    "1039": "ALERT: New high roller bet posted!\nA bet has been placed for $26,755.85 on Los Angeles Clippers - Portland Trail Blazers to win $48,160.54.\nTo view this bet or copy it https://t.co/yW2hsTZdD1 https://t.co/NQOtZX0g0U",
    "1040": "Portland Trail Blazers Starters:\n\nDamian Lillard\nCJ McCollum\nNorman Powell\nRobert Covington\nJusuf Nurkic\n\n#RipCity #NBA #NBATwitter #NBA75",
    "1041": "@CJMcCollum Alert! Watch CJ and his @trailblazers on TNT now!",
    "1042": "Ya se viene Blazers x Clippers!\nViva @trailblazers #RipCity",
    "1043": "The @TrailBlazers starting Lillard, McCollum, Powell, Covington, Nurkic on Tuesday. #RipCity #NBA",
    "1044": "@McDonalds @trailblazers Dill pickles belong in the trash 🗑 not on a hamburger!  Listen: @BurgerKing  &amp; @McDonalds think how much $$ 💴  &amp; time you can save if you eliminate dill pickles. I have eaten @McDonalds since 1st one opened in LaVale, MD. (1968). Ditch the pickle barrel",
    "1045": "Tonight's starting lineup for the Portland Trail Blazers: Lillard, McCollum, Powell, Covington, Nurkic https://t.co/bVWH4Av1bs",
    "1046": "#NBA #NBATwitter Today's Lineups\n\n#RipCity\nPortland Trail Blazers Starting 5:\nDamian Lillard\nCJ McCollum\nNorman Powell\nRobert Covington\nJusuf Nurkic\n\n#ClipperNation\nLos Angeles Clippers Starting 5:\nReggie Jackson\nEric Bledsoe\nPaul George\nNicolas Batum\nIvica Zubac",
    "1047": "Time 2 watch the Clippers follow instructions on how 2 LOSE GAMES in basketball EVERY WINTER, particularly 2 my #LakeShow EVERY WINTER 2: COME ON @trailblazers &amp; @Dame_Lillard #ripcity #BEATCLIPPERSPLEASE #PORvsLAC #NBA75 #NBAonTNT 🏀",
    "1048": "@ryansnuggs @BoredApeYC @LAClippers @trailblazers Damn, any @warriors apes w tix then? 🙂",
    "1049": "Portland and L.A. have both already blown each other out this season, so what's to make of tonight's rubber match? We break down this offense against defense clash with @Salas42_'s @trailblazers vs. @LAClippers picks.\n\nhttps://t.co/GcuJ6xHMvs",
    "1050": "NBA Live Scores: Game open! Follow to get updates as LAC hosts POR.  @LAClippers @trailblazers #NBA",
    "1051": "Everyone knows it’s game day. Go @trailblazers #RipCity https://t.co/HgcxSTOdFt",
    "1052": "Wed, 10th Nov: #LosAngelesClippers vs #PortlandTrailblazers - ODD @ 1.99\nMore details on: https://t.co/0YJS9JT91y\n#baskettips #basketprediction #basketballbets #nba #usabasket",
    "1053": "Reminder to fans that tonight's @trailblazers game has been picked up nationally by TNT. The Portland Trail Blazers will be back on ROOT SPORTS tomorrow night at 5:30 PM PT in Phoenix!",
    "1054": "@trailblazers @bruceely @gb3elite @CodyZeller @2ez_nassie Nas is like. https://t.co/7LjdVIQ0rT",
    "1055": "@trailblazers @SnellSeason holy dub, keep giving him love",
    "1056": "@trailblazers @SnellSeason look at snelly man so inspirational",
    "1057": "@trailblazers @SnellSeason If you say bucks in 6 I'll buy a blazers tony Snell jersey",
    "1058": "@trailblazers @bruceely @gb3elite @CodyZeller @2ez_nassie Great pics!❤🖤",
    "1059": "@trailblazers @SnellSeason Any idea what he spins on that turntable?",
    "1060": "ALERT: New high roller bet posted!\nA bet has been placed for $5002.37 on Los Angeles Clippers - Portland Trail Blazers to win $8,353.96.\nTo view this bet or copy it https://t.co/94BSSzl3lS https://t.co/hbvHYRkjz8",
    "1061": "@trailblazers @SnellSeason Aw hell yeah",
    "1062": "@trailblazers Needed this, thank you atTrailBlazers, love you",
    "1063": "@SnellSeason Anything for you https://t.co/3pHsVyt3b5",
    "1064": "@trailblazers @bruceely @gb3elite @CodyZeller @2ez_nassie Do you have any tony content for me",
    "1065": "It’s always a good time for @trailblazers basketball.",
    "1066": "It’s the @NBAonTNT from Staples Center tonight with @realStanVG and @ALaForce \n\n@LAClippers / @trailblazers https://t.co/RREpEfxmkL",
    "1067": "@trailblazers #FireOlshey NOW to save #RipCity https://t.co/0FOiUuAmWz",
    "1068": "We here @trailblazers 😈 https://t.co/hKcY98s7ue",
    "1069": "He’s off the table @trailblazers",
    "1070": "@trailblazers win tonight 🙏🏽🙏🏽 it’s my birthday",
    "1071": "@BYeti28 @BarstoolDucks @trailblazers @trailblazers fan and I love Kent. Maybe you’re just a hater account? Seems your Twitter is solely dedicated to bashing people. Classy.",
    "1072": "Eastside Distilling Signs Three-Year Sponsorship Deal with the Portland Trail Blazers at the Moda Center\n\nhttps://t.co/5Mgkyh63NL"
}