{
    "0": ".@OrlandoMagic coach Jamahl Mosley on what the team can take from last night's narrow loss and how they can take care of business against the Pelicans tonight. #MagicTogether https://t.co/mbnuv6GiXq",
    "1": ".@OrlandoMagic coach Jamahl Mosley on what the team can take from last night's narrow loss and how they can take care of business against the Pelicans tonight. #MagicTogether https://t.co/56FtpQbfEQ",
    "2": "Remember you are tanking 🙏🙏🙏@OrlandoMagic",
    "3": "@3AWilliams3 @OrlandoMagic @DavisGB1 @BuffaloBills @UCFKnights @UCF_Football Omg wow! Thank you!!! Go knights and Go Bills!!!",
    "4": "Uniforms for Orlando Magic vs New Orleans Pelicans at 5:00 PM. \n\n#MagicTogether #WBD https://t.co/tfWWW0xYUE",
    "5": "The Pels continue their playoff push tonight against the Orlando Magic! 👀\n\n@PelicansNBA Live counts you down to tipoff NOW on Bally Sports New Orleans! #WBD https://t.co/e7hyqmIL9s",
    "6": "Almost that time again,  let's go @OrlandoMagic #MagicTogether",
    "7": "@Zion2NYC @ESPNNBA Ok what is your point? We don’t have our stars playing. Orlando Magic is a team full of professional and potential players. They can beat anyone in the league at any given time",
    "8": "@OrlandoMagic PLEASE sign @devin_cannady3",
    "9": "HashTags On Deck! Let's Go!!!\n\n#OrlandoMagicGame67 #ORLvsNOP\n\n#MagicTogether \nvs\n#WBD \n\n#OrlandoMagic #MagicTogether  #WeGotAlotPopping #MagicSzn2021\nWE💥G O T💥ALOT💥P O P P I N G https://t.co/jqlH1LQDXH",
    "10": "The New Orleans Pelicans (27-38) host the Orlando Magic (16-50) at the Smoothie King Center.  The Pelicans attempt to get back on the winning track despite All-Star Forward Brandon Ingram sitting out on the injury report. https://t.co/PYZUN6maMI",
    "11": "The @OrlandoMagic take on the Pelicans tonight!\n\nGet ready for the action with Magic LIVE right now on Bally Sports Florida! #MagicTogether https://t.co/5T34Atx1aI",
    "12": "The @OrlandoMagic take on the Pelicans tonight!\n\nGet ready for the action with Magic LIVE right now on Bally Sports Florida! #MagicTogether https://t.co/W3juXDvKQF",
    "13": "@OrlandoMagic @DavisGB1 @BuffaloBills @UCFKnights @UCF_Football dudes a beast!!!!",
    "14": "@IamEdwinPrime @PlayoffFultzV2 @OrlandoMagic Yeah Ignas has been solid and when he plays with Lakeland he drops 30+ I do like adding the pure shooting of cannady tho",
    "15": "@MarchMadnessMBB @jameernelson @DelawareMBB @UDBlueHens time flies 🥲 https://t.co/c5BAGKvp3c",
    "16": "@OrlandoMagic @jalensuggs Why is anthony a starter. I don't get it. He's the reason the team lost.",
    "17": "New Orleans Pelicans - Orlando Magic over 223 linjalla arvio on 54%. #Sukkelat",
    "18": "What up #magic fans.I started collecting #cards again and here’s my personal collection so far 🔥I need to figure out how to get @TerrenceRoss to sign my /10 gold card of him!@OrlandoMagic #orlandomagic #basketball @The_ColeAnthony @franzboogie @wendellcarter34 @KingJames #lebron https://t.co/No1CTyHkSA",
    "19": "I have a friend who was a big NBA fan but stopped following entirely when the Orlando Magic traded Shaq",
    "20": "welcome back @jalensuggs 🤝\n\ntonight's starting five ⬇️ https://t.co/T3wbaQm1Ws",
    "21": "Tonight's starting lineup for the Orlando Magic: Anthony, Suggs, Franz Wagner, Carter Jr., Bamba https://t.co/bVWH4AMCA2",
    "22": "🚨INJURY UPDATE:\n.@OrlandoMagic guard Jalen Suggs (sprained right ankle) will play tonight at New Orleans.\n\n#MagicTogether",
    "23": "@OrlandoMagic @GregTompsett @DavisGB1 @BuffaloBills @UCFKnights @UCF_Football Gabe is the #1 reason the Bills do not \"need\" Chase Claypool. Chase is an excellent young player, but the Bills to giving up any value for him is a non-starter for me.",
    "24": "Respect Orlando Magic legend Shelvin Mack? Word to @SRTerrio_ https://t.co/k8LStvmxML",
    "25": "The @OrlandoMagic head down to the bayou to take on the @PelicansNBA!\n\nPregame starts at 7:30 PM with @JakeChapmanOM with tip off set for 8 PM on @969thegame https://t.co/DQVjmurJZZ",
    "26": "Join us at the Walt Disney World® Resort in Orlando, Florida from July 11-22 for the best PD available! Come experience the structures. Come experience the magic. Come experience full engagement!\n\nAnd APPLY NOW for a scholarship! Due 3/15!\n\nhttps://t.co/8SfVCjauy9 https://t.co/w6uhU63oaH",
    "27": "New Orleans Pelicans VS Orlando Magic\n\n50/1 bet builder ☘️ https://t.co/NAkUHhvxNU",
    "28": "Here is today’s (3/9) pregame media session with @OrlandoMagic Head Coach Jamahl Mosley:\n\n#MagicTogether \n\nhttps://t.co/WKC9jSw1AX",
    "29": "Game 67!⁠\n⁠\n🏀: Magic vs Pelicans\n🕔: 7:30 PM⁠\n📻: FM 96.9 | am740 | 101.1 HD-2⁠\n💻: https://t.co/1R8o1iKZvB\n📱: iHeartRadio App in Orlando https://t.co/SwYCa8Yl14",
    "30": "From the Pelicans Baseline - Coach Green's Key Pregame Quotes vs. Orlando Magic\n@PelicanScoop @ktmoze #Pelicans\n\nhttps://t.co/roW7DXgqUj",
    "31": "@MovingPictureny @theozonepod @OrlandoMagic @devin_cannady3 Way ahead of ya \n\nhttps://t.co/JjsV9hvbqV",
    "32": "feelin' cozy \n\n#ULTRADrip x #MagicTogether https://t.co/hN7ieFuOT2",
    "33": "@JEichenblatt @OrlandoMagic U attended games in the womb",
    "34": "@Rparksjr85 @OrlandoMagic @PelicansNBA @FortyEightMins Aye ask him when they going to be good.. 🤣",
    "35": "#Magic coach Jamahl Mosley says rookie starting guard Jalen Suggs (right ankle sprain) is going through warm-ups and is a game-time decision. He has missed Orlando's past 2 games.",
    "36": "@Underdog__NBA Not helpful @OrlandoMagic",
    "37": "Pregame with @OrlandoMagic Head Coach Jamahl Mosely. The Magic are in New Orleans tonight to face the @PelicansNBA @FortyEightMins #MagicTogether https://t.co/rWkk6CtmWn",
    "38": "Jalen Suggs is going through his on-court warm ups and remains a game-time decision for the @OrlandoMagic's road game against the Pelicans. If he's able to go, he'll start. If not, R.J. Hampton will once again start in his place.",
    "39": "Orlando magic +8.5 \nPistons +6 \n#GamblingTwiitter #FreePicks #NBAPick",
    "40": "[Live] 2022 NBA Basketball New Orleans Pelicans Vs Orlando Magic 👉 ▶️ : https://t.co/tKmwnPVgbw | 9-Mar-22 @ 20:00 | Orlando Magic | New Orleans Pelicans | NBA | Basketball https://t.co/Fi77kIBe9e",
    "41": "@OrlandoMagic @DavisGB1 @BuffaloBills @UCFKnights @UCF_Football LETS GOO",
    "42": "@BovadaOfficial @WhatsYaWager @thePatMorrow #whatsyawager \nORLANDO MAGIC v NEW ORLEANS PELICANS\n\nWendell Carter Jr. over 24.5 Points and Rebounds\n\nThanks! 🙏",
    "43": "Congratulations to Just_glyding (@JustGlyding) who moved up 1 spot to take #1 on the Orlando Magic team leaderboard.\n\nhttps://t.co/nIw9E0UHwr",
    "44": ".@OrlandoMagic vs @PelicansNBA Wendell Carter Jr. to get a double double +130. Might have to take that. Hit in the last 7 of 10 games.",
    "45": "Hey @OrlandoMagic look what I found… Definitely wasn’t 94’ but still a throw back 😁 https://t.co/UphZe4XPJv",
    "46": "@OrlandoMagic at least y’all tried",
    "47": "@_mcflyboi_ @Ian_Zwerling @sportscardsfl @felix_mcfelix @OrlandoMagic Ok he might be more developed I’ll give you that, but look at both players playing and tell me which one will be better in the pros",
    "48": "With Brandon Ingram officially out… adding U222.5 Total Points in the Magic-Pels game. Both teams second night of back-to-back. Orlando 3rd lowest scoring team.",
    "49": "🏀 NBA 🏀\n🏀 Orlando Magic x New Orleans Pelicans\n🕐 22:00 🕐\n⛹️ Cj McCollum ⛹️\n🏀 26,5+ pontos 🏀\n💰 Odd 1.86 💰\n💸 1 Unidade 💸 https://t.co/TEysYPzG3r",
    "50": "@WarrenCamille @OrlandoMagic @DavisGB1 @BuffaloBills @UCFKnights @UCF_Football Haha. My buddy does autograph stuff for the Bills. His GF also is from Buffalo and went to UCF.   Bills Mafia sticks together. I’ll text him now.",
    "51": "Back ORLANDO MAGIC to BEAT New Orleans Pelicans tonight in the @NBA (Game Starts at 01.10 GMT) #NBA #Basketball",
    "52": "@WarrenCamille @OrlandoMagic @DavisGB1 @BuffaloBills @UCFKnights @UCF_Football I could potentially make that happen",
    "53": "@DonnyTt2 @Ian_Zwerling @sportscardsfl @felix_mcfelix @OrlandoMagic Ok I know Chet is more talented than Timme and more athletic. But I still like better players and skills, Timme's stronger with more muscle and has more experience from playing longer. So I think Timme should be drafted higher at least in the first round.",
    "54": "New Orleans Pelicans vs. Orlando Magic Preview - Mar. 9\n@PelicanScoop #Pelicans @doingitdodson\n\nhttps://t.co/OEyBJiQX8I",
    "55": "New Orleans Pelicans vs. Orlando Magic Preview - Mar. 9\n@PelicanScoop #Pelicans @doingitdodson\n\nhttps://t.co/nAJx8v5ADI",
    "56": "@hardwoodtrshtlk @klaytheist11 @BlessedAdam_ @the_NBAgell @pistonsaredope @nbafan453 @GMwanttobe @nyktrell Image\nvia \n@nyktrell\n\nWith the 31st pick the Orlando Magic select Harrison Ingram \n\nIngram is a 6’8 point forward with a strong frame. Not a freak athlete but has good size and can guard multiple positions and is very skilled. https://t.co/27a8QvmGEG",
    "57": "@OrlandoMagic @wendellcarter34 Someone tell cole Anthony. He's not the star of the team. Why is he taking most of the shots.",
    "58": "@OrlandoMagic  it might be time to make that call y’all could use some shooting at bare minimum @devin_cannady3 https://t.co/hAVG5Os90P",
    "59": "@statmuse Orlando Magic",
    "60": "Let's go @OrlandoMagic 🔥🔥🔥🔵⚪⚫ #MagicTogether",
    "61": "@IamEdwinPrime @PlayoffFultzV2 @OrlandoMagic Exactly, Devin may or may not grow into a solid rotational piece but his greatest strength is our greatest weakness so he's worth a look. \n\nWe know what Ignaes is.\n\nTake that look now  while Fultz is on a minutes restriction because next year it becomes harder to do so.",
    "62": "New Orleans Pelicans Predictions and Preview for 3/9/2022 hosts Orlando Magic.  Looking for betting action?  Find out if there is any value in our preview. #GamblingTwitter #Basketball https://t.co/NXCe5nZKYN",
    "63": "Orlando Magic vs. New Orleans Pelicans - 3/9/22 Free Pick &amp; NBA Betting Prediction https://t.co/eiPsiJ9uvE\n.\n#Betting #FreePicks https://t.co/wQdBMx4ruG",
    "64": "Orlando Magic visits New Orleans Pelicans Predictions and Preview for 3/9/2022 today.  Who are we taking in this game?  Find out now. #GamblingTwitter #Basketball https://t.co/NXCe5nZKYN",
    "65": "The Orlando Magic Youth league I played in as a kid had a shot clock for crying out loud. https://t.co/3UgNTFjGFX",
    "66": "@TheNBACentral @RealJayWilliams You can tell the age of people by listening to them regarding shaq. The Orlando Magic Shaq would obliterate embiid. https://t.co/CgpbnJxHA8",
    "67": "@MosquitoCoFL @ryan_s_clark Every pro sports team eventually fails in Orlando. It’s a cursed city ever since the Magic couldn’t keep Shaq.",
    "68": "NBA Player Prop:\nWendell Carter Over 24.5 Points + Rebounds -120 (Orlando Magic)\n\nCarter has 25+ combined 8/L10 .. 4/L5 and has 30+ combined his L4 (32,31,33,36)",
    "69": "@DonnyTt2 @_mcflyboi_ @Ian_Zwerling @felix_mcfelix @OrlandoMagic You don’t think Chet will be a target to get dunked on?\nHe’s very tall but very thin.",
    "70": "Pelicans, Magic enter matchup coming off Tuesday defeats  #NBA\n #PelicansNBA #Pelicans #DoItBig #OrlandoMagic #Pure https://t.co/jG1MObLpTm",
    "71": "Had a blast at the @OrlandoMagic game where they highlighted HVAC Instructor Frederick Mendoza on Magic Vision! \n\n#MagicTogether | #FTCcollege https://t.co/YTmXj1fC2r",
    "72": "Please dont mess this up @OrlandoMagic, sign him next season. Seth Curry 2.0 https://t.co/hScOVU2p3A",
    "73": "i love the orlando magic so much",
    "74": "3/9/97 – On an NBC Sunday afternoon game, the Phoenix #Suns destroyed the Orlando Magic 121-85. PHX scored 44p in the 2Q and shot 57% from the field, 11-18 from beyond the arc, and held ORL to 11 4Q pts. Wes Person: 31p &amp; 7-9 from 3. KJ: 19p/13a. ORL: Penny: 19p/6a. #ValleyProud https://t.co/0URJW9yj2g",
    "75": "No Brandon Ingram, no problem?\n\nEverything bettors need to know prior to tip-off between the Orlando Magic and the New Orleans Pelicans, including 2 🆓 plays: ⬇️\nhttps://t.co/r6LOKPhfXh https://t.co/5MuHMFo0DO",
    "76": "#OnThisDay in 2016\nNole and Kobe in LA \n(LA Lakers vs Orlando Magic)\n#MambaForever https://t.co/DVb8ADZQyO https://t.co/AvGvGD3X2T",
    "77": "@OrlandoMagic @wendellcarter34 I want to move to Florida! Looks like they’re having too much fun!",
    "78": "NBA:🏀\nAtlanta Hawks +4.5 -110 [1]\n\nOrlando Magic +8 -110 [3] MAX PLAY🔥 \nSan Antonio Spurs Over 228.5 -110 [3] MAX PLAY🔥\n\nMiami Heat -4.5 -115 [1]\n\nNew York Knicks +8.5 -110 [1]\n\n#apuestas #deportes #apuestasnba",
    "79": "@_mcflyboi_ @Ian_Zwerling @sportscardsfl @felix_mcfelix @OrlandoMagic 1. Stats aren’t the only way to measure a player\n\n2.  Good college players don’t always make for great NBA players\n\n3. Chet is so much more talented than timme, no disrespect to timme tho",
    "80": "Wendell Carter Jr. in his last 10 games played: \n\n18.1 PTS\n11.2 REB\n2.9 AST\n60.2% FG https://t.co/Y71aOKoqF2",
    "81": "Game Preview!\nOur @OrlandoMagic take on the Pelicans. Both teams are on a back-to-back. Let’s Go Magic!\n#MagicTogether\n\nhttps://t.co/ViXEppR6yD",
    "82": "Magic try out new lineups with healthier backcourt as Orlando falls to Grizzlies https://t.co/wwSnozgf5L",
    "83": "NBA Basketball Game Betting Picks Simulator: 8:10 PM ET - Orlando Magic vs. New Orleans Pelicans - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/Uj9e1KpNLi #nba #sportsbetting #freepicks #cappertek",
    "84": "3 star Penn signee Jaydon Hodge with Buffalo Bills wide receiver Gabriel Davis at the Orlando Magic game. https://t.co/AZlhf7Tji4",
    "85": "@SpoonOfZeke Orlando Magic",
    "86": "Group outing to see the Wagner brothers and other @umichbball alumni in the @OrlandoMagic game against @hornets 🏀 on April 7. Stay tuned for details and tickets!",
    "87": "@DonnyTt2 @Ian_Zwerling @sportscardsfl @felix_mcfelix @OrlandoMagic No because I'm not smoking anything just take a look at it yourself. Men lie, women lie, numbers don't. Timme is not only better than Chet but he's like the best college player, I don't get why Chet is projected to go so high and Timme is projected to go so low, makes 0 sense. https://t.co/lLFwadGZpy",
    "88": "I remember using Jameer Nelson a lot playing 2K9, when the Orlando Magic was a top tier. This is crazy 😭 https://t.co/N0n12xsOIC",
    "89": "Brandon Ingram has been listed as out Wednesday night against the Orlando Magic. https://t.co/EmvZhP7i1U",
    "90": "@Moostinkun @OrlandoMagic I know this might be controversial to some people but like just saying my own personal HONEST opinion.",
    "91": "Just posted a photo @ Orlando Magic https://t.co/JHByPM5PSo",
    "92": "@Moostinkun @OrlandoMagic Yes bruh Suggs has been bad, he's been more of a bust so far, no offence. So trading him for future picks and talent would be great and plus this team has WAY TOO many guards. So when I think of that, Suggs is the first guy that comes to my mind and he would bring great value.",
    "93": "@JonesRubicon @7Ranger1994 @TomSmit01069776 @MustSeeStocks @RASdev1 They need to do something that has some relevance associated with the otc product,numbers or business deals all we investors get are tweets of them playing games  or god forbid Orlando magic basketball",
    "94": "Bliss in attendance at the Orlando Magic game via /r/AlexaBliss https://t.co/VIROTRRPXD",
    "95": "Hey @admiralelite15 what would you say if I was going to bring my family from Tennessee down to watch @OrlandoMagic just because they are huge fans of you!!! Would you throw a Shoutout to huge @Vol_Hoops and @admiralelite15 fans!!!!! Be there Friday against @Timberwolves",
    "96": "Orlando Magic Point Guard💯 https://t.co/t887YkSzDk",
    "97": "@IamEdwinPrime @PlayoffFultzV2 @OrlandoMagic I will say this thor, Ignas is playing decent in limited minutes. He comes in and provides a spark. Granted id rather have jeff or devin but ignas is not the worst",
    "98": "@raptorstings @AdamSchefter Kyle Kuzma being traded to the Orlando magic for a bunch of picks",
    "99": "@johnschuhmann Orlando Magic legend Adonal Foyle atop the leaderboard!",
    "100": "Consensus Line Move:\n2022-03-09 Orlando Magic at New Orleans Pelicans from 223.00 to 222.00\nUnder has books scared\n#NBA #sports #datascientist #makemoney",
    "101": "Consensus Line Move:\n2022-03-09 Orlando Magic at New Orleans Pelicans from -9.00 to -8.00\n#MagicTogether wait for it...\n#NBA #gambling #technology #cash",
    "102": "#Suns Tuesday stories:\n\n2022 NBA Finals preview? https://t.co/hcj3QxUZlj\n\nSuns edge Magic behind Deandre Ayton, Cameron Payne late-game efforts https://t.co/xopeY0OZ7N\n\n5 takeaways from escape in Orlando as exchange with JaVale McGee led to a fan ejection\nhttps://t.co/or74dRz7XE",
    "103": "From the Magic Kingdom to magical spa treatments, Orlando sparkles with the promise of adventure. Spend a day exploring the world-famous Disney theme parks or screaming your head off on a Universal... \n\nAir ticket from Abu Dhabi to Orlando\nhttps://t.co/yIf8LM88Ba",
    "104": "@koiyaaaa_ @OrlandoMagic Look at all of these lucky people getting to be near you",
    "105": "New Orleans #Pelicans F Brandon Ingram will miss tonight’s games due to right hamstring soreness against the Orlando #Magic. #NBA https://t.co/nUBLT84Eto",
    "106": "Haven't followed the Orlando Magic much this season, but the Pelicans have to be good enough now to get the win without Ingram in the lineup. Right?",
    "107": "@PelicansNBA Yall still better not lose against the Orlando magics. I bet Ingram is more comfortable resting because it's against the magic. Don't let the fanbase down",
    "108": "Suns barely beat the Magic so we can not sleep on Orlando",
    "109": "@MantisToboggan5 I'm surprised senior was with 5 teams over 4 years after Orlando. I can only remember him with the Magic for his career and then was gone one day.",
    "110": "3 generations of our family have been handed down an Orlando Magic Starter jacket pullover. Its about time the rest of the world caught up to us. https://t.co/UWbJ8jKhIV",
    "111": "An opportunity to bounce back in the Big Easy 💯\n\n@PelicansNBA vs @OrlandoMagic \n⏰ 6:30 pm\n📺 Bally Sports New Orleans\n📲 Bally Sports App\n#WBD https://t.co/DaNPI5bjTH",
    "112": "Please don't fumble the bag @OrlandoMagic https://t.co/UaJW4tKxg9",
    "113": "Behind the Numbers preview for 7 p.m. CT home game vs. Orlando (Magic, #Pelicans rank 1-2 in defense since All-Star break, despite the latter allowing 130+ pts in consecutive games; digging out of hole, into West postseason race; lineup notes/keys): https://t.co/bUB9aaEouj https://t.co/9S4q0b7sPw",
    "114": "Congratulations to longtime @NBA Coach, Brian Hill, on being inducted into the @OrlandoMagic Hall of Fame earlier this month. Coach Hill’s coaching career spans over 40 years, nine of which were with the Magic. \n\nClick here for the full article:\nhttps://t.co/EV7Q8sAoLk.",
    "115": "@MySoleIZAmazing between A&amp;T, Orlando Magic &amp; NY Giants\n\nsomebody gotta win SOMETHING....fuck lol",
    "116": "@RockTheBabyRuss We play rockets he better perform. No sympathy here.Tragic Johnson they called magic.Wat he do?Comeback n play better.Death threat aren't cool.Neither is him taking Orlando to playoffs either with no expectations in LA.yall want talk everything but his play .No bron spurs game",
    "117": "🏀NBA🏀 #NBA \n🏀Saison régulière🏀\n\nCharlotte Hornets 121-131 Brooklyn Nets\nIndiana Pacers 124-127 Cleveland Cavaliers\nOrlando Magic 99-102 Phoenix Suns\nMemphis Grizzlies 132-111 New Orleans Pelicans\nOklahoma City Thunder 115-142 Milwaukee\nGolden State Warriors 112-97 Los Angeles",
    "118": "Arsenal, Orlando Magic, and Carolina Panthers 😩 https://t.co/V6gVCdpe9b",
    "119": "We need him on the squad ASAP! @OrlandoMagic https://t.co/Ps18NHiq5h",
    "120": "@PlayoffFultzV2 @OrlandoMagic need a consistent three point shooter and floor spacer so bad\n\ni wonder if magic have been like \"we will have three more guards spots open next year (iggy, ross and harris) - just wait it out and use this year to help recover from injury",
    "121": "Who tryna buy me Orlando Magic pinstripe shorts",
    "122": "It took me having to be sitting in the Orlando magic stadium, with them blasting Disney music for me to realize they’re named the Magic because of Disney…",
    "123": "@clickthatfollow @PettyAirJordan When Jordan left the bulls still won 54 games. When shaq left Orlando the magic still made the playoffs. I’m giving facts not feelings",
    "124": "@okcthunder vs. @Timberwolves \n@OrlandoMagic vs. @PelicansNBA \n@nyknicks vs. @dallasmavs \n@Raptors vs. @spurs \n@trailblazers vs. @utahjazz \n@nuggets vs. @SacramentoKings \n@WashWizards vs. @LAClippers",
    "125": "Bring him back @OrlandoMagic https://t.co/OWc4crFXZv",
    "126": "“The fact the Magic lost by one possession to the best team in the league proves that we’re a good team— we just haven’t been healthy. The future is bright in Orlando!”— Salty https://t.co/fzOuyKBfM1",
    "127": "\"Put Russell Westbrook on Orlando Magic, they make the playoffs\": Nina Westbrook takes a shot at LeBron James... https://t.co/c0WeEISjuD",
    "128": "@PRISMPodcast1 @calebj15 @OrlandoMagic @franzboogie @NBA_de @umichbball Giddey by chance?",
    "129": "I've watched the last like 3 Orlando magic games and I'd just like what they want in a trade for Markelle.",
    "130": "On the road for one.\n\nGet ready for the @OrlandoMagic's showdown with the Pelicans with Magic LIVE at 7:30pm on Bally Sports Florida! #MagicTogether https://t.co/J64oz8WsQ6",
    "131": "Now they're at magic kingdom \n\nBtw \nThe castle in Paris is way better than the one in Orlando \nDisneyland Paris &gt;&gt;&gt; https://t.co/2ewUBCuUbe",
    "132": "I’m just gonna say. . We should completely skull drag this Orlando Magic team tonight. It’s a back to back, last night we were pitiful. We have to come out pissed off and end this shit violently until the clock hits zero. Someone should have a career game tonight #wbd",
    "133": "@70sOn7 Magic Matt I think it was Candida by Tony Orlando it was too close to Mandira for Barry Manilow Mandy song",
    "134": "@UCFKnights @OrlandoMagic @DavisGB1 @BuffaloBills @UCF_Football Legend 🔥🔥🔥",
    "135": "somewhat related: do the Orlando Magic have a plan or are they just kinda drafting people and \"seeing who they have\" still https://t.co/B4GRPdkg5T",
    "136": "@OrlandoMagic @MattParrino @DavisGB1 @BuffaloBills @UCFKnights @UCF_Football LEGEND!",
    "137": "Still can’t forgive LeBron for not beating the Dwight Howard Orlando Magic in 2009.\n\nWe DESERVED Kobe vs. LeBron in the Finals 🥺",
    "138": "The Orlando Magic are on the road at the New Orleans Pelicans tonight. Take a look at our picks for the game: https://t.co/lHG5tsytT0",
    "139": "@dudemeister_ @YellowLivesMa10 @RealTalk900 Lmao stop it Russell played with the best players, Sam Jones , Bob , Cousy &amp; John Havlicek with 9 other teams in the league😂😂😂. Toronto Raptors,  Vancouver Grizzlies &amp; Orlando Magic was added with Jordan winning. Bill Russell isn't better than Jordan. STOP IGNORANT HATE PLZ!",
    "140": "@B_GetFresh @OrlandoMagic They gonna get washed",
    "141": "@SpoonOfZeke Orlando magic",
    "142": "The @OrlandoMagic come to town to take on the #NewOrleans @PelicansNBA at the @SmoothieKingCtr TONIGHT. Tip off is at 7pm. Will you watch? https://t.co/E8XjnJx5Pc",
    "143": "@OrlandoMagic @DavisGB1 @BuffaloBills @UCFKnights @UCF_Football Gabe, do you know who @Iam1Cent is?\n#PennyFanSince95 https://t.co/n9npn7oMQK",
    "144": "After a close game last night against Phoenix the Magic travel to New Orleans to face the Pelicans. \n\nMarkelle Fultz will not play tonight. \n\n#MagicTogether #OrlandoMagic #NBA https://t.co/fBUqLttraR",
    "145": "🐦Rumours here that Espanyol's owners have an offer on the table for the club.\n\nThe interested party are a group of US investors, amongst whom figure the owner of Orlando Magic. The deal could be worth around €200 million. \n\nOne to watch closely...\n\n#LLL \n🧡🇪🇸⚽ https://t.co/rz2tfLai61",
    "146": "@willbits @w_white18 Come back to Orlando stay for a week, bring siblings, stay on Disney property. Yacht/Beach club is my favorite, cool pool with slide. Disney 2 days at Magic Kindom, the rest are 1 day Epcot, Hollywood, Animal kingdom, Typhoon Lagoon or Blizered beach.",
    "147": "@doug_DaBroke Shit it ain’t even about that, I just vividly remember him playing for St Joes &amp; the Orlando Magic. So for 18-19 years to go by this fast is crazy",
    "148": "@shobasketball @Matt_Barnes22 I met this dude when I worked at Best Buy in Orlando back when he played for the Magic. He came in with his family He was such a cool dude. He took the time to give me an autograph and everything. Happy Birthday dude!",
    "149": "COLE ANTHONY 🔥🔥\n\n🎥: @OrlandoMagic\nhttps://t.co/LkImNzCseq",
    "150": "I’m glad my @OrlandoMagic kept it close and made it a good game 😌👏🏾 https://t.co/bc0qnZh00V",
    "151": "NBA Orlando Magic x Phoenix Suns, #usa #nba #show 🇺🇸🏀🔝✌🏼🙏🏼 em Orlando Magic at Amway Center https://t.co/RaVr95KNwG",
    "152": "@OrlandoMagic @AlexaBliss_WWE @RyanCabrera @WWE hope alexa comes back to raw",
    "153": "@snowleopard405 @OrlandoMagic Maybe if he didnt have covered his shoes in highlighter yellow he might have some traction #findanewslant Everyone else in that play was moving just fine…",
    "154": "@FellaWithACar @OrlandoMagic @AdventHealth @wendellcarter34 I accept your invitation with gratitude",
    "155": "@OrlandoMagic @PDQFreshFood @steelemagic @BallySportsFL @BallyMagic Yes they are 😀👍🏻",
    "156": "@OrlandoMagic @PDQFreshFood @MarkelleF Imagine thinking your winning tonight",
    "157": "@OrlandoMagic @PDQFreshFood @steelemagic @BallySportsFL @BallyMagic The real stars",
    "158": "step-back Kelle https://t.co/IJKZeGqTGi",
    "159": "@youngkogo10 @BenStinar Shows you don't know anything about the Orlando Magic",
    "160": "Who would win in this 3v3? 🤔\n\n#atlantahawks #orlandomagic #nba https://t.co/VW8c6wo3JW",
    "161": "Let’s make some magic ✨\n\n🏀: vs Orlando\n🕖: 7:00pm CT\n📺: @BallySportsNO \n📻: @ESPNRadioNOLA\n\n#Pelicans | @SmoothieKing https://t.co/9Bbb2HnOvV",
    "162": "Orlando Magic vs  New Orleans Pelicans Prediction 3/9/22 -  Free NBA Picks https://t.co/5TkWxkboLK via @YouTube",
    "163": "I spent International Women’s Day with the @OrlandoMagic and it could not have been more perfect! First off… I can NOT get over how incredibly sweet everyone was 🥺❤️\n\nThank you for an awesome time! Go Magic 💙🏀✨ https://t.co/XBIBqsoiW3",
    "164": "@blakegriffin23 @_NFTU @OU_Athletics @blakegriffin23  please be at the Orlando Magic game!!",
    "165": "@FellaWithACar @OrlandoMagic @AdventHealth @wendellcarter34 Nah I live in NJ now. I was born &amp; raised in Palm Bay",
    "166": "The magic has been fueled by a recent Octane install from our partners at Fitness Gallery on Disney’s Campus in Orlando, FL. They added:\n💫LateralX\n💫XT4700\n💫XRide\n💫XT-One\n💫ZeroRunner  \n\nThey will now be able to experience the magic of Octane’s low impact equipment! https://t.co/PfjIUgaK0z",
    "167": "Game 67!⁠\n⁠\n🏀: Magic vs Pelicans\n🕔: 7:30 PM⁠\n📻: FM 96.9 | am740 | 101.1 HD-2⁠\n💻: https://t.co/1R8o1iKZvB\n📱: iHeartRadio App in Orlando https://t.co/QmJDxm0faq",
    "168": "🏀 Orlando Magic (@OrlandoMagic) #MagicTogether \n🆚 New Orleans Pelicans #WBD #ORLvsNOP\n✈️ N664DN | DAL8937 | B752\n🛫 MCO - 11:25 pm ET\n🛬 MSY - 11:55 pm CT\n📡 Tracking: https://t.co/JmrSaI2h9a https://t.co/qa1BJph3sp",
    "169": "🏀 Phoenix Suns (@Suns) #ValleyProud\n🆚 W @ Orlando Magic #MagicTogether #PHXvsORL\n⏭️ Miami Heat #HEATculture #PHXvsMIA\n✈️ N654DL | DAL8939 | B752\n🛫 MCO - 11:20 pm ET\n🛬 MIA - 11:59 pm ET\n📡 Tracking: https://t.co/xG2sIqBfWo https://t.co/AvgU5xik1O",
    "170": "@OrlandoMagic Love my team",
    "171": "@OrlandoMagic Have you given Westbrook a look?",
    "172": "DeAndre Ayton and Landry Shamet scored 21 points each and Mikal Bridges blocked a potential tying 3-pointer in the final seconds to help the Phoenix Suns hold off the Orlando Magic 102-99 Tuesday night.  https://t.co/74C2Dy8Rmt",
    "173": "How about some \"Old School Magic\" @thetournament @zoomthetbt #wednesdaythought #HumpDayVibes #basketball #Magic #sports #Trending @OrlandoMagic #fun #Shaq @NBAonTNT https://t.co/sERH3KO6mg",
    "174": "Consensus Line Move:\n2022-03-09 Orlando Magic at New Orleans Pelicans from 221.50 to 222.50\nOver undervalued\n#NBA #sportsbets #deeplearning #forexlifestyle",
    "175": "\"I did NOT think he had the reach!\" 💪\n\nOrlando Magic's Cole Anthony produced a THUNDEROUS dunk over the Phoenix Sun ⚡ https://t.co/rEZlao8bmW",
    "176": "I don’t think the Magic can go wrong with selecting either Cher Holmgren or Jabari Smith. Hopefully Adam Silver let’s the balls fall where they’re supposed to. Orlando has had quite a bit of *bad luck* recently in the lottery.",
    "177": "8:00pm ET, Wed, Mar 9\n\nOrlando Magic\nNew Orleans Pelicans\n\n📺: Bally Sports NO, \nBally Sports Florida\n\n#LEGENDoftheMiamiHEAT #NBA75",
    "178": "Phoenix Suns vs Orlando Magic Full Game Highlights | March 8 | 2022 NBA Season #Phoenix #Suns #NBA Video: https://t.co/eheCaAeFu1",
    "179": "Omg the Orlando Magic has just made Alexa Bliss their brand new general manager , that was quick, they said for the remainder of the season Ms Bliss will bring in ex WWE wrestlers to play basketball . https://t.co/VOdKqIa009",
    "180": "@OrlandoMagic @franzboogie @NBA_de @umichbball Franz make her dance",
    "181": "@Jyreecefeasts @OrlandoMagic @franzboogie @NBA_de @umichbball You'll know soon enough",
    "182": "Curious to what @OrlandoMagic @MiamiHEAT @MiamiDolphins @ORLPride @OrlandoCitySC @Disney @Jaguars @Publix all say about the Florida bill... \n#SayGay #SayGayAnyway",
    "183": "@OrlandoMagic @franzboogie @NBA_de @umichbball And they'll still rank him 6th in roty standing....",
    "184": "@OrlandoMagic @DavisGB1 @BuffaloBills @UCFKnights @UCF_Football Please get it correct. There is no space between Bills and Mafia.",
    "185": "@OrlandoMagic @AlexaBliss_WWE @RyanCabrera @WWE Bucks are better",
    "186": "@OrlandoMagic What a game.",
    "187": "Markelle Fultz really is one of the most fun watches in the league right now! If the Magic can get one of Jabari/Paolo, it's gonna be not only fun af, but should easily make them a playin team next year.\n\nAny good Magic pods out there btw\n?? #orlandomagic",
    "188": "PHOENIX SUNS 102-99\nORLANDO MAGIC, Final.",
    "189": "The Phoenix Suns hold off the Orlando Magic, 102-99 https://t.co/EagBz82KLl",
    "190": "@DylanFrew6 @IcyScottieV2 Franz is good one though, I'm not going to diss the kid, he was a steal for the Magic but Orlando offense doesn't run through him, his usage isn't close to Cade. I love the Wagner pick though, Magic got a stud with that pick",
    "191": "@OrlandoMagic @AlexaBliss_WWE @RyanCabrera @WWE Why can't every girl be more like Alexa Bliss?",
    "192": "Nfl version of Kyrie traded to the nfl version of the Orlando magic https://t.co/7hbYw5c5n6",
    "193": "@Nicko589 @jqkennedy17 @Robert40523905 @USSConstitution @BrandoIncognito @PapiTrumpo @BOB_V17 @AGoodDa95954430 @q_slavic @RandyRRQuaid @DREAMTEAMLIGHT @DivinityKop @OrlandoMagic @KShady17 @JohnKen19991776 @QuartzRx @monsters_a_gogo @Darthman7000 @Saints @truthERrn @AceBlackwood3 @Godstrojanhorse @JaneProvidence @shinymetashoes @QlationSp3 @stormwarning171 I just woke up, I hope I missed it. I’m not usually emotional but I have been lately. I hope you feel better! ❤️",
    "194": "@_mcflyboi_ @Ian_Zwerling @sportscardsfl @felix_mcfelix @OrlandoMagic I want what your smoking",
    "195": "@OrlandoMagic What is it going to take  for Orlando to be good again but I  know it's going to happen a good player will be signed by another team",
    "196": "We not turning against shit we expect greatness this ain’t the fucking Orlando magic Russ is trash and always will be it’s not our fault he gets paid 40 mill a year and can’t knock a consistent shot of the backboard shit makes no sense https://t.co/69MBvu9Kkt",
    "197": "@MagicVagberg Your 2021-2022 Orlando Magic https://t.co/BdJjThOXmp",
    "198": "Universal 1 day and Volcano Bay: Hi We have a friend going over to Orlando for a week next month, and they only want to do a day at Magic Kingdom (easy enough 1x day ticket from undecovertourist), but… https://t.co/mTE3dQkThP",
    "199": "NBA Basketball Game Betting Picks Simulator: 8:10 PM ET - Orlando Magic vs. New Orleans Pelicans - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/Uj9e1KpNLi #nba #sportsbetting #freepicks #cappertek",
    "200": "@BarstoolBigCat Orlando Magic legend",
    "201": "Phoenix Suns (@Suns) 102 - Orlando Magic (@OrlandoMagic) 99\nRecap : https://t.co/yDinxuFV8W\nBoxscore : https://t.co/vcfE2OeZdz\nPlay-By-Play : https://t.co/1KtBgBxrUb\nhttps://t.co/dxDU8xnWt8",
    "202": "🏀NBA🏀 #NBA \n🏀Saison régulière🏀\n\nCharlotte Hornets - Brooklyn Nets\nIndiana Pacers - Cleveland Cavaliers\nOrlando Magic - Phoenix Suns\nMemphis Grizzlies - New Orleans Pelicans\nOklahoma City Thunder - Milwaukee Bucks\nGolden State Warriors- Los Angeles Clippers",
    "203": "Phoenix Suns vs Orlando Magic Full Game Highlights | March 8 | 2022 NBA ... https://t.co/7xbUEMyBXM @YouTube",
    "204": "On the night of Tuesday to Wednesday, as part of the NBA regular season, the Phoenix Suns returned to success at the Orlando Magic (99-102). Just like the Brooklyn Nets at the Charlotte Hornets (99-102) with 50 points from Kyrie Irving.\n\nGame of the Nigh… https://t.co/AOYjb2KArT",
    "205": "Phoenix Suns vs Orlando Magic - Full Game Highlights | March 8, 2022 | 2... https://t.co/OTj1MIQLXc @YouTube",
    "206": "Nick Wright really said Jokic has better teammates than Luka 😭😭 his second best player is Aaron Gordon. The Orlando Magic could barely win 40 games with Aaron Gordon as their second best player (R)",
    "207": "FREE #livestream here👉https://t.co/2c6Ltz5wlw 😉\n——\nMar.9, Wed.\n🏀#NBA ‼️\n1.Detroit Pistons Vs Chicago Bulls\n2.Charlotte Hornets Vs Boston Celtics\n3. Miami Heat Vs Phoenix Suns\n4.Milwaukee Bucks Vs Atlanta Hawks\n5. New Orleans Pelicans Vs Orlando Magic ... https://t.co/jBuU9O9vVo",
    "208": "@OrlandoMagic The tank rolls on https://t.co/bpPei3yyv4",
    "209": "Orlando Magic (16-50, 15th in the Eastern Conference) vs. New Orleans Pelicans (27-38, 10th in the Western Conference) https://t.co/l3uCabSiHg",
    "210": "Final: Magic 99-102 Suns\n\nTerrific effort last night against the team with the best record in the NBA. Orlando took a 1 point lead with 1:51 remaining but couldn’t close the game out down the stretch.\n\n‘Dell had a big night finishing with 20 points &amp; 12 rebounds.\n\n#MagicTogether https://t.co/xue2z7umTv",
    "211": "@chefstylereacts @OrlandoMagic Thanks for helping the tank 👍🏻 https://t.co/1g9PDifXri",
    "212": "@sportscardsfl @felix_mcfelix @OrlandoMagic Chet https://t.co/XGo0tYaCEW",
    "213": "@OrlandoMagic Gave it your all out there 👍🏻",
    "214": "@CraggsSpeaks @OrlandoMagic Nah… it’s Will Ferrel 👌🏽 https://t.co/K2S8V117oW",
    "215": "@stephie_teach_ @OrlandoMagic That’s Jackie Moon! https://t.co/tAGOqUyEB3",
    "216": "@CraggsSpeaks @OrlandoMagic That’s Will Ferrel right? 😂",
    "217": "Forget Smith, Holmgren and Banchero. This is the pick @OrlandoMagic https://t.co/563olHHbqX",
    "218": "Orlando Magic's weaknesses get highlighted in late game losses – NBA News https://t.co/z4rNRn2AQ3",
    "219": "Phoenix Suns beat Orlando Magic, 102-99! \n\nDeandre Ayton: 21 PTS, 19 REB\nLandry Shamet: 21 PTS, 6 3PT\nCameron Payne: 18 PTS, 12 AST\n\n#phoenixsuns #orlandomagic #nba #colabet https://t.co/vhf2M0kjwK",
    "220": "@DuaneRankin @CamCox12 Wow un-mellow fans jawing with McGee while in Orlando as they beat Magic…..no bueno!",
    "221": "NBA\n\nFT.\n\nCharlotte Hornets 121 - 132 Brooklyn Nets\n\nIndiana pacers 124 - 127 Cavs\n\nOrlando magic 99 - 102 Phoenix Suns\n\nMemphis Grizzlies 132 - 111 New Orleans pelicans\n\nOklahoma city Thunder 115 - 142 Milwaukee Bucks\n\nGolden state warriors 112 - 97 LA Clippers\n#TheGamePlan",
    "222": "Phoenix Suns vs Orlando Magic Full Game Replay 2022 Mar 08 NBA Replay HD\nhttps://t.co/so6nsFDHha https://t.co/9AzH2wUkRr",
    "223": "@ORLPride @OrlandoMagic Is there a reason Kaylie Collins has been left off the active roster despite being signed to a two year contract????",
    "224": "Tuesday Recap\n\n✅CJ McCollum  o23.5 points \n✅Nicolas Batum o3.5 rebounds \n✅Cleveland Cavaliers 1Q -0.5\n✅Brooklyn Nets ML\n✅Pacers/Cavs o223.5\n✅Orlando Magic +6\n🗑 Mikal Bridges o17.5 points \n🗑Warriors/Clippers o223.5\n🗑PJ Washington o1.5 3PM \n\n+2 units! We will take it 💰💰",
    "225": "@OrlandoMagic @MarkelleF good",
    "226": "@OrlandoMagic @thats_G_ Gary what’s up",
    "227": "Damn.. Portland need to give us Dame. if Russ can make Orlando Magic a playoff team, he can make Trail Blazers a playoff team https://t.co/HKd2nkdhGO",
    "228": "#DeAndreAyton and #LandryShamet scored 21 points each and #MikaelBridges blocked a potential tying 3-pointer in the final seconds to help the Phoenix #Suns hold off the Orlando Magic 102-99 Tuesday night.  #NBATwitter #NBA  https://t.co/0KSNPV1fH9",
    "229": "@OrlandoMagic @thats_G_ hi Gary",
    "230": "Phoenix Suns beat Orlando Magic, 102-99! \n\nDeandre Ayton: 21 PTS, 19 REB\nLandry Shamet: 21 PTS, 6 3PT\nCameron Payne: 18 PTS, 12 AST\n\n#phoenixsuns #orlandomagic #nba https://t.co/BqTi4NaFDk",
    "231": "@TheFullTimeDad @FullTimeHoops1 No doubt true and I agree but it does seem like the Top team gets to play the  Lakers and the B team is playing the Orlando Magic.",
    "232": "The Magic lost by 3 tonight. Cole Anthony was -13 and Markelle Fultz was +9. So why didn't Fultz play in crunchtime since it was tied w/ 2 mins left and Anthony isn't a real PG? I don't know! I guess Orlando was stealth tanking? They play way better w/ Fultz it seems like",
    "233": "Happy birthday to Kenny the jet smith of the Houston Rockets #kennythejetsmith #kennythejet #sacramentokings #atlantahawks #houstonrockets #detroitpistons #orlandomagic #denvernuggets https://t.co/znXJPNnGgP",
    "234": "@OrlandoMagic @MarkelleF So good",
    "235": "The Phoenix Suns fend off a gutsy Orlando Magic comeback! \n\n📷 Phoenix Suns\n\n#NBA75 #AlwaysAFan https://t.co/VTCuyT0e70",
    "236": "The Phoenix Suns Beat The Orlando Magic. 102 - 99 Today!! 💜🧡💜🧡.",
    "237": "The Phoenix Suns Beat The Orlando Magic. 102 - 99 Today!! 💜🧡💜🧡",
    "238": "@OrlandoMagic so you stole the sun's uniforms?",
    "239": "@OrlandoMagic @AlexaBliss_WWE @RyanCabrera @WWE Awesome, enjoy the game!!🤘🏀",
    "240": "@OrlandoMagic But hopefully he figures it all out the future is bright.",
    "241": "@OrlandoMagic Markelle needs to start over cole sorry. Franz needs the ball more even though he seem a little out of it at first.. Wendell y’all better not trade him for nothing my first game live and he wants all the smoke lol trust that man!! Mo I’m not understanding why he gets lost so much",
    "242": "@KyleBenzion @OrlandoMagic Huge",
    "243": "Cole Anthony's layup with 3:25 left pulled Orlando even, and Carter's two free throws with 1:51 remaining gave the Magic their only lead of the second half. https://t.co/E7wEfvDm96",
    "244": "My wife said I need to be making MO money if I’m gonna keep losing on Orlando Magic player props https://t.co/w5XzsGtxYg",
    "245": "@adaniels33 Pray for the Orlando Magic.",
    "246": "Deandre Ayton posted his 20th double-double of the season and Cameron Payne had 18 points and 12 assists as the Phoenix Suns rallied late for a 102-99 win over the host Orlando Magic on Tuesday night. https://t.co/PmuuXnbVrY",
    "247": "The Phoenix Suns defeated the Orlando Magic | Score: 102-99 #powcast #nba #suns #magic https://t.co/cPWIMNYrxN",
    "248": "@OrlandoMagic been ass for years 🤦🏿‍♂️😂 https://t.co/jeI5EBYWRg",
    "249": "Deandre Ayton's 21 points and 19 rebounds power the Phoenix Suns to a win over the Orlando Magic!\n\nhttps://t.co/km5XS3OGN6",
    "250": "DeAndre Ayton came up with two clutch hits in the endgame as Phoenix Suns escaped with a 102-99 win over Orlando Magic in the 2021-2022 NBA Season on Tuesday at the Amway Center in Orlando, Florida.\nhttps://t.co/qWRIJmMXVh\n#FastBreakNews\n#NBA",
    "251": "Encerrado:\n\nOrlando Magic (16-50) 99 x 102 (52-13) Phoenix Suns\n\nPHX 📊\nDeandre Ayton: 21PTS/19REB/1AST\nLandry Shamet: 21PTS/3REB/2AST\n\nORL 📊\nWendell Carter Jr: 20PTS/12REB/1BLK\nMo Wagner: 12PTS/7REB/1BLK\n\n#NBA https://t.co/18X8toitDS",
    "252": "@OrlandoMagic @DavisGB1 @BuffaloBills @UCFKnights @UCF_Football Delete this",
    "253": "2022-2023 Orlando Magic season ticket holder 👀👀👀  #niveles",
    "254": "@abigaildisney Thank you for showing her doesn't speak for all Disneys. I lived in Orlando while my kids were little. They were raised in Disney magic. I want to be proud of that.",
    "255": "Landry Shamet (21 PTS) Drains a Season-High in Points and Threes vs. the Orlando magic #Phoenix #Suns #NBA Video: https://t.co/fXUovbt6Cj",
    "256": "Orlando Magic might be good in a few seasons.",
    "257": "Also my comment on instagram getting pinned by Orlando Magic! 🔥\nWonderful present for my birthday \nGo Magic 💙🤍💫 @OrlandoMagic #MagicTogether https://t.co/DCvFiDPuKg",
    "258": "Here is today’s (3/8) postgame media session with @OrlandoMagic guard @MarkelleF:\n\n#MagicTogether\n\nhttps://t.co/O00xKUCuw5",
    "259": "Here is today’s (3/8) postgame media session with @OrlandoMagic F/C @wendellcarter34:\n\n#MagicTogether \n\nhttps://t.co/0HZ9DfXh02",
    "260": "Here is today’s (3/8) postgame media session with @OrlandoMagic Head Coach Jamahl Mosley:\n\n#MagicTogether \n\nhttps://t.co/AGZoLEcMyf",
    "261": "@OrlandoMagic @DavisGB1 @BuffaloBills @UCFKnights @UCF_Football Best WR from the playoffs",
    "262": "Despite Late Rally, Magic Come Up Short Against Suns ' Orlando Magic – NBA News https://t.co/IOoErLiUtF",
    "263": "With that loss I think the Orlando Magic are the first team to be eliminated from playoff contention #PHXvsORL",
    "264": "Orlando magic really jus one day woke up and chose new colors",
    "265": "@OrlandoMagic @DavisGB1 @BuffaloBills @UCFKnights @UCF_Football Ayyy go bills!",
    "266": "@hazelboy_16 @micah_neeley03 @OrlandoMagic @Ticketmaster @The_ColeAnthony It was close",
    "267": "ORLANDO, Fla. (AP) — DeAndre Ayton and Landry Shamet scored 21 points each and Mikal Bridges blocked a potential tying 3-pointer in the final seconds to help the Phoenix Suns hold off the Orlando Magic 102-99 Tuesday night. https://t.co/GjvlFRr3cg",
    "268": "@JKepnerWFTV @OrlandoMagic JOE - I LOVE YA MAN !!! KEEP UP YOUR  G R E A T  WORK ! YOU DESERVE MORE AIR TIME !",
    "269": "i've said this multiple times but i'll say in more depth before i sound like a broken record. the shot distribution and delegation of offensive responsibility within the orlando magic is PATHETIC. WCJ has blossomed into a 20/10 threat every night and Franz for the last 20 games",
    "270": "@OrlandoMagic @AdventHealth @wendellcarter34 Did we win? We’re literally a poverty franchise right now. https://t.co/S1VfcdBm9M",
    "271": "@OrlandoMagic @AdventHealth @wendellcarter34 this is an every game thing",
    "272": "Orlando Magic 99 (Wendell Carter 20 pts, 12 rebs) Phoenix Suns 102 (DeAndre Ayton 21 pts, 19 rebs, Cameron Payne 18 pts, 12 asists), Memphis Grizzlies 132 (Ja Morant 24 pts) New Orleans Pelicans 111 (C.J. McCollum 32 pts, 11 asists)",
    "273": "@_mcflyboi_ @OrlandoMagic Trade Suggs?????? https://t.co/qxRouFnwIP",
    "274": "@OrlandoMagic @DavisGB1 @BuffaloBills @UCFKnights @UCF_Football RESPECT bra",
    "275": "@az2au @Suns @OrlandoMagic @ScottG247 Hey hey hey, that’s where I was born. Be nice 😂😂😂😂",
    "276": "Today's Orlando magic game recap 7-39 3 pointers and only 17 assists , spells doom for the magic. Under 18% from 3s. https://t.co/efWKcPzB9X",
    "277": "After being in Orlando for almost 4 years, tonight I was finally a Magic fan",
    "278": "Deandre Ayton helps Suns outlast pesky Magic  #NBA\n #OrlandoMagic #PureMagic #Suns #WeArePHX https://t.co/D7mHvREJG8",
    "279": "As a @Suns fan…for the love of God the @OrlandoMagic need to bring these back. Home and away versions. All the time. #Throwback https://t.co/xkTEZiQ4rW",
    "280": "@JKepnerWFTV @OrlandoMagic not a good record to have",
    "281": "Orlando magic legend and possible thread Candidate 👀👀 https://t.co/6kKt4pMueG",
    "282": "#OrlandoMagic - #PhoenixSuns 99:102\n#NBA\n🇺🇸🏀🇺🇸🏀🇺🇸🏀\n\nMore info: https://t.co/uHfuhN7vfN https://t.co/LG9vkyUbjz",
    "283": "@SuccWebsite @VitorHu37689587 @18kylebuschfan2 @OrlandoMagic why you so mad 💀💀💀",
    "284": "#NBA 🏀 \n1-0 (+0.90 units) \n\n• Orlando Magic +7.5 ✅✅\n\nBeat the market, cash the ticket. \n\nLet’s do it all again 🍷",
    "285": "NBA @Suns at @OrlandoMagic, Tuesday, March 8, 2022 @NBA @NBAstats #gamecharts #dataviz #nft https://t.co/unDsRJMBsR",
    "286": "@JEichenblatt @OrlandoMagic Big, BIG day.",
    "287": "The Phoenix Suns defeat the Orlando Magic 102-99.\n\n#phoenix #orlandomagic #magictogether #devinbooker #arizona #nba #phoenixsuns #basketball #trending #orlando https://t.co/SBTLAZpObg",
    "288": "@SadMagicFan1996 @OrlandoMagic Idk what is with this team and not giving franz the ball, I’m so sick of watching chuma and cole brick 50 shots a game",
    "289": "@OrlandoMagic Almost",
    "290": "Our Magic Player History mover of the night for the Suns game is Wendell Carter Jr in rebounds.\n\n@wendellcarter34 had another double double tonight, and his 12 rebounds moved him past the Polish hammer @MGortat on the @OrlandoMagic all time rebounds list.\n\n#MagicTogether https://t.co/5hQuTXJSg7",
    "291": "@felix_mcfelix @OrlandoMagic in 2022 we’re not talking bout the past your team is still 16-50. must be hard for you to realize that your team sucks this year so you need to bring up the past 😭",
    "292": "@BiggWest_ @MagicGaming @NoKappx @OrlandoMagic @AmwayCenter @May__GT @JonahEdwards_ @BigMFReign @uncool_matty Bigg West!",
    "293": "@OrlandoMagic fultz making a comeback soon tho love 2 see it",
    "294": "@18kylebuschfan2 @OrlandoMagic you commented this shit like 5 times cry harder lil bro",
    "295": "@OrlandoMagic ORLANDO TRAGIC 😂😂😂😂",
    "296": "@Gaming_Jew03 @OrlandoMagic They only let franz shoot 8 times",
    "297": "@DonnyTt2 @Ian_Zwerling @sportscardsfl @felix_mcfelix @OrlandoMagic Why second round?? He should go over Chet because since he's better.",
    "298": "@kbyefornowangel @OrlandoMagic We were in the playoffs 2 years ago 🤣. You didn't make the playoffs for 11 years until you had to get CP3 to help you make the playoffs and still choke a 2-0 lead in the finals https://t.co/Te9YfXFDho",
    "299": "A win is a win, a loss is a win and a competitive loss is a major win! \n\nOn to New Orleans we go!\n\n#MagicTogether #OrlandoMagic #NBA https://t.co/zO4tUzgN7y",
    "300": "I guess Disney’s Magic doesn’t work here🤷🏻‍♀️ @Suns @OrlandoMagic https://t.co/UMfrtRNaE0",
    "301": "@OrlandoMagic @AlexaBliss_WWE @RyanCabrera @WWE Alexa Bliss is the G.O.A.T.",
    "302": "50th loss of the season for the @OrlandoMagic. \n\nIt's the 11th time in franchise history (33 seasons) the Magic have lost 50+ games.",
    "303": "@felix_mcfelix @OrlandoMagic atleast we can make the playoffs unlike y’all who probably won’t be able to make it for the next decade",
    "304": "@kbyefornowangel @KnightFanAdam @OrlandoMagic Magic got no rings\n\nSUNS GOT NO RINGS 🤣 https://t.co/ZMUria2Cr8",
    "305": "This is a serious beatdown the @memgrizz are giving to my @PelicansNBA clearly they missing @B_Ingram13 tonight but no excuses they just didn't come ready to play we gotta put this one behind us and get ready for @OrlandoMagic tomorrow at the blender \"PLEASE\" show up #WBD",
    "306": "I love my new Orlando Magic hat and Tracy McGrady shirt 🤩 https://t.co/hPhIRVj2hl",
    "307": "@kbyefornowangel @OrlandoMagic The suns were just as shitty as the magic until the bubble 🤣. Also, its funny when both franchises have no rings.",
    "308": "@_mcflyboi_ @Ian_Zwerling @sportscardsfl @felix_mcfelix @OrlandoMagic Yeah In the second round",
    "309": "@OrlandoMagic Forreal tho, Cheers Magic Fans, i wish you well in your tanking. Happy to see Fultz make a comeback 👍 https://t.co/lJgFq60Ifp",
    "310": "@KnightFanAdam @felix_mcfelix @OrlandoMagic poverty franchise of yours",
    "311": "@ORLPride @OrlandoMagic That so awesone!!!",
    "312": "@Paschanimal1 @ESPNNBA Beating the Orlando Magic by 1 isn't killing.",
    "313": "@MarchMadnessMBB @jameernelson @DelawareMBB @UDBlueHens Love jameer @OrlandoMagic bring home back",
    "314": "@18kylebuschfan2 @kanyebetter11 @OrlandoMagic Im a Magic fan but damn they rent free on yo head💀",
    "315": "@kbyefornowangel @felix_mcfelix @OrlandoMagic Excuses. Poverty",
    "316": "Final: Phoenix 102, Orlando 99. \n\nMagic fall to Suns as R.J. Hampton takes on higher-profile assignments with Jalen Suggs out: https://t.co/VMxcFsKWU3",
    "317": "@18kylebuschfan2 @kanyebetter11 @OrlandoMagic Yeah I'd pick Drew Timme.",
    "318": "@EliteAnthonySZN @kanyebetter11 @OrlandoMagic To get Drew Timme.",
    "319": "@felix_mcfelix @OrlandoMagic yep yep we making the playoffs unlike y’all who suck. If we had everyone y’all would’ve lost by 30 like last time.",
    "320": "@OrlandoMagic @DavisGB1 @BuffaloBills @UCFKnights @UCF_Football I see what you did there @_tonyhuynh 😏",
    "321": "@Ian_Zwerling @sportscardsfl @felix_mcfelix @OrlandoMagic If I were the front office I would take Drew Timme.",
    "322": "@kbyefornowangel @OrlandoMagic I wonder how tf you gonna beat the heat tommorow. Suns are frauds 🤣, barely winning by 3 to the magic https://t.co/HNZ6lBMBdH",
    "323": "@EliteAnthonySZN @sportscardsfl @felix_mcfelix @OrlandoMagic No I want Drew Timme.",
    "324": "@OrlandoMagic Cole Anthony is not your PG of the future. It’s Markelle Fultz.",
    "325": "🔥💰RECAP💰🔥\n\n🔥Win🔥\n\n+$780.73\n\nID: 89696423\n1. Cleveland Cavaliers @ Indiana Pacers\n\nCleveland Cavaliers -2.5\n\n2. Phoenix Suns @ Orlando Magic\n\nOrlando Magic +6.0 https://t.co/yA2eXP5rFP",
    "326": "@sportscardsfl @felix_mcfelix @OrlandoMagic Drew Timme.",
    "327": "🤖 #SofiAlert \n📅 08-03-2022 \nPhoenix Suns - Orlando Magic \n🛋 3.3/5 Sofis https://t.co/YkeAAjvY8k",
    "328": "@OrlandoMagic It's good for a tanking team. But in the offseason trade Ross and Suggs for future talent and build around Fultz, Cole, and Wagner.",
    "329": "FINAL: Suns 102, #Magic 99\n\nOrlando drops their 50th game of the season.",
    "330": "@kbyefornowangel @OrlandoMagic No excuse to lose to a team like the magic anyways. You guys are finals contenders right?",
    "331": "@OrlandoMagic @DavisGB1 @BuffaloBills @UCFKnights @UCF_Football Give this man a 🔑 to the city",
    "332": "@kbyefornowangel @OrlandoMagic Are you fucking kidding me. The magic are the most injured team in the league",
    "333": "Deandre Ayton's 21 and 19 power the Phoenix Suns to a win over the Orlando Magic https://t.co/pzkUGJTnCa",
    "334": "@kanyebetter11 @OrlandoMagic thanks for beating us!",
    "335": "Nice try @OrlandoMagic",
    "336": "@BallyMagic @OrlandoMagic Anthony a ball hog. Had the worst plus menus of all team",
    "337": "@Ian_Zwerling @OrlandoMagic Thx for helping us get a good draft pick",
    "338": "@omarcastle20 @OrlandoMagic Ratio",
    "339": "@18kylebuschfan2 @lilshrimpy8inch @OrlandoMagic Fuck tanking lol, i promise you none of us really enjoy it",
    "340": "My boy cousin is a die hard Magic fan (we’re from Florida and he still lives in my hometown) and nothing beats going toe to toe with him in these @Suns vs @OrlandoMagic games. Our trash talk is second to none. Hell, that’s where I learned it from 😏. Love you Potty @ScottG247",
    "341": "@ademir415 @OrlandoMagic Thx for helping us get a good draft pick",
    "342": "@OrlandoMagic Wendell carter tonight https://t.co/mu7gcw9DHL",
    "343": "@OrlandoMagic @BillsMafiaBabes @DavisGB1 @BuffaloBills @UCFKnights @UCF_Football My guy! GD will stunt on all them hoes! @NFL",
    "344": "@OrlandoMagic Y’all should tweet the video anyways. Ggs 💙",
    "345": "@magicscotti @lilshrimpy8inch @OrlandoMagic Worth it for the draft pick tho maybe thats why hes happy",
    "346": "@OrlandoMagic Pathetic way to end the game. Let’s beat the pels",
    "347": "Moritz Wagner - Orlando Magic\n12 PTS\n7 RBD\n1 BK\n2 TO\n[FD(21.4) DK(22.75)]",
    "348": "Markelle Fultz - Orlando Magic\n11 PTS\n3 RBD\n4 AST\n1 STL\n2 TO\n[FD(21.6) DK(21.75)]",
    "349": "Wendell Carter Jr. - Orlando Magic\n20 PTS\n12 RBD\n1 BK\n1 TO\n[FD(36.4) DK(38.5)]",
    "350": "@kbyefornowangel @OrlandoMagic I think we know. But the real queetion is how did a 52-13 suns team almost lose to a trash team? 🤣",
    "351": "Orlando Magic: https://t.co/TXf2ybGaAC",
    "352": "@dysothy @OrlandoMagic Thanks for the tank contribution lfg good draft pick thx to you",
    "353": "@OrlandoMagic I’m proud of this team and this game!",
    "354": "@felix_mcfelix @OrlandoMagic Who are they tanking to get?",
    "355": "There’s the Warden @OrlandoMagic 😎 https://t.co/JWd5k1OGMC",
    "356": "The @OrlandoMagic come up short against the Suns.\n\nPostgame coverage and reaction is coming your way on Bally Sports Florida. #MagicTogether https://t.co/aMmz00nzFa",
    "357": "The @OrlandoMagic come up short against the Suns.\n\nPostgame coverage and reaction is coming your way on Bally Sports Florida. #MagicTogether https://t.co/cutMQw0FsB",
    "358": "The Orlando magic wearing orange will never sit right with me",
    "359": "Good try @OrlandoMagic",
    "360": "@OrlandoMagic Win or lose. Cole Anthony shouldn't be the starter",
    "361": "@OrlandoMagic We gave em a fight, the best team in the league and we were close as hell I’m saying this is an L on the scoreboard but a victory for our hearts and minds + the future. 💫 💙",
    "362": "@OrlandoMagic Good fight lfg get us to the next game asap",
    "363": "@OrlandoMagic We really choked smh",
    "364": "@OrlandoMagic Can’t win too many down the stretch. We move https://t.co/jO1YRYNHHt",
    "365": "🏀 Final Score 🏀\nPhoenix Suns 102 - 99 Orlando Magic\n\nCameron Payne 50.0 DK, 48.2 FD\nDeandre Ayton 46.3 DK, 42.3 FD\nWendell Carter Jr. 38.5 DK, 36.4 FD\n\nhttps://t.co/IIuYCTQkL5",
    "366": "@OrlandoMagic Why did we foul, stupid move",
    "367": "@OrlandoMagic Why the hell Anthony always has to play that hero ball guy at the end. Smh. Should've kept fultz in.",
    "368": "Life tip : dont bet hard esrned money on the Orlando Magic",
    "369": "Phoenix escapes the Orlando with a 102-99 victory over a very game Magic squad. Bridges with a potential game-saving block to seal it.",
    "370": "Ain’t no fucking Magic in Orlando",
    "371": "final 💔 https://t.co/Pgsfahx7jE",
    "372": "@OrlandoMagic Someone teach Cole how to shoot",
    "373": "@Bolts_szn02 How do we feel about the new coach? The team seems like they play hard, easy to root for, good foundation. What are our hashtags? #gomagic #orlandomagic #magic ???",
    "374": "#Orlando Magic - Phoenix Suns ★ #Partido finalizado: 99 - 102 ★ by #SofaScore",
    "375": "Foul. I hate it but do it. Don't let them get a shot up. \n\nThese are the tactics that need deployed against the Orlando Magic. \n\n🙃",
    "376": "@OrlandoMagic yoo draft pick lfg",
    "377": "@OrlandoMagic We lost",
    "378": "@OrlandoMagic Lmao",
    "379": "Phoenix leads 102-99 with 6.9 seconds left. \nOur ball. https://t.co/kZawQUSquw",
    "380": "Yeah Stan Van Gundy messed up the Orlando Magic finals by starting him over Skip to My Lou https://t.co/5faWwyAfeA https://t.co/7Nb7cZiKVH",
    "381": ".@OrlandoMagic F/C @wendellcarter34 has scored 20 points tonight vs. Phoenix.\n\nCarter Jr. has now scored 20+ points 10 this season.\n\n#MagicTogether",
    "382": "@OrlandoMagic not gonna do anything with it💀💀",
    "383": "@OrlandoMagic Insane that Franz ain’t getting the ball man.",
    "384": "@OrlandoMagic BRO GET THE DRAFT PICK.",
    "385": "@OrlandoMagic WHY DID COLE HOLD THE BALL",
    "386": "Phoenix leads 100-97 with 12.7 seconds left. \nOur ball. https://t.co/jJPmDZhhiz",
    "387": "Check the Orlando magic Phoenix suns score real quick",
    "388": "Come on @OrlandoMagic let's pull off the upset!",
    "389": "Lights going out, mikal slips on wet spot, cam slips… fix your damn court @OrlandoMagic",
    "390": "Is it me or does the @OrlandoMagic colors and Logo tonight look like a rip off of the @Suns?! I guess if you can't be great, rip off those that are great.🤣😂🤣 Yeah I said it!! @OrlandoMagic so lacking a true identity. https://t.co/cNEtyFRBoF",
    "391": "Been coming to @OrlandoMagic games since 92 when I was 2 years old. It took 30 years but it finally happened. I CAUGHT A TSHIRT https://t.co/7cI0SWkk0c",
    "392": "@OrlandoMagic @The_ColeAnthony The Huh?",
    "393": "@ZAYYYTHEGOAT 11 at end of first\nPlayed 3 mins in the second \n18 at end of third \nPlayed 4 mins in the most important qtr \n\nFire your shit coach @OrlandoMagic",
    "394": ".@The_ColeAnthony for the tie ‼️\n\n93-93 with 3:10 left\n\n📺: https://t.co/JXrb594IOi https://t.co/aEBIIQvW5b",
    "395": "Timeout with 3:25 to play, Suns and Magic tied 93-93.\n\nCole Anthony starting to take over. He left earlier with an injury but is clearly back and making an impact. Orlando just won’t let Phoenix rest.",
    "396": "the orlando magic experience is something else man i’ll tell ya https://t.co/pwnEkU0ZXH",
    "397": "Cole Anthony's scored the Magic's last 5 points and Magic-Suns is tied at 93 with 3:25 remaining.\n\nOrlando's on a 9-0 run.",
    "398": "@OrlandoMagic  I love the energy of Suggs in street clothes cheering his team on!!!  Let’s go Magic!!",
    "399": "Cole Anthony knocks down a triple, followed by a layin to tie the game.\n\n@OrlandoMagic 93, @Suns 93 with 3:25 left in the 4th.",
    "400": "With a due respect, we cannot lose to the Orlando Magic bro",
    "401": "Typical - shitty court, shitty staff, shitty organization. Nothings changed @OrlandoMagic @NEVINWILSON https://t.co/T3TrL2ZgZn",
    "402": "@Jokeeee_ @OrlandoMagic Keep Tweeting Joke they through him in for us lmao!",
    "403": "@Jokeeee_ @OrlandoMagic Tanking is real",
    "404": "ORL vs PHX #NBA #OrlandoMagic #PhoenixSuns #MagicTogether https://t.co/VcEvAInc4v",
    "405": "Dear Magic Twitter, sorry I’ve been away most of the season, I’ve been swept up in #auburn basketball, but I am here now and totally invested in the youth movement. With any luck we will soon add Jabari Smith to the mix. Anyways, go magic, quick season summary?! #orlandomagic",
    "406": "@Jokeeee_ @OrlandoMagic Because Hans and Franz 😜 https://t.co/yjuUwdrbA4",
    "407": "@2ShortJess @bryanalvarez Yes they do. Like when the Lakers are in the NBA finals that’s exactly what the networks want. They don’t want the Oklahoma City thunder playing the Orlando Magic",
    "408": "Orlando’s been in the bonus since the 8:45 mark in the 4th quarter, and is having a lot of success driving to the rim \n\n..yet there’s been several three-point attempts down the stretch here when Orlando is 6 of 36 from three on the night.\n\nMagic down 93-86 with 4:56 left.",
    "409": "18/12 for Wendell… 4:50 in the 4th and he still hasn’t played in the 4th \n\nYour coach sucks @OrlandoMagic",
    "410": "Three-point shooting tonight:\n\nLandry Shamet: 6-for-9\n\nOrlando Magic: 6-for-36",
    "411": "@MagicGaming @OrlandoMagic @AmwayCenter @Snubby21 @May__GT @JonahEdwards_ @BigMFReign @NoKappx @uncool_matty Potts Jackson and crew looking splendid https://t.co/GbULtFq8yq",
    "412": "@bhop2112 @OrlandoMagic @SHAQ would help",
    "413": "@OrlandoMagic LOSE THE GAME WE WANT A GOOD PICK..",
    "414": "Payne and Shamet are 9 of 13 from three so far tonight, just killing every Orlando comeback. \n\nThe Magic are 6 of 34 as a team. \n\nSuns lead 90-84, 6:39 left in the 4th quarter.",
    "415": "I’m not taking a knee motion that almost always ends in something tearing lightly. That’s very embarrassing at a professional level @nba @OrlandoMagic",
    "416": "ALERT: New high roller bet posted!\nA bet has been placed for $7,768.41 on Orlando Magic - Phoenix Suns to win $11,421.78.\nTo view this bet or copy it https://t.co/OQvW8vHieL https://t.co/kKJU39eG2u",
    "417": "@OrlandoMagic your floor staff needa get off the crack",
    "418": "@OrlandoMagic FIRE ALL YOUR FLOOR WIPERS NOW",
    "419": "🚨🚨🚨LESS THAN 48 HOURS REMAINS!!!!🚨🚨🚨\n\nCheck out ORLANDO MAGIC 2020-21/2021-22 Basketball 8 Box Case Break Mixer Immac #NBA https://t.co/dPRbT8et2w via @eBay",
    "420": "Timeout with 8:31 to play, Suns lead the Magic 85-82.\n\nOrlando trying to steal this one. They’re winning in the fourth 11-6 by way of 7-9 FTs.",
    "421": "@OrlandoMagic  clean the the fucken floors fucken dumb fucks !!!! My boy Mikal hurt now 🤦🏻‍♂️🤦🏻‍♂️🤦🏻‍♂️",
    "422": "Why fultz not get his position back yet what’s the hold up @OrlandoMagic",
    "423": "CLEAN THE FLOOR MAN @OrlandoMagic",
    "424": "#NBA75 | Final 3C ⏱️\n\n🏀 @Suns 79-71 @OrlandoMagic\n\n▶️ #TemporadaRegular\n\n👨🏻‍💻 @CristianHB77 https://t.co/tI4i7UxM7a",
    "425": "@SB4xJG4 @IcyScottieV2 @BammyBurner I wasn't saying big market I was saying popularity...all of those places are more popular to think about than the magic and that's from someone who lives 1 hr from orlando",
    "426": "Game night ⛹️‍♂️\n\n@OrlandoMagic | @AmwayCenter https://t.co/6myOefFQhN",
    "427": "Headband Cole for ✌️\n\n📺: https://t.co/JXrb594IOi https://t.co/IL91PCBebV",
    "428": "@br_orlandomagic playing your ♥️♥️ out https://t.co/PkHqf6zznf",
    "429": "These @OrlandoMagic jerseys are Fugly",
    "430": "@hazelboy_16 @OrlandoMagic @Ticketmaster @The_ColeAnthony how bad is his injury?",
    "431": "Get a summary of the Phoenix Suns vs. Orlando Magic basketball game https://t.co/9AZY5svkki\nvia @ESPN App https://t.co/7qDsOY8zID",
    "432": "@OrlandoMagic @wendellcarter34 Here's some advice: Trade Ross and Suggs for future talent and build around Fultz, Cole, Wagner.",
    "433": "@OrlandoMagic @SASsoftware Magic are better without cole Anthony as a starter",
    "434": "@OrlandoMagic @SASsoftware WTF WE NEED THE DRAFT PICK",
    "435": "@OrlandoMagic @Ticketmaster @The_ColeAnthony All of a sudden cole Anthony gets hurt and the team plays better.",
    "436": "Wendell Carter Jr. through three quarters:\n\n18 PTS \n12 REB\n8-13 FG\n\nIt marks his seventh straight double-double 👏\n\n@SASsoftware x #MagicTogether https://t.co/Avd4nzvea0",
    "437": "End of 3Q: Suns 79, Magic 71.\n\nWendell Carter Jr.’s leading Orlando with 18 points and 12 rebounds. Markelle Fultz has 10 points, 4 assists and 3 rebounds in 16 minutes. \n\nPhoenix, led by Deandre Ayton (17 points and 14 rebounds) has five players in double figures.",
    "438": "Last week I was in Orlando and heard about the \"magic\" of Disney and was intrigued to go for my first time, but now I say #boycottdisney and Gay Gay Gay.",
    "439": "Dell on both ends 😤\n\n📺: https://t.co/JXrb594IOi | @wendellcarter34 https://t.co/RLLEPaALn8",
    "440": "@OrlandoMagic @DavisGB1 @BuffaloBills @UCFKnights @UCF_Football Win pls",
    "441": "@IcyScottieV2 @gourfish @BammyBurner I think he means by \"media attention\" Orlando isn't much different from those three I just mentioned, out of all 4 Cleveland has gotten the most media attention, but I don't think Franz should be top 3 ROTY bcuz of he's on the Orlando magic, then what about Cade then?",
    "442": "ALERT: New high roller bet posted!\nA bet has been placed for $20,000.00 on Orlando Magic - Phoenix Suns to win $36,000.00.\nTo view this bet or copy it https://t.co/xwtYnJ2gcV https://t.co/V2yTpfecTt",
    "443": "ALERT: New high roller bet posted!\nA bet has been placed for $5,001.31 on Orlando Magic - Phoenix Suns to win $9,002.36.\nTo view this bet or copy it https://t.co/C0pdROo23h https://t.co/ZDrpB7U6c1",
    "444": "@orlandoupnext @OrlandoMagic @DavisGB1 @BuffaloBills @UCFKnights @UCF_Football I’ll raise you, in that he’s a Sanford Bokey boy",
    "445": "@OrlandoMagic It’s a shame we can’t tell the difference in these logos. Bring back the blue and white!",
    "446": ".@AlexaBliss_WWE &amp; @RyanCabrera in the house 🪄\n\n@WWE x #MagicTogether https://t.co/StBnYAiOdo",
    "447": "1st time back at a Magic game since Shaq and Penny left town. We sure could use them right now… @jennifer_ivory @orlandomagic @ Orlando Magic at Amway Center https://t.co/4PduzMI5bc",
    "448": "@SB4xJG4 @IcyScottieV2 @BammyBurner only cuz wagners on the magic..if wagner was doing this typa shit on a big market or even a team not named Orlando Magic he would be way more popular than scottie",
    "449": "🚨 UPDATE: Wendell Carter Jr. - Orlando Magic has a Double Double\n3:54 3rd\n16 PTS\n10 RBD\n[FD(27) DK(30)]",
    "450": "@lil_dingle28 @OrlandoMagic @DevinBook And proceeded to ask why everyone was wearing his jersey😂🤦🏻‍♀️",
    "451": "@18kylebuschfan2 @OrlandoMagic Win the game for the pistons*",
    "452": "At the @OrlandoMagic game and one of the magic fans just asked who @DevinBook is 💀💀.",
    "453": ".@OrlandoMagic F/C @wendellcarter34 has tallied 16 points and 10 rebounds tonight vs. Phoenix (4:35, 3rd quarter).\n\nCarter Jr. has now recorded seven straight double-doubles and a team-high 29 this season.\n\n#MagicTogether",
    "454": "NBA Reminder : Cole Anthony is TRASH #NBA #DFS #OrlandoMagic",
    "455": "smooth operator @MarkelleF \n\n📺: https://t.co/JXrb594IOi https://t.co/Ru9qtjhwQL",
    "456": "@OrlandoMagic LOSE THE GAME WE NEED THAT DRAFT PICK",
    "457": "Never bet on @OrlandoMagic.",
    "458": "@FinsUp024 @OrlandoMagic @DavisGB1 @BuffaloBills @UCFKnights @UCF_Football Gabriel davis gets a pass",
    "459": "@OrlandoMagic Our logo and the suns got me confused 😕",
    "460": "@OrlandoMagic @DavisGB1 @BuffaloBills @UCFKnights @UCF_Football Orlando’s hometown team https://t.co/AQW83T791Q",
    "461": "The uniforms for the @Suns and @OrlandoMagic are so confusing",
    "462": "@OrlandoMagic @DavisGB1 @BuffaloBills @UCFKnights @UCF_Football pls sign my jersey 😭 just a UCF student who’s from Buffalo, who wants her Gabe Davis jersey signed 😭",
    "463": "10:34  3rd Q\n\nPhoenix Suns  57\nOrlando Magic  43\n\n📺: Bally Sports Florida, \nBally Sports AZ\n\n#LEGENDoftheMiamiHEAT #NBA75",
    "464": "@OrlandoMagic forever tank team!",
    "465": "#NBA75 | Final 2C ⏱️\n\n🏀 @Suns 53-43 @OrlandoMagic\n\n▶️ #TemporadaRegular\n\n👨🏻‍💻 @CristianHB77 https://t.co/yXyZozro8P",
    "466": "@orlandoupnext @OrlandoMagic @wendellcarter34 funny how u say that acting like you now the magic suck when u were just talking about “suns in trouble”🤡",
    "467": "@FinsUp024 @OrlandoMagic @DavisGB1 @BuffaloBills @UCFKnights @UCF_Football We sure do",
    "468": "@SLAMonline @NBATV The Suns come to Orlando once a year so naturally the Magic bust out their traditional ORANGE UNIFORMS AND COURT.",
    "469": "@OrlandoMagic @DavisGB1 @BuffaloBills @UCFKnights @UCF_Football GOAT",
    "470": "@OrlandoMagic @DavisGB1 @BuffaloBills @UCFKnights @UCF_Football Nah we don’t do that",
    "471": "@orlandoupnext @OrlandoMagic @wendellcarter34 thanks 😹😹😹😹 free dub",
    "472": "Bills Mafia 🤝 #TeamOrlando\n\n@DavisGB1 in the O 🪄 https://t.co/QA97DBstcb",
    "473": "@OrlandoMagic @Magic_PR give Ross Jones a promotion",
    "474": "this pass 😱\n\n📺: https://t.co/JXrb594IOi https://t.co/zjVbhTGlTK",
    "475": "@OrlandoMagic @franzboogie @NBA_de @umichbball @jubjub388 we gonna have a perennial 50/40/90",
    "476": "Not sure if anyone gets to see the Orlando Magic halftime show with this man and a dog but, okay I see you.https://t.co/iebDfx6c0D",
    "477": "Say Hello to the Brazilians in the house!!! #MagicTogether @OrlandoMagic",
    "478": "Gonna need @OrlandoMagic to bring Scooby back for every game 🥺🥰 #MagicTogether https://t.co/hjplGJNZyp",
    "479": "This Orlando magic half time show is goated",
    "480": "Orlando magic halftime show- 10 Cool, 10 Fun",
    "481": "@OrlandoMagic @jamahlmosley please stop ‘experimenting with lineups’ it’s killing my vibe",
    "482": "Halftime: Suns 53, Magic 43. \n\nFranz Wagner makes a buzzer-beating layup with an assist from Cole Anthony at the end of the half to reduce Orlando's deficit to 10. \n\nMagic shooting just 35.4%. Suns only have 3 turnovers. \n\nWendell Carter Jr.: 11 points (5 of 7) and 7 rebounds.",
    "483": "@_dannyko Poverty franchise. Orlando Magic better",
    "484": "intermission in the O https://t.co/c5GhM7aEbf",
    "485": "Halftime em Orlando. Suns sem CP3 e Booker 53x43 Magic."
}