{
    "0": "@_danilomoreno @kiki_martinez87 @Suns he hasn’t missed a game since HS. not in college, not in the NBA. he will never sit unless fully injured",
    "1": "NBA Player Prop:\nChris Paul Over 14.5 Points -105 (Phoenix Suns)",
    "2": "@fedendamilano @Suns as a thunder fan we need y’all to win too",
    "3": "I’m at Paycom Center tonight where the Oklahoma City Thunder will take on the Phoenix Suns. Follow along for updates! https://t.co/FY1dJ5NpIm",
    "4": "@WhismanSucks We are in OKC watching your Phoenix Suns play our OKC Thunder! Hopefully nothing happens to land the players on @CrimeInSports https://t.co/8lyW8yN4UB",
    "5": "@Popehat @roddreher Isn't he the 2 guard for the @Suns?",
    "6": "4 years ago, the Phoenix Suns were the worst team in the West.\n\nNow, someway some how they are 1st seed in the western conference.\n\nBack then I don't even think anyone knew who was on the Suns.\n\nAnd they finna try and run it back this season after losing the 2021 NBA Finals.",
    "7": "Does he play for the @Suns? https://t.co/4C4LmQxQxE",
    "8": "@Suns Give Biyombo at least 20 mins of run tonight pls",
    "9": "@kiki_martinez87 @Suns Bridges has never missed a professional game, it’s personal now lol",
    "10": "@dmackerman @GrahamSmullen @Suns Even if he plays for a min lol",
    "11": "@Suns @BannerHealth JUST DONT STRUGGLE PLEASE",
    "12": "Phoenix #Suns resting Devin Booker, Deandre Ayton and Jae Crowder (right ankle soreness) for Sunday's game at Oklahoma City #ThunderUp\n\nWill start Landry Shamet, JaVale McGee and Cam Johnson along with Chris Paul and Mikal Bridges.  https://t.co/8R5DUrIkxH via @azcentral https://t.co/osZdOAN6jx",
    "13": "#Phoenix #Suns: @frysfoodstores wants #Suns fans to stay fresh! \n\nIn honor of Fan Appreciation Ni... \n \nhttps://t.co/QG08YMZGOu\n \n#Arizona #Basketball #NationalBasketballAssociation #NBA #NBAWesternConference #NBAWesternConferencePacificDivision #PhoenixSuns https://t.co/pWie1uGNdw",
    "14": "@GrahamSmullen @Suns He holds the NBA record, he ain’t sitting",
    "15": "@joe_tryon Phoenix Sun or Philadelphia Sixers are my picks",
    "16": "@goldpiece69 @OfficialNBARefs @Suns @memgrizz @NBATV Oh please do!",
    "17": "Oklahoma City Thunder (+14.5) vs. Phoenix Suns #ThunderUp #ValleyProud #NBA #NBATwitter #NBA75",
    "18": "Are you even a @Suns fan in your 30’s if you don’t have this? 😂 #suns #nba #TeenageMutantNinjaTurtles https://t.co/AjyxiGQ9VJ",
    "19": "@Suns Play iffe",
    "20": "@joe_tryon PHOENIX SUNS",
    "21": "Phoenix Suns Starters:\n\nChris Paul\nLandry Shamet\nMikal Bridges\nCameron Johnson\nJaVale McGee\n\nPlayers out:\nDeandre Ayton\nDevin Booker\nJae Crowder\nFrank Kaminsky\nDario Saric\n#ValleyProud #NBA #NBATwitter #NBA75",
    "22": "@DannyShapiro13 @Nailea_leon22 @Suns Appreciate you guys! I got y’all! Phx strong 💪🏼",
    "23": "I don't have to worry about Suns vs Lakers game on Tuesday. I know @suns winning that game.",
    "24": "@cryweirdolmaooo @Suns Yeah Ik hopefully he can get into the groove with his minutes today",
    "25": "@xvknuckles @Suns crowder is rest up too",
    "26": "@larryheld @Suns tell Matt I said hello ! enjoy your sunday!",
    "27": "Sunday Night Hoops in OKC!\n\nThunder Live begins NOW as OKC wraps up the weekend with a matchup against the Phoenix Suns at the top of the hour!\n\n@okcthunder | #ThunderUp https://t.co/J0M5WFueCn",
    "28": "@coopurr_ @Suns Cam still rusty",
    "29": "@Burritoexp @Suns Was also disappointed in the prices for playoffs this year. They should just limit how much they can be resold for, rather than jacking up the pricing",
    "30": "@Suns Fair enough",
    "31": "@xvknuckles @Suns Rest up",
    "32": "@Suns Bridges rest",
    "33": "@xvknuckles @Suns Resting",
    "34": "@Suns Iffe minutes",
    "35": "Phoenix Suns Starting Lineup 4/3\n PG: Chris Paul\n SG: Landry Shamet\n SF: Mikal Bridges\n PF: Cameron Johnson\n C: JaVale McGee\nhttps://t.co/o75oZ8vnE8",
    "36": "@Suns SHAM AND JOHNSON ON THE COURT TOGETHER expecting masterclass",
    "37": "@Nailea_leon22 @Suns @Atzael11 And me sheesh 😂",
    "38": "@Suns IFFE MINS PLZ",
    "39": "@EricStokesSzn6 @Suns you’re here daily bro. get a job",
    "40": "@Suns cam johnson stan",
    "41": "Starters in OKC. https://t.co/CcsER6hfpd",
    "42": "Uniforms for Phoenix Suns vs Oklahoma City Thunder at 4:00 PM.\n\n#ValleyProud #ThunderUp https://t.co/kMHk8U8Iwu",
    "43": "@Suns @BannerHealth IFFE",
    "44": "The 1 @Suns game we go to Booker is sitting out to rest :(",
    "45": "Does the Phoenix Suns Best Record Mean a Championship https://t.co/OpHrCufRoD via @KazualSportz",
    "46": "@michaeljduarte Hung tough but another loss. @Suns up next. Play in tournament hopes over for the @Lakers. 😞",
    "47": "AUTHENTIC NEW Nike Phoenix Suns Devin Booker City Edition Jersey The Valley MENS https://t.co/VSF9a1CHZ7\n\n$199.95  \n\nBuy It Now for only: $199.95\nBuy It Now\n\n#shopping #deals",
    "48": "When do we get a new update on Frank ??? @Suns",
    "49": "I don’t understand how #MontyWilliams is still having to fight to get the #CoachOfTheYear AGAIN! He took a team that wasn’t in the playoffs for how many years to the damn Finals and they have the best team in the league by 6 to 7 games. #PhoenixSuns fight for your coach Smh @Suns",
    "50": "@ALEXBOBAlNE @Suns @BannerHealth Okay 🤨💀",
    "51": "@Suns @FrysFoodStores pls have some east valley locations",
    "52": "@Suns @BannerHealth Iffe minutes or else",
    "53": "Based on the stat, the Lakers will definitely lose in their visit to Phoenix and Golden State, but the Suns and Warriors might save their key players for Play-Offs since they have already secured their positions. Spurs must win at any cost. https://t.co/ukmpqKMgA7",
    "54": "@Suns @BannerHealth IFFE SZN",
    "55": "@casualtakeking Smh. With All due  respect, @MarkJackson13. I may not get paid for my view but people people was saying the same thing about the Jordan Bulls until Phil Jackson took over.Phoenix suns acquired Jason Kidd and made it in2 the Playoffs. Both times a coaching change Mada a difference",
    "56": "Sunday Funday with my adult son before our @Suns  tip-off https://t.co/1Y8Ik8MIxa",
    "57": "Check out this listing I just added to my #Poshmark closet: Vintage Phoenix Suns single stitch T-shirt. https://t.co/0mzA7a1ZKG #shopmycloset @poshmarkapp",
    "58": "I would not be surprised if the Phoenix Suns DON'T rest their starters against the Lakers on Tuesday.\nAfter the Anthony Davis comments, Phoenix wants to kill them.",
    "59": "Do y'all think the Phoenix Suns organization knows that if it releases a Devin Booker 90s sun burst jersey it would be the end of times? That's why they haven't done it?",
    "60": "@Suns space Dey for new fan? https://t.co/7QdHVn7soO",
    "61": "@Suns @BannerHealth Bench Time",
    "62": "@Suns Iffe?",
    "63": "Can Devin Booker and the Phoenix Suns win this title this year, the answer is yes they could, and if they do, will they have had the best player in the league.\n\nThe answer is yes.",
    "64": "As it stands right now the Phoenix Suns will finish with the leagues best record, and the question will be, do they have the leagues best player on their team to win the title this year.",
    "65": "What are the chances of the number one team in the NBA the Phoenix Suns, to finish as the champion of the basketball world.\n\nThe Suns currently hold the leagues top record with a chance to get in the top record holders if they pass the 64 win mark.",
    "66": "Does the Phoenix Suns Best Record Mean a Championship\n\nA thread ⬇️ https://t.co/Xqu7FdXlTe",
    "67": "Lakers about to get their season ended by the Phoenix Suns in back to back years… oh lord.. 🫠",
    "68": "@Suns Devin booker sucks",
    "69": "The only thing I Love more than watching the @Suns win is watching the @Lakers lose. 😂😂 they’re right where they want to be. 😂😂 \n #DENvsLAL",
    "70": "If the @Suns handle business as expected against the @Lakers, and the @spurs win a game in their next two matchups, the @warriors can eliminate the Lakers from the play-in tourney and essentially end their season. 🔥🔥🔥",
    "71": "@KennySoloGaming @Suns @BannerHealth That’s fair. I also thought it would’ve been fun to beat them by 50 lol",
    "72": "@Suns @BannerHealth Not watching.",
    "73": "@Suns @BannerHealth its time. https://t.co/rZTrRDlEJw",
    "74": "Today's NBA Picks: 7:00 PM ET - Phoenix Suns vs. Oklahoma City Thunder - 25 PICKS AVAILABLE: https://t.co/zYjeAB8zcZ #nba",
    "75": "@suns_tutu_fan @Suns @FrysFoodStores Ah gotcha my bad I misinterpreted your post but I get you, yeah it would be cool if they sell them",
    "76": "The phoenix suns rn looking at their tuesday schedule and a chance to end the lakers season. https://t.co/n0uztslQ42",
    "77": "@EricStokesSzn6 @Suns @BannerHealth This ratio cares",
    "78": "@Suns @BannerHealth If we struggle against a team with 2 bench players I will be in awe",
    "79": "@NenaBreezyy @niquemm10 @Suns @FrysFoodStores Abril and I are already planning on it ahahaha",
    "80": "@EricStokesSzn6 @Suns @BannerHealth still have notis on + suns own ur fav team",
    "81": "🏀Phoenix Suns vs Oklahoma City\n\n📈TOP 3 KEY STATISTICS\n1⃣Total is OVER in 5 of #Suns last 5 games playing away #OKC\n2⃣Suns is 5-0 SU in last 5 games playing OKC\n3⃣OKC is 16-2 SU in last 18 games playing at home Suns\n\n#GamblingTwitter #bettingtips #NBA #NBATwitter https://t.co/isfnpd7mqZ",
    "82": "Tonight’s @BannerHealth Health Update: https://t.co/TCNsHRg5o3",
    "83": "Phoenix Suns me https://t.co/eVDHSbHkZe",
    "84": "Watching Rudy Gobert being ignored in plays with the Utah Jazz makes me really wonder what kind of a beast he’d be if he was in the Phoenix Suns’ style of play with CP3…",
    "85": "@Burritoexp @Suns Too nice🌵💯‼️",
    "86": "@Suns Suns in 4",
    "87": "@Burritoexp @Suns #1 burrito in the #ValleyProud  \n🧡💜🧡💜 👊😎🤞",
    "88": "@Suns Win please",
    "89": "HE SAID IT BEST- “it’s about winning and consistency!!!” THAT ALONE SHOULD HAVE THE @Suns TAKING ALL AWARDS THIS YEAR! #ValleyProud #NBA #Respect https://t.co/7sJLfHh10r",
    "90": "I had a Chicago bulls and Phoenix suns one couldn’t tell me shit 😂😂😂 https://t.co/5g2z4NzxtT",
    "91": "@1milgoddess @Suns Ratio + you’re mid",
    "92": "@Suns Post iffe",
    "93": "@Burritoexp @Suns You guys rock.  Have a great day!",
    "94": "@devinarchive @Suns He isnt playing",
    "95": "@Suns post booker",
    "96": "Checking in. https://t.co/5vSxMWkFg7",
    "97": "✅ Secured! @Suns ! @Atzael11 better bring me for doing you this favor https://t.co/ZN6xIwdNKM",
    "98": "@Burritoexp @Suns Sounds like a wonderful idea!",
    "99": "#TOPFIVE @NBA TEAMS (this season)\n5. @celtics ☘️\n4. @Pacers 🅿️\n3. @Suns 🌞\n2. @nuggets ⛏\n1. @kings 👑",
    "100": "Seriously appreciate all the homies. Went ahead and confirmed my playoff strip. Maybe we give away a couple seats in the first round. Much❤️LFG @Suns and @Burritoexp fans!!!!!!",
    "101": "{LIVE} USA NBA BASKETBALL Oklahoma City Thunder Vs Phoenix Suns https://t.co/C41YN3M3Jg lewat @YouTube",
    "102": "@Suns @FrysFoodStores Anybody plz get me one. I dont live in AZ and FL doesn’t have a Fry’s anyway 🙏🏼",
    "103": "@BenSimmons25 JERSEY SWAP TO @Suns https://t.co/TilYW6ModI",
    "104": "@ChrisOgeez0920 @Suns @FrysFoodStores Yeah thats a giveaway I probably won't win that's why I was hoping they were selling them too",
    "105": "the @Suns are definitely in the building lmao https://t.co/yvDdO8mvr6",
    "106": "@RichRendon @AZSportsRealtor @CJC9BOSS LOL it's funny are you really suggesting that the Jazz are going to be at the sun that's probably the funniest thing I've heard in the past years look at the gap between Winds of Phoenix Suns and the Jazz &amp; who won against the Jazz this year when we played in Phoenix or the Jazz",
    "107": "@Kenneth63372372 @Suns right, I'm ready!",
    "108": "Work. Before @Suns game\n\n@brody_hastings @MtRidgeFootball https://t.co/wm6RefxuPO",
    "109": "@freewayflippers @Suns True! Super similar colour way",
    "110": "@Suns @FrysFoodStores Who are these three ? I’m guessing the cast of the new Netflix show “WOKE-en up” about 3 multicultural friends who love to crack jokes while grocery shopping together",
    "111": "@zmoneyyyyyyyyy @niquemm10 @Suns @FrysFoodStores It's all week! Hahah when you get home hit a Fry's 😜",
    "112": "The Phoenix Suns have an assistant coach I hope the Lakers interview: Kevin Young. Embiid really liked him, hope we can give him a chance. Bonus: he’s under 50 years old.",
    "113": "@Dakodas_Dad @Suns @okcthunder Or a blowout with OKC making a weak comeback 🙃",
    "114": "@Suns @FrysFoodStores @suns_tutu_fan did you see this? I saw your post earlier about the shirt lol",
    "115": "@NateLanew @BALLYSPORTSAZ @Suns @alex_r_hill It's not all on @BALLYSPORTSAZ, Sarver is the one who made the deal with them in the first place.",
    "116": "Is the suns game on yet already. Fuck @suns https://t.co/1tVt70Jm4z",
    "117": "Phoenix Suns vs Oklahoma City Thunder - NBA League 2022\n🔴Live Broadcast📺📱:  https://t.co/BwQ4NPyz6i\nDate : 4/3/2022 - Time : 7:00 PM",
    "118": "How about his impact now?\n\n@CP3 former teams that are currently .500+ = none\n@Suns current record 7.5 wins better than anyone else \n\nnot sure if hes a POINT G-D, or G-D himself.\n\nh/t @DraftKings https://t.co/lUHZI2N0Ch",
    "119": "@SunDevilGym @CP3 @Suns Devils😈",
    "120": "@Dakodas_Dad @Suns @okcthunder BAAAAD NEWS",
    "121": "4PM tip off in AZ.  @BALLYSPORTSAZ still ruining lives of @Suns fans.  @StrattonH @alex_r_hill",
    "122": "@VMASECURITY @Jumpshot8 @warriors @utahjazz @Suns @CP3 Uh 🙄 so scary lol 😂 💜🧡🏀👏🏻🔥👍🏾😎",
    "123": "Nothing else for the Sun Devils in the 4th.\n\nCal 5, ASU 2 after 4 at Phoenix Muni.",
    "124": "@papeinsilence @m10157 @Wheelyum_ @lucas43591127 @LegendOfWinning this is the fattest piece of gobert hate i’ve EVER seen. The utah jazz would just be the phoenix suns before the bubble if gobert wasn’t there",
    "125": "LETS START THIS OFF RIGHT!! 1K TO 50K STARTS HERE!\nBET 1:\n\n-Phoenix Suns O 113.5 total points\n-Pelicans +6.5 \n\n$1,000 to win $2,086.82\n\nWho’s hopping on the bus with me?!❤️🔥 https://t.co/E1z6AGJrk0",
    "126": "Is this the night Phoenix #Suns set the franchise record for most wins in a single season?\n\nTried Friday at Memphis.\n\nLost. Still at 62 Ws.\n\nAt Oklahoma City #ThunderUp\ntonight.\n\nThey'll have to do it without Devin Booker (rest), Deandre Ayton (rest) and Jae Crowder (sore ankle). https://t.co/qyw5eMq06j",
    "127": "@okcthunder My Thunder made the road trip to OKC.\nYou know he's pulling for his team tonight vs the @Suns \nJoin me and @johnrhadigan for #Thunderlive pre game at 5:30pm CT on @BallySportsOK #ThunderUp https://t.co/IgjSPYf6IF",
    "128": "@TheMattPurvis @bszard @getnickwright I notice no one has refuted the Suns part of the equation, or the fact Dallas still has to get past Denver or Utah. Why because Phoenix &amp; Memphis have the 2 best records locked up.",
    "129": "@Suns Yes suns all day",
    "130": "NowPlaying Sun Drifting the Phoenix Coast and the Man Eating Probability - Wave Temples https://t.co/X4qtYyw4B7 20:25",
    "131": "@Suns @FrysFoodStores Need!!!!!",
    "132": "GAMEDAY!!! as @okcthunder host the Phoenix Suns tonight at 6 pm CT on Bally Sports Oklahoma and The Sports Animal...\nOKC will be without Tre Mann(right hamstring strain) JRE (right foot soreness) and Poku(flu-like symptoms) are game-time decisions while for Phoenix, Devin Booker,",
    "133": "@LuceRiott @Suns @LilTunechi This shit is hot ass, need a better mic and mix, develop yaself a bit more n come back",
    "134": "@Suns @FrysFoodStores Should be at all AZ fry’s . No all the Suns fans live in the Phoenix area💜🧡🏀🔥👍🏾🏜",
    "135": "@Suns @okcthunder @BALLYSPORTSAZ @AZSports @az_mejor Today is my birthday and all I want is a Win!! Let's do it boys",
    "136": "@LvR_BS @NBA @CP3 @Suns King status",
    "137": "@Suns truth? The loss to the Grizzlies🧐hopefully woke up the “over  self confident” by Suns! Just played “sleepy” no care most of the game, then tried too late to play real Suns 🏀 ZERO offense rebounds will NOT win games! Best wake up!",
    "138": "@cathinator I bet summer break is really hard in Phoenix. \nHere in Seattle, it's basically the only time that's truly pleasant to go outside, so we worship the sun like we are part of an ancient civilization. LOL. There's still boredom, though.",
    "139": "@Suns @LilTunechi Devon Booker for MVP !!! Go Suns",
    "140": "@solowhit_ @Suns @FrysFoodStores @drinkCOCO5 These drinks are good!",
    "141": "Phoenix Suns visits Oklahoma City Thunder Predictions and Preview for 4/3/2022 today.  Who are we taking in this game?  Find out now. #GamblingTwitter #Picks https://t.co/xJEaFYEB26",
    "142": "@Suns @FrysFoodStores Which stores!!",
    "143": "Phoenix Suns have been amazing. Just 15 Ls. Clinched the conference.",
    "144": "@Dakodas_Dad @Suns @okcthunder Close game coming",
    "145": "@EndlessJeopardy Who are the phoenix suns?",
    "146": "@EndlessJeopardy What is literally the Phoenix Suns?",
    "147": "@Kenneth63372372 All day, our @Suns fan",
    "148": "Oklahoma City Thunder Predictions and Preview for 4/3/2022 hosts Phoenix Suns.  Looking for betting action?  Find out if there is any value in our preview. #GamblingTwitter #Picks https://t.co/xJEaFYEB26",
    "149": "My son had to take a pic with his favorite player @DevinBook at Fry’s. And he picked the cherry flavor! Let’s go @Suns #PhoenixSuns #devinbooker @drinkCOCO5 https://t.co/R84qp249lu",
    "150": "@EndlessJeopardy Who are the Phoenix Suns, literally?",
    "151": "@Kenneth63372372 Lfg bro , and @Suns our   team hell yeah 💜🧡, from México with love",
    "152": "@Jumpshot8 Well if he rests today, hopefully he will play Tuesday. 🤷🏻‍♀️I would rather the @Suns face the Lakers with Bron &amp; AD….so they can beat them out of the play-in. 😈",
    "153": "@purple_n_orange Also the Suns isn't quite as bright in Pittsburgh as Phoenix lol",
    "154": "@dubsforever7 @Suns Just my opinion dude. Though not my main team, I like the GSW team. Looks like Poole-Thompson partnership works... kinda like Curry-Thompson. Hope this shows that my opinion has some merit.",
    "155": "@getnickwright Nick, Dallas will not beat Memphis or Phoenix. They both have the first two seeds locked throughout the playoffs. They have better teams. Dallas will have to go through either Denver with Jokic or Utah before the 2nd round match up. Let's remember their 14 games behind the Suns",
    "156": "@Suns this is the 3rd time im adkign, but this time im not only asking, im begging you, to let Iffe get his NBA debut! Just put him in ffs",
    "157": "Which team is the biggest threat to the Phoenix Suns? #NBATwitter #NBA75 #NBAPlayoffs",
    "158": "@Suns @FrysFoodStores Do you know what time the game will be?",
    "159": "@_NooooooNoooooo @Kenny58211098 @KittyKatDeee @NBA @Suns Way off I’m Puerto Rican man of many talents !!! And one thing I cook is my heritage and that’s Puerto Rican food 🇵🇷🇵🇷 @FoodNetwork @PuertoRicoPUR @PuertoRicanFood @BayAreaEats @GoyaFoods and you guys thought I was just a UPS man !!!! https://t.co/YeOq2Jl4KA",
    "160": "@itsdrewandsarah Would make good Phoenix @Suns pants!",
    "161": "@Tiffany_Lv_SunS @DevinBook @CP3 @mikal_bridges @CJC9BOSS @campayne @JaValeMcGee @DeandreAyton @landryshamet @TCraig_23 @bismackbiyombo 💓💜🧡. Let’s go Phoenix Suns!",
    "162": "WESTERN CONFERENCE SEMI-FINALS:\n\nPhoenix Suns (1) vs. Dallas Mavericks (4)",
    "163": "@VMASECURITY @Jumpshot8 @warriors @utahjazz @Suns @CP3 Dreaming buddy, enjoy a first round bounce",
    "164": "I ride or die with my @Suns, but you have to respect everyone in the West, especially @warriors @memgrizz and (after watching this #BucksMavericks game) the @dallasmavs, who are definitely on the come!  #NBAPlayoffs",
    "165": "@VMASECURITY @Jumpshot8 @warriors @utahjazz @Suns @CP3 Why are you so mad? lol",
    "166": "@Suns back to back games? hard against Mem's young (bench) legs when exhausted. might help paying some attention to bench players moves too, Right? Understand opponents is as important as understand yourself.  Good luck.",
    "167": "Lovin' the @Suns' sustainability commitment! https://t.co/FQ6Hx1an4B",
    "168": "@niquemm10 @NenaBreezyy @Suns @FrysFoodStores OH WAIT ILL BE THERE JK JK",
    "169": "@niquemm10 @NenaBreezyy @Suns @FrysFoodStores Y’all, I’m in Cali for games 🥺🥺🥺",
    "170": "{LIVE} USA NBA BASKETBALL Oklahoma City Thunder Vs Phoenix Suns | 3-Apr-22 | 19:00 | Live Stream &amp; On Demand 👉 ▶️ : https://t.co/DLwTIpvbXf | USA | NBA | BASKETBALL | Oklahoma City Thunder | Phoenix Suns https://t.co/RIWhTsZGsY",
    "171": "@Suns @FrysFoodStores come to surprise",
    "172": "Check out Matchbook Valley Of The Sun Phoenix Giants Devils ASU Fiesta Bowl Bottle Club AZ https://t.co/5HYmKP5tte @eBay",
    "173": "1) Phoenix Suns/Oklahoma City Thunder UN 107.5 -105 $500.00",
    "174": "@SunDevilGym @CP3 @Suns So cool!",
    "175": "@DallasMavsFr « We’re on a road for an extra time in this game 4 between the Mavs and the Phoenix Su… OMG DEVIN BOOKER AT THE BUZZER AND IT’S A 4-0 WIN IN THIS SERIES FOR THE SUNS »",
    "176": "Hilarious!!\n\nSpoiler Alert: the #PhoenixSuns will be in the 2022 #NBAFinals. https://t.co/hPqwmB5XkQ",
    "177": "@Burritoexp @Suns You bring him along to games and if you have extras sell them to help supplement the ones you have you can also use them as tax write off for giveaways etc or employee incentive program",
    "178": "Should Phoenix Suns or Memphis Grizzlies be No. 1? https://t.co/2H8LraJteM",
    "179": "The finals? Of course you would gloat about this if this actually happened to be the case. The fact that you think the Dallas Mavericks would beat the Phoenix Suns in a seven game playoffs series is a complete joke in itself man. Smfh. https://t.co/b4iemsCnh2",
    "180": "@PrizePicks can we get the Phoenix Suns player props up before this Laker game rips off.",
    "181": "@AntonioAngelo21 @Suns You right. Can’t take the money with you when your gone. Much love.",
    "182": "@Burritoexp @Suns Would the 14000 bring you more joy somewhere else?   I assume you have food and shelter and aren’t swimming in debt?  Life is about experiences.  Two years from now will you be struggling to pay for something you need because of this decision?",
    "183": "@chrisherstam @Suns Yessir https://t.co/XpQIlLceRD",
    "184": "Phoenix Suns are a good regular season team, we'll see when the playoff starts.",
    "185": "@BillsMafiaDel Once you win a championship none of that matters fam. The Phoenix suns have 0. They would die to have one. Did the raptors win the Kawhi Leonard trade my point exactly. You can’t win a trade as the Pels having done nothing",
    "186": "That’s how bucks play they just have a habit of sneaking up on ya @Patsnation87 @suns @ESPNNBA",
    "187": "NBA Power Rankings: Should Phoenix Suns or Memphis Grizzlies be No. 1? https://t.co/xsZ9wNKJ0A",
    "188": "Should Phoenix Suns or Memphis Grizzlies be No. 1? https://t.co/rzbts0GR8J",
    "189": "#FreePicks #SenseiSam \nNJ Devils\n🆚️\nNY Islanders\nOver 5.5 🧨\n@NJDevils\n@NYIslanders\n\nIndiana  Pacers \nOver 116.5  Team Total -134🧨\n@Pacers #Pacers\n\nThunder 🆚️  Suns\nUnder  223.5🧨\n@okcthunder #ThunderUp\n@Suns #RallyTheValley",
    "190": "@LakeShowYo Phoenix Suns @CP3",
    "191": "@Suns @okcthunder @BALLYSPORTSAZ @AZSports @az_mejor Let’s regroup and get this W 🙏🏻",
    "192": "@Suns @FrysFoodStores Fan appreciation would be dropping the ticket prices.",
    "193": "Phoenix Suns’ Mikal Bridges nears top of NBA’s DPOY betting odds https://t.co/uxGI2VD1mO",
    "194": "Phoenix Suns’ Mikal Bridges nears top of NBA’s DPOY betting odds https://t.co/6M9CXEyzR3",
    "195": "Phoenix Suns 1H -8.5 \nThey play vs OKC Thunder @ 7pm ET\nNBA picks Sunday",
    "196": "‘Incredible’: Brooklyn Nets coach Steve Nash giving high praise to Phoenix Suns https://t.co/9bkzkbeSTv",
    "197": "@English_AS @Suns What part of team you do not understand? Lebron is the one that brought the short cut mentality because he’s running out of time to catch Jordan 6 championships.",
    "198": "@Suns @FrysFoodStores Someone tell the Suns that thier last game was blocked out on the Dish Network. How does that happen to a community that is riding a 1st place team? https://t.co/u0VnJTwwlu",
    "199": "@Suns @FrysFoodStores Come to City of Maricopa Frys!",
    "200": "@NenaBreezyy @Suns @FrysFoodStores @zmoneyyyyyyyyy For shipping and handling 😂🧡",
    "201": "'Incredible': Brooklyn Nets coach Steve Nash giving high praise to Phoenix Suns #Phoenix #Suns #NBA https://t.co/Xuz14JQNnW",
    "202": "@NenaBreezyy @Suns @FrysFoodStores @zmoneyyyyyyyyy Me too! I’ll send you money",
    "203": "🐻 Memphis played their last game without four starters and won against the Phoenix @Suns. 🤯 #GrindCity https://t.co/GUjPiU1U0e",
    "204": "@Suns @FrysFoodStores Tip off time yet? Going to @Dbacks and @Suns that day",
    "205": "@Suns @FrysFoodStores @zmoneyyyyyyyyy get me a shirt when ya can lol",
    "206": "@LegendOfWinning The Jazz and the nfl Vikings have lost in the post season 30 times without a championship. However the Phoenix Suns take the cake of alltime chokers with 31 playoff failures without a ring.",
    "207": "@Suns @FrysFoodStores cool shirt",
    "208": "The Phoenix Suns are Championship Contenders I The Starting 5,,https://t.co/FEEQnxov3p",
    "209": "@Suns @okcthunder @BALLYSPORTSAZ @AZSports @az_mejor 63 wins... https://t.co/FkZru09R9P",
    "210": "@Suns @okcthunder @BALLYSPORTSAZ @AZSports @az_mejor LFG!!! Excited to hopefully watch Gabriel Iffe play",
    "211": "Headwear of the day @suns family @SunsJAM @MatthewLissy @DarthVoita *- -Phoenix Suns https://t.co/3KTSEkdCLq",
    "212": "@Suns @FrysFoodStores @ofeelee let me get a dollar",
    "213": "@Suns day. Is #BadNews for the @okcthunder #DakodaKnows #ValleyProud #NBA75 https://t.co/eBsCtmmpBZ",
    "214": "@Suns @LilTunechi He downgraded 2ks default outfit... And you guys are hyping it up",
    "215": "I am rooting for the Tigers to be good again. Detroit is a Tigers town the same way Phoenix is a Suns town. https://t.co/uw7T65c2ad",
    "216": "\"The Suns also saw great returns with this guy minus Paul. He too took this stretch of games as a personal challenge...\"\n\nEven though he was missed, Chris Paul's time away from the @Suns only made them that much stronger. (via @mattfe2) https://t.co/wmY4HdJFxr",
    "217": "@Suns @FrysFoodStores no stores in the UK https://t.co/w4roVAyPAB",
    "218": "Anyone else hear President Nelson talk about the Phoenix Suns in his conference talk?",
    "219": "Equipes já classificadas aos Playoffs:\n\nPhoenix Suns \nMemphis Grizzlies \nGolden State Warriors\nDallas Mavericks\n\nMiami Heat\nMilwaukee Bucks \nBoston Celtics https://t.co/vvYbJfy60n",
    "220": "Yesterday the @warriors beat Utah @Jaz and moved back to 3rd place in the West, which is not convenient for them. Better for @Warriors to be 4th. or 5th. and face the @Jazz in the 1st round of the PlayOff and in the 2nd. round Phoenix @Suns as 3rd They face Denver &amp; after Memphis https://t.co/WH4vG972az",
    "221": "@Suns @FrysFoodStores Any stores in The West Valley?",
    "222": "@Suns @FrysFoodStores They should have @drinkCOCO5 in the cart",
    "223": ".@FrysFoodStores wants Suns fans to stay fresh! \n\nIn honor of Fan Appreciation Night on 4.10, Fry’s is surprising fans this week with FREE merch at participating stores across the Valley! \n\nStay locked in to Suns Twitter for exclusive drop information. Quantities limited! https://t.co/F21jXCR9cB",
    "224": "@Suns Do you know what would make Ohio better🤔 getting rid of pedophile protector Gym @Jim_Jordan",
    "225": "The Thunder welcomes the Phoenix Suns to @PaycomCenter in its penultimate home contest of the season.\n\n@OUHealth Game Day Report\n￼\n📝 | https://t.co/kOvRAPfcqL https://t.co/RLNCExzSEL",
    "226": "yo can the @Suns stop resting these players idc if y’all clinched first seed my fantasy needs booker and ayton",
    "227": "@LakeShowYo Phoenix Suns 🌞 ☀️",
    "228": "@F3rnMayo Phoenix suns for me",
    "229": "Things are heating up in the Sun Belt, from Phoenix to Miami-and it's not just the temperature. Rents are increasing across the country at a breakneck pace, making it more difficult for renters to find affordable housing. https://t.co/fqCvzWHUFY https://t.co/9ISK5sjiZA",
    "230": "This is how a real basketball team walks out of the tunnel @Suns https://t.co/PJA9xWuIqz",
    "231": "@Meekval @WizkidtheLegend @warriors I don’t know what it means at all😂😂😂\nYou guys can’t even beat a serious Giannis \nCan’t beat the first team of the Phoenix suns\nYou can’t beat a lot of team the mavs, nuggets, Miami heat, nets, sixers",
    "232": "🔴𝑳𝒊𝒗𝒆 ~ Phoenix Suns vs. Oklahoma City Thunder - NBA League 2022 💯\n🔵🎥 Watch Live Fullᴴᴰ 👉 https://t.co/0kkZX4OQHH ☑️\n📆 : On Sunday. April 03 /2022\n⏰ : 6:00 PM",
    "233": "The Phoenix Suns take on the OKC Thunder at 7 PM EST!\n\nDevin Booker, Deandre Ayton and Jae Crowder are all out tonight due to rest. #Sund #Thunder https://t.co/qgppYvYJDg",
    "234": "Join us for brunch &amp; all-day happy hour! Try our award-winning Bloody Mary. #otb  @Suns #poker at 7pm. Sign up for the golf outing on April 23rd to support Veterans IV Veterans.@GlendaleAZttd @GlendaleChamber @VisitGlendaleAZ @WBVGC @WestValley101 @visitpeoriaaz @PeoriaChamberAZ https://t.co/I9EFopkMeg",
    "235": "Consensus Line Move:\n2022-04-03 Phoenix Suns at Oklahoma City Thunder from 223.00 to 222.00\nUnder lollipops\n#NBA #sportsgambling #ml #binaryoptions",
    "236": "Arizona Republic's NBA power rankings: Should Phoenix Suns or Memphis Grizzlies be No. 1? https://t.co/dboKzEZC8w",
    "237": "@Suns It’s time for Mikals lemonade stand",
    "238": "@WORLDSTAR Black Phoenix Suns Charles Barkley",
    "239": "Black Phoenix Suns Charles Barkley https://t.co/3udE6cHHtg",
    "240": "Arizona Republic's NBA power rankings: Should Phoenix Suns or Memphis Grizzlies be No. 1? https://t.co/3SZ4tHxXxT",
    "241": "@Suns @okcthunder @BALLYSPORTSAZ @AZSports @az_mejor Let's get the win and set a new record!",
    "242": "Arizona Republic's NBA power rankings: Should Phoenix Suns or Memphis Grizzlies be No. 1? #Phoenix #Suns #NBA https://t.co/Gu8ibe9QOw",
    "243": "Arizona Republic's #NBA power rankings: Should Phoenix #Suns or Memphis #Grizzlies be No. 1? (w/video) #NBA75 https://t.co/6oiKIgHxQs via @azcentral",
    "244": "DasHaus made a bet!\n\nEvent: Phoenix Suns vs Oklahoma City Thunder #NBA\nBet: Oklahoma City Thunder TO WIN +15\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "245": "DasHaus made a bet!\n\nEvent: Phoenix Suns vs Oklahoma City Thunder #NBA\nBet: Phoenix Suns TO WIN -15\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "246": "#Suns @ #Thunder Free NBA Betting Pick For Tonight. https://t.co/WGyuqRrg9Q #Phoenix will be in #TornadoAlley to take on #OklahomaCity #DevinBooker #ChrisPaul #DariusBazley #PaycomCenter #Tipster #FreeNBAPicks #SportsHandicapper",
    "247": "Analyzing Sunday’s Phoenix Suns at Oklahoma City Thunder odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/V1qqc6Zp74",
    "248": "@Suns @okcthunder @BALLYSPORTSAZ @AZSports @az_mejor Lets get the win\nAnd hope Cam Johnson have enough on court time to recover🙏🏿",
    "249": "@Suns @okcthunder @BALLYSPORTSAZ @AZSports @az_mejor Pls win",
    "250": "@Suns @okcthunder @BALLYSPORTSAZ @AZSports @az_mejor Suns Can I get a happy birthday",
    "251": "@Phx_Marilyn @tcani @Suns @PhoenixMercury Even if they had said something, talk is cheap.",
    "252": "@Suns @okcthunder @BALLYSPORTSAZ @AZSports @az_mejor paul george WISHES he was devin booker",
    "253": "@Suns @okcthunder @BALLYSPORTSAZ @AZSports @az_mejor 63-15 tonight",
    "254": "@Suns @okcthunder @BALLYSPORTSAZ @AZSports @az_mejor Easy win",
    "255": "Last game of the trip. \n\n🆚 @okcthunder\n🕓 4PM\n📺  @BALLYSPORTSAZ\n📻 @AZSports | @az_mejor https://t.co/79KAKaiDBr",
    "256": "Tonight’s NBA &amp; NHL Picks 🏀🏒\n\nPhoenix Suns ML\nNew York Rangers ML\nEdmonton Oilers ML\n\n$100 returns $211 https://t.co/0QP1srz7OM",
    "257": "@Phoenix_SunsFan Clairement les suns",
    "258": "4/3/68 – In their 1st #NBA Draft, Phoenix (they were still unnamed) selected F/C Gary Gregor out of South Carolina w/the 8th overall pick. Gregor failed out of college 9 games into his Soph year (64-65), got married, then av'd 13.0p/13.3r &amp; 17.9p/12.2r (66-68). #Suns #ValleyProud https://t.co/BREQcfn1zj",
    "259": "@Suns Sweet jacket too!",
    "260": "@TheHershAZ @Burritoexp @Suns Yeah, I agree with Hersh. You are not going to eat them. Go to the ones you want, sell the rest (hopefully to Suns fans). I might even buy some.",
    "261": "Just got signed to the @Suns... 🔥 https://t.co/8pCy89eI9u",
    "262": "NBA Full time Schedule for April 3rd \n\nWestern Teams playing today \n-Los Angeles Lakers \n-Los Angeles Clippers \n-Sacramento Kings \n-Golden State Warriors \n-Portland Trailblazers \n-Phoenix Sun's \n-Denver Nuggets https://t.co/NOJDqzqYXJ",
    "263": "11 years ago I was happy that the @Suns only lost by 17 to the spurs. Boy how things have changed. https://t.co/DkpgRRKJey",
    "264": "@officialD25 Hornets are a decent team. LaMelo is an playmaking fighting for a playoff spot.. If you want to talk about a REALLY GOOD team. Phoenix Suns your answer 🤷🏼‍♂️",
    "265": "Sun. vs. MIL at Phoenix: Miller 5, W. Calhoun 7, Carpenter 3, McCarthy 9, Marisnick 8, Heim 2, Culberson 6, Harris DH, Duran 4, Gray 1",
    "266": "4/3/94 – The Phoenix #Suns scored only 9p in the 3Q following Walter Davis' jersey retirement, but they still outlasted the Denver Nuggets behind KJ's 42p/17a, 108-98. Barkley finished w/15p/13r on 4-12 shooting, and Dan Majerle scored 15 2Qp, but never scored again. #ValleyProud https://t.co/tESE7cqo56",
    "267": "🏀SUNSDAY🏀\n\nWe've got the Suns gear you can't find in stores! \n\nRep the best team in the league: https://t.co/lUcKctTms7\n\n#nba #basketball #phoenix #suns #phoenixsuns #phx #phxsuns #thevalley #wearephx #chrispaul #devinbooker #deandreayton https://t.co/MUyQI8Rzqb",
    "268": "Hoy juega el Thunder!\n\n🆚 Phoenix Suns ☀️\n⏰ 20hs 🇦🇷🇺🇾\n👕 Statment Edition 🟠\n🏟️ Paycom Center ⚡️\n📺 NBA League Pass\n\n#ThunderUp https://t.co/G5IQGs12uq",
    "269": "@Suns are winning the NBA championship this year.",
    "270": "WESTERN CONFERENCE:\n\n1st vs. 8th\n\nPhoenix Suns vs. LA Clippers\n\n(As with the West, we’re going to assume MIN takes 7th and LAC takes 8th)",
    "271": "Day 4 off trying to get the suns to follow me @Suns",
    "272": "Odds to win Oct. 2022 #WNBA Finals \n\nConnecticut Sun +350\nLas Vegas Aces +375\nSeattle Storm +425\nChicago Sky +425\nPhoenix Mercury +500\nMinnesota Lynx +850\n\nWashington Mystics +1400\nNew York Liberty +3300\nDallas Wings +5000\nLA Sparks +5000\nAtlanta Dream +6000\nIndiana Fever +8000",
    "273": "Phoenix Suns Basketball 🏀",
    "274": "Phoenix Suns 💜💜🧡🧡",
    "275": "“I’m okay with you being my weakness, Blue. Because that means my weakness is a badass, hot as fuck Phoenix with enough fire in her veins to rival the sun. So come at me stars, I’m invincible!”\n\nin love lance is so😩😍",
    "276": "PHOENIX SUNS",
    "277": "Phoenix Suns 💜🧡",
    "278": "@BaileyCarlin Phoenix Suns were a 2k hack.",
    "279": "@Feinsand 3 teamer with the Phoenix Suns?",
    "280": "4/3/94 – The Phoenix #Suns retired Walter Davis' #6, the 5th retired in franchise-history (Hawkins, Van Arsdale, Westphal, Adams). Davis was the franchise's 2nd Rookie of the Year (1978) &amp; is the franchise's all-time leader in pts, (15,666) among other career stats. #ValleyProud https://t.co/aRCuCaDeY2",
    "281": "Sunday evening hoops, anyone?! 🏀\n\n@okcthunder vs @Suns \n⏰ 5:30 pm\n📺 Bally Sports Oklahoma\n📲 Bally Sports App\n#ThunderUp https://t.co/zwkYMBr6k7",
    "282": "@Burritoexp @Suns If you don't want them, I'll buy them. :)",
    "283": "Got 2 lower level tickets to the lakers @suns on April 5th!!! 275$ each!!! DM me! #suns #Phoenixsuns #Lakers https://t.co/lpk9lRCSGO",
    "284": "@Burritoexp @Suns If you can swing it, I say go for it. Could be our year!",
    "285": "Washington Wizards\n\nMinnesota Timberwolves\n\nPhiladelphia 76ers\n\nToronto Raptors\n\nDallas Mavericks\n\nDenver Nuggets\n\nDetroit Pistons\n\nOrlando Magic\n\nPhoenix Suns\n\nSan Antonio Spurs\n\nGolden State Warriors\n\nNew Orleans Pelicans",
    "286": "@Burritoexp @Suns While it is a lot of money, do it if it won’t hurt y’all, it’s something you have been passionate about sense at least I learned y’all had a Twitter",
    "287": "@Suns Go suns",
    "288": "@Suns  @PhoenixMercury  this is our GOAT? https://t.co/dI25tdPc7Y",
    "289": "FYI: Outlaw made his greatest contributions to the Suns wearing number 45, but when he returned to Phoenix as a free agent for the 2004-05 season, Steven Hunter was already wearing it. So Outlaw wore number 46 instead. \nvia: @BrightSideSun \n#Suns",
    "290": "@1017anthonym @BetMGM @DevinBook @Suns Man's only has points barely even touches the assists and no rebounds and no other stats that he even comes close to Embiid, Giannis, Jokic.",
    "291": "@Burritoexp @Suns I’m not a rich man, 1st world problems, wut?",
    "292": "@MamaNeedsPax Phoenix Suns seven games vs Nets.. if Chris Paul don’t get Hurt..lol",
    "293": "Let’s Gooooo @DevinBook  \n\n@Suns \n\n#ValleyProud https://t.co/nh0Shlsn4R",
    "294": "@Burritoexp @Suns If it makes the decision any easier I would think there’s a very good chance there’s not all 4 home games every round.  Bet there will be 3-4 less games than the max 16.  So maybe it’s closer to 12k?",
    "295": "Phoenix Suns not gonna win the West.\n\nThey will be elimited either by @warriors or @memgrizz",
    "296": "A former rez basketball player is now courtside for every Phoenix Suns and Mercury home game, calling the action off the court. https://t.co/k4mltm9jDx",
    "297": "Today's NBA Picks: 7:00 PM ET - Phoenix Suns vs. Oklahoma City Thunder - 4 PICKS AVAILABLE: https://t.co/zYjeAB8zcZ #nba",
    "298": "@dogmanp_sparks @BAAILEYYCREATES According to the talk show bros, the Phoenix Suns are an afterthought.",
    "299": "not the grizzlies beating the suns (number 1 in the west) without ja, adams, triple j, bane, and jones… @memgrizz  caught yall lackin @Suns",
    "300": "It was only a few years ago that KOC was using \"Bright Future...\" to describe the Phoenix Suns.\nHe couldn't have foreseen the CP3 piece, but the rest of the foundation is what made the case.\nSeeing a similar foundation in Houston is good news for #Rockets fans. https://t.co/nl9nsuaNmS",
    "301": "12 Team Sunday @NBA Parlay \n\n@celtics \n@Bucks \n@nuggets \n@DetroitPistons \n@sixers \n@nyknicks \n@Timberwolves \n@spurs \n@Suns \n@Raptors \n@warriors \n@LAClippers \n\n🎲 🎲 https://t.co/Ju4QYbenk9",
    "302": "I will never disown my teams.  Pittsburgh Steelers, NY Rangers, Boston Red Sox,  Phoenix Sun's,  No matter how bad they do.  Sink or Swim\nIf you abandon something as simple as that.   How do you expect to make it in a Marriage?",
    "303": "@MikeBellATL @ATLHawks @TheTraeYoung I have @ATLHawks vs @Suns or @memgrizz in finals 😳😳😳 (Bold prediction)",
    "304": "Phoenix Suns vs  Oklahoma City Thunder Prediction 3/4/22 -  Free NBA Picks https://t.co/naBkYjtEAc via @YouTube",
    "305": "#Thunder Preview: Hot Phoenix Suns Come to Paycom @FranchiseOK  https://t.co/sY8jgopov2",
    "306": "@Kenneth63372372 @Suns @angelinams112 @CooltownCards @thoraz06 @doreyboo001 @DominicMertz @rezz8910 @OhImAlex @Emack5inAz @Alfredo12398875 @jsandiegoo @nickialanoche @sofiasunss @toeknee216 @Tiffany_Lv_SunS @suns_tutu_fan @Uknowmes1 @SunsJAM GM!!!! ...Rise N' Shine #ValleyProud https://t.co/Ausm89UuMV",
    "307": "The 22-55 Oklahoma City Thunder welcome in the 62-15 Phoenix Suns on Sunday.  https://t.co/o5oSIGdih2",
    "308": "Oklahoma City Thunder vs Phoenix Suns - start time, preview and game thread  https://t.co/lj2ZfdTCSw",
    "309": "Consensus Line Move:\n2022-04-03 Phoenix Suns at Oklahoma City Thunder from 223.50 to 222.50\nUnder never a doubt\n#NBA #betting #innovation #luxury",
    "310": "No..\nFeels a long way from Macari &amp; Greenhoff on a sun drenched day in ‘77. Grit &amp; passion of Robson, Moran, McGrath, Whiteside, Keane, Buchan, Bruce, Irwin, Pallister, Hughes through 80’s &amp; early 90’s. \nThis feels like nothing\nWe’re in the ashes\nWhere’s the Phoenix? #mufc 11/",
    "311": "Went for an early walk. Just over the hill Ridley Scott is filming his upcoming film starring Joaquin Phoenix. #MobileSky #sun #sky https://t.co/WgQg02123y",
    "312": "🔴Live▶ Phoenix Suns vs. Oklahoma City Thunder - NBA League 2022\n🔴Watch Streaming Here➠ https://t.co/Oj9kjzgKVv\n📅 : Sunday, April 03, 2022\n⏰ : 7:00 PM",
    "313": "@lee_mystro @UltimateGswfan @Suns @memgrizz Who never won a ring before joining gsw, and who’s in the play in now ?, who needs whom 😂",
    "314": "Catching up on my @Suns talk from @AZSports and ya'll need to SERIOUSLY dial back the arrogance about predicting blowing out teams right behind in the standings. Gracias for the jinxing and take some pause for pride comes before the fall. #StayHumble #PlayHard",
    "315": "Phoenix Suns vs Golden State Warriors – Full Game Highlights | March 30, 2022 | 2021-22 NBA Season https://t.co/hAZjC8ho35",
    "316": "@HoodieMar29 @Suns @mikal_bridges @CP3 @DevinBook @campayne @JaValeMcGee @DeandreAyton He Definitely needs one!",
    "317": "The @Suns remember what losing is, going down against the @memgrizz. @Yg_Trece is back for the @LAClippers, where they’re holding out hope for #kawhi to return for the #playoffs as well. And @manuginobili is headed for the Hall of Fame.\n\n#ballers #proudwolves https://t.co/0R52yWLNjV",
    "318": "5 reasons why the undermanned Memphis Grizzlies upset the Phoenix Suns - Beale Street Bears https://t.co/4dqDkWKq9D https://t.co/aVAgNPa3Rt",
    "319": "Phoenix Suns vs Memphis Grizzlies Full Game Highlights | April 1 | 2022 ... https://t.co/RS8c4D2Mp4 @YouTube",
    "320": "NBA Basketball Game Betting Picks Simulator: 7:00 PM ET - Phoenix Suns vs. Oklahoma City Thunder - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/b87h4nLyvT #nba #sportsbetting #freepicks #cappertek",
    "321": "@8727Winkyy @Suns You ain’t a die hard suns fan then.  #facts",
    "322": "@ManuelM76131192 @ae_allchin @Kenny58211098 @NBA @Suns @FBI I’m 37 (today actually) and I’m well aware of the Bulls run. I’m married to the biggest Jordan fan on planet earth as well. Im not sure why you’re still here? You called me a Karen and wished me well, remember?",
    "323": "Apr.3🏀#NBA \nContinue👇\n6.Cleveland Cavaliers Vs Philadelphia 76ers\n7.Toronto Raptors Vs Miami Heat\n8.Houston Rockets Vs Minnesota Timberwolves\n9.Oklahoma City Thunder Vs Phoenix Suns\n10.San Antonio Spurs Vs Portland Trail Blazers\n11.Sacramento Kings Vs Golden State Warriors https://t.co/sfn6LL7afE",
    "324": "Sun Phoenix Top Spot v Amari’s Universe\nMon: NFFC 18s v Chelsea 18s Youth Cup\nWed: NFFC v Coventry City\nSat: Lincoln City v Wigan Athletic\n\n⚽️⚽️⚽️🎵 https://t.co/20ZzAPjJdR",
    "325": "🏀GAME DAY🏀 ✈️\n\n🆚 @okcthunder\n🕛 12:00am 🇬🇧\n🎽 ⚫\n\n📊 Record\nSuns: 62-15\nThunder: 22-55\n\n⚔️ Season Series\nSuns 3-0 Thunder\n\nWho's winning tonight?\nComment your predictions 👇\n\n#Suns #SunsUK #RallyTheValley #ValleyProud\n@Suns #NBA75 #NBA #ThunderUp",
    "326": "@arisonsned @outonbluesix Break in the Sun, no. Phoenix and the Carpet, very vaguely, but it would be the 1997 version, when I was 13.",
    "327": "The NBA bubble meant nothing. The Phoenix Suns went UNDEFEATED in their bubble stint, and look at them now.\n\nOh... Oh they're the Number 1 seed for two years in a row? Well this is awkward.",
    "328": "3 Phoenix Suns Players Show Silver Linings from Chris Paul's Injury https://t.co/D9WmtCE8zV https://t.co/2wxGN94FZm",
    "329": "@PapiSoloTweets The @Suns have to be praying that the @memgrizz and @warriors face each other in the second round",
    "330": "Get @K1 some @Suns tickets",
    "331": "@KittyKatDeee @ae_allchin @Kenny58211098 @NBA @Suns @FBI But I don’t know if you were around at the time the Chicago Bulls had the best record and won a championship! You might’ve been about five years old The Golden State Warriors were actually compared to the team do you want to know why? Because the warriors have that record haha",
    "332": "@LilMonsterJDR @cryweirdolmaooo @jvhein2 @Suns As a Suns fan I agree Giannis exposed us last year which is why they beefed up this year's team. No excuses, they just have to go out and win. It will be tougher this year.",
    "333": "@Burritoexp @Suns No, you should make some great food, and watch at home. Maybe give me half of that $14,000. &lt;Ost of it would come back to you anyway. LOL",
    "334": "@ManuelM76131192 @ae_allchin @Kenny58211098 @NBA @Suns @FBI And? You think you did something? 🙄 Already did that. https://t.co/sotKEdxWYa",
    "335": "@ThomasHoops87 @GeeThree @CableTheGuy @KendrickPerkins Dumbest shit. I doubt dude could even define \"culture.\" Rings or no rings, Phoenix is and has been a basketball city for every one of my &gt;40 years here. Suns' city since '68. WCF parades downtown in record heat. PHX was NBA culture twenty years before y'all even had a team.",
    "336": "The phoenix is a part of ancient Greek folklore, a giant bird associated with the sun. It's said to have lived for 500 years before dying and being born again, though there's disagreement about whether that rebirth occurs in an explosion of flames or after regular decomposition.",
    "337": "@recspexstix @NBA @Suns If I was 50 years old I would be retired !!!! And no we all know MJ is the goat six rings no losses😆😆😆 You better go get yourself a job so you can help out your mommy",
    "338": "@sleepnn299 @NBA @Suns Because I like real women not bitches real women not gonna find one calling them bitch😂😂😂😂 https://t.co/0jPwB22krH",
    "339": "@daniok7_ @NBA @Suns Hey so ate three rings https://t.co/wiplppos75",
    "340": "@Apgms_123 @NBA @Suns Let’s go https://t.co/g2LMe9dwje",
    "341": "@DuaneRankin We will have to see. @Suns all day I hope can't afford another heart break 💔.",
    "342": "@Burritoexp @Suns Where can I buy tickets?",
    "343": "Days without @Suns basketball…. I crave basketball…. Who the fuck am I 😂 they’re so fuckin fun",
    "344": "@getabucket_com They better spend they salary this off season on niggas who gone play defense and fire Steve Nash he’s a terrible coach get rid of that phoenix suns coaching staff",
    "345": "@memgrizz @Suns @utahjazz  I wanna thank for all the hate but get your popcorn ready rings baby rings !!! All that work and no rings 😂😂Just think between Klay Thompson Stephen Curry and Draymond Green that’s nine rings bwahhhh @warriors  add Sean Livingston that’s 12 😂😂 https://t.co/iZW28qRHfa",
    "346": "@warriors @Suns @memgrizz Remember there’s levels to this and you guys aren’t the only team who can win without the number one legend best shooter on the planet three point God. It’s all my haters we love you!!! Work on getting to that first one five finals appearances 💯🇵🇷 https://t.co/7OHnlGFlXm",
    "347": "@KatyABateman @outonbluesix Thank you so much! I guess they must have re-run it bc I would have been four in 1976 and not sure I would have remembered it! \n\nDo you remember break the sun, and the phoenix and the carpet?\nhttps://t.co/nkXQdEyepM",
    "348": "@SoniaLovato11 @Suns I have the same feelings as last year.  NERVOUS but EXCITED!",
    "349": "This is my official try out video for the @Suns trynna get that 10 day contract 🔥 https://t.co/WYDxwSJ8Pu",
    "350": "@tiredreixl @Correa_SZN @dubsforever7 @Suns @indeed Rip. I do have some cool college football helmets I collect. I even have customs of D1 teams that have basketball but not football. This is from 2018 so I have some more now lol. https://t.co/6MBBkMkWHi",
    "351": "@MyNBADrakeBull1 @tiredreixl @dubsforever7 @Suns @indeed I like Boise State fs",
    "352": "@MyNBADrakeBull1 @Correa_SZN @dubsforever7 @Suns @indeed I’m not really into it",
    "353": "@Correa_SZN @tiredreixl @dubsforever7 @Suns @indeed Lol. Do you guys watch college sports? I’m a Boise State fan.",
    "354": "@mikeherreraTD's favorite basketball player is your favorite player's favorite player @DevinBook @Suns #mxpx https://t.co/YCyBupNqji",
    "355": "https://t.co/gnmqg3dWJo Phoenix Suns will have to wait to make history after loss to Memphis Grizzlies https://t.co/oP99ahFqBt https://t.co/KgeGggtKj1",
    "356": "@MyNBADrakeBull1 @Correa_SZN @dubsforever7 @Suns @Correa_SZN I think I found Albert Einstein’s secret Twitter account",
    "357": "@Correa_SZN @tiredreixl @dubsforever7 @Suns I normally try to work around likes. Obviously they are important but I feel if you consistently ratio someone and don’t give up you’ve won.(especially with my secret weapon I came up with lol).",
    "358": "@MyNBADrakeBull1 @tiredreixl @dubsforever7 @Suns Silence young one https://t.co/u0Z3CsD3NH",
    "359": "AUTHENTIC NEW Nike Phoenix Suns Devin Booker City Edition Jersey The Valley MENS https://t.co/VSF9a1CHZ7\n\n$199.95  \n\nBuy It Now for only: $199.95\nBuy It Now\n\n#shopping #deals",
    "360": "@MyNBADrakeBull1 @tiredreixl @dubsforever7 @Suns Bro you ain’t ratioing anything wit yo 30 followers.",
    "361": "@tiredreixl @Correa_SZN @dubsforever7 @Suns Yea I guess lol. I usually ratio people that act toxic and to defend my teams but yeah I’m always up for ratioing someone that deserves it lol.",
    "362": "@MyNBADrakeBull1 @Correa_SZN @dubsforever7 @Suns So you’re like a hitman but you ratio instead, that’s awesome",
    "363": "@tiredreixl @Correa_SZN @dubsforever7 @Suns Anyway I can help you ratio someone if you ever need help.I’m a great ratioer. I came up with that one myself.For example I ratioed you to the highest power of the highest number and you can’t come back from that.Just don’t act too toxic to the Suns lol. Good luck in the playoffs",
    "364": "Random stat of the night:\nFTA/game Top 5 Players this season:\nEmbiid- 11.75\nGiannis- 11.59\nJames Harden- 8.47\nJimmy Butler- 7.93\nDeMar DeRozan- 7.83\n\nYou have to go down to #28 to find a Phoenix Suns player, Book at 5.39. \nLMAO",
    "365": "Tough loss for @Suns last night but the trip to Memphis was a blast. Get ready for playoff basketball! #MEMPHIS #SUNS https://t.co/6FwLTG1Oy8",
    "366": "Well I know they felt stupid as hell after this loss🤣🤣🤣🤣 @Suns #GrizzNation #FAroundAndFindOut 💙〽️ https://t.co/Q39ezoRvUT",
    "367": "@tiredreixl @Correa_SZN @dubsforever7 @Suns Have googol amount of googol ratios and counters to the googol power of googol",
    "368": "@tiredreixl @dubsforever7 @Suns Have googol amount of googol ratios and counters to the googol power of googol",
    "369": "@MyNBADrakeBull1 @Correa_SZN @dubsforever7 @Suns Ratio",
    "370": "@MyNBADrakeBull1 @dubsforever7 @Suns Ratio",
    "371": "@Correa_SZN @tiredreixl @dubsforever7 @Suns Have googol amount of googol ratios and counters to the googol power of googol.",
    "372": "@MyNBADrakeBull1 @tiredreixl @dubsforever7 @Suns Ratio",
    "373": "@tiredreixl @dubsforever7 @Suns Ratioing someone isn’t toxic. It’s not that. I will ratio you back if you do though. He came onto our page to talk badly about us and I’m defending my team.",
    "374": "@MyNBADrakeBull1 @dubsforever7 @Suns When you ratio it’s fine but when warriors fans do it toxic\nMaking sense",
    "375": "@tiredreixl @dubsforever7 @Suns He came onto our page acting toxic and I ratioed him accordingly for it. You both can have googol amount of googol ratios and counters to the googol power of googol then. Don’t have a problem with the Warriors but some of the fans act toxic like this.",
    "376": "@MyNBADrakeBull1 @dubsforever7 @Suns This ratio will make booker lose his ring\nOh wait",
    "377": "@MarchMadnessMBB @UNC_Basketball I knew he looked familiar! Said dude looks like Cam Johnson who plays for the Phoenix Sun's, and damn its his brother. 😳",
    "378": "@Burritoexp @Suns We declined",
    "379": "On this day in sports history April 3, Phoenix Suns Point Guard Kevin Johnson recorded 23 Points and 20 Assists in a 117-111 win against the Dallas Mavericks in 1990.",
    "380": "4/2/2009 – Phoenix #Suns President &amp; Chief Operating Officer Rick Welts announced that the Phoenix #Roadrunners would cease operations due to financial considerations following the reg, seas. finale on 4/4/09 after four-yrs in the #ECHL, ending Phoenix Roadrunners hist. for good. https://t.co/2y5yhfjHID",
    "381": "@Burritoexp @Suns 2K for a 65 inch 8K Samsung TV like I bought. You save 12K and Gas Money 💰. I'll just take 1 Breakfast Burrito and a Large Pepsi for saving you all that Doe",
    "382": "@FreeseTrenton @jamesrobinson_3 @NBA @Suns What do you mean",
    "383": "@Suns @mikal_bridges @intel Oh man, it doesn't get much more wholesome than that 💜🧡",
    "384": "@Burritoexp @Suns Mine are 6k for 2 , if we could smoke teams in The wcf n finals that be great for my wallet 🤣",
    "385": "you know im not worried about who the @Suns gonna play in the 1st round, more or less apprehensive to who that'll be exactly..the anticipation and excitement for the playoffs to even begin can be a lil annoying..lol js!",
    "386": "Pre-COVID, used to see Puff all the time at Suns home games when their family moved to Phoenix for Cam’s rookie season. https://t.co/kHq3Vf0kgV",
    "387": "@PowellAnalytics Baseball is my favorite sport, but Paul Westphal (RIP) is my all-time favorite Athlete!  Ambidextrous, terrific shooter, very good coach and apparently great human being. @Suns #Westy #PaulWestphal https://t.co/EgDZHKiHUL",
    "388": "PHOENIX SUNS vs\nOKLAHOMA CITY THUNDER, 7:00PM.",
    "389": "Guess who's back and got fired from his last job and is now waiting for the phoenix suns to get to the nba finals! #NBA #PHX",
    "390": "I know the @Suns are the team with the best record and the number 1 team in the west, but altogether I think the @memgrizz should be in that number 1 spot, but that’s just me and my opinion.",
    "391": "I'm a broken record on this topic. Looking at my Zona Wildcats and more importantly my Phoenix Suns. Boards. End of story. https://t.co/9LWOWUy5Jm",
    "392": "@redditspurs @Suns run started at the bubble when they came out undefeated.. Who knows what dividends this experience can bring out?",
    "393": "@ShonaCleary @Suns Same!",
    "394": "I'd admit I'm not the best at regular season games \n\nbut when it comes to tournaments and finals, I'm a beast\n\nlast time we got dogged was Phoenix Suns . way back in yonders",
    "395": "@NBA @Suns Who remembers. Haha my bad warriors are going for chip 4 !!!! God I feel spoiled https://t.co/eLaqw8Vmsw",
    "396": "@ESPNNBA @Suns  Just think the warriors have not played their best https://t.co/iZW28qRHfa https://t.co/DCBUHQHD7j",
    "397": "@Burritoexp @KROPPTOP @Suns I stood in line for 7 hours for 2001 Dbacks World Series tickets 1 &amp; 2. Sold half to a broker, paid for all of the tickets. Didn't lose a minute of sleep wonderin' who got them.",
    "398": "@KingPoe617 @kirkgoldsberry @memgrizz @Suns @Timberwolves @celtics @Raptors @nyknicks @BrooklynNets @Bucks @Lakers @chicagobulls Thad Young has been on the team 6 weeks, barely plays and will be gone in 2 months. Aside from him, the oldest player we have is 28. Lol! Again, we have the least NBA experienced team in the league.",
    "399": "@KealiaOhai @JJWatt The greatest!!!! @suns @UNC_Basketball #MFinalFour https://t.co/1YsIeq7Tf2",
    "400": "@brsucks2 @ssgrady7 @Suns I just got laid before tweeting this. Crazy I can’t still get hard but anyway wym what my team has done I’m just defend the grizz and Ja. They are second in the west with the second youngest team what else to say?",
    "401": "@LilMonsterJDR @AZCardinalsSF @asvpbilli @Suns @FanDuel No one ever has stalked you. You ain't that special. Your just jealous of the suns. Keep being the suns biggest fan though",
    "402": "@Burritoexp @Suns *A ticket to a game in Denver*",
    "403": "@Burritoexp @Suns If we somehow end up playing Denver in the playoffs, I’ll get one of your tickets if you bring me a burrito.",
    "404": "@JerryEsophagus @ssgrady7 @Suns So tell me exactly what your team has done. Jerry I’m bouta be on your fucking ass until it’s time for me to get laid and go to bed.",
    "405": "@Burritoexp @Suns I sell about half the games to cover the costs",
    "406": "@YoungFocusBA @Suns Haha, that’s the tweet. Don’t go to work and vibe with the familia.",
    "407": "@Burritoexp @Suns Maybe buy two, do a hat draw for the first game, then take those names out, pull for 2nd game, ect. ect. until everyone you invite goes, then start over. And you get to go to all the Finals games lol",
    "408": "@RkyMtnSunDevil @Suns Looks like we gonna get along really nice.",
    "409": "@Burritoexp @Suns Haha, now i have a fear of dying at work. Thank you bro 😅",
    "410": "@RkyMtnSunDevil @Suns I drink a lot. https://t.co/gXMnvpzJRT",
    "411": "@YoungFocusBA @Suns No one, dying, ever said I wish I would have spent more time at work. My brother just gonna have to deal with it, think imma do it.",
    "412": "@Burritoexp @Suns Drinks on me at each game",
    "413": "@DevioxusAJ @Suns Warriors should be no1 in this list lol.",
    "414": "@Burritoexp @Suns No problem 1997 left to go since earlier today. Treat yourself and the family. Just my opinion but i am sure you and your family will love the memories",
    "415": "@wackus1 @Suns Rodney…..that is the truth. My Bro is my business partner, how can I convince him? https://t.co/A5Cdmg5BKy",
    "416": "@RkyMtnSunDevil @Suns Think the familia is Fu@k@d😞",
    "417": "@8727Winkyy @Suns Yeah because regular season and playoffs are the same.  Just keep thinking that!",
    "418": "@ZackToTheFuture @Suns I wouldn’t roast anyone for the seats.",
    "419": "@Burritoexp @Suns Life is about experiences and to be able to see the suns make a run and possibly win the championship is once in a lifetime!! You have to go!!",
    "420": "@Burritoexp @Suns Think of your neighbors too.",
    "421": "@Burritoexp @Suns No. I'm talking about my seats haha. I could see how you could confuse what I said 🥴🥴",
    "422": "@beardownjj @Suns Word. Let’s make a deal.",
    "423": "@RkyMtnSunDevil @Suns Great plan. Lemme think about it.",
    "424": "@mbegay @Suns Great bro, thanks for the love. Hope you bragging to.",
    "425": "@Burritoexp @Suns Gotta do it.  Sell a few games to Suns fans",
    "426": "@YoungFocusBA @Suns Hahahaha. Love your answer go the problem. Guess I need go start grinding.",
    "427": "@Burritoexp @Suns Buy them and sell some!",
    "428": "@8727Winkyy @Suns @LilTunechi Sorry to say but you're not a suns fan then.",
    "429": "@Burritoexp @Suns Thats like 2,000 steak egg and cheese burritos you got this!",
    "430": "@DukePizzle @suns_tutu_fan @Suns_Armband @angelinams112 @DevinBookerMVP @toeknee216 @Suns @SunsNationNBA I have that same towel with KJ sweat on it!!",
    "431": "@LordAiden1 @Suns 😱😱😱 really???!!! I didn’t. Know that. ☹️",
    "432": "@Burritoexp @Suns Knock it down to 2 seats, forget the family, take me.",
    "433": "@Burritoexp @Suns I have a $17,000 for 2 tickets",
    "434": "@Burritoexp @Suns To be honest, you could probably make a killing just selling 1/2",
    "435": "@NBA @Suns to get smacked in the finals again..",
    "436": "@n0ahTann3r @zaccccc__ @8727Winkyy @jeremeaz @Suns Taking a picture with his favorite player",
    "437": "To do or not to do? @Suns playoff tix. 4 seats, would be $14,000 if i need to buy all games. I’m not a rich man and I have a huge familia. Decision got me twisted up🤷🏽‍♂️I know these are 1st world problems. Much love to the homies dealing with real shit, fr fr. God bless y’all.",
    "438": "@coopurr_ @Suns Bro this is a copy and paste comment with very few changes",
    "439": "You’ve heard of sun tea, yes, but have you ever had @Suns tea?\n\nI’ll show myself out https://t.co/p4hLxRGDFa",
    "440": "Caleb love you are a Phoenix sun",
    "441": "Just a couple of UNC guys hanging out having a laugh.  Here's hoping Roy Williams is in Phoenix in a couple of months rooting on Cam and the Suns as they play in the NBA Finals. https://t.co/7DxFrQzfDc",
    "442": "@ShonaCleary @Suns Cheers to that!! 🥂🏀🙏🏻 Go Heels &amp; Go Suns!!",
    "443": "@rmaxey1 @Jonny11602 @AlexIrving23 @Suns They gave them nothing to scout lol",
    "444": "@SunlessKhan The Phoenix Suns",
    "445": "@jlinehan9 If the Jazz don't care, then neither do I.  Ordering some Phoenix gear.  Go Suns.",
    "446": "@LakeShowYo Phoenix Suns",
    "447": "Since the Phoenix Suns clinched the top seed in the #NBA75, its necessary for these three to give them time to rest for a run in the postseason. #ValleyProud https://t.co/epN4XIwfnC",
    "448": "@suns_tutu_fan @Suns @mikal_bridges @CP3 @DevinBook @campayne @JaValeMcGee @DeandreAyton I need to get the Point God one!!! And why doesn’t 99 have one!?",
    "449": "@8727Winkyy @zaccccc__ @jeremeaz @Suns It ain’t how you took it it’s what you took it next too.. and we’ll now ya have lil bro",
    "450": "Dear, @Suns please draft @MarkWi1liams",
    "451": "@n0ahTann3r @zaccccc__ @jeremeaz @Suns Lmao never seen someone so worried about how the next man takes a picture",
    "452": "@zaccccc__ @8727Winkyy @jeremeaz @Suns But fr imagine posting up next to a trash can ‘aye bro take my pic’",
    "453": "@LakeShowYo Phoenix Suns.",
    "454": "@zaccccc__ @8727Winkyy @jeremeaz @Suns LMAAAOOO😭😭😭😭 violated that mannnnn gaw daYUM",
    "455": "@8727Winkyy @n0ahTann3r @jeremeaz @Suns So none of them",
    "456": "This Phoenix Sun got me doing one thing a day then I’m beaatttt🥵",
    "457": "@AlexIrving23 @Suns Kick thw Nets ass wverytime we see them ;)  I shutter to think what tue Grizzly bench would do to the nets",
    "458": "NBA Basketball Game Betting Picks Simulator: 4/3/2022 7:00 PM ET - Phoenix Suns vs. Oklahoma City Thunder - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/b87h4nLyvT #nba #sportsbetting #freepicks #cappertek",
    "459": "@Garbsqueege @DevinBook @JaValeMcGee @Suns happy for the kid that’s amazing!",
    "460": "https://t.co/gnmqg3dWJo Phoenix Suns at Memphis Grizzlies Watch Party| Best Bettor Podcast https://t.co/gV9rkFIvFn https://t.co/KgeGggtKj1",
    "461": "4/2/95 – David Robinson (23p/4r) hit 2 FTs w/21sec left &amp; Charles Barkley missed a jumper as the Spurs beat the Phoenix #Suns 109-106 despite Chuck's 45p/10r &amp; 4-8 from 3 (2p off his reg. season career-high). SA won their 11th straight. KJ: 16p/10a. Elliott: 30p/9r. #ValleyProud https://t.co/R5gJT0qrw9",
    "462": "@Suns Would love to be a fly on the wall to that embrace 🙂",
    "463": "@n0ahTann3r @jeremeaz @Suns I’m a grizzlies, warriors, nets, suns, and 76ers die hard fan lil bro.",
    "464": "@ajspapa @PleasantValerie @KendrickPerkins Means what exactly and who will remember the regular season series ? They remember the conference and league champs. So like I said, western conference and best overall record, great job @Suns",
    "465": "Why some people be saying bad things about #phoenix#suns just because they lost one game \n 🤷‍♂️ we still going win the championship🏀🏀🔥🔥🔥\n      #2022nba champions \n              #1inthewest",
    "466": "Sun Dancer, Oracle of the Phoenix. I've been wanting to do an all out digital drawing, and got inspired by an old piece I never finished. Anyone else fascinated with phoenixes :3? https://t.co/1c3mCkyOWD",
    "467": "Thanks for supporting the Basement Goblins tonight! Hope everyone enjoyed the Awko Phoenix interview at the end (I know I did lol).\n\nWe take the series 2-0 vs TU. Puts us in pretty good standing for the Playoffs at the end of this league. \n\nStream Sun! Match #5 Mon! See you then!",
    "468": "@jeremeaz @8727Winkyy @Suns Maannnn you really did em like that 🤣🤣🤣",
    "469": "🏀 The Los Angeles @Lakers are playing the Denver @nuggets and the Phoenix @Suns in their next two games.\n\n🤔 How much chance then to see these two in the playoffs? https://t.co/HixIO70svL",
    "470": "@JustTheTip_18 @Suns That’s fair, and I won’t argue that. Just seems like folks get mighty critical after one of their VERY few losses.",
    "471": "4/2/91 – Benched for 3min early in the 3Q for not playing aggressively enough, KJ scored 16p that quarter and finished w/37p/20a (his season-high in A's) as the Phoenix #Suns (50th win) cruised to a 131-117 win over Utah. X-Man: 28p/12r. Hornacek: 18p. Majerle: 17p. #ValleyProud https://t.co/TxyXwDXFzF",
    "472": "Check out Devin Booker 2020-21 Hoops Vanity Plates Phoenix Suns +Chronicles, Contenders https://t.co/M1xFaYq6ID #eBay via @eBay",
    "473": "Check out Devin Booker 2020-21 Hoops Vanity Plates Phoenix Suns +Chronicles, Contenders https://t.co/M1xFaYq6ID #eBay via @eBay",
    "474": "@camjordan94 @Suns my two faves",
    "475": "@camjordan94 @Suns His brother is Puff Johnson and is playing for the Heels tonight off the bench.",
    "476": "@ImranOsja @memgrizz @Suns Backups beat you guys… Cope and come back stronger!",
    "477": "Ooooooo cam Jordan johnson  from the @Suns went there so we have someone  that had my first and las name as there first and middle 😹 https://t.co/vr9PHhrmXH",
    "478": "@Suns So glad he’s there to watch his little brother play❤️❤️❤️",
    "479": "@TwiTati @memgrizz @Suns Ravens and raptors are your teams? I see where the need to take your anger out on other people comes from 😂🤡",
    "480": "I'm at Sun Circle Trail in Phoenix, AZ https://t.co/yjRY3xy7mf",
    "481": "@Suns Free jersey?",
    "482": "Hey @LeBatardShow @Stugotz790 funniest thing from the weekend:\n\nDan last Tuesday: “The Grizzlies aren’t as good as Phoenix”\n\nGrizzlies beat Suns without Ja and 3 other starters 😏",
    "483": "@goomvi Crazy how every team except the league-leading Phoenix Suns is fake",
    "484": "4/2/71 – The Phoenix #Suns acquired Otto Moore from the Detroit Pistons for future considerations (1972 1st: Bob Nash). Moore also signed a contract w/the Virginia Squires of the ABA in March so the Suns had to litigate his rights to make the ABA contract invalid. #ValleyProud https://t.co/DtwiBR1r5s",
    "485": "Phoenix Suns’ Mikal Bridges nears top of NBA’s DPOY betting odds https://t.co/2q6pzdeU7c",
    "486": "@KTeaiwa @Suns Finally got to see your show Katerina! I am still buzzing with excitement",
    "487": "Go PHOENIX SUNS",
    "488": "@8727Winkyy @Suns Let's see how many tweets I can make him delete \n\nhttps://t.co/ChELybloN1",
    "489": "Phoenix Suns’ Mikal Bridges nears top of NBA’s DPOY betting odds https://t.co/A0HZj44c9p",
    "490": "@jeremeaz @8727Winkyy @Suns hes just a fatherlass troll bro dont take it serious",
    "491": "PHOENIX SUNS",
    "492": "Phoenix Suns",
    "493": "Phoenix Suns 💜🧡",
    "494": "@8727Winkyy @Suns Throwing around \"we\" pretty loosely bro \n\nhttps://t.co/Wl5ZhVc087",
    "495": "@Suns we love a supportive big brother",
    "496": "@12xIso Still a mile away from 1st place \n@suns though…..",
    "497": "@Suns As a die hard suns fan I don’t think we making it to the finals grizzlies will beat us",
    "498": "@Suns Win a ring",
    "499": "@Suns Win the next game",
    "500": "Made it right in time from shoot around. 😉\n https://t.co/zDW9VlpoY0",
    "501": "@NBA2K @Suns @celtics @MiamiHEAT @warriors Put poole up more",
    "502": "The @Suns on Tuesday 🤣😂 https://t.co/yXjPwhFh6w",
    "503": "@suns or anyone familiar—when it says TBA for time of game 4/10/22 when is the latest that the time will be announced?",
    "504": "@PHXFansApp Suns may be the team to mathematically eliminate the Lakers on Tuesday night in Phoenix!  Now, how awesome would that be!",
    "505": "Phoenix Suns vs Memphis Grizzlies Full Game Highlights | April 1 | 2022 NBA Season #Phoenix #Suns #NBA Video: https://t.co/5QBHr5Zusf",
    "506": "Phoenix Suns vs Memphis Grizzlies Full Game Highlights | April 1 | 2022 NBA Season #Memphis #Grizzlies #NBA Video: https://t.co/AwCMok3o5l",
    "507": "@LilMonsterJDR @DavidGo91665851 @DbookVibes @quetricc @Suns J, you probably work at like Payless.  Whether the suns win or loose ain't got nothing to do with you buster",
    "508": "@DevinBook #SHIBLITE LOVE THE @Suns and @DevinBook . Most Dominant team in the NBA",
    "509": "@Suns @LilTunechi Clean.",
    "510": "@Suns I'm with Craig 🤷‍♂️",
    "511": "@GoldinCo @DeandreAyton @Women_Win @Suns @PhoenixMercury @PUMA @PUMAHoops Lot of people depending on you for fantasy playoffs tomorrow. Take your rest next week big dog. Let’s go",
    "512": "I make fun of the @suns a lot but they’re gonna go all the way this year congratulations @cp3 on your first title",
    "513": "Forgot to say this but Rogue really is the Phoenix Suns in the way of execution. Of course they are going to have their weakness but yeah point still stands.",
    "514": "@JJWatt @Suns get this man court side seats every Suns home game for the playoffs! AZ legend in the making",
    "515": "@wprofastpitch @smashitsportsfp @USSSAPride Great stuff. I’m merely a HS sportswriter in the softball hotbed of the NW Valley of the Sun (Phoenix). I put together a women’s pro softball league proposal after watching the AZ HS finals and WCWS last summer.\nI was curious, do you envision WPF as national or regional to start?",
    "516": "@robmaxwell2 @Suns @planetfootprint I don’t watch Star Wars buddy",
    "517": "Phoenix Suns\n\nSHAIBIE ASAPCOMEBACK",
    "518": "@cornskiii Baby they are looking like the old Phoenix Suns 🥴 God save the City Of Angels. They got us out here looking raggedy. 😭😪",
    "519": "Bring back 2018 @Suns. Who's with me?! https://t.co/FdMmznezIx",
    "520": "JJ rocking that @suns jersey!!! #RallyTheValley https://t.co/A6vvSAXuZi",
    "521": "[Post Game Thread] Your Memphis Grizzlies (55-23) win at home against the Phoenix Suns (62-15), 122 - 114\n https://t.co/mBt7pwu4tv #cliptags",
    "522": "@Suns @planetfootprint Will the resting players still be at OKC game?",
    "523": "🖼: The evolution of the @Suns logo! https://t.co/ak7PgmcadU",
    "524": "Made to Phoenix and took this picture of Suns Twitter https://t.co/MGQQIt3eg6",
    "525": "@dysothy @Suns @LilTunechi Nigga really said booger😭🤣",
    "526": "@Suns @planetfootprint Free jersey?",
    "527": "@Suns @LilTunechi Will Devin be at the OKC game even if they are resting him?",
    "528": "@robmaxwell2 @Suns @planetfootprint Idk who that is pal.",
    "529": "@MamaNeedsPax It’s the Phoenix Suns year!\n\nTS: domeng23",
    "530": "The @Suns completely deserve to win this year. https://t.co/DUFNwnEnSH",
    "531": "Ochai Agbaji YOU are a Phoenix Sun. https://t.co/nfRHo9Ej97",
    "532": "@Lofoir @tcani @Suns @PhoenixMercury That's chump change compared to the gambling $ windfall  @DougDucey delivered for his buddy.  Two teams two licenses.  I'm sure there is a backend for @DougDucey as well.",
    "533": "@CJ_Johnson17th Yea right Lakers probably won't make the playoffs. If they do the Phoenix Suns will sweep them first round.",
    "534": "@offspring I was gonna take my son when he was 5 for a “rock ‘n roll concert”. Then COVID. I just got him and my stepson tickets for Phoenix in April! My son’s fav songs are also mine. 1) Staring at the Sun and 2) Have you Ever.  Phoenix 2022, his name is “T”, future microbiolog",
    "535": "@SinanRubaye @Suns @memgrizz @JaMorant @Jumpshot8 Memphis won't make it past Lac 🤷‍♂️",
    "536": "The phoenix is an immortal bird associated with Greek mythology that cyclically regenerates or is otherwise born again. Associated with the Sun, a phoenix obtains new life by arising from the ashes of its predecessor. https://t.co/Mv4ws4SVdE",
    "537": "Draymond Green reacts to Jordan Poole’s 38-point explosion vs. Suns\n\n The 22-year-old guard is averaging career highs in points, rebounds, and assists. After the game against the Phoenix Suns, Draymond Green shared how pleased he was...\n\nRead More: https://t.co/bZ0TUaUNn5 https://t.co/OCrB7A1yQ2",
    "538": "Draymond Green reacts to Jordan Poole’s 38-point explosion vs. Suns\n\n The 22-year-old guard is averaging career highs in points, rebounds, and assists. After the game against the Phoenix Suns, Draymond Green shared how pleased he was...\n\nRead More: https://t.co/OL37PFW6ZB https://t.co/191DAhxS3d",
    "539": "@KrauseHouseDAO Book a bad bad man. Sols gonna win their first Chip. @Suns",
    "540": "right now it's the Phoenix Suns who won 60+ wins https://t.co/ZbeSqhMree",
    "541": "Lol I’d put this Kansas team up against the fucking Phoenix Suns at this point. If you shoot 90%, you’re gonna win.",
    "542": "@Suns @LilTunechi Love 💜🧡🔥🏀🐐",
    "543": "@iREPPHOENIX @BallsackSports @Suns Lebron is not going to the Suns",
    "544": "Phoenix #Suns resting Devin Booker, Deandre Ayton and Jae Crowder for Sunday's OKC game https://t.co/8R5DUrIkxH via @azcentral",
    "545": "@ImranOsja @Suns just wanted to see him play :(",
    "546": "@Suns @planetfootprint This is my sustainability! Go @Suns !! https://t.co/o0cJdXdknY",
    "547": "@cryweirdolmaooo @JaylenKnowsBall @Suns Do you not remember the refs ejecting our coach because they let you guys football tackle our player or is the Arizona Heat getting to your head",
    "548": "@stephenasmith @SoFiStadium Mark my words @Suns @Bucks sequel this June",
    "549": "@Clifftheusher @suns_tutu_fan @Suns @mikal_bridges @CP3 @DevinBook @campayne @JaValeMcGee @DeandreAyton Let me know when it hits!",
    "550": "@Suns @planetfootprint Booker sucks",
    "551": "Rally the Valley to help protect our planet! 🌎 Show us how you're sustainable for a chance to win courtside tickets!\n\n📄: https://t.co/Mp3K15IQai\n\n@planetfootprint | #SustainableSlamDunk https://t.co/gyVvdaNSui",
    "552": "[Post Game Thread] Your Memphis Grizzlies (55-23) win at home against the Phoenix Suns (62-15), 122 - 114\n https://t.co/mBt7pwMdHD #cliptags",
    "553": "We @Suns fans couldn’t be more proud of them boys👏🏼 https://t.co/6bd7srS8yR",
    "554": "@tcani @Suns @PhoenixMercury Sarver has spent 200k on Ducey &amp; GOP PACs from 2017-now https://t.co/ZTUTrety3n"
}