{
    "0": ".@OrlandoMagic coach Jamahl Mosley talks the road trip and how Cole Anthony's decision making has been a big part of his early success this season. \n\n📺: Bally Sports Florida\n💻: https://t.co/XlN65KAXx3\n📱: Bally Sports app!\n\n#MagicTogether #NBA https://t.co/v76OgKeJPx",
    "1": ".@OrlandoMagic coach Jamahl Mosley talks the road trip and how Cole Anthony's decision making has been a big part of his early success this season. \n\n📺: Bally Sports Florida\n💻: https://t.co/MpbodJrOFS\n📱: Bally Sports app!\n\n#MagicTogether #NBA https://t.co/3fvgiqoNzl",
    "2": "Jalen Suggs returns to Target Center tonight as the Timberwolves host the Orlando Magic. The Tigers battled Suggs and Minnehaha Academy twice on the same floor at the Minnesota Class AA State Tournament in 2017 and 2019. https://t.co/ld7ajmDe8y",
    "3": "@OrlandoMagic starting the season 1-6… https://t.co/45P2RWseRM",
    "4": "Jamahl Mosley the most handsome Orlando Magic head coach? 🤔",
    "5": "@Fitzmagic_Fan @OrlandoMagic No, he’s awful",
    "6": "Orlando Magic @ Minnesota Timberwolves\nPick : Orlando Magic.\nBasketball. NBA",
    "7": "Here is tonight’s (11/1) pregame media session with @OrlandoMagic Head Coach Jamahl Mosley:\n\n#MagicTogether \n\nhttps://t.co/WoNlk4ertG",
    "8": "\"It's been a little emotional, honestly.\"\n\n-@jalensuggs on playing his 1st pro game in his home state.\n\n@OrlandoMagic l #MagicTogether https://t.co/LqnVtTlynT",
    "9": "\"It's been a little emotional, honestly.\"\n\n-@jalensuggs on playing his 1st pro game in his home state.\n\n@OrlandoMagic l #MagicTogether https://t.co/1TvuuFxfUA",
    "10": "@OrlandoMagic Play robin Lopez",
    "11": "@JustinSky_ @OrlandoMagic I’m digging the new vibes",
    "12": "A young Pat Williams woos singer Andy Williams to sell #NBA tickets. Here’s the story. #basketball #sportshistory @TheWORD_Orlando #orlandomagic #76ers\nhttps://t.co/zQnY5knemo",
    "13": "Pre game flow at @TargetCenterMN with the @Timberwolves and @OrlandoMagic https://t.co/YWbkuGg7ou",
    "14": "Orlando Magic +9 &amp; sprinkling some on that ML +300 https://t.co/abh8vnplQC",
    "15": "@SoulSeekerDANTE @OrlandoMagic This lineup with Isaac and markelle will go crazy",
    "16": "#NBAMagicPolls after the first 15 games can we get to a respectable 5-10 record?\n\n#OrlandoMagic #MagicTogether  #WeGotAlotPopping #MagicSzn2021\nWE💥G O T💥ALOT💥P O P P I N G",
    "17": "My Monday Slate\n\nNBA\n🏀 Memphis Grizzlies ML vs Denver Nuggets\n🏀 Chicago Bulls/Boston Celtics U216\n🏀 Orlando Magic +9 vs Minnesota Timberwolves\n\nNFL\n🏈 New York Giants +10.5 vs KC Chiefs\n\nNHL\n🏒 Seattle Kraken +1.5 vs Edmonton Oilers",
    "18": "@OrlandoMagic @JJudahIsaac When we get him back@I hope he can lead us",
    "19": "@OrlandoMagic @chuma_okeke Looking to see if he can elevate his game this season",
    "20": "I see there's a @Timberwolves have got a game at midnight (UK time, obviously) against @OrlandoMagic. Who needs sleep anyway, right?",
    "21": "Those new Orlando Magic Unis 🔥",
    "22": "@OrlandoMagic This to me is our most effective starting lineup",
    "23": "#NBA #NBATwitter Today's Lineups\n\n#MagicTogether \nOrlando Magic Starting 5:\nCole Anthony\nJalen Suggs\nFranz Wagner\nWendell Carter Jr\nMo Bamba\n\n#RaisedByWolves\nMinnesota T'wolves Starting 5:\nD'Angelo Russell\nAnthony Edwards\nJaden McDaniels\nJarred Vanderbilt\nKarl-Anthony Towns",
    "24": "I'm at @TargetCenterMn for @Orlando_Magic vs @MNTimberwolves in Minneapolis, MN w/ @shauntae93 @renegade528 https://t.co/gzMEHegKuf",
    "25": "@OrlandoMagic Win the game #MagicTogether",
    "26": "Now that would be fire man. We need this @OrlandoMagic https://t.co/mI12vBysNJ",
    "27": "@OrlandoMagic Second dub of the season today",
    "28": "Tonight's starting lineup for the Orlando Magic: Anthony, Suggs, Franz Wagner, Carter Jr., Bamba https://t.co/bVWH4Av1bs",
    "29": "new game. same five. ⬇ https://t.co/KQQmPeRz61",
    "30": "The @OrlandoMagic starting Anthony, Suggs, F. Wagner, Carter, Bamba on Monday. #LetsGoMagic #NBA",
    "31": "Magic and Timberwolves (at @TargetCenterMn for @Orlando_Magic vs @MNTimberwolves in Minneapolis, MN w/ @shauntae93) https://t.co/WM4eNf8SrM",
    "32": "@CeeGeeThree2 @sportslogosnet @OrlandoMagic Just need to invert the colours. https://t.co/jHcprEp8ZN",
    "33": "7. whatever the orlando magic scheduled for their halftime show https://t.co/0gUD2l0eqC",
    "34": "New York Knicks - Toronto Raptors\nMinnesota Timberwolves - Orlando Magic\nLos Angeles Clippers - Oklahoma City Thunder\n\nBet slip link: https://t.co/JDX6nB81ru https://t.co/SmmMkf2ynZ",
    "35": "@DavidBaumannORL @OrlandoMagic Nice contributions from our “stabilizing” vets…",
    "36": "I need the Orlando Magic to make a jersey with Mickey Mouse on it",
    "37": "Don’t have an NBA affiliation but being from Florida I’m between @OrlandoMagic and @MiamiHEAT. New Magic jerseys might’ve sold me...",
    "38": "It still pains me that @SHAQ left the @OrlandoMagic. It was hard to accept this sight  until the @Lakers moved into @STAPLESCenter and I thought, \"They built that place for Shaq\" because @TheForum was too small for his massive presence. #MagicTogether #LakeShow #NBA75 #NBATwitter https://t.co/MVJ6l2OvXm",
    "39": "Programming Alert: I'll be helping out @osmattmurschel by covering some Orlando #Magic games this month, starting tonight as Jamahl Mosley's squad faces the Timberwolves at 8pm.\n\nThe @OrlandoMagic are looking forward to a five-game home stand, Mosley said. https://t.co/GUyagJ6q4T",
    "40": "@big_upps @easttman @OrlandoMagic The issue is for the city, they want to do something “different”…. \n\nThe problem is literally they just need to make that city version in blue/white/black our full-time jerseys????? \n\nIf you do that, give me an orange alternate jersey idgaf",
    "41": "@JcGrady1 @DavidBaumannORL @OrlandoMagic mosley has the players now to get more out of the bench..clearly doesnt have the common sense to rotate and stagger subs",
    "42": "Are the new @OrlandoMagic Jersey for sale yet? Thinking a suggs one for surev",
    "43": "Tonight’s Rising Star Play of the Day is:\n\n@Timberwolves -4 (-135) 1st Half vs @OrlandoMagic \n\nPresented by @DeadPresPicks @Joes_Picks make sure to visit https://t.co/Z2wbS8Oedi for my @btvbets Play of the Day! https://t.co/ZrGP9b96kS https://t.co/gwwR6ZF9Xh",
    "44": "@RLDURHM @OrlandoMagic Miami city jersey are 🔥even tho I hate the team 😹",
    "45": "@ZagsinNBA @jalensuggs @OrlandoMagic Definitely needs to get his efficiency up, once fultz and issac come back his assists should go up too",
    "46": "GAME #8\n\nThe @OrlandoMagic head to Minnesota to take on the @Timberwolves!\n\nPregame starts at 7:30 PM with @JakeChapmanOM with tip off set for 8 PM on @969thegame https://t.co/uz5MnensUG",
    "47": "@JcGrady1 @OrlandoMagic Yes, starters have done their job in a big way. A healthy Fultz and Isaac will make a difference, especially for a guy like T Ross.",
    "48": "@JohnDenton555 do you still write? @TheAthleticNBA has an open roster spot for @OrlandoMagic coverage. 👀",
    "49": "NBA Basketball Game Betting Picks Simulator: 8:10 PM ET - Orlando Magic vs. Minnesota Timberwolves - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/Ryppf11dOE #nba #sportsbetting #freepicks #cappertek",
    "50": "@ddoherty24 @Twolves_PR @OrlandoMagic @MasonDoherty11 @jalensuggs @Timberwolves @STPHSActivities Was great to see you both!",
    "51": "@OrlandoMagic @jalensuggs @RjHampton14 I love the classic design with these colors!!!!!",
    "52": "Thanks so much @JonKrawczynski @Twolves_PR @OrlandoMagic for helping @MasonDoherty11 reconnect with @jalensuggs before tonight’s @Timberwolves game. Let us know, Coach Mosley, if you need a last second shot drawn up. @STPHSActivities https://t.co/CQCCYkAMHZ",
    "53": "@stop2116 @OrlandoMagic @jalensuggs bro you must have no idea what’s going on with Orlando 💀 this is the first year of a rebuild..:the coach was straight up told to focus on development rather than winning...why are you rooting for wins?? That’s going to fuck up the draft pick...",
    "54": "@stop2116 @OrlandoMagic @JJudahIsaac why the hell would they rush him back and A) risk winning too many games and B) risk another injury when you can just take your time. This team does NOT need to win this year. Same reason Fultz is out.",
    "55": "@DavidBaumannORL @OrlandoMagic Best starters vs Worst bench. Mosley have work to do. Hope Fultz and Isaac would help with that.",
    "56": "@easttman @OrlandoMagic I really want to know what goes the the minds of the people in charge of it. “Oh this is what the people wants and looks really good? Cool, let’s do the exact opposite!”",
    "57": "@DavidBaumannORL @OrlandoMagic You can compare with this one: https://t.co/gzl60DSBvp",
    "58": "Pregame with the @OrlandoMagic and Coach Mosely. The Magic are in Minnesota to face the @Timberwolves tonight. This is a homecoming for @jalensuggs as well. #MagicTogether #NBA75 https://t.co/jCA8DQR0TK",
    "59": "@DavidBaumannORL @OrlandoMagic Let’s talk about that soon😉. Let’s pick up that DM convo for scheduling",
    "60": "@OrlandoMagic where do I send my money and what’s the postage damage to Gold Coast 🇦🇺 ??\n\n#fresh #orlando #magic #orlandomagic #mixtape #edition @NBA #NBA https://t.co/gBqkmQqO4j",
    "61": "@TStapletonNBA AK-47 Clone!! I live in Orlando and the only time I went to Magic Games a Superstar had to be playing here that night! I'm excited about these Youngsters Franz Wagner,Jalen Suggs and including Mo Bamba!",
    "62": "@Stephen0610 @OrlandoMagic Agree on all of it and I’m not worried about Suggs’ slow start. He’ll be fine.",
    "63": "@DavidBaumannORL @OrlandoMagic It’s been a bit rough, the good thing is Cole looks great, Franz looks solid, Suggs you can see is figuring things out, Mo Bamba is not a bust… but yeah… some stuff needs to be tightened up for SURE!",
    "64": "The @OrlandoMagic have a top 3 jersey in nba history, yet they keep making orange alternative jerseys…… get a grip",
    "65": "@OrlandoMagic You guys suck so bad at this. Fix the collar ffs.",
    "66": "A friend sent me this today… The @OrlandoMagic have 3 of the 8 worst plus-minus marks in the NBA among 427 players. And Terrence Ross is last by a wide margin. (This could change with as the Magic roster gets healthier, the team has been down 3 starters.) https://t.co/BOpGOB1bLV",
    "67": "Today's NBA Picks: 8:10 PM ET - Orlando Magic vs. Minnesota Timberwolves - 34 PICKS AVAILABLE: https://t.co/V4VAEE7qZi #nba",
    "68": "9 NBA games on tap tonight. I’m personally only betting 4 of the 9.  Just don’t like some of the odds. Here’s my picks \n\n#orlandomagic +8.5 -105\n#Grizzlies m/l -105\n#wizards #atlanta under 223 -115\n#Hornets -5 -110\nBulls Celtics might be a last minute addition. \n#NBA75 #FreePick",
    "69": "@BallyMagic @OrlandoMagic It aint like he gonna play hard. He's very inconsistent.",
    "70": "@jmprice86 @OrlandoMagic Ah yes. Pick is Minnesota -5.5 in 1H\n\nSorry for the typo",
    "71": "@pick_nba @OrlandoMagic So,  Minnesota is the pick?",
    "72": "Mo Bamba is quietly averaging 13.1 points, 1.9 threes and 1.9 blocks per game with a 61.3 eFG% 😳\n\n@esidery writes that Bamba is finally breaking out with the Orlando Magic:\nhttps://t.co/HltBl13ihu",
    "73": ".@OrlandoMagic rookie Jalen Suggs returns home to Minnesota for the 1st time in his #NBA career to take on Anthony Edwards and the #Timberwolves!\n\nWatch pregame at 7:30p on Bally Sports Florida. \n\n#OrlandoMagic #MagicTogether https://t.co/nyjDBh5rsn",
    "74": "@BlackLightning5 @OrlandoMagic The Magic's City Edition jersey is far from the only one without a conventional geographic identifier.  BKN, IND, LAL, LAC, SA, MIN &amp; PHI are some of the other clubs that don't have their geographic identifiers on their City Editions.  The orange didn't come from out of nowhere.",
    "75": "@OrlandoMagic @JJudahIsaac When tf is Isaac going to play ? Dude has been out for like 2 years now ?",
    "76": "@JakeRakoci @OrlandoMagic It’s just an alternate. But I agree I’m tired of the orange.",
    "77": "@OrlandoMagic @jalensuggs Can we win a damn game before we start having to talk about next season already 😡",
    "78": "Surely T Ross is worth a prospect or a 1st. A number of teams will be looking at him &amp; he does deserve a run with a contender. What’s a fair trade Magic fans? #orlandomagic #nba  https://t.co/vYejbF3Fqu",
    "79": "Yes. The @OrlandoMagic rebrand to Orange colors is 🗑 https://t.co/GIg5H289Zi",
    "80": "@OrlandoMagic maybe it’s a november fools joke",
    "81": "Noche de argentinos en la #NBA75 . Campazzo vs. Memphis, Bolmaro vs. Orlando y Deck vs. Clippers.\n\n🕘 21:00h - Campazzo / Bolmaro\n🐻 Grizzlies vs. Nuggets ⛏️\n📺 NBA Pass / DirecTV\n\n🐺 Wolves vs. Magic 🎩\n📺 NBA Pass\n\n🕦 23:30h - Deck\n⛵ Clippers vs. Thunder ⚡\n📺 NBA Pass https://t.co/kKjE0SSHff",
    "82": "#DailyPick \nMagic @ Timberwolves +5.5 1H\n@OrlandoMagic on their 5th road game in 6 games (and suck more than a dyson).  Interesting fact: Magic games are 6-1 on the over, T'wolves are 0-5.  Which trend gives? \n#NBA #GamblingTwitter #NBAPicks #FreePicks \n\nOverall: 184-151-5",
    "83": "There’s been a good bit of losing already but Cole Anthony has looked really, really good for the @OrlandoMagic so far https://t.co/BTFby6FWZ2",
    "84": "@Iker0999 Orlando Magic ✨",
    "85": "@OrlandoMagic I just saw the court design for the City Edition jerseys. I'm all about recycling but uhm, why isn't this at center court?! https://t.co/RALITigoeJ",
    "86": "@OrlandoMagic @jalensuggs Go get em Suggsie!!!  30 point night!",
    "87": "@RedSox @OrlandoMagic @PredsNHL @Bengals you guys should follow back imo",
    "88": "Orlando Magic: Cole Anthony is making a huge leap this season (via @LucaLockheart)\nhttps://t.co/wzmy9TdHGo",
    "89": "Jalen Suggs on playing in Minnesota:\n\n“A lot of emotions. I’m excited. ... Excited to be in front of family and friends.\n\nThis is where I grew up at and being able to come back here and play at the highest level, you can’t say much more than that.” https://t.co/L5HuLsfO7i",
    "90": "@Basketballniice @DylanFrew6 @Poirier_Stephen @NTFCNathan @NBATV @C_Duarte5 @Kia @AschNBA @Pacers Bro why u arguing with braindead magic fans? 💀 Man is comparing Chuma fucking Okeke to a generational talent. Orlando can't draft or develop for shit let them be delusional breh, they're gonna be poverty forever 😂",
    "91": "New Orleans Pelicans 👍\nOklahoma City Thunder 👎\nOrlando Magic 😍\nPhiladelphia 76ers 😍 https://t.co/ksloaovw2H",
    "92": "\"Try to keep my eyes off the stands too much\" is the mission for Jalen Suggs as his Orlando Magic play the Timberwolves tonight. \nThe @RedhawksAD graduate is expecting hundreds of family and friends at the Target Center.\n\nStory on the NBA rookie at 6 on @WCCO",
    "93": "@RedhawksAD @jalensuggs @OrlandoMagic Can’t wait to see all the @MinnehahaAcad supporters at @TargetCenterMN tonight!",
    "94": "Orlando, Christmas music starts on Magic 107.7 November 5th, 2021!! 🎅🏼🎄",
    "95": "11/1/95 - In the franchises 1st trade, the expansion Vancouver #Grizzlies acquired PF Anthony Avent (6.4p/5.0r in 3 seasons) from the Orlando Magic for PG Kevin Pritchard &amp; SF Larry Stewart, 2 days after the  preseason in which the team had been out-rebounded by an avg. of 47-40. https://t.co/jRXiS4G0BG",
    "96": "The Orlando Magic underwear don’t come off during sex https://t.co/kVJQ5V4LfC",
    "97": "Franz Wagner has surprised a lot of people (including me) with just how good he’s been so far for the Orlando Magic👇\n\n@OMagicDaily \n#MagicTogether \n\nhttps://t.co/v9ChLtm2Nf",
    "98": "@TimmyRob1991 @OrlandoMagic @NBA @MarkelleF Very nice for a very bad team",
    "99": "@OrlandoMagic @NBA @MarkelleF @dfoley33  these are elite!!",
    "100": "@unimockups Petition to get the @OrlandoMagic to wear these uniforms 82 times per year. https://t.co/fxJi3V8wVh",
    "101": "Orlando Magic visits Minnesota Timberwolves Predictions and Preview for 11/1/2021 today.  Who are we taking in this game?  Find out now. #SportsBetting #GamblingTwitter https://t.co/5TF7WLAA7o",
    "102": "@PlayoffFultzV2 @OrlandoMagic They need too keep this style and do black , blue and white versions as well!",
    "103": "@evan_winter @Cory_Hays407 I haven’t updated it with LA &amp; NE, but here’s all the places I’ve been. Red is Bucs and blue is Orlando Magic https://t.co/0WdKck8qA1",
    "104": "Too soon? Here’s when Orlando #radio station Magic 107.7 will start playing nonstop Christmas #music. https://t.co/s4FiVJh0VK",
    "105": "@OrlandoMagic Orange and gray is not a good color combo lol",
    "106": "Minnesota Timberwolves Predictions and Preview for 11/1/2021 hosts Orlando Magic.  Looking for betting action?  Find out if there is any value in our preview. #SportsBetting #GamblingTwitter https://t.co/5TF7WLAA7o",
    "107": "@unimockups @OrlandoMagic looks like something i’d make in photoshop in 2015",
    "108": "@marcusdj813 @RandyHolbrook @OrlandoMagic Yeah we get that part. It’s still horrible",
    "109": "@Windmill360 @OrlandoMagic Wayyyyyyyyyyyyyyyyyyyy better. We hate the orange",
    "110": "@Pissy_Spacek @SheshavingfunDD @NeneRamenLeakes All I can say is those Miami Heat and Orlando Magic rookies better watch out.",
    "111": "@OrlandoMagic For future reference, we all hate the orange . Stop. We bleed blue",
    "112": "Pretty cool breakdown by @sportslogosnet ! The jersey is paying tribute to the different eras of @OrlandoMagic basketball! I personally love em! #OrlandoMagic #MagicTogether https://t.co/DCzV5FUwhM",
    "113": "@marcusdj813 @OrlandoMagic Got it. Thank you.",
    "114": "@WearTesters The @OrlandoMagic jersey 👌🏻🔥",
    "115": "@NBATV @NBA @Lakers so so.... Best is @Raptors, @ATLHawks &amp; @OrlandoMagic",
    "116": "The @Timberwolves take on the Orlando Magic for the first time this season tonight at 7 p.m. at @TargetCenterMN.  \n\nTV: @BallySportsNOR (@davebenz, @JimPeteHoops, @leabolsen)\nRadio: @wccoradio (@WolvesRadio, @CAL_soderquist)\n\nWolves game notes:\n\nhttps://t.co/49XLLfqVe3 https://t.co/LMpKPwouLX",
    "117": "Back ORLANDO MAGIC to BEAT Minnesota Timberwolves tonight in the @NBA (Game Starts at 00.10 GMT) #NBA #Basketball",
    "118": "It’s time to make a change for the Orlando Magic, starting 2 centers was an interesting experiment but it’s simply not working. Check out my article below ⬇️ https://t.co/1DuO26ETVY",
    "119": "@marcusdj813 @OrlandoMagic So things related to our city shouldn't be on the City Edition? The nickname \"The City Beautiful\", incorporating the city's flag (that has no orange on it). These things should be disregarded because the color orange? Did you just say the city name shouldn't be on the City jersey",
    "120": "@Windmill360 @OrlandoMagic Can we just do this permanently????",
    "121": "@OrlandoMagic @MarkelleF @chuma_okeke @The_ColeAnthony yess",
    "122": "@OrlandoMagic @JJudahIsaac CLEANN",
    "123": "@OrlandoMagic @chuma_okeke YESS",
    "124": "@LMized @OrlandoMagic Bad coaching...I don't buy that. We had SVG and Doc here. If anything it was bad ownership and front office.",
    "125": "@Dan_Savage @DaneMooreNBA @OrlandoMagic @Timberwolves @NBA Dan FYI, Ant currently takes and misses the most shots. LAST YEAR IS OVER WITH. Lets stay focused buddy.",
    "126": "@marcusdj813 @OrlandoMagic Ahhhh, ok. Thanks. Still don’t like it but now I get why they do it.",
    "127": "@OrlandoMagic y'all okay? https://t.co/QxkHYp4Oi7 https://t.co/eFOZ7uY5JW",
    "128": "@OrlandoMagic These are nice…but we need the original colors badly",
    "129": "@sportslogosnet I'm in love with Orlando's uniform.  I think Nike and the Magic got it just right this time.",
    "130": "@OrlandoMagic @JJudahIsaac I need that warmup",
    "131": "🏀 @OrlandoMagic at @Timberwolves Preview 🏀\n🔹Starting unit has @NBA's best net rating\n🔹Magic looking to improve other pairings\n🔹Team has taken 3rd most charges\n🔹Franz Wagner is 3rd in rookie scoring\n🔹Rivals Report with @DaneMooreNBA \nAll that &amp; more:\nhttps://t.co/fSmMExomXW",
    "132": "@OrlandoMagic God this is ugly",
    "133": "Yes, because when I think of the uniform history of the Orlando Magic my mind always goes directly to black and orange. https://t.co/eKkjF1Hcc4",
    "134": "@OrlandoMagic Stop with the Knicks colors bro it’s annoying 😑",
    "135": "@OrlandoMagic @The_ColeAnthony @Timberwolves @BallySportsFL @969thegame Start the winning tonight and less losing please",
    "136": "@LookAtJaay @OrlandoMagic @MarkelleF @ItzADEXTER Ya but went with same colors",
    "137": "@OrlandoMagic Of the orange-themed uniforms, this is the best one. This is 🔥!",
    "138": "@WordSm7th @OrlandoMagic The area's citrus heritage.  Also, Orlando's in Orange County.",
    "139": "@RandyHolbrook @OrlandoMagic To honor Greater Orlando's citrus heritage and Orlando's location in Orange County.",
    "140": "@ImMcIlhenny @OrlandoMagic I'm sure the Magic accounted for that with an associated court design.  Stay tuned.",
    "141": "Oh wowwwww!!!!! That's all 🧡🖤🧡🖤🧡🖤 #MagicTogether @OrlandoMagic https://t.co/xKkAtAgA5W",
    "142": "@BlackLightning5 @OrlandoMagic The lack of commercial groves now has nothing to do with it.  The presence of such groves long before now is part of Greater Orlando's history with citrus.  The Magic is going with the color of the fruit itself, not so much its color.  \"Orlando\" doesn't have to be on the jersey.",
    "143": "@OrlandoMagic @The_ColeAnthony @Timberwolves @BallySportsFL @969thegame He's going to have a strong performance tonight again 💪💪🏀🏀",
    "144": "@HoopsTalk13 Offers you the luxury of playing Fultz off the pine and easing him into it. Imagine having @MarkelleF coming on with @TerrenceRoss lighting it up. I think it's the one two sucker punch @OrlandoMagic could really use 👏 #magictogether",
    "145": "The Orlando Magic should go back to the era of T-Mac uniforms because they are trash now.",
    "146": ".@The_ColeAnthony returns to Minnesota tonight 😈\n\n🆚: @Timberwolves \n📍: Minneapolis, MN\n🕗: 8 p.m.\n📺: @BallySportsFL\n📻: @969thegame https://t.co/KrnhljhFFG",
    "147": "@ORL_EGW @OrlandoMagic @JJudahIsaac I agree. Super clean. Gotta get one",
    "148": "Love the ball on the shorts @OrlandoMagic !!!\n(And the 2000 logo is a bit better also)",
    "149": "Two position battles going on within the Orlando Magic at this time: #NBAMagicPolls \n\n#1 Jalen Suggs and Cole Anthony: One of these guards will be in the starting lineup and one will probably be first off the bench.\n\n Who do you think starts once Fultz is 100% back Healthy?",
    "150": "Does anyone in Orlando actually care that Florida produces oranges? Or want the color orange in a jersey? \n\nI feel like a Disney or Puerto Rican themed Magic jersey would be much more endearing to the Orlando population https://t.co/giUTr9retJ",
    "151": "Why do I feel like the Titans are gonna be a 09 Orlando Magic type story?",
    "152": "Too soon? Here’s when Orlando radio station Magic 107.7 will start playing nonstop Christmas music https://t.co/1Hc2IgDjW1",
    "153": "We'll dig into this in tomorrow's episode of Club and Country on @440Sports. We'll bring you as much Orlando recap and playoff scenario magic as you can handle! #EveryoneN https://t.co/PwiawAZi3c",
    "154": "Cade Cunningham made his NBA debut for the Detroit Pistons in a win against the Orlando Magic on Saturday night. \n\nAlthough he only scored two points, @CrainNBA takes a look at how Cunningham showed flashes of his potential.\nhttps://t.co/uodbbS5KUK",
    "155": "@OrlandoMagic @MarkelleF @chuma_okeke @The_ColeAnthony Them jersey’s 🥵",
    "156": "So Orlando was trapping Cade in his first career game and Cade still impressed even tho he couldn’t shoot? I get that right? \n\nI’m excited to watch him and also the Magic are cowards for that",
    "157": "@Court_Cousins @The_ColeAnthony @OrlandoMagic Definitely w/ the old school logo .. love it",
    "158": "@OrlandoMagicUK @Timberwolves @TargetCenterMN @OrlandoMagic @timberwolves_uk @NBA_UKfans @mikeyclark87 @gera1nt @biffabacon439 @BallyMagic No,Yes,No,No,No",
    "159": "@blkdorsey @OrlandoMagic Where these colors be coming from",
    "160": "@SamiAhmed40 @Jonathan_Z89 @BeORLMagic @OrlandoMagic It's a figure of speech the only one hurting is here cuz you look like shit 😂",
    "161": "@obese_pockets @ayruuus We boutta have an Orlando Magic arc near deadline brah whole organization is going boom",
    "162": "@OrlandoMagic Ok but you’re changing the “ORL” grey and orange court to match, right?",
    "163": "@TheSteinLine Maybe the Shawn Kemp comp was accurate after all. Except we skipped right to Orlando Magic Shawn Kemp.",
    "164": "@OrlandoMagic AMAZING!! 🖤🧡🔥",
    "165": "@OrlandoMagic Love it!",
    "166": "Sorry can’t get behind Orange when it comes to @OrlandoMagic . Blue and black baby #MagicTogether",
    "167": "We’re very happy to have played a key role in bringing @PDQFreshFood to the @AmwayCenter. We look forward to the new partnership with @OrlandoMagic and @OrlandoHockey. https://t.co/kBBG8U5Kgv #MindStoneMarketing https://t.co/YakrRa2CBO",
    "168": "@OrlandoMagic @chuma_okeke When can we buy these?",
    "169": "Atlanta Hawks - Washington Wizards\nMinnesota Timberwolves - Orlando Magic\nLos Angeles Clippers - Oklahoma City Thunder\n\nBet slip link: https://t.co/a2IE8OEfvN https://t.co/1JGUHTidJr",
    "170": "@OrlandoMagic, designed by @MLR_Studios https://t.co/PGtiDhpHog",
    "171": "Genesis\n\n@SHAQ 1st game after leaving @OrlandoMagic born (3)/(6)/72\n\n1(83) days after @MagicJohnson retired 5/2/96\n\nChuck daily last gm was with @OrlandoMagic 5/15/(99)\n\nDied age 78 (3)(6) days b4 @kobebryant 1st ring without Shaq vs @OrlandoMagic 6/14/09 (99)-86 kb born  in (78) https://t.co/rudeG6okgk",
    "172": "How can we have one of the most iconic jerseys of all time, yet always get BS when these special editions come out.!? How? Why? @OrlandoMagic https://t.co/kHYlkyTtp7 https://t.co/ssyoKV3LQs",
    "173": "I give the Orlando Magic City Edition Jersey a 8.5",
    "174": "@OrlandoMagic @chuma_okeke Big Chuma Baby https://t.co/lbQQwnwHYV",
    "175": "The Magic suit up in Minnesota at 8pm tonight and have a 40-23 lead in the All-Time matchup.\n\nOrlando’s biggest win in Minnesota came on December 27th, 2008, as Hedo Turkoglu put up 26 points on 8-12 shooting, leading the Magic to a 118-94 win.\n\n#MagicTogether #HedoTurkoglu https://t.co/YWjYUYz6Ox",
    "176": "@OrlandoMagic @chuma_okeke Love the shade of orange used in these uniforms.",
    "177": "@OrlandoMagic @chuma_okeke Could we get a wallpaper of the entire 2022 roster?",
    "178": "then &amp; now https://t.co/nXY1kHpPy3",
    "179": "Orlando Magic https://t.co/R6BElJGkgQ",
    "180": "@HisNameIsAdrian Orlando magic city edition ones are wayyyyy better 🧡 lol",
    "181": "i highly advise a bet on the Orlando Magic against the timber wolves",
    "182": "@OrlandoMagic I kinda hate this",
    "183": "@leilarahimi I'm unsure why I like the Orlando Magic jersey so much... but I do...",
    "184": "Here is this morning’s (11/1) post-shootaround media session with @OrlandoMagic center @TheRealMoBamba:\n\n#MagicTogether \n\nhttps://t.co/QyQ3FM2GXc",
    "185": "@StorieASpicchi Nell'ordine: Knicks, Rockets e Orlando Magic.",
    "186": "Here is this morning’s (11/1) post-shootaround media session with @OrlandoMagic guard @jalensuggs:\n\n#MagicTogether \n\nhttps://t.co/RWx9cSSdT6",
    "187": "Here is this morning’s (11/1) post-shootaround media session with @OrlandoMagic Head Coach Jamahl Mosley:\n\n#MagicTogether \n\nhttps://t.co/HC5xkkJxMf",
    "188": "@nicekicks @okcthunder @OrlandoMagic @Suns Bruh Utah used the same design for like 3 years now",
    "189": "@OrlandoMagic How does a fan show up to a game with the hot new jersey and shorts on, and not look like a try hard? Asking for a friend",
    "190": "@OrlandoMagic Shoulda used the old school numbers too",
    "191": "The @OrlandoMagic are far behind the rest of the league in cool jersey combinations smh https://t.co/exQU8s6BT7",
    "192": "@OrlandoMagic @JJudahIsaac I hope the jacket is going to be for sale. 🔥🔥🔥",
    "193": "@OrlandoMagic Magic are so ass I forgot they still in the NBA",
    "194": "@themiznesss I stopped following the @OrlandoMagic and gave up my season tickets. Team blundered championship chance during the finals while they had best talent on the team. Bad coaching, period.",
    "195": "@BallyMagic @OrlandoMagic Yet that nickname is absent from this jersey... and it's still orange for some reason. At least they got rid of the anthracite",
    "196": "@MovieStreaker @OrlandoMagic It's our city edition. This city was known for its orange groves. 🍊",
    "197": "@marcusdj813 @OrlandoMagic There are no commercial groves in this county. And, if it's the whole \"Juiced\" thing? Orange juice is yellow, not orange. Why isn't the city's nickname on it? The city's name isn't even on it. Just phrase Rich DeVos said in 1995",
    "198": "@OrlandoMagic @JJudahIsaac The warm ups are nice 🔥",
    "199": "Orlando Magic let me choose the kit this year 😄😍🧡🖤 https://t.co/yUUSABEmFW",
    "200": "Jalen Suggs and Orlando Magic in town every AAU basketball wanna be will be at Target Center to the local star come home.And play against the home town Timberwolves.",
    "201": "@OrlandoMagic @rolopez42 @STUFFMagic Very cool pics these all are.",
    "202": "The new @OrlandoMagic jerseys &amp; apparel  🔥🔥",
    "203": "fresh https://t.co/AqCYjMrnCL",
    "204": "@OrlandoMagic When’s pre order",
    "205": "@JoshuaBRobbins Lol, you're still showing up on my Bleacher Report app under the Orlando Magic",
    "206": "Why is the Orlando Magic using the color Orange now like wth that ish is DUMPSTER JUICE !",
    "207": "NBA 🏀 Temporada: 14-13\n\nLunes 1/11:\nToronto Raptos vs New York Knicks U208.5 (-110)\nOrlando Magic O103.5 (-125)\nWendell Carter Jr. - Orlando Magic O11.5 Points (-120)",
    "208": "@debswim2010 @OrlandoMagic Deb I like it...but it needs some blue in it..don't u think 🤔 \nI mean that's their colors",
    "209": "Tryna see which @OrlandoMagic game I wanna go to next",
    "210": "Orlando Magic Snapback https://t.co/MvOvaJ2Nqa https://t.co/QUo2YpqTgu",
    "211": "@OrlandoMagic @MarkelleF @chuma_okeke @The_ColeAnthony Cole Anthony... ISSA VIBE! 😎",
    "212": "@BenGChase @OrlandoMagic @mordechai_jones @ChrisBerretta It was also used in 95",
    "213": "@OrlandoMagic I like the old font and pinstripes coming back I’m just not sure how I feel about orange and black, definitely the best one yet though",
    "214": "@Court_Cousins @OrlandoMagic @jalensuggs @RjHampton14 Franz can stop anyone 😂 https://t.co/M8Mbdw1Gln",
    "215": "@TylerHon14 @OrlandoMagic @jalensuggs @RjHampton14 Let’s go! Can Franz stop Ant?",
    "216": "@mattdooner @OrlandoMagic @UniWatch not related but I can't stand that the pinstripes go diagonal at the top... why",
    "217": "@Magic_PR @BallySportsFL @969thegame @BallyMagic @OrlandoMagic @NBA Fresh white kit for a fresh win… maybe… hopefully… okay let’s just be competitive",
    "218": "Monday night #MagicTogether comes your way tonight on @BallySportsFL, presented by @TMobile.\n\nTune in TONIGHT and watch your @OrlandoMagic wrap up their road trip vs. the TWolves. https://t.co/Hakiol2Rtg",
    "219": "5. Orlando Magic\n#MagicTogether https://t.co/9t8mvj3waf",
    "220": "@OrlandoMagic Ji with the jacket!",
    "221": "@BlackLightning5 @OrlandoMagic The City Editions often go beyond a franchise's colors.  This one for the Magic honors its Orange County location and Greater Orlando's citrus heritage.",
    "222": "@OrlandoMagic did good work! Washington and Dallas too! https://t.co/JttLjil3Yk",
    "223": "@schwarm @Loki_Wodenson @FabGeorgeFacts @OrlandoMagic @DM_Doesnt @GamerAdvantage @Alec_Azzam @rstockto @DawnsPlaceYt @SexyMaryAnna1 @goblinsngambles Princess Peach (as best I could from my closet...) https://t.co/HVKETia58y",
    "224": "him or paolo @OrlandoMagic https://t.co/UgKc83piHA",
    "225": "This @OrlandoMagic team is fun....even if the results don’t show it 😅",
    "226": "Thank you Orlando Magic. Can we see these in actual Magic colors just for fun? https://t.co/HuTPw88eSU",
    "227": "Telling the story of The City Beautiful. #MagicTogether \n\n📷: @OrlandoMagic https://t.co/V15XNAo9aJ",
    "228": "@Orlando_btc @ASvanevik Aka god's unchained $gods\n\nMagic the gathering, but with Crypto.",
    "229": "Orlando Magic: B+\n\nThese are really unique and I love the pinstripes in the jersey as well as the sides having the “galaxy star” feel to it. I think it has my favorite trim of all the jerseys. https://t.co/ARdboJwxX6",
    "230": "These new #OrlandoMagic city edition jerseys  are 🔥🔥🔥 https://t.co/XhRvJmBX8K",
    "231": "@Conner_osborn_ @OrlandoMagic @keithsinkula1 @jackiestacks28 Not bad Knicks are cleaner though",
    "232": "@OrlandoMagic @keithsinkula1 @jackiestacks28 @donnyberesheim Dem Boys lookin cleaaannn 🥶",
    "233": "@OrlandoMagic you had one job 🥴 the 2000-2001 jersey was your only option. Where'd you get this black and orange color scheme from??? https://t.co/T71EHQH5Ua",
    "234": "@OrlandoMagic so are we gonna get the original logo on the court @OrlandoMagic",
    "235": "@inzomnizak @OrlandoMagic Hope these were just for Halloween",
    "236": "@inzomnizak @OrlandoMagic Horrible",
    "237": "@OrlandoMagic @MarkelleF @chuma_okeke @The_ColeAnthony These jerseys are 🔥 🔥",
    "238": "Game Day 🔥\nMinnesota Timberwolves vs Orlando Magic\n❗Target Center\n⏰21:00\n📺NBA League Pass https://t.co/jd7eBD9Mfb",
    "239": "@OrlandoMagic ON MY BIRTHDAY MY TEAMS PLAY",
    "240": "@OrlandoMagic @MarkelleF @chuma_okeke @The_ColeAnthony I did the Orange",
    "241": "Early season NBA nonsense: the 1-6 Orlando Magic currently have the leagues best lineup with at least 100 possessions on the court. Anthony-Suggs-Wagner-Carter-Bamba are +22.2 net rating in their 167 possessions. This is Orlando’s most used lineup, yet overall they are -12.6 net",
    "242": "@OrlandoMagic I do not care for the orange but the old school jerseys and logo are great",
    "243": "@OrlandoMagic. finally did it!! this is  what a M🌟gic jersey is supposed to look like please. make these in all white and royal blue and we good https://t.co/e4IP82q0dK",
    "244": "@OrlandoMagic @MarkelleF @chuma_okeke @The_ColeAnthony Why would the coaches have been wearing the blue logo the other night?",
    "245": "@OrlandoMagic Fire https://t.co/4frQVa8OTc",
    "246": "@OrlandoMagic drop all these pics in the graphic by themselves please",
    "247": "@OrlandoMagic Ooh, any more pics of the jacket JI is rocking?",
    "248": "@OrlandoMagic Yessss I’m gonna be at the Lakers game",
    "249": "@OrlandoMagic Y’all better win so I can bring this out tonight https://t.co/JDGGnGu41i",
    "250": "Blood Drive on campus tomorrow, November 2nd from 11am to 5pm. All donors will receive a @my1blood gift and two tickets to an @OrlandoMagic game!\n🩸\nUse Sponsor Code #10910\nhttps://t.co/8NXfhCdr1k https://t.co/6Hn5rJ9whl",
    "251": "Every year the @OrlandoMagic ruin there chances to have the best jerseys https://t.co/4yACeabkiV",
    "252": "@OrlandoMagic @jalensuggs @RjHampton14 These are sick!! Love it!",
    "253": "@OrlandoMagic @NBA @MarkelleF Pacers 2.0",
    "254": "@OrlandoMagic @MarkelleF @chuma_okeke @The_ColeAnthony Orlando Magic “ Halloween Edition” Jersey’s are 🔥",
    "255": "11/1 #NBA picks🔥\n\nOrlando Magic +8.5 (-110)\nChicago Bulls +2 (-110)\nOKC/LAC U210 (-110)\n\nMay add more picks throughout the day.\n\n#GamblingTwitter #FreePicks https://t.co/vkeAHzeiKU",
    "256": "@OrlandoMagic Nope",
    "257": "@nicekicks @okcthunder @OrlandoMagic @Suns OKC's would look a lot nicer without the gas station patch. ⛽",
    "258": "@nicekicks @okcthunder @OrlandoMagic @Suns Sixers win this group.",
    "259": "The Orlando Magic have had some ugly jerseys for several years now smh",
    "260": "@JohnMorganESQ @OrlandoMagic Morgan and Morgan for the people !!! It is like the old Saturday Night live skit. Take your fingers and make the big L. Place it up to your forehead and just scream LIE !!!",
    "261": "The Orlando Magic are in Minnesota tonight to take on the Timberwolves at 8pm on @BallySportsFL\n\n#minnesota #sports #game #orlandomagic #magictogether #kat #podcast #spotify #dlo #nba #minnesotatimberwolves #basketball #ESPN #regularseason #coleanthony #nbaseason #jalensuggs https://t.co/hWuXkjvMIY",
    "262": "@OrlandoMagic @MarkelleF @chuma_okeke @The_ColeAnthony Why can’t I buy them yet",
    "263": "@Ballislife @OrlandoMagic I dont know who to @ in your branding department and I DONT CARE if you guys wear blue and black, orange and black, or orange and green, but MAKE THIS JERSEY THE BASE FOR YOUR NEXT REBRAND DEVOSS QUOTE STRIPES OR RWGULAR STRIPES I DONT CARE JUST USE THE PINSTRIPES",
    "264": "@JonnyCigar407 @Jonathan_Z89 @BeORLMagic @OrlandoMagic Yo head shaped like an egg too btw",
    "265": "I want those new orange shorts @OrlandoMagic",
    "266": "@OrlandoMagic GET ME A SCHEDULE AND RELEASE DATE OF THESE JERSEYS!!! https://t.co/KEG7J0FYXm",
    "267": "@OnAirWithCC @OrlandoMagic I just can't love these. I WHY they use orange but it does nothing for me",
    "268": "A HOUSE DIVIDED \nOrlando Magic / Archers Lacrosse Club https://t.co/0SpCUNUO7T",
    "269": "@kcoop0919 It’s Orlando Magic, for me! https://t.co/GWYSUVHqW2",
    "270": "@OrlandoMagic @MarkelleF @chuma_okeke @The_ColeAnthony Ship to the UK? ✌🏼🙏🏼",
    "271": "@OrlandoMagic @MarkelleF @chuma_okeke @The_ColeAnthony Lemme get y’all right with my pictures",
    "272": "@JonnyCigar407 @Jonathan_Z89 @BeORLMagic @OrlandoMagic I’m actually More focused on winning than I am aesthetics. Raise your bar my guy.",
    "273": "past meets present https://t.co/hgYqD7DL7y",
    "274": "@BlackLightning5 @CuseKnicksFan @OrlandoMagic @ORL_EGW So much better.",
    "275": "Orlando Magic unveil the #NBA75 City Edition jersey 🍊 \n\n(📸: @OrlandoMagic) https://t.co/aC7rl17Rk8",
    "276": "@SamiAhmed40 @Jonathan_Z89 @BeORLMagic @OrlandoMagic Don't be an idiot and enjoy the jersey",
    "277": "I need the @OrlandoMagic to STOP TRYING TO MAKE “FETCH” HAPPEN with their Orange variants https://t.co/DYWZVkvA1q",
    "278": "@JD_Crossover Orlando magic jersey even though I'm a bulls fan",
    "279": "@JohnnyBauman27 @CuseKnicksFan @OrlandoMagic How about this version from @ORL_EGW? It's better than last season's Earned https://t.co/9hX41iEPJQ",
    "280": "@OrlandoMagic @MarkelleF When do these come out",
    "281": "@RedhawksAD @jalensuggs @OrlandoMagic Got my tickets",
    "282": "the fiery shiny orange Orlando Magic Ball Logo is what won me over.\n\njust look at these beauties https://t.co/0LK5zlq9BZ",
    "283": "@OrlandoMagic Where can u get this in the uk!! 🧡",
    "284": "@OrlandoMagic can I have one of the new unis please?\n#BingBong",
    "285": "Gameday!! #MagicTogether @OrlandoMagic https://t.co/fPOtpUGMc0",
    "286": "Dear @OrlandoMagic Why?! Why with the orange and dark grey. It’s ugly. Just save your money on something else because creativity for city jerseys isn’t it.",
    "287": "The @OrlandoMagic knock it out of the park as well!!! https://t.co/LZfHD5q49L",
    "288": "@SamiAhmed40 @BeORLMagic @OrlandoMagic Ah yeah I guess but they can bring it back again.",
    "289": "@OrlandoMagic @MarkelleF When can we buy them?? 👀",
    "290": "@OrlandoMagic @MarkelleF where’s the best player @The_ColeAnthony ?",
    "291": "@Jonathan_Z89 @BeORLMagic @OrlandoMagic Bad timing to add it when all we’re doing is losing is what I mean lol",
    "292": "@schwarm @FabGeorgeFacts @OrlandoMagic @Sailor_NikNak @DM_Doesnt @GamerAdvantage @Alec_Azzam @rstockto @DawnsPlaceYt @SexyMaryAnna1 @goblinsngambles Stoned. I was stoned. 😂😂😂 Nobody came by my house. I was going to be a wizard but... I ended up sitting in my robe all by my onesies with an infused joint eating candy and watching What We Do in the Shadows. It was glorious!",
    "293": "@OrlandoMagic Stop with the orange. \nEnough is enough please",
    "294": "@BenGChase @OrlandoMagic @ChrisBerretta I do not hate these actually",
    "295": "The throwback style @nba city jerseys are tough! @wizards, @BrooklynNets , @HoustonRockets, @Timberwolves, @ATLHawks,just to name a few. And @MiamiHEAT definitely snapped on theirs! 🔥🔥&amp;  @OrlandoMagic  orange pinstripes!! 🔥🔥🔥🔥",
    "296": "@_SameOle_G @OrlandoMagic can you tell us if it’s black or dark gray😂",
    "297": "Orlando Magic https://t.co/ESlOgGIyVj",
    "298": "@GPTSal21 @OrlandoMagic Is that the Knicks?",
    "299": "@ryankroberson @OrlandoMagic Dang, those are fresh! 👀",
    "300": "Timberwolves also looks great… Orlando magic, on the other hand, does not seem right with color. https://t.co/w66Vih8JhL",
    "301": "@MagicMan816 @OrlandoMagic @TerrenceRoss @chuma_okeke Mid anime",
    "302": "@SportssFann1 I feel you, but at least these really have the classic Magic feel with the pinstripes and such. Frankly, would like them to ditch Orange and go with another concept for Orlando sometime soon, but these are sharp!",
    "303": "@MagicIceman1875 @OrlandoMagic Well, MagicIceman1875, if that’s even your real name they make it very difficult to do so.",
    "304": "@OrlandoMagic y'all want to be Phoenix so bad.. https://t.co/k6l6sKVfTV",
    "305": "@nicekicks @okcthunder @OrlandoMagic @Suns Does the OKC one come with a hood?",
    "306": "@OrlandoMagic @megnturner_ Isn’t this just the top half of the Pacers logo ?",
    "307": "@OrlandoMagic Kinda like these color scheme",
    "308": "Game 8\n\n🏀: Magic vs Timberwolves\n🕔: 7:30 PM Coverage\n📻: FM 96.9 | am740 | 101.1 HD-2\n📱: iHeartRadio App in Orlando https://t.co/Ezs8qrjzAp",
    "309": "@HeartHustleORL @The_ColeAnthony @OrlandoMagic Then you can buy suggs or franz in this",
    "310": "@mosballin And of course my Orlando Magic 👌",
    "311": "@ColeyMick Orlando Magic what is you doin??? Again?!!",
    "312": "@OrlandoMagic Make them Magic Colors!! Drop orange nonsense",
    "313": "I love that the @OrlandoMagic took our rally cry from 10 years ago and put it on their jerseys @mordechai_jones @ChrisBerretta https://t.co/6xE5kmYchs",
    "314": "@ORL_EGW @OrlandoMagic 1000 times better",
    "315": "@OrlandoMagic I don’t care for the orange https://t.co/CqXilfRPyC",
    "316": ".@okcthunder City Edition\n@OrlandoMagic City Edition\n@sixers City Edition\n@Suns City Edition https://t.co/yDff6s09sU",
    "317": "@OrlandoMagic Halloween Edition?? I think wearing her shirt I would feel similar to this... https://t.co/oI5nJPehnm",
    "318": "@OrlandoMagic @Matthegame - Suggs No.4 in this 🔥",
    "319": "@trailblazers vs @sixers , @cavs vs @hornets , @spurs vs @Pacers , @chicagobulls vs @celtics , @WashWizards vs @ATLHawks , @Raptors vs @nyknicks , @nuggets vs @memgrizz , @OrlandoMagic vs @Timberwolves , @okcthunder vs @LAClippers",
    "320": "@OrlandoMagic @jalensuggs @franzboogie Im gonna need one of each",
    "321": "@br_orlandomagic @brasilcoast2 Discordo, craque. 🌲",
    "322": "@OrlandoMagic @MarkelleF where is minister isaac",
    "323": "@OrlandoMagic @MarkelleF I miss seeing Markelle play man",
    "324": "@OrlandoMagic Really missed on the number font.",
    "325": "@OrlandoMagic @jalensuggs @franzboogie That Franz one I need it",
    "326": "@ColeyMick I never wanna see the Peach Tree, cream city or those orange Orlando magic jerseys again. OKC has a dumbass alternate jersey too I hope is buried",
    "327": "@AlanM__ Orlando magic looking dope too imo",
    "328": "@BonafideBro ik you ain’t tawking bout the ORLANDO MAGIC rn 😐",
    "329": "These are 🔥 🔥 🔥!!! I am max that I JUST bought a new @The_ColeAnthony jersey, I def would have gotten it in this jersey instead 😂🤣😂 @OrlandoMagic #OrlandoMagic #MagicTogether https://t.co/LYWrUMkDfT",
    "330": "@JoePompliano Well there's theres my excuse to buy my first @hornets Jersey... May need a @OrlandoMagic one too.\n\nI got plenty of Celtics jerseys. Xmas I'm gonna ask for a old school Larry bird and Bill Russell",
    "331": "@OrlandoMagic @MarkelleF @Barrie1873  this is also nice.",
    "332": "@OrlandoMagic @MarkelleF Fro Bamba sighting",
    "333": "Orlando Magic Note: I noticed how Issac aint getting them front page shots no more....HMMM...\n\nIt aint because he injured....cause Fultz aint back...",
    "334": "@OrlandoMagic @MarkelleF My gosh I miss markelle so much 😞😞",
    "335": "@OrlandoMagic Naw. Why orange?",
    "336": "@OrlandoMagic @MarkelleF Beauty",
    "337": "NBA 1st Half ML. Date: 11-01\nOrlando Magic vs Minnesota Timberwolves. 0.47%\nWilliam Hill. Magic @ +230\nDraftKings. Timberwolves @ -225\n#arbitrage #bettingtwitter #bettingpicks #sportsbets #freepicks #freemoney #mlb",
    "338": "@BlackLightning5 @CuseKnicksFan @OrlandoMagic Orange is such a terrible color for jerseys. 😏 Should've stuck with blue and black.",
    "339": "@OrlandoMagic Why do they keep making orange unis? They look horrible!",
    "340": "@KlineNBA I like the @MiamiHEAT jersey. The @okcthunder, @hornets, @OrlandoMagic and @SacramentoKings are really bad. I'd say @HoustonRockets @DetroitPistons @spurs @dallasmavs did the best job",
    "341": "immediate new Orlando Magic city edition jersey overreaction??",
    "342": "@UMetsMagicPhins @OrlandoMagic @TheRealMoBamba My guess is that we offered Mo an extension &amp; he turned it down.. maybe because the number wasn’t where he wanted it? But either way, if we’re paying Mo , that means he had a good yr , which is all good for us! So far, so good for Mo",
    "343": "@JohnMorganESQ @OrlandoMagic Dolphins need to be included in this class action suit",
    "344": "@OrlandoMagic make this the actual logo but blue",
    "345": "@OrlandoMagic please stop trying to make the orange thing happen. Just go back to the powder blue pinstripes already.",
    "346": "@SamiAhmed40 @BeORLMagic @OrlandoMagic Its an ode to Rich DeVos during our finals run in the 90s",
    "347": "@OrlandoMagic Orange is ugly as hell…get the blue I. There and these would be 🔥",
    "348": "SUPER SAIYAN CLASSIC ORLANDO MAGIC LOGO ON THE SHORTS  🤩 https://t.co/WLjcUtoRif",
    "349": "I would have to sue the @OrlandoMagic at the same time. https://t.co/mbz5WpxVRI",
    "350": "@JNCO_suave @HoopsEmpire_ @OrlandoMagic 34 years is the actual age.  It was unveiled in 1987",
    "351": "@OrlandoMagic What and why?",
    "352": "@br_orlandomagic @camisasdanba When do these go on sale?!",
    "353": "@OrlandoMagic clean af",
    "354": "why do the Orlando Magic insist upon shoving their orange colour scheme on us???",
    "355": "@OrlandoMagic Stripes look like the matrix code",
    "356": "@Realist_N_It @OrlandoMagic I been waiting on the orange pinstripes. Now once the white and the all orange drop it’s a wrap",
    "357": "The Jersey with stars in them… the ones Tmac &amp; Mike Miller played in. With the classic logo. @OrlandoMagic need to run it back to those uniforms https://t.co/DRC4aHerwA",
    "358": "@OrlandoMagic Still waiting for us to nail one of these 🙄",
    "359": "@jonjohnsonwip On another note the Orlando Magic city edition uniforms look hideous.",
    "360": "@IAm2AverageJoes @OrlandoMagic I agree, the best part of the season is when we don't have to see these awful orange monstrosities anymore",
    "361": "@OrlandoMagic About time you nailed the City unis. LFG",
    "362": "@OrlandoMagic Time to get a Fultz one",
    "363": "@CuseKnicksFan @OrlandoMagic You're right, they should be lit on fire with the previous s**tty orange jerseys",
    "364": "@OrlandoMagic At least it isn't Anthracite. \"Why not us? Why not now?\" Why are you still using orange? I thought that was done with. It's the best of these designs, but it's still orange. Orange is NOT a Magic color https://t.co/1pJ5pM5DWq",
    "365": "@OrlandoMagic can we get them in blue next please",
    "366": "@schwarm @Loki_Wodenson @FabGeorgeFacts @OrlandoMagic @Sailor_NikNak @DM_Doesnt @GamerAdvantage @Alec_Azzam @DawnsPlaceYt @SexyMaryAnna1 @goblinsngambles Not for Halloween itself, but at a recent costume-encouraged meeting I went as a bard, wearing faire garb and the most heinous long-black-hair nylon wig.\n\nIt was truly appalling, and people loved it. My college-age girls were most horrified that I had dark hair for it. :-p",
    "367": "@OrlandoMagic These are fire",
    "368": "@BeORLMagic @OrlandoMagic Low key underated",
    "369": "@BeORLMagic @OrlandoMagic Horrible choice of words since Mose has clearly refused to win games with his lineups. “Why not now” lol 💀🤦🏽‍♂️ smh.",
    "370": "@OrlandoMagic These are AMAZING!!!",
    "371": "@OrlandoMagic  YOU HAD A CHANCE FOR THE STARs JERSEY!!! https://t.co/iDdZsY70V7",
    "372": "@OrlandoMagic Clean",
    "373": "@OrlandoMagic Best part of our season",
    "374": "@OrlandoMagic Overwhelming, yet clean, love it",
    "375": "@OrlandoMagic Wallpaper soon?",
    "376": "@OrlandoMagic Imma need these to go on sale rn",
    "377": "@nicekicks @okcthunder @OrlandoMagic @Suns Okc said, \"the only thing colored we like in our city is the gas station logo.\"",
    "378": "@OrlandoMagic Hideous",
    "379": "@OrlandoMagic I love yall",
    "380": "@OrlandoMagic Love the trailing stars down the side panels",
    "381": "@PatrickNurseFTW @OrlandoMagic The Fort Pierce Hot Wand",
    "382": "@herseynba 1. Toronto Raptors\n2. Orlando Magic",
    "383": "Oklahoma City Thunder, Orlando Magic, Philadelphia 76ers, Phoenix Suns https://t.co/fZ5HVjCeko",
    "384": "@OrlandoMagic Oh those look way nicer than the leak, 🔥",
    "385": "The Orlando Magic choosing orange &amp; black makes no sense to me lol https://t.co/hv0NCmVUPt",
    "386": "@OrlandoMagic unveil latest City Edition unis…keeping with their new trend of orange but going back to the past with the logo https://t.co/gesc55fSpB",
    "387": "@jamesabaileyjr @OrlandoMagic I’m telling Santa for sure!",
    "388": "@OrlandoMagic Why is it orange? https://t.co/glOfX9SxJx",
    "389": "@OrlandoMagic Give us this too https://t.co/E0V2mfWkCs",
    "390": "@kperricone @OrlandoMagic Imma need the Jersey and the shorts... 🤣 🤣 🤣",
    "391": "@ORL_EGW @OrlandoMagic hook this up ASAP",
    "392": "@OrlandoMagic The “why not us why not now” as the pinstripes go hard",
    "393": "@OrlandoMagic i’m buying every single jersey",
    "394": "@OrlandoMagic Soooo when are the boys wearing them?? 🤔",
    "395": "@OrlandoMagic Why can’t it be blue? 😔 https://t.co/DlNOy64vaj",
    "396": "@OrlandoMagic make these blue and the statemtn jerseys and icon jerseys.",
    "397": "@OrlandoMagic So glad it’s not gray, these are fire",
    "398": "@jamesabaileyjr @OrlandoMagic This looks 1000x better than the leaked photo. Approved.",
    "399": "Detroit Pistons Rookie Cade Cunningham made his NBA debut over the weekend. Cunningham scored 2 points, on 1-8 from the field and 7 rebounds. #DETvsORL \n\nDespite Cunningham slow start, the Pistons secured their first win of the season 110-103 over the Orlando Magic. https://t.co/cYAfgfb8rK",
    "400": "@OrlandoMagic The wording in the pinstripes is 🔥",
    "401": "@OrlandoMagic Why not blue?",
    "402": "@OrlandoMagic These Jerseys are.... 🔥 🔥 🔥 🔥\n\n#OrlandoMagic #MagicTogether  #WeGotAlotPopping #MagicSzn2021\nWE💥G O T💥ALOT💥P O P P I N G https://t.co/38vVD1y4qM",
    "403": "@OrlandoMagic As I imagined, it better on the player!!!! Instant cop!!!",
    "404": "@OrlandoMagic the pinstripes being the \"why not us why not now?\" Is absolute 🔥🔥🔥",
    "405": "@magicsincetmac For a one time thing it was ok. But it’s getting annoying, nobody thinks about oranges for Orlando. Also the first thing people think of for the Magic jersey wise is how 🔥 our throwbacks are. Plus the white, blue and black is one of the best color ways in the league.",
    "406": "@OrlandoMagic Y’all snapped on this one 🔥🔥🔥",
    "407": "@OrlandoMagic Those logos crisp \n\nCome back stronger Markelle",
    "408": "@OrlandoMagic THIS IS SO NICE 🔥🔥",
    "409": "@OrlandoMagic FINALLY",
    "410": "Let's Gooooooo!!!!\n\n#OrlandoMagic #MagicTogether  #WeGotAlotPopping #MagicSzn2021\nWE💥G O T💥ALOT💥P O P P I N G https://t.co/LawqptvrTD",
    "411": "@OrlandoMagic Oh Wow...... https://t.co/pwMLmKWlcT",
    "412": "𝐍𝐢𝐤𝐞 𝟐𝟎𝟐𝟏-𝟐𝟐 𝐍𝐁𝐀 𝐂𝐢𝐭𝐲 𝐄𝐝𝐢𝐭𝐢𝐨𝐧\n\nMarkelle Fultz approved. 🔥 https://t.co/AxJsYuuAfc",
    "413": "@HoopsEmpire_ @OrlandoMagic 12 year olds smh",
    "414": "@OrlandoMagic Are the Magic merging with the Heat?",
    "415": "@OrlandoMagic That’s hot",
    "416": "@mcguirknba @OrlandoMagic Ayyyy this is fire, as the kids say!",
    "417": "@OrlandoMagic Y? This is seriously the best logo yall could come up with?",
    "418": "@OrlandoMagic Stop with the orange guys. These could be so clean in black and blue.",
    "419": "@mcguirknba @OrlandoMagic Looks better then the logo they posted",
    "420": "@OrlandoMagic We bringing back the orange jerseys 😍😍😍😍😍😍😍",
    "421": "@OrlandoMagic Idk how I feel about this",
    "422": "@OrlandoMagic L plz delete this",
    "423": "@OrlandoMagic Plz stop rebranding us as the Suns https://t.co/XrwIYZPxQr",
    "424": "The noise cancellation quality of the airpod pros is one of the main reasons I haven’t caught a charge so far. I forgot I’m flying to Orlando….nightmare. A plane full of Disney adults and their insufferable offspring awaiting magic.",
    "425": "@HoopsEmpire_ @OrlandoMagic It is from the original logo",
    "426": "Orlando Magic vs Minnesota Timberwolves 11/01/2021 Picks Predictions Previews\n\nhttps://t.co/nLSpHLhRRw\n\n#NBApicks #NBA #NBAparlay #NBAprediction #NBAbetting #basketballpicks #sportsbetting #expertpicks #freepicks #sportspicks #odds #picks #handicapper #Magic #Timberwolves https://t.co/GMhZ3jDG5F",
    "427": "Orlando Magic : https://t.co/12fgR0wXVD",
    "428": "@OrlandoMagic This looks like it was poorly made in photoshop. What’s going on with the stars coming off that ball lmao",
    "429": "Where to Play\n\n@OrlandoMagic take on the @celtics this Wednesday at @TheAmwayCenter \n\nGet Tickets!\n#Orlando #Sports #Magic \nhttps://t.co/jftIRByrjJ",
    "430": "originally, the Magic were nearly named the \"Juice\", since Orlando is known for sunshine and oranges.\n\nMagic fans have voiced anti-orange outrage since City Edition jerseys were first introduced, yet Nike keeps coming back with more.\n\nwho will win this feud? no one. except Nike https://t.co/wQJg19j4Fn",
    "431": "@OrlandoMagic 👀👀 let’s see that city jersey then!",
    "432": "@OrlandoMagic It would look better if you just rebranded to the old school jerseys",
    "433": "@OrlandoMagic so HD",
    "434": "@OrlandoMagic Ima need the link for a hat and a cole anthony jersey please &amp; thank you",
    "435": "@OrlandoMagic is that the Suns or the Magic?",
    "436": "@OrlandoMagic they look like shit. can’t wait till you ditch the orange theme",
    "437": "@OrlandoMagic Let me get that link to buy the shorts",
    "438": "@OrlandoMagic Love 🍊",
    "439": "@OrlandoMagic Nice",
    "440": "@themikeattack_5 @AdamSchefter Michael Carter-Williams was the NBA rookie of the year in 2014. He currently plays for the Orlando Magic",
    "441": "@OrlandoMagic Oh shitt https://t.co/b3Eaf6JHjL",
    "442": "@vucevicstan @VinoBuCketZ @OrlandoMagic @AdventHealth @franzboogie Nope. Not at all.",
    "443": "@OrlandoMagic Knicks?",
    "444": "@OrlandoMagic YES! If this is a mix between a throwback and last years citrus theme, this is gonna be great.",
    "445": "@schwarm @Loki_Wodenson @FabGeorgeFacts @OrlandoMagic @Sailor_NikNak @DM_Doesnt @GamerAdvantage @Alec_Azzam @rstockto @SexyMaryAnna1 @goblinsngambles The day before I helped my mom take the littles trick or treating then my fiancé and I handed out candy",
    "446": "@schwarm @Loki_Wodenson @FabGeorgeFacts @OrlandoMagic @Sailor_NikNak @DM_Doesnt @GamerAdvantage @Alec_Azzam @rstockto @SexyMaryAnna1 @goblinsngambles Worked then at home",
    "447": "@theozonepod 6-7 need to go back to black and blue . Orange is ok but that’s not Orlando Magic",
    "448": "@OrlandoMagic jerseys suck",
    "449": "@OrlandoMagic Oh damn",
    "450": "@OrlandoMagic Wanny owns y’all smh",
    "451": "@OrlandoMagic A follow back?? 👀",
    "452": "@OrlandoMagic The social media team now that we’ll finally stop asking about bringing back the pinstripes (maybe)… https://t.co/xeLja1Vp54",
    "453": "@OrlandoMagic * incoming new city edition 👀💙🖤",
    "454": "@OrlandoMagic Love it!!\nLet's get back to greatness. I smell a championship in the coming years 💚🤞",
    "455": "@OrlandoMagic Follow back please",
    "456": "@OrlandoMagic Follow Back",
    "457": "@OrlandoMagic OH THATS HOT",
    "458": "@OrlandoMagic That's so cool ! I love it",
    "459": "LEAKED -- Orlando Magic 2021-22 City Edition Jersey\n\nThe Stars and Stripes are HERE\n\nT-Mac's Magic Star Font is BACK\n\nthe color scheme is something...  but is this anything?? https://t.co/uT4wmHIsOD",
    "460": "Today we get city edition jerseys 🧡@OrlandoMagic  #GoMagic",
    "461": "@HoopsTalk13 @OrlandoMagic If NO is smart they hold Ingram and sell Zion.",
    "462": "My Day 21 in the #GTSLiveryoftheDay challenge is quite Magical ✨ #MagicTogether @OrlandoMagic https://t.co/phoRZnKcKn",
    "463": "Magic finish their road trip tonight in Minnesota as they try to put an end to a three game losing streak. \n\n#MagicTogether #OrlandoMagic #NBA https://t.co/jLDDtPU7H5",
    "464": "NBA Day 1️⃣4️⃣ 🏀🏀🏀\nSan Antonio Spurs vs Indiana Pacers\nPortland Trail Blazers vs Philadelphia 76ers\nCleveland Cavaliers vs Charlotte Hornets\nWashington Wizards vs Atlanta Hawks\nChicago Bulls vs Boston Celtics\nToronto Raptors vs New York Knicks\nOrlando Magic vs Minnesota Twolves",
    "465": "30 year Magic-versary?\n\nCity Jerseys must be on their way…\n\nI’m thinkin’ OG black with orange pinstripes instead of white, hopefully with Orlando written cursive, maybe an 🍊 or a 💫 as one of the letters",
    "466": "On this day 30 years ago, the Orlando Magic opened a season with a win for the first time as they took down the New York Knicks at Orlando Arena, 106-96: https://t.co/6zPtpt9VHc #MagicTogether via @MikeWFerguson  https://t.co/LFj9CPDQQ3",
    "467": "On this day 30 years ago, the Orlando Magic opened a season with a win for the first time as they took down the New York Knicks at Orlando Arena, 106-96: https://t.co/Odh4ClQUlZ #MagicTogether https://t.co/QpWoX6bnLD",
    "468": "Orlando Magic Video coming.............. https://t.co/3dFZYCbPB3",
    "469": "@Dan_Savage @JJudahIsaac @chuma_okeke @OrlandoMagic @DetroitPistons Hey lawyer guy!!! how about you spread the truth. Masks work. Heres scientific proof of that. https://t.co/ahsiovKmud",
    "470": "maybe i should play for the orlando magic 👁👄👁",
    "471": "Look what I found on @eBay! https://t.co/4oHUb3vwZd via @eBay #nba #magic #orlando #NBA2K22",
    "472": "21:00 – Denver Nuggets x Memphis Grizzlies\nNBA LEAGUE PASS\n\nOrlando Magic x Minnesota Timberwolves\nNBA LEAGUE PASS\n\n21:00 – 🏒NHL\nOttawa Senators x Chicago Blackhawks\nSTAR+\n\n21:15 – 🏈NFL\nNew York Giants x Kansas City Chiefs\nESPN\n\n(+)",
    "473": "From the Magic Kingdom to magical spa treatments, Orlando sparkles with the promise of adventure. Spend a day exploring the world-famous Disney theme parks or screaming your head off on a Universal... \n\nAir ticket from Abu Dhabi to Orlando\nhttps://t.co/yIf8LM88Ba",
    "474": "GAMEDAY!!!\n\nOrlando Magic @ Minnesota Timberwolves\n\n02:00 AM 🇪🇸\n\n#MagicTogether \n#RaisedByWolves",
    "475": "New York Knicks vs Orlando Magic  https://t.co/mECTvfJB94",
    "476": "Philadelphia 76ers Vs Orlando Magic  https://t.co/GHylGgmHPM",
    "477": "Houston Rockets vs Orlando Magic  https://t.co/8h8UJmkIUN",
    "478": "Dallas Mavericks vs Orlando Magic  https://t.co/5O7KonrTAK",
    "479": "Minnesota Timberwolves - Orlando Magic\nKansas City Chiefs - New York Giants\nLos Angeles Clippers - Oklahoma City Thunder\n\nBet slip link: https://t.co/PwdAHaHztV https://t.co/3noNra6hle",
    "480": "Miami Heat vs Orlando Magic  https://t.co/I3UMreJzCm",
    "481": "@OrlandoMagic So I am guessing you love the holiday Halloween and haunted houses. And things that go bump in the night. Happy Halloween. Thanks for sharing your time and story with us.",
    "482": "@OrlandoMagic @umichbball @franzboogie @The_ColeAnthony I was there! As a Michigan fan it was cool to see that on the opposing team. Announcer was yelling Wagner nonstop all game. Glad pistons pulled it off but they were a force to be reckoned with!",
    "483": "Book Review: “Disney World at 50: The Stories of How Walt’s Kingdom Became Magic in Orlando”: https://t.co/QQjv6Fqjo7 #disneybook #DisneyWorld50 https://t.co/c18erm7TrM",
    "484": "Minnesota Timberwolves vs Orlando Magic NBA Picks, Odds, Predictions 11/1/2021 https://t.co/cdS9oc1GC1",
    "485": "Okay Orlando peeps. Halloween is over. Christmas starts Nov 5th when @Magic107 switches over to Christmas magic…",
    "486": "@OrlandoMagic for @halseyandone  Ashley I remember 😍😍😍😍",
    "487": "Orlando Magic. Cleveland Cavaliers. San Antonio Spurs. https://t.co/2QxJ0hsrdC",
    "488": "@TupacAG @NBA2K I’ll one up you. Add the Orlando Magic in while you are at it @nba2k. Dwight, Lewis, Reddick, Nelson, Hedo, Gortat, Alston etc are already in the game….",
    "489": "Has the @OrlandoMagic seen this Sugg character rebound? He is standing almost in the exact place the rebound will be &amp; he literally runs passed the person he should be boxing out. Then that player gets the rebound. @Raptors would not have won a title if K.Low \"rebounded\" that way https://t.co/uWKwgQfdWn",
    "490": "New York Knicks vs Orlando Magic. $399 https://t.co/3YJecphpxl",
    "491": "Philadelphia 76ers vs Orlando Magic. $399 https://t.co/G9OJPDuQFt",
    "492": "Houston Rockets vs. Orlando Magic. $299 https://t.co/2sY97SitFm",
    "493": "Dallas Mavericks vs. Orlando Magic. $299 https://t.co/rV8oLRrceC",
    "494": "Miami Heat vs Orlando Magic. $299 https://t.co/TiqKATJVol",
    "495": "@OrlandoMagic @AdventHealth @franzboogie Hedo but with cheese",
    "496": "Orlando Magic https://t.co/dBJX8314TV",
    "497": "Orlando magic https://t.co/NtNxuP5s90",
    "498": "All home games @TargetCenterMN will bring you live on @BallySportsNOR \n\nMonday November 1st @OrlandoMagic 7pm \n\nWednesday November 3rd @LAClippers 7pm \n\nFriday November 5th @LAClippers 7pm",
    "499": "@PrimeKarlMarx @LGM_NYR Orlando magic loser lol",
    "500": "📖 🔟 Interesting @OrlandoMagic Stats Through Team’s First Seven Games by @Josh_Cohen_NBA\n\n#MagicTogether \n\nhttps://t.co/AekLb7S7yx",
    "501": "Magic wear down as trip comes to close at Timberwolves - Orlando Sentinel https://t.co/D03ZEl5ChR",
    "502": "@AshNicoleMoss @ZionOlojede Orlando magic",
    "503": "@HeartHustleORL @OrlandoMagic @TheRealMoBamba Ok, I thought since we didn’t sign him before the season he was unrestricted after the season.  #Pay This Man",
    "504": "Yall lost to the Orlando Magic😭 https://t.co/FixQLV1WTh",
    "505": "@Nasa_Grounded @scottfree321 @Kaibeast5 @DOCtheSAVAGE @Mar6Clark @MichaelHorst94 @TheHoopCentral Just because they never did it doesn't mean that they couldn't. DHoward 2008-2009 Orlando Magic team had THREE(3) ALL-STARS! Which means he had help getting to the finals. ALL NBA teams can at times be wrong because it is a popularity contest.",
    "506": "@HoopsTalk13 @OrlandoMagic This... looks pretty bad. Wow",
    "507": "@TheNBACentral Orlando Magic content &gt;&gt;&gt;&gt;&gt;",
    "508": "@amirewastaken We can't defeat the nets but the Orlando Magic knocking the bucks out of playoff contention for us",
    "509": "@ParkerMolloy Spoiled by TBS in the 90’s with that team. On a sick day if I could catch it right, in central Florida, it’d be Harry on the cubs, Skip on the Braves, and Chip on the Orlando Magic.",
    "510": "@OrlandoMagic y’all want an expiring contract that will provide a veteran presence to the locker room? https://t.co/ov8USusarW",
    "511": "@TDavenport_NFL @OrlandoMagic still paying him, I think ?"
}