{
    "0": "Watch Phoenix Suns vs. Los Angeles Lakers Live Stream Online\n🔴Go Live📺📱👉https://t.co/EGVO1BZwPv\n🔴Go Live📺📱👉https://t.co/EGVO1BZwPv https://t.co/hldhFKTyPb",
    "1": "ALERT: New high roller bet posted!\nA bet has been placed for $6702.41 on Phoenix Suns - Los Angeles Lakers to win $13,672.92.\nTo view this bet or copy it https://t.co/HsGtptJToM https://t.co/JJDH395qup",
    "2": "@Oloyedey4u Yes. Played for Los Angeles Lakers",
    "3": "ALERT: New high roller bet posted!\nA bet has been placed for $15,013.59 on Phoenix Suns - Los Angeles Lakers to win $27,925.27.\nTo view this bet or copy it https://t.co/xcMGk5R3N8 https://t.co/FAxITaxHYt",
    "4": "Sydney FC 🤝 Los Angeles Lakers \n\nNot making the post season",
    "5": "ALERT: New high roller bet posted!\nA bet has been placed for $29,986.43 on Phoenix Suns - Los Angeles Lakers to win $53,675.71.\nTo view this bet or copy it https://t.co/sA6yteNnUT https://t.co/8lKChMocfY",
    "6": "Phoenix Suns - Los Angeles Lakers\n\nBet slip link: https://t.co/NunkggueAb https://t.co/ffHvNVcvvM",
    "7": "Phoenix Suns - Los Angeles Lakers\n\nBet slip link: https://t.co/pDQnWzPDty https://t.co/GmQOORiuBU",
    "8": "ALERT: New high roller bet posted!\nA bet has been placed for $30,000.00 on Phoenix Suns - Los Angeles Lakers to win $57,600.00.\nTo view this bet or copy it https://t.co/65ecJZMVVs https://t.co/a8Ad0RHjit",
    "9": "Phoenix Suns - Los Angeles Lakers\n\nBet slip link: https://t.co/h3anuDRYxH https://t.co/gcPPGj5QGC",
    "10": "Today's NBA Picks: 10:30 PM ET - Los Angeles Lakers vs. Phoenix Suns - 15 PICKS AVAILABLE: https://t.co/e1xpGs0nnY #nba",
    "11": "They don't want the Los Angeles Lakers in the playoffs lol. https://t.co/0sCd7zoQ5Z",
    "12": "Tonight is the night we move on from this experiment known as the 2021-2022 Los Angeles Lakers … it’s been real https://t.co/cxxMGFDWtH",
    "13": "Los Angeles Lakers Starters:\n\nRussell Westbrook\nMalik Monk\nAvery Bradley\nAnthony Davis\nDwight Howard\n\nPlayers out:\nLeBron James\n#LakeShow #NBA #NBATwitter #NBA75",
    "14": "LAL crew vs PHX\n\n#SuitingUpTogether | @ToyotaSoCal https://t.co/wPg9yZ7VZm",
    "15": "Check out Kobe Bryant Los Angeles Lakers NBA Auto RP Holo 11\"x14\" Engraved Matted Frame https://t.co/a0AsyhaydO @eBay",
    "16": "Plaschke: Lakers' season a collection of pratfalls and airballs (Los Angeles Times)\n\nAfter the Lakers blew a lead and lost to Golden State in the first game of this season, LeBr...\n\nAdd your highlights:\nhttps://t.co/M9pXDpQkmz\n #LA_Lakers",
    "17": "Los Angeles Lakers Starting Lineup 4/5\n PG: Russell Westbrook\n SG: Malik Monk\n SF: Avery Bradley\n PF: Anthony Davis\n C: Dwight Howard\nhttps://t.co/o75oZ8vnE8",
    "18": "Check out 1986 Star Court Kings #17 Magic Johnson Los Angeles Lakers Graded BGS 8.5!!!!!! https://t.co/tZckJ8Kmrq @eBay",
    "19": "Uniforms for Los Angeles Lakers vs Phoenix Suns at 7:30 PM on NBA TV.\n\n#LakeShow #ValleyProud https://t.co/5ZuA8uaMrA",
    "20": "Los Angeles lakers have been ELIMINATED from playoff contention. Most disappointing team in history? https://t.co/MxxXs1E7oh",
    "21": "Reunited. https://t.co/T2JxCoBrVF",
    "22": "Lakers' Ultimate Tank Song (parody of One Call Away)\n\nI'm only 1, game away!\nI'll be there to your big, lottery day!\nAdam Silver got no, thing on me!\nI'm only 1, game away!\n\nok you fans carry on the lyrics!\n\n#Lakers\n#NBA\n#NBAonESPN\n#LosAngelesLakers\n#NBADraftLottery",
    "23": "Los Angeles Lakers Vs Phoenix Suns Live Play By Play &amp; Reaction https://t.co/5dtPwsPS3a",
    "24": "The Los Angeles Lakers will be without LeBron James (ankle), but will have Anthony Davis when they take on the Phoenix Suns on Tuesday night.\n\n#ValleyProud\nhttps://t.co/IAg9Rahyfi",
    "25": "@notcrypticno you said this bc even you can’t make the los angeles lakers win a basketball game. WAKE UP.",
    "26": "Phoenix Suns - Los Angeles Lakers\n\nBet slip link: https://t.co/Fl4gvwLiBh\n\n#PhoenixSuns #LosAngelesLakers #dogecoin #doge #gaming https://t.co/sXmG9Svk7G",
    "27": "@WashWizards Fun fact: the Los Angeles lakers originated in Minnesota because of its lakes!",
    "28": "Magic Johnson Blasts The Los Angeles Lakers: 'Quit Making Excuses. This Thing Did Not Work Out, The Parts Did Not Fit.' – Lakers News https://t.co/OEHaqauRvC",
    "29": "Magic Johnson Blasts The Los Angeles Lakers: 'Quit Making Excuses. This Thing Did Not Work Out, The Parts Did Not Fit.' – NBA News https://t.co/YiF1jmSxdi",
    "30": "Starting PG for the Los Angeles Lakers 🤩🤩🤩 https://t.co/Io2E7BRUJf",
    "31": "@epitomeofbeau @PHLSixersNation I mean the man you're questioning is comparable to Pop in some eyes. Have some respect for the future coach of the amazing Los Angeles Lakers",
    "32": "GSN-Kareem Abdul-Jabbar is once again criticizing Los Angeles star LeBron James and the way he uses his platform. “Some of the things he’s done and said are really beneath him, as far as I can see,” Abdul-Jabbar said Sunday before the Lakers’ 129-118 loss to the Denver Nuggets. https://t.co/IuJNduyg35",
    "33": "Column: The Lakers' misguided and mismanaged season went from bad to worse. There is plenty of blame to go around https://t.co/lD9PS4RwUA",
    "34": "A atypical season of losing for LeBron James 👀 \n\nCleveland Cavaliers | Los Angeles Lakers https://t.co/gKPVpQsNQk",
    "35": "NBA Betting Pick and Prediction: Los Angeles Lakers vs. Phoenix Suns - Tuesday, April 5, 2022 https://t.co/L5WOMaJ21a",
    "36": "During the 1983-84 NBA season, the Utah Jazz played 11 \"home\" games at the Thomas &amp; Mack arena in Las Vegas, NV. Hosting the Los Angeles Lakers on Apr 5, 1984, Kareem Abdul-Jabbar passed Wilt Chamberlain as the NBA's all-time leading scorer. https://t.co/WWgd3avZMI https://t.co/nidDT1PqZM",
    "37": "Stephen A. Smith: “Lakers are a national basketball atrocity” #LosAngelesLakers https://t.co/EAf6pa81xZ",
    "38": "6. Los Angeles Lakers",
    "39": "Not too long ago, the Atlanta Braves had less than a 1% chance of making the playoffs before winning the World Series. Now, the Los Angeles Lakers have less than a 1% chance of making the playoffs… 2022 NBA Champions?",
    "40": "Fuck the Los Angeles Lakers, Rob Pelinka and Russell Westbrook. https://t.co/GTwgn1Qimp",
    "41": "The Lakers are a national basketball ATROCITY - Stephen A. Smith | #NBA Countdown - https://t.co/iOb9d3BSYA - #ESPN #Greenberg #Healthy #JalenRose #LosAngeles #LosAngelesLakers",
    "42": "Los Angeles Lakers' LeBron James to miss another game due to ankle injury https://t.co/MeMjiQrIpn",
    "43": "LeBron James vs Lakers: Drama in Los Angeles! War of Words Has Begun! - Upside Sports Network\nhttps://t.co/RuxVQTnBu4",
    "44": "5 Los Angeles Lakers head coach candidates to replace Frank Vogel #LakeShow #NBA #NBATwitter #NBATwitterLive \n\nRead More- https://t.co/UoDAyQTvOn https://t.co/c7hm9wYesc",
    "45": "@SportsCenter While LeBron James is undoubtedly one of the best players in the NBA, his current team, the Los Angeles Lakers, have proved to be disappointing all season long.",
    "46": "Los Angeles #Lakers' LeBron James to miss possible elimination game due to ankle injury https://t.co/69ACQEO5rc via @upi #NBA #NBATwitter #NBATwitterLive #LakeShow",
    "47": "Los Angeles Lakers vs. Phoenix Suns picks, predictions, odds: Who wins NBA game Tuesday? https://t.co/7Bo96Qp69e",
    "48": "LeBron James to miss Lakers' game tonight against Suns https://t.co/w5FQ5yZeOV",
    "49": "Congratulations to lakersdynasty999 who moved up 3 spots to take #19 on the Los Angeles Lakers team leaderboard.\n\nhttps://t.co/7jbi1baNWE",
    "50": "I should be the next coach for the Los Angeles Lakers.",
    "51": "Now that my Los Angeles Lakers are eliminated. I can proudly join the bandwagons of the Milwaukee Bucks and the Dallas Mavericks.",
    "52": "ALERT: New high roller bet posted!\nA bet has been placed for $6,865.77 on Phoenix Suns - Los Angeles Lakers to win $52,179.88.\nTo view this bet or copy it https://t.co/ReuDawxeuO https://t.co/JVicXBccAo",
    "53": "Playoff picture, Los Angeles Lakers, play-in tournament, Frank Vogel fired, Doc Rivers,LeBron James injury, San Antonio Spurs, reaction https://t.co/IjmzhzDVmt",
    "54": "Per source: The Los Angeles Lakers will be parting ways with HC, Frank Vogel at the end of the season.",
    "55": "NBA LIVE TODAY🔴 Los Angeles Lakers vs Phoenix Suns - 5th April 2022 | NB... https://t.co/7qfb4bL1cu",
    "56": "Playoff picture, Los Angeles Lakers, play-in tournament, Frank Vogel fired, Doc Rivers,LeBron James injury, San Antonio Spurs, reaction https://t.co/dvY59cqCNT",
    "57": "oooww  🔥🔥🔥\nshare a live her Clicks go :https://t.co/rIH7wNyeUC\nOr HD  her:https://t.co/h3jyZOQhYJ\n#nbatrades #nbahistory #nbadraft #nbachamps #derrickrose #losangeleslakers #kobebryant #nbalive #nfl #antetokounmpo https://t.co/FJ3tgB6PNF",
    "58": "So L&amp;Gs. Please understand that after tonight by schedule and system of the NBA the Los Angeles Lakers MY LAKERS will be eliminated from Play In contest. Lets all be in a circle tonight with Bibles and Prayers that Rob Pelinka is next on this list with Frank Vogel being fired!😈",
    "59": "The Los Angeles Lakers are expected to fire Frank Vogel when the season is over. #The Lakers #NBA",
    "60": "@PBrooksReporter @espn @BallsackSports @Lakers Lakeshow Life: All of the Los Angeles Lakers problems start at the top.\nhttps://t.co/iEnWQce1Ux",
    "61": "TOMORROW: What do you want to know about #WinningTime and the Showtime-era Lakers?\n\nJoin the hosts of \"Binge Sesh\" for a reddit AMA at noon PST.\nhttps://t.co/TpbSQvGiWa",
    "62": "April 5, 1984: Los Angeles #Lakers C Kareem Abdul-Jabbar became the NBA’s all-time leader in PTS as he used his patented sky hook to pass former Laker great Wilt Chamberlain (31,419). The formerly known Lew Alcindor finished with 38,387 PTS (most ever)\nhttps://t.co/9OX5hieCGl",
    "63": "NBATV Center Court not available in Los Angeles and Phoenix markets. Lakers fans can watch the game Spectrum SportsNet while Suns fans can watch it on Bally Sports Arizona. https://t.co/iig4OxMI6X",
    "64": "Here is footage of @LilTunechi and @LilTwist arriving to the #LosAngelesLakers vs. #Philadelphia76ers NBA game just under 2 weeks ago! 🏀\n\n🎥 @unCrazedUK https://t.co/hsEORU9ySG",
    "65": "Flea Shreds the National Anthem on Bass at Los Angeles Lakers Game – Rolling Stone https://t.co/UUjfppUd37",
    "66": "The Lakers are not expected to hire Kurt Rambis as their next head ... (Silver Screen and...)\n\nWhen the Los Angeles Lakers inevitably fire Frank Vogel into the sun shortly after the concl...\n\nAdd your highlights:\nhttps://t.co/GHqh27CXJ4\n #LA_Lakers",
    "67": "Thinking about betting on Lock It In Los Angeles Lakers vs Phoenix Suns(NBA)?  Find out what pick Pine member @nvmbhearts locked in for the game.\n\nhttps://t.co/VTBYTecUe8 #GamblingTwitter",
    "68": "LeBron James to miss Lakers' game tonight against Suns (Los Angeles Times)\n\nLeBron James will miss his second straight game Tuesday night because of his sprained left a...\n\nAdd your highlights:\nhttps://t.co/DKIjPSN0FH\n #LA_Rams",
    "69": "The Los Angeles Lakers Can STILL Make The Playoffs... https://t.co/FvdFH7P2Kp via @YouTube",
    "70": "The Los Angeles Lakers look to make a final push into the postseason as they take on the high-flying Phoenix Suns tonight 😅 \n\n#NBA #LakeShow #ValleyProud\nhttps://t.co/2jlk5fMXOq",
    "71": "@Xbox Los Angeles Lakers!! @Lakers\n#ScoreMoreWithXbox #XboxDesignLab #sweepstakes https://t.co/0aVbOSz9aZ",
    "72": "PHOENIX (AP) — The Los Angeles Lakers again will be without star LeBron James as they try to stave off playoff elimination. https://t.co/i2ldZmq4wQ",
    "73": "Los Angeles Lakers Kobe Bryant jersey lapel pin-HOF 2020-Classic Collectible - https://t.co/UR3xR63iG9\n\n#lebron #lebronjames #lakers #nba \nhttps://t.co/2F8CwM5QOv",
    "74": "Flea Rocks Fuzzed Out Bass-Led National Anthem at Los Angeles Lakers Game https://t.co/OKzvvTXQxK",
    "75": "Kareem Abdul-Jabbar Apologizes to LeBron James Following Criticism of Lakers Star: NBA legend Kareem Abdul-Jabbar issued a public apolog https://t.co/GZBU1uyghS #Basketball #NBA #LosAngelesLakers #LeBronJames https://t.co/wTVTOa3yyq",
    "76": "The \"Los Angeles Lakers have been eliminated from the playoffs\" is about to hit different 🔥🙏",
    "77": "LeBron quit on the Lakers, the city of Los Angeles, and its fans, \n\nLBJ isn't a true leader.\n\n#NBA",
    "78": "They talking bout Doc Rivers being the next coach of the Lakers? The Los Angeles Lakers of the NBA? https://t.co/i3iytHhtX6",
    "79": "#LosAngelesLakers #NBA Losing Alex Caruso crippled the Lakers more than we thought was possible https://t.co/C2EBwZGIkY",
    "80": "if the los angeles lakers win the 2022 nba championship, i will do a face reveal",
    "81": "All of the Los Angeles Lakers problems start at the top https://t.co/X3BAtBOIJP",
    "82": "Damn the phoenix suns have twice as many wins as the Los Angeles lakers #analysis",
    "83": "LeBron James will miss his second straight game Tuesday night because of his sprained left ankle, the Lakers announced in Phoenix before their game against the league-leading Suns.\nhttps://t.co/w5FQ5yZeOV",
    "84": "5 Los Angeles Lakers head coach candidates to replace Frank Vogel https://t.co/CGYEN6YdRq",
    "85": "I would take that too  RT @zain_gogh: 2022-2023 Los Angeles Lakers Coach and his star player LeBron James https://t.co/XMv08AGKBs",
    "86": "Phoenix Suns Predictions and Preview for 4/5/2022 hosts Los Angeles Lakers.  Find out who we are taking in this matchup. #SportsBetting #Punters https://t.co/u5n546NdNF",
    "87": "The basketball world needs to see Doc Rivers coach the Los Angeles Lakers",
    "88": "🏀 GAME ANALYSIS 🏀\n\n🏟 Los Angeles Lakers vs Phoenix Suns 🏟\n\n▶️ BET THE NBA ▶️ https://t.co/odroCYfQFJ\n\n#NBA #GamblingTwitter \n\nhttps://t.co/PTpssczz2k",
    "89": "@latimes But The Captain was right in everything he said. LeFraud has tarnished the great Lakers organization.\n\nThe fact he cannot suit up when the playoffs are on the line says it all.",
    "90": "Los Angeles Lakers visits Phoenix Suns Predictions and Preview for 4/5/2022 today.  Who are we taking in this game?  Find out now. #SportsBetting #Punters https://t.co/u5n546NdNF",
    "91": "8 Ways Kobe Bryant Carried the 2012-13 Los Angeles Lakers to the NBA Playoffs https://t.co/AHJVMYzmWC",
    "92": "On this date (4/5) in 1️⃣9️⃣8️⃣4️⃣ @kaj33 becomes the NBA’s all-time career scoring leader. He finished his career with 38,387 points. #kareemabduljabbar #thecaptain #cap #losangeleslakers #lakernation #skyhook #nba #alltimeleadingscorer #OnThisDate https://t.co/CNzxkDV4Mq",
    "93": "🔴𝑳𝒊𝒗𝒆 ~ Los Angeles Lakers vs. Phoenix Suns - NBA League 2022 💯\n🔵🎥 Watch Live Fullᴴᴰ 👉 https://t.co/jFmiScuWhG ☑️\n📆 : On Tuesday. April 05 /2022\n⏰ : 9:30 PM",
    "94": "Los Angeles Lakers expected to part ways with Frank Vogel after the season wraps up 😬\n\nEarly candidates already started to emerge 👀\n\n🏀BET ON LAKERS' FUTURE COACH ➡️ https://t.co/O9A4v9j3JC\n\n#NBA #NBATwitter #LakeShow https://t.co/j6CZZ2G3No",
    "95": "This picture was taken in Bakersfield, CA at Centennial Garden, now @MechanicsBArena.\n\n18 year old LeBron James finished with 14 points and 10 rebounds against Shaq, Karl Malone, Gary Payton, and the Los Angeles Lakers. https://t.co/1LaxU5d8yU",
    "96": "As a lifelong fan of the legendary Lakers franchise, the legendary coach Doc Rivers, and the legendary player LeBron James, I fully support a uniting of this trinity.  I see multiple championships in Los Angeles if the Lakers can figure out a way to make this happen.",
    "97": "ESPORTE NA BAND - 07/04\n\n23:30 NBA\nLos Angeles Lakers x Golden State Warriors",
    "98": "The Los Angeles Lakers are going to have to pull out a win on the road tonight against the Phoenix Suns without LeBron James if they want to keep their playoff hopes alive. https://t.co/wRERnlmr5k",
    "99": "The next head coach of the Los Angeles Lakers will be:",
    "100": "The Los Angeles Lakers will head into a potential elimination game without their leader, LeBron James, after he was ruled out of Tuesday's game against the Phoenix Suns with left ankle soreness.\nhttps://t.co/0IA9FzeLRF\n#NBA #NBAxESPN #ESPNCaribbean https://t.co/yMsvwAll6e",
    "101": "Consensus Line Move:\n2022-04-05 Los Angeles Lakers at Phoenix Suns from 231.50 to 234.00\nOver buy-back\n#NBA #vegas #deeplearning #wallstreet",
    "102": "Have any questions about \"Binge Sesh,\" the Showtime-era Lakers or anything #WinningTime?\n\nJoin hosts @thefilmgoer and @KareemMaddox for an AMA on reddit tomorrow at noon PST!\nhttps://t.co/TpbSQvoHxA",
    "103": "The Los Angeles Lakers will miss the playoffs for the seventh time in nine seasons.",
    "104": "With a loss tonight &amp; a Spurs win, the Los Angeles Lakers would be eliminated from playoff/play-in contention. \n\nLos Angeles plays Phoenix without LeBron James &amp; San Antonio plays Denver. \n\nWill they be eliminated tonight? 🤔 https://t.co/ndIRexzHIo",
    "105": "Los Angeles Lakers’ LeBron James to miss another game due to ankle injury https://t.co/HmR3rgs3DO https://t.co/ZmbDSULqdG",
    "106": "Los Angeles Lakers vs Phoenix Suns - NBA League\n🔴Live Stream Available📺📱:  https://t.co/nyBdc5t5qC\nDate : Tuesday, April 05, 2022 - Time : 10:30 PM",
    "107": "Los Angeles Lakers vs Phoenix Suns - NBA League 2022\n🔴Live Now📺📱:  https://t.co/wz1CSMSYNX\nDate : Tuesday, April 05, 2022 - Time : 10:30 PM",
    "108": "Los Angeles Lakers LeBron James OUT Tuesday vs. Suns – Lakers News https://t.co/5GpWoLWpOP",
    "109": "According to @JakeLFischer, while some rival executives around the league have wondered about the #Lakers' willingness to discuss trading star PF-C Anthony Davis this offseason, it will not seriously be on the table for the Los Angeles branch.",
    "110": "Lakers opened at +375 to win the title this year. 🏆\n\nWith a loss vs. the Suns tonight + a Spurs win vs. the Nuggets, Los Angeles would be eliminated from the play-in tournament. 😳 https://t.co/NUVU5qVq22",
    "111": "#WinningTime is based on Jeff Pearlman’s seminal book on the Showtime Lakers. But it makes some key changes 👀 https://t.co/xiqy5P2XbN",
    "112": "@BookitWithTrent Los Angeles Lakers to win the finals",
    "113": "On this day: In 1984, Los Angeles Lakers player Kareem Abdul-Jabbar broke Wilt Chamberlain’s points record with a basket that brought him to 31,421 career points - via @TheHustle",
    "114": "Philadelphia 76ers: The Los Angeles Lakers want Doc Rivers? Oh no – Lakers News https://t.co/BJ2otJ1HQ4",
    "115": "GAMEDAY!📍\n-\nThe Los Angeles Lakers take on the Phoenix Suns tonight at 7:30 PM PST in the Footprint Center. 💜💛\n-\nWho do you think will win this game tonight? 🤔 \n- \n📸: ( @adampantozzi &amp; @JoeMurphyPhoto) \n- \nFollow @lalakersquad for more! 🔥 https://t.co/yCMBsZrUhx",
    "116": "Los Angeles Lakers’ LeBron James to miss another game due to ankle injury https://t.co/1jYiEiM6bt",
    "117": "Los Angeles Lakers’ LeBron James to miss another game due to ankle injury https://t.co/jlQ832NS1q",
    "118": "Los Angeles Lakers’ LeBron James to miss another game due to ankle injury https://t.co/Oxi2p5slfn",
    "119": "Four potential replacements for Frank Vogel as the Los Angeles Lakers next head coach.\n\nhttps://t.co/klM4qrF0S2",
    "120": "BREAKING: The Los Angeles Lakers have fired Frank Vogel, league sources tell @ESPN and @BallsackSports. David Fizdale will serve as interim head coach for the rest of the season. \n\nThe Lakers are 31-47 this season, and on the brink of elimination. https://t.co/FtHM06duUl",
    "121": "Los Angeles Lakers’ LeBron James to miss another game due to ankle injury https://t.co/iAtEmuS9kK",
    "122": "In the Paint's Exhibition Host, @bandofvices is furthering the movement. See how you can take part.\n\n\n#LakeShow x @hennessy https://t.co/RNdzDPotTD",
    "123": "Lobos,The Shop &gt; The Los Angeles Lakers.......Lol",
    "124": "Manchester United, Nigeria, and the Los Angeles Lakers 🥲🥲. Only me!",
    "125": "Flea Shreds the National Anthem on Bass at Los Angeles Lakers Game https://t.co/SVqqrvhqji",
    "126": "LeBron James Los Angeles Lakers 2020-21 Nike Icon Swingman NWT size mens 40 small $80 https://t.co/hTyPLOwclY",
    "127": "Flea Rocks Fuzzed Out Bass-Led National Anthem at Los Angeles Lakers Game https://t.co/FFnItPwmc5",
    "128": "BREAKING: My sources tell me that the Los Angeles Lakers are planning on firing Frank Vogel immediately after game 82",
    "129": "NBA Game Analysis: The Phoenix Suns have a forecast 77% chance to win against The Los Angeles Lakers with a spread of -22.5/22.5 and an over/under of 233. The Phoenix Suns are 3 - 0 against The Los Angeles Lakers in the 2021-22 Season.\n#betthetrend\n\n#sportbetting",
    "130": "2022-2023 Los Angeles Lakers Coach and his star player LeBron James https://t.co/bRFU9jb1og",
    "131": "@brofromanother Owner of the Los Angeles Lakers",
    "132": "The FIRST LADY OF VEGAS has an #NBA #FREEWINNER in the #LosAngelesLakers #PhoenixSuns matchup. Go to https://t.co/lzNvScfPQ7 for her NBA BEST BET just $7. @1stladyofvegas @SM_Free_Plays @sportsmemo @WagerTalk #bettingexpert #bettingadvice #winningpicks #bettingtwitter #betting https://t.co/gIMlcxSDR0",
    "133": "Check out October 14 2018 Newspaper Los Angeles Times LA Lakers LeBron James NBA Preview  https://t.co/chbhwpYMeL via @eBay #LeBronJames #NBA #Lakers",
    "134": "1984 - Kareem Abdul-Jabbar (Los Angeles Lakers) became the all-time NBA regular season scoring leader when he broke Wilt Chamberlain's record of 31,419 career points.",
    "135": "@demas6Basket Los Angeles Lakers",
    "136": "Lakers fans really think Doc Rivers would be a step up from Frank Vogel, look at what he did to the other Los Angeles team😂",
    "137": "@DrGuru_ I can’t wait for Doc Rivers to be the coach of the Los Angeles Lakers. This would be the best thing to happen to Clippers basketball since we got rid of Doc Rivers. We’ll look at that, I’m fully erect!",
    "138": "Sz L NBA Authentic #6 Lebron James Jersey 2022 Los Angeles Lakers HOME GOLD - https://t.co/Cv5NWtfa72\n\n#lebron #lebronjames #lakers #nba \nhttps://t.co/E9rJZIr9cz",
    "139": "There's only one man who can coach the Los Angeles Lakers. https://t.co/QVVVq7cSBC",
    "140": "@BowenLeatham @dbassjk @Fatbasil1 @BleacherReport \"Rounding out the top five are the Golden State Warriors ($5.6 billion), Los Angeles Lakers ($5.5 billion), Chicago Bulls ($3.65 billion), and Boston Celtics ($3.55 billion). This marks the first time in NBA history that three franchises are worth more than $5 billion\"",
    "141": "Los Angeles Lakers' LeBron James to miss another game due to ankle injury – NBA News https://t.co/9L8OkG3gIs",
    "142": "@dbassjk @Fatbasil1 @BleacherReport Rounding out the top five are the Golden State Warriors ($5.6 billion), Los Angeles Lakers ($5.5 billion), Chicago Bulls ($3.65 billion), and Boston Celtics ($3.55 billion). This marks the first time in NBA history that three franchises are worth more than $5 billion.",
    "143": "@NolanCollins02 have you seen the Los Angeles Lakers play recently?",
    "144": "@Fatbasil1 @dbassjk @BleacherReport Rounding out the top five are the Golden State Warriors ($5.6 billion), Los Angeles Lakers ($5.5 billion), Chicago Bulls ($3.65 billion), and Boston Celtics ($3.55 billion). This marks the first time in NBA history that three franchises are worth more than $5 billion.",
    "145": "NBA Betting Trend: We have Los Angeles Lakers at +8 points, which is a -3.5 point difference from the current line. Consider taking the underdog.\n#sportshandicapper \n#sportbetting",
    "146": "Los Angeles Lakers' LeBron James to miss another game due to ankle injury – Lakers News https://t.co/BXloHIrNIO",
    "147": "😍 Kobe Bryant Los Angeles Lakers 8 Jersey (NBA) 😍 \nShop now 👉👉 https://t.co/lcP3dfIDLZ\n.\n#sportsfans\n#sportsjerseys\n#sportswearstor\n#nflfans\n#nbafans\n#mlbfans\n#nhlfans https://t.co/HhZPj8YdUe",
    "148": "“the los angeles lakers have been eliminated from playoff contention” gon hit diff https://t.co/TNrjnEF44D",
    "149": "Betting odds for Devin Booker and the Phoenix Suns against the Los Angeles Lakers https://t.co/J3JpqCRFL2",
    "150": "Los Angeles Lakers' LeBron James to miss another game due to ankle injury https://t.co/JnpLdk3oRE via @abc7",
    "151": "@BleacherReport The Los Angeles Lakers will head into a potential elimination game without their leader, LeBron James. James was ruled out of Tuesday's game against Phoenix Suns with left ankle soreness, the team announced. It will be James' third missed game out of the Lakers' last four.",
    "152": "The new owner of the Los Angeles Lakers. Hell yeah! #WinningTimeHBO https://t.co/AElwC14qbk",
    "153": "2019-20 Panini Mosaic Basketball Lebron James PSA 10 Gem Mint Los Angeles Lakers - https://t.co/IneYvULrw5\n\n#lebron #lebronjames #lakers #nba \nhttps://t.co/swbjTadxvh",
    "154": "Lakers legends show LeBron how hot the stage can really get in Los Angeles https://t.co/WIw4Yeb3VY",
    "155": "Flea Rocks Fuzzed Out Bass-Led National Anthem at Los Angeles Lakers Game https://t.co/Kc9hS9cf93",
    "156": "Flea Shreds the National Anthem on Bass at Los Angeles Lakers Game https://t.co/Ryyab9s2tR",
    "157": "Philadelphia 76ers coach Doc Rivers is mentioned as a potential candidate to be the head man for the Los Angeles Lakers.  https://t.co/KCEEfAJNGW",
    "158": "🙏RETWEET https://t.co/Cqaopjw6kf story Winning NBA Trades\n\nWho wins the trade? Should not be the question😏\nIt should be who is winning the trade at the moment😏\n\nThe Los Angeles Lakers trade with New Orleans Pelicans led to one asterisk championship.\n\nWill next season prove … https://t.co/rxSicFVHyt",
    "159": "Los Angeles Lakers Expected To Part Ways With Frank Vogel In The Offseason – NBA News https://t.co/IiE9R13iq5",
    "160": "@TheHoopCentral Los Angeles Lakers",
    "161": "Los Angeles Lakers Expected To Part Ways With Frank Vogel In The Offseason – Lakers News https://t.co/yW0c2XiBSG",
    "162": "BREAKING: LeBron James (ankle) will miss second consecutive game tonight vs. Phoenix. \n\nWith a Lakers loss &amp; Spurs win tonight (vs. Denver), Los Angeles would be eliminated from play-in contention. https://t.co/xfOXkCJcI1",
    "163": "Phoenix Suns can eliminate the Los Angeles Lakers from playoff contention with a historic 63rd win I break it all down and give you guys my thoughts. New video on Suns Geek https://t.co/mi6lykliQn #Suns #Lakers #NBA",
    "164": "After tonight's MASSIVE BLOWOUT loss the Los Angeles Lakers officially have been eliminated from playoff contention. #seeyouinthefall",
    "165": "Owner of the Los Angeles Lakers. Bring it on! https://t.co/Uj2GUfUbwp",
    "166": "@TheHoopCentral Los Angeles lakers https://t.co/mSXTmfrPpb",
    "167": "@ShamsCharania To all Lakers fans: Goodbye. I’ve had a long think about it and I have come to a conclusion that I don’t love the Los Angeles Lakers anymore. They will never win any more trophies/rings. I’ve decided to support the Cleveland Cavaliers , a real trophy winning team.",
    "168": "New post (Los Angeles Lakers vs. Phoenix Suns NBA Odds and Pick for April 5th) has been published on The Sports Geek - https://t.co/wtQdedx3CG https://t.co/HHTUhaQRRd",
    "169": "LeBron James is OUT tonight.\n\nThe Los Angeles Lakers have gone from +11.5 to +12.5 in Phoenix tonight.\n\n#NBATwitter #GamblingTwitter https://t.co/mI2amsYIzh",
    "170": "The fate of the Los Angeles Lakers could be decided tonight: \n\nWith LeBron James (ankle) OUT against the Suns, the Lakers will be eliminated from postseason contention with a loss vs. the Suns, a win by the Spurs in Denver.",
    "171": "“Lakers have the bunch of biggest FAILURES” Spurs go crazy after sending LeBron James and co. one step closer to the exit door https://t.co/glgVBD7kLT #LALakers #LosAngelesLakers",
    "172": "🚨 Line Change 🚨\n\nLos Angeles Lakers @ Phoenix Suns\nTue 10:40 PM EST\n\nFrom:\nPHO -11.5 -110\n\nTo:\nPHO -13.0 -110",
    "173": "@TheHoopCentral Los Angeles Lakers",
    "174": "Los Angeles #Lakers F LeBron James will not play against the Phoenix #Suns due to his ankle injury. He needs to play in 2 more games in order to qualify for the league leaders in stats. The Lakers have 3 games left in the season after this one. #NBA https://t.co/vWPOPnWFas",
    "175": "Consensus Line Move:\n2022-04-05 Los Angeles Lakers at Phoenix Suns from 232.50 to 231.50\nUnder with respect\n#NBA #sportspicks #computerscience #trader",
    "176": "Consensus Line Move:\n2022-04-05 Los Angeles Lakers at Phoenix Suns from -11.50 to -13.00\n#ValleyProud flying out\n#NBA #sportsgambling #ai #invest",
    "177": "BREAKING: LeBron James (ankle) will miss second consecutive game tonight vs. Phoenix. \n\nWith a Lakers loss &amp; Spurs win tonight (vs. Denver), Los Angeles would be eliminated from play-in contention.",
    "178": "The Los Angeles Lakers have been elminated from playoff contention** https://t.co/mBT5ZfD2nV",
    "179": "The Los Angeles Lakers are expected to fire HC Frank Vogel at the end of the season, Source @JakeLFischer #Lakers https://t.co/RlTzbkihfE",
    "180": "Los Angeles Lakers vs  Phoenix Suns 4/5/2022 Picks Predictions Previews\n\nhttps://t.co/w5zSoHTlh8\n\n#NBAprediction #NBAbetting #NBAbettingpicks #NBA #NBApicks #NBAparlay #odds #picks #prediction #parlay #sportspicks #basketballpicks #Expertbettingpicks #expertpicks #Lakers #Suns https://t.co/7G5DpcEEvp",
    "181": "The Los Angeles Lakers will face off against the Phoenix Suns tonight. #LALvsPHX \n\nWith a loss and a Spurs win tonight, the Lakers would be eliminated from playoff contention. #NBAPlayoffs https://t.co/3bV01Bfsrr",
    "182": "Ric Bucher on LeBron James: “He’s clearly not been chasing a championship this year” #LeBronJames #LosAngelesLakers https://t.co/Towpl91W0n",
    "183": "@dreamwisp I trust you implicitly to fulfill either role, and I say this now a member of the Los Angeles Lakers.",
    "184": "Kareem Abdul-Jabbar Clarifies LeBron James Criticism Source: Sean M. Haffey / Getty NBA legend Kareem Abdul-Jabbar is taking the opportunity to further clarify his recent criticism of Los Angeles Lakers superstar LeBron... - https://t.co/COFPnw5y2l #digitalmusiczone https://t.co/IAG5sbwQeb",
    "185": "@theScore Here is your 2023 Los Angeles Lakers Head Coach! https://t.co/G42kGtkfF0",
    "186": "I’m in a toxic relationship with the Los Angeles Lakers 🤦‍♂️",
    "187": "Kareem Abdul-Jabbar Clarifies LeBron James Criticism Source: Sean M. Haffey / Getty NBA legend Kareem Abdul-Jabbar is taking the opportunity to further clarify his recent criticism of Los Angeles Lakers superstar... - https://t.co/COFPnw5y2l #ghettomogul #onmygrind https://t.co/a4LjuTHhKq",
    "188": "Two coaches emerge as favorites to replace Lakers head coach Frank Vogel #DocRivers #FrankVogel #LosAngelesLakers #QuinSnyder https://t.co/BQshTC3u4e",
    "189": "@1067theFan @Snide_Remarks Oh really? Have you read Showtime: Magic, Kareem, Riley, and the Los Angeles Lakers Dynasty of the 1980s by Jeff Pearlman? Cause that really shows a different take on JKC &amp; the ridiculous behaviors League owners have and maintain. Really opened my eyes on transition of Teams too.",
    "190": "Our Lakers vs Jazz predictions compare and contrast the fortunates of both teams heading into the final few games of the regular season.\n\n#Losangeleslakers #NBA #basketball #Pointspreads #bettingtips \n\nhttps://t.co/Pwduih0zqk https://t.co/o0o6PqYFXZ",
    "191": "Los Angeles Lakers vs Phoenix Suns NBA Pick and Prediction NBA Betting T... https://t.co/WOSTPLy1Fp via @YouTube",
    "192": "@malik_mccombs @SothaChill @norfwesss @downtown7thave @YaBoiBats @_caseygillespie @JakeLFischer @BR_NBA Suns are still good and not named “Los Angeles Lakers” so what you just said was irrelevant to this conversation.",
    "193": "Uh .. I own The Los Angeles Lakers https://t.co/eK0earxdZk",
    "194": "Revenge Game: JaVale McGee plays Los Angeles tonight.  He played 143 games in his career for the Lakers.",
    "195": "The next HC of the Los Angeles Lakers https://t.co/95VrvkmBcY",
    "196": "People really believe Doc Rivers would leave the playoff contending, potentially MVP led Sixers to coach the volatile dumpster fire that is the Los Angeles Lakers?",
    "197": "DasHaus made a bet!\n\nEvent: Los Angeles Lakers vs Phoenix Suns #NBA\nBet: Phoenix Suns TO WIN -11.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "198": "DasHaus made a bet!\n\nEvent: Los Angeles Lakers vs Phoenix Suns #NBA\nBet: Los Angeles Lakers TO WIN +11.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "199": "i bet some y'all didn't know this. Quin Snyder was on Lakers Assistant Coach in 2011-12. i wouldn't mind us bring him back as a head coach of the Los Angeles Lakers.",
    "200": "Doc Rivers and Quin Snyder are potential candidates as potential replacements for the Los Angeles Lakers next season. Per @JakeLFischer",
    "201": "@DC13____ @Tha4StringKing @southdownunder @MushFatty @Hamie2224 @LAClippersWay @JakeSmoltz @cameronDwinfrey @RikDaddy The Clippers have a 2 billion dollar arena that opens in 2024. The Lakers ownership doesn’t have liquid assets to build their own modern arena, much less buy one. Los Angeles has NEVER publicly funded a venue for any major sports team. If the Lakers want a modern venue? Vegas.",
    "202": "Los Angeles Lakers expected to fire Frank Vogel, looking at coaching candidates to replace him https://t.co/ukRQ7FqZaF",
    "203": "Los Angeles Lakers expected to fire Frank Vogel, looking at coaching candidates to replace him https://t.co/TIRIFmyqlK",
    "204": "Los Angeles Lakers expected to fire Frank Vogel, looking at coaching candidates to replace him https://t.co/VCIesTw9VY",
    "205": "Los Angeles Lakers expected to fire Frank Vogel, looking at coaching candidates to replace him https://t.co/pII3W3NZCy",
    "206": "\"It’s also widely believed that Los Angeles, as has been the franchise’s custom, will prioritize coaching candidates with past connections to the organization.\"\n\nContinue assim, Lakers. Este é o caminho!!! Para o elenco também...",
    "207": "Owner of the Los Angeles Lakers https://t.co/vvcmitOIjh",
    "208": "Quin Snyder YOU are the next Los Angeles Lakers head coach. https://t.co/12zHsybowH",
    "209": "I own the Los Angeles Lakers https://t.co/UPXQQGGu88",
    "210": "With a loss &amp; a Spurs win tonight, the Lakers would be eliminated from playoff contention #LosAngelesLakers https://t.co/fAtlAOXwPR",
    "211": "\"As the Lakers are expected to focus on candidates with previous experience, former Los Angeles head coach and current Warriors assistant Mike Brown is known to have interest in departing Golden State for another opportunity in a team’s first chair.\" https://t.co/9UnUjmiJHa",
    "212": "News out of Los Angeles\nLos Angeles @Lakers are expected to move on from Frank Vogel after the season. \n#nba #nbanews #Lakers #FrankVogel https://t.co/4gdkINquA6",
    "213": "I’m either the owner of or the point guard of the Los Angeles Lakers https://t.co/lvEB5vSkya",
    "214": "KEEP DOC RIVERS AWAY FROM THE LOS ANGELES LAKERS",
    "215": "Los Angeles Lakers expected to fire Frank Vogel, looking at coaching candidates to replace him – Lakers News https://t.co/z6ZZdJkkjs",
    "216": "@Iso_Jackson @BenStinar Because Los Angeles has five times as many people as San Diego and the Lakers could only sell 700k tickets each season.",
    "217": "Pro Standard Los Angeles Lakers Satin Jacket to Match the Air Jordan 6 “UNC”: https://t.co/nx7Xeq61AQ https://t.co/oBcY4q6pMT",
    "218": "Doc Rivers has agreed to become the next coach of the Los Angeles Lakers, pending physical, per Belvedere Sports",
    "219": "According to @JakeLFischer the Los Angeles @Lakers and Head Coach Frank Vogel are expected to part ways at the conclusion of this Season. https://t.co/fkHIEZu3kg",
    "220": "https://t.co/C9RyJpdbwV🏀TOP TIPS OF THE DAY🏀\n( 06 April🌱)\n\n🇺🇸 NBA\n💥Phoenix Suns vs Los Angeles Lakers:\nindividual total over (121.5) the Phoenixe👉 @ 1.90 https://t.co/wD5iooBjQz",
    "221": "The Los Angeles Lakers are expected to part ways with head coach Frank Vogel after the season. Per @JakeLFischer",
    "222": "April 5, 1984: Los Angeles #Lakers C Kareem Abdul-Jabbar became the NBA’s all-time leader in points as he used his patented sky hook to pass former Laker great Wilt Chamberlain (31,419). Formerly known as Lew Alcindor, he still remains the leading scorer with 38,387 PTS https://t.co/hrbPPozUxA",
    "223": "25% off💥\n\nLos Angeles Lakers x Nike Jersey 'Lebron'\n\n$97.50 + Free Shipping\n\nhttps://t.co/POfss1lauk\n\n*use code SPRING25 at checkout* https://t.co/ZD0IRjhqJo",
    "224": "@jemelehill I'm the point guard for the Los Angeles Lakers???",
    "225": "Los Angeles Lakers vs. Phoenix Suns picks, predictions, odds: Who wins NBA game Tuesday? https://t.co/BwuTIoOqDj",
    "226": "@rahul_stuff @GuruLakers I became a Lakers fan because of Kobe Bryant plus I became because in Los Angeles lives a so very special people who are some members of my family plus Los Angeles there's a lot of Latinos and I live in Latin America soooo........that's the thing!",
    "227": "Ad: 25% off LeBron James Los Angeles Lakers City Edition Jersey at $97.50 + FREE shipping, use code SPRING25 =&gt; https://t.co/f7EzFZukM2 https://t.co/OC9IdfD3r6",
    "228": "Would the Lakers be title contenders with DeMar DeRozan? #DeMarDeRozan #LosAngelesLakers https://t.co/4d9CdpwOI3",
    "229": "“Kareem Abdul-Jabbar on the receiving end of a poster from Jellybean Bryant”: Rare footage of the Lakers legend getting posterized by Kobe Bryant’s father goes viral https://t.co/3GzkIUAx4o #DetroitPistons #LosAngelesLakers",
    "230": "Kendrick Nunn Has Been Out With A “Knee Bruise” For The Entire Season. This Man Is A Thief Who Stole Money From The Los Angeles Lakers😂. On A Serious Note, With Kemba Being The Backup His Services Are No Longer Required. Just Get You A Career Third String PG And Call It A Day. https://t.co/xcVaLiybko",
    "231": "carmelo anthony to los angeles lakers espn first take  https://t.co/719KRS69R5",
    "232": "I am the owner of the Los Angeles Lakers. https://t.co/4i9EDxNcZx",
    "233": "“Michael Jordan is here, LeBron James is reaching up there” Magic Johnson suggests no-harm-done to LeBron James’ legacy after disastrous 2021-22 season https://t.co/4LYhkt1gLA #LALakers #LosAngelesLakers",
    "234": "@Kevin84881072 The Los Angeles Lakers and LeBron James. It’s an easy sell. And he finally won his second title. What more is left to do at KU especially if the 🔨 is coming?",
    "235": "Report: Lakers still expected to cut ties with Frank Vogel after a downing season #FrankVogel #LosAngelesLakers https://t.co/oDvh3TguB1",
    "236": "NBA Basketball Game Betting Picks Simulator: 10:30 PM ET - Los Angeles Lakers vs. Phoenix Suns - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/zFEXF3Jkwk #nba #sportsbetting #freepicks #cappertek",
    "237": "Quin Snyder to the Los Angeles Lakers... #Mizzou #Miz #LakeShow #LA #NBA https://t.co/ClesyLCRJB",
    "238": "The Los Angeles Lakers won three straight NBA Championships in the early 2000s. Jeff Hamilton’s Lakers 3-Peat Leather Jacket honors the team’s accomplishment in bold, luxurious fashion.\n\nhttps://t.co/EuU098l1IO https://t.co/OXI13v4Z4B",
    "239": "Los Angeles Lakers expected to fire Frank Vogel.",
    "240": "The Los Angeles #Lakers are expected to part ways with HC Frank Vogel after this season. Reportedly Utah #Jazz HC Quinn Snyder and Philadelphia #76ers HC Doc Rivers are potential replacements for Vogel. #NBA https://t.co/PYYPh2nslB",
    "241": "Doc Rivers – a potential candidate for the Lakers #DocRivers #LosAngelesLakers https://t.co/upRdifaFlD",
    "242": "MY PHOENIX SUNS have the incredible opportunity to mathematically eliminate the Los Angeles Lakers from any postseason play today, so this is essentially a religious holiday for me",
    "243": "@BleacherReport @JakeLFischer Los Angeles Lakers eyeing Utah Jazz head coach Quin Snyder as possible Frank Vogel replacement.",
    "244": "Sources said that LeBron James and Los Angeles Lakers are closing a deal that will make LeBron James the first person to: Coach, Play and serve as GM. https://t.co/xboIAfC7t4",
    "245": "Los Angeles #Lakers: The greatest fans.\n\n##LakeShow x @goatfuel... \n \nhttps://t.co/d635tVFqT1\n \n#Basketball #California #LakersOfficial #LosAngeles #LosAngelesLakers #NationalBasketballAssociation #NBA #NBAWesternConference #NBAWesternConferencePacificDivision https://t.co/uKOb0n1k7R",
    "246": "The Los Angeles Lakers  https://t.co/C044IZSkz7 https://t.co/uGtbVVQoBA",
    "247": "Los Angeles #Lakers: The one and only @flea333... \n \nhttps://t.co/sisYWed3gJ\n \n#Basketball #California #LakersScene #LosAngeles #LosAngelesLakers #NationalBasketballAssociation #NBA #NBAWesternConference #NBAWesternConferencePacificDivision https://t.co/RGkMGZMLo9",
    "248": "Congratulations to woollytrunkdunk13 who moved up 9 spots to take #18 on the Los Angeles Lakers team leaderboard.\n\nhttps://t.co/7jbi1baNWE",
    "249": "The next coach of the Los Angeles Lakers: https://t.co/gELb62udsg",
    "250": "I'm just going to put this out there, the Los Angeles Lakers have failed to reach the postseason 2 out of the 4 seasons since LeBron James joined the franchise",
    "251": "Los Angeles Lakers vs. Phoenix Suns picks, predictions, odds: Who wins NBA game Tuesday? https://t.co/2fzzD2rwRa",
    "252": "Kurt Rambis future Los Angeles Lakers Head Coach - AGAIN 😭 #BurnItDown #SellTheTeam @JeanieBuss https://t.co/QO347INJDd",
    "253": "Today's NBA Picks: 10:30 PM ET - Los Angeles Lakers vs. Phoenix Suns - 1 PICK AVAILABLE: https://t.co/e1xpGs0nnY #nba",
    "254": "Los Angeles Lakers vs  Phoenix Suns Prediction 4/5/22 -  Free NBA Picks https://t.co/zbNMSDTQ5r via @YouTube",
    "255": "Analyzing Tuesday’s Los Angeles Lakers at Phoenix Suns odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/7FAscy7Lmb",
    "256": "Los Angeles Lakers at Phoenix Suns odds, picks and predictions https://t.co/lUdZeTSpZa",
    "257": "@RexChapman New Owner of the Los Angeles Lakers and the Forum",
    "258": "The Los Angeles Lakers' quest to reach the play-ins has been put in serious doubt by a sixth consecutive defeat in going down to the Denver Nuggets. #doingsbet https://t.co/w9tcIwmUEj",
    "259": "Lakers vs. Suns Tuesday NBA injury report, spread, odds: LeBron James, Anthony Davis questionable as Los Angeles could be eliminated from playoff race https://t.co/e2dvyWteWB via @SportsLine #NBA #NBATwitter #Lakers #ValleyProud",
    "260": "Is It Time For A Rebuild In LA? The Los Angeles Lakers Are Not Exceeding Season Expectations. Who does the blame goes on? LeBron, Vogel, Buss? Read article now to!\n#LakeShow https://t.co/C0GWtdytqT",
    "261": "Is It Time For A Rebuild In LA? The Los Angeles Lakers Are Not Exceeding Season Expectations. Who does the blame goes on? LeBron, Vogel, Buss? Read article now to!\n#LakeShow https://t.co/7CfmB4R431",
    "262": "@russwest44 i’m a be honest and no disrespect but it wasn’t meant to be for you to be in Los Angeles Lakers. Good luck with the rest of your NBA career",
    "263": "Tonight's NBA action: \n\nMilwaukee Bucks @ Chicago Bulls tonight at 8pm ET on ESPN. \n\nLos Angeles Lakers @ Phoenix Suns tonight at 10:30pm ET on NBA TV. https://t.co/NG5bdMNa3M",
    "264": "Kobe Bryant Rookie PSA 5 Skybox PREMIUM Collector Card Los Angeles Laker RC 1996 - https://t.co/hWMSDJld1Z\n\n#lebron #lebronjames #lakers #nba \nhttps://t.co/kBGwVPQiB2",
    "265": "The Los Angeles Lakers NEEDS to win all their remaining games to keep their Play-in chances alive. \n\nAnd that needs to begin with a mission so impossible: beat the 62 win Suns. \n\nSeason is already behind me, so I couldn't care less about the result.",
    "266": "today 1984: Kareem Abdul-Jabbar of the Los Angeles Lakers becomes the NBA's all-time scoring leader when he reaches 31,432 points, passing Wilt Chamberlain. Abdul-Jabbar retired after the 1988-89 season following a 20-year career that netted 38,387 points.",
    "267": "ALERT: New high roller bet posted!\nA bet has been placed for $10,530.01 on Phoenix Suns - Los Angeles Lakers to win $19,585.82.\nTo view this bet or copy it https://t.co/E6OOj2EoX5 https://t.co/6E6gbHrAjO",
    "268": "Phoenix Suns - Los Angeles Lakers\n\nBet slip link: https://t.co/VuoUNI6sY5 https://t.co/m7wIvnA5bS",
    "269": "GAMEDAY. (me cago en todo)\n\n🏀 LOS ANGELES LAKERS 🆚 Phoenix Suns.\n\n🏟️: Footprint Center.\n\n⏱️ 23:30 (🇦🇷/🇧🇷/🇺🇾)\n⏱️ 22:30 (🇨🇱/🇵🇾/🇧🇴/🇻🇪/ 🇩🇴/🇵🇷)\n⏱️ 21:30 (🇨🇴/🇵🇪/🇪🇨/🇵🇦/🇨🇺)\n⏱️ 20:30 (🇲🇽)\n⏱️ 04:30  (🇪🇸)\n\n📺: Star+.\n💻/📱 NBA League Pass. https://t.co/mC7DPgpUQi",
    "270": "1984 - #KareemAbdulJabbar (#LosAngelesLakers) became the all-time #NBA regular season scoring leader when he broke #WiltChamberlain's record of 31,419 career points. https://t.co/1rjpxl5FDe",
    "271": "Men's Nike Los Angeles Lakers Lebron James Jersey Shirt Large L - https://t.co/fuJx76Dtt3\n\n#lebron #lebronjames #lakers #nba \nhttps://t.co/cLg5pjjfTx",
    "272": "I want to personally thank LeBron James and the Los Angeles Lakers for dethroning the 2018-19 Boston Celtics as the most disappointing NBA team of all time. Thank You LeBron James https://t.co/6DdluymgQp",
    "273": "Has Lebron James Quit On The Los Angeles Lakers https://t.co/192DPddeje",
    "274": "@brofromanother Owner of the Los Angeles Lakers. #WinningTime",
    "275": "On this day in sports history April 5, the Houston Rockets defeated the defending champion Los Angeles Lakers 2-1 to advance to the 2nd Round of the NBA Playoffs in 1981.",
    "276": "On this day in sports history April 5, the Los Angeles Lakers defeated the San Francisco Warriors 4-2 to advance to the Western Division Finals for the 2nd consecutive year in 1969.",
    "277": "On this day in sports history April 5, Los Angeles Lakers Point Guard Jerry West recorded 52 Points, 5 Rebounds, and 9 Assists in a 118-115 win against the Baltimore Bullets in Game 2 of the Western Division Finals in 1965.",
    "278": "“Even if LeBron &amp; AD were healthy all year they didn’t have the pieces” Nick Wright disregards all claims of LA Lakers being Championship favorites ever in 2021-22 season https://t.co/dF3peyQcZF #LALakers #LosAngelesLakers",
    "279": "“Miss you legend” NBA Twitter gets emotional after HBO’s winning time pays tribute to Kobe Bryant https://t.co/NWQNftsoyo #LosAngelesLakers #NBA",
    "280": "LeBron who? 🏀\n\nI think we have found the newest member for the Los Angeles Lakers. 👀\n\nWho would want him on their team?\n\n📷: brookexotic https://t.co/721KR8QWy4",
    "281": "Spurs: How The #Lakers Season Became A Failure - Los Angeles Sports Nation https://t.co/F6XTLARq6P",
    "282": "✈️ Los Angeles (LAX) to Geneva (GVA) for only $470 (USD) roundtrip 💸\n182 live dates on Adventure Machine. - get the app on iOS or Android #LosAngeles  #LosAngelesCL  #losangelescleanup  #LosAngelesLakers https://t.co/TaPOyNSlMz",
    "283": "@AkilahObviously I'm the head coach of the Los Angeles Lakers. I may or may not be in a coma.",
    "284": "@Jay_Stallings Calipari is going to the Los Angeles Lakers",
    "285": "Manchester City FC - Atletico Madrid\nTiafoe, Frances - Giron, Marcos\nPhoenix Suns - Los Angeles Lakers\n\nBet slip link: https://t.co/g6O1iCfBgA https://t.co/N0Xak8MfcB",
    "286": "@Anitta Los Angeles Lakers",
    "287": "NBA Basketball Game Betting Picks Simulator: 10:30 PM ET - Los Angeles Lakers vs. Phoenix Suns - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/zFEXF3Jkwk #nba #sportsbetting #freepicks #cappertek",
    "288": "【Los Angeles Lakers】31-47\n\nOFF RTG…109.7（23位）\nDEF RTG…112.8（23位）\nNET RTG…-3.1（23位）\n\nPTS…LeBron James（30.3）\nREB…Anthony Davis（9.8）\nAST…Russell Westbrook（7.1）\nSTL…LeBron James（1.3）\nBLK…Anthony Davis（2.3）\nMIN…LeBron James（37.2）\n\n#LakeShow https://t.co/8Lx0tugP8U",
    "289": "“The Rise of the Lakers Dynasty, a campy, mean-spirited fiction about the Showtime-era Los Angeles Lakers.” (The Hollywood Reporter)\n\nThat’s a hell of a take 😂",
    "290": "✈️ Los Angeles (LAX) to Milan (MXP) for only $482 (USD) roundtrip 💸\n1030 live dates on Adventure Machine. - get the app on iOS or Android #LosAngeles  #LosAngelesCL  #losangelescleanup  #LosAngelesLakers https://t.co/xqk3PbVF2S",
    "291": "Los Angeles Lakers unlimited love red hot chili peppers shirt https://t.co/NEnkOzNENk",
    "292": "Los Angeles Lakers legend and former president of basketball operations Magic Johnson revealed that DeMar DeRozan wanted to join the Lakers.\n#FastBreak\n#HoopSnoop\nhttps://t.co/KKIYqOm1xZ",
    "293": "@betnomi1 @NBA I think Los Angeles Lakers win\n\nXype7",
    "294": "Magic Johnson: LeBron has to take blame for DeMar DeRozan going to the Bulls instead of the Lakers #DeMarDeRozan #LosAngelesLakers https://t.co/iqIQx1rPh2",
    "295": "🏀Los Angeles Lakers Locker Room is sold for 🔺 1.5 #AVAX  \n\nhttps://t.co/EVEIToVEeT\n\n#AVAX #Avalanche #NFT #NFTGiveaways #Kalao #nftart #NFTGiveaway #NFTs #NFTGame #Metaverse https://t.co/QyA2GoXqfO",
    "296": "The Los Angeles Lakers remain in desperation mode as they inch closer to being eliminated from play-in berth consideration. #NBA | @Reuters https://t.co/9hmFTA2VOr",
    "297": "Dejounte Murray Suffering From Mysterious Illness: Los Angeles Lakers Look To Capitalize In Final Push For 10 Seed – https://t.co/Zp03ACmkmM",
    "298": "Dejounte Murray Suffering From Mysterious Illness: Los Angeles Lakers Look To Capitalize In Final Push For 10 Seed – Lakers News https://t.co/9Y2peXKYjL",
    "299": "Dejounte Murray Suffering From Mysterious Illness: Los Angeles Lakers Look To Capitalize In Final Push For 10 Seed – NBA News https://t.co/zLPJNLGg6a",
    "300": "Los Angeles Lakers beaten by Nuggets in sixth consecutive defeat https://t.co/PV9XNMpHnn",
    "301": "@kasie Owner of the Los Angeles Lakers. 🤪",
    "302": "Los Angeles Lakers Kobe Bryant jersey lapel pin-SHOWTIME Legend-Collectible - https://t.co/o9FSumyWqG\n\n#lebron #lebronjames #lakers #nba \nhttps://t.co/bfl1UFYCdM",
    "303": "We will always have next season - I love growing old with you #lalakers #lakers #losangeleslakers @Lakers",
    "304": "The @Lakers star Anthony Davis responds to critics saying \"they aren't little ticky-tack injuries.\"\n\nStory: @latimes \nTweet: @EthanJon3 \n\nhttps://t.co/eSIf2mwSa1",
    "305": "there needs to be a four way trade between the Hornets, Blazers, Warriors, and Lakers that sends Steph Curry to Charlotte, Damian Lillard to the Bay, and Klay to Los Angeles",
    "306": "1996 FLEER #203 KOBE BRYANT ROOKIE CARD RC LOS ANGELES LAKERS - https://t.co/4MN2PDS3US\n\n#lebron #lebronjames #lakers #nba \nhttps://t.co/ofo9Lls7I8",
    "307": "@HoCoHowie Owner of the Los Angeles Lakers https://t.co/WwTltXHefK",
    "308": "Owner of the Los Angeles Lakers. https://t.co/Zl0S4QXomD",
    "309": "@brofromanother I’m the starting forward for the Los Angeles Lakers circa 1979. https://t.co/qhg6PXp6CP",
    "310": "@TheParraEels Breaking News: Bryce Cartwright to the Los Angeles Lakers in 2025 🏀",
    "311": "GOT7 member and Golden State Warriors Global Ambassador @BamBam1A will perform at halftime of the final regular-season home game against the Los Angeles Lakers at Chase Center on Thursday, April 7. \n\n#BamBamxGSW https://t.co/3Vbssy7gGo",
    "312": "Please congratulate me, I either own the Los Angeles Lakers or I am their point guard!! #WinningTime https://t.co/mgi0moJfGx",
    "313": "Caleb Love undrafted rookie from the Los Angeles Lakers has a nice ring to it lol",
    "314": "Phoenix Suns can eliminate the Los Angeles Lakers from playoff contention with a historic 63rd win I break it all down and give you guys my thoughts. New video on Suns Geek https://t.co/mi6lykliQn #Suns #ValleyProud #Lakers #NBA",
    "315": "The NBA is burning: the San Antonio Spurs leave the Los Angeles Lakers with very few 'play-in' options https://t.co/8MSw6o6nQ6",
    "316": "@NotTheeWillHill The Lakers of Los Angeles",
    "317": "DeJounte Murray (Spurs) is out. If lakers go 3-1 and spurs go 0-4 or if lakers go 4-0 and spurs 1-3, the lakers will make the play-in. • #LosAngelesLakers #LAL #Lakers #SanAntonioSpurs #SAS #Spurs",
    "318": "\"Wait a minute. I know you. You're Kareem Abdul-Jabbar. You play basketball for the Los Angeles Lakers.\"\n\n\"I'm sorry, son, but you must have me confused with someone else. My name is Roger Murdock. I'm the co-pilot.\" https://t.co/uiwGmpcLF6",
    "319": "@CaseyExplosion I seem to be the new owner of the Los Angeles Lakers.",
    "320": "Lebron James 23 Los Angeles Lakers Art Simple Premium Poster https://t.co/1PWsS2jPnT",
    "321": "@BB_Votaciones @BTS_twt Los  Angeles Lakers\n#KCA #VoteBTSAsia",
    "322": "Nikola Jokic scored 38 points Sunday as the Denver Nuggets sent the Los Angeles Lakers spinning to a sixth straight defeat and closer to elimination from NBA postseason contention.\nRead more here: https://t.co/uyWyVQvjJY https://t.co/iY6f125F9V",
    "323": "@richeisen @Lakers District Attorney of Los Angeles",
    "324": "@brofromanother I’m the owner of the Los Angeles Lakers in 1979, apparently.",
    "325": "Owning the Los Angeles @Lakers https://t.co/THOavsCXQA"
}