{
    "0": "We at the @spurs game \nGO @DetroitPistons https://t.co/HVPJyERwKy",
    "1": "@Lionsbadboy @DetroitPistons @Kia Diallo disrespect will not be tolerated https://t.co/X4DfGrULfD",
    "2": "COVID-19 Protocol really got the Detroit Pistons roster out here looking like… https://t.co/wSE3wwHKNS",
    "3": "Make the call now @DetroitPistons!\n\n#Pistons #DetroitBasketball https://t.co/aH2q9XQPgN",
    "4": "@mrprodesign @CadeCunningham_ @DetroitPistons Bro this is cold",
    "5": "@DetroitPistons @Kia Only Jackson, Bey, Luka I recognize this is ridiculous covid has crippled us.",
    "6": "@JayScottSmith @DetroitPistons Still trying to figure out why we didn’t get to play the G Leaguified version of the Bulls a couple weeks ago",
    "7": "Hey there PtRers! This is @juanmarcosv and I'll be with you in this x-masy game between the @spurs and @DetroitPistons. #PorVida",
    "8": "Pistons @DetroitPistons https://t.co/IVA2giKEYn",
    "9": "@DetroitPistons @Kia Oh my",
    "10": "Detroit Pistons vs San Antonio Spurs | NBA live stream\nClick Live Here ➡ https://t.co/nW9tQblC3X",
    "11": "Detroit Pistons Starters:\n\nDerrick Walton\nFrank Jackson\nHamidou Diallo\nSaddiq Bey\nLuka Garza\n\nPlayers out:\nCade Cunningham\nJerami Grant\nKillian Hayes\nJosh Jackson\nCory Joseph\nSaben Lee\nTrey Lyles\nRodney McGruder\nKelly Olynyk\nIsaiah Stewart\n#Pistons #",
    "12": "@DetroitPistons @Kia Walton jr with the start! #GoBlue",
    "13": "The Detroit pistons like 5-6 years ago thought they could play Andre Drummond, Greg Monroe and Josh Smith all at the same time and it would be good. Life comes at you fast",
    "14": "@FroDyl2 @DetroitPistons @Kia It might not be as bad as Toronto’s tho 💀 https://t.co/RsRRbkszcs",
    "15": "@DetroitPistons @Kia REGGIE BULLOCK IS BACK!!!!!!!!",
    "16": "@DetroitPistons @Kia These g league mother fuckers",
    "17": "@FroDyl2 @DetroitPistons @Kia Yeah I saw 💀💀💀",
    "18": "@DetroitPistons @Kia this is a joke",
    "19": "@MotorCityCruise @DetroitPistons I’m sorry… I must. Lol.\n\nBut in all seriousness, welcome to the team! Hope it turns out like Porzingis!\n\nhttps://t.co/2erJW6fTng",
    "20": "@DetroitPistons @MichelobULTRA Win and I won't kill these puppy's I stole",
    "21": "@DetroitPistons @Kia @matthewelkins1 looks at this😂",
    "22": "@DetroitPistons @Kia Yes sir",
    "23": "Some new faces in the @Kia Starting 5️⃣ 👀 https://t.co/CNlW4tFtTy",
    "24": "Basically, everyone not named Saddiq Bey is out.\nI bet Detroit to cover. #Pistons https://t.co/7CIRWwKn8i",
    "25": "COVID having its way with the @DetroitPistons https://t.co/NwuMV4zr8M",
    "26": "On the real @russwest44 would be perfect fit in @DetroitPistons or @OrlandoMagic",
    "27": "@mrprodesign @CadeCunningham_ @DetroitPistons Can we get this on a shirt? Absolute fire.",
    "28": "In enemy territory, but here in San Antonio to root on our @DetroitPistons or the @MotorCityCruise or whatever we are calling ourselves tonight. https://t.co/D5oBgF51Mp",
    "29": "Who’s in? Who’s out? Pistons LIVE has the latest on the @DetroitPistons injury/covid front. https://t.co/v6PJ3mchW3",
    "30": "@mrprodesign @CadeCunningham_ @DetroitPistons Sounds good to me, we’ll be winning the championship by then😎",
    "31": "@thirty3deejays @CadeCunningham_ @DetroitPistons I'll get back to u in 2023 then lol",
    "32": "It’s time for Basketball: San Antonio Spurs vs Detroit Pistons https://t.co/LKcODOoEL7",
    "33": "@mrprodesign @CadeCunningham_ @DetroitPistons Okay but now I’m gonna need an entire deck",
    "34": "@DetroitPistons @HenryFordNews Where Eric Moreland when you need him",
    "35": "Treated myself with a Christmas present tonight - with my buddy Rick- SuperBoxSuite tickets\n\n@spurs vs @DetroitPistons \n\n#GoSpursGo\n\n#LetsGoBrandon (opps see below)\n\n#NoPoliticsPopJustCoach 😅😉🚨🏀 https://t.co/svdmVKhtM6",
    "36": "@ShamsCharania @TheAthletic @Stadium DETROIT PISTONS LEGEND I STILL HAVE HIS JERSEY",
    "37": "@RyanTouchdown @DetroitPistons @HenryFordNews So you’re saying take the spurs with the points?",
    "38": "@DetroitPistons @HenryFordNews Pistons should lose this game by 40 points",
    "39": "@MotorCityCruise @DetroitPistons Pistons keep getting worse &amp; worse.. #TankSzn",
    "40": "Fitting in nicely in San Antonio. 👍\n\n#ULTRADrip | @MichelobUltra",
    "41": "@DetroitPistons @HenryFordNews At least Luka Garza will get a ton of minutes tonight. man I've never seen anything like this. relating to covid this virus has decimated us.",
    "42": "Going to take my son for his first NBA game tonight @DetroitPistons play the Spurs tonight. Unfortunately COVID decided to snag half the damn team. Memories created anyway.",
    "43": "Detroit Pistons release ugliest Injury Report in franchise history #Pistons https://t.co/6627wqTXn5",
    "44": "@DetroitPistons @HenryFordNews Saddiq Bey be like https://t.co/9qUEEJ9ZSH",
    "45": "@DetroitPistons @HenryFordNews They cancel the game vs the bulls but allow this to be played? Happy to get more ping pong balls but clearly not in the spirit of competition",
    "46": "@9thNotchBoyz @DetroitPistons @HenryFordNews G league squad essentially lol",
    "47": "@DetroitPistons @HenryFordNews The Motor City Cruise getting their time to shine",
    "48": "@DetroitPistons @HenryFordNews waddup @jabarismithll",
    "49": "@DetroitPistons @HenryFordNews It’s going to be our actual Gleague team playing 😭",
    "50": "@DetroitPistons @HenryFordNews Bruh moment",
    "51": "@DetroitPistons @HenryFordNews So who tf is playing",
    "52": "@DetroitPistons @HenryFordNews Bro help please",
    "53": "@DetroitPistons @HenryFordNews Sick",
    "54": "Tonight's @HenryFordNews injury/status report against the San Antonio Spurs ⤵️ https://t.co/HsVNU3Buc9",
    "55": "@DetroitPistons fans rn: https://t.co/bYQeAnfKcw https://t.co/vCmoCF3Z2N",
    "56": "Spurs star point guard Dejounte Murray is out due to the NBA's health and safety protocols, the team announced before a Sunday evening game against the Detroit Pistons. https://t.co/cEu7YsN846",
    "57": "You not gonna give any calls to the Rookie averaging 18 ppg because he is \"a rookie\"? Bet. 80s Detroit Pistons style the rest of the way. Someone is getting suplexed if they come in the lane.",
    "58": "Kalamian on Walton: \"Here's a kid who grew up in Detroit, probably thought about starting for the Pistons millions of times. And here he is tonight, his third or fourth NBA start, and it's for his hometown team. I couldn't be happier for him. I know he's prepared for the moment.\"",
    "59": "The 2019 draft pick is back with the @DetroitPistons.  https://t.co/q2sHc8P8W6",
    "60": "Pistons now say Isaiah Livers (conditioning) is OUT tonight. This leaves Detroit with 9 active players:\nSaddiq Bey\nFrank Jackson\nLuka Garza\nHamidou Diallo\nJamorko Pickett\nCheick Diallo\nDerrick Walton Jr.\nCassius Stanley\nDevidas Sirvydis",
    "61": "the Detroit Pistons relationship with Dave is so toxic https://t.co/fsIcoqUsDr",
    "62": "The main difference between this and Detroit the other night is that the Pistons made half their threes for 3.5 quarters and the Magic are 5-of-24 from deep.",
    "63": "The Detroit Pistons, leading employer of former Pistons",
    "64": "Detroit Pistons sign Motor City Cruise forward Deividas Sirvydis to 10-day deal https://t.co/b6eLIaWInt",
    "65": "The Detroit Pistons are dealing with a COVID outbreak, knocking out a big portion of their active roster for Sunday’s game vs. San Antonio and potentially beyond. https://t.co/UPeSO4CpgS",
    "66": "@DetroitPistons Could I get a free Sirvydis jersey? It is the season of giving and given almost 24 years of support to this beautiful franchise!",
    "67": "@DetroitPistons BBALL FEDEROV CONFIRMED 🐴🏀🔥",
    "68": "How to Watch Detroit Pistons vs. San Antonio Spurs: NBA Live Stream, TV Channel, Start Time https://t.co/eb7rtx4gJp",
    "69": "Detroit Pistons sign Deividas Sirvydis to hardship deal https://t.co/2LhQom0gw0",
    "70": "Why is it that EVERYTIME I try to buy @DetroitPistons tickets on @Ticketmaster I get a different error code 🤬🤬",
    "71": "Deividas Sirvydis will wear No. 91 for the #Pistons. https://t.co/knAUEQi4c0",
    "72": "Consensus Line Move:\n2021-12-26 Detroit Pistons at San Antonio Spurs from 220.00 to 221.50\nOver invested\n#NBA #sports #coding #rich",
    "73": "@CL_Green34 @SheaSerrano Or Aguirre who won a ring with the Detroit Pistons",
    "74": "ALERT: New high roller bet posted!\nA bet has been placed for $5,325.69 on San Antonio Spurs - Detroit Pistons to win $10,690.71.\nTo view this bet or copy it https://t.co/3iGzjJzXAW https://t.co/bUGuzhXr1H",
    "75": "The Detroit Pistons are signing G-League forward Deividas Sirvydis to a 10-day hardship deal, source tells ESPN.",
    "76": "@Pistons_PR @DetroitPistons He’s inevitable",
    "77": "@MenaTrey @SaddiqBey @hamidoudiallo @DetroitPistons ayyyy proud of you!",
    "78": "Call-up number 4️⃣! \n\nCongratulations to Deividas Sirvydis on signing a 10-day contract with the @DetroitPistons! 📝 https://t.co/7vdJjxly3r",
    "79": "The #Pistons return to the hardwood tonight in San Antonio. \n\nCoverage starts at 6:30 p.m. on Bally Sports Detroit. https://t.co/nEa8wCe8yk",
    "80": "Detroit Pistons sign Deividas Sirvydis to hardship deal #Pistons https://t.co/Wth6KGcC0T",
    "81": "Today's NBA Picks: 7:10 PM ET - Detroit Pistons vs. San Antonio Spurs - 19 PICKS AVAILABLE: https://t.co/nV0Ap4rV76 #nba",
    "82": "Hey @JonasJerebko, you still have a pad in Detroit you can crash at for 10 days at the very least? 🤔\n\n#Pistons #DetroitBasketball",
    "83": "The Detroit Pistons are signing G-League forward Deividas Sirvydis to a 10-day hardship deal, source tells ESPN.",
    "84": "Miami Heat - Orlando Magic\nKansas City Chiefs - Pittsburgh Steelers\nSan Antonio Spurs - Detroit Pistons\nDallas Cowboys - Washington Football Team\n\nBet slip link: https://t.co/8IiuzPV6zE https://t.co/7lvD8anwOs",
    "85": "The Detroit Pistons sign Deividas Sirvydis to a 10-day contract, per sources.",
    "86": "The Detroit Pistons are signing G-League forward Deividas Sirvydis to a 10-day hardship deal, source tells ESPN. He plays with Detroit's Motor City affiliate.",
    "87": "San Antonio Spurs: San Antonio #Spurs vs Detroit Pistons Prediction: Surging #Spurs Feast - Oddschecker https://t.co/KOGeNrTWSL",
    "88": "Spurs: Pistons add Josh Jackson, Cory Joseph to health and safety protocols - Detroit News https://t.co/VGMuWJ5Iii",
    "89": "@BobbyDSixers @DetroitPistons @JFclothingco Omg shut up",
    "90": "TIP: San Antonio Spurs - Detroit Pistons, ck 2-1, 4.60 by #tipster sxomili95 (profit this month: +101.40)\n  #betting #Basketball #San #Antonio #Spurs #Detroit #Pistons",
    "91": "Get owned Detroit, Big Sean, Eminem, motown, PISTONS, RED WINGS, Tigers, Smokey Robinson,  Tom Selleck, the fab 5, it's ATL HOE",
    "92": "Detroit Pistons, NBA (in-season) champions! Would you care? – NBA News https://t.co/zWx132XzTV",
    "93": "@DetroitPistons @JFclothingco Love this one.  Yes, ordered 👍🏻",
    "94": "@aaronjbarnes Fam I remember when lakers played pistons the entire grade ganged up on me. They made Detroit pistons stickers to wear around school. Actually ima call out the ppl who did it cus I love them to this day. @McKinnsters and @dr_lofo haha",
    "95": "🚨 Item of the Game 🚨\n\nCheck out this @JFclothingco #Pistons tie-dye long sleeve shirt!  \n\n🔗: https://t.co/ZayyAwiYqy https://t.co/Ogi0xivZ3O",
    "96": "Detroit Pistons, NBA (in-season) champions! Would you care? (via @Realstuartl)\n#NBA #Pistons https://t.co/rBzmwfXJS0",
    "97": "Thanks to COVID-19, the last five days have been tough on the @DetroitPistons. https://t.co/H70wM3WtPM",
    "98": "@DisneyAlexMax @_Puzzlepiecedad @nbatopshot Happy Holidays fellow @DetroitPistons fans!  #Pistons #NBATopShotThis  #NBATopShot",
    "99": "@AlexWilsonESM They’re the worst team in sports right now. I’d take the Detroit Pistons over them.",
    "100": "The Creator Of NBA JAM Has Admitted He Put A Code In The Game That Didn't Allow The Chicago Bulls To EVER Make A Game-Winning Shot Against Detroit Pistons | Barstool Sports https://t.co/SNhBXO10SA",
    "101": "Today's NBA Picks: 7:10 PM ET - Detroit Pistons vs. San Antonio Spurs - 18 PICKS AVAILABLE: https://t.co/nV0Ap4rV76 #nba",
    "102": "If you got new #Pistons merch as presents this weekend, let's see it!\n\nShare a pic for our @UWMLife Reppin' the D fan shoutout → https://t.co/js4XQ9JbRs https://t.co/E16QYJ11mv",
    "103": "🏀 Detroit (107.6) @ San Antonio (109.4)\n\nDejounte Murray was just announced out as he's entering H&amp;S protocols so it might be safe to expect more Spurs to miss time. I like DET in this game regardless.\n\n💰 Value: Spurs team total u115, Pistons team total o105 &amp; Pistons +10",
    "104": "@DetroitPistons make the call man https://t.co/WcP0PLkSzw",
    "105": "@mikea71 @DetroitPistons It's crazy man...lol.\n\nhttps://t.co/nFcg6gvg91",
    "106": "@EscobarFurious @DetroitPistons I mean our only point guard right now is Derrick Walton Jr.",
    "107": "It's time @DetroitPistons.\n\n#Pistons #DetroitBasketball https://t.co/sTpQqCDTy6",
    "108": "Detroit Pistons add two more players to health and safety protocols (this is not a repost) #Pistons https://t.co/VVZXRw3vTP",
    "109": "@DetroitPistons we are not good and we need some vets please go get @isaiahthomas",
    "110": "@StephenM_Brooks @Graham_Couch @NateAtkins_ They should also add: \"Detroit Pistons Draft History: The Illusion that Their 2nd Round Picks were Better than Their 1st Round Picks.\" AND \"Understanding Heisman Voting and Rarity of Yards After Contact.\"",
    "111": "@DetroitPistons I offer myself to play today",
    "112": "@TriolaBrendan @DetroitPistons I can accept that I guess. But im not sure 10 days of IT really does that. I’m a fan of his…I want to see him as a bench contributor for a contender",
    "113": "@MARKSTONESNIPES @TriolaBrendan @DetroitPistons use the 10 day on a young guy. That’s all im saying.",
    "114": "@DetroitPistons Let's sign him https://t.co/j1tIO9k6Sv",
    "115": "@PistonsColorado @TriolaBrendan @DetroitPistons it’s a 10 day contract i never said i thought he was gonna become a staple of our team",
    "116": "@PistonsColorado @DetroitPistons Eh the rest of our team now is young guys with little to no experience, I think they would all benefit from a couple weeks with a vet that at least score a bit",
    "117": "@MARKSTONESNIPES @TriolaBrendan @DetroitPistons lmao Isaiah Thomas isn’t the savior. Take a flyer on a young guy",
    "118": "Desperately @DetroitPistons https://t.co/BF6pU1iwLM",
    "119": "Detroit Pistons' Josh Jackson and Cory Joseph enter health and safety protocols https://t.co/kzJ1NpWWjP",
    "120": "@TriolaBrendan @DetroitPistons Yeah but wouldn’t you rather take a flyer on a young guy?",
    "121": "@DetroitPistons sign J.R. Smith to a 10 day. Why not.",
    "122": "@PistonsColorado @TriolaBrendan @DetroitPistons have you seen the state of our roster",
    "123": "@FantasyLabsNBA @DetroitPistons could use a warm body",
    "124": "@PistonsColorado @DetroitPistons Cuz our only healthy point guard on the roster is Derrick Walton",
    "125": ". @DetroitPistons it’s time https://t.co/rh5KzKwYL7",
    "126": "Detroit Pistons add two more players to COVID-19 list https://t.co/S94DKKo2wZ",
    "127": "Frank sets it up ⬆️ and Saben throws it down ⬇️ for the Dunk of the Week, presented by @DraftKings. https://t.co/p9sy2C7zq8",
    "128": "Consensus Line Move:\n2021-12-26 Detroit Pistons at San Antonio Spurs from 218.00 to 220.00\nOver this just in\n#NBA #bettingonline #dataanalytics #forextrader",
    "129": "Tough Spurs news. Dejounte Murray out in the Covid Protocol. Will miss tonight's game vs. Pistons. Plus a busy week for the Spurs with games against Utah, Miami, Memphis and another at Detroit.",
    "130": "Detroit Pistons add two more players to COVID-19 list\nhttps://t.co/xoQr4emHhM\n\nDownload Now\nhttps://t.co/yz7lyj0BOu",
    "131": "@BigSto Only in basketball for me, and that’s mainly because I’m from Detroit and a Pistons fan 😤 and, also during my time in Cali, have become a Warriors fan. Off the court, nothing but respect!",
    "132": "Today's #NBA Stats\n\nhttps://t.co/RqpGxFL4b1\n\n#sportsbetting #nbastats #nbatips #basketball #Draftkings #FanDuel #handicapping #DetroitPistons #SanAntonioSpurs #Spurs #Pistons https://t.co/r1pIUkpUfI",
    "133": "hell i believe in the detroit pistons and lions. https://t.co/mbYYk2zQe5",
    "134": "@TheWoodardHouse @DetroitPistons @DerrickWalton10 @cassius_stanley @cheick_diallo13 Absolutely, if you are cold you can add layers, if you are hot… you can only go down to shorts and a shirt",
    "135": "Factual: #MAC10 and Deveon Mitchell (super Detroit Pistons rookie) were born 9-5-1998. ##TheMoreYouKnow @DatGirlFriday @jade78052492 @SwissLionsFan @CaptPat48 @Adinafit1 @mdabateNFL",
    "136": "Celebrate 2022 in style with NO FEES on remaining home games, courtesy of @soldbymarkz Real Estate Experts. \n\n🔗: https://t.co/VCOr4wCYSr https://t.co/HCVpxQD8Ya",
    "137": "Consensus Line Move:\n2021-12-26 Detroit Pistons at San Antonio Spurs from 219.50 to 218.00\nUnder market flood\n#NBA #sportsbettingadvice #coding #investment",
    "138": "Consensus Line Move:\n2021-12-26 Detroit Pistons at San Antonio Spurs from -11.50 to -10.00\n#Pistons sharps say\n#NBA #vegas #data #investment",
    "139": "@DetroitPistons Give him a 10 day, we have nothing to lose https://t.co/oia9c3crWj",
    "140": "BREAKING - Dejounte Murray OUT for Health and Safety Protocols for today’s game vs Detroit Pistons. \n\nPregame at 5:30pm on @1200WOAI https://t.co/j4y17zmXdN",
    "141": "I’d think about other teams winning too if my team was the Detroit pistons https://t.co/AHTYxoNkVm",
    "142": "I’m tellin ya,\nHe was a menace during the last Detroit Pistons rebuild https://t.co/S4BlfQFKIM",
    "143": "@MzFightDiva40 Tim Duncan had 21 pts 20 Reb 10 ast 8 blks but he completely dominated the Detroit Pistons the offense completely ran through him and defensively he was elite nobody talks about that game enough but celebrate all these other silly triple doubles in regular season games Smh 🤦‍♂️",
    "144": "@4Chagnon Oh yeah, I totally agree with you on that one! The game I was going too was supposed to be in January but got postponed to March 3rd now. They’re playing Detroit Pistons when I go. We lost to them 127-121 when they played Nov 13, but I’m keeping my fingers crossed that we win! 🏀",
    "145": "Game Preview: San Antonio Spurs vs. Detroit Pistons\n https://t.co/rI6WqGQVlZ",
    "146": "Sunday free pick. Courtecy of the Uncle's Club.\nDetroit Pistons +11.5",
    "147": "@russwest44 is perfectly suited for teams like the @DetroitPistons @Pacers @OrlandoMagic he can get those teams to playoffs maybe sell tickets he's just not a championship player and that's ok the @Lakers need to realize that.",
    "148": "🔮 NBA ELO Win Probabilities for December 26\n@DetroitPistons 7.8% @spurs 92.2%\n@sixers 48.3% @washwizards 51.7%\n@Raptors 22.2% @cavs 77.8%\n@Pacers 23.0% @chicagobulls 77.0%\n https://t.co/Iuhw7iGVvA",
    "149": "To those #Pistons fans observing, we wish you a Happy Kwanzaa! https://t.co/ewzzKjqlUT",
    "150": "@DetroitPistons resign Stanley Johnson he’s the key to the future",
    "151": "wings have been winning all my life, pistons have 3 in my lifetime, tigers have like 4 or 5 total..... the ONLY CORRECT ANSWER IS THE FUCKING DETROIT LIONS, I need them to win one.... NEED https://t.co/iK0pik0QfQ",
    "152": "WE BACK!\n\n🆚 @DetroitPistons         \n⏰ 6pm CT\n📍 @attcenter \n📺 @BallySportsSA \n🎲 https://t.co/wUQ2GUwaRl \n📻 @1200WOAI, @kxtn1350 AM &amp; 107.5 FM HD 2 https://t.co/5alwKlVJvr #actnearn #sct",
    "153": "New listing! \n\nGrant Hill 1996-97 Topps NBA at 50 Anniversary Foil #199 Detroit Pistons \n\nCheck it out: https://t.co/Wcbj7tRndH\n\n#TradingCards #ForSale #eBay https://t.co/myqfYMDDtG",
    "154": "@spurs @DetroitPistons @attcenter @BallySportsSA @1200WOAI @kxtn1350 @HEB @DejounteMurray you know who else would be back? a spurs player on the #NBAAllStar game if you vote for #dejountemurray",
    "155": "@spurs @DetroitPistons @attcenter @BallySportsSA @1200WOAI @kxtn1350 @HEB @DejounteMurray MY FIRST GAME LETS GO WINNNNN",
    "156": "WE BACK!\n\n🆚 @DetroitPistons         \n⏰ 6pm CT\n📍 @attcenter \n📺 @BallySportsSA \n🎲 https://t.co/9tnP05yFRW \n📻 @1200WOAI, @kxtn1350 AM &amp; 107.5 FM HD 2 https://t.co/hGmQlgneSa",
    "157": "Vintage Detroit Pistons Starter Satin Bomber Jacket Size Small 80s 90s NBA https://t.co/gpSDxjVU0t eBay https://t.co/WUzZJr9Jf2",
    "158": "The hits just keep on coming for @DetroitPistons. Now the big man is in COVID-19 protocols. https://t.co/9hjd7hdh8w",
    "159": "Consensus Line Move:\n2021-12-26 Detroit Pistons at San Antonio Spurs from 220.50 to 219.50\nUnder did I do that?\n#NBA #sportspicks #developer #investor",
    "160": "Consensus Line Move:\n2021-12-26 Detroit Pistons at San Antonio Spurs from -10.50 to -11.50\n#PorVida snake in the weeds\n#NBA #vegas #data #bitcoins",
    "161": "“Steph Curry, you may have won the NBA Finals, but you and your team still have to face this team…”\n\n“Th- that’s the Detroit Pistons’ music!” https://t.co/gKlZWbUv4u",
    "162": "Spurs: San Antonio #Spurs vs Detroit Pistons 12/26/21 NBA Picks, Predictions, Odds - Sports Chat Place https://t.co/VGMuWJ5Iii",
    "163": "Spurs: San Antonio #Spurs vs Detroit Pistons 12/26/21 NBA Picks, Predictions, Odds - Sports Chat Place https://t.co/6OH035K8gq",
    "164": "San Antonio Spurs: Detroit Pistons game score vs. San Antonio #Spurs: Time, TV, radio https://t.co/KOGeNrTWSL",
    "165": "DasHaus made a bet!\n\nEvent: Detroit Pistons vs San Antonio Spurs #NBA\nBet: San Antonio Spurs TO WIN -10.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "166": "DasHaus made a bet!\n\nEvent: Detroit Pistons vs San Antonio Spurs #NBA\nBet: Detroit Pistons TO WIN +10.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "167": "🚨ITS GAMEDAY\n\nDetroit Pistons(5-26) vs\nSan Antonio Spurs(13-18)\n\nPistons only lost by 3 last game with a short handed team without our two superstars. Now with the call-ups from the g league and momentum, I won’t be surprised if we win tonight.\n\n#Pistons",
    "168": "Detroit Pistons vs. San Antonio Spurs - NBA (12/26/21) | Tip-Off, How to Watch https://t.co/q8Hhz9LrNV",
    "169": "@DetroitPistons @meijer @PistonsHooper Where are the gifts for us the true supporters life in Africa piston champions NBA 🏀🏀💙💙",
    "170": "Detroit Pistons vs. San Antonio Spurs - NBA (12/26/21) | Tip-Off, How to Watch https://t.co/yPxJZOTLZ8",
    "171": "Detroit Pistons vs. San Antonio Spurs - NBA (12/26/21) | Tip-Off, How to Watch https://t.co/XGCTkVnqfk",
    "172": "This 4-team trade helps everyone. Sixers land 2 good players (Dejounte Murray and Jerami Grant) and a pick, Ben Simmons finds a home. @sixers @suns @spurs @DetroitPistons #BenSimmons https://t.co/IKY1DXb6qa",
    "173": "Consensus Line Move:\n2021-12-26 Detroit Pistons at San Antonio Spurs from 217.00 to 220.50\nOver gonna eat\n#NBA #sports #ai #business",
    "174": "@amp_222 @BenSimmonsBurn @klmnopqqq @jamar1up @LakeShowYo His stans will never see that. All they see is when he manages to score 25 points some nights against teams like Detroit pistons and lakers win by 2 or 3 points after 3ple overtime 🤦‍♂️ I’m so ready for him to be traded if lakers get lucky to find a team that wants him",
    "175": "@tigers @DetroitRedWings @DetroitPistons Would be a great memory with my son. https://t.co/2urir9xpEC",
    "176": "@ColeOwenTurner1 Really speaks to the levels of the detroit pistons",
    "177": "See you soon, @spurs 👋 \n\n📺 @BallySportsDET \n📻 @WWJ950 \n💻 NBA League Pass | https://t.co/PV8hXiHMVQ\n🤝 @Shopify | Modestia Collection\n📍 @attcenter https://t.co/7VcJHspgEU",
    "178": "Here are the offensive plays that stood out to me in the Miami Heat vs Detroit Pistons game\n\n⬇️⬇️",
    "179": "Detroit Pistons sign Derrick Walton Jr. and Cassius Stanley to 10-day contracts\nhttps://t.co/j1UYNBiWky",
    "180": "Detroit Pistons sign Derrick Walton Jr. and Cassius Stanley to 10-day contracts https://t.co/pzaCGu7miY #Basketball",
    "181": "Derrick Walton Jr has signed a 10 day contract with the Pistons 〽️💪 \n#DetroitPistons \n#GoBlue",
    "182": "@tucan939 @alexcheche11 @iDude14 The Pistons aren't trading Grant while he is on this current contract. He chose to play in Detroit because he wanted to play for a black city and a black head coach and be a primary option on offense.",
    "183": "Spurs:  Detroit Pistons game score vs. San Antonio #Spurs: Time, TV, radio https://t.co/Qf0onNzhK9",
    "184": "Detroit Pistons @ San Antonio Spurs\nPick : San Antonio Spurs.\nBasketball. NBA\n\nNew Orleans Pelicans @ Oklahoma City Thunder\nPick : New Orleans Pelicans.\nBasketball. NBA\n\nIndiana Pacers @ Chicago Bulls\nPick : Indiana Pacers.\nBasketball. NBA",
    "185": "Consensus Line Move:\n2021-12-26 Detroit Pistons at San Antonio Spurs from 217.50 to 216.50\nUnder this just in\n#NBA #sport #python #stockmarket",
    "186": "The Detroit Pistons will take on the San Antonio Spurs on the road tonight at 7pm ET. https://t.co/7olmRvrm0A",
    "187": "NBA Basketball Game Betting Picks Simulator: 7:10 PM ET - Detroit Pistons vs. San Antonio Spurs - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/rdNJcQGjqW #nba #sportsbetting #freepicks #cappertek",
    "188": "Spurs: Detroit Pistons game score vs. San Antonio #Spurs: Time, TV, radio https://t.co/X5GGe072cQ",
    "189": "What Detroit Pistons must target at deadline, regardless of Jerami Grant's fate https://t.co/z6Cvsyqwh8",
    "190": "Detroit Pistons game score vs. San Antonio Spurs: Time, TV, radio and how to watch #YahooSports #NBA https://t.co/EVTI76PrcL",
    "191": "Former @DetroitPistons had a solid combined Christmas Day triple-double yesterday, with 48/19/17. Incl. Khris, Wayne, B. Knight, Blake, Bruce, Stanley. Anyone I missed?",
    "192": "Christmas is over so let's go back and go over the Detroit Pistons game\n\nIn the first half the team was lead by Herro's 20 &amp; Strus' 13 pts\n\n⬇️⬇️",
    "193": "What Detroit #Pistons must target at deadline, regardless of Jerami Grant's fate https://t.co/VWbi7g5pL5",
    "194": "What Detroit Pistons must target at deadline, regardless of Jerami Grant's fate https://t.co/sMA8YJ7MRB",
    "195": "Spurs: Detroit Pistons game score vs. San Antonio #Spurs: Time, TV, radio https://t.co/F6XTLARq6P",
    "196": "Spurs: Detroit Pistons game score vs. San Antonio #Spurs: Time, TV, radio https://t.co/AiM1vW1vBk",
    "197": "@SavantHoops Hes more like a detroit pistons dennis rodman.. can run all game long, hustling and smart in adapting offense and defense transition",
    "198": "I FUCKING HAT E THE DETROIT PISTONS LOGO!!!!!!",
    "199": "Detroit Pistons game score vs. San Antonio Spurs: Time, TV, radio and how to watch https://t.co/lD93h8gTjt https://t.co/6bsdVtsoJY",
    "200": "Detroit Pistons game score vs. San Antonio Spurs: Time, TV, radio and how to watch https://t.co/oGWuCMSQou",
    "201": "Detroit Pistons game score vs. San Antonio Spurs: Time, TV, radio and how to watch https://t.co/q9cMVHomaB",
    "202": "Game Preview: San Antonio Spurs vs. Detroit Pistons https://t.co/7BmA0tx4nV",
    "203": "@TheATrainShow Gotta admit, as a @DetroitPistons fan, I am enjoying this! 👍",
    "204": "San Antonio Spurs: Game Preview: San Antonio Spurs:  vs. Detroit Pistons https://t.co/aZaUlKtQrb",
    "205": "@BeanEnjoyersCEO Talent&gt;fit why would teams pass up a rising star for a roll players? You know who else did that? Detroit and any piston fan can tell you picking darko over melo was one of the worst decisions they ever made.",
    "206": "NBA Basketball Game Betting Picks Simulator: 7:00 PM ET - Detroit Pistons vs. San Antonio Spurs - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/rdNJcQGjqW #nba #sportsbetting #freepicks #cappertek",
    "207": "Game Preview: San Antonio Spurs vs. Detroit Pistons https://t.co/jdl8VPmQ8E",
    "208": "@IlMoniker Detroit was the 1st city i visited in the States.. love the sports over there so follow the Lions Pistons &amp; Tigers ..NFL NBA Baseball ..been to a couple Tigers games .. Lions aren’t great but have my support.. that’s being a fan i guess ..",
    "209": "@ClarenceOver @Richie_whatever @BillSimmons Keep waiting on those pistons and lions buddy! Just give it some time, Detroit is a hot free agent destination so you’re going to be attracting a superstar sooner or later!",
    "210": "@DaEthiopianWolf @jidebam @DetroitPistons My lakers could use you. ⏳🤐",
    "211": "@pickdawgz\n\n#PickDawgzCapperContest\nNumber220 Capper Contest picks 12/26: \nPick #1: NFL Detroit Lions +7 (FD)\nPick #2: NFL Chicago Bears/Seattle Seahawks UNDER 42 (DK) \nPick #3: NBA Detroit Pistons +10 (FD)",
    "212": "@rsandns @rcwhlr @Super70sSports That Pistons team was better, fam. Magic or no Magic, Detroit was winning that series",
    "213": "@Nathan_K_Hunt @detroitbadboys @DetroitPistons Your son is cooler than me",
    "214": "@YoIAmUno @thezachattack_2 @urkle9 He had a great performance and had a large positive impact on the game, discrediting that because of a loss is dumb asf and you’re clearly not accounting for the 4 other guys on the court. Also Kd hung up 50 and barely beat a Detroit Pistons team who’s best player is 20 years old",
    "215": "@detroitbadboys @DetroitPistons We got my son a Cade jersey, even though, as he let us know after opening it, Killian is his favorite player. 😑 (He is also a big Elton John fan hence the hat and glasses) https://t.co/TUjtpfGsQG",
    "216": "Detroit Pistons sign ex-Michigan G Derrick Walton, Cassius Stanley to 10-day deals - Detroit Free Press https://t.co/sfQ9RYLEUl https://t.co/W08zPO2T3x",
    "217": "Trey Lyles becomes sixth Detroit Pistons player to enter health and safety protocols",
    "218": "@tigers @DetroitRedWings @DetroitPistons Would love a chance to win and share with family",
    "219": "Michigan Basketball 1991-1992\n\n1986-1987 Red Wings \n\n1987-1988 Detroit Pistons\n\nHM: Michigan Football 1996 solely for the Biakabutuka game sending Northwestern to the Rose Bowl. https://t.co/bl31V9tfKD",
    "220": "The Nets ain’t played in 3 games before this😂😂😂😂…..like I said the Detroit Pistons are better then the Lakers",
    "221": "God can we play the Detroit pistons for the rest of the season please",
    "222": "@IHaveAN02858601 @ATLHawks @DetroitPistons I hope 😂😂",
    "223": "@TheRealPres10 Be like a @ATLHawks @DetroitPistons score. What sport is this even??? 🤣",
    "224": "Hmm…either the 87-88 Detroit Pistons or 2018 Michigan basketball. https://t.co/dQaGqDW0i1",
    "225": "@daily_msu I’ve seen every team in Detroit but the Lions win a championship in my lifetime. Pistons 3x, Red Wings 3x, Tigers 1x. Lions need to get it done.",
    "226": "@HiveCards @Stretch_Breaks Detroit Pistons autos!\n\nKennard $5 PWE \nEveryone else is $3 PWE each https://t.co/bya4qVyHLv",
    "227": "@DubsNets He led my Pistons to the playoffs that season. I know he had some great years in LA. but it's more significant in Detroit bc of the career highs. he did score 50+ against Philly putting everyone on notice that season.",
    "228": "@Eminem @DetroitPistons @BleacherReport @mitchell_ness I’m such a better writer",
    "229": "1987-88 @DetroitPistons\nI was at the game where they finally knocked out the Celtics in the ECF. Outplayed the Lakers in a 7-game series loss. https://t.co/BBP0hOsEMW",
    "230": "Blake Griffin, Bruce Brown, Langston Galloway and Stanley Johnson are on the court currently playing on x-mas day... poor NBA and #COVID19 protocols... all ex-pistons 🤦‍♂️😂@NBA @Lakers @BrooklynNets @DetroitPistons",
    "231": "Trey Lyles becomes sixth Detroit Pistons player to enter health and safety protocols https://t.co/s6EU5Qw9kc https://t.co/OPF56VcYH7",
    "232": "@BurritoFritto @_luhjerry @Lions @BlazePizza @NFL @DetroitPistons @DetroitRedWings @RamsNFL @LArams4L @Tyrellcrosby @Jamahl @bigplay24slay @je_lions @ShawnPorterJr @jamalagnew UNREAL",
    "233": "Scouting Report\nName: Jarren Gary\nCollege: Miami (FL)\nHeight: 5'11\nWeight: 165\nStrengths: Defense, Energy, Hustle\nWeaknesses: Shooting, Dribbling, Passing, Athleticism\nSummary: Solid rotation piece, unselfish teammate, good for team morale\nMake the call @DetroitPistons https://t.co/Qtu7vQLkhD https://t.co/oinvHZYf4f",
    "234": "Trey Lyles becomes sixth Detroit Pistons player to enter health and safety protocols https://t.co/bjGtwBg2De",
    "235": "@TheWoodardHouse @DetroitPistons @DerrickWalton10 @cassius_stanley @cheick_diallo13 Cold&gt;heat",
    "236": "@DetroitPistons Why does our team suck so much",
    "237": "Trey Lyles becomes sixth Detroit Pistons player to enter health and safety protocols https://t.co/sovyzEuHnM",
    "238": "Trey Lyles becomes sixth Detroit Piston to enter health and safety protocols https://t.co/hFNelI8HE4",
    "239": "@themaxhoover @NastyN04h Absolutely and there not easy to come by. That's why I've always said if we can't aquire a player better than Randle then we need to add more players closer to Randle. The Detroit Pistons won a ton of games and a title without a Top 15-20 Guy. Billups was 5th in MVP but 🤷🏾‍♂️",
    "240": "🗣️📢 With the first pick in the 2042 @nba draft the @detroitpistons select Omari McCurtis from @waynestate 🏀 📢 and so it begins @ Detroit, Michigan https://t.co/OPCvCIEdIG",
    "241": "@tigers @DetroitRedWings @DetroitPistons This would be awesome if I could win this! All 3 of my favorite teams.",
    "242": "@MotorCityCruise @DetroitPistons Congrats!  🥳",
    "243": "Amid the rash of COVID-19, there are two new members of the @DetroitPistons. One name is familiar for @umichbball fans: https://t.co/8jj5fsmtDZ",
    "244": "@VegasBballMom @mellentuck @HPbasketball I hope back to Detroit to coach the Pistons❗",
    "245": "Warriors are SO fun to watch when whirring. Basketball unfiltered. \n\nNow, if you'll excuse me, I have to resume rooting for the Detroit Pistons",
    "246": "Why Detroit Pistons may go Chet Holmgren over Paolo Banchero if they pick No. 1 https://t.co/dhm3bOYfAu #sports #feedly",
    "247": "Merry Christmas to all you Detroit Pistons fans out there! #DetroitPistons https://t.co/iBs0y3I3wH",
    "248": "Yahoo! Sports:  Why Detroit Pistons may go Chet Holmgren over Paolo Banchero if they pick No. 1 https://t.co/IqLhuWz66h"
}