{
    "0": "@ggerould @SacramentoKings Looking great GG!",
    "1": "@FreeMalikMonk Sacramento kings legend Justin James.",
    "2": "Let's go nuggs! #milehighbasketball (at @BallArenaDenver for @denvernuggets @SacramentoKings in Denver, CO w/ @theryanhess) https://t.co/OF5aMd0Cai",
    "3": "@ggerould @SacramentoKings G-Man drip",
    "4": "@SacramentoKings @Verizon @swipathefox @JustHolla7 @hbarnes @moe_harkless @Dsabonis11 Is metu going to play tonight or what?",
    "5": "@ggerould @SacramentoKings G-man is Kobe Bryant of Sports radio and we are blessed to have you in Sac!",
    "6": "@ggerould @SacramentoKings Miss your top-end interviews on the @NHRA tour Gary! Hope you are keeping well, great to see you're still going strong! 🤟🏼🏁",
    "7": "🏀 Denver Nuggets vs Sacramento Kings\n🏆 NBA\n🗓 26/feb.\n⏰ 23:00\n📺 NBA TV",
    "8": "@ggerould @SacramentoKings Best in the business",
    "9": "🚨THE DICE HAVE SPOKEN🚨\n2/26 @MoneylineDice Roll:\n\n#NBA\n4U #Nuggets -8\n\n🔥Current streak: W2🔥\n\nCheck out our Dice/Notebooks @ https://t.co/tnaCLx2J5V\n\nTrack our rolls: https://t.co/3elvJGWB0V\n\n#GamblingTwitter #Kings #Sacramento https://t.co/YFhyaKZwit",
    "10": "@ggerould @SacramentoKings Nothing less than legendary from the G-Man 👑",
    "11": "@ggerould @SacramentoKings Legend",
    "12": "@ggerould @SacramentoKings Ah great stuff Gary !!",
    "13": "@SacramentoKings @Verizon @swipathefox @JustHolla7 @hbarnes @moe_harkless @Dsabonis11 Moe Harkless💀",
    "14": "Starting 🖐🏾 for the @SacramentoKings at Denver:\n@swipathefox @JustHolla7\n@hbarnes @moe_harkless and @Dsabonis11. How will this @AlvinGentry lineup fair against Michael Malone and “The Joker” at Denver. Let’s not forget that DeMarcus Cousins has signed with Denver. @FCartoscelli3",
    "15": "Sacramento Kings guard De’Aaron Fox rug pulled fans who bought $1.5m worth of his NFT project. He sent them basketball jerseys as an apology https://t.co/VHwye9YQHy",
    "16": "Game 62 of the Sacramento Kings baby!!! https://t.co/CC7XswShoI",
    "17": "Sacramento Kings Starters:\n\nDe'Aaron Fox\nJustin Holiday\nHarrison Barnes\nMaurice Harkless\nDomantas Sabonis\n\nPlayers out:\nTerence Davis\nRichaun Holmes\n#SacramentoProud #NBA #NBATwitter #NBA75",
    "18": "These two 1985 cards of the first @SacramentoKings basketball team from 1985-1986 and the first arena (Sacramento Arena) arrived today. #SacramentoProud https://t.co/6pdldLCAlL",
    "19": "@Aly61698381 @Erik_Lakeflow @baIIcontroII @TheNBACentral Trust in Lebron James’s passer’s I.Q. to be better than Sacramento Kings guards. 😂😂😂 Buddy Hield can’t shoot WITHOUT THE BALL. Lebron feeding Anthony Davis and himself = more efficient Buddy Hield with less attempts.",
    "20": "Tonight's starting lineup for the Sacramento Kings: Fox, Holiday, Barnes, Harkless, Sabonis https://t.co/bVWH4AMCA2",
    "21": "So before we get started with @SacramentoKings basketball tonight from Denver, there are two different views I want to show folks. Photo 1 is from radio row, where @ggerould is broadcasting from. Photo 2 is Section 104, Row 21, Seat 12. That is where I moved to due to crowding.🤝 https://t.co/5swOtIR2Xa",
    "22": "SAC/DEN SGP Ladder🪜🪜\n\nFox 25+ Points/Sabonis 6+ Assists\n+222  0.5U\n\nFox 30+ Points/Sibonis 8+ Assists\n+914  0.1U\n\n#NBAPicks #sacramentokings",
    "23": "Tune in tonight! @momoragan @SacramentoKings @NBCSKings https://t.co/MBMwKsjTH5",
    "24": "Almost 2 weeks away from @BallArenaDenver, but we are baaaack! Let's go @nuggets! Time to win back 2 back vs the @SacramentoKings All Star Break is done, 24 to go for #MileHighBasketball FINISH STRONG!!! https://t.co/2jGahhOiBr",
    "25": "@instaIocker With the #1 overall pick in the 2026 NBA Draft the Sacramento Kings select...",
    "26": "Michael Malone spoke at length on his Sacramento  #Kings history with DeMarcus Cousins, now newly signed through the end of this #Nuggets season:\n\n\"You know, I think the reason we hit it off was because he realized from day 1 that I was not gonna be afraid to coach him.\"\n\n(1/x) https://t.co/CN7ztaCDdL",
    "27": "Shoutout back to the @SacramentoKings fans back in #Sacramento. Here in Denver, Colorado with @KyleDraperTV and the @NBCSKings television network as well as with @ggerould and the Kings Radio Network. Good times doing good work for @JohnRKings @mmcnair &amp; the entire organization. https://t.co/1MH2NgBLNO",
    "28": "This and wearing a gold Kings jersey will be my only lasting legacy for Sacramento 😂 https://t.co/WwtguUye5O",
    "29": "G League in South Bay tonight. Sacramento Kings rookie Neemias Queta is suited up for Stockton. https://t.co/tfS6Fsutdy",
    "30": "ALERT: New high roller bet posted!\nA bet has been placed for $9681.07 on Denver Nuggets - Sacramento Kings to win $12,198.15.\nTo view this bet or copy it https://t.co/GAUYliKasW https://t.co/5tdQuEkJGD",
    "31": "Denver Nuggets - Sacramento Kings\n\nBet slip link: https://t.co/aVODH9To76 https://t.co/KgJJPKS7Vm",
    "32": "@SWlPATHEFOX Ngl I drove to Sacramento in 2017 and caught a Kings game as they were playing the Cavs, and I don’t think more than 5,000 people showed up. Plus I barely see any of y’all on Twitter",
    "33": "Shoutout to @momoragan back @ the @NBCSKings Studio in San Francisco, as well as @JasonRoss1140 back at @Golden1Center and the @SacramentoKings radio network. I’m with my guy @KyleDraperTV and showing a view from radio row today in Denver, Colorado. #SacramentoProud #BusinessTrip https://t.co/XNGDzKwjOs",
    "34": "@sameolvee @maxthagreat_ Mate I have the unfortunate situation of being a @SacramentoKings fan as my cousins were born there. Oh how I loved CWebb, spud, white choc etc but at least you guys have won a title. I wish I could jump on a bandwagon!! 🤦‍♂️🥺😩🤪😂",
    "35": "Sacramento Kings vs Denver Nuggets - NBA League 2022\n🔴Watch Streaming Now➠ https://t.co/wSwyYo5iIy\n📅 : Saturday, February 26, 2022 ⏰ 9:00 PM",
    "36": "Richaun Holmes (horse play) ruled out Saturday.\n\n#CREAMgetsTheMONEY at\nhttps://t.co/Nn0iNg7L2I\n\n@Rich_Holmes22 #SacramentoProud @SacramentoKings #NBADFS #DFS\n\nhttps://t.co/8coVuP7Wg4",
    "37": "@BradSherman Brad\nWe need to get your buddy up in Sacramento, who has restricted the California Oil Industry with regulations and laws to lift those and start more oil drilling here in LA county and Kern County, Ca. And also in Ventura County and up the coast in San Ardo and King City.",
    "38": "New listing! \n\nJabari Parker 2020-21 Prizm Green Prizm Holo #220 Sacramento Kings MINT \n\nCheck it out: https://t.co/4QqZ0nL2bH\n\n#TradingCards #ForSale #eBay https://t.co/QabNngnWpd",
    "39": "@realStanVG Come save the @SacramentoKings coach!",
    "40": "@ChrisMarlowe @graceofthecurls @nuggets @SacramentoKings Have a quick and full recovery 🙏🏼",
    "41": "Kings gameday live: Fox explains NFT project fiasco; Nuggets sign Cousins; Holmes’ status – Sacramento Bee | NFTRADIUS https://t.co/cEHMBkkst8",
    "42": "@hawksplswin The Sacramento Kings follow me lol",
    "43": "Video: Sacramento Kings and Denver Nuggets players joined arms in a show of support for Ukrainian-born Kings forward Alex Len before their game Thursday night. https://t.co/WNHiXhBTk0",
    "44": "Sacramento Kings’ De’Aaron Fox scuttles NFT plan, tells investors time isn’t right https://t.co/LeU8SqyzGZ",
    "45": "@SacramentoKings @mypmstore Lets get that 5 L. 😓",
    "46": "🏀 02/26 Final Update:\n\n#CBB 3 more plays added\n\nFree Play:\n\n791 Seattle (-4.5)\n\n#NBA 4 plays for tonight w/ 1 Top Play\n\nFree Premium Play:\n\n531 Sacramento Kings (+8.5)",
    "47": "I completely forgot about, but now I remembered both @jborjasac and @jdrake9161 too. I hope they have an opportunity to see what Denver has to offer and if anything they do could perhaps apply back home in #Sacramento. @SacramentoKings basketball begins in Denver at 7pm Mountain. https://t.co/vM0RtBqZrf",
    "48": "@SacramentoKings blowing my brains out if we have to watch mo harkless play basketball again",
    "49": "@ItsEarToe Combo 1:\n- Payback\n- Sacramento Kings\n- Golden King \n- Fusion Coil\n\nCombo 2:\n- Ravina\n- Illusion Rune\n- Psi-Blade\n- Corrupted Tendrils",
    "50": "NBA Basketball Game Betting Picks Simulator: 9:10 PM ET - Sacramento Kings vs. Denver Nuggets - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/bkBA2H9xXP #nba #sportsbetting #freepicks #cappertek",
    "51": "[📺LIVE - 03H10] 🏀 #NBA\nSacramento #Kings @ Denver #Nuggets en direct sur beIN SPORTS MAX 4 \n#NBAextra",
    "52": "@itsjustadamh @Joshplusmore @LakersNation Lakers GM had the Sacramento Kings trade 90% completed. 😂😂😂 Last obstacle was whether to include that 1st Round draft pick.\nLebron threw his weight around and requested Westbrook. https://t.co/6WxcGZLfRI",
    "53": "rebounds per game through his rookie season with Sacramento Kings in 2009. Regressing each yr after that, the frm No. 4 overall pick’s most recent NBA season saw him log 10.2 points &amp; 2.4 assists per game with the Indiana Pacers (2018-19).",
    "54": "Sacramento tried to bury Buddy …. Kings fans are 💩 https://t.co/9RhMVtHuEl",
    "55": "Uniforms for Sacramento Kings vs Denver Nuggets at 6:00 PM.\n\n#SacramentoProud #MileHighBasketball https://t.co/fPwd80TNuf",
    "56": "In Denver for @SacramentoKings Basketball tonight. I have to show my friends back home like @SacGonzo, @cjflores28, @sacrt_henry, @pinayhope &amp; @Sarah4Transit a selfie onboard a train over at Denver Airport, and the free bus along 16th Street in Downtown Denver. #InterestingStuff https://t.co/MJ9pLL6DZW",
    "57": "🔴Live ~ Sacramento Kings vs. Denver Nuggets - NBA League 2022\n🔗 🔴Watch Live Fullᴴᴰ 👉 : https://t.co/9EDfASpvID ✅\n📆 : On Saturday. February 26 /2022\n⏰ : 9:00 PM",
    "58": "you dont know who is de'aaron fox from the sacramento kings???\n\nyeah bruh i dont even know where sacramento is",
    "59": "@ChrisMarlowe @graceofthecurls @nuggets @SacramentoKings Oh you don’t have Comcast?  Lucky you. Be back soon",
    "60": "Marvin Bagley is easily the top 3 worst draft selection in Sacramento Kings history. \n\nEASILY. https://t.co/iCBMj2fj4k",
    "61": "ICYMI - Check out this clip from our latest episode with @hbarnes of the @SacramentoKings and @GoHeels alum(just like our beloved co host @Johnhenson31) !\n\nTag the projects he mentions for a follow back‼️🔥🤝👇🏽\n\n@psychedelic_nft @BAYC2745 @BossBeautiesNFT @WomenTribe_nfts &amp; more! https://t.co/fhzwSMpnef",
    "62": "NFL Network played the AFC Championship game and now MLB Network is playing game 7 of the 2014 World Series.\n\nI haven’t checked but I’m gonna guess NBA TV is running old footage of the Kings moving trucks driving to Sacramento",
    "63": "@SacramentoKings What plans do you guys have for tonight? \n\nThis is how @ManCity came out today. \n\n#nowarinukraine #SacramentoProud \n\nDo me proud https://t.co/NhRSO11SU4",
    "64": "Nuggets vs Kings preview is up:\nTPM™ 2021-'22 Game #59 vs Sacramento - Pre-Game version\nhttps://t.co/VFPcv9yXBM",
    "65": "@ChrisMarlowe @graceofthecurls @nuggets @SacramentoKings Always thinking of others! You're the best! Feel better soon.  Will be looking forward to The Marlowe Live Twitter Chat!",
    "66": "@BleacherReport I will do this for @SacramentoKings 🙌",
    "67": "@ChrisMarlowe @graceofthecurls @nuggets @SacramentoKings Well, sorry to hear you are not well… speedy recovery! Soon enough you’ll be back to the shape of Hector, when he was a pup 😎",
    "68": "we need Jabari Smith in a Sacramento Kings uniform. I will make sure this happens. whatever it takes.",
    "69": "Sacramento Kings’ De’Aaron Fox scuttles NFT plan, tells investors time isn’t right https://t.co/MTmDysg3Fr",
    "70": "@ChrisMarlowe @graceofthecurls @nuggets @SacramentoKings So alive tweeting or a live tweeting? 🤷‍♂️😂😂🤦‍♂️✌️ #FeelBetterSoon 🙏",
    "71": "@ireraiz @swipathefox @SacramentoKings So what happened? Why is it done?",
    "72": "@ChrisMarlowe @graceofthecurls @nuggets @SacramentoKings Looking forward to your Twitter comments! I think @VicLombardi was fantastic in previous stint, love Hanz but hope we get more Vic!",
    "73": "@ChrisMarlowe @graceofthecurls @nuggets @SacramentoKings Who's on the call Chris, @VicLombardi ?",
    "74": "Denver Nuggets Predictions and Preview for 2/26/2022 hosts Sacramento Kings.  Find out who we are taking in this matchup. #NBA #Sportsbook https://t.co/d9eJ2COWXr",
    "75": "Sacramento Kings’ De’Aaron Fox scuttles NFT plan, tells investors time isn’t right https://t.co/eQyBL84W9x",
    "76": "Thanks to all for the well wishes sent my way! I am doing well and as @graceofthecurls mentioned I will be watching @nuggets and @SacramentoKings live tweeting as we go. Let’s Boogie! 😎",
    "77": "@jarzod @nuggets @SacramentoKings @ongondola 👀 I’m actually in town \n\nhttps://t.co/7slaT7nERr",
    "78": "Milwaukee Bucks - Brooklyn Nets\nDenver Nuggets - Sacramento Kings\n\nBet slip link: https://t.co/SwSG6jdy1h https://t.co/Uk1wDxU3E7",
    "79": "Has Vivek Ranadive hindered the progress of the Sacramento Kings organization? Matt George provides some insight on The Royal Rebounds Podcast available only on YouTube. Be sure to check Matt out on The Locked On Kings Podcast as well!\n\nhttps://t.co/nSbzMiBhfR https://t.co/zo2ZEMsCEP",
    "80": "@jarzod @nuggets @SacramentoKings @ongondola literally just bought 3 tix last night https://t.co/25eCyvQfY8",
    "81": "Our Hottest Prop tonight is MVP Nikola Jokic when The Nuggets take on The Kings. Look for him tonight as we predict Jokic to reach 20 points this matchup! #denvernuggets #sacramentokings #nba #nbabets #nbapicks #playerprops",
    "82": "Any creators in Denver want two suite tickets to the @nuggets vs @SacramentoKings tonight?? \n\nFollow @ongondola and reply to this tweet with your gondola profile link for a chance to go! We’ll pick names at 5pm MST! https://t.co/uMe1AGwOy0",
    "83": "How today started. How it is going at the moment. Made it on @SouthwestAir from @FlySMF to @DENAirport. It is still five hours until @SacramentoKings tip-off at the Nuggets. I will first go to the Hotel Indigo, then go to 16th and California, per recommendation of @ggerould.🍕🤝 https://t.co/IxfrzLt3aK",
    "84": "@AnnaJaneSmith4 Not lebron the Sacramento kings. They should be ahead of the Lakers but they can't get out of their own way",
    "85": "Analyzing Saturday’s Sacramento Kings at Denver Nuggets odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/5m0694bhZV",
    "86": "Sacramento Kings at Denver Nuggets odds, picks and prediction https://t.co/B8gjwDxfyQ",
    "87": "@rubicon20192 @GoodmanHoops Domantas Sabonis is a Lithuanian-American professional basketball player for the Sacramento Kings of the National Basketball Association.",
    "88": "The Sacramento Kings will look to get back on track tonight when they face the Denver Nuggets at Ball Arena.\n\nHere's what happened on Thursday against Denver at Golden 1 Center, injury updates, stats &amp; more: https://t.co/NcNKORmCrN",
    "89": "Consensus Line Move:\n2022-02-26 Sacramento Kings at Denver Nuggets from 237.50 to 236.50\nUnder never a doubt\n#NBA #bettingexpert #tech #personalfinance",
    "90": "@Colts @TyHaliburton22 As a Sacramento Kings fan and a Indianapolis Colts fan, I'm down with it. Let's go Colts!!! #ForTheShoe",
    "91": "When I lived in Cali I’d go to every Celtics game in Oakland or Sacramento and every time I went to the kings game, Buddy Hield would always torch us, moved to Chicago region in October and going to watch second Pacer game tomorrow and already know he’s dropping 5 3’s on us. https://t.co/IaejvpfjAS",
    "92": "#Sacramento Kings’ De'Aaron Fox scuttles #NFT plan, tells investors time isn’t right #NFTs #NFTCommunity  https://t.co/eed1eXhlaR",
    "93": "The Sacramento Kings playoff drought https://t.co/CvkX07fPqv",
    "94": "You can only rock ONE #sacramentokings jersey for the rest of your fandom … \n\nwho is it and what ‘era’ of jersey is it?\n\nPersonally … at this moment in time … I’m gonna wait for 5 comments to tell y’all mine! Muahaha \n\n#SacramentoProud",
    "95": "The Stockton Kings, the NBA G League affiliate of the Sacramento Kings, announced they have added Quinn Cook.",
    "96": "Sacramento Kings’ De'Aaron Fox scuttles NFT plan, tells investors time isn’t right https://t.co/ib0XDO8HrS #NFT #NFTCommunity #NFTs #ethereum #eth #solana #art \n\nCheck my pinned tweet at @WHardingKY for three free stocks from #Webull worth up to $6300!",
    "97": "🔴 Live▶ Sacramento Kings vs. Denver Nuggets - NBA League 2022\n🔴Match Now➠ https://t.co/PVcdAO9vXr\n📅 : Saturday, February 26, 2022\n⏰ : 9:00 PM",
    "98": "#Nuggets back at it tonight vs Kings. This schedule sets up well to improve seed over final 23 games. They are an 8 point favorite at home — one of 15 home games in second half — vs Sacramento, per @SuperBookCO",
    "99": "Hot Take Friday\nIf LeBron was on the Sacramento Kings, they’d be more of a contender than LBJ on the current Lakers.",
    "100": "Vivek Ranadive. \n\nAlso probably the ghost of Pete D’Alessandro. #SacramentoKings https://t.co/b1wfserVSx",
    "101": "I watched his Sacramento kings highlights this would be really damn good if we could get him https://t.co/4qwWZgcsbN",
    "102": "I’m gonna need the Sacramento Kings to step the fuck up and win some games",
    "103": "Kings gameday: Fox's NFT collapse; Nuggets sign Cousins | The Sacramento Bee https://t.co/rRLwytLzSk #Cryptoart #NFT #OpenSea",
    "104": "SATURDAY TRIPLE HEADER ON @ALTITUDESR!\n\n1:00 PM on 92.5 FM | @ColoradoRapids vs @LAFC\n\n6:30 PM on 92.5 FM | @Nuggets vs @SacramentoKings\n\n7:30 PM on 950 AM &amp; ASR App | @Avalanche at @GoldenKnights\n\n#Rapids96 | #GoAvsGo | #MileHighBasketball | #LAFC | #SacramentoProud | #VegasBorn https://t.co/KmEkqWAoGN",
    "105": "@overtime @SacramentoKings How come they didn’t pray for peace in Yemen? 100k killed, 8 years of bombing, no electricity, food or clean water.. it’s been 8 years can’t see how they missed it?",
    "106": "@ggerould @SacramentoKings Happy travels G-Man!!",
    "107": "Bagley clearly has skill @SacramentoKings do the whole league a favor and just disband your team",
    "108": "Tweet from Legion Hoops (@LegionHoops) Legion Hoops (@LegionHoops) Tweeted:\nTRADE: The Bucks are trading Donte DiVincenzo to the Sacramento Kings, via ESPN. https://t.co/i4Osid1rdG",
    "109": "@SwipaTheFoxNFT @swipathefox This piece of shit rugged his own collection and fucked over his fans!! De'Aaron Fox your a piece of garbage, the NFT community coming for you!! @SacramentoKings how can you endorse this scumbag!! Force him to repay!!! https://t.co/KFjWhrsGV0",
    "110": "We stand against war and with the people of Ukraine. Praying for peace ❤️\n\n(via @SacramentoKings)\nhttps://t.co/i6TmqcKfPD",
    "111": "Tonight I go purple to root on the @SacramentoKings. #RockThePurple #SacramentoProud https://t.co/ixUhpwnc0F",
    "112": "Thank you @SacramentoKings for giving us @MB3FIVE for nothing!\n\nWe appreciate your generosity.\n\n#Pistons",
    "113": "@RatiolFear -Blaze Pizza\n-Sacramento Kings\n-Memphis Grizzlies\n-Denver Nuggets\n-Colorado Avalanche\n-Colorado Rockies\n-Stephon Gilmore\n-Brandon Bolden\n-Georges Niang",
    "114": "Players of the Denver Nuggets and Sacramento Kings of the NBA showing solidarity to Ukraine. \n\n#nowarinukraine https://t.co/SrpHlQRIvY",
    "115": "The Sacramento Kings face the Denver Nuggets in Saturday's NBA Basketball Action. Get Trending Rabbit's NBA Basketball Pick and Prediction for this game https://t.co/YADQh630Ot via @YouTube #NBA #NBAPredictions #Nuggets #Kings #SacramentoProud #MileHighBasketball #NuggetsVsKings",
    "116": "Cryptocurrency, NBA Top Shot and the #SacramentoKings \n\nI wrote about the topic a few months back and it seems to be resurfacing with the recent 'SwipaThaFox' NFT situation\n\nAre you in #crypto or #NBATopShot ?\n\n@nbatopshot #SacramentoProud  \n\nhttps://t.co/rJYGyTaCpZ",
    "117": "Pronostico Baloncesto NBA  Denver Nuggets - Sacramento Kings (27-Febrero-2022) - https://t.co/4nZfdQTM0B\n\n#pronosticos #pronosticosfutbol #pronosticosapuestas #apuestasdeportivas #pronosticosgratis https://t.co/zL4s5EGtE4",
    "118": "@theathletic still needs to up their #SacramentoKings articles\n\nPaid for them originally because they were the BEST ... now ... one of the worst. \n\nStill #SacramentoProud",
    "119": "@kingbsoto13 @SacramentoKings @MB3FIVE you got your wish",
    "120": "King shit smoking on this Sacramento",
    "121": "Sacramento Kings vs. Denver Nuggets- 2/26/22 Free Pick &amp; NBA Betting Prediction https://t.co/5cG2yq7imz\n.\n#Betting #FreePicks https://t.co/DjMWpnoB0s",
    "122": "the #circleoflife crew 👑 @KingJames age(20) +   Savannah’james age (18) + Gloria James age (37) + @RichPaul4 23 = (98) for number 1 hurricane of 05 #hurricanekatrina formed 8/23/05 on @kobebryant 27th bday \n\n10/29/03 👑 1st gm 106-92 L (1)(98) total.vs @SacramentoKings https://t.co/1n8yVInG0c",
    "123": "Revenge Game: DeMarcus Cousins plays Sacramento tonight.  He played 470 games in his career for the Kings.",
    "124": "Notable matchups over the remaining 21 Games for the #SacramentoKings \n\n3/2 - @ New Orleans Pelicans\n3/3 - @ San Antonio Spurs\n3/23 - @ Indiana Pacers (Ty/Buddy revenge game)\n3/31 &amp; 4/1 - @ Houston Rockets\n4/5 - vs. NOP\n\n#SacramentoProud",
    "125": "DasHaus made a bet!\n\nEvent: Sacramento Kings vs Denver Nuggets #NBA\nBet: Denver Nuggets TO WIN -7.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "126": "DasHaus made a bet!\n\nEvent: Sacramento Kings vs Denver Nuggets #NBA\nBet: Sacramento Kings TO WIN +7.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "127": "Consensus Line Move:\n2022-02-26 Sacramento Kings at Denver Nuggets from 235.50 to 237.50\nOver nervous?\n#NBA #vegas #innovation #forex",
    "128": "Sacramento Kings vs  Denver Nuggets Prediction 2-26-22 -  Free NBA Picks https://t.co/P8dLirqaRY via @YouTube",
    "129": "@ggerould @SacramentoKings Good for you, G-Man!",
    "130": "@AsHotDog @RFWill149 I wish I could go. I’ll be covering the @SacramentoKings at @vivintarena that weekend as they take on the Utah Jazz. I hope everyone who goes has fun and a good time while staying healthy and safe. I do have 20 games picked out in my 2022 flex-plan package. See you all real soon.",
    "131": "The De’Aaron Fox NFT scandal, explained: From legality to what happens next | De’Aaron Fox, the star point guard for the Sacramento Kings, saw his NFT project dissolve suddenly. Wh #nft\n\nhttps://t.co/jFAtdEdW1s",
    "132": "@SacramentoKings @alexlen WhatsApp about you? You dont Defend your country in ukraine? Online words? Kliczków Brother are waiting",
    "133": "Consensus Line Move:\n2022-02-26 Sacramento Kings at Denver Nuggets from -8.50 to -7.50\n#SacramentoProud flying out\n#NBA #sportsgambling #tech #forexlifestyle",
    "134": "Kings (22 - 39) @ Nuggets (34 - 25)\n🚨 Buzzer Moment Watch\n🕘: 9:00 pm ET\n📱: Buzzer⚡️, NBA League Pass\nSpread: DEN -8.5 (@FDSportsbook)\n\n📰This is a rematch from Thursday night. Denver won by 18 behind a 31 point game from Will Barton. Sacramento is 2-3 since acquiring Sabonis.",
    "135": "2/26 Saturday #NBAPicks\n\n1* Boston Celtics vs Detroit Pistons ~ UNDER 215 -110\n\n1* Toronto Raptors vs Atlanta Hawks ~ Toronto Raptors +2.5 -110\n \n1* Sacramento Kings vs Denver Nuggets ~ Sacramento Kings +8.5 -110",
    "136": "Denver Nuggets - Sacramento Kings İddaa Tahmini 27.02.22\nhttps://t.co/A7yX02IJHR",
    "137": "The De’Aaron Fox NFT scandal, explained: From legality to what happens next | De’Aaron Fox, the star point guard for the Sacramento Kings, saw his NFT project dissolve suddenly. Wh #nft\n\nhttps://t.co/8Qb1RAMGiz",
    "138": "SACRAMENTO KINGS vs\nDENVER NUGGETS, 10:00PM.",
    "139": "Kings gameday live: Fox explains NFT project fiasco; Nuggets sign Cousins; Holmes’ status - Sacramento Bee https://t.co/JVkzyc6ir8",
    "140": "GM/GA/GN Kings gameday live: Fox explains NFT project fiasco; Nuggets sign Cousins; Holmes’ status  Sacramento Bee https://t.co/uorYEmB7xS",
    "141": "Sacramento King https://t.co/96bUmgRq8h",
    "142": "@4MR_Monty I feel ya bro, I’m also a #Sacramento Kings fan and it doesn’t get worse than that. Well I’m #SacramentoProud  and going to #KeepPounding 😂",
    "143": "Mr 2-15 needs to just accept that this is RJ’s team now tbh. I’m sure the Sacramento Kings would love to make you one of their higher options bro @J30_RANDLE",
    "144": "NBA Ukrainian players share emotional message amid Putin, Russian invasionUkrainian NBA player Alex Len (center) locks arms with his Sacramento Kings teammates and Denver Nug... #helloworld2022 #StandWithUkriane #キズナアイ   https://t.co/oboqKt1vvB",
    "145": "Sacramento Kings, Denver Nuggets lock arms in show of solidarity with Alex Len, Ukraine https://t.co/84uaVsgKiE",
    "146": "🏀 𝗚𝗔𝗠𝗘𝗗𝗔𝗬 🏀\n\n👑 SACRAMENTO KINGS\n⚒ DENVER NUGGETS\n📍 Ball Arena (Denver)\n📺 NBA League Pass \n\n#SacramentoProud https://t.co/I2qUJpNlCL",
    "147": "@CarmichaelDave It just so happens that @SouthwestAir is who I will be with on Saturday and Sunday for a round trip + @SacramentoKings game to/from Denver. I have to return to #Sacramento for the 5-Day workweek, then back in the air Saturday the 5th to #Southwest Headquarters at the Mavericks.🤝",
    "148": "Denver Nuggets vs Sacramento Kings Full Game Highlights | February 24 | ... https://t.co/5qINlYUXCw @YouTube",
    "149": "#RT @CoinDesk: .@SacramentoKings guard @swipathefox botched an NFT project and fans are left holding the bag. \n\n\"The Hash\" crew says it highlights the demand for coding talent in the space. \"Where is the underlying product?\" @naomibrockwell asks.\n\nPresen… https://t.co/WkrtzAh37Q",
    "150": "Sacramento Kings, Denver Nuggets lock arms in show of solidarity with Alex Len, Ukraine https://t.co/xoSpoM1ckt",
    "151": "@JosgabrielNFTs @Slowboidex @Forrey_Wayne @SacramentoKings @swipathefox @espn @NBA @shaqtin @garyvee @The_BTC_Express Greed and stupidity",
    "152": "@PatBoyle44 @WFAN660 I'm late to the voting but no. Just like over here in Sacramento with the Kings...firing the coach isn't going to fix an inept team...we saw that firing Luke Walton",
    "153": "@swipathefox @Sacramentokings nice rug pull you fucking scammer",
    "154": ".@SacramentoKings guard @swipathefox botched an NFT project and fans are left holding the bag. \n\n\"The Hash\" crew says it highlights the demand for coding talent in the space. \"Where is the underlying product?\" @naomibrockwell asks.\n\nPresented by @turbota… https://t.co/plX8WnC7Ea",
    "155": "Happy birthday to Kurt rambis of the Los Angeles lakers #kurtrambis #darrellkurtrambis #losangeleslakers #charlottehornets #phoenixsuns #sacramentokings https://t.co/QZXRKDsNeM",
    "156": "The Dixon High School Girls #Basketball team won their first #cifsjs Title with a 48-42 victory over Calaveras High School Friday at the Golden 1 Center, home of the Sacramento Kings.#vacareporter #dixonhighschool #nikon #nppa #nppawest @vacareporter @athletics_dixon @cifsjs https://t.co/FAYCXmGhBQ",
    "157": "The De’Aaron Fox NFT scandal, explained: From legality to what happens next | De’Aaron Fox, the star point guard for the Sacramento Kings, saw his NFT project dissolve suddenly. Wh #nft\n\nhttps://t.co/Tf9BgIJdJd",
    "158": "@BrendenNunesNBA You have to not suck to have any true rivalry, therefore @SacramentoKings have no rivals.",
    "159": "@SacramentoKings @KalimahJohnson @dstinc1913 @swipathefox how you gonna spend the 1.5 million dollars you scammed from your fans? @BleacherReport @barstoolsports @TMZ",
    "160": "@ggerould @SacramentoKings Happy you get to call a game again on the road.  Fun!",
    "161": "@JCassity @oshima9 @_Rsipad @BrendenNunesNBA Almost every sports network even fox tweeted saying don’t compare me to another man i’m  my own player in the begging of the year but hahahah🤔 I belive the tweet was Ja is the player sacramento kings fans think fox is go back and look it up if u don’t belive me 🤷🏽‍♂️",
    "162": "@WeedxMut12 @SacramentoKings Been there before. Last time I was in vegas. The jazz cost me $800",
    "163": "@LeslieMinesIII Sacramento Kings.",
    "164": "The Sacramento Kings were a problem for Denver last season. Sacramento swept the three games from the Nuggets despite finishing with 16 fewer wins and hurt Denver’s playoff positioning. https://t.co/b5oXZOutZY",
    "165": "@oddomanick @KingsChamps2030 @SacramentoKings hop in the discord",
    "166": "@Slowboidex @SacramentoKings @swipathefox @espn @NBA @shaqtin I would like my $1800 back",
    "167": "Hornets, Nets, Clippers, Nuggets, Magic, &amp; Kings have the same amount of championships but the Kings are the only team that is brought up about being moved. For decades, even with bad teams, Sacramento has shown more loyalty than any other franchise. These fans need more respect https://t.co/A0cFq8OqXr",
    "168": "@karalawson20 Remember when she worked for the @SacramentoKings ...everything she did was at another level...saw the greatness early...she is special!!!",
    "169": "@IamCKirkpatrick @Lakers @JeanieBuss Oh no!! This hurts my @SacramentoKings loving heart! I still love you and your family though! 😘🥰 #NSYNCfanforlife #SacramentoProud  #TeamKirkpatrick",
    "170": "Not one Network suggests the Sacramento Kings moving and letting Seattle take place. The Kings haven’t been relevant in 20 years. Yet the .@Pelicans swept a .@Blazers team with 3 potential Hall of Famers. CARRY THE HELL ON!!!!",
    "171": "Phil Handy could have a chance of coaching the Sacramento kings next season 👀\n\nI’m calling it.",
    "172": ".From a pool of 32 teams, there's only 3 Black play-by-play announcers 🎙 in the National Basketball Association (NBA). Two of them work for the Sacramento Kings. 🏀 \n\n.Photo Art by Tony Ray Harvey 📸 \n\n@NBACommsMR @NBA @NBA @NBAonTNT @espn @TonyRayHarvey https://t.co/41NG9S4hgF",
    "173": "The De’Aaron Fox NFT scandal, explained: From legality to what happens next | De’Aaron Fox, the star point guard for the Sacramento Kings, saw his NFT project dissolve suddenly. Wh #nft\n\nhttps://t.co/EbljuVR6Lw",
    "174": ". From a pool of 32 teams, there's only 3 Black play-by-play announcers 🎙 in the National Basketball Association (NBA). Two of them work for the Sacramento Kings. 🏀 \n\n.Photo Art by Tony Ray Harvey 📸 \n\n@NBACommsMR @NBA @NBA @NBAonTNT @espn @TonyRayHarvey https://t.co/eHwcB0vvHk",
    "175": "Congratulations to bburghardt (@Burgy85) who moved up 2 spots to take #18 on the Sacramento Kings team leaderboard.\n\nhttps://t.co/WHnq2718B3",
    "176": "@jarule can you please lift the curse on the @SacramentoKings already? Haven't we had enough? 🥺",
    "177": "Jamari and the Modesto Christian Crusaders will be playing for the boys D1 Section Championship tomorrow night in the Sacramento Kings Golden 1 Arena. https://t.co/F4t78geQPl brought to you by @CourtsmithHoop You won’t see us without or Jamari exclusives.. We’re Built Different. https://t.co/56HFtD07VV",
    "178": "@southbeachGEE The Sacramento Kings have entered the chat.",
    "179": "@CGEEEZZZY Hey I think I am all over that Sacramento Kings game tomorrow 🤔",
    "180": "@bentecs @Debi27771215 @SacramentoKings bro he owned the nft investors first of all and second of all there war going out and you just care about some nft shit?",
    "181": "@NFTINFLUNCER @swipathefox @SacramentoKings #swipathescam We know what happened, Buddy. We also see the half a mil sitting in your wallet… got the screenshots so don’t even try to move it",
    "182": "Didn’t realize the Stockton Kings were different than the Sacramento Kings https://t.co/dyqV0IezZf",
    "183": "@BrendenNunesNBA The Sacramento Kings are the Sacramento Kings biggest rivals.",
    "184": "@SideEyePrincess @gobirdsalex @SacramentoKings His kids were also great… his wife, I’ll be in Twitter jail if I describe her. 😂",
    "185": "Per Sources , it has been leaked that Jahmeir Davis is becoming a new General Manager of IBL with an expansion team being the Sacramento Kings , he tends to build a team of two young IBL guards that have shown promise in Free Agency and hopes to guide them to All Star potential. https://t.co/3P6Y30GVJl",
    "186": "@jet122179 @gobirdsalex This makes me happy. I love my @SacramentoKings !",
    "187": "Denver Nuggets vs Sacramento Kings Full Game Highlights | February 24 | 2022 NBA Season #Denver #Nuggets #NBA Video: https://t.co/ZNH31SVqvB",
    "188": "@Charlottean28 With that logic, why not just let everyone in?  Create some tournament so every team gets an opportunity.  Making the post season SHOULD be an accomplishment but it isn't anymore.  Sure the 22-39 Sacramento Kings are still playing meaningful games tho!",
    "189": "@Kings_6thMan Barbara. Is a Rock Star and her boy guard ain’t so bad either. . Sacramento Fans love you guyzz — Keep it going 🏀🏀🏀🤠😎. Be well / take care — my brother ice says almost every game ( tv). Where are the Sign Lady and Niko - I hope they are ok.   Keep on doing your thing 👍👍👍",
    "190": "Sacramento kings https://t.co/keVzuIrbeT",
    "191": "@BrendenNunesNBA The Sacramento Kings",
    "192": "The Westchester Knicks will acquire Louis King, per @JShawNBA. King, who started the season with the Sacramento Kings on a two-way contract, averaged 12.0 PPG, 6.0 RPG, 3.6 APG and 1.1 SPG in 6 games with Stockton. He played in 15 games for Westchester during the 2020-21 season.",
    "193": "@CardPurchaser It's who we are, but still love my team! Still so thankful for drafting Marvin over Luka @SacramentoKings https://t.co/dbQgg8JGiR",
    "194": "Laguna Creek sits at 7 three pointers with 5:35 left.. @Golden1Center @SacramentoKings, 3 more and we get free tacos?",
    "195": "@Mayor_Steinberg @Leadership_Sac @SacramentoKings You have your heart in the right place @Mayor_Steinberg. We need more like you!",
    "196": "This week, I had the opportunity to see the new garden, gazebo, stage and other amenities built by young people at the Mack Road Valley Hi Community Center. \nThank you, @Leadership_Sac, Mack Road Partnership, @SacramentoKings Kings, and all of the sponsors who made this happen. https://t.co/rrotKaHEYd",
    "197": "@Slowboidex @DelayedJumper @SacramentoKings @swipathefox @espn @NBA @shaqtin For real...can't believe @swipathefox is trying to walk away from this mess, blame others and pretend he's \"too busy\".  \n\nSuper bad look for the Kings too, knowing they have a crook on their team. \n\nFix it Fox, you made it happen.",
    "198": "Huge shout out and thank you to @SacramentoKings @CacheCreekCR! Entered daily on their 25 Day Fam Frenzy and won the prize I wanted the most! An auto @hbarnes jersey! LFG! #gokings https://t.co/A3fXabCLi9",
    "199": "@FineTheRefs @kiiLkenny @FantasyGenius4U @BeauLWagner @nbastats @NBA @SacramentoKings Got it resettled as a win. F the books",
    "200": "Thunder preserve through a tough shooting performance in OT to outlast the Pacers, 129-125 for their 19th win of the season and next game for the Thunder is Monday Night against Dearron Fox, Domantas Sabonis, Harrison Barnes and the Sacramento Kings with tiptime set for 7 pm CT",
    "201": "With Ukrainian Alex Len in the center, Kings and Nuggets players gathered for a moment of silence before Thursday’s game in solidarity with the people of Ukraine.\n\n(🎥 @sacramentokings) https://t.co/jLBVWfhVND",
    "202": "@Jakery33 @thekingsherald @SacramentoKings @Thomo1885 Ron and peep Brad in the back",
    "203": "@waytooript @DelayedJumper @SacramentoKings @swipathefox @espn @NBA @shaqtin thank you for saying it for me @waytooript some people just don't understand the situation",
    "204": "@uhbroncofan A bit shocking to see the Sacramento Kings this high on the list #SacramentoProud #kangz"
}