{
    "0": "Dejounte Murray O18.5 (Low Points Line) - Murray is coming back tonight from a rest game. The Spurs are at home up against a poor Houston Rockets side who are not defensively great. In Murray’s last 5 he has hit; 27, 29, 16, 19, 19 points. #nbabets #bettingpicks #dejountemurray",
    "1": "Direct\nLive Stream ▶️🎥\n🔴👇\nHouston Rockets vs San Antonio Spurs\nLIVE HD🔴►https://t.co/0e5WW37C0x https://t.co/zVneDrW5p9",
    "2": "Are you looking for a best TV to watch Houston Rockets vs San Antonio Spurs Live.?\nLive here👉👉 https://t.co/wZfkCWoiGr https://t.co/r0HS8X9e0b",
    "3": "@RooshWilliams @lovethegame02 @Bigahhfro @UnbiasBball Ima have to side with Roosh bro. In the city if Houston.. not rockets Twitter.. not stans.. but with regular Houstonians .. harden is a mark. Nobody in real Houston likes him except stans on Twitter.",
    "4": "@HoustonRockets @clutchthebear @officialccd Thank you @MichelobULTRA https://t.co/H983oebKSW",
    "5": "NBA : San Antonio Spurs vs Houston Rockets Live Stream\nWacht Here : https://t.co/hV64ffK4N8\nVENUE : AT&amp;T Center (San Antonio)\n\n#SanAntonioSpurs #HoustonRockets #NBA https://t.co/OjbRruTwnM",
    "6": "The @HoustonRockets  really playing gordon?",
    "7": "@HoustonRockets in SA we reppin tha H tho ! https://t.co/THcPEuZcz0",
    "8": "@HoustonRockets let’s goooooo beat the SPURms!!!!!!!! 🚀🚀🚀🚀🚀🚀",
    "9": "The @HoustonRockets starting Porter Jr., Green, Gordon, Tate, Wood on Friday. #Rockets50 #NBA",
    "10": "@HoustonRockets @Kevinporterjr @o_tate_ Come on ❤️",
    "11": "@HoustonRockets @Kevinporterjr @o_tate_ bro tip off is 7:30",
    "12": "Houston Rockets (+7.5) @ San Antonio Spurs #Rockets #PorVida #NBA #NBATwitter #NBA75",
    "13": "Houston Rockets Starters:\n\nKevin Porter\nJalen Green\nEric Gordon\nJae'Sean Tate\nChristian Wood\n\nPlayers out:\nUsman Garuba\nJohn Wall\n#Rockets #NBA #NBATwitter #NBA75",
    "14": "@MayeuxBroussard @HoustonRockets @spurs I like the yellow!",
    "15": "NBA STREAM: Houston Rockets Vs San Antonio Spurs | Live Play By Play &amp; R... https://t.co/wZQfCB3xEl via @YouTube come join",
    "16": "Tonight's starting lineup for the Houston Rockets: Porter Jr., Green, Gordon, Tate, Wood https://t.co/bVWH4AMCA2",
    "17": "Houston Rockets Starting Lineup 2/4\n PG: Kevin Porter Jr.\n SG: Jalen Green\n SF: Eric Gordon\n PF: Jae'Sean Tate\n C: Christian Wood\nhttps://t.co/o75oZ8vnE8",
    "18": "Are you looking for a best TV to watch Houston Rockets vs San Antonio Spurs Live.?\nLive here👉👉 https://t.co/84y35lbOIv https://t.co/cN3FySyrZC",
    "19": "The Houston Rockets I believe we're the Lowest Seed to enter the Playoffs and win the Championship, one day, in History, will there be a 6_8? That would stand out as overcoming injuries, age, time, and recreation.  Eyes 👀 prize",
    "20": "It’s time for Basketball: San Antonio Spurs vs Houston Rockets https://t.co/ot8QhWepbT",
    "21": "@HoustonRockets @MichelobULTRA @JalenGreen @o_tate_ Lets Go team ❤️",
    "22": "I don't know much as I love Mike that 94-95 Houston rocket team is a tough out! And no man on Earth walking could check  Hakeem Olajuwon in 1994 and 95. https://t.co/sRYmTwD7mK",
    "23": "The Houston Rockets Luc Monte had the Run DMC CD playing during the game.",
    "24": "Today's NBA Picks: 8:40 PM ET - Houston Rockets vs. San Antonio Spurs - 28 PICKS AVAILABLE: https://t.co/breaQaWSOi #nba",
    "25": "Houston Rockets / San Antonio Spurs 🏀 NBA Wager\n\n$55,000 to win $50,000 💰 16 of 17 posted FREE WON!\n\n#GamblingTwitter 🔒 If they don’t post big tickets how can you trust them? https://t.co/sLAVs0bB9C",
    "26": "@MaxxTheOne1 @Homesteadboy503 @HoustonRockets @JalenGreen Nobody knew christian wood was going to have an up and down season and show the leadership issues. Still too early to say who has the better upside",
    "27": "Houston Rockets vs. San Antonio Spurs | USA: NBA\nThis match will start at 08:30 PM, February 04, 2022\n📺 Watch Live Here =&gt; https://t.co/dWAshmqwTK\nVenue: AT&amp;T Center (San Antonio)\nPlease Like and share, thank you https://t.co/0og3tMQD71",
    "28": "@HoustonRockets @MichelobULTRA @JalenGreen @o_tate_ MY BOYS MY BOYS !!",
    "29": "Day 47 of asking @alperennsengun how many likes for you to send me a signed jersey? 🐐 @HoustonRockets #RocketsTwitter",
    "30": "Zach Collins will be active tonight vs the Houston Rockets for the first time since 2020",
    "31": "#Rockets vs Spurs TONIGHT on AT&amp;T SportsNet\n\nHere are @CalvinMurphyHOF's keys to the game presented by @Toyota \n\nJoin Calvin &amp; @KevinEsch1 as they begin our coverage at 7PM\n\n@HoustonRockets \n#toyotausa\nhttps://t.co/HOouXfTS9S https://t.co/ScEq8ykrKy",
    "32": "So the @HoustonRockets are working on showing support to young entrepreneurs in the city. \n\nNow is the time to jump into the business world in Houston because when it is being encouraged that heavily, we know there’s a ton of opportunities! \n\n#htowntakeover #Houston #business",
    "33": "#Rockets have won 4 of their last 6 road games when playing as underdogs. Houston is the underdog given a 41.7% chance to beat #PorVida \n\n#NBA #NBATwitter",
    "34": "@ssabb05 I had the absolute privilege of being a guest on the Overstated NBA show to talk about the @HoustonRockets! #Lightthefuse",
    "35": "3 young @HoustonRockets on the roster https://t.co/4bDd1e3cd3",
    "36": "@tony_maraj @Moody504___ @OGIsBetta @wojespn before that draft night, they attempted to offer the Rockets Drexler and their '84 1st round pick (which would probably be MJ for the Rockets) for Ralph Sampson, but Houston declined (saved them lmao)",
    "37": "@Not___KC @JacManuell Man will become a Houston Rockets legend",
    "38": "@HoustonRockets i know u saw how much Norman Powell is worth DONT act sick with it for Eric and Christian wood",
    "39": "TIP: San Antonio Spurs - Houston Rockets, Dejounte Murray Double Double ucinak, 1.537 by #tipster Martin771 (profit this month: +63.76)\n  #betting #Basketball #San #Antonio #Spurs #Houston #Rockets",
    "40": "On the bright side, there is a 50% chance a Houston Rocket wins the Rising Star Challenge this year 🤷🏽‍♂️",
    "41": "Houston Rockets \nAtlanta Hawks !!",
    "42": "@coinbase @NBA #CoinbaseNBASweepstakes would love to go see my @HoustonRockets",
    "43": "All I know outta the BK situation is that the Houston Rockets are about to be in draft heaven the next few years",
    "44": "The Houston Rockets Terik Black had  to go to the bathroom during the game so he hit his juul.",
    "45": "@HoustonRockets Fire every security guard that was in jidions video",
    "46": "It's GAME NIGHT for the @HoustonRockets \n\n@cayleighgriffin has a preview of the game against the Spurs in the Midday Minute presented by @memorialhermann \n\nCoverage begins at 7PM with #Rockets Pregame \n\n#memorialhermann https://t.co/7ME4lXFTyo",
    "47": "@marioelie1 @MrChuckD @HoustonRockets @nyknicks @VernonMaxwell11 @TheJetOnTNT I won’t even sport anything with the current logo. All my gear is retro. I have no idea why they’ve stuck with the current one so long. They don’t even have to create anything new just go back to the championship gear and everyone is happy.",
    "48": "@MrChuckD @HoustonRockets @nyknicks @marioelie1 @VernonMaxwell11 @TheJetOnTNT Preach.",
    "49": "Agree with this. If James hadn't had the hamstring injury they'd have their ring.\n\n The trade was also never a mistake by the Rockets, despite the 'Houston didn't get anything for Harden' takes which are now being deleted all around NBA twitter. https://t.co/vhKJvgg6Kn",
    "50": "Thread!! Just in time for the @HoustonRockets  game vs. the @spurs check out these head to head player matchups. Join @mike_inago and myself tonight after the game to chop it up on the #chopup spaces. #Rockets #Lightthefuse #rockettrends #GoSpursGo #PorVida  \n\nKPJ vs. D. Murray https://t.co/QG2pu4iTGc",
    "51": "TIP: San Antonio Spurs - Houston Rockets, J.Tate 13,5 - , 1.85 by #tipster drose25 (profit this month: +62.24)\n  #betting #Basketball #San #Antonio #Spurs #Houston #Rockets",
    "52": "Basketball Hall of Famer Bill Fitch, who was head coach of the 1986 Western Conference champion Houston Rockets, has passed away at 89 years old.  https://t.co/BLCLyPc4xa",
    "53": "Thread!! Just in time for the @HoustonRockets  game vs. the @spurs check out these head to head (H2H) matchups. Join @mike_inago and myself tonight after the game to chop it up on the #chopup spaces. #Rockets #Lightthefuse #rockettrends #GoSpursGo #PorVida https://t.co/Pg3W2kkQKZ",
    "54": "DOES ANYBODY WANT RUSSELL WESTBROOK FROM US @ATLHawks @Clippers @memgrizz @BrooklynNets @nyknicks @sixers @PelicansNBA @hornets @DetroitPistons @trailblazers @utahjazz @Suns @cavs @Twolves @celtics @warriors @Bucks @MiamiHEAT @HoustonRockets @Raptors PLEASE HELP.",
    "55": "@RooshWilliams After everything he did with Houston you say this.Because its his fault CP3 hamstring was made out of glass &amp; Ariza put up 0 pts in a game 7. Russ allowing him to be double teamed at half court in a whole playoff series was his fault to ? 29.6 7.7 apg 6 rpg for his rockets tenure",
    "56": "@BimaThug @Rockets_Insider @Sebastian4now @RooshWilliams @RedNinetyFour @clutchfans @Jonathan_Feigen @BenDuBose Yes. He is the pillar of Houston sports.",
    "57": "Rockets fans react to rumor of Nets trading James Harden to 76ers #Houston #Rockets #NBA https://t.co/4Jx7hj5E5A",
    "58": "Harden wanting out of Brooklyn only shows how much of a true Rocket he is by potentially increasing the value of those picks Houston got in the trade 😂",
    "59": "@steven_weissman @The_PhifthQ Probably because he was on the Houston Rockets for his prime but push your agendas",
    "60": "@NateNTheH @BillSimmons @clutchfans The ringer are Houston sports haters and always kissing the warriors ass. Its expected Rockets ruined their dream match ups and Astros beat their red soxs 😁👍",
    "61": "NBA Game Preview: The San Antonio Spurs have a forecast 74% chance to win against The Houston Rockets with a spread of -10.5/10.5 and an over/under of 232. The San Antonio Spurs are 1 - 1 against The Houston Rockets in the 2021-22 Season.\n#bettingadvice",
    "62": "💲500 🧃👇\n🏀\nHouston Rockets  \nvs \nSan Antonio Spurs https://t.co/TLiuG5YkUl",
    "63": "Lets try this again!! Had the great @PastorPostUp on to talk all things Houston Rockets. This pod was awesome. Check it out! \n\nhttps://t.co/My0JtJCNWq",
    "64": "The Houston Rockets Terik Black had 64 hotdogs in his pockets while playing.",
    "65": "@Metaserph At least a minor part of my little brain is pretending to work 😎\n\nI have some personal connections to Houston  (spent some time  there in 2018). Rockets, Astros and Cougars 😄✌🏼",
    "66": "Rockets should give Brooklyn their picks back for Harden! Make it happen @RafaelStone12 @PJFertitta @TilmanJFertitta @HoustonRockets !",
    "67": "Houston Rockets Counting their Lottery picks from now until 2027. https://t.co/SbzX42lnrb https://t.co/sIDKzFtsbK",
    "68": "@perrylander_ The Rockets own the Nets picks until 2027.\n\n I will say, the best case scenario is for Harden to walk in  this upcoming FA, but the trade Houston made with Brooklyn looks a lot better with Harden leaving the Nets this soon.",
    "69": "#Cavs head coach J.B. Bickerstaff said that focusing on containing the Hornets and dictating the overall speed is the priority tonight.\n\nCharlotte is only behind the Houston Rockets in terms of pace.",
    "70": "I follow @JHarden13. I wanted him to go to the @sixers when he was still with the @HoustonRockets. My thought process was he needs a really good big. I thought @AntDavis23 should’ve gone to HOU instead of the @Lakers. I just hope this drama with the @BrooklynNets end soon.",
    "71": "Free @KyrieIrving, he doesn’t need a vaccine down in Houston!! Let that man go already @BrooklynNets #Rockets https://t.co/ZUSjR7k8gh",
    "72": "RT @BallySportsSA: Start your weekend off with the @spurs 🥳\n\n@spurs vs @HoustonRockets \n⏰ 7:00 pm\n📺 Bally Sports Southwest\n📲 Bally Sports App\n#PorVida https://t.co/1Cg1fzaazu #actnearn #sct",
    "73": "@Pacers @cavs @HoustonRockets can we have a redo? I’d like @CarisLeVert and @_bigjayy_ back please",
    "74": "Harden would struggle so much if this is the case, Harden is only at his full potential when he's got shooters around him like he did with the Houston Rockets https://t.co/2Cmdybq0Gb",
    "75": "Start your weekend off with the @spurs 🥳\n\n@spurs vs @HoustonRockets \n⏰ 7:00 pm\n📺 Bally Sports Southwest\n📲 Bally Sports App\n#PorVida https://t.co/LXpNxr68vT",
    "76": "@pistonsaredope @king_darofans Yeah I’m really confused on the victory laps rockets fans are taking rn. If anything there’s a possibility that this year’s pick might fall to mid lottery and it’s the best one houston gets 😟",
    "77": "@AshNicoleMoss Rockets owner was an idiot for refusing to work with Morey to begin with. Houston could have had simmons right now to build around.",
    "78": "Things turn around, tonight... We hope\n\nHouston @ San Antonio - OVER (237) \n\n#PorVida #NBABets #Rockets \nhttps://t.co/6VFLnSIxjY",
    "79": "HOUSTON ROCKETS ABOUT TO FEAST ON THE NETS PICK 😤😤😤 https://t.co/yPgnD3GBf0",
    "80": "Friendly reminder the Houston #Rockets own the Brooklyn Nets first round picks until 2027.",
    "81": "@Rockets_Insider Gtfoh lol this is just too much I hope rockets fans slander tf out of Harden he did all that to Houston for absolutely nothing good job guy",
    "82": "@Rockets_Insider What houston reportes do with the athletic is pretty great, Kelly and you are awesome. I think what local media know lacks is good sources and the HC is becoming like StephenA takes, just to get clicks, good reporting with good info and different perspectives.",
    "83": "@ShamsCharania @TheAthletic The Houston #Rockets own the Nets picks through 2027.\n\nRafael Stone masterclass.",
    "84": "You can never say that James Harden did nothing for the Houston Rockets. https://t.co/Fb7NYXCKnD",
    "85": "To all the James Harden Defenders; he QUIT on the Houston Rockets, he QUIT on the Brooklyn Nets.\n\nFollow him to the Philadelphia Sixers! \n\nI GUARANTEE the Sixers will implode in the Playoffs, hopefully it comes against my Brooklyn Nets!",
    "86": "@Rockets_Insider But “why did Houston trade him for Oladipo???!” 😂 😂 😂",
    "87": "@AttucksPatriots #UrbanScholars received @HoustonRockets swag at the #MLKDay of service 🔥🔥🔥 https://t.co/IyCRsLDlfd",
    "88": "The Houston Rockets Gerald Green had a blind fold on during the game.",
    "89": "🏀SPURS v ROCKETS \n\nPoeltl O14.5 pts -106 (1.5u)\n\nShouldn’t be a minutes limit since it was just a minor concussion he was out with &amp; before that he was DOMINANT &amp; now he gets the best matchup in Houston who allow the MOST PTS to C’s &amp; 2nd most pts in the paint. He’s  is over..",
    "90": "San Antonio Spurs Predictions and Preview for 2/4/2022 hosts Houston Rockets.  Find out who we are taking in this matchup. #NBATwitter #Sportsbook https://t.co/L9gQi1MOHw",
    "91": "@HoustonRockets is this the long term plan? https://t.co/Bvr8nH2QuV",
    "92": "Dejontae Murray drop 19 against Houston rockets in 24 minutes last time out. Houston gives the 2nd most points to point guards. #GamblingTwitter",
    "93": "@kennythomasnba @HoustonRockets @NBAalumni Good old Rocket Days🚀🚀🚀🤟🤟🤟🤟",
    "94": "#flashbackfriday action🔥\n\n@HoustonRockets @NBAalumni https://t.co/Ytfwq2CWNb",
    "95": "I drove through rain and some icy roads from Houston to be here in San Antonio for the @HoustonRockets games vs the Spurs tonight. I’d appreciate a win 😇 https://t.co/iEbrpAqaJg",
    "96": "Houston Rockets visits San Antonio Spurs Predictions and Preview for 2/4/2022 today.  Who are we taking in this game?  Find out now. #NBATwitter #Sportsbook https://t.co/L9gQi1MOHw",
    "97": "Rockets traded Robert Covington for a 1st and Portland ALREADY shipped him off...\n\nYet another deal that Houston won.",
    "98": "ATLANTA HAWKS +3\nHOUSTON ROCKETS +7\nDALLAS MAVERICKS -1.5\n2/4",
    "99": "@HoustonRockets @ATTSportsNetSW @SportsTalk790 Jalen green going off tonight",
    "100": "Sales Associate (Inside Sales) - Houston Rockets &amp; Toyota Center (Houston · TX) https://t.co/OL2XN26bao",
    "101": "NBA Betting Preview: San Antonio Spurs vs. Houston Rockets - Friday, February 4, 2022 https://t.co/otUvS1I1HB",
    "102": "The rebuilding @HoustonRockets would get a 4 years younger Hardaway Jr. with a declining salary and a lob-threat in Dwight Powell, his contract runs out in 2023. The @dallasmavs get leadership and a very good PF in C. Wood. #Trade #Nba #ESPN https://t.co/2yHRMVS1b1",
    "103": "@MrChuckD @HoustonRockets @nyknicks @marioelie1 @VernonMaxwell11 @TheJetOnTNT The home and away \"Houston\" and \"Rockets\" texts as well.",
    "104": "NBA 🏀 Temporada: 76-70\n\nViernes 4/2: \n\nCleveland Cavaliers vs Charlotte Hornets O216.5 (-110)\nHouston Rockets vs San Antonio Spurs U237.5 (-110)",
    "105": "What To Expect From The Houston Rockets | 2021-2022 Preview/Prediction https://t.co/bbktrXB5jX",
    "106": "@MrChuckD @HoustonRockets @nyknicks @marioelie1 @VernonMaxwell11 @TheJetOnTNT Not just Rockets but UH too.\nThey used these classic uni’s from 1959-1986 now bringing them back as throwbacks?🤷🏻‍♂️\nJust make them the official uni’s again!\n\nUH is joining Big12 starting the 2023-24 szn, that’d be a perfect time to bring them back.\n\nExclusive J’s are awesome too!😁 https://t.co/cLeTcCyQu6",
    "107": "@MrChuckD @VernonMaxwell11 @HoustonRockets @nyknicks @marioelie1 @TheJetOnTNT @DR34M (there you go, Chuck). 👊",
    "108": "The Houston Rockets James Harden had a terrible warmup and won't play.",
    "109": "@jeancarloanton5 @IndoChimps @jandro0o When I had went to the rockets game he was at that hoe. With Trae tha Truth. But yeah Houston the next visit blood gotta come pull up on us brotha. https://t.co/j4SgcOOcTK",
    "110": "told em gettin money is the best solution and when you do wear your rocket like you rest in Houston",
    "111": "Houston Rockets / San Antonio Spurs 🏀 NBA Wager \n\n$55,000 to win $50,000 💵 I will be adding more at Caesars\n\n#GamblingTwitter 🤝 DM for access https://t.co/3d78OIb9Vz",
    "112": "@HoustonRockets @JalenGreen @alperennsengun @Chriswood_5 @gmathews_24 it’s bigger then black and white",
    "113": "@KDTrey5 @ESPNNBA @stephenasmith Your performance speaks for itself, man. Ignore the haters. Rings are a terrible metric to measure a player’s career.\n\nI know when my team plays your teams, you are the opposing player I am terrified of the most. 🤷‍♂️ I wish you had been a Houston Rocket, honestly.",
    "114": "@HoustonRockets  vs @spurs \n-3 to -7 👀💨🗣✍🏾🥶\n\n70 % on spurs \n95 % on they ML \n\n239 is now 237.5 w 71 % on the over \n\nRefs: \nSean Wright 203.5 PPG \nKevin cutler 204.8 PPG \nJonathan sterling 217.1 PPG",
    "115": "@MrChuckD @HoustonRockets @nyknicks @marioelie1 @VernonMaxwell11 @TheJetOnTNT Whoever thought changing uniforms after a championship was smart should never have owned the team. Looking at Leslie!",
    "116": "@MrChuckD @HoustonRockets @nyknicks @marioelie1 @VernonMaxwell11 @TheJetOnTNT I'm glad you said it Chuck. Rockets Jerseys just as classic as Celtics,  Lakers and Knicks.. Rockets only Western team to be in the Finals in the 80's outside of the Lakers.. Twice facing the Celtics",
    "117": "The Rockets take on the Spurs tonight! Coverage begins at 7pm!\n\n@HoustonRockets | #Rockets https://t.co/mXFFGRoct6",
    "118": "@JeffPassan Send Manfred to Houston so he can take a rocket to the moon and leave him there",
    "119": "@DucksJaggernaut So you’re gna lose to the Houston rockets and John wall???",
    "120": "Today's NBA Picks: 8:40 PM ET - Houston Rockets vs. San Antonio Spurs - 24 PICKS AVAILABLE: https://t.co/breaQaWSOi #nba",
    "121": "@NickScurfield I’m probably in the minority here but I would have been fired up a couple of weeks ago but not now, teams have been tanking for years to move up in the draft #houstonrockets and teams have fired coaches after winning seasons also but now it’s all about race can we just have #nfl",
    "122": "ICYMI \n\nHere is my latest podcast with @HTOWN4LIFE40 as we discuss the @RGVVipers as a \"Mini Launch Pad\" for the @HoustonRockets. \n#TheValleysTeam\n\nListen here: https://t.co/Cg09wXuZjZ",
    "123": "@spurs over @HoustonRockets tonight @slimthugga @OGRONC https://t.co/W4TKpZk20b",
    "124": "Wishing Judson Rocket @CoachJinks great success at Houston!   @JISD_ATHLETICS @JudsonISD https://t.co/SrufFbuZSK",
    "125": "@Askyomomma1 @MrChuckD @HoustonRockets The meskin in me be like... https://t.co/stUXKIIDqZ",
    "126": "Promo Alert: Register now for the 20th annual Houston Rockets Run and get early bird pricing: https://t.co/CacPZTDwTg https://t.co/DXxU9gSGvT",
    "127": "Imma say it. Jaylen Brown to rockets makes zero sense for Houston.",
    "128": "NBA Basketball Game Betting Picks Simulator: 8:40 PM ET - Houston Rockets vs. San Antonio Spurs - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/zilOK3FmGJ #nba #sportsbetting #freepicks #cappertek",
    "129": "@MrChuckD @VernonMaxwell11 @HoustonRockets @nyknicks @marioelie1 @TheJetOnTNT As I told you on the MVP night that you were one bad dude with those 3’s",
    "130": "@sports_besiktas @HoustonRockets @JalenGreen @alperennsengun @Chriswood_5 @gmathews_24 He played on Tuesday",
    "131": "HOUSTON vs. SAN ANTONIO - Totals Prediction = 55.89% going UNDER #Rockets #Spurs  Full odds at https://t.co/nUn5OcMhOI",
    "132": "Tha Texans and Nick, Jack , Plus Fat Boy Cal making the city of Houston look like a shit hole of an organization. I hope the season ticket owners see this bs going on. How long does it take to pick a coach. It’s not Rocket Science or Nuclear Enginnering freaking common sense 🤦🏾‍♂️",
    "133": "Analyzing Friday’s Houston Rockets at San Antonio Spurs odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/Sc2pUFbVOC",
    "134": "LeBron James and Bronny on the Houston Rockets is gonna be wild",
    "135": "Now trade Eric Gordon and Christian Wood @HoustonRockets",
    "136": "The Houston Rockets P.J. Tucker had the Run DMC CD playing during the game.",
    "137": "@HoustonRockets @JalenGreen @alperennsengun @Chriswood_5 @gmathews_24 Big game incoming, let's get it 🚀",
    "138": "@HRbenj @chiddyafc @wojespn What a title for Houston Rockets lmao\nY'all only have 2\nAnd y not focus on the present?\n\nSee y'all in playoffs\nOh wait......",
    "139": "@FitermanSports @DR34M @HoustonRockets Got em! https://t.co/qz1GH4N1y1",
    "140": "@ziyanm_ @HoustonRockets Simons for Augustin, nwaba and a 2025 2nd https://t.co/igLPZ2vR11",
    "141": "Christian Wood hopes Rockets play him with Alperen Sengun more #Houston #Rockets #NBA https://t.co/oNMKs1aqXq",
    "142": "@MrChuckD @HoustonRockets @nyknicks @marioelie1 @VernonMaxwell11 @TheJetOnTNT Agreed, Chuck.  That mostly red and white is classic and I like the comparison to the pinstripes.",
    "143": "get the blazers front office on the phone immediately @houstonrockets",
    "144": "@HoustonRockets @JalenGreen @alperennsengun @Chriswood_5 @gmathews_24 follow back? i have no electricity im using my limited data rn 🙁",
    "145": "@chiddyafc @HRbenj @wojespn Houston Rockets fan😭😭😭",
    "146": "@HoustonRockets got all them draft picks 👀👀 https://t.co/olSJSsY4xR",
    "147": "@HoustonRockets @JalenGreen @alperennsengun @Chriswood_5 @gmathews_24 SA here we come",
    "148": "@HoustonRockets @JalenGreen @alperennsengun @Chriswood_5 @gmathews_24 trade",
    "149": "Your turn @HoustonRockets https://t.co/ZW9f1nYFCg",
    "150": "@FitermanSports @DR34M @HoustonRockets Can I purchase a Clyde and Drexler jersey",
    "151": "IT Systems Coordinator - Houston Rockets &amp; Toyota Center (Houston · TX) https://t.co/kGPmeFoju6",
    "152": "‘The Dream’ and ‘The Glide’\n🚀Hakeem Olajuwon•@DR34M \n🚀Clyde Drexler• \n\nHonored and grateful to have the @HoustonRockets legends as Exclusive Clients. We had a great time at the @autographshowoftexas \n\n______________________\n#FitermanSports #houstonrockets #nba #houston https://t.co/w4rMljn18r",
    "153": "I’m not so much talking about who had more value to those Rockets team bc with the way they played that was definitely Harden, I’m more talking about Houston shipping CP out and painting him as the villain when he clearly had a ton more in him and Harden seemingly does not https://t.co/9GmJcvxQ7g",
    "154": "I normally don't play 2 steals just to be as a safe as possible, but Murray is literally in the perfect spot to do so. Houston is bottom of the league against steals, and look at Murray's hit rate against the Rockets the last 5 games....1u play on BetMgm. And a poll coming up! https://t.co/ynaM7xtb9P",
    "155": "@rocketzin4 @JSchlick03 @LeGoatedOne I’m from the bay. Been a dubs fan since memory. Rocket fans down bad cuz houston was chanting MVP for Curry the other night!",
    "156": "@taimgxe @marioelie1 @MrChuckD @HoustonRockets @nyknicks @VernonMaxwell11 @TheJetOnTNT Both but more so that 1st run!",
    "157": "@StyleBender v. @RobertWhittakerMMA II \nLarger than life, it's not just a fight for the undisputed @UFC Middleweight Championship, it's the battle for Down Under! 🤜🏆🤛\nAnd you can watch it live, Saturday February 12 in the house of @HoustonRockets  #UFC271 https://t.co/qTZ4OmyRaG",
    "158": "@HoustonRockets Rockets website design user survey 🚀❤️ https://t.co/ilaOUcXXYi",
    "159": "I had Lin knicks t shirt and Houston rockets jersey lmao https://t.co/02kw6Tx9tH",
    "160": "🚨 Line Change 🚨\n\nHouston Rockets @ San Antonio Spurs\nFri 8:40 PM EST\n\nFrom:\nSA -5.0 -105\n\nTo:\nSA -7.0 -105",
    "161": "Consensus Line Move:\n2022-02-04 Houston Rockets at San Antonio Spurs from 236.00 to 237.00\nOver track it\n#NBA #bettingonline #datascientist #trading",
    "162": "Consensus Line Move:\n2022-02-04 Houston Rockets at San Antonio Spurs from -5.00 to -6.50\n#PorVida never wait\n#NBA #soccer #coding #investing",
    "163": "@MrSkyWalker69 @CurryTakingOver @DrGuru_ Simply explain, when where the Houston Rockets up in the 2019 series and who was hurt in the 2019 series on the Rockets…simply tell me that…",
    "164": "🔴Live Basketball ~ Houston Rockets vs. San Antonio Spurs - NBA League | 2022 🏀💯\n🔗 🔴Watch Live Fullᴴᴰ 👉 : https://t.co/Z9070ejV7d ✅\n📆 :On Friday. February 04 /2022\n⏰ : 8:30 PM\nDONT FORGET TO SHARE AND FOLLOW FOR MORE INFO AND UPDATE.",
    "165": "Keita Bates-Diop @KBD_33 (conditioning) off the injury report for Fri's matchup vs the @HoustonRockets !\n\nSince the start of January, he's averaged 6.3 P and 4.8 R in 21.4 min.\n\n#CreamGetsTheMoney #nbaDFS\n\nhttps://t.co/LFLWJ6yZLz https://t.co/KUxbdshLXQ",
    "166": "The Houston Rockets P.J. Tucker had  to go to the bathroom during the game so he hit his juul.",
    "167": "@HoustonRockets See this kid hit that shot live...after all he had been through that week... simply amazing. I'll never forget it! @Kevinporterjr",
    "168": "@guywalters There's nothing to see already. You're late some 20 years. Since that Germany succesfully erased remanents of theirs unglorious history. More traces of nazi german rocket program You'll find in Houston's Johnson Space Center.",
    "169": "Charlotte Hornets - Cleveland Cavaliers\nSan Antonio Spurs - Houston Rockets\nDenver Nuggets - New Orleans Pelicans\n\nBet slip link: https://t.co/nxAK0MP714 https://t.co/oSAAIQ8Ftm",
    "170": "Spurs IR v Houston\n\nCacok out (gleague)\nLandale out (concussion protocol)\nWalker out (right knee soreness)\nWieskamp out (gleague) #porvida #nba75 #rockets",
    "171": "540 days later... Zach Collins will play NBA basketball again. \n\nCollins is OFF the injury report and will make his debut with the San Antonio Spurs against the Houston Rockets.",
    "172": "Houston Rockets: NBA Friday bets: +294 same game parlay for Rockets-Spurs https://t.co/EI7HPOKSxz",
    "173": "Ayo @HoustonRockets trade with my @Lakers for Bron https://t.co/KiOzbbt0ft",
    "174": "The San Antonio Spurs will host the Houston Rockets tonight. This will be the final home game before the Spurs start their annual Rodeo Road Trip. Here are five things to watch for in tonight's game. https://t.co/4oeepcNsg5",
    "175": "Feb 3 1995 - #ClydeDrexler records his 18K career point in @trailblazers 112-97 win over @Timberwolves.  Drexler finished game w/16 points &amp; 18,009 total points.  He would play 2 more games w/#Blazers before being traded to @HoustonRockets \n\n#RipCity #thisdateBlazersHistory https://t.co/nJHIcvgfSb",
    "176": "@MrChuckD @HoustonRockets @nyknicks @marioelie1 @VernonMaxwell11 @TheJetOnTNT Yes Yes Standing Ovation",
    "177": "NBA Friday bets: +294 same game parlay for Rockets-Spurs #Houston #Rockets #NBA https://t.co/7XgN6Hu6i2",
    "178": "@MrChuckD @HoustonRockets @nyknicks @marioelie1 @VernonMaxwell11 @TheJetOnTNT Much love Chuck.",
    "179": "@MrChuckD @HoustonRockets @nyknicks @marioelie1 @VernonMaxwell11 @TheJetOnTNT Respect ✊🏾",
    "180": "NBA Friday bets: +294 same game parlay for Rockets-Spurs\n\nWhen scanning the NBA board Friday, one game in particular seems to offer us significant betting value, that being the Houston Rockets and San Antonio Spurs. https://t.co/kR7OuQvnCN",
    "181": "\"But Morey and Co. weren’t prepared to place blind trust in their model; as an Asian American kid, Lin just didn’t pass the eye test. A year after Houston and every other team let Lin go undrafted, the Rockets began measuring the speed of a player’s first two steps ...",
    "182": "What's #Best on https://t.co/VfZu3jgOen ?\nGame Recap Vs Cavaliers : Houston Rockets\nhttps://t.co/CtzNoGYVBE\n#sports #houstonrockets #nba #nationalbasketballassociation #basketball #basketballhighlights #jamesharden #beard #houston #sports",
    "183": "Houston Rockets vs San Antonio Spurs NBA Pick and Prediction NBA Betting Tips 2/4/2022 https://t.co/vUcBVqn8jc via @YouTube #NBA #NBAPick #NBAPredictions #NBAOdds #Spurs #Rockets #GoSpursGo #SpursVsRockets",
    "184": "Courtesy of an investment by owner Tilman Fertitta, the Houston Rockets are now traveling to road games on a luxurious new plane. The excitement from players was quite visible on Thursday.  https://t.co/mtWQPlDMzW",
    "185": "@MrChuckD @HoustonRockets @nyknicks @marioelie1 @VernonMaxwell11 @TheJetOnTNT Couldn’t agree more. Those are the only Rockets uniforms as far as I’m concerned.",
    "186": "Detroit Pistons - Boston Celtics\nSan Antonio Spurs - Houston Rockets\nDenver Nuggets - New Orleans Pelicans\nPortland Trail Blazers - Oklahoma City Thunder\n\nBet slip link: https://t.co/AMELS3peci https://t.co/8FNmLYSeo9",
    "187": "Detroit Pistons - Boston Celtics\nSan Antonio Spurs - Houston Rockets\nDenver Nuggets - New Orleans Pelicans\nPortland Trail Blazers - Oklahoma City Thunder\n\nBet slip link: https://t.co/S2cTPBwBxa https://t.co/XQ33anEFl5",
    "188": "The Houston Rockets Trevor Ariza had a falling out with his uncle billy.",
    "189": "@MrChuckD @HoustonRockets @nyknicks Celtics, Rockets, Knicks, Lakers, Pistons, Bulls, Spurs...(GSW now too)\n[be like the yankees &amp; packers, don’t fuck with them jerseys] https://t.co/4woNlu9nTF",
    "190": "@MrChuckD @HoustonRockets @nyknicks @marioelie1 @VernonMaxwell11 @TheJetOnTNT @TilmanJFertitta Bring these back right now.",
    "191": "@HoustonRockets Nice",
    "192": "@MrChuckD @HoustonRockets @nyknicks @marioelie1 @VernonMaxwell11 @TheJetOnTNT Thank you for the H-Town love, legend! 🤘🏾",
    "193": "Need help deciding what to wear to @HoustonRockets vs @spurs tnite in San Antone 🤔\n\nHelp me out @RooshWilliams 🚀🚀\n\n#Houston #Rockets #htown #clutchcity #broussard https://t.co/38li34xey6",
    "194": "@MrChuckD @HoustonRockets @nyknicks @marioelie1 @VernonMaxwell11 @TheJetOnTNT Chuck D has spoken ! 🚀",
    "195": "@HaakonMusic @Gavan262 @BARNESSZN_ @IngramsMidrange @Raptors36578362 Yeah Giannis went crazy, but he still had better teammates than harden did in Houston and didn’t play as good teams. The bucks got lucky to beat the nets and the rockets got super unlucky not beating the warriors in 2018",
    "196": "Houston rockets 2023-2024 watch. We gone be in position to draft Bronny &amp; young core Fa Lebron to mold and ride his career out with https://t.co/fe3sIGJyTr",
    "197": "@NickScurfield Fan base won’t get fired up until they win that’s just typical Houston Fans it took the Astros a while but they are finally there and there to stay for a while hopefully the Rockets get back there since 94/95 Texans just never been there but our fans love football until now",
    "198": "The Houston Rockets James Harden had his gucci flip flops on during the first half.",
    "199": "It still BLOWS my mind that the @Lakers game plan against the @HoustonRockets 2 years ago when they played in the playoffs was to literally leave Westbrick wide open and just let him shoot and IT WORKED. Then 2 years later they want to trade for him!? @KingJames 🤡🤡",
    "200": "In honor of the passing of Houston Rockets head coach Bill Fitch I decided to go old school today…\n#Rockets #Sarge https://t.co/MipucAHP5L",
    "201": "@HoustonRockets i love that mf hes our future",
    "202": "@MrChuckD @HoustonRockets @nyknicks @marioelie1 @VernonMaxwell11 @TheJetOnTNT I have that back to back championship gear on today. LOL",
    "203": "@MikeDSykes Just last season when harden was out there bullshitting because he didn’t want to play with houston it was the rockets fault. But now with ben saying he don’t want to play with Philly so he choosing not play in games, it’s ben fault instead of Philly lol.",
    "204": "We Sending Them Rockets Like Houston… Yeah",
    "205": "Join us Thursday, Feb. 10th for a \"R\" Association Night Out at the @HoustonRockets vs @Raptors game, as we support two fellow letterwinners @MRScoachlacee, @RiceTFXC '08 &amp; @jdhtown, @RiceFootball '99 as their team's face-off. https://t.co/hHumdSisH9",
    "206": "RIP to a legendary coach who took the #Cavs from expansion team to the ECF in 6 seasons, guided the #Celtics to their 14th title (first in the Bird era), took the #HoustonRockets to the #NBAFinals and guided the #Nets and #LAClippers to the playoffs.  https://t.co/3DpcWf70AH",
    "207": "TIME'S RUNNING OUT FOR FREE TICKETS, Y'ALL!! 🚀🏀🔥\n\nInsiders! Deadline's 11:59am TODAY to get your entries in for your chance at @HoustonRockets tickets for Sunday's game vs the New Orleans Pelicans!\n\nIf you're not an Insider yet, it's free to sign up!\n\nhttps://t.co/in5nbsnYDU https://t.co/ZqB2jqYJAN",
    "208": "@MrChuckD @HoustonRockets @nyknicks @marioelie1 @VernonMaxwell11 @TheJetOnTNT 100% agree",
    "209": "@MrChuckD @HoustonRockets @nyknicks @marioelie1 @VernonMaxwell11 @TheJetOnTNT I agree. Great font. Yellow is sharp. Simple, clean.",
    "210": "@MrChuckD @HoustonRockets @nyknicks @marioelie1 @VernonMaxwell11 @TheJetOnTNT They should not have changed their jersey after the 2nd title to those hideous ones 😪",
    "211": "Rockets at Spurs: Prediction, point spread, odds, over/under, betting picks #Houston #Rockets #NBA https://t.co/uEGYfjGPkO",
    "212": "🏀 The Houston Rockets have struggled this season all around, but mostly on the road, posting a 7-20 away record. Tonight Christian Wood and the crew head to the AT&amp;T Center to take on the San Antonio Spurs. Can the Rockets get it together tonight?\nhttps://t.co/jv2qs8rGyE",
    "213": "@MrChuckD @HoustonRockets @nyknicks @marioelie1 @VernonMaxwell11 @TheJetOnTNT @GeraldR14805080, check this out!",
    "214": "@MrChuckD @HoustonRockets @nyknicks @marioelie1 @VernonMaxwell11 @TheJetOnTNT Respect",
    "215": "🚨 Line Change 🚨\n\nHouston Rockets @ San Antonio Spurs\nFri 8:40 PM EST\n\nFrom:\nSA -3.5 -110\n\nTo:\nSA -4.5 -110",
    "216": "NBA AI Analysis: Houston Rockets – San Antonio Spurs https://t.co/ZKZvDPY2rF",
    "217": "Consensus Line Move:\n2022-02-04 Houston Rockets at San Antonio Spurs from 234.50 to 236.50\nOver has books scared\n#NBA #espn #programmer #investor",
    "218": "Consensus Line Move:\n2022-02-04 Houston Rockets at San Antonio Spurs from -3.50 to -4.50\n#PorVida driving the market\n#NBA #gambling #ai #financialliteracy",
    "219": "@MrChuckD @VernonMaxwell11 @HoustonRockets @nyknicks @marioelie1 @TheJetOnTNT The ketchup and mustard unis were the best",
    "220": "@MrChuckD @HoustonRockets @nyknicks @marioelie1 @VernonMaxwell11 @TheJetOnTNT Og ! @MrChuckD and they think Desmond bane is tough Mad max was different",
    "221": "NBA Early Leans :\n\nUtah Jazz ML\nBoston Celtics -8.5\nIndiana Pacers +3.5\nHouston Rockets +4 \nNew Orleans Pelicans +6.5/ ML",
    "222": "NBA On Fire feat. Giannis Antetokounmpo, Anfernee Simons, Cade Cunningham &amp; The Atlanta Hawks #Houston #Rockets #NBA Video: https://t.co/tCd6zO7tE0",
    "223": "NBA ML. Date: 02-04\nHouston Rockets vs San Antonio Spurs. 1.36%\nFanDuel. Rockets @ +164\nBetMGM. Spurs @ -155\n#arbitrage #bettingtwitter #bettingpicks #sportsbets #freepicks #freemoney #mlb",
    "224": "The Houston Rockets Clint Capela had 5 broken backboards in 1 game.",
    "225": "GAMEDAY 🚀 Tonight we will be Taking on the San Antonio Spurs at 7:30 pm Central \n\n📺 AT&amp;T SportsNet Southwest, Bally Sports Southwest, NBA, NBA League Pass\n\n#Rockets @HoustonRockets @ATTSportsNetSW https://t.co/P4dDzOZuDN",
    "226": "Houston Rockets: Zach Collins could make his Spurs debut tonight against the Rockets https://t.co/fkp0xhMjXZ",
    "227": "AI-analys basket: Houston Rockets – San Antonio Spurs https://t.co/xnpMZTa59q",
    "228": "Future Houston Rocket!! https://t.co/XmcRhLjf2I",
    "229": "@HoustonRockets @abc13houston @GriselRwallace @lpisdFA One of my brilliant @HREHawks students has taken the @incredibox_ app that I introduced to all my classes &amp; is composing unique beatbox music. This one is dedicated to the Houston Rockets! Enjoy! https://t.co/TElfiS4CmQ",
    "230": "Stoked for this event tonight with @summitsompod. Love collabing with fellow @HoustonRockets fans. @TheDreamTake https://t.co/F6L4ttrKLa",
    "231": "@BeSomeone09 @marioelie1 @MrChuckD @HoustonRockets @nyknicks @VernonMaxwell11 @TheJetOnTNT Which one…?  🤔 Down 2-0 (1994 Clutch City emergence) or down 3-1 (1995 Chuck saying they won’t be back aka “Kiss of Death @marioelie1)   Just wow!",
    "232": "@MrChuckD @HoustonRockets @nyknicks @marioelie1 @VernonMaxwell11 @TheJetOnTNT Absolute truth! Start the movement back to the white Clutch City and ketchup &amp; mustard! 🤘",
    "233": "@eagle86rm371 @MrChuckD @HoustonRockets @nyknicks @VernonMaxwell11 @TheJetOnTNT TRUTH.",
    "234": "The @HoustonRockets play basketball tonight, and they will beat the @spurs tonight. BOOK IT. #GameDay",
    "235": "Opening Line: Houston Rockets (234.5) vs. San Antonio Spurs(-3.5) - Linemoves Since: (4) #Rockets #Spurs  Full odds at https://t.co/nUn5OcMhOI",
    "236": "Jalen Green, Christian Wood lead Rockets past Cavaliers\n\nHOUSTON (AP) — Christian Wood and rookie Jalen Green scored 21 points each and the Houston Rockets snapped an 11-game home skid with a 115-104 win over the Cleveland Cavaliers on Wednesday night.\n\n… https://t.co/9SVgFLhlIO",
    "237": "@marioelie1 @MrChuckD @HoustonRockets @nyknicks @VernonMaxwell11 @TheJetOnTNT I completely agree! I think that they should also bring back the old mustard and ketchup logo and I miss Turbo too!",
    "238": "The only teams in the @nba this season to play against the same opponent multiple times in the same arena for 2 straight games:\n\n@LAClippers, @SacramentoKings and @HoustonRockets (4 times) followed by the @Bucks, @dallasmavs and the @Timberwolves (3 times).\n\nIt is crazy, right?",
    "239": "NEVER been a fan of all these jersey varations. But when someone as prominent as @MrChuckD shares his thoughts, now I know it's a fact. This @HoustonRockets team is gritty. Time to dress them up as such. https://t.co/WMZNe9wQ83",
    "240": "@marioelie1 @MrChuckD @HoustonRockets @nyknicks @VernonMaxwell11 @TheJetOnTNT Totally agree it want the same once the ketchup and mustard went away",
    "241": "“That was a team win,” said Rockets forward Jae’Sean Tate about Houston’s win over the Cleveland Cavaliers. #Rockets #LightTheFuse #Sarge https://t.co/1EtzuRLZqY",
    "242": "@marioelie1 @MrChuckD @HoustonRockets @nyknicks @VernonMaxwell11 @TheJetOnTNT That Suns series is stuff of legend",
    "243": "The Houston Rockets Terik Black had a disco ball hung up in his locker.",
    "244": "Houston Rockets vs  San Antonio Spurs Prediction 2/4/22 - Free NBA Picks https://t.co/Dui9onwnYn via @YouTube \n\n#NBA #NBAPick #NBAPrediction #Basketball",
    "245": "@MrChuckD @VernonMaxwell11 @HoustonRockets @nyknicks @marioelie1 @TheJetOnTNT You ain’t telling any lies!!!!!",
    "246": "@MrChuckD @HoustonRockets @nyknicks @VernonMaxwell11 @TheJetOnTNT Preach Chuck. We have too many different uniforms. I love the Mustard and Red.✊🏿",
    "247": "It’s why those @HoustonRockets jerseys should NEVER change.. those Summit colors are like Yankee pinstripes. I’m a @nyknicks fan never the Rockets but respeck the H Town Hakeem @marioelie1 @VernonMaxwell11 @TheJetOnTNT etc Moses Cal Murphy. Ownership fkn w the BRAND of champions https://t.co/zJwHtzQAJu",
    "248": "Every day is a celebration of Black History and the fight for opportunity and equity.  Our thanks to the Houston Rockets for recognizing the Houston Area Urban League during the Rockets win over the Cleaveland Cavaliers on Wednesday, February 2nd! https://t.co/57g5han3J4",
    "249": "I was sad to hear of the passing of Hall of Fame hoop coach Bill Fitch - great memories listening to the \"Miracle at Richfield\" on 3WE in Cleveland when he was the Cavs' coach opposing the Bullets. He also coached @HHS_BlueStreaks product Ralph Sampson with the Houston Rockets.",
    "250": "@salcedo_dylan @Itamar_17_10 @HoustonRockets Right?! Can you just retire a rocket please?",
    "251": "@4Clevre Still got a ways to go to get to Houston, magic and pistons lol, but honestly magic and pistons and rockets just had a top pick last year, they don’t deserve another one",
    "252": "📰 Houston Rockets at San Antonio Spurs Predictions and Odds Feb 4!\n👉 https://t.co/IUfz2caKGE @sportsmemo",
    "253": "@Itamar_17_10 Dude is fuckin dog man, keep this man forever @HoustonRockets",
    "254": "🔴 Live▶ Houston Rockets vs. San Antonio Spurs - NBA League 2022\n🎟️🎥Live Streaming➠  https://t.co/TRmr2gEZUk\n📅 : Friday, February 04, 2022\n⏰ : 8:30 PM",
    "255": "New from Houston Chronicle — Rockets at Spurs: 5 things to watch https://t.co/84pQbkCpgO",
    "256": "@Rockets_Insider KPJ has flashed the potential of Harden, he’s just gotta keep grinding! Scoot is 21 and remember, beard arrived in Houston at 23",
    "257": "The Houston Rockets P.J. Tucker had a blind fold on during the game.",
    "258": "Lakers dismantled Rockets in Houston 122-101 \n\nLakeshow Big Three combined for 50 points\n\n30-5 https://t.co/pqgFe7aJtC",
    "259": "Bill Fitch won a NBA title in Boston and also led the Houston Rockets to the NBA Finals in 1986. https://t.co/8dibpLyTcH https://t.co/z7qqvsiDev",
    "260": "San Antonio Spurs vs Houston Rockets 2/4/22 Free NBA Pick and Prediction... https://t.co/tvuqGMogP6 via @YouTube",
    "261": "Houston - Home to the world-famous NASA Johnson Space Center and the Houston Space Center, you can get face-to-face with some iconic American spaceflight landmarks and artefacts, from the legendary Saturn V rocket\n\n#Houston #Space #NASA https://t.co/FdRmSTV4WJ",
    "262": "Mendelson Entertainment Honors the Late Lusia Harris https://t.co/iBx4YN4AuQ \n@TSUMensHoops     @mavericknewsp \n@AAU_Basketball      @HoustonRockets \n@FAMU_MBB             @Memphis_MBB \n@BamaStateMBB       @NewOrleansPeli1",
    "263": "The Houston Rockets Nene had his gucci flip flops on during the first half.",
    "264": "The Houston Rockets Zhou Qi had the Run DMC CD playing during the game.",
    "265": "@SportsMT @SportsTalk790 @HoustonRockets @UHCougars Even if Disco comes back and the \"John Travolta Channel\" begs you to be their DJ AND will let you wear platform shoes every day??",
    "266": "@Woa_Nick @MarioLavine @Ahmedmattoo1 @_JasonLT The Lakers don’t have Center that is a CORNER SHOOTER for floor spacing like the Houston Rockets P.J. Tucker. 😂😂😂 Traded Clint Capela to pacify Westbrook. Lakers pacify Lebron in Small-Ball Offense, not Westbrook.",
    "267": "The Houston Rockets Nene had two chains.",
    "268": "The Houston Rockets Trevor Ariza had 3 blind dates in the locker room at halftime.",
    "269": "Houston Rockets: Spurs take on the Rockets on 3-game skid https://t.co/iwfc7gw4Ae",
    "270": "Courtesy of an investment by owner Tilman Fertitta, the Houston Rockets are now traveling to road games on a luxurious new plane. The excitement from players was quite visible on Thursday.  https://t.co/4BMOsQZF1X",
    "271": "🏀#NBA ‼️\n1.Indiana Pacers Vs Chicago Bulls\n2.Detroit Pistons Vs Boston Celtics\n3.Charlotte Hornets Vs Cleveland Cavaliers\n4.Toronto Raptors Vs Atlanta Hawks\n5.San Antonio Spurs Vs Houston Rockets ...\n-------\n⭐️Free #livescore &amp; #livestream 👉https://t.co/z8cdc9BY9Y 😉 https://t.co/4gjGqB3zHl",
    "272": "The Houston Rockets Gerald Green had the Run DMC CD playing during the game.",
    "273": "Houston Rockets: Spurs’ Zach Collins could debut in matchup with Rockets https://t.co/O8CVwIb4AF",
    "274": "Houston Rockets (15-36, 15th in the Western Conference) vs. San Antonio Spurs (19-34, 12th in the Western Conference) https://t.co/moTcGx0kGh",
    "275": "Game Preview: San Antonio Spurs vs Houston Rockets https://t.co/6nyzKs0vZ2",
    "276": "NBA Basketball Game Betting Picks Simulator: 8:40 PM ET - Houston Rockets vs. San Antonio Spurs - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/zilOK3FmGJ #nba #sportsbetting #freepicks #cappertek",
    "277": "Game Preview: San Antonio Spurs vs. Houston Rockets https://t.co/mDa56vd6YL",
    "278": "The Houston Rockets Zhou Qi had a tripping call for tripping the mascot.",
    "279": "Spurs' Zach Collins could debut in matchup with Rockets #ZachCollins #NBA\n #spurs #GoSpursGo #HoustonRockets #Rocke https://t.co/8zTgdEXoab",
    "280": "NBA Basketball Game Betting Picks Simulator: 2/4/2022 8:40 PM ET - Houston Rockets vs. San Antonio Spurs - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/zilOK3FmGJ #nba #sportsbetting #freepicks #cappertek",
    "281": "Houston Rockets vs. San Antonio Spurs game preview, in which tonight features an All-Star snub and a potential return after a 16-month absence. https://t.co/pO3yWaMUSA",
    "282": "Houston Rockets vs. San Antonio Spurs game preview, in which tonight features an All-Star snub and a potential return after a 16-month absence https://t.co/cRYR9TN4rE",
    "283": "Day 25 of asking @JalenGreen how many likes for you to send me a signed jersey? 🐐 @HoustonRockets #RocketsTwitter",
    "284": "Day 46 of asking @alperennsengun how many likes for you to send me a signed jersey? 🐐 @HoustonRockets #RocketsTwitter",
    "285": "The Houston Rockets Eric Gordan had a twitterbot with no followers.",
    "286": "Ex…Excuse me?\n\nLose every game from here on out @HoustonRockets https://t.co/U5UAKSdB3z",
    "287": "Yeah I’m tryna hit the grizzlies vs rockets game if I slide to Houston …. Here for a good time not a long time 👻",
    "288": "steph owning the houston rockets and klay owning the sacramento kings &gt;&gt;&gt;&gt;&gt;",
    "289": "Basketball Hall of Famer Bill Fitch, who was head coach of the 1986 Western Conference champion Houston Rockets, has passed away at 89 years old.  https://t.co/SOFZxI38fb",
    "290": "The Houston Rockets Gerald Green had a twitterbot with no followers.",
    "291": "@NOHYPEJUSTBALL @BiasedHouston @HoustonRockets @KellyIkoNBA @JTGatlin @Rockets_Insider True",
    "292": "Fil-Am @HoustonRockets rookie @JalenGreen explains why he sees two-time MVP Steph Curry as a big brother and someone to learn from.\n\nPlay Yahoo Fantasy Basketball with your friends! 🏀 Join or create a league for free here: https://t.co/vT9GnybgAV\nhttps://t.co/mvBsgLL6y2",
    "293": "@tonysthunder31 I like that he’s bring back the step back middy fr shits money he did a little bit of it in Houston I remember he hit 2 step middys on the clips when he was on the rockets",
    "294": "Podcast @yardbeets &amp; I did celebrating the life &amp; career of Hakeem The Dream Olajuwon. GREATEST HOUSTON ROCKET OF ALL TIME\n\nhttps://t.co/jWEu4yFDw5\n\nLEGENDS OF SPORTS https://t.co/EIy6sVnn91\n\nhttps://t.co/8CdPyW47Mf",
    "295": "@BrooklynNets @JHarden13 Rockets fan here.....I don't know if Harden on the wrong side of his prime but he was beast mode for Houston.....he definitely ain't the same Beard for the Nets not even close.....he  not hooping like an allstar this year....plus he a reserve....he normally be a starter",
    "296": "Tate put Mobley in Rikers last night, just another notch on the belt of the best player on the Houston Rockets",
    "297": "Stephen Curry owns the Houston Rockets and Klay Thompson owns the Sacramento Kings 😍😎",
    "298": "The Houston Rockets Clint Capela had 3 blind dates in the locker room at halftime.",
    "299": "Rockets at Spurs: Lineups, injury reports, broadcast and stream info for Friday #Houston #Rockets #NBA https://t.co/z7okaQq1Ke",
    "300": "@HoustonRockets But your a rocket",
    "301": "still got my #25 Houston Rockets Chandler Parsons jersey 💯",
    "302": "@botskey Will head to that venue that’s hosting those games to watch @dougmcdermott and the @spurs take on the @HoustonRockets",
    "303": "For a third time in barely over three weeks, Houston and San Antonio will do battle on Friday. The road team won both of the first two games, which might benefit the visiting Rockets.  https://t.co/freAZkcl2P",
    "304": "@HoustonRockets @JalenGreen @Kevinporterjr It's Bigger than black n white",
    "305": "@HoustonRockets @JalenGreen @Kevinporterjr Look how happy they are about the new plane 🥶🥶🥶",
    "306": "RT CelebDeathAlert \"#RIPBillFitch, 89, American Hall of Fame basketball coach (Cleveland Cavaliers, Boston Celtics, Houston Rockets), NBA champion (1981)\"",
    "307": "@HoodieBev @BrooklynNets @warriors @ATLHawks @Timberwolves @nuggets @DetroitPistons @PelicansNBA @memgrizz @Suns @MiamiHEAT @Bucks @trailblazers @SacramentoKings @cavs @celtics @nyknicks @dallasmavs @HoustonRockets @utahjazz @okcthunder @OrlandoMagic @Raptors Got too many bigs already 🤷‍♂️",
    "308": "The Houston Rockets Trevor Ariza had the Run DMC CD playing during the game.",
    "309": "You hear that? @BrooklynNets @warriors @ATLHawks @Timberwolves @nuggets @DetroitPistons @PelicansNBA @memgrizz @Suns @MiamiHEAT @Bucks @trailblazers @SacramentoKings @cavs @celtics @nyknicks @dallasmavs @HoustonRockets @utahjazz @okcthunder @OrlandoMagic @Raptors https://t.co/4IEfx0C44M",
    "310": "In the 36 year stretch from the 1984-85 season to the 2019-20 season, the Houston Rockets had a total of 3 (THREE) losing seasons. Made the playoffs 27 times total. \n\nDo y’all ever think about maybe this franchise is overdue for a prolonged stretch of losing? And it might be rn?",
    "311": "HEAT at SPURS | FULL GAME HIGHLIGHTS | February 3, 2022 #Houston #Rockets #NBA Video: https://t.co/ZaclC0pjvi",
    "312": "#RIPBillFitch, 89, American Hall of Fame basketball coach (Cleveland Cavaliers, Boston Celtics, Houston Rockets), NBA champion (1981)",
    "313": "Is this clippers vs rockets game worth going to in Houston 🤔",
    "314": "@BiasedHouston @HoustonRockets @KellyIkoNBA @JTGatlin @Rockets_Insider @TexanVision Low Turnovers will equal WINS 🎉🎉🎉 #Rockets https://t.co/9PjURXP298",
    "315": "@sportscardwiza1 @Jidion6 @HoustonRockets What does yeat have to do with this?",
    "316": "@pologluvr1 @Jidion6 @HoustonRockets He got kicked out of a Houston rockets game because people were trying to take pictures with him",
    "317": "🏀 Feb. 3, 2006: Tracy McGrady scores 36 and combines with Yao Ming for 60 points as the Houston Rockets beat the SuperSonics, 100-77.\n📋 Box score: https://t.co/obTrKyXvaG https://t.co/ckxFkU2Oip",
    "318": "The Houston Rockets Ryan Anderson had a poptart warming up in his shoes.",
    "319": "The hustle never stops! @ChandlerParsons  #rockets fans would love to hear about your experience here in Houston https://t.co/QwtnGLTEiH",
    "320": "@Rocket_Man_Doug @scarflessdog @JoeHunt49617135 @elonmusk @GregWAutry This EV business has taken the world by storm. If it's not intended to be carbon neutral at some definitive time that possibly outstrips the time horizon of carbon output brought upon by the continued reliance on oil. Houston, we have a problem",
    "321": "@ChandlerParsons Did you ever miss playing with the houston rockets",
    "322": "@inthefastlaneed @NBAMathHoops @HoustonRockets I did this two in eight grade",
    "323": "Nike Aeroswift James Harden Red HOUSTON ROCKETS Men Authentic NBA Team JERSEY 52 https://t.co/NEHQ3HwJ6q eBay https://t.co/VR0WfeZpup",
    "324": "@FOXBetLive Houston rockets winning the nba championship",
    "325": "@raptors should call the @SacramentoKings about @Rich_Holmes22 and call @HoustonRockets about @Chriswood_5",
    "326": "@HoustonRockets can’t give up sengün under any circumstances He’s tough 😤",
    "327": "@JoelEmbiid @champssports Thats the @HoustonRockets for kicking @Jidion6 out the mix",
    "328": "The Houston Rockets Terik Black had a fan warm his seat up while he was playing.",
    "329": "Houston Rockets: Former Rockets coach Bill Fitch passes away at 89 https://t.co/6UKfZtC1Ze"
}