{
    "0": "Per @TheSteinLine the Houston #Rockets  would be open to trading John Wall for Russell Westbrook and also sufficient draft compensation. Thoughts on Russell Westbrook on coming back to Houston even though he’s in a slump? #LightTheFuse",
    "1": "Klay Thompson out for Friday night's game against Houston Rockets \n\nhttps://t.co/07Tdtp9JcC \n\nvia @mercnews https://t.co/Dwz0M9wLrK",
    "2": "The Houston Rockets Wild For Trying To Re-Aquire Westbrook…🤦🏾‍♂️",
    "3": "#NBA #NBATwitter Today's Lineups\n\n#Rockets\nHouston Rockets Starting 5:\nKevin Porter Jr.\nJalen Green \nEric Gordon\nJae'Sean Tate\nChristian Wood\n\n#DubNation\nGolden State Warriors Starting 5:\nStephen Curry\nJordan Poole\nAndrew Wiggins\nOtto Porter Jr.\nKevon Looney",
    "4": "Late Night Basketball SGP. Houston Rockets @ Golden State Warriors  \n\n#WolvesPicks🐺 \n#NBA \n#GamblingTwitter https://t.co/VEBZ7jKA57",
    "5": "@RexChapman @nyknicks I remember the @HoustonRockets beating them on the Finals",
    "6": "🚀 @TheofficialEG10 already said what-up to me 2 mins into warmups, I'm good - he's good. It's gonna be FUN @HoustonRockets",
    "7": "🏀WARRIORS v ROCKETS\n\nWiggins U4.5 rebs -130 (1u)\n\nHe’s under in 9 straight games with an average of 3.1 over that stretch, had 3 last time they played Houston",
    "8": "Happy RedNation Day!!!!! Geaux @HoustonRockets!!!!!🐻🏀🚀 #RocketsGameday #Rockets #NBATwitter #NBA #NBA75",
    "9": "Plz bros @HoustonRockets",
    "10": "@tedcruz @HoustonRockets Man I miss those mid 90's playoff battles with the Rockets. HBD Dream.",
    "11": "The @HoustonRockets starting Porter Jr., Green, Gordon, Tate, Wood on Friday. #Rockets50 #NBA",
    "12": "@tedcruz @HoustonRockets Ever watch Rafael play?\n\nhttps://t.co/oDiFBU9wtc",
    "13": "The Houston Rockets Nene had  to go to the bathroom during the game so he hit his juul.",
    "14": "@RitmoNba @HoustonRockets @Lakers Un Lose - Lose.",
    "15": "@levelstothis_2 Anywhere but the @HoustonRockets  please..",
    "16": "I'm at @ChaseCenter for @warriors @HoustonRockets in San Francisco, CA https://t.co/hC76fsq3nr",
    "17": "@redrocket95 @CoachKarl22 @marioelie1 @HoustonRockets Looks like your reading comprehension has got a long way to go too— I said “most skilled big,” NOT “big with the most championships.”\n\nBut if I remember right Dream didn’t win his first MVP or championship til year 10– so Jokic is doing ok here in year 7 😉",
    "18": "WOW REALLY RT @ComplexSports: Houston Rockets Reportedly Interested in John Wall for Russell Westbrook Trade\n\nMore: https://t.co/Pg7sJIlP6u",
    "19": "Moved back into the top 100 on the @HoustonRockets Leaderboard on @nbatopshot . #75 today after aquiring @JalenGreen this week.",
    "20": "@Jdon76 @TilmanJFertitta @PJFertitta @HoustonRockets @ToyotaCenter Olajuwon said he did not want a statue of himself because it would go against his Muslim faith",
    "21": "@HoustonRockets I smell a 30 burger by green tonight. Also a double double from Al-P",
    "22": "Give Wardell another one @HoustonRockets https://t.co/Oi0kOuiEw4",
    "23": "Houston Rockets +11 🤔",
    "24": "Tonight's starting lineup for the Houston Rockets: Porter Jr., Green, Gordon, Tate, Wood https://t.co/bVWH4AMCA2",
    "25": "Klay Thompson to sit out in second half of back-to-back against Houston Rockets https://t.co/LRApWLh6Bo",
    "26": "Houston Rockets Starters:\n\nKevin Porter\nJalen Green\nEric Gordon\nJae'Sean Tate\nChristian Wood\n\nPlayers out:\nJohn Wall\n#Rockets #NBA #NBATwitter #NBA75",
    "27": "Golden State's still one of the NBA's best teams at face value, with but without Draymond Green, it has been falling apart of late. @Covers_Ro sees why Houston can take advantage with our @houstonrockets vs. @warriors picks:\n\nhttps://t.co/kzdlHmHQDy",
    "28": "@HoustonRockets FB ADMIN 🐐",
    "29": "Tf the @HoustonRockets  gonna do with a 2027 1st round pick? Mfr that's 5 yyrs away",
    "30": "Houston Rockets Vs Golden State Warriors | Live Reactions And Play By Play https://t.co/0Kw4sQN2Pi via @YouTube",
    "31": "Klay Thompson to sit out in second half of back-to-back against Houston Rockets https://t.co/PRhyyyRCuQ",
    "32": "Klay Thompson to sit out in second half of back-to-back against Houston Rockets https://t.co/5b5QVaKb47",
    "33": "@a_duckett @BigSargeSportz Honestly if the Lakers send Houston a FRP to take Russ, and the Rockets then flip Russ to another team for draft capital, Stone will have worked some wizardry out of the ashes of Daryl Morey’s Harden / Westbrook / CP3 mess.",
    "34": "@colecaodeadao @fernandolopo @HoustonRockets Monstro.",
    "35": "Titles shouldn’t mean much. But truthfully, T-Mac wasn’t healthy when it came time for Houston to go on playoff runs. That and early exits. Had the Rockets added a third star like a Dirk or a KG, then we’re talking a title. https://t.co/weOVTkGnmX",
    "36": "@Y2Kosich @HoustonRockets @Hoferadollar Only one day after a legend",
    "37": "ALERT: New high roller bet posted!\nA bet has been placed for $9,978.15 on Golden State Warriors - Houston Rockets to win $11,375.09.\nTo view this bet or copy it https://t.co/oaGiN67gVr https://t.co/vWSFadGjSq",
    "38": "NBA LIVE TODAY🔴 Houston Rockets vs Golden State Warriors - 21st January ... https://t.co/iI4cT9Qk9i",
    "39": "[LIVE] 2022 NBA Basketball Golden State Warriors vs Houston Rockets https://t.co/k56Yb57hLO via @YouTube",
    "40": "How much the @nba paying the @HoustonRockets to trade for Westbrook just to help @kingjames",
    "41": "[LIVE] 2022 NBA Basketball Golden State Warriors vs Houston Rockets https://t.co/7sHXeJvxt8 via @YouTube",
    "42": "@HoustonRockets Goat center 🐐🐐",
    "43": "If the Rockets trade for Russell Westbrook, here’s what he would look like in a Houston jersey: https://t.co/gBAIA1E0i5",
    "44": "@marioelie1 @HoustonRockets Unbeatable!",
    "45": "Warriors: Houston #Rockets at Golden State #Warriors odds, picks and prediction - USA TODAY Sportsbook Wire https://t.co/QGKUJl9BEU",
    "46": "@wash77033 @d2derrick @rocktredblood @MorpheusDeZion @abbyeddymom @cdhthegreat @SammyDpsi @IamWendums @SportsDean @mikecanjerk Yes. They send that to Houston along with Russ, for Wall. Rockets buy out Russ and keep the pick. Easy peasy.",
    "47": "@MavriqGG @LegionHoops @TheSteinLine I dont care if its the Houston Rockets, A spaceX Rocket, or a hot pocket, please send Russ somewhere. Im done with his shenanigans.",
    "48": "@tedcruz @HoustonRockets Grew up a rockets fan and now you have ruined them too.",
    "49": "@Complex then the @HoustonRockets need to also sign a Ringling Barnum and Bailey contract and t.v. deal cause it will definitely be a circus at the Toyota Center!",
    "50": "@HoustonRockets @dnwaba0 That B.G Choppa city shirt is too fucking clean bro wtf...",
    "51": "#Rockets have covered the spread in 4 of their last 5 road games when facing the Western Conference. Houston has been given a 52.4% chance to cover a +10-point spread against #DubNation \n\n#NBA #NBATwitter",
    "52": "@marioelie1 @HoustonRockets LEGENDS! #HTownLove",
    "53": "New #Rockets from Houston Chronicle — Jalen Green vs. Jonathan Kuminga: a reunion for rising rookies https://t.co/qYSe2zHnLT",
    "54": "The Houston Rockets Eric Gordan had the Run DMC CD playing during the game.",
    "55": "Pull up. Social Beer Garden (3101 San Jacinto St 77004) for the free @houstonrockets watch party vs Golden State! Plenty of prizes and good vibes. #RadioBoss #Kiotti https://t.co/zJ0SG9w7D2",
    "56": "@KarinAbcarians @a_duckett Nice to see the beta rockets Twitter gets some good press. They are so tarnished by their sucking the Jesus dick of Cal and Jack that they think they have a good reputation in Houston sports. I magazine thinking Jack and Cal are better than @StephStradley and @adamclanton.",
    "57": "Tonight from San Francisco!\n#Rockets at @warriors \n\nHere are @CalvinMurphyHOF keys to the game presented by @Toyota \n\nCoverage begins at 8:30 on AT&amp;T SportsNet\n\n@HoustonRockets \n#toyotausa\nhttps://t.co/HOTx8nYDuC https://t.co/vYkEw4Imnh",
    "58": "@tedcruz @HoustonRockets He doesn’t like you either",
    "59": "The lakers play the rockets in Houston on March 9th.\nAnd I will be there at Toyota Center.",
    "60": "Houston Rockets vs. Golden State Warriors - NBA League 2022\n📺📱Watch Live➠  https://t.co/xkLPo2YQZ6\n📅 : Friday, January 21, 2022\n⏰ : 10:00 PM",
    "61": "FRIDAY NIGHT ARENA LIGHTS!!\n\n@cayleighgriffin previews tonight’s game between the @HoustonRockets &amp; the @warriors in our Midday Minute presented by @memorialhermann \n\nJoin us for #Rockets Pregame at 8:30\n\n#MemorialHermann https://t.co/NtRUykGHAW",
    "62": "Golden State Warriors vs Houston Rockets Live Stream - NBA 2022\nWatch : https://t.co/T0XeOlriuC\n\nVenue: Chase Center (San Francisco)\n#Warriors #Rockets #NBAAllStar #Livestream https://t.co/fCHKUT8zMj",
    "63": "Houston Rockets: NBA Rumors: Houston Rockets:  Are Reportedly Open To Trading For Russell Westbrook https://t.co/efvNH2Xkmt",
    "64": "@tedcruz @HoustonRockets He hates you. Everyone hates you.",
    "65": "@Y2Kosich @HoustonRockets How did we not know this",
    "66": "ANNOUNCE @HoustonRockets https://t.co/cCwaGIwKqW",
    "67": "NBA Rumors: Houston Rockets and Los Lakers to Swap Russell Westbrook for John Wall @nblindberg  https://t.co/TPcN6aT3AV",
    "68": "@CoolyRoc_ Bro you cannot judge him off of that dude how if the nigga was tired like God damn chill man lol he balled last yr for the dumpster Rockets he'll be aight he just needs to GTFO of Houston lol",
    "69": "@tedcruz @HoustonRockets Are they Americans?",
    "70": "👍 on @YouTube: BREAKING NEWS! HOUSTON ROCKETS MAY TRADE JOHN WALL FOR RUSSELL WESTBROOK! https://t.co/RxlGwBca2Z",
    "71": "Pull the trigger @HoustonRockets.",
    "72": "@marioelie1 @HoustonRockets The Dream!",
    "73": "#Houston! 🚀 Don’t miss The Rocket Man himself, #EltonJohn, TOMORROW night for a second and final show at Toyota Center! 🎫 tickets are available here👇👇👇 \nhttps://t.co/kkyEhtBP4v https://t.co/DK6fQV0IcT",
    "74": "@PBAinsider @Lakers @HoustonRockets They offered tht kendric nun and the 2027 1st round pick for jermi grant",
    "75": "Okay, shake it off. Let's get out half unit back plus more\n\nLets go Hunting\n\nMichigan St +3 \n\nHouston Rockets +4.5 1q\n\nRockets have cover the 1q as dogs in 5 striaght, I look for them to continue that against the warriors team that lost to the Pacers last night. https://t.co/JfYbi6iW9n",
    "76": "@PBAinsider @Lakers @HoustonRockets At this point I'll trade him for @ISKATI_06 will make the Lakers a lot better",
    "77": "The Houston Rockets love bad contracts",
    "78": "NBA Rumors: Houston Rockets Are Reportedly Open To Trading For Russell Westbrook – https://t.co/XaHkAM13qu",
    "79": "The @Lakers adding draft capital just to dump Russell Westbrook back to the @HoustonRockets in a potential trade for John Wall would be hilarious.",
    "80": "@HoustonRockets please don’t, I rather miss the playoffs than have westbrick back",
    "81": "@tedcruz @All100Senators @HoustonRockets Greatest rocket of all time... that's what you call Trump's weenis.",
    "82": "@tedcruz @HoustonRockets Shhh, don’t tell your boss they are Americans.",
    "83": "@HoustonRockets I will name my next kid Houston Rocket Small if you trade for him. https://t.co/4ye9mn2mDx",
    "84": "@HoustonRockets leave Westbrook where he is lol we don't want that .",
    "85": "Consensus Line Move:\n2022-01-21 Houston Rockets at Golden State Warriors from 229.00 to 230.00\nOver squares...?\n#NBA #bettingadvice #coder #stocks",
    "86": "🚨GAMEDAY! The Golden State Warriors will face off the Houston Rockets in Houston. Who y’all got?👀",
    "87": "@ClutchPointsApp @TheSteinLine No, please @HoustonRockets don't do this",
    "88": "@Luka_Donut @TheHoopCentral Wall is not washed. The only reason John Wall is not playing is because the @HoustonRockets are trying to lose games on purpose",
    "89": "@i_Am_Magnolia @HoustonRockets They gave up two first round picks and two pick swaps to get https://t.co/J9cDXsEtBP got one back for swapping Westbrook for Wall.If Rafael Stone gets them picks back by swapping Westbrook and Wall again that would be God Level GM type shit",
    "90": "The Houston Rockets Trevor Ariza had a slip and slide free throw contest.",
    "91": "Houston Rockets on Twitter: \"Scary Garry was on fire! https://t.co/BdkpQ1F5WY\" / Twitter - https://t.co/k8FOeb2dxF #GoogleAlerts",
    "92": "New post (Houston Rockets vs. Golden State Warriors Pick - NBA January 21, 2022) has been published on The Sports Geek - https://t.co/TCN3y4xi4a https://t.co/7c6nZdY1YP",
    "93": "@NBAHistory I believe that @HoustonRockets wouldn't have won two championships if MJ didn't retire.",
    "94": "@issabetjerry @HoustonRockets Fam I’m locking John up if that 11 second mark is all he got 😂",
    "95": "@LitLikeChris @Lakers @HoustonRockets Lmaooo wall is a better 3rd option rn 100%",
    "96": "@GloMmt @Lakers @HoustonRockets Lol lakers better stay far away from that trade",
    "97": "👀👀👀 give us wall and Matthews we got 2 second rounders &amp; Russ @Lakers @HoustonRockets https://t.co/p8QrAsoMpm",
    "98": "@FrederikGnatt Houston Rockets takker ja😁",
    "99": "And we’re interested in this clown @HoustonRockets? End these nonsense rumors. https://t.co/zKSiGmFUY8",
    "100": "@tedcruz @HoustonRockets Mitch says they are not Americans https://t.co/gZrgKKpM8m",
    "101": "On behalf of the Houston Rockets, the answer is FUCK NO https://t.co/kLjoVmMK6C",
    "102": "@JaniceDean Did you work at 97Rock in Houston?  You used to do my traffic reports when I was a producer for KPRC/KSEV Clear Channel in Houston in the 90s. I remember Hannah storm used to work at 97Rock when she was doing the Houston Rockets studio shows.",
    "103": "Houston Rockets vs. Golden State Warriors | USA: NBA\nThe match will start at 10:00 PM, January 21, 2022\nVenue: Chase Center (San Francisco)\n🔴 Link for this Match 👉 https://t.co/dWAshmqwTK\nLet's watch live online, Thank you https://t.co/lfsVlO0XKt",
    "104": "john wall to @Lakers ??? when is the last time hes played??? @HoustonRockets are down to get @russwest44 back??? hmmm",
    "105": "@tedcruz @HoustonRockets They, like most of America, hate you.",
    "106": "@HoustonRockets @leothegreat080 Blessed to have been able to watch the GOAT play in Houston 🚀 Game 6 of the NBA Finals vs the Knicks is still the greatest Rockets games I’ve ever had the pleasure to attend.",
    "107": "Houston Rockets Reportedly Interested in John Wall for Russell Westbrook Trade\n\nMore: https://t.co/Qz1edVTftb",
    "108": "@marioelie1 @HoustonRockets H-town Legends! You all put us on the map!",
    "109": "🔴Live ~ Houston Rockets vs. Golden State Warriors - NBA League  2022 💯\n📅 : 21 January, 2022📌\n⏰: 10:00 PM📌\n▼F̾oͦl̾l̾oͦw▼ 🔗Link 🌐 ⭆ https://t.co/EQDGajbb7c✅",
    "110": "@susan1234456789 Still got your Houston Rockets Westbrook jersey? 😂",
    "111": "@geauxleafsgeaux @tedcruz @HoustonRockets Don't forget the pocket rocket too!",
    "112": "Back GOLDEN STATE WARRIORS to BEAT Houston Rockets tonight in the @NBA (Game Starts at 03.10 GMT) #NBA #Basketball",
    "113": "Best @HoustonRockets player of all time. Happy birthday, Dream 🏀 https://t.co/K0RqDQnXIx",
    "114": "@nba is trash 🗑. Bought tickets on 12/11/21 for @sixers vs. @HoustonRockets for 1/24/22 so 6yr old son could see @JoelEmbiid just to learn today that it was played on 1/10/22. Thanks. Guess we'll wait till next year if we're lucky.  Enjoy the donation @NBA 🗑.",
    "115": "@VernonMaxwell11 @HoustonRockets @ATTSportsNetSW @utahjazz Mad Max and Starks is like gasoline and matches 😅",
    "116": "We're in the spirit and ready for The Rocket Man to be in downtown Houston this weekend! 🤩  Come get your pre-concert fuel 🍹 🌮 https://t.co/A0ZyZMeyiq",
    "117": "@RoundRockTim @marioelie1 @HoustonRockets Couple of legends!!!\n\nThanks for the magic, gents!!!",
    "118": "@Zacharybrown832 @HPbasketball You’re aware of who owns the Houston Rockets, right?",
    "119": "TedCruz: Greatest Rocket of all time. \n\nHappy birthday, Dream!\n\n@HoustonRockets https://t.co/HBJItpvmJj #conservative",
    "120": "@tedcruz @HoustonRockets Greatest two way player of all time, too",
    "121": "@HoustonRockets The greatest!!!",
    "122": "The Houston Rockets Trevor Ariza had 5 broken backboards in 1 game.",
    "123": "After watching that clip of washed John Wall ima need 2 FRPs up off ya @HoustonRockets",
    "124": "Tonight the Warriors host the Rockets -- and Houston reportedly could be interested in a Russell Westbrook reunion 👀\n\nhttps://t.co/QRrx1OFafh",
    "125": "Why should the #rockets help the #lakeshow?  Westbrook came out and said he didnt want to play for them no more 18 months ago, what changed? It’s not Houston’s fault LA went all in on old assed players!",
    "126": "@JeanieBuss @HoustonRockets \n@PelicansNBA @russwest44 @JohnWall @Devonte4Graham \nHow about this propose trade offer?\n1.NOP gets Westbrook&amp;Kevin Porter Jr \n2.LAL gets Wall&amp;K-Mart Jr. \n3.HOU gets Graham,Josh Hart,Tomas&amp;Troy Murphy&amp;LAL 2nd rd picks\n\n https://t.co/zkWn2N8ecl #Fanspo",
    "127": "Aye @HoustonRockets play John wall tonight. I wanna see how much slower that tween tween crossover is in a nba game",
    "128": "@TitanOilers Back Off this is the Dream Houston through and Through not Tennessee. Bud let you have a piece of my Oilers but not my Rockets.",
    "129": "Houston Rockets win the tip at a 70% clip hmmmmm 🧐🧐🧐🤔🤔🤔 https://t.co/1cUbA4HrnQ",
    "130": "@tedcruz @HoustonRockets You were a participant with prior knowledge according to Navarro.  You did your job “beautifully”. DOJ must prosecute all coup plotters  https://t.co/eEX3dqkzA5",
    "131": "If you ask any Houston Rockets fan, they will (or should) tell you that John Wall was terrible last season in all facets of the game.\n\nThis idea that he is the same guard as he was pre-injury is false.\n\nAnd no, he didn't play any defense and didn't blow by anyone easily.",
    "132": "@mrjjoyner @JeanieBuss @PelicansNBA @HoustonRockets @russwest44 @JohnWall @Devonte4Graham @joshhart How cheap is the crack?",
    "133": "[LIVE] 2022 NBA Basketball Golden State Warriors vs Houston Rockets | [Stream Now] : https://t.co/oCtmd9EQZr | Date : 21-Jan-22 | 22:00 | NBA | Basketball | Golden State Warriors | Houston Rockets | Houston Rockets vs Golden State Warriors NBA Basketball [LIVE] 2022 https://t.co/svvjqcZAX8",
    "134": "@HoustonRockets y’all better fucking not https://t.co/2sgHsLKlAt",
    "135": "🔴[LIVE'STREAM] ~ Houston Rockets vs Golden State Warriors - NBA League 2022\n🔴Broadcast Link !! https://t.co/Ghy2GSCuhL ✅\nDate : On Friday. January 21 /2022\nTime : 10:00 PM",
    "136": "@ashleydeadassb @HoustonRockets Ashley, pick a player. Not the entire franchise. Gotta play to win here.",
    "137": "@SCompoccia @marioelie1 @HoustonRockets Facts!",
    "138": "@kenley_mck @Trevor_Lane It's a good deal for both of them. Russ might not even want to play for Houston, if he gets bought out Rockets save tons of money.",
    "139": "@marioelie1 @HoustonRockets 2 of my favorite Rockets players ever in this photo.",
    "140": "@tedcruz @HoustonRockets Oh the irony ... https://t.co/2WIXyidGTI",
    "141": "@tedcruz @HoustonRockets Now he wouldn't bail to Cancun when his team needed it... Nor would he self-flagellate himself on Tucker Carlson show. \n\nNow sit down Raphael",
    "142": "@tedcruz @HoustonRockets Is he an American?",
    "143": "The Houston Rockets if the Westbrook-Wall actually goes through https://t.co/44YYv662S3",
    "144": "“Lakers have agreed to trade Russell Westbrook to the Houston Rockets for John Wall and a first-round pick, sources tell ESPN” https://t.co/32PCWt16gl",
    "145": "@tedcruz @HoustonRockets The greatest Rocket of all time was Rocket Richard.",
    "146": "@b_marderosian @marioelie1 @HoustonRockets One of the very best centers of all-time and probably the most uniquely talented of them all.",
    "147": "I meeeeeeaaaaannnnn, no. Why cant we just play John Wall @HoustonRockets https://t.co/Qvv4xcUda5",
    "148": "Houston Rockets GM must be down horrendous. https://t.co/YIQPutu0HZ",
    "149": "@tedcruz @HoustonRockets Ted, which one is Dream?",
    "150": "How did the absence of Donovan Mitchell affect the Utah Jazz in the loss to the Houston Rockets? #TakeNote #NBA #UtahJazz https://t.co/KLlHyjMfoT",
    "151": "I’ll take it ATP RT @Complex: Houston Rockets says they would consider a Russell Westbrook for John Wall trade 👀\n\nDETAILS: https://t.co/5WlTRs5GT8 https://t.co/rCxWjUkgUg",
    "152": "Houston Rockets says they would consider a Russell Westbrook for John Wall trade 👀\n\nDETAILS: https://t.co/VeICt00ZNZ https://t.co/OIQPeGInwz",
    "153": "@tedcruz @HoustonRockets Don’t…just don’t. https://t.co/RSuWlLO2jH",
    "154": "@tedcruz @HoustonRockets Ted? I thought you were pissed at the NBA over China? \n\nMake up your twisted mind, okay?",
    "155": "@tedcruz @HoustonRockets You're going to prison for inciting insurrection on camera.",
    "156": "@DWaibs @tedcruz @HoustonRockets Projecting hate is a losing strategy, and won't accomplish what you think it will.",
    "157": "@tedcruz @HoustonRockets Look Ted... More Americans!!!",
    "158": "@HoustonRockets @ATTSportsNetSW @SportsTalk790 Oh god lets us win",
    "159": "@HoustonRockets @ATTSportsNetSW @SportsTalk790 Please win",
    "160": "Gray unis for the Bonnies on ESPN2 tonight. The Houston Rockets are expected to send a scout to the game. https://t.co/2JBvHTePp7",
    "161": "Report: The Houston Rockets are interested in trading John Wall for Russell Westbrook 👀 \nhttps://t.co/nVrEnGbM7s",
    "162": "Greatest Rocket of all time. \n\nHappy birthday, Dream!\n\n@HoustonRockets https://t.co/DNVNFMCx1l",
    "163": "@SamQuinnCBS @JTGatlin Except Houston isn’t the team with championship aspirations and wasting a season of LeBron’s greatness. That’s a far greater opportunity loss than Rockets just sticking w/the status quo.",
    "164": "Bro, if the Golden State Warriors don’t beat the Houston Rockets tonight I’m losing faith in them",
    "165": "The Houston Rockets Eric Gordan had a six pack of budlight for breakfast on game day.",
    "166": "@BraddeauxNBA 💪🏾💪🏾💪🏾🚀🏀🤘🏾 hope you like it bro🔥 @HoustonRockets https://t.co/mEtzDEhig8",
    "167": "Happy Birthday to who is by far the best and greatest Houston Rockets player of all time, a top 10 player of all time and a top 3 center of all time Hakeem Olajuwon 🐐🐐🐐 https://t.co/LdWMbGQWcw",
    "168": "Golden State Warriors Predictions and Preview for 1/21/2022 hosts Houston Rockets.  Looking for betting action?  Find out if there is any value in our preview. #GamblingTwitter #NBA https://t.co/DdwdC0VUuO",
    "169": "@joydeangela Okay question joy.. I’m a Rocket fan and I don’t wanna sit Russ he gotta be somewhere playing if he goes back to Houston and sits the rest of the season? What options and contract outside of walls contract",
    "170": "Still keep a rocket idc if I’m in Houston",
    "171": "@DaKidGowie hope you like it Bro🤘🏾 and much love reppin the squad @HoustonRockets 🚀🏀🤘🏾 https://t.co/97RX2Jl1nN",
    "172": "Golden State Warriors Predictions and Preview for 1/21/2022 hosts Houston Rockets.  Find out who we are taking in this matchup. #GamblingTwitter #NBA https://t.co/DdwdC0VUuO",
    "173": "@HoustonRockets Truly the GOAT.",
    "174": "@PBSImpulse9 @ESPNFrankie @HoustonRockets One time for Teej!",
    "175": "John Wall fits better with @KingJames and the @Lakers and we know that the @HoustonRockets won't let Russ destroy the franchise.... @MagicJohnson start making calls....",
    "176": "Rodrick Rhodes at a @celtics @HoustonRockets game https://t.co/mpk3Yw6t4M",
    "177": "Houston Rockets vs. Golden State Warriors game preview https://t.co/6Jd4ZNkDxS via @DreamShakeSBN",
    "178": "The Rockets take on the Warriors tonight! Coverage begins at 8:30pm!\n\n@HoustonRockets | #Rockets https://t.co/dN6VmMFw2r",
    "179": "@marioelie1 @HoustonRockets You two look great.. sure enjoyed watching y’all play",
    "180": "Houston Rockets reportedly interested in Lakers’ Russell Westbrook under one condition #HoustonRockets #LosAngelesLakers #RussellWestbrook https://t.co/pK67o95EQ0",
    "181": "@TheNBACentral @TheSteinLine @HoustonRockets down tremendous",
    "182": "GAME DAY!\n\n🆚️ Houston Rockets \n⏰ 00h\n📍 Chase Center\n📺 NBA League Pass\n\n#DubNation https://t.co/GkosHkitbp",
    "183": "@tonysthunder31 @Devon2481 Russ clearly wasn’t the same guy in Houston lol. If he was that rockets team would’ve killed everyone since he was paired with literal peak harden.",
    "184": "NBA:\nPortland Trail Blazers Alta  212 -110 [1]\nPortland Trail Blazers +8.5 -110 [1]\nOklahoma City Thunder Over 224 -110 [3] MAX \nSan Antonio Spurs -1 -110 [1]\nHouston Rockets Alta  229 -110 [3] MAX",
    "185": "@HoustonRockets @brianmctaggart Happy birthday Hakeem!",
    "186": "@anxiolitiko @HoustonRockets Hey 20 millones",
    "187": "@HoustonRockets @Hoferadollar the Dream and Detlef forever joined by day of birth",
    "188": "@ArtOfNova_ Free my boy you clowns @HoustonRockets",
    "189": "New #Rockets from Houston Chronicle — How the Rockets spent their day in San Francisco https://t.co/xagFNqThGH",
    "190": "The Los Angeles Lakers/ Houston Rockets trading Russell Westbrook for John Wall.....🙄🙄🙄🙄🙄#LakeShow #LeBronJames  #NBAAllStar https://t.co/wTgT25pok6",
    "191": "Not that surprising. Houston can get a first round pick for him, buy him out to create cap space, and still let the youngsters play. It's kinda win-win-win for the Rockets (other than Tilman's pocketbook). https://t.co/srk8LZBadO",
    "192": "@ed3___ @HoustonRockets yessir facts 🔥",
    "193": "@ATTSportsNetSW @HoustonRockets What time??",
    "194": "NBA RUMOR REPORT 🚨🚨🚨 the @HoustonRockets are interested in trading for @russwest44. In return they are interested in sending @JohnWall to the @Lakers. Also keep in mind that Wall is part of the @KlutchSports roster. @RichPaul4 is @JohnWall’s agent. @FortyEightMins https://t.co/axeet5Xvfi",
    "195": "@WallzGoat @HoustonRockets would love to see JW there 👀\n\nand watching russ in houston was great",
    "196": "The Houston Rockets reportedly would be interested in trading for Los Angeles Lakers guard Russell Westbrook under one condition.  https://t.co/bLFaeLTDAt",
    "197": "NBA Basketball Game Betting Picks Simulator: 10:10 PM ET - Houston Rockets vs. Golden State Warriors - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/Y2jH4z2n8U #nba #sportsbetting #freepicks #cappertek",
    "198": "@PBSImpulse9 @HoustonRockets Damn shame Houston is near poverty levels",
    "199": "@marioelie1 @HoustonRockets Dude was one of the best I’ve ever seen. Footwork. Position. Skill.",
    "200": "@HoustonRockets Happy birthday",
    "201": "russ to @HoustonRockets ? @WallzGoat what’s going on",
    "202": "@marioelie1 @HoustonRockets Happy birthday Hakeem",
    "203": "HOUSTON ROCKETS vs\nGOLDEN STATE WARRIORS, 11:00PM.",
    "204": "@LakersSBN @TasiaMRios @TheSteinLine HOUSTON ROCKETS - WELL TAKE RUSS FOR WALL &amp; PICKS.\n\n🤣ROB PELINKA GETTING BACK TO THE OFFICE🤣 - https://t.co/7kdBuijaoA",
    "205": "Houston Rockets: Report: Rockets would accept Russell Westbrook for John Wall trade... if Lakers attached\u0085 https://t.co/nGCOWXn7kH",
    "206": "This will probably be last piece focusing on trade rumors and reports until the deadline or if a deal goes down, but today I took a look on how the Houston Rockets could help facilitate a Ben Simmons to Sacramento deal. \n\nhttps://t.co/e5HtX405KZ",
    "207": "@HoustonRockets Glad to realize that i am sharing birth date with a legend! 😎Happy Birthday Hakeem…!",
    "208": "@SamQuinnCBS @RedNinetyFour But your first tweet posed a statement that sounded like LA has a choice in what they give the Rockets. That's the issue.  Houston isn't desperate to trade Wall.  Lakers would be desperate to trade Russ.  If the Rockets want a 1st round or Tucker, LA has no choice",
    "209": "HOUSTON ROCKETS - WELL TAKE RUSS FOR WALL &amp; PICKS.\n\n🤣ROB PELINKA GETTING BACK TO THE OFFICE🤣 - https://t.co/jbQug11YD0",
    "210": "The Houston Rockets and Los Angeles Lakers after getting off the phone discussing a John Wall for Russell Westbrook trade: https://t.co/a8LGFWP7ns https://t.co/QupekzLvgb",
    "211": "@SamQuinnCBS @RedNinetyFour Best case scenario: Rockets get a couple 2nds. Russ agrees to an historic buyout.\n\nOk scenario: Russ agrees to sit just like Wall. Money comes off the books in 2 years.\n\nBad scenario: Russ refuses buyout. Things get really messy and all Houston has to show for it are 2 seconds.",
    "212": "Don’t let the Lakers off the hook @HoustonRockets https://t.co/LzG1IiQDLi",
    "213": "Warriors: Houston #Rockets vs Golden State #Warriors: Injury Report, Predicted Lineups and Starting 5s https://t.co/jmmdZS8jLo",
    "214": "O Houston Rockets demonstrou interesse em trocar John Wall por Russel Westbrook + picks de draft\n\nVia @TheSteinLine https://t.co/S6TyWlWXax",
    "215": "The Houston Rockets James Harden had a poptart warming up in his shoes.",
    "216": "@PBSImpulse9 @HoustonRockets Make it happen @Lakers",
    "217": "@HoustonRockets @JalenGreen @Jaygup23 Y’all should do a segment where everyone tells the story behind their tats. Would be super interesting!",
    "218": "Lmaooooo I knew I always liked y’all @HoustonRockets https://t.co/F37EJCrl87",
    "219": "@CaitCamelia @spicypickledpea Damn you have more spam calls today than the Houston Rockets have wins!",
    "220": "SVOLTA\nI have been advised that I should amend my previous characterization of the Lakers’ finding a Westbrook trade from outright impossible to extremely unlikely. There is one team out there that would take him, if the conditions are right. That team, is the Houston Rockets.",
    "221": "@marioelie1 @HoustonRockets Happy Birthday Hakeem Olajuwon!🐐🏀",
    "222": "Trade Brodie BACK to Houston ?? Rockets on some other stuff https://t.co/G8d9MvRYWw",
    "223": "NBA Play:🏀✨\n\n1️⃣Rockets +11 (-110)\n\n-Houston is 4-1 ATS in its last 5 games on the road\n\nWarriors are on the second night of a back to back, and yesterday’s game went to overtime. Warriors will also be without Klay &amp; Draymond, so Rockets +11 looks like the best play https://t.co/MWhuhVfAea",
    "224": "dear @HoustonRockets, \nplease trade for russell westbrook\nthank you",
    "225": "@HoustonRockets @JalenGreen @Jaygup23 PLEASE dont trade for Westbrick!!",
    "226": "@HoustonRockets @JalenGreen @Jaygup23 Let Jalen run the offense today, pls",
    "227": "If Russell Westbrook gets traded to Houston, this is how I *actually* think it would play out:\n\nHe agrees to stay away from the Rockets for the rest of the year. Rather than playing this season, he stays in LA with his family. Then they figure out a buyout in the offseason.",
    "228": "I just need to know if my veteran PG is gonna be a blood or a crip @HoustonRockets",
    "229": "@LegionHoops @TheSteinLine @HoustonRockets he just left!!!",
    "230": "ULTIMA HORA: Los Houston Rockets interesados en Russell Westbrook https://t.co/xTSXM64cJo",
    "231": "@RooshWilliams @Less_HumbleTeej @HoustonRockets Yeah I think the apprehension was that a lot of us assumed he wouldn’t get bought out",
    "232": "@RooshWilliams @HoustonRockets As long as he don’t ever hit that court I’m in",
    "233": "@cameronwolf24 I mean, technically, a player doesn't have a choice in sitting out. Wall has made it easy for Houston, but like, if the Rockets needed to, they could just never put Westbrook in the game.",
    "234": "@Less_HumbleTeej @HoustonRockets Why? Snag a first and let Russ walk and we’re done",
    "235": "@TheNBACentral @TheSteinLine The man was ballin with The Rockets 🚀 b4 he got hurt WTH is the Houston fans crying about",
    "236": "@TheNBACentral @TheSteinLine This seems to have been said Stein and Houston Rockets as a form of low hanging fruit humor than being realistic.\n\nThese media outlets deserve to get fried by the the athletes",
    "237": "New from Houston Chronicle — How the Rockets spent their day in San Francisco https://t.co/IbYI4hahrP",
    "238": "@ZanolettiA @TinaLara29 It didn’t work either with him in Houston no reason why the Rockets should take him back we’re rebuilding 😂",
    "239": "Hakeem Olajuwon, in full Hakeem Abdul Olajuwon, byname the Dream, (born January 21, 1963, Lagos, Nigeria), Nigerian-born American professional basketball player who led the Houston Rockets to consecutive National Basketball Association (NBA) championships in 1994 and 1995.",
    "240": "BCAARYBR\n\nAway (+13.5)\nGolden State Warriors v Houston Rockets\nHandicap (incl.overtime) -13.5\n1.69\n\n Home (-11.5)\nUtah Jazz v Detroit Pistons\nHandicap (incl.overtime) -11.5\n1.78\n\n Away (-3.5)\nOrlando Magic v Los Angeles Lakers\nHandicap (incl.overtime) 3.5\n1.72\n\n5.2 ODD\n100% SURE",
    "241": "It better be 3 FRPs bro @HoustonRockets I STG",
    "242": "@RedNinetyFour I never said they were desperate. I'm being realistic. The Rockets are gonna have a $44 million player not playing for them either way. I think having the one that comes with some second-rounders is better than the alternative, all things being equal. If Houston disagrees? Cool.",
    "243": "Per @TheSteinLine, Houston is interested in trading for Brodie 👀\n\nRussell Westbrook + 2027 First Round Pick➡️ Rockets\nJohn Wall ➡️ Lakers\n\nThoughts? 🤔 https://t.co/Wq3Z2NMIGh",
    "244": "🚨🚨BIG SLATE TONIGHT❗️❗️\n\nNHL🏒\nBlues ML (-170)\nBlues -1.5 (+150)\n\nCBB🏀\nCleveland/Youngstown o141 (-110)\nIllinois ML (-190)\nIllinois State -7.5 (-110)\n\nNBA🏀 \nHouston Rockets +11 (-110)\nHouston Rockets ML Sprinkle🤏🏼 (+425)\n\nLETS RIDEREE #GamblingTwiiter",
    "245": "@yossyol Wait who said Russ might come back to Houston? As a Rockets fan, I do not want that to happen tbh",
    "246": "Fuck the @Lakers DONT trade with them let them suck forever! @HoustonRockets",
    "247": "@Less_HumbleTeej @HoustonRockets I trust in Stone - if we get a bounty of picks, I’ll gladly do it",
    "248": "Houston rockets are crackheads 😭 https://t.co/oSQskPtm3t",
    "249": "@Less_HumbleTeej @HoustonRockets If lakers send picks and we just buyout Russ cus he’s probably more likely to accept one, I’d do it in a heartbeat",
    "250": "@Less_HumbleTeej @HoustonRockets GET THE BAND BACK TOGETHER!!!",
    "251": "You my cinnamon apple. Don’t do it @HoustonRockets",
    "252": "@TheNBACentral @TheSteinLine Pleaseeee @HoustonRockets  please 🙏🙏",
    "253": "They traded these two players ALREADY. Dissolve Houston Rockets at this point https://t.co/aS9hGwUy9m",
    "254": "The Rockets have strategically tied pick swaps to other first-round picks they're owed in order to increase their chances of getting a higher pick. For example, tying the Miami swap with the Brooklyn first they're owed this season gives Houston the higher selection of the two.",
    "255": "Via @TheSteinLine: there at least 1 team that would be open to Westbrook trade.\n \n“That team, surprisingly, is the Houston Rockets.” \n\nWestbrook played in Houston during the ‘20 season. The Rockets are in a position to take on bad contract if draft picks are attached. #NBAAllStar https://t.co/GZuyFlWLGi",
    "256": "@ksgrt6 @Less_HumbleTeej @HoustonRockets I know I was playin lol. Yuck tho",
    "257": "Russell Westbrook will be traded to the Houston Rockets, he will also renegotiate an extension for more years for lower annuals moving forward. Russ is done with the Lakers.",
    "258": "@TheHusayn @HoustonRockets LMFAOOOOOOO YOU HEARD IT HERE FIRST FOLKS!",
    "259": "As a dedicated Rockets superfan, I agree that she’s right!!! Bring Russ back @HoustonRockets https://t.co/jefOOMdHsN",
    "260": "According to @TheSteinLine there is 1 team that would take Russell Westbrook…\n\n“That team, surprisingly, is the Houston Rockets.”\n\nAntoher John Wall for Russell Westbrook trade? 😂 #NBA #Rockets #LakeShow https://t.co/afhLfs6yFa",
    "261": "The Houston Rockets Luc Monte had a terrible warmup and won't play.",
    "262": "@MrIzzy0714 @SamQuinnCBS He wouldn't be giving up $47M. He would get still get paid something like $42M from the Rockets and then go make that $5M back from whichever team signs him next. The alternative for Houston is paying Wall $47M to not play so they're saving $5M and getting picks from the Lakers.",
    "263": "As a lifelong Houston Rockets fan I need you to listen to actual fans and not Packer fans @HoustonRockets \n\nWe want Russ back!!!! https://t.co/vRHHXMLKl9",
    "264": "The irony with Russ to Rockets rumours is he was actually looking great in Houston tbh. Why did they trade him ??",
    "265": "I STG man don’t do this shit @HoustonRockets",
    "266": "There is at least one team out there that would take Russell Westbrook if the conditions are right. \n\n“That team, surprisingly, is the Houston Rockets,” per @TheSteinLine #LakeShow #Rockets https://t.co/VGY1b89XJl",
    "267": "There is at least one team out there that would take Russell Westbrook if the conditions are right, per @TheSteinLine \n \n“That team, surprisingly, is the Houston Rockets.” 😳 https://t.co/9jvzjWGewZ",
    "268": "Do what you gotta do @HoustonRockets https://t.co/Ohv9qI9KK6",
    "269": "Don’t being that bum ass fashionista back here @HoustonRockets",
    "270": "I’ve floated this before but \n\nJohn Wall to the Lakers\nRussell Westbrook + a protected first round pick to the Rockets\n\nRuss then agrees to a buyout with Houston and signs with the Clippers.\n\nWin-Win-Win https://t.co/vpDOv0uTdV",
    "271": "Interesting from @TheSteinLine here: He reports the Houston Rockets would possibly take Russell Westbrook back for John Wall if the Lakers included the 2027 first-round pick. (Check out his latest column for more context: https://t.co/ATjUZTTtrP) https://t.co/NZYAQVn1ez",
    "272": "@marioelie1 @HoustonRockets Never underestimate the heart of a champion. https://t.co/3su8SrQQHD",
    "273": "There is at least one team out there that would take Russell Westbrook if the conditions are right, per @TheSteinLine \n \n“That team, surprisingly, is the Houston Rockets.” 😳\n\n(Via https://t.co/CwpW1nO5P8) https://t.co/yh8ux1sbRO",
    "274": "The Greatest Houston Rocket https://t.co/nvhcojB9yX",
    "275": "A HOUSE DIVIDED \nNC State Wolfpack / Houston Rockets https://t.co/EFPYJpaOHK",
    "276": "20 years ago today: Atlanta’s Shareef Abdur-Rahim vs. Houston’s Kenny Thomas.\n\nBoth players were suspended for three games without pay and fined $15,000.\n\nHawks 95, Rockets 91\nJanuary 21, 2002.\n📺 CNN World Sport https://t.co/vi75akGjNg",
    "277": "Congratulations to cvasilie7 (@CVasilie) who moved up 59 spots to take #22 on the Houston Rockets team leaderboard.\n\nhttps://t.co/xnqyAdpoTd",
    "278": "@french_runner_ @DR34M @HoustonRockets @nyknicks yes ....le recto et le verso https://t.co/2DlwG7JAxR",
    "279": "Had to travel from Denver to the Bay for this guys 13th birthday so he can catch his idol @StephenCurry30 and the @warriors play a home game at the @ChaseCenter vs @HoustonRockets. His Warriors journey continues! https://t.co/tC6SXoqVCF",
    "280": "@AbdulMu079 @matthewplsstop @BraddeauxNBA Agreed, you don't think Moses helped put them on the map? Playoffs Spurs Rockets at home in Houston 10 points 2 of 11 6 turnovers 6 fouls",
    "281": "@Redapples2021 @HoustonRockets Watching this like... https://t.co/yIsXYHlm4t",
    "282": "The SLS rocket will deploy 10 CubeSats on @NASAArtemis I. One of which will carry life...specifically, yeast. Learn about this research investigation that will send microorganisms into deep space on the latest episode of Houston We Have A Podcast.\n\n&gt;&gt; https://t.co/mqrNK6qh4V",
    "283": "@StarringRico @LockedOnRockets @HoustonRockets A true die-hard Rockets fan! 😤\n\nAppreciate you coming on, was great talking hoops with you!",
    "284": "🎂 Happy 59th birthday, Hakeem Olajuwon! The basketball hall of fame center led the Houston Cougars to 3 Final Fours, helped the Rockets win 2 NBA titles and was the 1994 NBA MVP. Cheers, Hakeem!\n📼 Video: https://t.co/F9a5t5xKLT\n📜 Bio / 📊 Stats:: https://t.co/lByWWtrmqA https://t.co/HTUW884c7C",
    "285": "🔒 Insiders: Enter to win free tickets to upcoming Houston Rockets games at the Toyota Center \nNO ONE IS BUYING TICKETS FOR LOSERS SO THEY ARE TRYING TO FILL THE SEATS",
    "286": "@StarringRico @JTGatlin @LockedOnRockets @HoustonRockets Yes sirrrr 🔥🚀🤘",
    "287": "HBD to the greatest @HoustonRockets of all time!!! @DR34M https://t.co/BRlsTJLBjU",
    "288": "🎂 Happy 59th birthday, Hakeem Olajuwon! The basketball hall of fame center led the Houston Cougars to 3 Final Fours, helped the Rockets win 2 NBA titles and was the 1994 NBA MVP. Cheers, Hakeem!\n📼 Video: https://t.co/IEi6PbwTVl\n📜 Bio / 📊 Stats:: https://t.co/cWZXj02YAm https://t.co/PQrf0W5LkX",
    "289": "Thank you @JTGatlin for having me on @LockedOnRockets!! This was so much fun to do. Anytime I get to talk about my @HoustonRockets is a good time! 🔥🤘🏽🚀 https://t.co/LUL4RVkxVO",
    "290": "I could watch this all day. @DR34M has to be one of the most under-appreciated true superstars in history. What a talent. @HoustonRockets #ClutchCity https://t.co/rwrwlDLQf5",
    "291": "The Houston Rockets Terik Black had a terrible warmup and won't play.",
    "292": "@bobanmanut @HoustonRockets No. Nobody cares. Go away.",
    "293": "The Golden State Warriors play basketball today against the Houston Rockets!",
    "294": "@warriors @Verizon Dont do it today, against my @HoustonRockets..... wait till sunday maybe?",
    "295": "Free #Rockets tix to 4 of the next 5 games to be had, y'all, courtesy of the @HoustonRockets and @KPRC2!\n\n@clutchfans https://t.co/rfuMtB6m8U",
    "296": "HBD to Hakeem The Dream, the greatest center of all time!! @DR34M @HoustonRockets 🚀🐐 https://t.co/8aA8EI59ss",
    "297": "NBA Foundation Grantee Spotlight!\n#NBAFoundation #NBA @HoustonRockets #HoustonRockets #UEI https://t.co/6voW3e2KK5",
    "298": "FREE HOUSTON ROCKETS TICKETS!! 🚀🏀🔥\n\nInsiders, you'll have a 4 diff chances to win free @HoustonRockets tix for upcoming games!\n\n1st up: Tuesday's game vs the Spurs!\n\nhttps://t.co/in5nbsnYDU\n\nInsiders, you can enter once a day. If youre not yet an Insider, it's free to sign up! https://t.co/IWP4Qxrn4D",
    "299": "@WestheimerWild1 I like that!! Left wing king #kpj @HoustonRockets",
    "300": "Houston Rockets vs. Golden State Warriors | USA: NBA\nThe match will start at 10:00 PM, January 21, 2022\nVenue: Chase Center (San Francisco)\n🔴 Link for this Match 👉 https://t.co/dWAshmqwTK\nLet's watch live online, Thank you https://t.co/sxhswJNjSo",
    "301": "Wishing our 1998 TSHOF Inductee, Hakeem Olajuwon (@DR34M) a Happy Birthday🎉\n\n🏀Led the @UHCougarMBK to 3 straight @NCAA Final Four appearances\n🏀1983 Most Outstanding Player\n🏀1994 &amp;1995 MVP \n🏀Led the @HoustonRockets to back-to-back NBA championships ('94 &amp; '95) https://t.co/5uC1UfUsta",
    "302": "@HoustonRockets Happy birthday omo iya",
    "303": "Happy Birthday to the Greatest Center that the Houston Cougars and Rockets ever had. @HoustonRockets @UHCougars @DR34M https://t.co/oMdrzvXJzR",
    "304": "@marioelie1 @brokkolirob @HoustonRockets Give yourself roses to ser, you helped bring that trophy home! Legends 🤘🏾🔥",
    "305": "Curry has 504 points against the Houston Rockets, with  105 assists, and 104 rebounds, played 726 minutes. Curry is averaging 25.2 PPG, 5.3 assists, and 5.2 rebounds.",
    "306": "@HoustonRockets The greatest to ever live!\n\nLong Live The Dream!!!",
    "307": "Aggie Football: 5\nAggie Baseball: 2\nHouston Astros: 1\nHouston Texans: 1\nHouston Rockets: 1 https://t.co/QGjumMKtxp",
    "308": "The Houston Rockets Zhou Qi had a twitterbot with no followers.",
    "309": "@HoustonRockets @ToyotaCenter Wait it kinda looks like it would hit for at least 2 seconds",
    "310": "@HoustonRockets Happy birthday @DR34M !",
    "311": "The Warriors have won four straight games against the Houston Rockets. November 7, 2021 winning, 120-107, May 1st, 2021, winning 113-87, April 10, 2021, winning 125-109, and March 17, 2021, 108-94.",
    "312": "@HoustonRockets A true legend and an American.",
    "313": "Houston Rockets: Why the Houston Rockets:  Don’t Need to Trade Eric Gordon Right Now https://t.co/51uEZRW5Kk",
    "314": "@HoustonRockets Happy Birthday to The Dream Shake originator!!!",
    "315": "This will be the 225 meeting between the Warriors and the Houston Rockets. The Rockets lead the series, 126-98.",
    "316": "James Harden would have found inner peace and unlocked greatness as a Houston Rocket if he had converted to Islam like Hakeem. Happy Birthday Dream. #Rockets",
    "317": "Happy birthday, Hakeem Olajuwon!\n.\n.\n.\n#nba #hakeem #thedream #basketball #houstonrockets #bball https://t.co/YTFgwcFJ8Z",
    "318": "@HoustonRockets This guy can play. Blessed who see this Man do what him do in Rockets Back-to-back and his entire career! We are all widows of him. I hope soon we will back on track of NBA titles! Only The good for him and his family!",
    "319": "@HoustonRockets Happy birthdayyy to the Dream🥳🎉🎈I need my jersey autograph by him🥺",
    "320": "@HoustonRockets Happy birthday goat 🐐",
    "321": "@HoustonRockets Happy Birthday @DR34M !!!",
    "322": "@Real_sjl19 @HoustonRockets @NBA Him and ‘Nique were my favs.",
    "323": "@marioelie1 @HoustonRockets Amen!  You’re not so shabby yourself, Mr. Elie!!!  Have a Great Weekend!!🚀🚀🚀🚀🚀🚀",
    "324": "@CoachKarl22 @marioelie1 @HoustonRockets The Dream was incredible— the most skilled center I’d ever seen— until Jokic came along",
    "325": "@HoustonRockets Happy Birthday Dream! 👑",
    "326": "@HoustonRockets Happy Birthday",
    "327": "@HoustonRockets Happy birthday Akeem the dream.",
    "328": "@BryantBurnsRed @HoustonRockets Fair enough!",
    "329": "@TheyCallMeBrady @HoustonRockets Then let me rephrase. In my opinion Hakeem is the GOAT center. And I'm not the only one thinks so, but I suppose it isn't unanimous.",
    "330": "🚨New Episode🚨\n@JP_Mirabueno \n@summitcommish \n\nLegendary tv play by play announcer for our Houston Rockets @ca_rockets &amp; Rocket fan favorite Von Wafer reunite for the first time in 12 years!\n\nSnippet of our episode below.\n\nLink to episode\nhttps://t.co/Aye86Da8FM\n\n#rockets https://t.co/9iKG2KhbBa",
    "331": "Loved hanging out at @Frontier_AISD and watching all the kids #BeFit with Topper! Thanks @memorialhermann and @HoustonRockets for keeping our Wildcats in tip-top shape! #ExploreDiscoverThrive https://t.co/e0tCn5mn5O",
    "332": "@TheRyanHollins @Ronnie2K do it for the @HoustonRockets fans",
    "333": "@HoustonRockets Happy birthday 🚀🐐DR34M 🐐🚀",
    "334": "@HoustonRockets Happy birthday to my all time favorite player. THE DREAM 34",
    "335": "@HoustonRockets Happy birthday goat 💯🚀🐐",
    "336": "The Houston Rockets James Harden had a tripping call for tripping the mascot.",
    "337": "@the6foot5 @HoustonRockets Yessir I see the Aggie ring sign in the back 😂👍🏻",
    "338": "@BryantBurnsRed @HoustonRockets Never doubted how good he was lol. You said greatest “center” of all time and i gave you players you could argue that with.",
    "339": "@marioelie1 @HoustonRockets Enough said Mr Elie",
    "340": "@HoustonRockets Dream!",
    "341": "Why the Houston Rockets Don't Need to Trade Eric Gordon Right Now – NBA News https://t.co/QErsLZxl5S",
    "342": "@TheyCallMeBrady @HoustonRockets Wilt was a cheat code and played during an era where he had no competition that could compare. Kareem n Russell you could make the argument for. That said Hakeem was drafted ahead of Jordan and you hardly hear anyone say that it was a mistake. That alone tells you how good he was",
    "343": "The Rockets have won 2 in a row and Garrison Mathews has been on fire in those games! 🔥🔥🔥\n\nLet's see what he can do tonight against the Warriors! Coverage begins at 6:30pm!\n\n@HoustonRockets | #LightTheFuse https://t.co/OBLusTeaXX",
    "344": "@HoustonRockets please babe",
    "345": "LIVE ~ Houston Rockets vs Golden State Warriors - NBA League 2022\n🔴Sign up here📺📱:  https://t.co/QeV1waPXiM\nDate : Friday, Jan. 21 - Time : 10:00 PM",
    "346": "@BryantBurnsRed @HoustonRockets Wilt. Kareem. Bill Russell. Stop with the bias bro! 😂",
    "347": "1/21/22 nba play. @HoustonRockets +10.5 v @warriors. #GamblingTwitter #bettingtwitter #bettingsports #wager #friday #cashit #bettingpicks",
    "348": "The Houston Rockets are shopping Eric Gordon to contenders ahead of the NBA trade deadline. @nblindberg looks at the reasons why the Rockets don’t need to trade Eric Gordon before the deadline, and how it may be better to wait until the offseason https://t.co/FSsPMJduVK",
    "349": "Kevin porter jr is so hot #houstonrockets https://t.co/qYhtCpVyaR",
    "350": "Happy birthday, @DR34M ❤️\n\nLe plus grand joueur dans l’histoire des Houston Rockets. https://t.co/nL0lXbkBSm",
    "351": "@marioelie1 @HoustonRockets Incredible player",
    "352": "@HoustonRockets Greatest center of all time and nothing anyone says will change my mind. Happy B-Day Dream!!!",
    "353": "#NBA75 tonight:\n\nHouston Rockets +10.5 @ 1.90\nSan Antonio Spurs (Money Line) @ 1.97\nWashington Wizards (Money Line) @ 1.91\nBoston Celtics -8.5 @ 1.96\n\nGood luck !",
    "354": "@marioelie1 @HoustonRockets Only 1",
    "355": "What’s your favorite game day snack? \nGet it delivered (01/21/22) TODAY ONLY for $2.50 ALL areas of Houston. \nhttps://t.co/5Vb6f78aEf\nNo codes necessary. #GameDay #Rockets #Houston #warrior #GoldenStateWarriors https://t.co/BnuGS9JsCI",
    "356": "What’s your favorite game day snack? \nGet it delivered (01/21/22) TODAY ONLY for $2.50 ALL areas of Houston. \nhttps://t.co/5Vb6f78aEf\nNo codes necessary. #GameDay #Rockets #Houston #warrior #GoldenStateWarriors https://t.co/XwKSOUsHvL",
    "357": "@HoustonRockets Happy Birthday Dream",
    "358": "@marioelie1 @HoustonRockets Happy Birthday! The Greatest Center Ever!",
    "359": "@HoustonRockets THE DREAM",
    "360": "@marioelie1 @HoustonRockets Happy birthday Dream! Always a Rocket!!💯",
    "361": "@HoustonRockets Happy Birthday to my all time favorite Houston Rocket.",
    "362": "@russwest44 is finished. He ruined @KDTrey5 career, he completely destroyed what the @HoustonRockets were building with @JHarden13 and now he has completely DESTROYED the @Lakers and is ruining the end of @KingJames career and it's fucking sad",
    "363": "The Houston Rockets Chris Paul had the Run DMC CD playing during the game.",
    "364": "@Houstorian @HoustonRockets @DR34M Happy birthday Dream. Thanks for the memories GOAT \nWatch \"Olajuwon dominates Robinson\" on YouTube\nhttps://t.co/AuTGcrWr1S",
    "365": "@HoustonRockets The one and only.",
    "366": "@HoustonRockets HBD,HAKEEM THE DREAM",
    "367": "@HoustonRockets Happy Birthday Hakeem, Enjoy...",
    "368": "Houston Rockets: NBA Fans React To 50-Year-Old Allan Houston Draining Threes With Ease: \"Only Missed 5 Shots In 30min. He Different.\" https://t.co/mRwJc4ndRY",
    "369": "Houston Rockets looking to sneak in their third straight win tonight in Oakland against Golden State",
    "370": "@HoustonRockets Happy birthday Dream.",
    "371": "Houston Rockets vs. Golden State Warriors - NBA League 2022\n📺📱Watch Here➠  https://t.co/T84jXID4q9\n📅 : Friday, January 21, 2022\n⏰ : 10:00 PM",
    "372": "@marioelie1 @HoustonRockets Happy Birthday to the Dream\n🎂🎂🎂",
    "373": "Just Bought! \"He’s a turbocharged cinder block with the strength to jostle against centers on defense and the speed to chase guards. If Tate is barreling at you, get the hell out of his way.\" The new NBA SMALLER CENTER. @HoustonRockets @NBA    https://t.co/ku7HZHJeVV?",
    "374": "@VernonMaxwell11 Tell me you know nothing about @HoustonRockets history without telling me you know nothing about @HoustonRockets history…",
    "375": "7 to Aggie fb\n1 to Aggie basketball\n2 to Houston rockets https://t.co/IeYIcqf085",
    "376": "@marioelie1 @HoustonRockets The Goat 🐐",
    "377": "@marioelie1 @HoustonRockets Awesome!!!  Happy Birthday Hakeem!!  I coached his brother Afis at UT-San Antonio",
    "378": "@HoustonRockets More Life With Good Health",
    "379": "@bobanmanut @HoustonRockets Yadah Yadah Yadah, you’re whole argument is void. He provided TWO rings",
    "380": "@HoustonRockets Glad I can share a bday with the 🐐",
    "381": "@HoustonRockets The Dream!!!",
    "382": "@HoustonRockets As talented as he was, he was drafted to an organization that put him in a great position of success and didn’t provide a single championship for it. https://t.co/T1UYZeMteJ",
    "383": "@HoustonRockets Where would he rank in todays nba? If he was in todays nba he would be a solid top 15 player behind Damian Lillard and jokic.",
    "384": "@HoustonRockets Could he be the Rudy Gobert of the previous era? His resume may look impressive 2xdpoy,3xblk champ however according to advanced analytics he doesn’t perform very well on the perimeter https://t.co/7thEilDA5S",
    "385": "@HoustonRockets Hakeem is often compared to shaq and Kareem but according to advanced analytics he’s not on the same tier https://t.co/b4WEN1KNzk",
    "386": "@HoustonRockets 9 first round playoff exits, 1 missed playoffs in his prime, which include 4 sweeps, 6 blowouts, couldn't make an All-NBA first team during the ages of 27, 28, 29can't win an MVP or ring before age 30, was in trade talks with Boston for Reggie Lewis https://t.co/4oScNbreza",
    "387": "Hakeem Olajuwon is 59 today.\n\nHailing from Lagos, Nigeria, The Dream came to prominence at Houston as a member of Phi Slama Jama.\n\nA 12-time All-Star, Hakeem won back to back titles, &amp; Finals MVP’s with the Rockets in 94-95.\n\nToday's birthdays in sports\n👇\nhttps://t.co/V0CCLj6Pgu https://t.co/SxKYOT7QcO",
    "388": "@HoustonRockets Why Hakeem alajoan is the most overrated basketball player in nba history thread https://t.co/hCmdu8C4T1",
    "389": "@HoustonRockets Happy Birthday the Hakeem!",
    "390": "@HoustonRockets the real goat",
    "391": "@marioelie1 @HoustonRockets Hakeeeeeeeem the dream! Happy birthday 🎉🎉",
    "392": "HAPPY BIRTHDAY JANUARY 21; Model Mario Adrion ,28; Soccer Marco Asencio ,26; Actress Geena Davis ,66; Fashion Designer Christian Dior(1905-1957)\"117\"; Actor Lex Lumpkin,16; NBA Hakeem A. Olajuwan Houston Rockets &amp; Toronto Raptors),59; BEST WISHES &amp; GOOD HEALTH TO ONE &amp; TO ALL!!!",
    "393": "@marioelie1 @HoustonRockets champ champ",
    "394": "@HoustonRockets Greatest center oat",
    "395": "Today in 1963, @HoustonRockets legendary center Hakeem Olajuwon is born. @DR34M https://t.co/9BKzdb1M64",
    "396": "@HoustonRockets HBD to the best center ever",
    "397": "Happy 59th birthday Hakeem Olajuwon. Olajuwon was the 1994 NBA Finals MVP who led the Houston Rockets to back-to-back championships. His other accolades include being a 12x NBA All-Star and a 6x All NBA First Team selection. Enjoy your day, Hakeem. https://t.co/eUWNUo40lp",
    "398": "@marioelie1 @HoustonRockets Dreamerrrrrrrrrrrrr!!!!!!!!!!!!! 🎉🎉🎉",
    "399": "@NBAHistory @BenDuBose @HoustonRockets sign him back, instead of Theis",
    "400": "New #Rockets from Houston Chronicle — Rockets at Warriors: 5 things to watch https://t.co/yAeHCM6V8t",
    "401": "The Houston Rockets 🚀 owner said that he is back and ready for all the smoke 💨. https://t.co/4ERiwYWx6k",
    "402": "@nuggets sign former @SacramentoKings @PelicansNBA @warriors @HoustonRockets @LAClippers and @Bucks @boogiecousins to a ten-day contract #NBA #Nuggets #NBA75 https://t.co/j2zZq3C8gp",
    "403": "@marioelie1 @HoustonRockets Both looking good!",
    "404": "The Houston Rockets Nene had 5 broken backboards in 1 game.",
    "405": "@HoustonRockets Best shot blocker EVER! Not up for debate! The numbers PROVE IT!",
    "406": "@HoustonRockets Happy Birthday, Hakeem.\nUnbeatable - The Dream\nhttps://t.co/sIsizoxUIZ",
    "407": "I haven't followed Houston Dynamo since 2007, closely...So I've decided to again 2022... What perfect timing, eh!!! Now its the time to do it again as the MLS league product has improve and so have the Dynamo franchise. Perfect timing with the Rockets &amp; Texans rebuilding.",
    "408": "DasHaus made a bet!\n\nEvent: Houston Rockets vs Golden State Warriors #NBA\nBet: Golden State Warriors TO WIN -10.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "409": "DasHaus made a bet!\n\nEvent: Houston Rockets vs Golden State Warriors #NBA\nBet: Houston Rockets TO WIN +10.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "410": "4 Houston Rockets RC auto lot #thehobby https://t.co/d85cUCsQKJ",
    "411": "@HoustonRockets Best Center ever!",
    "412": "@HoustonRockets One of the greatest",
    "413": "@HoustonRockets I took the hardaway ,\n🎉🎊",
    "414": "@HoustonRockets Happy Birthday Dream 🎂",
    "415": "@HoustonRockets Happy Birthday Hakeem “The Dream “! Miss watching you play!!",
    "416": "@HoustonRockets It's out of the dream shake or the shimmy shake the greatest jukemove in hoops.🏀",
    "417": "@HoustonRockets Best center of all time.",
    "418": "@HoustonRockets Happy Birthday king!!!!",
    "419": "the greatest non-american player ever to play in the nba turns 59 today, greatest ever houston rockets player aswell. hakeem ‘the dream’ olajuwon https://t.co/697hZvrYrK",
    "420": "@HoustonRockets Happy Birthday Dream!",
    "421": "@HoustonRockets G.O.A.T #Dream thx 4 all the great memories happy birthday 🎂",
    "422": "@HoustonRockets Happy Birthday!! Wish yu were still playing",
    "423": "@HoustonRockets Happy Birthday Dream. 🎉",
    "424": "@HoustonRockets Happy birthday Dream and to many more 🎉",
    "425": "@HoustonRockets Happy birthday Dream!",
    "426": "@HoustonRockets Legend",
    "427": "@Redapples2021 @HoustonRockets best center oat",
    "428": "@HoustonRockets Best sh*t yall've done yet. 🤘🏿🚀 #Rockets",
    "429": "@RobbySilv @Suns @AdamSchein @TheBobStew @HeresMikeyFitz @MadDogRadio Houston rockets had the 1 seed before. Seeding doesn’t matter playing well at the right time does",
    "430": "@HoustonRockets 📼 DREAM https://t.co/plKl47TWCL",
    "431": "@HoustonRockets Rockets are taking down the Warriors tonight for dreams b-day!!!! 🎂🎂\n\n@khoee",
    "432": "@HoustonRockets Hbd to the best center of all time",
    "433": "@HoustonRockets legend, happy birthday 🚀",
    "434": "@HoustonRockets Not a rocket unfortunately",
    "435": "@HoustonRockets Happy bday Dream!!",
    "436": "@HoustonRockets happy birthday legend",
    "437": "Join us in wishing Houston Rocket's legend, Hakeem Olajuwon a Happy Birthday!\n\n#HoustonSportsHOF\n@DR34M | @PNCBank https://t.co/bFf24jxB1y",
    "438": "The Houston Rockets James Harden had 69 points 24 rebounds.",
    "439": "Houston Rockets: Kevin Porter Jr. growing in confidence for Rockets https://t.co/4PgFfJCty6",
    "440": "HAPPY BIRTHDAY TO HAKEEM, THE DREAM, OOOOOOOOOOLAJUWON!!!! 🐐🥳🎂🏀🚀\n\nThe championships are forever. The legacy is forever.\n\nHouston, let's give some bday love to the @DR34M!!\n\n#HakeemtheDream #HakeemOlajuwon #HtownGOAT #GOAT #HoustonRockets #Houston #HappyBirthday #KPRC2 https://t.co/1WKxGC3PBI",
    "441": "Houston Rockets at Golden State Warriors odds, picks and prediction https://t.co/6NT399xhsG",
    "442": "Consensus Line Move:\n2022-01-21 Houston Rockets at Golden State Warriors from 229.00 to 228.00\nUnder check those props\n#NBA #sportsbook #innovation #bitcoins",
    "443": "@RussGoat0 @rahul_stuff @warriors Suns are playing good but so did the Houston Rockets at the hight of their power vs the Warriors. 🤷‍♂️ I do not have faith in the Suns or even the Bucks. If any of those teams faced a hot Golden State? Suns could probably stay in the game but it’s still easily a Warriors W.",
    "444": "New from Houston Chronicle — Rockets at Warriors: 5 things to watch https://t.co/eOMLPk6yMa",
    "445": "@IndianaMBB @TheofficialEG10 @HoustonRockets Cmon Hoosiers let's get this going #iubb",
    "446": "OKC Thunder: Houston #Rockets: The Top-5 Contenders That Could Make a Move for Eric Gordon Part 2 https://t.co/K2ww5CEEyJ",
    "447": "The Houston Rockets Luc Monte had a disco ball hung up in his locker.",
    "448": "From @Lakers vs @OrlandoMagic to @HoustonRockets vs @warriors, here's a look at the betting odds and predictions heading into each of tonight's (Jan. 21) 11 @NBA games. 🏀\n\n#NBA #NBA75 #NBATwitter #sportsbettingpicks \nhttps://t.co/5GyOwcVcqr",
    "449": "Milwaukee Bucks - Chicago Bulls\nGolden State Warriors - Houston Rockets\n\nBet slip link: https://t.co/qITAPlyiLI https://t.co/WAupD3v3c6",
    "450": "@emart86 @WBEN Bro, it’s $300. You blow that on the Houston Rockets on a Wednesday.",
    "451": "The Houston Rockets Chris Paul had  to go to the bathroom during the game so he hit his juul.",
    "452": "@HoustonRockets how’s Jalen Green doing",
    "453": "@HoustonRockets Ggs you guys get a free win tommorow now go out there and expose them frauds",
    "454": "The Houston Rockets P.J. Tucker had a terrible warmup and won't play.",
    "455": "We are turning into the Harden Houston Rockets.  There are players out there that simply shouldn’t be jacking up 3s and should instead be getting to the rim and putting pressure on the refs.  We’re also lacking solid midrange scorers and post scorers that can help open up the 3.",
    "456": "The Houston Rockets P.J. Tucker had 69 points 24 rebounds.",
    "457": "Pronostico Baloncesto NBA Golden State Warriors - Houston Rockets (22-Enero-2022) - https://t.co/S5c9LpGWVS\n\n#pronosticos #pronosticosfutbol #pronosticosapuestas #apuestasdeportivas #pronosticosgratis https://t.co/FclikIEVNh",
    "458": "Houston Rockets: NBA Preview: Mr. Opposite Picks takes Golden State Warriors +12.5 Vs. Houston Rockets:  1/21 https://t.co/etPSpvOiF5",
    "459": "Happy Birthday @DR34M @HoustonRockets https://t.co/dlQBeG81hz",
    "460": "The Houston Rockets Gerald Green had the Run DMC CD playing during the game.",
    "461": "Houston Rockets vs. Golden State Warriors - 1/21/22 Free Pick &amp; NBA Betting Prediction https://t.co/3bxDp7qdBW\n.\n#Betting #FreePicks https://t.co/8OHZwFNTTD",
    "462": "Houston Rockets: Stephen Curry regains scoring form in vain as shorthanded Pacers upset extends Warriors recent\u0085 https://t.co/BQC22mYzpw",
    "463": "Yugoslav Basketbolcu ismi gibi..\n\n”in the first round 14th pick, Houston Rockets select Covid Pandemic from Slovenia”",
    "464": "Former Rockets guard Vernon Maxwell has become known for trolling the Jazz, and he did it yet again after Houston’s latest win at Utah.  https://t.co/dUp5tRZPq8",
    "465": "The Houston Rockets Luc Monte had 3 blind dates in the locker room at halftime.",
    "466": "@karbachbrewing @HoustonRockets @marioelie1 It’s 2:37AM and I’m on Twitter trying to win a 6 pack of @karbachbrewing signed by @marioelie1 🤦🏾‍♂️ and now I need a friend to tag 🤔…. @clutchthebear I choose you! 🥴 wonder if he’ll have one with me? Or 2!! Or 3!!",
    "467": "@botosoole @warriors @HoustonRockets We lost to pacers, we taking revenge on rockets!",
    "468": "Houston Rockets (14-32, 15th in the Western Conference) vs. Golden State Warriors (32-13, second in the Western Conference) https://t.co/arqshSRFJD",
    "469": "The Houston rockets  security team sucks",
    "470": "NBA Basketball Game Betting Picks Simulator: 10:10 PM ET - Houston Rockets vs. Golden State Warriors - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/Y2jH4z2n8U #nba #sportsbetting #freepicks #cappertek",
    "471": "Warriors: Houston #Rockets vs. Golden State #Warriors game preview: lineups, injuies - The Dream Shake https://t.co/QGKUJl9BEU",
    "472": "Los Angeles Lakers is what people thought the Houston Rockets would be",
    "473": "The Houston Rockets Clint Capela had a twitterbot with no followers.",
    "474": "Rockets look to cap strong trip with win over Warriors  #NBA\n #Warriors #DubNation #WarriorsGround #HoustonRockets  https://t.co/NuvnG2vVuH",
    "475": "Congratulations to rapid_dachshund1971 and chots99 who moved up to take #5 and #97 on the Houston Rockets team leaderboard.\n\nhttps://t.co/xnqyAdpoTd",
    "476": "Warriors: Houston #Rockets vs. Golden State #Warriors game preview: lineups, injuies - The Dream Shake https://t.co/LzrudgXny2",
    "477": "Consensus Line Move:\n2022-01-21 Houston Rockets at Golden State Warriors from -12.00 to -10.50\n#Rockets track it\n#NBA #bettingexpert #datascience #stocks",
    "478": "@saadmjd @warriors @HoustonRockets Here’s to hoping. Also great Steph has found a rhythm",
    "479": "@rayan_heravi @warriors @HoustonRockets Only game he looked good was the one he started, tomorrow he’ll get another shot.",
    "480": "@saadmjd @warriors @HoustonRockets Poole is in a RUT",
    "481": "@rayan_heravi @warriors @HoustonRockets Feels like no one can make a shot every game, these guys need the all star break real bad right now.",
    "482": "@saadmjd @warriors @HoustonRockets Also need to start shooting the ball. Curry the only guy tn.",
    "483": "@rayan_heravi @warriors @HoustonRockets Best time for him to ask for that extension lol",
    "484": "@saadmjd @warriors @HoustonRockets I mean if it’s 3-110 or whatever give it to him with a team option on the end",
    "485": "@rayan_heravi @warriors @HoustonRockets Draymond gonna ask for the super max",
    "486": "@saadmjd @warriors @HoustonRockets Idk anymore brother. We need our heart and soul back. They don’t have toughness without him.",
    "487": "It’s about to be hell when the @warriors lose to the @HoustonRockets tomorrow.",
    "488": "The Houston Rockets Eric Gordan had a fan warm his seat up while he was playing.",
    "489": "🚨 Line Change 🚨\n\nHouston Rockets @ Golden State Warriors\nFri 10:10 PM EST\n\nFrom:\nGS -12.0 -110\n\nTo:\nGS -10.5 -110",
    "490": "Looking at tomorrow night’s slate sending the “What’s up big head” text to the  @DetroitPistons &amp; @HoustonRockets https://t.co/07FcFgNADA",
    "491": "@corriemwende @HoustonRockets Don't worry, you'll Stat pad again Rockets",
    "492": "@HoustonRockets Lol right after that dude missed a open 3",
    "493": "@arxanii Might not bode well for the Rockets tomorrow. If Warriors lose against Houston then.. yesh. I think Curry has a monster game. More than happy to be wrong though :)",
    "494": "@RooshWilliams BOOM - I'll be there tomorrow night 5th row to watch Gordon smash on them!!!! 🚀\n\n@HoustonRockets https://t.co/EOB8PU09B6",
    "495": "The Warriors go to (32-13). Will the Warriors bounce back against the Houston Rockets tomorrow night?",
    "496": "I hope @Warriors won’t show up against my @HoustonRockets tomorrow. #Rockets",
    "497": "Houston Rockets vs. Golden State Warriors game preview, in which it’s annoying that the Warriors are so good again. https://t.co/kqlD712CyX",
    "498": "Houston Rockets vs. Golden State Warriors game preview, in which it’s annoying that the Warriors are so good again https://t.co/NHMtXE0GvN",
    "499": "The Houston Rockets James Harden had the Run DMC CD playing during the game.",
    "500": "@abhavsar @GoodmanHoops John Wall..? John Wall… Oh the guy that the Houston Rockets young guys like Jalen Green and KPJ could use to lean on and mentor through the season instead of them sitting him out waiting for a trade. Yeah in that way Ivey and Wall are very comparable",
    "501": "@ikelove99 YEP! Houston sports is cursed man. Rockets should have at least kept the band together",
    "502": "@HoustonRockets….. buyout John Wall",
    "503": "@MarryYoda You crazy bro 😂. But that's how it happens with all the major Houston sports teams. Astros trade somebody mid season they end up winning the world series. Texans get rid of a coach the team he go to win a superbowl. And everyone that leave the Rockets ball out elsewhere",
    "504": "@bball_ref @utahjazz @ATLHawks @MiamiHEAT @chicagobulls @Suns @HoustonRockets @LAClippers @OrlandoMagic @okcthunder @DetroitPistons Top 5 Defensive Rating (DRtg):\n@warriors \n@Suns \n@cavs \n@dallasmavs \n@celtics \n\nBottom 5:\n@hornets \n@SacramentoKings \n@trailblazers \n@HoustonRockets \n@ATLHawks",
    "505": "@HoustonRockets Like the Rockets.",
    "506": "@sterling198525 @TheofficialEG10 @HoustonRockets Word",
    "507": "The Houston Rockets James Harden had 5 broken backboards in 1 game.",
    "508": "@HoustonRockets People wanna fire Silas but there is a reason he’s not playing Sengun. He’s seen him play more than anyone",
    "509": "@TheFrankIsola Get a third team involved and make it happen. @HoustonRockets maybe.",
    "510": "\"3 years ago the @sixers’ Daryl Morey, one of the league’s most respected general managers, tweeted in support of the Hong Kong protests. The message cost him his position with the @HoustonRockets and resulted in a temporary ban of NBA games on state TV – an estimated $400m hit.\"",
    "511": "Congratulations to belindaleee, Zeent, smpiggy, AndyWarholla (@AndyWarholla) and Thelawyer251238 who moved up to take #5, #6, #7, #8 and #9 on the Houston Rockets team leaderboard.\n\nhttps://t.co/xnqyAdGZKL",
    "512": "Future Houston Rocket https://t.co/Gid0HxPaWH",
    "513": "@HoustonRockets Need to start Garrison over Jalen",
    "514": "KEVIN PORTER JR HOUSTON ROCKETS NBA 2K22 HIGHLIGHTS by nba2kgleague #nba... https://t.co/Pzp8x9ZlV5 via @YouTube",
    "515": "@HoopsNostalgia @trailblazers @blazersedge Clyde The Glyde Drexler and Hakeem The Dream Olajuwon.  Two great Houston Rockets!!",
    "516": "Thank you to the @HoustonRockets and @TexasChildrens Be Fit program for the wonderful adventure with some of our 2nd grade students today!  Our Cheetahs enjoyed getting fit with you!  ♥️💚🏀♥️💚 #cecheetahs #justcanthidethatcheetahpride https://t.co/7G6wluxu9v",
    "517": "Teams P. 3\n\n@Timberwolves - Kevin Garnett\n@okcthunder - Russell Westbrook\n@HoustonRockets - James Harden\n@dallasmavs - Dirk Nowitzki\n@spurs - Tim Duncan\n@nuggets - Carmelo Anthony\n@utahjazz - Karl Malone\n\n#NBA #NBATwitter",
    "518": "The Houston Rockets P.J. Tucker had 3 blind dates in the locker room at halftime.",
    "519": "Houston ROCKET",
    "520": "🏀 Jan. 20, 1984: Ralph Sampson has 24 points and 23 rebounds and Phil Ford has 17 assists as the Houston Rockets rout the Spurs, 138-104.\n📋 Box score: https://t.co/lW5go0eoAa https://t.co/LoPGCcvkf4",
    "521": "“We’ve clearly got some stuff to work on,” @Joeingles7 said after the @utahjazz's 116-111 loss to the @HoustonRockets on Wednesday night. | By @NBASarah\n\nhttps://t.co/Mq0ckVHWvF",
    "522": "Staying in Houston for a few nights for my birthday and wanted to go to a rockets game and the warriors are in town so of course they inflate the price 🙄",
    "523": "@MogoSME @utahjazz @HoustonRockets @chicagobulls @MogoSME overshot their contribution on the @Jazz logo. Their contributions included providing production files driven by NBA Creative Services and NBA SVP, Tom O'Grady. In fact the Wasatch Mountain range first appeared in 1993, before SME ever worked with NBA. https://t.co/z3uSjmETMf",
    "524": "\"[Wojnarowski] The Houston Rockets have agreed to trade Carmelo Anthony and cash to the …\"\n\nhttps://t.co/RCdWIE8jk3\n\n[via r/nba Jan 21, 2019 #NBA]",
    "525": "My Houston Rockets family,don’t every time you see CP3 play it makes you sick.He is the best leader to ever play this game. He can do more with less. His teams are tough and so damn smart. we traded him for Westbrook do you see why I was so devastated!!\nCP3 trade set is back!!"
}