{
    "0": "gonna chew over this some more but i believe i am now intrigued by the indiana pacers",
    "1": "🇺🇸 NBA - 06/02 🗓 \n\nCleveland Cavaliers 98-85 Indiana Pacers",
    "2": "\"Tristan Thompson will not play a single game with the [Indiana] Pacers. It sounds like he wants to go to a contender and compete for a title before he retires. So, expect Tristan Thompson not to be on the Pacers anytime soon. He's gonna be bought out.\" (via @esidery on @JMV1070) https://t.co/cBTaIuSFaq",
    "3": "🏀 Atlanta Hawks vs Indiana Pacers\n🏆 NBA\n🗓 08/feb.\n⏰ 21:30\n📺 NBA LEAGUE PASS",
    "4": "Atlanta Hawks (-12.5) vs. Indiana Pacers! #TrueToAtlanta #GoldBlooded #NBA #NBATwitter #NBA75",
    "5": "Indiana Pacers Starters:\n\nKeifer Sykes\nChris Duarte\nLance Stephenson\nTorrey Craig\nGoga Bitadze\n\nPlayers out:\nMalcolm Brogdon\nTyrese Haliburton\nBuddy Hield\nIsaiah Jackson\nT.J. McConnell\nReggie Perry\nTristan Thompson\nMyles Turner\nT.J. Warren\n#GoldBlood",
    "6": "Tonight's starting lineup for the Indiana Pacers: Sykes, Stephenson, Duarte, Craig, Bitadze https://t.co/bVWH4ANapA",
    "7": "Indiana Pacers Starting Lineup 2/8\n PG: Keifer Sykes\n SG: Lance Stephenson\n SF: Chris Duarte\n PF: Torrey Craig\n C: Goga Bitadze\nhttps://t.co/o75oZ8vnE8",
    "8": "Eddie Gill on the reported deal (not yet finalized) that will send Domantas Sabonis, Jeremy Lamb and Justin Holiday to the Kings in exchange for Tyrese Haliburton, Buddy Hield and Tristan Thompson: \"It's a new day for the Indiana Pacers.\"\nStream: https://t.co/EIvWg8wFOm https://t.co/NpJEBhSGi5",
    "9": "The Indiana #Pacers surprised the entire #NBA community today with the acquisition of second year guard Tyrese Haliburton from the Sacramento #Kings.\n\nThe hype for #Haliburton is valid. ⬇️ https://t.co/aHWan0q7W4",
    "10": "The Indiana Pacers will look completely different when they return home later this week while Sacramento Kings are getting an All-Star. https://t.co/jPe8pbX33p",
    "11": "@patrickmcf7 @FDSportsbook College: Auburn -1\nBrooklyn Nets +9.5\nIndiana Pacers +12.5",
    "12": "Ladies and Gentlemen your Indiana #Pacers available players for tonight’s match up. \n\nKeifer Sykes\nChris Duarte\nTorrey Craig\nOshae Brissett\nGoga Bitadze\nLance Stephenson\nDuane Washington\nTerry Taylor",
    "13": "Who Will The Indiana Pacers Sign In Free Agency? https://t.co/EaskUSprug",
    "14": "Indiana Pacers trade Domantas Sabonis, Justin Holiday, Jeremy Lamb to Sacramento Kings. Sabonis, Holiday, and Lamb made the trip to Atlanta for the game against the Hawks, but they will not suit up for the Pacers. https://t.co/RaHvW4VGsK via @usatoday.",
    "15": "Pacers have new plan for Myles Turner after Domantas Sabonis trade? #Indiana #Pacers #NBA https://t.co/lP0Q0LlbRh",
    "16": "The Indiana Pacers officially chose Myles Turner over Domantas Sabonis, forcing a handful of potential Turner suitors to scramble for a Plan B.\n\n#GoldBlooded | #NBATwitter| #TradeDeadline | @BigTimeTimJim \nhttps://t.co/IBIhdNW8kj",
    "17": "#CBBUS3-adjacent side note: \nTristan Thompson traded to Indiana Pacers.\nLady Hoosiers... https://t.co/wbdwHsSI3u",
    "18": "Pacers made the right decision, trading an all-star for a budding star in Tyrese Haliburton #Indiana #Pacers #NBA https://t.co/khBQERGI1q",
    "19": "Atlanta Hawks - Indiana Pacers\nMemphis Grizzlies - Los Angeles Clippers\nDenver Nuggets - New York Knicks\nSacramento Kings - Minnesota Timberwolves\n\nBet slip link: https://t.co/bnDJdMEj8p https://t.co/1DzGn8CnOj",
    "20": "The Indiana Pacers continued their mid-season overhaul by trading their all-star big man for a young, up-and-coming point guard. https://t.co/pdDcGGoI5A",
    "21": "Philadelphia 76ers - Phoenix Suns\nBrooklyn Nets - Boston Celtics\nAtlanta Hawks - Indiana Pacers\n\nBet slip link: https://t.co/Oyf7pf0j8p https://t.co/vlGha9U6l4",
    "22": "@PrinnyBro @leonrestored Update: I have been claimed off waivers and am coming home to the Indiana Pacers",
    "23": "Atlanta Hawks vs Indiana Pacers Basketball Live | 2022 NBA[Stream HD] : https://t.co/fQ8Zzemgnq | 8-Feb-22 | 19:30 | NBA | Basketball | Indiana Pacers | Atlanta Hawks | Live | 2022 Basketball NBA Indiana Pacers vs Atlanta Hawks | Atlanta Hawks vs Indiana Pacers Live Stream, https://t.co/i5rMOf8lUa",
    "24": "@buddyhield let me as a native Hoosier be the first to welcome you to the great state of Indiana as a Indiana Pacers.. you will light up and send more electricity through the Fieldhouse more than Reggie Miller ever could.. best of much too you the test of the season",
    "25": "NBA Trade: Sacramento Kings tauschen Tyrese Haliburton mit Domantas Sabonis von Indiana Pacers https://t.co/QXkKMtD8xX",
    "26": "@CarmichaelDave @TyHaliburton22 P. S. @TyHaliburton22 you are better in every way than Fox, wish I could be the GM and made you our centerpiece. You will be a Hall of Famer and again our Sucramento Queens will face the reality our front office needs complete reorganization. Best of luck. New Indiana Pacers fan!",
    "27": "@jj_redick by gosh with these trades Indiana Pacers are going to next year's NBA Finals",
    "28": "NBA trade grades: Pacers, Kings swap star players Domantas Sabonis and Tyrese Haliburton #Indiana #Pacers #NBA https://t.co/33Gl6BRCcJ",
    "29": "And just like that, the Indiana Pacers have a new franchise cornerstone as they move on to a new and exciting era of Indiana basketball.\n\n#Pacers\n\nhttps://t.co/EaFKFpTEie",
    "30": "Indiana Pacers center Myles Turner has formally requested a trade, per @FOXSports and @BallsackSports. He has a list of desired destinations and the list includes the Lakers, Warriors, Nets, Bucks, and Hornets.",
    "31": "Indiana Pacers makin moves! Win for Pacers. L for Kings https://t.co/P361693XcF",
    "32": "The Indiana Pacers lowkey got a squad",
    "33": "@arielhelwani Did not expect to see Sacramento Kings and Indiana Pacers news from Ariel ... Nothing wrong with that basketball is cool and all just not the source I was expecting this news from 😂",
    "34": "The Indiana Pacers are fun again. Hello, world.",
    "35": "Making sense of the shocking deal between the Sacramento Kings and Indiana Pacers https://t.co/URLfOiJUcY",
    "36": "Oh hey, the newest member of the Indiana Pacers: https://t.co/WPGZEAvgXg",
    "37": "#Pacers \nIndiana Pacers +4.5 1st Q -112 \n(1.5u)\n#GamblingTwitter",
    "38": "the last time the Indiana Pacers won fewer than 30 games\n\n1989",
    "39": "Tyrese Haliburton is headed to the Indiana Pacers. https://t.co/UPXXSNmp8q https://t.co/EMeL0pvLtD",
    "40": "Atlanta Hawks - Indiana Pacers\nMemphis Grizzlies - Los Angeles Clippers\n\nBet slip link: https://t.co/hcX5dVHFUU https://t.co/iRbpcNxmHc",
    "41": "ESPN's Adrian Wojnarowski on Pacers trade: 'The league is stunned' #Indiana #Pacers #NBA https://t.co/hfYkrskCND",
    "42": "Recap: #NBATradeDeadline\nThe Kings have reportedly acquired former All-Star Domantas Sabonis in a trade with the Indiana \n\nPacers\nIndiana receives: \nTyrese Haliburton\nBuddy Hield\nTristan Thompson\n\nSacramento receives: \nDomantas Sabonis\nJustin Holiday\nJeremy Lamb\n2027 2nd rd pick",
    "43": "@AKRileyy5 welcome to the Tyrese Haliburton era of Indiana Pacers basketball 😈",
    "44": "Looking for a value bet?  See if the Indiana Pacers-Atlanta Hawks Predictions and Preview for 2/8/2022 is one in our preview.  No crazy hype just a prediction and preview. #Picks #GamblingTwitter https://t.co/jKFXFgwxAd",
    "45": "A major blockbuster trade went down between the Indiana Pacers and Sacramento Kings.\n\nFor @basketbllnews, I explain why the team who traded away an All-Star actually left the instant winner: https://t.co/0he0AUK8yv",
    "46": "HOLY SHIT THE INDIANA PACERS GOT TYRESE HALIBURTON. THEY ARE NOT PLAYING AROUND.",
    "47": "The Indiana Pacers straight waxed the Kings. Absolutely embarrassing for them. How do you get rid of Heild, and haliburton for sabonis???",
    "48": "Agreed, I’ll be honest if I’m an Indiana Pacers fan, I’m definitely excited about the potential that comes with Tyrese Haliburton running the point, but they need to desperately upgrade at shooting guard and power forward #NBATwitter https://t.co/654VTwiFB0",
    "49": "Indiana Pacers visits Atlanta Hawks Predictions and Preview for 2/8/2022 today.  Who are we taking in this game?  Find out now. #Picks #GamblingTwitter https://t.co/jKFXFgwxAd",
    "50": "The New York Knicks, Indiana Pacers, Philadelphia 76ers and the Utah Jazz have all reached out to the Kings with interest in De’Aaron Fox, per @Schultz_Report. https://t.co/EEvLvQLHGj",
    "51": "Kings to trade Tyrese Haliburton and Buddy Hield to Indiana Pacers https://t.co/xJp5U9hn40",
    "52": "Updated: Kings make blockbuster trade to acquire Indiana Pacers All-Star Domantas Sabonis. We reported in January the Kings had stepped up their pursuit of Sabonis, but how did we get here and when will Sabonis suit up for Sacramento?\nhttps://t.co/5bJwuWFY9m",
    "53": "‘MAKE IT MAKE SENSE!’ JJ Redick tries to wrap his head around Kings-Pacers trade | NBA Today #Indiana #Pacers #NBA Video: https://t.co/pq9w00LZy3",
    "54": "Thanks to the acquisition of Tristan Thompson, the new sponsor of the Indiana Pacers is the Nurx app.",
    "55": "https://t.co/JqzBm9EY6k\n\nThe Indiana Pacers are trading two-time All-Star big man Domantas Sabonis to the Sacramento Kings for a package that will include second-year guard Tyrese Hali...",
    "56": "JJ Redick says Indiana Pacers clearly wins in Sabonis Halliburton  trade and I agree considering his lighter contract course he has not reached a ceiling yet as well. @Pacers  @SacramentoKings perhaps they miss a dominant center like DeMarcus Cousins🤨🤨🧐",
    "57": "@barstoolsports Who will Tristan knock up in Indiana? @Pacers #Pacers",
    "58": "The Indiana Pacers pulled off a blockbuster trade centered around standout young guard, Tyrese Haliburton, but Tom Witt (@sactowncrown) explains why this could be the trade of the century for the Sacramento #Kings! #SacramentoProud #NBATradeDeadline \nhttps://t.co/CQwMwvMy65",
    "59": "5 things to know about Pacers trade acquisition Buddy Hield #Indiana #Pacers #NBA https://t.co/NvfUKaOovu",
    "60": "The Indiana Pacers traded two-time All-Star Domantas Sabonis to the Sacramento Kings on Tuesday as part of a 6-player deal. Sacramento is sending Tyrese Haliburton, Buddy Hield and Tristan Thompson to the Pacers. https://t.co/a7EHgZg1As",
    "61": "REPORT: Indiana Pacers Sit Malcolm Brogdon For 10 Days Of Rehab https://t.co/mERWYAXNci",
    "62": "@SunsNationNBA If being aggressive means becoming the Indiana Pacers, I’ll stay with the buyout market.",
    "63": "Dallas Mavericks: NBA Rumors: Indiana Pacers Could Trade Myles Turner For Goran Dragic And A First Round Pick https://t.co/gckgMBqvdY",
    "64": "A blockbuster trade involving the Indiana Pacers and the Sacramento Kings. Two-time #NBAAllStar Domantas Sabonis is heading to the Kings as part of a six-player deal. 😱\n\nWhat do you think of the deal? 🤔\n#NBA #Kings #Pacers  https://t.co/gvTGul0Clr",
    "65": "Making sense of the shocking deal between the Sacramento Kings and Indiana Pacers https://t.co/aqpf3Vhw0E",
    "66": "THE INDIANA PACERS \nGreat move!",
    "67": "And the Indiana Pacers are your 2034 NBA Champions!",
    "68": "@soucekyoself It’s no Indiana Pacers Tyrese Haliburton bandwagon",
    "69": "Buddy Hield on the Indiana Pacers may be one of the weirdest uniform looks ever.",
    "70": "Wow did not see this coming !!\n\nIndiana Pacers, Sacramento Kings work six-player trade that includes Domantas Sabonis, Tyrese Haliburton, sources say\n\n#NBA #trade #sabonis #basketball #tyresehaliburton https://t.co/xGG3QSFV0c",
    "71": "The Indiana Pacers, Sacramento Kings send shockwaves through the rest of the NBA with a blockbuster trade ahead of the deadline https://t.co/kI5seyK6e2",
    "72": "'Welcome to Basketball Hell': Kings fans beside themselves after trade with Pacers #Indiana #Pacers #NBA https://t.co/KxrZpObNo1",
    "73": "The @IndianaPacers are trading Domantas Sabonis, Jeremy Lamb, and Justin Holiday to the @SacramentoKings for Tyrese Haliburton, Buddy Hield, and Tristan Thompson. The trade was confirmed by @wojespn. \n\n#NBA #NBATradeDeadline #Pacers #Kings",
    "74": "Former Oshkosh North star Tyrese Haliburton traded to Indiana Pacers https://t.co/Mj94WuOvwK",
    "75": "Former Oshkosh North star Tyrese Haliburton traded to Indiana Pacers https://t.co/9tKOwkVmju",
    "76": "Your Indiana #Pacers: https://t.co/2OSjEgfwIQ",
    "77": "Former Oshkosh North star Tyrese Haliburton traded to Indiana Pacers https://t.co/BmoMAVZmda",
    "78": "Andy Vermaut shares:Pacers put together new look in 6-player deal with Kings: The Indiana Pacers traded two-time All-Star Domantas Sabonis to the Sacramento Kings on Tuesday in a… https://t.co/pxHd1PEaz6 Thank you. #ThankYouJournalistsForTheNewsWeGetFromYou #AndyVermautThanksYou https://t.co/TLk8Q32g9W",
    "79": "Former Oshkosh North star Tyrese Haliburton traded to Indiana Pacers https://t.co/MB7uAo3TMn",
    "80": "The Indiana Pacers are trading two-time All-Star Domantas Sabonis to the Sacramento Kings in a 6-player deal. https://t.co/BVHC4BhEqO",
    "81": "Indiana Pacers mood right now https://t.co/QcvWnSTnRK",
    "82": "Indiana Pacers trade Domantas Sabonis, Justin Holiday, Jeremy Lamb to Sacramento Kings - USA TODAY https://t.co/ObJJPK7k9x",
    "83": "Former Oshkosh North star Tyrese Haliburton traded to Indiana Pacers https://t.co/Y9KlE9pfWa",
    "84": "Former Oshkosh North star Tyrese Haliburton traded to Indiana Pacers https://t.co/iY5hYzU4WD",
    "85": "Former Oshkosh North star Tyrese Haliburton traded to Indiana Pacers https://t.co/98dYHvh0qm",
    "86": "Former Oshkosh North star Tyrese Haliburton traded to Indiana Pacers https://t.co/jUNyB2dJIU",
    "87": "Sacramento Kings trade Buddy Hield to Indiana Pacers in six-player trade, per report – NBA News https://t.co/KYhzTmmXL6",
    "88": "Former Oshkosh North star Tyrese Haliburton traded to Indiana Pacers https://t.co/OOWMqxEXN6",
    "89": "The Atlanta Hawks Are About To Destroy The Indiana Pacers Tonight.",
    "90": "Former Oshkosh North star Tyrese Haliburton traded to Indiana Pacers https://t.co/Z4vZcQ7By1",
    "91": "INDIANAPOLIS (AP) — The Indiana Pacers traded two-time All-Star Domantas Sabonis to the Sacramento Kings on Tuesday in a 6-player deal, a person with direct knowledge of the details confirmed to The Associated Press. https://t.co/U3j6JrYIls",
    "92": "Former Oshkosh North star Tyrese Haliburton traded to Indiana Pacers https://t.co/9RSuo8slKW",
    "93": "REPORT: Oshkosh North grad Tyrese Haliburton to be traded to Indiana Pacers https://t.co/tTyNR71b61",
    "94": "The Indiana Pacers are trading two-time All-Star Domantas Sabonis to the Sacramento Kings in a 6-player deal. https://t.co/pnbDUUXq84",
    "95": "The Indiana Pacers made fools of the Sacramento Kings in the Domantas Sabonis trade sweepstakes. They've also set themselves up for years of contention with a brilliant stroke of genius.\n\n#NBATradeDeadline | #Pacers | #SacramentoProud | @getsMart_5  https://t.co/njPPpDASIv",
    "96": "The Sacramento #Kings are trading Tyrese Haliburton, Buddy Hield and Tristan Thompson to the Indiana #Pacers for Domas Sabonis, Jeremy Lamb, Justin Holiday and 2027 second-round pick \n\n#NBA #SacramentoProud #AlwaysGame #3ptcnvrsn https://t.co/2kua8DtjCX",
    "97": "🚨 TRADE ALERT 🚨\n\nIndiana Pacers are trading Domantas Sabonis to Sacramento Kings for a Tyrese Haliburton package! \n\nPacers also land sharp shooter Buddy Hield and Tristian Thompson.\n\nVia Adrian Wojnarowski\n\n#domantassabonis #tyresehaliburton #indianapacers #sacramentokings https://t.co/pFESnup54a",
    "98": "Good afternoon, \n\nI now pull for the Indiana Pacers. I go where Buddy goes.",
    "99": "The Indiana Pacers have traded Domantas Sabonis, Jeremy Lamb and Justin Holiday to the Sacramento Kings for Tyrese Halliburton, Buddy Hield and Tristan Thompson. Big blockbuster trade as we near closer to the trade deadline. #NBATradeDeadline #Kings #Pacers #RTBNNews https://t.co/JYZwQayck1",
    "100": "2022-02-08\nAtlanta Hawks(-12.5) - Indiana Pacers(+12.5): \nBet on Atlanta Hawks -12.5\n\n2022-02-08\nPhiladelphia 76ers(-1.5) - Phoenix Suns(+1.5): \nBet on Philadelphia 76ers -1.5\n\n#NBA #bettingtwitter #bettingsports",
    "101": "5 things to know about Pacers trade acquisition Tristan Thompson #Indiana #Pacers #NBA https://t.co/W8ARrlWk7W",
    "102": "MY WORST TAKE EVER! Reacting To Tyrese Haliburton Indiana Pacers Highlights https://t.co/oFLspdIaup via @YouTube",
    "103": "Great to see Indiana @Pacers player T.J. Warren out at Gainbridge Fieldhouse today to take in some Mad Ants basketball! https://t.co/74osP6AmWu",
    "104": "Tyrese Haliburton, Indiana Pacers.\n\nhttps://t.co/0vKy4ZCk6p",
    "105": "⚠️ TRASPASO NBA ⚠️\n\n• Sacramento Kings recibe: Domantas Sabonis, Jeremy Lamb y Justin Holiday.  \n\n• Indiana Pacers recibe: Tyrese Haliburton, Buddy Hield y Tristan Thompson.",
    "106": "The Indiana Pacers traded two-time All-Star Domantas Sabonis to the Sacramento Kings on Tuesday in a 6-player deal, a person with direct knowledge of the details confirmed to The Associated Press. https://t.co/BM0cjsZDGv",
    "107": "His skillset will be highlighted now bc ppl will see it now playing on the east coast. nobody watched him in sac. them games was coming on at 10:30pm  RT @espn: Tyrese Haliburton is headed to the Indiana Pacers.\n\n(via @wojespn) https://t.co/yU3qsA4CE9",
    "108": "\"The idea that [the Indiana Pacers] could get Tyrese Haliburton in a trade I think even exceeded Indiana's expectations.\" (via @wojespn) https://t.co/idzFDFlp5o",
    "109": "Former Oshkosh North star Tyrese Haliburton traded to Indiana Pacers https://t.co/pf90wSlX0G",
    "110": "Former Oshkosh North star Tyrese Haliburton traded to Indiana Pacers https://t.co/VluR3j78kl",
    "111": "Former Oshkosh North star Tyrese Haliburton traded to Indiana Pacers https://t.co/8RnUIenIve",
    "112": "Former Oshkosh North star Tyrese Haliburton traded to Indiana Pacers https://t.co/a7QMduAdtF",
    "113": "Former Oshkosh North star Tyrese Haliburton traded to Indiana Pacers https://t.co/rPBo9FP0w9",
    "114": "Report: Sacramento Kings Trading Tyrese Haliburton, Buddy Hield And Tristan Thompson To Indiana Pacers https://t.co/5nCXfpnRAG https://t.co/sWKIScvNzA",
    "115": "The @Pacers fan base is gonna love @TyHaliburton22. #sacramentokings #indianapacers",
    "116": "AP source: The Indiana Pacers have traded two-time All-Star Domantas Sabonis, Justin Holiday, Jeremy Lamb and a second-round pick to the Sacramento Kings for Tyrese Haliburton, Buddy Hield and Tristan Thompson.\n\nby @apmarot \n https://t.co/uilSRG8uv0",
    "117": "@TyHaliburton22 best of luck in Indiana my brotha 🙏🏽‼️ \n\n#tyresehaliburton #sacramentokings #indianapacers https://t.co/pBFKFIPxUx",
    "118": "Blockbuster Sacramento Kings and Indiana Pacers Trade Breakdown 🤯\n\nIf you haven't heard the news yet, the Kings have traded Tyrese Haliburton, Buddy Hield and Tristan Thompson to the Pacers for Domantas Sabonis, Jeremy Lamb, and Justin Holiday. \n\nMy … https://t.co/XuFnkYbVPr https://t.co/ZsoVZLOuhJ",
    "119": "For 30 years, the Indiana Pacers have been phenomenal at reinventing themselves with very few losing seasons (even after catastrophes).  You don't have that sustained success by accident.  Reggie/Davis/Smits &gt; Artest/SJax/J'Oneal/Tinsley &gt; PG/West/G.Hill/Granger https://t.co/G1U0xEw015",
    "120": "Indiana Pacers trade Domantas Sabonis, Justin Holiday, Jeremy Lamb to Sacramento Kings https://t.co/I4QKwPlETn #sports #feedly",
    "121": "Indiana Pacers, Sacramento Kings work six-player trade that includes Domantas Sabonis, Tyrese Haliburton, sources say https://t.co/pfGP9eRhR0",
    "122": "🚨TRADE ALERT 🚨\n\nThe Indiana Pacers are trading Domantas Sabonis, Jeremy Lamb, Justin Holiday, and a 2027 second-round pick to the Sacramento Kings for Tyrese Haliburton, Buddy Hield, and Tristan Thompson 👀\n\n#NBA #NBATwitter #GoldBlooded #SacramentoProud https://t.co/kzjmChUJiX",
    "123": "Woj: Myles Turner's Future to Be Significantly Impacted by Sabonis-Haliburton Trade #Indiana #Pacers #NBA https://t.co/aMXmLVdeJU",
    "124": "A #Blockbuster #Deal has been made between the #IndianaPacers and the #SacramentoKing. #NBA75 #GoldBlooded #Kings👑 https://t.co/rnd57OFRKz",
    "125": "Went offline and Bloom Sacramento Kings trade Tyrese Haliburton to Indiana Pacers. Whaaaaat",
    "126": "Just now, @esidery on JMV says that Thompson WILL NOT play a game with the Indiana Pacers.",
    "127": "The Indiana Pacers are sending Domantas Sabonis, Jeremy Lamb, and Justin Holiday to the Sacramento Kings for Tyrese Haliburton, Buddy Hield, and Tristan Thompson. https://t.co/e4pnTHv34S",
    "128": "🚨 TRADE ALERT\n\nSacramento Kings:\n✅ Domantas Sabonis \n✅ Jeremy Lamb\n✅ Justin Holiday\n✅ 2nd round pick (2027)\n\nIndiana Pacers:\n✅ Tyrese Haliburton\n✅ Buddy Hield\n✅ Tristan Thompson \n\nℹ️ @wojespn\n\n#NBA75 #NBApl #Sacramento #Pacers https://t.co/Elyf8pnY0t",
    "129": "Chicago Bulls may be able to go after Tristan Thompson from the Indiana Pacers now. Any rules say we can't?",
    "130": "A look at the current Pacers roster #Indiana #Pacers #NBA https://t.co/7fbBmCQ8jB",
    "131": "Winners, losers from blockbuster Tyrese Haliburton and Domantas Sabonis trade https://t.co/v5USxMwXzH #NBA #IndianaPacers #SacramentoKings",
    "132": "@Vada_Fly How!? Who tf did tha Indiana Pacers get??",
    "133": "🚨 NBA Trade Alert 🚨\n\n▪️ Sacramento Kings acquire: Domantas Sabonis, Justin Holiday and Jeremy Lamb\n\n▪️ Indiana Pacers acquire: Tyrese Haliburton, Buddy Hield, and Tristan Thompson\nhttps://t.co/A8ITMsShfa",
    "134": "BREAKING: The Indiana #Pacers have traded Domantas Sabonis to the Sacramento Kings. What the Pacers got in return and how it impacts their future. \n\nMyles Turner \"gets to play center now and appears thrilled with the idea of playing with Haliburton\":\nhttps://t.co/wO1GudH5tW",
    "135": "@wojespn Tyrese Haliburton finding out he is headed to the Indiana Pacers. https://t.co/lOYehvjLWk",
    "136": "By acquiring Haliburton, Buddy Hield and having a shooter like Duarte, Indiana Pacers can be easily the East’s version to GSW. With an elite big man in Myles Turner.",
    "137": "NEW: The Indiana #Pacers make a blockbuster trade with the Sacramento Kings, moving 2x All-Star, Domantas Sabonis. Here's what the Pacers got in return and my thoughts on the trade:\nhttps://t.co/Q1dHCTCDhH",
    "138": "Indiana Pacers better draft Chet Holmgren after all this shit is said and done",
    "139": "BCAP7W6P\n\nOver 122.5\nAtlanta Hawks v Indiana Pacers\nAtlanta Hawks total 122.5\n2.30\n\n Over 120.5\nLos Angeles Lakers v Milwaukee Bucks\nMilwaukee Bucks total120.5\n2.25\n\n Over 121.5\nSacramento Kings v Minnesota Timberwolves\nMinnesota Timberwolves total 121.5\n2.20\n\n11.50 ODD",
    "140": "@TheBayBR Roubos. O Indiana Pacers recebe: \nTyrese Haliburton \nBuddy Hield \nTristan Thompson\n\nO Sacramento Kings recebe:\n\nDomantas Sabonis\nJeremy Lamb\nJustin Holiday\nEscolha de Draft de 2° Rodada de 2027",
    "141": "Indiana Pacers, Sacramento Kings work six-player trade that includes Domantas Sabonis, Tyrese Haliburton, sources say - ESPN https://t.co/uXsHUFE6Ls",
    "142": "Things you’ll never see in Indiana: \nPacers championship \nMyles Turner getting any bitches",
    "143": "Pacers trade Sabonis, Lamb, Holiday to Kings for Haliburton, Hield, Thompson #Indiana #Pacers #NBA https://t.co/aMeInLvTsL",
    "144": "The Indiana Pacers front office was def like, 'The Kings want Sabonis, we should ask for Haliburton.'\nThat was then followed by a 'Holy shit! they're going to give us Haliburton'",
    "145": "Indiana Pacers- bad at basketball. Good at cloning. https://t.co/CRq9Jv1Yf3",
    "146": "\"What's the reasoning behind this?\" 🤔\n\n@TheKevinWalsh &amp; @RightSideVP react to the Sacramento Kings acquiring Domantas Sabonis, Jeremy Lamb, and Justin Holiday from the Indiana Pacers for Tyrese Haliburton, Buddy Hield, and Tristan Thompson\n\n#GoldBlooded\n#SacramentoProud https://t.co/K5dRcUwsom",
    "147": "@StevieStacks84 Northwestern (ML) \nIllinois +5 \nPhoenix Suns +1.5\nNew Orleans Pelicans -9.5 \nIndiana Pacers +12.5",
    "148": "The @SacramentoKings have reportedly acquired Domantas Sabonis in a trade with the Indiana @Pacers, per ESPN’s Adrian Wojnarowski and The Sacramento Bee’s Jason Anderson.\n#NBA75 #trade #ESPN #Kings #Pacers https://t.co/HZ1q86xoDK",
    "149": "BCAP7LQL\n\n250.5+\nSacramento Kings v Minnesota Timberwolves\nPoint range\n6.50\n\n 250.5+\nLos Angeles Lakers v Milwaukee Bucks\nPoint range\n6.70\n\n 250.5+\nAtlanta Hawks v Indiana Pacers\nPoint range\n10.50\n\n456 ODD\nSINGLE",
    "150": "#RT @espn: Tyrese Haliburton is headed to the Indiana Pacers.\n\n(via @wojespn) https://t.co/NRTaV8zEQT",
    "151": "5 things to know about Pacers trade acquisition Tyrese Haliburton #Indiana #Pacers #NBA https://t.co/i4bLjqw6oS",
    "152": "Former Iowa State guard Tyrese Haliburton is traded to the Indiana Pacers and comes back closer to home! https://t.co/86oE4BpBo7",
    "153": "Indiana pacers front office plays chess not checkers",
    "154": "I love this for the Pacers. Myles Turner is a keeper now unless you get a godfather offer. Great fit with Haliburton and Duarte.\n\nIndiana Pacers are building a very good foundation. https://t.co/wLam6nRzpz",
    "155": "I am once again happy to be a fan of Indiana Pacers basketball. https://t.co/9HHkSHwGyB",
    "156": "🚨 Domantas Sabonis Sacramento Kings'e takas oldu!\n\nDomantas Sabonis, Jeremy Lamb, Justin Holiday ➡️ Sacramento Kings\n\nTyrese Haliburton, Buddy Hield, Tristian Thompson ➡️ Indiana Pacers\n\n(via @wojespn) https://t.co/6UpkDuAFb2",
    "157": "This trade is the most hopeful I've been about the Indiana pacers since Paul George was on the roster",
    "158": "Tyrese Haliburton and Isaiah Jackson are perfect for each other. The Indiana Pacers could potentially land a top 3 pick and get one of Paolo, Chet, or Jabari. The future may be very bright in Indiana.",
    "159": "Indiana Pacers, Sacramento Kings work six-player trade that includes Domantas Sabonis, Tyrese Haliburton, sources say\nhttps://t.co/6Vj1PvwCSR\nhttps://t.co/6Vj1PvwCSR",
    "160": "Indiana Pacers, Sacramento Kings work six-player trade that includes Domantas Sabonis, Tyrese Haliburton, sources say https://t.co/xAWBpQMpOg",
    "161": "@JeremyNicolls The Indiana Pacers in exchange for Malcom Brogdon",
    "162": "Indiana Pacers, Sacramento Kings work six-player trade that includes Domantas Sabonis, Tyrese Haliburton, sources say https://t.co/t1CdpVjsQ9",
    "163": "Indiana Pacers, Sacramento Kings work six player trade that includes Domantas Sabonis, Tyrese Haliburton, sources say https://t.co/3LaDuRH4GX https://t.co/obbZqDvdkW",
    "164": "Indiana Pacers trade Domantas Sabonis, Justin Holiday, Jeremy Lamb to Sacramento Kings https://t.co/tR4kmNxzi2",
    "165": "Indiana Pacers, Sacramento Kings work six-player trade that includes Domantas Sabonis, Tyrese Haliburton, sources say https://t.co/dtSnhYlUVC https://t.co/Tokkyvi9CL",
    "166": "The Indiana Pacers absolutely finessed the Sacramento Kings with getting Tyrese Haliburton.",
    "167": "NBA Trade Tracker: Indiana Pacers Making Moves https://t.co/6Yhu59hJU5",
    "168": "@YasukeBlack @ChrisKirschner Ikr, that's why I fried us some chicken,  we're gonna be starving by the time five o'clock comes around. \n\nLet's Go Hawks Fans!!!  Let's Go Hawks!!!  Beat Indiana Pacers!!!\n\n🍿 🍿 🍿 🍒 Cokes",
    "169": "Kris Jenner must have called in a favor to get tired Tristan Thompson out of California and traded to the Indiana Pacers https://t.co/2Sa1Vv0X7O",
    "170": "Indiana Pacers got a bright future now. A rebuild fresh and the draft is coming. Meanwhile Sacramento is still in the gutter. The Kings ainT it since Chris Webber got the boot kick out the door",
    "171": "The Sacramento Kings drove the green by drafting Tyrese Haliburton out of Iowa State with the 12th overall pick.\n\nThey 4-putt for bogey by trading him to the Indiana Pacers.",
    "172": "hi we are the Indiana Pacers! Where your nba career goes to die!!!",
    "173": "Glue guy Tristan Thompson on the move again! ⁦@ryenarussillo⁩ ⁦@Ceruti⁩\n\n Indiana Pacers, Sacramento Kings work six-player trade that includes Domantas Sabonis, Tyrese Haliburton, sources say https://t.co/SlppEdbPud",
    "174": "NBA Trade Tracker: Indiana Pacers Making Moves https://t.co/cFUimsLSt0",
    "175": "This trade will include Myles Turner going to the Golden State Warriors and the Indiana Pacers getting assets, sources tell ESPN.",
    "176": "Tyrese Haliburton is headed to the Indiana Pacers.\n\n(via @wojespn) https://t.co/LxYWcrQiaW",
    "177": "The Indiana Pacers literally blew up that entire team… I don’t think I remember a time where they did this lol",
    "178": "The Indiana #Pacers are totally going to tank for Jabari Smith, Chet Holmgren, or Paolo Banchero in the 2022 NBA draft. Haliburton would be a great fit with any of those bigs.",
    "179": "The Indiana Pacers , should be ashamed of themselves.  \n\n#NBATradeDeadline",
    "180": "The Golden State Warriors are finalizing a trade with the Indiana Pacers, sources tell ESPN",
    "181": "Report: Domantas Sabonis to Kings, Tyrese Haliburton to Pacers in 6-Player Trade #Indiana #Pacers #NBA https://t.co/k98Askdacs",
    "182": "like sure “Indiana Pacers” but that shit was four hours away versus two 🤷🏻‍♀️",
    "183": "THE INDIANA PACERS HAVE CLONING TECHNOLOGY https://t.co/2XWQ531wNo",
    "184": "As far as Rebuilding Indiana Pacers did a Hell of a job",
    "185": "Tyrese Halliburton, future of the Indiana Pacers",
    "186": "Indiana Pacers is really trading Domantas Sabonis? Wow",
    "187": "Former #Sooners guard Buddy Hield is reportedly being traded from the Sacramento Kings to the Indiana Pacers.\n\nhttps://t.co/ODrv0H5iKN",
    "188": "@schmitty111 Like the Indiana pacers? I believe it was a car.",
    "189": "When does the Indiana pacers play their next game I want to watch buddy heild go off",
    "190": "Reports: Kings trade Haliburton, Hield, Thompson to Indiana Pacers https://t.co/fuPqIgFYUu",
    "191": "A big trade for these two teams, the Indiana Pacers have traded Domantas Sabonis, Jeremy Lamb, and Justin Holiday to the Sacramento Kings for Buddy Heild, Tyrese Haliburton, and Tristan Thompson. Things are getting crazy real quick!!\n\n#IndianaPacers #SacramentoKings https://t.co/KD7JCemaOy",
    "192": "@Coach_CombsDC @DCcoachBubba72 @Pacers For reference the Indiana Pacers are the only team in the NBA without a “lottery pick” (pick 1-14 I think) since 1990",
    "193": "NATIONAL BASKETBALL ASSOCIATION: The Indiana Pacers have landed former Iowa State star Tyrese Haliburton in a trade with the Sacramento Kings.  https://t.co/rYoCF0c2It",
    "194": "NATIONAL BASKETBALL ASSOCIATION: The Indiana Pacers have landed former Iowa State star Tyrese Haliburton in a trade with the Sacramento Kings.  https://t.co/OiyAYjmyZh",
    "195": "Domantas Sabonis trade: Pacers send him to Kings for Tyrese Haliburton, Buddy Hield #Indiana #Pacers #NBA https://t.co/5ZjMorcXH1",
    "196": "The Indiana Pacers somehow got the best/youngest player you could get to start a rebuild around, and somehow their fan base is going to be happier tonight than a lot of people in Sacramento.",
    "197": "Indiana pacers just did a drive by on the kings and robbed them 🤣",
    "198": "Check out 2016-17 Panini Donruss Kings Caris LeVert #17 INDIANA PACERS FREE SHIPPING https://t.co/ICVW7Kco2k @eBay",
    "199": "JUST IN: The Indiana Pacers are trading away All-Star power forward Domantas Sabonis to the Sacramento Kings as part of a deal that involves six players, ESPN's Adrian Wojnarowski reported. https://t.co/r6uvStzkeO",
    "200": "Indiana Pacers depth chart when healthy:\n\n• PG: Brogdon\n• SG: Haliburton\n• SF: Hield\n• PF: Craig\n• C: Turner (?)\n\n- Bench: Duarte, Lance, yeah. \n\n#Pacers",
    "201": "Check out 2016-17 Panini Donruss Optic Caris LeVert RC #167 INDIANA PACERS FREE SHIPPING https://t.co/nbf2fbBmC0 @eBay",
    "202": "Check out Caris Levert 2016-17 Donruss INDIANA PACERS FREE SHIPPING #167 ROOKIE https://t.co/8HGeDBEYjs @eBay",
    "203": "Check out 2016-17 DOMANTAS SABONIS PANINI STUDIO RC #78 INDIANA PACERS FREE SHIPPING https://t.co/yBi6NpPVaR @eBay",
    "204": "Check out 2016-17 Donruss Domantas Sabonis RC #161 INDIANA PACERS THUNDER FREE SHIPPING https://t.co/uSdcI3O0Sx @eBay",
    "205": "Although Buddy Held was just traded to the Indiana Pacers, in the deal with Sac-Indy deal with Haliburton, Duarte, I wonder if Held is moved again in the next 48 hours?",
    "206": "Check out 2016-17 Panini Complete #341 Domantas Sabonis RC Rookie INDIANA PACERS https://t.co/GMlUkGEeEz @eBay",
    "207": "The Indiana Pacers trade Domantas Sabonis, Jeremy Lamb &amp; Justin Holiday to the Sacramento Kings for Tyrese Haliburton, Buddy Hield &amp; Tristan Thompson (via @wojespn) https://t.co/2S2fUepnot",
    "208": "CAMBIO ‼️\n\nSacramento Kings adquiere : \n\n• Domas Sabonis\n• Jeremy Lamb \n• Justin Holiday \n\nIndiana Pacers adquiere : \n\n• Tyrese Hailburton \n• Buddy Hield \n• Tristan Thompson \n\n#NBAEnHDN https://t.co/rMTEDjxqdP",
    "209": "BREAKING: The Indiana Pacers have made a blockbuster trade with the Sacramento Kings. The trade details are as follows:\n\nKings Receive: Domantas Sabonis, Jeremy Lamb, and Justin Holiday\n\nPacers Receive: Tyrese Haliburton, Buddy Hield, and Tristan Thompson\n\nWOW!!!",
    "210": "Kings general manager Monte McNair made his move Tuesday, acquiring two-time All-Star Domantas Sabonis from the Indiana Pacers.  https://t.co/JiDu5UD9jE",
    "211": "Tyrese Halliburton and Chris Duarte in the backcourt is how you rebuild properly.\n\nBravo Indiana #Pacers. #NBA #NBATradeDeadline",
    "212": "Indiana Pacers the greatest ISU alumni franchise of all time?\n• Jamaal Tinsley \n• Fred Hoiberg\n• Georges Niang\n• Tyrese Haliburton",
    "213": "@wojespn How did the Indiana Pacers end up with 2 Jeremy Lambs?",
    "214": "Analyzing Tuesday’s Indiana Pacers at Atlanta Hawks odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/l85jjIhGwl",
    "215": "Report: Sacramento Kings Trading Tyrese Haliburton, Buddy Hield And Tristan Thompson To Indiana Pacers https://t.co/RMJa8db4Qr https://t.co/NOklgAxMkI",
    "216": "🚨 Line Change 🚨\n\nIndiana Pacers @ Atlanta Hawks\nTue 7:40 PM EST\n\nFrom:\nATL -10.5 -110\n\nTo:\nATL -12.0 -105",
    "217": "The Indiana #Pacers are trading Domas Sabonis, Jeremy Lamb and Justin Holiday to the Sacramento #Kings in exchange for Tyrese Haliburton, Buddy Hield and Tristan Thompson, sources told ESPN's Adrian Wojnarowski on Tuesday. 🏀 #NBATwitter #NBA  https://t.co/auZO3mKtKX",
    "218": "Kings general manager Monte McNair made his move Tuesday, acquiring two-time All-Star Domantas Sabonis from the Indiana Pacers. https://t.co/yuUbRWSD86",
    "219": "@JillAdge The @SacramentoKings will receive a 2027 2nd round pick from the Indiana Pacers.",
    "220": "Kings general manager Monte McNair made his move Tuesday, acquiring two-time All-Star Domantas Sabonis from the Indiana Pacers. https://t.co/WRXtoWD9VZ",
    "221": "Consensus Line Move:\n2022-02-08 Indiana Pacers at Atlanta Hawks from -10.50 to -12.00\n#TrueToAtlanta Lets Go!\n#NBA #sportsbets #tech #bitcoins",
    "222": "Sources: Kings make blockbuster trade to acquire Indiana Pacers All-Star Domantas Sabonis\n\nhttps://t.co/5bJwuWFY9m",
    "223": "How come really good guards that seem to just be unwanted by all there prior teams end up on the Indiana Pacers (oladipo, levert, now Halliburton) \n\nCalling it now, Sexton signs there this offseason",
    "224": "Sacramento Kings acquire Domantas Sabonis from the Indiana Pacers in NBA blockbuster trade https://t.co/RQblCUjX1y",
    "225": "BOMBAZO!💣\n\nSacramento Kings recibe a: Domantas Sabonis, Jeremy Lamb y Justin Holiday.\n\nIndiana Pacers recibe a: Tyrese haliburton, Buddy hield y Tristan thompson. https://t.co/ZiA9N6f3Bm",
    "226": "Are the Indiana Pacers prepping to build a superior Defense around Turner &amp; Halliburton? \n\nIf so… I love it.\n\nThey need an identity \n\n#Pacers",
    "227": "hold on now…. Jaden Ivey to Indiana pacers now we might be talking. Haliburton and Ivey https://t.co/1oLtjOw2Hg",
    "228": "TRADE ALERT:\nIndiana Pacers trade - Domantas Sabonis, Jeremy Lamb, Justin Holiday, 2027 second-round pick\nfor\nSacramento Kings - Tyrese Haliburton, Buddy Hield, and Tristan Thompson",
    "229": "The Indiana #Pacers have now traded Caris LeVert &amp; Domantas Sabonis and with the addition of Tyrese Haliburton, you would think Malcom Brogdon could be on the move. #Knicks fans, what we doing??",
    "230": "@TimMaxwell22 For the Indiana Pacers",
    "231": "The Toronto Raptors are sending G Justin Holl and C Nick Ritchie to the Indiana Pacers for F Myles Turner, sources say.",
    "232": "The Indiana pacers actually won a trade",
    "233": "Domantas Sabonis headed to Sacramento Kings in blockbuster trade involving Tyrese Haliburton https://t.co/xa1S0lxPIM #NBA #IndianaPacers #SacramentoKings",
    "234": "great day to be a fan of the indiana pacers",
    "235": "The Indiana Pacers are trading Domantass Sabonis, Jeremy Lamb and Justin Holiday to the Sacramento Kings in exchange for Tyrese Haliburton, Buddy Hield and Tristan Thompson, sources told ESPN's Adrian Wojnarowski on Tuesday. #nbatrade #NBA",
    "236": "Multiple Sources confirm @wojespn report that the Sacramento Kings will acquire 2x All-Star Domantas Sabonis, Jeremy Lamb, Justin Holiday &amp; a future 2nd round pick from the Indiana Pacers in exchange for Tyrese Haliburton, Buddy Hield &amp; Tristan Thompson.",
    "237": "This #Bulls 2nd Round Drafted Rookie @AyoDos_11 single handedly broke up the Indiana #Pacers. https://t.co/9HKpapuvmm",
    "238": "That’s it. I am done being a fan of the Sacramento Kings. I have sat through decades of no playoff appearances, watching them draft Bagley over Luka only to see future star Haliburton traded to Indiana. I am taking my talents to the Indiana Pacers where they run a real franchise",
    "239": "Khloe Kardashian when she hears Tristan Thompson traded to Indiana Pacers? https://t.co/27iwQl3sEz",
    "240": "The Kings trading Tyrese Haliburton is awful. \n\nNobody won that trade between Indiana Pacers and Sacramento Kings",
    "241": "@tsnmike This is a very good trade by the Indiana Pacers.",
    "242": "The Indiana Pacers. \n\n“hey, at least we’re not the Kings”",
    "243": "Also not the best but not a bad return for Indiana. Pacers get a 21-year-old stud in Halliburton and a few other pieces. With all the moves they’re making, you can only wonder if Miles Turner is next. I feel like they could use some good draft picks. https://t.co/qecBu6WbXX",
    "244": "James Harden, Indiana Pacers legend",
    "245": "@maxvrambout @LakersNation Indiana Pacers got Buddy Hield and Sacramento Kings got Domas Sabonis.",
    "246": "https://t.co/7gYWVkAvh8\n\nThe Indiana Pacers are trading two-time All-Star big man Domantas Sabonis to the Sacramento Kings for a package that will include second-year guard Tyrese Hali... @YahooSportsNBA",
    "247": "🚨 TRASPASO 🚨 \n\nA Sacramento Kings: Domantas Sabonis, Jeremy Lamb, Justin Holiday\n\nA Indiana Pacers: Tyrese Haliburton, Buddy Hield, Tristan Thompson https://t.co/mFqpqsB98Q",
    "248": "https://t.co/7gYWVkAvh8\n\nThe Indiana Pacers are trading two-time All-Star big man Domantas Sabonis to the Sacramento Kings for a package that will include second-year guard Tyrese Hali...",
    "249": "Sacramento basically traded their best young piece to become the Indiana Pacers.\n\nI feel bad for Domas because there aren’t going to be any fans of that team left.",
    "250": "Trade Grade: Indiana Pacers Trade Caris LeVert Traded to the Cleveland Cavaliers https://t.co/DRg7gUqaZr",
    "251": "🚨TRADE ALERT🚨\n\nSacramento Kings Receive;\nDomantas Sabonis\nJeremy Lamb\nJustin Holiday \n\nIndiana Pacers Receive: \nTyrese Hailburton\nBuddy Hield\nTristan Thompson \n\nGrade this trade! #NBATwitter \n\n(Via. @wojespn) https://t.co/tNqmCJ4P6R",
    "252": "The Indiana Pacers got a really nice haul. Tyrese Haliburton has a bright future.",
    "253": "@Heart2StartKev This should’ve been Fox to Indiana. Pacers know they got over on us. I’ll still root for Tyrese Haliburton",
    "254": "Sacramento Kings fans after trading Tyrese Haliburton to Indiana Pacers? https://t.co/aIE1Ns4dAH",
    "255": "The Indiana Pacers will receive. #Pacers \n\nTyrese Haliburton\nBuddy Hield\nTristan Thompson",
    "256": "The Indiana Pacers are trading Buddy Hield to the Boston Celtics on the three-team deal with the Sacramento Kings, sources tell ESPN.",
    "257": "Absolute highway robbery by the Indiana Pacers",
    "258": "With the first overall pick, the Indiana Pacers select… Paolo Banchero, Forward, Duke.",
    "259": "The Sacramento Kings have traded Tyrese Haliburton, Buddy Hield and Tristan Thompson to the Indiana Pacers in return for All-Star center Domantas Sabonis, Justin Holiday and Jeremy Lamb, per @wojespn \nhttps://t.co/keqM0SWPVE",
    "260": "Indiana Pacers: Play hardly for Jabari…. Don’t fret, we might get Chet!",
    "261": "🔴 TEMOS MAIS UMA TROCA!!!\n\nIndiana Pacers recebe: Tyrese Haliburton, Buddy Hield e Tristan Thompson\n\nSacramento Kings recebe: Domantas Sabonis, Jeremy Lamb e Justin Holiday\n\n(Via @wojespn)",
    "262": "@TyHaliburton22 I guess this means I need to become an Indiana Pacers fan. 😢 I'm 💔.",
    "263": "Ain’t no way “The Indiana Pacers” made a good trade! Rip Sabonis, wish you could’ve went to a way better team https://t.co/2GwillkWBo",
    "264": "@_JasonLT Buddy Hield has been traded to the Indiana Pacers. 👍\nNo more Buddy Hield talk for Laker fans.",
    "265": "The Sacramento Kings are trading Tyrese Haliburton and Buddy Hield to the Indiana Pacers for a package that includes Domantas Sabonis. #Kings #Pacers https://t.co/tVagByR31B",
    "266": "@picknpod @bruceely The Indiana Pacers are trading Domantas Sabonis, Jeremy Lamb and Justin Holiday to the Sacramento Kings for Tyrese Haliburton, Buddy Hield and Tristan Thompson",
    "267": "NBA Game Preview: The Atlanta Hawks have a forecast 78% chance to win against The Indiana Pacers with a spread of -12/12 and an over/under of 224. The Atlanta Hawks are 1 - 0 against The Indiana Pacers in the 2021-22 Season.\n#sharpbets\n#sportbetting",
    "268": "Report: Former Oklahoma Star Buddy Hield Traded to Indiana Pacers\n#Sooners\nhttps://t.co/r0GKDE14tF",
    "269": "The @SacramentoKings are reportedly acquiring Domantas Sabonis from the Indiana Pacers, per @wojespn.\n\nFrom December: Why the Pacers Are Giving Potential Suitors a Blueprint for How Not to Use Domantas Sabonis, writes @jackfrank_jjf \nhttps://t.co/8ye9MN7At8",
    "270": "There truly is a God. And today, he loves the Indiana Pacers.",
    "271": "Report: Former Oklahoma Star Buddy Hield Traded to Indiana Pacers\n#Sooners\nhttps://t.co/qE91O954gY",
    "272": "The Indiana Pacers have done it! \n\nThe Indiana Pacers have traded Domantas Sabonis, Jeremy Lamb and Justin Holiday to the Sacramento Kings!\n\nIn return we got Tyrese Haliburton! Buddy Hield and Tristan Thompson. This is actually crazy!",
    "273": "Report: Former Oklahoma Star Buddy Hield Traded to Indiana Pacers https://t.co/NJ7t9fzx4I #Sooners",
    "274": "It appears Tyrese Haliburton is now a member of the Indiana Pacers. At least he will be in Milwaukee more often.",
    "275": "@WisBBYearbook @skcreno27 \nBREAKING NEWS:\nFormer Oshkosh North standout Tyrese Haliburton has been traded today from the Sacramento Kings to the Indiana Pacers as part of a 6-player deal, confirmed by ESPN's Adrian Wojnarowski.",
    "276": "The Indiana Pacers https://t.co/MoFk17ckoP",
    "277": "Even though I’m a Justin Holiday fan, I will remain loyal to my Indiana Pacers. I will also remain Justin Holiday SZN",
    "278": "Indiana Pacers making moves!\nhttps://t.co/suOLvy3MSp",
    "279": "indiana pacers to the ecf in 2024 remember this interview",
    "280": "The Indiana #Pacers have traded Domantas Sabonis, Jeremy Lamb, and Justin Holiday to Sacramento. They receive Tyrese Haliburton, Buddy Hield, and Tristan Thompson.\n\nWhat are your thoughts, Indiana?!",
    "281": "Tyrese Haliburton playing for Rick Carlisle should be fun. Might consider tuning in to watch an Indiana Pacers game sometime.",
    "282": "FOR THE INDIANA PACERS BABY LETS FUCKING GO https://t.co/netpMc44UN",
    "283": "@FairlyMagicMan Agree him and Duarte a nice start but it’s the Indiana pacers at the end of the day, hope they flip hield too",
    "284": "Halliburton and Duarte backcourt. With more assets still to collect\n\nThe Indiana Pacers know how to REBUILD",
    "285": "“Breaking: The Indiana Pacers are trading Domantas Sabonis, Jeremy Lamb and Justin Holiday to the Sacramento Kings for Tyrese Hailburton, Buddy Hield and Tristan Thompson, sources tell Adrian Wojnarowski.”",
    "286": "TRADE DETAILS:\n\nIndiana Pacers Receive: Tyrese Hailburton, Buddy Hield &amp; Tristan Thompson #GoldBlooded \n\nSacramento Kings Receive: Domantas Sabonis, Jeremy Lamb, Justin Holiday &amp; Draft Compensation #SacramentoProud",
    "287": "As a diehard Sacramento Kings fan since 2020 I am disgusted. I will be taking my fandom to the Indiana Pacers",
    "288": "ALERTA DE TROCA 🚨🚨\n\nSacramento Kings recebe:\n- Domantas Sabonis\n- Jeremy Lamb\n- Justin Holiday\n- Escolha de 2ª rodada de 2027\n\nIndiana Pacers recebe:\n- Tyrese Haliburton\n- Buddy Hield\n- Tristan Thompson\n\n🗞️ @wojespn \n\n#GoldBlooded https://t.co/mA1PLMtCTk",
    "289": "The Indiana Pacers: We try to find good fits for our players in trades.\n\nAlso The Indiana Pacers: ENJOY BEING A KING, DOMAS! https://t.co/90sGfyEBuP",
    "290": "Kings trading Tyrese Haliburton to the Indiana Pacers",
    "291": "The motto for the 2022 Indiana Pacers is simple:\n\n#TankForChet",
    "292": "Indiana Pacers have perfected cloning technology https://t.co/ewCOalm6uq",
    "293": "Developing story regarding the Indiana Pacers. Sabonis, Holiday, and Lamb are off to Sacramento. https://t.co/xjTtzTTTdG",
    "294": "FLASH NEWS: SABONIS AI KINGS👀\n\nI Pacers mandank Domas Sabonis, Jeremy Lamb e Holiday a Sacramento per Tyrese Hailburton, Buddy Hield e Tristan Thompson.\n\nChe ne pensi dello scambio?\n\n👇🏻👇🏻👇🏻\n\nhttps://t.co/LIQOpRr2UZ\n\n#nbapassion #sabonis #indianapacers https://t.co/0UVlYcHv2K",
    "295": "Indiana Pacers front office: https://t.co/iUGPV2O77Z",
    "296": "The winners of the trade deadline so far, by far, are the Indiana Pacers.",
    "297": "@fcbjosee They made a trade with the Indiana Pacers.",
    "298": "The Indiana Pacers are now cloning Lambs. https://t.co/eVKvLnij4v",
    "299": "Indiana Pacers star Domantas Sabonis is traded to the Sacramento Kings 😱\n\nWhich team won the trade?\n\nhttps://t.co/3bduIVP0bQ",
    "300": "🚨| BOMBA: O Indiana Pacers trocou Domantas Sabonis, Justin Holiday e Jeremy Lamb para o Sacramento Kings por Tyrese Haliburton, Buddy Hield e Tristan Thompson! \n\n[@wojespn] https://t.co/08xcFNWONZ",
    "301": "BREAKING: \n\nThe Sacramento #Kings have traded: \nTyrese Haliburton \nTristan Thompson \nBuddy Hield to the Indiana Pacers \n\nFOR \n\nDomantas Sabonis \nJeremy Lamb \nJustin Holiday (via @wojespn ) \n\n#NBATradeDeadline https://t.co/SlP2E8WIT5",
    "302": "The Indiana Pacers: https://t.co/zXccY8Q8EX",
    "303": "Breaking: Indiana Pacers first team to successfully clone player, both Jeremy Lambs involved in trade. https://t.co/fHUzrnqkMj",
    "304": "In the end, the Sacramento Kings had the most intriguing pieces to offer the rebuilding Indiana Pacers. The Kings were among the teams I had heard that were interested in Domantas Sabonis. Now they get their man and can focus on their next chapter. Myles Turner is next to go. https://t.co/523RjsouFc https://t.co/w6XjLD734x",
    "305": "Tyrese Haliburton is the definition of a young cornerstone player.\n\nThe Indiana Pacers are the winners of the trade deadline and it's not even close.",
    "306": "Indiana Pacers pod now https://t.co/v9lznx2nx0",
    "307": "In a related story, the Indiana Pacers have mastered cloning technology.... https://t.co/PyDRfNLf4D",
    "308": "🔴Basketball Live ~ Atlanta Hawks vs Indiana Pacers - NBA | 2022 💯\n🔗 🔴Watch Live Fullᴴᴰ 👉 : https://t.co/KkoiKUBWo0 ✅\n📆 :On Tuesday. February 08 /2022\n⏰ 01:30 GMT\nDONT FORGET TO RETWEET AND FOLLOW FOR MORE INFO AND UPDATE.",
    "309": "Sacramento Kings trading Tyrese Hailburton, Buddy Hield and Tristan Thompson to the Indiana Pacers for Domantas Sabonis, Jeremy Lamb and Justin Holiday, per sources. https://t.co/sKK3G88kUc",
    "310": "TROCA NA NBA\n\nO Sacramento Kings e o Indiana Pacers fecharam uma troca. \n\nKings envia: Tyrese Haliburton, Buddy Hield e Thristian Thompson.\n\nPacers envia: Domantas Sabonis, Justin Holiday e Jeremy Lamb.\n\n#NBA75 https://t.co/JPkwd5HwWR",
    "311": "#BREAKING: The Sacramento Kings have traded Tyrese Haliburton, Buddy Hield and Tristan Thompson to the Indiana Pacers for Domantas Sabonis, Jeremy Lamb and Justin Holiday. \n\n#Kings #Pacers",
    "312": "TAKAS GERÇEKLEŞTİ 🔥🔥🔥\n\nSacramento Kings ➡️ Domantas Sabonis, Jeremy Lamb, Justin Holiday\n\nIndiana Pacers ➡️ Tyrese Haliburton, Buddy Hield, Tristan Thompson https://t.co/B32jsTbt99",
    "313": "🚨🚨🚨Takas Var🚨🚨🚨\n\n🔷Sacramento Kings - Domantas Sabonis Jeremy Lamb ve Justin Holiday\n\n🔶Indiana Pacers - Tyrese Haliburton, Buddy Hield ve Tristan Thompson\nhttps://t.co/d3Ez9LSnfn",
    "314": "The Indiana Pacers did what? https://t.co/Ggcd0Crb8x",
    "315": "The #SacramentoKings traded Tyrese Halliburton in an amazingly shortsighted move.  I like Sabonis but the Kings ceiling is still pretty low.  Halliburton is legit though and the Pacers have a key piece moving forward.  #IndianaPacers #NBA #NBA75",
    "316": "The Indiana Pacers are sending Domas Sabonis, Jeremy Lamb, and Justin Holiday to the Sacramento Kings for Tyrese Halliburton, Buddy Hield, and Tristian Thompson, per @wojespn",
    "317": "🚨 BOMBA!!! 🚨\n\nO Indiana Pacers trocou Domantas Sabonis, Justin Holiday e Jeremy Lamb para o Sacramento Kings, por Tyrese Haliburton, Buddy Hield e Tristan Thompson. 😳\n\n🗞 @wojespn \n📸 Rocky Widner https://t.co/7luXzSTs4T",
    "318": "BREAKING: The Sacramento #Kings are trading Tyrese Haliburton, Buddy Hield and Tristan Thompson to the Indiana #Pacers for Domantas Sabonis, Jeremy Lamb and Justin Holiday per ESPN. #NBA",
    "319": "Today's NBA Picks: 7:40 PM ET - Indiana Pacers vs. Atlanta Hawks - 17 PICKS AVAILABLE: https://t.co/3D7qx5Uqrw #nba",
    "320": "The Indiana Pacers are captivated by Raptor’s sophomore guard Malachi Flynn. Though the Raptors are hesitant to deal him in a potential trade for Myles Turner. Expectation is that a deal will be done as long as Toronto is willing to give up the exciting young prospect. https://t.co/kOCbCysLio",
    "321": "On Sunday, the @cavs acquired Caris LeVert from the Indiana Pacers.\n\nHe joins a Cleveland team that currently is tied for third in the Eastern Conference.\n\n#LetEmKnow https://t.co/RW2oShbDZD",
    "322": "Per Sources: The Toronto Raptors and Indiana Pacers are in serious discussions on a trade centered around Goran Dragić and Myles Turner. The expectation is that the deal will involve Toronto’s 2022 first round pick, as well as Raptor’s sophomore guard Malachi Flynn. https://t.co/eGIzyfMAw4",
    "323": "\"The [New York] Knicks also discussed sending [Evan] Fournier's salary to the Indiana Pacers before the Pacers moved Caris LeVert to the Cleveland Cavaliers.\" (via @JakeLFischer) https://t.co/fqD8vHJgWJ",
    "324": "The Indiana Pacers believe they can get more for the 3 time block champion and all defensive talent. Many teams are said to be interested. A first round pick and a “promising young talent” is around the realm of what Chad Buchanan (Pacer’s GM) would be looking for. Per sources. https://t.co/0kAqB4cvM9",
    "325": "NBA Basketball Game Betting Picks Simulator: 7:40 PM ET - Indiana Pacers vs. Atlanta Hawks - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/93spoam9n5 #nba #sportsbetting #freepicks #cappertek",
    "326": "Whos the manager for the Indiana pacers??? So you traded Levert for rubio and now yall about to give up Myles for… Goran? Another PG? Tf you guys doing????",
    "327": "We’re going LIVE! Tune in at 9 am tomorrow to join Indiana @Pacers point guard Keifer Sykes (@ksykesyb) and current SEI student and basketball player Chance White as they discuss how to leverage their love for the game to uplift the community. https://t.co/8HIOHUpqu4",
    "328": "#Indiana #Pacers' #MylesTurner Dragged For Having Zero Game With Women https://t.co/rkH3UFUIiH",
    "329": "Most likely to be traded from the Indiana Pacers this deadline? #GoldBlooded",
    "330": "C'mon down to the Indiana Pacers Win-Now Veteran Emporium! https://t.co/PzLwlUHXDP",
    "331": "If dealt to the right team before the NBA Trade Deadline, Indiana Pacers standout forward Domantas Sabonis could be the X-factor to determine the next NBA champion. \n\n#NBATradeDeadline | #Pacers | #Suns | @JohnDenton555  https://t.co/w69KZDlzsN",
    "332": "The 19-36 Indiana #Pacers face the Atlanta Hawks tonight. Will Chris Duarte lead the team in playing time? Will Isaiah Jackson return? \n\nA look at tonight's Injury report, odds, and predictions:\nhttps://t.co/PoDw90DZf7",
    "333": "📰 Atlanta Hawks vs Indiana Pacers Predictions and Odds Feb 8!\n👉 https://t.co/QE2TdHoomP @wagertalk",
    "334": "Indiana Pacers vs  Atlanta Hawks Prediction 2/8/22 - Free NBA Picks https://t.co/z1ynvN5Atu via @YouTube \n\n#NBA #NBAPick #NBAPrediction #basketball",
    "335": "DasHaus made a bet!\n\nEvent: Indiana Pacers vs Atlanta Hawks #NBA\nBet: Atlanta Hawks TO WIN -10\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "336": "Report: Indiana Pacers looking for pathways to move T.J. Warren https://t.co/wDPJoUiN3v",
    "337": "Report: Indiana Pacers looking for pathways to move T.J. Warren https://t.co/2BdjpztwQo",
    "338": "Former @SumnerSpartans and @RogersRamsHoops @Ryan_Carr11 shares his story!!!! Carr is now VP of the Indiana Pacers https://t.co/pydcX65GKv",
    "339": "Consensus Line Move:\n2022-02-08 Indiana Pacers at Atlanta Hawks from -9.50 to -10.50\n#TrueToAtlanta driving the market\n#NBA #sportsbetting #datascientist #motivation",
    "340": "Cleveland Cavaliers acquire Caris LeVert in trade with Indiana Pacers\nhttps://t.co/dGmqZcTlRk https://t.co/HWKGT2vRyh",
    "341": "CJ McCollum Trade Rumors: Pacers Linked to Blazers Star After Caris LeVert Deal #Indiana #Pacers #NBA https://t.co/kPn9Dpyil4",
    "342": "Good Luck 2 my Atlanta Hawks 2night against the Indiana Pacers 🏀🏀🏀 https://t.co/kllk7RZwSv",
    "343": "Indiana Pacers Postgame Media Availability (Cleveland Cavaliers) | February 06, 2022\nhttps://t.co/nQ1H3zbPmW\nhttps://t.co/nQ1H3zbPmW",
    "344": "Atlanta Hawks - Indiana Pacers\nDallas Mavericks - Detroit Pistons\n\nBet slip link: https://t.co/JRTeqOSY4q https://t.co/YNS2lyl3Ml",
    "345": "INDIANA PACERS vs\nATLANTA HAWKS, 8:30PM.",
    "346": "INDIANA PACERS 85-98\nCLEVELAND CAVALIERS, Final.",
    "347": "Indiana Pacers Highlights vs Cleveland Cavaliers | February 6, 2022\nhttps://t.co/32hujVpEWU\nhttps://t.co/32hujVpEWU",
    "348": "NBA Basketball Game Betting Picks Simulator: 7:40 PM ET - Indiana Pacers vs. Atlanta Hawks - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/93spoam9n5 #nba #sportsbetting #freepicks #cappertek",
    "349": "Indiana Pacers vs Cleveland Cavaliers - Full Game Highlights | February 6, 2022 | 2021-22 NBA Season\nhttps://t.co/ZOpwkfCF5F\nhttps://t.co/ZOpwkfCF5F",
    "350": "Opinion: The Los Angeles Lakers need to call the Indiana Pacers and strike a deal for this player.  https://t.co/jNuOP8RRr7",
    "351": "🏀#NBA ‼️\n1.Philadelphia 76ers Vs Phoenix Suns\n2.Atlanta Hawks Vs Indiana Pacers\n3.Brooklyn Nets Vs Boston Celtics\n4.Memphis Grizzlies Vs Los Angeles Clippers\n5. New Orleans Pelicans Vs Houston Rockets ...\n-------\n⭐️Free #livescore &amp; #livestream 👉https://t.co/z8cdc9BY9Y 😉 https://t.co/GX5POs68gY",
    "352": "NBA Basketball Game Betting Picks Simulator: 2/8/2022 7:30 PM ET - Indiana Pacers vs. Atlanta Hawks - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/93spoam9n5 #nba #sportsbetting #freepicks #cappertek",
    "353": "NBA Trade\n\nCleveland Cavaliers acquire:\nG Caris LeVert\nMiami 2022 2nd Round Pick\n\nIndiana Pacers acquire:\nG Ricky Rubio\n2022 1st Round Pick\nHouston 2022 2nd Round Pick\nUtah 2027 2nd Round Pick\n@cavs @Pacers \nhttps://t.co/czyU7Aud5o",
    "354": "Congratulations to Butcherandom who moved up 11 spots to take #20 on the Indiana Pacers team leaderboard.\n\nhttps://t.co/O74GedAEqq",
    "355": "Cleveland Cavaliers acquire Caris LeVert in trade with Indiana Pacers\nhttps://t.co/bk7cUSMClf\nhttps://t.co/bk7cUSMClf",
    "356": "@callherdiana Center for the Indiana Pacers.",
    "357": "Gus Johnson, a 6-foot-6 forward out of Idaho, played 9 years in the NBA with the Baltimore Bullets, 1 year in the ABA. Won ABA title with the Indiana Pacers. 5x NBA All-Star. Averaged 16.2 PTS, 12.1 TRB, 2.6 APG, &amp; Shattered 3 backboards in HOF career.\nhttps://t.co/gCnO3L6Asq",
    "358": "The Indiana Pacers are seeking a large package for Domantas Sabonis, while talks for Myles Turner have slowed in part because of his damaged left foot.",
    "359": "@BigKevinSports @BIGPLAY @BIGPLAY_dave @BIGPLAYReflog @Reflog_18 @DollarDogNick @shacknews @LabattUSA @GVartwork Who is the player The Cleveland Cavaliers traded for from the Indiana Pacers yesterday?\n“Chris LaVEENE” \n“Close”\n“Chad LaVern”\n🤣🤣🤣🤣\nThank you for having me on Guys!\nGreat show!\nMY BAD! \n#LetEmKnow",
    "360": "Indiana Pacers Trade Caris LeVert to Cleveland Cavaliers\nhttps://t.co/Kemiuxx9YR\nhttps://t.co/Kemiuxx9YR",
    "361": "How are you going to have a basketball team in the state of Indiana not operate like a basketball team in the state of Indiana? @Pacers",
    "362": "@LakersDailyCom Indiana Pacers hanging the phone up on the Lakers, always have. https://t.co/rFhS5qE20Y",
    "363": "Cleveland traded Caris LeVert to the Indiana Pacers on Sunday, while the LA Clippers traded Eric Bledsoe, Justise Winslow, Keon Johnson, and a future second-round pick to the Portland Trail Blazers on Friday.",
    "364": "@smoothyreal That might not get it done, but I wouldn't be surprised if the Indiana Pacers traded him to the Mavericks because he's from the Dallas area.",
    "365": "Congratulations to StankNuggettz and ArchdukeAwesomesauce who moved up to take #5 and #21 on the Indiana Pacers team leaderboard.\n\nhttps://t.co/O74GedAEqq",
    "366": "Caris LeVert entered Rocket Mortgage FieldHouse as a visitor with the Indiana Pacers on Sunday afternoon. He left the building as part of the home team. https://t.co/baUfDFq5vQ",
    "367": "Acceptable answers: Indiana pacers /  Detroit pistons /   https://t.co/MPWUZXgcgt. \nMore details: https://t.co/WHmzUcBd4K\n\nScores at https://t.co/yE0NxWEqIN",
    "368": "Chicago Bulls trade Coby white, Patrick Williams and a first round pick to the Indiana Pacers for Domantas Sabonis. Please #NBATradeDeadline #NBA",
    "369": "Indiana Pacers @MalcolmBrogdon7 seems like a really really really good dude.",
    "370": "The Cleveland Cavaliers competed in the 98-85 Indiana Pacers. After the game, the American media counted a supernatural data about lofook. https://t.co/eR1YF3cMsb",
    "371": "Thank you to the Indiana @Pacers and the @hoosierlottery for recognizing Officer Robert Sumner last Friday evening with a Community Impact Award! \nSummer was recognized for his efforts in savings a woman from a sinking vehicle in December.\n#plainfieldproud https://t.co/Qd2iLG8xhG",
    "372": "ICYMI: Moving Caris LeVert now could be a sign that the Indiana Pacers are finally ready to offload one of their core guys.\n\n#NBATradeDeadline\nhttps://t.co/14DDjzza4G",
    "373": "The Indiana Pacers sent Caris LeVert to the Cleveland Cavaliers and got Ricky Rubio plus a trio of draft picks in return. https://t.co/NcWJFB51Ei"
}