{
    "0": "@BallySportsSW @DwightPowell33 @dallasmavs How the hell do we watch it???????",
    "1": "Dallas Mavericks, ravaged by protocol additions, sign former All-Star Isaiah Thomas to hardship deal\nhttps://t.co/Mk2fqZjRDW",
    "2": ".@DwightPowell33 playing the best basketball in two years and we're not mad about it. \n\n@dallasmavs | #MFFL https://t.co/VfmLq4WoSG",
    "3": "NBA News: Spitfire Guard Not Done Yet, Trying Luck With Dallas Mavericks https://t.co/633BzWar9V",
    "4": "@LiamH_14 @LaraMlara1622 @dallasmavs @isaiahthomas Yeah of course I know that but he's shown some flashes of it. He just hasn't been consistent because he has not found the right proper home yet and his opportunity wasn't enough. So he just needs a right chance and to be consistent. I'm just praying that he plays great here.",
    "5": "@dallasmavs @isaiahthomas All money on Thomas!! Mavs win!! https://t.co/uSN4QDdXKl",
    "6": "The Bulls finished the night with a season-high 38 assists. \n\nThe last time they reached that mark came on December 2nd, 2014 against the Dallas Mavericks ... in double overtime.",
    "7": "@dallasmavs @SacramentoKings @NBATV @BallySportsSW @theeagledallas Mavs win by 17",
    "8": "@wviclaunch_bob @dallasmavs @ModeloUSA he’s so bad we definitely need to cut him",
    "9": "@arunowtf @dallasmavs @isaiahthomas They didn’t renew it?",
    "10": "Free agent guard Prod Nico plans to sign with the Dallas Mavericks, sources tell @TheAthletic @Stadium. Nico is expected to join team in Sacramento tonight.",
    "11": "@dallasmavs @ModeloUSA Let’s get the W !",
    "12": "@dallasmavs @ModeloUSA What are steins personal reasons seems like he has a history of this cut him please",
    "13": "I bet on y’all tonight @dallasmavs I usually don’t but every time I don’t ya win. Don’t let me down 🙏🏿",
    "14": "@dallasmavs @ModeloUSA Mavericks have been fun to watch lately, when Luka comes back and dribbles out the clock and everybody’s numbers drop and everyone is standing around I’ll turn it off",
    "15": "Dallas Mavericks when the line is within 4 of pick em, coming off a win as a dog are just 1-17 ATS. \n\nThis Betlabs system would indicate play on the Sacramento Kings +1.5 over the Mavs.\n\n#Betlabs https://t.co/PEHEMVQ8lr",
    "16": "Portland Trail Blazers vs. Dallas Mavericks: Game preview, time, TV channel, how to watch free live stream online https://t.co/L8hKYzIaer",
    "17": "@ShannonSharpe You are relentless with this Russ hate.😆🤣\nI'm a @dallasmavs fan that follows you and most of what I see from you is Russ hate. 😆🤣\nDid he do something personal to you or your family?",
    "18": "@HenriGuild @dallasmavs @isaiahthomas Basically another Brunson.",
    "19": "@dallasmavs @isaiahthomas We need to keep  him permanently this would be huge boost to the the team",
    "20": "Isaiah Thomas taking the court tonight as a Maverick. You heard it right. \n\n@TheSteinLine has all the info on the newest addition in Dallas. \n\n@dallasmavs | #MFFL https://t.co/BIoGmHQcuH",
    "21": "@dallasmavs @ModeloUSA IT &gt; Powell",
    "22": "A two game series in Sactown 🏀 A few up, a few down on the health &amp; safety protocol list. And more on #IsaiahThomas coming up on BSSW!\n\nMAVS LIVE, Live Now! \n\n@dallasmavs | #MFFL | 📺 BSSW https://t.co/6LsGrjG00c",
    "23": "Sacramento Kings (+1.5) vs. Dallas Mavericks #MFFL #SacramentoProud #NBA #NBATwitter #NBA75",
    "24": "@dallasmavs @ModeloUSA When's 77 coming back?",
    "25": "Tonight's starting lineup for the Dallas Mavericks: Brunson, Ntilikina, Finney-Smith, Porzingis, Powell https://t.co/bVWH4AMCA2",
    "26": "@dallasmavs @isaiahthomas I called this last night when I was playing 2k whit my friend",
    "27": "The Dallas Mavericks have signed Isaiah Thomas to a 10-day contract #MFFL https://t.co/oWc5c2XNcX",
    "28": "@CtxSoles @dallasmavs @ModeloUSA He isn’t even playing tonight so that’s really good",
    "29": "@dallasmavs @ModeloUSA good thing Reggie ain’t starting. Dude is horrible",
    "30": "@dallasmavs @ModeloUSA Let’s get it",
    "31": "Phoenix Suns - Oklahoma City Thunder\nSacramento Kings - Dallas Mavericks\n\nBet slip link: https://t.co/pRs8Dk1mT6 https://t.co/AYqAdBPT8N",
    "32": "Game #34- @dallasmavs (8th in W) vs. @SacramentoKings (11th in W)\n\n#IsaiahThomas is taking the floor as a Maverick tonight wearing #2. Thomas is on a 10-day contract due to majority of Mavs players still on the H&amp;S protocol list. \n\n📺: @BallySportsSW @NBATV\n⏰: 9:30 E.T.\n\n#MFFL",
    "33": "🇦🇺 @JoshBGreen + the @dallasmavs head to Sacramento today trying to make it back-to-back wins. Tip-off at 2:30pm AEDT 🇦🇺 \n\n 📲💻 Watch live on League Pass: https://t.co/RJlQCgJe1C https://t.co/d9eVsoPQ5C",
    "34": "@triggandreww @A1exinChains @dallasmavs @isaiahthomas Yeah I know of course not like that. But I'm just saying he may help a lot and earn a contract for the rest of the season where in playoff time is his chance he just needs the right opportunity and the Lakers were never it.",
    "35": "@DHaenens_Roy I mean, I wouldn’t mind getting into it. From an investment standpoint why not. Use the profits for stuff I like down the line. Mark Cuban owns the Dallas Mavericks so that won’t be hard to get.",
    "36": "Dallas Mavericks sign Isaiah Thomas to a 10-day contract: https://t.co/8OtlHYUI5m",
    "37": "@triggandreww @dallasmavs @isaiahthomas But you gotta remember he lead the Celtics to the conference finals also those teams just never gave him enough of a chance. I am praying that this opportunity will work with the Mavericks, have some hope and faith man.",
    "38": "@ANaikNHL @dallasmavs @isaiahthomas He lead a team to the conference finals. Come on you never know anything's possible. Stay positive by having some faith and hope man :D",
    "39": "@LiamH_14 @LaraMlara1622 @dallasmavs @isaiahthomas Nah you're weeping like have some faith and hope, don't just straight up start hating man. Please or else your just like your pfp.",
    "40": "@dallasmavs @isaiahthomas Already my favorite Mav this year.",
    "41": "@A1exinChains @triggandreww @dallasmavs @isaiahthomas Yes for the defense and he has shown he still get a lot of points yeah but he hasn't been consistent with that yet. So hopefully he could lead us in the right direction to greatness just like how he lead the Celtics to the conference finals. I'm praying for the best.",
    "42": "Free Pick Mercury Day 12/29/21.\n\n🏀NBA- @dallasmavs at @SacramentoKings\n\n#1. -115 Over 56.5 1st Quarter Total Points.\n\nSingle Wager 1 Unit.\n\nBankroll Management #Bankroll #Gematria #Numerology #Scripted #Rigged #NBA 🎬",
    "43": "Does @dallasmavs have a dunk team?",
    "44": "@dallasmavs @isaiahthomas I hope after his ten days y’all keep him, we need more playmakers",
    "45": "@dallasmavs @isaiahthomas Yoooo let him start plz!!!",
    "46": "@scum_JUNIOR @LiamH_14 @LaraMlara1622 @dallasmavs @isaiahthomas Of course hopefully they don't cut him at all. But have some hope and faith man you know he had a season where he lead his team to the conference finals and averaged almost 30 points per game and was sixth in the MVP race.",
    "47": "Dallas Mavericks @ Sacramento Kings\nPick : Dallas Mavericks.\nBasketball. NBA",
    "48": "Dallas Mavericks sign Isaiah Thomas to 10-day contract. https://t.co/J3zSOGoeTF https://t.co/0Y9RbVtaIX",
    "49": "@JMackeyPG It is real. Not pictured: The private Miranda Lambert concert/party we all attended and the Dallas Mavericks tickets we were gifted",
    "50": "@ANaikNHL @dallasmavs @isaiahthomas I'm afraid that he'll stay😓",
    "51": "@dallasmavs @isaiahthomas Never gave up and hustled his way back. Well deserved.",
    "52": "@lilreno313 @dallasmavs @isaiahthomas just got cut",
    "53": "GAME THREAD: Dallas Mavericks at Sacramento Kings  https://t.co/ySsimG8jL1 https://t.co/pSDVLATfV7",
    "54": "NBA Basketball Game Betting Picks Simulator: 10:40 PM ET - Dallas Mavericks vs. Sacramento Kings - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/1dsIb1rphy #nba #sportsbetting #freepicks #cappertek",
    "55": "Isaiah Thomas to sign with the Dallas Mavericks https://t.co/rlNOj1evsk",
    "56": "@Slance5289 @AshPort5 @bakermayfield My little brother spent a year with the Knicks and played overseas 16 years with the Harlem Globetrotters we grew up with Mike Bibby oh, don't know if you know who Brian fair is played for the Dallas Mavericks",
    "57": "Former All-Star guard Isaiah Thomas signed a 10-day hardship deal with the Dallas Mavericks on Wednesday after the team had two more players enter the NBA's health and safety protocols‼️🚨#uaccessmagazine https://t.co/XUlFTu4lTp",
    "58": "@JusPlainJeff @dallasmavs @luka7doncic @swish41 Looks fun",
    "59": "Here are the 23 players other than Isaiah Thomas that have suited up for the Dallas Mavericks this season https://t.co/wYOYsgYBb9 https://t.co/30PQC0C0M3",
    "60": "Dallas Mavericks: Isaiah Thomas Available For Mavericks Vs. Kings After Signing 10-Day Contract https://t.co/tFIebs3VSx",
    "61": "@dallasmavs @UncleFraz @isaiahthomas To someone else he sucks",
    "62": "@clew142 @ArcibaZack @ARokas15 @DaveSoSmoove @dallasmavs @HoustonRockets @austin_spurs Put me in coach",
    "63": "@dallasmavs The league will say @mcuban stole this @isaiahthomas signing. Book it! @NBA",
    "64": "When Isaiah Thomas plays for Dallas tonight, he will be the 24th Maverick to get court time this season, breaking a tie with Atlanta’s 23 for the league lead, according to @EliasSports. \n\nThe NBA’s single-season record for players, Elias says, was set last season by Houston: 30. https://t.co/4vPW06LMSH",
    "65": "@dallasmavs @isaiahthomas Just give this former, all nba player a fair shake. @mcuban",
    "66": "@dallasmavsshop @dallasmavs @swish41 @mitchell_ness yoo. I'm in love.",
    "67": "@ANaikNHL @dallasmavs @isaiahthomas it's a 10 day contract, he's supposed to be cut",
    "68": "@LiamH_14 @LaraMlara1622 @dallasmavs @isaiahthomas it's a 10 day co tract. That's what he's there for",
    "69": "@MavsPR @dallasmavs @isaiahthomas Who did they sign for a short contract that the MAVS aren't keeping?",
    "70": "@ArcibaZack @ARokas15 @DaveSoSmoove @dallasmavs @HoustonRockets @austin_spurs Cause Luka ain’t never gone pass a test 😂😂😂 Jalen Brunson , IT &amp; Trey Burke the only hope lol",
    "71": "@dallasmavs @isaiahthomas As a mavs fan i really not sure hell fit in his role",
    "72": "@ARokas15 @ArcibaZack @DaveSoSmoove @dallasmavs @HoustonRockets @austin_spurs Boy Zack ain’t getting up and down like that lol they gone do him like they did IT 😂😂😂",
    "73": "@ArcibaZack @DaveSoSmoove @dallasmavs @HoustonRockets @austin_spurs y’all need a PG? Hit up @ArcibaZack",
    "74": "@dallasmavs @isaiahthomas Where it all started. God is good!",
    "75": "@dallasmavs @isaiahthomas Huge fan of the Bad Boys!!!\nCan’t wait to see @IsiahThomas do it again!! https://t.co/EtoLFsv9Mv",
    "76": "@isaiahthomas the @dallasmavs will love your dirty draws. Go ball I T!!!",
    "77": "Yahoo! Sports:  Isaiah Thomas reportedly signs 10-day deal with Dallas Mavericks after Lakers stint https://t.co/dThdrkwYkv",
    "78": "Dallas Mavericks, ravaged by protocol additions, sign former All-Star Isaiah Thomas to hardship … – NBA News https://t.co/ZEK5XT9J5x",
    "79": "Dallas Mavericks, ravaged by protocol additions, sign former All-Star Isaiah Thomas to hardship … – https://t.co/WQ5NwOMoAH",
    "80": "@MavsPR @dallasmavs @isaiahthomas Let's Gooo",
    "81": "@ArcibaZack @dallasmavs *6’6 of negative covid tests 🤣",
    "82": "@ScotPollard31 sporting your jersey for tonight’s game vs them @dallasmavs Go Kings!\n#SacramentoProud https://t.co/MYiTHd431z",
    "83": "@ArcibaZack @dallasmavs Me and Brandon Knight are about to ball out 🤣",
    "84": "@dallasmavs @isaiahthomas LETS GOOOOOOOOOOOO",
    "85": "@_mcflyboi_ @dallasmavs @isaiahthomas Just being realistic",
    "86": "@_mcflyboi_ @LaraMlara1622 @dallasmavs @isaiahthomas Weep more please",
    "87": "#Dallas #Mavericks:  2x NBA-All ...\n \nhttps://t.co/Py59rmW62j\n \n#DallasMavericks #DallasMavericks #NBASouthwest #NBASouthwestDivision #NBAWestern #NBAWesternConference #NBAWesternConferenceSouthwest #NBAWesternConferenceSouthwestDivision #Southwest #SouthwestDivision #Texas https://t.co/oI4tZmhn5x",
    "88": "@dallasmavs @isaiahthomas Glad to see the positive reaction from Mavs fans. Happy for IT regardless of what happens",
    "89": "@MavrelloB @dallasmavsshop @dallasmavs @swish41 @mitchell_ness Will there be Authentics too! Or just Swingmans?",
    "90": "Fresh off his deal with the Lakers, Isaiah Thomas is available for the Mavericks on Wednesday after signing a 10-day deal with Dallas. https://t.co/kmfcE8uPym",
    "91": "Isaiah Thomas had played for 2 teams this season. He just recently signed a 10 day contact with the Mavericks. \nMaybe if it goes well, Dallas signs him for the remainder of the season??.",
    "92": "@patriottakes lol mavericks in dallas only",
    "93": "@dallasmavs @SacramentoKings @NBATV @BallySportsSW @theeagledallas FRANK POSTER 🔥🔥🔥",
    "94": "@dallasmavs @isaiahthomas Hope we don’t have any promotions for a free Frosty when players miss two free throws.",
    "95": "@_mcflyboi_ @triggandreww @dallasmavs @isaiahthomas He’s not that anymore though, however he is a huge liability on defense which he has been at all points in his career.",
    "96": "The SLOW Grind Continues: Isaiah Thomas Joins Dallas Mavericks On 10-Day Contract Source: David Berding / Getty The Los Angeles Lakers won’t be Isaiah Thomas’ final stop on his journey back into the NBA. Isaiah Thomas... - https://t.co/WGStqUQZke #digitalmusiczone https://t.co/p0ooxEqTY8",
    "97": "@dallasmavs @isaiahthomas YESSS LET'S FUCKING GO!",
    "98": "@ANaikNHL @dallasmavs @isaiahthomas No stop the hate. He had a year where he averaged almost 30 points per game and was sixth in MVP voting.",
    "99": "@LiamH_14 @LaraMlara1622 @dallasmavs @isaiahthomas Hater clown lol you match your pfp.",
    "100": "@dallasmavs @isaiahthomas Slings next 10 days are 100% gonna be good now",
    "101": "@triggandreww @dallasmavs @isaiahthomas Why? He had a season where he was the number 1 option averaging almost 30 points per game in Boston.",
    "102": "The SLOW Grind Continues: Isaiah Thomas Joins Dallas Mavericks On 10-Day Contract Source: David Berding / Getty The Los Angeles Lakers won’t be Isaiah Thomas’ final stop on his journey back into the NBA. Isaiah... - https://t.co/WGStqUQZke #ghettomogul #onmygrind https://t.co/axppgRcnyB",
    "103": "@Le_Faded @dallasmavs @isaiahthomas That's Westbrick?",
    "104": "@_Tommy76_ @dallasmavs @isaiahthomas *All* And they sign him for the rest of the season.",
    "105": "The Dallas Mavericks have signed guard Isaiah Thomas to a 10-day contract under the COVID-related hardship allowance.  https://t.co/oaECbO4Hxe",
    "106": "@dallasspencer97 @dallasmavs @isaiahthomas Yeah they already have enough defenders.",
    "107": "Dallas #Mavericks, ravaged by protocol additions, reach hardship deal with Isaiah Thomas ... - ESPN https://t.co/3vxQQUV9qb",
    "108": "IT joining the Mavs tonight against Sacramento I bet u he’s a better fit on @dallasmavs 💯🔥🏀",
    "109": "@BenHilly94 @dallasmavs @isaiahthomas Yeah we really need him to hit all of his shots. Also has Bullock been good this season?",
    "110": "@sam_my_6 @dallasmavs @isaiahthomas What's with the aggressiveness",
    "111": "@dallasmavs @isaiahthomas YEAHHH LET'S FUCKING GO!",
    "112": "Dallas Mavericks sign Isaiah Thomas to 10-day contract – NBA News https://t.co/R24rCIgAhG",
    "113": "Dallas Mavericks sign Isaiah Thomas to 10-day contract – https://t.co/DLjHpWSG1E",
    "114": "Check out this listing I just added to my #Poshmark closet: DALLAS MAVERICKS Embroidered Long Sleeve Shirt Jersey Unisex Childs Youth XL 20. https://t.co/YN7RipigBS #shopmycloset @poshmarkapp",
    "115": "@dallasmavs @luka7doncic @BEDGEAR Where do you even vote?",
    "116": "@SidAccount @dallasmavs @NotIsaiah__ @luka7doncic @BEDGEAR Idek tbh.",
    "117": "@dallasmavs @isaiahthomas Lets go",
    "118": "@dallasmavs @isaiahthomas Congrats",
    "119": "The Dallas Mavericks have officially signed Isaiah Thomas to a 10-day contract.\n\nHe will wear number 2 and is expected to be available tonight in Sacramento. https://t.co/TngqVah4lH",
    "120": "@dallasmavs @isaiahthomas Better start hitting his shots. Two of his three Laker games were awful and we already have enough guys who can’t shoot or defend",
    "121": "@Decievxd @russgoat4 @KOT4Q @dallasmavs @isaiahthomas Kings smoked us 3 time last season and almost beat us earlier this season lmfao they play good against us",
    "122": "\"Dallas Mavericks, ravaged by protocol additions, sign former All-Star Isaiah Thomas to hardship deal\" https://t.co/KLOBGOYqc5",
    "123": "@dallasmavsshop @dallasmavs @swish41 @mitchell_ness This is a must buy jersey",
    "124": "@dallasmavs @isaiahthomas No way bro I'm hyped he deserves this👏",
    "125": "@dallasmavs @isaiahthomas Nice.",
    "126": "🔴 Live▶ Dallas Mavericks VS Sacramento Kings - NBA League\n🔴Live Now➠ https://t.co/Jg9ogbtQak\n12/29/2021 @ 10:30 PM",
    "127": "🔴 Live▶ Dallas Mavericks VS Sacramento Kings - NBA League 2021\n🔴Live Now➠ https://t.co/Do5gBkqBlx\n12/29/2021 @ 10:30 PM",
    "128": "@dallasmavs @isaiahthomas Give him and Knight a contract for the rest of the year. Give this damn team some scorers besides Luka",
    "129": "@dallasmavs @isaiahthomas SIGN HIM FUCKING NOW !!!!!!!!!!!!",
    "130": "also if Luka or Jokic has to sit out for covid protocols I will off myself @dallasmavs",
    "131": "@dallasmavs @isaiahthomas LETS FUCKING GO",
    "132": "@russgoat4 @KOT4Q @dallasmavs @isaiahthomas We’re playing the kings lmao",
    "133": "BREAKING: Dallas Mavs Plan To Sign Isaiah Thomas - Sports Illustrated Dallas Mavericks News, Analysis and More https://t.co/JKutSX3T0F",
    "134": "@mavsfan505 @dallasmavs What happened to our actual sNiPeR",
    "135": "@dallasmavs We represent our team and the 2 G.O.A.T.S everywhere we go!! @luka7doncic @swish41 https://t.co/3Ln9j4spP8",
    "136": "@NBATrashTalkin @dallasmavs @isaiahthomas Who said that??? They are just announcing the signing like they have for every player signed for COVID hardship 🤷",
    "137": "@dallasmavs @isaiahthomas Keep him along with Knight",
    "138": "Dallas Mavericks sign Isaiah Thomas to 10-day contract https://t.co/vg0ZyOwayB",
    "139": "@isaiahthomas is on the move to the @dallasmavs https://t.co/pZMAmpf5F6",
    "140": "@KOT4Q @dallasmavs @isaiahthomas You wild",
    "141": "@dallasmavs @isaiahthomas In ur dreams 😎",
    "142": "@77Blazers @trailblazers @dallasmavs @terryporter30 Very cool.  I think I remember this game.   Looking at the boxscore Blazers had only five 3-point attempts.  How times have changed!  Other notable: Duckworth with 27 FGA...that was unusual for the day.  Drexler with 55 minutes.",
    "143": "@dallasmavs @isaiahthomas So random",
    "144": "@dallasmavs @isaiahthomas Let’s go I.T. 🙌🏾",
    "145": "@KevinLo74138777 @dallasmavs @isaiahthomas Thomas&lt;Brunson",
    "146": "@dallasmavs @isaiahthomas Sucks he'll get cut in like 3 games",
    "147": "Check out 2021 DONRUSS #331 MICAH PARSONS RC DALLAS MAVERICKS  https://t.co/xJRjiwzT64 via @eBay",
    "148": "@dallasmavs @isaiahthomas I thought he was playing for the lakers?",
    "149": "@dallasmavs @isaiahthomas he’s terrible",
    "150": "@dallasmavs @isaiahthomas I hope he plays for every team by years end",
    "151": "@LaraMlara1622 @dallasmavs @isaiahthomas He’ll play 2 games and then ride the bench before he’s cut",
    "152": "@dallasmavs @isaiahthomas I hope he stick here",
    "153": "@dallasmavs @isaiahthomas Yessir🔥",
    "154": "@isaiahthomas Gonna look nice with the @dallasmavs tonight! Really good fit. 🏁🏁🏁",
    "155": "@NathielIsaac @KOT4Q @dallasmavs @isaiahthomas you’re right what was i thinking",
    "156": "@dallasmavs @isaiahthomas We are NOT making it out the hood",
    "157": "@KOT4Q @dallasmavs @isaiahthomas I think they want to win, sorry",
    "158": "HELL YEH @isaiahthomas to the @dallasmavs ! Get it bro!",
    "159": "@KOT4Q @dallasmavs @isaiahthomas I would take the over on +/- 12",
    "160": "@MavsPR @dallasmavs @isaiahthomas I wanted Celtics to sign him 😭",
    "161": "@KOT4Q @dallasmavs @isaiahthomas fuck that go into overtime and play him 53",
    "162": "@MavsPR @dallasmavs @isaiahthomas Let's go @isaiahthomas!!!",
    "163": "@dallasmavs @isaiahthomas Play him 48",
    "164": "@dallasmavs @isaiahthomas When can we get some Thomas Jerseys",
    "165": "@dallasmavs @isaiahthomas Little defense that's it....little man",
    "166": "@dallasmavs @isaiahthomas Christmas miracle",
    "167": "@MavsPR @KeithSmithNBA @dallasmavs @isaiahthomas THE MARATHON CONTINUES.\n@isaiahthomas",
    "168": "@dallasmavs @isaiahthomas The duality of man https://t.co/xHMp50aEeV",
    "169": "@dallasmavs @isaiahthomas Nice ♥️♥️♥️",
    "170": "@dallasmavs @isaiahthomas Thomas &gt; Burke",
    "171": "@dallasmavs @isaiahthomas He should get full contract",
    "172": "Mavericks make it official with guard Isaiah Thomas.\n\nDALLAS — The Dallas Mavericks announced today that they have signed guard Isaiah Thomas to a 10-day contract under the COVID-related hardship allowance. Thomas (5-9, 185), 11-year veteran, has career avgs of 18.0 ppg, 4.9 apg.",
    "173": "@dallasmavs @isaiahthomas Now get him a BALLERZ! @BALLERZ_NFT",
    "174": "@dallasmavs @isaiahthomas Bricks incoming",
    "175": "@dallasmavs @isaiahthomas We sign IT ! @squish41",
    "176": "@dallasmavs @isaiahthomas I pray for him to have some great performances 🙏🙏🙏",
    "177": "@dallasmavs @isaiahthomas Great!",
    "178": "@dallasmavs @isaiahthomas Let's gooo",
    "179": "@MavsPR @dallasmavs @isaiahthomas Better start hitting his shots. 2 of his 3 Laker games were cheeks",
    "180": "We have signed guard Isaiah Thomas to a 10-day contract under the COVID-related hardship allowance.\n\nThomas will wear #2. https://t.co/nJu2FMlFsj",
    "181": "Dallas Mavericks have signed guard @isaiahthomas to a 10-day contract under the COVID-related hardship allowance.",
    "182": "@MavsPR @dallasmavs @isaiahthomas It’s time https://t.co/Jbk2jInnwX",
    "183": "Go @dallasmavs WIN WIN WIN TONIGHT!!! WIN WIN WIN WIN!!!!! @NBA @NBATV #MAVS #DALLAS #NBA #NBA75",
    "184": "The Dallas Mavericks have signed guard Isaiah Thomas to a 10-day contract under the COVID-related hardship allowance.\n\nThomas will wear #2 for Dallas. He is expected to join the team for tonight’s game in Sacramento. https://t.co/pTgpZajMcQ",
    "185": "#NBA - Who covers the spread?\n\n#Mavericks -1½ 🆚 #Kings +100\n🏀 Total 220½\n\nThe total has gone OVER in 4 of Dallas' last 5 games.\nThe total has gone OVER in 4 of Sacramento's last 6 games. https://t.co/zUgD3YpaOk",
    "186": "#NBA\n\n🗑️ #Mavericks -1½ vs #Kings +100\n🏀 Total 220½\n\nDallas are 6-2 ATS in their last 8 games.\nSacramento are 3-7 ATS in their last 10 games.\n\nBet here: https://t.co/ECPrLfNSnt https://t.co/lbx40pfvN5",
    "187": "#NBA 🏀\n\n#Mavericks -1½ vs #Kings +100\n🗑️ O/U 220½\n\nDallas are 6-2 ATS in their last 8 games.\nSacramento are 3-7 ATS in their last 10 games.\n\nWho covers?\n\nBet now: https://t.co/T06YGboglw https://t.co/WVi1cJpNmr",
    "188": "Dallas Mavericks: Mavericks sign Isaiah Thomas: Place 2 in health and safety protocols https://t.co/JU83QtCFsJ",
    "189": "Guard Isaiah Thomas reportedly signs 10-day deal with Dallas Mavericks. #MFFL https://t.co/belSPW1mlk",
    "190": "@dallasmavs @SacramentoKings @NBATV @BallySportsSW @theeagledallas Let's Go Mavs! #MFFL",
    "191": "Dec 29, 1989 - Despite 42 pts by Derek Harper &amp; 27 rebs by James Donaldson, the @trailblazers were able to pull out a 144-140 3-OT victory vs @dallasmavs. \n\nClyde Drexler led Portlaand w/32 pts &amp; @terryporter30 had 28 pts &amp; 10 assists\n\n#Blazers #RipCity #thisdateBlazersHistory. https://t.co/P6AXLBo9jM",
    "192": "The SLOW Grind Continues: Isaiah Thomas Joins Dallas Mavericks On 10-Day Contract https://t.co/XRl48tqcil",
    "193": "Reports: @dallasmavs to sign @isaiahthomas to 10-day contract\nhttps://t.co/7RMuSjWgl2",
    "194": "Here we go! #NBA #NBAPicks #SportsPicks @Lakers @memgrizz @dallasmavs @SacramentoKings https://t.co/fvnyq1JeMH",
    "195": "@dallasmavs I think signing Isaiah Thomas will be the spark this team needs to be a title contender! Great locker room guy! And will light a fire under Luca!",
    "196": "@StoolGreenie @dallasmavs Will they do the tribute videos at the same time?",
    "197": "@StoolGreenie @dallasmavs Fire Brad",
    "198": "According to Shams Charania, Isaiah Thomas will sign with the Dallas Mavericks after his 10-day trial with the Los Angeles Lakers. https://t.co/5k7NF1dUl6",
    "199": "The SLOW Grind Continues: Isaiah Thomas Joins Dallas Mavericks On 10-Day Contract\n\n➡️: https://t.co/1ihuuld4pl\n\n📸: Getty Images https://t.co/sQWJAs9bkq",
    "200": "@StoolGreenie @dallasmavs They’re not gonna see this bro.",
    "201": "Back SACRAMENTO KINGS to BEAT Dallas Mavericks tonight in the @NBA (Game Starts at 03.40 GMT) #NBA #Basketball",
    "202": "40 years later, the Mavericks finally get Isaiah Thomas.  Too bad it wasn't the Dad, Isaih in 1981. \nThey brought him to Dallas for an interview in '81 and it didn't go too well. So the Mavs drafted Mark Aguirre. And the Pistons got Thomas and two titles. \nhttps://t.co/BApMyDpfD9",
    "203": "Do it @dallasmavs https://t.co/6kyzgbeu5E",
    "204": "Isaiah Thomas reportedly signs 10-day deal with Dallas Mavericks after Lakers stint https://t.co/gx36TsTSRv https://t.co/Gp4lZSGFMp",
    "205": "After a very short @Lakers stint, Isaiah Thomas has agree to a ten day hardship contract with the @dallasmavs. He is expected to join the team in Sacramento starting tonight #LakeShow #DallasMavericks #NBA https://t.co/s4yS74XmZf",
    "206": "@dallasmavs backed up the brink trucks and signed @isaiahthomas to a ten day contract\n#Celtics #Boston #SorryNotSorry",
    "207": "Have ALWAYS been an @isaiahthomas fan 🙌🙌 welcome to @dallasmavs #mffl",
    "208": "@Mavs_FFL To much Guards To Much Players No One Playing Good DEF Classic Dallas Mavericks.",
    "209": "@dallasmavs @kaj33 The shirt from my very first Mavs game at Reunion arena. https://t.co/f2ysNdsXKd",
    "210": "Reports say Isaiah Thomas will sign with the Dallas Mavericks after his 10-day trail with the Los Angeles Lakers 👀 \n\n#NBA #NBATwitter #MFFL #LakeShow https://t.co/0tUrT0rq9a",
    "211": "Utah Jazz #NBATopShotThis \nhttps://t.co/JfAQIBsSsW\n\nMy squad @dallasmavs https://t.co/xP70mLfLjE",
    "212": "Jazz\n#NBATopShotThis \nhttps://t.co/LNrozbrepf\n@dallasmavs https://t.co/2HHpMPNKT7",
    "213": "@isaiahthomas How can I get my hands on that  Dallas Mavericks Isaiah Thomas Jersey let’s go!!!!!!🔥🔥🔥🔥",
    "214": "@MavsPR @dallasmavs Hoping for a speedy and safe recovery!",
    "215": "@inallairness My childhood memory of Ro Blackman is as a Dallas Maverick in the all star game, speaking to himself before he shot 2 all-or-nothing FTs to tie the game. \" Confidence Baby!\"",
    "216": "I’ve hated the way the NBA has dealt with @isaiahthomas over the past few years. Pumped that I can root for him during @dallasmavs games",
    "217": "Congratulations Isaiah Thomas ( IT) on your signing with the Dallas Mavericks ! A fan always ! Boston passed up on a great player !",
    "218": "▶️▶️https://t.co/U1lgtQByx4◀️◀️\n#NBA live streams coming:\n#SacramentoKings vs #DallasMavericks\n#crackstreams #buffstreams https://t.co/tNAB9G1xe4",
    "219": "@AlexE1349 @dallasmavs Love you too bro💀💀💀",
    "220": "ICYMI: Episode 45 - Josh Green, Brandon Knight, and Marquese Chriss Headline New-Look Dallas Mavericks https://t.co/jn9HiBT4tR",
    "221": "🕷🏀 Bet de nuit 🏀🕷\n\n🇺🇸Sacramento vs Dallas Mavericks \n\nKristaps Porzingis +25pts  🕸@1,86\n\n#NBA #TeamParieur #tipster #Tips https://t.co/8DDJot3dat",
    "222": "@Tony_Goodwin_ @TexasLegends @dallasmavs Been watching you since you left Rock Ridge HS, Congratulations.",
    "223": "Welcome to the @dallasmavs @isaiahthomas",
    "224": "@dallasmavs @SacramentoKings @NBATV @BallySportsSW @theeagledallas Luka playing?",
    "225": ".@isaiahthomas has been signed by the .@dallasmavs and will continue his #NBA75 return! Good news for him &amp; the game! Source #BasketBallForever https://t.co/isGwHIUQwQ",
    "226": "@isaiahthomas welcome to the @dallasmavs !! Super excited to have you here! Lifelong @celtics fan living in DFW, so its #mffl too! @mcuban keep IT around! Let's get it!",
    "227": "As a fellow die-hard Mavs fan myself, I'm counting on my fellow #MFFL's to help my friend out here \n\nPlease RT!!!! Let's make this happen. \n\ncc: @coopmavs @MFollowill @All_Things_Mavs @dallasmavs https://t.co/xJ0syIz4z3",
    "228": "scouts from the Dallas Mavericks, Houston Rockets, Minnesota Timberwolves, Oklahoma City Thunder, Charlotte Hornets, Utah Jazz, Washington Wizards, Toronto Raptors and Atlanta Hawks (2x) are credentialed for Auburn-LSU tonight",
    "229": "Mavericks picked up Brandon Knight &amp; IT I kinda like that in Dallas 🔥 Luka will have to move to shooting guard.",
    "230": "New post (Apuesta baloncesto – NBA 21/22 – SACRAMENTO KINGS vs DALLAS MAVERICKS) has been published on Apuestas NBA - https://t.co/Nr9b6fXrBG https://t.co/6AvrzVYusu",
    "231": "@isaiahthomas and @Jroc__3 both @dallasmavs  🔥🔥🔥🔥",
    "232": "@isaiahthomas get it bro #dallasmavericks",
    "233": "Dallas Mavericks visits Sacramento Kings Predictions and Preview for 12/29/2021 today.  Who are we taking in this game?  Find out now. #Picks #SportsBetting https://t.co/3vLbPPB85k",
    "234": "Join us we watch Dallas Maverick Isaiah Thomas drop 40 on the Kings tonight. https://t.co/8j2xDaR5ap",
    "235": "Dallas Mavericks: Reports: Isaiah Thomas signs with Mavericks, may suit up vs. Kings https://t.co/YSNee6iYP8",
    "236": "Just posted a photo @ Dallas Mavericks https://t.co/IQ8KV1hAGO",
    "237": "2 years ago today…😢\n\nThis is still so hard to come to terms with… 😢\n\n#ripkobeandgianna \n\n🎥 via @dallasmavs https://t.co/dnA8mGKQls",
    "238": "@dallasmavs @All_Things_Mavs @luka7doncic @BEDGEAR Wonder when he will clear the protocol thing, he's been out for significant time now",
    "239": "Please run this we are losing anyway @dallasmavs https://t.co/6NnX32VM2V",
    "240": "Sacramento Kings Predictions and Preview for 12/29/2021 hosts Dallas Mavericks.  Find out who we are taking in this matchup. #Picks #SportsBetting https://t.co/3vLbPPB85k",
    "241": "@Tony_Goodwin_ @TexasLegends @dallasmavs Get em, T2! 💪🏻",
    "242": "@sell_dalton @BPortistime Still can’t believe the @dallasmavs passed on him",
    "243": "@isaiahthomas signed a 10 day contract with my @dallasmavs yes sir. #MFFL",
    "244": "The Dallas Mavericks have confirmed that Brandon Knight and Boban Marjanović will miss tonight’s game against the Sacramento Kings due to health and safety protocols.\nhttps://t.co/9ezGDZJpNl",
    "245": "Reports: Isaiah Thomas signs with Mavericks, may suit up vs. Kings https://t.co/yBLI7UyPHF #NBA #Dallas #IsaiahThomas",
    "246": "This Isaiah Thomas Kristaps Porzingis combination about to be lethal for the Dallas Mavericks https://t.co/Cq6HkNDIBC",
    "247": "Dallas Mavericks",
    "248": "🏀Game day for @dallasmavs!\n\n🆚@SacramentoKings\n🕤 9:30PM CT\n📺@NBATV and @BallySportsSW\n 📻@theeagledallas and 99.1 FM\n\n#MFFL https://t.co/PnPoUmqFwG",
    "249": "@dallasmavs @SacramentoKings @NBATV @BallySportsSW @theeagledallas So sad Knight isnt playing 😭",
    "250": "Old friend Isaiah Thomas will make his Dallas Mavericks debut tonight in Sacramento.\n\nWho else will be active in tonight’s matchup between the Kings &amp; Mavs? Everything you need to know ⬇️\nhttps://t.co/AOEa16SY3z",
    "251": "@miketinez13 @dallasmavs BIG TIME bro lol",
    "252": "2 more for the collection @luka7doncic @dallasmavs @kzs_si #MFFL https://t.co/1fk9SEnGHW",
    "253": "@dallasmavs Heart is still heavy every time I see this Photo.",
    "254": "@TheRealAlexis @okaykearin I try to catch the Mavericks when they are here in Houston. Tickets cheaper in Dallas than Houston though. 😆",
    "255": "@MavsFansForLife @dallasmavs This is a good move and a good fit!!! Thomas’s game is very similar to Brunson. #MFFL",
    "256": "Maybe the @dallasmavs will sign me on a 10-day contract.",
    "257": "It’s been a amazing year, looking forward to the opportunities in 2022 🕊\nThank you @texaslegends as well as @dallasmavs 🙌🏾 https://t.co/FiDtYvfkI2",
    "258": "@BallySportsSW @dallasmavs @Goodknight11 Glad to see him back great kid",
    "259": "It’s been a amazing year, looking forward to the opportunities in 2022 🕊\nThank you @texaslegends as well as @dallasmavs 🙌🏾 https://t.co/EJmGP9jgrN",
    "260": "welp...guess I'm a @dallasmavs fan now... @isaiahthomas go zeke!!!",
    "261": "The plan for rest of the day: \n\nNow - Gym\nNext - Dabo in the #CheezItBowl \nAfter That - Cs gonna C or move to 1 game under 500 YIPPEEEE #BleedGreen\nLast - @isaiahthomas debut with @dallasmavs #MFFL https://t.co/j28RpSuEKO",
    "262": "Can @swish41 now come out of retirement \n\n@dallasmavs could really do with a Legend on court 😎",
    "263": "@dallasmavs @SacramentoKings @NBATV @BallySportsSW @theeagledallas How we feeling MFFL’s?",
    "264": "Dallas Mavericks sign Isaiah Thomas https://t.co/IyPg1eZ9Fa",
    "265": "Former Boston Celtics guard Isaiah Thomas is planning to sign a short-term deal with the Dallas Mavericks.  https://t.co/WleBTNtCCt",
    "266": "@BallySportsSW @swish41 @mcuban @dallasmavs We love this guy!",
    "267": "Dallas Mavericks, ravaged by protocol additions, reach hardship deal with Isaiah Thomas,… – NBA News https://t.co/Pi3ZxbSY2M",
    "268": "Congratulations on your 10-day contract with our amazing @dallasmavs @isaiahthomas ! We can’t wait to see what’s in store during your time here👀🔥 https://t.co/psAHzLbPKk",
    "269": "@dallasmavs @NotIsaiah__ @luka7doncic @BEDGEAR Has he even played half the games?",
    "270": "@dallasmavs @SacramentoKings @NBATV @BallySportsSW @theeagledallas put me in the game fr",
    "271": "@dallasmavs @SacramentoKings @NBATV @BallySportsSW @theeagledallas Thomas with 32 points or nothing",
    "272": "#NBA75- #NBA: #SacramentoKings/#DallasMavericks; Who U got-#Mavericks/#Kings?\n@SacramentoKings\n@dallasmavs  \n@NBATV  \n@NBA",
    "273": "Game 1 of 2 in Sacramento. \n\n🆚 @SacramentoKings \n⌚️ LATE TIP-OFF: 9:30PM CT\n📺 @NBATV and @BallySportsSW \n📻 @theeagledallas and 99.1 FM https://t.co/elFZern7rx",
    "274": "I’m into having shit, turning dreams to average shit\nBring your trophy to the club, Dallas Maverick shit",
    "275": "Free agent Isaiah Thomas plans to sign with the Dallas Mavericks. Thomas will join the team in Sacramento tonight. Source @ShamsCharania #Mavs #Thomas https://t.co/KJPu3T0Vr5",
    "276": "Make it happen @dallasmavs https://t.co/U1a09o4CUY",
    "277": "@prettybrngurl Jamarra, are you coming to Dallas for Mavericks game?  Dallas Illini will be there. Would love to meet you!",
    "278": "@dallasmavs @luka7doncic @kporzee @T_HardJR @jalenbrunson1 @swish41 @mgborja Also say hi to @poiZonivytheDJ 🇰🇪",
    "279": "@dallasmavs @luka7doncic @JoshBGreen @BobanMarjanovic @MaxiKleber @kporzee @DwightPowell33 Do we still have the belt?",
    "280": "More Mavericks Players Enter COVID Protocols After Playing Portland: Soobum Im-USA TODAY Sports  \n\nAfter playing Portland on Monday night, Dallas announces two players who saw action in that game are out. \n\nDallas Mavericks guard Brandon Knight… https://t.co/xJTrcJ2IAe #RipCity https://t.co/dTl1lriMVX",
    "281": "Isaiah Thomas has signed with the Dallas Mavericks making that his 9th different team in his NBA career. https://t.co/x96HGTTCHH",
    "282": "San Francisco:: Former Kings guard Isaiah Thomas en route to Sacramento ... to play for Dallas Mavericks https://t.co/jwPryJaNmY",
    "283": "Brandon Knight and Boban Marjanovic of the Dallas Mavericks have entered health and safety protocols. Both saw action against the Blazers Monday night, albeit briefly for Marjanovic. https://t.co/tU8MMXIBki",
    "284": "Free agent Isaiah Thomas is planning to sign with the Dallas Mavericks. He’s back in the league, as Dallas plays his former team, the Sacramento Kings tonight. https://t.co/odmPjaGdKg",
    "285": "@dallasmavs I can clear my schedule for any 10 days that yall may need me for 🙋🏾‍♀️🤠",
    "286": "@igzilla83 @LakersReporter This game-winner against the Dallas Mavericks was the “scene of the crime.” All of these Covid protocols following that celebration. https://t.co/9d2pAhzSrU",
    "287": "This 1.5yo is way too casual with these bombs. @mcuban @RealJasonKidd @dallasmavs yall gonna give him a 10-Day contract or what? He can be at the Mavs practice facility in 20 minutes. https://t.co/ZLBYYLRmEX",
    "288": "Thinking about betting on Dallas Mavericks @ Sacramento Kings (NBA)?  Find out what pick Pine member @Abirama locked in for the game.\n\nhttps://t.co/hRAw8w74ec",
    "289": "The Dallas Mavericks have agreed to a 10-day hardship deal with Isaiah Thomas, sources told ESPN.\nhttps://t.co/RnoCXlYfyO",
    "290": "Free agent guard Isaiah Thomas plans to sign with the Dallas Mavericks. Thomas is expected to join team in Sacramento tonight. (Shams) https://t.co/kyhyvvGJ0D",
    "291": "Dallas Mavericks: 4 reasons why Mavs are the ideal team for Isaiah Thomas https://t.co/w5QsmlYYli",
    "292": "Congratulations to muj who moved up 46 spots to take #19 on the Dallas Mavericks team leaderboard.\n\nhttps://t.co/H3UcoAlCB2",
    "293": "Preview: Mavs hoping for second win against Kings - The Official Home of the Dallas #Mavericks https://t.co/chqTGzYn12",
    "294": "Former Kings guard Isaiah Thomas will reportedly be in Sacramento on Wednesday as a member of the Dallas Mavericks.  https://t.co/Y6iDvtYFT5",
    "295": "@DistractedAnna All three point guards on the 2016 Dallas Mavericks roster were born on June 26th, 1984.",
    "296": "Isaiah Thomas had agreed to a 10-day hardship deal with the @dallasmavs after the team had 2 more players enter the @NBA health and safety protocols.",
    "297": "Former Kings guard Isaiah Thomas will reportedly be in Sacramento on Wednesday as a member of the Dallas Mavericks. https://t.co/DpAeduvD0j",
    "298": "Former Kings guard Isaiah Thomas will reportedly be in Sacramento on Wednesday as a member of the Dallas Mavericks. https://t.co/Mz4tuvC0X3",
    "299": "Former Kings guard Isaiah Thomas en route to Sacramento ... to play for Dallas Mavericks\nhttps://t.co/9Bxn3dFPUD",
    "300": "@dallasmavs @luka7doncic @BEDGEAR Now I can get behind this AllStar nomination! #LukaDoncic https://t.co/Y69waopNAd",
    "301": "@mavsfan505 @dallasmavs This season has been strange.",
    "302": "@M_Flores187 @dallasmavs It's an unfortunate truth lol",
    "303": "Isaiah Thomas is a Dallas Maverick.",
    "304": "@dallasmavs sign @isaiahthomas to a 10 day contract… @haralabob’s favorite player!",
    "305": "only ONE @dallasmavs is averaging 40% from 3... and that man is, Dwight Powell. \n\nThank you, Dwight, for being a sniper #mffl https://t.co/GCfigqt5Qm",
    "306": "@3411sethu @ShamsCharania @TheAthletic @Stadium See why the Dallas Mavericks are a bad team?🙄😐",
    "307": "only ONE @dallasmavs has played in ALL 33 games this season... and that man is, Dwight Powell. \n\nThank you @DwightPowell33 for having perfect always showing up #mffl https://t.co/31JnXRLy5Y",
    "308": "@fsentwali LeBron is a singular exception.  He is a player, GM and coach in one - and plays all those roles to a high degree.  \n\nthe 2004 NBA championship team Detroit Pistons and the 2011 Dallas Mavericks are examples of organizational excellence making it to the top.",
    "309": "Question Of The Day: Who holds the record for 300-plus yard passing games in a season?\nA. Donovan McNabb\nB. Carson Wentz \nC. Nick Foles\nD. Terrell Owens\nThe answer will be announced after the Dallas Mavericks-Sacramento Kings NBA Game on NBA TV tonight. https://t.co/yZmu9e8xgc",
    "310": "Isaiah Thomas to sign with the Dallas Mavericks https://t.co/CocuCyOcG2 #fantasybasketball",
    "311": "Isaiah Thomas ficha por Dallas Mavericks https://t.co/SiCOqAhtpD",
    "312": "Analyzing Wednesday’s Dallas Mavericks at Sacramento Kings odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/5HuG8W1Q2e",
    "313": "Analyzing Wednesday’s Dallas Mavericks at Sacramento Kings odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/Org3rEIzap",
    "314": "Dallas Mavericks at Sacramento Kings odds, picks and prediction https://t.co/kKa9c58DzP",
    "315": "@BallySportsSW @dallasmavs @Goodknight11 Always pulling for this young man!!!",
    "316": "IT TIME LETS GO! @dallasmavs https://t.co/GpfG6C1JnW",
    "317": "#RT @ShamsCharania: Mavericks center Boban Marjanovic and replacement guard Brandon Knight have entered health and safety protocols, sources tell @TheAthletic @Stadium. Dallas is planning to sign Isaiah Thomas to a hardship deal.",
    "318": "All these 10 day contracts cause of COVID… Lmk if y’all need a guy @dallascowboys \n@Buccaneers \n@Colts \n@Lakers\n@dallasmavs \n6’1\n185 (Can bulk to 205)\n21 Years\n4.65 40 YD\n\nQB , Linebacker, Safety, PF",
    "319": "On this day in sports history December 29, Don Nelson became the 3rd coach in NBA history to reach 1,000 career wins, as the Dallas Mavericks defeated the Atlanta Hawks 113-97 in 2001.",
    "320": "@GematriaNetwork Dallas Mavericks wins on 6/12/2011-2/13/22=557 weeks 102nd nfl season 201 557=102nd prime Star of David and Dallas cowboys star jesuit ritual 666",
    "321": "Breaking: Isaiah Thomas To Sign With Dallas Mavericks – NBA News https://t.co/PukNVf6zi3",
    "322": "Isaiah Thomas to sign with Dallas Mavericks, 2nd NBA team this season (report) – NBA News https://t.co/exBHMKiHkj",
    "323": "We got IT now @dallasmavs .. idk how to feel about this but I’m hoping he prospers again …",
    "324": "Isaiah Thomas ficha por Dallas Mavericks https://t.co/0W1XzsZQeH",
    "325": "Isaiah Thomas has signed with the Dallas Mavericks, per @ShamsCharania",
    "326": "Game Day!!! Game #34: 🐴Dallas Mavericks (16-17) @ 👑Sacramento Kings (14-21): 🏟️Golden 1 Center in Sacramento, California. 📺🏀⛹🏿🎫🤜🤛\n\n#MFFL #SacramentoProud https://t.co/vFezZjK88W",
    "327": "G Isaiah Thomas will sign with the Dallas Mavericks.",
    "328": "@dallasmavs Y’all hearing the collective laugh from the audience? 😆",
    "329": "@dallasmavs @luka7doncic greatness respect greatness",
    "330": "How to Watch Dallas #Mavericks vs. Sacramento Kings Game Live Online on December 29, 2021 https://t.co/3vxQQUV9qb",
    "331": "Dallas #Mavericks vs Sacramento Kings: Live Stream, Score Updates and How to Watch NBA match https://t.co/tooTSOZgYh",
    "332": "I said I would change teams if bol bol was traded to the Dallas mavericks. But they decided to sign Isaiah Thomas. I don’t have a problem with that at all. I think it’s great but it rubbed me the wrong way in the slightest and I threw up. I now cheer for Chicago Bulls. LFG",
    "333": "@Lakers @dallasmavs @DetroitPistons @ATLHawks I can play on a 10 day. Dm me for my email and my highlights, I’m good for a few mins off the bench to bring some energy into the game. Consider me",
    "334": "@dallasmavs @luka7doncic @BEDGEAR Okay, but what about KP?",
    "335": "Isaiah Thomas to join the Dallas Mavericks, per report – NBA News https://t.co/miAUFOZDoQ",
    "336": "@quackquackdave @redditmavericks @dallasmavs the memes have become too powerful",
    "337": "Dallas Mavericks players Brandon Knight and Boban Marjanović have entered health and safety protocols.",
    "338": "Isaiah Thomas will reportedly sign with the Dallas Mavericks https://t.co/DiXPz9ZfTN",
    "339": "Isaiah Thomas’ next stop: the Dallas Mavericks. 👀\n\nShams Charania says the veteran plans to sign with Dallas:\nhttps://t.co/gtq9w8IOTR",
    "340": "@squish41 @redditmavericks Oh cool. Pennywise is officially a Dallas Maverick. Let’s go.",
    "341": "Isaiah Thomas has SIGNED with the Dallas Mavericks! https://t.co/wAii4OjVn3\n\n#NBA #NBA75 #NBAXmas #NBATwitter #IsaiahThomas #BreakingNews #MFFL #LakeShow #CourtSideHeat",
    "342": "@landahoy14 @redditmavericks @dallasmavs See you tweeted this and now Boban is in Health and safety protocols 🤦🏻‍♂️ the league couldn’t handle it.",
    "343": "@WhatSeperatesU @dallasmavs @luka7doncic @BEDGEAR He will be",
    "344": "THIS IS A GLIMPSE INTO WHAT ISAIAH THOMAS LOOKS LIKE IN A DALLAS MAVERICKS UNIFORM https://t.co/GJm9quhCGu",
    "345": "THE REASON WHY THE DALLAS MAVERICKS SIGNED ISAIAH THOMAS 👇🏽 https://t.co/mgq6HFWVYW",
    "346": "🚨 JUST IN : Free agent guard Isaiah Thomas plans to sign with the Dallas Mavericks. Thomas is expected to join team in Sacramento tonight, per Shams Charania.\n\n#isaiahthomas #mavericks #nba https://t.co/bM9xUnFvZD",
    "347": "@asapzeke @ShamsCharania @TheAthletic @Stadium Mavericks center Boban Marjanovic and replacement guard Brandon Knight have entered health and safety protocols, sources tell @TheAthletic @Stadium. Dallas is planning to sign Isaiah Thomas to a hardship deal.",
    "348": "Isaiah Thomas reportedly joins Dallas Mavericks after 10-day contract with Lakers #DallasMavericks #IsaiahThomas #NBARumors https://t.co/o29KzcfvyI",
    "349": "Mavericks center Boban Marjanovic and replacement guard Brandon Knight have entered health and safety protocols, sources tell @TheAthletic @Stadium. Dallas is planning to sign Isaiah Thomas to a hardship deal.",
    "350": "BREAKING: The Dallas Mavericks have signed Isaiah Thomas and he will suit up tonight against Kings. https://t.co/F6QT0KUz5k",
    "351": "@dallasmavs @luka7doncic @BEDGEAR When is Luka NFT going to happen Mark Cuban?",
    "352": "@kaiserm1013 @boardroom @dallasmavs @ShamsCharania @isaiahthomas That one dude on the sideline begging to get in a pickup at the YMCA",
    "353": "@ShamsCharania @TheAthletic @Stadium I am also planning on signing with the @dallasmavs please notify the team for me",
    "354": "Dallas Mavericks legend Isaiah Thomas",
    "355": "@TheHoopCentral @ShamsCharania Good luck @dallasmavs",
    "356": "Isaiah Thomas is en route to Sacramento and will be in uniform for Dallas tonight and coming off the Mavericks bench, league sources say. \n\nMore NBA from me: https://t.co/A6ycVm5PUQ",
    "357": "@dallasmavs @luka7doncic @BEDGEAR Let’s not go crazy he still needs to get in shape this year for that to happen",
    "358": "Isaiah Thomas is signing with Dallas Mavericks, per @ShamsCharania  https://t.co/YhDyZfHsAC",
    "359": "@dallasmavs @luka7doncic @BEDGEAR Sell IT",
    "360": "@dallasmavs @luka7doncic @BEDGEAR he wont be an allstar this year",
    "361": "Isaiah Thomas to join the Dallas Mavericks, per Shams https://t.co/340Ytj2aIp https://t.co/mLClmxdOSl",
    "362": "@dallasmavs @luka7doncic @BEDGEAR Announce IT",
    "363": "⭐️ 2x NBA-All Star ⭐️ Let’s run it 🔙. \n\nRT to vote @luka7doncic for #NBAAllStar 🗳\n\n@BEDGEAR | #WallpaperWednesday https://t.co/OFvoV07orD",
    "364": "#NBA\n\n🔒 Dallas are 7-13 SU in their last 20 games against Sacramento.\n🔒 Sacramento are 3-7 SU in their last 10 games played in December.\n\n#Mavericks -2½\n#Kings +115\nO/U 220\n\nSign up now for a premium #perhead service and get 2 weeks free! 👉 https://t.co/jUA8LsIyOe https://t.co/lCp1raZ6mb",
    "365": "Isaiah Thomas to join the Dallas Mavericks, per report https://t.co/pmqYpwyI9k https://t.co/u5n8lXUd2I",
    "366": "Guard Isaiah Thomas plans to sign with Dallas Mavericks, report says https://t.co/A9kX6GlhFO",
    "367": "🔥🔥RT @BleacherReport: Isaiah Thomas will sign with the Dallas Mavericks, per @ShamsCharania https://t.co/9WtidcuDC9",
    "368": "Luka Doncic - I got it. #lukadoncic #dallasmavericks\nhttps://t.co/df4AVsRBej",
    "369": "Isaiah Thomas in a Dallas Mavericks uniform is NOT what I had on my 2021 bingo card…#MFFL https://t.co/E2Hsb5WgN5",
    "370": "Luka Doncic - I got it. #lukadoncic #dallasmavericks\nhttps://t.co/df4AVsRBej",
    "371": "plz recreate @dallasmavs https://t.co/cWYc3QVGAh",
    "372": "@BleacherReport @ShamsCharania Nice! Another reason to like @dallasmavs",
    "373": "BREAKING: Isaiah Thomas has signed with the Dallas Mavericks #MFFL",
    "374": "@boardroom @dallasmavs @ShamsCharania @isaiahthomas Bro just out here running 5s with random squads",
    "375": "Isaiah Thomas signs with the Dallas mavericks. Haha beat ya @woj 😂",
    "376": "@dallasmavs so did we get IT or not",
    "377": "@nick_fcb13 Free agent guard Isaiah Thomas plans to sign with the Dallas Mavericks, sources tell @TheAthletic @Stadium\n. Thomas is expected to join team in Sacramento tonight.",
    "378": "Isaiah Thomas will sign with the Dallas Mavericks, per @ShamsCharania\n\n#NBA | #Celtics | #BleedGreen https://t.co/lYj6V8xM9Z",
    "379": "NBA news #IsaiahThomas is to join the #DallasMavericks https://t.co/gCHe12hI2l",
    "380": "Isaiah Thomas to sign a 10-day contract with the Dallas Mavericks https://t.co/T3gciRQnJv",
    "381": "🚨 Isaiah Thomas is signing with the Dallas Mavericks https://t.co/Qas8kwQtep",
    "382": "#RT @ShamsCharania: Free agent guard Isaiah Thomas plans to sign with the Dallas Mavericks, sources tell @TheAthletic @Stadium. Thomas is expected to join team in Sacramento tonight.",
    "383": "Isaiah Thomas is signing with the Dallas Mavericks, per @ShamsCharania https://t.co/AHFEGo0lRE",
    "384": "Isaiah Thomas will sign with the Dallas Mavericks, per @ShamsCharania https://t.co/xg7ecb5QOY",
    "385": "Once again, Isaiah Thomas has found an #NBA team 😃\n\nOnce again, it’s not the Boston #Celtics 😔\n\nIT is headed to Dallas to join the #Mavericks 🥳 https://t.co/ZLp6OfHeAU",
    "386": "Isaiah Thomas is signing with the @dallasmavs, per @ShamsCharania.\n\nIT, who last played for the Lakers a week ago, is expected to join the team this evening. https://t.co/6hHJIyqesm",
    "387": "Free agent G Isaiah Thomas plans to sign with the Dallas Mavericks, per @ShamsCharania. https://t.co/I4UOrXFqkh",
    "388": "All season this year @dallasmavs 🤦🏽‍♂️ #StillLoveYou #MFFL https://t.co/LwD56ry8Y9",
    "389": "Free agent guard Isaiah Thomas plans to sign with the Dallas Mavericks, sources tell @ShamsCharania. \n\nThomas is expected to join team in Sacramento tonight. https://t.co/YOA2F77hsE",
    "390": "The Dallas #Mavericks and #NBA FA G Isaiah Thomas have agreed to a deal and Thomas will join the team in Sacramento tonight per the Athletic. https://t.co/6s7fXLa8DH",
    "391": "BREAKING: Isaiah Thomas has signed a deal with the Dallas Mavericks &amp; will play for them tonight against Sacramento. \n\nDetails of the contract to come. \n\nThoughts on the signing? 🤔 https://t.co/ZdtYj4opM1",
    "392": "Good Luck @isaiahthomas ! RT @ShamsCharania: Free agent guard Isaiah Thomas plans to sign with the Dallas Mavericks, sources tell @TheAthletic @Stadium. Thomas is expected to join team in Sacramento tonight.",
    "393": "Isaiah Thomas is signing a 10-day contract with the Dallas Mavericks per @ShamsCharania",
    "394": "Do the Dallas Mavericks know about this?? https://t.co/cewvpBRBNS",
    "395": "Play IT at center tonight, @dallasmavs",
    "396": "Isiah Thomas to sign with the @dallasmavs",
    "397": "ISAIAH THOMAS IS BACK AGAIN! Dallas Mavericks give him a shot 👀 https://t.co/QpUaNboywM",
    "398": "Isaiah Thomas is officially a Dallas Maverick.",
    "399": "MAJOR WIN @dallasmavs MAJOR WIN‼️ Welcome to DFW @isaiahthomas https://t.co/7AmMGTRfGk",
    "400": "A look back at @Swish41 Top Moments.\n\nNo 8️⃣ - The time Dirk went bananas on the Spurs in the 2006 NBA Playoffs. \n\n#DirkTop10 | @DallasMavs https://t.co/TIy9w5Fv2P",
    "401": "BREAKING: Isaiah Thomas is signing with the Dallas Mavericks, via The Athletic.",
    "402": "OFFICIAL: Isaiah Thomas is signing with the Dallas Mavericks; he is expected to join the team tonight while they are in Sacramento. #NBA #NBA75 #NBAXmas #NBATwitter #IsaiahThomas #CourtSideHeat #MFFL #BreakingNews",
    "403": "Free agent Isaiah Thomas plans to sign with the Dallas Mavericks",
    "404": "ISAIAH THOMAS IS NOW A DALLAS MAVERICK https://t.co/d14UJhJrze",
    "405": "Isaiah Thomas is expected to sign with the Dallas Mavericks. Per @ShamsCharania",
    "406": "@ShamsCharania @TheAthletic @Stadium Dallas mavericks get even worse",
    "407": "Free agent guard Isaiah Thomas plans to sign with the Dallas Mavericks, sources tell @TheAthletic @Stadium. Thomas is expected to join team in Sacramento tonight",
    "408": "Free agent guard Isaiah Thomas plans to sign with the Dallas Mavericks, sources tell @TheAthletic @Stadium. Thomas is expected to join team in Sacramento tonight.",
    "409": "It’s been two years ago today that the @dallasmavs played the @Lakers @cryptocomarena in LA . That was Kobe’s last game he attended. 12/29/19. #MFFl #LakeShow ✝️✝️🙏🏻🙏🏻.",
    "410": "@pdx_mavs @SportsSturm From CBS Review of Barnes Trade:  Grade - A - \"This trade gives Dallas real financial flexibility, an impressive accomplishment considering it took on the contracts of Tim Hardaway Jr. and Courtney Lee in order to get Kristaps Porzingis. The Mavericks could create a $21.3 million",
    "411": "NBA Betting Preview: Dallas Mavericks vs. Sacramento Kings https://t.co/4sgBVdzOI2",
    "412": "@BallySportsSW @swish41 @mcuban @dallasmavs I see a post about #41, I like.",
    "413": "Dallas Mavericks: Is it Josh Green time for the Dallas Mavericks: ? https://t.co/pXgyk77Zly",
    "414": "Really ready for the Dallas mavericks to offer me a 10 day hardship contract. I’m ready.",
    "415": "@dallasmavs Nobody thinking at les one month to this moment Kobe and his daugther were died😭😭",
    "416": "For @mavsmoneyball: Is it Josh Green time for the Dallas Mavericks? https://t.co/dOSAg5gkQB https://t.co/Mlhs6ofnLV",
    "417": "📅 On this day in 2001, the @dallasmavs Don Nelson became the third coach in NBA history to reach 1,000 wins with a victory over the Hawks.\n\nNelson is now one of 10 coaches with at least 1,000 wins; one of four with at least 1,000 losses; and one of two to reach both marks. https://t.co/NFgovZHYmR",
    "418": "Is it Josh Green time for the Dallas Mavericks? https://t.co/az5wHQKQIK https://t.co/fI2YOPdb6E",
    "419": "Dallas Mavericks. Trade for Ben Simmons and then use the roster openings to sign Brandon Knight and Theo Pinson and Marquese Chriss. Make something HAPPEN",
    "420": "🏀Dallas Mavericks Today🏀\n\nIs Luka Doncic close to returning with new protocols? Is Josh Green starting to breakout? \n\nI cover that &amp; more on today's video.\n\n📺WATCH: https://t.co/upXgYziZ4X https://t.co/UO8Y9zEYPD",
    "421": "@dallasmavs @luka7doncic @kporzee @T_HardJR @jalenbrunson1 @swish41 @mgborja Why not go ahead and put her handle in the tweet?",
    "422": "@dallasmavs @kporzee Not playing like one, so no! Darius Garland from Cavs has a better case for All star than KP!",
    "423": "Today's NBA Consensus (So Far):\n\nUtah Jazz 74%\nNew York Knicks 70%\nBoston Celtics 69%\nDallas Mavericks 69%\nMemphis Grizzlies 67%\nIndiana Pacers 60%\nOklahoma City Thunder 54%\nChicago Bulls 52%\nSan Antonio Spurs 52%",
    "424": "@dallasmavs this brings me to tears! can’t believe that this happened literally a month before he passed i wish we could go back and tell him  &amp; everyone not to board the plane",
    "425": "Kings gameday live: Will Dallas Mavericks star Luka Doncic return from COVID-19 protocols? https://t.co/uzqFgC05Bf",
    "426": "We asked our team photographer for her favorite pictures of the year 👇📸 #BestOf2021 https://t.co/Hqdf1CJqN5",
    "427": "@JohnKapina @dallasmavs I wasn't there and I want a photo.",
    "428": "@NBATV @SacramentoKings @dallasmavs Man , KP has been proving everybody wrong .",
    "429": "@NBATV @SacramentoKings @dallasmavs KP going for 30+",
    "430": "So, whatever happened to the DPOG belt? @JoshBGreen #NBAAllStar @dallasmavs https://t.co/dx4QLWtKq8",
    "431": "@dallasmavs All love and respect but they dapped like 6 times in a span of a minute 😂😂",
    "432": "@dallasmavs @luka7doncic Such a great photo by @Stevallica",
    "433": "@ilikelewds1 @h14p1 @cameron Yup. Your credit card and passport will be an NFT in 5 years. Season tickets to the @dallasmavs @mcuban will be even more soon. NFTS are not just art.",
    "434": "Congratulations to RTROats who moved up 5 spots to take #24 on the Dallas Mavericks team leaderboard.\n\nhttps://t.co/H3UcoAlCB2",
    "435": "Dallas Mavericks: Preview: Mavs hoping for second win against Kings https://t.co/w5sELmd6QN",
    "436": "Revenge Game: Harrison Barnes plays Dallas tonight.  He played 205 games in his career for the Mavericks.",
    "437": "@dallasmavs That guy with a LeBron Jersey wanted a photo so bad 😂😂",
    "438": "@dallasmavs @luka7doncic Long live Mamba 🙏",
    "439": "@PickDawgz Chris Wright #342 \n\n12/29/2021\n\nPick #1: NCAAF Maryland v Virginia Tech over 54.5\nPick #2: NBA Dallas Mavericks -2\nPick #3: NBA Hornets +3.5\n\n#PickDawgzCapperContest",
    "440": "@dallasmavs @luka7doncic Kobe daughter in the pic makes it sad",
    "441": "DasHaus made a bet!\n\nEvent: Dallas Mavericks vs Sacramento Kings #NBA\nBet: Dallas Mavericks TO WIN -1.5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "442": "@dallasmavs @luka7doncic Iconic",
    "443": "2 years ago today. \n\n🐍 x 🪄 https://t.co/gc1MNlqOdn",
    "444": "@BallySportsSW @Mavs_FFL @dallasmavs @Goodknight11 Get on YouTube tv",
    "445": "Dallas Mavericks fan Stephen Joseph has entered health and safety protocols.",
    "446": "🏀 𝗚𝗔𝗠𝗘𝗗𝗔𝗬 🏀\n\n🔵 DALLAS MAVERICKS\n👑 SACRAMENTO KINGS\n📍 Golden 1 Center (Sacramento)\n📺 NBA League Pass\n\n#SacramentoProud https://t.co/sjUFN6nryx",
    "447": "NBA Basketball Game Betting Picks Simulator: 10:40 PM ET - Dallas Mavericks vs. Sacramento Kings - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/1dsIb1rphy #nba #sportsbetting #freepicks #cappertek",
    "448": "🚨 Podcast Episode 45 Is Out! 🚨\n“Josh Green, Brandon Knight, and Marquese Chriss Headline New-Look Dallas Mavericks” \n\nHOSTS: @sixfivelando, @joshmazr.\n\nApple Podcasts: https://t.co/LeCyK0HKk4\nSpotify: https://t.co/vcUIzOWEbi\nWebsite: https://t.co/hDTVZQse9l https://t.co/AUFGhw2RKJ",
    "449": "@dallasmavs @JoshBGreen There we go! THAT’S the Josh Green I expected.",
    "450": "How to Watch Dallas #Mavericks vs. Sacramento Kings Game Live Online on December 29, 2021 https://t.co/tooTSOZgYh",
    "451": "@KlDSSEEGH0STS he’s gonna look dashing in Dallas Mavericks uniform",
    "452": "@JesusBengoechea Real Madrid Dallas Mavericks ??",
    "453": "Kings gameday live: Will Dallas Mavericks star Luka Doncic return from COVID-19 protocols? – https://t.co/xl8vbZOZSd",
    "454": "Dallas Mavericks: Kings gameday live: Will Dallas Mavericks:  star Luka Doncic return from COVID-19 protocols? https://t.co/UHA8zpwFNW",
    "455": "Get this 2021-22 Panini Sticker &amp; Card Collection Luka Doncic Dallas Mavericks\nhttps://t.co/rWi8M4t5NJ #Luka #Dallas #NBA #NBAVote",
    "456": "Live updates throughout the day on tonight’s NBA game between the Sacramento Kings and Dallas Mavericks at Golden 1 Center. https://t.co/ATviAJOmSO",
    "457": "Live updates throughout the day on tonight’s NBA game between the Sacramento Kings and Dallas Mavericks at Golden 1 Center. https://t.co/p4H9TZXjUd",
    "458": "Live updates throughout the day on tonight’s NBA game between the Sacramento Kings and Dallas Mavericks at Golden 1 Center.  https://t.co/jGREHgPjZE",
    "459": "Luka Doncic Dallas Mavericks 2018-19 Panini Prizm Red White \n#sportsCards\nSource: Fanatics Checker\nReason: In Stock\n\n05:13:48.2280 AM EST #Ad\n\nhttps://t.co/j4DIkrmxZA",
    "460": "Luka Doncic Dallas Mavericks 2018-19 Panini Prizm Red White \n#sportsCards\nSource: Fanatics Checker\nReason: In Stock\n\n05:13:48.2280 AM EST #Ad\n\nhttps://t.co/RJzgSk5BDM",
    "461": "Sacramento Kings vs. Dallas Mavericks\n NBA LIVE \n📲 :  https://t.co/CMIJDhy490\nToday @ 7:30 pm PST\nFree For Subscription",
    "462": "Dallas Mavericks (16-17, eighth in the Western Conference) vs. Sacramento Kings (14-21, 11th in the Western Conference) https://t.co/6LhjCmSUVl",
    "463": "Dallas Mavericks (16-17, eighth in the Western Conference) vs. Sacramento Kings (14-21, 11th in the Western Conference) https://t.co/267KoB8GPr",
    "464": "Prediction Portland Blazers – Dallas Mavericks https://t.co/mTWGebp7jk",
    "465": "@TheHoopCentral Dallas maverick if luka and kp healthy",
    "466": "Dallas Mavericks: Kings, Mavericks gear up for two-game set in Sacramento https://t.co/xkGZg19hyX",
    "467": "#youtube Kristaps Porzingis on Dallas Mavericks BEATING Portland Trail Blazers with no Luka Doncic https://t.co/ofG0nuNz3A",
    "468": "@dallasmavs @JoshBGreen @D_RyFIFA few nice dimes",
    "469": "@Alex_James99 @dallasmavs @BEDGEAR @kporzee Sure, 20ppg for the 3rd straight season but stats are stupid.  What's more credible is that you just FEEL like he's terrible.  That's what matters.",
    "470": "Dallas Mavericks: Dallas Mavericks:  vs Sacramento Kings: Live Stream, Score Updates and How to Watch NBA match https://t.co/kcIHIQWdE8",
    "471": "@semiobjective i actually went to my first NBA game abour 2-3 weeks ago. i live in kansas and my girlfriend and I drove to dallas to watch the lakers vs mavericks and it was insane seeing lebron and all the other legends! you’ll love it man!",
    "472": "@dallasmavs @luka7doncic @BobanMarjanovic How bitches be looking at 5'11 vs 6'0 guys.",
    "473": "Portland Trail Blazers vs. Dallas #Mavericks: Live Stream, TV Channel, Start Time | 12/27 ... https://t.co/grBASVC5uG",
    "474": "Congratulations to Delarius who moved up 353 spots to take #408 on the Dallas Mavericks team leaderboard.\n\nhttps://t.co/H3UcoAlCB2",
    "475": "@dallasmavs better keep Brandon Knight",
    "476": "@dallasmavs @kporzee Healthy he must be the center of the top three, but he is too easy to injury, or make him a pure pitcher, with his height, can also play a world",
    "477": "Dallas Mavericks: 3 things to watch as the Mavericks visit the Kings https://t.co/Ixpd5zji28",
    "478": "it's extremely will add an extra lucky charms if yoongi really have portland blazers front row seat &amp; shake your hands to say goodluck dam, in your next game when you'll go against dallas mavericks. for god sake, i need head to head bet my luck over yoongi this time 😉 https://t.co/Cu0Rkx2Ppg",
    "479": "Check out Dirk Nowitzki Dallas Mavericks NBA 12”x15” Engraved Plaque RP Autograph Picture https://t.co/qQ7ETvHnAI @eBay",
    "480": "Check out Dirk Nowitzki Dallas Mavericks NBA 12”x15” Engraved Plaque https://t.co/XlbnhjMEaK @eBay",
    "481": "Monster Boom! 🤯🤯\nLuka Doncic /10 Influx Gold Auto pulled from our @paniniamerica Flux Basketball breaks!  @luka7doncic \n#boom #whodoyoucollect #luka #lukadoncic #mavericks #dallas #basketball #autograph #thehobby #groupbreaks #nba https://t.co/bKEBC5SVTU",
    "482": "@GlanvilleCaleb @dvgca @NBA @dallasmavs Why do y’all go out of your way to have a take knowing you havent watched him play this season 😂",
    "483": "@dallasmavs @mcuban @kporzee Not even close…and he’s too old for rising stars",
    "484": "Check out LUKA DONCIC 2020-21 PANINI ILLUSIONS DALLAS MAVERICKS #43 https://t.co/yJQFCrs3cE @eBay",
    "485": "Brandon Knight is BACK and doing his thing with the Dallas Mavericks 🔥\n\nHe had a near 20-piece last night off the bench 👏 https://t.co/7dwWRgaytw",
    "486": "@dallasmavs @stephy_825 @FrankLikina This crushes my soul.",
    "487": "@dallasmavs @FCDallas @kporzee WHAT ABOUT DONCIC",
    "488": "Brandon Knight finishes with 18 points, 3 rebounds, 5 assists and 1 steal in his third game back in the NBA with the Dallas Mavericks.\n\n“I don’t care how it happened. The fact that I was able to put on a NBA jersey (again)… some tears came out of my eyes.” https://t.co/SV2zBaXwdV"
}