{
    "0": "#NBA #NBATwitter Today's Lineups\n\n#MagicTogether \nOrlando Magic Starting 5:\nGary Harris\nJalen Suggs\nFranz Wagner\nWendell Carter Jr\nMo Bamba\n\n#TrueToAtlanta\nAtlanta Hawks Starting 5:\nTrae Young\nBogdan Bogdanovic\nKevin Huerter\nJohn Collins\nClint Capela",
    "1": "@OrlandoMagic @chuma_okeke @wendellcarter34 Just announce that devos should sell the Team.",
    "2": "Tonight’s views\n\nThe Orlando Magic are in town facing the Atlanta Hawks.\n\nTip-Off is at 7:32pm\n\n#forever404 #truetoatlanta #nba75 https://t.co/zJhNF3R1wz",
    "3": "@Belgian_Magic @OrlandoMagic Update: Expect to see both on the court sometime after/between New Years and all-star weekend.",
    "4": "@ORL_EGW @OrlandoMagic I think RJ should start even when jalen is healthy",
    "5": "@FIizop @OrlandoMagic @chuma_okeke @wendellcarter34 Unless you give is trae we’re good",
    "6": "The night's Vernon Jones ads have begun\nAtlanta Hawks vs Orlando Magic https://t.co/HMIbUHFeu7",
    "7": "With Suggs out tonight, it’ll be nice to see Gary Harris show us something, especially on the offensive end. \n\nRJ Hampton should get plenty of minutes tonight as well, which Magic fans have been asking for. #OrlandoMagic #MagicTogether",
    "8": "1st day of NBA cartoons!!! #NBA #charlottehornets #miamiheat #orlandomagic #atlantahawks #washingtonwizards https://t.co/ryIRkKyl8b",
    "9": "Orlando Magic rookie Jalen Suggs OUT tonight vs. the Atlanta Hawks with an ankle injury",
    "10": "@Dan_Savage @OrlandoMagic That’s terrible",
    "11": "Starting lineup for Orlando vs Atlanta - coming up LIVE on AFN 📺🌍\n\n#NBA | #ForTheTroops🇺🇸 \n(via @OrlandoMagic) https://t.co/hkBoQRr3KG",
    "12": "After a tidy win against @OrlandoMagic the other night, @WashWizards are looking to get their fifth-straight win against @PelicansNBA tonight 👍🤞🙏!! @WashWizards are definitely a force to contend with this year 🎉🎆!!",
    "13": "@Belgian_Magic @soulchild72 @OrlandoMagic I think they've effectively said as much without saying it. And if they were tanking, this is the first piece of PR they'd put out. So much of a team's public statements are with a purpose and to deliver a chosen message that often isn't reality",
    "14": "After a 5-game home stand, I’m back in studio for @OrlandoMagic road broadcasts with @JakeChapmanOM! Tune in to the pregame on https://t.co/IQ7R55Ji5a https://t.co/r47ANS29f3",
    "15": "PHOTOS, VIDEO: The Magic of Christmas at Hogwarts Castle Nighttime Show Returns for the 2021 Holiday Season at Universal Orlando Resort\n\nhttps://t.co/igy5ifFcTj",
    "16": "📅 On this day in 2005, the @OrlandoMagic's Dwight Howard had 21 points and 20 rebounds in an 85-77 win over the Bobcats.\n\nHoward (19 years, 342 days) is the only teenager in NBA history to record a 20-point, 20-rebound game. https://t.co/pOG3BgyDO9",
    "17": "Game 14\n\n🏀: Magic vs Hawks\n🕔: 7:00 PM Coverage\n📻: FM 96.9 | am740 | 101.1 HD-2\n📱: iHeartRadio App in Orlando https://t.co/M3ZBNgfKgX",
    "18": "@OrlandoMagic @chuma_okeke @wendellcarter34 Westlake and Pace Academy! Welcome home guys",
    "19": "ORL Magic rookie G, Jalen Suggs has a sprained ankle and is out tonight vs ATL and is considered day-to-day. I expect to see more of RJ Hampton &amp; Gary Harris #NBA #OrlandoMagic",
    "20": "@TAK121300 @sxm_magic @OrlandoMagic No idea what he meant, but theres no timeline for either of them. The guess has been both will probably be back in December, maybe Fultz in late November",
    "21": "@jeremytache I was surprised to see it’s not the Orlando Magics theme which I learned today was a thing.",
    "22": "Although Magic sit in conference basement after 13 games, all hope isn’t lost - Orlando Sentinel https://t.co/YWpWSjnt7z",
    "23": "Detroit Pistons - Sacramento Kings\nCleveland Cavaliers - Boston Celtics\nWashington Wizards - New Orleans Pelicans\nAtlanta Hawks - Orlando Magic\nSan Francisco 49ers - Los Angeles Rams\n\nBet slip link: https://t.co/VTI57ZxOeC https://t.co/UtxJlUO5n6",
    "24": "We're ready for the bounce back today against the @ATLHawks . Good luck @TheRealMoBamba and the @OrlandoMagic ! It's GMDY!\n\n#NBATwitter #MagicAboveAll💫 #wearthegame",
    "25": "#NBAMagicPolls Most impactful Magic player Tonight will be ______\n\n#FillInTheBlank\n\n#MagicTogether \nVs\n#TrueToAtlanta \n\n#OrlandoMagic #MagicTogether  #WeGotAlotPopping #MagicSzn2021\nWE💥G O T💥ALOT💥P O P P I N G",
    "26": "GAME #14\n\nThe @OrlandoMagic go from staying at home to now going on a 5 game road trip, starting TONIGHT in Atlanta against the @ATLHawks!\n\nPregame starts at 7 PM with @JakeChapmanOM with tip off set for 7:30 PM on @969thegame https://t.co/fo8EMjJXP6",
    "27": "@Julie_thado97 @OrlandoMagic @Arnoldnike93 Bro nobody on the Magic account gives 2 shits about ur bitcoin",
    "28": "#NBAMagicPolls Which vet steps up Tonight?\n\n#MagicTogether \nVs\n#TrueToAtlanta \n\n#OrlandoMagic #MagicTogether  #WeGotAlotPopping #MagicSzn2021\nWE💥G O T💥ALOT💥P O P P I N G",
    "29": "@nba_ruim @br_orlandomagic @The_ColeAnthony your my idol! Here's a work of art of you!",
    "30": "🔴 IN LIVE\n\nAmway Center, Orlando, FL\n\nMILWAUKEE BUCKS\nvs\nORLANDO MAGIC\n\nANBATV: https://t.co/SyZA4GIw4M https://t.co/VOF2izifTb",
    "31": "Here is tonight’s (11/15) pregame media session with @OrlandoMagic Head Coach Jamahl Mosley:\n\n#MagicTogether \n\nhttps://t.co/iVPmrAjAhT",
    "32": "#NBAMagicPolls Who Wins this game?\n\n#MagicTogether \nVs\n#TrueToAtlanta \n\n#OrlandoMagic #MagicTogether  #WeGotAlotPopping #MagicSzn2021\nWE💥G O T💥ALOT💥P O P P I N G",
    "33": "@sxm_magic @OrlandoMagic What?",
    "34": "Orlando vs Atlanta\n\n🔵Anthony over 18.5 points\n🔵Collins P+R+A over 25.5\n\nI've recommending something good happening to the Orlando Magic. Have I been hacked? Surprisingly no! Jalen Suggs and his 26.1% usage is out tonight. That has to go somewhere right?\n\nWhy not Cole Anthony?",
    "35": "#NBAMagicPolls Cole Anthony scores 20 points Tonight.\n\n#OverOrUnder \n\n#MagicTogether \nVs\n#TrueToAtlanta \n\n#OrlandoMagic #MagicTogether  #WeGotAlotPopping #MagicSzn2021\nWE💥G O T💥ALOT💥P O P P I N G",
    "36": "The @OrlandoMagic starting Anthony, Harris, F. Wagner, Carter Jr., Bamba on Monday. #LetsGoMagic #NBA",
    "37": "@TAK121300 @OrlandoMagic Inured g",
    "38": "@OrlandoMagic Man I miss the old 2019 line up",
    "39": "@OrlandoMagic We got this 💪💪",
    "40": "@Magic_PR @OrlandoMagic Suggs to sucks so far this season hopefully  we can see his potential  this year",
    "41": "@OrlandoMagic Beat the Hawks. They been on a losing streak recently but won their last game. Lets put a stop to their winning tonight.",
    "42": "@OrlandoMagic Is there any timeline for Fultz and Issac?",
    "43": "@OrlandoMagic Gary Harris https://t.co/Z3lc8sqwS6",
    "44": "@OrlandoMagic Game cannot be played until you make the new city jerseys available for purchase online",
    "45": "tonight's starting five in ATL ⬇ https://t.co/UD9KMNyQ6K",
    "46": "With Jalen Suggs out, expect the @OrlandoMagic to utilize the elements of positionless basketball they've talked about in regards to backup point guard duties. Franz Wagner, R.J. Hampton, Terrence Ross and Gary Harris will all assist in that role. https://t.co/6ctuxwMbVf",
    "47": "Pregame interviews with @ATLHawks Head Coach Nate McMillan and @OrlandoMagic Head Coach Jamahl Mosely. @OrlandoMagic vs. @ATLHawks in Atlanta at @StateFarmArena tonight. Stay tuned for my coverage on @FortyEightMins postgame. #TrueToAtlanta #MagicTogether #atlantahawks #NBA75 https://t.co/DtbrHZ87J7",
    "48": "@Big_Chuma_okeke @OrlandoMagic ayo spare some more? Askin for a friend😏",
    "49": "Orlando Magic Starters:\n\nCole Anthony\nGary Harris\nFranz Wagner\nWendell Carter\nMo Bamba\n\nPlayers out:\nMichael Carter-Williams\nMarkelle Fultz\nJonathan Isaac\nE'Twaun Moore\nJalen Suggs\n#MagicTogether #NBA #NBATwitter #NBA75",
    "50": "Tonight's starting lineup for the Orlando Magic: Anthony, Harris, F. Wagner, Carter Jr., Bamba https://t.co/bVWH4Av1bs",
    "51": "The Orlando Magic take on the Atlanta Hawks at 7:30pm on @ballysportsflorida\n\n#atlanta #sports #game #orlandomagic #magictogether #traeyoung #podcast #spotify #georgia #nba #atlantahawks #basketball #ESPN #followme #likeforlike #like4like #atl #coleanthony #nbaseason #orlando https://t.co/OQcjrTjagU",
    "52": "@Magic_PR @OrlandoMagic Man, that Suggs.",
    "53": "Let's go @OrlandoMagic 🔥🔥🔥",
    "54": "Jalen Suggs (ankle) will not play tonight in the @OrlandoMagic's road game against the Atlanta Hawks. Gary Harris will start in his place.",
    "55": "Per the @OrlandoMagic, guard Jalen Suggs will not play tonight at Atlanta due to a sprained right ankle. Suggs is day-to-day.",
    "56": "The Orlando Magic announce that rookie Jalen Suggs will not play tonight against the Atlanta Hawks due to a right ankle sprain.",
    "57": "🚨 INJURY UPDATE:\n@OrlandoMagic guard Jalen Suggs will not play tonight at Atlanta due to a sprained right ankle.\n\nSuggs is day-to-day.\n\n#MagicTogether",
    "58": "I don’t see an opening for someone to cover the Orlando Magic… https://t.co/Jwqc4JRLy1",
    "59": "Your Price: $29.99 - Orlando Magic New Era 2021/22 City Edition Official 9TWENTY Adjustable Hat https://t.co/vV03nsNp0G https://t.co/36tYkOeInZ",
    "60": "Heavy Late Sharp Action moving right now in the NBA. Just got an emergency call from Money Makin Mitch in Vegas……\n**Orlando Magic vs. Atlanta Hawks**\n                ***OVER 216***\n                      🔥🔥🔥 https://t.co/EvEw2fN2IT",
    "61": "BWW Review: CINDERELLA at Orlando Repertory Theatre - Magic and wonder comes to life on stage with a brilliance that is sure to thrill theatergoers of all ages\nhttps://t.co/syFqmpJCpe",
    "62": "@OrlandoMagic @ATLHawks @BallySportsFL @969thegame @thats_G_ Is the Tuesday news that we’re releasing Gary pls",
    "63": "@Belgian_Magic @OrlandoMagic How many retweets is gonna be enough for management to come out and give us fans an ACTUAL update???",
    "64": "A new Let's Play!  Draft Day Sports Pro Basketball 2022 with the Orlando Magic!  Episode 1--Meet the Team and Opening Night is up!  Hope you enjoy!\n\n@wolverinestudio \n\nhttps://t.co/Xc1gesn82i",
    "65": "@BeORLMagic @OrlandoMagic Per NBA Locker Vision, looks like there debuting on 11/24 vs the Hornets. \n\nhttps://t.co/0j2D6Zylxk",
    "66": "I loved the Orlando Magic version of T-Mac, especially his battles with Kobe. Just have to wonder what could have been with a healthy Grant Hill. https://t.co/PXXcZFp4Gm",
    "67": "@OrlandoMagic @The_ColeAnthony @franzboogie @wendellcarter34 I desperately want one of these practice jerseys",
    "68": "@TeeOhhDeeDee @LukeJalil @OrlandoMagic @TerrenceRoss @RjHampton14 I can guarantee you that announcement has something to do with the new training facility",
    "69": "@paykoman02 @TrashTalk_fr @OrlandoMagic @OrlandoMagicFR @CatchNShootFr Une action incroyable",
    "70": "@OrlandoMagic @The_ColeAnthony @franzboogie @wendellcarter34 Cole dropping 30 tonight, Franz 25",
    "71": "@Dazz59 @TomTomParis1 @TrashTalk_fr @OrlandoMagic @OrlandoMagicFR @CatchNShootFr On a vu playoff 1996 Penny vs Hill",
    "72": "@orlandomagic the face I make when considering using my holiday time from the UK to see one game and young 🐐 @The_ColeAnthony drop 50… https://t.co/N7AHMlsbS8",
    "73": "@fcgb33du24 @TrashTalk_fr @OrlandoMagic @OrlandoMagicFR @CatchNShootFr Les blessures nous les ont pris !",
    "74": "Nov 15 Hoops Picks\n\n#NBA Picks\n#LetEmKnow 1H CLE ML, +125\n#OrlandoMagic #Forever404 ORL ATL U 215, -110\n\n#CollegeHoops Picks\nPROV +6, -110\nFRES ST -22.5, -106\nSTAN -19, -104 \nUCLA -26.5, -104\n\n#NbaTwitter #GamblingTwitter #nbapicks #bettingtips  #NBA75 #ncaabb",
    "75": "@SHAQ real talk…..when are you buying the @OrlandoMagic ?",
    "76": "Wow! This weekend was pure magic✨ Thank you to every Headliner who came out this weekend to @edc_orlando to celebrate not only our #25yearcelebration, but also our 10th year in the city.❤️🙏\n\nView full post here: https://t.co/wa8wyt4NGB https://t.co/jhPfZEIzVi",
    "77": "Orlando Magic forward Chuma Okeke (@chuma_okeke) is pictured below in PROT002 by Hayaspora. https://t.co/zdfjMALgsC",
    "78": "@realStanVG If you want to go there, you got the Orlando Magic to the finals, then Dwight Howard had you fired.  He was plotting against you, like the Democrats did for 4 years.  But tell yourself what you need to.",
    "79": "Going to #SurvivorSeries this Sunday and might be going to my first NBA game Brooklyn Nets Vs Orlando Magic. #brooklyn #nyc #nba #netsvsmagic https://t.co/vIDYP6otKy",
    "80": "Atlanta swept Orlando, 3-0, last season, winning by an average of 14.0 points. Clint Capela averaged a double-double against the Magic last season, averaging 14.0 PPG and 16.5 RPG.\n\nLast night, Capela notched his team-leading ninth double-double of the season (T3rd in NBA).",
    "81": "Atlanta Hawks Predictions and Preview for 11/15/2021 hosts Orlando Magic.  Looking for betting action?  Find out if there is any value in our preview. #SportsBetting #NBA https://t.co/g1Mjbq8yOr",
    "82": "@OrlandoMagic buy out Rolo we need white Hakeem",
    "83": "Looking for a value bet?  See if the Orlando Magic-Atlanta Hawks Predictions and Preview for 11/15/2021 is one in our preview.  No crazy hype just a prediction and preview. #SportsBetting #NBA https://t.co/g1Mjbq8yOr",
    "84": "My official card tonight in NBA/NCAAB:\n\nPenn State -4 (1.1u)\nProvidence/Wisc U130 (1.1u)\nNCAT&amp;T +8 (1.1u)\nNC Greensboro -18 (1.1u)\nOrlando Magic +10.5 (1.1u)",
    "85": "Golf. Extra \"magic hours.\" More. The @steelers co-owner is selling this $8.4 million home that comes with @WaltDisneyWorld perks. Take a look https://t.co/tDCcmBWU9M #DisneyWorld #luxuryhomes #realestateinvesting #realestate #Orlando",
    "86": "Indian Cowboy NBA\n\n4 unit - Atlanta Hawks -10.5 over Orlando Magic",
    "87": "@OrlMagicMan @OrlandoMagic @MarkelleF @JJudahIsaac felt the same way - been strolling the timeline today seeing a lot for tweets asking for updates today",
    "88": "Club Assist was honored to once again partner with the @OrlandoMagic to donate 150 tickets for the #SeatsForSoldiers game on Nov. 13. To our military men and women, and their families, thank you for your service and selflessness to our country. #Veterans\nhttps://t.co/joLj3mOEYD",
    "89": "Join #SciTechChat (AKA #HealthSystemsChat) in the #Metaverse during #HIMSS22! Our 5th year floating above Orlando (via magic of virtual reality) 6 hours/day! Here is Thursday's link: https://t.co/EdJPgbcnul",
    "90": "I’m really debating whether I want to buy this Orlando Magic bombers jacket or not 😩",
    "91": "@Belgian_Magic @BeenKnightedUCF @OrlandoMagic And your right. Give the fans honestly and details.",
    "92": "Join #SciTechChat (AKA #HealthSystemsChat) in the #Metaverse during #HIMSS22! Our 5th year floating above Orlando (via magic of virtual reality) 6 hours/day! Here is Wednesday's link: https://t.co/O8Pck6LlLa",
    "93": "@Belgian_Magic @BeenKnightedUCF @OrlandoMagic The players want to play too. Issac has already said on a podcast that he feels he is ready.  And he is slated to come back after Markelle.   I get being safe but competitive people want to compete and I feel holding them out for too long is a problem too.",
    "94": "Join #SciTechChat (AKA #HealthSystemsChat) in the #Metaverse during #HIMSS22! Our 5th year floating above Orlando (via magic of virtual reality) 6 hours/day! Here is Tuesday's link: https://t.co/p0kWdZB9tE",
    "95": "@Belgian_Magic @OrlandoMagic Yeah, I agree 100%...😒",
    "96": "@soulchild72 @OrlandoMagic Okay, but tell us then! This non-communication is really annoying.",
    "97": "@BeenKnightedUCF @OrlandoMagic All good, man. I have a ton of trust in WeltHam. Really this is the only thing that bugs me. If these guys are healthy, I want to see them play. If they’re not, I want *some* info on what’s going on.",
    "98": "An article about one of my favorite young players written by one of my awesome friends. Check it out \n\nCan Cole Anthony Bring the Magic Back in Orlando? // ONE37pm https://t.co/tRa7Qrx764",
    "99": "Seems I missed the memo where Magic fans were getting the pitchforks out to force the @OrlandoMagic to give us an update on @MarkelleF and @JJudahIsaac injury status but I’m all for it",
    "100": "@unitedweare23 @Belgian_Magic @OrlandoMagic They have the team headed where it needs to be. Starting from the ground up with a TON of young talent is among the best of ways to be successful in the NBA. There is zero reason to not be confident in this front office.",
    "101": "@unitedweare23 @Belgian_Magic @OrlandoMagic You know this front office is relatively new right? They inherited the MESS that Hennigan left behind and still managed to drag that sorry ass core to the playoffs. Then they FINALLY did what we were all asking for and tore that garbage apart.",
    "102": "@Goodfella0 @DavidBaumannORL @OrlandoMagic @MarkelleF @JJudahIsaac They add to the talent pool of the team significantly so it would be great to see them but you’re right, those two alone aren’t going to fix the issues we’ve seen with the team",
    "103": "@DavidBaumannORL @OrlandoMagic @MarkelleF @JJudahIsaac Just tell us when. I don’t care if it’s not until January, just tell us!",
    "104": "@Belgian_Magic @OrlandoMagic Probably not tanking but making \"damn\" sure their investments are truly 100% healthy so no more in and out of the line ups...just my guess",
    "105": "@BeenKnightedUCF @Belgian_Magic @OrlandoMagic Trust the office… 😂😂😂😂 have you seen how bad we have been for a long time? What are we going to do just keep getting draft picks without developing our core",
    "106": "@Belgian_Magic @OrlandoMagic I guess we don’t see eye to eye there and that’s fine...I trust the front office to do what it takes to steer this young group in the right direction",
    "107": "@Court_Cousins @OrlandoMagic I have the same worry, I think many fans do. Something’s not right.",
    "108": "The Magic are in Atlanta tonight, and got off to a bad start in this matchup, as Atlanta won the first six games ever from 1989-1991.\n\nIt wasn’t until April 16th, 1991 that Orlando finally beat the Hawks, with Scott Skiles going off for 25 points, 9 assists and 9 rebounds. https://t.co/od3r2sxaqW",
    "109": "@BeenKnightedUCF @OrlandoMagic I honestly do not believe it’s in our or their best interest to sit JI or Markelle if they’re healthy. They need to improve by playing. I actually think JI at least suffered at setback they’re not telling us about.",
    "110": "@Big_Chuma_okeke They're the best @OrlandoMagic",
    "111": "I feel really, really good about the Orlando Magic to win outright tonight. I know it sounds like a homer pick, but fellas, I can’t bet with my heart when my heart is already ice cold to this organization. How are we only +10.5 against a team who just beat MIL?",
    "112": "@OrlandoMagic @TerrenceRoss @RjHampton14 he's the goat of course",
    "113": "@TheNBACentral Ahhh all this @OrlandoMagic love",
    "114": "@OrlandoMagic @TerrenceRoss @RjHampton14 I’ll get that fb some day",
    "115": "@Belgian_Magic @OrlandoMagic I feel this. Managing expectations is one thing but this is completely different. Part of me feels like there’s some bad news in here that’s being hidden on the Isaac front",
    "116": "@NBA  @orlandomagic vs @atlantahawks tonight! @stuffmagic #stuffmagic @atlharrythehawk #atlharrythehawk #harryhawk #magic #orlandomagic #orlando #atlantahawks #hawks #atlanta #atl #NBA   #mascot #mascots #basketball #bball #hoops #NBAfans  #plush #BleacherCreatures #ItsNotADoll https://t.co/Ql8cB7blGr",
    "117": "@zerojuantwo3 @OrlandoMagic @ATLHawks @chuma_okeke @ajc @sarah_k_spence Definitely need more consistency with them. You can tell by the splits, they’re definitely an asset in the wins and not getting enough in the losses.",
    "118": "Bring back Jonathan Isaac @OrlandoMagic",
    "119": "If JI isn't playing by 2022 just let him sit out the season.\n\n#OrlandoMagic #MagicTogether  #WeGotAlotPopping #MagicSzn2021\nWE💥G O T💥ALOT💥P O P P I N G",
    "120": "@SixthManShow @OrlandoMagic Here’s my receipt. Rooting for wins no matter what! We haven’t moved up in the draft in more than a decade so screw the draft. #GoMagic",
    "121": "@NBASTORESupport where are the Orlando Magic City jerseys???",
    "122": "@theScore @TerrenceRoss @OrlandoMagic @RjHampton14 At 30?? Ancient!",
    "123": "@Belgian_Magic @magiicartii @OrlandoMagic Even if it’s “not until after the holidays” fine",
    "124": "@theScore @TerrenceRoss @OrlandoMagic @RjHampton14 Day to day",
    "125": "In the spirit of the wonderful Orlando Magic video @bykevinclark posted the other day, I went digging to find the amazing old school intro for the Thunder from 2009-10 (I think) when a select few games aired on KSBI. Behold: https://t.co/xwjfoJANiC",
    "126": "@OrlandoMagic @The_ColeAnthony @franzboogie @wendellcarter34 Why aren’t the city jerseys online for purchase???",
    "127": "@OrlandoMagic @The_ColeAnthony @franzboogie @wendellcarter34 let go magic",
    "128": ".@TerrenceRoss still has BOUNCE. 🐰👀\n\n(🎥: @OrlandoMagic, @RjHampton14) \n\nhttps://t.co/ujkrOrvk1z",
    "129": "@Belgian_Magic @OrlandoMagic nah. Let them sit as long as possible. As soon as they’re back this is a decent team and we need another lottery pick badly",
    "130": "@OrlandoMagic @TerrenceRoss @RjHampton14 RJ recording like https://t.co/A5pqT4huen",
    "131": "@Shortii_Dee I’m going to see the Orlando Magic’s play the Heat’s!",
    "132": "🏀 #NBA\n\nOrlando Magic 🆚 Atlanta Hawks\n📆 Mar 16 nov 01:40\n\n#Raspibets #FreePicks #FreeTips #StatBets #SportsBetting #BettingTipster #MagicTogether #TrueToAtlanta\n🆓🔎📈⬇ https://t.co/CumoJvT0qA",
    "133": "@Belgian_Magic @cmparker999 @OrlandoMagic respect the tank?",
    "134": "Orlando Magic are a fourth-quarter team, if they can get their competitively – NBA News https://t.co/3StWGYMvjG",
    "135": "I’m sick of it. I need an update on Fultz and Isaac. This is getting ridiculous. Come on, @OrlandoMagic, respect your fans.",
    "136": "🏀 NBA FREE CARD 🏀\n\nPelicans/Wizards U 207 -110 [2u]\nOrlando Magic TT U 101.5 -105 [1u]\n\nJ. Randle O 8.5 Reb -140 [2u]\nC. Paul O 9.5 Ast -105 [1u]\nP. Siakam O 29.5 Pts/Reb/Ast -115 [1u]",
    "137": "@OrlandoMagic where are the city jerseys?",
    "138": "@OrlandoMagic @TerrenceRoss @RjHampton14 I’m still wondering to this day are the high school hoops and the recreation hoops are they the same as NBA Hoops",
    "139": "@Dan_Savage @OrlandoMagic @ATLHawks @chuma_okeke @ajc @sarah_k_spence Magic hustle \"bell plays\" ranked with the rest of the NBA...\n\n• Deflections: 22nd in NBA\n• Steals: 29th in NBA\n• Loose Balls Recovered: 18th in NBA\n• Charges Drawn: 11th in NBA\n• Contested Shots: 19th in NBA\n• Screen Assists: 25th in NBA\n• Defensive Rebounding: 23d in NBA",
    "140": "@OrlandoMagic @TerrenceRoss @RjHampton14 Exert this energy onto the court",
    "141": "Every team but the Magic wear their City Jersey’s merely days after they’re unveiled. Get with the program @OrlandoMagic",
    "142": "@OrlandoMagic @TerrenceRoss @RjHampton14 Drop the City jerseys online",
    "143": ".@TerrenceRoss still got 🐰\n\n(via @RjHampton14) https://t.co/umzhDE4c4D",
    "144": "NBA Picks | Can the Atlanta Hawks secure a second consecutive W? \n\n@Adriel_Smiley has his #ParlehPicks for tonight's game:\n\n🏀 @ATLHawks moneyline (-550)\n🏀 @OrlandoMagic to cover +10.5 (-110)\n\n#NBA75 #MagicTogether #TrueToAtlanta #sportsbetting #NBAbets https://t.co/zYN6RcuUtj",
    "145": "The Doc with #NBA Monday\n\n#Magic +10.5\n#OKC +9\n#Trailblazers -1.5\n\n#Orlando #ThunderUp #Portland #NBATwitter",
    "146": "To night 🇺🇸NBA🇺🇸\n\nDetroit-Sacramento\nWashington-Pelicans\nCleveland-Boston\nNY Knicks-Indiana Pacers\nAtlanta Hawks-Orlando Magic\nMemphis-Houston\nOklahoma-Miami Heat\nMinnesota-Phoenix Suns\nDallas-Denver\nPortland-Toronto\nLA Lakers-Chicago Bulls\n\n#NBA #TeamBetters https://t.co/OuPxkrBq7L",
    "147": "@bttfnba Le All star game 92 a orlando et le match fou de Magic",
    "148": "@OrlandoMagic @The_ColeAnthony @franzboogie @wendellcarter34 Release the jerseys",
    "149": "@BennettHinkle @OrlandoMagic @The_ColeAnthony @franzboogie @wendellcarter34 Fr. Only ones in the NBA not for sale",
    "150": "@OrlandoMagic @The_ColeAnthony @franzboogie @wendellcarter34 Wear the city edition jerseys",
    "151": "we out here \n\n📍 ATL https://t.co/GXlGS01uYr",
    "152": "The Ringer's Kevin Clark calling for attention to the 1989 Orlando Magic theme song might result in the team reviving the tune for every home game https://t.co/9nJRNjNZT5\n\nhttps://t.co/7cmG06fjZx",
    "153": "@NBA is really never gonna release the @OrlandoMagic city edition jersey 🙄🙄🙄",
    "154": "🏀 @OrlandoMagic at @ATLHawks Preview 🏀\n\n🔹Magic head out on challenging road trip\n🔹Jalen Suggs (ankle) game-time decision\n🔹@chuma_okeke's keys to the game\n🔹\"Bell plays' an indicator to ORL's success\n🔹Rivals Report with @ajc's @sarah_k_spence:\n\nhttps://t.co/1tnko2MR85",
    "155": "GameDay! #magictogether @OrlandoMagic https://t.co/79aalGRBFx",
    "156": "I’m not sure that’s enough, but it does bring up an important reality for Orlando which is at some point they need to find their superstar to be a championship team, be it via trade or draft.\n\nWith the current group of young guys on the Magic, there may be an All-Star at best. https://t.co/UV0JAtPGpr",
    "157": "@Shortii_Dee Right like it’s Orlando Magic not Magics! 😂",
    "158": "@OrlandoMagic Something's missing from the store.. https://t.co/p3gP1GsJhh",
    "159": "New episode! “SLAMDUNK SESAME”\n\n• Recap of the past week of @OrlandoMagic basketball.\n• Orlando Magic theme song returns\n• Veterans struggling\n• Markelle &amp; JI\n\nApple: https://t.co/PTLr7f9I4R\n\nSpotify: https://t.co/mTMBctytGC\n\nYouTube: https://t.co/hpRLdIfFPt https://t.co/5RtALJEChA",
    "160": "The Orlando Magic say team chairman Dan DeVos will be making a 'major community announcement' on Tuesday at 10:00 AM.",
    "161": "Our patience will be tested during the tough stretch coming up for the Magic. \n\nThe Magic are on the road for 12 of their next 15 (and 22 of their next 32) games in which they mostly play against playoffs quality teams. #MagicTogether #OrlandoMagic",
    "162": "@BeORLMagic @OrlandoMagic Thought I was the only one not seeing it",
    "163": "Be magic or be gone! #magic #magicaboveall🍊 #magic #nba #orlandomagic https://t.co/D1Q8MN2DXe",
    "164": "@jonathanigoat @OrlandoMagic NOBODY IS SAFE https://t.co/PEEtOzgQAd",
    "165": "Release the city jerseys online @OrlandoMagic \n\nCOWARDS!",
    "166": "REMIX! @jaredrusso &amp; @Jaredrossking redraft all the rookies culminating in a live waiver wire add, some fun facts about Jeremiah Robinson-Earl, a rant about Jalen Green, and lots of talk about the Orlando Magic.\n\nLISTEN: https://t.co/YuhBArW9Zl\n\niTunes: https://t.co/WzYeARiviS",
    "167": "@br_orlandomagic GO MAGIC",
    "168": "@br_orlandomagic Cole Anthony guarda 40 no Trae Young, sem clubismo",
    "169": "@BeORLMagic @OrlandoMagic I’ve been refreshing the page since 10 AM….",
    "170": "Where are the city jerseys @OrlandoMagic",
    "171": "SOMEBODY NEEDTO SIGN @StephensonLance \n@Lakers @LAClippers @hornets @Suns @BrooklynNets @nyknicks @Pacers @ATLHawks @SacramentoKings @MiamiHEAT @OrlandoMagic @Timberwolves @dallasmavs @warriors @PelicansNBA @okcthunder @DetroitPistons @trailblazers @chicagobulls @celtics @sixers",
    "172": "Hello @OrlandoMagic we are comming from Poland just to see Your game against @Bucks on 30.12… hope this will be amazing evening… wish You all the best till this date… me and my family will bring You luck. Im sure of that;) see You soon;) #orlandomagic #NBA75 #lovethisgame",
    "173": "Here is today’s (11/15) post-shootaround media session with @OrlandoMagic Head Coach Jamahl Mosley:\n\n#MagicTogether\n\nhttps://t.co/azbCJikz8g",
    "174": "Here is today’s (11/15) post-shootaround media session with @OrlandoMagic center @TheRealMoBamba:\n\n#MagicTogether \n\nhttps://t.co/PjqtIsgkXm",
    "175": "@NBA where are the @OrlandoMagic city jerseys?",
    "176": "Mood: @OrlandoMagic vs @ATLHawks Tonight https://t.co/NQaeRPJnUC",
    "177": "@FanaticsSupport where can I find the new Orlando Magic Nike 2021/22 City Edition Swingman jerseys?",
    "178": "Who would have thought that the Washington Wizards be the number 1 seed? Their record is 9-3 after Saturday's win against the Orlando Magic. Pelicans up next 👀 \n\n#NBA #NBATwitter #DCAboveAll https://t.co/cnKYALc1ub",
    "179": "@NBA @BrooklynNets Drop @OrlandoMagic",
    "180": "The Orlando Magic team store only has Fultz and Cole city jerseys in the team shop at Amway. No size larges in the Cole",
    "181": "@OrlandoMagic City Jerseys when? https://t.co/4ZTWAR3Wy8",
    "182": "@jonathanigoat @OrlandoMagic Yeah there’s gonna be a bigger release. Has to be",
    "183": "The @OrlandoMagic kick off a five-game road trip tonight against the Hawks!\n\nGet ready for the action with Magic LIVE at 7pm on Bally Sports Florida! #MagicTogether https://t.co/csqIxFx3Fw",
    "184": "❗ GAMEDAY ❗\n\n🆚 Orlando Magic\n⏰ 21:30\n📺 League Pass ou Linkão https://t.co/W34AKawoNZ",
    "185": "@OrlandoMagic where the jerseys at???!!",
    "186": "@HeySweetTweetz Does the Orlando Magic store have the new city jerseys yet?",
    "187": "it’s been an hour @OrlandoMagic https://t.co/Fsnj601g6r",
    "188": "Monday's Free Pick: Orlando Magic +10.5\n\nThe Atlanta Hawks are getting too much respect from the books tonight after beating the short-handed Milwaukee Bucks 120-100 at home last night.  Now the Hawks will be playing the 2nd of a back-to-back and will be without De'Andre Hunter.",
    "189": "orlando magic game day #MagicTogether https://t.co/Ib6tLVtOK4",
    "190": "@OrlandoMagic @ATLHawks @BallySportsFL @969thegame @thats_G_ Where are the city edition jerseys at ?",
    "191": "Don’t know who needs to hear this but: ORANGE. IS. NOT. AN. ORLANDO. MAGIC. COLOR.",
    "192": "No way we lose to the “Orlando Magic” tonight",
    "193": "Game 14\n\n🏀: Magic vs Hawks\n🕔: 7:00 PM Coverage\n📻: FM 96.9 | am740 | 101.1 HD-2\n📱: iHeartRadio App in Orlando https://t.co/afTNln6nhD",
    "194": "@OrlandoMagic @ATLHawks @BallySportsFL @969thegame @thats_G_ Y’all got any info on our city jerseys 😅 I’ve been patiently waiting and refreshing the page",
    "195": "@OrlandoMagic @ATLHawks @BallySportsFL @969thegame @thats_G_ Home of the World Champion, Atlanta Braves",
    "196": "This man can now afford TWO lower-bowl Lakers tickets against the Orlando Magic 🔥 https://t.co/tF7Aa2OH42",
    "197": "game day in the A\n\n🆚: @ATLHawks \n📍: Atlanta, GA\n🕢: 7:30 p.m.\n📺: @BallySportsFL\n📻: @969thegame https://t.co/vSugP4ycd3",
    "198": "@BobRathbunTV @OrlandoMagic @HawksOnBally @DWilkins21 @laurenjbara @TreavorScales @BrianOliver1313 Bob. Thank you.",
    "199": "@villainkeys @OrlandoMagic take notes, I need that Cole Anthony jersey already",
    "200": "@DomClare @PedroRios22 My Orlando Magic are just doing just fine okay",
    "201": "Episode #20 is out! \n\n#nickanderson #orlandomagic\n\nhttps://t.co/DseYWsg3w7",
    "202": "@NBASTORESupport why aren’t Orlando Magic City Edition Jerseys available on @NBASTORE ?",
    "203": "Dylan Cole was absolutely part of the Orlando Magic pregame (H/T @bykevinclark for the best video of the week)... no wonder he made that play yesterday. #HollywoodCole #ColeWorld @dylancole31 https://t.co/h4wFQM7os1",
    "204": "Thanks to @bykevinclark I have the @OrlandoMagic song stuck in my head",
    "205": "@mtplug_grinder @2kscampolice @ice_kx @OrlandoMagic \nBADGE GRINDER",
    "206": "@Gregapalooza @OrlandoMagic If I had to guess, it'll be him, Carter, and Suggs.",
    "207": "@nbastore why aren’t the Orlando Magic city edition jerseys on the site?",
    "208": "@liveonthatswing @OrlandoMagic yeah, I saw that when I saw the Nuggets tweet their link. Hope Coke Anthony counts as a star lol",
    "209": "@Gregapalooza @OrlandoMagic looks like they're only doing stars rn. i wanted a cam payne jersey initially lol",
    "210": "@liveonthatswing @OrlandoMagic Nice man, that’s a great get. Must be going in order of the standings so I’ll be waiting a while 🤣",
    "211": "@Gregapalooza @OrlandoMagic it's flowing in slowly. got myself a devin booker city just a few mins ago",
    "212": "Orlando Magic: https://t.co/OGaRzdFl4A",
    "213": "@liveonthatswing @OrlandoMagic just checked but it’s still not available",
    "214": "@Gregapalooza @OrlandoMagic said 10 am est",
    "215": "The Orlando Magic Theme Song is making a triumphant comeback! https://t.co/ibsppA5bau",
    "216": "My wife was like what do you want to do to celebrate your promotion...I said well the @OrlandoMagic are in town next week...she was like ask my dad...I said DONE! hahaha\n\nNo kids or responsibilities for the night.",
    "217": "@ATLHawks @OrlandoMagic @StateFarmArena @BallySportsSO @929TheGame @bmw_atl 50 piece tonight ice @TheTraeYoung 🔥",
    "218": "@OrlandoMagic fam...your boy will be in the building Friday night vs the @BrooklynNets...anyone else going I'd love to say hey!",
    "219": "@ATLHawks @OrlandoMagic @StateFarmArena @BallySportsSO @929TheGame @bmw_atl If we lose to the Magic tonight and go 5-10 im officially not watching anymore until the next game",
    "220": "Rockwell Automation is excited to be SHPE's title sponsor for this years Magic of Innovation hackathon challenge!\n\nBest of luck to all the teams - we look forward to announcing the winners in Orlando next week at #SHPE2021! https://t.co/fYcOL8w7fa",
    "221": "Let's keep it going ‼️ \n\n🆚: @OrlandoMagic  \n⏰: 7:30pm ET \n📍: @StateFarmArena  \n📺: @BallySportsSO  \n📻: @929TheGame  \n🎟️: https://t.co/wfCJY8AiPd \n\nPresented by @bmw_atl https://t.co/zm3vUIhBQp",
    "222": "The entire Orlando Magic team, Tim Tebow (bumped into him with a tray of cookies) &amp; Aaron Rodgers. All when working in WDW, ESPN week and when the Packers won the superbowl on 2011. https://t.co/yw5JWUENxv",
    "223": "Good morning all! Right back at it tonight with the @OrlandoMagic in town! Coverage on @HawksOnBally starts at 7e/6c with @DWilkins21 @laurenjbara @TreavorScales and @BrianOliver1313",
    "224": "Analyzing Monday’s Orlando Magic at Atlanta Hawks odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/gGqlpT58FG",
    "225": "@OrlandoMagic when does the city edition jersey go on sale?",
    "226": "Atlanta Hawks – Orlando Magic Predictions &amp; Odds\n\nhttps://t.co/Dym7cWGNb2\n\n#NBA #bettingtipster https://t.co/wkGESs8qae",
    "227": "Throwback pic #orlandomagic \n#brianhill https://t.co/M8tQu2hNOa",
    "228": "@kev_bundleSSS you a orlando magic fan .. you down bad enough bro",
    "229": "Shout out to everyone at IT Nation who made this flash mob possible! Orlando IS magic!\nhttps://t.co/q77wMIjfkA",
    "230": "The Hawks are currently 10.5-point favorites against the Magic tonight... if you enjoy that sort of thing.\n\nNo injury report yet for ATL on the back-to-back, but Hunter and Okongwu are definitely out.\n\nOrlando is still without Isaac, Fultz and MCW, with Jalen Suggs questionable.",
    "231": "Do you know what's cool? The weather and TerraMia's \"Fall Flavors.\" Come to our Altamonte Springs ristorante &amp; wine bar to experience great cool weather dishes like our Ragu Della Dominica. @TerramiaFL @CityofAltamonte @SeminoleCoFL @OrlandoCitySC @OrlandoMagic @citybeautiful https://t.co/VdRj4jfd0s",
    "232": "@nbatopshot Mo Bamba doing some nice things for the @OrlandoMagic !",
    "233": "I know the Orlando Magic are cheeks, but the Hawks laying 10 on the second night of a back-to-back seems like a lot.",
    "234": "#NBAMagicPolls Does Markelle Fultz play basketball this week?\n\n#OrlandoMagic #MagicTogether  #WeGotAlotPopping #MagicSzn2021\nWE💥G O T💥ALOT💥P O P P I N G",
    "235": "21:00 – 🏀NBA\nBoston Celtics x Cleveland Cavaliers\nNBA LEAGUE PASS\nSacramento Kings x Detroit Pistons\nNBA LEAGUE PASS\nNO Pelicans x Washington Wizards\nNBA LEAGUE PASS\n21:30 – Orlando Magic x Atlanta Hawks\nNBA LEAGUE PASS\nIndiana Pacers x NY Knicks\nNBA LEAGUE PASS\n\n(+)",
    "236": "@LukeJalil Meanwhile for the #orlandomagic @MarkelleF  and @JJudahIsaac  nowhere to be found",
    "237": "Orlando Magic @ Atlanta Hawks\nPick : Orlando Magic.\nBasketball. NBA",
    "238": "How many of these next 3 games are must wins?\n\nGame 1: Indiana Pacers (at MSG)\nGame 2: Orlando Magic (at MSG)\nGame 3: Houston Rockets (at MSG)",
    "239": "The Magic will look to bounce back tonight in Atlanta. \n\nJalen Suggs is questionable to play tonight due to a right ankle sprain suffered in Saturday’s night game against the Wizards. \n\n#MagicTogether #OrlandoMagic #NBA https://t.co/Rg7dmaYYEl",
    "240": "From the Magic Kingdom to magical spa treatments, Orlando sparkles with the promise of adventure. Spend a day exploring the world-famous Disney theme parks or screaming your head off on a Universal... \n\nAir ticket from Abu Dhabi to Orlando\nhttps://t.co/yIf8LM88Ba",
    "241": "NBA Day 2️⃣8️⃣ 🏀🏀🏀\nBoston Celtics vs Cleveland Cavaliers\nSacramento Kings vs Detroit Pistons\nNew Orleans Pelicans vs Washington Wizards\nOrlando Magic vs Atlanta Hawks\nIndiana Pacers vs vs New York Knicks\nDenver Nuggets vs Dallas Mavericks\nPhoenix Suns vs Minnesota Twolves",
    "242": "sync................blue whiskey........... hokcey stick.............malt whisky scotch........................dentistry.............magic........orlando........",
    "243": "Orlando Magic @ Atlanta Hawks\n\nPlayer Points Projections\n\nhttps://t.co/qNr8TitwNf",
    "244": "@GxldeOrandismo Orlando Magic",
    "245": "@OrlandoMagic @FieldsAuto @TerrenceRoss @chuma_okeke @franzboogie @thats_G_ Yall getting smoked",
    "246": "@VeChainFam Have a look at @WilderWorld....amazing team with solid investor backing like Digital Currency Group (owner of Grayscale), Animoca, Metapurse, Orlando Magic NBA Star Michael Carter-Williams and many more !!",
    "247": "ALERT: New high roller bet posted!\nA bet has been placed for $5854.8 on Atlanta Hawks - Orlando Magic to win $11,007.03.\nTo view this bet or copy it https://t.co/MIyhWlBIYC https://t.co/cPte9IuiTK",
    "248": "Fading Magic tip off five-game road trip at Hawks  #NBA\n #ATLHawks #TrueToAtlanta #OrlandoMagic #PureMagic https://t.co/TSHBpKLLUr",
    "249": "@warriors @Bucks @Lakers @SacramentoKings @memgrizz @sixers @LAClippers @utahjazz @celtics @trailblazers @nuggets @BrooklynNets @MiamiHEAT @dallasmavs @nyknicks @Suns @OrlandoMagic @chicagobulls @HoustonRockets @WashWizards @Raptors @okcthunder @cavs @ATLHawks @spurs @Timberwolves @PelicansNBA @DetroitPistons @Pacers please follow back",
    "250": "@warriors @Bucks @Lakers @SacramentoKings @memgrizz @sixers @LAClippers @utahjazz @celtics @trailblazers @nuggets @BrooklynNets @MiamiHEAT @dallasmavs @nyknicks @Suns @OrlandoMagic @chicagobulls @HoustonRockets @WashWizards @Raptors @okcthunder @cavs @ATLHawks follow back please",
    "251": "@OrlandoMagic @OrlandoMagicUK - What a stunning, awful, yet somehow beautiful, video to wake up to 🤣🤣🤣🤣",
    "252": "@mindykaling My best tip would be go to florida, California’s whole park can fit in the parking lot of magic kingdom in Orlando!",
    "253": "https://t.co/6hF3H8ChJ3 NBA2k22; With Orlando Magic 35-20. 2 game line-up. Rookie season record,  MyCareer mode part 27. Putting in work as we face off against #1in the East Boston Celtics and #3 in the West Portland Trailblazers. Working  my way to the Chicago Bulls.",
    "254": "@okyeahyep DM the Orlando Magic’s &amp; just tell them Marcos sent you 📲📲",
    "255": "@BruceBlitz Orlando Magics: https://t.co/1FABiWEono",
    "256": "REMIX! @jaredrusso &amp; @Jaredrossking redraft all the rookies culminating in a live waiver wire add, some fun facts about Jeremiah Robinson-Earl, a rant about Jalen Green, and lots of talk about the Orlando Magic.\n\nLISTEN: https://t.co/YuhBAsdKQT\n\niTunes: https://t.co/WzYeAR0TUi",
    "257": "@DanteMagic @OrlandoMagic now how many retweets for “If the spell dont getcha, the Magic will” $12 tshirts",
    "258": "Nike Air Penny 5 V Orlando Home White Black Blue Mens Basketball Shoes Size 10.  These shoes, named after Anfernee Penny Hardaway,  are in good pre-owned condition.  The icy out soles, insoles, and laces are like new. $68 #nike #orlandomagic #sneakers  https://t.co/SdqCJzAgKK",
    "259": "Jalen Suggs scores 8 points on 4/10 shooting with 3 rebounds, 2 assists, a steal, and 3 turnovers in a loss against the Wizards @jalensuggs @OrlandoMagic",
    "260": "ORLANDO YOU WERE MAGIC TONIGHT 😭😭😭\n\nTHANK YOU @EDC_Orlando ❤️\n\n📸: @iamZOSS https://t.co/X8SwvVjzlY",
    "261": "I'm ready to see a 2nd unit backcourt led by an  E'twuan Moore &amp; RJ Hampton back court. Hopefully it happens tomorrow.\n\n#OrlandoMagic #MagicTogether  #WeGotAlotPopping #MagicSzn2021\nWE💥G O T💥ALOT💥P O P P I N G",
    "262": "@itisuhhhhot Checked with him; He is most unhappy with the Orlando Magic’s logo, doesn’t think people can tell a Panther from a Jaguar, but he mostly thinks “birds are a dumb mascot, they’re weak compared to other animals and people.”",
    "263": "Yes, destroy the ever so dominant Orlando Magic and prove to us how slept on you were 😂 https://t.co/F9gmJ6Jrip",
    "264": "Join @playersonlynft discord group and vote for @BALLERZ_NFT so that @mcarterwilliams from @OrlandoMagic will play an NBA game with ballerz NFT art on his shoes! Let’s see if one of @mcuban’s players from @dallasmavs can match that! Remember to RT this!\n\nhttps://t.co/egCg3fy7EG",
    "265": "If you ever wondered what it was like to attend an Orlando Magic vs. Phoenix Suns game in the Penny/Shaq Golden Age, when Barkley was still formidable, this is not far from the vibe",
    "266": "I was absolutely on a Naval military base in Orlando, doing one of the following:\n\nPlaying or running a Rifts campaign, or\nPlaying Ani-Mayhem or Magic: the Gathering, or\nWatching dubbed anime vhs tapes on the 13inch tv in my room, or\nWatching a movie at the nearby theater. https://t.co/XsH1Nu88MK",
    "267": "@OrlandoMagic @FieldsAuto @TerrenceRoss @chuma_okeke @franzboogie @thats_G_ Please get a win 🙏🏿",
    "268": "wheels up to ATL 🛫 https://t.co/xnbVGcX6as",
    "269": "The all-black upper with varsity royal hits was worn by T-Mac during his final season with the Orlando Magic.\n\nRead: https://t.co/7HKdno1tRZ",
    "270": "@Sugar_Super_Ray @UM_radio_Mic What’s the name of the object the Orlando Magic and Miami Heat play to claim at the end of the season?\n\nI just heard a collective “huh?”",
    "271": "@bykevinclark @ringer After your successful campaign to bring back the old Orlando Magic song, is a lost song from an NFL team next?",
    "272": "@DavidBaumannORL @OrlandoMagic @MarkelleF @JJudahIsaac Agreed I really hope it’s soon cause I would love too see this team at full strength.",
    "273": "@OrlandoMagic Bring back the pinstripes while you’re at it.",
    "274": "@bykevinclark @ringer Do you think the Orlando magic video last night at Amway arena reverberated so hard that it effected Tampa’s ability to focus on the redskins today",
    "275": "@fools_gd I had Orlando Magic!"
}