{
    "0": "@Bucks Is this on TV? Brewers are on Bally sports right now",
    "1": "@RingTourJrue @NworaVibes @Bucks Damnnnn",
    "2": "@rashadburner @NworaVibes @Bucks 23 and Elijah Bryant had 16",
    "3": "@ShortyGlo18 @Bucks Jim Paschke donned Thanasis “Thanasty” last season and I just ran with it lol",
    "4": "@Bucks Bucks are scared of the Nets.",
    "5": "@AndreasBali89 @Bucks Facts",
    "6": "\"Giannis plays extremely hard!\"\n\n-@Jrue_Holiday11 talks team character and playing winning basketball—not flashy.\n\n@Bucks l #FearTheDeer https://t.co/j8unRKTo7X",
    "7": "Hey @BallySportWI, \n\nWhere’s the @Bucks game? 🤔 https://t.co/Ng7qL4Ge6c",
    "8": "On the road with my @ATLHawks backpack. Let’s go Hawks and @Bucks  😊👏🤙 https://t.co/dbyqQw0PIh",
    "9": "@Bucks @Balo47_  solche Hunde",
    "10": "@Thanastyburn @Bucks Bro where do yaw come up with these names😭",
    "11": "@BallySportWI @ZoraStephenson @Dario_Melendez @LisaByington @olskool888 @Bucks Yeah if only we could watch this instead of tennis? WHAT THE HECK IS GOING ON!!!",
    "12": "@ItsToySoldierYT @Bucks “Play random” is my favorite Bud quote ever.",
    "13": "@RingTourJrue @NworaVibes @Bucks Didn’t Teague have 25 too 😭",
    "14": "@hlalhelali @Bucks Thanasis is barely a bench warmer in the worst basketball era ever. In the 60s most he'd be is a ball boy",
    "15": "@NworaVibes @Bucks He dropped 34 in the last game last year",
    "16": "@EliskorSakura @Bucks They can’t , think he got like endorsements or somin",
    "17": "@Bucks Bucks in 6",
    "18": "Milwaukee Bucks vs Cleveland Cavaliers LIVE REACTION/Play-By-Play https://t.co/tH2YyfFjRz via @YouTube",
    "19": "@NworaVibes @Bucks Masterclass inbound",
    "20": "@NBAHistory @Bucks @Jrue_Holiday11 @Khris22m @Giannis_An34 Now officially a BIG-3",
    "21": "make no mistake about it, i couldnt care less about seeding, i am rooting for a Milwaukee Bucks win today, lets get win Number 52 #FearTheDeer https://t.co/iPNE7ByTyV",
    "22": "@heyhiyowhatsup @NBAonTNT @Bucks What point? That I’m better off rooting for a team that doesn’t care about winning a title?",
    "23": "@Bucks Jrue dropping 40 today",
    "24": "@Bucks Nwora gonna drop 30+",
    "25": "@BallySportWI @Bucks More like everyone stumbling over themselves to get that 3 seed!",
    "26": "@Bucks Lets goooooo https://t.co/mXD3fv0Q0t",
    "27": "@Bucks Lmaoooooooo",
    "28": "@cianciola @BleacherReport @Bucks @BallySportWI In Milwaukee so we'll know if they win by then or not. Thnx",
    "29": "@JergoatWest @Bucks Thanasis would be MVP D\nduring that plumber era",
    "30": "@Bucks Who the hell are those players lol",
    "31": "@crazy_geordie @Bucks We already clinched the 2nd seed",
    "32": "@BallySportWI @ZoraStephenson @Dario_Melendez @LisaByington @olskool888 @Bucks If only we could watch this instead of tennis. 🤷‍♂️",
    "33": "@thezachattack_2 @MilwaukeeMamba @Bucks That’s the team to rest against lmao what are you on about",
    "34": "@thezachattack_2 @Bucks that’s the point",
    "35": "@BallySportWI @ZoraStephenson @Dario_Melendez @LisaByington @olskool888 @Bucks Where? It's not showing on Ballys WI extra?",
    "36": "@thezachattack_2 @MilwaukeeMamba @Bucks Yeah exactly",
    "37": "@Mxstre @Bucks Good question I’d lowkey assume Wes is resting tho and didn’t show up on injury report",
    "38": "@Bucks Let jrue start play 2 minutes then rest him",
    "39": "@Bucks Weak frauds... this is why y'all first round exits",
    "40": "@Bucks These players would be drafted in the 13th round in a real era like the 1960s",
    "41": "@Bucks thank you kings",
    "42": "@thezachattack_2 @Bucks played everyone in detroit second night of a back to back",
    "43": "@Bucks Sit Jrue.",
    "44": "@Bucks Jrue holiday TN https://t.co/EB062azEsX",
    "45": "@Bucks Our normal starters except jrue https://t.co/9g418nkaW9",
    "46": "@Bucks Small Ball!!",
    "47": "@BallySportWI @Bucks Why is tennis playing on the Ballys extra station when it should be pregame?",
    "48": "@Bucks Thanks",
    "49": "@Bucks Why… ffs",
    "50": "@Bucks Why start nwora instead of Wes?",
    "51": "@Bucks Dream team",
    "52": "@Bucks Throwing so you don’t have to face KD LMAOOOOOO",
    "53": "@Bucks Nwora 40-piece",
    "54": "@Bucks Oh god",
    "55": "@Bucks The Bucks are showing us the starting lineup for tonights game.",
    "56": "@Bucks Jrue bout to get 50",
    "57": "@Bucks Thank you 🙏",
    "58": "@Bucks oh hell nah 😹😹",
    "59": "@Bucks This lineup would sweep Philly tbh",
    "60": "@Bucks I ACTUALLY LIVE THIS",
    "61": "@Bucks \"Play fast, play random, play together, play in great space, so play some basketball,\"",
    "62": "@ukhwini @BleacherReport @Bucks Why he built like https://t.co/CMswmJoXbQ",
    "63": "Starting 5 for Game No. 82. https://t.co/OMSzM7AoYt",
    "64": "\"This is a good-lookin' crew!\"\n\n-@ZoraStephenson, @Dario_Melendez, @LisaByington and @olskool888 deal out regular-season awards.\n\n@Bucks l #FearTheDeer https://t.co/cm2IfN2o32",
    "65": "@SElYASUZUKI @Bucks Teams will be trying to avoid the #Bucks not the other way around. Simmons hasn't played competitively in a year. Nets are not good defensively and Simmons has been worked by Giannis in the past. Not worried. Going to be an awesome first round series!",
    "66": "@BallySportWI @Bucks A lot of people don't want the Nets in the first round, I say BS! The Nets don't want us!",
    "67": "@Bucks what channel are bucks on spectrum",
    "68": "ALERT: New high roller bet posted!\nA bet has been placed for $7,000.00 on Cleveland Cavaliers - Milwaukee Bucks to win $12,063.97.\nTo view this bet or copy it https://t.co/xvFKRWxpQb https://t.co/UYqFyg3Ijk",
    "69": "Milwaukee does not want to play Nets in first round. Bucks are resting Giannis, Khris MIddleton, Bobby Portis and Brook Lopez today. https://t.co/CMkxasTmRw",
    "70": "@BallySportWI @Bucks Get the brewers off my tv and put on the Bucks",
    "71": "Please lose @Bucks https://t.co/FeBTWpmAQB",
    "72": "Why in the world is @Jrue_Holiday11 starting today? No way he should and have the others starters sit. He deserves to sit. @Bucks",
    "73": "Good Luck @bucks @celtics https://t.co/tjnVC5P95A",
    "74": "@ZULF51779107 @Bucks @SociosUSA He's not",
    "75": "Let’s Play Some @cavs Basketball! Game #82 and regular season finale as Cavs host @Bucks at @RMFieldHouse. 3:30 tip on CAVS Radio Network with @chones22 and me from the Joe Tait Perch. HUGE game for Cavs to determine play in seeding. Dial in! https://t.co/QsISesTegb",
    "76": "@BleacherReport @Bucks To be honest....From a Laker fan:\n\nJesus.... Really proud of you... Unbeliable",
    "77": "@Bucks My grandson travelled 4 hours to get to see Gianni at today’s game please give him a chance to meet Gianni  🏀",
    "78": "Live coverage: Bucks vs. Cavaliers at Rocket Mortgage FieldHouse #Milwaukee #Bucks #NBA https://t.co/Pb1FglEvEb",
    "79": "@BrasilNets KD e rookies x Raptors\nCam Thomas x Knicks\nNets x Sixers em Philly (KD e Kyrie)\nKD e rookies x Sixers\nKyrie x Bucks em Milwaukee",
    "80": "The @Bucks sitting @Giannis_An34 to try and avoid the 2 seed because they want no part of @BrooklynNets is the softest $#!t I’ve ever seen.",
    "81": "@bucks getting all there guys extra rest as an inevitable matchup in the first round with the @nets approach next week.. \n7-10 are all gonna win today only the play-in will switch the 7/8 seed in the EC \n\n#NBA #NBA75 #NBATwitter #VinnyHoopz",
    "82": "Imo the best case Bucks scenario today is: Cavs win, Grizzlies win, Pacers win, Hornets win.\n\nMilwaukee stays at 2 and the Nets fall to 9. Feels incredibly unlikely but it’s a possible outcome.",
    "83": "@BallySportWI @Bucks Unfortunate the game won't be seen in Milwaukee by @Bucks fans with @YoutubeTV  #Greed",
    "84": "@Bucks @SociosUSA BRO IS GIANNIS PLAYING OR NAH THTS ALL WE WANNA KNOW THIS HIS LAST GAME FOR MVP CHANCE",
    "85": "@FantasyLabsNBA The @bucks lineup you’d dream of for the only game you get your family to all season. 👊🏻",
    "86": "Time to lock this 2 seed! 🔒\n\n@Bucks l #FearTheDeer https://t.co/QGFPiA9nCQ",
    "87": "@Bucks @SociosUSA So the Bucks are throwing the towel to be 3rd and play the Bulls?\n\nThey don't wanna play Nets so badly in a 1st round?",
    "88": "@ImMvttv @Bucks @MotorolaUS Oh shit I forgot about mamu",
    "89": "@Bucks Ne reee!!!",
    "90": "Let's finish this regular season strong! 💪\n\nhttps://t.co/YrDRKidrDB\n\n@Bucks l #FearTheDeer https://t.co/LEr4hEW0tA",
    "91": "Ojo que si ganan los Pacers a Nets, Cavs a los Bucks, Hornets a Wizards y los Celtics a Grizzlies\n\nLa tabla quedaria:\n\n2°Boston \n3°Milwaukee \n7°Cleveland \n8°Charlotte",
    "92": "Personally I hope we win tonight. The @Bucks would make short work of the @BrooklynNets …. That is if Brooklyn even wins the first game of the play in which they very well might not",
    "93": "\"The $250 million that taxpayers across Wisconsin ended up dedicating to the construction of a new basketball arena for the Milwaukee Bucks, in 2015—after, of course, team owners Marc Lasry and Wesley Edens threatened to move the team—was shown to have come out of ...",
    "94": "Cleveland Cavaliers vs. Milwaukee Bucks gamethread https://t.co/IW1JfV3wbi https://t.co/JRUspJ1HfM",
    "95": "Consensus Line Move:\n2022-04-10 Milwaukee Bucks at Cleveland Cavaliers from -7.50 to -8.50\n#LetEmKnow never wait\n#NBA #espn #datascientist #investingtips",
    "96": "Uniforms for Milwaukee Bucks vs Cleveland Cavaliers at 12:30 PM. \n\n#FearTheDeer #LetEmKnow https://t.co/mPYaWKoz9A",
    "97": "Bucks will start Holiday, Carter, Thanasis Antetokounmpo, Nwora and Mamukelashvili on Sunday.\n#FearTheDeer #Bucks #NBA75 #NBATwitter #NBA #Twitter #MilwaukeeBucks #DFS .@Bucks #sundayvibes #Str8UpGang340",
    "98": "@HellerSports I never thought that I would see the Milwaukee Bucks ever win a Championship and against All odds they did🙌 I don't know why the Brewers suffer so much in the playoffs maybe you have an answer 🤔🤔",
    "99": "Milwaukee Bucks (+8.5) @ Cleveland Cavaliers #LetEmKnow #FearTheDeer #NBA #NBATwitter #NBA75",
    "100": "Milwaukee Bucks Starters:\n\nJrue Holiday\nJevon Carter\nJordan Nwora\nThanasis Antetokounmpo\nSandro Mamukelashvili\n\nPlayers out:\nGrayson Allen\nGiannis Antetokounmpo\nGeorge Hill\nSerge Ibaka\nBrook Lopez\nKhris Middleton\nBobby Portis\nLuca Vildoza\n#FearTheDee",
    "101": "@mariuscojocaruu @Bucks @betwayusa Lol. Makes sense now",
    "102": "@Bucks @SociosUSA FIRST ROUND EXITS🤡🤡",
    "103": "The Bucks are now averaging 128.3 ppg on 50.9% shooting over their last three games. \n\n🎥 @SociosUSA https://t.co/sqGugsARLU",
    "104": "Today's starting lineup for the Milwaukee Bucks: Holiday, Carter, Thanasis Antetokounmpo, Nwora, Mamukelashvili\nhttps://t.co/bVWH4AMCA2",
    "105": "@Bucks @SociosUSA Six is crazy we are 10-1 with Lopez back",
    "106": "Milwaukee Bucks Starting Lineup 4/10\n PG: Jrue Holiday\n SG: Jevon Carter\n SF: Thanasis Antetokounmpo\n PF: Jordan Nwora\n C: Sandro Mamukelashvili\nhttps://t.co/o75oZ8vnE8",
    "107": "@Hags37 @Bucks @betwayusa i’m a cavs fan bro",
    "108": "@RyanKennedy_22 @NBA @cavs @Bucks FEAR THE DEER!!!! LOL\n\nGreat looking family you got there boss - enjoy the game!",
    "109": "@Bucks @betwayusa wow that was so long ago, back when the bulls and that team were considered to be contenders lol",
    "110": "@Bucks @we_energies ratio",
    "111": "Since Game 2 of the Eastern Conference semi-finals, the Milwaukee #Bucks are 6-2 against the Brooklyn #Nets.\n\nI feel like people have wondered about that.",
    "112": "@mariuscojocaruu @Bucks @betwayusa Why y’all want them to lose? I’m a cavs fan, just curious. You guys are the champs- you shouldn’t care who you play in the first round.",
    "113": "@MaxeyBetta @Bucks @SociosUSA stop getting ratioed",
    "114": "Former Milwaukee Bucks, Los Angeles Clippers and Houston Rockets forward Luc Mbah À Mouté has been advising Cameroonian side @FAP_Cameroun as they compete at the @theBAL .\n\nLuc helped with the recruitment of players. \n\nAlways toiling to prosper Cameroonian basketball. https://t.co/weNyImYzR4",
    "115": "#LetEmKnow will host a vastly downgraded version of #FearTheDeer with superstar Giannis Antetokounmpo, All-Star Khris Middleton, Brook Lopez and Bobby Portis all resting with minor ailments. @cavs @Bucks #NBA75 https://t.co/VWrLBp74SU",
    "116": "Milwaukee Bucks injury update ahead of Cavaliers clash. Several players are out https://t.co/16B38HFcG5",
    "117": "@mr11rings @ghinesNBA @KingSan50523330 @sativaenergy @Perciousocet Yeah, but you aren’t providing the numbers specifically for those types of games. You are including games like the Milwaukee Bucks in the first round when he put up 30-8-7 in game 4. \n\nLike I said, to you, this is clutch.",
    "118": "@Bucks His first game! LET’S GO! https://t.co/HbvesSRvjo",
    "119": "@thanospaok3 @Bucks @SociosUSA No, he's been ruled out",
    "120": "🏀Milwaukee vs Cleveland\n\n📈TOP 4 KEY STATISTICS\n1⃣Total is UNDER in 5 of #Bucks last 5 games playing away #Cavs\n2⃣Total is OVER in 5 of Bucks last 5 games\n3⃣Total is UNDER in 5 of Cavs last 6 games playing Bucks\n\n#GamblingTwitter #bettingtips #NBA #NBATwitter https://t.co/XJw7zMfNxU",
    "121": "@MaxeyBetta @Bucks @SociosUSA Stop being a troll",
    "122": "@Bucks @SociosUSA Is Giannis going to play?",
    "123": "@dreamschaseme11 @Giannis_An34 @Jrue_Holiday11 @Khris22m @Bucks @JordanNwora At the end of the day it don’t matta. Bucks in 6.",
    "124": "Check out this listing I just added to my #Poshmark closet: Milwaukee Bucks Under Armour Gray Tee Size Small. https://t.co/QwYlfNk11k #shopmycloset @poshmarkapp",
    "125": "@Bucks @SociosUSA Brook played in 13 of those.",
    "126": "@NBAonTNT @Bucks Happy to have this man in Milwaukee",
    "127": "@MitchBradford_ @Bucks @MotorolaUS I don't know, didn't check their page",
    "128": "@Bucks @SociosUSA huge bounce back after a mid Jan-Feb",
    "129": "it’s still Bucks szn in Milwaukee",
    "130": "@Bucks @SociosUSA Bobby Portis wouldn't survive in a real era like the 1960s",
    "131": "Today's NBA Picks: 3:30 PM ET - Milwaukee Bucks vs. Cleveland Cavaliers - 15 PICKS AVAILABLE: https://t.co/FvYZy7p19N #nba",
    "132": "At 15-6, the Bucks have the third-best record in the NBA after the All-Star break. \n\n🎥 @SociosUSA https://t.co/AV9LYeCOmW",
    "133": "@MitchBradford_ @Bucks @MotorolaUS All of their starters are out/doubtful",
    "134": "@Mxstre @JimOwczarski @Bucks @BrooklynNets But we BARELY beat them last time we played. It was OT. That’s nerve wracking",
    "135": "3 city officials of Milwaukee are being accused of election bribery for accepting “Zuck bucks” to beef up in-person and absentee voting and to fund illegal privately-funded absentee ballot drop boxes, according to the Thomas More Society. Think they mean “Suck Bucks”. Oops me bad",
    "136": "Tell him to thank the @Bucks coach for limiting @Giannis_An34  minutes during the season. https://t.co/F5BiP88SVV",
    "137": "@KeithSmithNBA I'd rather the Nets get the 7 to drain the Bucks at the 2, Celtics easy first round against Chicago, go up against Milwaukee fresher",
    "138": "🏀NBA🏀\nCleveland Cavaliers vs Milwaukee Bucks\n\nIn the last game, Cleveland lost to the Brooklyn Nets 118-107. Cleveland has lost 3 games in a row.📉\n\nMilwaukee finished the season in 2nd place in the Eastern Conference. Milwaukee won 3 games in a row.🔥 https://t.co/3a8RCaqgqY",
    "139": "@dcwriter360 @JimOwczarski @Bucks @BrooklynNets Both, I truly believe that the bucks could take out the nets much easier than last year, they have no defense and their offense consists of 2 great players (KD and Kyrie) and 1 shooter (Seth curry), those 3 can't beat the bucks with how they've been playing.",
    "140": "🚨BigPlay 4/10🚨\n\nOne team playing to secure the two seed. One team playing to avoid 10th place. Defending champs Milwaukee Bucks play young slumping Cavs.  Both teams want this game. One team will execute and execute early.  Starters or not. \n\nBucks 1H +4.5 2u 🦌#FearTheDeer",
    "141": "Congrats to Lisa Byington on being named the TV Voice of the Milwaukee Bucks beginning in 2023. I’ll be the new Radio Voice of the Bucks on WTMJ. Can’t wait to be a part of history!",
    "142": "🚨 Line Change 🚨\n\nMilwaukee Bucks @ Cleveland Cavaliers\nSun 3:40 PM EST\n\nFrom:\nCLE -7.5 -110\n\nTo:\nCLE -8.5 -110",
    "143": "@Mxstre @JimOwczarski @Bucks @BrooklynNets I understand that but would you rather watch the @Bucks play the @BrooklynNets again for some sort of symbolic rematch and to prove a point? Or would you rather see the @Bucks in another championship?",
    "144": "@Danizeh Boston is 3 rn tho? Doesnt it depend on Milwaukee. If the bucks win today, they remain 2 seed",
    "145": "@dcwriter360 @JimOwczarski @Bucks @BrooklynNets The thing is that I'd love to watch a bucks nets series again 😂",
    "146": "@AmicoHoops Thxs it looks like the Milwaukee bucks are planing to drop to the 3rd seed to play wounded Chicago a team that they have used has a whipping 📪 all year smart move. Go cavilers lets get those 2 play in games!",
    "147": "@joe_rsullivan33 @Bucks You when asked a simple ? https://t.co/I2xEvDZctk",
    "148": "@NBAonTNT @Bucks Called lebron corny for saying the same thing",
    "149": "@Bucks @betwayusa thank you for resting ❤️",
    "150": "@Mxstre @JimOwczarski I don't think either approach is wrong. That is, @Bucks could adopt a \"championship mentality\" and say \"bring it on,\" or they could be strategic and recognize @BrooklynNets not only have a vendetta against us but the artillery to carry it out. Neither way is surefire.",
    "151": "@celticsforum @Bucks Just change your handle to NetsForum. First step is admitting",
    "152": "@Bucks @betwayusa What the f man I thought I was wrong for start time and missed the game. https://t.co/h1IpCSxwkG",
    "153": "@Bucks @betwayusa We better not keep up with them today too",
    "154": "@Bucks @betwayusa The defense continues to be horrendous in this weak era and this footage proves it",
    "155": "@GreekFreekMVP @Bucks @betwayusa Im rusty",
    "156": "@Bucks @betwayusa Ringless franchise",
    "157": "@BucksTranslate @Bucks @betwayusa gamw",
    "158": "@Bucks @betwayusa Cavs&gt;Bucks",
    "159": "@Bucks @betwayusa Please lose today",
    "160": "@Bucks @betwayusa That game did bad things to me",
    "161": "@Bucks @betwayusa The Bucks are showing us highlights from our last gamw against the Cavs",
    "162": "The Bucks couldn't keep up with the young Cavs' explosive offense in their last matchup in Cleveland losing 115-99.\n\n🔄 @betwayusa Game Rewind https://t.co/21pRJiyLco",
    "163": "Thank you @Bucks 🤝 @cavs #LetEmKnow https://t.co/NOtpgsWaAs",
    "164": "@iohandles @Bucks Cavs or Hawks who do you want to see first play in game",
    "165": "@joe_rsullivan33 @Bucks Never seen a defending champ w the same core run from an opponent before. Funniest shit I've seen in a long time. Literal LOL.. and ur making it funnier -- for dif reasons",
    "166": "@martinck0 It’s actually the defending champs Milwaukee Bucks I want to avoid",
    "167": "@ADwPlaysss @TutitoApenas @Bucks @paysbig I hate how they wait until the game starts so I can’t bet…",
    "168": "@Bucks @MotorolaUS RELEASE.THE.LINEUP",
    "169": "Thank you @Bucks! Where should I send the wings? #LetEmKnow https://t.co/7yuBYAee34",
    "170": "@celticsforum @Bucks So? Other teams are different. New season",
    "171": "@Bucks @MotorolaUS Go for it… stay healthy.. another championship awaits…",
    "172": "@joe_rsullivan33 @Bucks Same players",
    "173": "Happy “tank to avoid the Nets day” to those who observe @Bucks @sixers https://t.co/GjbJqPCMVC",
    "174": "@Bucks @MotorolaUS His name",
    "175": "Olha, com as notícias recentes, acho que teremos a seguinte ordem final no Leste:\n\n1. Miami Heat\n2. Boston Celtics\n3. Milwaukee Bucks\n4. Philadelphia 76ers\n5. Toronto Raptors\n6. Chicago Bulls\n7. Brooklyn Nets \n8. Cleveland Cavaliers\n9. Atlanta Hawks\n10. Charlotte Hornets",
    "176": "@celticsforum @Bucks Again it’s a new season",
    "177": "@joe_rsullivan33 @Bucks A tad bit funnier when it's the so called champs, no?",
    "178": "@NBAonTNT @Bucks I hear a lot of talk about Giannis being (either genuinely or performatively) \"humble\". I don't think he is; flexing for the camera after he dunks through Chris Paul isn't humble. But Giannis seems genuinely uninterested in comparing himself to other players, and I like that.",
    "179": "@RatiodbySteph_ Cuz it was Milwaukee and Phoenix, too small of a market to get wild about? Pretty awesome series, and for the Bucks to win in 6 was as sweet as it gets",
    "180": "@celticsforum @Bucks I think it’s funny that anyone runs from anyone. Once you start picking opponents it never works out",
    "181": "@joe_rsullivan33 @Bucks I asked you a question you don't find it funny the \"defending champs\" are running from Brooklyn? Lol",
    "182": "Check out this listing I just added to my #Poshmark closet: COPY - Milwaukee Bucks swingman #34 Giannis Antetokounmpo size mens medium jers…. https://t.co/4DUYYCyayV #shopmycloset @poshmarkapp",
    "183": "Cleveland Cavaliers vs Milwaukee Bucks 4/10/22 NBA Picks, Predictions, Odds https://t.co/gUQz9yCYgm There isn’t a team in the NBA bad enough for the Cavs to beat the way they’ve been playing. Even with most Buck’s starters absent, the Cavs may still lose a game they should win.",
    "184": "@strawdolluser @Bucks Giannis and Brook in that series https://t.co/tp8iv9s3rg",
    "185": "@TylerPat1218 @Giannis_An34 @Jrue_Holiday11 @Khris22m @Bucks @JordanNwora Lmaooo wtf that was a lame as excuse my guy. You duckin just like them smart move by bucks orhinization",
    "186": "@joe_rsullivan33 @Bucks Yea but isnt it funny when the so called champs are ducking?",
    "187": "@dreamschaseme11 @Giannis_An34 @Jrue_Holiday11 @Khris22m @Bucks @JordanNwora I’ll be fine w the 3 and a fully healthy team then 2 and have someone hurt",
    "188": "@Bucks @MotorolaUS Pat 30 ball incoming",
    "189": "@TylerPat1218 @Giannis_An34 @Jrue_Holiday11 @Khris22m @Bucks @JordanNwora Stop what ? Why wouldn’t you want the 2 seed?",
    "190": "Milwaukee Bucks vs. Cleveland Cavaliers Preview: For the Seeds https://t.co/4TqikCXev2 via @brewhoop The Cavs keep losing every must win game. Even with the Bucks starters, except Holiday, absent The Cavs are still likely to lose when the game is set up on a silver platter.",
    "191": "The All-Mighty Milwaukee Bucks with the so called \"best player in the league\" is sitting out to duck the Brooklyn Nets in the 1st round this can't be real life 😭",
    "192": "@Bucks Closing in…100 minutes to tip! https://t.co/plZfCAmbAS",
    "193": "@celticsforum @Bucks You have been lobbying the Celtics to do the same lol.",
    "194": "@Bucks @MotorolaUS None of these players would survive in a real era like the 1960s",
    "195": "The Grizzlies won’t have many players today against the Celtics. By game time, Celtics will know how Milwaukee did without many of its best players. If the Bucks lose, Celtics will earn second place with a win. https://t.co/bByOSxGwFh",
    "196": "@dreamschaseme11 @Giannis_An34 @Jrue_Holiday11 @Khris22m @Bucks @JordanNwora Stop it",
    "197": "@Bucks @MotorolaUS Pistons own you",
    "198": "Bucks sitting all of these guys. Cavaliers playing at home vs (mostly) Milwaukee backups - if they win, Cavs get 2 shots at the play-in tournament.",
    "199": "Check out this listing I just added to my #Poshmark closet: COPY - Milwaukee Bucks swingman #34 Giannis Antetokounmpo size mens medium jers…. https://t.co/6GU4kEevNc #shopmycloset @poshmarkapp",
    "200": "@Bucks @MotorolaUS Bruh we have no center",
    "201": "Ready for the matinee. \n\n📸 @MotorolaUS https://t.co/xpBUs0gXcY",
    "202": "@Bucks I wanted a war",
    "203": "Milwaukee is officially sitting most of their key guys in Cleveland, which isn’t ideal for the Hawks.\n\nAtlanta needs the Zombie Bucks to pull an upset.",
    "204": "Come through. I need y’all to win. @Bucks @DetroitPistons",
    "205": "Just need y’all to hold up your end of the bargain @Bucks https://t.co/uUkPtyUx2Y",
    "206": "@JaysGotNext @NBAonTNT @Bucks Bucks have beat the Nets five times in a row, and Giannis just dropped 44 on them nine days ago. Besides, if the Bucks were afraid of the Nets they were they wouldn't have sent their starters out to thrash the Pistons on Friday.",
    "207": "@Peraccc @Giannis_An34 @sixers @JoelEmbiid @Bucks @Suns -NBA scoring champ\n-First center to average 30+PPG since 1982\n-Most 40/10 games in a season in NBA history\n...all while getting double &amp; triple teamed.\n\n@JoelEmbiid",
    "208": "@allmyfriends77 @Bucks We can play the nets or we can 4-0 sweep the bulls and then play the nets in the 2nd round because they will beat the Celtics.",
    "209": "Milwaukee Bucks: 4/10 Game Preview: Celtics at Grizzlies https://t.co/zxB9bdnHNA",
    "210": "@BraggingRtsSpts @cyanshsharma007 @Buakaw69182235 @allmyfriends77 @Bucks They were beating the Bucks by 40 before Kyrie got hurt lol",
    "211": "@xVJ93 @GSWJoKuWinga @SbtaughtU No, I'm pretty sure I was born and raised in Milwaukee my whole life and have been a Bucks fan...literally my whole life.  🤦‍♀️🤷‍♀️ How is some rando on Twitter gonna try telling me who I'm a fan of? Feel free to look through my replies/tweets.",
    "212": "@Bucks Jrue carrying?",
    "213": "Oh my gosh bucks are ducking smoke!! I thought they were locked into 2. @Giannis_An34 @Jrue_Holiday11 @Khris22m @Bucks @JordanNwora say it ain’t so big dog",
    "214": "@Brewfan0419 When the Bucks looked for a unique way to honor Milwaukee",
    "215": "@GoDawgsBitch @Bucks @MotorolaUS Same I was confused 😂",
    "216": "@Bucks @MotorolaUS Hospital ring doesn't count",
    "217": "@Bucks @MotorolaUS He wouldn't survive in the 60s",
    "218": "@Bucks @MotorolaUS I’m honestly fine if we lose or not.",
    "219": "@Triplecontabla @Bucks @celtics @sixers Gana bucks, philly y memphis,",
    "220": "@Bucks @MotorolaUS Hope Boston wins",
    "221": "Finale in Cleveland. \n\n📸 @MotorolaUS https://t.co/Yj4OPP0M2g",
    "222": "Congratulations to ctrippy and MakeUsDream who moved up to take #29 and #88 on the Milwaukee Bucks team leaderboard.\n\nhttps://t.co/uMlVhppkVf",
    "223": "The #Cavaliers are facing the #Bucks for the 4th time this season and have won two of three against Milwaukee so far. Cleveland is 12-5 in its last 17\nhome games vs. Milwaukee.",
    "224": "@Bucks @betwayusa Less. 107.",
    "225": "I'd like preemptively thank the @Bucks for saying we don't care what seed we are for the playoffs and just sitting everyone for the game today. Hopefully this one doesn't come back to bite me. #LetEmKnow",
    "226": "New tumblr post: \"#NBA2K22 Milwaukee Bucks vs Charlotte Hornets MyLeague PS4 GAMES...\" https://t.co/am36EYZGEZ ifttt, youtube",
    "227": "@Bucks @paysbig An inevitable loss and we gonna sweep the Bulls",
    "228": "▪︎#NBA75 \nRegular season (last games)\n\n@Pacers ⚔ @BrooklynNets\n@WashWizards ⚔ @hornets\n@Bucks ⚔ @cavs\n@ATLHawks ⚔ @HoustonRockets\n@celtics ⚔ @memgrizz\n@DetroitPistons ⚔ @sixers ... https://t.co/9AVU3Jnido",
    "229": "@Bucks Bucks are trying to lose cos they are scared of the Nets.",
    "230": "The #Bucks head into their final regular season game vs. the #Cavaliers this afternoon in Cleveland a season-high 21 games over .500 and in the second spot of the Eastern Conference standings. Milwaukee improved to a season-best 51-30 with a 131-101 win over #Pistons on Friday.",
    "231": "@Buakaw69182235 @cyanshsharma007 @allmyfriends77 @Bucks Its not only the Nets that the Bucks could face if they get the 2, they also could face the Hawks.",
    "232": "@Bucks @paysbig Release the damn lineup. God yall are the WORST with this. The Cavs have had their lineup up allll day.",
    "233": "Lot of @Bucks fans in downtown Cleveland (on the FAN) \n\n#LetEmKnow #Cavs",
    "234": "We made it!  So excited for our first @NBA game as a family!  Let’s go @cavs!  Beat the @Bucks! https://t.co/DAJoFwATec",
    "235": "@jj_redick @OldManAndThree @DevinBook Any member of the Milwaukee @Bucks … especially the League MVP!  #FearTheDeer https://t.co/KqGgH6vrwJ",
    "236": "@Mynt_Life @BallySportWI @Bucks Roto Grinders\nStarters\nJrue Holiday PG \nWesley Matthews SG/SF \nPat Connaughton SG \nJordan Nwora SF/PF\nSandro Mamukelashvili C\nBench\nJevon Carter PG\nThanasis Antetokounmpo SF/PF\nRayjon Tucker SF\nLindell Wigginton PG",
    "237": "@LVVisualss @Giannis_An34 @Bucks @HoHighlights @ComplexSports @TheHoopCentral Ay! The feeling when your design is starting to turn out the way you want it to be is unbeatable",
    "238": "@N_BN613 @Jb13Swish @Bucks Bucks fans said Celtics were avoiding the nets when it wasn’t true",
    "239": "@antedwardsroty @BleacherReport @Bucks Sounds humble to me . He said what his goal was.. was laughed at and went and got it and never made it all about him ..",
    "240": "@BallySportWI @Bucks Whats the starting line up?",
    "241": "Brook Lopez has found his footing for the Milwaukee Bucks lately, and it comes at the perfect time. #FearTheDeer \nhttps://t.co/x1mwndpUIM",
    "242": "Hey @Bucks \n\nI need you to please bully the hell out of the Cavs today \n\nSincerely \n- A Hawks Fan",
    "243": "@RatiodbyBando @Bucks @paysbig Boston still has to beat Memphis don’t they?",
    "244": "because of these tipoff times: Boston gets to watch the Milwaukee game and see if they lose. \n\nif the Bucks do: the Celtics can then decide if they want to try to win and move up to 2. https://t.co/wHSpjydGf9",
    "245": "@MomentRanks @Bucks @cavs 3)  Starters of @Raptors and @MiamiHEAT might see some action tonight but expect less playing time. https://t.co/jsmsm9rDqH",
    "246": "@DkMetcough @Bucks Anyone can injury 🤷🏻‍♂️",
    "247": "@dgtl_crunchwrap Like it or not, Eric Bledsoe changed the culture of the Milwaukee Bucks",
    "248": "@byjuliapoe That's not really true. Philly can't finish ahead of Milwaukee. If the Bucks lose as appears likely, the Bucks would be the thread seed if the Celtics won, no matter what Philly does.",
    "249": "Well, Vegas expects Bucks to mail it in today. Cavs are 7.5-pt favorites.\n\nMilwaukee loss puts the ball in Celtics' court. Would they prefer the 2-seed or playing Bulls/Raptors in 1st round?",
    "250": "Reports say that Donte DiVincenzo wants out of the Kings Organization, Bucks fans do you thinks he want’s to come back to Milwaukee👀 https://t.co/yq0JeobiS7",
    "251": "Hey Milwaukee @bucks, it's CelticsForum. I see you are resting players today under the guise of health, but we all know you're just ducking the Nets. That's not the way champions are supposed to act. Fake champs! #CucksNotBucks",
    "252": "@FDSportsbook Milwaukee Bucks (+275) playing to lock up the 2 seed against the Cavs https://t.co/0FgEHQYFWk",
    "253": "@ZAYYYTHEGOAT @_ElBoogie “The 76ers can't finish higher than third, as they lose the head-to-head tiebreaker with Milwaukee (which won the season series) and now can only tie the Bucks in wins” - espn",
    "254": "@joe_yancey3 @Bucks I think so yes, honestly as a Cavs fan to avoid the bottom of the play in we need to win today, but you’re right bucks have something to play for today",
    "255": "@Bucks @betwayusa Tell us who’s playing first…",
    "256": "@NBALatam Milwaukee Bucks",
    "257": "Come back to the @Bucks @Divincenzo https://t.co/j1Ph99ak4O",
    "258": "Dear @Bucks please rest all your starters today. Thanks",
    "259": "@InterpretedByBC @Bucks @LoriNickel @journalsentinel @Giannis_An34 @PXP_Sports Love this guy!",
    "260": "@eli_alvah @NBAonTNT @Bucks If lebron decided to play these last 2 or 3 games he would of won the scoring title lol. So like i said joel was winning it reguardless just like he's finna win the mvp giannis knows that so that was a good response by him lmao",
    "261": "DasHaus made a bet!\n\nEvent: Milwaukee Bucks vs Cleveland Cavaliers #NBA\nBet: Cleveland Cavaliers TO WIN -8\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "262": "@__Shilts__ @Bucks Bucks don't want to play the Nets",
    "263": "DasHaus made a bet!\n\nEvent: Milwaukee Bucks vs Cleveland Cavaliers #NBA\nBet: Milwaukee Bucks TO WIN +8\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "264": "Soooo…No one can watch the @Bucks game unless you live in market?!? 😭 What is this shit?",
    "265": "Last game day of the regular season. So many games today onboard, and we are here to share with you our @momentranks daily picks and FGM leaders of each team. \n\nLet's Begin. \n\n1) Rest day for most @Bucks starters. Will we see J. Nwora leading the team against @cavs today? https://t.co/92oYAieIJt",
    "266": "@cavs @Bucks @BallySportsCLE @betwayusa It’s been a fun season y’all. No matter what happens our guys called their asses off all year man. Lets finish this shit https://t.co/PWej6Nt6xx",
    "267": "@DubsNets @Bucks wow. they can pass! great job",
    "268": "@Bucks @paysbig Win or racist",
    "269": "@JorFailure_ @Bucks @paysbig AD has the beach, while Giannis will be in Playoffs 😉",
    "270": "@Bucks @paysbig Tanking! https://t.co/ar15AAS4PZ",
    "271": "@TutitoApenas @Bucks @paysbig Doubtful",
    "272": "@DadBodRobO @Bucks For grammatical accuracy",
    "273": "@jacobandersonWI @JaysGotNext @NBAonTNT @Bucks Nets fans still bitter about KD stepping on the line.",
    "274": "@Bucks @paysbig Damn did our stats get better?? I don’t remember our stats having most single digit numbers",
    "275": "@JorFailure_ @Bucks @paysbig Don’t talk when your favourite team isn’t in the play-in 🤡 head",
    "276": "@Bucks @paysbig Lose the game. Sweep those frauds in chicago",
    "277": "@JorFailure_ @Bucks @paysbig At being injured",
    "278": "@Bucks @paysbig W keep it moving",
    "279": "@Bucks @paysbig Ad&gt; Greek Cheeks",
    "280": "Regular-season finale in Cleveland. \n\n🎰 @paysbig https://t.co/DpKmJZFQTL",
    "281": "@MaxeyBetta @Bucks @betwayusa Cringe",
    "282": "@cavs @Bucks @BallySportsCLE @betwayusa Go ahead n win",
    "283": "ICYMI -- 'We are rolling with the punches': Cleveland Cavaliers look ahead to Milwaukee Bucks after loss to Brooklyn Nets\n\nFinal game of the regular season today ... Cavs host Bucks at 3:30 p.m.\n https://t.co/wTwxYjJbeD via @beaconjournal",
    "284": "@NBALatam Milwaukee Bucks #FearTheDeer",
    "285": "@cavs @Bucks @BallySportsCLE @betwayusa Cavs are bound to have a good game when @cediosman is leading the way",
    "286": "@Shannon_263 @BleacherReport @Bucks Being a Homer I say Memphis.  Second the Suns, third Milwaukee. Either of these teams can win should they make it.",
    "287": "@waitamomentic @Bucks why risk him getting injured in a meaningless game",
    "288": "@Shannon_263 @BleacherReport @Bucks Prob be a repeat of last years Finals.  I think Giannis will win another",
    "289": "Come back home @Divincenzo @Bucks https://t.co/ytO1TL7es9",
    "290": "@DubsNets @BleacherReport @DrippyDak @Bucks who do u think is gonna win the championship",
    "291": "@Heroic_Robb @Bucks @NBAHistory @Giannis_An34 @Khris22m @Jrue_Holiday11 who do u think is gonna win it all",
    "292": "@Bucks He wouldn't survive in the 60s",
    "293": "@cavs @Bucks @BallySportsCLE @betwayusa Let’s finish strong. Im proud of this team #letemknow ❤️🤙🏽🐶",
    "294": "@cavs @Bucks @BallySportsCLE @betwayusa Ready 🤩🤩🤩🤩🤩",
    "295": "@N_BN613 @Jb13Swish @Bucks Because they had 2 days of rest since last game and want the highest seed possible",
    "296": "@InterpretedByBC @Bucks @LoriNickel @journalsentinel @Giannis_An34 @PXP_Sports Milwaukee hit the mega-universe JACKPOT when Giannis became a Buck. An absolutely amazing human being.",
    "297": "@Bucks Headed to Cleveland. I have soreness. The car surely needs maintenance. But we’ll be there…game ready. https://t.co/WGny5iHAFY",
    "298": "@nihilist_bucks Milwaukee bucks stay healthy.",
    "299": "@DrGuru_ The @bucks just won 3 in a row, including beating the Celtics, to take over the 2 seed.  They aren’t avoiding anyone.",
    "300": "@cavs @Bucks @BallySportsCLE @betwayusa What's the situation with this game",
    "301": "@BleacherReport @Bucks In the ME first society we live in today this young man just breathed new life in me. Selfishness is not the way to win in a team sport. Media and alot of fans have pushed that narrative to almost no return.  Much respect to Giannis. His answer alone is MVP.",
    "302": "@nathanmarzion The @bucks just won 3 in a row to move past the Celtics into the number 2 position. @DrGuru_  the Bucks are NOT avoiding anyone.",
    "303": "@cavs @Bucks @BallySportsCLE @betwayusa 🏀 Let’s go - see you there!!! 🏀",
    "304": "@cavs @Bucks @BallySportsCLE @betwayusa It comes down to this",
    "305": "@cavs @Bucks @BallySportsCLE @betwayusa LETSS GOOOOOO",
    "306": "@cavs @Bucks @BallySportsCLE @betwayusa What a year!",
    "307": "@cavs @Bucks @BallySportsCLE @betwayusa Hey @bucks this game means nothing to you btw!",
    "308": "@cavs @Bucks @BallySportsCLE @betwayusa Are the bucks playing their starters?",
    "309": "@cavs @Bucks @BallySportsCLE @betwayusa Cavs admin follow back",
    "310": "Consensus Line Move:\n2022-04-10 Milwaukee Bucks at Cleveland Cavaliers from 224.00 to 226.50\nOver check those props\n#NBA #handicapper #technology #trading",
    "311": "@cavs @Bucks @BallySportsCLE @betwayusa We need to win",
    "312": "Game 82.\n\n🆚 @Bucks\n🕞 3:30PM ET\n📺 @BallySportsCLE \n\n@betwayusa | #GetItLocked https://t.co/7m4qCpVKTD",
    "313": "@pconnaughton @Bucks Great smile!",
    "314": "@Bucks Nobody playing today I'm taking Cleveland!",
    "315": "@cyanshsharma007 @Buakaw69182235 @allmyfriends77 @Bucks They did this last year when they had a chance to get the 2 seed on the last day of the year. Its for safety reasons.",
    "316": "@Bucks Ya king so you don’t have to play the nets… sad",
    "317": "@GreekGodSzn @domenic821 @nylewinston @OoJson @KsportstalkD @SoraX24 @DrGuru_ Don’t misunderstand me I’m not the guy above who said whatever nonsense about not worrying about the bucks. Out of all the teams the Celtics will eventually have to go through to win, Milwaukee is definitely the one that will be the hardest. But Bobby Portis ain’t &gt; than Horford",
    "318": "#Milwaukee #Bucks: Motoring through the season.... \n \nhttps://t.co/dEEtQ5S1aW\n \n#Basketball #MilwaukeeBucks #NationalBasketballAssociation #NBA #NBAEasternConference #NBAEasternConferenceCentralDivision #Wisconsin https://t.co/Cam52pf1iS",
    "319": "@TheNBACentral @James_HamNBA Bring him back @Bucks",
    "320": "@laz_ur @soloPSPK_ @spicyp123 @__Shilts__ @Bucks Sixers playing Pistons.\n\nIf bucks lose i dont see how Celtics get the 3 seed",
    "321": "@TheNBACentral @James_HamNBA He’ll end up back with the @Bucks",
    "322": "1️⃣ Suns - Bucks \n2️⃣ 4-2 Milwaukee\n3️⃣ Antetokounmpo https://t.co/yrXsv7jvNn",
    "323": "@GAmyGoat @imightbepop @BleacherReport @Bucks *averages 0.4 more free throws than Giannis",
    "324": "@Jb13Swish @Bucks Celtics still have the tiebreaker. Celtics were accused of being afraid of the nets when they benched 2 starters (one who is 35 and the other who didn’t look right the night before) on the 2nd night of a back to back",
    "325": "@Bucks @betwayusa Lose the damn game today",
    "326": "So #bucks @Bucks you going to win today or try and lose??!",
    "327": "@BleacherReport @Bucks Respect 🐐",
    "328": "@InterpretedByBC @Bucks @LoriNickel @journalsentinel @Giannis_An34 @PXP_Sports Love this!",
    "329": "@yair3887 @drgradinjan @Bucks Do you know what a comma is?",
    "330": "@WisBBYearbook @jackeichsays @Bucks Playing there in the WISAA high school playoffs will always be a lifelong memory!",
    "331": "@DocCardo @Bucks I would be fine with 2 seed but we aren’t playing anyone so we are going to lose",
    "332": "@Bucks @betwayusa more let giannis get 50",
    "333": "@Bucks I’m begging this account to please use the word “fewer”",
    "334": "@ChrisNunian48 @Bucks @betwayusa Thanasty going for 30 I fear",
    "335": "@BrianBcho @celtics @Bucks @sixers I just saw 😓😓",
    "336": "@Bucks Good decision...GO CAVS!!!",
    "337": "@Bucks @betwayusa I say less honestly. I think most of the starters and some bench guys rest so idk",
    "338": "@Bucks @betwayusa Stop the vote https://t.co/ydvK1CVEtQ",
    "339": "@MegaZane5 76ers beating the Milwaukee Bucks on the road before All Star Break, ending a losing streak against them.",
    "340": "@Bucks @betwayusa Does Gianni’s play ? Please don’t rest - we will get karma for trying to get 3rd instead of 2nd",
    "341": "@Bucks @betwayusa Bucks admin follow back 👀",
    "342": "@Bucks @betwayusa how should i know",
    "343": "lose and the state of wisconsin will explode @Bucks https://t.co/P3y0lUU2a8",
    "344": "@Bucks @betwayusa More",
    "345": "Will the Bucks score more or less than 112 points today? \n\n📊 @betwayusa",
    "346": "Looks like I am a big Milwaukee Bucks, Minnesota wild and Chicago blackhawks fan today?? Love this playoff bubble",
    "347": "@glenfrommke @Bucks Playing the bulls is an easy sweep for bucks.",
    "348": "@JGMaster1 @celtics @Bucks @sixers Yeah check the line on bucks game. They are resting EVERYBODY for a nice matchup in rd 1 vs Bulls.",
    "349": "Brook Lopez has found his footing at the right time for Milwaukee Bucks – NBA News https://t.co/z5eDc4ewrH",
    "350": "@celtics WIN PLEASE @Bucks WIN please @sixers IDC . Celtics need that 3rd spot to VS Chicago. https://t.co/dSp6N9JSY6",
    "351": "Milwaukee Bucks vs Cleveland Cavaliers NBA Pick and Prediction NBA Betti... https://t.co/CMhCRXsZ1z via @YouTube",
    "352": "Crazy as it sounds give me the nets first round. Basketball gods see what y’all doing @Bucks",
    "353": "@DC_Bucks_Fan I mean shit I agree but it’s like we don’t know what could happen during the play in seeding games. There’s a chance Boston takes 2 seed, Brooklyn losses first play in game, and now Boston could have home court over Milwaukee in second round while not having to play BK in first.",
    "354": "Analyzing Sunday’s Milwaukee Bucks at Cleveland Cavaliers and lines, with NBA expert picks, predictions and best bets.  https://t.co/8oHbEF7uQP",
    "355": "Milwaukee Bucks at Cleveland Cavaliers odds, picks and predictions https://t.co/1RjY78wBsQ",
    "356": "@BraggingRtsSpts @Buakaw69182235 @allmyfriends77 @Bucks Then why bucks resting giannis, Middleton,lopez,protis🤣 in must win match lol",
    "357": "@Bucks Jrue masterclass",
    "358": "@ChefGoated @_aleksa_kml @sixers2022LG @3xBanHammer @BleacherReport @Bucks Bc Kobe gave him a challenge, he had to win it for him",
    "359": "4.10.22\nIndiana #Pacers vs Brooklyn #Nets\nWashington #Wizards vs Charlotte #Hornets\nMilwaukee #Bucks vs Cleveland #Cavaliers\n\nToday's #NBAPredictions: https://t.co/hltNwEZVnD\nBet on NBA:  https://t.co/ArbfnziqHj\n#Draftkings #Fanduel #sportsbook #BetMGM #WilliamHillUS https://t.co/9Fn9YpEaTO",
    "360": "Milwaukee Bucks: Brook Lopez has found his footing at the right time for Milwaukee Bucks:  https://t.co/ZdvThOk514",
    "361": "@Bucks Honestly I kinda want us to lose to beat the bulls instead of the nets, last time it was way to stress to even watch",
    "362": "@BayAreaBrenner @NBAonTNT @Bucks Missing the point man",
    "363": "@InterpretedByBC @Bucks @LoriNickel @journalsentinel @Giannis_An34 @PXP_Sports Pure class!",
    "364": "@SamsonBrown412 @Bucks @Giannis_An34 Same man and got courtside seats first time ever seeing the bucks in person….",
    "365": "Regular season concludes today.\n\n@Bucks x Cavs\nBucks Live - 2pm https://t.co/bBsFJ8Pooa",
    "366": "@BleacherReport @Bucks I’m officially a Giannis fan",
    "367": "@Bucks please let @Giannis_An34 play, i'm coming all the way from pgh to finally see my goat😫",
    "368": "@cyanshsharma007 @Buakaw69182235 @allmyfriends77 @Bucks Thats so wrong. The Bucks don't care what seed they get. They're not scared of KD and Kyrie, they are the one team that has dominated the Nets since those 2 arrived.",
    "369": "@Brewcity4141 @Bucks Thought Celts would have better conference record.  🤷‍♂️  tough to keep all these tie breakers straight especially when there could be more than two teams tied.",
    "370": "@ChrisDreamer @CPTrey3 @BleacherReport @Bucks Giannis is 27, he's not better than Duncan right now, but he has a lot of career left(hopefully).",
    "371": "@jphanned You're just like the rest of the talking heads with no respect for the @Bucks. They're not scared of Brooklyn. If they get them 1st rd @Bucks will be on to Rd 2. https://t.co/uiLRpFvzdC",
    "372": "@Bucks Wisconsin Herd vs Cavs should be fun",
    "373": "@BleacherReport @Bucks The humble bs gotta stop man https://t.co/gVLRAQoXaC",
    "374": "@heyhiyowhatsup @NBAonTNT @Bucks Yes, as a Bucks fan, I felt so cheated last season when they won the NBA Finals.",
    "375": "@buyingall5stock @justinsuperbuck @Bucks W Giannis owns Emfreethrow and harfatass https://t.co/tZSaQ4FkOb",
    "376": "@Bucks Is giannis playing",
    "377": "@LostMrDarkHorse @HoustonRockets @Bucks @Pacers Yep rockets are a guaranteed top3 in the literally so winning won’t hurt them at all in Jalen we trust",
    "378": "@DubsNets @Bucks Brooklyn RISE Elijah Stewart is BacK\nhttps://t.co/eblxApORUH",
    "379": "@ChasePletcher4 @HoustonRockets @Bucks @Pacers Bucks are bozos resting everyone and pacers are shit. Rockets only one to possibly upset",
    "380": "@Bucks sorte nos playsssss",
    "381": "Good morning lol @HoustonRockets @Bucks @Pacers",
    "382": "@InterpretedByBC @Bucks @LoriNickel @journalsentinel @Giannis_An34 @PXP_Sports Dude totally gets it. So happy he is on my team. #Bucks",
    "383": "@RatiodbyBando @giannisdabest @Bucks Last one jrue wasn't as good as he is now, hlwe good, KD can't beat us by himself.",
    "384": "@Mxstre @giannisdabest @Bucks nah i think i’m good on that. last one to stressful",
    "385": "@InterpretedByBC @Bucks @LoriNickel @journalsentinel @Giannis_An34 @PXP_Sports What a guy!",
    "386": "@giannisdabest @RatiodbyBando @Bucks No, we want a bucks nets series",
    "387": "Pussy @Bucks https://t.co/C4NVRaqTLF",
    "388": "@aceezium I liked it, if only when it was over I could make this tweet: FONZIE TO FLO: KISS OUR GRITS / Bucks win second NBA title.  Because, see, Happy Days was based in Milwaukee and Alice in Phoenix.",
    "389": "It's a busy sports day! You can hear the @Brewers game here on WTMJ and the @Bucks game on @ESPNMilwaukee.\n\nDetails here:\n\nhttps://t.co/PMZyUS4WOH",
    "390": "@NiftersThaGoat @RuthlessEchoz @DubsNets @BleacherReport @DrippyDak @Bucks Didn’t he literally drop 44 on KD team just last week???",
    "391": "@SnellSZN @Bucks NBA regular (read: exhibition) season has been too long forever, but after two straight shortened seasons it REALLY seems eternal this year.",
    "392": "@Jrue_Bucketz @Bucks Y'all need to win. Celtics fans want to stay at 3rd seed.",
    "393": "The regular season comes to a close for the Milwaukee Bucks today against the Cleveland Cavaliers and @omgbradshaw has a few things to watch for in this one. #FearTheDeer https://t.co/r3sSwbqucy",
    "394": "@jayshotta21 @ATLHawks @Bucks Jrue Holiday master class",
    "395": "@BleacherReport @Bucks \"How can I focus on myself without being selfish\" is some Yoda shit https://t.co/UyIa9amNFi",
    "396": "@giannisdabest @RatiodbyBando @Bucks Lose the game to let Cavs get the 8 seed, George hill owes us",
    "397": "The Milwaukee Bucks Could Have Drafted Nikola Jokic And Joel Embiid Along With Giannis Antetokounmpo – NBA News https://t.co/outDF3NW7x",
    "398": "@jayshotta21 @ATLHawks @Bucks Bud ball cares not for who is on the court but how the system is running",
    "399": "@BleacherReport @Bucks Focused, that perspective sets him apart, making him a better athlete and a better person. A true role model.",
    "400": "Julia and I went to the 51st Annual @rochester_u Partnership Dinner last night. The event featured @Bucks General Manager Jon Horst - an RU alum - as the speaker. Enjoyed hearing his journey to an NBA championship. https://t.co/F4ZhtNqa5Z",
    "401": "@ToddChr10631452 @Bucks But they would still get the 2nd via tiebreaker",
    "402": "Listen up @ATLHawks and @Bucks \n\nTAKE CARE OF BUSINESS TODAY",
    "403": "Cleveland Cavaliers vs. Milwaukee Bucks: game preview and how to watch https://t.co/GwHIaMm82C",
    "404": "milwaukee bucks. https://t.co/vgn0c29CbJ",
    "405": "@BleacherReport @Bucks That is hard to beat in a 7 game series!!!",
    "406": "@Bucks Carter day https://t.co/0tZf1hWZlr",
    "407": "@giannisdabest @Bucks I like this",
    "408": "@RatiodbyBando @Bucks Lose the game to sweep the bulls",
    "409": "The Milwaukee Bucks Basketball Organization ❤️👏🏻🏀!",
    "410": "@MagicLeadSM @OrlandoMagic @tobias31 @NikolaVucevic @Bucks Could have been a nice core of Vooch, Tobias and Victor",
    "411": "@Bucks GIANNIS MUST PLAYS PLEASE",
    "412": "@lilt82 @Lakers Lakers players WERE NOT INJURED. 😂😂😂 Had just beat Kawhi Leonard’s Clippers and Giannis Atentekumpo’s Milwaukee Bucks, then the Corona Virus happened. Lebron is the point guard even if he is at the Center position, gotta admit it.",
    "413": "@Bucks Sandro starting?",
    "414": "@Bucks The first time in a while I want to lose",
    "415": "@Bucks Luca dropping 30",
    "416": "My dream NBA finalS matchup?\n\nDallas Mavericks vs Milwaukee Bucks",
    "417": "@steinkobbe Milwaukee is an underdog city with potential, the Bucks finally realized their potential last year after a 50 year drought, so the Brewers are up next!",
    "418": "@Bucks Admin follow back?",
    "419": "@Bucks Morning admin https://t.co/PnYoFI3mwk",
    "420": "The Milwaukee bucks can lock up the 2nd seed and play against the April 15th winner with:\n\n➙ Win over the Cavaliers\nOR \n➙ A Celtics loss in Memphis\n\n*can drop to as low as 3rd seed*\n\n(67.6% probability) https://t.co/DhrmoGRCFo",
    "421": "@Bucks We need Luca!!",
    "422": "@Bucks Win the game to assert dominance",
    "423": ".@FirecrackersThe have arrived in @CityofCleveland and cannot wait to wow and delight the @Bucks and @cavs fans during halftime of today’s 3:30 PM ET @NBA game @RMFieldHouse.\n\n@BallySportsCLE! Please keep the cameras rolling!\n\n#FearTheDeer #LetEmKnow #HeartofTheFan #KingsStrong🧨 https://t.co/ApgSKG1FYC",
    "424": "Good morning. https://t.co/29ouOohP6J",
    "425": "Cleveland Cavaliers vs. Milwaukee Bucks: game preview and how to watch (@cwmwrites) https://t.co/V3sKVwEwxx https://t.co/iS0H3sg4Yp",
    "426": "@Giannis_An34 @Jrue_Holiday11 @Bucks lmaooo gotta sit the starters cuz y’all are avoiding the Nets first round ... REAL MVPs don’t run away from the best competition.. just like y’all were getting trashed last playoffs by the Nets. Run you clowns runnnnn",
    "427": "LOL\n\nGiannis Antetokounmpo, the Milwaukee Bucks star known as \"Greek Freak,\" deposited $250,000 in 50 different bank accounts, according to his boss, team owner Marc Lasry.\nhttps://t.co/zTOJiByQxO",
    "428": "@_The__King_ @ESPNStatsInfo gAnus &amp; Milwaukee are Paper champions. They would have gone down 3-1 to the best team in the EC last season Brooklyn without Harden until gAnus committed that Bush League FOUL on Kyrie w/ 6 minutes left in the 1st half the Bucks were only up by 4 points (1/2)",
    "429": "@yair3887 @drgradinjan @Bucks no such thing as luck in professional sports",
    "430": "@NBAonTNT @Bucks He is right!! He shouldn’t be worry about scoring titles!! Championships are his goals",
    "431": "@Pacers vs. @BrooklynNets \n@WashWizards vs. @hornets \n@Bucks vs. @cavs \n@ATLHawks vs. @HoustonRockets \n@celtics vs. @memgrizz \n@Raptors vs. @nyknicks \n@MiamiHEAT vs. @OrlandoMagic \n@DetroitPistons vs. @sixers \n@chicagobulls vs. @Timberwolves \n@spurs vs. @dallasmavs",
    "432": "Houston Rockets - Atlanta Hawks\nCleveland Cavaliers - Milwaukee Bucks\nBrooklyn Nets - Indiana Pacers\nCharlotte Hornets - Washington Wizards\n\nBet slip link: https://t.co/NEiPlhJ5gl https://t.co/IlXynqDA3h",
    "433": "It is my preference that the Milwaukee Bucks …eh I don’t care about today.\n\nThis is the Way. \n\nPositive Vibes Only.",
    "434": "@Bucks Giannis just lost the scoring title chance",
    "435": "Milwaukee Bucks vs. Cleveland Cavaliers Preview: For the Seeds https://t.co/FXbHVDZevG",
    "436": "Time to finish out the regular season on a high note!! @cavs vs @Bucks #nba #nba75 https://t.co/CPLMrsbaJs",
    "437": "@buyingall5stock @AKUMP0_SZN @Bucks Exactly. The bball gods will not reward him.",
    "438": "Milwaukee Bucks vs Cleveland Cavaliers Match Preview, Prediction, Betting Spreads and Odds - April 10th, 2022 | NBA Season 2021-22 https://t.co/0RgBgD1tOT #NBA #Basketball",
    "439": "One of the most important games today in the @NBA sees the @cavs host the @Bucks. With the Bucks resting key players, look for Darius Garland to show out. Check out our best bets &amp; #NBAProps for this matchup here. #NBA #betting #props https://t.co/0OmjyWrrBp",
    "440": "The @cavs will wrap up the 2021-22 regular season today when they face the Milwaukee Bucks at @RMFieldHouse. The Cavs are 2-1 vs. the Bucks this season.\n\nGame Notes 4/10/22 - #CavsBucks: Overall Game #82, Home Game #41\nhttps://t.co/QISz4ywYSf",
    "441": "@itistricia @NBA @cavs @Bucks Thanks!  Us too!",
    "442": "@RyanKennedy_22 @NBA @cavs @Bucks Hope your kids experience a win for their first game! Have a nice time",
    "443": "Y'all better lose @sixers @Bucks @celtics. It seems like we will again have old but gold series bucks against nets🤞. https://t.co/71mMuJlweH",
    "444": "@Bucks @Giannis_An34 plz throw the game today so you don't play the Nets in the first round. I know you will beat them and that's why i don't want you to meet in the first round.",
    "445": "@NBAonTNT @Bucks To sum it up. It’s one day at a time sir!!",
    "446": "@shandargina01 @BleacherReport @Bucks You local?\nGame on twice today actually if you are.\n@BallySportWI delay tonight 7 due to Brewers game this afternoon. \nLive on BSWIHe at 2:30",
    "447": "Today is one of those days where you just stick to your TV and watch @NBA all day\n\nKey match ups:\n\n@celtics/@memgrizz\n@Bucks / @cavs\n@sixers / @DetroitPistons\n@BrooklynNets / @Pacers\n@ATLHawks / @HoustonRockets\n@Lakers / @nuggets\n@warriors / @PelicansNBA\n@utahjazz / @trailblazers",
    "448": "@BleacherReport @Bucks When I hear @LoriNickel 😁😁",
    "449": "@Bucks just don't play the Raptors, please.",
    "450": "Milwaukee Bucks: Cavs vs Bucks | Rocket Mortgage Game Preview https://t.co/orwLRodv1r",
    "451": "@KxnGary @cavs @BallySportsCLE @wtam1100 @wmms @Power891 @RocketMortgage @Bucks They are",
    "452": "@BleacherReport @Bucks Love the way he is so humble. He doesn't try to show up the other players not like most of the other players in the league now he belongs in the 80s and 90s",
    "453": "Sunday Sports Buffet \nAll going on at the same time this afternoon;\n-@Bucks \n-@Brewers \n-@TheMasters \n-@IndyCar Long Beach\nMy DVR will be smoking.",
    "454": "@RyanKennedy_22 @NBA @cavs @Bucks Fear the Deer!!!",
    "455": "@Carto_The_Hero So @RobRush02 said we’ve got the H2H over Milwaukee so theoretically yes. Whichever way you slice it 2/3 is still the hardest path as it likely includes Milwaukee or Brooklyn. But im all up for a bucks second round match up as me and @UK_Bucks have some interesting bets planned!",
    "456": "@BleacherReport @Bucks So today's game isn't being televised? Why not? Only streaming on NBA TV? If I'm missing something, give me a holler. Thnx.",
    "457": "@cavs @BallySportsCLE @wtam1100 @wmms @Power891 @RocketMortgage Please @Bucks rest starters",
    "458": "Milwaukee Bucks to Win 2022 NBA Championship is one of the best value tickets you can find on @PropSwap right now writes @RandleRant \n\nhttps://t.co/xgowFIp2Ip https://t.co/n2C83TVFEt",
    "459": "Super excited to take the kids to their first ever @NBA game today!  @cavs vs @Bucks Heading to #TheLand soon! https://t.co/OVG53r6Gwc",
    "460": "@BleacherReport @Bucks Milwaukee is so lucky to have such an amazing person and humble athlete on the team. #FearTheDeer",
    "461": "@NBAonTNT @NworaVibes @Bucks Didn’t say anything about DOPY🤭🤭 which he’s leading still https://t.co/drChdwq51t",
    "462": "@NBAonTNT @Bucks Giannis is a Freaking Beast 🔥",
    "463": "Milwaukee native Marquise Watts could be changing the look of pro basketball in Minnesota #Milwaukee #Bucks #NBA https://t.co/rN7BWweZ3k",
    "464": "Game 3 - Cleveland Cavaliers vs. Milwaukee Bucks\nSpread: CLE -8.5\n\nInjuries:\n- Bucks - \nOut: Grayson Allen, Goerge Hill, Luca Vildoza, \nDoubtful: Giannis Antetokounmpo, Khris Middleton, Bobby Portis, Brook Lopez\n- Cavaliers - \nOut: Jarrett Allen, Collin Sexton, Dean Wade",
    "465": "@BolWrld @BleacherReport @Bucks Bro, they always cooking your mentions 😂😂",
    "466": "@Hoophall @NBA @NBAHistory @UNC_Basketball @cavs @warriors @Bucks @nuggets @SacramentoKings 1st coach to lose a best of 5 series to an 8 seed",
    "467": "@NBAonTNT @Bucks First off, I love this era of ball. ALTHOUGH, imo, this sentiment isn't good for ball. These athletes have been beating into submission to be humble. They all \"only care about the chip\". But only one team wins. Fans get cheated all season because players don't care about reg seas",
    "468": "@BleacherReport @Bucks Possibly the best ambassador of basketball alive!",
    "469": "Adult Apron – Milwaukee Bucks by WildlavenderCompany https://t.co/27tcOsSXEr via @Etsy",
    "470": "🔴LIVE ~ Milwaukee Bucks vs. Cleveland Cavaliers - NBA League Pass\n🔴Watch Now➠ https://t.co/KNM1TPC3yR\n📅 : Sunday, April 10, 2022\n⏰ : 3:30 PM",
    "471": "🔴LIVE ~ Milwaukee Bucks vs. Cleveland Cavaliers - NBA League 2022\n🔴Live Streaming Now➠ https://t.co/qHhR9mufse\n📅 : Sunday, April 10, 2022\n⏰ : 3:30 PM",
    "472": "@BleacherReport @Bucks Lakers gotta find a Giannis Atentekumpo 2.0, but at Small Forward. 👍",
    "473": "@espn @NBA yall really televised the @BrooklynNets game over the @Bucks game?! 🤣🤣",
    "474": "Hmmmm lemme think, abc mouse, Milwaukee Bucks, StatMuse, 4 others. Pack watch frfr https://t.co/qpqvFTFal9",
    "475": "@BleacherReport @14LathropBadger @Bucks Lebron take notes",
    "476": "I want to thank the almighty God for giving a coach like Alex nwora for giving privilege to come to USA to study and play basketball. thank you so much sir and also Jordan nwora foundation @alexnwora @IsaiahJohnsonA @JordanNwora @Bucks @NworaFoundation https://t.co/qRDxiSJgDX",
    "477": "@NBA @Bucks Wow #34 hot shot shit",
    "478": "@kyrie_lyric @NBAonTNT @Bucks He could chase 50 every night without any objection from anyone on the Bucks or in Milwaukee.",
    "479": "Ok @Bucks @celtics pls win thanks https://t.co/yxF8XxkZeu",
    "480": "@PonyThaCHAMPony @hoopshopjunkie @ChrisDreamer @CPTrey3 @BleacherReport @Bucks Don’t disrespect John Henson like that",
    "481": "🚨 Line Change 🚨\n\nMilwaukee Bucks @ Cleveland Cavaliers\nSun 3:40 PM EST\n\nFrom:\nCLE -7.0 -110\n\nTo:\nCLE -8.5 -110",
    "482": "My sports itinerary today GMT{+3}\n St Miren Vs Rangers 14:00\n Leicester Vs C.Palace 16:00 \n Florentina Vs Napoli 16:00 \nEuro League women final (B'Ball): Sopron Basket Vs  Fenerbahce 17:00\nMcity Vs L'Pool 18:30\nNBA Cleveland Cavaliers Vs Milwaukee Bucks 22:30",
    "483": "@NBAonTNT @Bucks 100% MVP answer to that question!!! Unfortunately, I still think Jokic is the MVP.",
    "484": "@AllenCsa15 @Bucks They was just trying to stay ahead of falling to 4th seed by not allowing them to have the worst record of the 3(sixers and Celtics)",
    "485": "@TallndSlim @BleacherReport @Bucks Facts. Hasn’t chased ‘big market’ exposure, has gotten better and better over time.  Seems like a real competitor.",
    "486": "@NBAonTNT @Bucks Lollll wonder who that shots at 🤷‍♂️",
    "487": "@jackeichsays @Bucks Iconic floor design.",
    "488": "@violet_s_ummers I'm so happy that my Milwaukee Bucks whooped your Phoenix Suns to win the championship last year!!",
    "489": "Ducking the nets as champs? 🤡🤡 @Bucks",
    "490": "@BleacherReport @Bucks Play this on a loop 👍🏾",
    "491": "3 of 3\n\nNOTE:  We do NOT believe the @bucks fear a first round matchup with either @ATLHawks or @BrooklynNets – the two squads that have the best chance of claiming the @NBA Eastern Conference seventh seed.\n\nCC:  @jphanned\nCC:  @Underdog__NBA",
    "492": "2 of 3\n\nAccordingly, the @Bucks are locked-in to the second seed regardless of the match up outcomes today.\n\nContinued...",
    "493": "@Neuburg92 \"How are the Bucks incentivized [sic] to lose? 2 seed is better than 3\" – \n\nThere is no incentive for the @Bucks to win or lose today due to the fact that same holds tiebreakers over both @celtics and @sixers.\n\nContinued...",
    "494": "@BleacherReport @Bucks @Giannis_An34 feigns humility but still throws subtle digs at his opponents. He's an amazing basketball player but a very peculiar, character. His dad jokes are amazing though 😂😂😂",
    "495": "@TradesGenius @BleacherReport @Bucks Lestank? You're so silly",
    "496": "FREE #livestream here👉https://t.co/2c6Ltz5wlw 😉\n——\nApr.10, Sun.\n🏀#NBA ‼️\n1.Brooklyn Nets Vs Indiana Pacers\n2.Houston Rockets Vs Atlanta Hawks\n3.Charlotte Hornets Vs Washington Wizards\n4.Cleveland Cavaliers Vs Milwaukee Bucks\n5. New York Knicks Vs Toronto Raptors",
    "497": "NBA Basketball Game Betting Picks Simulator: 3:30 PM ET - Milwaukee Bucks vs. Cleveland Cavaliers - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/RzfkWLHZZC #nba #sportsbetting #freepicks #cappertek",
    "498": "@NBAonTNT @Bucks First,he is a champion",
    "499": "🏀NBA🏀 #NBA \n🏀Saison régulière🏀\n\nBrooklyn Nets - Indiana Pacers\nCharlotte Hornets - Washington Wizards\nCleveland Cavaliers - Milwaukee Bucks\nDallas Mavericks - San Antonio Spurs\nDenver Nuggets - Los Angeles Lakers\nHouston Rockets- Atlanta Hawks",
    "500": "This sums up the final day of the #NBA75 regular season very well. #FearTheDeer could greatly benefit from losing, while #LetEmKnow desperately needs a win to avoid potentially dropping to 10th in the East. @Bucks @cavs https://t.co/8WvNa3Opk4",
    "501": "Cleveland Cavaliers vs. Milwaukee Bucks – NBA Wett-Tipp, Prognose, Quoten (10.04.2022, 09:30 CET) - https://t.co/Q64T769CPG",
    "502": "@BleacherReport @Bucks GOAT mentality",
    "503": "@Bucks Jevon Carter 30 points tonight 💪",
    "504": "ALERT: New high roller bet posted!\nA bet has been placed for $87,577.04 on Cleveland Cavaliers - Milwaukee Bucks to win $119,980.54.\nTo view this bet or copy it https://t.co/FvZZtMIwQS https://t.co/adVvMHhzFX",
    "505": "Cleveland Cavaliers - Milwaukee Bucks\n\nBet slip link: https://t.co/KQHNuqAg2e https://t.co/iZ8xhpCnZY",
    "506": "@price21 @NBAonTNT @Bucks But it’s easier sitting in street clothes with AD. E-Z money…",
    "507": "@VYPEIndy @Bucks @celtics My bad if both lose bucks stay 2nd and Philly would move to 3rd if they were to win. But if Celtics win and bucks lose, I believe Celtics would jump the bucks. Philly wins and Celtics lose, sixers would jump the Celtics.",
    "508": "@VYPEIndy @Bucks @celtics Sixers",
    "509": "Check out 2021-22 Panini STICKERS &amp; CARDS COLLECTION GIANNIS ANTETOKOUNMPO MILWAUKEE BUCKS https://t.co/lakHXBloDH #eBay via @eBay",
    "510": "@BleacherReport @Bucks So glad you’re a Buck, brother! 🦌",
    "511": "@4PFnerry @Dallassportsctr @KDTrey5 @Bucks I hope they make it competitive and I honestly hope they win as Kyrie is my fav player and it’d be great for the future of the nets and his legacy, I just do not see it happening.",
    "512": "@4PFnerry @Dallassportsctr @KDTrey5 @Bucks 26.5% in the clutch. Your only response is “trust me bro just watch KD will clutch, mark my words” to this abysmal stat that KD holds.",
    "513": "@nfthustlegod @Dallassportsctr @KDTrey5 @Bucks Lucky ass championship 😭 y’all got, come back to this comment when the nets bounce y’all out 🫡",
    "514": "@4PFnerry @Dallassportsctr @KDTrey5 @Bucks Is this your goat? Mr. 0-6 in OT game 7? Is this your clutch god who can do it all offensively? https://t.co/Pn54xbtywf",
    "515": "@nfthustlegod @Dallassportsctr @KDTrey5 @Bucks Nets in 6 watch y’all was lucky last season it won’t work this year😈",
    "516": "@4PFnerry @Dallassportsctr @KDTrey5 @Bucks eh, i really doubt that the nets would beat the bucks when they have no defense and solely rely on offense. maybe and this is a big MAYBE, if ben simmons comes back 100% his old self the nets would have a chance, but we know thats not gonna happen.",
    "517": "Check out 1996-97 Fleer Metal #136 Ray Allen Fresh Foundation RC Milwaukee Bucks https://t.co/0X1gWbxntq #eBay via @eBay",
    "518": "\"The Milwaukee Bucks will get exposed this season!\" 💀",
    "519": "@BleacherReport @Bucks My favorite player in the league right now on attitude alone",
    "520": "@itsgirlnabs @theCyberZon @Bonefire851 @__Shilts__ @Bucks They have a better record against common opponents",
    "521": "Real talk, Chicago Cubs fans gotta DETEST Milwaukee at this point. Worse than Cleveland. Worse than GB. First the Bucks take out AC, now the yearly tradition of Brewers pegging Cubs players appears to be renewed. Fucking ridiculous tbh.",
    "522": "@BleacherReport @Bucks GIANNIS, please continue.",
    "523": "@nfthustlegod @Dallassportsctr @KDTrey5 1st round exits @Bucks",
    "524": "@MountForPM @logjam17 @Bucks @MotorolaUS Nope, votes are due by Monday midnight",
    "525": "@AUSTlNREAVES @BleacherReport @Bucks Dunk and win",
    "526": "@nihilist_bucks They should put an F1 race in Milwaukee and make them drive around the hop",
    "527": "@DubsNets @BleacherReport @DrippyDak @Bucks He owns him because he’s humble? Doesn’t care about awards? Mad dipshit energy rn",
    "528": "@theCyberZon @Bonefire851 @__Shilts__ @Bucks But season series is 2-2?? How does the tie breaker work for that?",
    "529": "@emzzilyy @Bucks all I did was arm workouts with dumbbells relax",
    "530": "@hoopshopjunkie @ChrisDreamer @CPTrey3 @BleacherReport @Bucks Hah? Giannis didn’t have a David Robinson on his team when he was drafted, with all due respect",
    "531": "@NBAonTNT @Bucks This man dealing with a lot",
    "532": "@Neuburg92 @jphanned @Underdog__NBA @husseymichael Agree to disagree I guess. KD was a shoe size away from beating Bucks without Kyrie, and with Harden in a wheelchair handing the ball off at half court like a QB that can’t pass. Kyrie smoked you guys in Milwaukee earlier this season and your perimeter D is statically awful,",
    "533": "@colelep @Bucks working out in THOSE shoes????",
    "534": "REPORT: Milwaukee Bucks Sign Rayjon Tucker to Multiyear Contract. https://t.co/BoARXzL4Ql",
    "535": "@cyanshsharma007 @BraggingRtsSpts @Buakaw69182235 @allmyfriends77 @Bucks Bro I’m just a bucks fan that doesn’t want to see us face the nets again early. Shits scary. KD and Kyrie can easily win 4 out of 7 against anyone. I’m not saying who would win what, I’m just saying I think the bucks could handle the nets, but I don’t wanna test that 🤣",
    "536": "@BleacherReport @Bucks There’s two certainties in life…1. We will all die 2. People on twitter will hate on anything",
    "537": "@howboutthemsox @BraggingRtsSpts @Buakaw69182235 @allmyfriends77 @Bucks Definitely nets &amp; bucks trying to avoid first round matchups also you think brown &amp; tatum better than kd &amp; kyrie in playoffs then forgot 🤣 Celtics will choked if they met nets in first round",
    "538": "@cyanshsharma007 @BraggingRtsSpts @Buakaw69182235 @allmyfriends77 @Bucks The nets don’t wanna play the bucks as much as the bucks don’t wanna play the nets. The winner of that game goes to the ECF pretty easily IMO and probably finals. Nets would rather play Boston. I think Bucks win either way",
    "539": "@howboutthemsox @BraggingRtsSpts @Buakaw69182235 @allmyfriends77 @Bucks Ppl really underestimate nets at this point 🤣 don't be suprise if nets beat Celtics or bucks in first round 🤣kd &amp; kyrie will be more dangerous in playoffs",
    "540": "@cyanshsharma007 @BraggingRtsSpts @Buakaw69182235 @allmyfriends77 @Bucks The nets would rather have Boston as a 2 seed too 💀💀💀",
    "541": "@Sneakysnakes659 @InterpretedByBC @Bucks @LoriNickel @journalsentinel @Giannis_An34 last time i compared Giannis/Rodgers people yelled at me, i’m done \n\n(but yeah you’re right) https://t.co/CSLHS5ocbB",
    "542": "@BraggingRtsSpts @Buakaw69182235 @allmyfriends77 @Bucks The reason bucks don't want 2nd seed https://t.co/uS1vBcGrnL",
    "543": "NBA Milwaukee Bucks 2015 Font https://t.co/fKl20Z3WNY",
    "544": "\"You don't get to your full potentials, when you focus on the wrong things.\"- @Giannis_An34 \n\n@Bucks @NBA @espn @ESPNAfrica @SkySportsNBA @abcsport @BBCSport @cnnsport @BBCSport @SuperSportTV @MultiChoice @AlJazeera @dwnews  @beINSPORTS_EN",
    "545": "milwaukee bucks https://t.co/lruqRTlxYh",
    "546": "@TwoPuffs2Takes @NBAonTNT @Bucks That’s Russel Wilson imo, this is just him giving an honest answer",
    "547": "@BleacherReport @Bucks If you had SOLELY listened to this audio clip without any video, your first impression would be that \"this dude speaking sounds like Zelensky!\" 🇺🇦",
    "548": "Giannis Antetokoumpo speaks on how he puts his focus in the right place to succeed 🙌\n\n@espn @SkySportsNBA\n@abcsport @beINSPORTS_EN\n@NBA @SuperSportTV\n@MultiChoiceGRP @dwnews\n@BBCSport @ESPNAfrica\n@AlJazeera\n\n(@Bucks) https://t.co/u3cMV4DhaX",
    "549": "Milwaukee Officials Took 'Zuck Bucks' from Zuckerberg, New Filing with Election Commission Reveals What Began Popping Up Right After https://t.co/KteGpYnp2n",
    "550": "@BleacherReport @Bucks Giannis ❤️",
    "551": "@TheDestinAdams He’s a Milwaukee buck and you can have a second.",
    "552": "@InterpretedByBC @Bucks @LoriNickel @journalsentinel @Giannis_An34 @PXP_Sports @WiscoGrant suppose Rodgers has this same mentality? I honestly think he might, but not to this extent.",
    "553": "@jphanned Maybe I'm reading it wrong, and explain it to me like a 6-year old if I am 😂\n\nBut if Philly, Milwaukee and Boston all end up 51-31 tomorrow (seems likely), doesn't Milwaukee hold this tiebreaker?\n\nMilwaukee 4-3 vs Cs/Sixers\nBoston 4-4 vs Bucks/Sixers\nSixers 3-4 vs Bucks/Cs https://t.co/Bt6HN8DCjp",
    "554": "@Bucks Giannis always gives us the best photos",
    "555": "@_Graysonblazer @BleacherReport @Bucks Big facts",
    "556": "@TheSteinLine @JimOwczarski @eric_nehm Boston doesn’t play until 6:30, so if the Bucks lose they can just as easily throw their game to avoid leapfrogging Milwaukee into the 2 seed",
    "557": "@VYPEIndy @celtics @sixers @Bucks 76ers need to win and grizzlies need to beat Celtics",
    "558": "@BlackZed2013 @BleacherReport @Bucks Should be the face of humanity. Not just the league",
    "559": "@NBAonTNT @Bucks He knows how to play the microphone. Baby face in wrestling terms.",
    "560": "Milwaukee Bucks: Who Will Celtics Play In Playoffs? Three Scenarios Entering Season Finale https://t.co/fk3uy857ND",
    "561": "@BleacherReport @Bucks EGO IS YOUR ENEMY!!!!!! ✊🏾🎯",
    "562": "@BleacherReport @Bucks Greek Freaky 🔥🔥🔥🔥🔥🎯❤️✊🏾",
    "563": "@LVVisualss @Giannis_An34 @Bucks @HoHighlights @ComplexSports @TheHoopCentral Great job as always👏",
    "564": "@NBAonTNT @Bucks I mean when u know u not finna win it this is the right response lol.",
    "565": "@NBAonTNT @Bucks Wish Lebron had his attitude.",
    "566": "@BleacherReport @Bucks This why he’s the greatest rn",
    "567": "I asked my friends who will win the NBA Championship.\n1. Milwaukee Bucks (15.3%)\n2. Philadelphia 76ers(10.6%)\n3. Phoenix Suns(9.7%)\n4. Utah Jazz(8.6%)\n5. Brooklyn Nets(8.1%)\n6. Memphis Grizzlies (7.3%)\n7. Miami Heat(6.9%)\n8. Golden State Warriors(5.4%)\n9. Boston Celtics(4.1%) https://t.co/w3iJlNZI6V",
    "568": "@NitStark @Giannis_An34 @Bucks @HoHighlights @ComplexSports @TheHoopCentral Thank you bro! 😁\n\nIt took a lot of messing around but once it started taking shape it came out exactly how I envisioned it",
    "569": "@BleacherReport @Bucks Kool Dude!",
    "570": "@BleacherReport @Bucks how do you guy hate on him lmaooo like wth 🤦🏽‍♂️",
    "571": "Would very much appreciate a @Brewers win (or even proof of batting life from @ChristianYelich) during the upcoming off week for the @Bucks. #pleaseandthankyou #amen",
    "572": "@Bucks Celtics can rest started and tank too just like Bucks.  No guarantees on anything.",
    "573": "@Bucks Good decision, the organization would be hammered if Giannis or Kris got hurt in a meaniless game. Rest all the starters and get ready for the playoffs.",
    "574": "@Christi91883608 @1973salvador @AmNotEvan No one has proven anything in the playoffs because the playoffs haven’t started. Nets will be out in the first round if they play Boston or Milwaukee, which is why it is so frustrating for the Bucks to freely give away the 2 seed.",
    "575": "@AllenCsa15 @1973salvador @AmNotEvan Who told you that What has Boston proven agaisnt the Bucks in the playoffs?Nothing Stop thinking about the regular season, that means nothing in the playoffs,Nets have the best chance to beat Milwaukee in the east!",
    "576": "@Bucks Looking forward to the 2-hour drive to watch tomorrow. I’ll try to explain “maintenance” to my boys when we get there.",
    "577": "@laz_ur @__Shilts__ @Bucks The Celtics will either be the 2 or the 4 by the end of the day tomorrow. Because Philly is going to beat Detroit, and we will probably lose to the Cavs with our starters not playing.",
    "578": "Win tomorrow @Bucks @memgrizz @sixers",
    "579": "@Buakaw69182235 @allmyfriends77 @Bucks The reason they are resting their starters is because Bud is doing an experiment on the Cavaliers by using his reserves and seeing how they do against their starters since they could play Cleveland in Round 1.",
    "580": "@drgradinjan @Bucks Agreed bucks got blessed last year winning game 7 at Brooklyn on the road their better off getting the 2 seed and take Brooklyn to a battle win that series to host the Celtics or Philly in round 2 then going in the road if the nets loses or don’t get the 7th seed",
    "581": "@LVVisualss @Giannis_An34 @Bucks @HoHighlights @ComplexSports @TheHoopCentral This...is absolutely incredible omg. After seeing how the design was, when you started it, it's blown my mind even more man. Incredible lighting. Incredible design!",
    "582": "@RuthlessEchoz @DubsNets @BleacherReport @DrippyDak @Bucks It's in their blood",
    "583": "@BleacherReport @Bucks “How can i focus on myself without being selfish” defines Giannis as a player and a man, its a question more players/people need to ask themselves",
    "584": "Congratulations to Bechtel who moved up 85 spots to take #63 on the Milwaukee Bucks team leaderboard.\n\nhttps://t.co/uMlVhppkVf",
    "585": "@BleacherReport @Bucks The goat",
    "586": "@Ndabzz23 @Bucks @pconnaughton Last week fam.",
    "587": "@BleacherReport @Bucks Or you have Embiid still playing up 20 with 1 minute to go vs Pacers today",
    "588": "@BleacherReport @Bucks Bless this man",
    "589": "@BleacherReport @Bucks we are so lucky we are getting to watch this legendary story of his unfold",
    "590": "#Milwaukee #Bucks: Full throttle.... \n \nhttps://t.co/OI94pxrRPB\n \n#Basketball #MilwaukeeBucks #NationalBasketballAssociation #NBA #NBAEasternConference #NBAEasternConferenceCentralDivision #Wisconsin https://t.co/EiKNkFAwFz",
    "591": "Milwaukee Officials Took 'Zuck Bucks' from Zuckerberg, New Filing with Election Commission https://t.co/stpaNZ1slT Three city officials of Milwaukee are being accused of election bribery for accepting “Zuck bucks” to to fund illegal privately-funded absentee ballot drop boxes",
    "592": "@BleacherReport @Bucks and people think jokic deserves MVP cause he stat pads assists 🤣🤣🤣",
    "593": "My sports itinerary today GMT{+3}\n St Miren Vs Rangers 14:00\n Leicester Vs C.Palace 16:00 \n Florentina Vs Napoli 16:00 \nEuro League women final (B'Ball): Sopron Basket Vs  Fenerbahce 17:00\nhttps://t.co/CMNzZv7I7B Vs L'Pool 18:30\nNBA Cleveland Cavaliers Vs Milwaukee Bucks 22:30",
    "594": "@Brandon_Focht13 @Bucks @Giannis_An34 BRO WE HAVE BASICALLY THE SAME SLIP WE SHOULDA TOOK GIANNIS BOARDS🤦🏾‍♂️",
    "595": "@soloPSPK_ @spicyp123 @__Shilts__ @Bucks Wouldn't be tied so Bucks just get 2nd",
    "596": "@SoberRizzo @evans_megan8 @Bucks Bulls fan😂😂😂😂😂😂",
    "597": "@MercedesElite @HollywoodBoi5 @Bucks Because I’m on spring break and doing nothing else it doesn’t matter it would be my choice so and I’m trying to see how the different sports stadiums",
    "598": "@Bucks I don't care what seed we get, JUST START THE PLAYOFFS!",
    "599": "Championship rings are getting more and more elaborate! The 2020 Tampa Bay Buccaneers, and 2020-2021 Milwaukee Bucks have unbelievable rings. Add 2021 Atlanta Braves to that list. https://t.co/8YNZtkovAR",
    "600": "@BleacherReport @Bucks Great team player",
    "601": "@NBAonTNT @Bucks I have so much respect for @Giannis_An34",
    "602": "@BleacherReport @Bucks That’s why he’s going back 2 back",
    "603": "@Bucks jrue needs rest",
    "604": "@c4_know @Fan17Nba @Vinn_34 @bernard_dat @Bucks They are top 2",
    "605": "@Vinn_34 @bernard_dat @Bucks Yall top 2 now",
    "606": "@Bucks Lmfao and Bucks fans accused Celtics of being scared of the Nets 😂😂😂",
    "607": "@Notmelly_8 @HollywoodBoi5 @Bucks Why would u drive now seems like DECESION test is smart why get anyone hurt",
    "608": "@Bucks @Bucks if @Giannis_An34 sits my parlay is shot 😭😭😭 https://t.co/rfMSRFf1g1",
    "609": "@Bucks Plus our bench has some shooters Jordan Nwora not much on D he's liability",
    "610": "This episode...the boys came up with a NBA Finals of the DALLAS MAVERICKS and MILWAUKEE BUCKS, What's your finals pick??",
    "611": "@imamretired @_Elove4 @SixersTre @BleacherReport @Bucks Giannis hater some real weirdos with the reaching",
    "612": "@AUSTlNREAVES @BleacherReport @Bucks Dribble dribble teammates -Cp3, Westbrook,Durant,kyrie, 10+seasons 0 rings\nAntetekumpo teammates -middleton,holiday 7 years 1 ring\nDribble boy washed",
    "613": "@BleacherReport @Bucks Real easy guy to root for. Reminder: he committed to the Bucks BEFORE going out and winning a championship. Didn’t try to form a super team. Didn’t hold the team hostage. Never asked for a trade. More then you can say for other superstars.",
    "614": "@Bucks No one wants the nets not even the great championship team...",
    "615": "@horchata999 @soloPSPK_ @laz_ur @spicyp123 @Bucks Yeah, if Bucks lose, Celtics lose, and Sixers win, then Bucks are 2, Sixers 3, and Celtics 4",
    "616": "@ShamTendz @Bucks @pconnaughton Literally a lockdown defender who can get 10+ 7 4 2 and 2 every night",
    "617": "@soloPSPK_ @laz_ur @spicyp123 @__Shilts__ @Bucks In that scenario, the Bucks will be the 2-seed because they will have 1 more win, as they do today.",
    "618": "@BleacherReport @Bucks This man sounds like a true Champion.",
    "619": "@Soccer_3_Mom @Bucks @pconnaughton That's it a swear",
    "620": "@ShamTendz @AKUMP0_SZN @Bucks @pconnaughton What you mean",
    "621": "Milwaukee Bucks https://t.co/yYKeBeoOSd",
    "622": "Those yellow uni’s sooooo 🔥🔥🔥🔥 please bring them back @Bucks https://t.co/GGxQpncY0n",
    "623": "@BleacherReport @Bucks This guy is truly built/made different. I’ve only heard about 2 other people make that statement before. He’s a winner no doubt!",
    "624": "@DubsNets @BleacherReport @DrippyDak @Bucks You’re just making excuses, not telling me how he “owns Giannis” cause of he needs all this help like you say he does, then he def doesnt. Giannis doesn’t have All-Star caliber teammates, KD had 2 arguably top-10 players on his team.\nEnjoy your first round exit",
    "625": "@BigSalza @BleacherReport @DrippyDak @Bucks \"He picked Brooklyn\" explains Harden getting injured after 20 seconds in the series and Giannis taking out Kyrie (on purpose) in game 3 🤓",
    "626": "@Bonefire851 @__Shilts__ @Bucks nah celtics got the tiebreaker on the bucks",
    "627": "@MarcRyanOnAir\nI don't know how old you are, but before NBC took over the NBA in the 90's, this is what I grew up with. Listening to Brent Musburger or Dick Stockton was truly heaven for me especially if involved the @Lakers\n@celtics\n@sixers or @Bucks! 👇 https://t.co/y9BAWEchX9",
    "628": "@BleacherReport @Bucks How humble is this dude? What a great ambassador for this game!!! Antidiva and totally team minded",
    "629": "Milwaukee Bucks Injury Update: \n\nOUT: \nGrayson - Left hip; soreness \nGeorge - Right abdominal; strain \nLuca - Coach's Decision \n\nDOUBTFUL: \nGiannis - Right knee; soreness\nBrook - Back; maintenance \nKhris - Left wrist; soreness \nBobby - Left shoulder; soreness",
    "630": "@DubsNets @BleacherReport @DrippyDak @Bucks He picked Brooklyn, not Giannis’ fault. L after L here bud",
    "631": "@BigSalza @BleacherReport @DrippyDak @Bucks That's what happens when you play 53 minutes in a 53 minute game (due to a very washed Blake Griffin being his best teammate not Middleton and Jrue)",
    "632": "@JerseyFresh1310 @JackCallahanNBA @StoolGreenie Only if Milwaukee also wins. If Boston and Philly win and Milwaukee loses, it’s a 3 way tie and the Celtics own the tie breaker over both. So they’d be the 2 seed. If Milwaukee wins they remain a game above the Celtics and the Bucks get the 2 seed",
    "633": "@NBAonTNT @Bucks Manz scored 50 in a finals close out game…",
    "634": "@Bucks No one should play. Nothing to do with seeding. Just health.",
    "635": "@BleacherReport @Bucks How can you not love this dude and what he’s about! So glad he got that first Championship on his Resume. Hopefully we can get 2 or 4 more lol!",
    "636": "@BlessedYukio @BleacherReport @Bucks Embiid has been lobbying for MVP since the quarter mark of the season. Now he’s complaining media doesn’t like him. He could learn something from this.",
    "637": "@spicyp123 @__Shilts__ @Bucks No. 3rd tie breaker is records vs. top 6 teams and they have the advantage in that",
    "638": "@DevioxusAJ @NBAonTNT @Bucks Embiid aint in the same universe as Giannis, kiddo.",
    "639": "@imightbepop @BleacherReport @Bucks Watching all 20 highlights of free throws in one half?",
    "640": "@BleacherReport @Bucks And this is why the rest of the nba hates him…. He speaks REAL shit.   Good for you Giannis.  🙏🏾👍🏾🙏🏾👍🏾🙏🏾",
    "641": "@NBAonTNT @Bucks Real sportman",
    "642": "@Senator_AA @NBAonTNT @Bucks Posting about the world champs and the best player in the world is suspicious?",
    "643": "@BleacherReport @Bucks Embiid should listen to this",
    "644": "@JaysGotNext @NBAonTNT @Bucks Dodging the team they’ve beaten 5 straight times? \n\nWorry about your squad getting that coveted round 1 victory so they can take a second round beating.",
    "645": "@laz_ur @__Shilts__ @Bucks Isn't a loss still gonna keep them 2nd seed , cause they have better division standings?",
    "646": "@NBAonTNT @Bucks This is why I’m big fan of his",
    "647": "@BleacherReport @Bucks He and Jokic got it figured out",
    "648": "@NBAonTNT @Bucks You better than Embid",
    "649": "@MkeKid134 @AmNotEvan @nihilist_bucks AND, even if we lose to Brooklyn, if we beat Milwaukee tomorrow, we would HOST the Hawks/Hornets winner.  Home court is big for us in this equation.",
    "650": "@Bucks So you’re telling me there’s a chance",
    "651": "@casualtakeking MILWAUKEE BUCKS",
    "652": "Cleveland - we’re comin’ for ya!!!\n#MKE➡️CLE @Bucks @Giannis_An34 @Jrue_Holiday11 @BPortistime @Khris22m @GraysonJAllen @Thanasis_ante43 https://t.co/BreVHEKTvh",
    "653": "@Bucks Bucks want to give up the home court advantage in the second round because they are afraid of losing to the Nets in the first round.  This move might backfire.",
    "654": "@NBAonTNT @Bucks How can anyone hate on this dude? He doesn't care about narratives; all he cares about is the work...",
    "655": "@Bucks Everyone basically sore",
    "656": "@__Shilts__ @Bucks Since bucks are 1 ahead of 76ers and celtics and beat them both, don't bucks hold the tiebreaker and hold the 2 seed regardless?",
    "657": "@NBAonTNT @Bucks He injured kyrie.He's a DIRTY player🤮🤮🤮",
    "658": "Visiting Milwaukee and @Bucks #WI https://t.co/K2Fh5CYCrA",
    "659": "Milwaukee L\nPhili W or L\nCeltics W\n\nCeltics W moves them over the bucks (who they have the tiebreaker over)\n\nBucks L moves them under the Celtics \n\nWhatever happens with Phili is irrelevant https://t.co/8iIOal6jrb",
    "660": "@__Shilts__ @laz_ur @Bucks completely fine with that we have had an easy round 1 for 3 years let’s keep it that way",
    "661": "@NBAonTNT @Bucks I love everything about this man",
    "662": "@Bucks I’m fine with this… I want the 3 see so we can kick the bulls as in 4",
    "663": "@GTC901 @Bucks Finally having some success and think Memphis is a power house!!!??  Let's see how Memphis adapts to half court playoff basketball!!!",
    "664": "@__Shilts__ @laz_ur @Bucks That’s fine… I would rather play the bulls then the nets",
    "665": "@Bucks This is weak and has nothing to do with rest. Giving away the 2 seed one game after playing everyone in the second half of a back to back in order to keep it makes zero sense.",
    "666": "OMG are there any @Celtics @sixers @Bucks fans that can tell me what will determine 3rd seed in #NBA Eastern Conference?",
    "667": "@BleacherReport @Bucks Getting swept by the heat + ratio + L",
    "668": "@IcyKso @Bucks Fr, dude has played 37 mpg over the last 6",
    "669": "@UkrainianOladip @NBAonTNT @Bucks Your source?",
    "670": "@JaysGotNext @NBAonTNT @Bucks By beating the Celtics ass? Thinking of your team?",
    "671": "@Bucks Easy dub",
    "672": "I got Milwaukee ne k &amp; neck with the bucks for eastern conference finals https://t.co/NKWG2JAy75",
    "673": "@NBAonTNT @Bucks The Constant curiosity and quest  to get better…a certain someone always preached that https://t.co/VBKDaO22LK",
    "674": "@Bucks bums for that damn trae won’t make playoffs now",
    "675": "@NBAonTNT @Bucks Good for you  Just be the best you can be and the rest will take care of itself",
    "676": "@NBAonTNT @Bucks This is why everyone on the bucks feels empowered to play their natural game, not just Jrue and Khris, the likes of Allen, Portis, Brook, have many possessions where they get to really do their thing as well, Giannis not chasing numbers is great for them",
    "677": "@NBAonTNT @Bucks Why NBA pages posting Giannis and Bucks all of a sudden. Something suspicious",
    "678": "@NBAonTNT @Bucks Fake ass humble guy.  Ppl act likes he's a good guy but they don't know his history past in Greece.  Arson charges at 16 and I juvy at 15 for domestic assault.",
    "679": "@elonmusk Elon buy the Milwaukee buck and give me a tesla an and a mansion with 8 bedrooms a big pool and paid off and $1,000,000,001.01",
    "680": "@NBAonTNT @Bucks Giannis isnt better rhan embiid",
    "681": "@NBAonTNT @Bucks Still dodging the nets 😭😭😭",
    "682": "@NBAonTNT @Bucks Giannis You're The Greatest PF Of All Time",
    "683": "\"If I keep worrying about if I can win the scoring champ, and who has done it in the past... It takes me away from the goals I really want to achieve.\"\n\nGiannis is locked in on his biggest goals 🔒\n\n(via @Bucks) https://t.co/1z1ZDNL7VV",
    "684": "@SLAMonline @Bucks 8/11 is a slow start for Giannis? Damn his standards be high asf",
    "685": "@SeanGrandePBP Who gets the 2 if the Bucks lose, Celtics lose, and Sixers win? Since Philly plays after Milwaukee I wonder if they try and avoid the 2 seed if it’s possible that they get it",
    "686": "🏀 Milwaukee Bucks (@Bucks) #FearTheDeer\n🆚 W @ Detroit #Pistons #MILvsDET\n⏭️ Cleveland Cavaliers #LetEmKnow #MILvsCLE\n✈️ N664DN | DAL8932 | B752\n🛫 DTW - 5:02 pm ET\n🛬 CLE - 5:26 pm ET\n📡 Tracking: https://t.co/aalNao2Bq8 https://t.co/pld1Weix73",
    "687": "@Bucks How y’all gonna do Jrue like that 😂",
    "688": "@Bucks Thank you https://t.co/2jjIUaD3hq",
    "689": "@Bucks Everyone should play to the end of the season and get the 2nd seed. Think this is a little ridiculous.",
    "690": "An increasingly popular question, so let's put it here again...\n\n3-way tie &gt; Boston #2, Milwaukee #3 and Philadelphia #4.\n\nHere's a cheat sheet...\n\nBucks lose, Celtics win &gt; Boston is #2\nSixers win, Celtics lose &gt; Boston is #4 vs. Toronto\nAnything else &gt; Boston is #3 vs. Chicago https://t.co/xLPcDngV5Z",
    "691": "@Bucks Rest jrue play Luca bud https://t.co/DVLV87J2ud",
    "692": "@Bucks No 30PPG season Giannis😔 https://t.co/dpxLrG7tv7",
    "693": "@Bucks Good decision. Let 'em rest for the playoffs.",
    "694": "A NBA Finals da temporada 2021-22 vai ser entre Milwaukee Bucks x Memphis Grizzlies.\n\nBucks in 7.\n\n🏆🏆🏆 https://t.co/NwtI1z9hdI",
    "695": "this years rise of the Memphis grizzlies, phoenix suns and constant domination of the Milwaukee bucks is telling you now that its not about the “Big 3”anymore its about building a solid team 1-15. and thats great for the League 👏🏼  #NBA 🏀",
    "696": "@HollywoodBoi5 @Bucks I know  we were planning on driving down there but I don’t know what I wanna do yet",
    "697": "@BleacherReport @Bucks This is an amazing answer https://t.co/hsRRZKUn6x",
    "698": "@Notmelly_8 @Bucks Game is in Cleveland",
    "699": "@Bucks Let Jrue rest too",
    "700": "So the Bucks are throwing tomorrow at Cavs. Figures. The \"defending champs\" want nothing to do with the Nets now that KD has Kyrie and a squad. Milwaukee Cucks! https://t.co/ClD4Rf6LOG",
    "701": "@808Dev_ @Bucks first round exits",
    "702": "@laz_ur @Bucks Yup, it’s crazy that if they win and we lose it goes to the 6th tiebreaker too",
    "703": "@BleacherReport @Bucks Being in the moment living your life he's not worried about rewards he's got the gift he enjoy playing basketball 🏀 making his teammates better around him that's good 👍✅💯 just living life I am David that's what I'm doing enjoying my life forget BS good day y'all",
    "704": "Milwaukee Bucks: Kevin Durant Says Teams Aren't Tanking To Avoid Nets In Playoffs: \"I Don't Even Really Think They're Worried About Us,\u0085 https://t.co/io50DIqfdH",
    "705": "@Bucks Why Jure not rest together?",
    "706": "@IrishBMoney @eric_nehm Yes just like that the bucks go from having games 1257 in milwaukee to 1257 in boston all because you had to rest these guys in the final game with 5 days off after the cavs game",
    "707": "@Bucks No lucs nooooo",
    "708": "@Bucks Give Jrue a break lmao",
    "709": "@Bucks So Jrue and the Wisconsin Herd are playing",
    "710": "@Bucks So they're bailing on this game and settling for third seed.  That sucks.",
    "711": "@__Shilts__ @Bucks No. We're leaving it in Boston's hands. If they wanna tank we stay in 2. If they don't, we go to 3.",
    "712": "@Bucks We neeeeed to winnnnnnn",
    "713": "@__Shilts__ @Bucks We get the bulls then 😎😎😎😎",
    "714": "@Bucks So do I still make the decision to go to tomorrow’s game or should I just go to the Brewers game I really don’t know",
    "715": "@DanzaInFour Bucks. Milwaukee owns BKN",
    "716": "@Bucks So what you’re saying is we’re tanking for the 3 seed?",
    "717": "@Bucks Good or bad",
    "718": "@SaraJayXXX @SaraJay @Bucks Sarah will always be number one",
    "719": "@Bucks Idc what happens this game all I know is BUCKS IN 6 🙌",
    "720": "@Bucks Poor Grayson🤣🤣🤣🤣",
    "721": "Injury Update: \n\nOUT: \nGrayson - Left hip; soreness \nGeorge - Right abdominal; strain \nLuca - Coach's Decision \n\nDOUBTFUL: \nGiannis - Right knee; soreness\nBrook - Back; maintenance \nKhris - Left wrist; soreness \nBobby - Left shoulder; soreness",
    "722": "@DubsNets @BigSalza @BleacherReport @DrippyDak @Bucks Bucks still won tho and Giannis still dropped 40, just saying",
    "723": "@DubsNets @BleacherReport @DrippyDak @Bucks Cool stat bro, here’s one from the same game. https://t.co/RlFEThPDjR",
    "724": "@BleacherReport @Bucks This is why he reigns supreme. https://t.co/1nt4KEfbzk",
    "725": "Does anyone know who the 3 seed is in the #NBA Eastern Conference if both #Milwaukee and #Boston lose their last game? @Bucks @celtics",
    "726": "The Milwaukee Bucks when they realized they had a chance to get the Bulls in the first round https://t.co/Qlddlfyvuj",
    "727": "We might be a Pacers family, but Owen had to have a @Bucks  cake because he loves him so @Giannis_An34 ! https://t.co/5enXzJDx7y",
    "728": "@xmariomc @BleacherReport @DrippyDak @Bucks *To the Bucks with a washed Blake/Harden as his best teammate 😃",
    "729": "HAHAHAHA run from it @Bucks BROOOOKKLLYYNNN https://t.co/AySlJJbyBJ",
    "730": "I want the @Bucks in the first round! Let’s go @KDTrey5 @KyrieIrving @BrooklynNets",
    "731": "@BigSalza @BleacherReport @DrippyDak @Bucks Kyrie played in one of those games and KD was doing stuff like this 1v5 with a washed Blake Griffin as his second best option 😹😹😹 https://t.co/PHWpLhVcfH",
    "732": "New York, United States — The Milwaukee Bucks edged closer to securing second seeding in the Eastern Conference playoffs on Friday with a 131-101 rout of the Detroit Pistons.\n\nRead more: https://t.co/vsIxAc9V8W\n\n#MilwaukeeBucks\n#DailyTribune",
    "733": "New York, United States — The Milwaukee Bucks edged closer to securing second seeding in the Eastern Conference playoffs on Friday with a 131-101 rout of the Detroit Pistons.\n\nRead more: https://t.co/Dp1FofZGH3\n\n#MilwaukeeBucks\n#DailyTribune",
    "734": "@dirtyaIbanian @Bucks Hmm then everything will workout. Otherwise Nick Nurse is a tough customer if you don't have enough fire power.",
    "735": "Fucking cowards @Bucks https://t.co/JnJQT0DSUf",
    "736": "@ButchHG @BleacherReport @Bucks Facts",
    "737": "Cleveland plays Milwaukee tomorrow 👀 Assuming the Bucks don’t rest their players scenario #1 is very possible! Nets are beating the Pacers and the Hornets are beating the Wizards 🤷🏾‍♂️\n\nAll the Hawks gotta do is win. https://t.co/ndTVWfJS7l",
    "738": "@NGTRSLC4LIFE @Bucks horford’s vaccinated and i heard jaylen will get it if we end up playing toronto so i’m okay with it",
    "739": "@BleacherReport @Bucks Gotta love Giannis.     Refreshing!",
    "740": "@BleacherReport @Bucks Yeah that's words right there. I love it",
    "741": "If the Bucks throw tomorrow's game to avoid the Nets in the first round.. change their name to the Milwaukee Cucks",
    "742": "Check out 1974 Topps Basketball Oscar Robertson #55 Milwaukee Bucks HOF Graded PSA 6!!!!!! https://t.co/G77Eb6G6jS @eBay",
    "743": "@BleacherReport @Bucks Sounds obsesive",
    "744": "@BleacherReport @Bucks If he wins the chip this yr he's top 15 greatest all time already lol",
    "745": "@dirtyaIbanian @Bucks Okay I see. But then you guys will be without Robert Williams for the whole series. Plus Jaylen and Horford for Toronto games. So Toronto games you guys don't have three key players. Are you guys willing to take that gamble ?.",
    "746": "@Q_2smooovvv @BleacherReport @Bucks His focus changed like yours has",
    "747": "If the Bucks lose tomorrow then Boston better lose too because playing Toronto then Miami is so much better than Brooklyn and then (maybe) Milwaukee",
    "748": "@NGTRSLC4LIFE @Bucks 4th honestly would rather have toronto first round and the heat 2nd rather then brooklyn and then the bucks",
    "749": "@Q_2smooovvv @BleacherReport @Bucks From when he was younger tho right?",
    "750": "@BleacherReport @Bucks Couldn’t say it any better",
    "751": "@BleacherReport @Bucks The Tom Brady of the NBA.",
    "752": "Check out ORG0041 1996-97 Finest #22 Ray Allen B RC #MilwaukeeBucks https://t.co/BOLs0QF9Qj via @eBay",
    "753": "End Of The Line: Milwaukee Bucks Return to the NBA Playoffs https://t.co/YApc44k1uY",
    "754": "@GreenBay_Jay @Brewers @JoshMaurerPxP @lanegrindle @Bucks Still, he deserves all the interest he has, but I think the team needs to stick with someone that is every game",
    "755": "@DubsNets @BleacherReport @DrippyDak @Bucks KD has lost 5 straight to the Freak lmao 😂 atleast check the records before you comment 🤡",
    "756": "If Milwaukee bucks vs Brooklyn Nets happen at the east first rounf playoffs. Who do you got ? KD or Giannis ? \n#NBA #Playoffs #BrooklynNets #Milwaukee #bucks",
    "757": "@eric_nehm This is disappointing. It makes no sense to give away the 2 seed. Boston is the biggest challenge to Milwaukee and doing this hands them home court in a second round series. Not what I expected from the Bucks.",
    "758": "@BleacherReport @Bucks Love this guy. Need kids to emulate him.",
    "759": "@BleacherReport @Bucks Media frame players with words and other bull shot them blame the same players for their speculations. Neither one of these guys (LeBron to Giannis) started or duels this scoring champ thing. Now BR, one of those media sources, want to post a righteous statement.",
    "760": "@BleacherReport @Bucks Jokic and Giannis fans being okay if one of the 2 wins it. Nobody likes Embiid to win except for Embiid fans. It's about the attitude.",
    "761": "@DubsNets @BleacherReport @DrippyDak @Bucks Why can't you KD fans just not be toxic for one second",
    "762": "@dirtyaIbanian @Bucks Sixers losing to Detroit is not a gamble Embiid wants to take with his MVP chances. So most likely you guys are 4th or 2. That's why I asked what you guys prefer ?",
    "763": "@Bucks What do I gotta do to get a signed giannis jersey 👀",
    "764": "@jackeichsays @Bucks One of my favorite buildings.",
    "765": "@NGTRSLC4LIFE @Bucks 3 but that would take a sixers loss",
    "766": "@HPbasketball If it’s a 3-way tie between Boston, Milwaukee and Philly wouldn’t the Bucks be the two seed? The second tiebreaker in a three way tie is record head-head amongst the tied teams. Milwaukee is 4-3, Philly 4-4 and Boston 3-4 so Milwaukee would get the 2 right?",
    "767": "@BleacherReport @Bucks And then he went off and shit on my pistons lol",
    "768": "@TatersWI @swaggolfco @Braves @MLB @Bucks Maybe if we @ the @NBA they’ll let swag use the logos. ;)",
    "769": "@dirtyaIbanian @Bucks If Bucks lose. You guys going to be either 2 or 4. Which one you guys prefer ?.",
    "770": "@BleacherReport @Bucks Gonna be better than LeBron I'm telling yall 2 more chips in Milwaukee, never left, never complained, just hard work and discipline I said if giannis can win 2 more in Milwaukee I'll think he's better than LeBron, nd nothing can't tell me otherwise Giannis wants to win fuck stats",
    "771": "@bucks We going #Back2Back🏆\nLet's Go @Giannis_An34 #Goat🐐\n#2TIMEMVP Make it #3TIMEMVP\n#BucksInSix #BucksBack2Back🏆\n\n https://t.co/J6a4F85ClY",
    "772": "@BleacherReport @Bucks Best player in the world.",
    "773": "@swaggolfco @Braves @MLB @Bucks Ring Ceremony was October 19.. seeing as our two states always have the utmost respect for each other, I assume their championship cover is still in R&amp;D.. I’ll just keep F5’ing until I see it. https://t.co/umQuP7Tebd",
    "774": "@JoelMacho77 @BleacherReport @Bucks Cheap shot maker.",
    "775": "🏀 Boston Celtics (@celtics) #BleedGreen \n🆚 L @ Milwaukee Bucks #FearTheDeer #BOSvsMIL\n⏭️ Memphis Grizzlies #GrindCity #BOSvsMEM\n🗒️ C's went back to Chicago after MIL\n✈️ N661DN | DAL8919 | B752\n🛫 MDW - 12:28 pm CT\n🛬 MEM - 1:31 pm CT\n📡 Tracking: https://t.co/uA5MnEdak0 https://t.co/CzuOjXhqID",
    "776": "Beasting never wins btw @Bucks",
    "777": "@BleacherReport @Bucks Absolute heart of a champion. \n\nFace of the league as far as I'm concerned. If every player were had his mindset, the league would be in much better shape than it is today.",
    "778": "@BleacherReport @Bucks King shit👑🐐",
    "779": "@BleacherReport @Bucks With him playing 30 or less minutes in blowouts and the other two in the game late, you know he’s not just talking",
    "780": "@BleacherReport @Bucks No Dad jokes Giannis??? 🤷🏽‍♂️",
    "781": "@unvsable @GAmyGoat @imightbepop @BleacherReport @Bucks ooooookkkkkk? still NBA right? i asked the lanlord how much for rent she said it was free 😎",
    "782": "Bucks, Brewers launching NFT collectibles: What are they? - FOX 6 Milwaukee https://t.co/gDDBH7dFr5",
    "783": "@Barksdale235 @GAmyGoat @imightbepop @BleacherReport @Bucks 1 ring before the 60's btw.",
    "784": "@unvsable @GAmyGoat @imightbepop @BleacherReport @Bucks 3 rings to your 2 🤷🏻‍♂️. i would be mad too if he destroyed my team like that last year idk how thats supposed to make me mad. you worried about 2 grown ass men who are more successful than you in life 💀 couldnt be me",
    "785": "@Grant_Shirley4 @Bucks Jrue Holiday will send the cavs home 😈",
    "786": "@Barksdale235 @GAmyGoat @imightbepop @BleacherReport @Bucks I'm enjoying it, y'all haven't won one since 83.\n\nHope y'all win one as soon as Harden leaves. Can't stand that fat fuck.",
    "787": "@BleacherReport @Bucks That's a True Leader words right there and STAYED with one team win or lose unlike the other one.",
    "788": "@PonyThaCHAMPony @ChrisDreamer @CPTrey3 @BleacherReport @Bucks Much respect. The fact that Giannis has been in the league without legitimately being a title contender ends the convo before it begins",
    "789": "@unvsable @GAmyGoat @imightbepop @BleacherReport @Bucks but enjoy your first ring since ‘71! it was a good series",
    "790": "@unvsable @GAmyGoat @imightbepop @BleacherReport @Bucks i mean coming at me with insults when ive done nothing but say you late to the party sounds kinda pissed off to me https://t.co/Uc9kPF4orw",
    "791": "@BleacherReport @Bucks I would assume this is cause he has already won mvp 2 times",
    "792": "Let's go @Bucks #Milwaukee https://t.co/03vW3Mt0tQ",
    "793": "@BleacherReport @Bucks I love my guy. Exudes class and professionalism. But dawg. Can we get some bass in that voice…..",
    "794": "@DubsNets @BleacherReport @DrippyDak @Bucks Brooklyn’s 7th 🤣",
    "795": "@OwnedByBron I don't want to see the Bucks in the first round. Assuming Nets win tomorrow and the play in, they're the 7 seed. Bucks are currently 2. However if Bucks lose and Celtics win the Celtics will get 2. I would much rather play Boston than Milwaukee.",
    "796": "@BleacherReport @Bucks I love his focus about playing ball!",
    "797": "@Barksdale235 @GAmyGoat @imightbepop @BleacherReport @Bucks Nah, did embiid make it out the 2nd round yet? https://t.co/vueg7jG11I",
    "798": "Here are some of the strategies I’ve paid most close attention to in non Football sports outside of Detroit Teams:\n1- Tampa Bay Lightning\n2- Houston Astros\n3- Milwaukee Bucks\n4- Dallas Mavericks\n5- Utah Jazz\n6- Los Angeles Lakers\n7- Denver Nuggets\n8- Colorado Avalanche\nAnd more.",
    "799": "~The Way of Kam: Thoughts on Basketball, Beaches, and Life #1 😌 🏝🏀#TheWayofKam #TransitionGame #TG #TransitionGameManga #NBA #Manga #RobinLopez #BrookLopez #OrlandoMagic #MilwaukeeBucks #KamFord #Basketball #DeepThoughts #BallIsLife #Philosophy #TWoK1 https://t.co/gswMbiMgyx https://t.co/Ze1IP7jSeY",
    "800": "@unvsable @GAmyGoat @imightbepop @BleacherReport @Bucks did i hurt your feelings sir? im sorry 🥺",
    "801": "@Bucks You are scared of the Nets😹😹",
    "802": "I love you @Bucks \n#backtobackchips.",
    "803": "Check out GRN008 1996-97 Finest Refractors #22 Ray Allen B #MilwaukeeBucks https://t.co/GxhIYHdFwi via @eBay",
    "804": "@ParlayQueen @BleacherReport @Bucks He is such an amazing guy.  That's the role model I want my kids to have. So glad he's ours.❤🏀 #Wisconsinproud",
    "805": "@InterpretedByBC @Bucks @LoriNickel @journalsentinel @Giannis_An34 @PXP_Sports Why I love this man and can't stand LeBron.",
    "806": "@unvsable @GAmyGoat @imightbepop @BleacherReport @Bucks took you 2 hours to do this just for no one to look at it 💀",
    "807": "...I could listen to this all f'in day... 🙏 #enjoytheprosses😎 #thefreek 🇬🇷🏀🦌 @Bucks @Giannis_An34 https://t.co/5q5KblIM4n",
    "808": "@BleacherReport @Bucks Young 🐐",
    "809": "@Barksdale235 @GAmyGoat @imightbepop @BleacherReport @Bucks Thread of Embiid bad performances carried by FT's:",
    "810": "@BleacherReport @Bucks Shots fired 😂",
    "811": "@Davechange00 @BleacherReport @Bucks He is beyond special!",
    "812": "Fear the Deer 🦌 🏀 @OriginalFunko @Giannis_An34 @Bucks #FearTheDeer #funko #funkogold #greekfreak https://t.co/Wg7e5Wab1x",
    "813": "Give me Milwaukee in round 1. Celtics then Bucks would be ridiculous https://t.co/GSPc0TpG2s",
    "814": "Btw for the @Bucks it seems primarily driven by the fact that some players (Jrue, Serge) only have 1 S3 moment, and its in the 10k territory (effective bottleneck): https://t.co/1hDnQu9M77",
    "815": "@BleacherReport @Bucks Yeah I watched them play. Knock em down, belt them up, hurt them. That’s his you win.",
    "816": "Bucks are potentially resting a bunch of key players for the final game of the regular season where seeding is still up for grabs.\n\nIf Milwaukee loses and Boston wins, Boston will take over the #2 seed and set up a potential 2-7 matchup with Brooklyn. https://t.co/dxDiMGu815",
    "817": "@JaysGotNext @Bucks - inapplicable\n1 tied (2-2)\n2 both division leaders\n3 not same division\n4 tied conference record (33-19)\n5 the one that matters but stats are not readily available https://t.co/yoF5hPzTqw",
    "818": "@BleacherReport @Bucks Respect",
    "819": "@wontgottlieb With Boston facing Memphis on the 2nd night of a b2b. Isnt it safe to assume Memphis rests everyone, and Boston goes all out to avoid Toronto bc of potential vax issues? Then Milwaukee is resting everyone tmrw vs Cleveland. So isn’t it looking like Bulls-Bucks is the most likely?",
    "820": "@BleacherReport @Bucks He really practices what he preaches",
    "821": "@JaysGotNext @Bucks no division record only matters if you’re in the same division",
    "822": "@Imman_Adan Milwaukee 2, philly 3, boston 4 (sixers don’t have the tiebreaker vs bucks)",
    "823": "@BleacherReport @Bucks Some good stuff here. What a human being and basketball player. Love this mindset.",
    "824": "@3xBanHammer @BleacherReport @Bucks I think it is not that he doesn't care, it is just that it that he doesn't think about it right now. If he wins it then that's good, but for now, he focuses on the goal which is being a better version of himself.",
    "825": "The Bucks ducking the Nets man I’m crying…pussy ass team in Milwaukee if you ask me",
    "826": "@BleacherReport @Bucks His English is getting a lot better",
    "827": "@BleacherReport @Bucks He’s really the most genuine human being bro. I don’t care what team you root for",
    "828": "@BleacherReport @Bucks King Giannis https://t.co/PcDMDVoigt",
    "829": "This man I mean seriously folks This guy is the EPITEMY of humble,selfless,team first,being in the present.. he's so amazing as a human being.. thankyou @Giannis_An34 for being you and being a loyal @Bucks we appreciate you bro 💯\n\nhttps://t.co/fXn9ZZ6kzr\n#MvpFreek #GreekFreek",
    "830": "@jackeichsays @Bucks Grew up attending Marquette games beginning in 1965. Saw my 1st NBA game in 1968: Phoenix at Milwaukee. Attended the Harlem Globetrotters every New Year’s Eve. Went to several Milwaukee Classics involving both the Warriors &amp; Badgers. I’m so happy it’s still standing.",
    "831": "@BleacherReport @Bucks There is a reason Giannis is the best player in the NBA. This dude gets it!",
    "832": "@BleacherReport @Bucks This why you gotta respect him 💯‼️",
    "833": "@StuartPixley @_aleksa_kml @sixers2022LG @3xBanHammer @BleacherReport @Bucks Very fair",
    "834": "@BleacherReport @Bucks I’m a Lakers fan but I have to admit it..Giannis&gt;AD",
    "835": "@mtingO6 @Bucks The bucks have a better division record yet some people are saying that we will get tiebreaker",
    "836": "go burn in **** @Bucks https://t.co/1LGrHhcsvE",
    "837": "Milwaukee Bucks: End Of The Line: Bucks Return to the NBA Playoffs https://t.co/T5bStZLsGx",
    "838": "@MIPBarrett @Boness305 @BleacherReport @Bucks Just remember giannis didnt win last year bc ppl didnt want him to 3 peat. That man is easily the best there is rn",
    "839": "@mtingO6 @Bucks I have no clue bro, this shit makes no sense",
    "840": "@dirtyaIbanian @Bucks need that fatty jrue to have a masterclass",
    "841": "@dirtyaIbanian @Bucks they are intentionally fucking us",
    "842": "@BleacherReport @Bucks How can you not love @Giannis_An34?",
    "843": "@Giannis34SZN @Bucks Who dat ?",
    "844": "@JaysGotNext @Bucks sohowthefuckimposedtofigurethatshitout",
    "845": "@BleacherReport @Bucks Giannis is my fav.",
    "846": "@BleacherReport @Bucks Honestly most of ‘en don’t care they really just was hoop it’s the fans who over do it",
    "847": "@mtingO6 @Bucks I think all",
    "848": "fuck you fuck you fuck you fuck you fuck you fuck you fuck you fuck you @Bucks https://t.co/zhqpfiLoiL",
    "849": "@JaysGotNext @Bucks is that all east or just playoff teams",
    "850": "@BleacherReport @Bucks You can’t worry about what you can’t control. You give your best and if you are voted 🗳 mvp than good and if not you keep focusing on what you are able to control; your game, your process, your focus… all that will make you an ultimate champion.",
    "851": "Was celebrating my mother-in-law's bday at her favorite bar on West Milwaukee watching the #Bucks game Friday when I impressed her by pointing to the TV and saying \"I know that guy.\"\n\nI 👀you @Dario_Melendez https://t.co/tVFznGD0en",
    "852": "@BleacherReport @Bucks Love this dude!",
    "853": "@JaysGotNext @Bucks i legit have no idea how to look up your record against east playoff teams",
    "854": "@BleacherReport @Bucks And people hate on this guy…",
    "855": "@BleacherReport @Bucks One of the few players with a real ring.",
    "856": "Oh so if bucks lose then Boston can just tank the game to avoid Brooklyn. Again, the players will never tank. It’s the orgs making these calls. Interested to see if Tatum plays if Milwaukee loses https://t.co/2wczTiQO5m",
    "857": "@BleacherReport @Bucks Refreshing in a league where Booker and his teammates were celebrating how many points he scored even though they lost the game",
    "858": "@BLCity5 If all Boston, Philadelphia and Milwaukee go 51-31 I believe the Bucks take the 3 way tie because they have the tie breakers over both Philly and Boston",
    "859": "@mtingO6 @Bucks Yes apparently",
    "860": "@JaysGotNext @Bucks wait the tiebreaker rules are so confusing do you guys have the tiebreak over the bucks?",
    "861": "@BleacherReport @Bucks I recognize that voice @LoriNickel",
    "862": "Awww come on man! @Bucks 😖😭",
    "863": "@Franco52 @jackeichsays @sultan_of_stats @Bucks Zep, Tull, ELP, Who Yes u name it Stones",
    "864": "If the Bucks lose and the Celtics win, Milwaukee will have to the 3 seed — meaning the Nets will not see them in the first round.",
    "865": "@titans4L_ @BleacherReport @Bucks Wrong",
    "866": "@BleacherReport @Bucks Man’s through Boston in there ight bet",
    "867": "@DubsNets @TheodoreGalanos @Bucks Bucks resting players tomorrow 👀",
    "868": "@aawttar @BleacherReport @Bucks Stay mad https://t.co/gZbba5GlVI",
    "869": "@imightbepop @Danizeh @BleacherReport @Bucks In your dreams https://t.co/UGblIToUZU",
    "870": "@mtingO6 I want to play the bulls but this pussy ass franchise @Bucks dodging the nets",
    "871": "@BleacherReport @Bucks Top 5 PF of all time...",
    "872": "@BleacherReport @Bucks How can you not like him..",
    "873": "@BleacherReport @orlandoupnext @Bucks Best PF of all time",
    "874": "@BleacherReport @Bucks That's why he's Kobes best student.\n\nIgnoring all the noise. https://t.co/yUhm7Xw6vD",
    "875": "@MackDaddyLawson @BleacherReport @Bucks This is what greatness looks like.",
    "876": "@Boness305 @BleacherReport @Bucks The only time I hate him is when he drops a 40 point triple double on my team but otherwise he is a great person and probably the best player in the league",
    "877": "@BleacherReport @Bucks Somebody show @JaMorant this.",
    "878": "@jmaes85 @Bucks Soft",
    "879": "@_MF_OG @Bucks Soft",
    "880": "@BleacherReport @Bucks He is THAT guy",
    "881": "@BleacherReport @Bucks Extremely mature response",
    "882": "@MikeN328 @jackeichsays @sultan_of_stats @Bucks Wow, the Beetles &amp; Springsteen! Pretty cool",
    "883": "End Of The Line: Milwaukee Bucks Return to the NBA Playoffs https://t.co/9UcZoehLK4",
    "884": "@TheodoreGalanos @Bucks Bruce shoots over 40% from 3pt lol we'll let yall run this and Jrue can shoot open 3s too 😀",
    "885": "@Bucks soon https://t.co/kR75FGMO1f",
    "886": "Need us to beat the Bucks tomorrow then lose to the Nets in the 7/8 game then beat Atlanta/Charlotte I’d much rather play Miami over Milwaukee",
    "887": "@DubsNets @BleacherReport @DrippyDak @Bucks 🤔 Giannis won the last 5 straight against KD, knocked him out of the playoffs, won the ring, and just put 40 on his head last week.\nBut ok https://t.co/hQLaPqEQTG",
    "888": "Pretty sure I’m gonna surprise my daughter with a road trip from Milw. to Cleveland - going to the final @Bucks game of the regular season tomorrow… stay tuned!  #roadtrip #milwaukeetocleveland #milwaukeebucks #fearthedeer",
    "889": "@Cavsanada Thank you @Bucks",
    "890": "@BleacherReport @Bucks Is he not amazing?",
    "891": "@BleacherReport @Bucks @JakeKates45 type of player",
    "892": "@BleacherReport @Bucks Humble gee",
    "893": "@BleacherReport @Bucks meanwhile.. https://t.co/JUhNikuwf8",
    "894": "@BleacherReport @Bucks this dude is unreal. just a well oiled machine",
    "895": "@BleacherReport @Bucks This guy is basically a Ted Lasso character",
    "896": "@BleacherReport @Bucks Best player in the league and future GOAT",
    "897": "1972-73 Topps Basketball #100 Kareem Abdul Jabbar Milwaukee Bucks PSA 6 ExMt https://t.co/xMNBlQajSX via @Etsy #Captain #HappyBirthday #LakersNation #Kareem",
    "898": "@BleacherReport @Bucks That's it, I'm a Giannis fan now, and it's been a long time coming too 👏🏿👏🏿👏🏿",
    "899": "@Mrdotoomuch_ @BleacherReport @Bucks How is it fake?",
    "900": "@BleacherReport @DrippyDak @Bucks That's why KD owns him 😹",
    "901": "@BleacherReport @Bucks This guy is going to be in the GOAT conversation",
    "902": "@BleacherReport @Bucks This fake humble sh*t is Hilarious",
    "903": "@BleacherReport @Bucks @russwest44 ... please take notes",
    "904": "@BleacherReport @Bucks Fucking amazing person",
    "905": "Gotta be one of, if not the most, regrettable move in Milwaukee Bucks history letting English get away. https://t.co/tBRGo0Bcn1",
    "906": "@imightbepop @Danizeh @BleacherReport @Bucks Good god what an atrocious L",
    "907": "@BleacherReport @Bucks “How can I focus on myself without being selfish”🔥",
    "908": ".@Brewers                   @Bucks\n                          🤝 \n            Dirty organizations",
    "909": "@BleacherReport @Bucks @KingJames take notes….",
    "910": "Hey There! Here's a New Post On: End Of The Line: Milwaukee Bucks Return to the NBA Playoffs....Check it out. https://t.co/7kla22hCPR  #NBA #NHL  #NFL https://t.co/mQ57YNZ6I4",
    "911": "@BleacherReport @Bucks I mean am sure at some point he wanted to chase MVP but obviously he had come long way and it’s definitely not a priority anymore",
    "912": "@ChrisDreamer @CPTrey3 @BleacherReport @Bucks When it’s all said and done, we’ll have that convo",
    "913": "@_aleksa_kml @sixers2022LG @3xBanHammer @BleacherReport @Bucks That's 🧢, Giannis wanted MVP when Kobe challenged him to get it. He said so himself.",
    "914": "@obvious_shirts Ban Milwaukee players from sports. Bucks and Brewers",
    "915": "Jrue Holiday wins the NBA Finals with a steal on Devin Booker and finishes it off with the epic lob to Giannis 🔥 \n\n@Bucks fans got this one on repeat 🔁 \n\nWant to attend the #NBAPlayoffs in person? We’re sending Top Shot collectors to every single game ➡️ https://t.co/PxC4qMfuuX https://t.co/3TaQd8WUWc",
    "916": "@BleacherReport @Bucks Giannis is #him\n\nPeople already taking him for granted.",
    "917": "@_Elove4 @imamretired @SixersTre @BleacherReport @Bucks A bronsexual that has Giannis on his mind 24/7 have some shame",
    "918": "Bucks dominate the Pistons behind Giannis Antetokounmpo's huge second half as Milwaukee maintains No. 2 seed in Eastern Conference https://t.co/ioC7JiOj87 #sports #feedly",
    "919": "@BleacherReport @Bucks @ButchHG .. he can talk like this now that he has a ring and two mvps. Just last week they was talkin about the video where he said he was going to be the mvp. Shit funny ..",
    "920": "@Bucks My goat",
    "921": "@BleacherReport @Bucks Winner Mentality",
    "922": "@Franco52 @jackeichsays @sultan_of_stats @Bucks Well seen all the classics in my day including The Beatles you name it, Springsteen so many times plus met him back stage, tonight my sons in town &amp; going to C Brian Jonestown Massacre, might go, but getting up there",
    "923": "@BleacherReport @Bucks Not even a fan of his … But Goddamn how could I not be now! That’s passion, discipline and focus! Don’t mistake it for anything else! He truly is special",
    "924": "@BleacherReport @Bucks Absolutely love the mindset on this guy,man! ALL prospective NBA players (and some vets) should use this as a template to be a true \"champion\"..👏🏽👏🏽👏🏽",
    "925": "@sixers2022LG @3xBanHammer @BleacherReport @Bucks Joel didnt deserve it last year and neither giannis nor jokic cared about the mvp when they both had 0 mvps",
    "926": "@Bucks Pat is mad underrated. Love this dude.",
    "927": "@BleacherReport @Bucks Goat mentality",
    "928": "@PhilMackey Twinkies always find a way to melt down and overshadow Buck’s signature HRs, like last opening day vs Milwaukee. Just watch 🤤",
    "929": "@_Elove4 @SixersTre @BleacherReport @Bucks Literally every player does that unless someone takes a really hard fall",
    "930": "@BleacherReport @Bucks Run this clip back in ten years to see how he did over those ten years.",
    "931": "@imamretired @SixersTre @BleacherReport @Bucks That would believable if doesn’t just act like nothing happens you obviousl can feel the shooter feet land on top of yours and he acts like he did nothing he’s dirty",
    "932": "@BleacherReport @Bucks Get writers that know their sport",
    "933": "@stayathomeMo @PompeyOnSixers @PhillyInquirer @Bucks If you're trying to avoid anyone, you have no confidence in the Sixers. \n\nBring on the Bucks in RD2!",
    "934": "My new favorite  player!! RT @BleacherReport: Stop and listen to these words from Giannis on how he puts his focus in the right place to succeed 🙌\n\n(@Bucks) https://t.co/Xaf7RSaRYO",
    "935": "@BleacherReport @Bucks Is there a more likable superstar!?!? Love me some @Giannis_An34 and the bucks.  Love him and this team.  We are So lucky to have you @Giannis_An34",
    "936": "@_Elove4 @SixersTre @BleacherReport @Bucks Bad close outs does not mean a dirty player…",
    "937": "@Brananagus @GAmyGoat @imightbepop @BleacherReport @Bucks and who are you?",
    "938": "@BleacherReport @Bucks Even if there are better players throughout history, how many are salt of the earth like Giannis? Every kid should strive to be like him.",
    "939": "@BleacherReport @Bucks With that being said… y’all can have that shit.  See you in the Finals. ✌🏾 https://t.co/PGSCB42P2j",
    "940": "@AUSTlNREAVES @WWWWWWWW44455 @wuegoh @BleacherReport @Bucks Common cringe",
    "941": "@BleacherReport @Bucks This is why he’s the goat",
    "942": "So the 2nd, 3rd and 4th seeds in the East for the #NBAPlayoffs comes down to tomorrow:\n\n@celtics v @memgrizz\n@Bucks v @cavs\n@DetroitPistons v @sixers\n\nWho do you think is gonna end up where?",
    "943": "@wuegoh @AUSTlNREAVES @BleacherReport @Bucks Clippers fan twerking for the lakers",
    "944": "Love this guy man\n\nInsightful Giannis Interview💡: Bucks star describes why he prioritizes personal growth: ‘MVP, I could care less’ 🎥 (@Bucks) https://t.co/a85woUkIFc",
    "945": "@AUSTlNREAVES @BleacherReport @Bucks We’re probably gonna face the 76ers",
    "946": "@BleacherReport @Bucks Coming from the dirtiest player in the league https://t.co/AN2j3u4zaV",
    "947": "@BleacherReport @Bucks Take note @JoelEmbiid",
    "948": "@BleacherReport @Bucks Goat",
    "949": "@stacymagee01 @Bucks How is he that big now?!  So cute",
    "950": "@BleacherReport @Bucks Nah im good",
    "951": "@Bucks Best underrated player right there and nicest guy",
    "952": "@BleacherReport @Bucks By the way he answers that question, you know he‘s being sincere here. Not a yada yada answer. He’s so fucking authentic and likeable…",
    "953": "@BleacherReport @Bucks People actually hating this guy is just further proof that people take their NBA fandom wayyy too personally/seriously",
    "954": "@BleacherReport @Bucks Thats why he brought his team to the second seed and Lebron couldn’t help his team even make the playoffs",
    "955": "@MaxeyBetta @Bucks Better than maxey",
    "956": "@BleacherReport @Bucks What is that reporter tryna say in the beginning",
    "957": "@BleacherReport @Bucks Giannis is the MVP. Most consistent player over last 5 years. Other players may have slightly better stats but his team is a top 5 team in the league",
    "958": "Face card. https://t.co/O1960BBwJJ",
    "959": "@Molly_WISN @GerronJordan @DeerDistrict @Daji_aswad_wx @DGutierreztv @Bucks I wouldn’t expect anything less 🤣",
    "960": "@BleacherReport @noorrzainab @Bucks This is what basketball is about. Just win.",
    "961": "@BleacherReport @Bucks Giannis/Jokic &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt; everyone else. Just good dudes and playing better than anyone else. Embiid is there with his play, but that dude cares too much about himself IMO.",
    "962": "@BleacherReport @Bucks This why I love this kid, hate his team as a Heat fan lol but love his attitude and work ethics..",
    "963": "@WaverleKETV @GerronJordan @DeerDistrict @Daji_aswad_wx @DGutierreztv @Bucks Did he bark at all the other dogs? Absolutely he did 😂😂",
    "964": "@3xBanHammer @BleacherReport @Bucks Dude beat it. Those other two have already won it. Easy for both to say they don't care now. Jo deserved it last year too.",
    "965": "@Bucks Giannis losing the scoring title",
    "966": "@BleacherReport @Bucks I love this kid!! HE GETS IT💯 #BullsNation https://t.co/x3ZfGtPm2t",
    "967": "@BleacherReport @Bucks this is badass",
    "968": "@BleacherReport @Bucks Yall remember when he pushed Dunleavy? Now, he is a changed man.",
    "969": "@BleacherReport @Bucks This is a superstar you want to build yours franchise with for the next five to ten years. Selfless person who wants team success more than individual accolades. Giannis is just a different breed. Must appreciate athletes like him 💯",
    "970": "Please tell me @Spike_Lee_Joint is rooting for the @Bucks in the playoffs!",
    "971": "@MikeN328 @jackeichsays @sultan_of_stats @Bucks Besides sports, go to any concerts there?",
    "972": "@BleacherReport @Bucks This is why I love this guy and I am a Suns fan.",
    "973": "@BleacherReport @Bucks Wish we had this guy on knicks. He Gets it. #knicks @Giannis_An34",
    "974": "@PompeyOnSixers @PhillyInquirer Happy with the 4. Don’t want the 3 at all. Hoping to avoid @Bucks until the conference finals.",
    "975": "@BleacherReport @Bucks Damnit. I tried really hard not to like him. But I do. Shit.",
    "976": "@Toya_Washington @Giannis_An34 @Bucks Such a great guy and mindset. He is an inspiration and educator to this 60 year old man",
    "977": "@BleacherReport @Bucks This man has even improved immensely on speaking the English language over the last few years. The guy never stops working! So clear and his vocabulary is more vast than ever, truly inspiring!",
    "978": "@BleacherReport @Bucks Not many dudes think like this...",
    "979": "@Bucks Air Greek 😀",
    "980": "@AlxMD7 @BleacherReport @Bucks he will if he ever reaches the ECF and falls short",
    "981": "@AUSTlNREAVES @BleacherReport @Bucks Won’t give the lakers a play-in spot",
    "982": "@CPTrey3 @BleacherReport @Bucks Not better then Tim Duncan",
    "983": "@BleacherReport @Bucks Love this right here",
    "984": "@BleacherReport @Bucks Top 3 in the MVP “race”.. top guy doesn’t care about winning it. 2nd place guy doesn’t care about winning it. 3rd place guy… cries that people don’t like him.😂😂😂 man the differences are astonishing.",
    "985": "@BehemothBaller @BleacherReport @Bucks That's fair game lol.  Different when they are against your team.  Always liked him.  He seems so chill",
    "986": "@BleacherReport @Bucks He’s extremely humble and real.  Class act.",
    "987": "@itsescoman @BleacherReport @Bucks You should, and Lebum too.",
    "988": "@InterpretedByBC @Bucks @eric_nehm @Giannis_An34 LMAO grow up Wes",
    "989": "@BleacherReport @Bucks all these accolades come with getting better, and giannis has put that on FULL DISPLAY.",
    "990": "@imightbepop @Danizeh @BleacherReport @Bucks Stop it…none of them except Bron has accomplished what Giannis has accomplished, and Bron just missed the playoffs so…yea stop ts",
    "991": "@BleacherReport @Bucks Fake humble merchant",
    "992": "@imightbepop @IcyKso @Danizeh @BleacherReport @Bucks Def not. Grizzlies literally better without him😭😭",
    "993": "@SB4xJG4 @BleacherReport @Bucks I didn’t add Giannis",
    "994": "@BolWrld @BleacherReport @Bucks Is that the real bolbol😏",
    "995": "@Barksdale235 @GAmyGoat @BleacherReport @Bucks Own him",
    "996": "@BehemothBaller @BleacherReport @Bucks Didn't everyone dislike him for awhile?  Never understood it.  People just hate greatness.",
    "997": "@IcyKso @Danizeh @BleacherReport @Bucks ? He’s betta than Curry, Luka and Trae if that’s who you implying",
    "998": "@BolWrld @BleacherReport @Bucks I promise I seen a tweet that u were gonna pray on his downfall or sum, like it was a list😭",
    "999": "@imightbepop @Danizeh @BleacherReport @Bucks Ja not even the best in his own position lmao",
    "1000": "@BleacherReport @Bucks Embiid would never",
    "1001": "@BolWrld @BleacherReport @Bucks Wait a minute...",
    "1002": "@BleacherReport @Bucks GOAT mentality",
    "1003": "@BleacherReport @Bucks My MVP",
    "1004": "@BleacherReport @Bucks first round exit unfortunately",
    "1005": "@SixersTre @BleacherReport @Bucks People thinking giannis is dirty is hilarious to me",
    "1006": "@BleacherReport @Bucks @rudygobert27 Take notes and stop worrying about All Star games &amp; DPOYs",
    "1007": "@BleacherReport @Bucks This why he already top 20 all time",
    "1008": "If Milwaukee loses and Boston wins then the Bulls will face the Bucks.\n\nIf Boston loses and Philly wins then the Bulls will face the 76ers.\n\nIf Boston and Philly both lose then the Bulls will face the Celtics.\n\nBucks @ Cavs\n76ers vs. Pistons\nCeltics @ Grizzlies",
    "1009": "@BolWrld @BleacherReport @Bucks “people” https://t.co/cDNNc3VBUV",
    "1010": "@imightbepop @Danizeh @BleacherReport @Bucks Bro snuck in Ja like we wouldn’t notice💀💀💀💀💀",
    "1011": "@BleacherReport @Bucks Mvp talk",
    "1012": "@TurnUpBron @BleacherReport @Bucks You know I like Lebron but not this season brotha",
    "1013": "@BleacherReport @Bucks Dude is so genuinely likable in every way.",
    "1014": "@BleacherReport @Bucks I ain't hearing dad jokes",
    "1015": "@BleacherReport @Bucks People think this is an act. When he’s just a nice dude",
    "1016": "@BleacherReport @Bucks Inspirational",
    "1017": "@BleacherReport @Bucks Best player in the league 👑",
    "1018": "@BleacherReport @Bucks I wonder who is he going to undercut next time, is it Kai or KD.",
    "1019": "@BleacherReport @Bucks Best player in the game.",
    "1020": "@BleacherReport @Bucks This is why he’s the best player in the world respect Giannis 🙏",
    "1021": "@BleacherReport @Bucks Embiid should watch and learn from this",
    "1022": "@BleacherReport @Bucks he wannabe humble so bad but purposely lnjures players💀",
    "1023": "@BleacherReport @Bucks Leading the witness, your honor",
    "1024": "@BleacherReport @Bucks Giannis You're The Greatest PF Of All Time",
    "1025": "@BleacherReport @Bucks Kawhi&gt;giannis",
    "1026": "@thetoxicgod_ @BleacherReport @Bucks Holy Mid",
    "1027": "@BleacherReport @Bucks Best player in the league",
    "1028": "@BleacherReport @Bucks tell GianRoblox to win a real ring",
    "1029": "@BleacherReport @Bucks Not my MVP streets watching Embiid highlights rn",
    "1030": "@BleacherReport @Bucks I don’t think I will + ratio",
    "1031": "@BleacherReport @Bucks RIP DWAYNE HASKINS🙏🏼🙏🏼🙏🏼🙏🏼",
    "1032": "@BleacherReport @Bucks Kd better than u lil bro",
    "1033": "@BleacherReport @Bucks best player in the league rn, behind Trae Young",
    "1034": "@BleacherReport @Bucks Don’t care",
    "1035": "@BleacherReport @Bucks Fake humble",
    "1036": "Stop and listen to these words from Giannis on how he puts his focus in the right place to succeed 🙌\n\n(@Bucks) https://t.co/3eqt4MvRw7",
    "1037": "@Bucks please im begging",
    "1038": "@GerronJordan @DeerDistrict @Daji_aswad_wx @Molly_WISN @DGutierreztv @Bucks I spy Andy @Molly_WISN ♥️",
    "1039": "Please rest the starters @bucks",
    "1040": "@UK_Bucks @Bucks Best player in the world for sure.\nBut the joker really deserves mvp this year too",
    "1041": "@5OTF_ Im at a 7.. Im confident they will have enough to get past the 1st round, and a potential 2nd round vs Philly/Toronto.. but if were against Milwaukee, im not sure Bam/Jimmy will take the necessary jumps to propel  the Heat vs the Bucks… and will we have enough rebounding? 🤷🏽‍♂️",
    "1042": "@GerronJordan @DeerDistrict @Daji_aswad_wx @Molly_WISN @DGutierreztv @Bucks Absolutely love these pictures!",
    "1043": "https://t.co/kC9aw269f4\n\nMilwaukee Bucks",
    "1044": "All the #Celtics seeding scenarios for you. Imo, let’s go get that #3 seed. Let the Nets tire the Bucks out and Milwaukee gotta play us off a 7 gamer. https://t.co/fZOqByyjRv",
    "1045": "Junior’s peak salary was $350k, yet he’s amassed $600m in wealth!\n\nJunior was the 8th overall pick by the Lakers in 1975 and ended up playing 12 seasons, mostly with the Milwaukee Bucks.",
    "1046": "Need it @bucks https://t.co/p14A3l7gpu",
    "1047": "@GTC901 @Bucks and it's not even close.",
    "1048": "@Bucks I think he deserves to rest tomorrow",
    "1049": "Boston Celtics: 3 takeaways from the Milwaukee #Bucks' dominant win over Detroit Pistons - Behind the Buck Pass https://t.co/GtwYTUBGhG",
    "1050": "With Philly beating the Pacers there are 16 scenarios in play for tomorrow.  \nThe Bucks can drop to 3 in only 4 of them\nPhilly can get to 3 in only 4 of them\n\nWe're getting: Milwaukee, Boston, Philly",
    "1051": "Jarrett Allen is out tomorrow for the #Cavs against the Milwaukee Bucks."
}