{
    "0": "@Jonatha10782939 @ashan1738 @celtics they suck cause they are kids.Why? Because of one twitter video i saw. You dont know basketball.That isnt even a legitimate reason to be \"trash\"🤣",
    "1": "@celtics The bench warmers are the leaders that’s awesome",
    "2": "@Hargoat13 @celtics if they give us KD and Harden in return",
    "3": "Are we ready for some @celtics ?  Crickets! https://t.co/q9n6eP8Xdz",
    "4": "@MsSamanthaMay @celtics A bottle of wine for 1 is a glass.",
    "5": "@celtics Patriots SZN we don't care sadly",
    "6": "@celtics Let's go for victory 💚💚💚",
    "7": "@celtics Like the energy",
    "8": "@SunnyMon3y @AidanGLT @celtics For real",
    "9": "Please @celtics let’s win this game",
    "10": "@ashan1738 @celtics And this is the reason why this team is trash, they are a bunch of kids.",
    "11": "@celtics Trade Robert Williams to the Nets",
    "12": "@n4thy55 @celtics Above the peasants...lol",
    "13": "@celtics Stop playing around we lost to a 5-13 spurs have some shame",
    "14": "@celtics This why we be losing",
    "15": "@celtics if y’all don’t win by 20 its shameful",
    "16": "@celtics here is tatum and brown ?",
    "17": "@celtics Warm ups are clean...want one to rock on Xmas",
    "18": "@celtics can you guys not shit the bed against a bad team? ty.",
    "19": "@celtics Let's goooo",
    "20": "@celtics Don’t ruin my day",
    "21": "@celtics Let’s Win",
    "22": "LET’S HOOP 🤣😂 https://t.co/TmMuPArvsi",
    "23": "@MoooseSZN @celtics in a 60 pt loss",
    "24": "@celtics let's gooooooooo",
    "25": "The @Celtics starting Smart, Brown, Tatum, Grant Williams, Horford on Sunday. #Celtics #NBA",
    "26": "@celtics They will be saying this all year. This team is dysfunctional",
    "27": "Outspoken NBA player changing name to Enes Kanter Freedom to celebrate US citizenship \n\nBoston Celtics center Enes Kanter, an outspoken human rights advocate, is changing his name to Enes Kanter Freedom as part of his...https://t.co/IRaSdaIWES https://t.co/zTfENt8g0o",
    "28": "BOSTON (AP) — Boston Celtics center Enes Kanter is changing his name to “Enes Kanter Freedom” to celebrate becoming a United States citizen. https://t.co/8zae58usCG",
    "29": "@shenjoo @celtics dennis is injured",
    "30": "#NBA #NBATwitter Today's Lineups\n\n#BleedGreen \nBoston Celtics Starting 5:\nMarcus Smart\nJaylen Brown\nJayson Tatum\nGrant Williams\nAl Horford\n\n#WeTheNorth \nToronto Raptors Starting 5:\nFred VanVleet\nSvi Mykhailiuk\nScottie Barnes\nPascal Siakam\nPrecious Achiuwa",
    "31": "@celtics Team will be what it is until we trade pieces. Brad shouldn’t have emphasized too much on defense this offseason and not enough with shooting which has been this teams achillies heel for years",
    "32": "@celtics Watch out for grant 3’s 👌🏼☘️",
    "33": "@mcwheezer @celtics Tatum is not coachable, he won't listen, he just keeps trying to shoot a dumb step back 3 every chance he gets, and iso balls, he's about himself.",
    "34": "@jmargles9 @celtics thank you!!!",
    "35": "@GoldieOnSports @celtics That’s a nice view. Have fun at the game!!",
    "36": "@GoldieOnSports @celtics giving them BUSINESS after I specifically asked him not to",
    "37": "@jordancicchelli @celtics traitor 😤😤😤",
    "38": "@GoldieOnSports @celtics he’s at balzac’s",
    "39": "@cfbpat @celtics What's the point, the Celtics proved who they are, they ain't getting better and they win lose more games.",
    "40": "@FootbaIIHead @celtics Nah pats only thing keeping Boston thriving",
    "41": "@JaylenTatum0 @celtics No. Rob can have mine",
    "42": "@DekayScott @celtics Grant has been good actually, its not a bad thing he starts",
    "43": "@0fficial_Tog @celtics I can’t deny the accuracy, but I’m hoping for better please. 😂🙏🏽",
    "44": "@celtics Grant Williams",
    "45": "@celtics I'm done hearing what they need to do better, this team is trash and that's a fact, I don't care if they win a game and then we hear, oh, this is starting to come together as a team and it never does, they play a few good games and they go back to their old habits.",
    "46": "Now @celtics your turn to win today",
    "47": "Boston Celtics Starters:\n\nMarcus Smart\nJaylen Brown\nJayson Tatum\nGrant Williams\nAl Horford\n\nPlayers out:\nDennis Schroder\nRobert Williams\n#BleedGreen #NBA #NBATwitter #NBA75",
    "48": "@celtics Dennis Brown Jayson Grant and Horford. \nStart this lineup please.",
    "49": "@celtics Are they healthy?",
    "50": "@celtics #BleedGreen Comeback from the slow start.\nwe are the best team in the east",
    "51": "@celtics START ROMEO",
    "52": "@DekayScott @celtics Who should he start instead. BTW Grant has been great this season.",
    "53": "@celtics Grant scoring 40",
    "54": "@celtics Don’t ruin my day plz",
    "55": "@celtics Can’t wait to go down 24, make a comeback take a 16 point lead in 4th and let them go on a 25–2 run and lose the game.",
    "56": "@bl0ndeddd @celtics dennis is out",
    "57": "@celtics 🚨🚨🚨🚨🚨🚨🚨GRANT IS NOT A STARTER ON AN NBA TEAM 🚨🚨🚨🚨🚨🚨🚨 please learn Ime",
    "58": "@Burner06137507 @celtics at least the patriots know how to win",
    "59": "@celtics Run plays for him. I’ve had enough of tatum",
    "60": "@celtics Please win",
    "61": "@celtics no schorder no win",
    "62": "@celtics Football is on. Not tryna watch another L",
    "63": "Tonight's starters ⤵️ https://t.co/uhadbugeJU",
    "64": "@belalkakar_ Erdogan and Xi (and LeBron) will quake in their boots the entire 11.2 minutes of time he’s on the court for the underachieving @celtics.",
    "65": "@celtics Just win bro",
    "66": "@celtics JB don’t be on the injury report every game challenge https://t.co/BRPfaEaFyI",
    "67": "@celtics rob can have my average human immune system",
    "68": "@celtics Is Brad Stevens available? https://t.co/vInVFFJeHJ",
    "69": "@Vintagehoops1 @celtics rob williams and schroder are out still",
    "70": "@celtics Thanks",
    "71": "@celtics w. early raptors pack",
    "72": "@celtics Let’s go https://t.co/eHKqWD7nle",
    "73": "@celtics okay maybe celtics win today",
    "74": "@celtics Let’s hope Tatum gets traded tonight",
    "75": "@celtics No one on the injury report?!?!",
    "76": "@celtics Perfect now we can lose by 5 and not 15!",
    "77": "@celtics Don’t ever do that again you clown training staff",
    "78": "Boston Celtics center Enes Kanter, an outspoken critic of human rights issues, will become a US citizen Monday and legally change his name to Enes Kanter Freedom.\nhttps://t.co/kFHfqpbdhW",
    "79": "#NEBHInjuryReport update:\n\nJaylen Brown - AVAILABLE",
    "80": "@celtics is this shirt a joke?  This has to be the funniest nickname ever given how shitty this team has been https://t.co/CskMHj341f",
    "81": "Even sweeter to have him go get that W @celtics https://t.co/uVpDSoKFGX",
    "82": "Boston Celtics center Enes Kanter, an outspoken critic of human rights issues, will become a US citizen Monday and legally change his name to Enes Kanter Freedom.\nhttps://t.co/R2Hf8Yogfc",
    "83": "@DraftExpress @MarcJSpears So it would have been better if they were riding with a vaccinated person.\nBeing vaccinated has not help @sixers over the past month.\nNor @celtics two months ago.",
    "84": "@celtics We need to stop overthinking it and just play basketball",
    "85": "@celtics Shots need to be distributed more evenly. Anyone can score given 20-25 Shots per game.  Causes others to stand around.",
    "86": "Boston Celtics center says he will change his name and become a US citizen",
    "87": "@celtics please guys…",
    "88": "\"Robotech\", \"Transformers\", \"G.I. Joe\", \"Voltron\", Run DMC, LL Cool J, The Fat Boys, Whodini, Roxanne Shante, the Boston Celtics, New England Patriots, Boston Red Sox, Patrick Ewing, Reggie Lewis, Dana Barros &amp; Drederick Irving. https://t.co/EYDaF8MOQf",
    "89": "Boston Celtics center says he will change his name and become a US citizen\nhttps://t.co/4eI7ZmmBCl",
    "90": "Enes Kanter is changing his name to ‘Enes Kanter Freedom’ as the outspoken Boston Celtics center becomes a US citizen Monday https://t.co/S7iXHziSOA",
    "91": "📥TownHall Boston Celtics center and outspoken critic of the CCP, Enes Kanter will change his last name to Freedom and will make his current last name his middle name, making his new legal name Enas Kanter Freedom, as he prepares to become a citizen of the United States on Monday",
    "92": "Boston Celtics' Enes Kanter to change last name to Freedom - via @ESPN App https://t.co/qip7Zlyesc",
    "93": "Enes Kanter is changing his name to ‘Enes Kanter Freedom’ as the outspoken Boston Celtics center becomes a US citizen Monday https://t.co/3ZZLtoakO8",
    "94": "It's a slam dunk for @celtics fans! Join us in-person as professional #basketball player and #author @RedsArmy_John takes our stage to present and sign his book, THE BOSTON CELTICS ALL-TIME ALL-STARS. Register to attend the free event at https://t.co/fpCMcEl8Tk https://t.co/qkZhdaFoW6",
    "95": "@BCCoachStevens @celtics LET ME GET THIS STR8 i said lets get damrcus cousins WHY DIDNT WE? NO Guaranteed contract. GET Beasley now! for second team why kept kanter, jubari, pritchard, G Williams, Bruno 4 what! we need Biggs that play d and score GET ONE OF THE MORRIS BROTHERS",
    "96": "@celtics So there’s no chemistry",
    "97": "Boston Celtics big man @EnesKanter is legally changing his name to Enes Kanter Freedom. #Freedom #Celtics https://t.co/9rRr8noerQ",
    "98": "Boston Celtics center Enes Kanter is changing his name to “Enes Kanter Freedom” to celebrate becoming a United States citizen.",
    "99": "@celtics Maybe we just need to be better, ever thought of that",
    "100": "Toronto Raptors Predictions and Preview for 11/28/2021 hosts Boston Celtics.  Looking for betting action?  Find out if there is any value in our preview. #SportsBetting #Picks https://t.co/l7bjrYev6v",
    "101": "@celtics 🙄🙄🙄whatever wins us games",
    "102": "The Boston Celtics not about to ruin my good day",
    "103": "Coach Udoka emphasizes the need to become more collectively vocal: “That will take us to another level as a team.”",
    "104": "@RealBillRussell @ManionCollects @jaytatum0 @celtics @NBA Those are first quarter rebounding stats for Mr Russell.",
    "105": "@EnergySports12 @ThisWayArt @celtics exactly. we have a ball movement system and it will never work with brown.",
    "106": "@BurnerClarkson @celtics The best player in your teams history touches kids",
    "107": "Boston Celtics News - Jaylen Brown is questionable while Dennis Schroder and Rob Williams are out for tonight's game with the Toronto Raptors. #bostonceltics #celtics #bostonathletes #boston #basketball #NBA #NBA75 #bostonsports #bleedgreen #goceltics #bostonathletemagazine",
    "108": "Looking for a value bet?  See if the Boston Celtics-Toronto Raptors Predictions and Preview for 11/28/2021 is one in our preview.  No crazy hype just a prediction and preview. #SportsBetting #Picks https://t.co/l7bjrYev6v",
    "109": "@celtics take my hamstring",
    "110": "@celtics Good please stay that way",
    "111": "@celtics Give him my hamstring",
    "112": "#NEBHInjuryReport update: Jaylen Brown is going through pregame testing on his hamstring \"with the intent to play,\" according to Coach Udoka. He's responded well to his minutes increasing and has felt no setbacks.\nhttps://t.co/qCsLvM9dsY",
    "113": "@ThisWayArt @BasketB0t @celtics Who would you like to trade him for",
    "114": "And now checking in for the Boston Celtics, number 11, Enes Freedom!",
    "115": "@celtics Might want to send @jaytatum0 the definition of WE",
    "116": "@celtics lmao, like the last game loss?",
    "117": "@BasketB0t @ThisWayArt @celtics That system will never work with Brown and Tatum. The best move is to build like the late 00’s C’s or late 10’s Warriors. Keep both of them and get a lead playmaker and third scorer. The Jay’s spot up shooting ability allows for this to be possible.",
    "118": "@celtics I've got an idea.\nHear me out.\n\nscore.. more points than the opponent.\nThat is it. Just score more points than the other team and you win the game.\nOptionally, you could try to play actual defense and stop turning the ball over?",
    "119": "@CelticsDirect @playmaker I wish the @celtics would FREE him from the team.",
    "120": "@celtics Maybe try and make some shots early on and don’t fall behind?",
    "121": "@NBA_NewYork @EnesKanter @Jumpman23 @Nike @KingJames @celtics How many black causes did the 100 million go to or was it just for tax purposes",
    "122": "TODAY’S #NBA #MarketMover from @Nicole_luvsabet is the Boston Celtics H2H v Toronto Raptors @tabcomau #RadioTAB @tabcomaumedia",
    "123": "@NBA_NewYork @EnesKanter @Jumpman23 @Nike @KingJames @celtics Kanter is right cheap labor from China. Jordan's at one time were made in the United States. The price difference should go to the people. You don't have to be black to speak about it.",
    "124": "Boston Celtics center Enes Kanter will celebrate his U.S. citizenship by is changing his name to “Enes Kanter Freedom.”  https://t.co/SoJQtlp5Xg",
    "125": "Get NBA FREE access for a Limited Time\n● Live Broadcast Here ►►  https://t.co/2ZUnsqlNIz\n\nLos Angeles Clippers vs Golden State Warriors\nIndiana Pacers vs Milwaukee Bucks\nToronto Raptors vs Boston Celtics\nMemphis Grizzlies vs Sacramento Kings\nNBA LIVE STREAM",
    "126": "@celtics Loss",
    "127": "@celtics at least boston has the patriots being good again bc y'all are disgusting",
    "128": "@celtics Celtics have made a breakthrough on how to play the game of basketball",
    "129": "@celtics Sure thing, social media person. https://t.co/FdwYPVdPeY",
    "130": "Recent B/R article highlights 3 trade targets for Boston Celtics to add playmaking, scoring https://t.co/jGPJTs58uo",
    "131": "@celtics Grant Williams",
    "132": "@celtics No we won’t",
    "133": "@celtics Poverty franchise",
    "134": "@celtics Don’t disappoint me and win like Patriots!",
    "135": "@celtics Pls win",
    "136": "@CrookedFeuer @TheGussReport @Pacers @KingJames @Lakers @NBA @nyknicks @celtics @sixers The idea that courtside doesn't involve conduct restrictions is pretty funny.",
    "137": "Boston Celtics center @EnesKanter is changing his name to “Enes Kanter Freedom” to celebrate becoming a United States citizen. #NBA  https://t.co/rx4qB7xyYZ",
    "138": "@EnergySports12 @ThisWayArt @celtics not in a system the predicates ball movement.",
    "139": "#Basketball,\n\n#NBA, #NBATwitter,\n\n#GOCeltics, #Celtics, #BleedGreen, #CelticsWin, #BostonCeltics, vs. #RTZ, #WeTheNorth, #TorontoRaptors, #Raptors, Get your best odds - fast at https://t.co/Ohl03KWAVe https://t.co/4v3bpXa1hu",
    "140": "NBA🏀\n\nToronto Raptors - Boston Celtics\n\nJayson Tatum O7.5 rebounds - 1U @ 20/23",
    "141": "@celtics vs @Raptors predictions\n\nPrediction: @Raptors -1 (-110)\n\nPrediction: Over 209 (-110)\n\nBest bet: @Raptors 1H Team Total Over 50.5 (-125)",
    "142": "@StevenDrolet @inspiredlife7 @delaun1984 @Gary_Aka_Mac @NBA_NewYork @EnesKanter @Jumpman23 @Nike @KingJames @celtics Dude literally everything at walmart is made in china, no one in america cares.",
    "143": "Recent B/R article highlights 3 trade targets for Boston Celtics to add playmaking, scoring https://t.co/08fn4t3tCS",
    "144": "@StevenDrolet @inspiredlife7 @delaun1984 @Gary_Aka_Mac @NBA_NewYork @EnesKanter @Jumpman23 @Nike @KingJames @celtics Wrong again. You have no idea how sports business works. It is all about advertising dollars from broadcasting, selling merchandise, gate fees and concession stand revenues.",
    "145": "@StevenDrolet @inspiredlife7 @delaun1984 @Gary_Aka_Mac @NBA_NewYork @EnesKanter @Jumpman23 @Nike @KingJames @celtics you have no idea what you are talking about. Players sign contracts and are paid from revenue made by teams and the league from all sources.",
    "146": "boston celtics https://t.co/CYDwWgx6IM",
    "147": "@StevenDrolet @inspiredlife7 @delaun1984 @Gary_Aka_Mac @NBA_NewYork @EnesKanter @Jumpman23 @Nike @KingJames @celtics The NBA plays games in China, has a tv deal with Chinese tv stations. How do you not know this? \n\nhttps://t.co/CwncLGZjZ9",
    "148": "Tag a @celtics fan that NEEDS this vintage ringer tee 👇 @ Mammoth Lakes, California https://t.co/e7ck6Hip54",
    "149": "@StevenDrolet @inspiredlife7 @delaun1984 @Gary_Aka_Mac @NBA_NewYork @EnesKanter @Jumpman23 @Nike @KingJames @celtics Lebron also partners with Nike, he doesn't tell nike where to make sneakers so there is no difference. Kanter is just clueless and no one takes him seriously. He just tweets from the comfort of the u.s.",
    "150": "Boston Celtics center Enes Kanter is changing his name to “Enes Kanter Freedom” to celebrate becoming a United States citizen.\n\nThe native of Turkey has been outspoken in his criticism of the Turkish government:\nhttps://t.co/Ztin7xZ4vO",
    "151": "Boston Celtics Burger Enes Kanter Changing Name To Enes Kanter Freedom https://t.co/o65vD8yt45",
    "152": "Enes Kanter of Boston Celtics is most outspoken #NBA player on #China human rights abuses. Kanter on other celebrities: \"They should know one thing: It should be morals and principles over money.\"\n\nBe like Enes Kanter.\n\nhttps://t.co/7sEdMdBtwp",
    "153": "Juwan @juwanmorgan making his presence felt w @celtics affiliate 12pts 10rebs (4-6 from 3) last night @IndianaMBB #NBAVET #Edge ✊🏼 https://t.co/mbxecBQxBe",
    "154": "VIVIDESIGN Group -  Boston Celtics Stars Getting Something New—Tough Talk From Ime Udoka https://t.co/XQ3hX8OB9X  - Call 270-723-3650 https://t.co/fonXCG7eX7",
    "155": "@IvSolly @RussRingSeason @AIexxx0 THT was in a groove.\n3 consecutive games of 17, 28, &amp; 25 points then abrupt halt because Lebron James returned and THE VETS WANTED CREDIT FOR BEATING THE BOSTON CELTICS. All momentum distroyed, just play defense now.",
    "156": "@elLobo020 @castrofy26 @betikaKe Fear Boston Celtics",
    "157": "@Sportsnet @Raptors @celtics Prediction:\nTATUM ≪ BARNES https://t.co/XnbxSS0FmZ",
    "158": "Boston Celtics center Enes Kanter is changing his last name to Freedom. The Turkish-born NBA journeyman is set to become a United States citizen this week. https://t.co/Z3oePx8BfG",
    "159": "@Raptors against the @celtics at Scotiabank Arena!!! 🏀\n#RapsOnSN https://t.co/AOgrKrP4X0",
    "160": "@ayeayeaye3x @BoyNature100 @One_Rad_Cat @NBA_NewYork @EnesKanter @Jumpman23 @Nike @KingJames @celtics enes is just looking for attention. Tell me what he has done besides tweeting. He is a fool who has no idea what he is talking about. athletes are not politicians and many are not informed to be in that space.",
    "161": "@BRM508 @celtics Cope you little bitch. 😂 https://t.co/CTZVzHh1Bb",
    "162": "Boston Celtics' Enes Kanter to change last name to Freedom - via @ESPN App https://t.co/eQoLR8YmHO",
    "163": "@celtics Happy Hanukkah!",
    "164": "Boston Celtics center Enes Kanter is changing his name to “Enes Kanter Freedom” to celebrate becoming a United States citizen. @kslsports\n\nhttps://t.co/DMUx0DigPr",
    "165": "@Sportsnet @Raptors @celtics I rather have gold than a crusty red raptor foot",
    "166": "Boston Celtics at Toronto Raptors  Game #21   11/28/21 https://t.co/cQnB9HEg5B https://t.co/S6Iyl1iM9F",
    "167": "@celtics @Raptors @NBCSBoston @1057WROR Can't wait to be hurt again",
    "168": "Boston Celtics centre Enes Kanter is changing his name to 'Enes Kanter Freedom' to celebrate becoming a United States citizen.   https://t.co/JZ5302TbOA",
    "169": "The @Raptors welcome the @celtics to town as they go head-to-head for the third time already this season. 🏠 \n\nReply with your score predictions for the game! #RapsOnSN https://t.co/NkZIPraj9m",
    "170": "@CTVNews “Boston Celtics centre Enes Kanter is changing his name to \"Enes Kanter Freedom\" to celebrate becoming a United States citizen.”",
    "171": "“Boston Celtics centre Enes Kanter is changing his name to \"Enes Kanter Freedom\" to celebrate becoming a United States citizen.” #CCP #China #BoycottBeijingOlympics #UyghurGenocide #FreeTibet https://t.co/wEiEtRIm2t",
    "172": "Boston Celtics center Enes Kanter will celebrate his U.S. citizenship by is changing his name to “Enes Kanter Freedom.”  https://t.co/s4qlAfIJvF",
    "173": "Boston Celtics Daily Links  11/28/21 https://t.co/HJc6ccneVV https://t.co/MKXW0gNvNA",
    "174": "I wonder how the Boston celtics are doing this season? https://t.co/7zPKjGEe03",
    "175": "[Charania] Boston Celtics center Enes Kanter is legally changing his name to Enes Kanter Freedom, @TheAthletic @Stadium learned. Kanter will be his middle name, Freedom is his new last name. He becomes a U.S. citizen on Monday. https://t.co/YKb7wSXlQc",
    "176": "I'm gonna ask the Celtics if they plan on getting hype a Fck soon lol cc: @Celtics\nHuh\nDo\nYou\nHaha",
    "177": "@celtics @Raptors @NBCSBoston @1057WROR Wouldn’t take this team seriously until we make some trades. Why did they let Brad  Stevens give all the money away to Smart and Rob?",
    "178": "@celtics and a Hakuna Matata to you as well!",
    "179": "“The Boston Celtics have traded Freedom for cash considerations” story by @wojespn https://t.co/Tfv2dVQuOb",
    "180": "The ◎ Wolf Pack 🐺 brings you #WolfDrop 🚀🚀🚀\n\nThe NBA 🏀🏀🏀 season is heating up 🔥🔥🔥 and WolfSquad is loving every minute 🐺\n\nCan you guess their favourite teams? 😉\n\n#NFT #NFTs #SolanaNFTs #cryptoart #NFTCommunity #nftcollectors #NBA\n#GSW #ChicagoBulls #BostonCeltics #SOL https://t.co/xRms6I01QV",
    "181": "BOSTON (AP) — Boston Celtics center Enes Kanter is changing his name to “Enes Kanter Freedom” to celebrate becoming a United States citizen. https://t.co/PgXRAarkGe",
    "182": "@ItsMe_Chauntice @celtics When each one is hot, they pour fire on the other. Jaylens the much more efficient player and has been for a while, so its tatum stomping his fires more than the other way around. Jaylen averaged 2 shots in the 4th and overtime before he got hurt n tatum took 10 inefficiently",
    "183": "@celtics Thank you!",
    "184": "@thewillofb @soni_maxx @chicagobulls @SamSmithHoops The Boston Celtics went from a sub 500 team in 2007 to a championship in 08 with whole different team, it can happen ,but the Bulls won't spend the money to do it.",
    "185": "@celtics thank u 🥶",
    "186": "@celtics Thank u:)",
    "187": "@celtics A win would be nice to celebrate haha 😀",
    "188": "Happy #Hanukkah  to all our fans celebrating 🕯 https://t.co/td8BOZAEj4",
    "189": "@ItsMe_Chauntice @celtics Tatum likes to have the ball and iso. Lead the league in shot attempts most this season. This is why they don't pass to each other. Took 30 shots on a night jaylen had 46 and coulda had 50 or 60. Jaylen doesn't regress when tatums on the floor, he just doesn't get the ball",
    "190": "Former @utahjazz and current @celtics center @EnesKanter is changing his name to “Enes Kanter Freedom” to celebrate becoming a United States citizen.\n\n#TakeNote #NBA \n\nhttps://t.co/IYSUBWIqU2",
    "191": "Back BOSTON CELTICS to BEAT Toronto Raptors tonight in the @NBA (Game Starts at 23.10 GMT) #NBA #Basketball",
    "192": "Boston #Celtics center @EnesKanter is reportedly changing his name to Enes Kanter Freedom.\n\nKanter will become his middle name, while Freedom will be his surname.\n\nKanter is set to become a U.S Citizen on Monday.\n\n(via @ShamsCharania)\n\n#BleedGreen  | #NBATwitter https://t.co/gGgkM62OLw",
    "193": "Boston Celtics center Enes Kanter is changing his last name to Freedom, The Athletic reported Sunday. https://t.co/xgPnVvBqCu",
    "194": "Wish, I, could, say, the, same. @celtics https://t.co/S2ubRxCV9b",
    "195": "@Super70sSports @johnnysfgiants And the Boston Celtics used to play 5 home games at the Hartford Civic Center.",
    "196": "Boston Celtics logo but it better incorporates the colors from various flags of Ireland: https://t.co/bANS1szlIl",
    "197": "Source: Boston Celtics' Enes Kanter to change last name to Freedom - via @ESPN App https://t.co/BOjOALMtNE",
    "198": "This is what migrating to the United States and appreciating its freedoms look like: \n\n“Source: Boston Celtics' Enes Kanter to change last name to Freedom” \n\nCC: ⁦@JackPosobiec⁩  https://t.co/rrQHhCvyKR",
    "199": "@celtics @Raptors @NBCSBoston @1057WROR We got this.I believe in this https://t.co/y17QtfNdHB mg is https://t.co/cPbW6kFlQm’s easy and right to blame the coach but that is Bec he is young.he will understand sooner or later to work with this team.we will become a unstoppable team",
    "200": "@KySportsRadio  @DrewFranklinKSR @ryanlemond @MrsTylerKSR Boston Celtics center Enes Kanter is changing his name to Enes Kanter Freedom, a source confirmed to ESPN. #BBN",
    "201": "@NHLBruins @tdgarden @GEICO It would be great if you and the @celtics would stop playing at the same time and even better to stop losing at the same time",
    "202": "Source: Boston Celtics' Enes Kanter to change last name to Freedom - via @ESPN App —that’s nice!  https://t.co/YVSzpCsD7j",
    "203": "Source: Boston Celtics' Enes Kanter to change last name to Freedom - via @ESPN App https://t.co/nodqaFetQe",
    "204": "NBA Boston Celtics Stagger Set Play by Chris Filios | Basketball Plays, Basketball Set Plays, Quick Hitters Basketball Plays\nhttps://t.co/IPzhg2HQPG",
    "205": "Source: Boston Celtics' Enes Kanter to change last name to Freedom - via @ESPN App https://t.co/sJVWcwArFt",
    "206": "@celtics @CullerSports Can u please follow me back",
    "207": "Boston Celtics Stars Getting Something New—Tough Talk From Ime Udoka https://t.co/ToYQwk3xgG https://t.co/4suZ5DGoDg",
    "208": "@FatherDomenic @pistol3peat @LarryBirdBurne1 @RealBillRussell @jaytatum0 @celtics @NBA People don't hate the past. People hate their own past.",
    "209": "Boston Celtics center @EnesKanter is changing his name to Enes Kanter Freedom and becoming a U.S. citizen tomorrow.\n\nCongratulations Enes, glad to call you a compatriot.",
    "210": "@EnesKanter the differences between @celtics and @Lakers @KingJames are culturally significant. This Turkish Freedom Fighter’s voice stands out because there significantly less of them in which he can hide. He stands in front of a tank whereas you have a corporate brand worth $$$",
    "211": "@CELTICSvsEvery1 @celtics We really need it",
    "212": "Boston Celtics Stars Getting Something New—Tough Talk From Ime Udoka https://t.co/6ZNoieeGtg https://t.co/9jEryXQi4W",
    "213": "Boston Celtics Burger Enes Kanter Changing Name To Enes Kanter Freedom - https://t.co/1U1hl4TXgF https://t.co/MpJ0vZUlf8",
    "214": "@kennyboy_117 Boston Celtics and woke ass people joining still a better love story than twilight",
    "215": "Awesome story: Boston Celtics center Enes Kanter changes last name to “Freedom” ahead of becoming a US citizen.  https://t.co/bXGA04Uq8E",
    "216": "@NBATurkiye @celtics @Lakers @chicagobulls @warriors 1979-1989 lakers",
    "217": "@TDChannel1 the @MapleLeafs will try to go for their 7th straight win tonight against the @AnaheimDucks…puck drop is 8PM\n\nThe @Raptors try to get back into the win column when they begin their next homestand tonight against the @celtics.  Tip off is set for 6PM\n\n#TDCPressBox https://t.co/v4LyNYVB5w",
    "218": "Release enes freedom @celtics",
    "219": "Boston Celtics big man Enes Kanter is reportedly changing his legal name to \"Enes Kanter Freedom\" as he becomes a U.S. citizen. https://t.co/jQfbre1Oww",
    "220": "@ThisWayArt @BasketB0t @celtics He ranked in the 90+ percentile amongst spot up shooters last year. Dude shoots 49-39-75 so he has a right to be a bit selfish and shoot the ball since he literally shoots better than the team does.",
    "221": "Boston Celtics/Toronto Raptors O209 @ -110.\n\n#TailTrout\n#NBA\n#BOSvsTOR\n#GamblingTwitter \n#SportsBetting",
    "222": "@ThisWayArt @BasketB0t @celtics He legit is. Same DBPM while guarding opponents second best player.",
    "223": "@Buffett13 @celtics Just dont go to the game if you worried. Live your life and let others live theres. If you want to wear one go for it. No ones gotten covid at a bruins or celtics game. So stop bitching on twitter about masks",
    "224": "What are the @sixers without Embiid and Ben Simmons?\nAnswer: the Boston Celtics @celtics ☘️ 😂 @NBA",
    "225": "@NBATurkiye @celtics @Lakers @chicagobulls @warriors 2010-2014 Heat",
    "226": "@NBATurkiye @celtics @Lakers @chicagobulls @warriors 95-bullls",
    "227": "Boston Celtics center Nathan Salas is legally changing his name to Nathan Salas Freedom, @TheAthletic @NNatethan @Stadium learned. Salas will be his middle name, Freedom is his new last name. He becomes a U.S. citizen on Monday.",
    "228": "@alancornett @C_SamBurnham Boston Celtics, Fighting Irish, etc. All great mascots",
    "229": "Corporate courage...\n\nTo do what’s right!\n\nKeep doing what ur doing @EnesKanter @celtics @atptour @WTA @PatrickMcEnroe &amp; those others who fight 4 freedom!\n\nCapitalism can co-exist. Rewards will come...\n\n#whereispengshuai\n#HumanRights \n#China https://t.co/6TiwV8YCNC",
    "230": "@bighurtrocks @EnesKanter @DonaldJTrumpJr @bennyjohnson @celtics @NBAonTNT I can't think of anything China or Erdogan will hate more than knowing the burr in their saddle will be trolling them every time any person in China or Turkey sees a pic of the back of his jersey...\n\nCongrats, #EnesKanterFreedom, &amp; thanks.",
    "231": "@RealTalk900 Red Auerbach an “The Boston Celtics” -&gt; 1950s!",
    "232": "NBA Betting Preview: Boston Celtics vs. Toronto Raptors https://t.co/6k2Js97FGP",
    "233": "Boston Celtics Stars Getting Something New—Tough Talk From Ime Udoka https://t.co/rSTthXjI7z",
    "234": "Throwback card series @jaytatum0 @T_HardJR @ACFresh21 @Dame_Lillard @ESPNNBA @BleacherReport @BR_NBA @dallasmavs @celtics @NoDunksInc #poppingpacks https://t.co/4LskZb60EG https://t.co/iFwYmMEFOj",
    "235": "@celtics Let's hope because after 20 games were looking pretty stiff",
    "236": "[Forwarded from Benny Johnson]\n[ Photo ]\nBREAKING: Enes Kanter of the Boston Celtics is legally changing his name to “Enes Kanter Freedom” when becomes a U.S. citizen on Monday. https://t.co/pXW6xZu5xx",
    "237": "Please get him off my team. @celtics @BCCoachStevens https://t.co/fAzZAumRz9",
    "238": "BREAKING: Enes Kanter of the Boston Celtics will be legally changing his name to “Enes Kanter Freedom” when becomes a U.S. citizen on Monday. 🇺🇸 https://t.co/ovTHiRXQjj",
    "239": "Shams: Boston Celtics center Enes Kanter to change last name to ‘Freedom’ https://t.co/OlM9mZLJ0O",
    "240": "Tonight! The @celtics take on the #raptors at 6pm. #BleedGreen https://t.co/sSIYFhRU5V",
    "241": "@celtics @Raptors @NBCSBoston @1057WROR Not watching‼️",
    "242": "@celtics @Raptors @NBCSBoston @1057WROR Schroder and Williams out. Love Williams but what a liability if we make the playoffs.",
    "243": "RAPTORS GAME PREVIEW\n\n🏀: @celtics vs. @Raptors \n📺: Sportsnet One\n🕖: 6 PM/ET\n\nhttps://t.co/yRjXVs5ArD",
    "244": "Boston Celtics Burger Enes Kanter Changing Name To Enes Kanter Freedom https://t.co/obRbQ0pBLV",
    "245": "[Charania] Boston Celtics center Enes Kanter is legally changing his name to Enes Kanter Freedom, TheAthletic Stadium learned. Kanter will be his middle name, Freedom is his new last name. He becomes a U.S. citizen on Monday.",
    "246": "@0fficial_Tog @celtics @Raptors @NBCSBoston @1057WROR I care.\nSpeak for yourself when referring to \"nobody\" because that's who you are :)",
    "247": "@TheCelticsTake @celtics @Raptors @NBCSBoston @1057WROR Don't care. Celtics are playing in 5 hours",
    "248": "@jbgeosat @celtics Absolutely agree 💯. Not sure Brad is the answer either. I guess time will tell.",
    "249": "@connerburks Just an FYI Ariel said Celtic right the first time and you guys corrected him to the wrong way 🤣. The football team Celtic is said the same way as Boston Celtics. Hope your bets went well",
    "250": "please for the love of god cut this man @celtics https://t.co/wZLlRrmlr9",
    "251": "Shams: Boston Celtics center Enes Kanter to change last name to ‘Freedom’ https://t.co/8B9Basmo5f",
    "252": "@celtics @Raptors @NBCSBoston @1057WROR Loss",
    "253": "“It was announced earlier this week that Kanter had passed his citizenship test, and will officially become a citizen of the USA on Monday, but today news came that that wouldn’t be the only change for the Boston Celtics center.”\n\n#RipCity https://t.co/ybdHZLeGGU",
    "254": "@bighurtrocks @EnesKanter @DonaldJTrumpJr @bennyjohnson @celtics @NBAonTNT Tell em come to PA he can enjoy our “right to work” tax…🤦🏾‍♂️",
    "255": "@JumpshotPapi @EnesKanter @DonaldJTrumpJr @bennyjohnson @celtics @NBAonTNT Just a freedom illusion over here",
    "256": "Freeze early Sunday\n3U Patriots/Titans U44 -120\n2U Texans ML 1H -145\n1.5U LA Rams -130\n1.5U Lightning/Wild U5.5 -110\n1U Boston Celtics -105\n1.5U James Madison/FAU U145.5 -110\n@Thetruth243",
    "257": "Boston Celtics Stars Getting Something New—Tough Talk From Ime Udoka https://t.co/WnEzf3r7nF https://t.co/Som2Le1QB7",
    "258": "Analyzing Sunday’s Boston Celtics at Toronto Raptors odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/OraoR4BZuC",
    "259": "@jesusdersupajew Boston Celtics center Enes Kanter reportedly is the first NBA player in history to take his entire 2021 salary in Reddit Karma",
    "260": "Lets get a win today @celtics ☘️",
    "261": "@celtics @Raptors @NBCSBoston @1057WROR Focus on our D first, thats our strong point",
    "262": "@celtics @Raptors @NBCSBoston @1057WROR Ya no thanks, who wants to watch a heartless, shit team.",
    "263": "@celtics @Raptors @NBCSBoston @1057WROR Are we looking at another pathetic effort??",
    "264": "@celtics @Raptors @NBCSBoston @1057WROR Football is on nobody cares",
    "265": "@celtics @Raptors @NBCSBoston @1057WROR Loss",
    "266": "@celtics @Raptors @NBCSBoston @1057WROR Pain",
    "267": "@celtics @Raptors @NBCSBoston @1057WROR Enes Kanter Freedom about to go off!!",
    "268": "@OGIsBetta @celtics @Raptors @NBCSBoston @1057WROR Most likely",
    "269": "Boston Celtics Burger Enes Kanter Changing Name To Enes Kanter Freedom, NBA Twitter Reacts https://t.co/K5lxbBzRsu Photo: Getty #breaking https://t.co/nigE79quNM",
    "270": "@bighurtrocks @EnesKanter @DonaldJTrumpJr @bennyjohnson @celtics @NBAonTNT Son became American to find out we aint really all that free 😂😂",
    "271": "🚨 JUST IN 🚨\n\nBoston Celtics center Enes Kanter is legally changing his name to Enes Kanter Freedom. Kanter will be his middle name, Freedom is his new last name.\n\n(via Shams Charania)\n\n#eneskanter #bostonceltics #nba https://t.co/IBQBRpes8j",
    "272": "@OGIsBetta @celtics @Raptors @NBCSBoston @1057WROR Probably",
    "273": "Per @ShamsCharania, Boston Celtics center Enes Kanter is legally changing his name to Enes Kanter Freedom. Kanter will become his middle name and Freedom is his new last name. He becomes a U.S. citizen on Monday.\n\nThis is his new jersey 🏀 https://t.co/j5t78zYx1S",
    "274": "\"The Boston Celtics have parted ways with Freedom\".\n\n\"The Boston Celtics are in talks to trade Freedom for Love\".\n\n\"The Boston Celtics have traded Freedom for cash considerations\".\n\nAnyway, every center for the past 10 years has said that when being defended by him. #NBA #OTnba https://t.co/CFYS560qt7",
    "275": "Boston Celtics’ Enes Kanter changing name to Enes Freedom https://t.co/BuRlqXU8cv #NBA #BostonCeltics",
    "276": "@HonestLarry1 Rondo was a great Boston Celtic Guard. One of his best plays.\nRondo was the Point Guard of the ‘2008 World Champion Boston Celtics’ 🏀\nWhen will the next Boston Celtic World Championship be??",
    "277": "@tmmip @celtics I’m saying",
    "278": "@OGIsBetta @celtics @Raptors @NBCSBoston @1057WROR true sadly, but even sadder is tatum dropping 40 on you.",
    "279": "Boston Celtics’ Enes Kanter changing name to Enes Freedom https://t.co/xHUaxxSGh1",
    "280": "Boston Celtics’ Enes Kanter changing name to Enes Freedom https://t.co/MNNqTJeTjY",
    "281": "@celtics @Raptors @NBCSBoston @1057WROR Lose?",
    "282": "@celtics @Raptors @NBCSBoston @1057WROR Lets go green @celtics 🤙✌",
    "283": "@oreoviamilk @celtics @Raptors @NBCSBoston @1057WROR No cap lol",
    "284": "@celtics @Raptors @NBCSBoston @1057WROR I swear man don’t even think about catching that L, yall be depressing me with this .500 business!!!!",
    "285": "@celtics @Raptors @NBCSBoston @1057WROR please win I want chet",
    "286": "@celtics @Raptors @NBCSBoston @1057WROR Trade Tatum trade brown do me a favor and tank for the next 5-10 years. I’m over it.",
    "287": "@celtics @Raptors @NBCSBoston @1057WROR whatever",
    "288": "@celtics @Raptors @NBCSBoston @1057WROR A loss to Brooklyn moved us from 6th to 10th. Where will we be tomorrow?",
    "289": "@celtics @Raptors @NBCSBoston @1057WROR Time to win",
    "290": "@celtics @Raptors @NBCSBoston @1057WROR Please win",
    "291": "@celtics @Raptors @NBCSBoston @1057WROR Oh boy another Celtics game, can’t wait",
    "292": "@celtics @Raptors @NBCSBoston @1057WROR Please win fam",
    "293": "TONIGHT ☘️ Celtics at @Raptors\n\n⏰ 6:00PM\n📺 @NBCSBoston \n🎙 @1057WROR \n\n#BleedGreen https://t.co/riFek6peZE",
    "294": "PSA: I officially announce the #BostonCeltics no longer my favorite team. No longer my #1. After putting up with so much fuckery over the past 3 to 4 years as a life long fan. I mentally can’t take it anymore. Enes Kanter was the push I needed. \n\nI am officially a #MiamiHeat fan",
    "295": "@BruinsWyan @tdgarden @NHLBruins @celtics I don't remember the right to see the Bruins play being written anywhere in the Constitution",
    "296": "Report: Celtics' Enes Kanter changing name to Enes Freedom #EnesKanter #NBA\n #celtics #BostonCeltics  https://t.co/26JPr44lCt",
    "297": "@celtics @tpinsonn get this man on the roster https://t.co/7Z0F0xE3A7",
    "298": "@celtics @Vistaprint Attention @GentileBrewing",
    "299": "Please release this man @celtics https://t.co/pQp51C3UyP",
    "300": "@BostonGoat1 @StoolGreenie @chicagobulls @sixers @celtics Time will tell",
    "301": "I want to photograph a @celtics game at least onceeee",
    "302": "Boston Celtics vs Toronto Raptors 11/28/2021 Picks Predictions Previews\n\nhttps://t.co/u5Fx3lVAgs\n\n#NBAprediction #NBA #NBApicks #NBAparlay #NBAbetting #handicapper #sportspicks #odds #picks #basketballpicks #freepick #freepicks #expertpicks #sportsbetting #Celtics #Raptors https://t.co/AomdVp3Jz5",
    "303": "Boston Celtics center Enes Kanter is legally changing his name to Enes Kanter Trey, @TheAthletic @Stadium learned. Kanter will be his middle name, Trey is his new last name. He becomes a U.S. citizen on Monday.",
    "304": "FREEDOM WAS BENCHED BY BOSTON CELTICS https://t.co/PdON3pcynj",
    "305": "Boston Celtics fan BVagmi is legally changing his name to BVirgin, @TheAthletic @Stadium learned. B will be his middle name, Virgin is his new last name. He becomes a registered sex offender on Monday.",
    "306": "How many chuds are going to buy the Boston Celtics Freedom jersey lol https://t.co/hoqJcJk21c",
    "307": "Who wins tonight - @celtics or @Raptors ?  #Celtics #Raptors #NBA",
    "308": "The CIA has the Boston Celtics in a crippler crossface, poverty franchise, rest of the East clears",
    "309": "Boston Celtics fan and future GM Ayden Franco is legally changing his name to Ayden Franco Kanter, @TheAthletic @Stadium learned. Franco will be his middle name, Kanter is his new last name.",
    "310": "@JDaniel2033 Danny Ainge was a star with the Boston Celtics winning 2 NBA Finals",
    "311": "Boston Celtics “Freedom” jersey sales are gonna rival the GDP of dozens of developing countries https://t.co/vpDxUTiuIh",
    "312": "Top #NBA play today: Boston Celtics 1.0 (6.6 value)\n\nLike = tailing",
    "313": "@celtics @Vistaprint ordering my enes freedom jersey today",
    "314": "@celtics @Vistaprint I THINK I SPEAK FOR EVERY REAL CELTICS FAN WHEN I SAY PLEASE TRADE TATUM",
    "315": "@celtics @Vistaprint please release enes freedom",
    "316": "@celtics @Vistaprint Can I get Freedom #13 thank you 🙏",
    "317": "@celtics @Vistaprint Give Kanter his Freedom and release him",
    "318": "On my knees at this point. Please cut this dweeb @celtics https://t.co/esLSVOHoyx",
    "319": "Celtics and @Vistaprint are giving back to celebrate small businesses. If you own or work for a small business with 1-50 staff members, enter to win a complimentary suite night and personalized Celtics jersey for your company to enjoy.\n\nEnter to win: https://t.co/64ExD9Zona https://t.co/7pO54tggeS",
    "320": "Congratulations to Boston Celtics forward @eneskanter on becoming a U.S. citizen. Kanter is the essence of America, and in Boston, a cradle of our republic, he reminds us all that individual freedom is a primary value.\n\nHis name is now Enes Kanter Freedom. https://t.co/sLDyOr032l",
    "321": "BREAKING: @EnesKanter of the Boston Celtics is legally changing his name to “Enes Kanter Freedom” when becomes a U.S. citizen on Monday. https://t.co/q8ECMwGGlL",
    "322": "This is so awesome to hear...even though he's a @celtics player ... From a @Lakers fan, congrats @EnesKanter! https://t.co/VrNTO0c43z",
    "323": "Boston Celtics center Enes Kanter is legally changing his name to Enes Kanter Freedom, per @ShamsCharania. https://t.co/dIdaSegBPn",
    "324": "Boston #Celtics C Enes Kanter is legally changing his name Enes Kanter Freedom and he becomes a US citizen on Monday per the Athletic. #NBA https://t.co/NQzY0PIv4q",
    "325": "Manchester United, New England Patriots, Boston Celtics, Boston Bruins all play today. Good Sunday !!!",
    "326": "Bradley Beal traded to the @celtics",
    "327": "Please cut Kanter i'm sick of the shenanigans @celtics",
    "328": "@bverrastro_10 @celtics Was really hoping it would be Penes Kanter but alas",
    "329": "Boston Celtics' Enes Freedom",
    "330": "Boston Celtics center @EnesKanter is legally changing his name to Enes Kanter Freedom.\n\nKanter is set to become a U.S. citizen on Monday.\n\nSources tell @ShamsCharania: https://t.co/jGqpeNmKgm https://t.co/E76IU0M8pE",
    "331": "@Jonatha10782939 @celtics Goodbye",
    "332": "@celtics release this nigga https://t.co/2q8jsnDNPy",
    "333": "DasHaus made a bet!\n\nEvent: Boston Celtics vs Toronto Raptors #NBA\nBet: Toronto Raptors TO WIN -2\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "334": "I’m begging you to cut this man @celtics https://t.co/HVcW6t5swv",
    "335": "DasHaus made a bet!\n\nEvent: Boston Celtics vs Toronto Raptors #NBA\nBet: Boston Celtics TO WIN +2\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "336": "Please cut this nigga @celtics https://t.co/5psscFu9Na",
    "337": "Release him @celtics https://t.co/1iwkBrojHb",
    "338": "Boston Celtics center Enes Kanter is legally changing his name to Enes Kanter Freedom, @TheAthletic @Stadium learned. Kanter will be his middle name, Freedom is his new last name. He becomes a U.S. citizen on Monday.",
    "339": "Boston Celtics star Jayson Tatum thought the team fought hard, despite losing a late lead to the 5-13 San Antonio Spurs.  https://t.co/lj7ee9e7kk",
    "340": "NBA\nDET @ LAL Under 216 - BEST BET 🔨🔨🔨🔨🔨🔨🔨🔨\n\nBoston Celtics (+110)\n\n@Clappa12\n@StreakCoolers",
    "341": "@Dynhrn22 @isaiahthomas EXACTLY… we need him @celtics ..put Dennis as the 6th man..",
    "342": "Our Healthy Habits programs aims to support diabetes prevention and you can help too by voting for your favorite dunk tonight during the Boston Celtics game! 🏀🍀  Check @celtics to vote - each vote raises $1 for the Y’s program! #SunLifeDunk4Diabetes https://t.co/CI5o7Av3RZ https://t.co/ACVGCArcss",
    "343": "@celtics I need my Timelord 😔",
    "344": "@TheSinBinBreaks @HobbyConnector @sports_sell 2021 Boston Celtics Lot $25 OBO\n2021 Brooklyn Nets Lot $15 Shipped BMWT\n2021 Charlotte Hornets Lot $200 OBO\n2021 Chicago Bulls Lot $20 OBO https://t.co/mhZMA5KTTy",
    "345": "Ball’s (and puck’s) in your court/garden/park/stadium, @celtics @NHLBruins @RedSox @Patriots https://t.co/1P7G0gLXHV https://t.co/28ohfm6wdN",
    "346": "Well TV...looks like it's just you &amp; me today.\n\n@Patriots  @NHLBruins  @celtics \n#MacAttack10  #BlackAndGoldBaby!! #BostonCeltics https://t.co/wwRWdB55ix",
    "347": "NBA Day 4️⃣0️⃣ 🏀🏀🏀\nGolden State Warriors vs Los Angeles Clippers\nMilwaukee Bucks vs Indiana Pacers\nBoston Celtics vs Toronto Raptors\nSacramento Kings vs Memphis Grizzlies\nDetroit Tigers vs Los Angeles Lakers\n#NBA2022",
    "348": "November 28, 1990: The game between the Boston Celtics &amp; Atlanta Hawks is suspended with 10:30 left in the 2nd quarter (Boston leading 37-22) due to condensation on the Boston Garden floor.\n\nThe game would be completed on 12/23/90 (Celtics 132, Hawks 104). https://t.co/9zSaPP4jfS",
    "349": "Being a Boston Celtics fan from childhood and passionately hating LeBron from 2010-2017 and then becoming a LeBron stan is arguably the biggest plot twist of my life",
    "350": "Toronto Raptors vs Boston Celtics is on DAZN Schweiz [$] (geo/R). With commentary from Flo Pertsch.  For more details see https://t.co/UOiEcP08Hk #TorontoRaptors #BostonCeltics #DAZNSchweizgeoR",
    "351": "Toronto Raptors vs Boston Celtics is on DAZN Deutsch [$] (geo/R). With commentary from Flo Pertsch.  For more details see https://t.co/UOiEcP08Hk #TorontoRaptors #BostonCeltics #DAZNDeutschgeoR",
    "352": "Good Morning Raps fam! It's gameday #21! The Raptors are finally back home in Toronto to face the Boston Celtics tonight at 6pm ET on Sportsnet #WeTheNorth https://t.co/Hqo9c2O1Ym",
    "353": "@985TheSportsHub @celtics @1057WROR People still watch?",
    "354": "The Boston Celtics play basketball today #BleedGreen https://t.co/K6Wt07SqfF",
    "355": "@celtics Groundhog Day.",
    "356": "@celtics Take this to the bank from a real SUPER NATURAL SOUL BROTHER!  This guy is light, bright, and two thirds white!!!!!! What the heck does he really know about OUR THANKSGIVING CULTURE? ABSOLUTELY NOTHING! SAY IT AGAIN!!!!",
    "357": "Former Celtic Kemba Walker sells his Brookline mansion https://t.co/dF3sR4Ul1D #realestate #luxury #luxuryhomes @brooklineMA @NBA @nyknicks @celtics @okcthunder #basketball #tombrady https://t.co/BM4PPtENpQ",
    "358": "Former Celtic Kemba Walker sells his Brookline mansion https://t.co/3cVoixz7gp #realestate #luxury #luxuryhomes @brooklineMA @NBA @nyknicks @celtics @okcthunder #basketball #tombrady https://t.co/yLUsteBYSP",
    "359": "19:00 –⚽🇧🇷Campeonato Brasileiro\nInternacional x Santos\nPREMIERE\n\n19:15 – ⚽🇦🇷Campeonato Argentino\nArgentinos Juniors x Gimnasia LP\nSTAR+\n\n19:30 – ⚽🇺🇸MLS\nPhiladelphia Union x Nashville\nFOX SPORTS, WATCH ESPN e STAR+\n\n20:00 – 🏀NBA\nBoston Celtics x Toronto Raptors\nNBA LEAGUE PASS",
    "360": "@985TheSportsHub @celtics @1057WROR Here comes the L or maybe the win and they’re 1 game over 500 and the most overrated team in history. Break up this group.",
    "361": "I never expected that Devonte' Graham is leaving Jaylen Brown to join Luka Doncic on the Boston Celtics #BleedGreen https://t.co/gIs4hqbAlD",
    "362": "PLAY US AGAIN WITH MOBLEY, COWARDS. @BrooklynNets @Suns @warriors @celtics.",
    "363": "@soccer548 @celtics Never got what the fascination was with Ainge as a general manager.  He had the one good year when they won with Garnet then they spent the rest of the time always “rebuilding”. 🤯",
    "364": "@NBA_Indonesia The great Boston Celtics ☘️",
    "365": "Check out my Facebook comments regarding this article as well as my YouTube channel @celtics to see where my Playing Coaching model can get the W tonight for the World's greatest Basketball franchise @RealBobManning @BostonCelts4eva @BostonGlobe @CelticsNationCP @b_celticstweets",
    "366": "WATCH: Larry Bird and the Boston Celtics raise Banner 15 to the rafters https://t.co/H5km5UWsnE",
    "367": "TONIGHT: @Celtics vs #Raptors live from #Toronto on @1057wror https://t.co/6MhioJRvvM",
    "368": "@jbgeosat @celtics Danny Ainge!",
    "369": "Boston Celtics vs Toronto Raptors Prediction &amp; Match Preview - November 28th, 2021 | NBA Season 2021-22 https://t.co/aNzBfOTtPB",
    "370": "Just thinking what it would be like right now in Boston if the @celtics hadn’t passed on Giannis in the 2013 draft!  🤔 https://t.co/35FK7MoAsW",
    "371": "Lakers Game Preview: The Boston Celtics https://t.co/AqtqjKy0TG https://t.co/xf7KZa7YXC",
    "372": "wow. maine celtics better than the boston celtics now? hahahaha https://t.co/6xXbmf7rni",
    "373": "@FoxiMcNuggets It's to do with how my Basketball playing coaching model works he's able to work ahead of time what potentially MAY happen like with my passing system where if you have Enough time to work with you may choose a catch to shoot option @davehopla @celtics @corkcelts @RealBobManning",
    "374": "Boston Celtics at Toronto Raptors: Stream, lineups, injury reports and broadcast info (11/28) https://t.co/8XPDwICCHc",
    "375": "Want this for y’all @celtics https://t.co/aIPd6gdYEb",
    "376": "Boston Celtics @ Toronto Raptors\nPick : Boston Celtics.\nBasketball. NBA",
    "377": "Dennis Schröder is on fire this season with the Boston Celtics.",
    "378": "WATCH: What do the numbers tell us about the Boston Celtics so far this season? https://t.co/d7UdSI8ldo",
    "379": "Once again, the Jewish Jordan is a game changer. Every AD in the country should buy these nets. Also, @celtics and @tdgarden https://t.co/Uol16UzeRD",
    "380": "Boston Celtics play today \nRIP my mental health",
    "381": "Bumper Logue Down basketball 🏀 column out Monday. \nI chat to Boomers fan favourite @MatisseThybulle, @SydneyKings import and former @celtics RJ Hunter, plus pars on @Joeingles7, @joshgiddey, @JasonCadee5, @DuopReath, @illawarrahawks, @SEMelbPhoenix, @MelbUnitedHQ and more. https://t.co/yLXxrxe5Yx",
    "382": "Boston Celtics vs. Toronto Raptors- 11/28/2021 Free Pick &amp; NBA Betting Prediction https://t.co/ArMjs6u8e1\n.\n#Betting #FreePicks https://t.co/iB5FENhdYL",
    "383": "Boston Celtics beat LeBron James, LA Lakers, &amp; OKC Thunder, Houston Rockets preview teaser video https://t.co/mPCXBsDOA2",
    "384": "@AndrewDoucett18 @celtics Lol we already do, AND we could hit the side of a barn with the dam ball might as well be building a wall with all the bricks",
    "385": "How I Want The 2022 NBA FINALS To Look Like!!!!\n\nGames Won:\n\nPHOENIX SUNS: 4 ☑️\n\nBOSTON CELTICS: 0\n\nPHOENIX SUNS 2022 NBA FINALS CHAMPIONS!!!!",
    "386": "@AidanGLT @mukkamadboyzzzz @SunnyMon3y @celtics Brown too! Not just this season!",
    "387": "@Randomp00711062 @DickieNuggz @Burner06137507 @celtics How y’all go from the playoffs to the 12th seed 😭😭😭",
    "388": "@EnergySports12 @BasketB0t @celtics Jokes 🤣🤣🤣",
    "389": "@EnergySports12 @BasketB0t @celtics Brown is a selfish player and injury prone! Trade!",
    "390": "@celtics @jaytatum0 basketball is fun Jayson yup but you guys are there to get a championship dude I can't ok I'm tired of the team   not caring enough it's silly \nI'm done with this for  the season  now",
    "391": "@celtics I don't know how like this keeps happening do they just not care about wins as much as they should\nHave them watch Larry Bird Magic Johnson and Michael Jordan footage then they might care about stacking up more wins\n\nSomething",
    "392": "@celtics Be like listen we're a team with 17 banners be like yes basketball is fun it's very fun but we want a championship also",
    "393": "@celtics Tine to tell everyone step it up or you'll have to think about trades next season someone's gotta to get this team in a winning mind set they just coast along in some Games",
    "394": "@Randomp00711062 @DickieNuggz @Burner06137507 @celtics 1 year rental btw 😹😹😹",
    "395": "Boston Celtics star Jayson Tatum thought the team fought hard, despite losing a late lead to the 5-13 San Antonio Spurs.  https://t.co/Fcvjx2uDko",
    "396": "Lmao. I just love this entire concept. @celtics @RedSox @Patriots @NHLBruins please do this with @StopandShop https://t.co/ZPDUVqRZEj",
    "397": "@isaiahthomas @isaiahthomas EVERY @celtics fan wishes you were still wearing the green!",
    "398": "@celtics are gonna end the @Suns winning streak in a few weeks n then they’ll knock off the @warriors #banner18 #myprediction",
    "399": "@MRPETERPARKER @celtics Imagine hyping yourself and going to the court just to find out you’re gonna lose all day",
    "400": "@isaiahthomas For the record, I think the @celtics ought to do this, and give you some starting duties.  The city would mark out to it, too.",
    "401": "@jamaicanceltic @celtics Most people on here were crying for Brad to get gone. Careful wutcha wish for",
    "402": "Tonight @celtics vs @Raptors #WeTheNorth",
    "403": "And yall told us Ime was a good coach. This is what good coaching looks like. Mad at Brad Stevens and @celtics for doing us like this https://t.co/hs8rT114KW",
    "404": "Oh so they pulling out the Boston Celtics on opening night excuses??? Shame https://t.co/nT9smdrGg6",
    "405": "@isaiahthomas if you could join the @celtics again would you be happy or not? We need you back! #IT4",
    "406": "@isaiahthomas a special memory with boston celtics (a special game, special hoop etc)",
    "407": "Check out Bob Cousy Boston Celtics Framed 8x10 Jersey Photo MAN CAVE #Retweet #BostonCeltics https://t.co/4oAqAAigQT via @eBay",
    "408": "@2Rynz @celtics But JR is not... really",
    "409": "k  i'm gonna say it the @Bucks are the new @celtics until proven otherwise period (hopefully lucky will help us out this year and prove me wrong💚💚💚🍀🍀🍀😋😋😋#BleedGreen)",
    "410": "#NBA exec gets brutally honest about the Boston #Celtics being \"stuck,\" via @HoopAnalysisNet. \n\nhttps://t.co/OQgUHBv766",
    "411": "@isaiahthomas Other then Boston Celtics . What was your favorite NBA team you played for?",
    "412": "@celtics Tatum is straight 🚮 this season!",
    "413": "@JavierM79402766 @RalphRa54487298 @celtics There are a lot of black coaches in the league. Ime was picked because he was highly regarded as an assistant.",
    "414": "Hello, @celtics … y’all listen or what? Bring #IT4 back! #DoIT RT @balldontstop: Isaiah Thomas shouldn’t just be on an NBA roster. He should be the 6th man off a bench and providing a spark. \n\nMany teams are literally missing that extra 16 points and attack.",
    "415": "@isaiahthomas @celtics Really?????? Let’s goooooooi",
    "416": "@wlohaty @jaytatum0 @celtics This is fire",
    "417": "@dlcarpen140 @celtics He was an mvp in 78. His best days were behind him. If you’re looking for 6th man look to Frank Ramsey .  Others I remember how great Bob MAcadoo was fo Lakers as 6 man from around 82-85 or so.",
    "418": "@Hatz_of_the_CBF @celtics Best 6th man in league History. Went on to be a MVP.  Like I said hard decision",
    "419": "@dlcarpen140 @celtics I wouldn’t put Walton because he was only there three years. I remember what Walton was in the late 70’s before the wheels literally came off. In his youth he was a beautiful player to watch",
    "420": "@Hatz_of_the_CBF @celtics Bumped JoJo for Walton. I’m not saying this was easy.",
    "421": "@BasketB0t @celtics Just as good as Klay",
    "422": "@BrianTRobb I don’t know how u have listened to @cgasper &amp; @bigjimmurray talk @celtics all these years while remaining sane …. My god r they #sad",
    "423": "@dlcarpen140 @celtics No Jo Jo White?  Did I miss Dave Cowens somewhere?",
    "424": "Just for the record. @celtics https://t.co/cXaOFqraJf",
    "425": "@ThatGuySlimm @chicagobulls @MiamiHEAT Charlotte hornets or Boston Celtics. \nLFG!!!!!\n\n#NFTGiveaway",
    "426": "My Dad loved Joe’s game when he played for the @celtics 🔥 https://t.co/P6CGVWa6JF",
    "427": "\"KYRIE SUCKS\"\n\nhttps://t.co/zaV5Jg7VvZ\n\n[via r/bostonceltics Nov 28, 2019 #Celtics]",
    "428": "Yesterday this guy #bembry doing the damage against the @celtics in @NBA2K with big number’s….. today he’s doing big things against the red hot @Suns 🔥🔥 this guy is so special &amp; more fear guy to score for @BrooklynNets somethin to think about #NetsWorld #nba #bknvsphx https://t.co/DAoXVYOIrf",
    "429": "KOBE IN 2010 WENT THROUGH THE:\n\n🟣 50-32 OKC Thunder in 6\n🟡 53-29 Utah Jazz in 4\n🟣 54-28 Phoenix Suns in 6\n🟡 50-32 Boston Celtics in 7\n\nHe averaged:\n▫️29.2 PPG\n▫️5.5 APG\n▫️6.0 RPG\n▫️49/37/84 splits\n\nMOST UNDERRATED PLAYOFF RUN EVER 💜💛🐍♾ #MambaMentality https://t.co/K5wwwl1j6D",
    "430": "@celtics Right mentality.",
    "431": "@celtics yal going out sad man https://t.co/dxmw03fprd",
    "432": "@BasketB0t @celtics Smart is our best defensive player atm. You trade him and we'll fall apart defensively. I do agree that we need better shooters tho. Our shooting this season has been awful.",
    "433": "Maine Celtics Score - Final: @MaineCeltics 131, WC Knicks 106. #maineceltics #celtics #bostonceltics #boston #basketball #boston #maine #bostonsports #bleedgreen #goceltics #bostonathletemagazine https://t.co/XAcfGZLOB5",
    "434": "@LarryBirdBurne1 @RealBillRussell @jaytatum0 @celtics @NBA The team is in regression.",
    "435": "@bucknersrevenge @pistol3peat @LarryBirdBurne1 @RealBillRussell @jaytatum0 @celtics @NBA No one cares about the past. I say this to my Yankees friends.",
    "436": "@celtics can we hire a new training staff or sum",
    "437": "Check out Boston Celtics 1946 Adjustable Hat Cap #TwinsEnterprise #BostonCeltics https://t.co/ybLCx2VAuI via @eBay",
    "438": "Ah I see they’re taking the 2021 Boston Celtics approach… https://t.co/ksCIvVokh6",
    "439": "Game 20 of the 2021-2022 #BostonCeltics season. Boston Celtics @ San Antonio Spurs",
    "440": "@BillsGodfather @Hip_Foxy @Tiquan_Doe @TJDMCR No Tom Brady, no dynasty. Just a modern day Boston Celtics clone.",
    "441": "@celtics After a loss, main players will become questionable or out for the next game. But if they win, the bench stringers are the one reported on the injury list.",
    "442": "Okay, sign Grant Williams to a lifetime contract @celtics. And someone answer the man on this https://t.co/DsXCOaE4RD",
    "443": "@jaytatum0 has a Laker legend on his profile pic and has never denied wanting to be one so why do the @celtics keep someone like that? \n\nBuild on @FCHWPO and probably get a @DejounteMurray a Domantas or some other guys who might really want to be green!",
    "444": "@celtics Jayson Tatum is part of the problem. He’s going to end up like Carmelo Anthony if he doesn’t make major adjustments to his game. I say trade him for DeAndre Ayton since he wanted to play with Devin Booker in the first place",
    "445": "@smart_MS3 is going to be the next #36 to be retired by the @celtics realest @celtics since @paulpierce34 if you don’t know … know you know",
    "446": "@Tatcm_ @celtics lmfao when was that 😭😭 y’all be makin up fantasies 💀",
    "447": "@celtics Fuck",
    "448": "#celtics suck we have good players no superstars..@espn @celtics https://t.co/XAeTXtmXTl",
    "449": "@FrisellaMatt @nickdelpizzahut @celtics I hate you 😑",
    "450": "@celtics The @celtics are a inconsistent joke....",
    "451": "The Boston Celtics are a .500 ball club in there last 92 games..\n#NBA",
    "452": "@celtics I'm dubious",
    "453": "@celtics If we're gonna suck, can we at least extend the rotation to use some different players?",
    "454": "@celtics How is Rob Williams still out from a cold?? Wtf!",
    "455": "@KylerMorin33 @QJBeat Oh no bro I still got you Man what do you think about the Boston Celtics so far",
    "456": "@celtics Hats off to the Boston Celtics for giving it their all! We put up a great game and got almost all of our shots. Another great game for tatum as he went into the paint almost ever play. We did the best we could especially since we went again the best team in the league https://t.co/gk4JZH3LvR",
    "457": "@celtics Nice job resigning Robert Williams dere Brad!",
    "458": "@Stevieboyj1000 @OfficialPDC @DropkickMurphys I’m a Boston Celtics fan and they walk out to it so I loved hearing Brendan come out to that, loved it even more when he won!",
    "459": "@celtics Celtics have no excuse. The Spurs were 4-13 before they won last night.",
    "460": "@celtics I think the Coach need to stop this buddy thing Enes Kenter played very well . I still don’t know why he replaced him with Al Horford.",
    "461": "@Younghandsome71 @celtics Brown can’t step up when Tatum on the court tho he regress &amp; plays Robin to his Batman only when JT has an off night is when he step up . They both should be on fire together",
    "462": "@celtics Can y'all put Tatum out as well? I'm tired of being disappointed in him",
    "463": "Celtics need to sign John Wall wtf is we doing ?! @celtics",
    "464": "@celtics The celtics are gonna suck for a long time because they are dead set on building around tatum, brown. Its obviously not working but meanwhile hayward and rozier look great in Charlotte. Celtics can't spot or develop talent",
    "465": "@celtics Another L because the ball will be sticking in Tatum's hands, who has been playing like shit. And everyone will tall about how it will get better next time...yuck",
    "466": "@celtics Trade the coach.",
    "467": "@celtics This team is soft, injury after injury, year after year, I'm done being a Celtics fan.",
    "468": "@EnergySports12 @BasketB0t @celtics Yeah right....every time his man scores he’s standing behind him.",
    "469": "@celtics Should be a win then.....",
    "470": "BOSTON CELTICS BOSTON CELTICS BOSTON CELTICS BOSTON CELTICS",
    "471": "@leveillejeremy @celtics Nah, he just plays in the NBA. If you have a unique or desired skillset, they pretty much just let you play when you feel like it.",
    "472": "@celtics Lol Jaylen brown has tunnel vision and doesn’t move the ball he doesn’t drive and kick. He doesn’t move on the perimeter or move around off ball. Lol he’s not even being asked to do the same things as Tatum. And get the benefit of Tatums gravity.",
    "473": "@EnergySports12 @celtics “Elite” lol 😂",
    "474": "@celtics Damn Rob must be really sick",
    "475": "@jwc292 @celtics He was lol it was the players who were tuning him out because they thought they knew better",
    "476": "@CeltsnPats @celtics Yea he was great last year",
    "477": "@celtics Tough sledding this year.",
    "478": "@celtics Always does!! Brown and Tatum always try to go one on one. Brad! And this NEW coach are one in the same!! Won’t stand up and stop the foolishness and keep losing!! Mediocre is for a lot of other franchises!! NOT BOSTON!!! Can Bill coach Basketball to?",
    "479": "@ItsMe_Chauntice @celtics The Celtics still have a 1 on 1 isolation problem. Tatum has been near the top of the league in isos and bottom of the league in success every yr including this one since his second year, while Jaylen brown has gotten better and more efficient every year. He's far from the issue.",
    "480": "The road to superstardom is not easy. ☘\n\n#bostonceltics #celtics #jaysontatum #celticsdiary https://t.co/PJugh9SISU",
    "481": "Maine Celtics News - @MaineCeltics starting lineup for tonight's game with the WC Knicks. #maineceltics #celtics #bostonceltics #bostonathletes #boston #maine #bostonsports #basketball #BleedGreen #bostonathletemagazine https://t.co/pE6VK8FTxR",
    "482": "@fritzglc @NBCSCeltics @TMobile @celtics WTF.    THAT IS. SHOCKING.",
    "483": "@celtics @RochieWBZ No biggie Jayson Tatum just holds the ball anyway",
    "484": "@BasketB0t @celtics Brown is literally an elite shooter and defender",
    "485": "im in an abusive relationship with the boston celtics.",
    "486": "NBA Boston Celtics Stagger Set Play by Chris Filios | Basketball Plays, Basketball Set Plays, Quick Hitters Basketball Plays\nhttps://t.co/IPzhg2HQPG"
}