{
    "0": "Los Angeles Lakers season starts today. https://t.co/FCy97rNHAh",
    "1": "LeBron James (knee) to rejoin Los Angeles Lakers for game vs. Houston Rockets - via @ESPN App.   #NBA.  #Lakers.   https://t.co/mDcKvLdXtd",
    "2": "Uniforms for Los Angeles Lakers vs Houston Rockets at 5:00 PM. \n\n#LakeShow #Rockets https://t.co/DZ4wewFE23",
    "3": "Dwight Howard, Los Angeles Lakers, and Xbox Team Up to Open Gaming Lab to Inspire Youth https://t.co/OD0MkDLHv9",
    "4": "@daboio @_JasonLT Bro this small market owns Los Angeles Lakers 😂 don't get to lippy .",
    "5": "🏀🏀Houston Rockets vs Los Angeles Lakers 🏀🏀\n\n🔴𝕃𝕀𝕍𝔼 NOW ►🆗👉https://t.co/al4nWVZApk\n\n🔴𝕃𝕀𝕍𝔼 NOW ►🆗👉https://t.co/al4nWVZApk\n\n#HoustonRockets #AngelesLakers #NBA #Livestream https://t.co/Ggk1ZTI9oh",
    "6": "🏀🏀Houston Rockets vs Los Angeles Lakers 🏀🏀\n\n🔴𝕃𝕀𝕍𝔼 NOW ►🆗👉https://t.co/al4nWVZApk\n\n🔴𝕃𝕀𝕍𝔼 NOW ►🆗👉https://t.co/al4nWVZApk\n\n#HoustonRockets #AngelesLakers #NBA #Livestream https://t.co/4lOHFvYq8t",
    "7": "🏀🏀Houston Rockets vs Los Angeles Lakers 🏀🏀\n\n🔴𝕃𝕀𝕍𝔼 NOW ►🆗👉https://t.co/al4nWVZApk\n\n🔴𝕃𝕀𝕍𝔼 NOW ►🆗👉https://t.co/al4nWVZApk\n\n#HoustonRockets #AngelesLakers #NBA #Livestream",
    "8": "NBA: Los Angeles Lakers vs Houston Rockets 2022 Live Stream\n🔴𝕃𝕀𝕍𝔼 NOW ►🆗👉https://t.co/al4nWVZApk\n\n🔴𝕃𝕀𝕍𝔼 NOW ►🆗👉https://t.co/al4nWVZApk\n#NBA https://t.co/NtJmSQ6mY6",
    "9": "NBA: Los Angeles Lakers vs Houston Rockets 2022 Live Stream\n🔴𝕃𝕀𝕍𝔼 NOW ►🆗👉https://t.co/al4nWVZApk\n\n🔴𝕃𝕀𝕍𝔼 NOW ►🆗👉https://t.co/al4nWVZApk\n#NBA https://t.co/1MyduoTknP",
    "10": "NBA: Los Angeles Lakers vs Houston Rockets 2022 Live Stream\n🔴𝕃𝕀𝕍𝔼 NOW ►🆗👉https://t.co/al4nWVZApk\n\n🔴𝕃𝕀𝕍𝔼 NOW ►🆗👉https://t.co/al4nWVZApk\n#NBA",
    "11": "Thu, 10th Mar: #HoustonRockets vs #LosAngelesLakers - ODD @ 1.92\nMore details on: https://t.co/GJt4tPIpQX\n#baskettips #basketprediction #basketballbets #nba #usabasket",
    "12": "March 9, 1988\n\nLos Angeles Lakers coach Pat Riley recorded his 400th career victory in a 104-99 win over the Knicks in New York, reaching the 400 victory plateau faster (540 games) than any other coach in NBA history. 🐐 https://t.co/ANpAWcGmL7",
    "13": "@arxanii Your life must be pretty boring if you wake up and think about how many points jalen green will have against the Los Angeles lakers in a basketball game.",
    "14": "According to @sam_amick and @billoram, Phil Jackson has been in frequent communication with #Lakers owner Jeanie Buss about team matters all season long. The PG Russell Westbrook situation is known to have drawn his interest. Phil lives in Los Angeles during the winter months. https://t.co/PcrtJ8R2mp",
    "15": "I TRIED TO REBUILD THE LOS ANGELES LAKERS IN NBA 2K22 AND IT WAS A VERY ... https://t.co/M3geMZFJHF via @YouTube",
    "16": "Winning Time: The Rise of the Lakers Dynasty\nTV SHOW ∙ DRAMA ∙ 2022\n\nThis series chronicles the professional and personal lives of the 1980s Los Angeles Lakers, one of sports’ most revered dynasties\n\nGet it on Apple TV:👇\n\nhttps://t.co/o4dAjVNM9w #VintageOlisa #Pacers https://t.co/ckoljxnSb1",
    "17": "Los Angeles Lakers Vs. Houston Rockets Live Play By Play &amp; Reaction https://t.co/yuOT4hI2HR",
    "18": "🚨 Line Change 🚨\n\nLos Angeles Lakers @ Houston Rockets\nWed 8:10 PM EST\n\nFrom:\nHOU 6.5 -110\n\nTo:\nHOU 7.5 -110",
    "19": "[Live] 2022 NBA Basketball Houston Rockets Vs Los Angeles Lakers 👉 ▶️ : https://t.co/C2nVjpU3Ez | 9-Mar-22 @ 20:00 | Los Angeles Lakers | Houston Rockets | NBA | Basketball https://t.co/QUtCX0Ze8P",
    "20": "The Los Angeles Lakers play basketball today https://t.co/wKK0lg0GMV",
    "21": "“In the fourth quarter, he told me that’s it you had a great game” Iman Shumpert reveals an astonishing story highlighting how Kobe Bryant’s Mamba Mentality affected his game https://t.co/daO2EKlL9F #LosAngelesLakers #NBA",
    "22": "@BrasilTurnover Los Angeles Lakers",
    "23": "Los Angeles Lakers",
    "24": "Consensus Line Move:\n2022-03-09 Los Angeles Lakers at Houston Rockets from 234.00 to 235.00\nOver what ya gonna do?\n#NBA #bet #statistics #entrepreneurship",
    "25": "Lakers: Kyle Kuzma Seems to Take a Jab at Los Angeles – Lakers News https://t.co/WrWf8VLCQm",
    "26": "Check out 2016-17 NBA Panini Threads Los Angeles Lakers Nick Young Trading Card #LosAngelesLakers https://t.co/KlbELjseOV via @eBay  #NBA75 #NBATwitter #NBA2K22 #NBATwitterLive #NBAonTNT #WinningTime #NBAonESPN",
    "27": "Los Angeles Lakers visits Houston Rockets Predictions and Preview for 3/9/2022 today.  Who are we taking in this game?  Find out now. #GamblingTwitter #NBA https://t.co/301k7iEkC5",
    "28": "Here’s looking at you. https://t.co/M4TPViMJhM",
    "29": "Los Angeles took our Lakers, so I guess we’ll just have to take their Rams. https://t.co/M0ZFnPvNJ2",
    "30": "Houston Rockets Predictions and Preview for 3/9/2022 hosts Los Angeles Lakers.  Find out who we are taking in this matchup. #GamblingTwitter #NBA https://t.co/301k7iEkC5",
    "31": "8 Ways Kobe Bryant Carried the 2012-13 Los Angeles Lakers to the NBA Playoffs https://t.co/AHJVMYzmWC",
    "32": "Los Angeles Lakers star LeBron James (knee soreness) will return tonight against the Houston Rockets\n\n@ChrisBHaynes | #LakeShow https://t.co/Dd0ce36Shf",
    "33": "Los Angeles #Lakers F LeBron James will return to the lineup tonight against the Houston #Rockets after being out with knee soreness. #NBA https://t.co/pS0C2AS3Ht",
    "34": "Los Angeles Lakers star LeBron James (PTO) will return tonight against the Houston Rockets. https://t.co/h7Mw4j2LHB",
    "35": "Los Angeles Lakers star LeBron James (knee soreness) will return tonight against the Houston Rockets, league sources tell @YahooSports.",
    "36": "@statmuse Los Angeles Lakers",
    "37": "Lakers: Kyle Kuzma Seems to Take a Jab at Los Angeles\n\nhttps://t.co/OTcshbrbdn",
    "38": "@statmuse Los Angeles Lakers of the NBA, PSG with all those SuperStars Still Lost",
    "39": "@NevadaHoops @gsherfield5 Grant Sherfield on the 2022 Nevada Wolfpack\n🤝\nLeBron James on the 2022 Los Angeles Lakers",
    "40": "Los Angeles Lakers vs. Houston Rockets - 3/9/22 Free Pick &amp; NBA Betting Prediction https://t.co/EBDZuiIw3B\n.\n#Betting #FreePicks https://t.co/GyVqwikMDl",
    "41": "LeBron James scores 56 as Los Angeles Lakers end skid against Golden State Warriors; Miami Heat battle past Philadelphia 76ers https://t.co/u17vWKd3r6 #sports",
    "42": "@ptgorst @navbasiTLW @OliverKay I guess it's the same as the New York Yankees, Dallas Cowboys or Los Angeles Lakers. The brand outstrips the reality.",
    "43": "The Official Hot Sauce of the Lakers. When it comes to flavor, #weGOTCHU\n\n#LakeShow x @bibigoUSA https://t.co/LUZCsm0bER",
    "44": "Today's NBA Picks: 8:10 PM ET - Los Angeles Lakers vs. Houston Rockets - 14 PICKS AVAILABLE: https://t.co/zLKJylAZRy #nba",
    "45": "Langford finally made his debut for San Antonio on Monday night, when the Spurs defeated the visiting Los Angeles Lakers 117-110. He had seven points and one rebound off the bench. https://t.co/3q6MReTHEz",
    "46": "GAMEDAY!📍\n-\nThe Los Angeles Lakers will take on the Houston Rockets at 5:00 PM PST in the Toyota Center tonight. 💜💛\n-\nWho do you think will win this game tonight? 🤔 \n- \nFollow @lalakersquad for more! 🔥 https://t.co/V2pZHF5WrL",
    "47": "Paris Saint Germain are football's version of the Los Angeles Lakers.",
    "48": "Hey everyone, this is the very first article that I ever published in my life! I want to thank TDS for giving me this opportunity. Please check out my Houston Rockets vs. Los Angeles Lakers game preview, and tell me what you think. https://t.co/pxkcmlobRE",
    "49": "Come join us for tonight’s Olympic Celebration! Doors open at 4:30 pm 🙌\n🏀 Los Angeles Lakers vs Houston Rockets @ 5:00 pm\n🏒Montreal Canadiens vs Vancouver Canucks @ 7:30 pm\n#socloseyoucanfeelit #SB #MicahHart https://t.co/aiEIgnQBGZ",
    "50": "Check out this listing I just added to my #Poshmark closet: Mitchell &amp; Ness Los Angeles Lakers Tee Sz XXL. https://t.co/isCEZfAAuu #shopmycloset @poshmarkapp",
    "51": "@Lakers @SpectrumSN @SociosUSA Los Angeles Lakers is very bad in this season.",
    "52": "3 great defensive players the Los Angeles Lakers easily could have had https://t.co/OxozpGRhRK",
    "53": "DID YOU KNOW...that the DJ for the Motocross Jam Festival (DJ Roueche) is the official DJ for the Los Angeles Lakers? He'll be spinning just for us Mar 19!\n\nhttps://t.co/5YeNAorjn4 https://t.co/iCVeQULMFG",
    "54": "Los Angeles Lakers at Houston Rockets - 3/9/22 NBA Picks and Prediction https://t.co/qy3KTWS6EB\n\n#NBA #NBAPick #FreePick #FreePicks #SportsBetting #ExpertPick #NBATwitter #ExpertBettingAdvice #sportsbettingadvice #handicappers #SportsGambling #SportsPicks #Rockets #LakeShow https://t.co/nK2XAFOWYW",
    "55": "Three Things to Know: Lakers at Rockets - 3/9/22 | Los Angeles Lakers (Los Angeles Lakers)\n\nThe Lakers (28-36) face the Rockets (16-49) on Wednesday evening for a road game, with LAL h...\n\nAdd your highlights:\nhttps://t.co/OBcXLVeMcV\n #LA_Lakers",
    "56": "The Los Angeles Lakers face the Houston Rockets in Wednesday's NBA Basketball Action. Get Trending Rabbit's NBA Basketball Pick and Prediction for this game.\n\n#NBA #NBAPick #NBAPredictions #NBAOdds #Rockets #Lakers #LakeShow #LakersVsRockets https://t.co/NJmxVzZ4sZ via @YouTube",
    "57": "@Hippydodgerfan @Legodrules @nick_shop69 @LakersSBN The one season the lakers were healthy, a championship came. Lmfaooo you just a bonafide hater and you’re a disgrace to Los Angeles sports team as a fan",
    "58": "Here's why Kendrick Perkins believes it may be best for Los Angeles Lakers point guard Russell Westbrook to sit out the rest of the season.\n\n#Lakers | #RussellWestbrook | #ESPN | @bgarciaivsports  https://t.co/mjTXvXSUR7",
    "59": "For some reason, I just had a flashback to the 2020 NBA finals Los Angeles Lakers championship bubble team. LeBron James. Anthony Davis. Man that was a special team.",
    "60": "Los Angeles, our #Lakers are battling Houston TONIGHT at 5:00 PM. Drop a 💛  to show your support! \n\n#LakersNation #LakersGame #GoLakers #Basketball https://t.co/6QNwRqDBuL",
    "61": "Check out Kobe Bryant NBA Los Angeles Lakers 12”x15” Engraved Plaque https://t.co/3aQiATbTpn @eBay #collectible",
    "62": "Check out Kobe Bryant Michael Jordan NBA Los Angeles Lakers Bulls 12”x15” Engraved Plaque https://t.co/IRRcTE5uoP @eBay #collectible",
    "63": "Check out Kobe Bryant NBA Los Angeles Lakers 12”x15” Engraved Plaque https://t.co/XvdiXfYIiM @eBay #collectible",
    "64": "Do fans from Los Angeles love the Lakers and as much as fans from San Antonio do?\n\nSerious question.",
    "65": "Los Angeles Lakers at Houston Rockets odds, picks and predictions https://t.co/Ez3tCC8QvV https://t.co/2jbOb4FFwX",
    "66": "Game Night: The Los Angeles Lakers look to bounce back vs The Houston Rockets. https://t.co/AiUwKvXmEQ",
    "67": "Check out 1990-91 SkyBox #138 Earvin (Magic) Johnson Los Angeles Lakers HOF Mint #LosAngelesLakers https://t.co/SV0F40EYTW via @eBay",
    "68": "Los Angeles Lakers vs. Houston Rockets https://t.co/lp5dGlD1Tn",
    "69": "Jerry West earned a reputation as a Hall of Fame player for the Los Angeles Lakers back as \"Mr. Clutch.\" Tyce Bertlshofer has earned a similar moniker for the Burlington High School boys basketball team. https://t.co/jeJbvbjEwx",
    "70": "@sigg20 Howard Cosell never got over it. He dissed the city of Los Angeles,the Dodgers,the Lakers and the Rams on national TV during Game 6 of the '81 World Series. As the Dodgers were winning the world championship. He even indirectly dissed Mayor Bradley.",
    "71": "Kyle Kuzma says leaving Lakers for Wizards has been great 'because ... (Silver Screen and...)\n\nKyle Kuzma's journey with the Los Angeles Lakers was a winding one.\n\nAdd your highlights:\nhttps://t.co/SPJ4HL3eS0\n #LA_Lakers",
    "72": "You have to be a special type of person to play for the Los Angeles Lakers. It’s a whole lot of pressure. https://t.co/FlqERcAqtW",
    "73": "\"As my first order of business as the owner of the Los Angeles Lakers I hereby contract the Los Angeles Lakers\" https://t.co/XL88TIEoPK",
    "74": "Analyzing Wednesday’s Los Angeles Lakers at Houston Rockets odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/iwnvv0WMBj",
    "75": "Jogo 61:\n\nLos Angeles Lakers 124-116 Golden State Warriors. (05/03/22). https://t.co/1wQm05eNge",
    "76": "@latimes This is the same Plaschke that wrote Westbrook was \"defiant\" in his first press conference because ... he didn't answer his questions fast enough. \n\nSame Plaschke that wrote an editorial telling the Lakers to trade Kobe. \n\nSome things -- or people -- never change.",
    "77": "🏀Do we have any hard-core basketball fans? Tell us your favorite team in the comments below!🏀\n-\n✨ Houston Rockets Vs. Los Angeles Lakers ✨ // March 9th, 2022 @ Houston Toyota Center\nTickets on sale @ https://t.co/Q9prlCispG 👈👈👈\n-\n#Sports #Wednesday #Baksetball... https://t.co/FgNqAQ4IO7",
    "78": "This will be the 230th regular season meeting between the Los Angeles Lakers (28-36) and the Houston Rockets (16-49). The Lakers lead the series 144-85.",
    "79": "Russell Westbrook has had enough of the Westbrick jibe with him asking the Los Angeles Lakers to quell their chants #westbrook #westbrick #lakers #lebron #losangeles #nba #basketball https://t.co/NatiaEu3EO",
    "80": "Game day!\nLos Angeles Lakers is playing against Houston Rockets today at 8 pm at Toyota Center, Houston!\nhttps://t.co/PLMWkz7J4I\n\n#nba #HoustonRockets https://t.co/DihPirTP5X",
    "81": "Los Angeles Lakers vs  Houston Rockets Prediction 3/9/22 -  Free NBA Picks https://t.co/CiRa8QA0hA via @YouTube",
    "82": "#Lapivoteca: Regal FC Barcelona vs Los Angeles Lakers NBA tour 2010 https://t.co/d5ghNKBh7j via @pivotworld9",
    "83": "🚨 It's Game Day!\n\n🏀 Los Angeles Lakers @ Houston Rockets\n\n🕒 Tip off alle 2:00 🇮🇹\n\n💬 Live su Telegram https://t.co/ggnxaixAHp\n\n#LakeShow #Rockets #NBA75 https://t.co/3jy7OJzKH5",
    "84": "The Lakers are favored in Houston, but given the uncertain status of LeBron James and apparent turmoil in Los Angeles in recent weeks, an upset by the Rockets doesn’t feel implausible.  https://t.co/U0f1v4XWob",
    "85": "GAMEDAY.\n\n🏀 LOS ANGELES LAKERS 🆚 Houston Rockets.\n\n🏟️: Toyota Center.\n\n⏱️ 22:00 (🇦🇷/🇧🇷/🇺🇾/🇨🇱/🇵🇾)\n⏱️ 21:00 (🇧🇴/🇻🇪/ 🇩🇴/🇵🇷)\n⏱️ 20:00 (🇨🇴/🇵🇪/🇪🇨/🇵🇦/🇨🇺)\n⏱️ 19:00 (🇲🇽)\n⏱️ 02:00  (🇪🇸)\n\n💻/📱 NBA League Pass. https://t.co/m4tc3NqTGU",
    "86": "On this day in sports history March 9, Los Angeles Lakers Center Wilt Chamberlain recorded 25 Points, 38 Rebounds, and 7 Assists in a 120-109 win against the Baltimore Bullets in 1969.",
    "87": "8:00pm ET, Wed, Mar 9\n\nLos Angeles Lakers\nHouston Rockets\n\n📺: ATTSN-SW, \nSpectrum SportsNet\n\n#LEGENDoftheMiamiHEAT #NBA75",
    "88": "Check out Lebron James NBA Los Angeles Lakers 12”x15” Engraved Plaque https://t.co/JdPyCoEOHW @eBay",
    "89": "LOS ANGELES LAKERS:\n\nLakers go full rebuild. Trade Lebron, trade AD, trade Russ, etc. \n\nMiss playoffs for second consecutive year, but end it in a better spot then last year with better young pieces to build around for the future.",
    "90": "LeBron James scores 56 as Los Angeles Lakers end skid against Golden State Warriors; Miami Heat battle past Phila https://t.co/E2to3dxGUY https://t.co/cR6QYWEssx",
    "91": "NBA Basketball Game Betting Picks Simulator: 8:10 PM ET - Los Angeles Lakers vs. Houston Rockets - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/bhnbo5nm3O #nba #sportsbetting #freepicks #cappertek",
    "92": "LOS ANGELES LAKERS vs\nHOUSTON ROCKETS, 9:00PM.",
    "93": "Did you know that #GreggPopovich tied Don Nelson’s #NBA record with his 1,335th career victory as a coach in the #SanAntonioSpurs’ 117-110 win over the #LosAngelesLakers on Monday night?\n\n#record #basketball #interestingfacts https://t.co/i9AJgPNc2h",
    "94": "Showtime : Magic, Kareem, Riley, And The Los Angeles Lakers Dynasty Of The 1980s—Pearlman, Jeff.\n2014\nBook | 796.32364 l879 zp 2014\nitems: 4 | circs: 87 | last circ: 3/2022\nlos angeles lakers basketball team history\nhttps://t.co/KDNUk32G7M",
    "95": "▶️▶️https://t.co/5HE6dqHPNi◀️◀️\nLive #NBA streams upcoming:\n#HoustonRockets vs #LosAngelesLakers\nand more ... https://t.co/5qyD9TRvVP",
    "96": "New Episode! \"Winning Time: The Rise of the Lakers Dynasty – First impressions | Plus will we ever go back to the Arnold?\"\n\nThe “Showtime” era of the Los Angeles Lakers in the 1980s probably saved pr…\n\nPlayer links &amp; show notes: https://t.co/UBRwUUkpfG",
    "97": "Los Angeles Lakers Diamond Icon Edition\nPrice:₱5,395\nFor more details click this link:https://t.co/pQwbH6777v https://t.co/lFdfXjzSRg",
    "98": "I absolutely love basketball. Winning time: rise of the Los Angeles lakers is a must watch 🤞🏼",
    "99": "Houston Rockets: Los Angeles Lakers vs Houston Rockets:  Live Stream, Score Updates and How to Watch NBA 2022 https://t.co/3kuR1dDlf1",
    "100": "@YannisNBA Moreover, it is the responsibility of the employer to protect the employee.  The Lakers are a franchise/organization, they aren't the city of Los Angeles.  \n\nDamage done?   The Lakers might as well be Thanos in Infinity War.  All that for a drop of blood.",
    "101": "I’m the owner of the Los Angeles Lakers https://t.co/it8zWeXlTR",
    "102": "In his long-awaited San Antonio Spurs debut, former @NewAlbanyHoops and #IUBB star Romeo Langford scored seven points and the helped his new team beat the Los Angeles Lakers 117-110 on Monday.\n\nSTORY: https://t.co/N3TPq8iOyo",
    "103": "The last team to go back to back in Los Angeles were the Kobe Lakers. That team is revered to this day. Cement your legacies as all-time LA LEGENDS! https://t.co/xU87JCpyQD",
    "104": "2019-20 Panini Mosiac #8 LeBron James PSA 10 Los Angeles Lakers - https://t.co/AvPZxcvGxh\n\n#lebron #lebronjames #lakers #nba \nhttps://t.co/t2q3PB53II",
    "105": "LeBron James — See myself with Los Angeles Lakers for ‘as long as I can play’ https://t.co/85rw03sluS",
    "106": "@AP2112640040 @RapsDistrict Man I'm going to be honest with you I don't get to watch you a lot of pro basketball but I do not like the Los Angeles Lakers",
    "107": "*NEW BLOG ALERT!* LeBron James is one of the greatest basketball players of all-time. Why has he been so hard to like?\n#thesportspageblog #sportsblog #sportsblogger #goat #lebronjames #basketball #losangeleslakers #miamiheat #clevelandcavaliers #hottake\n\nhttps://t.co/7tTxdTwm07 https://t.co/Xqz2Xk01AW",
    "108": "LeBron James — See myself with Los Angeles Lakers for ‘as long as I can play’ https://t.co/yADDQGvdeZ",
    "109": "I checked the official account of the Los Angeles Lakers @Lakers to see if the team somehow made a statement regarding the death threats to Russell Westbrook and his family. And nothing. The third star of the team isn't worth a tweet. Damn. Front office sucks ass.",
    "110": "Not a day goes by that Kobe Bryant isn’t missed by Los Angeles Lakers fans everywhere. Another Kobe nugget to make fans miss him more surfaced thanks to Charles Barkley.  https://t.co/HygWUHXrQL",
    "111": "JUST DON X 59FIFTY LAKERS now available from FRESHRAGSFL\n\n#newdrop #freshrags #florida #sneakerboutique #nba #losangeleslakers #lakers #lakeshow #losangeles #california #just #don #59fifty #hatcrawler #fitted #hatcollector\n\nhttps://t.co/2xhhWgkbZ9",
    "112": "@thefilmgoer @KareemMaddox @latimes Just so you know: it was Jack Kent Cooke and not Jerry Buss who actually drafted Magic Johnson BEFORE he sold the Lakers, Kings and Forum to Buss and his partners.",
    "113": "March 8, 2020: In the eventual NBA Champion Los Angeles #Lakers' 2nd to last game before the season suspension, LeBron James scored/assisted on LA's final 13 PTS against the Clippers with LBJ's and-1 dagger leading to some memorable emotion from the King\nhttps://t.co/ZuoxWiF66n",
    "114": "Los Angeles Lakers are eight games down below .500.",
    "115": "Check out 2019 Panini Silver Prizm #25 Magic Johnson Los Angeles Lakers HOF PSA 9 MINT   https://t.co/sYL0Ujg5Ta via @eBay",
    "116": "LIVE: LOS ANGELES LAKERS vs DALLAS MAVERICKS | SCOREBOARD | PLAY BY PLAY | BHORDZ TV https://t.co/QFoXRpuV5c",
    "117": "the land of the lakes which was once minnasota but made its home in los angeles. when trump said drain the swamp. swamps could be lakes. covid. movies. politicians and hollywood. nasa. the lakers. the swampers. connections.",
    "118": "@JPronos23 Los angeles lakers",
    "119": "Lakers coaching staff pressed to deal with Russell Westbrook at deadline, report says\nhttps://t.co/8NAV9ZVO2C\n\n#RussellWestbrook #Lakers #LosAngelesLakers #NBA",
    "120": "✈️ Los Angeles (LAX) to Majorca (PMI) for only $427 (USD) roundtrip 💸\n117 live dates on Adventure Machine. - get the app on iOS or Android #LosAngeles  #LosAngelesCL  #losangelescleanup  #LosAngelesLakers https://t.co/CdSwoFMv8Z",
    "121": "Lebron James Jersey Los Angeles Lakers LA New #23 Jersey Mitchell Ness Medium - https://t.co/Zlk6LnlCAw\n\n#lebron #lebronjames #lakers #nba \nhttps://t.co/SFQWJSbP5j",
    "122": "🚨🚨🚨LESS THAN 48 HOURS REMAINS!!!!🚨🚨🚨\n\nCheck out LOS ANGELES LAKERS 2020-21/2021-22 Basketball 8 Box Case Break Mixer Immac #NBA https://t.co/HX2LbMnC9y via @eBay",
    "123": "@Ballislife The Los Angeles Lakers everybody! (So, the next time you're in a contract year &amp; you've been reading a little too much of your own press clippings...)",
    "124": "@CCT21STS @RonaldoKurniaw2 @LakersNation @KingJames The Los Angeles Lakers don’t have 17 championships. Big difference.",
    "125": "11-Time NBA Champion Coach Holds the Key to Russell Westbrook's Future at Los Angeles Lakers \n#LakeShow  #lakernation #Lakers \n@lakeers\nhttps://t.co/09lJ591VN4",
    "126": "NBA Leader: 25.6 PPG Los Angeles Lakers ULTIMATE TRADE For 227's YouTube Chili' Zach Chili' LaVine 25.6 PPG 4.9 RPG 4.3 APG #BullsNation Spicy' https://t.co/Hfcu53yDr7 https://t.co/Rz4yCrcOaF #UCLA #Bruins! NEW SUPERTEAM w/ LEBRON… https://t.co/9VhNkxXcQx https://t.co/feA8VJoofv",
    "127": "Los Angeles Lakers fans need this 'Showtime' shirt – Lakers News https://t.co/PcwbROOMMo",
    "128": "Listen/Look how everyone is taking up for the Los Angeles Lakers. My goodness gracious, it seems like they are being catered to. No other franchise but them. Now they need Phil again. Jesus have mercy, this is ridiculous. 😂🤦🏿‍♂️#helpthemplease #excuses #magicsavethem #comeonphil",
    "129": "Suppose That The Los Angeles Lakers And The Portland Trailblazers Are Not Quite https://t.co/JRJNybERpN",
    "130": "Russell Westbrook speaks out about the ‘Westbrick’ nickname I SPEAK FOR YOURSELF: Los Angeles Lakers guard Russell Westbrook made headlines after his wife Nina Westbrook came to his defense after fans, media pundits and others began to call him Russell… https://t.co/kqVh0kP7u5 https://t.co/qHcAtvvTzH",
    "131": "Los Angeles Lakers fans need this 'Showtime' shirt – NBA News https://t.co/TmvVrGzXLM"
}