{
    "0": "Let's get this going. #LakeShow https://t.co/XNICqnCSFF",
    "1": "#NBA #NBATwitter Today's Lineups\n\n#LakeShow\nLos Angeles Lakers Starting 5:\nRussell Westbrook\nWayne Ellington\nTalen Horton-Tucker\nAnthony Davis\nDeAndre Jordan\n\n#SacramentoProud\nSacramento Kings Starting 5:\nDe’Aaron Fox\nTyrese Haliburton\nTerence Davis\nChimezie Metu\nRichaun Holmes",
    "2": "#NBA75 | COMING NEXT! \n-Phoenix Suns vs Golden State Warriors\n-Sacramento Kings vs Los Angeles Lakers\n-Portland Trail Blazers vs Detroit Pistons\nBET NOW:\nhttps://t.co/IT7pYFdaVg https://t.co/Qb71fcss89",
    "3": "#NBA75 | COMING NEXT! 3 AMAZING GAMES!\nPhoenix Suns vs Golden State Warriors\n\nSacramento Kings vs Los Angeles Lakers\n\nPortland Trail Blazers vs Detroit Pistons\nBET NOW:\nhttps://t.co/0rTJpgSrdP https://t.co/ZIP8f7odU5",
    "4": "Sacramento Kings - Los Angeles Lakers, over 224 1.961 55% 2u #Sukkelat",
    "5": "Check out this listing I just added to my #Poshmark closet: Los Angeles Lakers Women's Sweatshirt. https://t.co/GzNbE6Nco5 #shopmycloset @poshmarkapp",
    "6": "Talen &amp; Wayne join the starting five. \n\n#SuitingUpTogether | @ToyotaSoCal https://t.co/Zcqg8vCTZK",
    "7": "Kings’ Harrison Barnes, Moe Harkless out vs the Lakers #LosAngelesLakers #SacramentoKings https://t.co/QifiXRoZkJ",
    "8": "Los Angeles Lakers Vs Sacramento Kings Live Play By Play &amp; Reaction https://t.co/WEo1AEOAdo",
    "9": "ESPN: Los Angeles Lakers' LeBron James in health and safety protocols; expected to miss several games, sources say.\nhttps://t.co/dwz4hoTXDt\n\nvia @GoogleNews",
    "10": "On this day in 1973, Elmore Smith of the Los Angeles Lakers blocked 10 shots in a 123-107 win over the Kansas City-Omaha Kings https://t.co/7Ht0Z47um1",
    "11": "Lakers starting lineup vs the Kings revealed #LosAngelesLakers #SacramentoKings https://t.co/nly7vIfgym",
    "12": "Los Angeles Lakers Starters:\n\nRussell Westbrook\nWayne Ellington\nTalen Horton-Tucker\nAnthony Davis\nDeAndre Jordan\n\nPlayers out:\nTrevor Ariza\nAvery Bradley\nLeBron James\nKendrick Nunn\n#LakeShow #NBA #NBATwitter #NBA75",
    "13": "Updated Injury Report vs. Los Angeles Lakers - 11/30: \n\nMarvin Bagley III (illness) - OUT\n\nHarrison Barnes (right foot sprain) - OUT\n\nMoe Harkless (left knee soreness) - OUT\n\nRobert Woodard II (left ankle soreness) - OUT",
    "14": "Starters for @SacramentoKings vs. Los Angeles Lakers - 11/30:\n\nG - De’Aaron Fox \nG - Tyrese Haliburton \nG - Terence Davis  \nF - Chimezie Metu \nC - Richaun Holmes",
    "15": "Starter Wayne https://t.co/QKTGQnK8cq",
    "16": "LeBron James has been placed in the NBA’s health and safety protocols, and was ruled out for the Los Angeles Lakers’ game against the Sacramento Kings on Tuesday night. https://t.co/TC7Jdx9Eq8",
    "17": "ALERT: New high roller bet posted!\nA bet has been placed for $9354.54 on Sacramento Kings - Los Angeles Lakers to win $9,394.28.\nTo view this bet or copy it https://t.co/mOPJyAAkLq https://t.co/PT9ap3viti",
    "18": "The positive results came hours before the Los Angeles Lakers were set to face the Sacramento Kings.\n\nHe will have to quarantine away from the team for 10 days or until he can submit two negative COVID-19 tests.\n\nhttps://t.co/WqlLZBrhDD",
    "19": "Check out Los Angeles Lakers Anthony Davis #3 Nike Gold 2021/22 Diamond Swingman Jersey #Nike https://t.co/JYx1smqW3m via @eBay",
    "20": "Check out Los Angeles Lakers Dwight Howard #39 Nike Gold 2021/22 Diamond Swingman Jersey #Nike https://t.co/2IaxgRW9jx via @eBay",
    "21": "Check out Los Angeles Lakers Carmelo Anthony #7 Nike Gold 2021/22 Diamond Swingman Jersey #Nike https://t.co/ZE0YKefwys via @eBay",
    "22": "Check out Los Angeles Lakers Russell Westbrook Nike Gold 2021/22 Diamond Swingman Jersey #Nike https://t.co/z59VrxJpfZ via @eBay",
    "23": "Los Angeles Lakers' LeBron James is out for Tuesday night's game against the Sacramento Kings due to NBA's COVID-19 health and safety protocols.  https://t.co/EB5S2MA7TD",
    "24": "@SaiIorTurnee (2021-22 Los Angeles Lakers)",
    "25": "Los Angeles Lakers' LeBron James is out for Tuesday night's game against the Sacramento Kings due to NBA's COVID-19 health and safety protocols.  https://t.co/qBXlLEadHu",
    "26": "Los Angeles Lakers' LeBron James is out for Tuesday night's game against the Sacramento Kings due to NBA's COVID-19 health and safety protocols.  https://t.co/e4KtxWViIN",
    "27": "Russ on the go 💨 https://t.co/GtNWHQvN5W",
    "28": "Los Angeles Lakers' LeBron James is out for Tuesday night's game against the Sacramento Kings due to NBA's COVID-19 health and safety protocols.\nhttps://t.co/o4i378OOMq",
    "29": "After facing off against each other just three days ago, the Los Angeles Lakers and the Sacramento Kings are set to go toe to toe against each other once more today, Dec 1 at 11 AM PST. https://t.co/WQm8vasBwQ",
    "30": "Los Angeles Lakers' forward LeBron James has entered the NBA's COVID-19 health and safety protocols and will miss the road game against the Sacramento Kings, the team said.\n\nhttps://t.co/9fhVyFik0n",
    "31": "Los Angeles Lakers' LeBron James is out for Tuesday night's game against the Sacramento Kings due to NBA's COVID-19 health and safety protocols.  https://t.co/GD3gf2ZtiK",
    "32": "LeBron James positive for COVID-19 after testings, classified as asymptomatic in current condition — report #COVID19 #LeBronJames #LosAngelesLakers https://t.co/yK2YiHJx32",
    "33": "LeBron James will miss yet another Los Angeles Lakers’ game Tuesday night, this time against the Sacramento Kings, as he follows NBA protocols for COVID-19. https://t.co/oYgxqTTmJ6",
    "34": "New tumblr post: \"#NBA2K22 Chicago Bulls vs Los Angeles Lakers MyLeague PS4 GAMES...\" https://t.co/ZnhyhWfnpy ifttt, youtube",
    "35": "So did ⁦@KingJames⁩ catch the vid? He got the shot? Now what? \nLos Angeles Lakers' LeBron James in health and safety protocols; expected to miss several games, ... - via @ESPN App https://t.co/qDCnqrYDSk",
    "36": "Los Angeles Lakers' LeBron James is out for Tuesday night's game against the Sacramento Kings due to NBA's COVID-19 health and safety protocols.  https://t.co/iFTbYBgICg",
    "37": "Los Angeles Lakers star LeBron James has entered the NBA's COVID-19 health and safety protocols, the team said Tuesday. https://t.co/R9y8UJIH8y",
    "38": "Shoutout to the fans 💜💛 https://t.co/6ZYPdOIfxF",
    "39": "LeBron James has been placed in the NBA's health and safety protocols, and was ruled out for the Los Angeles Lakers' game against the Sacramento Kings on Tuesday night.\nhttps://t.co/gTBXoTJaXs",
    "40": "Lakers star LeBron James to miss game tonight after entering COVID-... (Los Angeles Times)\n\nLeBron James has entered the NBA's COVID-19 health and safety protocols and will miss the La...\n\nAdd your highlights:\nhttps://t.co/fj38Zucd20\n #LA_Lakers",
    "41": "Lakers coach Frank Vogel says the team found out this morning LeBron James would be entering NBA health and safety protocols. Vogel added the team then arranged for him to get safe transportation back to Los Angeles.",
    "42": "Lakers coach Frank Vogel says he found out LeBron James was placed in the health and safety protocols this morning and he got “safe transportation” back to Los Angeles.",
    "43": "Los Angeles Lakers' LeBron James in health and safety protocols; expected to miss several games, sources say - ESPN https://t.co/QwIrljZvv4 https://t.co/BYytpvQjtU",
    "44": "LeBron James has entered the league's health and safety protocols and will not play in Tuesday's game against the Kings, the Los Angeles Lakers announced‼️ It is expected that James will miss several games 🚨#uaccessmagazine https://t.co/g2FrvYCpOa",
    "45": "Los Angeles Lakers' forward LeBron James has entered the NBA's COVID-19 health and safety protocols and will miss Tuesday night's road game against the Sacramento Kings, the team said.   https://t.co/gxc9cPq5qa",
    "46": "Los Angeles Lakers | #9 | Guard-Forward\n\nBazemore can shoot open threes and spread the floor, but he's earned a name for himself as a perimeter defender, allowing superstar teammates to put more effort into the offensive end by protecting him.\n\nWhether... https://t.co/pTDTCmryQi",
    "47": "Los Angeles Lakers' forward LeBron James has entered the NBA's COVID-19 health and safety protocols and will miss Tuesday night's road game against the Sacramento Kings, the team said. https://t.co/4CiYPGcLLj",
    "48": "Play Lakers Pick 'Em for your chance to win tickets to the December 12 game vs the Magic.",
    "49": "LeBron James has been placed in the NBA’s health and safety protocols, and was ruled out for the Los Angeles Lakers’ game against the Sacramento Kings on Tuesday night. https://t.co/b3uZ19fUZ0",
    "50": "Put a fork in the Los Angeles Lakers  it’s over … time to retire the team and start new …",
    "51": "ALERT: New high roller bet posted!\nA bet has been placed for $7,836.82 on Sacramento Kings - Los Angeles Lakers to win $7,893.66.\nTo view this bet or copy it https://t.co/0AyGn0df77 https://t.co/mhvdeCetdR",
    "52": "Young fellas fitted 🤩 https://t.co/W8QNycjOu9",
    "53": "Los Angeles Lakers' forward LeBron James has entered the NBA's COVID-19 health and safety protocols and will miss Tuesday night's road game against the Sacramento Kings, the team said https://t.co/f4BcxGGO8i",
    "54": "FILED UNDER CORONAVIRUS ,  LEBRON JAMES ,  LOS ANGELES LAKERS ,  NBA ,  11/30/21 https://t.co/g2R2cdobBz",
    "55": "NEW: Los Angeles Lakers star LeBron James tests positive for COVID-19; he is vaccinated and asymptomatic at this time.",
    "56": "LeBron James has entered the league's health and safety protocols and will miss Tuesday's game against the Kings, the Los Angeles Lakers announced. \n#NBA #NBATwitter https://t.co/uEmd95gpS1",
    "57": "Los Angeles Lakers star LeBron James won't play against the Sacramento Kings at Golden 1 Center on Tuesday night after he entered COVID-19 health and safety protocol, the team announced. https://t.co/vl8rWCdM6r",
    "58": "Los Angeles Lakers forward Trevor Ariza gave an update on how he feels after having ankle surgery earlier in the year.  https://t.co/7lttWWFdLF",
    "59": "🏀 Los Angeles Lakers(-3.5) @ Sacramento Kings(+3.5)\n\n⌚ 10PM ET\n\nO/U: 226\n\n📋 Over is 5-1 in Lakers last 6 overall.\n\nBet BTC ➡️ https://t.co/spMiJIy3iL\n\n#NBATwitter #NBAPicks #SportsBetting #GamblingTwitter https://t.co/1MYzUEDcdP",
    "60": "This has been a rough period for LeBron James and the Los Angeles Lakers. My latest for @thehill. https://t.co/ugPiBKVruR",
    "61": "Lakers' LeBron James placed in NBA's COVID-19 health and safety protocols, could miss several games\nhttps://t.co/P3S8DESBzr\n\n#losangelessports #lebronjames #losangeleslakers #basketball #news",
    "62": "@BBallInsiders @Suns Ahem. How can BBall Insiders not know that the longest winning streak in history is 33 games by the Los Angeles Lakers, when Jerry West, Wilt, Baylor (retired during season), Gail Goodrich, and a guy named Pat Riley were playing. How can you be an insider if you don't know sh*t?",
    "63": "Los Angeles #Lakers star LeBron James enters NBA's COVID-19 protocols - https://t.co/UtHBJdmfIt #NBA #NBATwitter #NBATwitterLive #LakeShow https://t.co/urnuy3trEu",
    "64": "Los Angeles Lakers' LeBron James in health and safety protocols; expected to miss several games, sources say - ESPN India https://t.co/OAeFoPWOi9 https://t.co/F6qp04TW36",
    "65": "Los Angeles Lakers' LeBron James in health and safety protocols; expected to miss several games, sources say.\n\n#LA #Lakers #NBA #LeBronJames https://t.co/TnCds96vAh",
    "66": "2021-2022 Lakers Youth Foundation November YOU Grant | Los Angeles ... (Los Angeles Lakers)\n\nCongratulations to Social Justice Learning Institute on winning the Lakers Youth Foundation ...\n\nAdd your highlights:\nhttps://t.co/Ku8iTu7vA4\n #Education",
    "67": "Los Angeles Lakers star LeBron James enters NBA's COVID-19 protocols https://t.co/swZDtsR003 https://t.co/RSVm6IL4P7",
    "68": "Lakers star LeBron James to miss game tonight after entering COVID-19 health protocols https://t.co/ryJOqm0NwD",
    "69": "Los Angeles Lakers' LeBron James in health and safety protocols; expected to miss several games, sources say https://t.co/7KJD90LaYL",
    "70": "Los Angeles Lakers’ LeBron James enters NBA COVID-19 protocols, out against Sacramento Kings https://t.co/FGFxqScNnJ",
    "71": "Los Angeles Lakers’ LeBron James enters NBA COVID-19 protocols, out against Sacramento Kings https://t.co/l32v2Uob0U",
    "72": "#RecentSportNews #hotsports #latesports #sportblog #sportlisting LeBron in health and safety protocols, out Tues.: LeBron James has entered the league’s health and safety protocols and will miss Tuesday’s game against the Kings, the Los Angeles Lakers… https://t.co/lJMRiQBDHj",
    "73": "@BleacherReport Maan... the Los Angeles Lakers got to be the most interesting team in all of American Sports oh, it's literally something every other day",
    "74": "Russell Westbrook ranks 72nd (0.110) in DEF Win shares to lead the Los Angeles Lakers in this category of players who have played at least 10 games.\n\nAustin Reeves is 2nd at 87th (0.102)\nMalik Monk is 3rd at 102 (0.905)\n\nDidn't expect to see that stat from the Brodie lol https://t.co/r0mhJFGUr8",
    "75": "The Los Angeles Lakers &amp; The Cursed Season",
    "76": "#RecentSportNews #hotsports #latesports #sportblog #sportlisting LeBron in health and safety protocols, out Tues.: LeBron James has entered the league’s health and safety protocols and will miss Tuesday’s game against the Kings, the Los Angeles Lakers… https://t.co/FTOfUm3ZkF",
    "77": "@TreesapJake My high school basketball team destroyed their opponents by 50 points in a game last week. Should they now be paid the same as the Los Angeles Lakers? I mean, it's the same sport, right? There's absolutely no difference at all between the two teams and their situations, right?",
    "78": "Michael Jordan Chicago bulls Los Angeles Lakers Magic Johnson newspaper 1 of 6 https://t.co/CZfBjqDnVq eBay https://t.co/EpoGMtUo2H",
    "79": "Los Angeles Lakers star LeBron James has entered the NBA’s health and safety protocols and will miss Tuesday’s game against the Sacramento Kings, the team announced. https://t.co/OwrcotyaAb",
    "80": "#SportsNews LeBron in health and safety protocols, out Tues.: LeBron James has entered the league's health and safety protocols and will miss Tuesday's game against the Kings, the Los Angeles Lakers announced. https://t.co/Q7cdGVn120 https://t.co/YDsFrgthFx",
    "81": "Los Angeles Lakers star LeBron James won't play against the Sacramento Kings at Golden 1 Center tonight after he entered COVID-19 health and safety protocol, the team announced.  https://t.co/g3gX0bHDcH",
    "82": "Back LOS ANGELES LAKERS to BEAT Sacramento Kings tonight in the @NBA (Game Starts at 03.10 GMT) #NBA #Basketball",
    "83": "Los Angeles Lakers star LeBron James will not play against the Sacramento Kings on Tuesday after entering NBA health and safety protocols. https://t.co/87dwSvWsce",
    "84": "Los Angeles Lakers star LeBron James will not play against the Sacramento Kings on Tuesday after entering NBA health and safety protocols. https://t.co/znQydFO5xY",
    "85": "Los Angeles Lakers star LeBron James will not play against the Sacramento Kings on Tuesday after entering NBA health and safety protocols. https://t.co/7sQsbLJccB",
    "86": "Los Angeles Lakers’ LeBron James enters NBA COVID-19 protocols, out against Sacramento Kings https://t.co/2X23vaBi1b #NBA #LosAngelesLakers #YB",
    "87": "BREAKING: Los Angeles Lakers star LeBron James has entered the NBA's health and safety protocols and will not play tonight against the Sacramento Kings, according to reports. https://t.co/F25wszJVM0",
    "88": "Los Angeles Lakers star LeBron James has entered the NBA's health and safety protocols and will miss Tuesday's game against the Sacramento Kings.\n\nhttps://t.co/zmKXthuEOj",
    "89": "LeBron James suddenly declared unavailable to Los Angeles Lakers for tonight’s game https://t.co/vg8s1wZgmw",
    "90": "The Los Angeles Lakers have announced that LeBron James has entered the NBA's health and safety protocols and is out for tonight's game against the Sacramento Kings.",
    "91": "Today's NBA Picks: 10:10 PM ET - Los Angeles Lakers vs. Sacramento Kings - 42 PICKS AVAILABLE: https://t.co/hYEhRbvbMc #nba",
    "92": "At this point this is me everytime a beat writer says\n\n\"Los Angeles Lakers...\" https://t.co/sKFsODakkD",
    "93": "Los Angeles Lakers' best and worst 2-man lineups by net points per 100 possessions when those players are on the floor (minimum 100 minutes):\n\nCarmelo Anthony and LeBron James (+11.5)\n\nAvery Bradley and Malik Monk (-22.0)",
    "94": "Los Angeles Lakers say LeBron James has entered NBA’s health and safety protocol.",
    "95": "BREAKING: Los Angeles #Lakers F LeBron James has entered the #NBA’s health and safety protocols and miss the game tonight against the Sacramento #Kings. https://t.co/BaG5ItQ5yO",
    "96": "BREAKING: LeBron James has entered health and safety protocols and is out tonight vs. Sacramento &amp; for the coming days, according to the Los Angeles Lakers.",
    "97": "@SInow @SIChrisMannix The  Los  Angeles  Lakers  have  to  much  talent   to  be  a  500  team  !  Someone  on  this  team  should   show   some  leadership  ability  !#LAKESHOW#BEATKINGS",
    "98": "⏰ 05:00 (GMT +2)\n🏀 BASKETBALL -  NBA\n🇺🇸 Sacramento Kings vs Los Angeles Lakers\n👉 Lakers -2.5 handicap @ 1.70\n\n#betting #basketball #NBA #NBATwitter https://t.co/oo1zoGUKnt",
    "99": "Lakers: Los Angeles Has a Chance to Go On a Hot Streak Over the Next 2 Weeks\n\nhttps://t.co/pDTpS6ZyDL",
    "100": "NBA Games Today: 🔥🔥\nNew York Knicks vs Brooklyn Nets\nMemphis Grizzlies vs Toronto Raptors\nLos Angeles Lakers vs Sacramento Kings\nGolden State Warriors vs Phoenix Suns\nDetroit Pistons vs Portland Trail Blazers",
    "101": "@CaipiraTips Toronto Raptors\nBrooklyn Nets\nLos Angeles Lakers\nPortland Trail Blazers\nGolden State Warriors\nFlamengo\nAmérica-MG\nNew England Revolution\nEmpate",
    "102": "Brooklyn Nets big Blake Griffin sought the help of Los Angeles Lakers center and former teammate DeAndre Jordan after moving to the bench.  https://t.co/y8ASwdHESE",
    "103": "NBA Betting Preview: Sacramento Kings vs. Los Angeles Lakers https://t.co/DlNEGH0oxB",
    "104": "From @CaesarsSports: A Nevada bettor placed $285,000 on Lakers at Kings under 227 (-110) for a total potential payout of $544,090.90 and another $245k on Kings +5 (-110) for a total potential payout of $467,727.25. Sacramento is a 4-point home underdog to Los Angeles.",
    "105": "Los Angeles Lakers at Sacramento Kings - 11/30/21 NBA Picks and Prediction https://t.co/WFGPVKTIHd #NBA #NBAPick #FreePick #FreePicks #SportsBetting #ExpertPick #NBATwitter #ExpertBettingAdvice #sportsbettingadvice #handicappers #SportsGambling #Picks #LakeShow #SacramentoProud https://t.co/zxWvMdcYrb",
    "106": "Houston Rockets\nLA Clippers\nLos Angeles Lakers\nMemphis Grizzlies\nMiami Heat\nMilwaukee Bucks\nMinnesota Timbwervoles &amp; Lynx\nOklahoma City Thunder\nOrlando Magic\nIndiana Pacers\nPhiladelphia 76ers\nPhoenix Suns\nSacramento Kings\nSan Antonio Spurs\nUtah Jazz\nWashington Wizards",
    "107": "A typical day in my \"Meta\" Los Angeles --  I wake up and tweet and then give my early pm urban economics lecture at USC and then I take my drone 3 miles North to https://t.co/YlvM8kDgUQ Arena to play power forward for the Lakers.  I would end the night at a Beverly Hills disco.",
    "108": "In this essay, I will use a Division of Labor framework to analyze the underperformance of the Los Angeles Lakers thus far into the 2021-2022 NBA Season.",
    "109": "Los Angeles Lakers visits Sacramento Kings Predictions and Preview for 11/30/2021 today.  Who are we taking in this game?  Find out now. #NBATwitter #Punters https://t.co/KlZiYqCsvM",
    "110": "Looking for a value bet?  See if the Los Angeles Lakers-Sacramento Kings Predictions and Preview for 11/30/2021 is one in our preview.  No crazy hype just a prediction and preview. #NBATwitter #Punters https://t.co/KlZiYqCsvM",
    "111": "Celebrity Laker fan Jack Nicholson was sitting courtside for this Clippers home game, despite the Lakers also playing in Los Angeles that evening.\n\nWhen the Clippers arrived in L.A. in '84, Jack also had Clippers season tickets at the L.A. Sports Arena. https://t.co/4nZVuZmUet https://t.co/aakTkf95Ex",
    "112": "NBA Betting Picks: Los Angeles Lakers vs. Sacramento Kings Preview https://t.co/y5RwEeD8bk",
    "113": "@FansOfLeBron  los Angeles Lakers star LeBron James, who hasn't hesitated to take shots at Republican legislators and even Kyle Rittenhouse, has faced criticism for his posture toward the Chinese Communist Party.but is in favor of the ccp killing millions of there own citizens",
    "114": "Director Adam McKay explains how his Lakers project led to a split ... (Los Angeles Times)\n\nWhen director Adam McKay and his former creative partner Will Ferrell broke up their product...\n\nAdd your highlights:\nhttps://t.co/qMIt4y9vYA\n #LA_Lakers",
    "115": "Injury Update: Trevor Ariza | Los Angeles Lakers (Los Angeles Lakers)\n\nOn Monday afternoon, prior to the team's flight to Sacramento, Trevor Ariza addressed report...\n\nAdd your highlights:\nhttps://t.co/cplowKpUhH\n #LA_Lakers",
    "116": "Three Things to Know: Lakers at Kings - 11/30/21 | Los Angeles Lakers (Los Angeles Lakers)\n\nThe Lakers (11-11) made it a perfect 5-0 when playing on Sundays after their 110-106 victory...\n\nAdd your highlights:\nhttps://t.co/h5CLvEI3kf\n #LA_Lakers",
    "117": "Over 3 yrs. from now My LOS ANGELES LAKERS gone be the TORONTO LAKERS..the RAPTORS will be the CANADA RAPTORS 🏀 https://t.co/tutEA487wH",
    "118": "Los Angeles Lakers: 3 potential trade packages for Russell Westbrook https://t.co/cx0xmC1EYR   Lakers management team team ‘hit and miss’ until they get it right?",
    "119": "@LakersSpin number 2 NBA Basketball team is called @Lakers &amp; Los Angeles Lakers with the player is called @KingJames!!!!",
    "120": "Kings vs Lakers tonight 👊 \n\n- Sacramento is 16-10 against Los Angeles since the beginning of the 2014-15 season (8-5 at home)\n\n- The Kings are 4-5 vs the Lakers at Golden 1 Center\n\n- Tyrese Haliburton career-averages vs LAL (3 games): 17.0 PTS, 4.0 REB, 7.0 AST, 50% FG, 50% 3PT) https://t.co/fnF2JNASNZ",
    "121": "A Bizarre Los Angeles #Lakers Lineup Could Become Surprisingly Crucial to Saving What’s Been a Disappointing... https://t.co/YdesaFINiC",
    "122": "Quick trip up to Sactown \n\n⏰: 7:00 p.m. PT\n📺: @SpectrumSN \n📻: ESPN LA 710 &amp; 1330 KWKW\n\n#LakeShow x @socios \n\nhttps://t.co/maCdkPTQdf",
    "123": "Trade #3: Los Angeles Lakers\n\nWestbrook gets shipped down the hall in exchange for longer term deals. Westbrook would be a better fit with the Clippers personnel and the Lakers would finally have playable role players who can stretch the floor and aren't ball-dominant. https://t.co/6ypaR6ppLx",
    "124": "Michael Westbrook of the Los Angeles Lakers ought to be allowed to play his own way in a basketball game that makes him comfortable and score and score points",
    "125": "Analyst: “Lakers can turn it around, but they aren’t the best in the West” #LosAngelesLakers https://t.co/s2Ik9P4ZlW",
    "126": "𝗚𝗔𝗠𝗘𝗗𝗔𝗬\n🏀 » Los Angeles Lakers at Sacramento Kings\n⏰ » 7:00 PM PST\n📺 » NBCS CA\n📍 » Golden 1 Center https://t.co/WwMT2p5tN1",
    "127": "Trade #3: Los Angeles Lakers\n\nThe Lakers swallow their pride and give up on their vets on expiring deals and a future pick for a 40%+ 3P shooter to put alongside their atrocious spacing. \n\nWe clear up cap space going forward and get a possibly invaluable draft pick. https://t.co/kHN1okgVTQ",
    "128": "Game Night... Los Angeles Lakers vs The Sacramento Kings. Lakeshow 🏀 🏀 🏀 🏀 https://t.co/GfhDuLv4Ky",
    "129": "GAMEDAY!📍\n-\nThe Los Angeles Lakers are taking on the Sacramento Kings tonight at 7:00 PM PST tonight in the Golden 1 Arena. 💜💛\n-\nWho do you think will win this game tonight? 🤔 \n- \nFollow @lalakersquad for more! 🔥 https://t.co/usJA97iMjJ",
    "130": "Let's do this. It's Game Day. https://t.co/dvAdH1VfJk",
    "131": "Consensus Line Move:\n2021-11-30 Los Angeles Lakers at Sacramento Kings from 226.00 to 227.00\nOver up to the task\n#NBA #sportsbook #pythonprogramming #businessowner",
    "132": "Today's Top NBA Consensus (So Far):\n\nGS Warriors 77%\nLos Angeles Lakers 63%\nToronto Raptors 62%\nBrooklyn Nets 61%\nPortland Trail Blazers 60%",
    "133": "Lakers said  Avery Brady underwent MRI last night in Sacramento that \nshowed UCL sprain of right thumb. \nHe will undergo further medical testing and physician evaluation upon arrival back to Los Angeles tomorrow.",
    "134": "The best bets from the game between the Los Angeles Lakers and Sacramento Kings, which will happen in Golden 1 Center.  https://t.co/mZLDhPG3nE",
    "135": "2021-11-30\nSacramento Kings(+4.0) - Los Angeles Lakers(-4.0): \nBet on Los Angeles Lakers -4.0\n\n#NBA #basketball #bettingsports #trade @Lakers",
    "136": "LeBron James hasn't had his usual 'pop' going to the rim. Is that j... (Silver Screen and...)\n\nYou may - or may not - have noticed that Los Angeles Lakers superstar LeBron James has been ...\n\nAdd your highlights:\nhttps://t.co/jtcZs5EWpx\n #LA_Lakers",
    "137": "Kings center Richaun Holmes is set to return tonight vs Los Angeles after missing three games due to an eye contusion and non-COVID illness 👏\n\nLakers forward LeBron James is currently listed as questionable. https://t.co/xMp4MTP0nD",
    "138": "Lakers injury report for tonight vs. Kings #AnthonyDavis #AveryBradley #LeBronJames #LosAngelesLakers #SacramentoKings https://t.co/Yw6ojvvRxK",
    "139": "Los Angeles Lakers head coach Frank Vogel explained how the small-ball lineups have helped improve the spacing for the Big 3.  https://t.co/FgLZa43ECO",
    "140": "@KingRocfella lmao pity me please \n\ni stay up to watch the los angeles lakers be useless 😩",
    "141": "Check out this LCS in LA and a little surprise trip to the LAKERS GAME! https://t.co/0Sm2HT3O2Q #localcardshop #sportscards #sportscardscollector #losangeles #Lakers @ Los Angeles, California https://t.co/YPRd2HVDJp",
    "142": "NBA Rumors: Lakers-Kings-Sixers Trade Would Send Harrison Barnes &amp; Buddy Hield To Los Angeles https://t.co/Z6xOO2xWH2",
    "143": "NBA Rumors: Lakers-Kings-Sixers Trade Would Send Harrison Barnes &amp; Buddy Hield To Los Angeles\nhttps://t.co/itmCCJcr23",
    "144": "Anthony Davis says it's up to Frank Vogel whether or not team plays... (Silver Screen and...)\n\nThough the Los Angeles Lakers have gone through many changes since Frank Vogel took over as ...\n\nAdd your highlights:\nhttps://t.co/b30MLqXC5Z\n #LA_Lakers",
    "145": "Check my betting analysis for tonight's showdown between the Phoenix Suns and the Golden State Warriors and also for Sacramento Kings vs Los Angeles Lakers rematch:\nhttps://t.co/1SN60cmB9M",
    "146": "Here is what you need to know as the Los Angeles Lakers head north to face the Sacramento Kings.  https://t.co/6iHKBpYBFE",
    "147": "Column: You don’t get to comment on the Los Angeles Lakers. Hack. https://t.co/adUhlANXZw",
    "148": "NBA Betting Picks: Los Angeles Lakers vs. Sacramento Kings Preview https://t.co/QwLngHfklB",
    "149": "The Staples Center located in Los Angeles, home of the  @Lakers and other professional sports team, announced recently that it would rebrand as the https://t.co/dZLUsRJ8ym Arena. \n\n#cryptocurrency #blockchain #bitcoin #ethereum  #opensource #altcoins \nhttps://t.co/Eg9RLVe67x",
    "150": "Yall watching Suns vs Golden State instead of the masterclass beautiful basketball game that is gonna be The Sacramento Kings vs. The Los Angeles Lakers",
    "151": "Sacramento Kings vs Los Angeles Lakers 11/30/21 NBA Picks, Predictions, Odds » Sports Chat Place https://t.co/PiWCFYGlGk #NBA #NBAPick #FreePick #FreePicks #SportsBetting #ExpertPick #NBATwitter  #ExpertBettingAdvice #BettingTipster #Handicapper #Sports #lakeshow #SacramentoProud https://t.co/48LcZx8BrO",
    "152": "Los Angeles Lakers vs. Sacramento Kings Preview | SportsNus https://t.co/aa5NvQbHqp",
    "153": "five best Russell Westbrook trade scenarios for the Los Angeles Lakers\n\n https://t.co/wIyGMqrZvL",
    "154": "Los Angeles Lakers vs Sacramento Kings 11/30/2021 Picks Predictions Previews\n\nhttps://t.co/As83LOu8rO\n\n#basketballpicks #NBApicks #NBAparlay #NBAbetting #NBAprediction #NBA #sportspicks #odds #picks #freepick #freepicks #expertpicks #sportsbetting #handicapper #Lakers #Kings https://t.co/Vc8KDxDuxe",
    "155": "Bro really named his album Los Angeles Lakers 😔 https://t.co/J7atSNPgZV",
    "156": "Head-to-toe Lakers purple is the primary color for the 2021-22 Los Angeles @Lakers Nike NBA City Edition Jersey, with touches of baby blue from the OG championship team in Minneapolis. The belt buckle includes the “L” logo from the three-peat era of the 2000s. https://t.co/3YX3GRh5fe",
    "157": "🚨NOW AVAILABLE🚨\n\n📸 Los Angeles Lakers LeBron James Nike 2021/22 Swingman Player Jersey - Icon Edition (Non Diamond Edition)\n\n🔗https://t.co/4YPSdlm7rT\n\n*Also available Association Edition, City Edition, and Statement Edition https://t.co/YUAaZ8oVef",
    "158": "Los Angeles Lakers forward Trevor Ariza gave an update on how he feels after having ankle surgery earlier in the year.  https://t.co/R7x91qANm6",
    "159": "Top #NBA play today: Los Angeles Lakers -5.0 (6.7 value)\n\nLike = tailing",
    "160": "Analyzing Tuesday’s Los Angeles Lakers at Sacramento Kings odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/sTwaqM16cq",
    "161": "Los Angeles Lakers at Sacramento Kings odds, picks and prediction https://t.co/2lwrkOqj2D",
    "162": "#CryptoDotCom New Name for #StaplesCenter \n\nHome to Los Angeles #Lakers \n\n#CryptoCurrency https://t.co/x1tSYwWvKD",
    "163": "DasHaus made a bet!\n\nEvent: Los Angeles Lakers vs Sacramento Kings #NBA\nBet: Sacramento Kings TO WIN +5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "164": "DasHaus made a bet!\n\nEvent: Los Angeles Lakers vs Sacramento Kings #NBA\nBet: Los Angeles Lakers TO WIN -5\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "165": "Los Angeles Lakers head coach Frank Vogel explains why he still plays Avery Bradley despite what the statistics say.  https://t.co/aFQHh7Aurb",
    "166": "The Los Angeles Lakers received an extremely low grade from The Athletic through 22 games.  https://t.co/gCJShoF6Pu",
    "167": "🚨JUST RELEASED🚨\n🏷️Get 10% off w/ promo code HONEY10\n\n📸Mitchell &amp; Ness Los Angeles Lakers Overtime Fleece Crew \n\n🔗https://t.co/oeu1lTEvjv https://t.co/AjfIvRevoe",
    "168": "The Kings are 1-7 ATS in their last eight games as home underdogs.  Los Angeles is 20-8-1 ATS in its last 29 meetings in Sacramento.  Bet the Lakers Tuesday.",
    "169": "Jordan’s late era #Bulls voted all-time #NBADynasty - but who decides how long a dynasty lasts? \n\n11995-1998 Chicago Bulls (46%)\n21969-1976 Boston Celtics (24%)\n32015-2018 Golden State Warriors (15%)\n41979-1989 Los Angeles Lakers (12%)\n51980-1987 Boston Celtics (3%) https://t.co/YAMfCGgsF1",
    "170": "#3 Randy Cedeño \nNba\nToronto \nNets\nPortland \nSuns\nLakers \nNhl\nBoston \nNew jersey \nFlorida \nWild\nNashville \nStlouis \nDallas rl \nLos Angeles \nFutbol \nJuventus \nBraga\nOriente Petrolero",
    "171": "🚨 It's Game Day!\n\n🏀 Los Angeles Lakers @ Sacramento Kings\n\n🕒 Tip off alle 4:00 🇮🇹\n\n💬 Live tu Telegram https://t.co/ggnxaixAHp\n\n#LakeShow #SacramentoProud #NBA75 https://t.co/3P0ybrjDfX",
    "172": "Possibly a way to fix the Los Angeles Lakers:\nLeBron, pass the ball more. You have more scorers on your team. You are a amazing passers, if you pass up and don't take a lot of shots, you could easily get 15 and 10 a night.The whole team needs to keep their composure closing games",
    "173": "Adam McKay’s friendship with Will Ferrell went sour over upcoming HBO Los Angeles Lakers project https://t.co/Me7R4WK2GX https://t.co/FS1NWf6X7Q",
    "174": "25% off Nike NBA Los Angeles Lakers Shorts. Use code CM25\n\nhttps://t.co/1ZftY54Gtz\n\nFree shipping w/FLX account\n\n#Ad https://t.co/KfUvtRxrbZ",
    "175": "Adam McKay’s friendship with Will Ferrell went sour over upcoming HBO Los Angeles Lakers project https://t.co/20cOWB1qRw https://t.co/RrWokZnjp3",
    "176": "@micahswaifuu Vakifbank is the equivalent of the Los Angeles Lakers of the NBA. Maraño will be playing alongside Isabelle Haak if Sweden, Gaby of Brazil, Hackley of USA, and the core of the Turkish National team of Ozbay, Boz and Senoglu. Former players are Zhu Ting and Shiela Castro.",
    "177": "Los Angeles Lakers star Anthony Davis wants the team to defeat the Sacramento Kings Tuesday following Friday’s triple-overtime loss.  https://t.co/EyGzJ5pUQm",
    "178": "Check out LOS ANGELES LAKERS MITCHELL &amp; NESS ADULT XL PURE SHOOTER MESH BUTTON DOWN JERSEY  https://t.co/1Gt9Vb01YT via @eBay",
    "179": "Adam McKay Says He No Longer Speaks With Will Ferrell After Falling Out Over Los Angeles Lakers Series https://t.co/o0RmAq3UC3 https://t.co/xcaBDUGMbY",
    "180": "Sacramento #Kings at Los Angeles #Lakers |11/30/21 | Free Picks and Prediction \n\n#NBA #NBAPick #NBAPredictions #Lakers https://t.co/e1kCDDEYcj",
    "181": "📷 | Damiano David leaving the Lakers game at the Staples Center in Los Angeles. (28.11.21) https://t.co/Z9CSVeiM3w",
    "182": "📷 | Damiano David and Thomas Raggi leaving the Lakers game at the Staples Center in Los Angeles. (28.11.21) https://t.co/Xbtv2Bk6xF",
    "183": "📷 | Damiano David leaving the Lakers game at the Staples Center in Los Angeles. (28.11.21) https://t.co/JXQgI3dV1G",
    "184": "#NBA Preview: Mr. Opposite Picks takes #SacramentoKings +4.5 Vs. Los Angeles #Lakers 11/30 https://t.co/EjG81NRpJv",
    "185": "Live pregame, in-game and postgame updates on today’s NBA game between the Sacramento Kings and Los Angeles Lakers at Golden 1 Center. https://t.co/V4y3Q7W7Tl",
    "186": "Live pregame, in-game and postgame updates on today’s NBA game between the Sacramento Kings and Los Angeles Lakers at Golden 1 Center. https://t.co/1U5p8bZcbp",
    "187": "Los Angeles Lakers @ Sacramento Kings\n\nhttps://t.co/nsJ5VoVYIq",
    "188": "Live pregame, in-game and postgame updates on today’s NBA game between the Sacramento Kings and Los Angeles Lakers at Golden 1 Center. https://t.co/tVV0DgJukX",
    "189": "Brooklyn Nets big Blake Griffin sought the help of Los Angeles Lakers center and former teammate DeAndre Jordan after moving to the bench.  https://t.co/EA652lnfpn",
    "190": "Lakers’ Big 3 playing inspired basketball will help get them more wins, says Robert Horry #LosAngelesLakers #RobertHorry https://t.co/ifnAFeW4Wz",
    "191": "Jalen Rose: “Lakers will not make it to Finals unless they’re a Top 4 seed” #LosAngelesLakers https://t.co/wB0FcFR9An",
    "192": "Trevor Ariza on Lakers: “This team is extremely talented, has a lot of different weapons” #LosAngelesLakers #TrevorAriza https://t.co/iQmPKw9u9U",
    "193": "NBA Basketball Game Betting Picks Simulator: 10:10 PM ET - Los Angeles Lakers vs. Sacramento Kings - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/cizKcQqewr #nba #sportsbetting #freepicks #cappertek",
    "194": "Adam McKay Says He No Longer Speaks With Will Ferrell After Falling Out Over Los Angeles Lakers Series https://t.co/Z4ueSGL9hx via @DailyCaller",
    "195": "kobe bryant \nmade his debut with the los angeles lakers 24+1 years ago \ntoday \n\n11/04/2021/ \n\n🐍💜💛\n\nthanks @wildopenarts \nthanks #oursong \nthanks #kobe \nalways \n\n#artbyterencelan \n#mamba4ever \n#kobebryant\n#kb824\n#lakers\n#nba \n#art https://t.co/jtxNvEguKs",
    "196": "Los Angeles Lakers @ Sacramento Kings\nPick : Sacramento Kings.\nBasketball. NBA",
    "197": "Lakers' game plan for Kings rematch all about snarl and LeBron James' versatility https://t.co/2f5sTcxoky",
    "198": "Frank Vogel: “You have to win the second half differently than you won the first” #FrankVogel #LosAngelesLakers https://t.co/D8irrIDSWA",
    "199": "Brooklyn Nets - New York Knicks\nToronto Raptors - Memphis Grizzlies\nSacramento Kings - Los Angeles Lakers\nPhoenix Suns - Golden State Warriors\n\nBet slip link: https://t.co/Mcc9Dy7T9m https://t.co/Aljhzc3GAz",
    "200": "Los Angeles Lakers X New York Knicks – Ao Vivo https://t.co/3k75EIcVGZ",
    "201": "SOURCE SPORTS: Lakers Vs Warriors Play in Game Got Massive Ratings\n\nThe NBA got everything it wanted and then some on Wednesday with the play-in game between the Golden State Warriors and Los Angeles Lakers. The league added the play-in tournament for ra https://t.co/HPkiUzPEHe",
    "202": "#youtube Frank Vogel REVEALS the Los Angeles Lakers will PLAY LeBron James at the CENTER position https://t.co/f4FeBMQC69",
    "203": "#youtube Anthony Davis and LeBron James on Los Angeles Lakers wanting PAYBACK against Sacramento Kings https://t.co/x8M7JadsfR",
    "204": "@SOULbeautifulme There are 3 great Basketball teams in Los Angeles... The Lakers, The Sparks &amp; South Bay. The rest are just Flippers. 😂",
    "205": "Detroit Pistons game score vs. Los Angeles Lakers: Live scoring updates https://t.co/YE86M0Fa1V",
    "206": "ALERT: New high roller bet posted!\nA bet has been placed for $5028.2 on Sacramento Kings - Los Angeles Lakers to win $9,654.15.\nTo view this bet or copy it https://t.co/anyI7c4aSr https://t.co/uNaFzUppdt",
    "207": "Los Angeles Lakers star LeBron James: “(This season) ranks right at the top of any other challenge I’ve had in my career.”  https://t.co/nWAAYmIiYX",
    "208": "The Los Angeles Lakers, without having to play a game tonight, are a half game out of 4th in the west with a rematch against the Sacramento Kings slated for Tuesday night.  \n\n#together https://t.co/o4Jn70L46Q",
    "209": "Thanks to https://t.co/hRZW5PXEdI, I'll be able to watch the entirety of the 1991 NBA Finals between the Chicago Bulls and the Los Angeles Lakers. A series I was too young to see at the time.",
    "210": "CURRENT REVIEW: The Land of 10,000 Lakes, The Lakers 17 NBA Championship History\nAs one of the most successful basketball teams ever, the Los Angeles Lakers are also a hugely successful franchise worth millions.\nREAD MORE: https://t.co/iZfPBrvNnc https://t.co/TgPqZtDX51",
    "211": "Peja Stojakovic holds the franchise record for 3-pointers in a game with 10. That game was also played in Los Angeles, but against the Lakers.",
    "212": "Down front at the Staples Center for Lakers vs Pistons with Jeff. LeBron delivered, LA for the win! 110-106 🏀 @ Los Angeles, California https://t.co/x5ahEAQFqc",
    "213": "Check out this listing I just added to my #Poshmark closet: NWT 1996-97 Los Angeles Lakers Kobe Bryant Jersey. https://t.co/EUoTf7sUwi #shopmycloset @poshmarkapp",
    "214": "In a much-anticipated re-match between the Los Angeles Lakers and Detroit Pistons, all eyes were on LeBron James and Isaiah Stewart.",
    "215": "Much of the talk around the Los Angeles Lakers lineups has been around the usage of Anthony Davis at the five. \nDavis has indeed increased his time played at the position, with Cleaning the Glass showing 70 percent of his minutes coming at the five so far",
    "216": "FYI: 20+ games into the NBA season, the Minnesota Timberwolves are ahead of the Los Angeles Lakers in the Western Conference standings.",
    "217": "Hall of Fame Coach Phil Jackson led the Patroons to the 1984 CBA Championship.  He moved on to the NBA and led the Chicago Bulls to 6 NBA titles &amp; the Los Angeles Lakers to 5 NBA titles!  It all started in Albany, NY!",
    "218": "Every time the Bulls beat a team, it's basically getting beaten by the 2017-18 Los Angeles Lakers backcourt LOL https://t.co/XYzlDuOqg5",
    "219": "Here is how the Los Angeles Lakers graded individually in a close win against the Detroit Pistons.  https://t.co/vXPH8T7wus"
}