{
    "0": ".@OrlandoMagic coach Jamahl Mosley talks about building off last night's clutch win as they take on the Thunder tonight. #MagicTogether https://t.co/GluACVYty5",
    "1": ".@OrlandoMagic coach Jamahl Mosley talks about building off last night's clutch win as they take on the Thunder tonight. #MagicTogether https://t.co/rDvYGMilYx",
    "2": "Kyrie Irving got traded to the Orlando magic for a boat load of picks https://t.co/CYAc0CahUE",
    "3": "Such a big win last night for our @OrlandoMagic over the Golden State @Warriors - here’s to more of the same tonight against @okcthunder! #MagicTogether https://t.co/79sKOFs4C3",
    "4": "We are Detroit and Orlando Magic fans today boys. Lfgoooo",
    "5": "Almost time let's go @OrlandoMagic #MagicTogether https://t.co/XIiEWq37d1",
    "6": "Oklahoma City Thunder (+2.5) vs. Orlando Magic #ThunderUp #MagicTogether #NBA #NBATwitter #NBA75",
    "7": "On my first @OrlandoMagic broadcast in what feels like forever, bout to hop on with @JakeChapmanOM for the pregame on @969thegame. I'll be on @ half/post-game as well. \n\n@OrlandoMagic vs @okcthunder",
    "8": "📅: GAMEDAY @ 8:00 PM\nOrlando Magic Vs. Oklahoma City Thunder - NBA League 2022\n🎟️🎥: https://t.co/2fZsocGNOv\nOnly Available For Registered Users. Create a FREE account to get access",
    "9": "@samucaagfbpa ORLANDO MAGIC https://t.co/oxjyI5kx3Z",
    "10": "@OrlandoMagic @MichelobULTRA @The_ColeAnthony these 2 players are better than what OKC has haha",
    "11": "@samucaagfbpa Orlando Magic",
    "12": "📍 OKC\n\n#UltraDrip x #MagicTogether https://t.co/N32RRUHreu",
    "13": "Lmfao warriors fans already looking to replace Steve Kerr 😂 Orlando Magic are coach killers https://t.co/PelwxFF2OG",
    "14": "The @OrlandoMagic take on the Thunder tonight!\n\nGet ready for the action with Magic LIVE right now on Bally Sports Florida! #MagicTogether https://t.co/W4pDKs2nPq",
    "15": "The @OrlandoMagic take on the Thunder tonight!\n\nGet ready for the action with Magic LIVE right now on Bally Sports Florida! #MagicTogether https://t.co/3MDzIKdsrw",
    "16": "@MagicBamba @slopppybagel @DanteMagic Again, the three biggest difference makers on the court the last 3-4 years have not been draft picks from the Orlando magic (Fultz, WCJ, Vuc ) Give up on the lottery game",
    "17": "@Tozzcast Ugh, why did I take the Warriors +the points last night? I shouldn’t have went against my home town team…never again…Go @OrlandoMagic",
    "18": "This time it's in our house 😤\n\nThunder Live begins now as OKC looks to get revenge against the Orlando Magic at the top of the hour!\n\n@okcthunder | #ThunderUp https://t.co/9RZ1F87KBS",
    "19": "@Magic_PR @OrlandoMagic You will not out tank us",
    "20": "Gonna have to dig deep for an L tonight boys @OrlandoMagic https://t.co/vrxV5G9U0n",
    "21": "Uniforms for Orlando Magic vs Oklahoma City Thunder at 5:00 PM. \n\n#ThunderUp #MagicTogether https://t.co/7uoMZrEcTq",
    "22": "Only 10 more weeks ! 💞✨ Join us and thousands of your friends as we return to the MAGIC in Orlando this year ! June 2-6 2022 only at Disney Resorts 🌈 Full details and tickets at https://t.co/g2u6zESn9Z #1MW #OMW #circuitevents #onemagicalweekend https://t.co/sVK81L8QDo",
    "23": "@Brahim_7_ Orlando magic",
    "24": "Tonight, I am a fan of the Orlando Magic (#MagicTogether ), the Houston #Rockets and the Best Team in the East (#TrueToAtlanta ).",
    "25": "@TeeOhEmm Who are you sports allegiances? \n\nNFL - Chargers\nMLB - San Diego Padres \nNCAA - Aztecs\nNBA - Orlando Magic\nNHL -  ----\nPremier League - X (Brazil: @Gremio )\nMLS - X\n@USLChampionship - @SanDiegoLoyal \nNASCAR - N/A\nF1 - @SChecoPerez - RBR",
    "26": "@OrlandoMagic @Suns S/O to the magic keep doing yall thang @warriors be ready for that fade Worriers",
    "27": "HashTags On Deck! It's GameDay!!\n\n#OrlandoMagicGame74 #ORLvsOKC\n\n#MagicTogether   \nvs\n#ThunderUp   \n\n#OrlandoMagic #MagicTogether  #WeGotAlotPopping #MagicSzn2021\nWE💥G O T💥ALOT💥P O P P I N G https://t.co/HbyO6qW4oH",
    "28": "@meandthisarmy @TheStilt69 @NBAMemes YOU KNEW WHO I WAS TALKING ABOUT THO RIGHT ?\n\nITS BEEN YEARS SINCE THEM NAMES BEEN MENTIONED SO I'M NOT LOSING ANY SLEEP OVER A MISSPELLED NAME 😬 🙃 😅 \n\nHorace did score buddy \nHe did it with the Orlando magic\nAnd \nThe L.A LAKESHOW",
    "29": "@richie_moler @AndyKHLiu cause you face superior defenses in higher stakes games than playing the Orlando Magic in December",
    "30": "@Boards2Buckets @MomentRanks @DreamShake_R youre right, I needed the orlando magic voodoo doll😂",
    "31": "@Sunsupnext @NotMahMaximus @Suns Losing to Orlando Magic is just downright humiliating 💀 &amp; we’re “supposed” to be better than the Suns gtfoh. Warriors are coming off the colossal 2019 loss too so that’s prolly where all this is coming from, context matters. My bad for putting that energy towards y’all",
    "32": "The Orlando Magic is about to tear some shit up.",
    "33": "@Shai_Media Im an Orlando Magic fan tonight",
    "34": "Huge news. Praying the Orlando Magic take a chance on Peter Kiss https://t.co/Lz9Vs65JDi",
    "35": "@Magic_PR @OrlandoMagic God no. The tank battle is in full command tonight",
    "36": "Here is today’s (3/23) pregame media session with @OrlandoMagic Head Coach Jamahl Mosley:\n\n#MagicTogether \n\nhttps://t.co/XlaJi89Dk6",
    "37": "Yes sir, it's that boy that we, at Persona Custom Clothiers, suited up for the 2020 NBA Draft, RJ Hampton @RjHampton14 of the Orlando Magic!! 🏀💪🏀💪 @rjhamptonelite @RJHShowcase @THE_SHOW_DFW https://t.co/bhKXaW6jIe",
    "38": "@JuiceeJoker You’re taking the Steph-less warriors over the Miami heat the night after they lost to the Orlando magic",
    "39": "Orlando Magic",
    "40": "Game 74!\n⁠\n🏀: Magic vs Thunder\n🕔: 7:30 PM⁠\n📻: FM 96.9 | am740 | 101.1 HD-2⁠\n💻: https://t.co/t2LGtOYZ1R⁠\n📱: iHeartRadio App in Orlando https://t.co/2lqIvS6pIi",
    "41": "Here is our guy that we, at Persona Custom Clothiers, suited up for the 2020 NBA Draft, RJ Hampton @rj14 of the Orlando Magic!! #rjhampton @ Paycom Center https://t.co/OFOF1XjdNf",
    "42": "New tumblr post: \"#NBA2K22 Orlando Magic vs Boston Celtics MyLeague PS4 GAMES...\" https://t.co/D8Cgjfgf5D ifttt, youtube",
    "43": "@orlando_cologne @adamlambert Pure magic and perfection!!👏👏👏😍",
    "44": "@OrlandoMagic Magic vs OKC Tank Basketball Baby https://t.co/sm3UbRElFH",
    "45": "Big Chum in the first five tonight 🤝 https://t.co/ELJK0t08x5",
    "46": "Orlando Magic Starters:\n\nCole Anthony\nR.J. Hampton\nFranz Wagner\nChuma Okeke\nMo Bamba\n\nPlayers out:\nGary Harris\nWendell Carter\nMarkelle Fultz\nJalen Suggs\n#MagicTogether #NBA #NBATwitter #NBA75",
    "47": "Huge draft implications in this one. Magic and Thunder are both in the bottom 4 in the standings. Bottom 3 get the most ping pong balls in the lottery. \n\nOrlando also looking to extend their longest win streak of the season -- would be the first time all year winning 3 in a row.",
    "48": "Tonight's starting lineup for the Orlando Magic: Anthony, Hampton, Franz Wagner, Okeke, Bamba https://t.co/bVWH4AMCA2",
    "49": "Wendell Carter Jr. (left wrist/left ankle sprain) is out tonight for the @OrlandoMagic's road game against @okcthunder.\n\nShai Gilgeous-Alexander (ankle) is out for OKC.\n\nThe Magic will start: Cole Anthony, R.J. Hampton, Chuma Okeke, Franz Wagner, and Mo Bamba.",
    "50": "Mark Daigneault says Shai Gilgeous-Alexander will NOT play tonight against the Orlando Magic.",
    "51": "Resultados NBA\nOrlando Magic 94-90 Golden State Warriors \nNew York Knicks 111-117 Atlanta Hawks \nMilwaukee Bucks 126-98 Chicago Bulls\nDenver Nuggets 127-115 Los Ángeles Clippers",
    "52": "Shai Gilgeous-Alexander (right ankle soreness) is OUT tonight, Mark Daigneault said. \n\nSGA will sit against the Magic for the second time in four days.  \n\nOrlando and OKC are separated by half a game. The tank race is heating up with 10 games to play.",
    "53": "Shai Gilgeous-Alexander will NOT play tonight against the Orlando Magic per coach Mark Daigneault",
    "54": "@colonelfan53 @JVasJr32 @KlayForTrey If draymond so good then why you losing to the Orlando magic? Even the lakers haven’t lost to them this season 😂",
    "55": "I'm very impressed by what I've seen from @jmclerkin's Orlando Magic this year, and I wish them nothing but the best for the remainder of the season.",
    "56": "@ORLmuse @OrlandoMagic @franzboogie That’s some good company. This man knows the game and has the skill. What’s his ceiling ?",
    "57": "@Magic_PR @OrlandoMagic OKC still will lose to the Magic",
    "58": "@Magic_PR @OrlandoMagic they cant guard heem",
    "59": "🚨@OrlandoMagic INJURY UPDATE:\n\nF/C Wendell Carter Jr. (left wrist/left ankle sprain) will not play tonight at Oklahoma City.\n\n#MagicTogether",
    "60": "It's not too late! Grab your discounted tickets to the USF Night with the Orlando Magic and head to Big Storm Brewing beforehand at 5:30 PM for a Pregame Social with the USF Orlando Alumni Chapter! \nTickets🎫---&gt; https://t.co/BdYn8eC0iS",
    "61": "@NBA_de @OrlandoMagic Very impressive play from our guys last night  especially the German War Bro, the Wagner,'s at the same time I think Cole over dribble at times and don't dish to the open 3 guys, I see that a lot out of his play, once he gets that, the better the team 👍🏾",
    "62": "NFL - Raiders\nMLB - Cardinals\nNCAA - UCF\nNBA - Magic\nNHL - Blues\nPremier League - Liverpool\nMLS - Orlando City\nNASCAR - Was Dale Earnhardt Jr. but not don't care\nF1 - Anyone Alfa Romeo https://t.co/WdUN8Xi0gf",
    "63": "Clearly the Orlando Magic are the best.",
    "64": "@Luke2_k @srchivlm @73Babynewyear @OrlandoMagic THEY DIDNT BEAT MY GOAT CURRY (2x MVP)",
    "65": "@Dtheyounging @DudeRiley7 @SlayYoung23 That’s what I’m saying like being a fan of something means I like something about it wtf is there to like about the pistons if I’m from Detroit the knicks if I’m from New York the magic if I’m from Orlando like these guys are delusional",
    "66": "@papidiagne30 @_spotfire @LuneSanity Orlando Magic 😭",
    "67": "@LanceTHESPOKEN I dislike the trade but we can’t be blind to the 4 year 120 mil contract and still needing to sign Orlando Brown etc.  I would agree the window would be shorter where this trade extends that.  10 is a special player no doubt but Mahomes has to provide the magic.",
    "68": "Go be great tonight @The_ColeAnthony @OrlandoMagic",
    "69": "@RustyBUCKETS321 The Orlando magic will be a play in team next season . Wendell Carter is becoming one of the best big men in the nba and franz Wagner is averaging 15 points while barley taking any shots this team is going places",
    "70": "🏀NBA Views From The Crews S1E6:Dante Marchitelli of the Orlando Magic🏀\n@DanteMagic  joins @DBarrett36 to talk Orlando Magic, NBA, his journey, the future of the Magic, Coach Muss and more.\nITunes: https://t.co/HCioWYXsvZ\nSpotify: https://t.co/tqSTye1xb6\nhttps://t.co/RIEqWq7kk2",
    "71": "@peteschultz19 @imonlyjojo @dennis_k_g @OrlandoMagic They don’t need it, there’s more to it. But I am saying curry is needed for a guaranteed win. If they used valid reasoning and had real life refs, and reasonable gameplay on a few more players it would be a win to for golden state.",
    "72": "@TheDuckisBlue @OrlandoMagic @Vikings @athielen19 The man can definitely ball out. Hooping was his best sport in HS",
    "73": "Why is my name so memeable. First it was Terrence Howard from my TEACHER AND FRIENDS irl\n\nNext it's Terrence from angry birds and this lil wayne song randuk talks about\n\nAND NOW IT'S TERRENCE ROSS FROM ORLANDO MAGIC OSKFSJHFUFJWALGJESHEJG",
    "74": "Curry’siz Golden State Warriors, sonuncu Orlando Magic’e kaybetti\n\nhttps://t.co/cGBF0BqaqJ https://t.co/BQoZ5fvcPg",
    "75": "@carterjrstan @OTOWN4LIFE1 @OrlandoMagic I don’t report people to anyone. I believe in freedom of speech 🤷🏻‍♂️",
    "76": "@currygawker @srchivlm @73Babynewyear @OrlandoMagic but it does tho they beat ya",
    "77": "“No offense to the Orlando Magic” \n\n2 points 3 rebounds 7ast \n\nBum. https://t.co/qwejTXg0mh",
    "78": "@unitedweare23 @Franzchise1 @legendofkelle @SixthManShow And still have not reached the conference finals as recently as the Orlando Magic lol.",
    "79": "@OrlandoMagic @Suns Thanks friend! I believe in #Magic .",
    "80": "@ZacharyLowNBA has made a pick for @okcthunder vs. @OrlandoMagic\n\nPerformance:\nOKC Games: 113-85-3 (57%)\nOverall: 217-183-5 (54%) \n\n#OklahomaCityThunder | #OrlandoMagic\n    \nhttps://t.co/wxi4zc6ULb",
    "81": "@craighofeld has made a pick for @okcthunder vs. @OrlandoMagic\n\n#OklahomaCityThunder | #OrlandoMagic\n    \nhttps://t.co/idMl29SmOA",
    "82": "@HoursCheckmate @WReffner Eh, good and bad.  Disney was horrible.  In 6.5 hours we went on 3 rides and that was with a fast pass.  That day was terrible!  The other days we went to the Orlando Magic game, an airboat alligator tour and golfing. Those days were fun!  I’ll never go to Disney again",
    "83": "@OrlandoMagic @Suns 😂the nerve",
    "84": "90 points against the Orlando Magic team with 19 wins who doesn’t win home games… make it make sense",
    "85": "@30likeimgifted @OTownNBA @goldenstateover @felix_mcfelix @NiMekhi @OrlandoMagic Im sorry",
    "86": "OKC Thunder: POSTGAME REACTION: Orlando Magic vs. Golden State #Warriors 3/22/22 - YouTube https://t.co/K2ww5CEEyJ",
    "87": "@OrlandoMagic is Doc Rivers an idiot??",
    "88": "@sonicvvs @OrlandoMagic he be looking so out of energy when curry not on the court",
    "89": "@CoCoMiKe12 Seeding is not super concerning to me, losing to the Orlando Magic is lol",
    "90": "Delone Catholic's John Gabriel was inducted into the Orlando Magic hall of fame in March. He told a story of how his remarkable basketball life began.\n       https://t.co/67PTEBACeZ",
    "91": "@30formvp @OrlandoMagic fax 😭 we thought this mf draymond was gonna help but he can’t do shit without curry on the court 💀",
    "92": "Delone Catholic's John Gabriel was inducted into the Orlando Magic hall of fame in March. He told a story of how his remarkable basketball life began.\n       https://t.co/2I7MNoJHai",
    "93": "@OrlandoMagic @Suns They did it themselves, you weren’t needed 🤝",
    "94": "Delone Catholic's John Gabriel was inducted into the Orlando Magic hall of fame in March. He told a story of how his remarkable basketball life began.\n       https://t.co/XfWiJEVLGb",
    "95": "@OrlandoMagic Do it again against the Thunder.",
    "96": "@basedgfa @Lass17x @Sageof6turtles What are u talking about?! No one wanted to be there!!! The Lakers were just the better team. The only team that would have had an advantage in the bubble would be the Orlando Magic.",
    "97": "How did the Orlando Magic’s mascot pull off this magic trick? \n\nhttps://t.co/VDRWv7JD0o",
    "98": "@sonicvvs @OrlandoMagic MAN FR 💀😭 curry really had this team looking like title contenders",
    "99": "@srchivlm @73Babynewyear @OrlandoMagic no i’m saying curry &gt; MJ",
    "100": "@OrlandoMagic You just lost the game",
    "101": "Please Orlando beat us for the love of god PLEASE @OrlandoMagic #ThunderUp",
    "102": "@OrlandoMagic @PDQFreshFood Wheres Moe🥺",
    "103": "Who are you sports allegiances? \n\nNFL - Philadelphia Eagles\nMLB - Atlanta Braves\nNCAA - Carolina Hurricanes \nNBA - Orlando Magic  \nNHL -  Carolina Hurricanes\nPremier League - Arsenal\nMLS - Orlando City\nNASCAR - William Byron (but also Bubba/YRB)\nF1 - 🤷🏼‍♂️\n\nFeel free to ask Q’s 😂 https://t.co/aFYKt2EqXu",
    "104": "🌉 Dray's addition to the game verdict against @OrlandoMagic, \"played softly\" and \"not playing good basketball.\" #DubNation https://t.co/Ry8SdSBAeS",
    "105": "\"no disrespect to the orlando magic but thats one of the worse teams in the league\" - draymond green\n\n😂😂",
    "106": "@AybaJeanion @DudeRiley7 @CODWOES @SlayYoung23 You can say that but the magic have been one of the worst ran franchises I’ve ever witnessed , they can’t keep stars, they can’t draft, until now they always in nba 10th - 7th seed purgatory they suck fyi I’m not from Orlando but it’s the closest to me",
    "107": "Who are your sports allegiances? \n\nNFL - Eagles\nMLB - Red Sox\nNCAA - UCF\nNBA - Magic\nNHL - 🤷🏻‍♀️\nPremier League - Norwich\nMLS - Orlando City\nNWSL - Orlando Pride\nBundesliga - RB Leipzig\nGaming - My stepson",
    "108": "If we win Tonight please tweet as if every Magic Player will read it. I know asking for common decency on the internet is not going to happen. So just be as respectful as possible.\n\n#OrlandoMagic #MagicTogether  #WeGotAlotPopping #MagicSzn2021\nWE💥G O T💥ALOT💥P O P P I N G",
    "109": "@BleacherReport @anthonyVslater The @OrlandoMagic outplayed you…no disrespect.",
    "110": "@itsjustlamy @JusLoveTrey @imdanielmendoza @hyper5onic @GnosisIsPower @hizzieschild @cindyperezzzzz @mutantfate It’s not really hypothetical as long it takes in main universe 616, In trials of magneto the eldritch orchards is the one of current chaos magic feats. In fact in her upcoming solo comic series, wanda will be a powerful interdimensional being stated by steve Orlando.",
    "111": "@Dom_2k Demar Derozan was traded to the Orlando Magic",
    "112": "@OrlandoMagic @Vikings @athielen19 Welcome to the Thielen, Orlando.",
    "113": "@30formvp @OrlandoMagic we really can’t the warriors deserve this how tf they lose to the magic 😭 curry gotta do everything for this team bruh",
    "114": "@misterfuneral @currygawker @hongtaeju2 @73Babynewyear @OrlandoMagic already past that lmfaoo",
    "115": "@_b0y1da_ @OrlandoMagic agreed",
    "116": "NBA Basketball Game Betting Picks Simulator: 8:00 PM ET - Orlando Magic vs. Oklahoma City Thunder - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/VJNMrOkxaI #nba #sportsbetting #freepicks #cappertek",
    "117": "From the Magic Kingdom to magical spa treatments, Orlando sparkles with the promise of adventure. Spend a day exploring the world-famous Disney theme parks or screaming your head off on a Universal... \n\nAir ticket from Abu Dhabi to Orlando\nhttps://t.co/yIf8LM88Ba",
    "118": "@yehonala04 Yeah, one of those was NCAA Tournament hero, Jack “Goose” Givens. When I was a kid, Goose was the color commentator for Orlando Magic games while Chip Carey did the play-by-play.",
    "119": "Check out 1992 Topps Shaquille Oneal Rookie Card #362 PSA Graded NM 7 ORLANDO MAGIC #2  https://t.co/v6SfNSYIZf via @eBay",
    "120": "@OrlandoMagic I took it out the package and the arm fell https://t.co/rwOyUWkamK",
    "121": "@Desiree_Nikoll @warriors @NBCSAuthentic @957thegame @betwayusa Losing to the Orlando Magic is about as bad as it gets!!",
    "122": "@JKepnerWFTV @OrlandoMagic Thunder fans everywhere hope that record improves to 8-6 tonight.",
    "123": "The @OrlandoMagic are 7-6 since Feb. 25th.  \n\nGive HC Jamahl Mosley a ton of credit for the effort he's getting out of this team at the end of a tough season.",
    "124": "Who are you sports allegiances? \n\nNFL - Bucs\nMLB - Rays\nNCAA - Noles\nNBA - Magic\nNHL - Lightning \nPremier League - N/A\nMLS - Orlando City\nPGA - Brooks\nNASCAR - N/A\nGaming - N/A https://t.co/h0GFVW9QOf",
    "125": "@OrlandoMagic When the admin for this page finally gets to use that meme he’s been saving https://t.co/V4YA76wOmJ",
    "126": "All I see is good @OrlandoMagic defense on NBA Today...not bad Warriors https://t.co/lxN71Irmdl",
    "127": "@JamesPiercey11 @sengunPengun Incremental progress and cultural improvement matters to free agents and it matters to guys forcing trades to team up with certain players. Hard to do that when you’re the Orlando Magic",
    "128": "crying laughing at a girl asking Joey Janela to bring her to an Orlando Magic game https://t.co/WfUaX4PZpX",
    "129": "@lancem69 Your favorite team just lost to the Orlando Magic.",
    "130": "We lost against MAGIC ORLANDO FUCKING MAGIC",
    "131": "@LakelandMagic @OrlandoMagic @JeffD_11 @nbagleague @RhodyMBB He has nothing left to prove in the G League. Give him some real minutes in Orlando and watch the culture of winning basketball start to take form.",
    "132": "Lmaoooooo niggas turn into the Orlando Magic when they see a good team https://t.co/Ebl08Bgu8K",
    "133": "I like to give a special shout-out to the     @OrlandoMagic. If it wasn't for your Valiant effort on beating the @warriors, we would never be Pacific CHAMPS on our day Off! @Suns\n\n#VALLEYPROUD #RALLYTHEVALLEY #NBA75",
    "134": "Can't find any value on today's NBA slate? Don't worry... @RMagsTTLSports has your back! Tap in below for the full insights &amp; analysis behind all of his best bets of the day!👀⬇️\n\n🏀Orlando Magic 1H -0.5 (-118)\nhttps://t.co/6RZf7yF1EU https://t.co/PbjaHbVSIE",
    "135": "@zanderai @statmuse @CHAHornetsMuse So what? The hornets are as irrelevant of a franchise as anyone besides the Sacramento kings &amp; Orlando magic",
    "136": "@Tsuna3332 @TAYT99 @warriors @RingzSeason22 @OrlandoMagic I smoke weed 😂",
    "137": "Somebody get me Mary phone number so I can call her and tell her how much of a bum her “TWO POINTS AGAINST THE ORLANDO MAGIC, CAN’T PERFORM WITHOUT CURRY” - ass son, Draymond is.",
    "138": "After facing the Orlando Magic in what resulted in a low-scoring, defensive battle just four days earlier the Thunder look to even the series tonight on home turf.\n\n@OUHealth Game Day Report\n✍️ | https://t.co/lRSYxiLSV7 https://t.co/uGOs6LmWXS",
    "139": "@OTownNBA @goldenstateover @YoungBoyReturn @felix_mcfelix @NiMekhi @OrlandoMagic I’ll take that L, i meant other dude not you",
    "140": "@30likeimgifted @goldenstateover @YoungBoyReturn @felix_mcfelix @NiMekhi @OrlandoMagic @youngboyreturn posted it not me lmao",
    "141": "@OTownNBA @goldenstateover @YoungBoyReturn @felix_mcfelix @NiMekhi @OrlandoMagic But you posted it…as a hoke right? So that means you found humor in that, right?",
    "142": "@30likeimgifted @goldenstateover @YoungBoyReturn @felix_mcfelix @NiMekhi @OrlandoMagic When did I laugh at someone’s injury, I literally said I didn’t condone it",
    "143": "@LeggoDubs @Proxied3 @andre @OrlandoMagic Lmao imagine",
    "144": "Ende #Basketball Herren #NBA \n97:115 WashingtonWizards vs #HoustonRockets \n132:123 #BostonCeltics vs OklahomaCityThunder \n108:110 MinnesotaTimberwolves vs #DallasMavericks \n90:94 GoldenStateWarriorsvs #OrlandoMagic \n117:111 #AtlantaHawk vs NewYorkKnicks",
    "145": "Shai Gilgeous-Alexander (ankle) remains QUESTIONABLE for tonight's game vs. the Orlando Magic, per the Thunder's 1:30 pm injury report.",
    "146": "@TheNewArena exactly what the @orlandomagic need.  another Center.",
    "147": "Warriors: NBA: Golden State #Warriors at Orlando Magic | Sports | https://t.co/twmnVghbME https://t.co/QV3EY3K26K",
    "148": "@warriors Why are we losing to such teams thou???this is very embarrassing truth to be told, players  shouldn’t get paid to lose to teams like Orlando Magic, this is not a good look for the franchise period",
    "149": "The Golden State Warriors are usually cool, calm and collected. However, the Orlando Magic got the best of them on Tuesday night.\nhttps://t.co/Mn5OB6onkR",
    "150": "3-22-22 Recap\nMonte Morris O 6.5 RA 2U 🟢\nOrlando Magic +8.5 🟢\nRJ Barrett Pts O 24.5 🟢\nDemar Derozan Pts O 26.5 (21)🔴\nEvan Fournier PRA O 18.5 (16) 🔴\nEvan Sits 4th idk why and blowout killed demar.\n\n3-2 +2U\n\n5-2 L7",
    "151": "#NBA #NBA75  #GAMEDAY  \n\n🏀 Orlando #Magic 🆚 Oklahoma City #Thunder  \n\n🕢 7pm 🇺🇸 (CT)\n7pm 🇲🇽🇨🇴🇪🇨🇵🇪 \n8pm 🇵🇾🇻🇪🇧🇴🇩🇴🇵🇷 \n9pm 🇦🇷🇺🇾🇨🇱🇧🇷\n1am 🇪🇸\n\n🏟 Paycom Center, #OKC\n\n#ThunderUp https://t.co/sHU5gN5Jup",
    "152": "@theozonepod Orlando is going to beat them if they had the entire team out *the Magic* OKC is hot garbage",
    "153": "@EarlCosner @mjack704 @ty_larm @PapiSoloTweets On a buzzer-beater on a back to back after dropping 150 in Orlando against the Magic who took you to OT?\n\nWhat’s your point?",
    "154": "@OrlandoMagic @Vikings @athielen19 Delete this",
    "155": "Am I cheering for a Orlando Magic win tn? Maybe",
    "156": "Orlando Magic Black Framed Wall- #autographed #ad https://t.co/AYaLqWyrFb",
    "157": "@OrlandoMagic @Suns Magic goated.",
    "158": "Klay Thompson resting against Miami? Really? Orlando exposed the Warriors as a Fucn clown show! After the embarrassing performance against the Magic the leaders tap out against real opponents? WARRIORS PRIDE IS NON EXISTENT 🤨 KLAY IS A COWARD WHO IS HIDING BEHIND INEPTNESS NOW😏",
    "159": "How did the Orlando Magic’s mascot pull off this magic trick? \n\nThe power of illusion!\n\nThe job of a mascot is to entertain and delight, but I had no idea the Orlando Magic had a real-life magician on their staff to don their suit.\n\nThe Orlando Magic mas… https://t.co/a7FcKTfDzq",
    "160": "@OTownNBA @goldenstateover @YoungBoyReturn @felix_mcfelix @NiMekhi @OrlandoMagic That had nothing to do with the convo fool, you exposed yourself as someone who laughs at injuries. Smh.",
    "161": "@jazzoobest @OrlandoMagic @MarkelleF I get that, but I’m not gonna lose my mind if we don’t get any of them. This FO has proven they can pick a good player wherever they draft.",
    "162": "Went all in and lost to the freaking Orlando magic. So the young boys can get roasted by Miami. Smh https://t.co/mo9DhuFpgG",
    "163": "@OrlandoMagic @AdventHealth @jalensuggs Can I get the hookup!!",
    "164": "@MarkelleMagic @OrlandoMagic @MarkelleF Hey I love and appreciate this energy but I want Paolo, Chet, Jabari or Jaden",
    "165": "@GeraldBourguet @PHNX_Suns Always such solid work. Was wondering if you had anything to say about @suns winning the division &amp; the only mention I could find was in a story on espn about the @warriors losing to the @OrlandoMagic",
    "166": "@WhenWeAllVote @USOWomen Come to the line we need you\nThe team is struggling imagine losing to trash teams spurs and Orlando magic what a shame",
    "167": "@Chief_ILL @NA5TYN4T3 @_Breezy_Briii Least skilled?  What?  His footwork for a man his size was absolutely amazing.  It was very good for someone half his size.  Later in his career, he relied more on his physicality, but man those Magic years in Orlando, no one would suggest he was anywhere near \"unskilled\".",
    "168": "@Pato @OrlandoMagic Awesome clip",
    "169": "Draymond Green vents after the Warriors loss to the Orlando Magic.\nhttps://t.co/BG7dGhroYh",
    "170": "@iamrimz33 Dead team, Orlando magic of all team 🤦🏼‍♂️",
    "171": "@MNSportsFan0 @Pat34795481Pat @OrlandoMagic @Vikings @athielen19 Northern Minnesota don’t treat me like that",
    "172": "Y’all sleep on the @OrlandoMagic … fuck a tank. This team as currently constructed with an off-season and a healthy @MarkelleF is a playoff team next year with NO pick this summer. Keep sleeping.",
    "173": "@OrlandoMagic @okcthunder @BallySportsFL @969thegame Back 2 back dubs too",
    "174": "The @OrlandoMagic hit the road as they look for their third straight win!\n\nGet ready for the game against the Thunder with Magic LIVE at 7:30pm on Bally Sports Florida! #MagicTogether https://t.co/u5Y5Va4ouZ",
    "175": "@warriors @NBCSAuthentic @957thegame @betwayusa I will not be watching this poverty of a team until Steph returns. When you lose to the Orlando Magic that's when you know you've hit rock bottom.",
    "176": "NBA 🏀 Temporada: 94-96\n\nMiércoles 23/3: \n\nBrooklyn Nets -1.5 (-110)\nBrooklyn Nets vs Memphis Grizzlies U 238 (-110)\nPhoenix Suns vs Minnesota Timberwolves U238 (-110)\nOrlando Magic vs OKC Thunder U221.5 (-110)\nPhiladelphia 76ers vs LA Lakers U230.5 (-110)",
    "177": "going back-to-back in OKC 🪄\n\n🆚: @okcthunder \n📍: Oklahoma City, OK\n🕗: 8 p.m.\n📺: @BallySportsFL\n📻: @969thegame https://t.co/6L4F5brMtd",
    "178": "A quick rematch, this time on home court! \n\n@okcthunder vs @OrlandoMagic \n⏰ 6:30 pm\n📺 Bally Sports Oklahoma\n📲 Bally Sports App\n#ThunderUp https://t.co/vIc5C5Oi01",
    "179": "It’s the fucking Orlando magic… THE ORLANDO FUCKING MAGIC",
    "180": "@BitSler @Bitsler_Indo @Bitsler_Brasil Orlando Magic",
    "181": "@OrlandoMagic @jalensuggs @AdventHealth How can I get one of these?! Help a brother out!",
    "182": "Draymond pulled no punches after the Warriors' loss to the Magic, because 'soft' wasn't the only s-word he used to describe their play after losing in Orlando, writes @CjHolmes22 https://t.co/WzNiIF7xRb",
    "183": "Orlando Magic at Oklahoma City Thunder (March 23, 2022): 3 Things To Watch, Odds and Prediction – NBA News https://t.co/I08WvwfDz0",
    "184": "@zerojuantwo3 @SixthManShow I don’t really know what your game is here. Do you want DeVos fire Weltman, and if so who is the magical GM that is going to make everyone on the Orlando Magic roster a star?",
    "185": "@redleader_ewok @in4_warriors @CantGuardBook1 @OrlandoMagic @Suns Me too, I am hoping CP3, Jae, De Aron, &amp; Cam Payne are healthy by then 🙏🏻",
    "186": "The Orlando Magic’s continuing commitment to innovation and technology, the team will host its inaugural Magic Innovation Challenge on April 1-3, 2022 at the Magic offices in the CNL II building and at Amway Center. The weekend will offer developers..  (1-2) #MagicTogether https://t.co/gdqP3wZ9tx",
    "187": "@OrlandoMagic @AdventHealth @jalensuggs Mine didn’t come out so good 😭 https://t.co/SS3pMf0nPQ",
    "188": "Draymond saying “No disrespect” right before saying the Orlando Magic are one of the worst teams in the league seems more insulting than if he left that part off. Lol.",
    "189": "Currently with the third best odds, the Orlando Magic have a 20-53 record (on a two game win streak)\n\nProject to end up 22-60.\n\nOKC\nSacramento\nCleveland\nWashington\nToronto\nNew York\nCleveland\nCharlotte\nMiami",
    "190": "@redleader_ewok @in4_warriors @CantGuardBook1 @OrlandoMagic @Suns I’m not imagining anything, we’ll just have to wait til we get there but it’s not looking good for warriors with Steph out 😐",
    "191": "New post (Orlando Magic vs Oklahoma City Thunder NHL Pick – March 23) has been published on The Sports Geek - https://t.co/iYCbh7s0Cc https://t.co/7rQuV5i7vg",
    "192": "@justinreyesv @in4_warriors @CantGuardBook1 @OrlandoMagic @Suns Yeah but what are we imagining? I don’t get what you’re saying.",
    "193": "@OrlandoMagic @Vikings @athielen19 Kirk’s dad is a pastor in Orlando. A lot of the guys come down here in the off-season",
    "194": "@redleader_ewok @in4_warriors @CantGuardBook1 @OrlandoMagic @Suns March 30 https://t.co/3NT7dTVfMX",
    "195": "@altdchambers @ALTDintl @GabeJaramillo @GregAnthony50 @ButtaButtaWorld @scottdelmastro @BreunichC Sales? or just more fluff? @GregAnthony50 @The_ColeAnthony @OrlandoMagic @RASdev1 Any interest from investors??",
    "196": "@OmarAH25 @SirWaveyForever Yeah exactly thats what im telling people. They don’t understand. The orlando magic defense basically got what they wanted. A 2pointer instead of a three.",
    "197": "@OrlandoMagic @PDQFreshFood LET WENDELL PLAY",
    "198": "@justinreyesv @in4_warriors @CantGuardBook1 @OrlandoMagic @Suns What?",
    "199": "Oh it’s on @OrlandoMagic https://t.co/xjE8OzT2IP https://t.co/9c5GMOVj08",
    "200": "@in4_warriors @CantGuardBook1 @OrlandoMagic @Suns And 400million more dollars too huh",
    "201": "Man I close to 340 and can dunk like that.\n\nHe’s heavier than Shaq was with the Orlando Magic, and more athletic, man this shit nuts. https://t.co/Ly7X9MfgKN",
    "202": "@AnthonyyFor3 @OrlandoMagic @Vikings @athielen19 Hype",
    "203": "Must be hard being a fan of a team with a garbage ass human on the roster. Being an Orlando Magic fan all we gotta worry about is an antivax dude which is just another florida man down here lolol",
    "204": "@CantGuardBook1 @OrlandoMagic @Suns how u gonna say that when no one on the suns team has one either. Terrible comeback",
    "205": "@GrizzlyMuse We need to congratulate @OrlandoMagic for this",
    "206": "@GupScored @AdamSchefter @DrewJRosenhaus @JasonRosenhaus @NFLrecord Kyrie Irving leaves KD and the Nets for the Orlando Magic",
    "207": "As a lifelong @OrlandoMagic fan, I've loved watching teams sleep on the Magic. Maybe @Money23Green should have just said \"I'm\" instead of \"We're\" #OrlandoMagic #Shaqtin https://t.co/54NBdpJpAA",
    "208": "@KOT4Q AD traded to the Orlando Magic",
    "209": "@twittyjones @OrlandoMagic They really know how to appreciate us!!",
    "210": "@OrlandoMagic @PDQFreshFood Just missing Moe Wagner!",
    "211": "@thankgouda @OrlandoMagic By far!! Lil girls got some BIG talent already.. glad I wasn't the only one to notice lol\nStraight killed it",
    "212": "Draymond Green after losing another close game: \"It’s hard to win a game when you’re getting punk’d\"\n\nRead about this and other takeaways from the Warriors postgame pressers following their loss against the Orlando Magic. https://t.co/k0LdAVSxEx",
    "213": "\"No disrespect to the Orlando Magic, but that’s one of the worst teams in the league.\"\n\nDraymond Green sounds off after the Warriors' disappointing loss to the Magic. https://t.co/YEy7i7Uyyd",
    "214": "@OrlandoMagic @Suns I love the Magic Twitter now",
    "215": "The fact @MarkelleF looks the same as he ever has (even if the numbers haven’t caught up yet) is a great sign for him and the @OrlandoMagic after his return from an ACL injury https://t.co/mDKw3QAOHD",
    "216": "Analyzing Wednesday’s Orlando Magic at Oklahoma City Thunder odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/QIHxAjcVuV",
    "217": "How did the Orlando Magic’s mascot pull off this magic trick? &gt;... #SportsNews #TylerTysdal #SBNation #Tysdal #TyTysdal https://t.co/ZdDHw2CllI\nhttps://t.co/TCCDGK015x https://t.co/TOaLW5k1pB",
    "218": "@killa33la @CGJXXIII @OrlandoMagic Happy birthday 22",
    "219": "“No disrespect to the Orlando Magic” then proceeds to absolutely bury them hahaha https://t.co/GRYD23cqqy",
    "220": "@OrlandoMagic You know what warriors deserve this.",
    "221": "Golden State star Draymond Green didn't hold back after losing to the Orlando Magic.\n\n\"I think we're playing soft. We're playing stupid. We're just not playing good basketball and we're getting punked.\"\n\nhttps://t.co/Tnp25Eq97O",
    "222": "🏀NBA🏀 #NBA \n🏀Saison régulière🏀\n\nOrlando Magic 94-90 Golden State Warriors\nNew York Knicks 111-117 Atlanta Hawks\nMilwaukee Bucks 126-98 Chicago Bulls\nDenver Nuggets 127-115 Los Angeles Clippers",
    "223": "Golden State Warriors vs Orlando Magic Full Game Highlights | March 22 |... https://t.co/nveBRR2RJI @YouTube",
    "224": "Last night 👀 @NBA 🏀 \n@warriors vs @OrlandoMagic https://t.co/OLwggvNUok",
    "225": "A primeira vez a gente nunca esquece 🙏🏻 the first time we never forget !! Obrigado / Thank you @OrlandoMagic 💙 https://t.co/DfL3ktowYz",
    "226": "@MNSportsFan0 @Pat34795481Pat @OrlandoMagic @Vikings @athielen19 STOOPPPP THE CAPPPPPP",
    "227": "Checking in on Markelle Fultz since his return to the Orlando Magic (via @LucaLockheart)\nhttps://t.co/EVexIgRlfn",
    "228": "@DHenry4mvp @OrlandoMagic @CoachGusMalzahn @UCFKnights @UCF_Football Loser? Guy has a national championship…",
    "229": "The Orlando Magic (20-53) bested the Golden State Warriors (47-25) on Tuesday, winning 94-90 in a tightly contested matchup.\nRecap by @_KyleLander \nhttps://t.co/YASlGWKwVp",
    "230": "@OrlandoMagic @PDQFreshFood Mose wondering why he doesn’t give Bamba more than 1:30 of fourth quarter minutes https://t.co/OeNyzjcZfg",
    "231": "Date night out to the basketball #orlandomagic 🏀✨ https://t.co/3n7cSblLMf",
    "232": "@jrichardgoodman You lose to the fing Orlando Magic this teams issues go way beyond any one player",
    "233": "@OrlandoMagic And with this win to a curry-less team, you are….let us check 👀…OH #14 in the East …..carry on https://t.co/wXqmS2cq08",
    "234": "@100PercentCocky lolol\n\nwhen I was younger and I watched the Orlando Magic\ndestroy Shaq's career I almost sat down and wrote them a letter offering my head coaching abilities..\nand one of the huge points was I would do it for half the cost..\n\nsame energy https://t.co/xDGY5tEOfH",
    "235": "@DJDezignz @OrlandoMagic @The_ColeAnthony fire",
    "236": "@Magic_PR @OrlandoMagic @franzboogie Unbiasedly, he seems like a very cool guy",
    "237": "Penny Hardaway Orlando Magic 1 #thehobby #ad https://t.co/opmnypT6Xb",
    "238": "@3AWilliams3 @OrlandoMagic @DavisGB1 @BuffaloBills @UCFKnights @UCF_Football I’m going to wait and see if he’s going to attend UCFs spring game in a few weeks!",
    "239": "@DEBAPRIYOELITE @WrestleBanana Because the Magic’s arena was already booked in Orlando and for some reason AEW was dedicated to do Revolution in Orlando when they could’ve done it at Arthur Ashe Stadium",
    "240": "Casuals needs to stop just looking at records and see what is happening in Orlando with that talented young core in the front court. But if y’all want to look at records, Magic are 7-6 in the last 13 games while Dubs have been 5-8. #MagicTogether https://t.co/oqkFY6IJYh",
    "241": "Thank you @OrlandoMagic  for Teacher Appreciation Night. Only $15 to sit in Section 217. https://t.co/KhD60cbdkF",
    "242": "@OrlandoMagic @Suns Thank you Orlando",
    "243": "NBA Defensive GOAT?! Golden State Warriors vs Orlando Magic Full Game Highlights | March 22 | 2022 NBA Season https://t.co/2i7KmGNWi3 https://t.co/xi7MsffwYo",
    "244": "@NekiasNBA No. The Phoenix Suns are close to trading Devin Booker to the Orlando Magic",
    "245": "As an @OrlandoMagic fan... we'll take the disrespect. Still beat that ass tho. https://t.co/R4ed6gjY9o",
    "246": "@redleader_ewok @in4_warriors @CantGuardBook1 @OrlandoMagic @Suns We don’t really have to imagine tbh, there’s a game on March 30 just like there was last Christmas and December 3",
    "247": "@ORLmuse @OrlandoMagic @franzboogie Franz is #him we been knew",
    "248": "@ORLmuse @BlockedByIsaac @OrlandoMagic @franzboogie Dummy efficient",
    "249": "@OrlandoMagic @PDQFreshFood Why does he look like he shitted himself",
    "250": "@73Babynewyear @currygawker @OrlandoMagic We waived MCW :-(",
    "251": "@BlockedByIsaac @OrlandoMagic @franzboogie He’s in the same company as:\n\nTyrese Haliburton\nKyrie Irving\nDarren Collison\nStephen Curry\nEric Gordon",
    "252": "The (20-53) @OrlandoMagic (3rd-worst record in NBA) vs. (20-52) @okcthunder (4th-worst record in NBA) tonight at 8 pm. Odds on the line.\n\nThunder have lost 10 straight games, league's longest losing streak. \n\nMagic have won back-to-back games, and are 7-6 in last 13 games. https://t.co/QIOmM2xhDz",
    "253": "@ORLmuse @OrlandoMagic @franzboogie full list ?",
    "254": "@CODWOES @SlayYoung23 If you’re from Orlando u should be a magic fan. If you’re from Boston u should be a Celtics fan. I’m from the Bay Area so I’m a warriors fan. This rooting for a player instead of a team thing is so lame, and it doesn’t exist outside of basketball",
    "255": "@vdubya42 @ClappedDan @Pat34795481Pat @MNSportsFan0 @OrlandoMagic @Vikings @athielen19 Dude the Timberwolves have the lowest win percentage of all NBA teams by far. The Magic have been to two finals. And it’s not like the Lightning are the reigning back to back Stanley cup champions.",
    "256": "@in4_warriors @CantGuardBook1 @OrlandoMagic @Suns Warriors fans are always so salty. It’s okay that another team is better than yours",
    "257": "@lennyyhesse @CantGuardBook1 @in4_warriors @OrlandoMagic @Suns @rice_labs U were saying?",
    "258": "@thejerseydev1l @JohnnyH004 @conrad30162890 @gswforIife @OrlandoMagic ong they were bums",
    "259": "@JohnnyH004 @thejerseydev1l @conrad30162890 @gswforIife @OrlandoMagic this your family photo? https://t.co/wNpQx4NkVu",
    "260": "@OrlandoMagic Thanks Orlando for beating Golden State so I don't have to shame my Raptors for losing to y'all anymore 🙏",
    "261": "@thejerseydev1l @JohnnyH004 @conrad30162890 @gswforIife @OrlandoMagic i could’ve made the nba back then😭😭",
    "262": "@thejerseydev1l @JohnnyH004 @conrad30162890 @gswforIife @OrlandoMagic w i don’t flex the old rings either tbh it’s useless",
    "263": "@OCelik42 @BSinanaj24 @OrlandoMagic Word I have a cousin in Arizona so we should be good if that’s where the parade gona be at. Brooklyn wouldn’t be either",
    "264": "@JohnnyH004 @thejerseydev1l @conrad30162890 @gswforIife @OrlandoMagic how many of those wins came in the last 10 years?",
    "265": "@BSinanaj24 @KQuitt_21 @OrlandoMagic You inviting us to NY? Gotchu",
    "266": "@thejerseydev1l @JohnnyH004 @conrad30162890 @gswforIife @OrlandoMagic nah their rings came when my grandparents were in there teenage years not even playing💀",
    "267": "@BSinanaj24 @KQuitt_21 @OrlandoMagic I rather deal with that, then have a PLAYER directing our FO on who to pick up and trade and STILL lose.",
    "268": "@BSinanaj24 @OCelik42 @OrlandoMagic Magic in 6. #MagicTogether",
    "269": "@JohnnyH004 @thejerseydev1l @conrad30162890 @gswforIife @OrlandoMagic your team has fraud rings i fear",
    "270": "@OrlandoMagic Warriors Twitter got TROLLED!",
    "271": "@JohnnyH004 @thejerseydev1l @conrad30162890 @gswforIife @OrlandoMagic rather have half my rings from recent than all my rings from the 60s👍🏻",
    "272": "@BSinanaj24 @KQuitt_21 @OrlandoMagic With another disappointment",
    "273": "@Rocsi67340795 @loveabundantly @OrlandoMagic @OfficialNBARefs Imagine shooting just 40% from the field and playing soft as hell (as draymond alluded to), and thinking the REFS were the problem😂😂😂thats just looking for an excuse man. Stop it. That’s sad. You just lost to a rebuilding team. There is no excuse for that.",
    "274": "Orlando had themsleves a great win last night and so did we 🔥\n\nMagic +8 ✅\nhttps://t.co/4YQCeVwDvF",
    "275": "@OCelik42 @BSinanaj24 @OrlandoMagic OHHHH SHIIITTTTT OZ WOKE UP AND DECIDED TO SPIT THE TRUTH!!! 👀👀👀👀👀",
    "276": "The Warriors scored just 90 points against the Magic.\n\nThen Steve Kerr and Draymond Green delivered the grimmest assessment we’ve heard from either on the current state of the team.\n\n@anthonyVslater on the loss in Orlando: https://t.co/faCZmxXoqE https://t.co/fQAUUrD0QM",
    "277": "“No disrespect to the Orlando magic, but they’re one of the worst teams in the league”",
    "278": "Who are you sports allegiances? \nNFL - Jags\nMLB - Braves\nNCAA - Gators\nNBA - Magic\nNHL - Dont really care for it \nPremier League -Non\nMLS - Orlando I Guess\nPGA -  None\nNASCAR - Dont really watch it https://t.co/yeJVqfUHQb",
    "279": "Warriors: Golden State #Warriors vs Orlando Magic - Full Game Highlights | March 22, 2022 - YouTube https://t.co/QGKUJl9BEU",
    "280": "Warriors: NBA roundup: Orlando Magic deals Golden State #Warriors its third straight loss - Sportstar https://t.co/NDkm9Vp5hK",
    "281": "It's time to make magic at the @AmwayCenter this Friday from 9 a.m.-3 p.m., Valencia AST graduates! No, the @OrlandoMagic won't be the star of the show, it will be you!\n\nTake your talents and knowledge to the @citybeautiful Skilled Trades Hiring Fair. https://t.co/YdwW7cuo4U",
    "282": "@thejerseydev1l @conrad30162890 @JohnnyH004 @gswforIife @OrlandoMagic right, having your franchise best player average like 9 ppg for his career in the 60s isn’t a flex😭",
    "283": "@OrlandoMagic are the punkers. What a time https://t.co/qnsbE1Tkdu",
    "284": "@DavidBaumannORL @OrlandoMagic Its Aggravating losing and losing and losing every year.",
    "285": "Who are you sports allegiances? \n\nNFL - Browns and Bills\nMLB - Cleveland\nNCAA - Ohio State, UCF, and Syracuse\nNBA - Magic and Cavs\nNHL - Lightning and Sabres\nPremier League - I like it, but don't support a team\nMLS - Orlando City\nPGA - none\nNASCAR - F1 is better\nGaming - none https://t.co/6r6rMEu1zs",
    "286": "☄️Squidward’s Plays of the Day☄️\n\n#CBB 🏀\nUNCW +5 (1u) 🔒☄️(Hoping line moves up slightly, shop around)\nWake Forest +3 (1u) 🔒☄️\nBYU -2.5 (2U)🔒☄️\n\n#NBA 🏀\nTimberwolves +1.5 (1u) 🔒☄️\nOrlando Magic 1Q -0.5 (1u) 🔒☄️\n\nLFG 🦑🔥 https://t.co/jpeglL8l6x",
    "287": "Orlando deserves the show they get on either sides of halftime if they’re not going nuts for the mascot doing magic https://t.co/bfvoxYxx8C",
    "288": "@Proxied3 @andre @ElysiumGY @OrlandoMagic Fr is this the motto he’s talking about?",
    "289": "I think some of you are seriously overrating the players at the top of this draft. Relax.\n\n#OrlandoMagic #MagicTogether  #WeGotAlotPopping #MagicSzn2021\nWE💥G O T💥ALOT💥P O P P I N G",
    "290": "@conrad30162890 @JohnnyH004 @gswforIife @OrlandoMagic fine some 80s and one in the past 2 decades🙄",
    "291": "@DavidBaumannORL @OrlandoMagic Can’t trust the lottery at this point. Young team winning confidence is much more important than relying on ping pong balls IMO",
    "292": "@OrlandoMagic @Suns HAHAHAHA MAGIC TWITTER ELITE FOR THIS ONE",
    "293": "@OrlandoMagic @AdventHealth @franzboogie @The_ColeAnthony I was there… I absolutely LOVED it!!",
    "294": "Safe to say the Orlando Magic won’t be looking to acquire @Money23Green anytime soon… #MagicTogether #draymond",
    "295": "@OrlandoMagic @Vikings @athielen19 What are you doing in Orlando Thielen you silly goose",
    "296": "@DavidBaumannORL @OrlandoMagic Magic gonna mess around and move out of the bottom 3... Bennedict Mathurin it is.",
    "297": "@OrlandoMagic You know your franchise is down bad when you have to make memes about good teams losing to us. Yikes. Enough is enough.",
    "298": "@certifiednugget @NBA @OrlandoMagic @ATLHawks @Bucks @nuggets Bulls imo. At least the Magic know they're a lottery team. Bulls are 0-16 vs the top 3 of each conference 😩",
    "299": "@Flight23White @OrlandoMagic starting 5 PG Cole Anthony, SG, RJ Hampton, SF Franz Wagner, PF Wendell Carter Jr, C Mo Bamba where’s my 50 racks????",
    "300": "@DavidBaumannORL @OrlandoMagic Time to scout the players in that 5-8 pick range.. Classic",
    "301": "@DavidBaumannORL @OrlandoMagic I think im going to vomit.",
    "302": "@MorningRoast957 The Warriors ironically have the same record as the Heat going into tonight’s game. However, they are playing like the Orlando Magic even with Curry.",
    "303": "@Pato @OrlandoMagic I love this so much! #MagicTogether",
    "304": "@OrlandoMagic dame https://t.co/ya9ijLN3NL",
    "305": "@MDL6 @ballbybasey @DanteMagic Hezonja, Gordon, Vooch, and a bunch of other people who are no longer on the Orlando Magic lol",
    "306": "“The Wendell Carter deal is going to be a steal for the Orlando Magic, and a good building block for the team” - @KeithSmithNBA \n\nListen - https://t.co/t2LGtOYZ1R | FM 96.9 | am740 | 101.1 HD-2 https://t.co/jUmNwugnl1",
    "307": "@OrlandoMagic @PDQFreshFood Great team win last night💯Let’s put the league on notice 😤",
    "308": "@DavidBaumannORL @OrlandoMagic And drop out of bottom 3.  Terrible wins",
    "309": "@30likeimgifted @DAlLYTAKE @YoungBoyReturn @NiMekhi @OrlandoMagic Yall cant even beat the magic without steph tho if he gets hurt again or doesn’t come back for the playoffs yall are cooked",
    "310": "@DylanFrew6 @thisistrofy @KCEgamer @ClassySpeaks Smhh you probably believe orlando magic will win a chip soon too.. and who’s to say Shai won’t be better than Cade?",
    "311": "Orlando Magic Black Base Team Lo #autographed #ad https://t.co/ZtfdQo16sO",
    "312": "@OrlandoMagicUK @OrlandoMagic @warriors @GSWarriors_UK @NBA_UKFans @AmwayCenter @gera1nt @mikeyclark87 @biffabacon439 @CraggsSpeaks watched the second quarter and would have been miles ahead if we could shoot the 3.",
    "313": "I've got 3 more of my NBA best bets this Wednesday evening. 🏀💎\n\n-Boston Celtics vs Utah Jazz\n-Minnesota Timberwolves vs Phoenix Suns\n-OKC Thunder vs Orlando Magic\n\nLet me know what you think!\n\n#NBA #NBAbets #NBApicks #NBAtips \nhttps://t.co/KVXDer9ezr",
    "314": "@SkolPurplePod @OrlandoMagic @haha_cd6 @Vikings @athielen19 We’ll, I didn’t. But, I know a guy that did.",
    "315": "@BSinanaj24 @OrlandoMagic Sure, a team with no all stars. and lakers got this all star team and struggling for the Play In spot",
    "316": "Still can't believe we lost to the Magic. Orlando Magic?? https://t.co/vLsmm7nBY8",
    "317": "@DavidBaumannORL @OrlandoMagic yuck i hope not",
    "318": "@DavidBaumannORL @OrlandoMagic 7-6 since the all star break and really 2 of those losses could have been wins too",
    "319": "Death, taxes and the @OrlandoMagic getting hot once eliminated from playoff contention. \n\nMagic could notch their first 3G win streak of the season if they beat OKC tonight.",
    "320": "@BSinanaj24 @OrlandoMagic He had 2 pts against “the worst team in the league”…",
    "321": "Mo &amp; Mose https://t.co/xOeA8e8MdM",
    "322": "Consensus Line Move:\n2022-03-23 Orlando Magic at Oklahoma City Thunder from 220.50 to 219.50\nUnder nervous?\n#NBA #bettingonline #ai #blockchain",
    "323": "@BeenKnightedUCF @loveabundantly @OrlandoMagic @OfficialNBARefs huh lmao. https://t.co/q8WXq14Gvf",
    "324": "Hard truth few want to even discuss???? None of this talent acquisition and securing top picks even matters if the Orlando Magic cannot consistently develop guys once we get them. Noticeable leaps too, Garland-type leaps are needed, not small little incremental stuff. Period.",
    "325": "@justinreyesv @CantGuardBook1 @in4_warriors @OrlandoMagic @Suns Stay on you teams page first Dub fans",
    "326": "@Florida @OrlandoMagic @orlandonews8 @WaltDisneyWorld @Disney @UniversalORL @orlandosentinel *Walk Out At Disney World, As Worker Are  Protesting Over Gay Rights. https://t.co/Ylz9fw0SDI",
    "327": "@NBA the #tanking rule has to change. Tired of these team being so greedy with picks. Okc literally trying to rest most of all their starters. Pretty sure half of them arent hurt vs Orlando magic.",
    "328": "There was no way in hell the Orlando Magic should have won 20 games this season, especially with 9 games left in the season. With the roster that was constructed, first year head coach, all of the injuries, and relying heavily on rookies, just super impressed.",
    "329": "@StepbackAch @DetroitPistons @OrlandoMagic @okcthunder Because I’d be dammed we win tonight and have the same odds as DETROIT again. Actually idc bc they’d pick chet 😂😂😂",
    "330": "The tank gang of Orlando Magic Twitter has MAGA vibes going on with their denial of fact based lottery odds lol",
    "331": "@KingdomOfGOAT @cbreezy0013 @BDFITL @PettyAirJordan Bron had to go through the superteam celtics and the Orlando magic.\n\nNot as good as the 80s Celtics and pistons to that degree but they were indefinitely a tough challenge.",
    "332": "Kam Walczak is back to discuss the Forgotten Magic. While a struggling franchise can have a revolving door when it comes to their roster, sometimes it is important to keep the focus on who you still have. #NBA #NBATwitter @OrlandoMagic \n\nhttps://t.co/NJI5r3GBm9 https://t.co/w1U64KplrL",
    "333": "@CGJXXIII @OrlandoMagic Enjoy Disney too!",
    "334": "Draymond Green Makes Devastating Admission as Warriors Fall to “One of the Worst” Orlando Magic https://t.co/v0S5TwJvdc",
    "335": "@Warrior88690436 @NBAextra Et pour en rajouter...🙄\nThe Orlando Magic have not lost to the Golden State Warriors at home since December 1st, 2017. \n\n#MagicTogether https://t.co/Ja9vAueCDz",
    "336": "Orlando Magic vs  Oklahoma City Thunder Prediction 3/23/22 - Free NBA Picks https://t.co/HzhePFoukg via @YouTube \n\n#NBA #NBAPick #NBAPrediction #Basketball #Sportsbetting",
    "337": "@DuragDevTheGOAT @ORLmuse @OrlandoMagic But that's something I def would've considered 😂",
    "338": "@DuragDevTheGOAT @ORLmuse @OrlandoMagic Nah the homie did lol.",
    "339": "Damn, someone mad … 😁 @OrlandoMagic #MagicTogether https://t.co/IXPMglTkAu",
    "340": "@asimsgiddyup @OrlandoMagic This is not unpopular in my eyes. I absolutely LOVE him. Have him 4th just under Ivey.",
    "341": "Orlando magic -1.5",
    "342": "OKC Thunder: Oklahoma City #Thunder vs Orlando Magic 3/23/22 NBA Picks, Predictions, Odds - Sports Chat Place https://t.co/JXr7dbngRC",
    "343": "@The_ColeAnthony @OrlandoMagic i love you 🥳💙💰💰💰🧿🧿🧿🤑🤑🤑🤑🤑🤑🤑 https://t.co/C3odZlninj",
    "344": "Unpopular opinion: Whether the @OrlandoMagic get the #1 pick or the #6 pick they should take Mathurin.\n#MagicTogether",
    "345": "Indiana Pacers - Sacramento Kings\nOklahoma City Thunder - Orlando Magic\n\nBet slip link: https://t.co/TdYSnNz7vv https://t.co/vJilCyb4U5",
    "346": "@OrlandoMagic @JJudahIsaac give him the vax when he's under",
    "347": "@Anthony04849499 @OrlandoMagic @Pato @STUFFMagic @OrlandoCitySC Good morning Anthony! You’re right about that 😊",
    "348": "@SkolHardTruth @Pat34795481Pat @OrlandoMagic @Vikings @athielen19 It literally was 70 on Monday",
    "349": "I knew I had Orlando Magic merch for a reason. https://t.co/zkHngENJsV",
    "350": "@OrlandoMagic @UCFSportsInfo @CoachGusMalzahn @UCFKnights @UCF_Football Certainly couldn't do this while coaching at auburn.",
    "351": "Dear @OrlandoMagic,\n\nGot a nice little win streak going, eh? Time to build some confidence heading into the off-season. Would be a shame if you lost all that momentum to the black eye of the NBA. \n\nSincerely,\nLong time Magic fan. https://t.co/iU5D0rGtBr",
    "352": "3/22\n\nNBA\nOrlando UN 215💰\nKnicks +3.5👎\nMagic +7.5💰\n\nCBB\nAbilene Christian +1.5👎\nSt. Bonny +3💰\n\n3-2\n\n#GamblingTwitter #bettingtwitter #CBB #nbabets",
    "353": "@Georgeous91 @Cranbiet @OrlandoMagic @The_ColeAnthony yeah would look smart that, look like sponge bobs house",
    "354": "@MNSportsFan0 @Pat34795481Pat @OrlandoMagic @Vikings @athielen19 No it wasn't and it's snowing now ...",
    "355": "🏀 Golden State Warriors (@warriors) #DubNation\n🆚 L @ Orlando Magic #MagicTogether #GSWvsORL \n⏭️ Miami Heat #HEATCulture #GSWvsMIA\n✈️ N652DL | DAL8926 | B752\n🛫 MCO - 11:36 pm ET\n🛬 MIA - 12:15 am ET\n📡 Tracking: https://t.co/kek32lECu8 https://t.co/EFLn3P8OzT",
    "356": "@justinreyesv @CantGuardBook1 @in4_warriors @OrlandoMagic @Suns get a job first",
    "357": "🏀 Orlando Magic (@OrlandoMagic) #MagicTogether \n🆚 Oklahoma City Thunder #ThunderUp #ORLvsOKC\n✈️ N663DN | DAL8937 | B752\n🛫 MCO - 11:35 pm ET\n🛬 OKC - 1:20 am CT\n📡 Tracking: https://t.co/gYMWUDmHGG https://t.co/Af7c7ChiaN",
    "358": "45 members and guests of LNRCC enjoyed an evening of basketball watching the Orlando Magic. Thanks to the generosity of our Platinum Partner AdventHealth inviting us into their suite at Amway Center and the assistance of our Chamber Magic rep Corey Helvey. https://t.co/xgNTENxiaq",
    "359": "“No disrespect to the Orlando Magic but that’s one of the worst teams in the league.” Lmaoo how can you say that respectfully 🤣😂",
    "360": "The Oklahoma City Thunder play the Orlando Magic on Wednesday, and if you’re wondering how you can watch the action live, you’ve come to the right place. The Thunder (20-52) are current…  https://t.co/NXobYxWXat",
    "361": "@KDFTW357 @OrlandoMagic lol kyrie makes you cry when he leaves... trollers",
    "362": "We, the FAD are very excited to have this promotion t-shirt selling at the Orlando Magic basketball game on Tuesday, April  5that7 at pm at the Amway Center in Orlando, Florida. https://t.co/Ynvvwbz9Jr",
    "363": "@ORLmuse @OrlandoMagic @Lendosbeatz this who you bet against ?",
    "364": "@OrlandoMagic Blocked",
    "365": "Consensus Line Move:\n2022-03-23 Orlando Magic at Oklahoma City Thunder from 219.00 to 220.50\nOver need it more\n#NBA #sportsbettingadvice #python #lifestyle",
    "366": "@elijahburke138 @NBA @OrlandoMagic @ATLHawks @Bucks @nuggets not you again+ratio",
    "367": "keep building 🪄 https://t.co/Ioo1uZB7jg",
    "368": "Good morning to the future of the Orlando Magic https://t.co/WkiUtuvQoB",
    "369": "Game 74!\n⁠\n🏀: Magic vs Thunder\n🕔: 7:30 PM⁠\n📻: FM 96.9 | am740 | 101.1 HD-2⁠\n💻: https://t.co/t2LGtOYZ1R⁠\n📱: iHeartRadio App in Orlando https://t.co/EAzBKUSbvL",
    "370": "Golden State Warriors vs Orlando Magic Full Game Highlights | March 22 | 2022 NBA Season #GoldenState #Warriors #NBA Video: https://t.co/y6Jwtk4wx9",
    "371": "@rororacmain @imonlyjojo @dennis_k_g @OrlandoMagic If Golden State needs curry to beat the rebuilding magic that’s pretty bad.",
    "372": "@MNSportsFan0 @Pat34795481Pat @OrlandoMagic @Vikings @athielen19 It was HOF here in Florida to be honest. \nToo 🔥 🥵 for March... \nWe also love us some hockey so 🤝.",
    "373": "New @OrlandoMagic bobblehead means an update to the family photo! #MagicTogether https://t.co/bf6n499fqw",
    "374": "I just posted \"Orlando Magic Sign Jeff Dowtin to 10-Day Contract | Orlando Magic\" on Reddit\n\nhttps://t.co/MBlmeZYCva",
    "375": "@dastardlyhorny1 @CamAlexander22 @moc_dude Orlando Magic started up the 3 point era fr",
    "376": "Without Curry and the gang, youd be on the Orlando Magic. Absolute clown https://t.co/rYdemWBher",
    "377": "Today's NBA Picks: 8:00 PM ET - Orlando Magic vs. Oklahoma City Thunder - 1 PICK AVAILABLE: https://t.co/jwsP89T3sE #nba",
    "378": "@slatermaker1 @Cranbiet @OrlandoMagic @The_ColeAnthony Something like this? https://t.co/PCVvxeCtsE",
    "379": "@andre @OrlandoMagic They were PRICEY!",
    "380": "Draymond Green - ''We're playing soft. We're playing stupid. We're just not playing good basketball and we're getting punked. ... No disrespect to the #Orlando Magic but that's one of the worst teams in the league'' 🏀\nhttps://t.co/SaY2H26gnv",
    "381": "Winnersss!!! #NBA #NBA75  @OrlandoMagic @ATLHawks @Bucks @nuggets https://t.co/V5Zf9KFI7Z",
    "382": "@DanteMagic @OrlandoMagic @OKC So much to be proud of, but Franz calmly sinking those FTs like he was at the park by himself was just special. This group is fearless, and you can feel the culture has changed. I’ll be courtside in Cleveland Monday representing! Go Magic!",
    "383": "Tuesday night's winners... @OrlandoMagic @ATLHawks @Bucks &amp; @nuggets! https://t.co/lrfiJlDs7I",
    "384": "The Orlando Magic, who have the worst home record in the NBA this year, beat the Warriors in Orlando.\n\nDraymond is SPITTIN https://t.co/oxcELSsY0o",
    "385": "The Magic travel to OKC to take on the Thunder for what should be another interesting matchup between two teams trying to fight for better lottery odds.\n\nSuggs and Fultz will not play and Harris and Carter Jr are listed as questionable to play.\n\n#MagicTogether #OrlandoMagic #NBA https://t.co/q1Qd9zF1Cp",
    "386": "@DanHicken's version of the Orlando Magic song during the 10-minute drill is better. Just sayin'.😁😆\nMade me chuckle.\nON @1010XL",
    "387": "[GAME THREAD] Golden State Warriors (47-22) @ Orlando Magic (19-53) 3/22/22 4:00PM\n https://t.co/GgeXcNzDDI #cliptags",
    "388": "if we had been the team to draft him in the 2nd round, the Orlando Magic front office really would not have hesitated to trade away Nikola Jokic for cash considerations.\n\njust gotta think about that sometimes. https://t.co/wTCV4FGotH",
    "389": "@datboijoy1 @NiMekhi @OrlandoMagic How do y’all come up with this 😭😭😭😭",
    "390": "@BleacherReport @anthonyVslater “ no disrespect to the Orlando Magic” after the disrespect has been said . Lmaoooo boy this is wild .",
    "391": "@Georgeous91 @Cranbiet @OrlandoMagic @The_ColeAnthony grow them please",
    "392": "@MR2Litt @misterfuneral @currygawker @hongtaeju2 @73Babynewyear @OrlandoMagic Hmmmm you spittin",
    "393": "#TwitterlessJeff doubts the existence of the Orlando Magic song. Guess I know what I'm ending the 10 Minute Drill with.",
    "394": "@Cranbiet @OrlandoMagic @The_ColeAnthony Fuck I wish I had dreads! 😩😂",
    "395": "I’m tired of the NBA disrespecting the Orlando Magic. https://t.co/ZCmsalKbFr",
    "396": "@mattwrld this yo team? Losing to the Orlando Magic? THE MAGIC? https://t.co/9ULCeA0S8L",
    "397": "@ElSleepyFloyd @hongtaeju2 @curtiefoo @OrlandoMagic Enjoy it while it lasts soon you'll been fighting for the number one draft pick",
    "398": "@OrlandoMagic Warriors... Come out and play\nWarriors... Come out and play",
    "399": "Warriors lost to the Orlando Magic. What is going on",
    "400": "Magic haven’t lost to the Warriors at home since 2017. I went to that game in 2017. Seems clear that me not being there is a good luck charm @OrlandoMagic if you wanna reimburse me for my work with tickets let me know",
    "401": "@kevinwildes, the @OrlandoMagic are backkkk!!!!!! 😂😂 https://t.co/yHXkHI8nVR",
    "402": "The Nikola Vucevic Trade Saved The Orlando Magic https://t.co/tyiXOTBuQn #afunkydiabetic #nbarookieoftheyear #afunkydiabetic #funkydiabetic #funkydiabetic #franzwagner",
    "403": "@KDFTW357 @OrlandoMagic So fucking what.",
    "404": "🚨 Line Change 🚨\n\nOrlando Magic @ Oklahoma City Thunder\nWed 8:10 PM EST\n\nFrom:\nOKC 2.0 -115\n\nTo:\nOKC 1.0 -105",
    "405": "@YoungBoyReturn @30likeimgifted @NiMekhi @OrlandoMagic If you’re a Magic fan do you guys want Chet? I guess with WCJr on such a team friendly contract he can be a backup if necessary, and maybe they’ll play together who knows. Wonder how Isaac will be next year. Hope he gets 100%, always liked him.",
    "406": "@YoungBoyReturn @30likeimgifted @NiMekhi @OrlandoMagic I’m a Pistons fan and I have no idea if I want them to get #1 pick or not. I mean I do, obv at least want them to get T3 pick, but there’s no seemingly super obvious star. Early on I was high on Paolo and low on Chet, now it’s the opposite. Weird draft. Should be interesting.",
    "407": "@JohnnyH004 @gswforIife @OrlandoMagic all from the 60s",
    "408": "Hasil NBA: Milwaukee Bucks Seruduk Chicago Bulls, Orlando Magic Hajar Warriors #news  #sport #jadicepatpaham https://t.co/4tsWhHcX0j",
    "409": "Orlando Magic +8.5 ✅\n\n#nba #nbapicks #GamblingTwitter https://t.co/zM6Tl2DYXJ",
    "410": "@_SirSteven @Chrisallini Devos family is a perfect example of Orlando leadership in general. They don’t embrace what the city actually is. Magic games safe but you can upstairs and do coke at the arena sky lounge lol",
    "411": "@DonnyTt2 @OrlandoMagic @Vikings @athielen19 Yea he was just at Disney",
    "412": "I knew we'd lose some games but dropping to Orlando magic and SAS is just nasty. almost the same team as last year without steph https://t.co/DVD4B63F30",
    "413": "Final: Magic 94-90 Warriors\n\nMAGIC WIN! Orlando overturn a 14 point deficit with clutch shots &amp; free throws down the stretch to knock off the Warriors.\n\nMagic hold Golden State to 40% shooting in a win that’s great for development &amp; confidence. Great win!\n\n#MagicTogether https://t.co/6hnJFJml5H",
    "414": "“We’re playing soft. We’re playing stupid. We’re just not playing good basketball and we’re getting punked. … No disrespect to the Orlando Magic but that’s one of the worst teams in the league”\n\nDraymond Green is fed up with the Warriors recent performances 😡 https://t.co/xkSQvWNyvZ",
    "415": "@Mocherexs Orlando magic &gt;&gt;&gt;",
    "416": "@OrlandoMagic @The_ColeAnthony @Georgeous91 reminds me of you",
    "417": "##NBA: Tuesday night’s winners… @atlhawks @nuggets @bucks &amp; @orlandomagic!... \n \nhttps://t.co/dkSXKOyVST\n \n#Basketball #NationalBasketballAssociation https://t.co/mGQa3gCPGE",
    "418": "Golden State Warriors (@warriors) 90 - Orlando Magic (@OrlandoMagic) 94\nRecap : https://t.co/2VnXnVn5xB\nBoxscore : https://t.co/4YLHoxDVHn\nPlay-By-Play : https://t.co/6InwGRrRAj\nhttps://t.co/TJFdDDJ2fM",
    "419": "On Open Mike today:\n\nOrlando Pride apologize for making fans remove \"Gay\" banner.\n\nMagic beat Warriors, but, sigh, Jonathan Isaac has another surgery.\n\nDolphins-Bucs make major deals!\n\nPrize: Magic tickets!\n\nListen live: FM 96.9 | AM 740 | HD 101.1-2 | https://t.co/nKVj38fOR6 https://t.co/FJ6txd8RIT",
    "420": "@OrlandoMagic @Suns Haha, great work Magic!",
    "421": "Golden State Warriors vs Orlando Magic 4th Quarter Highlight | March 22n... https://t.co/yw0fEYXEUj @YouTube",
    "422": "Golden State Warriors vs Orlando Magic 3rd Quarter Highlight | March 22n... https://t.co/oMTd18Ryxw @YouTube",
    "423": "Golden State Warriors vs Orlando Magic 2nd Quarter Highlight | March 22n... https://t.co/bl7bbIBvTF @YouTube",
    "424": "Golden State Warriors vs Orlando Magic 1st Quarter Highlight | March 22n... https://t.co/B0Q145N2nD @YouTube",
    "425": "Franz Wagner Orlando Magic 2021 #autographed https://t.co/Q7q1k5Yl0n",
    "426": "@BleacherReport @anthonyVslater That made my day, a dejected Draymond! You can’t sleep on the Magic, a young enthusiastic core and they’ve been delivering a top defence! #orlandomagic #letsgomagic",
    "427": "Orlando Magic is surprised they beat a Curry less Warriors team who still have a MAX PLAYER CALLED KLAY THOMPSON WHO IS SUPPOSED TO HOLD IT DOWN FOR AT LEAST 3 FUCN WEEKS UNTIL THE PLAYOFFS BEGIN?🤨 KLAY AIN'T PRODUCING AND POOLE IS NO REAL DEAL PLAYER, HE'S A GREAT SUPPORT ROLE",
    "428": "@OrlandoMagic @Suns Suns🤝magic\n   Respect 🙏🏻 https://t.co/f7ZirxB6lh",
    "429": "@Game6Clay @YoungBoyReturn @30likeimgifted @felix_mcfelix @NiMekhi @OrlandoMagic He’s a jets fan explains a lot",
    "430": "@CGJXXIII @OrlandoMagic Happy Birthday Lil man",
    "431": "Golden State Warriors vs Orlando Magic - Full Game Highlights | March 22... https://t.co/atSwKOCAcn @YouTube",
    "432": "@case__5 I want to laugh,but I can't cos my team lost to fucking Orlando magic",
    "433": "@DAlLYTAKE @YoungBoyReturn @NiMekhi @OrlandoMagic Pissed off for what? Best player isn’t even playing…and we still get to compete for a chip unlike…drum roll…. The Magic 😔",
    "434": "🔵 ᴡᴀɢɴᴇʀ &amp; ᴡᴀɢɴᴇʀ 🔵\n\nFranz (18 PTS, 2 STL), Moritz (7 PTS, 4 REB) und die @OrlandoMagic gewinnen zu Hause gegen die Warriors! \n\n#MagicTogether https://t.co/xCsoIRwlXc",
    "435": "🏀NBA🏀 #NBA \n🏀Saison régulière🏀\n\nOrlando Magic - Golden State Warriors\nNew York Knicks- Atlanta Hawks\nMilwaukee Bucks- Chicago Bulls\nDenver Nuggets - Los Angeles Clippers",
    "436": "The Dennis Kancler Memorial Award for 3/22/2022 goes to Mo Bamba of the Orlando Magic  who helped his team win yesterday with 12 combined Rebounds, Assists, Steals and Blocked Shots #MagicTogether  #NBA #NBATwitter #NBA75",
    "437": "@KingKayak_ @SkolCash @magicscotti @GerrieJoe @OrlandoMagic @Vikings @athielen19 fuck no",
    "438": "Warriors: Golden State #Warriors vs Orlando Magic - Full Game Highlights | March 22, 2022 - YouTube https://t.co/NDkm9Vp5hK",
    "439": "Warriors: NBA roundup: Orlando Magic deals Golden State #Warriors its third straight loss - Sportstar https://t.co/t6svubBHmq",
    "440": "OPEN MIKE THOUGHT-PROVOKING DAILY POLL brought to you by https://t.co/3oIF3FP0Fk: Do you agree or disagree with the Orlando Magic team president Jeff Weltman, who described oft-injured Jonathan Isaac’s recent a hamstring injury and resulting surgery as a “minor” injury?",
    "441": "OKC Thunder: Oklahoma City #Thunder vs. Orlando Magic Predictions &amp; Odds – March 23, 2022 | BigOnSports https://t.co/K2ww5CEEyJ",
    "442": "Mo Bamba hit a go-ahead 3-pointer with 52.2 seconds left and the host Orlando Magic handed the Golden State Warriors their third straight loss with a 94-90 comeback victory on Tuesday night\n\nREAD MORE: https://t.co/f5OkfynsUe\n\n#NBATwitter #NBA2K22 #nba2k22myteam https://t.co/XNVIiB5yxP",
    "443": "Draymond Green did not hold back in the postgame presser of the @warriors -@OrlandoMagic game.\n\n“We’re playing soft. We’re playing stupid. We’re just not playing good basketball and we’re getting punked.”\n\nRead more:\nhttps://t.co/MtPA7eMUr2\n\n#DubNation #WarriorsGround https://t.co/wt04fat4fL",
    "444": "@misterfuneral @currygawker @hongtaeju2 @73Babynewyear @OrlandoMagic lol curry top 5 already G",
    "445": "@hongtaeju2 @gswforIife @OrlandoMagic and to toronto lol",
    "446": "Post-Game Review: Orlando Magic - (94) Vs. Golden State Warriors- (90) Tuesday,  March 22,  2022.\n\nRead More: https://t.co/QlnsQMnVyC https://t.co/mSTuuLETOD",
    "447": "@OrlandoMagic LMAO!!!! Give Steph his MVP NOW!!! Because NOO WAY BRUH NO WAY!!!!🤣🤣🤣",
    "448": "@OTownNBA @NiMekhi @OrlandoMagic Owned",
    "449": "@raven_king18 @SkolCash @magicscotti @GerrieJoe @OrlandoMagic @Vikings @athielen19 New to football huh?",
    "450": "Post-Game Review: Orlando Magic - (94) Vs. Golden State Warriors- (90) Tuesday,  March 22,  2022.\n\nRead More: https://t.co/QlnsQMnVyC https://t.co/LsRSKNptQN",
    "451": "Orlando Magic has no business beating Golden State https://t.co/TwaassZVHB",
    "452": "@currygawker @hongtaeju2 @73Babynewyear @OrlandoMagic Curry will never be top 10 all time lol",
    "453": "Orlando Magic (20-53, 14th in the Eastern Conference) vs. Oklahoma City Thunder (20-52, 14th in the Western Conference) https://t.co/bizOVgACc2",
    "454": "@NiMekhi @OrlandoMagic Lmao you guys lost",
    "455": "Andrew \"all star starter\" Wiggins against Orlando 🥶 Maple Jordan 🥶\n13 points 🤮🤮🤮🤮🤮🤮🤮🤮🤮\n27% shooting 🤯🤯🤯🤯🤯🤯🤯🤯🤯\n0 assists 👏👏👏👏👏👏👏👏👏👏\n-7 plus minus 💀💀💀💀💀💀💀💀💀\nLost to the Magic 🤣🤣🤣🤣🤣🤣🤣🤣\nProving haters wrong?!??!?!? Not a bust?!?!?!?!?!?",
    "456": "NBA Recap: Warriors run out of Magic in Orlando/Giannis great comeback vs. Bulls/Trae Young continues to generate hate at MSG https://t.co/arJpNfgqJM",
    "457": "Orlando Magic (20-53, 14th in the Eastern Conference) vs. Oklahoma City Thunder (20-52, 14th in the Western Conference) https://t.co/vKehTUDnHQ",
    "458": "@bruno_akampa GSW to Orlando Magic 🤯 like who loses to Orlando",
    "459": "Giannis Antetokounmpo dominates as Milwaukee Bucks beat Chicago Bulls again; Orlando Magic shock Golden State Warriors https://t.co/JILr3gZKXB",
    "460": "GOLDEN STATE WARRIORS VS. ORLANDO MAGIC | GAME HIGHLIGHTS\nhttps://t.co/d0qiAXtKBf\nhttps://t.co/d0qiAXtKBf",
    "461": "NBA Defensive GOAT?! 227's YouTube Chili' Draymond Chili' Green 9.3 PPG 8.7 RPG 7.0 APG #DubNation Spicy' https://t.co/e1wIrnHVxm https://t.co/RMMpY94sQl #MichiganState #Spartans Postgame interview after loss to Orlando Magic | We… https://t.co/VdPoXg4x6i https://t.co/xi7MsffwYo",
    "462": "@HRM6818 @NBA @OrlandoMagic He’s a bum he cries about Kyrie not vaccinated more than he talks about the actual game of basketball",
    "463": "Orlando Magic Golden Classic Tea #autographed #ad https://t.co/zPe1qeCbVq",
    "464": "@73Babynewyear @currygawker @OrlandoMagic Nobody's + steph&gt; all of them",
    "465": "...somebody tell https://t.co/8m5noxouKr that without Steph,there’s no difference between that Warriors team n Orlando Magic...🤧 #NBA",
    "466": "@DogSurfRoadshow @LockedOnDubs @KylenMills @andre @warriors @OrlandoMagic I know that no one wants to say it but I will. Wiggins is the player he is. Sometimes slightly better (earlier this year) sometimes slightly worse (since ASG) He will never be a max player or leader. He is an average NBA SF who will never live up to his top draft pick status 🤷‍♂️",
    "467": "NBA Basketball Game Betting Picks Simulator: 8:00 PM ET - Orlando Magic vs. Oklahoma City Thunder - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/VJNMrOkxaI #nba #sportsbetting #freepicks #cappertek",
    "468": "@CantGuardBook1 @OrlandoMagic @Suns Suns still ringless btw 😂",
    "469": "Said in our Youtube episode to stay away from @warriors  -7.5 tonight @ @OrlandoMagic . Classic sharps vs squares bet.",
    "470": "So @BlueJ444  &amp; I was going over this game earlier - it’s always good to bounce info off a like minded head - warriors haven’t covered against @OrlandoMagic - now if curry was healthy I’m sure things would be different in last nights game https://t.co/InOsrCrVBS",
    "471": "@OrlandoMagic this is self diss.",
    "472": "BleacherReport: \"We're playing soft. We're playing stupid. We're just not playing good basketball and we're getting punked. ... No disrespect to the Orlando Magic but that's one of the worst teams in the league\"\n\n- Draymond after tonight’s loss\n\n(via @an… https://t.co/UhMDtLKVsV",
    "473": "@OrlandoMagic \"Warriors come out to play\" 🙄😁😅😂🤣",
    "474": "@OrlandoMagic @JJudahIsaac Jonathan Isaac every 5 seconds: https://t.co/O8Oy5eRwn0",
    "475": "Mo Bamba hit a go-ahead 3-pointer with 52.2 seconds left and the host Orlando Magic handed the Golden State Warriors their third straight loss with a 94-90 comeback victory on Tuesday night. https://t.co/KGqiiZqrX0",
    "476": "Now Playing on LITE 99 Orlando This Magic Moment by Ben E. King #nowplaying #orlando #orlandomusic #softrock #oldies #florida #lastplayed #recentlyplayed",
    "477": "\"We're playing soft. We're playing stupid. We're just not playing good basketball and we're getting punked. ... No disrespect to the Orlando Magic but that's one of the worst teams in the league\"\n\n- Draymond after tonight’s loss\n\n(via @anthonyVslater)\nhttps://t.co/02GSveBZVq",
    "478": "@CantGuardBook1 @in4_warriors @OrlandoMagic @Suns Who cares lmfaooo worthless ass finals mvp go get a ring first",
    "479": "[NBA Highlights] Golden State Warriors vs Orlando Magic - Full Game Highlights | March 22, 2022 | 2021-22 NBA Season https://t.co/znOpoD9j5b",
    "480": "Franz Wagner scored the last 5 points of the game for the @OrlandoMagic to lift them to the win at home! #MagicTogether  \n\nFranz Wagner: 18 PTS, 2 STL\nCole Anthony: 14 PTS, 5 REB, 5 AST\nWendell Carter Jr: 19 PTS, 8 REB\nJordan Poole: 26 PTS, 6 AST, 5 3PM https://t.co/RmfA1otBCp …",
    "481": "The Warriors without Draymond or Curry = Orlando Magic. @katayikl @KapandeGift",
    "482": "VIDEO: Highlights NBA, Orlando Magic Kalahkan Golden State Warriors 94-90 https://t.co/WehW7CHqUF",
    "483": "Warriors Fall To Magic, 94-90; Suns Clinch First Place In Pacific D... (Cbslocal)\n\nORLANDO, Fla. (AP) - Franz Wagner made three free throws with 12.2 seconds remaining and dun...\n\nAdd your highlights:\nhttps://t.co/fiwIJUr9GH\n #GoldenStateWarriors",
    "484": "Orlando Magic earning the privilege of pressure\nhttps://t.co/Xb8VbYfOLl\n#LatestNews #BreakingNews #Entertainment #News #WorldNews #SportsNews",
    "485": "@OrlandoMagic @vihangajay5 gotta show this to Savindu 😭",
    "486": "Franz Wagner made three free throws with 12.2 seconds remaining and dunked on an inbounds play for the final points, leading the Orlando Magic to a 94-90 win over the Golden State Warriors. https://t.co/hQPVZ7GQwC",
    "487": "@BleacherReport @anthonyVslater Draymond: you’re trash, no offense \n\nOrlando Magic: https://t.co/0YxuLT0sXI",
    "488": "@OrlandoMagic @JJudahIsaac He has to go!!!were definitely gettin a top pick come next draft.. https://t.co/YkQvdMMRWU",
    "489": "The fact that Green actually agrees with the media people and Quin Snyder that HE is the MVP of the team, I absolutely have to point out: \n\nSteph Curry beat Dallas by 38, Milwaukee by 20, Chicago by 38, beat Utah twice, beat the Nets\n\nDraymond can't beat the Orlando Magic.",
    "490": "@OrlandoMagic @PapaJohnsORL They screwed up by winning instead of loosing games, Magic always in tragic situations dam.",
    "491": "#NBA: Tuesday night’s winners… @atlhawks @nuggets @bucks &amp; @orlandomagic!...\n \nhttps://t.co/ytTTaYXUx6\n \n#Basketball #NationalBasketballAssociation #NationalBasketballAssociation https://t.co/vUyGgAEw4j",
    "492": "I cannot believe the damn @warriors lost to @OrlandoMagic  . Short four points . Gtfoh . @StephenCurry30 is prolly going tf off right now !!! Four fcking points ! Cmon now . He cant be the one to always help with the Ws . Yall better pull yall damn weight and change plays .",
    "493": "Magic-Thunder matchup heavy on draft lottery implications  #NBA\n #okcthunder #ThunderUp #OrlandoMagic #PureMagic https://t.co/si1zhmP9he",
    "494": "Curry'siz Golden State Warriors, sonuncu Orlando Magic'e kaybetti... https://t.co/0bE5bYQkEx --- #sondakika #haber #sondakikahaber #haberler",
    "495": "Curry'siz Golden State Warriors, sonuncu Orlando Magic'e kaybetti    \nhttps://t.co/mieoV6mU6q https://t.co/YGvRPiLhSi",
    "496": "Draymond Green @Money23Green after the @Warriors 94-90 loss at the @OrlandoMagic Golden State’s 3rd straight loss allowed the @Suns to clinch the Pacific Division. @CBSNBayArea @KPIXtv 👇🏾 https://t.co/0U8fRq6PE2",
    "497": "Warriors: Golden State #Warriors vs. Orlando Magic Full Game Highlights | 2021-22 NBA Season - YouTube https://t.co/LzrudgXny2",
    "498": "@50NuancesDeNBA \"We're playing soft. We're playing stupid. We're just not playing good basketball and we're getting punked. ... No disrespect to the Orlando Magic but that's one of the worst teams in the league\"\n- Draymond after tonight’s loss\n(via @anthonyVslater)\nhttps://t.co/yUpGnoZqV4 🤮🖕",
    "499": "ALERT: New high roller bet posted!\nA bet has been placed for $14,740.57 on Oklahoma City Thunder - Orlando Magic to win $29,775.94.\nTo view this bet or copy it https://t.co/3qfrEIKtjl https://t.co/GRJIzSps6p",
    "500": "@OrlandoMagic @PapaJohnsORL I know Steph wasn't there but a fantastic #magicwin. @franzboogie back in it &amp; once again @wendellcarter34 showing why he's be one of the great #Magic trades. Just keeps delivering every game. Wins like this will give the team belief &amp; confidence for the future #MagicTogether",
    "501": "Oklahoma City Thunder - Orlando Magic\n\nBet slip link: https://t.co/vkD1MsXUMt https://t.co/UhpJ8lrfAb",
    "502": "@YoungBoyReturn @30likeimgifted @felix_mcfelix @NiMekhi @OrlandoMagic weirdo",
    "503": "Midkerr's son @Mocherexs heard lame Orlando magic pipe una ass smh",
    "504": "Franz Wagner made three free throws with 12.2 seconds remaining and dunked on an inbounds play for the final points, leading the Orlando Magic to a 94-90 win over the Golden State Warriors  https://t.co/9WPJdQB955",
    "505": "Golden State Warriors vs Orlando Magic Full Game Replay 2022 Mar 22 NBA Replay HD\nhttps://t.co/2zynkAuZhI https://t.co/fBG7OGbB7Z",
    "506": "@CantGuardBook1 @OrlandoMagic @Suns me, u cp0 and devin booker got the same amount of rings combined",
    "507": "@ORLmuse Magic fans coming to the Magic rescue. We won't anybody else disparage our own team, except the Magic fans. #MagicTogether #OrlandoMagic",
    "508": "@Pairedcat31 @DrGuru_ Relax that’s cap ..cos Denver without Jokic would still be better than Orlando,rockets,blazers just to name a few ..golden state without Steph lost tonight to the fucking magic lmao",
    "509": "@OrlandoMagic @Suns Thank you Magic! 🤝🤝🤙🤙😜😜🧡🧡💜💜",
    "510": "Orlando Magic: https://t.co/xUWq4ulJiJ",
    "511": "@OrlandoMagic @Vikings @athielen19 So that’s why y’all won",
    "512": "NBA Recap: Warriors run out of Magic in Orlando/Giannis great comeback vs. Bulls/Trae Young continues to generate hate at MSG https://t.co/rPXYwpUPNa",
    "513": "@OrlandoMagic @Suns lmao",
    "514": "What does @SteveKerr say to the fans of the @warriors after losing to @OrlandoMagic (20-53) one of the worst teams in the league; after coming off a loss to San Antonio (27-44) @spurs? It will be: Forget the ring, we can't win!!",
    "515": "@OrlandoMagic Man this is too good not to respect it. You bastards. 🤣🤣🤣",
    "516": "orlando magic of all teams as in🚮🚮🚮🚮🚮🚮🚮🚮",
    "517": "Now Playing on LITE 99 Orlando Every Little Thing She Does Is Magic by The Police #nowplaying #orlando #orlandomusic #softrock #oldies #florida #lastplayed #recentlyplayed",
    "518": "What does @Stevekerr think of losing to Orlando @magic (20-53) who is almost the worst team in the league, After loss of @spurs ? It's the message: Forget the ring, we can't win? @Money23Green",
    "519": "NBA\n\nFT.\n\nOrlando Magic 94 -90 Golden state warriors \n\nNew York Knicks 111 -117 Atlanta Hawks \n\nMilwaukee Bucks 126 - 98 Chicago Bulls \n\nDenver Nuggets 127 -115 Los Angeles Clippers \n\n#TheGamePlan",
    "520": "@ClappedDan @MNSportsFan0 @OrlandoMagic @Vikings @athielen19 Lol seriously, I grew up there, I grew up a Viking fan. Pretty simple. Not everyone enjoys freezing there ass off 8 months out of the year. I wake up to 70 degrees everyday. There’s more to life than Minnesota buddy.",
    "521": "@Iakerschip @OrlandoMagic so are we the lakers",
    "522": "Signed Orlando Magic 1993 94 Te #autographed https://t.co/RD0VzfpYkG",
    "523": "NBA Recap: Warriors run out of Magic in Orlando/Giannis great comeback vs. Bulls/Trae Young continues to generate hate at MSG https://t.co/kQILzrb8QA ⚽️⚽️  📲 Bet now via ⟶ https://t.co/0I4IIflkwI √ https://t.co/TE88ZsPbBr",
    "524": "@ClappedDan @MNSportsFan0 @OrlandoMagic @Vikings @athielen19 I grew up there, that was enough",
    "525": "@warriors But the @OrlandoMagic were more locked in!!! Got that Dub baby!!! No pun intended",
    "526": "Yo, you telling me Klay fouled Richardson late in the game on a 3 pointer against the Spurs and he did the same thing again against this Orlando Magic team? Lol wow Klay.",
    "527": "@SixthManShow @BleacherReport @anthonyVslater He is kinda wrong though. Orlando has been playing better basketball than the Ws all month. We're a better team *right now*, obviously been tanking. Also, if he was on the Magic, he would arguably be the 4th best starter on the team lol",
    "528": "@OTownNBA @goldenstateover @30likeimgifted @felix_mcfelix @NiMekhi @OrlandoMagic I really have no idea at this point but im not deleting that",
    "529": "@srchivlm @currygawker @73Babynewyear @OrlandoMagic Yes without the Goat Curry they are sadly cant even beat the shitty Magic who are the worst team in the league  lmao",
    "530": "Don't escape from Orlando Magic Peraimaru",
    "531": "@goldenstateover @YoungBoyReturn @30likeimgifted @felix_mcfelix @NiMekhi @OrlandoMagic Not condoning sending that but why instigate the convo in the first place is the question I ask that guy",
    "532": "#OrlandoMagic - #GoldenStateWarriors 94:90\n#NBA\n🇺🇸🏀🇺🇸🏀🇺🇸🏀\n\nMore info: https://t.co/lVx4S5hRNU https://t.co/8ajtfMn8wx",
    "533": "I’m just curious how the most complete team loses to the Orlando Magic 😂😂",
    "534": "@currygawker @73Babynewyear @OrlandoMagic so you’re saying your team is ass?",
    "535": "can’t wait for the “orlando magic has form” excuse.",
    "536": "lmao golden state warriors lost to orlando magic. 😂😂😂",
    "537": "No disrespect to Orlando Magic. This loss came as a surprise to me. https://t.co/MlKJ6dzKD8",
    "538": "@OrlandoMagic y’all have some dumb fans out there.",
    "539": "@srchivlm @73Babynewyear @OrlandoMagic My Goat Curry wasn’t playing so therefore that loss doesn’t count and the magic are still Bum asf. Hold this L bozo",
    "540": "We make excuses EVERY TIME for this team and that’s a bigger problem. Orlando magic has to be the wort team in the NBA but a squad led by JP, KT, AW, DG scored ONLY 38 points in the opening 2 Qtrs - that is inexcusable… https://t.co/SbqiKXD2Gq",
    "541": "@73Babynewyear @OrlandoMagic na they BUMS + YB better",
    "542": "@andre @OrlandoMagic mannnnn @andre i dropped 1800 on tickets to the Hawks Warriors game next day steph go down just tryna get the relay for the JP autograph fam !!!",
    "543": "@loveabundantly @OrlandoMagic @OfficialNBARefs There is no way you actually believe that…the refs did everything in their power for GSW to win and the warriors still couldn’t pull it off",
    "544": "@ZagsInTheNBA @SethDavisHoops Well if Chet goes to Orlando theyre all gonna be Magic Grizzlies or Wizards so that probably helps 😂",
    "545": "@hongtaeju2 @73Babynewyear @OrlandoMagic magic will never make playoffs again. poverty franchise",
    "546": "@49ersgiantsfan1 @warriors @OrlandoMagic @Dan_Savage Dan is the man! That’s awesome.",
    "547": "@_njsniper @OrlandoMagic Disgusting",
    "548": "@ClappedDan @Pat34795481Pat @MNSportsFan0 @OrlandoMagic @Vikings @athielen19 Oh okay I see watchu mean. I thought you were calling Florida sports teams shitty. My bad bro",
    "549": "@thisaintjalen respect my Orlando Magic lol",
    "550": "#Warriors-Orlando Magic: FREE GIVEAWAY! live commentary 2nd screen/analysis/PVO/Not illegal stream\n\nhttps://t.co/Vutp85zwIO",
    "551": "@Stephen0610 @warriors @OrlandoMagic Oh hell ya!!! Since 1989!! Even for a few autographs and D12’s game worn jersey after he played in sac long time ago. Haha even met my hero @Dan_Savage haha!!",
    "552": "@ClappedDan @Pat34795481Pat @MNSportsFan0 @OrlandoMagic @Vikings @athielen19 Your point was that it must be shitty to be a fan of Florida sports teams. My point is that Florida sports team wash Minnesota teams.",
    "553": "@curtiefoo @hongtaeju2 @OrlandoMagic Funky ass Magic ain’t been past the first round since Obama was in office, his first term 😂😂😂😂",
    "554": "🔥🚀 Fantasy TOP 10 (9cat H2H) Mar22 🚀🔥\n\n🏀🏀 Franz Wagner 🏀🏀\n\nRANK: #5\ndx score: 464\n\n6-9 FG 🔥\n6-6 FT 🔥🔥\n0 THREE\n0 REB\n3 AST\n2 STL 🔥\n1 BLK\n1 TO\n18 PTS\n\n@OrlandoMagic #Magic\n\nhttps://t.co/jAKFKdVzKB",
    "555": "@49ersgiantsfan1 @warriors @OrlandoMagic Is this another Bay Area Magic fan?",
    "556": "@OrlandoMagic Your social media guy either gettin fired or a promotion and I honestly can't tell which he deserves most.",
    "557": "@ElSleepyFloyd @hongtaeju2 @OrlandoMagic Hope they enjoy watching the playoffs in Cancun or wherever the rest of the bozos go that don't make the post season..",
    "558": "Nothing but love for @SHAQ though it took me YEARS (and years and years) to forgive his leaving @OrlandoMagic 🏀",
    "559": "@ClappedDan @Pat34795481Pat @MNSportsFan0 @OrlandoMagic @Vikings @athielen19 Let’s count Super Bowl wins. Bucs: 2 (about to be 3 🤫), Dolphins: 2, Vikings: 0. Jaguars are a pretty new team but yeah they suck.",
    "560": "warriors said screw your tankjob @OrlandoMagic",
    "561": "Disney World at 50: The Stories of How Walt's Kingdom Became Magic in Orlando Get eBook",
    "562": "@hongtaeju2 @curtiefoo @OrlandoMagic But that whole ass Magic team will be going on vacation in 2 weeks and the Warriors will be starting the real season that only elite teams get to \n\nLevels, Hong. \n☕️😎",
    "563": "@ClappedDan @Pat34795481Pat @MNSportsFan0 @OrlandoMagic @Vikings @athielen19 Florida’s sports teams are better than Minnesota bro",
    "564": "@ImGriz_ “No offense to the Orlando Magic, but they are one of the worst teams in the league” 🤣🤣🤣🤣",
    "565": "@BallyMagic @OrlandoMagic I love him",
    "566": "I had to….sorry my ⁦@warriors⁩ fans!! I’m a ⁦@OrlandoMagic⁩ HUGE fan. Go #orlandomagic https://t.co/xJ3lGcfPOa",
    "567": "Like Draymond Green didn’t actually try to discredit the Orlando Magic for being the worst team in the league. Nobody believes that coming out of Draymond’s mouth.",
    "568": "“No disrespect to the Orlando magic but they the worse team in the league” Draymond Green quote. Bruh you had 2 points in 28 minutes. STFU!!!",
    "569": "Draymond Green calls the Orlando magic one of the worst teams in the league but he had only 2 points !",
    "570": "@currygawker @OrlandoMagic fact they got come wit revenge !!🫡",
    "571": "@NBA @OrlandoMagic warriors you guys have to do better",
    "572": "@DDDGURU @warriors @OrlandoMagic Kerr actually Bottom 15 coach",
    "573": "@30likeimgifted @YoungBoyReturn @NiMekhi @OrlandoMagic average pissed off warriors fan after a loss",
    "574": "@LegionHoops @anthonyVslater Might as well have said no disrespect to the Orlando Magic, but they should just fold.",
    "575": "@CarsonJSchmidt @alan_thomas95 @OrlandoMagic @Vikings @athielen19 If they send Evans and Wirfs sure",
    "576": "@OrlandoMagic warriors fans are pissed 😹😹",
    "577": "Against @OrlandoMagic? Seriously @warriors ?",
    "578": "Draymond on tonight’s loss: \n\n“We're playing soft, we’re playing stupid. We're just not playing good basketball and we're getting punked. No disrespect to the Orlando Magic but that's one of the worst teams in the league.”\n\n(H/T @anthonyVslater) https://t.co/y4IIkbn0qn",
    "579": "Why do the Orlando Magic get more coverage than the raps 😭😭😭",
    "580": "@Qdwag94 @BleacherReport @anthonyVslater My thoughts exactly. The classy way to say that is “No disrespect to the Orlando Magic, but they have one of the worst records in the league.” Saying we’re one of the worst teams just feels like bad sportsmanship.",
    "581": "Did Draymond Green forget that the Warriors were 15-50 in 2020 with the same talent as the Orlando Magic? https://t.co/06a2IkfonE",
    "582": "This is a little late, but my phone was low on battery but... THE @OrlandoMagic WON DURING MY FIRST EVER TIME THERE!!!",
    "583": "Encerrado:\n\nOrlando Magic (20-53) 94 x 90 (47-25) Golden State Warriors\n\nORL 📊\nWendell Carter Jr: 19PTS/8REB\nFranz Wagner: 18PTS/3AST/2STL/1BLK\n\nGSW 📊\nJordan Poole: 26PTS/2REB/6AST\nKlay Thompson: 15PTS/2REB/3AST/2STL\n\n#NBA https://t.co/Zplh1wKbza",
    "584": "The Warriors scored 90 in a loss to the Magic. Then their leading voices sounded some alarm bells postgame.\n\nStory from Orlando https://t.co/SM8EDy4EUY",
    "585": "@mevvybear Well he should at least beat the Orlando Magic with the “DPOTY”",
    "586": "@OrlandoMagic @OriginalBayArea Damn this is tough",
    "587": "@Pat34795481Pat @MNSportsFan0 @OrlandoMagic @Vikings @athielen19 Oh bummer, anyways",
    "588": "@DanteMagic @OrlandoMagic @OKC RJ steal too 🔥",
    "589": "@nicknbanaylst @goatballhandler @dubsforever7 @BolWrld But can’t put up more than 15 against the Orlando magic",
    "590": "@goldenstateover @30likeimgifted @felix_mcfelix @NiMekhi @OrlandoMagic Sorry",
    "591": "Warriors lost to the damn Orlando Magic and couldn’t even put up 90 points. How dare y’all say anyone is more valuable than Stephen Curry? GS had a top 2 record most of the season. But you know he shot like Dame instead of himself part of the yr so somehow he was less valuable.",
    "592": "@OrlandoMagic @warriorsworld draymond is right, we are getting punked 😭",
    "593": "Mo Bamba hit a go-ahead 3-pointer with 52.2 seconds left and the host Orlando Magic handed the Golden State Warriors their third straight loss with a 94-90 comeback victory on Tuesday night.\n\nhttps://t.co/rI6KxUWQry",
    "594": "“NO DISRESPECT TO THE ORLANDO MAGIC, THEY’RE ONE OF THE WORST TEAMS IN THE LEAGUE”💀💀",
    "595": "@LucianBM Clearly not the clippers they are in playins and good position to compete for the playoffs \n\nWe are worst team in the league without Curry got completely outplayed by Orlando magic",
    "596": "@MNSportsFan0 @OrlandoMagic @Vikings @athielen19 Oh wow that’s great, I grew up there and I moved the hell out. Not a fan of snow and cold anymore",
    "597": "@OrlandoMagic Didn’t y’all get eliminated from playoff contention already like a couple weeks ago I think y’all even got the big’ol  E in the standing on the NBA App and it’s a E for eliminated",
    "598": "@Suns you're welcome 🤝",
    "599": "Adam at the Magic game in Orlando tonight #Vikings https://t.co/xdWFGRn9Ru",
    "600": "@njerinjehu @NBA @OrlandoMagic This is wild 😂",
    "601": "@OrlandoMagic @JJudahIsaac Fultz has fixed his shoulder came back torn an acl missed a year and came back...... yet we still haven't seen JI......",
    "602": "And my amazing Orlando Magic let it happen https://t.co/Er0UI3ye7i",
    "603": "@Pat34795481Pat @OrlandoMagic @Vikings @athielen19 It was 70 here in minny yesterday",
    "604": "The @warriors (47-25) collapse in the fourth, fall to the @OrlandoMagic 94-90. #dubnation was outscored in the fourth 29-16.",
    "605": "@TonetzNapa @NBA @OrlandoMagic Shooting %",
    "606": "@JBOrl11 @SadMagicFan1996 @CantGuardBook1 @OrlandoMagic That's so funny",
    "607": "@NBA @OrlandoMagic Stephen A in shambles.",
    "608": "@BleacherReport @anthonyVslater @OrlandoMagic  can we get a cry baby meme going here?",
    "609": "@BleacherReport @anthonyVslater You didn’t take Orlando serious.  You thought you could half ass play and beat the so called lowly Magic.",
    "610": "I wish this disrespect lives rent free in the Magic’s head. #orlandomagic https://t.co/pjwi4ZZJNn",
    "611": "Orlando Magic 🪄 https://t.co/XRRyivUUdI",
    "612": "@OrlandoMagic Why does this sound like they’re dissing themselves",
    "613": "@SixthManShow @BleacherReport @anthonyVslater ORLmuse\n@ORLmuse\n · 2h\nThe Orlando Magic have not lost to the Golden State Warriors at home since December 1st, 2017. \n\nHe is dead wrong Crymon Green",
    "614": "Franz Wagner made three free throws with 12.2 seconds left and dunked on an inbounds play for the final points, leading the Orlando #Magic to a 94-90 win over the Golden State Warriors on Tuesday night.  #NBATwitter #NBA https://t.co/oq4Aw6UQte",
    "615": "@Org3Babyface @NBA @OrlandoMagic still don't care bitch",
    "616": "Middle Tennessee ML (2) ✅💰🔥\nUNCW 2H Over 79.5 (2) ✅💰🔥\nOrlando Magic Live (1) ✅💰🔥\nUNCW Over 152.5 (1) ✖️\n\nAnother amazing day! Follow for more!",
    "617": "@NBA @OrlandoMagic sad times…",
    "618": "@JohnnyH004 @gswforIife @OrlandoMagic he also has 0 rings",
    "619": "@YoungBoyReturn @30likeimgifted @felix_mcfelix @NiMekhi @OrlandoMagic you weird smh",
    "620": "@YoungBoyReturn @NiMekhi @OrlandoMagic y’all had lottery picks the past 10 years now lol",
    "621": "@OrlandoMagic Way to go 🪄",
    "622": "@NBA @OrlandoMagic This season is more different than I thought",
    "623": "@NBA @OrlandoMagic I was told Steph curry is not the MVP of this season 😳\nWarriors is 2-8 without Steph",
    "624": "@iambroots Yep, made a killing with Orlando magic today. The under was amazing! Made more than cryptos. Amen!",
    "625": "@DaddyStepback @StepbackAch @DetroitPistons @OrlandoMagic @okcthunder That tells me they can't handle the losing at all, the Rockets haven't hadn't had a losing season before last year in 15 years and people were losing their minds, there's no guarantee at all that they won't be at the bottom again next season",
    "626": "There's a team that lost to Orlando Magic 🥺. A moment of silence for them and their fans. https://t.co/yvQdKjxN3c",
    "627": "Warriors' Draymond Green: 'We're not playing good basketball and we're getting punked'\n\nThe Golden State Warriors lost to the Orlando Magic on Tuesday night, 94-90, and Draymond Green had harsh things to say about his team's performance. https://t.co/k2Q2XtVteJ",
    "628": "@SJSUAthletics why was the @SJSUAthletics logo on the @OrlandoMagic court all the way in Orlando?",
    "629": "Draymond Green reflects on Warriors close lose against the Magic: ‘We’re playing soft, we’re playing stupid’  #DraymondGreen #GoldenStateWarriors #OrlandoMagic https://t.co/5oFRxpRhJR",
    "630": "@RJHubbs17 @OrlandoMagic @haha_cd6 @Vikings @athielen19 Ratio",
    "631": "@Carter69081515 @NBA @OrlandoMagic You haven’t won a ring in general never 😹",
    "632": "@OrlandoMagic The disrespect",
    "633": "@ReiterSB @OrlandoMagic @IveyJaden Looking like Ja Morant out there!! Magic better not mess this up",
    "634": "@Org3Babyface @NBA @OrlandoMagic you're right we've never won a mickey mouse ring",
    "635": "@OrlandoMagic You just lost this season",
    "636": "@DDDGURU @warriors @OrlandoMagic +7.5 and no Curry big guy.",
    "637": "@OrlandoMagic Relax you’re not making the playoffs 😂😂",
    "638": "@OrlandoMagic I would say \"You Just lost to the Orlando Blooms\"",
    "639": "@warriors My first NBA experience was amazing but the outcome of the game was very disappointing not only did we lose @StephenCurry30 who Was the reason I bought tickets but we also lost to the @OrlandoMagic of all teams no disrespect to them tho🥲🙃#NBA #goldenstatewarriors",
    "640": "@Carter69081515 @NBA @OrlandoMagic You haven’t won a Mickey ring never",
    "641": "The Orlando #Magic knock off the Golden St. #Warriors 94-90. Steph Curry sat this one out. Wendell Carter Jr. posted 19pts and 8rebs for the magic while Jordan Poole put up 26pts and 6asts for the Dubs. #NBATwitter https://t.co/vD1J5HfStf",
    "642": "@OrlandoMagic @CoachGusMalzahn @UCFKnights @UCF_Football BOOM!!!!",
    "643": "@cardinals150 \nNo disrespect to Orlando Magic, but they suck!! https://t.co/qRYllooIqN",
    "644": "@Org3Babyface @NBA @OrlandoMagic 3 years and try winning a real ring and not a mickey mouse ring bitch",
    "645": "@OrlandoMagic @Vikings @athielen19 Pretty sure he’s been to the O before 🤷🏻‍♂️🤦🏻‍♂️",
    "646": "@DaddyStepback @StepbackAch @DetroitPistons @OrlandoMagic @okcthunder Same here, I just don't think people realize how much of a drop there is after 4, a few meaningless wins at this point of the season shouldn't make anyone feel better especially since they're playing teams missing their best players",
    "647": "@KingGi0 @OrlandoMagic @IveyJaden He’s nassssttyyyy",
    "648": "@NBA @OrlandoMagic why the warloss are overrated?\n\n- Stephanie Curry  can’t defend and every team runs whoever offense on him💀💀\n- Steve KerrBum is not a real coach 🤦‍♂️\n- Andrew Bum Wiggins is a walking garbage🗑\n- Jordan Swimming Poole is absolutely overrated\n- Can’t win without 5 all stars🤡",
    "649": "@Carter69081515 @NBA @OrlandoMagic you haven’t made the playoffs in 31 years",
    "650": "@NBA @OrlandoMagic Larriors are nothing without Curry",
    "651": "@OrlandoMagic There’s a lot of salty gsw fans in here",
    "652": "@DDDGURU @warriors @OrlandoMagic They’re not very good, that’s how",
    "653": "Franz Wagner scored the last 5 points of the game for the @OrlandoMagic to lift them to the win at home! #MagicTogether  \n\nFranz Wagner: 18 PTS, 2 STL\nCole Anthony: 14 PTS, 5 REB, 5 AST\nWendell Carter Jr: 19 PTS, 8 REB\nJordan Poole: 26 PTS, 6 AST, 5 3PM https://t.co/xsyVnavdQz",
    "654": "@KSBWDrea I thought he was the greatest defensive player of all time? And he can't stop the friggin Orlando Magic? Maybe less fucking podcasting and TNT and more focusing on your opponents?",
    "655": "@AbelGe87 @StepbackAch @DetroitPistons @OrlandoMagic @okcthunder 10 losing streak here we come 🤞",
    "656": "NBA Basketball Game Betting Picks Simulator: 3/23/2022 8:00 PM ET - Orlando Magic vs. Oklahoma City Thunder - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/VJNMrOkxaI #nba #sportsbetting #freepicks #cappertek",
    "657": "“No disrespect to the Orlando Magic; that’s one of the worst teams in the league.” \n\n-Draymond Green, after losing to the Orlando Magic. \n\n💀",
    "658": "Poole's second half heroics come up short in Warriors' loss to Magic (East Bay Times)\n\nORLANDO, Fla. - Jordan Poole's second half heroics came up short Tuesday in the Warriors' 94...\n\nAdd your highlights:\nhttps://t.co/w4QTZr2daT\n #GoldenStateWarriors",
    "659": "@StepbackAch @DetroitPistons @OrlandoMagic @okcthunder No doubt, it's doesn't even have to be the top pick or number 2, just landing in the top 3 would be more than good enough",
    "660": "@JayssPlayss @EVRYDAYCarter @RyanBarnhart0 @andre @OrlandoMagic Nice “blowout”",
    "661": "@bonyscribe @Canes No question. NC State is actually not the smaller extent either. (Duke is by numbers). But i was talking about pro sports. I feel similar about Orlando and Im a Magic fan.",
    "662": "@StepbackAch @DetroitPistons @OrlandoMagic @okcthunder He got hot at the worst possible time, top it off these teams are all missing their best players, falling out of the bottom 3 and ending up with the 6th pick would be a disaster",
    "663": "@dbs408 What exactly is so wrong with this roster that it can’t beat the Orlando magic in March? 😂\n\nYou guys stick to your narratives I’ll give you that",
    "664": "LoL the @warriors seriously lost to the @OrlandoMagic?  Man, Klay Thompson is just not very good.",
    "665": "@krjie_13 @ORLmuse @OrlandoMagic Trust me it's in my memory\n\nhttps://t.co/Z18CHy7eUK",
    "666": "@currygawker @OrlandoMagic Looks like you need one of them bum players when Curry is out.",
    "667": "@MeganMakinMoney You did good, but did you have the Orlando Magic on the money line? https://t.co/kAqp4bJAXG",
    "668": "@OrlandoMagic @PapaJohnsORL WWW THANK YOU",
    "669": "Orlando Magic 94 (Wendell Carter 19 pts) Golden State Warriors 90 (Jordan Poole 26 pts), New York Knicks 111 (R.J. Barrett 30 pts, 13 rebs) Atlanta Hawks 117 (Trae Young 45 pts, Bogdan Bogdanovic 32 pts)",
    "670": "@OrlandoMagic Guys they’re not used to this",
    "671": "@DDDGURU @warriors @OrlandoMagic Lots of mistakes; just all around sloppy 🏀! I’m afraid for the playoffs…😧",
    "672": "How does a loss to the Orlando Magic affect Chris Chiozza’s legacy?",
    "673": "I credit #GamblingTwitter for the nba props this late in the year. Shit so inconsistent the last 15 games. Teams play with nothing to lose a la the Orlando magic",
    "674": "@ORLmuse @OrlandoMagic Damn",
    "675": "@Jacqleeen Orlando magic https://t.co/fQf39pHfIE",
    "676": "@DanteMagic @OrlandoMagic @OKC 12-14 since the Chicago win!\n\nBeen playing close to .500 for 2 months now",
    "677": "“We’re playing soft. We’re playing stupid. We’re just not playing good basketball and we’re getting punked. … No disrespect to the Orlando Magic but that’s one of the worst teams in the league”\n\nDraymond Green is fed up with the Warriors recent performances 😡 https://t.co/0id3Cbrdwd",
    "678": "@OrlandoMagic Bruh even the social media page clowning the team…did they really think this was a W?",
    "679": "@OrlandoMagic @PapaJohnsORL Thank you https://t.co/xotSrsA89V",
    "680": "@RyanGreen1010XL @OrlandoMagic No doubt the future is bright can't wait till next season",
    "681": "I think Papa John's should reconsider this promo next year. This group will be at least .500 next year. #orlandomagic  #MagicTogether https://t.co/eZpS4vN919",
    "682": "Wait a minute guys, we lost to Orlando Magic 💀💀...damn this team really needs Steph curry back https://t.co/9aKYGIocMr",
    "683": "@73Babynewyear @currygawker @OrlandoMagic Its always those Curry dickriders… They aint no shit but Curry 😭",
    "684": "@currygawker @73Babynewyear @OrlandoMagic warriors still lost bozo lol",
    "685": "@warriors We aint winning no chip if a Curryless team can't beat the Orlando Magic. 😔",
    "686": "Golden State Warriors vs Orlando Magic - Full Game Highlights | March 22, 2022 | 2021-22 NBA Season\nhttps://t.co/3UA68Qdha0\nhttps://t.co/3UA68Qdha0",
    "687": "@gswforIife @OrlandoMagic And yall lost to that “Ringless team”💀💀",
    "688": "Big time win by these young @OrlandoMagic players over GSW 💪🏼 \n\n3-3 homestand\n\n7-6 since All-Star break\n\nSeek 1st 3-game win streak of season tomorrow @OKC \n\nWendell a beast, Cole dives on floor, Cole pass, Mo 3, Mo block, Franz FTs, Chuma pass, Franz dunk!  HUGE PLAYS LATE",
    "689": "@OrlandoMagic win means nothing lmao, enjoy that 19th straight lottery pick",
    "690": "@OrlandoMagic Big W lol",
    "691": "Best coach in the world can’t beat the Orlando magic? https://t.co/SDWT8ZyK8C",
    "692": "Thanks @OrlandoMagic",
    "693": "When will I listen to @BWalkerSEC about following line movement. @OrlandoMagic was such a sharp play",
    "694": "Signed a 10 day contract with the Orlando Magic. 😎😂 #MagicTogether https://t.co/aZullLADX7",
    "695": "@OrlandoMagic @Vikings @athielen19 @athielen19 you'd be surprised at the number of Minnesotans who live in Florida, especially on the gulf coast. Happy your enjoying the offseason here! #skol",
    "696": "@Pato @OrlandoMagic ORLANDO TILL WE DIE",
    "697": "@bayelrey80 @Uncle_Alchemy Hell he can at least simplify the offense. Your telling me we cant score a 100 points on the damn Orlando Magic? Come on man",
    "698": "Here is today’s (3/22) postgame media session with @OrlandoMagic forward @franzboogie:\n\n#MagicTogether\n#NBARooks\n\nhttps://t.co/hBKgFIBhVA",
    "699": "Here is today’s (3/22) postgame media session with @OrlandoMagic guard @The_ColeAnthony:\n\n#MagicTogether \n\nhttps://t.co/181EMEDKJz",
    "700": "@73Babynewyear @OrlandoMagic all of them players are on 10-day contracts. They are BUMS. CURRY&gt;",
    "701": "Draymond Green after Dubs’ loss: \"We're playing soft. ... No disrespect to the Orlando Magic but that's one of the worst teams in the league.” 😬\nhttps://t.co/x1rO3AlMUw",
    "702": "@CjHolmes22 Orlando Magic decided for em",
    "703": "Cry baby NBA players when they lose to us. We mess with your head. \"One of the worst teams in the league\" with a bunch of young guns who are finally healthy and vibing. Watch out league. Disrespect. @OrlandoMagic https://t.co/Qm1ulJeuEw",
    "704": "Dawg! @OrlandoMagic fans probably like 🫠 https://t.co/tbSARa9UdY",
    "705": "@OrlandoMagic There’s no way you win back to back nights",
    "706": "@xwh_yz @mel_pesos @NBA @warriors @OrlandoMagic i be ballinnn like a mf pro",
    "707": "Eeeiii, what has become of this team? Orlando Magic?!!! https://t.co/TaqZN1DBNW",
    "708": "@TheWarriorsTalk Could kerr clear this up, is he saying as the coach w 3 chips 5 straight finals no longer knows how to win??? No Steph &amp; he can't figure out how to win!! It's a back to back tomorrow kerr, do the team &amp; yourself a favor set yourself out. Figure it out. Orlando Magic tho! 😂",
    "709": "And losing to the Orlando Magic? Man this is not looking good right now, especially after that loss to the Spurs on Sunday.",
    "710": "@OrlandoMagic @afejr33 this gets me every time. With the big fella holding the box. 😂",
    "711": "@shesingsforfree I’m a loyal Orlando Magic fan. \n\nThe bar isn’t set all that high. 😅",
    "712": "@gswforIife @OrlandoMagic And you’re still mad about a hustle play from 2 weeks ago 😂",
    "713": "Magic pass Pistons in win column. Orlando has two or three winnable games left, including OKC tomorrow. https://t.co/Vd3MZVMpDt",
    "714": "@gadielcartagena \"We're playing soft. We're playing stupid. We're just not playing good basketball and we're getting punked. ... No disrespect to the Orlando Magic but that's one of the worst teams in the league\"\n\n- Draymond after tonight’s loss\n Yeah we're in trouble tomorrow lol",
    "715": "my Orlando Magic fandom will rival @bykevinclark’s for the next 24 hours.\n\nno further questions at this time.",
    "716": "@currygawker @OrlandoMagic I am missing the point here. Magic didnt have Isaac, MCW, T Ross &amp; Suggs.",
    "717": "Draymond Green still in his prime dropped 2 points against the Orlando Magic. Yet was trash talking Paul Pierce on his way out. Make it make sense 🤷🏾‍♂️",
    "718": "\"We're playing soft. We're playing stupid. We're just not playing good basketball and we're getting punked. ... No disrespect to the Orlando Magic but that's one of the worst teams in the league\"\n\n- Draymond after tonight’s loss\n\n(via @anthonyVslater)\nhttps://t.co/PeseVYpGcM",
    "719": "My prediction that Poole would hang 40 on Orlando was a bad call (he scored 26), but my claim that the Warriors would be mostly ok for a couple weeks without Steph is looking idiotic. Held to 90 points by the Magic? Wow. Only OKC has scored fewer (85) in a game vs ORL this season",
    "720": "We beat the Warriors😂 Let’s go @OrlandoMagic",
    "721": "BLOWOUT WINNERS💰💰\n\nTrae Young Over 27.5 Points✅\n\nOrlando Magic vs GSW Under 216.0 ✅ https://t.co/ZsGNiVelox",
    "722": "LMAOOOOOOO the @warriors without @StephenCurry30 SHOULD WIN VS THE ORLANDO MAGIC!!!\n\nand we lost. haha. \n@StephenCurry30 IS THE MVP. He kept this team in the 2nd seed while klay and dray are in and out of the lineup. \n\nas usual, we ain't winning shit without WARDELL\n#Dubnation",
    "723": "@SourdeathSam @OrlandoMagic I will never emotionally recover from this",
    "724": "@kd3rdburner @gogobobo711 @warriors You go up 10 entering the fourth quarter against a a bad team do you think anyone gives af if the WARRIORS who have championship aspirations have “enough chemistry” to win that game vs the ORLANDO MAGIC??",
    "725": "Kyle or Steve - who is handling 4th quarters worse? Geezus. Got punked by the fucken Orlando Magic. #dubnation",
    "726": "@Chrisan10_ Ain’t no way the Orlando Magic are meming us trade everyone immediately",
    "727": "@Mike_Hern92 @OrlandoMagic Amen to that - hopefully this is the one and only full year of doing it for a while",
    "728": "PLEASE @OrlandoMagic DRAFT @IveyJaden 🙏🏼 https://t.co/GNoMGQNvwm",
    "729": "like there's no excuse losing to the Orlando Magic, I don't give a fuck who not playing.",
    "730": "@kd3rdburner @gogobobo711 @warriors Again .. IT’S ORLANDO. Watch Phoenix play. Aaron holiday just got there and fits in seamlessly. Torrey Craig, biyombo, all of their new acquisitions came in not missing a beat. That’s great coaching. Idgaf if Wiggins ain’t played with Klay. It’s THE MAGIC",
    "731": "@OrlandoMagic This Terminator/Warriors mash-up is weird, but I am in.",
    "732": "@OrlandoMagic please beat us tomorrow",
    "733": "But not as painful as the dubs losing to the fucking Orlando Magic bum dum tiss",
    "734": "@DDDGURU @warriors @OrlandoMagic Jordan Poole is the only player on the floor who can score.",
    "735": "All Star Starter Andrew Wiggins scored 13 points (5-19) in a loss to the Orlando Magic. And Draymond had 2 points in 29 minutes.",
    "736": "@vivenoe @OrlandoMagic Take the L",
    "737": "@BayAreaSportsF7 @ZevanShuster @RajChipalu @Sunny1Singh_ They just lost to the Orlando magic bru",
    "738": "@vivenoe @OrlandoMagic Ratio.",
    "739": "Poole drops nearly 30 almost every game if not more sometimes and y’all still find a way to lose. Ik we ain’t got Steph but Orlando MAGIC???! Pleaseeee",
    "740": "The Orlando Magic.",
    "741": "\"In order to execute it requires a certain level of physicality, and we're not meeting that.\n\nNo disrespect to the Orlando Magic but that's one of the worst teams in the league, and we can't match that with them.\" https://t.co/Zo4imQqOPj",
    "742": "@oneandonlyomxr @SurtainSzn @bw_ignite @ORLmuse @OTownNBA @OrlandoMagic Own that last place in the AFC West Fraud 🙏🏼",
    "743": "\"In order to execute it requires a certain level of physicality, and we're not meeting that.\n\nNo disrespect to the Orlando Magic but that's one of the worst teams in the league, and we can't match that with them.\" https://t.co/MLStTuUjds",
    "744": "@OrlandoMagic Thanks for letting the pistons get a better pick",
    "745": "@SurtainSzn @bw_ignite @ORLmuse @OTownNBA @OrlandoMagic how bout you go look at some bitches",
    "746": "@ORLmuse @OrlandoMagic @jasonwithawhy WE FUCKING OWN YOU",
    "747": "@OTownNBA @gswforIife @OrlandoMagic and they still lost😭😭😭",
    "748": "@moseskuminga @TheACExperience @gswforIife @OrlandoMagic Y’all really beefin with magic fans ?",
    "749": "Curry fans went from \"Wait till Draymond Comes Back\"\n\nTo this 🤣\n\nMy Orlando Fuckin Magic messing up They heads https://t.co/HtSJrABEvs",
    "750": "Draymond Green Says Warriors 'Playing Soft,' 'Playing Stupid' After Loss vs. Magic: The Golden State Warriors didn't have Stephen Curry for Tuesday's 94-90 loss to the Orlando Magic, but Draymond… https://t.co/uxbTlC3fnx #Basketball #NBA #GoldenStateWarriors #DraymondGreen https://t.co/aX0HVWbXxN",
    "751": "Come on!\n\nIt's Orlando Magic.\nOrlando Magic!!!!!! https://t.co/MRKhcPjltw",
    "752": "@kd3rdburner @gogobobo711 @warriors Warriors had 11 fourth quarter points with a minute left in the game against the ORLANDO MAGIC",
    "753": "@samesfandiari Orlando Magic beating the Golden State Warriors is a travesty. Need to go into the NBA Playoffs on a winning streak.",
    "754": "With a Orlando Magic win the Detroit Pistons are sitting with the second best odds at the 1st overall pick In the 2022 NBA draft 👀 https://t.co/XTJzlT4LYJ",
    "755": "\"No disrespect to the Orlando Magic, but that’s one of the worst teams in the league.\"\n\nDraymond Green didn't hold back in his assessment of the Warriors following tonight's loss\n\nhttps://t.co/wWVTihXx1T",
    "756": "So listen\nHowever we can get this done\nDear @OrlandoMagic &amp; @AmwayCenter \n\nGet whomever you want to join in &amp; dance\nI want to perform/sing this song heading to the arena.\n\nI've been playing in metal venues in orlando since 09, &amp; been a magic fan since 94.\n\nThis is destiny https://t.co/sPABbeuqvH",
    "757": "@OrlandoMagic @The_ColeAnthony Fb pls",
    "758": "@SkolCash @magicscotti @raven_king18 @GerrieJoe @OrlandoMagic @Vikings @athielen19 Easy there killer, if it’s so shitty why do you flock here from up North",
    "759": "@gswforIife @OrlandoMagic Damn that would mean like the jazz nets grizz pacers suns are all trash franchises too",
    "760": "@OrlandoMagic @The_ColeAnthony Come home and shave it off Cole",
    "761": "getting trolled by the orlando magic is rock bottom https://t.co/YhYIjUkYup",
    "762": "@Tyler_Fulghum @OrlandoMagic @warriors Dude but it's crazy all we talk about is the teams depth . And they can't beat Orlando without Steph . I get Klay and Draymond coming back from injuries . U think they can get it together for the playoffs? They're dropping in standings too",
    "763": "Warriors lost to the Magic tonight in Orlando on the first night of their back-to-back in Florida. https://t.co/R2iDPzuiYd",
    "764": "@OrlandoMagic You know damn well yall would've lost if Curry were there. But have at it.",
    "765": "I barely caught the game lmao what fuckin losers how you lose to the Orlando Magic 😂😂😂😂😂",
    "766": "Draymond: \"No disrespect to the Orlando Magic, but that’s one of the worst teams in the league. If you can’t match up with them you’re definitely not going to do it against a great team.\" #NBA https://t.co/bSW4cD0avY",
    "767": "@YrgBdot @OrlandoMagic Damn that goes along with teams like the jazz suns nets pacers",
    "768": "@FattyMcPatty5 Magic have low key beat the Warriors 4 straight times in Orlando. We OWN those frauds",
    "769": "Wagner, Orlando Magic deal Warriors third straight loss – NBA News https://t.co/Iw9r8PiQk4",
    "770": "@ThakidSpazz It’s the Orlando Magic, ain’t nobody hearin that shit, and they blew a lead☠️I’m highly aware Steph ain’t play but this is still a easy game",
    "771": "@kd3rdburner @ItLandedHere @gogobobo711 @warriors against the tanking team known as the orlando magic…",
    "772": "@OrlandoMagic @Vikings @athielen19 Enjoying weather in a non shitty state",
    "773": "@OrlandoMagic Wild graphic fr",
    "774": "@RyanGreen1010XL @OrlandoMagic Lol the future will always be bright for the magic",
    "775": ".@IAmApoloJr #Congratulations 👏🙌 #andnew @prowrestlingtc #champion I guess the @OrlandoMagic @Kay_Lee_Ray &amp; @shirai_io aren't the only #winners tonight! #TooSweet🤘 https://t.co/3oCPDlyZDx",
    "776": "@OrlandoMagic Orlando team and front office is fucking garbage for even posting something like this. Should be embarrassed.",
    "777": "@30likeimgifted @felix_mcfelix @NiMekhi @OrlandoMagic This funnier https://t.co/EqwMxo8yOS",
    "778": "@OrlandoMagic W ADMIN",
    "779": "@30likeimgifted @YoungBoyReturn @NiMekhi @OrlandoMagic Okay \"30likeimgifted\" 30likeimstupid",
    "780": "Tired: The Golden State Warriors \nWired: The Orlando Magic https://t.co/NENrkDtHPL",
    "781": "@YoungBoyReturn @felix_mcfelix @NiMekhi @OrlandoMagic Hahaha omg too funny https://t.co/sDNiJXyvdd",
    "782": "@DaltonJ_Johnson I'm sorry, just really depressed about losing to the Orlando Magic, it says alot. Sorry 😞",
    "783": "@DDDGURU @warriors @OrlandoMagic Terrible",
    "784": "@30likeimgifted @felix_mcfelix @NiMekhi @OrlandoMagic Ok gravity merchant",
    "785": "@Sunsmuse_ Golden State Warriors loss to the Orlando Magic hurts because I am sure that the Lakers wanted the easier opponent Golden State to be the #1 Seed.",
    "786": "@30likeimgifted @felix_mcfelix @NiMekhi @OrlandoMagic Say the Nigga word NOW https://t.co/CQdfWuIRjC",
    "787": "Wow the Orlando magic actually helped me make money tonight that’s insane",
    "788": "@tschwartz09 @currygawker @OrlandoMagic i mean they called him the goat so that was implied",
    "789": "@OrlandoMagic Liking for this beautiful graphic of a classic 👏🏾",
    "790": "@felix_mcfelix @YoungBoyReturn @NiMekhi @OrlandoMagic Okay felix mcfelix lmao",
    "791": "Orlando Magic ✅\nBut how could I have made people believe it. https://t.co/yy0fpVHQBz",
    "792": "Somebody on twitter said the bulls turn into the Orlando magic anytime they play a half decent team and shit couldn’t be more true",
    "793": "@raven_king18 @SkolCash @magicscotti @GerrieJoe @OrlandoMagic @Vikings @athielen19 Incorrect https://t.co/SwGICdSk7g",
    "794": "The @OrlandoMagic rally in the 4th quarter to hand the @Warriors their 3rd straight loss! #NBA75 \n\nVisit https://t.co/K9jJDOXjil for other updates. https://t.co/756dbWhskQ",
    "795": "So I'm all caught up on here for today \n\n1. LSU old timer media vs LSU new school media \n\n2. Orlando Magic with the comeback W against GS\n\n3. Crazy ass Tornado videos\n\n4. Terron Armstead to Miami\n\n5. Everyone is re-signing back with Tampa now that Brady is back",
    "796": "@Tydozer_ @EarlyJulius @LukeSwiatek @AndrewLeezus What about all Orlando Magic games?",
    "797": "@MCLOVIN21200 @OrlandoMagic @warriors 🤢 May have been looking ahead to tomorrow night in Miami.",
    "798": "Orlando Magic vs Golden State Warriors was on Bally Sports Florida. With commentary from David Steele. Co-commentator is Jeff Turner. Reporter is Dante Marchitelli.  For more details see https://t.co/RBDhmA5ojg #OrlandoMagic #GoldenStateWarriors #BallySportsFlorida",
    "799": "@OrlandoMagic @CoachGusMalzahn @UCFKnights @UCF_Football Do it for Chuma",
    "800": "So @Tyler_Fulghum all of a sudden the @OrlandoMagic defense turned into the 2000 pistons ? What the hell is going on with the @warriors I understand Steph didn't play but come on . They blow a huge lead in 4th . Warriors are done man !",
    "801": "Mo Bamba hit a go-ahead 3-pointer with 52.2 seconds left and the host Orlando Magic handed the Golden State Warriors their third straight loss with a 94-90 comeback victory on Tuesday night. https://t.co/6piZEjBIjM",
    "802": "Golden State Warriors vs Orlando Magic Full Game Highlights | March 22, ... https://t.co/LQz1D2Z6y9 @YouTube",
    "803": "@30likeimgifted @YoungBoyReturn @NiMekhi @OrlandoMagic Dodging my response. Your a slick one. Bro doesn't want move on cuz he's obsessed. Get help \n\nHeres the number: (1-800-273-8255)",
    "804": "@DDDGURU @warriors @OrlandoMagic Fo real... They got nothing rn.",
    "805": "The Warriors without Steph Curry lost to the Orlando Magic, is this a joke?!?",
    "806": "Thanks for losing to #Orlando today, #GoldenState #Warriors.   Wait.  Orlando?!?!?  20-53 Orlando #Magic ?!?!?  Yikes. https://t.co/DRyRrxKPgz",
    "807": "@OrlandoMagic Wow 20 wins that is insane",
    "808": "ORLANDO, Fla. (AP) — Franz Wagner made three free throws with 12.2 seconds left and dunked on an inbounds play for the final points, leading the Orlando Magic to a 94-90 win over the Golden State Warriors on Tuesday night. https://t.co/dutbCyPSUs",
    "809": "@SkolCash @magicscotti @GerrieJoe @OrlandoMagic @Vikings @athielen19 could say the same about Minnesota 🤷‍♂️",
    "810": "@30likeimgifted @YoungBoyReturn @NiMekhi @OrlandoMagic Playoffs*",
    "811": "@YoungBoyReturn @felix_mcfelix @NiMekhi @OrlandoMagic We both agree…",
    "812": "@OrlandoMagic @haha_cd6 @Vikings @athielen19 I gave my girlfriend the O last night.",
    "813": "Franz  Wagner  Orlando  Magic  2021 #basketballcards https://t.co/YW12zZwzJj",
    "814": "@ORLmuse @OrlandoMagic That means we are close to taking them down in a 7 game series? 🤔",
    "815": "@30likeimgifted @felix_mcfelix @NiMekhi @OrlandoMagic Warriors without Curry: https://t.co/84SoYcbrLa",
    "816": "@lbjhoopz23 @freco210 @currybuu @warriors @KendrickPerkins not to the fucking orlando magic",
    "817": "@OrlandoMagic IM A GSW FAN. YALL GOT YALL OWN SONG THAT SHIT CATCHY AS FUCK.",
    "818": "Orlando did its magic against Golden State!\n\n📷 Orlando Magic\n\n#NBA75 #AlwaysAFan https://t.co/A6hulM96oh",
    "819": "@MalikG @OrlandoMagic I didn’t mean this year. I meant in the future. I’m tired of being in the lottery.",
    "820": "@OrlandoMagic who got the song link",
    "821": "@SloHoopsFan cause they just lost their 3rd in a row without curry to the orlando magic... and that's just game 1 in their 5 games in 7 days road trip.",
    "822": "@MagicBamba @OrlandoMagic @PapaJohnsORL They did play Admiral 18 min",
    "823": "@OrlandoMagic @warriorsworld Lol so what 😂",
    "824": "@NBA @warriors @OrlandoMagic Future #Raptors",
    "825": "@Mike_Hern92 @OrlandoMagic With 10 games left, we'd honestly like to lose MORE games, but these young guys, especially Franz and Wendell are just too good!",
    "826": "\"No disrespect... but the Orlando Magic are one of the worst teams in the league\" \n😂😂😂 https://t.co/wLU2rVaICq",
    "827": "Steph curry is golden state warriors how do they even loose to Orlando Magic?",
    "828": "@LeonisWord @DDDGURU @warriors @OrlandoMagic Bruh with or without Steph there’s absolutely NO reason we should lose to the Orlando Magic! Poor shooting, lazy passes oh and a few guys who need to just go back to the G-League ie Lee and Chiozza. @Money23Green you know u can score right?",
    "829": "WE GETTING CLOWNED BY THE ORLANDO MAGIC BRUH WE SUPPOSED TO BE WINNING A RING THIS YEAR https://t.co/RT1wk7PO7T",
    "830": "I love you @OrlandoMagic",
    "831": "“you guys were 2-7 with you not on the court last year-“ “different team this year 😏 that’s what i’m so excited about 🙂” \nwarriors record rn without him: 2-6 while on a 2 game losing streak having just lost to the (20-53) orlando magic 😟",
    "832": "@MalikG @OrlandoMagic If only they could win games.",
    "833": "@vjramnath @OrlandoMagic @Vikings @athielen19 Lol cry.. you a grown ass man",
    "834": "@OrlandoMagic @PapaJohnsORL Just Draft Chet Holgreen Already",
    "835": "@OrlandoMagic @Vikings @athielen19 GOAT",
    "836": "@OrlandoMagic Good shit.",
    "837": "@OrlandoMagic @PapaJohnsORL Stop winning and ruining your draft position....",
    "838": "Orlando Magic. 💀💀💀🤣🤣",
    "839": "@tschwartz09 @currygawker @OrlandoMagic true",
    "840": "@OrlandoMagic It hurts man GG",
    "841": "@imonlyjojo @dennis_k_g @OrlandoMagic Warriors suck without curry. If they had curry Orlando magic would be a loser in which they already or. That and the personification of it.",
    "842": "And some people wonder why Steph was still a top 5 mvp candidate when he was “slumping.” Mf’ers can’t even beat the Orlando Magic without him https://t.co/YtT0IfszrH",
    "843": "@FabMeloHOF Fade the fuck out of the magic tomorrow. Thunder is +2.5 at home and I can’t imagine the Magic travels from Orlando to Oklahoma and wins two days in a row",
    "844": "@OrlandoMagic Stop fuckin winning, we sposed to be tanking",
    "845": "@officialmyles23 No way you defending this. IT WAS THE ORLANDO MAGIC",
    "846": "@30likeimgifted @YoungBoyReturn @NiMekhi @OrlandoMagic Bro is obsessed with the magic. \"Won't move on\"\n\nfucking weirdo 😂 https://t.co/047fActMSl",
    "847": "@Iakerschip @KumingaSzn00 @OrlandoMagic Lebum is as handsome, athletic, fantastic, skilled and cool as my last fart that escaped my 23 year old ass crack",
    "848": "Good win @OrlandoMagic 👏👏👏 https://t.co/XLCo3DLko8",
    "849": "@NukeSZN aye i watch yo squad but obviously not as much as yu but you think aaron gordon brought his Orlando magic self to denver?",
    "850": "@MalikG @OrlandoMagic It’s all starting to come together. Add another top 3-5 pick, and we’re rolling next season.",
    "851": "@DDDGURU @warriors @OrlandoMagic Warriors played as if the Magic were a G-League team. The Magic played the Warriors as if they were trying to win a playoff game. #Effort",
    "852": "@tschwartz09 @OrlandoMagic oh Tyler, not just beat, we would absolutely obliterate them.",
    "853": "@MalikG @OrlandoMagic Coach Mose! 💪🏽🔥👏🏽",
    "854": "@CitroSucks @OrlandoMagic In your dreams sadly",
    "855": "Draymond says the Warriors shouldn’t be getting, “punked” after losing to the woeful Orlando Magic. Warriors have now lost 12 of their last 18 games.",
    "856": "@felix_mcfelix @YoungBoyReturn @NiMekhi @OrlandoMagic Bro your memes are weak af…and you aren’t funny. And No, I won’t move on, and theres nothing you will do about it.",
    "857": "Draymond Green: “To execute it requires a certain level of physicality. No disrespect to Orlando Magic, but that's one of the worst teams in the league. We can't match that with them. So if you can't match that with them, you're definitely not going to do it against a great team.",
    "858": "@tgunn21 @anthonyVslater We had all our key guys tonight except Steph. We were facing the Orlando Magic.\nI’m pretty sure any coach in the league would come out with the W tonight. Kerr doesn’t adapt his offense for anyone.",
    "859": "@IMAGP13 @OrlandoMagic Suns in 5 sadly",
    "860": "@Johnas_Street Warriors just lost to the Orlando Magic without Steph. Case closed!",
    "861": "Late heroics by Mo Bamba, Franz Wagner lift Magic past Warriors  #NBA\n #OrlandoMagic #PureMagic #Warriors #DubNatio https://t.co/TKJwIBlq4O",
    "862": "@morpheoussz @ICY_pt3 bold as per they aren't supposed to beat Orlando magic without Curry?",
    "863": "@30likeimgifted @YoungBoyReturn @NiMekhi @OrlandoMagic Just hold this L and weep. Now move on\n\n mr 30likeimgifted https://t.co/0gfQtkur95",
    "864": "Draymond postgame: “No disrespect to the Orlando Magic, but that’s one of the worst teams in the league.”\n\nClearly, no disrespect.",
    "865": "@CitroSucks @OrlandoMagic in your dreams",
    "866": "@OrlandoMagic @The_ColeAnthony Bless his heart lol",
    "867": "@OrlandoMagic As a thunder fan thank you so much. Can’t wait till y’all kick our ass so we have the 3rd best lottery odds",
    "868": "Great Win Tonight!!! Gonna get that good sleep Tonight. \n\n#OrlandoMagicGame73 #GSWvsORL\n\n#DubNation  \nvs\n#MagicTogether  \n\n#OrlandoMagic #MagicTogether  #WeGotAlotPopping #MagicSzn2021\nWE💥G O T💥ALOT💥P O P P I N G https://t.co/51SMTxqYL0",
    "869": "@moseskuminga @gswforIife @OrlandoMagic True. Most of them bought Laker Jerseys in 2020, then bought Warriors jerseys this year.",
    "870": "@OrlandoMagic @CoachGusMalzahn @UCFKnights @UCF_Football Ha, the Magic finally brought a real coach into the arena…. Been 20+ years, bout time.",
    "871": "@IMAGP13 @OrlandoMagic The Suns will win the WCF sadly",
    "872": "MAGIC WIN\n\n#OrlandoMagic\n#Peaches\n#Magic\n#HarryPotter \n#MagicWIN\n#MagicTogether \n#MagicKingdom",
    "873": "@BallyMagic @OrlandoMagic Just a note that Golden State passed on Franz Wagner for Kuminga lol",
    "874": "@CantGuardBook1 @OrlandoMagic Klay might be the problem possibly? Only one doing anything is Poole for them",
    "875": "@DonnyTt2 @OrlandoMagic @Vikings @athielen19 He has a house in FL and visits Orlando for the parks. He has kids lol",
    "876": "@OrlandoMagic And still have double the amount of wins as yall do on the season....this is the weirdest of flexes.... https://t.co/9hh9akhhST",
    "877": "Draymond: \"No disrespect to the Orlando Magic, but that’s one of the worst teams in the league. If you can’t match up with them you’re definitely not going to do it against a great team.\"",
    "878": "@chopticw @OrlandoMagic @Vikings @athielen19 Has a house in FL",
    "879": "@magicscotti @raven_king18 @GerrieJoe @OrlandoMagic @Vikings @athielen19 The best wideout to ever step foot in shitty ass Florida",
    "880": "@CGJXXIII @OrlandoMagic Ayee! Happy birthday to lil man. 🔥",
    "881": "196° Jogo - Golden State Warriors 94 x 102 Orlando Magic \n\n44 MIN\n25 PTS\n5 REB\n11 AST\n2 STL\n9-21 FG (42.9%)\n3-6 3PT (50.0%)\n4-5 FT (80.0%)\nDerrota ❌ (80-116)\n\n#DubNation https://t.co/Gxb5QvKiNB",
    "882": "Draymond Green: \"We're losing a lot of fourth quarters...no disrespect to the Orlando Magic,  but that's one of the worst teams in the league...\"",
    "883": "The Orlando magic beat the Golden state warriors \nImagine sucking that much",
    "884": "@BallyMagic @OrlandoMagic we’re the best worst team in the league ever",
    "885": ".@OrlandoMagic coach Jamahl Mosley praises the hometown fans after the win over the Warriors on Tuesday night. #MagicTogether https://t.co/799sCBAQgx",
    "886": ".@OrlandoMagic coach Jamahl Mosley praises the hometown fans after the win over the Warriors on Tuesday night. #MagicTogether https://t.co/ecQ34z0xlR",
    "887": "🔥WARRIORS WRAP UP🔥\n\n@The_StilesFiles reacts to the #Warriors 94-90 loss vs. #Magic including\n\n🧙Dubs look sluggish in Orlando\n\n⚡️Poole tallies 10th straight 20-point game\n\n👏Porter Jr totals a double-double\n\nThe Dubs are 47-25, Join Us!\n\n☎️888-957-9570\n📻https://t.co/XmfLlR6a0r https://t.co/axuTOolwiT",
    "888": "@currygawker @OrlandoMagic So without Steph, y’all can’t beat a 20 win team?? 💀💀💀💀",
    "889": "@loveabundantly @OrlandoMagic @OfficialNBARefs Cope Karen Cope https://t.co/jn70iU7cYf",
    "890": "@CitroSucks @OrlandoMagic if refs were real yall are 8-74 😂",
    "891": "@felix_mcfelix @YoungBoyReturn @NiMekhi @OrlandoMagic No its not…you don’t know if that pick is a superstar… nd even with s superstar the Magic are garbage sadly 😔",
    "892": "Orlando Magic surprises Golden State Warriors 94-90 Wendell Carter Jr 19points 8rebounds.",
    "893": "Lol Orlando magic wyd",
    "894": "@OrlandoMagic Lol, this is funny. Acting like you actually won that game without the @OfficialNBARefs wearing your jersey.",
    "895": "When the @OrlandoMagic win, we all win!! 🪄",
    "896": "@IMAGP13 @OrlandoMagic Unfortunately it isn't real (yet) but God I wish it was",
    "897": "@DDDGURU @warriors @OrlandoMagic 🎶first name stephen last name curry🎶",
    "898": "@ivictorsammy Lmao 😭The Orlando Magic are a basketball team",
    "899": "@OrlandoMagic Accepting #cryptocurrencies",
    "900": "@OrlandoMagic Wagic",
    "901": "@YoungBoyReturn @NiMekhi @OrlandoMagic Ion even comprehend what you just said sadly",
    "902": "@30likeimgifted @NiMekhi @OrlandoMagic Ion even a magic fan",
    "903": "@CitroSucks @OrlandoMagic wtf, dude does an onlyfans 😂😂",
    "904": "@OrlandoMagic @The_ColeAnthony @franzboogie Yeah, great win with a hip check to to a defender flying past you on 3pt. Guess what? That's not talent. And it's not basketball. Why don't you try actually playing basketball w/o the lies. And btw, without the @OfficialNBARefs tonight, you were smoked. #GSWvsORL #DubNation",
    "905": "We all know how valuable Steph is, but if this team can’t close out a game vs the Orlando Magic without him, how strong is our roster? \n\nIt doesn’t help that we have an incompetent coach. It’s looking like Curry is gonna have to carry for us to even get out the 2nd round.",
    "906": "@warriors Any chance I can get an open tryout? Having 6 guys with 2 points or less on your team with game minutes AND dropping a 13 point lead to the @OrlandoMagic (53 loss team) is not the definition of “locked in” #helpisontheway",
    "907": "@30likeimgifted @YoungBoyReturn @NiMekhi @OrlandoMagic That's so fucking stupid. That's like me saying in 2009 that curry isn't going to help your team by drafting him. https://t.co/AC0ax1vmwf",
    "908": "@NBA @warriors @OrlandoMagic Dude literally told the @memgrizz not to draft him. Lmao thanks for the tip my guy.",
    "909": "@NBA @warriors @OrlandoMagic Golden state with no curry, No KD,\nJust overrated scorers and defenders with no ratings = loss against Orlando witchcraft",
    "910": "Say what you want about this @OrlandoMagic team, but you have to admit that the chemistry vibes are immaculate.  Look at all the smiling faces from coaches and players alike at the end of this clip...\n\n#MagicT https://t.co/PLVWrgm2dP",
    "911": "@nolankelly80 @OTownNBA @gswforIife @OrlandoMagic Lmaoo",
    "912": "@OrlandoMagic Now post your nba championships",
    "913": "fucking NBA games once again fucking me up how the Orlando  Magic beat the Warriors  got damn so you mean to tell Warriors  can't win without Curry damn 1 player basically carry the team",
    "914": "The Warriors lose another game😭😭😭 at least it’s to my Magic💪😁😭\n\nThe Warriors have now loss two game, even though they had their most important player, Draymond Green!\n\nLoss to the 28 win Sant Antonio Spurs😭\nLoss to the 20 win Orlando Magic😭\n\n@KendrickPerkins https://t.co/FyctZvGmEe",
    "915": "Top 15 coach can’t come up with a way for this team to beat the Orlando Magic? Everybody beats the Magic! And spare me your dissertations about the players on the court.",
    "916": "@OrlandoMagic Poverty franchise",
    "917": "RESULT:\n\n💰 Orlando Magic +8 (-110) 1.5u\n\n1-0, +1.5u\n\nMagic with an outright win. \n\nNBA YTD: 116-103-6, +19.70u https://t.co/BWgKqPydGf",
    "918": "So when does Steve Kerr start taking blame for these types of losses? Media credits him for winning though. Top 15 Coach of all time can’t coach his way to a W over the @OrlandoMagic @warriors deserve better coaching games like this we should be winning.",
    "919": "@CitroSucks @OrlandoMagic paid refs nigga",
    "920": "Orlando magics won vs GSW 💀💀💀💀",
    "921": "@hatchell_jr @OrlandoMagic Losing to a dude that dunks in yuttas??? Lol damn",
    "922": "We lost to the fucking Orlando Magic …….. @warriors https://t.co/Y7X9ZXAMqi",
    "923": "NBA Defensive GOAT?! Golden State Warriors vs Orlando Magic - Full Game Highlights | March 22, 2022 | 2021-22 NBA Season https://t.co/06Tvc9Yeai https://t.co/xi7MsffwYo",
    "924": "NBA Defensive GOAT?! Golden State Warriors vs. Orlando Magic Full Game Highlights | 2021-22 NBA Season https://t.co/MRej18hnAq https://t.co/xi7MsffwYo",
    "925": "Y’all really lost to the Orlando magic. 💀💀💀 https://t.co/PhpXm9NnbG",
    "926": "@angry_47 @OrlandoMagic L+Ur mad 😹😹🤡🚬🚬🚬🚬🚬🚬🚬",
    "927": "@OrlandoMagic Pain gg tho",
    "928": "NBA @warriors at @OrlandoMagic, Tuesday, March 22, 2022 @NBA @NBAstats #gamecharts #dataviz #nft https://t.co/XlbSYRBhSB",
    "929": "@sofiasunss @OrlandoMagic https://t.co/eUWiczzkGQ I am deceased 💀💀💀💀💀💀",
    "930": "@KumingaSzn00 @Iakerschip @OrlandoMagic You lost against the magic",
    "931": "@felix_mcfelix @YoungBoyReturn @NiMekhi @OrlandoMagic “What?” Its not going to make them any better. You need me to call you and tell you do you’ll understand?",
    "932": "@ZachWil319 @staymeloooo @WorldWideWob Orlando Magic bro.... Come on",
    "933": "\"That was dope, that was dope.\"\n\n@OrlandoMagic guard Cole Anthony is feeling good after the home win over the Warriors on Tuesday night. #MagicTogether https://t.co/WdqFyDsfN9",
    "934": "@OrlandoMagic make sure franz sees this pls https://t.co/WOvgMSpnby",
    "935": "@nolankelly80 @OTownNBA @gswforIife @OrlandoMagic Exposed GSW 😔",
    "936": "Orlando Magic have tied OKC with 20 wins.\n\nThunder vs Magic tomorrow.\n\nOKC can take possession of the #3 lottery spot. \n\nThis is not a test.",
    "937": "@910Vengeance @OrlandoMagic Steph out, lol",
    "938": "@OrlandoMagic Don't forget the fact that @warriors  skipped on Franz Wagner for Kuminga in last year's NBA Draft...",
    "939": "🤖 #SofiAlert \n📅 22-03-2022 \nGolden State Warriors - Orlando Magic \n🛋 3.6/5 Sofis https://t.co/lMasjTHDv1",
    "940": "@OrlandoMagic @PapaJohnsORL Go magic",
    "941": "Wiggins and Thompson disappointing tonight. I am just fiscally sick after watching this. We can’t beat the Orlando Magic?",
    "942": "@dcFaddy @YoungBoyReturn @NiMekhi @OrlandoMagic Don’t understand what you’re trying to say sadly 😔",
    "943": "@CitroSucks @OrlandoMagic Paid refs",
    "944": "@ORLmuse @OrlandoMagic W then",
    "945": "@ORLmuse @franzboogie @OrlandoMagic could be #2 👀",
    "946": "@warriors LETS GO @OrlandoMagic  !!!! https://t.co/3EqZnZyDQJ",
    "947": "@warriors It’s the Orlando Magic - really? I think the San Jose Spartans can give this Dubs team a good game. 🤣😢😡 my emotions throughout the entire game.",
    "948": "@30likeimgifted @YoungBoyReturn @NiMekhi @OrlandoMagic What 🤨 https://t.co/zA95D0RNdM",
    "949": "It was our night!! #Ref25 was against #Warriors #Ref25 very iffy!! #Ref25 won for @OrlandoMagic!! #Ref25 has to be watched very close! https://t.co/tvQx364FYe",
    "950": "@angry_47 @OrlandoMagic “Ratio god”, “ never been ratioed “ https://t.co/HJu3EZhbWJ",
    "951": "Who bet on the Orlando Magic tonight ?!",
    "952": "How'd you bottle 14 points to Orlando magic",
    "953": "@CitroSucks @OrlandoMagic You just paid the refs to win LMAOOO",
    "954": "@warriors HOW TF DO WE LOOSE TO THE FUCKING ORLANDO MAGIC BRO THEY ARE NUMBER 15 IN THE FUCKING EAST MEANING THEY HAVE THE WORST RECORD IN THE FUCKING EAST WE ARE NUMBER 3 IN THE WEST MEANING WE ARE ONE OF THE TOP TEAMS IN THE WEST THERES NO FUCKING WAY WE SHOULDVE LOST THAT GAME",
    "955": "@OrlandoMagic - eliminated from the playoffs 😹",
    "956": "@caltimas @angry_47 @OrlandoMagic Nah dat nigga tweaking he talking to himself 😂😂😂",
    "957": "@NiMekhi @OrlandoMagic Keep fucking weeping 🤣 https://t.co/aokkLA8z8I",
    "958": "@NBA @warriors @OrlandoMagic Terrible defense by Draymond. Left him wide open in the corner. Overrated defender.",
    "959": "@OrlandoMagic How does someone lose to the magic lmao",
    "960": "@30likeimgifted @YoungBoyReturn @NiMekhi @OrlandoMagic Making the players doesn’t matter when you get bounced from the first series",
    "961": "@OrlandoMagic YEP YEP!",
    "962": "@OrlandoMagic Me deciding if I should be happy about this win but thinking about the tank https://t.co/1bShxsGMNi",
    "963": "@YoungBoyReturn @NiMekhi @OrlandoMagic Dgaf about a first pick sadly. Not going to make yall any better sadly 😔",
    "964": "🔥Get them twice in the Orlando Magic game. \n\nCollected on Orlando+7.5☑️Winner \n\nAlso Collected on Wagner Over 14.5 Points Only he wrapped up the night with 18 also was the reason the magic won scoring 5 points Down the stretch. \n#DubNation #MagicTogether #GamblingTwitter https://t.co/UfaW9pmtE0",
    "965": "@OrlandoMagic not salty, I swear https://t.co/l0jHXs9ENl",
    "966": "@OrlandoMagic Wrong song, play this one https://t.co/Jj04241Uyr",
    "967": "@OrlandoMagic @PapaJohnsORL THANK Y'ALL NIGGAS FRFR 🤝🏾💯 https://t.co/2TKkAYQHJq",
    "968": "@30likeimgifted @NiMekhi @OrlandoMagic Orlando won the 1st pick sadly",
    "969": "All Star Starter Andrew Wiggins in a loss to the Orlando Magic (worst team in the NBA)\n\n13 Points\n8 Rebounds\n1 Steal\n5/19 FG\n2/6 3FG\n26 FG%",
    "970": "@AfroLariatoSZN Thank you @OrlandoMagic",
    "971": "@OrlandoMagic @The_ColeAnthony @franzboogie Give Franz Wagner more minutes and STOP bringing him to play in the very last minutes! He deserves more minutes! More ball touches!! 😤😤💪💪He can put 20+ on most of the games!!!",
    "972": "The Warriors are now 2-7 without Stephen Curry, -10 with him off the floor and just lost to the San Antonio Spurs and Orlando Magic B2B 🤙🏽 https://t.co/oBWg9gBmMw",
    "973": "@ThatsFactory @untuckedkai @DrGuru_ Without Steph gravity and ability to attract multiple defenders now all the attention on him bro went 5-20 against Orlando Magic Sadique Bey or whatever bro name from Pistons just gave Orlando 51",
    "974": "orlando tho? y’all lost to the orlando magic",
    "975": "@SurtainSzn @ORLmuse @OTownNBA @OrlandoMagic Do you want my validation? Mommy and daddy not giving you enough?",
    "976": "The @OrlandoMagic  tho 🤬 https://t.co/JtdV8oLlBS",
    "977": "Orlando Magic vs. Purok Tres",
    "978": "HOW ON EARTH DID WE LOSE TO THE ORLANDO MAGIC?? THE MAGIC",
    "979": "@canzole412 @OrlandoMagic yes we are!",
    "980": "After the Golden State Warriors lost to the Orlando Magic, the Phoenix Suns became Pacific Division Champions for the 2021-22 NBA season, back to back! \nThe last time they clinched the Pacific Division in back to back season is 2005-06 and 2006-07! #ValleyProud #NBA75 https://t.co/LaJ1fQHsQ5",
    "981": "@gswforIife @OrlandoMagic 95% of Warriors fans' jerseys are still within their return window at Foot Locker.",
    "982": "@bw_ignite @ORLmuse @OTownNBA @OrlandoMagic It was like 4 tweets down",
    "983": "@BlockedByIsaac @franzboogie @OrlandoMagic 1) Shaquille O’Neal 79\n2) Penny Hardaway 64\n3) Victor Oladipo 62\n4) Franz Wagner 60\n5) Dennis Scott 59",
    "984": "@OrlandoMagic @The_ColeAnthony @franzboogie Beating GS was worth the lottery odds *which Orlando was not winning that anyways* If you want the culture to change you have to WIN period",
    "985": "\"Having fun playing defense.\"\n\nFranz Wagner chats with Dante Marchitelli about the @OrlandoMagic's home win over the Warriors on Tuesday night. #MagicTogether https://t.co/gxUIlrXL6Q",
    "986": "\"Having fun playing defense.\"\n\nFranz Wagner chats with Dante Marchitelli about the @OrlandoMagic's home win over the Warriors on Tuesday night. #MagicTogether https://t.co/MvRcPfj7S8",
    "987": "@OrlandoMagic yall hype over beating an ass team wow",
    "988": "@alan_thomas95 @OrlandoMagic @Vikings @athielen19 Bucs bound?",
    "989": "@NBA @OrlandoMagic 94 @warriors 90 final score @AmwayCenter. #NBA #MagicTogether #Jameshillsports",
    "990": "Me and my dawgs $849 richer bc of the Orlando Magic 🤣 they were +245",
    "991": "@KumingaSzn00 @OrlandoMagic funny bcuz didn’t steph only put up 3 points vs the celtics? lol",
    "992": "@OrlandoMagic Better*",
    "993": "@warriors The Warriors can’t even beat the Orlando Magic without Steph 😩",
    "994": "@OrlandoMagic Good job best g League team 👏",
    "995": "@OrlandoMagic I can make bettet memes",
    "996": "@OrlandoMagic I know you’re not supposed to say Gay in Florida anymore…. But that game was so gay!",
    "997": "Warriors are sad af for losing to the Orlando Magic",
    "998": "@OrlandoMagic really played Wendall Carter only the last 3-4 mins of the entire 4th in a close game. He fell 2 Rebs shy for my parlay 😒 tf is that https://t.co/9z73WrkHSt",
    "999": "@OrlandoMagic @PapaJohnsORL LOL WE ACTUALLY WON? https://t.co/KZufYvzkbW",
    "1000": "PLAY THE SONG 🕺 https://t.co/Toey3Pe3rs",
    "1001": "Let’s hear it for your @OrlandoMagic !!!!\nI don’t want that lottery chance to dwindle but I’m happy for this win! #OrlandoMagic #MagicTogether #MagicVsWarriors",
    "1002": "@SurtainSzn @ORLmuse @OTownNBA @OrlandoMagic This far down in an Orlando Magic thread.... \nhttps://t.co/KtBzkDg9qk",
    "1003": "Hold up ?! These MF’s lost to the Orlando Magic with a Top 15 coach of All time ?",
    "1004": "@OrlandoMagic Kyrie still Owns your franchise.",
    "1005": "@OrlandoMagic I’m a Dubs fan. Shoutout to the Magic for this tweet",
    "1006": "@ORLmuse @franzboogie @OrlandoMagic full list ?",
    "1007": "@gswforIife @OrlandoMagic Warriors deserves this slander",
    "1008": "@DDDGURU @warriors @OrlandoMagic It's a different offense without Steph, the cheat code. Simple as that. I just hope this period doesn't ruin Poole. He's expected to be Steph, basically. That's not fair.",
    "1009": "@OrlandoMagic @PapaJohnsORL YESSIR thank you Magic. https://t.co/fDsqgJYG2r",
    "1010": "@KerithBurke @warriors @OrlandoMagic oops.  Magic climb to 20-53 #DubNation",
    "1011": "@ORLmuse @franzboogie @OrlandoMagic Legend",
    "1012": "@bw_ignite @ORLmuse @OTownNBA @OrlandoMagic Own 53 losses",
    "1013": "@warriors 😂We lost against the Spurs and Magic the ORLANDO MAGIC😂🤦🏻‍♂️...Jesus Christ and this is without Steph only, you would think we could win some games oh man we dropping to the 4-6 seed yay😪 https://t.co/IdzZhAZGLh",
    "1014": "Draymond with a 4/6/5 against the Orlando Magic 😂😂😂😂",
    "1015": "The Orlando Magic beat the Warriors",
    "1016": "@warriors Y’all not going no where this year,U lost to The Orlando Magic.\nSmh @KlayThompson suck now,And @AndrewWigginsS3 belong on the bench,He not even consistent,Idk how he was a allstar this year.",
    "1017": "@OrlandoMagic lmaoo ggs",
    "1018": "@DDDGURU @warriors @OrlandoMagic Pretenders. Early season magic has warm off 😂😂😂",
    "1019": "Klay Thompson contra o Orlando Magic (22/03/2022):\n\n32:19 minutos\n15 PTS\n02 REB\n03 AST\n02 STL\n01 TOV\n40% FG\n28,6% | 2/7 3PM\n\n#DubNation https://t.co/MlctdsWFBR",
    "1020": "@OrlandoMagic i can’t even be mad ..",
    "1021": "@OrlandoMagic @The_ColeAnthony @franzboogie Amazing win!!!",
    "1022": "@MagicBamba @OrlandoMagic @PapaJohnsORL You act like we was going to win the lottery haha",
    "1023": "Thank you, Orlando Magic.  Love you!",
    "1024": "The Orlando Magic do some really big steps on the right direction. Tonight's showcase over the Warriors proved it. They allowed 90 points against a such a offensive-gifted team. That's clear sign of growth. #MagicTogether",
    "1025": "Why do the Orlando Magic keep winning these games right towards the end of the season? They do it to themselves every year. I guess picking 6th - 8th is the move smh.",
    "1026": "@OrlandoMagic Please slander us more we deserve it man smh",
    "1027": "@itssjuszach @OrlandoMagic @ColeKelleSZN @PapaJohnsORL Realest shit I’ve ever heard",
    "1028": "@OrlandoMagic i love u",
    "1029": "Post-Game Review: Orlando Magic - (94) Vs. Golden State Warriors- (90) Tuesday,  March 22,  2022.\n\nRead More: https://t.co/pOoW4RTHkU https://t.co/OV2FouB5Ko",
    "1030": "So, are the Orlando Magic just NOT tanking, or...?",
    "1031": "To the Magic……The Magic….Orlando….the 15th seed in the East. We are on strike…not watching the Warriors until the playoffs. https://t.co/bnK9gSmmlc",
    "1032": "@OrlandoMagic 💀 ily admin",
    "1033": "@OrlandoMagic @The_ColeAnthony @franzboogie I love the energy!!",
    "1034": "ENCERRADO: O Orlando Magic (20-53), em casa, venceu o Golden State Warriors (47-25) por 94 a 90. #MagicTogether \n\nWagner: 18pts, 3ast &amp; 2stl.\nCarter Jr: 19pts &amp; 8reb.\n\nPoole: 26pts, 2reb &amp; 6ast.\nPorter Jr: 14pts, 15reb &amp; 1ast.\n\n#NBA75 https://t.co/mCbcXN6lbX",
    "1035": "@OrlandoMagic @PapaJohnsORL Thank you from mavs fans.\nWe still in hunt for 3rd seed",
    "1036": "@YoungBoyReturn @NiMekhi @OrlandoMagic GS is in the playoffs….youll be in cancun before The season ends. Lmao",
    "1037": "@DDDGURU @warriors @OrlandoMagic Because they are absolutely terrible right now. Wiggins went all-star to scrub. Haven’t seen them do dumber things since well before 2015. Ejections. Repeatedly fouling 3-point shooters w games on the line. And Dray, Klay and Steph are the culprits. Not peaking at wrong time.",
    "1038": "@gswforIife @OrlandoMagic Wipe your tears",
    "1039": "@OrlandoMagic @PapaJohnsORL PLEASURE LFGGGGG",
    "1040": "@angry_47 @OrlandoMagic Nigga u liking ur own tweets lol gg",
    "1041": "@OrlandoMagic @PapaJohnsORL WE CAN’T TANK PROBABLY!!! FOR THE LOVE OF GOD 🤦🏻‍♂️🤦🏻‍♂️🤦🏻‍♂️",
    "1042": "I got the drake curse bruh ain't not way the warriors lost to the orlando magics LMAOOOOOO",
    "1043": "@OTownNBA @gswforIife @OrlandoMagic I still remember the 2009 Finals run so",
    "1044": "Bruh we lost to Orlando Magic!!! 😭😭😭",
    "1045": "@OrlandoMagic @PapaJohnsORL THUNDER LEGEND MO BAMBA‼️ THANKS U https://t.co/Q7koSghRcj",
    "1046": "@OrlandoMagic 😂😂😂 damn",
    "1047": "PLAY THE SONG @OrlandoMagic",
    "1048": "lost to the fuckin orlando magic 😒",
    "1049": "Post-Game Review: Orlando Magic - (94) Vs. Golden State Warriors- (90) Tuesday,  March 22,  2022.\n\nRead More: https://t.co/QlnsQMnVyC https://t.co/E9MlXIrWpq",
    "1050": "\"That's a great win!\"\n\n@The_ColeAnthony interviews @franzboogie 😂 https://t.co/m4ppa1uDMx",
    "1051": "The orlando magic run the NBA #MagicTogether",
    "1052": "@OrlandoMagic @PapaJohnsORL STEVEN CURRY OVERRATED",
    "1053": "Orlando magic is special franchise https://t.co/b90R2uCSt2",
    "1054": "The warriors without Steph lost to the ORLANDO MAGIC 🥴",
    "1055": "@NiMekhi @OrlandoMagic Cope my boy",
    "1056": "WE LOST TO THE ORLANDO MAGIC!!!!!!!",
    "1057": "@OrlandoMagic Kiss all those prospects goodbye Magic fans as much as i enjoy kicking GS's butts back to reality we screwed ourselves here",
    "1058": "Orlando Magic Black Framed Team  #autographed #ad https://t.co/fwlO7vwRf5",
    "1059": "#NBA75 Member Klay Thompson dropped a whopping 15 points on 40% and lost the championship frontrunning Orlando Magic 🔥🔥",
    "1060": "@EVRYDAYCarter @JayssPlayss @RyanBarnhart0 @andre @OrlandoMagic Bro in his feelings rn 💀",
    "1061": "The Warriors beat the 1st seed Phoenix Suns WITH Stephen Curry and WITHOUT Jordan Poole, Klay Thompson and Andrew Wiggins. \n\nThe Warriors lost to the 15th seed Orlando Magic WITHOUT Stephen Curry and WITH Jordan Poole, Klay Thompson and Andrew Wiggins.",
    "1062": "Play the Orlando magic song!",
    "1063": "Fukn Orlando Magic... Like WTF? I just bet on @warriors for the last time😫😫😫.... \nAiite, I'm cool again, lets go warriors🙏🙏",
    "1064": "@OrlandoMagic @PapaJohnsORL Wagic",
    "1065": "@SFCityBoySports @warriors @OrlandoMagic What happened ??",
    "1066": "this team just blew a 14pt lead in the fourth to the fuckin ORLANDO MAGIC",
    "1067": "@warriors should’ve been your night tho it’s the orlando magic",
    "1068": "@KumingaSzn00 @Iakerschip @OrlandoMagic “We don’t have steph “ he wouldn’t have impacted the game anyway the brick machine",
    "1069": "E o Orlando Magic venceu o Warriors!\n\n94 x 90\n\nWendell Carter Jr.: 19 pts/ 8 reb\nFranz Wagner: 18 pts/ 3 ast\n\nJordan Poole: 26 pts/ 6 ast\n\nhttps://t.co/qpMZ0yrE6c",
    "1070": "@OrlandoMagic @ColeKelleSZN @PapaJohnsORL we’re the best team in the league, only reason we don’t have more wins is cus the other team scored more points",
    "1071": "@ORL_EGW @JayssPlayss @RyanBarnhart0 @andre @OrlandoMagic He said he didnt gaf 😭",
    "1072": "@dennis_k_g @OrlandoMagic That makes it worse💀💀💀",
    "1073": "My @OrlandoMagic have the best social media team in the league! 🔥",
    "1074": "@OTownNBA @gswforIife @OrlandoMagic Makes it more shameful warriors lost to them 😔",
    "1075": "@NiMekhi @OrlandoMagic They won a lottery pick and the only thing yall are winning is a trip to cancun",
    "1076": "warriors lost to the orlando magics? https://t.co/yLmtMOKToR",
    "1077": "So the Warriors shit the bed and lost to the Orlando Magic tonight\n\nWhat does that mean for us tomorrow? They not missin huh",
    "1078": "@OrlandoMagic If my Goat Curry was playing we would beat y’all by 60. Hold this L 🤡",
    "1079": "@WorldWideWob As a diehard Knicks fans since the old-man Ewing days, it's clear to me that the Orlando Magic are a better team than the Knicks They are not nearly as bad as their record suggests",
    "1080": "Okkkk, get me hype for the Knicks game coming up 😝 #OrlandoMagic",
    "1081": "Final @OrlandoMagic 94 and 90 @warriors  #heartbreaker man. On to the #next game.",
    "1082": "Imagine losing to the Orlando Magic 😭😭😭",
    "1083": "Klay, Poole, Draymond, and Wiggins can’t beat the Orlando Magic w/o Steph??? Y’all are fucking EMBARASSING.",
    "1084": "@angry_47 @OrlandoMagic warriors are looking real dangerous with klays return😳",
    "1085": "TO THE ORLANDO MAGIC?!!? @warriors",
    "1086": "🏀 Final Score 🏀\nGolden State Warriors 90 - 94 Orlando Magic\n\nJordan Poole 38.0 DK, 33.4 FD\nOtto Porter Jr. 37.8 DK, 34.5 FD\nCole Anthony 29.3 DK, 27.5 FD\n\nhttps://t.co/IIuYCTQkL5",
    "1087": "@OrlandoMagic @PapaJohnsORL THANK YOU https://t.co/kQRz56c4NX",
    "1088": "GSW can’t beat the Orlando fucking Magic without Steph lol yet idiots like @howaboutafresca thinks he has too much help LMFAOOO 🤣🤣🤣",
    "1089": "@ORL_EGW @JayssPlayss @RyanBarnhart0 @andre @OrlandoMagic So easy",
    "1090": "@ORLmuse @OrlandoMagic Larriors",
    "1091": "@dennis_k_g @OrlandoMagic And y’all still lost LOL",
    "1092": "Damn @OrlandoMagic pulled off a upset over @warriors",
    "1093": "3 straight hurting losses\n\n1. Stephen Curry injury\n2. Getting hoed by refs against SA\n3. Choking against Orlando Magic\n\nf*** Marcus Smart\nf*** the refs\nand now I gotta say f*** this team https://t.co/N52xfZehvk",
    "1094": "Gary Harris - Orlando Magic\n8 PTS\n2 RBD\n1 AST\n3 STL\n1 TO\n[FD(19.9) DK(18.5)]",
    "1095": "Chuma Okeke - Orlando Magic\n8 PTS\n5 RBD\n4 AST\n1 BK\n1 STL\n2 TO\n[FD(24) DK(23.75)]",
    "1096": "Franz Wagner - Orlando Magic\n18 PTS\n3 AST\n1 BK\n2 STL\n1 TO\n[FD(30.5) DK(28)]",
    "1097": "Rookie Franz Wagner scores six points in the final seconds as the @OrlandoMagic stun the @warriors on @CignalTV. https://t.co/IvCnXdOiBe",
    "1098": "@OrlandoMagic @PapaJohnsORL I’d rather have the number 1 pick..",
    "1099": "cant even beat the fucking orlando magic lmfao",
    "1100": "Orlando Magic +255 ✅ 🤯\n\nBoth tonight's strongest ML (96% of the 💰) and spread (70%) plays were backing the Warriors.\n\nhttps://t.co/dYjqoVaueU",
    "1101": "@957thegame wow #DubNation   , good game @OrlandoMagic",
    "1102": "@OrlandoMagic y’all head coach sucks when it’s comes to minute rotation my goodness",
    "1103": "@OrlandoMagic @PapaJohnsORL Ratio",
    "1104": "@OrlandoMagic OrWando Wagic",
    "1105": "The lottery-bound Orlando Magic just stunned the depleted Golden State Warriors.",
    "1106": "Vitória do Magic!!\n#MagicTogether \n\nOrlando Magic 94 VS 90 Golden State Warriors\n\nDestaques:\n\nW. Carter Jr. - 19PTS/ 8REB\nF. Wagner - 18PTS\nC. Anthony - 14PTS/ 5REB/ 5AST\n\nJ. Poole - 26PTS/ 6AST\nK. Thompson - 15PTS/ 3AST/ 2STL\nPorter Jr. - 14 PTS/ 15REB https://t.co/PJ5wVefBeq",
    "1107": "As an Orlando Magic fan since 10 minutes ago, I've never been more proud of this team.",
    "1108": "@cou_rage00 I told you. Orlando magic know how to played big teams they are good at 3 pointer field goal too 😂",
    "1109": "Warriors lost to this Orlando Magic team and they'll face Miami Heat tomorrow..... rip to my mental health",
    "1110": "It seems like @The_ColeAnthony is a lock for a career in broadcasting after his playing career @BallyMagic @OrlandoMagic #MagicTogether",
    "1111": "@ORL_EGW @EVRYDAYCarter @RyanBarnhart0 @andre @OrlandoMagic Idgaf if you were right?",
    "1112": "Yeahhhhh, MAGIC WIN! @OrlandoMagic #MagicTogether https://t.co/5saUXt4fpY",
    "1113": "@ORLmuse @OTownNBA @OrlandoMagic We own them frauds",
    "1114": "Y’all idiots, shitty players.... Y’all nothing without Stephen curry🤬🤬🤬. Orlando magic is the worst team in the nba ffs https://t.co/OdlWD98e7q",
    "1115": "@warriors “Not our night”...😂We lost against the Spurs and Magic the ORLANDO MAGIC😂🤦🏻‍♂️...Jesus Christ and this is without Steph only, you would think we could win some games oh man we dropping to the 4-6 seed yay😪 https://t.co/sdZF9b9JbD",
    "1116": "@angry_47 @OrlandoMagic Lol triggered",
    "1117": "@OrlandoMagic @PapaJohnsORL Good win Magic.. yall been putting up a fight against these top teams! GG!",
    "1118": "@angry_47 @OrlandoMagic u have to like ur own tweets lmfaoooooo warriors not winning shit",
    "1119": "Magic win their 20th game of the season.\n\nThe Thunder can take control of the 3rd best lottery odds tomorrow night vs Orlando with a LOSS.\n\nHuge tank-off upcoming. https://t.co/eRivcEGFxi",
    "1120": "Warriors lost to the Tanking Orlando Magic",
    "1121": "The #Warriors score just 90 points in Orlando and lose to the 19-53 Magic. An incredibly disappointing loss in the race to be the #2 seed in the Western Conference.",
    "1122": "@OrlandoMagic HOLY LETS GOOOOOOOOOO",
    "1123": "@JayssPlayss @EVRYDAYCarter @RyanBarnhart0 @andre @OrlandoMagic Ok? Doesn’t change the fact I was right",
    "1124": "9 points in a quarter vs Orlando Magic is crazy https://t.co/Ds71IczkQI",
    "1125": "@NBA @warriors @OrlandoMagic Like my nigga mo",
    "1126": "@KumingaSzn00 @OrlandoMagic using ur logic we ain’t have ad, ur point?",
    "1127": "NBA VIP winner \n\nOrlando Magic + 7.5 ✔️\n\n@Angle4U999 https://t.co/FHcoVRxqZh",
    "1128": "We lost to the Orlando Magic",
    "1129": "Orlando Magic ffs https://t.co/yucoMwhk0d",
    "1130": "Orlando Magic",
    "1131": "@NBA @warriors @OrlandoMagic Beautiful game",
    "1132": "This really shows the impact Steph curry has on the warriors. Without him, we are worse than Orlando magic 👌🏿.",
    "1133": "@DDDGURU @warriors @OrlandoMagic plz help THEM",
    "1134": "@OrlandoMagic @PapaJohnsORL SWEET VICTORY!!!",
    "1135": "Golden State loses in Orlando while the Magic shoot just 29% on 35 threes. This stretch could be really ugly for the Dubs https://t.co/qGPj0zuz0f",
    "1136": "WINNNN @OrlandoMagic yesssss!! https://t.co/iFgLF2l0EE",
    "1137": "@OrlandoMagic This you? 🤣 https://t.co/ad2A9KqNUd",
    "1138": "I am super happy for everyone w the Taco. I did not have the Taco so I’ll need a few minutes. \n\nFuck the Orlando Magic",
    "1139": "@OrlandoMagic @PapaJohnsORL Play the song!",
    "1140": "@DDDGURU @warriors @OrlandoMagic So u telling me… Steve Kerr needs 4 All Stars to beat the Magic???? Smh",
    "1141": "@ORLmuse @OrlandoMagic W curry is Ja's son",
    "1142": "@ORL_EGW @EVRYDAYCarter @RyanBarnhart0 @andre @OrlandoMagic Bro i am not a warriors fan🤣🤣",
    "1143": "Good shit @OrlandoMagic",
    "1144": "@NBA @warriors @OrlandoMagic This can’t be anymore fixed.",
    "1145": "@OTownNBA @OrlandoMagic Wait forreal???",
    "1146": "Yessirrrrrr!!! Good game!! @OrlandoMagic 🍾",
    "1147": "@warriors LMAOOOOO YOU NEEDED CURRY TO BEAT THE ORLANDO MAGIC",
    "1148": "How in the actual fuck did we loose to the Orlando Magic",
    "1149": "@warriors Fucking orlando magic",
    "1150": "Orlando Magic. I'm done, no more watching this.  #Dubnation",
    "1151": "The Magic just beat the Warriors.\n\nThe Rockets are now 1 game ahead of the Pistons and 1.5 games ahead of Orlando in their race to the worst record in the league. Excellent news",
    "1152": "@OrlandoMagic Your season is over 💀💀 this win means nothing",
    "1153": "The Golden Star Warriors just lost to the 19-53 Orlando Magic. Sigh.",
    "1154": "@warriors Bro…to the Orlando magic? Like deadass this shit is embarrassing.",
    "1155": "FRANZ WAGNER FOR ROOKIE OF THE DAMN YEAR!!! \n\n@OrlandoMagic",
    "1156": "FINAL: #Magic 94, Warriors 90\n\nOrlando picks up their tenth home win of the season.\n\nThe fight for the bottom 3 just got a whole lot more interesting...",
    "1157": "@DDDGURU @warriors @OrlandoMagic This team looks lost",
    "1158": "We really just lost to Orlando magic 😂😂😂 smh these bums can’t do anything without Curry",
    "1159": "i laughed at Lakers losing to the Kings..... now we lose to Orlando Magic lmao 💀💀💀",
    "1160": "The ORLANDO MAGIC just beat the GSW. Goodnight.",
    "1161": "@JayssPlayss @EVRYDAYCarter @RyanBarnhart0 @andre @OrlandoMagic Easy Magic W just as I predicted https://t.co/u9mmYFmqkt",
    "1162": "@OrlandoMagic Lfg magic Good win",
    "1163": "@warriors @OrlandoMagic #Ref25 very iffy!!! ¿? https://t.co/NTDi3zNlHE",
    "1164": "Orlando stuns Golden State 94-90,\n\nWith the Magic win, Oklahoma City is just a half game back from the third best draft odds and one full game back from Detroit and the second best odds.",
    "1165": "THE ORLANDO MAGIC WON. PISTONS FANS THIS IS VERY VERY GOOD.",
    "1166": "No way we just lost to Orlando magic",
    "1167": "The Orlando Magic have not lost to the Golden State Warriors at home since December 1st, 2017. \n\n#MagicTogether https://t.co/pXHRkLgaZp",
    "1168": "ORLANDO FUCKIN MAGIC MAN",
    "1169": "lost to the 20-53 ORLANDO MAGIC 🤣",
    "1170": "@warriors What a shame losing to Orlando magic big shame am done with this team until Steph comes back",
    "1171": "We lost to the Orlando Magic. THE ORLANDO MAGIC.",
    "1172": "The Golden State Warriors just lost 94-90 to the Orlando Magic. Offense struggled. Grizzlies now up two games for the No. 2 seed in the Western Conference.",
    "1173": "Bruh I know the Golden State Warriors did not just lose to the damn Orlando Magic ?? Bruh wtf 🤦🏾‍♂️",
    "1174": "Getting outplayed in the 4th quarter by the Orlando Magic. LOL trash",
    "1175": "Lol at the golden state warriors losing to the Orlando magic.",
    "1176": "MAGIC WIN!\n\ndubs 🤝 @PapaJohnsORL https://t.co/tAGzfsZh2v",
    "1177": "@OrlandoMagic Damn shame.. warriors suck",
    "1178": "Niggas blew back to back leads in the 4th quarter against the magic in the last 2 meetings in Orlando",
    "1179": "Losing to the Orlando Magic? #Warriors #DubNation https://t.co/wDEy1MXLRn",
    "1180": "LET'S GOOOOOOOO!!!!\n\n#OrlandoMagicGame73 #GSWvsORL\n\n#DubNation  \nvs\n#MagicTogether  \n\n#OrlandoMagic #MagicTogether  #WeGotAlotPopping #MagicSzn2021\nWE💥G O T💥ALOT💥P O P P I N G https://t.co/Q2qpzaqSN1",
    "1181": "Final: Magic 94, Warriors 90\n\nWendell Carter Jr. - 19 pts, 8 rebs\nFranz Wagner - 18 pts, 3 asts\nCole Anthony - 14 pts, 5 rebs, 5 asts \n\nFranz Wagner scores 5 points in the final 13.2 seconds to lift the @OrlandoMagic to victory.",
    "1182": "How the bell did the @warriors lose to the @OrlandoMagic ??? Plz help me",
    "1183": "No way the Warriors with Draymond/Klay/Wiggins/Poole all playing just lost to the Orlando Magic 😭😭😩😩",
    "1184": "Nice win #orlandomagic !!",
    "1185": "OKC THUNDER APPRECIATION THREAD FOR MO BAMBA AND @OrlandoMagic!\n#ThunderUp",
    "1186": "nice Win you got there @OrlandoMagic",
    "1187": "@angry_47 @OrlandoMagic cry u guys just lost to the one of the worst teams in the league",
    "1188": "Another pointless win for the @OrlandoMagic … what a horrible franchise… you want a top pick to build or do you want to win a meaningless game in March when you are utterly out of contention",
    "1189": "@OrlandoMagic Y’all know y’all cap 🧢",
    "1190": "@THEWALLY32 Let's go @OrlandoMagic",
    "1191": "@OrlandoMagic PLAYOFF BOUND",
    "1192": "Omg ily Orlando magic",
    "1193": "@OrlandoMagic Y’all mfs got 0 franchise rings LMFAAOOO",
    "1194": "Absolute rock bottom of the season..Warriors lose to Orlando Magic..!",
    "1195": "@KumingaSzn00 @OrlandoMagic cry u just lost to the one of the worst team in the league",
    "1196": "ORLANDO MAGIC WIN!!! BEAT GSW. #Tankathon #Rockets",
    "1197": "Thank you @OrlandoMagic",
    "1198": "All-Star starter Andrew Wiggins in Golden State's Curry-less loss to the Orlando Magic:\n\n36 MIN\n13 PTS\n5-19 FG\n0 AST",
    "1199": "🤝🏾 Orlando Magic",
    "1200": "What a game that was! The @OrlandoMagic survived a @warriors scare and win 94-91 at home @AmwayCenter! Definitely worth the price of admission for this one! https://t.co/5UsU4pGsTZ",
    "1201": "We lost to Orlando magic .WTF!!!! 😡😡",
    "1202": "The chase is officially on.\n\nThe Oklahoma City Thunder have moved to a two-way tie with the Orlando Magic for third place in reverse standings.\n\nOrlando won 94-90 vs. Golden State tonight.\n\nThe Thunder's next opponent — the Magic. They square off tomorrow in a high-stakes game.",
    "1203": "@OrlandoMagic We’ve won our last 4 in Amway vs Golden State",
    "1204": "Warriors how tf you losing to the Orlando Magic ? I could never be the coach. Errbody would be gettin cursed tf out after the game - even the assistants would be catching these hands 😂😂",
    "1205": "Wide open to the basket - AND THE STEAL?  Sheesh, @warriors gave up... to the 19 (now 20) win @OrlandoMagic 😅😂 #NBA",
    "1206": "@OrlandoMagic Pizza day tomorrow",
    "1207": "Thank you @OrlandoMagic",
    "1208": "@OrlandoMagic 2023 NBA Champs",
    "1209": "i love you, @OrlandoMagic 💙",
    "1210": "@OrlandoMagic WRLANDO WAGIC YOU OWN THEM",
    "1211": "@OrlandoMagic W Good Job beating the warriors 😆",
    "1212": "Orlando Magic just beat golden state. Congrats to them",
    "1213": "Good win @OrlandoMagic",
    "1214": "Name a better combination than the Orlando Magic, catastrophic injuries, and ill-fated late season victories. It’s Groundhog Day. Great win.",
    "1215": "@OrlandoMagic thank you",
    "1216": "@OrlandoMagic WARRIORS SUCK",
    "1217": "Orlando WIN and we cash our spread bet eeeeaaaasy 🤝\n\nMagic +8 ✅ https://t.co/HdMgscSdWp",
    "1218": "@NBA @warriors @OrlandoMagic COME ON MAGIC GET IT DONE",
    "1219": "@OrlandoMagic What a win!!!!",
    "1220": "@OrlandoMagic Fml man we’re gonna win out aren’t we",
    "1221": "Magic down two with under a minute to go. Mo Bamba three, Mo Bamba block, then Klay Thompson fouls a three-point shooter and just like that the Warriors barely score 90 points and lose in Orlando.....\n\nBig yikes. Oh, and B2B in Miami tomorrow and Klay likely won't play....",
    "1222": "@OrlandoMagic YESSSIRRRRRRRRR WWWWWWWWWWWW",
    "1223": "look at MY Orlando Magic",
    "1224": "ORLANDO MAGIC WIN",
    "1225": "YOU JUST LOST TO THE ORLANDO MAGIC https://t.co/ne0sdf2ENU",
    "1226": "🤬 HOT TAKE 🤬\n\n‼️GOLDEN STATE WARRIORS LOST TO ORLANDO MAGIC‼️",
    "1227": "@CantGuardBook1 @NBA @warriors @OrlandoMagic Finishing and handles def better with Don",
    "1228": "Why are the Orlando Magic trying to win games",
    "1229": "@EyadGoinHam Well yeah Orlando mixed with so many fans from different places too. But real Magic fans are hoping for the loss for the tank lol",
    "1230": "@mel_pesos @NBA @warriors @OrlandoMagic Where's Ali with the motherfuckin dope?",
    "1231": "Us Pistons fans appreciate you🙏🏾, @OrlandoMagic",
    "1232": "Let’s go, Magic! 🏀 #OrlandoMagic https://t.co/Gf6SM9QaVb",
    "1233": "@gabrieelpst ORLANDO MAGIC.",
    "1234": "@NW0R_ @OrlandoMagic @MarkelleF Fuck tanking going need experience in these games… for next season how many years can you be trash n cool with it. There’s NOT ONE COLLEGE player that is ready to step in n change a basketball team",
    "1235": "Hopefully he misses one on @OrlandoMagic",
    "1236": "@adinross  I swear the @warriors  would only lose to the @OrlandoMagic  because YOU BET ON THEM ADIN!!!! holyfuckingshit your  a EDDIE MUSH!!!! stop fucking betting ‼️‼️‼️‼️‼️",
    "1237": "@NBA @warriors @OrlandoMagic Best team in the league",
    "1238": "Orlando Magic",
    "1239": "This is fuckin unacceptable. You can’t be giving away games to trash teams especially the Orlando Magic",
    "1240": "imagine losing to Orlando magics lol 😂",
    "1241": "Niggas out here finna lose to the Orlando magic?",
    "1242": "🚨 MO BAMBA GIVES THE MAGIC THE LEAD 🚨\n\n@warriors: 88\n@OrlandoMagic: 89\n12 seconds remaining in Q4\n\nWatch Now on NBA League Pass: https://t.co/ksZ27WgfCO https://t.co/k4YTMHaUxX",
    "1243": "uh oh Golden State fans thinking the refs are robbing them again against... *checks notes*\n\nThe ORLANDO MAGIC??? https://t.co/rqdDtf9ctn",
    "1244": "@OrlandoMagic time to unfollow you",
    "1245": "@angry_47 @OrlandoMagic Bit salty",
    "1246": "@Money23Green you be posting all your wine and dines with Lebron but getting beat up by the Orlando Magic. Cmon bruv.",
    "1247": "@OrlandoMagic @TheRealMoBamba CALLLLLLINGGGGGG",
    "1248": "Gotten so bad that we can’t beat Orlando Magic.\n\nReally???",
    "1249": "NBA Defensive GOAT?! Golden State Warriors vs. Orlando Magic Full Highlights 4th QTR | 2021-22 NBA Season https://t.co/KKg0j8F89M https://t.co/xi7MsffwYo",
    "1250": "4th qtr @warriors  88 @OrlandoMagic 89….now let’s do this @warriors  (challenge by coach) 12.2 secs",
    "1251": "@OrlandoMagic @TheRealMoBamba We own this bum franchise",
    "1252": "@warriors bringing the heat with 88pts against the 19-53 @OrlandoMagic. @Suns are gonna run thru the West.",
    "1253": "We losing to the @OrlandoMagic daaaamn 🤦🏿‍♂️🤦🏿‍♂️🤦🏿‍♂️🤦🏿‍♂️",
    "1254": "FOR THE LEAD 💰\n\n📺: https://t.co/I9B8pjAHIs | @TheRealMoBamba https://t.co/KiUuNzEEim https://t.co/I6buQTrwE3",
    "1255": "Orlando Magic 🧏🏾‍♂️",
    "1256": "@DHenry4mvp @OrlandoMagic @CoachGusMalzahn @UCFKnights @UCF_Football What, bozo?",
    "1257": "@OrlandoMagic why y’all trying so hard, y’all gonna be in cancun in less than a month",
    "1258": "let's go boys @OrlandoMagic",
    "1259": "@NBA How does that work #GSvsORL You can't INCREASE the shot clock w/no foul &amp; no change of possession?! @warriors @OrlandoMagic",
    "1260": "@BiBigGuy911 @NBA @warriors @OrlandoMagic doesnt matter they won 3",
    "1261": "These niggas in a dogfight with the Magic of Orlando",
    "1262": "MOOOOOOOO CALLINNNNNN'",
    "1263": "@OrlandoMagic @CoachGusMalzahn @UCFKnights @UCF_Football Let go knights nation and magic ⚔️⚔️⚔️⚔️",
    "1264": "@NBA @warriors @OrlandoMagic No sporting comp in the world knows how to ruin the final minutes of a game like the nba",
    "1265": "@NBA @warriors @OrlandoMagic Wendell better get some boards",
    "1266": "These Orlando magic nba refs are stupid",
    "1267": "painfully long delays in an Orlando magic game that I care about too much",
    "1268": "its the orlando magic why are y'all struggling so much",
    "1269": "@NBA @warriors @OrlandoMagic yeah and 10 minutes to put 8 seconds back on the shot clock with side out of bounds",
    "1270": "Get that Shit out of here…let’s Gooo Maggiiccccc @OrlandoMagic #NBA75 #magictogether https://t.co/JujE13HEXE",
    "1271": "@OrlandoMagic fighting for 14th seed in the East lol 😂 #GSWvsORL #dubnation",
    "1272": "@NBA @warriors @OrlandoMagic I’m not gonna watch the Warriors without Curry. Like eating a glizzy without Ketchup",
    "1273": "The Warriors got 85 points against the Orlando Magic with a minute left in the game 😭",
    "1274": "@NBA @warriors @OrlandoMagic Man finish the damn game",
    "1275": "@NBA @warriors @OrlandoMagic ain’t no way golden state about to lose to orlando",
    "1276": "@NBA @warriors @OrlandoMagic Warriors better",
    "1277": "The Warriors just got outscored 21-6 by the Orlando Magic since the 10 minute marks of the 4th quarter. And suddenly, a 14 point lead is a deficit",
    "1278": "10 points on 18 shots vs the ORLANDO MAGIC",
    "1279": "🚨 THE MAGIC LEAD BY 1 LATE 🚨\n\n@warriors: 85\n@OrlandoMagic: 86\n1:12 remaining in Q4\n\nWatch Now on NBA League Pass: https://t.co/ksZ27WgfCO",
    "1280": "@WarriorsAllBall why is @SJSU on the @OrlandoMagic s floor?\n#DubNation",
    "1281": "The Orlando Magic cannot get an offensive rebound to save their life.  Smh",
    "1282": "4-18 against the bottom feeding Orlando Magic 🤮",
    "1283": "Never gonna forgive this team for making me sweat through a game against the Orlando Magic",
    "1284": "thank you @OrlandoMagic 🙏🏻",
    "1285": "Warriors really about to lose to the fuckin Orlando Magic cmon bruh 😭",
    "1286": "Imagine saying some dumb shit like all NBA teams are trying to win and watch the Orlando Magic sit Wendell Carter Jr. for 8 minutes in the 4th qtr of a 1 poss. game where he’s leading the team in both points and rebounds. Yes I’m a gambler. But explain how that makes any sense.",
    "1287": "We are about to lose to Orlando Magic. 😭😭😭\nHerh warriors 😭",
    "1288": "GET IT DONE, @OrlandoMagic! 👏🏽",
    "1289": "@OrlandoMagic @thats_G_ they need a better coach period",
    "1290": "We struggling to beat the ORLANDO MAGIC 🤢",
    "1291": "@GoIdenState what a fucking joke, this team is an absolute joke. \nthe fucking orlando magic...jesus fucking christ",
    "1292": "nah golden state struggling wit the magic the fuckn Orlando Magic😂😂",
    "1293": "@OrlandoMagic @thats_G_ best player wendell carter jr of the game and he plays him the whole 3rd practically and sits him until 3 minutes left of the 4th. Like whats the point?",
    "1294": "no way we’re actually in danger of losing to the orlando freaking magic 😟",
    "1295": "these niggas suck. 3 max players getting out played by the Orlando Magic. embarrassing",
    "1296": "@Senseisports1 @OrlandoMagic @warriors @nuggets @uncwmenshoops Great call",
    "1297": "Golden State Warriors vs Orlando Magic Live\nLIVE LINK🔴https://t.co/gDd9Vh3mR5\nLIVE LINK🔴https://t.co/gDd9Vh3mR5 https://t.co/eChHla1XbU",
    "1298": "LOL struggling against the Orlando Magic, but you know why. There’s too much 1 on 1 going on. No ball movement whatsoever",
    "1299": "Why the fuck @Magic_PR is giving Schofield 18 minutes and counting? 🤔 Let Bamba, Carter and Okeke take ALL the minute they can handle. The Core NEED minutes to develop. I hate this micro management/mediocre coaches #nba #orlandomagic",
    "1300": "Wendell Carter Jr.'s jumper gives the @OrlandoMagic an 86-85 lead over the Warriors with 1:43 left in the 4th.\n\nCarter leads Orlando with 19 points and 7 rebounds.",
    "1301": "oh holy shit we are going to lose again to the orlando fucking magic",
    "1302": "@OrlandoMagic @CoachGusMalzahn @UCFKnights @UCF_Football BOOM",
    "1303": "Been watching the Orlando Magic a lot recently, starting to become a big Cole Anthony fan.",
    "1304": "Warriors got an all star starter surely he can handle the Orlando magic 😀",
    "1305": "Stuff the Dragon for the Orlando Magic has to be one of the strangest mascots I’ve ever seen? They don’t even call him Stuff the Magic Dragon? Why not just call him Puff the Magic Dragon?",
    "1306": "@OrlandoMagic @thats_G_ he just threw the ball to the crowd 💀💀",
    "1307": "@OrlandoMagic @CoachGusMalzahn @UCFKnights @UCF_Football Charge On!!! Go Knights!!!",
    "1308": "@br_orlandomagic he just threw the ball to the crowd 💀",
    "1309": "ottomatic the only thing keeping us from bombing against the *checks notes* Orlando Magic sigh",
    "1310": "The orlando magic would be so sick if they all happened to still be in college",
    "1311": "The Orlando Magic are so fucking good when they're not tank commanding",
    "1312": "warriors are just the orlando magic with no steph lmao wth is this",
    "1313": "@warriors playing like a d league team vs @OrlandoMagic",
    "1314": "please.... make this stop @warriors @OrlandoMagic",
    "1315": "Warriors have:\n\nPoole\nWiggins \nDraymond\nKlay Thompson \nOtto Porter Jr\nKevon Looney\nKuminga \nMoody\n\nAnd they are on a dog fight with the fucking Orlando Magic, and they usually get the doors blown off without steph against a good team. Ty lue would do wonders. https://t.co/cca8K3terX",
    "1316": "we are getting out hustled by the playoff eliminated orlando magic",
    "1317": "@OrlandoMagic @JJudahIsaac #Glassman. God punishing him for standing and putting the attention and spotlight on himself in da bubble.  God commands one to be humble, not attention seeking.",
    "1318": "@OrlandoMagic bro put wendell in right now",
    "1319": "I need the Orlando Magic to stop playing like the Orlando Magic. #MagicTogether",
    "1320": "@OwtQHolic @OrlandoMagic @MarkelleF My guy we kinding tanking",
    "1321": "Does your entire bench usually play in crunch time? @OrlandoMagic",
    "1322": "Hey @OrlandoMagic you mind putting Wendell Carter Jr back in !",
    "1323": "Breaking: @athielen19 has been traded to the Orlando Magic. Details of the trade are still coming in, but I can confirm he has the on-court skill set that the Magic were looking for. Best of luck with your new team. https://t.co/dII2yW7Szc",
    "1324": "there goes G 🔥\n\nGary Harris cuts the lead to one!\n\n📺: https://t.co/I9B8pjAHIs | @thats_G_ https://t.co/v9w4GpjUcr",
    "1325": "13-0 run for Orlando Magic. \n\nThis was a very ugly sequence. https://t.co/p85oV9U3IJ",
    "1326": "Orlando magic cmon",
    "1327": "I swear if this team lose to the ORLANDO MAGIC.....",
    "1328": "Golden State Warriors vs Orlando Magic Live\nLIVE LINK🔴https://t.co/gDd9Vh3mR5\nLIVE LINK🔴https://t.co/gDd9Vh3mR5 https://t.co/OfYyynInkl",
    "1329": "@OrlandoMagic PUT WENDELL BACK IN PLZ",
    "1330": "@OrlandoMagic @MarkelleF Fire that coach … this is not AAU you can’t have your bench playing against starter and expect to win",
    "1331": "Klay Thomson 🔥🏀💦💦💦 @klaythompson @warriors @nbalatam #nba #ilovethisgame #geishatorres #splashbrothers #amway #orlando @ Orlando Magic https://t.co/7gblynb7Zh",
    "1332": "@OrlandoMagic @Vikings @athielen19 What’s he doin here?",
    "1333": "@OrlandoMagic @MarkelleF Start him",
    "1334": "Idc if they win this game you shouldn't have been in a dogfight against the Spurs, and you shouldn't be in a dogfight against the Orlando Magic. https://t.co/wxk3JcgD5v",
    "1335": "shifty with it 💨\n\n📺: https://t.co/I9B8pjAHIs | @MarkelleF https://t.co/XOn1IB3LrL",
    "1336": "They want to lose to the Orlando magic... Sigh",
    "1337": "Markelle gets in the paint with such ease.\n\n#OrlandoMagicGame73 #GSWvsORL\n\n#DubNation  \nvs\n#MagicTogether  \n\n#OrlandoMagic #MagicTogether  #WeGotAlotPopping #MagicSzn2021\nWE💥G O T💥ALOT💥P O P P I N G",
    "1338": "@KHQA He needs to declare the Orlando Magic NBA champions.",
    "1339": "NBA Defensive GOAT?! Golden State Warriors vs. Orlando Magic Full Highlights 3rd QTR | 2021-22 NBA Season https://t.co/vH0TQTxvUJ https://t.co/xi7MsffwYo",
    "1340": "All I know is, the #ORLMagic better keep the Wagner brothers together…I’m sold. #MagicTogether @OrlandoMagic  bye…",
    "1341": "@JRAMNOTTHAGOAT To be fair, Orlando Magic Shaq was a fucking Alien lol",
    "1342": "Kuminga picks up his 5th foul on a frustration foul, 8-0 run for the Magic and the Warriors call time. GSW 79 Orlando 73, 9:21 left.",
    "1343": "BLUE RC @OrlandoMagic #FranzWagner https://t.co/tYmK6n8Gc8",
    "1344": "@bandito_1914 @OrlandoMagic @KevinOConnorNBA  voice**",
    "1345": "I want Fultz to be WAY more aggressive when it's comes to getting his shot. I know he's still working his back though.\n\n#OrlandoMagicGame73 #GSWvsORL\n\n#DubNation  \nvs\n#MagicTogether  \n\n#OrlandoMagic #MagicTogether  #WeGotAlotPopping #MagicSzn2021\nWE💥G O T💥ALOT💥P O P P I N G",
    "1346": "@OrlandoMagic @CoachGusMalzahn @UCFKnights @UCF_Football Loser watching losers. Nice 39-19 second half.",
    "1347": "@OrlandoMagic @CoachGusMalzahn @UCFKnights @UCF_Football @OrlandoMagic follow back pls",
    "1348": "A 36-19 third quarter for the Warriors leaves the score GSW 74 Magic 65 end of three. Poole has 17, Klay 15, Kuminga 14. Orlando is 7-44 when trailing after 3.",
    "1349": "End of 3Q: Warriors 74, Magic 65.\n\nGolden State outscores Orlando 36-19 in that quarter.. \n\nWendell Carter Jr.: 17 points (6 of 11), 7 rebounds.\nCole Anthony: 12 points, 5 rebounds, 4 assists.\nFranz Wagner: 13 points (5 of 8), 3 assists",
    "1350": "END OF 3Q: Jordan Poole leads the way as the Golden State Warriors take a 74-65 lead over the Orlando Magic.",
    "1351": "@OrlandoMagic @SASsoftware top 5 center rn.",
    "1352": "Wendell Carter Jr. through three quarters:\n\n17 PTS\n7 REB\n6-11 FG\n\n@SASsoftware x #MagicTogether https://t.co/vgV3WCak6o",
    "1353": "@raven_king18 @GerrieJoe @OrlandoMagic @Vikings @athielen19 Nah who is that",
    "1354": "@OfficialNBARefs respect the @OrlandoMagic, mother fuckers!",
    "1355": "14 likes and I make “Orlando Magic Twitter Iceberg”\n\nI’ll actually do it this time promise",
    "1356": "@RealTrump2020_ BREAKING NEWS:\n\nFlorida recognizes the Orlando Magic as NBA Champions !",
    "1357": "Definitely not a @orlandomagic #court  #tonight #everyone is repping the #blueandgold #LetsGoWarriors  @warriors @ Amway Center https://t.co/do6xoxWBEu",
    "1358": "Yo that usher was sleep on the camera @ @OrlandoMagic game 😆",
    "1359": "@VincenzoBellom9 Orlando Magic",
    "1360": "@Bently_Dreams @warriors @OrlandoMagic I had an extra ticket. Dang.",
    "1361": "@mondaevu He then declared the Orlando Magic 2022 NBA champions…",
    "1362": "Wow a much different game now as the Golden State @warriors lead the @OrlandoMagic 69-61 with 3:15 left in the 3rd quarter. Fans are definitely getting their money’s worth for this one. https://t.co/87JiryqyOu",
    "1363": "This is one of the best solo date nights I’ve had in awhile @warriors #SelfLoveIsTheBestLove @OrlandoMagic https://t.co/GpSHsORJsA",
    "1364": "Orlando Magic Jerseys\nBNWT\n“City Edition” Large and 3xl available $65 each\nWhite “Home” Large $55\n@RetailTuesday #RetailTuesday https://t.co/skBxBaKK9V",
    "1365": "Somebody on the Warriors needs to help Andrew Wiggins fix his jump shot. This is not looking good for Wiggins since it’s happening against the Orlando Magic.",
    "1366": "@companeromarcus I used to read an Orlando Magic blog years ago the kinda reminded me of canis hoopus. Was some of my first exposure to other basketball nerds lol",
    "1367": "@KCJJ @NBCNews He then declared the Orlando Magic NBA champions...",
    "1368": "Andrew Wiggins…either you’re hurt more than is being led on or you straight up have NO HEART. A ROOKIE on the ORLANDO MAGIC is showing you up! STEP UP!",
    "1369": "Franz steals &amp; dishes to RJ for 👌\n\n📺: https://t.co/I9B8pjAHIs https://t.co/dd5jm3EqSh",
    "1370": "@OrlandoMagic warriors sold that first half lol",
    "1371": "@Kalel1407 @LKas1113 @OrlandoMagic @Vikings @athielen19 Dubs",
    "1372": "Wow @warriors have taken their first lead of the game 55-52 over @OrlandoMagic in the 3rd quarter. This game could get interesting so fast.",
    "1373": "@raven_king18 @GerrieJoe @OrlandoMagic @Vikings @athielen19 Nah who tf is that",
    "1374": "Andrew Wiggins is an All Star Starter shooting 1/10 against the Orlando Magic.",
    "1375": "We're struggling against the Orlando Magic 😣😔",
    "1376": "ORLANDO MAGIC..........",
    "1377": "This game has been lagging for me all night 😒 @NBA @OrlandoMagic",
    "1378": "Orlando magic ML was free AF pre game. Warriors suck without curry",
    "1379": "@samesfandiari Also this just proves steph deserves first team over ja. Jas team is like 14-2 without him. Warriors can’t score 40 points without Stephen against the fucking Orlando magic",
    "1380": "@KendrickPerkins we need to hear from you today. The Best player on the Warriors in a dogfight with the Orlando Magic.",
    "1381": "@OrlandoMagic @AdventHealth @jalensuggs We need a fultz gang bobble head one day",
    "1382": "Warriors: Golden State #Warriors at Orlando Magic 3/22/22 - NBA Picks &amp; Predictions https://t.co/w1xcv8qqF4",
    "1383": "Warriors: Golden State #Warriors vs Orlando Magic: Match Prediction, Injuries... - Media Referee https://t.co/FRD6LYfEtv",
    "1384": "Brits at the Amway Centre in support of @OrlandoMagic #MagicTogether",
    "1385": "@WatinForDaTrain @SneakyMaru @andre @OrlandoMagic Lmao",
    "1386": "@OCPDesigns @OrlandoMagic You spelled championship wrong",
    "1387": "@warriors  aren’t really going to @OrlandoMagic are they 🤦‍♂️\n#DubNation",
    "1388": "@andre @OrlandoMagic Actually they shoulda raised the prices! The chance of watching their squad grab a rare dub went up exponentially when he got ruled out.",
    "1389": "@OrlandoMagic @Vikings @athielen19 What the fuck he doing out there",
    "1390": "@JayssPlayss @RyanBarnhart0 @ORL_EGW @andre @OrlandoMagic There i liked ur tweet so u can feel included",
    "1391": "@cou_rage00 Welcome back boss @warriors is down to @OrlandoMagic 😂",
    "1392": "@GerrieJoe @OrlandoMagic @Vikings @athielen19 you must be joking",
    "1393": "@LKas1113 @OrlandoMagic @Vikings @athielen19 Cuz they better then the 3rd seed team",
    "1394": "@JayssPlayss @RyanBarnhart0 @ORL_EGW @andre @OrlandoMagic i don’t make the rules buddy https://t.co/O54veaaL1h",
    "1395": "NBA Defensive GOAT?! Golden State Warriors vs. Orlando Magic Full Highlights 2nd QTR | 2021-22 NBA Season https://t.co/4Zzl0Ttte9 https://t.co/xi7MsffwYo",
    "1396": "@EVRYDAYCarter @RyanBarnhart0 @ORL_EGW @andre @OrlandoMagic Tell your fanboy stop likin all out tweets🤣",
    "1397": "IMAGINE LOSING TO THE FUCKING ORLANDO MAGIC??? WE DOWN BAD",
    "1398": "@EVRYDAYCarter @RyanBarnhart0 @ORL_EGW @andre @OrlandoMagic 🤣🤣 bro how you gonna telll me what I did or didn’t try to imply? I said typical blowout and that I’d enjoy watching your garbage ass team",
    "1399": "@JayssPlayss @RyanBarnhart0 @ORL_EGW @andre @OrlandoMagic You know whst you implied you just mad we got the Dubs looking fraudulent tn🤷🏻‍♂️",
    "1400": "Orlando 46 GSW 38 at the half...Kuminga has 10 Porter Jr has 9 and Carter Jr has 10 for the Magic. The Dubs are shooting 36.6% and are 2-14 from three.",
    "1401": "@warriors cmonn its just orlando magic",
    "1402": "@LKas1113 @OrlandoMagic @Vikings @athielen19 Whose winning the game",
    "1403": "@andre @ElysiumGY @OrlandoMagic Bro we need some momentum going to the playoffs. We call you a swiss army knife for a reason.. u can't sit the whole year and be sharp for the playoffs.",
    "1404": "Half-joking (Draymond IS overrated tho) but watch how Draymond plays w/o Steph in the line-up\n\nGSW become the Orlando Magic real quick when KD left &amp; Steph is hurt\n\nThat 2019-20 season was a Draymond-centered season b/c KD was gone, Steph &amp; Klay were hurt\n15-50 https://t.co/HqpKSCeDg1 https://t.co/IG8mim7jvA",
    "1405": "@EVRYDAYCarter @RyanBarnhart0 @ORL_EGW @andre @OrlandoMagic Lol you hard up behind Orlando🤣 I didn’t say they was gon lose 🤡🤡 l losers",
    "1406": "@OrlandoMagic @Vikings @athielen19 Tell him to leave real fan could’ve had that seat",
    "1407": "we are losing to the orlando magic 😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂",
    "1408": "@ORL_EGW @EVRYDAYCarter @RyanBarnhart0 @andre @OrlandoMagic Okay and Orlando had their bench in Up by like 12. Did I say Orlando was gonna get blown out? No",
    "1409": "38 points at the half against the Orlando Magic. Not good enough by the Warriors. I'm off to bed",
    "1410": "@WardellCentral @Fitzmagic_Fan @OrlandoMagic yall will still win prob",
    "1411": "Y'all actively rooting for the Warriors... 🤮🤮🤮\n\n#OrlandoMagicGame73 #GSWvsORL\n\n#DubNation  \nvs\n#MagicTogether  \n\n#OrlandoMagic #MagicTogether  #WeGotAlotPopping #MagicSzn2021\nWE💥G O T💥ALOT💥P O P P I N G https://t.co/44w9bOJprz",
    "1412": "@OrlandoMagic @Vikings @athielen19 Let him play guard",
    "1413": "38 points scored at halftime vs the Orlando Magic. 💀 https://t.co/X9UYJDgz3J",
    "1414": "welcome to the O, Adam Thielen  🪄 https://t.co/3hLRSodC1v",
    "1415": "38 points in a half vs the Orlando Magic…GSW down bad without Steph. Wiggins &amp; Poole a combined 2/14 from the field and a donut for Dray",
    "1416": "@OrlandoMagic Playoffs here we come",
    "1417": "@andre @TheWarriorsTalk @OrlandoMagic Get ur old ass up on the floor Dre 😂",
    "1418": "Check out 2021 COREY KISPERT Panini Chronicles Pink XR Draft Picks RC #168 Orlando Magic https://t.co/HWAA1bnv3v @eBay",
    "1419": "@donovan46552326 @WardellCentral @OrlandoMagic We never play this good so yea ur right😭",
    "1420": "@OrlandoMagic Keep it up!",
    "1421": "@WardellCentral @OrlandoMagic It’s ok you’ll probably come back to this when your up by 20 in the fourth🤣",
    "1422": "38 points in a half against the Orlando Magic is insane",
    "1423": "@MarcusSequeira Fully healthy lakers are 0-2 against the warriors this season and they won’t be making the playoffs. Nets are 0-1 against the warriors. The warriors are 2-7 without Steph this year and are currently down 10 to the Orlando Magic. Steph is just way better than your favorite player",
    "1424": "Every shot they're taking on the outside has been heavily contested. \n\nEvery shot in the interior is either not taken or they're turning it over on the other end\n\nAnd Yes that's happening against the Orlando Magic lmaooooo https://t.co/gxjbxujwso",
    "1425": "@Fitzmagic_Fan @WardellCentral @OrlandoMagic bro winning against the warriors and doesn’t know what to do",
    "1426": "@RyanBarnhart0 @ORL_EGW @JayssPlayss @andre @OrlandoMagic We talking to JaysPlays not u lol",
    "1427": "Orlando (+7.5) looking nice heading into halftime 👀 \n\n#Magic currently lead the #Warriors by a score of 46-38 #NBATwitterLive https://t.co/VMieP7VNoi",
    "1428": "@OrlandoMagic Ohhhh baby",
    "1429": "DO Y'ALL SEE WHAT THE WARRIORS ARE WITHOUT STEPH CURRY ?? 38 POINTS AT HALFTIME TO THE FRICKING ORLANDO MAGIC .....HELP\n#DubNation \n@warriors",
    "1430": "A team scoring ONLY 38 in 2 Qtrs AGAINST the Orlando Magic, doesn’t even DESERVE the play-in tournament 🤔.",
    "1431": "@OrlandoMagic Stop throwing the ball back for a three-pointer you cannot make fgs. Get to the basket and make a 2 pointer instead of this nonsense.",
    "1432": "@EVRYDAYCarter @ORL_EGW @JayssPlayss @andre @OrlandoMagic They not blowing the warriors out lol and I didn’t say it would be a blowout simply wouldn’t be as entertaining as the heat game.",
    "1433": "@warriors Orlando magic rocking us?\nYeah we are finished",
    "1434": "@WardellCentral @OrlandoMagic We own y’all",
    "1435": "Phoenix suns without Cp3 and Booker had a winning record,  Memphis without JA morant still winning games.... Warriors full squad without 30 they struggling against fking Orlando magic. 😴,",
    "1436": "@warriors How can you be down at the half to ORLANDO MAGIC!!",
    "1437": "@OrlandoMagic Own these frauds let’s go‼️",
    "1438": "Wiggins can't even score against the orlando magic lol, what a joke",
    "1439": "\"We're moving well.\"\n\nFranz Wagner credits the @OrlandoMagic's communication for their stingy first-half defense tonight! #MagicTogether https://t.co/smtHc2KfEE",
    "1440": "@CGJXXIII @OrlandoMagic Happy Birthday 🎂🎊🎉",
    "1441": "The Warriors just shot 14-40 from the field including 2-14 from three in the first half-\n\nagainst the....Orlando Magic.",
    "1442": "I luv u @OrlandoMagic pls dont let up in second half",
    "1443": "@OrlandoMagic 24 more mins",
    "1444": "@JayssPlayss @EVRYDAYCarter @RyanBarnhart0 @andre @OrlandoMagic Yea Magic blowing out the Warriors can probably get boring",
    "1445": "half time in the O 🪄 https://t.co/pJ2hcgAt8U",
    "1446": "They only have 36 points in the first half vs the Orlando Magic 😂",
    "1447": "@OrlandoMagic if u win today I will unfollow you.",
    "1448": "36 points in the first half against the ORLANDO MAGIC. Steph is the MVP",
    "1449": "If the Orlando fucking Magic are calling out your sets no vets on the court you need to adapt.",
    "1450": "@antonin_org the same orlando magic team that let Kyrie drop 60 in 30 minutes😭😭it’s just comedy now",
    "1451": "The Warriors have 38 points in the first half vs the Orlando Magic. \n\nA week ago, Kyrie Irving had 41 points in the first half vs the Orlando Magic.",
    "1452": "What the heck are we doing here. We playing ass against the orlando magic smh",
    "1453": "36 points in a half against the Orlando Magic. \n\nSteph is the MVP.",
    "1454": "38 points in 24 minutes vs the Orlando Magic https://t.co/Y3lmR2JIi6",
    "1455": "38 points at half versus the Orlando fucking Magic 🔥🔥🔥🔥🔥🔥🔥",
    "1456": "Ladies and Gentlemen… the Orlando fucking Magic.. https://t.co/FEZZCFQEDY",
    "1457": "38 points scored at halftime vs the Orlando Magic…",
    "1458": "@br_orlandomagic @Pato @STUFFMagic @BrOrlandoCity Duck Alexandre",
    "1459": "[LIVE] 2022 NBA Bsketball Orlando Magic Vs Golden State Warriors | Watch Live &amp; On Demand 👉 ▶️ : https://t.co/m6Lj2hQiID | NBA | Golden State Warriors | Orlando Magic | Bsketball https://t.co/fnh6xnJdQi",
    "1460": "Struggling to crack 40 points before half time against ORLANDO MAGIC 😂😂😂😂😂😂",
    "1461": "@LostxSawce We losing to the orlando fucking magic",
    "1462": "💙 amazing being here @OrlandoMagic 💙💙💙 https://t.co/BSfMuyqPbY"
}