{
    "0": "Should I even bother with the Sacramento Kings game🤔 #SacramentoProud are they even going to show up tonight..",
    "1": "@James_HamNBA @SacramentoKings What’s this resting PG13, I know it’s not an anomaly but it imho are turning off fans",
    "2": "@James_HamNBA @SacramentoKings I thought coach was gonna look for players who wanted to compete?",
    "3": "@Brettj3232 @SacramentoKings I know which is sad but I’m glad to see him back",
    "4": "LOS ANGELES (AFP) — LeBron James was ruled out of the Los Angeles Lakers’ clash with the Sacramento Kings on Tuesday after entering the National Basketball Association’s (NBA) Covid-19 health and safety protocols, the team said. https://t.co/4TklSnA1kr",
    "5": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns Look up Colin Cowherds comments today on this. He admitted that when they talk Lakers, Yankees, etc, their company makes money.",
    "6": "@DeuceMason @SacramentoKings @Audacy @Sports1140KHTK @ESPN1320 @momoragan @mmcnair Brother in looks only. I think, “Dave Mason,” a talk with @momoragan is something you may need to have. I will have to tell @TRRaganAuthor about what you said.😳🥴 https://t.co/OhLoCvCFC5",
    "7": "@ClipsUniTracker @LawlersLawYo @SacramentoKings @LAClippers @cryptocomarena The black uniform 😢 https://t.co/sE68RiskUs",
    "8": "#NBA #NBATwitter Today's Lineups\n\n#ClipperNation\nLos Angeles Clippers Starting 5:\nReggie Jackson\nEric Bledsoe\nMarcus Morris\nSerge Ibaka\nIvica Zubac\n\n#SacramentoProud\nSacramento Kings Starting 5:\nDe’Aaron Fox\nTyrese Haliburton\nTerence Davis\nChimezie Metu\nRichaun Holmes",
    "9": "@SacramentoKings @Verizon @swipathefox @TyHaliburton22 @TerenceDavisJr @Chimezie_Metu @Rich_Holmes22 sell the team @vivek",
    "10": "@SacramentoKings @Verizon @swipathefox @TyHaliburton22 @TerenceDavisJr @Chimezie_Metu @Rich_Holmes22 Bagley comes back he’ll start?",
    "11": "@SacramentoKings @Verizon @swipathefox @TyHaliburton22 @TerenceDavisJr @Chimezie_Metu @Rich_Holmes22 Stop starting TD, bring him off the bench with the 2nd group.",
    "12": "NBA Pick of the Day 2 🏀⭐️\n\nUnder 215 points in Sacramento Kings vs. LA Clippers (2U) \n\n$1,100 bet to win $1,000\n\nAs always, please bet responsibly \n\n#GamblingTwitter #MercenaryBet \n\n#NBA  #NBA75 https://t.co/UdYYCPeuUf",
    "13": "@James_HamNBA @SacramentoKings Lord help us",
    "14": "@A237654 @Matt_Barnes22 @SacramentoKings @Yg_Trece @LAClippers Agreed on all fronts but Simmons. This team needs shooting and he ain't gonna help with that.",
    "15": "@Matt_Barnes22 @SacramentoKings @Yg_Trece @LAClippers Give Fox and Buddy a couple DNP-CDs",
    "16": "Sacramento Kings vs Los Angeles Clippers preview, prediction and picks | SportsNus https://t.co/iwbgPsJKSZ",
    "17": "@Matt_Barnes22 @SacramentoKings @Yg_Trece @LAClippers Play 48 minutes of team basketball.  Move on offense, pass the ball, take good shots. Play defense and rebound the basketball and limit the turnovers. Basic playoff quality basketball.",
    "18": "@SacTownBarnbaum @SacramentoKings @Audacy @Sports1140KHTK @ESPN1320 @momoragan @mmcnair You should have better seats considering you brother is Steve Ballmer.",
    "19": "The @SacramentoKings are now warming up before their matchup at the Los Angeles Clippers. In case it’s a bit hard to see on the backs of the players track suits, their logo is exactly what you all see on the mask. @Audacy @Sports1140KHTK @ESPN1320 @DeuceMason @momoragan @mmcnair https://t.co/SJRHrZR6O7",
    "20": "Today's NBA Picks: 10:40 PM ET - Sacramento Kings vs. Los Angeles Clippers - 27 PICKS AVAILABLE: https://t.co/gLkU6mY1IU #nba",
    "21": "@13eechamFR maybe the sacramento kings series",
    "22": "The @SacramentoKings starting Fox, Haliburton, Davis, Metu, Holmes on Wednesday. #SacramentoProud #NBA",
    "23": "@EnderHeartkat @SacramentoKings Oh ok yea he has been nice just has had injuries",
    "24": "I like Alvin Gentry as the head coach for the @SacramentoKings. I wouldn’t mind him being the actual head coach.",
    "25": "@Brettj3232 I’ve been watching him since the @SacramentoKings days",
    "26": "@SacramentoKings let’s try not to suck tonight",
    "27": "@MrKenRudulphTV @SacramentoKings I kinda always want to root for the Kings because of what went down in 2002 against the Lakers in the playoffs",
    "28": "Sacramento Kings will win a chip before the Clippers",
    "29": "@Matt_Barnes22 @SacramentoKings @Yg_Trece @LAClippers Fox need to go off",
    "30": "@notScotPollard @James_HamNBA @SacramentoKings Fuck, can’t wait for his debut, ty :)",
    "31": "@James_HamNBA @SacramentoKings This team will never learn . Just a clueless organization w no basketball minds . How you go run small ball w no length lol we have nothing but short wingspan basketball players .",
    "32": "#LeBronJames tested positive for #COVID19 and was placed in the @NBA’s health and safety protocols on Tuesday morning, missing the Los Angeles @Lakers’ 117–92 win against the Sacramento Kings that night. https://t.co/1JWrjeN9vO",
    "33": "@Matt_Barnes22 @SacramentoKings @Yg_Trece @LAClippers Blow it up",
    "34": "@UrbnHandicapper @SacramentoKings You are about to see at least one half of good basketball. I can’t say if it’s gonna be the first half or the 2nd half or if it’s gonna be the 1st and 4th quarter or half of the 2nd quarter with parts of the 4th quarter. 🤷🏾‍♂️ Enjoy!! 😬",
    "35": "@James_HamNBA @SacramentoKings I’m boycotting watching until Metu isn’t a starter",
    "36": "@davioncentral @SacramentoKings Davion is not on the injury report. He will play.",
    "37": "@SacramentoKings please win 😭",
    "38": "Sacramento Kings Starters:\n\nDe'Aaron Fox\nTyrese Haliburton\nTerence Davis\nChimezie Metu\nRichaun Holmes\n\nPlayers out:\nMarvin Bagley\nHarrison Barnes\nMaurice Harkless\nRobert Woodard\n#SacramentoProud #NBA #NBATwitter #NBA75",
    "39": "I will be covering the Los Angeles Clippers vs Sacramento Kings Game @ Staples Center Arena 7:30pm start time. #rqcomm101csuf https://t.co/4VrfkthyL7",
    "40": "Tonight's starting lineup for the Sacramento Kings:  Fox, Haliburton, Davis, Metu, Holmes https://t.co/bVWH4AMCA2",
    "41": "@JasonRoss1140 @DeuceMason @SacramentoKings @scottmarsh1140 @HankDaHighFlyer @ggerould @Golden1Center @momoragan The @SacramentoKings, of course!! https://t.co/wDuER5QKTy",
    "42": "@James_HamNBA @SacramentoKings Will queta play?",
    "43": "@MrKenRudulphTV @SacramentoKings I still have no clue why I still love a team that doesn't love me back for over 15 years.",
    "44": "Starters for @SacramentoKings at LA Clippers - 12/1:\n\nG - De’Aaron Fox \nG - Tyrese Haliburton \nG - Terence Davis  \nF - Chimezie Metu \nC - Richaun Holmes",
    "45": "@WavyRJ @mmcnair @SacramentoKings Well take Bagley off your hands",
    "46": "@SacTownBarnbaum @SacramentoKings @scottmarsh1140 @HankDaHighFlyer @JasonRoss1140 @ggerould @Golden1Center @momoragan who you rooting for?",
    "47": "@WavyRJ All HOF Shooters have an off Night @mmcnair @SacramentoKings but Klay Thompson 2.0 will be great in that Purple and Black",
    "48": "@Matt_Barnes22 @SacramentoKings @Yg_Trece @LAClippers they need to play with heart. \nact like the care. \nplay tough defense. \njust play like they care.\nplay like they want to be Sacramento kings.",
    "49": "@Matt_Barnes22 @SacramentoKings @Yg_Trece @LAClippers Consistent fucking effort bro... Feels like dudes be shrugging shoulders/head down when teams go on runs...",
    "50": "Coming up at 7pm on the @SacramentoKings radio network is “Kings PreGame Live with @scottmarsh1140 @HankDaHighFlyer @JasonRoss1140 @ggerould and @DeuceMason from @Golden1Center in #Sacramento. I am in-person for tonight’s game. Hoping to be on “NightChat” with @momoragan later.🤝 https://t.co/qpdd5bW1vB",
    "51": "@Matt_Barnes22 @SacramentoKings @Yg_Trece @LAClippers PG is out for tonight’s game",
    "52": "@Matt_Barnes22 @SacramentoKings @Yg_Trece @LAClippers Matt, have you thought about coaching or maybe even a liaison for the Kings? You have mad knowledge brotha",
    "53": "@Matt_Barnes22 @SacramentoKings @Yg_Trece @LAClippers I'm sure the kings will win by 20.  Followed by losing the second half by 55",
    "54": "Can the @SacramentoKings bounce back after two ugly losses?? They take on a @Yg_Trece less @LAClippers tonight.. Last two teams we’ve played have been missing their star player &amp; that hasn’t mattered for us.. what do the Kings need to do to secure a win tonight?",
    "55": "@MrKenRudulphTV @SacramentoKings Just so you know I am now obligated to watch this game",
    "56": "NBA ML. Date: 12-01\nSacramento Kings vs Los Angeles Clippers. 0.47%\nFanDuel. Kings @ +230\nBetMGM. Clippers @ -225\n#arbitrage #bettingtwitter #bettingpicks #sportsbets #freepicks #freemoney #mlb",
    "57": "@SacramentoKings @CoorsLight Cold Hard Fact: The Kings have lost 10 of their last 13 games",
    "58": "@SacramentoKings @CoorsLight Worst operation in basketball",
    "59": "@SacramentoKings @CoorsLight I give 0 shits lose",
    "60": "@MrKenRudulphTV @SacramentoKings This GIF is why I f**k with you Bruh 😂😂😂",
    "61": "@MrKenRudulphTV @SacramentoKings I’ll take it easy on you. I know your squad has some MAJOR issues…lol",
    "62": "At @staplescenter covering @SacramentoKings basketball on freelance duty again for @Audacy #Sacramento Sports Talk Stations: @Sports1140KHTK and @ESPN1320. Have to give a shoutout to @ggerould &amp; @BobbyGerould with regards to our favorite Los Angeles Food Spot: The Pantry @ Fig.👇🏽 https://t.co/cM8Cq2y5W4",
    "63": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns Skip and Shannon are not in the business of actual information.  They are entertainment focuses of lazy scandalous reporting",
    "64": "ALERT: New high roller bet posted!\nA bet has been placed for $5,002.85 on Los Angeles Clippers - Sacramento Kings to win $15,508.84.\nTo view this bet or copy it https://t.co/dUqToSy2sN https://t.co/vvUcXZxgA5",
    "65": "Match: Los Angeles Clippers - Sacramento Kings\n\nBet slip link: https://t.co/Fj6b0tIUkD\n\n#LosAngelesClippers #SacramentoKings #omgnetwork #omg #blackjack https://t.co/ePCq0llILw",
    "66": "LeBron James has been placed in the NBA's health and safety protocols, and was ruled out for the Los Angeles Lakers' game against the Sacramento Kings on Tuesday night.",
    "67": "LeBron James has been placed in the NBA's health and safety protocols, and was ruled out for the Los Angeles Lakers' game against the Sacramento Kings on Tuesday night.",
    "68": "@SacBee_JoeD....It's a shame that Sacramento isn't a college sports town. SAC ST. Football is doing big things, are hosting a playoff game @ an affordable price range of $5-$20 &amp; its barely getting any run. The Kings could learn a thing or 2 about heart/effort from these amateurs",
    "69": "@CarmichaelDave When you own or run the Sacramento Kings, you can't miss on ALMOST every draft pick. The draft is our only chance to build a team.",
    "70": "@TimMaxwell22 How are you not just the @SacramentoKings Twitter guy. This shit would make national rounds and kings Twitter interaction would explode.",
    "71": "Al Horford has five blocks tonight. His career-high is seven, set in 2011 against the Sacramento Kings.",
    "72": "@NBA2K @Beluba @Ronnie2K @LD2K why haven’t the court for the @SacramentoKings been updated? It’s been at least 2 years since they’ve changed it.",
    "73": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns No difference with the Cards! No recognition at all!",
    "74": "The NBA’s health &amp; safety protocols have prohibited fully vaccinated basketball star LeBron James from playing in last night’s game against the Sacramento Kings. Boost 🐑!!",
    "75": "@SacramentoKings Please show some heart, passion for the game, dignity, pride for your fans, fight for our city and God forbid, show some damn integrity and fight even when things aren’t going well/things get physical. Play like a team, pass the ball, move without, attack paint",
    "76": "@delonwright play like he's still with the Sacramento Kings...Like he's not on a team with championship aspirations....",
    "77": "@SacramentoKings @ankr Holmes is a dawg we need more players like him . 💯🦾",
    "78": "@matthew_peirson @SacramentoKings Man, you ain’t never lied. They totally need a full stop. Time to reflect and get a fresh start. Like…seriously. 😬",
    "79": "@CLopez63 @nbatopshot we have a @SacramentoKings #SacramentoProud community we're trying to build. If you join up I'll gift you your first moment!",
    "80": "This is the highlight of the Sacramento kings season https://t.co/IG44Eqds5T",
    "81": "DeA’aron Fox will need to step up tonight @swipathefox @SacramentoKings",
    "82": "@MrKenRudulphTV @SacramentoKings The Kings need about three years off. Turn them off then turn them on again when the time has passed. We need a break 🤦‍♂️",
    "83": "@MrKenRudulphTV @SacramentoKings You need to become a Cleveland cavalier fan! Most fun team in NBA to watch now.  Young nucleus. Lobs and dunks all night!! All aboard. Gonna be a great ride",
    "84": "@MrKenRudulphTV @SacramentoKings If Richaun Holmes is Wilt again tonight I have zero shot",
    "85": "Yo @NBA @NBATV I didn’t pay $200 for NBA League Pass so you could blackout every @SacramentoKings game just because your playing it on NBA TV. Start letting League Pass watch NBA TV for free or give me a refund!! #pennypinchers",
    "86": "@gswish10 @SacramentoKings Don’t count that money just yet, this might be a trap game for the Clippers. 😳",
    "87": "@MrKenRudulphTV @SacramentoKings True, that said, I bet the clips",
    "88": "@gswish10 @SacramentoKings Last night we dodged LeBron, so it really doesn’t matter. 🤷🏾‍♂️",
    "89": "@MrKenRudulphTV @SacramentoKings Dodged PG13 tho",
    "90": "This was 3 years ago. What happened to the promise, the pride, the fight? Are we just gonna lay down and die now? Kings fans deserve better. @swipathefox @SacramentoKings https://t.co/wc53saA5Q0",
    "91": "After last night I find it cruel and unusual punishment to have the @SacramentoKings play another basketball game tonight. It’s against another LA team too? Nah, player. 🤦🏾‍♂️",
    "92": "LOS ANGELES (AFP) — LeBron James was ruled out of the Los Angeles Lakers’ clash with the Sacramento Kings on Tuesday after entering the National Basketball Association’s (NBA) #Covid19 health and safety protocols, the team said.\n\nREAD MORE:\nhttps://t.co/NqtoUN3Mi7\n\n#DailyTribune",
    "93": "LOS ANGELES (AFP) — LeBron James was ruled out of the Los Angeles Lakers’ clash with the Sacramento Kings on Tuesday after entering the National Basketball Association’s (NBA) #Covid19 health and safety protocols, the team said.\n\nREAD MORE:\nhttps://t.co/MfxDCLXpY1\n\n#DailyTribune",
    "94": "@NBATV I subscribe, I’m a LAKER  fan , however I live in Lake Tahoe, Incline Village , NV. I’m blocked out of Sacramento kings games and warriors game , yet I get Bay Area coverage that watch on NBC Warriors. I don’t get Any kings coverage please address.",
    "95": "🏀 Sacramento Kings(+8) at L.A. Clippers(-8)\n\n⌚ 10:30 PM ET\n\nO/U: 216.5\n\n📋 Over is 4-0 in Kings last 4 games as an underdog.\n\nBet BTC ➡️ https://t.co/spMiJIy3iL\n\n#NBATwitter #NBAPicks #SportsBetting #GamblingTwitter https://t.co/YxIOMwOxYR",
    "96": "@StocktonKings @SacramentoKings @thebobbyjackson Y'all seem great but no I have literally never wondered that\nSorry, coach Jackson",
    "97": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns Sick of being forced to watch the lake side show.",
    "98": "Sacramento Kings vs. LA Lakers - 12/1/2021 Free Pick &amp; NBA Betting Prediction https://t.co/wuBsbPesa5\n.\n#Betting #FreePicks https://t.co/eEPTqYoPJL",
    "99": "I need to find out if I’m alone here.   You turn on the Kings game, say end of the 1st qtr &amp; you question whether to watch the rest fearing you’ll jinx the game or change the channel for fear of jinxing the game.  Well, sorry about last nights loss @SacramentoKings I watched it",
    "100": "I went into the day thinking the Sacramento Kings get rolled, but they really need to seize this opportunity with the Los Angeles Clippers resting Paul George.",
    "101": "@FDSportsbook @FanDuel_Support \nWill you add player props and the double double option for Chimezie Metu (C) for the Sacramento Kings? 🏀",
    "102": "Embarrassing yesterday, just embarrassing. @SacramentoKings",
    "103": "@SacramentoKings vs @LAClippers  10:30pm eastern",
    "104": "@SacramentoKings @ankr It’s also a followback wednesday?",
    "105": "Omicron is the sacramento kings of variants. The oakland raiders, the detroit lions. Doesn’t have the fundamental support to win.",
    "106": "How about a consistent effort tonight @SacramentoKings just wanting to enjoy a W",
    "107": "@Kcharach_CHEK @TimMaxwell22 Side note: are you from Sacramento? Haha looks like you’re in Canada - how did you become a Kings fan?",
    "108": "Wednesday NBA🏀\n\nSacramento Kings (+5.5) -110\n\n#GamblingTwitter #FreePicks",
    "109": "@megalutou @SacramentoKings Please show up and give a shit @SacramentoKings",
    "110": "Dear @SacramentoKings I’m pulling up to watch the whole game no matter what .   #pleasebefun",
    "111": "@ErickUQ1 @AncientAge449 @Athletics @SacramentoKings @warriors I’d rather ride the struggle bus than the bandwagon",
    "112": "@MRob0351 @SacramentoKings @Rich_Holmes22 They can't handle defense it showed.",
    "113": "Get rid of Buddy Hield. Cut him from the roster. I don’t care if we get nothing, we have to start establishing culture in the @SacramentoKings organization immediately. We have the opportunity to start creating a culture and send a message to future players.",
    "114": "Skip Bayless is pleasantly surprised with Lakers win over Kings #LosAngelesLakers #SacramentoKings https://t.co/YOGE8AQAyA",
    "115": "@dammit_its_eddy @SacramentoKings @Rich_Holmes22 Fact,no king can make pressure shots.they can't handle a little D.",
    "116": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns That might as well be the Cowboys and Lakers network",
    "117": "Sacramento Kings ,Coach Gentry is not the one that needs to apologize, It is now on the owner Vivek Ranadive which we have heard nothing from him! As Season ticket holder for years this is the low point . Iam thinking he does not care about fans he has already millions!",
    "118": "@SacramentoKings @Rich_Holmes22 SAC.HAS GOT TO BE THE WORST TEAM SHOOTING FROM THE FIELD, YEAR AFTER YEAR,THEY CANT HANDLE PRESSURE.",
    "119": "@MarcJSpears @KarlTowns @TheUndefeated I think this is where @swipathefox is with the @SacramentoKings. The only difference is the @Timberwolves actually did a rebuild and structured a solid roster around @KarlTowns",
    "120": "@ActualMarkDavis @SacramentoKings @sactowncrown @TimMaxwell22 I didn't choose the Kings, the Kings chose me",
    "121": "@LAClippers @SacramentoKings @BallySportWest @NBATV @AM570LASports @TuLigaRadio @AguaCalientePS If you lose im changing teams",
    "122": "@HDCardz @SacramentoKings @sactowncrown @TimMaxwell22 ....or pick a new team 🤣",
    "123": "@HDCardz @SacramentoKings @sactowncrown @TimMaxwell22 Whoever wrote this has been living in a dark place for 20 years and needs to meditate  😉😂😂",
    "124": "@bigiv864 @Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns The Suns started 1-3 and the talk was “Oh, last year was a fluke.” 17 consecutive wins later and we as fans need to chill out because it’s November basketball?",
    "125": "Latest Kings thread rant if you're bored 🤷‍♂️\n\nAlso, a link to 'Grant's Rant' from earlier today if you want the old-head perspective 😂\n\n@SacramentoKings @sactowncrown @TimMaxwell22 \n\nhttps://t.co/Pt8XXU9hvr https://t.co/6N4Jlc2AZY",
    "126": "SAC@LAC:\nOUT- Woodard (SAC); Batum, Leonard, Preston (LAC)\n-Kings also announce Marvin Bagley (illness) and Harrison Barnes (foot) are OUT\n-Maurice Harkless is also listed as questionable (knee) for Sacramento\n-The Clippers say Paul George will be rested tonight and will NOT play",
    "127": "@malufrnds sacramento kings",
    "128": "@SacramentoKings @TyHaliburton22 @ankr Kick him off the team",
    "129": "Back SACRAMENTO KINGS to BEAT Los Angeles Clippers tonight in the @NBA (Game Starts at 03.40 GMT) #NBA #Basketball",
    "130": "The Sacramento Kings have a LONG way to go - Jalen Rose | Jalen &amp; Jacoby - https://t.co/FiErGM7W5L temporary covers https://t.co/Bn9IBaC7CG - https://t.co/km9ozbszRT",
    "131": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns Those guys are 🤡",
    "132": "We’re tremendously grateful to the @SacramentoKings  for inviting out us to several games this season via their #DoGood Community Partner program. Last night our kids (&amp; staff) had an amazing time watching the #Kings take on the #Lakers .Thank you so much ! \n#CommUnity\n#GoKings https://t.co/WWCXaudSn6",
    "133": "@SacramentoKings Then we shit the bed in the 2nd half of the game",
    "134": "@anaarevalolucas @WarriorsPR @warriors i'm assuming he comes back one of the two home games before Christmas, most likely the game against the Kings. Klay loves demolishing the @SacramentoKings",
    "135": "@Vivek stick to cricket. Sell the @SacramentoKings to someone who knows basketball",
    "136": "@SacramentoKings @TyHaliburton22 @ankr Makes me wish I had eye cancer",
    "137": "@AncientAge449 If you like the @Athletics then is okay to leave the @SacramentoKings for the @warriors ..",
    "138": "#e_RadioUS The Sacramento Kings have a LONG way to go – Jalen Rose | Jalen &amp; Jacoby https://t.co/rX2DsXOr0F https://t.co/Ggp1VWwxs6",
    "139": "Bet @swipathefox goes crazy tonight, fuck the haters bro true Sacramento Kings fans are ride or die with you! Beat LA!",
    "140": "LeBron James was sidelined last night during a game against the Sacramento Kings due to the NBA's Covid-19 health and safety protocols. https://t.co/UmAdwkQSdX",
    "141": "Alvin Gentry apologizing for the disaster that is the Sacramento Kings is:\n1. The sign of a true professional\n2. Further proof that franchise is a complete shit show. \nAG deserves so much better. https://t.co/gT5wg9KPl7",
    "142": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns That’s so true @Jumpshot8 I was also surprised there is no way they should not have lead off with @Suns but I guess the reason they didn’t is because @warriors lost if it was a warriors win they would have lead with the story. It’s disrespectful to @Suns.",
    "143": "🏀TOP VALUE PLAY🏀\n\nChimezie Metu of the Sacramento Kings is popping up as the top value play of the slate on #DraftKings for #NBAdfs. Access the rest of our DFS projections on our Projections Portal here: https://t.co/x4TT3E8iPt.\n\n#Fanduel #DFS #DKNG #BasketballTwitter https://t.co/RbW0q2Vrld",
    "144": "⏰ 05:30 (GMT +2)\n🏀 NBA\n🇺🇸 Los Angeles Clippers vs Sacramento Kings\n👉 Clippers -4.5 handicap @ 1.75\n\n#betting #basketball #NBA #NBA2K22 #NBATwitter #NBAPicks https://t.co/2726Ssvf6K",
    "145": "How...the...he...heck is it December 1st?!?! Sheesh, well stepping up into @1025KSFM with your shot at Sacramento Kings tickets and GUARANTEED I got DaBaby Double coming for your shot to tsee him Feb 1st at Sacramento Memorial Auditorium!  Lock in our New # 916-885-KSFM https://t.co/R0fuLQOzw7",
    "146": "@Sports1140KHTK @CarmichaelDave Done….100%……until @Vivek is removed or bought out I am 100% done with @SacramentoKings - say what you will about @boogiecousins at least he cared….he had passion…. I am tired of @swipathefox looking like a beaten puppy.",
    "147": "2022 New Years Resolution. Give up on the @SacramentoKings forever.",
    "148": ".@SacramentoKings y’all seem to be lacking a true veteran presence in the locker room. Might I suggest this man? https://t.co/d8ts813c0l",
    "149": "@ryansnuggs @BoredApeYC @AdamBombSquad @LAClippers @SacramentoKings You very generous, thank you.",
    "150": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns The problem is that these lonely Lakers fans help bring ratings, while us Suns fan know better then to watch a bunch of bullshit on TV.",
    "151": "Let’s see if this works\n\n*the Sacramento Kings are a good basketball team* https://t.co/6MjM9Uz9vI",
    "152": "The Sacramento Kings have a LONG way to go – Jalen Rose | Jalen &amp; Jacoby https://t.co/j7bLmonMgj",
    "153": "Vivek has to thank you for everything,please exit stage left @SacramentoKings",
    "154": "@nbatrend 📂  NBA franchise \n └📂  Sacramento Kings\n      └📂  L’s Taken\n          └📂  This folder is full",
    "155": "Game 23 of the Sacramento Kings baby!!! https://t.co/59lk8LrQcs",
    "156": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns they biased haters, it’s nice seeing arizona beat up on all these big market teams !!!",
    "157": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns Lakers move the needle bro",
    "158": "Starting to understand why New Orleans got rid Buddy so early in his career. #SacramentoProud #sacramentokings #nba #nbatwitter",
    "159": "NBA:\nAtlanta Hawks ML vs Indiana Pacers @ 2.06 HIGH\nPhiladelphia 76ers ML vs Boston Celtic @ 2.26 MEDIUM\nCharlotte Hornets +10 vs Milwaukee Bucks @ 1.80 MEDIUM\nLA Clippers -5 vs Sacramento Kings @ 1.83 MEDIUM\nOrlando Magic +8.5 vs Denver Nuggets @ 1.83 LOW",
    "160": "@SacramentoKings @TheDougChristie Kings never beat the Lakers when it mattered",
    "161": "Since November 7th, only the Orlando Magic have posted a worse record than the Sacramento Kings. \n\nYes that includes tankers like the Pistons, the Rockets, and the Thunder.",
    "162": "Sacramento Kings\n\n1st half vs. 2nd half https://t.co/UscNg6ancb",
    "163": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns There clowns they don't know what there talking about anyways big shit show",
    "164": "@SacramentoKings ownership blows. Just cashing checks and bs'ing everyone that they care about basketball. I feel bad for our talent they don't deserve to be under the Vivek regime. Close down shop!!!!!",
    "165": "Resultados NBA\nBrooklyn Nets 112-110 New York Knicks \nToronto Raptors 91-98 Grizzlies \nPhoenix Suns 104-96 Golden State Warriors \nPortland Trail Blazzers 110-92 Detroit Pistons \nSacramento Kings 92-117 Los Ángeles Lakers",
    "166": "NBA PURCHASE ORDER\n\n#555 SACRAMENTO KINGS +6",
    "167": "@ryansnuggs @BoredApeYC @AdamBombSquad @LAClippers @SacramentoKings Man I missed it! I’ll look out for the next ones 😅🙌🏼",
    "168": "@NJDevils2021 @SacramentoKings @Rich_Holmes22 On some Fridays they do follow Friday",
    "169": "Kings gameday live: Paul George ruled out for Clippers; Barnes, Bagley out for Sacramento\nhttps://t.co/L14YlgALQ5",
    "170": "@SacramentoKings @Rich_Holmes22 besties can u follow me?",
    "171": "LeBron James has been placed in the NBA's health and safety protocols, and was ruled out for the Los Angeles Lakers' game against the Sacramento Kings on Tuesday night.\n\nhttps://t.co/VxWMoQe5nR",
    "172": "Kings vs Clippers tonight in LA. Sacramento will be without Marvin Bagley (non-COVID illness), Harrison Barnes (foot sprain) &amp; Maurice Harkless is questionable (left knee soreness).",
    "173": "@jose_castellar @Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns And Aaron Rodgers occasionally.",
    "174": "@bigiv864 @Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns It's more the two best teams in the league went head to head, played a good competitive game, and the talk is about Lakers-Kings. We know why but it's annoying.",
    "175": "@SKings916 @SacramentoKings dont we say that about all the kings and then end up getting kicked in the ass",
    "176": "Let’s get a W tonight!  @SacramentoKings \n\nI have a good feeling about this game.\n\nLet’s Gooooooooooo!\n#SacramentoProud",
    "177": "@travthesav @SacramentoKings @nbatopshot @_Puzzlepiecedad @gold35rush @bflewis3 @KyleDeming1 @SacTown41681629 @RealMurphdog916 yea but @RealMurphdog916 is not in SacValley",
    "178": "If any verified @BoredApeYC, Mutant, or @AdamBombSquad members are in LA and want 2 tix to the @LAClippers vs. @SacramentoKings tonight tag me (snuggster) in the verified members discord. Must own an ape/mutant/abs. Previous winners eligible after 1 hour.",
    "179": "The rockets 4-16\nOKC 6-14 and both are rebuilding then you have the sacramento kings 8-14 it’s been 2007 since the Kings made the playoffs https://t.co/eMyoZWUt1U",
    "180": "Sacramento Kings @ LA Clippers\n\nProjected Score\n\nPlayer Points Projections\n\n🚨TOTAL BET RECOMMENDED🚨\n\nhttps://t.co/80DaLQGl5v",
    "181": "@ChewieWoolf @SacramentoKings @nbatopshot @_Puzzlepiecedad @gold35rush @bflewis3 @KyleDeming1 @SacTown41681629 @bflewis3 &amp; @RealMurphdog916 are also TS collecting Kings Fans",
    "182": "@WolfinBrabant 1) Washington Generals\n2) Monstars \n3) Sacramento Kings",
    "183": "@ChewieWoolf @SacramentoKings @nbatopshot @_Puzzlepiecedad @gold35rush @bflewis3 @KyleDeming1 @SacTown41681629 lifetime kings fan here....  🙋‍♂️",
    "184": "@LAClippers @SacramentoKings @BallySportWest @NBATV @AM570LASports @TuLigaRadio @AguaCalientePS Y’all lose this I swear https://t.co/HnZYnF43Lu",
    "185": "Sacramento Kings big man Marvin Bagley and his girlfriend college volleyball player and model Rissah Lozano. 🖤🖤🖤 https://t.co/6OmAGCxmv3",
    "186": "The Sacramento Kings are so bad, @TheAthletic does not even bother to cover them anymore.",
    "187": "The Kings man..We are a shitty organization.  It’s not like we don’t have talent, we do. The teams just not winning.  How do we solve it?  One trade will not save us.  The organization sucks, we suck as fans, Sad time in Sacramento rn.  God hates Sacramento.",
    "188": "Bitches want you to be dumb and loyal.. what do I look like, a @SacramentoKings fan? 😩",
    "189": "LeBron James has been placed in the NBA’s health and safety protocols, and was ruled out for the Los Angeles Lakers’ game against the Sacramento Kings on Tuesday night.\n\nFull Story--&gt; https://t.co/xw5kY0G4Jw https://t.co/nHRnD8qVHx",
    "190": "NBA\nMIN @ WAS Under 216 (-110) - BEST BET 🔨🔨🔨🔨🔨🔨🔨🔨\nBoston Celtics ML (-140)\nDALLAS ML (-145)\nSacramento Kings +7.5 (-110)\n\n@Clappa12\n@StreakCoolers",
    "191": "Sacramento Kings guard Tyrese Haliburton's girlfriend Jade Jones was a cheerleader at their college Iowa State when they met. 🖤🖤🖤 https://t.co/4WSZV2iKgy",
    "192": "#Poll: Do you know what is the Sacramento King’s function? #NBA",
    "193": "@SacramentoKings I still believe Reese!  Dont lose the faith!",
    "194": "@LAClippers @SacramentoKings @BallySportWest @NBATV @AM570LASports @TuLigaRadio @AguaCalientePS Let go",
    "195": "@LakersDynastyLD We kicked some Sacramento ass keep it up Lakers we can play the next couple games without the king James let's go Lakers may god bless y'all respect",
    "196": "https://t.co/6V9TmnUDhs I'm old enough to remember when the Sacramento Kings were worth watching when this guy was on the team",
    "197": "It seems like the phrase \"rock bottom\" has been used several times this season when referring to a brutal Sacramento Kings loss.\n\nFollowing last night's embarrassing showcase against the Lakers, @JayMarZZ asks a question that has no clear answer: What now?\nhttps://t.co/i5gRagZe0K",
    "198": "Read what happened when the NBA's Sacramento Kings visited Folsom State Prison. https://t.co/35i5fjcV6T",
    "199": "The Sacramento Kings: You can comfortably rest your superstars at our expense https://t.co/6GOPxVKO0I",
    "200": "@LAClippers @SacramentoKings @BallySportWest @NBATV @AM570LASports @TuLigaRadio @AguaCalientePS mr. balmer we need a trade. Get Schroeder from Boston, and ship Bledsoe. We need someone capable of shooting.",
    "201": "@SacramentoKings @Rich_Holmes22 Why! It’s better to lose showing effort than not giving a 💩 where’s your pride players??? And I’m not talking about all of them. #@Rich_Holmes22  ❤️🙏",
    "202": "Update on my son as he ponders last night’s @SacramentoKings game (sound on): https://t.co/LD03Nl145p",
    "203": "@managuit_rey @LAClippers @SacramentoKings @BallySportWest @NBATV @AM570LASports @TuLigaRadio @AguaCalientePS He’s out for rest",
    "204": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns What you expect? It’s not only on them but Fox’s producers…but you can bet if Warriors won they’d have a story",
    "205": "@bigiv864 @PublicHealthJoe @Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns So media should talk about Lakers more? Cool",
    "206": "𝗚𝗔𝗠𝗘𝗗𝗔𝗬\n🏀 » Sacramento Kings at Los Angeles Clippers\n⏰ » 7:30 PM PST\n📺 » NBCS CA\n📍 » Staples Center https://t.co/N3jM0rLwC5",
    "207": "Bruh @Everton and the @SacramentoKings in a battle to see who can piss me off more.",
    "208": "@LAClippers @SacramentoKings @BallySportWest @NBATV @AM570LASports @TuLigaRadio @AguaCalientePS the clippers can easily win this  game  if paul george will concentrate on his midrange jumper",
    "209": "3 More Trades to Send Ben Simmons to the Sacramento Kings\n\n#HereTheyCome | @WillWork4Sneaks https://t.co/4En248xnSW",
    "210": "Stock market’s game plan today is a carbon copy of what the Sacramento Kings drew up for last night’s matchup with the lakers.",
    "211": "Live updates throughout the day on tonight’s NBA game between the Sacramento Kings and Los Angeles Clippers at Staples Center. https://t.co/lzU6GA0abv",
    "212": "Live updates throughout the day on tonight’s NBA game between the Sacramento Kings and Los Angeles Clippers at Staples Center. https://t.co/rXvMRLegA6",
    "213": "Kings gameday live: Home-and-home set against Clippers awaits after tough loss to Lakers\n\nLive updates throughout the day as Sacramento Kings prepare to face Los Angeles Clippers tonight at Staples Center.\nhttps://t.co/L14YlgALQ5",
    "214": "@SacramentoKings @CarmichaelDave @NBCSKings\nThe Kings are an embarrassment. Fox is averaging 5 to 6 Turnovers a game, Tyrese can't score, Buddy???\nSo what happens now? What does one do with a below-average, underperforming, overpaid, nonchalant, leadership-less team?",
    "215": "We are gonna play a pissed off Kings team from their loss last night to the Lakers. Seems like the Clippers are very overconfident to beat Sacramento without their star player but ok they better win and they better beat the Lakers since it seems they want PG to sit tonight",
    "216": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns It's cause they spent all off season crowning the Lakers as the 2022 NBA champions and don't want to admit they were wrong. They'd rather double down and continue to spread the narrative that they can make a comeback, but will quickly shoot down the Suns even being in the WCF 😒",
    "217": "Happy game day #ClipperNation!\n\nWe’re short Paul George tonight, but the @LAClippers have the @SacramentoKings tonight. Don’t take them lightly and get that W. GO CLIPPERS!!! https://t.co/RBATZ7kriW",
    "218": "@LAClippers @SacramentoKings @BallySportWest @NBATV @AM570LASports @TuLigaRadio @AguaCalientePS Com'on guys 🔥🔥🔥🙌🙌🙌🙌",
    "219": "Los Angeles Clippers Predictions and Preview for 12/1/2021 hosts Sacramento Kings.  Looking for betting action?  Find out if there is any value in our preview. #Picks #Sportsbook https://t.co/xnBKEHttGi",
    "220": "@Pacers @Timberwolves @OrlandoMagic @cavs @PelicansNBA @HoustonRockets @SacramentoKings @celtics @hornets GO GET THISWIN TODAY GUYS!!!YES YOU GUYS CAN DO THIS!!!YES YOU GUYS CAN WIN AGAINST THISTEAM!!!!!!YESYOUCAN!YESYOUCAN!!YESYOUCANGUYS!!!!!GO OUT THERE ON THE COURT,PLAYHARD,,,",
    "221": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns That’s because Shannon humps Lebron’s leg.",
    "222": "@Anthonyhca1 @SacramentoKings @sactownroyalty @thekingsherald Because they’re still developing guys that we drafted within the year and half. What’s your excuse for the other 4? Lol",
    "223": "@betbs @SacramentoKings This year the suck feels different.",
    "224": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns @ShannonSharpe said @StephenCurry30 had an OFF NIGHT 3-5 times but didn’t mention @mikal_bridges ONE TIME",
    "225": "The Sacramento Kings will look to cleanse themselves of last night's epic meltdown when they face the Los Angeles Clippers tonight at STAPLES Center.\n\nHere's last night's recap, injury updates &amp; more ✍\nhttps://t.co/LVnvIpFYJH️",
    "226": "@chrissmith Checking the league schedule, I guess ESPN couldn't stomach the Sacramento Kings for one night, even if they are playing the Lakers. Hawks get the same treatment in February, with an 8:30 Wednesday nighter at the UC against Minnesota.",
    "227": "ALERT: New high roller bet posted!\nA bet has been placed for $5,658.77 on Los Angeles Clippers - Sacramento Kings to win $10,695.07.\nTo view this bet or copy it https://t.co/ru9ZvrMKWs https://t.co/qpsK9vNFJ5",
    "228": "@Libruary_NFT @hbarnes @TyHaliburton22 @hoopculture13 @SacramentoKings @ChewieWoolf @nbatopshot Wow that’s awesome!!!",
    "229": "Clippers' Paul George (rest) is out for tonight's game against the Sacramento Kings.",
    "230": "@TimMaxwell22 @SacramentoKings @MarkJonesESPN it's time to stop firing coaching and hold the players accountable",
    "231": "Maybe it’s the @SacramentoKings that put me in a bad mood during the holidays every year…\n\nDamn.",
    "232": "Hours after LeBron James entered the COVID-19 protocol, the Lakers overcame a 14-point first-half deficit and beat the Sacramento Kings 117-92.\n\nhttps://t.co/OHbUqPYyYw",
    "233": "@Libruary_NFT @hbarnes @TyHaliburton22 @hoopculture13 @SacramentoKings @ChewieWoolf @nbatopshot @Libruary_NFT making appearances in all arenas! Watch out @NBA! #NBATopShotThis",
    "234": "“I would do *anything* for the Kings to get a new owner that would keep them in Sacramento”\n\n*one finger on a monkey paw retracts*",
    "235": "🏀 #NBA\n\nSacramento Kings 🆚 Los Angeles Clippers\n📆 Jue 2 dic 04:40\n\n#Raspibets #FreePicks #FreeTips #StatBets #SportsBetting #BettingTipster #Kings #ClipperNation\n🆓🔎📈⬇ https://t.co/kopPov8DiH",
    "236": "@FCartoscelli3 I’ve covered both @oneMG_ &amp; @JvoChristian_ when they played for @SacHornetsMBB. The @sacstate alums are now on the @StocktonKings roster, and can definitely make the @SacramentoKings a much, much better basketball product that Head Coach @AlvinGentry is meaningfully looking for.",
    "237": "@KCRAdapper Michelle, two guys that we know well that will get it done are both @oneMG_ and @JvoChristian_. The @SacHornetsMBB alums are on the @StocktonKings roster under Head Coach @thebobbyjackson. It would sure be nice if they were under Head Coach @AlvinGentry, and the @SacramentoKings.",
    "238": "This morning I listened &amp; participated in 3️⃣ hours of the @CarmichaelDave Show with @JayMarZZ on the @Sports1140KHTK YouTube Channel. It was a very interactive 3️⃣ hours of KingsAholics Anonymous, and a way to vent about the @SacramentoKings while heading to tonight’s game in L.A.",
    "239": "@LakersNation @Trevor_Lane Homie beat the Detroit pistons and the Sacramento kings with 3 hall of famers.\n\nDefinitely not.",
    "240": "To my #1 podcast of 2021, Locked On Kings - Daily Podcast On The Sacramento Kings: thank you for keeping me company on @Spotify all year long! #SpotifyWrapped https://t.co/SGUUdLSpiS \nShout out @MattGeorgeSAC for the quality content on a not so quality team",
    "241": "@j_sepan5ki @SacramentoKings He watched the game with all his heart https://t.co/sHQT4P3dCY",
    "242": "@LAClippers @SacramentoKings @BallySportWest @NBATV @AM570LASports @TuLigaRadio @AguaCalientePS Clippers wake up. Come out to play a the Kings are 8-14. Clippers come out to playaaa my over &amp; under can't take this it all season...🏀😪🏀.",
    "243": "Proud to join with @SacramentoKings to open these community basketball courts. https://t.co/EsJMZOyksB",
    "244": "@LAClippers @SacramentoKings @BallySportWest @NBATV @AM570LASports @TuLigaRadio @AguaCalientePS Clippers Win #InGodsName 🙏🙏☝️☝️",
    "245": "I think Charles’s take on @SacramentoKings last night on @NBAonTNT was about the meanest thing that could be said of a team.  But true. \n\n@TimMaxwell22 @thekingsherald @JillAdge @momoragan @SHAQ @CarmichaelDave \n#saveusbensimmons",
    "246": "@LAClippers @SacramentoKings @BallySportWest @NBATV @AM570LASports @TuLigaRadio @AguaCalientePS Pls win Im begging",
    "247": "They aren't getting SHIT for sympathy about 5 years of losing from a SINGLE Sacramento Kings fan\n\nIf that's their mentality, then they didn't really care to fix this in the first place. \n\nbye. https://t.co/DgEWm0OLzu",
    "248": "Imagine being a Sacramento Kings fan….🤮🤮",
    "249": "Lakers' LeBron catches COVID:  Lakers star is put into NBA isolation and misses victory over Sacramento Kings as his season goes from bad to worse \nhttps://t.co/xQ1YlxVLbA via @MailOnline",
    "250": "@PickDawgz Millz Young 151\n#1 Washington state -2  (-110)\n#2 Dallas Mavericks -3.5 (-110)\n#3 Sacramento Kings vs La clippers over 216.5 (-110)\n🚨🚨Millz money pack 💵📦 \n#PickDawgzCapperContest @PickDawgz https://t.co/3DuF6yCyfN",
    "251": "@ClipsUniTracker @SacramentoKings @LAClippers @cryptocomarena The black ones are cursed",
    "252": "@HeuristicLineup To any Vivek that thinks Kings fans of Sacramento people are just going to show up and watch trash basketball\n\nIt's not happening. \n\nThe seats will stay empty.\n\nAnd eventually the league will step in. because, thats what they do to bad owners.",
    "253": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns That show is garbage.",
    "254": "#LOSANGELESCLIPPERS\n\nNicolas Batum\nJason Preston\nKawhi Leonard\n\n#SACRAMENTOKINGS\n\nHarrison Barnes  - Doubtful  (Game Time Decision)\nMaurice Harkless  - Doubtful  (Game Time Decision)\nMarvin Bagley III  - Doubtful  (Game Time Decision)",
    "255": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns If it ain’t the Cowboys, Lakers/LeBron, or Tom Brady, it’s not important to Skip or Shannon. Period.",
    "256": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns Even though I love the Lakers the lack of recognition and respect for the Suns makes no sense. I think y'all are going to ignore some talking heads and just keep winning.",
    "257": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns Well the first problem is you turned on Undisputed. @dpshow and @RichEisenShow both talked about the Suns/Warriors at the top of their shows.",
    "258": "GAMEDAY!\nDIA DE CLIPPERS!\n \n🆚 @SacramentoKings\n⏰ 00:30\n📺 League Pass\n🚑 Kawhi, Batum, Preston\n#ClipperNation\n https://t.co/QsXKAz5IiT",
    "259": "The positive results came hours before the Los Angeles Lakers were set to face the Sacramento Kings.\n\nHe will have to quarantine away from the team for 10 days or until he can submit two negative COVID-19 tests.\n\nhttps://t.co/ul1jZNktCs",
    "260": "Imagine how embarrassing it is when someone asks u what ur fav team is and u have to say Sacramento kings",
    "261": "⛴Clippers vs Kings Preview⛴\n\n🏀Hoping the defense shows up vs Sacramento \n\n⛴Clipper fans vote on if the team should make a trade \n\n🏀Deep dive into Paul George’s heavy pick and roll responsibilities \n\n🐶 https://t.co/BDqqSixUTp\n\n🍎 https://t.co/P2YtFdtyYA https://t.co/tQsNQUFqQk",
    "262": "otherwise. Especially with a team that is playing back to back games like the Sacramento Kings tonight who played the Lakers last night. \n\nThis system is 6-3 ATS in the 1H this season hitting 70% of winning bets. \n\nIf you’re interested in following this, take the Kings 1H. https://t.co/5eAmXYEHQ3",
    "263": "@Sacto_King_UK @SacramentoKings I love how this included “puddles of their own vomit” 😂😂👏👏",
    "264": "@LAClippers @SacramentoKings @BallySportWest @NBATV @AM570LASports @TuLigaRadio @AguaCalientePS Yessir",
    "265": "Midweek hoops!\n\n🕢 7:30PM PT \n🆚 @SacramentoKings \n📺 @BallySportWest, @NBATV \n📻 @AM570LASports, @TuLigaRadio https://t.co/LjXnjJ2rq8",
    "266": "The Clippers look to snap their two-game skid tonight at home against the Sacramento Kings. @RalstonDacanay with the preview:\n\nhttps://t.co/BERP2rN6iI",
    "267": "@SeanCunningham Sacramento should be apologizing to you. For having you coach the worst team. They should of kept the Monarchs least they had a Championship why they were in Sacramento. The kings had 3 arena's and there still losers. Where's the next coach lol 😂😂😂 https://t.co/91FgaMiqsd",
    "268": "@SacramentoKings \n\nI don’t ask for much.. https://t.co/ogDiwln8P6",
    "269": "@PublicHealthJoe @Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns Yes I did closet I’ve gotten to a hole n 1  once again I like the suns . it was so awesome for my team to go against such a great Organization and good people but I’m a Bucks fan just like you are a suns fan",
    "270": "@RussRingSeason And I wasn’t going to the Sacramento Kings franchise, you bandwagon jumper to be passed around to all 30 NBA teams like a cigarette.",
    "271": "@ChewieWoolf @SacramentoKings @nbatopshot @_Puzzlepiecedad @gold35rush @bflewis3 @KyleDeming1 @SacTown41681629 Suns fan in West Sac 🤠 TS: wetlikeimbook1224",
    "272": "Analyzing Wednesday’s Sacramento Kings at Los Angeles Clippers odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/vaXbJJJrsu",
    "273": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns They are all suns haters",
    "274": "Sacramento Kings at Los Angeles Clippers odds, picks and prediction https://t.co/zvsWHIsMx8",
    "275": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns A big reason Shannon have that job is to talk about Lebron James all day. It’s what he gets paid to do. I don’t even listen to that show anymore. Just a drunk show. https://t.co/5FHbykuVtU",
    "276": "Sacramento Kings players’ accuracy on wide-open three-pointers this year:\n\nDavis - 1/22 (4.5%)\nMetu - 6/30 (20%)\nHarkless - 5/23 (21.7%)\nFox - 7/30 (23.3%)\nMitchell - 15/56 (26.8%)\nHaliburton - 18/51 (35.3%)\nBarnes - 20/54 (37%)\nHield - 26/69 (37.7%)",
    "277": "@lavurty Or if he was trying to use a team from another sport, the Sacramento Kings, the Colorado Rockies, etc.",
    "278": "@SeanySikkStikks The @SacramentoKings Kings’d.",
    "279": "Some days I wanna swap teams and stop supporting the @SacramentoKings . I love this team so so much but this franchise hasn’t changed in 15 years and every player on our roster looks unmotivated to play for the franchise. Can you blame them tho? 🙃🙃",
    "280": "LeBron James has tested positive for COVID-19 this afternoon and will miss several games including tonight’s game against the Sacramento Kings due to NBA health protocols. https://t.co/IKakkcWnrF",
    "281": "@SacramentoKings @Rich_Holmes22 I think we all knew Walton wasn’t the only problem with the kings …still the right decision…been trying not to say this…but…fox is just a huge disappointment…IF we can trade him I would…except for Holmes it’s just a huge mess really",
    "282": "Let me fix it for you….he’s been nonchalant since he’s been a Sacramento King! No 🧢 https://t.co/uKonwZRMZN",
    "283": "Sports: LeBron James has tested positive for COVID-19 and was ruled out for the Los Angeles Lakers’ game against the Sacramento Kings on Tuesday night. https://t.co/QPb2JrI8Ta",
    "284": "Los Angeles Lakers guard Malik Monk gave credit to his teammates after dropping 22 points off the bench against the Sacramento Kings.  https://t.co/Kwc59zxN2P",
    "285": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns Today on ESPN - Should the warriors be worried about the Suns. 😂 \n\nUhh YaH! You just got beat by a Bookerless Suns. The streak is at 17 let’s get 18. 🙌🏼",
    "286": "@Loustafer @SacramentoKings @sactownroyalty @thekingsherald Hali and mitchell been playing very poorly....why are they safe??🤣",
    "287": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns It’s ridiculous",
    "288": "@ChewieWoolf @Libruary_NFT @nbatopshot @SacramentoKings @Lakers @Golden1Center @TheJurassicPack Hope you're in Fox moment! He is 🔥",
    "289": "@TimMaxwell22 “The NBA Should Contract And Delete The Sacramento Kings”",
    "290": "I won't be planning on or setting aside time to watch this Sacramento Kings team play anymore. \n\nIf I happen to catch it while its on, I'll watch. But I'm not changing around my work schedule for this shit anymore. \n\nIf they don't care, I don't care.",
    "291": "LeBron James has tested positive for COVID-19 and was ruled out for the Los Angeles Lakers' game against the Sacramento Kings on Tuesday night.\n\nhttps://t.co/xCw9Hve55V",
    "292": "@Libruary_NFT @hbarnes @TyHaliburton22 @hoopculture13 @SacramentoKings @ChewieWoolf @nbatopshot Yo, great to see this as a @SacramentoKings fan :)",
    "293": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns Typical. Why give them the time of day?",
    "294": "@Mistahbroooooks @SacramentoKings @nbatopshot @_Puzzlepiecedad @gold35rush @bflewis3 @KyleDeming1 @SacTown41681629 @th3otherAJ @theejudd2010 @charlepacman @th3otherAJ @theejudd2010 @charlepacman Follow up!",
    "295": "LeBron James has tested positive for COVID-19 and was ruled out for the Los Angeles Lakers' game against the Sacramento Kings on Tuesday night. https://t.co/jDZUrtIgFK",
    "296": "@SacramentoKings @TheDougChristie Oooh I need that",
    "297": "@Jumpshot8 @Blazyface93 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns Awful and I’m a laker fan and was like wtf lol",
    "298": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns No respect for Suns &amp; Cards",
    "299": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns espn today https://t.co/uZ0c5olqoF",
    "300": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns #nba @Suns Sorry Mr Sharpe but there is real basketball taking place outside of the “HollywoodFakers”.. Talk about not doing your homework and realizing that there is civilization outside of Los Angeles",
    "301": "@jimrome - CALL TIME OUT!! Did I just hear Sacramento and Kings in seg. 1?!? War Doug Christie getting the head gig. @Producer_Tom",
    "302": "@markpv314 @SacramentoKings @nbatopshot @_Puzzlepiecedad @gold35rush @bflewis3 @KyleDeming1 @SacTown41681629 Follow up",
    "303": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns What’s the best alternative to ESPN and Fox? I get depressed going on there.",
    "304": "Sacramento media has given up on the Kings this season, and the fanbase is killing me. There's so much negativity around this team. Justtalking to fans is exhausting. We literally have an interim coach, we're full of guards who can't shoot and no wings. Yes, we suck.",
    "305": "Uniforms for today's matchup between the Clippers and Kings\n@SacramentoKings Association ⚪️\n@LAClippers Statement ⚫️\n🕢 7:30 PM PT\n🏠 @cryptocomarena \n📺 Bally Sports SoCal\n#ClipperNation https://t.co/MDaXCycLmM",
    "306": "I’m unfollowing @SacramentoKings since this organization no longer appreciates its fans…similar to 2004 when I cancelled my beloved seats at Arco when the organization signed Greg Ostertag 🤢 #kangz",
    "307": "@PublicHealthJoe @Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns You win I agree good points just a fan of good basketball",
    "308": "Sacramento Kings vs Los Angeles Clippers 12/1/2021 Picks Predictions Previews\n\nhttps://t.co/g9AQFlPmkB\n\n#NBAprediction #NBA #NBApicks #NBAparlay #NBAbetting #sportsbetting #handicapper #sportspicks #odds #picks #freepick #freepicks #basketballpicks #expertpicks #Kings #Clippers https://t.co/tIRUSIWVVX",
    "309": "@AndrewTrujillo5 @Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns Don’t forget they might spend 5 minutes talking about how they aren’t sold on the suns or the cardinals!",
    "310": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns WITHOUT BOOKER! Yeah they have talk all Lakers and Cowboys first because the don’t want to offend the big market teams!",
    "311": "@Ballislife @SacramentoKings @TheDougChristie that guy looks like rick fox",
    "312": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns Bad boys move in silence.",
    "313": "Shannon Sharpe on Lakers win over Kings: “This told me they can play defense when they want to” #LosAngelesLakers #SacramentoKings https://t.co/H156CmaEDz",
    "314": "@Ballislife @SacramentoKings @TheDougChristie doug christie fell off the nba because he was too much of a pussy to stand up to his high maintenance wife",
    "315": "✨ Famous Followers\n\n🥇 Panthers\n🥈 Cubs\n🥉 SacramentoKings\n🏅 ZachBoychuk\n🏅 Canes\n🏅 sneerid\n🏅 UncleDrewGB\n\n➡️ https://t.co/WcBs9UtyoL https://t.co/Py90RbhonL",
    "316": "@TheNBACentral Need buddy on the Cs. Cmon @SacramentoKings blow that shit up already   We got great value buddy nesmith rotting on the bench",
    "317": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns They are LA centric and also dwell on the Cowboys and Cleveland Browns. Very little mention of the Suns or Cardinals.",
    "318": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns Then after that segment they probably talked about the Cowboys for 30 min.",
    "319": "No one can rant about the Sacramento Kings' failings quite as well as @TimMaxwell22 can https://t.co/0tGyYfLxXB",
    "320": "Down 14 with nine minutes left in the 3rd, #Lakers play actual defense, and outscore the Sacramento Kings 65- 26 the rest of the way to win, 117-92.\n\nThey do not win that game without #DwightHoward, who played like Superman in 35 minutes.\n\n#NBA\nhttps://t.co/u0NR8M0qyd",
    "321": "@Ballislife @SacramentoKings @TheDougChristie Did his wife approve this t shirt 👀👀😂😂😂",
    "322": "@collazo530king @SacramentoKings Sorry to hear that. Stay positive y’all get through this slump. Go birds",
    "323": "@Vivek @mmcnair @AlvinGentry Instill leadership in your team. I feel like the @SacramentoKings is a grad school assignment and how would you implement successful change and what leadership is necessary to get there. And define barriers and how to overcome them 🤔 https://t.co/0T6FCieKaJ",
    "324": "The team, this roster, cannot be rescued. \n\nThey cannot be resuscitated. \n\nThey cannot be changed.\n\nThey don’t care enough.\n\nThe Sacramento Kings are fundamentally broken.\n\nhttps://t.co/XRDfegw7kf",
    "325": "LeBron James entered the NBA’s COVID-19 health and safety protocols yesterday and missed the Lakers’ 117-92 win against the Sacramento Kings last night.\n\nAnthony Davis said he spoke with James and that his teammate told him he was “asymptomatic.”\n\nhttps://t.co/2T3n6neYfM",
    "326": "@RyanWardLA If only the Lakers could play the Sacramento Kings 6 more times this season.",
    "327": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns Win something and they’ll talk.",
    "328": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns You STILL butt hurt about the media coverage? #Cute #MoveOutThaBasement",
    "329": "The Sacramento Kings are broken https://t.co/DpXE6PFTJj",
    "330": "@PublicHealthJoe @Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns My team did win 18 in a row and we didn’t do shit when the playoffs came around   We will see we got what 5 months to go till we crown a champ slow down let the season in fold I like the sun",
    "331": "@sam_amick Can you please write an article that fixes the Sacramento Kings?  \n\nThanks.  I would greatly appreciate it.",
    "332": "@ChewieWoolf @Libruary_NFT @nbatopshot @SacramentoKings @Lakers @Golden1Center @TheJurassicPack I ripped this at Kings game yesterday. Much better than 2nd half action. https://t.co/mSD8RG31eJ",
    "333": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns 😂😂 yep, sounds about right!!",
    "334": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns Nobody understood it dum dum. Yeah I can see you and Shannon tripping over each other to kiss the ring first...🤣🤣🤣",
    "335": "🏀 Los Angeles Lakers (@Lakers) #LakeShow\n🆚 W 117-92 @ Sacramento Kings #SacramentoProud #LALvsSAC\n✈️ N663DN | DAL8929 | B752\n🛫 SMF - 11:33 pm PT\n🛬 LAX - 12:33 am PT\n📡 Tracking: https://t.co/hpShkUyeN2 https://t.co/Yu23r2diPH",
    "336": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns Sounds about right smh",
    "337": "LeBron James has tested positive for COVID-19 and was ruled out for the Los Angeles Lakers' game against the Sacramento Kings on Tuesday night.\nhttps://t.co/JSN4SCUkfo",
    "338": "Lebron James Has Tested Positive For Covid-19 And Missed Tuesday Night’s Game Against The Sacramento Kings https://t.co/RhniUeg9gY",
    "339": "@LakersNation I don’t understand how the Lakers got down by 9 points in the 1st place. Last the NBA ranked the Sacramento Kings the #1 worst defense in the NBA. There have been no drastic roster upgrades.",
    "340": "@ATLHawks vs. @Pacers \n@nuggets vs. @OrlandoMagic \n@Timberwolves vs. @WashWizards \n@sixers vs. @celtics \n@cavs vs. @MiamiHEAT \n@hornets vs. @Bucks \n@dallasmavs vs. @PelicansNBA \n@HoustonRockets vs. @okcthunder \n@SacramentoKings vs. @LAClippers",
    "341": "At least we have “Slamson” #sacramentokings… he gets it done every night… https://t.co/8Hg1xL5K2w",
    "342": "@johnnyoplaya64 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns Stoop",
    "343": "@johnnyoplaya64 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns You didn’t understand my tweet dude. You have no clue.  I love @ShannonSharpe",
    "344": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns Of course they did EJ. Completely on brand. I’d have been shocked if they didn’t. #bringonthehaters",
    "345": "@JillAdge Don't give your 💰 to the @SacramentoKings Don't attend the games, then maybe they might put a better product on the floor. Hit them in their pockets",
    "346": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns You expected something different? Lol. If there is anybody swinging harder from LBJ's jockstrap than you it's Shannon Sharpe. Duh? Are you gonna whine the whole season? Hopefully this just a few senior moments.",
    "347": "@DRaddatz0 @Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns @FirstTake Hornets and Memphis beat them too but you don’t go around saying they clamped Curry and made him play poorly… Mikal played great defense (not taking anything away from me) but let’s not be too crazy and you also have to accept an off night from Curry.",
    "348": "@YeeiGo530 @SacramentoKings Most likely with this garbage franchise I’m getting to the point where I don’t even care anymore….",
    "349": "@DRaddatz0 @Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns @FirstTake I think some of it is excuses but they also had valid points. Do You think Curry will go 4/21 everytime they play against Suns? Or GSW will have 23 TOs? And this was still a close game until 1 mins mark. Yes, Booker was out for 2nd half but Klay isn’t playing either.",
    "350": "@Libruary_NFT @hbarnes @TyHaliburton22 @hoopculture13 @SacramentoKings @ChewieWoolf @nbatopshot Hope u both enjoyed",
    "351": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns Talk to ya boys EJ! 😤",
    "352": "Doesn’t count as a W in the win/loss column but I genuinely appreciate Alvin’s sincerity here. Can’t recall any coach saying this let alone with an interim title. Thank you, Coach, for acknowledging what we are all feeling. @SacramentoKings @CarmichaelDave https://t.co/53FGSM778T",
    "353": "@_JasonLT The NBA ranked the Sacramento Kings the worst defense in the NBA, they haven’t improved much so this was the perfect team to play if you don’t have Lebron.",
    "354": "Since their 5-4 start, the Sacramento Kings:\n\nLoss\nLoss\nLoss\nLoss\nWin\nLoss\nLoss\nLoss\nLoss\nWin\nWin\nLoss\nLoss\n\nThree wins, ten losses.",
    "355": "Houston Rockets vs Oklahoma City Thunder\nSacramento Kings vs Los Angeles Clippers\n#NBA2022",
    "356": "@DarrellColema20 @Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns yup i already see that happening.. 🤪",
    "357": "@ChewieWoolf @SacramentoKings @nbatopshot @_Puzzlepiecedad @gold35rush @bflewis3 @KyleDeming1 @SacTown41681629 I may not be a superfan like most all of you, but Sacramento Kings has been one of my teams in the west (I usually pick two for each conference when the season starts) for so many years. \n\nHope you include me in your list. 😅",
    "358": "@lococard777 @Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns damn its december..",
    "359": "@collazo530king @SacramentoKings Another 10 years without payoffs ? yikes!",
    "360": "NBA on Dec 1st . \n\nReverse line Movement in Game Total \n\n1. Under 217.5 \n(555) Sacramento Kings @ (556) L.A. Clippers\n\n2. Under 206.5 \n(545) Philadelphia 76ers @ (546) Boston Celtics\n\nFull Unit on each, also if any of these totals increase up by 2 points 1/2 unit will be placed.",
    "361": "LeBron James didn't play in the Lakers game against the Sacramento Kings on Tuesday as the NBA superstar has been placed in the league's health and safety protocols.\n\nJames is vaccinated for COVID and it is unclear if he tested positive for the virus. https://t.co/WgRqBoZgVV",
    "362": "What do the @SacramentoKings do during halftime? They need to focus and meditate, pray, something to keep them locked in. These Kings are basically the walking definition of erectile dysfunction, physically unable to finish. #disgustedkingsfan",
    "363": "LeBron James Out of Sacramento Kings Clash After Entering COVID-19 Protocols https://t.co/0evx1lFXaD",
    "364": "@RockTheBabyRuss @Lakers @russwest44 @WayneEllington No thanks. 😀😀😀\nLast season the Sacramento Kings were ranked by the NBA as the worst defense in the NBA, basically no upgrades. I wanted the total opposite of Lebron James = veteran’s minimum point guard as a BALL MOVER.",
    "365": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns Trash",
    "366": "Sacramento Kings forward Tristan Thompson (who is 🇯🇲) began a relationship with IG model Jordan Craig (also 🇯🇲) sometime around 2015. Jordan was once married to rapper Tyga before meeting Tristan. Her and Tristan had 1 son together before their split in 2016. https://t.co/r4xDZujnZE",
    "367": "@Mistahbroooooks @SacramentoKings @nbatopshot @_Puzzlepiecedad @gold35rush @bflewis3 @KyleDeming1 @SacTown41681629 @th3otherAJ @theejudd2010 @charlepacman yoooo thank you for responding and tagging. I have followed them all",
    "368": "LeBron James has tested positive for COVID-19 and was ruled out for the Los Angeles Lakers’ game against the Sacramento Kings on Tuesday night. https://t.co/ACwuDgED4W",
    "369": "The Los Angeles Lakers' star player, who is vaccinated, didn't suit up in Tuesday night's game against the Sacramento Kings.\n\nhttps://t.co/YYbBeOJMlM",
    "370": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns Typical  . Not a surprise.  It's all good though.",
    "371": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns Exactly.  That was ridiculous.  Total joke.  @Lakers favoritism is sickening.",
    "372": "Houston Rockets x OKC Thunder\nNBA LEAGUE PASS\n\n00:00 – 🏒NHL\nVegas Golden Knights x Anaheim Ducks\nSTAR+\nPittsburgh Penguins x Edmonton Oilers\nSTAR+\n\n00:30 – 🏀NBA\nSacramento Kings x LA Clippers\nNBA LEAGUE PASS",
    "373": "@Itz_Me_T @Golden1Center @SacramentoKings Yea i ate that shit last night my last bite tasted molded an my stomach been hurting since",
    "374": "@BeeTatted916 @Golden1Center @SacramentoKings Oh hell no",
    "375": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns @Jumpshot8 Eddie we should be numb to the fact that national media has no idea where Phoenix is even located.",
    "376": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns They would have to lead off by crucifying Stef  and his awful performance last night…they ain’t gonna cut their own throat on the golden child",
    "377": "@PickDawgz Saetae #302\nPick #1 NBA/ Philadelphia 76ers +2.5\nPick #2 NBA/ New Orleans Pelicans +2.5\nPick #3 NBA/ Sacramento Kings +7.5",
    "378": "As a @SacramentoKings fan I’m really tired of watching this team dribble the ball down the court and post-up at the 3 point line . The only one who cuts to the basket is Holmes. Not every team can shoot the 3 like the Warriors! #gotothehoop",
    "379": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns They are a joke The Suns deserve top billing, and I'm a Dubs fan fwiw.",
    "380": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns It’s alright EJ, we don’t need their love. Let’s keep rolling with or without em!",
    "381": "@PokerProErik @Libruary_NFT @nbatopshot @SacramentoKings @Lakers @Golden1Center @TheJurassicPack I don't have an iPhone... no @Seussibles for me",
    "382": "@Ballislife @SacramentoKings @TheDougChristie I need that!",
    "383": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns We are only the 11th largest media market. Only half that market are Phoenix fans. Media runs on views and clicks so most their time is talking about bigger markets. It’s not a diss. It’s the game. Also, it’s not 1986 so there are plenty of other outlets to talk AZ sports. Relax",
    "384": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns Bet the following 25 minutes they talked about the Cowboys.🙄🙄🙄",
    "385": "What you look like after you eat molded nachos at @Golden1Center @SacramentoKings before the game! I feel your pain fox they got me to https://t.co/ecAnbUEQoh",
    "386": "@PokerProErik @SacramentoKings @nbatopshot @_Puzzlepiecedad @gold35rush @bflewis3 @KyleDeming1 @SacTown41681629 @Libruary_NFT it is his westcoast team 😉",
    "387": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns @ShannonSharpe that’s trash man.",
    "388": "🚨CALLING ALL @SacramentoKings FANS and/or LOCAL SACRAMENTO AREA @nbatopshot COMMUNITY!🚨\n\n📢ROLL CALL🤲\n\nPlease let me know! RT &amp; @ tag people so I don't miss anyone. For a long time I have been trying to curate a list together. Help is appreciated.  #SacramentoProud https://t.co/J6mak06dOX",
    "389": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns We get zero respect!! But we dont need it!!! Both our Cards and Suns get none! They hate we are good!!! \"Started from the bottom now we here\"! These 2 are the future and they hate it!!! https://t.co/ez5cOMwpu6",
    "390": "“You do not deserve this. You deserve much, much better.”\n\n- Kings HC Alvin Gentry message to Kings fans following Sacramento’s loss to the Lakers last night https://t.co/EeG13WzymE",
    "391": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns Ratings Eddie, America loves/hates Lebron and the Cowboys the most",
    "392": "@Libruary_NFT @ChewieWoolf @hbarnes @TyHaliburton22 @hoopculture13 @SacramentoKings @nbatopshot I wish I had seen this in time. I would have said hi.",
    "393": "Sacramento Kings vs. Los Angeles Clippers Preview (12/01/2021)\n\nhttps://t.co/eJemN7fDcC\n\n#Kings #Clippers #bettingadvice #bettingexpert #bettingpredictions #NBAbetting #realphilreal #sportshandicapper https://t.co/VuPfgl7Fli",
    "394": "How is Sacramento? Lol… the Kings tickets got to be dirt cheap, that arena be empty. I might go out there next time the Lakers in town lol.",
    "395": "I feel bad for Sacramento Kings fans that have season tickets. Cancel them bitches. Get something nice for y’all’s families this Christmas with the money you spend on that sorry ass team.",
    "396": "@Jumpshot8 @Patsnation87 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns Omg I had to turn it off. How ridiculous!!!",
    "397": "DasHaus made a bet!\n\nEvent: Sacramento Kings vs Los Angeles Clippers #NBA\nBet: Los Angeles Clippers TO WIN -7\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "398": "DasHaus made a bet!\n\nEvent: Sacramento Kings vs Los Angeles Clippers #NBA\nBet: Sacramento Kings TO WIN +7\nOdds: 2.000 (+100)\nWager Cap: 0.00025 #bitcoin\n\n#sportsbetting #betting #sportspicks #gamblingtwitter #gambling",
    "399": "Fan Thrown Out Of Tristan Thompson Sacramento Kings Game For Insulting The Kardashians https://t.co/m5sVeVS4KH #KeepingUpWithKardashians #KhloeKardashian #TristanThompson",
    "400": "@ChewieWoolf @Libruary_NFT @nbatopshot @SacramentoKings @Lakers @Golden1Center @TheJurassicPack Haha I would definitely have to say the same",
    "401": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns Your fault for turning on that garbage",
    "402": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns Disrespectful do better @undisputed @ShannonSharpe",
    "403": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns I can't believe Skip and Stephen A have jobs, their takes are soooooo ass-inine. They built up this outrageous sports talk platform with no substance and their brand is basically say stupid stuff and double down and never take accountability.",
    "404": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns ESPN is 🗑 and has been for years.",
    "405": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns Exactly why I never watch any of those shows. Those dudes are clowns and for the most part don't even know what the hell they're talking about.",
    "406": "Man the Lakers must be some kinda garbage if the coach of the Sacramento Kings has to issue a public apology for losing to them 😂😂😂",
    "407": "@OmerEats @Libruary_NFT @nbatopshot @SacramentoKings @Lakers @Golden1Center @TheJurassicPack man... last night was a total tale of two halves. I'd have to wait &amp; see what the rosters look like when the next game happens before I bet on my Kangz. I",
    "408": "LeBron James has tested positive for COVID-19 and was ruled out for the Los Angeles Lakers' game against the Sacramento Kings on Tuesday night. https://t.co/T3DZSbd32v",
    "409": "LeBron James has tested positive for COVID-19 and was ruled out for the Los Angeles Lakers’ game against the Sacramento Kings on Tuesday night. https://t.co/4eWStpY4o3",
    "410": "@SacramentoKings start explaining 🤦🏾‍♂️ https://t.co/mcrg13uVU4",
    "411": "@ChewieWoolf @Libruary_NFT @nbatopshot @SacramentoKings @Lakers @Golden1Center @TheJurassicPack Moment wager next Kings Lakers game?",
    "412": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns @suns are the worst nightmare for @espn",
    "413": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns it's a Cowboy and Lakers lead broadcast, mostly . But Shannon is hilarious.",
    "414": "The Los Angeles Lakers overcame a double-digit deficit in the second half to defeat the Sacramento Kings. Final 117-92 #LALvsSAC \n\nAnthony Davis scored 25 points, Russell Westbrook added 23. While LeBron James sits out due to testing positive for the Covid-19. https://t.co/cNURwdjAxe",
    "415": "LeBron James Out of Sacramento Kings Clash After Entering COVID-19 Protocols https://t.co/Y8oUqvhB40",
    "416": "#NBATopShotThis\nGreat times with @Libruary_NFT rippin' @nbatopshot PAX at the @SacramentoKings @Lakers @Golden1Center game.\n#SacramentoProud @TheJurassicPack https://t.co/iOQg3AFPJB https://t.co/HVKNou5GkG",
    "417": "Encerrado:\n\nSacramento Kings (8-14) 92 x 117 (12-11) Los Angeles Lakers\n\nLAL 📊\nAnthony Davis: 25PTS/7REB/3AST/2STL/2BLK\nRussell Westbrook: 23PTS/5REB/6AST/1STL\n\nSAC 📊\nRichaun Holmes: 27PTS/9REB/2AST/2BLK\nDe'Aaron Fox: 17PTS/5REB/5AST/2STL\n\n#NBA https://t.co/7Cuvcpa8nd",
    "418": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns All they talk about is the cowboys and Lakers it's nauseating",
    "419": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns NO NEED TO WATCH DAT GARBAGE 🗑",
    "420": "BLOW IT UP @SacramentoKings @sactownroyalty @thekingsherald \n\nFOX\nBUDDY \nBARNES\nBAGLEY \n\nKey pieces to keep: Hali , Mitchell, Holmes",
    "421": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns That show is trash like the rest of them @undisputed @FirstTake @TheHerd national sports media sucks",
    "422": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns Own those bozos",
    "423": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns Your first mistake was turning that show on!😂",
    "424": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns It's Cowboys and Lakers all the time.",
    "425": "Even Twitter doesn’t know what the Sacramento Kings do … lol on to the next! Go Kings! https://t.co/m3spHZoG8H",
    "426": "Los Angeles Lakers star LeBron James tests positive for COVID-19 and will miss the team’s matchup against the Sacramento Kings.  https://t.co/4L8DwNaDFp",
    "427": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns That’s what they talk about EVERY DAY, if it’s not Lebron, it’s the Cowboys!",
    "428": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns Who can listen to that Fox Sports gibberish?",
    "429": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns @FirstTake isn’t much better. They lead with the game but it’s all making excuses for the Warriors and how “the Warriors WILL get their revenge Friday” SMH",
    "430": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns Because they producers map out what's gonna be talked about before they start. ESPN pushes it's anchors to talk about Lebron James and LA Lakers. Ask Paul Pierce he will tell ya LBJ 20+ times or more a day.  @paulpierce34",
    "431": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns Steph Curry didn't win, so they want to focus on popular teams for us common folk. Not many people are Suns fans. \n\nSame reason CP3 is getting zero love for MVP, yet Curry is running away with it.\n\nNarratives.",
    "432": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns Unbelievable",
    "433": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns Skip and Shannon are barely sports talk EJ. Not gonna be much real basketball talk there at all",
    "434": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns Then they followed up with a segment about the Cowboys",
    "435": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns C’mon Unc @ShannonSharpe What’s up with that?",
    "436": "The Los Angeles Lakers picked up win No. 12 on the year in a road blowout of the Sacramento Kings.  https://t.co/QUWtmXwyjP",
    "437": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns Then followed it up by talking about the Cowboys😂😂😭",
    "438": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns Shannon is secretly in love with the Lakers. He can’t help himself.",
    "439": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns Suns fans are in a good spot.  They can cheer about beating the Warriors without Booker, and when Golden State wins Friday, Suns fans get to say bbbbbut we were missing Booker.",
    "440": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns Said the same thing lol, they're all excited about the Lakers coming back from 14 down lol, smdh.",
    "441": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns No need to turn on that disaster of show.  It's the same ish everyday there.",
    "442": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns So right @Jumpshot8 , Suns/W’s was early game of year…Mikel  Bridges catapults to A Defensive Player of Year Candidate, Can’t wait to be there tomorrow night to see @Suns break the Win Streak record! 18!! #ValleyProud",
    "443": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns Theres a group of people at espn that give honest opinion about Suns JJ Redick K Perkins Malika Andrews",
    "444": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns Ur really a good ambassador for ur team but stop man it’s not even Christmas yet the nba should stop now and crown y’all in ur mind",
    "445": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns It's unreal  12-11 &amp; 12-14 record teams get almost a half hour of air. Teams fighting CONSISTENTLY for the 8th seed in the west while 1 &amp;2 played a fantastic game against each other &amp; rematch Friday but when they get to it they will probably spend 5 min saying it's a 2 day crown",
    "446": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns Sounds about right.",
    "447": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns Talking about how they’ll go over Stephs worst performance “wasn’t his best” 🙄",
    "448": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns Eddie’s first mistake was tuning into Undisputed and expecting anything other than LeBron talk..",
    "449": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns Typical",
    "450": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns It's a joke.",
    "451": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns Not surprising happens to every az team",
    "452": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns Live look at @espn https://t.co/m6LJhaiTkK",
    "453": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns Eddie it seems like this happens all the time to any Arizona team",
    "454": "Unreal. You beat the Sacramento Kings, and it's a lead story over the two best teams in the Association? \n\nC'mon, man! https://t.co/sZ601eog9F",
    "455": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns That show is about LeBron, Dallas Cowboys and Tom Brady…will not get anything else.",
    "456": "I’m a Sacramento Kings fan. You talk about misery. 🤦🏾‍♂️",
    "457": "@Jumpshot8 @ShannonSharpe @undisputed @Lakers @SacramentoKings @warriors @Suns I never watch it but today I was inclined to turn it on.. saw the lakers were the lead story and that was enough for me",
    "458": "Lol.I turn on @ShannonSharpe and @undisputed this morning andthey lead off with the @Lakers and @SacramentoKings and talk 20 minutes about two teams that are at bottom of conference standings and no mention of a team that beat @warriors and has won 17 games in a row in the @suns",
    "459": "@CodyAlt @BleacherReport 🙄🙄🙄 what an embarrassment. 40-8 run. I’m done with this team @SacramentoKings",
    "460": "** Reduced: $19.49 - Save $10.50 ** Sacramento Kings Mitchell &amp; Ness Team Ground Snapback Hat - Purple https://t.co/XHauRaQQ5g https://t.co/9bYYuaVzZ4",
    "461": "The Phoenix Suns beat the 17-2 GS Warriors &amp; extended their win streak to 17, in a row. That matches their franchise record, for consecutive wins.\n\nThe leading story on Undisputed is the Lakers beating the Sacramento Kings, who went into last night’s game w/ an 8-13 record…",
    "462": "@CarmichaelDave Respect to Coach Alvin. Monte and Vivek are cowards to apologize to the city of Sacramento and the fans of the Kings. Nothing will change as long as Vivek owns this franchise.",
    "463": "Anyone know if the @SacramentoKings lead the league in blowouts this season? They've got to be in the top 3 at least.",
    "464": "Sacramento Kings are seeking a Stockton Kings Locker Room Attendant - more details here! https://t.co/MH7HnG3DhN",
    "465": "WATCH: Playing without LeBron James, Los Angeles Lakers still punish Sacramento Kings https://t.co/Ga68Z23sBC",
    "466": "WATCH: Playing without LeBron James, Los Angeles Lakers still punish Sacramento Kings https://t.co/hFhdF5OCtZ",
    "467": "Its time for @Vivek to step down as the controlling partner of the @SacramentoKings. It's clear that until the culture of the organization changes nothing will change. Coaches, GM's, Players, Announcers, Trainers have all been replaced. Only one thing remains constant! https://t.co/lhrIKG3Ewa",
    "468": "LeBron James Out of Sacramento Kings Clash After Entering COVID-19 Protocols https://t.co/dAp26xTvAB",
    "469": "@PickDawgz Chris Wright #342 \n\n12/01/21\n\nNBA Philadelphia 76ers +5 -110 \n\nNBA Dallas Mavericks -3 -110 \n\nNBA Sacramento Kings +7.5",
    "470": "Tonight's NBA double-header: \n\nPhiladelphia 76ers @ Boston Celtics tonight at 7:30pm ET on NBA TV. \n\nSacramento Kings @ Los Angeles Clippers tonight at 10:30pm ET on NBA TV. https://t.co/S4MmQeMuKC",
    "471": "@eski225 @Chuck1one @Knickanators @Freekeith @SellDaTeamDolan @LegionOfKnicks @StateNYKPOD @Rick__War @_knicks1688 @queens_dude @KnicksBig15 @Woodshed_1914 @eepdllc @0oty_Mac @BadBadLeroyBro7 @knickloyalty @TMal761 @jfromflorida1 @victorlb03 @J1gg__ @acedghill @IanChisolm @YankeesKnicks99 @EdMemphisPimpin @Not47Buddz @mikenieve @AJTheManChild @BigFreezie @Jukebox3331 @TruePG718 @KembasHome @Trace_AVP @DonaldP47082631 @PreZnyc621 @rahmmagick @Julius_DL @tripleMwassup @NotKnickanator @Sharonchik266 @MikeFromQns7 @DavidBr37616769 @stalling_e @Jmastapiece @SBADJ1 @theline4two @LukeHen09435098 @ToddyWoddy1330 @tre_nite @NYK247_4EVER Hate the Knicks and Love the Mavs bum ass, Hate the Knicks and Love the GSW trash ass, Hate the Knicks and Love the Sacramento Kings dumbass, Hate the Knicks and Love the OKC Thunder stupid ass,",
    "472": "@GrantNapearshow I agree w/you. What are the odds he sells if you were a gambling man? It’s so typical of the @SacramentoKings to beat LA last week in triple OT in LA when they had Lebron &amp; the Kings had no Barnes or Holmes, then reward us all with that performance last night w/LA missing Bron.",
    "473": "NBA ML. Date: 12-01\nSacramento Kings vs Los Angeles Clippers. 0.8%\nFOX Bet. Kings @ +260\nDraftKings. Clippers @ -250\n#arbitrage #bettingtwitter #bettingpicks #sportsbets #freepicks #freemoney #mlb",
    "474": "LeBron James was sidelined by the NBA’s Covid-19 health and safety protocols and, as a result, missed Tuesday’s game against the Sacramento Kings.\n\nRead more: https://t.co/luHHMV79h0",
    "475": "Malik Monk had himself a GAME against the Sacramento Kings 👀🔥\n\n22 POINTS\n4 REBOUNDS\n4 ASSISTS\n8-16 FG\n6-10 3P\n32 MINS\n+33\n\n#LakeShow \n\nhttps://t.co/9kA7ZYXJt5",
    "476": "Chimezie Metu's contract with the Sacramento Kings becomes fully guaranteed if he's not waived today.",
    "477": "WATCH: Playing without LeBron James, Los Angeles Lakers still punish Sacramento Kings https://t.co/IPiiaB8501 #GameScores #NBA #LosAngelesLakers",
    "478": "@springwaterbabi @SacramentoKings You mad cuz I turned $250 into a $4,500 Top Shot collection, ain't ya??? That investment would've covered 6 months rent for ya, huh??? Fuckin baby!!!",
    "479": "LeBron James Out of Sacramento Kings Clash After Entering COVID-19 Protocols https://t.co/0dL5qXMVCE",
    "480": "@JeffBezos, buy the Sacramento Kings.",
    "481": "This week we cover the 2002 western conference finals, to try to determine if it was rigged against the Kings. https://t.co/U9b6OJ04YH\n#basketball #kings #sacramentokings #sacramento #kobe #shaq #nba #lakers #losangeles #losangeleslakers #lakersnation #sports #podcast #funny",
    "482": "This week we cover the 2002 western conference finals, to try to determine if it was rigged against the Kings. https://t.co/foGr79VyZX\n#basketball #kings #sacramentokings #sacramento #kobe #shaq #nba #lakers #losangeles #losangeleslakers #lakersnation #sports #podcast #funny",
    "483": "@springwaterbabi @SacramentoKings Na I got a pretty nice top shot collection too. How's yours going? Or did you need to pay rent?",
    "484": "Los Angeles Lakers' LeBron James is out for Tuesday night's game against the Sacramento Kings due to NBA's COVID-19 health and safety protocols.  https://t.co/BcoV2RHHcF",
    "485": "@patknci just made us realize that the only person truly qualified to coach the @SacramentoKings is Oprah \n#YouGetAWinYouGetAWinYouGetAWin https://t.co/J2v1EZJVhZ",
    "486": "NEW EPISODE ALERT!\n\nWith 20 games down, the guys take a look at some teams that are over-performing or under-performing expectations. From the red hot Phoenix Suns to the dumpster fire that is the Sacramento Kings, the guys give their thoughts on all the hot storylines in the NBA https://t.co/CpHaq0uHBi",
    "487": "@NBA @swipathefox @SacramentoKings Woas trop chaud",
    "488": "Sacramento #Kings at Los Angeles #Clippers |12/1/21 | Free Picks and Prediction \n\n#NBA #NBAPick #NBAPredictions #clippers https://t.co/UHkqIdzrI2",
    "489": "Malik Monk on his big night vs. Kings #LosAngelesLakers #MalikMonk #SacramentoKings https://t.co/XusADetP4d",
    "490": "@mourinGOAT @iire_xx @DanesiNajeeu Congrats on winning the Detroit Pistons and Sacramento Kings 🎉🎉🎉🎉👏👏👏👏👏👏👏👏",
    "491": "Kings’ HC calls Kings’ performance vs the Lakers ’embarrassing’ #AlvinGentry #LosAngelesLakers #SacramentoKings https://t.co/WxnKhJvCnp",
    "492": "Robert Horry reacts to Lakers crushing Kings #LosAngelesLakers #RobertHorry #SacramentoKings https://t.co/Bq2ACUQbsV",
    "493": "@SacramentoKings @Rich_Holmes22 Good morning, Kings fans 😉.",
    "494": "#NBA 🏀 Big Odds!\n⏰Thur, 5:30 a.m\nLA CLIPPERS 🆚 SACRAMENTO KINGS\nDon't Miss some Exciting NBA Games with #MBET !!\n#BestOdds\nVisit 📲https://t.co/b6QVf65vC5 Play Now and Win Big!! https://t.co/ZNBW1d4Bei",
    "495": "@SacramentoKings @TheDougChristie Couldn’t afford Warren Lotas?",
    "496": "Lakers played their best game yesterday against Sacramento Kings.",
    "497": "San Francisco:: Photos from the Sacramento Kings’ loss to the Los Angeles Lakers at Golden 1 Center https://t.co/cSqQajnRbq",
    "498": "Portland Trail Blazers 110 (C.J. McCollum 28 pts) Detroit Pistons 92 (Isaiah Stewart 15 pts, 14 rebs, Cade Cunningham 26 pts), Sacramento Kings 92 (Richaun Holmes 27 pts) Los Angeles Lakers 117 (Dwight Howard 12 pts, 13 rebs, Anthony Davis 25 pts)",
    "499": "Anthony Davis with an alley oop vs the Sacramento Kings https://t.co/t2eKQuaxlS",
    "500": "Top last baskets of the periods from Sacramento Kings vs. Los Angeles Lakers https://t.co/r31O2iqcsE",
    "501": "Anthony Davis on Lakers win vs. Kings: “It’s a team thing” #AnthonyDavis #LosAngelesLakers #SacramentoKings https://t.co/oC5NscRB5d",
    "502": "Honestly move the Sacramento Kings to Vancouver",
    "503": "Malik Monk with a last basket of the period vs the Sacramento Kings https://t.co/4uITx906dI",
    "504": "@SacramentoKings This is a marathon and not a Sprint  , there's 60 games left , just keep plugging .",
    "505": "@SacramentoKings Glad they bounce right back tomorrow with another game vs the clippers , no time to wallow in tonight's loss .",
    "506": "LeBron James missed the LA Lakers' clash with the Sacramento Kings on Tuesday after entering the #NBA's Covid-19 health and safety protocols.\n\nIt's unclear if James has tested positive for the coronavirus.\n\nHe must now return two negative tests before being allowed to return.",
    "507": "Los Angeles Lakers vs Sacramento Kings | Full Game Highlights | Nov 30, 2021 | FreeDawkins | SportsNus https://t.co/Ap1FeQYrBp",
    "508": "Richaun Holmes - Sacramento Kings\n27 PTS\n9 RBD\n2 AST\n2 BK\n2 TO\n[FD(44.8) DK(44.25)]",
    "509": "Chimezie Metu - Sacramento Kings\n14 PTS\n11 RBD\n3 STL\n[FD(36.2) DK(35.25)]",
    "510": "Terence Davis - Sacramento Kings\n8 PTS\n6 RBD\n1 AST\n2 BK\n1 STL\n2 TO\n[FD(23.7) DK(22)]",
    "511": "@Stormof69 hey Storm!\nI know Sacramento seems like it may be a 'cow town' and it is but we have the Kings who never win, a huge arena, crime and homeless people.\nWe're like any other city.\nPlease get your agent to book you here\n\nFront row 4 me",
    "512": "🚨🔓🏀\nLos Spread de Hoy - SpreadToday\n#NBA #NBA2K22 \n- @cavs +7.5\n- @HornetsPR +8\n- @SacramentoKings +7.5\n#NCAAB \n- #Marist +8.5\n-  #Pennsylvania +18\n- #UtahValley +14.5\n\n#GamblingTwitter \n#FreePick",
    "513": "Los Angeles Clippers vs Sacramento Kings - NBA Prediction https://t.co/4eQVvhyNzn",
    "514": "Resultados dos jogos de ontem:\n\nToronto Raptors 91 x 98 Memphis Grizzlies\n\nBrooklyn Nets 112 x 11 New York Knicks\n\nSacramento Kings 92 x 117 Los Angeles Lakers\n\nPortland Trail Blazers 110 x 92 Detroit Pistons\n\nPhoenix Suns 104 x 96 Golden State Warriors\n\n #jamesharden #nba https://t.co/dtsoAAFYmM",
    "515": "Los Angeles Lakers vs. Sacramento Kings Full Game Highlights | NBA Seaso... https://t.co/lJ9l8oqM20 @YouTubeより",
    "516": "Key Points: Davis and Westbrook Lead Lakers Past Kings Minus James in Sacramento - FortyEightMinutes. Check out my latest @Lakers coverage on @FortyEightMins. The @Lakers defeated the @SacramentoKings in Sacramento, 117-92. Article link is here: https://t.co/6V4wMaeIcm #LakeShow https://t.co/1hgM3wWBi3",
    "517": "Los Angeles Lakers vs. Sacramento Kings Full Highlights 4th Quarter | NBA Season 2021-22 https://t.co/gklD6wJMcH",
    "518": "Next Sacramento Kings GM https://t.co/yE7e2WWoOw",
    "519": "@FakeRudyMartzke Mark Jones on the Sacramento Kings’ woes. https://t.co/u3RoiFRZp5",
    "520": "@SacramentoKings 🙄Means nothing when the @SacramentoKings get dunked on with the final score. #FireEveryone",
    "521": "@SacramentoKings The loss? Not so immaculate 🙄 The admin for the @SacramentoKings account should save these types of tweets until the Kings win.",
    "522": "@Lakers wins against @SacramentoKings 117-92.💪🏻💛",
    "523": "@prettyboylvtrey @muddysituation Sacramento Kings!",
    "524": "Frank Vogel on why he gave Dwight Howard big minutes vs. Kings #DwightHoward #FrankVogel #LosAngelesLakers #SacramentoKings https://t.co/eBTpreSsaU",
    "525": "LeBron James sat out the Los Angeles Lakers’  117-92 win over the Sacramento Kings after entering the NBA’s COVID-19 health and safety protocols.\n https://t.co/vCp81534v0",
    "526": "LeBron James is put into NBA isolation after 'testing positive' for COVID: Lakers star won't play against Sacramento Kings tonight during season that's seen him miss games because of spra...\nvia https://t.co/4bM0z7qnVP https://t.co/pKqmK22rlD",
    "527": "Frank Vogel says he used halftime to “light fire under” Lakers players #FrankVogel #LosAngelesLakers #SacramentoKings https://t.co/PZtsH4lFAp",
    "528": "LeBron James is put into NBA isolation after 'testing positive' for COVID: Lakers star won't play against Sacramento Kings tonight during season that's seen him miss games because of spra...\nvia https://t.co/ukePCFr1gS https://t.co/FMyyDoraFH",
    "529": "@benmaller Sacramento Kings legend HAROLD PRESSLEY #InstaTrivia #MallerMilitia #SacramentoProud https://t.co/HRBNgWktEv",
    "530": "@davidsmith009 @SacramentoKings @Rich_Holmes22 @Chimezie_Metu fox can ball from a lakers fan",
    "531": "I can’t with this team any longer #kangz @SacramentoKings https://t.co/XPonDHnlcC",
    "532": "@SacramentoKings No consistently November.",
    "533": "LeBron James has been placed in the #NBA's health and safety protocols, and was ruled out for the Los Angeles Lakers' game against the Sacramento Kings on Tuesday night.",
    "534": "@NBCSKings @alexdidion_ Man just heard Charles Barkley just said that the Sacramento Kings need to be out of the league or move to Seattle.... Your thoughts?",
    "535": "[FINAL] Lakers 117 Kings 92\n\nNO LEBRON...NO PROBLEM!!\n\nLos Angeles Lakers (12-11) DEMOLI the Sacramento Kings (8-14) 117-92.\n\nA. Davis: 25 PTS | 8 REB | 2 STL | 2 Blk \nR. Westbrook: 23 PTS | 5 REB | 6 AST \nM. Monk: 22 PTS | 4 REB | 4 AST \nC. Anthony: 14 PTS | 1 REB",
    "536": "Lakers vs. Kings Final Score: Russell Westbrook leads L.A. past Sacramento without LeBron - Silver Screen and Roll https://t.co/lkb58Paavl https://t.co/Ixy52O8mdc",
    "537": "@EliteLakeShow_ @SacramentoKings @Rich_Holmes22 Do you feel good about yourself? Kings fans just trying to be left alone in our depression and you over here just piling on top. https://t.co/3gGSEqGsJm",
    "538": "👑NEW LOCKED ON KINGS POD👑\n🏀This Kings team has no pride.\n🏀Lakers fans take over the G1C and embarrass Sacramento.\n🏀Alvin Gentry apologizes to the fans.\n\n🎙️https://t.co/eaWIQgr84V\n💻https://t.co/PxqzE8XZtn https://t.co/coYrzthOPo",
    "539": "Malik Monk buzzer beater from DEEP! \n\n@Lakers, @SacramentoKings second half set to begin on NBA League Pass: https://t.co/sXoriUODxv https://t.co/xcxtHymIn1",
    "540": "The @SacramentoKings are terrible for my mental health. Good night.",
    "541": "@MikuniTaro @SacramentoKings @TyHaliburton22 Nice kickers my man...when are we going to see Ryan...I'm good early week of 12/20...Let me know!!!\n😍😍😍😍😍😍🥰 https://t.co/AsDDEed0Zt",
    "542": "Ende #Basketball Herren #NBA \n110:112 NewYorkKnicks vs #BrooklynNets \n98:91 #MemphisGrizzlies vs TorontoRaptors \n96:104 GoldenStateWarriors vs #PhoenixSuns \n92:110 DetroitPistons vs #PortlandTrailBlazers \n117:92 #LosAngelesLakers vs SacramentoKings",
    "543": "@SacramentoKings @Rich_Holmes22 How do they fade like that after half time, they dis not like what the coach said in the locker room 🥵",
    "544": "@NickBoltonSZN_ @NBA @Lakers @SacramentoKings Legooutside",
    "545": "\"LeBron James Enters NBA Virus 'Health and Safety Protocols,' Skips Tuesday Night Game\" Fans hoping to see LeBron James face off against the Sacramento Kings on Tuesday were left wanting when the NBA announced the star Laker had entered \"health and safety protocols.\"https://…",
    "546": "@PatrickKilken55 @SacramentoKings @TheDougChristie Love it!!!  Need to make that an NFT",
    "547": "Los Angeles Lakers vs Sacramento Kings Full Game Replay 2021 Nov 30 NBA Replay HD\nhttps://t.co/wQghjly8R0 https://t.co/xHmJzLZEcz",
    "548": "Los Angeles Lakers' LeBron James is out for Tuesday night's game against the Sacramento Kings due to NBA's COVID-19 health and safety protocols.  https://t.co/cZHSmWfJCS",
    "549": "FT\n\nBrooklyn Nets 112 - 110 New York Knicks\n\nToronto Raptors 91 - 98 Memphis Grizzlies\n\nPhoenix Suns 104 - 96 Golden state warriors\n\nPortland Trail Blazers 110 - 92 Detroit Pistons\n\nSacramento Kings 92 - 117 Los Angeles Lakers\n\n#TheGamePlan #NBA",
    "550": "Our #3 and I appreciate Vivek &amp; Matina san for our amazing seats! 🙏🏻 We truly enjoyed the hospitality &amp; experience! I am going to stay hopeful. Go #Kings #KingsFamily #haliburton @SacramentoKings @TyHaliburton22 https://t.co/3XJJTpnDhl",
    "551": "I will never eat another thing from @SacramentoKings @Golden1Center dam last bite of my nachos tasted molded and now my stomach hurting 🤦‍♂️",
    "552": "@MarcosBreton @SacramentoKings Heck yes!  Lol.",
    "553": "@NBA The city of Sacramento deserves so much better than the awful teams we’ve had 4 16 years. Kids r gettin their license this year and were a baby or not even born yet last time Kings made playoffs. Intervene Adam Silver in some way. Keep them in Sac tho #SacramentoProud",
    "554": "1,000,000 years since our last playoff birth. It's time for Sacramento Kings fans to bleed the organization dry until they give us a winning team. \n\nno attending games. \nno watching games on television\nno buying merchandise. \n\nPlease share\n\n#boycottsacramentokings",
    "555": "Anthony Davis scored 25 points, Russell Westbrook added 23 and the Los Angeles Lakers overcame the absence of LeBron James to beat the Sacramento Kings 117-92 on Tuesday night. https://t.co/OWWMOLhcqc",
    "556": "Podcast: The Lakers finally blew a team out (Silver Screen and...)\n\nWhen the Los Angeles Lakers tipped off against the Sacramento Kings Tuesday night, they did ...\n\nAdd your highlights:\nhttps://t.co/7cOL0zz7wU\n #LA_Lakers",
    "557": "@JandersonSacBee Don't know what's worse...being an @SacramentoKings fan or an @dallascowboys fan...thank goodness for @cuisoftball https://t.co/pKKRaFnK0K",
    "558": "Seen while out tonight covering the Sacramento Kings loss to the LA Lakers. In #California. #kingsLakersTamalesTesla https://t.co/M2jxq9FoES",
    "559": "Kings to visit Clippers as inconsistent teams square off  #NBA\n #laclippers #SacramentoKings #SacramentoProud https://t.co/FsuntDiQuD",
    "560": "Wed, 1st Dec: #SacramentoKings vs #LosAngelesLakers - ODD @ 1.97\nMore details on: https://t.co/TG6qNFDLZU\n#baskettips #basketprediction #basketballbets #nba #usabasket",
    "561": "Why are you so scared to take the ball into the paint??? @SacramentoKings",
    "562": "The Sacramento Kings are The Curse of Oak Island of the NBA.\nAll promise and no reward season after season after long boring season.",
    "563": "@SacramentoKings Do better",
    "564": "The Sacramento Kings are take your tv out back and put it out of its misery bad.",
    "565": "Can’t believe the La Lakers worn against Sacramento Kings without Lebron kings they’ve been good this year tho",
    "566": "@kcranews I’m thankful for Ranadivé keeping the Kings in Sacramento but his ownership tenure has been abysmal",
    "567": "The Lakers finally reacted to a message that's been apparent for weeks: If they want to be a championship team, they need to give a championship-level effort.\n\nThat showed in the second half against the Sacramento Kings, powering the Lakers' first blowout: https://t.co/7sQeWmgrSl",
    "568": "Nobody knows true pain the way @SacramentoKings fans do. Nobody. https://t.co/eoI28GyufC",
    "569": "LA Lakers will lose against Sacramento Kings 🤡🤡🤡🤡🤡🤡",
    "570": "Los Angeles Lakers' LeBron James is out for Tuesday night's game against the Sacramento Kings due to NBA's COVID-19 health and safety protocols. #FOX13 https://t.co/AG89auXNWo",
    "571": "Thanks to @TheCityofSac for inviting us to tonight’s @SacramentoKings vs @Lakers game. #SuiteLife #BiggerThanBasketball https://t.co/Ty0wJA75eX",
    "572": "NBA\n\nFT.\n\nBrooklyn Nets 112 - 110 New York Knicks\n\nToronto Raptors 91 - 98 Memphis Grizzlies\n\nPhoenix Suns 104 - 96 Golden state warriors\n\nPortland Trail Blazers 110 - 92 Detroit Pistons\n\nSacramento Kings 92 - 117 Los Angeles Lakers\n\n#TheGamePlan",
    "573": "@Ballislife @SacramentoKings @TheDougChristie Fox got 3 💍💍💍 😂😂😂😂 let it go DC it aint that serious",
    "574": "@MattGeorgeSAC Thus proving the obvious point that the problem with this embarrassment of a franchise is not within the coaching ranks.  Look farther north.  Hint:  inept ownership.  Somewhere, Luke Walton praises God he was “fired” from this clown show. #SacramentoKings",
    "575": "LeBron James won't play tonight after entering COVID-19 health protocols \n\nLeBron James has entered the NBA's COVID-19 health and safety protocols and will miss the Lakers' game tonight against the Sacramento Kings, the team announced.",
    "576": "@gwiss Will it help if they changed the name from Sacramento Kings to Otnemarcas Sgnik.\n\nMonte seems to think we have the talent, looks like the problem is in the name, lets try it backwards.",
    "577": "The Los Angeles Lakers picked up win No. 12 on the year in a road blowout of the Sacramento Kings.  https://t.co/FnzbF0nnjh",
    "578": "@GeeDotAre sacramentokings https://t.co/zCfiZAnfXE",
    "579": "@Thando_Blessin1 @NBA @Lakers @SacramentoKings 😭😭😭he was cooking",
    "580": "Anthony Davis scored 25 points, Malik Monk shot 6 of 10 from 3-point range en route to 22 points off the bench, and a Los Angeles Lakers team playing without LeBron James rode a big third quarter to a 117-92 defeat of the host Sacramento Kings. https://t.co/0fOfMlCQhY",
    "581": "@MzoliThaHomie1 @NBA @Lakers @SacramentoKings 😂😂💀and her 22pts \n\nThis name still kills me",
    "582": "@NBA @Lakers @SacramentoKings Microwave monk😭😭😭😭@Thando_Blessin1",
    "583": "Ducks beat the kings in LA, Lakers beat the kings in Sacramento. This duck is me 💯 https://t.co/5I3rGve3xG",
    "584": "@Jordan_Swanson @SacramentoKings Let’s goooooooo",
    "585": "The @SacramentoKings were leading 69-61 at the 7:08 mark in the third quarter when Gentry subbed Hali/Holmes out for Mitchell/Len. The Lakers went on an 11-1 run and were leading 72-70 when Hali and Holmes were subbed back in at the 3:43 mark. #Kangz",
    "586": "My daughter is turning 13 years old soon. She's been waiting to go to a Sacramento Kings playoff game with me her entire life. This organization should be set on fire. \n\n#sacramentoproud\n\n@Vivek @mmcnair @SacramentoKings  @swipathefox @thekingsherald",
    "587": "@AllenSliwa @LAIreland @JABcamLA @LindseyBaseball @UneeQ_ @BergmanGreg @ScottKaplan @ESPNLosAngeles @TravisRodgers @VeniceMase @AmandaCB79 @Sedano Lakers v Kings…..  Monk didn’t need a church to PREY on Sacramento!",
    "588": "The Los Angeles Lakers were without LeBron James, but huge run in the second half secured the victory over the Sacramento Kings 👌\n\nhttps://t.co/K3KJpp4nJa",
    "589": "@AnaKasparian You obviously don't frequent Sacramento Kings Twitter.",
    "590": "trade the whole team @SacramentoKings",
    "591": "@SacramentoKings @Rich_Holmes22 Fox , Halliburton and Buddy all play poorly tonight . Fox had yo many turnovers and Buddy never got going. Just a poor performance from the guards tonight 🤦‍♂️",
    "592": "EAT A FRANK @SacramentoKings https://t.co/sgMhzaLUD5",
    "593": "KINGS IN THE MUDDDDD @SacramentoKings @LAKings",
    "594": "Lakers Destroy Kings Without The King! \"Los Angeles Lakers vs Sacramento... https://t.co/e1RlGDTVUt via @YouTube",
    "595": "LeBron James is put into NBA isolation after 'testing positive' for COVID: Lakers star won't play against Sacramento Kings tonight during season that's seen him miss games because of spra...\nvia https://t.co/LEFi0Qm4gr https://t.co/X03XPxxpOq",
    "596": "SACRAMENTO, Calif. (AP) — Anthony Davis scored 25 points, Russell Westbrook added 23 and the Los Angeles Lakers overcame the absence of LeBron James to beat the Sacramento Kings 117-92 on Tuesday night. https://t.co/b8XGPuKxuN",
    "597": "@CarmichaelDave Looks like wearing the “Sacramento Kings” jersey makes them forget basketball.\n\nEasy solution - Change the name of the team and the City (and get better players)!",
    "598": "@SacramentoKings @Rich_Holmes22 What a sh*tty team!! \n\nL O S E R S",
    "599": "@ShesLiftedXo @SacramentoKings Haha kings gna kings 🤷🏿‍♂️",
    "600": "Anthony Davis’ 25 points led the Los Angeles Lakers to a 117-92 win over the Sacramento Kings #SSBasketball",
    "601": "@JordanN1333272 @PdgaSunMoon @elpwsALT @SacramentoKings @Rich_Holmes22 @Vivek Well said 💯 @Vivek isn’t capable of leading an NBA team.",
    "602": "Wanna know why this city loves the @SacramentoKings and why it hurts so much when they lose? Or why people are so passionate about them? Cuz they’re our only team here. We’re not LA, SF, NY, Philly or another city who have all majors sports teams. We got 1 squad. (1/2)",
    "603": "Major League 2: Rotten Bums + Parking Lot https://t.co/pPrTomJgNq via @YouTube. Literally how I feel about my #sacramento #kings right now",
    "604": "Lmmfao best comment of the game was from a @SacramentoKings commentary! @DwightHoward 💪🏽💪🏽💪🏽 D-Bo-ing his way on the court like someone stole his bike! 😂 let's go @Lakers #LakersGang \n\nWhole team did well 💜💛💜💛",
    "605": "@CarmichaelDave Sacramento Kings max contract player doesn't understand the assignment!",
    "606": "@thekingsherald This game was not fair to @Rich_Holmes22. This team just does not care about each other or the fans. Fans fought hard to keep the @SacramentoKings here. It’s past time for the team to show the fans the respect they deserve.",
    "607": "@MarcosBreton @SacramentoKings The owner",
    "608": "Society has advanced beyond the need for the Sacramento Kings",
    "609": "Sacramento Kings needa do better.",
    "610": "👍 on @YouTube: Sacramento Kings FALL to the Lakers 117-92 - POSTGAME LIVE https://t.co/71ueYJksFO",
    "611": "@phxIIymxkan @SacramentoKings @SacramentoKings do it",
    "612": "Hahah. Wait for what Charles said at the end about the Sacramento Kings. Even though i prefer another way around of it. Like the majority of us here.\n\n#BringBackOurSonics #TimeToExpand #SeattleIsABasketballTown @SimplySonics @Iconic_sonics @BringBackSonics https://t.co/sXxT86KdZz",
    "613": "Dear Sacramento Kings: \n\nPlease trade De’Aaron Fox.\n\nThank you.",
    "614": "@TAizenberg how you feelin? @SacramentoKings",
    "615": "I’m still waiting for those lower level tickets prices to drop… @SacramentoKings @Golden1Center",
    "616": "Led by 25 pts from @AntDavis23, the @Lakers overcame the absence of LeBron James to beat the @SacramentoKings 117-92. #LakeShow 📸: Ezra Shaw https://t.co/0IdsDWrxOy",
    "617": "@Matt_Barnes22 @SacramentoKings @Lakers https://t.co/3nM3JT8JvZ\nYour mother-in-law",
    "618": "All I want from the @SacramentoKings this Christmas is a team that takes no shit, brings the aggression on offense and defensive and never backs down. 🙏🙏🙏",
    "619": "I happen to stop watching the Lakers &amp; they go on a 40-8 run to blow out Sacramento. #LakeShow\n\nI happen to stop watching the Kings as they are down 4-1 &amp; they tie it up 4-4. #GoKingsGo",
    "620": "don’t worry @SacramentoKings @SHAQ never defended the @Lakers either @NBAonTNT https://t.co/PV9MijB1nG",
    "621": "Being a @SacramentoKings fan is really like being a lions fan tbh",
    "622": "@CrownDowntown @TheCityofSac @SacramentoKings @Lakers @JohnRKings @blaylockboyz @E_DUB916 @tbedal @dampania @johnsantich @PamelaSantich @CLopez63 And the players in return decided to crap on the hard work you guys put in to keep this team and show how much fans care.",
    "623": "Kings interim head caoch Alvin Gentry, disgusted with the way his team performed in the second half, apologizes to Sacramento fans after the game. https://t.co/tkV6az8biF",
    "624": "LeBron James was ruled out of the Los Angeles Lakers' clash with the Sacramento Kings on Tuesday after entering the NBA's Covid-19 health and safety protocols, the team said. #LeBronJames #NBA\n\nRead more: https://t.co/MOHAs45yEN https://t.co/P9KGeSPp9H",
    "625": "Even Charles Barkley is going off on the  @SacramentoKings now, \"You can't be this bad for this many years...\"",
    "626": "@SacramentoKings @Rich_Holmes22 Lmao trash ass team 😂",
    "627": "@NBA @Lakers @SacramentoKings All star three point contest contender",
    "628": "The @SacramentoKings aren’t going to win a lot of games when Fox is only taking 9 shots. He seemed to be really passive early which is fine but when we need buckets he’s gotta be the guy. 7 turnovers don’t help either.",
    "629": "@NBAonTNT Trust me Charles we expect much better from this Sacramento Kings team too. Way too much talent to not win more games has to be ownership or something because Sacramento is a great basketball city too",
    "630": "Sacramento Kings to-do list:\n*trade De'aaron Fox and a pick for Ben Simmons. \n*keep Tyrese Haliburton and Richaun Holmes.\n*trade everyone else. don't leave a single regular rotation player left. \n*Hire real coach and don't be stingy.\n*kick @mmcnair in the nards",
    "631": "When Chuck said the @NBA needa punish the @SacramentoKings by moving them to Seattle I felt that 👀 #NBAonTNT #BringBackOurSonics",
    "632": "Barkley going off on Kings.  “We need to have a meeting about the Sacramento Kings.  We need to relegate them to like, somewhere.”",
    "633": "Charles Barkley said the Sacramento Kings should be relegated to somewhere LOL like to Auburn @NBAonTNT #NBAonTNT https://t.co/afkAAYdiZ0",
    "634": "@SacramentoKings hook ud up with some Harrison Barnes",
    "635": "@TheRealBigAl916 @SacramentoKings Well… it started off good lol",
    "636": "It’s time @SacramentoKings https://t.co/F7KXmMixfJ",
    "637": "@soren_flyin @SacramentoKings @Rich_Holmes22 What’s up with this dude!!!!",
    "638": "@CarmichaelDave Barkley just shredded the @SacramentoKings on Inside the NBA. Said Kings “need to go.”  We really are becoming a bad joke in the entire NBA.",
    "639": "@elpwsALT @SacramentoKings @Rich_Holmes22 That’s when Fix has to come in as our guy , he was non existent tonight 🤦🏽‍♂️",
    "640": "Sacramento Kings should trade De’Aaron Fox.",
    "641": "Charles Barkley said the sacramento kings need to move Seattle with that record 😹😹😹😹",
    "642": "@SacramentoKings @Rich_Holmes22 Sad just sad , Fox should be ashamed of himself , letting the Lakers come in here and disappearing like that!",
    "643": "They need to go ahead a move the Sacramento Kings to Seattle",
    "644": "When are fans going to stop having any type of positive expectations for the @SacramentoKings? #trash #jinxed",
    "645": "@SacramentoKings @Rich_Holmes22 Hield gets paid 20 mil to throw up bricks",
    "646": "Carmichael Dave blocked me for this but it looks like I was dead on correct. The Seattle SuperSonics will make the playoffs before the Sacramento Kings do. #SacramentoProud #selltheteam #vivekmustgo",
    "647": "@lensflare8 @IamKDiddy Bro they're planning their vacations for April lol. Ain't no one requesting trades. Punch in, do the bare minimum, punch out. That's the culture of the Sacramento Kings.",
    "648": "I’m 💯 sure the halftime jump ropers would’ve beat the @SacramentoKings by 20 points also. @vivek who wants to pay money for a poor quality product? Asking for all of Sactown.",
    "649": "Lakers is washed okes ngl as fans how are you this excited for a win against Sacramento Kings😭",
    "650": "Really?? Over @SacramentoKings ?? That’s unbelievable! And they use a whole Q? \n\nThat’s a dinasty right there…\n\nBah! https://t.co/tuIcwQ1u0I",
    "651": "@Lionsbadboy @NBA @Lakers @SacramentoKings This aged well",
    "652": "@therealhg26 @joshhigh66 @j_biegler @SacramentoKings @Vivek Yeah I don’t even care who we trade at this point as long as it’s a good trade for us. I really like some of the players, but at this point, we need changes",
    "653": "LAKERS WIN! 🚨🙌\n-\nThe @Lakers defeated the @sacramentokings 117-92 tonight.\n-\nA. Davis - 25 PTS| 7 REB| 3 AST|\n\nR. Westbrook - 23 PTS| 6 AST| 5 REB|\n-\nThe Lakers improve to (12-11) on the season! 💜💛\n- \nFollow @lalakersquad for more! 🔥 https://t.co/Npo8tRhjLa",
    "654": "Guess it’s time to start looking at @tankathon again. It should probably be the Sacramento Kings homepage.",
    "655": "Thanks to @TheCityofSac for inviting us to tonight’s @SacramentoKings vs @Lakers game. #SuiteLife #BiggerThanBasketball https://t.co/BmVQp9ejpi",
    "656": "Playing without LeBron James, Lakers still punish Kings  #NBA\n #SacramentoKings #SacramentoProud #Lakers #LakeShow https://t.co/1ekOCiL7LK",
    "657": "Shoutout to Monk and Dwight for their magnificent play today. Russ took over in that 2nd half. Bench was really good, pretty much everyone was great in the 2nd half. A really nice 25 point win in Sacramento against the Kings. Up next is the Clippers. #LakeShow #LakerNation 💜",
    "658": "@Matt_Barnes22 @SacramentoKings @Lakers Glad Kenny joined you on the postgame show so I could ease my pain with alcohol 🍹 \n\nhttps://t.co/b9ASyJ533n",
    "659": "Told you @LouisKing  would crack thr @SacramentoKings roster. iT will be worth it: Los Angeles Lakers vs Sacramento Kings - Full Game Highlights | November... https://t.co/w8SSVLyjOY via @YouTube",
    "660": "@SacramentoKings RATIOOOOOOOOOO",
    "661": "Something deep inside of me wants to trade every last player on this roster\n\nJust to shake things up @SacramentoKings",
    "662": "I’m A Sacramento Kings Fan https://t.co/eG8WCaYLSI",
    "663": "If this team doesn’t care, why should I? @SacramentoKings",
    "664": "@yanezjocelyne @Lakers @SacramentoKings Haha Lakers beat them by 25 points🤣🤣",
    "665": "Is this the most unlikable Sacramento Kings team of all time? \n\nI’m seriously spending time thinking about this",
    "666": "Los Angeles Lakers star LeBron James was placed in the NBA’s COVID-19 health and safety protocols, the team announced, and missed Tuesday’s game against the Sacramento Kings.\n#lebronjames #lebron19 #nba #covid_19 https://t.co/hAsUiYqJD8",
    "667": "@Aykis16 Hey @buddyhield @RealTristan13 I know at the end of the day ya’ll are people too and that’s cool but why are us fans more dissapointed tonite than ya’ll? Tonite was just more evidence our team lacks leadership and I sure don’t see it seconds after collapsing! @SacramentoKings https://t.co/I2mbbCmxHa",
    "668": "Alvin Gentry opens up his press conference apologizing to the fans.\n\n\"As the coach of the Kings I want to apologize to every Sacramento Kings fan out there. You deserve better.\"\n\nSays he will find players who will give fans better.",
    "669": "@BigDaddyHuppDoh @joshhigh66 @j_biegler @SacramentoKings @Vivek Im just gonna say blow it up. Fox has disappeared this year no idea whats up with him. It seems it has been empty stats the past few years that haven’t led to anything. I say keep Hali, Mitchell, and Holmes and everyone else can get shipped.",
    "670": "@MarcosBreton @SacramentoKings Go find Grant and act like it’s 1960",
    "671": "Fuck the Sacramento kings",
    "672": "@DeuceMason The Stockton Kings could compete with the Sacramento Kings. Let’s be real. Sac is a dumpster fire.",
    "673": "@stillwhohei @SacramentoKings @Rich_Holmes22 @Chimezie_Metu Man that flipped quickly",
    "674": "This is why I will not spend another dollar on @SacramentoKings games @Vivek and @mmcnair\nNo more patience, no more excuses https://t.co/uadBPuVMAG",
    "675": "The Sacramento Kings are shooting 29/116 (25%) from three in their last three games.",
    "676": "@JollyRancherz_ @BrunoMagnific0 @SacramentoKings @Rich_Holmes22 Nah when we're that embarrassing they have the right to talk that shit",
    "677": "@CarmichaelDave ...a remarkable one to remember since they have not made it in 15 years...and counting...GO @SacramentoKings ...winners in the wrong direction",
    "678": "@SacramentoKings @Rich_Holmes22 Well that was disgusting",
    "679": "@JollyRancherz_ @SacramentoKings @Rich_Holmes22 This you? https://t.co/0CG7lL0CME",
    "680": "@SacramentoKings @Rich_Holmes22 Man Vivek should do these players and fans what they deserve and sell the team",
    "681": "@SacramentoKings @Rich_Holmes22 Buddy doesn't give a fuck so why should we https://t.co/7JYCzkswMi",
    "682": "@JollyRancherz_ @Louis_SZN29 @SacramentoKings @Rich_Holmes22 It’s either the Thunder or Rockets as the worst",
    "683": "@MarcosBreton @SacramentoKings Players then Monte.\nUnfortunately Vivek cannot be on the list!",
    "684": "Sacramento Kings FALL to the Lakers 117-92 - POSTGAME LIVE https://t.co/wfyUoiPyaX via @YouTube  come drown your sorrows with us",
    "685": "Sacramento Kings FALL to the Lakers 117-92 - POSTGAME LIVE https://t.co/MssMKys3Eu via @YouTube produced by @Shoots808 and @royal_rebounds",
    "686": "This is probably in the top 5 lowest moments in history of the Kings here in Sacramento...maybe top 3. This is disgusting. 🙄 https://t.co/fgm6Bql2jV",
    "687": "@SacramentoKings @Rich_Holmes22 Trade everyone not named Richaun Holmes, we S U C K",
    "688": "🤖 #SofiAlert \n📅 30-11-2021 \nLos Angeles Lakers - Sacramento Kings \n🛋 3.9/5 Sofis https://t.co/gE4hcILz5M",
    "689": "@MarcosBreton @SacramentoKings @Lakers Because the organization has ran off all their fans. Most nights there are 7-8K tops.",
    "690": "i’ve had enough of the sacramento kings. give me another team to cheer for immediately.",
    "691": "@SacramentoKings You were saying",
    "692": "FINAL: \n#Lakers 117\n#Kings 92\n\n#LakeShow are 12-11 and get the \"payback\" on Sacramento that AD wanted. A big second half in which LA outscored SAC, 67-33 was enough for their first blowout victory. #WeLoveLA",
    "693": "@P1ASAP @SacramentoKings @Rich_Holmes22 Fox just doesn’t have confidence. When he does he goes off. Just like away at LA",
    "694": "LAKERS WENT ON A 40-8 RUN, to comeback &amp; beat Sacramento, 117-92! \n\nAnthony Davis: 25 PTS, 7 REB, 12/22 FGM\nRussell Westbrook: 23 PTS, 6 AST, 5 REB\nMonk: 22 PTS off bench, 6/10 3PM\n\nRichaun Holmes ATE for the Kings with 27 PTS &amp; 9 REB on 12/13 FGM. \n\nNo LeBron, no problem! 💪 https://t.co/OtNZfWA0gl",
    "695": "LAKERS WIN!!! 💜💛\n\nThe Lakers used a huge 67-33 2nd half run to oust the Kings in Sacramento for their 12th win of the season, 117-92.\n\nAD: 25 pts, 7 rebs, 3 asts, 2 stls, 2 blks\nRuss: 23 pts, 5 rebs, 6 asts\nMonk: 22 pts, 4 rebs, 4 asts\nDwight: 12 pts, 13 rebs, 2 stls, 2 blks https://t.co/d7TY9zykJF",
    "696": "@SacramentoKings @Rich_Holmes22 ratiooooo",
    "697": "@SacramentoKings @Rich_Holmes22 Good try. Need more 3 pt shooters. Barnes pls hurry back",
    "698": "@SacramentoKings @Rich_Holmes22 \"But I'll be sure to come back when the Lakers beat the Kings.....\" https://t.co/WjNjjlz5DF",
    "699": "U really skipped yo bedtime just to post this RT @RealSkipBayless: The Lakers who lost at home to the Kings last Friday in 3 overtimes (as LeBron missed TWO game-winners) just won the second half at Sacramento 67-33 without LeBron. Hmmm.",
    "700": "HOORAY!\nThe Los Angeles Lakers defeat the Sacramento Kings!\nCongrats on the win @Lakers!\n#NBA75",
    "701": "@SacramentoKings is this Staples Center or Staples Center? https://t.co/KaT3RdC4GO",
    "702": "@BigDaddyHuppDoh @j_biegler @SacramentoKings @Vivek I’ll take a new owner as well.",
    "703": "FIM DE JOGO\n\nLos Angeles Lakers 117 x 92 Sacramento Kings \n\nDESTAQUES:\n\nAnthony Davis: 25 pts | 7 reb | 3 ast\nRussell Westbrook: 23 pts | 5 reb | 6 ast\nMalik Monk: 22 pts | 4 reb | 4 ast\nhttps://t.co/DaNuaDo4nb",
    "704": "@RealSkipBayless The Lakers who lost at home to the Kings last Friday in 3 overtimes (as LeBron missed TWO game-winners) just won the second half at Sacramento 67-33 without LeBron. Hmmm. https://t.co/fkHgTLyQTf",
    "705": "@Vivek hey congrats on being good with computers and shit but can you sell the @SacramentoKings please?",
    "706": "@joshhigh66 @j_biegler @SacramentoKings @Vivek I’ll take that too at this point lol",
    "707": "@mmcnair @SacramentoKings @Vivek Fucking. Pathetic.",
    "708": "@SacramentoKings @Rich_Holmes22 Here for the replies https://t.co/tleyA9tm5I",
    "709": "@SacramentoKings @Rich_Holmes22 Trade fox",
    "710": "@BigDaddyHuppDoh @j_biegler @SacramentoKings @Vivek Half? The whole roster can go",
    "711": "@SacramentoKings @Rich_Holmes22 Terrible team. Now you know the problem was not the coach. 😭 I can’t watch anymore",
    "712": "@j_biegler @SacramentoKings @Vivek @joshhigh66 And half the roster should go too lol",
    "713": "@damienbarling There is something deeply dysfunctional about this team. This is not the first time this team has stopped playing in the middle of a game. Trade them all and start over. #NBA #sacramentoproud #sacramentokings #nbatwitter",
    "714": "@SacramentoKings @Rich_Holmes22 Follow back Kings rn that they all mad",
    "715": "@SacramentoKings @Rich_Holmes22 LMAO https://t.co/tbRyipIjDb",
    "716": "@SacramentoKings @Rich_Holmes22 quite possibly the worst team exhibition i've seen all season long. and that's saying a lot.",
    "717": "@SacramentoKings @Rich_Holmes22 I think it’s time we start thinking of getting a real head coach. It’s frustrating to see these games that could be easily won down the drain",
    "718": "@stillwhohei @SacramentoKings @Rich_Holmes22 @Chimezie_Metu I expect nothing less from us anymore 😂 all good GG’s",
    "719": "Someone please tell Skip that you cannot use the Sacramento Kings as a barometer for any serious analysis. https://t.co/T7BUTTM0Hk",
    "720": "FINAL DE JOGO\n\nLos Angeles Lakers 117x92 Sacramento Kings\n\n#LakeShow \nAnthony Davis: 25 PTS | 7 REB\nRussell Westbrook: 23 PTS | 5 REB | 6 AST\n\n#SacramentoProud \nRichaun Holmes: 27 PTS | 9 REB\nDe'Aaron Fox: 17 PTS | 5 REB | 5 AST\n\n#NBA75 https://t.co/q0XSoxJ7mF",
    "721": "@MarcosBreton @SacramentoKings Now you see the problem was not the coach! 🤦🏻‍♂️",
    "722": "@heyMrcass @SacramentoKings @Rich_Holmes22 I wouldn't take a bag of balls for any of these garbage players",
    "723": "@SacramentoKings @Rich_Holmes22 Just lost to LeCovid Team 😹😹 https://t.co/y4cFHCc4km",
    "724": "@SacramentoKings Sell the team already. That was the most embarrassing display of hoop I’ve ever seen",
    "725": "@SacramentoKings @Rich_Holmes22 U guys drive me absolutely insane",
    "726": "@SacramentoKings @Rich_Holmes22 TRIPLE OT GAME DOESNT COUNT thanks for the home game Queens 😂😂 https://t.co/lmjXozWI43",
    "727": "@SacramentoKings @Rich_Holmes22 This franchise is so bad. If only they drafted Luka...",
    "728": "@SacramentoKings @Rich_Holmes22 Pitiful fucking franchise, something has to change",
    "729": "The LAKERS will finish November 8-8 after a comeback from 14 points down on the road in Sacramento. LAKERS 117 Kings 92 as the LAKERS out score the Kings 67-33 in the 2nd half. Anthony Davis had 25 points, Russell Westbrook added 23 points and Malik Monk with 22 points in the win",
    "730": "No triple-overtime needed. The Los Angeles Lakers walked into Golden 1 Center and embarrassed the Sacramento Kings Tuesday night by a final of 117-92. It was a pathetic showing by a Kings team that has now been blown out in back-to-back games. Here are six quick thoughts.",
    "731": "@SacramentoKings @Rich_Holmes22 i just feel bad for our team man, first 2 quarters were full of having fun and playin good then we just suck ass",
    "732": "#NBA | FT:\nSacramento Kings 92-117 Los Angeles Lakers\nFor more games, click the link below!\nhttps://t.co/IT7pYFdaVg https://t.co/MQffDVjgcd",
    "733": "@SacramentoKings y’all couldn’t give us the W at home could you? 😒",
    "734": "Wow what a come back from the #LakeShow from - 9 at 1/2 to win with a +25 against the #sacramentokings",
    "735": "@SacramentoKings something needs to change. Including the game  commentators. A Robitussin joke when Holmes turned his ankle? Sad.",
    "736": "@MarcosBreton @SacramentoKings The quickest way to turn a franchise around is for the fans to stay home...\nOwners hate an empty arena",
    "737": "LeBron James is put into NBA isolation after 'testing positive' for COVID: Lakers star won't play against Sacramento Kings tonight\n\nAnd he is fully vaccinated, this whole thing is fucked up.  https://t.co/Vf9lxQOMv2",
    "738": "We suck @SacramentoKings",
    "739": "Sacramento kings are so useless i hate this team",
    "740": "@j_biegler @SacramentoKings @Vivek @joshhigh66 Nah walton is probably the worst coach in the league. Gentry ain’t that good either lol but these players aren’t good together and stop trying half the time. And idk wtf it up with fox and Haliburton",
    "741": "Typical @SacramentoKings !!! Not even surprised",
    "742": "Me watching that second half trash the @SacramentoKings  put out.\n\n#TheyDontWantIt https://t.co/x6iO1f0H3Q",
    "743": "Final: Lakers 117, Kings 92.\n\nLakers fans were super loud during a second half in which LAL held Sacramento to just 33 points to run away with the road win and get back over .500 on the season.",
    "744": "LA Lakers swim past Sacramento Kings 117-92 Anthony Davis 25points 7rebounds 3assists.",
    "745": "Sacramento Kings thought they were Gods from another World by beating Los Angeles Lakers in triple overtime. They tried to punish Lebron James.\n\nTonight, the Kings lost to the Lakers, without Lebron James playing.\n\nBe careful when you talk about one of greatest players in the NBA",
    "746": "You just got punked like the bitch you are on your own home court. Disgraceful @SacramentoKings",
    "747": "@Lakers defeat @SacramentoKings by a 25 point lead #LAKERSWIN #LakersShow \n\n@KingJames has said it final",
    "748": "Movie starts on the side lines. Musicians. All spoiled rotten with World star basketball players. And the Sacramento kings still had you shaking in your boots lmao.",
    "749": "@stillwhohei @SacramentoKings @Rich_Holmes22 @Chimezie_Metu Nothing but pain…",
    "750": "@SacramentoKings  fucking suck.. no ♥️… how embarrassing..",
    "751": "@SacramentoKings THEY DIDNT POST THE FINAL SCORE LMAO",
    "752": "Big W for the @Suns! 🔥\n\nHaven’t lost a game since October 27 against @SacramentoKings with Harrison Barnes’ game winner. Fans stayed patient with a 1-3 record and haven’t looked back since. https://t.co/cSmL6d11nN",
    "753": "The Lakers who lost at home to the Kings last Friday in 3 overtimes (as LeBron missed TWO game-winners) just won the second half at Sacramento 67-33 without LeBron. Hmmm.",
    "754": "@SacramentoKings send the loss tweet",
    "755": "@Raidernugg209 @SacramentoKings All bad bro",
    "756": "sacramento kings' fans are so extreme 😂 chill and suffer it's not so bad man, enjoy the hoops",
    "757": "@SacramentoKings @vivek y’all are embarrassing",
    "758": "@SacramentoKings postgame show starts &amp; all you see are @Lakers jerseys",
    "759": "If @Vivek is angry that @SacramentoKings fans have left the arena and it has been taken over by Lakers fans he has no one to blame but himself for this mess of an organization.",
    "760": "Pathetic and embarrassing, even for the @SacramentoKings.  Off to cancel single team pass because I’d rather have $18 than watch these horrible games.",
    "761": "@MarcosBreton @SacramentoKings Demand Vivek to sell. His ownership is worse than the Maloofs.",
    "762": "LAAAAAAAAAAAAAAAAAAAAAAAKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKEEEEEEEEEEEEEEEEEEEEEEEEEEEEEERRRRRRRRRRRRRRRRRRRRRSSSSSSSSSSSSSSSSSSS WIIIIIIIIIIIIIIIIIIIIINNNNNNNN\nLOS ANGELES LAKERS 117 X 98 SACRAMENTO KINGS",
    "763": "@TSpencerNairn @itsmygame @Raptors To bad the prices can't be what they were when I was a kid back in the 1970's like when we had The Kansas City Kings who are in Sacramento now. GO RAPTORS.",
    "764": "Tell me the excuse tonight.\nBlow it up @SacramentoKings",
    "765": "@LakersNation Well, Kobe was a co-owner (with Shaq) of the Sacramento Kings for many years.",
    "766": "@stillwhohei @SacramentoKings @Rich_Holmes22 @Chimezie_Metu Don’t even care about the Kings tho",
    "767": "@Libruary_NFT @hbarnes @TyHaliburton22 @hoopculture13 @SacramentoKings @ChewieWoolf @nbatopshot Love this!!!",
    "768": "WHAT A GREAT GAME @Lakers  @SacramentoKings",
    "769": "the lakers without lebron james just had their most convincing win of the season. a certified sacramento kings moment",
    "770": "I’m convinced I’m a sacramento kings fan still because I’m not very keen on the whole self love thing. My god this team.",
    "771": "Final: Lakers 117, Kings 92\n\nThe Lakers improve to 12-11 and 5-7 without LeBron James. LA outscored Sacramento 67-33 in the second half. This is the Lakers' largest margin of victory this season -- and just their third double-digit win.\n\nUp next: vs. the Clippers on Friday.",
    "772": "Who you gonna fire now?\n@SacramentoKings",
    "773": "The Lakers outscore the Kings 67-31 in the second-half to win 117-92 on the road in Sacramento. Anthony Davis led the way with 25 PTS and 7 REB. Russell Westbrook finishes with 23-5-6.\n\nThe Lakers bench outscored that of the Kings 58-20.",
    "774": "Why do bad things (losing) happen to good people (the Sacramento Kings)",
    "775": "Ugly loss makes me siiick @SacramentoKings",
    "776": "#sacramentokings @ Golden 1 Center https://t.co/bmhlFIEfZZ",
    "777": "If the #DreamTeam from the 1992 Olympics played for the @SacramentoKings , in their prime, they'd still only get 30 wins",
    "778": "Sacramento Kings fans deserve better.",
    "779": "@Michael98770048 @tailorgang1984 @SacramentoKings Didnt want to draft Luka because they had Fox then proceed to draft Haliburton and Davion. Braindead franchise",
    "780": "E'Aaron Fox ain't got no D! #tradefox @mmcnair @SacramentoKings",
    "781": "Pathetic but so predictable.\n@SacramentoKings",
    "782": "@SacramentoKings take the franchise to Seattle.",
    "783": "This doesn't look like a player worth a max contract. Our \"best player\" has zero heart, accountability and leadership skills.\nDisgusting hearing all these Laker fans in our building.\n@SacramentoKings @Vivek @mmcnair https://t.co/gXzF9gm05j",
    "784": "@SacramentoKings where’s that same energy from Friday?",
    "785": "I really wanted to renew my season tickets, but this is just too much to take. Time to bow out. 👋🏽 #sacramentokings",
    "786": "Gotta feel bad for that poor franchise —-&gt; @SacramentoKings 👀 https://t.co/KahBOM0icz",
    "787": "Wayne Ellington contra o Sacramento Kings: https://t.co/5GsnsBXY8h",
    "788": "Loud LETS GO @LAKERS chants in Sacramento 😂 #lakers #kings",
    "789": "I know you hear those “Let’s go @Lakers”chants in your own arena. 😂 @SacramentoKings",
    "790": "I Know more laker fans than kings fans living in Sacramento lol the chants don’t surprise me at all #LakeShow",
    "791": "The Sacramento Kings should send the Suns and the Warriors a thank you note for keeping our attention tonight",
    "792": "F*ck them @SacramentoKings https://t.co/9WHYHXG5w0",
    "793": "@Mikeweisberg @PokerProErik @Libruary_NFT @hbarnes @TyHaliburton22 @hoopculture13 @SacramentoKings @ChewieWoolf @nbatopshot I was wondering why chewie was so quit on twitter!",
    "794": "I love when the Lakers beat the Kings in Sacramento. 💜💛💜💛",
    "795": "@Matt_Barnes22 @SacramentoKings @Lakers You called it bro",
    "796": "Best description I can give for my @SacramentoKings is bipolar…completely bipolar….I’d start trading some guys myself and NOBODY is safe except Holmes…NOBODY but that’s just imo",
    "797": "@ElPincheSal @SacramentoKings The Seattle Kraken arena now has the luxury boxes needed for NBA teams. Just pack up in the dead of night, the way the Baltimore Colts snuck out of town.",
    "798": "@SacramentoKings take the Kings out of your team name",
    "799": "Time to hit the reset button  @SacramentoKings",
    "800": "@SacramentoKings year in and out I experience being apart of the shittiest franchise of the NbBA",
    "801": "Let's go Lakers chants roaring in Sacramento. Man, can you believe the Kings haven't made the playoffs since 2007. They're practically the Mariners of the NBA. #LakeShow",
    "802": "@SacramentoKings ya'll are false kings, Lebron is the real king smdh",
    "803": "@Michael98770048 @SacramentoKings Fox is hot garbage",
    "804": "@Matt_Barnes22 @SacramentoKings @Lakers Love to see it",
    "805": "Loud Lakers chants in Sacramento. Those old Kings teams must be embarrassed. 😬",
    "806": "@Matt_Barnes22 @SacramentoKings @Lakers The infamous 3rd qtr has been around since bush administration 🥴🤙🏾",
    "807": "Lakers fans completely take over Sacramento kings arena. Lol",
    "808": "Is Fox trying to lose a game on purpose??? 7 turnovers! What is wrong with him this season?  #sacramentokings",
    "809": "@ElkGroveNews @SacramentoKings Kings games are so much fun but I can imagine it’s entirely different now with Covid.",
    "810": "@SacramentoKings I think this is the worst kings team I have seen yet",
    "811": "@Matt_Barnes22 @SacramentoKings @Lakers Lakers showed more energy and effort the second half!",
    "812": "@danieltyree @SacramentoKings I mean all of my teams apply",
    "813": "@tailorgang1984 @SacramentoKings The spacing is awful. Haliburton and fox don’t play good together. I would trade fox obviously. He’s good but not going to win anything alone. Mitchell also plays too much. It’s like they went out and drafted a black jimmer.",
    "814": "@toffhibee By “sports,” do you mean the @SacramentoKings ? They only loosely fit the term.",
    "815": "@Logan96979691 @SacramentoKings @Rich_Holmes22 @Chimezie_Metu true but let's not act like qw had the game to 11 just now and fox came in and turned the ball over 2 times and missed an elbow jumper that he created space for... poor shooting in the second half i think we missed 20 straight fg attempts",
    "816": "I feel genuinely bad for Sacramento Kings fans.",
    "817": "Even though the @SacramentoKings have effectively lost with about 3 minutes to go - they just gave up - these behind-the-backboard seats are consistently empty. https://t.co/sgPQDfImaQ",
    "818": "I'm done watching this tonight. The Sacramento Kings other than Richaun Holmes have zero heart. Not worth investing my time and money into the product if the players don't care. Blow it the fuck up!!!\nNot #SacramentoProud",
    "819": "That overwhelming sound that you hear is one of two things:\n\n1. The large quantity of Lakers fans in attendance at Golden 1 Center cheering as their team pummels the Kings\n2. The rest of the NBA laughing at Sacramento's expense",
    "820": "@SacramentoKings are losing because they have a stupid coach.",
    "821": "Tale of Two Halves … Basketball is a game of runs &amp; the @SacramentoKings weren’t ready when the @Lakers made a run in the second half.. Lakers have out scored the Kings 55-27 in the second half 🤦🏽‍♂️",
    "822": "Kings 6/26 from distance tonight. Just 27 points scored by Sacramento in this second half with 3:57 to play",
    "823": "@SacramentoKings kindly donate in the comments!!! Go @Lakers https://t.co/5Vd7RpJRBt",
    "824": "@SacramentoKings @Rich_Holmes22 @Chimezie_Metu just to lose by 20+\nthe WORST team in NBA, by far\n🗑️",
    "825": "@CaveManVampire @SacramentoKings May have to pass. Lol",
    "826": "@PokerProErik @Libruary_NFT @hbarnes @TyHaliburton22 @hoopculture13 @SacramentoKings @ChewieWoolf @nbatopshot PPE didn't know about this? https://t.co/4yjd6teIzq",
    "827": "Oh we smoking on that #sacramentokings pack tonight b🚬 😂😂\n\n #lakeshow #lakersnation #NBATwitter #NBA75 #NBA75",
    "828": "@Libruary_NFT @hbarnes @TyHaliburton22 @hoopculture13 @SacramentoKings @ChewieWoolf @nbatopshot Go kings... 😭",
    "829": "@Libruary_NFT @hbarnes @TyHaliburton22 @hoopculture13 @SacramentoKings @ChewieWoolf @nbatopshot Let's go!!!",
    "830": "@Matt_Barnes22 @SacramentoKings @Lakers We aren't made of it. We just layover and give up.",
    "831": "@SacramentoKings 🔥🗑 another lottery year….",
    "832": "@SacramentoKings Mitchell dribbles too damn much!",
    "833": "@SacramentoKings you guys are an embarrassment",
    "834": "@Libruary_NFT @hbarnes @TyHaliburton22 @hoopculture13 @SacramentoKings @ChewieWoolf @nbatopshot DANGGGG!! Thats so sick, getting a Daion jersey for Xmas, dudes defense is next level!",
    "835": "Well good night @SacramentoKings ….it was fun for awhile",
    "836": "@TebowCouch @SacramentoKings They shoulda done that years ago",
    "837": "Why do I still watch @SacramentoKings games? It's pointless and dejecting.",
    "838": "@SacramentoKings man I thought we had a chance tonight 😔 lol",
    "839": "@ElPincheSal @SacramentoKings Or, and hear me out, they could move to Seattle with a new owner",
    "840": "@SacramentoKings Hield is such a scrub. I get he can shoot, but he’s so bad on defense. He should be buried on bench. Mitchell too, I bet he’s a rookie, but he’s like a black jimmer.",
    "841": "i dont want to watch the sacramento kings play basketball anymore",
    "842": "The Kings just embarrassing Sacramento as a city. Nothing new here",
    "843": "@SacramentoKings fuck you",
    "844": "Hey @SacramentoKings, do us all a favor and fold as a sad pathetic franchise. Thanks\n\n“#SacramentoProud”",
    "845": "Running on fumes after 15 hours of travel, but I made it to Sacramento to see @hbarnes, @TyHaliburton22, and @hoopculture13 at a @SacramentoKings game with @ChewieWoolf. We're in row 6, maybe we'll be in a @nbatopshot Moment? #NBATopShotThis https://t.co/41VEairA18",
    "846": "Another crappy night for the @SacramentoKings - nothing new there, But Have you noticed the consistent number of empty lower-level seats? That has been consistent all season. https://t.co/1mekpaD4xr",
    "847": "Still a chance for my @SacramentoKings I knew Walton wasn’t all of the problem…but I really think gentry has them playing fast and better…but for some reason we just can’t put it all together…I don’t know I really don’t we shouldn’t have lost this game after playing so well",
    "848": "Fucking weak ass mfs @SacramentoKings 😒",
    "849": "Sacramento Kings is the most stagnant team in the NBA. No progress in the last 10 years!",
    "850": "Hey @SacramentoKings The fans deserve better.. #SacramentoProud",
    "851": "The Hound scored 2 blocks against the Kings of Sacramento. All Time Great Jeff Van Gundy commented \"the things we do for love\"",
    "852": "@SacramentoKings \n\nPlease trade @Rich_Holmes22 &amp; @swipathefox to a team where their effort and talent can be utilized. No need to waste their time and talent in this franchise",
    "853": "@SacramentoKings make me wanna kms",
    "854": "@mdbenson07 @SacramentoKings I’m no expert, but that doesn’t sound good to me",
    "855": "@NBAFantasy For context, they are playing the SACRAMENTO KINGS!!!!!",
    "856": "The Refs in the @SacramentoKings  game need to be fined and all given eye test. @DwightHoward  has been Mack trucking all night long and the refs letting the dinosaur gateway with it. #STOPBABYINGTHELAKERS #REFSAREPAIDED #SCREWJOB",
    "857": "@KyleDraperTV just said “Kyle’s Guy of the Game”, and it made me miss seeing @kylejguy in a @SacramentoKings uniform. 😔",
    "858": "@MarcosBreton @SacramentoKings Announcer called the Kings’ 3rd quarter “cataclysmic” and “indecorous.” DAMN! That’s bad, right?",
    "859": "#lakersnation #lakeshow we need Vogel OUT OUT!!!!!! \n\n#lakers #NBA75 #sacramentokings https://t.co/1xRuk3cZYa",
    "860": "Boy, the @SacramentoKings suck. @Golden1Center has plenty of empty seats. One losing season after another may have taken their toll on the fan base.",
    "861": "I dare you to try to knock out our HBK @SacramentoKings 😡",
    "862": "Poor @SacramentoKings announcers trying to paint lipstick 💄 on this pig 🐷",
    "863": "Just trade everyone… No one has any deep connection to anyone on this @SacramentoKings team anymore - besides maybe Holmes.  Seriously, no one is going to care 2 squirts about who stays and who goes.",
    "864": "@Matt_Barnes22 @SacramentoKings @Lakers I read this when I was at work, now I’m at home watching the game and you called it. 😡😡😡",
    "865": "@SacramentoKings yea y’all blew it 😂😂",
    "866": "Some of the worst basketball you’ll ever witness. 3rd quarter and 4th quarter of tonight’s @SacramentoKings game.",
    "867": "@ghoops3 @SacramentoKings Don’t want to stick around for a recap by Matt Barnes?? Isn’t that worth staying tuned in?",
    "868": "@Matt_Barnes22 @SacramentoKings @memgrizz @Lakers @KingJames These guys are like Jekyll and Hyde, you never know what your going to get with the Kings.",
    "869": "@SacramentoKings really falling down for no reason just to gain some free thrown on @Lakers 😤",
    "870": "The Sacramento kings are no joke an embarrassment to basketball",
    "871": "15 points in the 3rd for Sacramento..Luke Walton is probably happy he was let go...#LALvsSAC #SacramentoProud @SacramentoKings",
    "872": "Massive 3rd Quarter for @Lakers:\n \nLakers 87-74 Kings, outscored the @SacramentoKings\n 37-15! 🔥\n\n#NBA75 https://t.co/zsF9iLWnBk",
    "873": "Where’s Fox? @SacramentoKings",
    "874": "@NBA @swipathefox @SacramentoKings Great job!",
    "875": "ALERT: New high roller bet posted!\nA bet has been placed for $5004.73 on Sacramento Kings - Los Angeles Lakers to win $6,356.01.\nTo view this bet or copy it https://t.co/3ExzMrCbOV https://t.co/3JgA71DkvA",
    "876": "@SacramentoKings pathetic!!! You all quit tonight!!!! I am done with you all!!! When that loser @Vivek sells his stakes give me a call",
    "877": "Like Iv been saying I ain’t spending a single $ on this clown franchise again until things change @SacramentoKings",
    "878": "@SacramentoKings Just tonight?",
    "879": "Sacramento kings is straight 🗑 @SacramentoKings",
    "880": "The @Lakers owe us a fucking blow out, and the @SacramentoKings are going to be our first of many. I had a dream",
    "881": "Watching the Sacramento Kings basketball is like smoking meth.",
    "882": "same play same play same play same play\ndribble dribble dribble dribble\nWhat the hell is this team?\n#SacramentoKings",
    "883": "@momoragan The @SacramentoKings have been pushing shots and second guessing good looks. Plus not sharing. Team needs to wake up or walk off floor.",
    "884": "Hearing the handful of kings fans ringing the cow bell at the Sacramento Kings home court is just really sad now, but I get it.  Trying to recapture that long lost magic of those late 90’s/ early 2000 teams. #LakeShow #lakers",
    "885": "Lmao yall stink @SacramentoKings",
    "886": "It makes no sense and yet happens way too often. Sacramento goes away from what works and settles for iso sets &amp; chucking threes. Kings are 6/24 (25%) from 3pt range by the way.",
    "887": "@SacramentoKings at there finest two Quarters of hoop and quit",
    "888": "@miseleccionmx logo looks bootleg, @SacramentoKings still suck. Just a regular ass Tuesday https://t.co/YV6ijPBysp",
    "889": "sacramento kings legend rajon rondo",
    "890": "@SacramentoKings worst 3rd quarter swing EVER… We stink",
    "891": "@Matt_Barnes22 @SacramentoKings @Lakers Sounds like you played before #greatcall",
    "892": "@MarcosBreton @SacramentoKings Start with Vivek.",
    "893": "A great 3rd quarter for the LAKERS as we out score the Kings 37-15 in that 3rd frame to now lead 87-74 over Sacramento. The LAKERS would finish the quarter on a 35-8 scoring run as well. Anthony Davis with 23 points and Malik Monk is a game high +/- of +19 as he has 15 points.",
    "894": "@SacramentoKings Joke franchise. Joke account. Team is trash.",
    "895": "The @Lakers outscored the @SacramentoKings 37-15 in the third quarter.",
    "896": "Welp fellow @SacramentoKings fans after playing just fantastic….we’re falling apart…still plenty of time not throwing in towel…but for Christ sakes ….just another night being a kings fan I suppose",
    "897": "37-15 is a classic Sacramento Kings 3rd quarter score",
    "898": "@Matt_Barnes22 @SacramentoKings @Lakers Sheesh. Guess we have our answer.",
    "899": "@Justin21LAL And you underestimate ours 🤣🤣 we’re the Sacramento Kings after all.",
    "900": "The @SacramentoKings might as well play all road games with the way the officials favor the opposing team no matter what. The kings don't get home court advantage #NBA75",
    "901": "@Lakers came out in the 3rd quarter and went on a run against the @SacramentoKings can the kings get back in this? 87-74 lakers",
    "902": "@SacramentoKings You guys are terrible",
    "903": "There’s nothing salvageable about the @SacramentoKings.  As ever, the longer you wait to blow it up, the worse it’ll get.",
    "904": "Kings were up 14 with 9:26 in the 3rd.\n\nLakers are up 13 headed into the 4th.\n\nSacramento in the 3rd: 4-18 FG, 0-6 from 3 and outscored 37-15",
    "905": "Worst quarter of bball I've ever seen 😳 @SacramentoKings",
    "906": "@MarcosBreton @SacramentoKings Starts with Vivek and then Vlade.",
    "907": "@SacramentoKings absolutely embarrassing to be a fan of yours.",
    "908": "Bums @SacramentoKings",
    "909": "The Sacramento Kings ain’t shit.. #SacramentoProud",
    "910": "It's like they just give up . @SacramentoKings @FCartoscelli3",
    "911": "This has to be Walton’s fault, right? \n@SacramentoKings",
    "912": "Pelicans can beat the Clippers yet the Kings are struggling with the Lakers? Why do I put my trust in Sacramento? Kings you have 12 minutes to make this right",
    "913": "the Sacramento Kings are my 13th reason why https://t.co/eWExN3zzbu",
    "914": "@MarcosBreton @SacramentoKings 6-22 on 3 pointers , we are a small ball team that can’t shoot",
    "915": "@SacramentoKings how do we miss this many free throws???? Count em",
    "916": "🚨 UPDATE: Chimezie Metu - Sacramento Kings has a Double Double\n1:09 3rd\n10 PTS\n10 RBD\n3 STL\n[FD(31) DK(30)]",
    "917": "LeBron James has been placed in the NBA’s health and safety protocols and was ruled out for the Los Angeles Lakers’ game against the Sacramento Kings on Tuesday night. https://t.co/eHAsn9ypfo",
    "918": "@MarcosBreton @SacramentoKings Made the mistake of tuning in for the 3rd quarter. Misery",
    "919": "@MarcosBreton @SacramentoKings You think they'd mind putting the TNT game on in the arena on the big screen? 😂🤣",
    "920": "Sacramento Kings\n#SacramentoProud https://t.co/kxv1WfoLmv",
    "921": "I can’t take this shit @SacramentoKings",
    "922": "So frustrating being a @SacramentoKings fan. I’m just over it. Losing in the most kings way. I fucking give up. #SacramentoProud",
    "923": "@Ballislife @SacramentoKings @TheDougChristie Doug Christie would get TORCHED by Kobe on the regular !  \nDid we forget when Kobe brushed the dirt off his shoulder on him ?",
    "924": "@SacramentoKings @NBA complete bullshit that an official can't get the fuck outta the way and let's a player turn his ankle by stepping on his foot",
    "925": "So proud of this dude!!! 👏🏻big moves being made!!! Congratulations man! @SacramentoKings made one hell of a good choice! https://t.co/TfheR81hSn",
    "926": "@lilainla Actually dodging notable LeBron stopper Marvin Bagley of my Sacramento Kings",
    "927": "@Matt_Barnes22 @SacramentoKings @Lakers Let @Rich_Holmes22 play the entire game #48minutes",
    "928": "Ok @SacramentoKings ….time to show you got some nuts ….they’ve come all the way back what are we gonna do",
    "929": "Timeout Kings as the LAKERS have come all the way back from 14 points down to take the lead here in Sacramento. 4:37 left in the 3rd Q and it's now the LAKERS 74 Kings 72.",
    "930": "Los Angeles Lakers star LeBron James won't play Tuesday against the Sacramento Kings after entering the NBA's health and safety protocols, the team announced, according to Ross the Boss #LeBronJames #mfsn",
    "931": "@Matt_Barnes22 @SacramentoKings @Lakers Lakers are not missing. Scoring every trip",
    "932": "Third quarter blues once again for the Kings. Lakers use a 24-13 start to the quarter to capture the lead in Sacramento 74-72 with 4:37 left in the 3rd. LA matching their only lead of the game.",
    "933": "@Matt_Barnes22 @SacramentoKings @Lakers here's that run....",
    "934": "@SacramentoKings  @MarkJonesESPN  that's the kings we know and love",
    "935": "#GUARANTEED IF THE #LAKERS LOSE TO THE #SACRAMENTOKINGS TONIGHT. THE COACH GETS #FIRED",
    "936": "@Ballislife @SacramentoKings @TheDougChristie Fire",
    "937": "Game of #Runs\n@SacramentoKings vs @Lakers",
    "938": "@SacramentoKings @Rich_Holmes22 @Chimezie_Metu Did @TyHaliburton22 forgot how to shoot? Stat sheetin with TOs. Ur no Westbrook. Stop shootin bricks",
    "939": "How can you have 5Allstars playing against Sacramento kings and still down by 8",
    "940": "Lest go @SacramentoKings https://t.co/W97VtB2NH0",
    "941": "Don’t lose to the @SacramentoKings Lakers....",
    "942": "Why are the Sacramento kings cooking the lakers 😐",
    "943": "@Number9IsDaLife @LakersNation What benefit would the league have to have the refs be biased against the lakers when they are playing the Sacramento kings",
    "944": "@HonestSacFan @PatrickKilken55 @SacramentoKings @TheDougChristie Real one https://t.co/GbsiKYgJCi",
    "945": "@Mista_Bayor You're getting your ass kicked by fucking Sacramento kings but you're worried about my team, the best in its conference. you're so funny mann",
    "946": "Lakers are 4-7 without LeBron, down 6 to the Sacramento Kings, could be on the verge of going under .500, and Russ is rocking the baby on a made basket\n\nI hate it here",
    "947": "Sorry but a team with Anthony Davis-Russell Westbrook-Carmelo Anthony-Dwight Howard shouldn't need Lebron James to beat 8-13 @SacramentoKings team whose arguably best or 2nd best player @hbarnes isn't even playing. Fact Barnes is at worse Sac 2nd best player is bad enough #NBA",
    "948": "@Colton__Mc @SacramentoKings @TheDougChristie Real one https://t.co/GbsiKYgJCi",
    "949": "@SacramentoKings what app do I use to upgrade my seats? Help a fan out!",
    "950": "@SacramentoKings @TheDougChristie Is that Doug Christie???",
    "951": "You know this Sacramento kings team is actually very impressive who would have thought the coach could have been the problem for this young and rising te- WHO AM I KIDDING THIS LAKERS TEAM IS GOD AWFUL.",
    "952": "@nba @SacramentoKings look at all those open seats lower level , damn shame #greed",
    "953": "Seeing all the empty seats at the @Lakers @SacramentoKings game tonight is just a reminder what a pathetic job @Vivek has done as an owner.",
    "954": "@NBA @Lakers @SacramentoKings It's really amazing. I was watching a b ball tourney on tv right after the pandemic started and saw quality basketball with undrafted players and former collegiate's. They all had great form but so many misses. To watch this makes me realize how much God given talent they have",
    "955": "@Matt_Barnes22 @SacramentoKings @Lakers The lakers are being so passive… they need to attack the paint.. Westbrook needs to play above the rim.. stop throwing silly lobs all the time and forcing the ball inside when the defense clearly collapses on AD… and work Melo into the game move on offense and guard the 3!",
    "956": "@WestGoat @NBA @Lakers @SacramentoKings Hahahaha flakers fans said he was the secret weapon a few weeks ago",
    "957": "@Matt_Barnes22 @SacramentoKings @Lakers I love you so much!!! You’re one of my favourite players ever! I’ll never forget what you did for that 07 We Believe Warriors team, and of course your time with the Lakers during the 2011 and 2012 seasons",
    "958": "@Lionsbadboy @NBA @Lakers @SacramentoKings They already lost to the thunder twice. That’s enough to know they’re ass",
    "959": "Lakers Twitter:\n\nAD is a top 5 defender\n\n2021 Sacramento Kings:\n\n@iamSacTownKing https://t.co/FcyKdxd6Xr",
    "960": "@NBA @Lakers @SacramentoKings Lakers are ass dudes about to lose to the Kings twice",
    "961": "@NBA @Lakers @SacramentoKings Lakers dominating as usual since the kings are an overrated Mickey Mouse franchise",
    "962": "@NBA @Lakers @SacramentoKings Lakers are a poverty organization",
    "963": "I exceeded my report tweets. This the real deal @SacramentoKings #kings #dougchristie @TheDougChristie https://t.co/ifoIiq9KaR",
    "964": "@NBA @Lakers @SacramentoKings Scoreboard",
    "965": "Malik Monk buzzer beater from DEEP! \n\n@Lakers, @SacramentoKings second half set to begin on NBA League Pass: https://t.co/5QqkBhf1W0 https://t.co/S0DWgxA8HQ",
    "966": "Great first half for the @SacramentoKings outstanding…having Holmes back is a huge game changer….run and gun kings let’s go ! Keep it up gentlemen!!",
    "967": "Bruh how are the Lakers struggling against the Kings 🤬 THE SACRAMENTO KINGS?!?! HOWWWW?!?! 😭",
    "968": "@eaganr @Lakers @SacramentoKings Agreed. Love your site!",
    "969": "Solid 1st half for the @SacramentoKings but this a game runs.. @Lakers make a run in the 2nd half kings have to be ready for it. Defense &amp; Ball movement have been great for Sac tonight",
    "970": "@Ballislife @SacramentoKings @TheDougChristie WHERE DO I BUY THIS SHIRT?",
    "971": "@Slick_Jules @SacramentoKings @TheDougChristie Omg lol",
    "972": "INTERVALO\n\nLos Angeles Lakers 50 x 59 Sacramento Kings\n\nDESTAQUES:\n\nAnthony Davis: 13 pts | 4 reb | 1 ast\nDwight Howard: 10 pts | 6 reb | 0 ast\nCarmelo Anthony: 9 pts | 1 reb | 1 ast\nhttps://t.co/7INqbq5q1A",
    "973": "@SacramentoKings  make your tickets cheaper",
    "974": "By the way, Vogel is supposedly a Defensive Genius. This defensive genius couldn’t adjust against a basic pick and roll that ended up in six straight lobs against this offensive juggernaut called The Sacramento Kings.\n\nHis only adjustment is missing. His name is Avery Bradley.",
    "975": "@SacramentoKings @Rich_Holmes22 @Chimezie_Metu Kings come out with energy 👏🏻👏🏻👏🏻",
    "976": "Los Angeles Lakers' forward #LeBronJames has entered the NBA's health and safety protocols and will miss today's game against the Sacramento Kings, NBA said. LeBron, who is fully vaccinated, tested positive for #COVID19, according to TMZ Sports. https://t.co/hJ6zh3Q16c",
    "977": "@SacramentoKings @Rich_Holmes22 @Chimezie_Metu Plz keep owning the Lakers",
    "978": "@SacramentoKings @Rich_Holmes22 @Chimezie_Metu Beating the Lakers https://t.co/BLMWXI3VZO",
    "979": "Not a bad half from Sacramento. De'Aaron Fox has only taken five field goal attempts and the Kings lead by 9 at the break.\n\nIf Fox can get going and Holmes can continue to get good looks in the post, the Kings could create some real separation in the second half.",
    "980": "@SacramentoKings @Rich_Holmes22 @Chimezie_Metu 2-0 VS LAKERS LETS FINISH SACTOWN",
    "981": "\"Los Angeles Lakers Vs Sacramento Kings Live Play By Play &amp; Reaction\" on YouTube.. maybe mike D antoni mite be suit for tha lakers-  live chat comment\nhttps://t.co/7OZOTplT6q",
    "982": "Kings lead the Lakers 59-50 at the half in Sacramento. Malik Monk drills a deep 3 to beat the buzzer to end the half for LA. Kings led by 18 in the half, Richaun Holmes 12 points, 6 rebounds for Sacramento, who also got a nice boost from Chimezie Metu in the half with 10pts.",
    "983": "@fannyRbcc @SacramentoKings @TheDougChristie Need this🔥🔥",
    "984": "Kings lead the Lakers 59-50 at the half. Sacramento is outshooting the Lakers 55.6% to 43.5% with an 18-3 advantage in fastbreak points. Anthony Davis leads all scorers with 13 points. Richaun Holmes has 12 points and six rebounds.",
    "985": "\"Quicker than gossip\" ???🤔🤔🤔\n\nGets worse each game.\n\nHelp me with this @CarmichaelDave \n@SacramentoKings",
    "986": "Posted at the @Lakers vs @SacramentoKings game",
    "987": "LeBron James was suddenly ruled out of Los Angeles Lakers' game against Sacramento Kings on Tuesday (Wednesday, Manila time) after entering the NBA's COVID-19 health and safety protocols, the team announced.\n#FastbreakNews\n#NBA\nhttps://t.co/qMr24MCXfo",
    "988": "@Lakers playing so bad and without any ideas making @SacramentoKings look a legit team. Crazy that AD and Co gotten this low yet Front Office ain't firing Vogel's ass",
    "989": "The Sacramento Kings are feelin them selves..  #SacramentoProud",
    "990": "Good shit @SacramentoKings",
    "991": "@CodyBrown32 @SacramentoKings @TheDougChristie Can we just have one thing to celebrate? 😒",
    "992": "@Lakers Don't remember which sports commentator recently made the statement that \"This Is A Young Man's Game\", but the Sacramento Kings are proving it so far. @russwest44 is playing HORRIBLE!  \n@KingJames",
    "993": "SACRAMENTO KINGS BASKETBALL.\nhttps://t.co/TVLjDawPJ6",
    "994": "@SacramentoKings LeCovid could never",
    "995": "@PatrickKilken55 @SacramentoKings @TheDougChristie Where do you buy this?",
    "996": "@Matt_Barnes22 @SacramentoKings @memgrizz @Lakers @KingJames Kept hearings about revenge game. @Lakers are in deep s**t",
    "997": "Los Angeles Lakers vs. Sacramento Kings: Play-by-play, highlights and reactions https://t.co/fSGsBh5OT5",
    "998": "Sacramento Kings - Los Angeles Lakers\nPortland Trail Blazers - Detroit Pistons\nPhoenix Suns - Golden State Warriors\n\nBet slip link: https://t.co/CPvudvEgtt https://t.co/mDAbiJecvL",
    "999": "LeBron James has been placed in the NBA’s health and safety protocols and was ruled out for the Los Angeles Lakers’ game against the Sacramento Kings on Tuesday night.\n\nhttps://t.co/E9lj5W65yZ",
    "1000": "It's always a battle when it's @Lakers vs @SacramentoKings  🍿✊🏽 #GottaLoveIt",
    "1001": "Win the game @SacramentoKings ! I need Vogel gone yesterday",
    "1002": "@ShannonSharpe Russell Westbrook WHAT A Terrible Trade  .. 5 Points &amp; 4 Turnovers Against The Kings. Against Sacramento Kings For God's Sake. The Kings.  5 Points &amp; 4 Turnovers. With No Assists Or Rebounds Against The Kings 🤷🤷🤷",
    "1003": "It’s the middle of the 2nd quarter snd it’s garbage time at the @Golden1Center \n\n@SacramentoKings  45   @Lakers 38\n\n#Turnovers\n#MissedLayups\n#PoorShotSelection\n\n@NBA",
    "1004": "I was certainly disappointed in the Memphis game….but with Holmes back the kings are a different team absolutely the hart and soul of the @SacramentoKings",
    "1005": "LeBron James has been placed in the NBA's health and safety protocols, and was ruled out for the Los Angeles Lakers' game against the Sacramento Kings on Tuesday night. Such a move almost certainly means one of two things: that James, who said earlier\n\nhttps://t.co/rcyi3JKWZH https://t.co/nvKRtROxST",
    "1006": "I did not buy the Lakers team pass to watch us lose to the Sacramento Kings back-to-back!!",
    "1007": "i know facing a defensive stalwart such as the sacramento kings makes it tough but",
    "1008": "My sleep is better than this eyesore. Sacramento kings fgs!!!!",
    "1009": "Lakers beat the kings with no bron or AD last year in Sacramento btw",
    "1010": "@Audrey_Pizza007 @SacramentoKings @TheDougChristie Dats disrespectful champ",
    "1011": "Y’all want another 1 of our soon to be old coaches ??? @SacramentoKings",
    "1012": "@Lakers We do horrible as a team. Think I gotta give up hope until I see at least 3 wins in a row. We loosing to @SacramentoKings 😰😰",
    "1013": "@SacramentoKings Win this game!!! Thanks!",
    "1014": "Matt Barnes on the sacramento kings broadcast now? Lmao not even mad at that.",
    "1015": "@SacramentoKings @TyHaliburton22 Kings really own lafraud 😂😂",
    "1016": "@SacramentoKings dunking on the @Lakers every other possession",
    "1017": "@SacramentoKings You gave an Anthony Davis steal to Horten-Tucker. I shouldn’t have to sweat incorrect score keeping",
    "1018": "@SacramentoKings @TyHaliburton22 @Rich_Holmes22 Let's goooo! https://t.co/d2KooUv9pJ",
    "1019": "This is the worst Lakers team I have seen in a long time. \n\nImagine being hammered by Sacramento Kings. Being bullied by these set of players should make you retire.",
    "1020": "@SacramentoKings @TheDougChristie Does anybody other than bots know where to get this shirt?",
    "1021": ".@SacramentoKings some self alley-oops by your players to entertain us please?",
    "1022": "Want to see the @SacramentoKings take on the @OrlandoMagic on December 8th at @Golden1Center? Listen LIVE in 15 minutes for your shot to WIN a pair of tickets! 🏀 https://t.co/t0zuctjrjU",
    "1023": "let’s go @SacramentoKings 🤣🤣",
    "1024": "@PatrickKilken55 @SacramentoKings @TheDougChristie Yo where did you get it from",
    "1025": "Sacramento looking to capitalize against the Lebron-less Lakers\n\nKings  (+135) lead 28-20  \n\nhttps://t.co/fPrOYgyUDg",
    "1026": "The LAKERS will use their 3rd timeout of the game already. 10:05 to go in the 1st half and the Kings have opened up a 12 point lead over the LAKERS. Sacramento 34 LAKERS 22 as the Kings get an easy slam dunk.",
    "1027": "Los Angeles Lakers' LeBron James is out for Tuesday night's game against the Sacramento Kings due to NBA's COVID-19 health and safety protocols.  https://t.co/HEzSNt0urS",
    "1028": "Sacramento Kings vs LA Lakers\n\nOR\n\nGolden State Warriors vs Phoenix Suns\n\nWhy don't I have 2 TVs now? 🤣🤣🤣🤣",
    "1029": "The Kings are jumping the passing lanes on every possession. Fun to watch. 9-2 lead in fastbreak points. 7 steals already for Sacramento.",
    "1030": "If there's one knock on Sacramento's L. King it's that those X's and O's, they haunt him.",
    "1031": "The @SacramentoKings look so much better without Luke Walton as coach it’s incredible to watch",
    "1032": "Sacramento Kings vs Los Angeles Lakers is on Spectrum SportsNet. Reporter is Mike Trudell.  For more details see https://t.co/ya4twvGxsW #SacramentoKings #LosAngelesLakers #SpectrumSportsNet",
    "1033": "Between Sacramento and Los Angeles, it's FUCK THE KINGS kind of night",
    "1034": "@SacramentoKings @TheDougChristie imma need that fuk what pretty ricky talking bout 🔥",
    "1035": "After 12 minutes of action in Sacramento it's the LAKERS down 28-20 to the Kings. The LAKERS are 0-5 from deep and only 40% from the field. Also, 8 turnovers for the Purple and Gold in that 1st Q. We need to take care of the ball better. Sorry to sound like a broken record.",
    "1036": "Kings lead the Lakers 28-20 after the opening quarter. Davion Mitchell with 8 points for Sacramento, Anthony Davis 9 for the Lakers. Russell Westbrook with 4 turnovers in that period, De'Aaron Fox had 3",
    "1037": "Good start for the Kings, who lead the Lakers 28-20 after 1Q. Kings shooting 54.5% overall and 4 of 10 from 3-point range. Lakers shooting 40% from the field and 0 of 5 from 3-point range. Sacramento has a 9-2 advantage in fastbreak points.",
    "1038": "Against the sacramento kings man lol 😭 come on dawg #lakeshow",
    "1039": "@SacramentoKings @Verizon @swipathefox @TyHaliburton22 @TerenceDavisJr @Chimezie_Metu @Rich_Holmes22 Where is Neemias?",
    "1040": "Imagine if the Lakers lost to the Sacramento Kings, again\n\nThat would be quite funny I would think",
    "1041": "@PatrickKilken55 @SacramentoKings @TheDougChristie The inspiration! https://t.co/rGF8WzsXmf",
    "1042": "Sacramento Kings are doing some idiotic things.. smh",
    "1043": "Sacramento move the kings to Baltimore Baltimore kings sounds tuff color scheme on point",
    "1044": "NW:@Lakers vs @SacramentoKings #LakeShow",
    "1045": "Lakers selling out there in 1st Quarter Buckets trailing 13-24 to the fucking Sacramento Kings https://t.co/1aMKhckO0j",
    "1046": "@ChewieWoolf @SacramentoKings I’m interacting, but if you get them you should definitely take your son",
    "1047": "Embarrassing … @SacramentoKings completely dominating the @Lakers on both sides of the ball.\n\n#NoDefense #NoHustle #NoLeBronJames",
    "1048": "Why can’t the Sacramento Kings play like this all the time 😩 #SacramentoProud",
    "1049": "Beat their ass @SacramentoKings I’m over it. Sorry ass team.",
    "1050": "@sacteown @jaimeurban6 @Ballislife @SacramentoKings @TheDougChristie He was what now",
    "1051": "@WyreseWalliburt @shenjoo @SacramentoKings @Verizon @swipathefox @TyHaliburton22 @TerenceDavisJr @Chimezie_Metu @Rich_Holmes22 What’s wrong with bagley?",
    "1052": "@Jon__Bradley @SacramentoKings Don’t forget memes"
}