{
    "0": "San Antonio Spurs (-2.5) vs. New Orleans Pelicans! #WBD #PorVida #NBA #NBATwitter #NBA75",
    "1": "PREVIEW\n\nNew Orleans Pelicans @ San Antonio Spurs\n\nhttps://t.co/gdVzINFZSZ",
    "2": "New Orleans Pelicans’ Zion Williamson suffers setback in recovery from foot surgery https://t.co/t8MUPI49Re",
    "3": "#Sports #TopStories Zion Williamson Is Still Not Ready: Bad news for New Orleans Pelicans as Zion Williamson is still not ready for first-team action and might take a few more months. Just when it was assured that Zion would return to the Pelican… https://t.co/DlCRHvdMC2",
    "4": "New Orleans Pelicans Starters:\n\nDevonte' Graham\nBrandon Ingram\nJosh Hart\nHerbert Jones\nJonas Valanciunas\n\nPlayers out:\nDaulton Hommes\nDidi Louzada\nZion Williamson\n#WBD #NBA #NBATwitter #NBA75",
    "5": "Tonight's starting lineup for the New Orleans Pelicans: Graham, Hart, Ingram, Jones, Valanciunas https://t.co/bVWH4AMCA2",
    "6": "Detroit Pistons - Brooklyn Nets\nSan Antonio Spurs - New Orleans Pelicans\nOklahoma City Thunder - Dallas Mavericks\n\nBet slip link: https://t.co/GBj05kwXFC https://t.co/xKYHNtTXv2",
    "7": "When #Pelicans beat writers ask @OverACheatah about Zion’s future in New Orleans: https://t.co/vmUIiUOh2R",
    "8": "NBA Games Today: 🔥🔥🔥\nMilwaukee Bucks vs New York Knicks\nBrooklyn Nets vs Detroit Pistons\nDallas Mavericks vs Oklahoma City Thunder \nNew Orleans Pelicans vs San Antonio Spurs\nMinnesota Timberwolves vs Portland Trail Blazers\nOrlando Magic vs Los Angeles Lakers",
    "9": "New Orleans Pelicans visits San Antonio Spurs Predictions and Preview for 12/12/2021 today.  Who are we taking in this game?  Find out now. #Basketball #NBA https://t.co/SXCZqY3Oi0",
    "10": "Analyzing Sunday’s New Orleans Pelicans at San Antonio Spurs odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/BmiHnxAg5N",
    "11": "NBA MAX PLAY\n\nSan Antonio Spurs vs New Orleans Pelicans \n\nEasy winner here \n\n7-1 last 8 Max (90%)\n\n15 quick likes and I’ll drop it https://t.co/cJO4BF4awA",
    "12": "Consensus Line Move:\n2021-12-12 New Orleans Pelicans at San Antonio Spurs from 219.50 to 220.50\nOver business... man\n#NBA #soccer #data #success",
    "13": "@KingJosiah54 The saddest part about this video is the fact that he throwing that insult against Gordon when he was playing for the the new orleans pelicans 😪  somes up all the new orleans franchise in one clip, I'm depressed now😔 https://t.co/6jPpUJdwm6",
    "14": "New Orleans Pelicans vs. Spurs: Odds, best daily fantasy bets – NBA News https://t.co/qhFZCFTGf7",
    "15": "Wish him a speedy recovery.  Check out https://t.co/F9qvNDIQMQ to learn more about some injuries to this area of the foot. New Orleans Pelicans' Zion Williamson suffers setback in recovery from foot surgery  ⁦@orthobullets⁩  https://t.co/kSve8XmWbf",
    "16": "The San Antonio Spurs will host the New Orleans Pelicans tonight as the teams will face off for the first time this season. Here are five things to watch for in tonight's game.  https://t.co/wyOnAQpujU",
    "17": "𝐆𝐀𝐌𝐄𝐃𝐀𝐘! #PorVida\n\n🆚 New Orleans Pelicans\n📍 AT&amp;T Center, TX\n⏰ 21h00 (BRT)\n📺 NBA League Pass\nhttps://t.co/RVU5X4MDrM",
    "18": "Best line of the year is from @YourOldDroog “They give themselves a bad name like the New Orleans Pelicans” 😂😂 https://t.co/bsj75f1a73",
    "19": "@Domo8186 @Bailey97388879 @4tehwin Do you think Beal might be going to New Orleans? Him for their 1st round this year, next year, and the following year, Devonte Graham, Josh Hart, and Kira Lewis Jr, might be a good Idea. the only concern is that Beal might not want to good to pelicans.",
    "20": "@MrChuckD @PelicansNBA @hornets @SeattleSonics But I doubt Adam Silver and the @NBA let the @PelicansNBA leave NOLA cause all we would have is the @Saints and tourism. The financial support isn’t in New Orleans whereas Seattle has @Amazon @Microsoft @Google @Costco @Facebook Seattle is the iCloud version of Silicon Valley…",
    "21": "@MrChuckD I’m from New Orleans Chuck, the Lower 9th Ward born and raised. I played for the @PelicansNBA but they were the @hornets then in 2002. \n\nSeattle deserves the @SeattleSonics back but I don’t want it that way. No doubt Seattle would support the team better do to it’s robust economy",
    "22": "Like when the Charlotte Hornets play the New Orleans Pelicans. Only difference is at one time it was the Charlotte Bobcats and the New Orleans Hornets. https://t.co/dZaELoIQ10",
    "23": "New Orleans Pelicans' Zion Williamson suffers setback in recovery from foot surgery - via @ESPN App https://t.co/PEZBqqOdL1",
    "24": "@YahooFantasyCC Herbert Jones is the starting PF for the New Orleans Pelicans. Yet, he is only given the SF designation. Can you please give both SF and PF.",
    "25": "The Krause House (named after the late Chicago Bulls GM Jerry Krause) created a plan that’s a combination of blockchain-based fundraising and old-style grassroots organizing. \n\nThey're trying to buy the New Orleans Pelicans. https://t.co/Air5RHW468",
    "26": "@GPFree75 @ATL_Jonesin @ScottDKushner Because players don't see New Orleans as a place they want to go as free agent or play for. Two things are going to happen with Zion. Either he becomes the next Greg Oden or he leaves the team when his contract is up. Pelicans have two landing spots. Seattle or Las Vegas.",
    "27": "New Orleans Pelicans vs. San Antonio Spurs Free Basketball Picks 12/12/21 – Free NBA Picks\n\nFree NBA Picks: https://t.co/6zs5bCs6Dn\n\nBet on Basketball: https://t.co/rAFjp0NQxx\n\n#Draftkings #Fanduel #Pointsbet #Basketballpicks #Sportsbook #NBAPicks #NBATwitter #GamblingTwitter https://t.co/QINGg2CYG8",
    "28": "New Orleans Pelicans: What's next without Zion Williamson? – NBA News https://t.co/nNJIiFMxqy",
    "29": "NBA Pick of the Day\n\nSan Antonio Spurs vs. New Orleans Pelicans\nPelicans ML (+110) - 1.5u 🤞\n\n#NBA75 #NBATwitterLive",
    "30": "@ATL_Jonesin @ScottDKushner How does the NEW ORLEANS Pelicans Organization benefit at ALL moving to Seattle? That makes absolutely no got damn sense!.",
    "31": "NBA - New Orleans Pelicans' Zion Williamson suffers setback in recovery from foot surgery https://t.co/gamGJLJWSd",
    "32": "NBA Basketball Game Betting Picks Simulator: 7:10 PM ET - New Orleans Pelicans vs. San Antonio Spurs - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/4yccEi6XD1 #nba #sportsbetting #freepicks #cappertek",
    "33": "NBA - New Orleans Pelicans' Zion Williamson suffers setback in recovery from foot surgery https://t.co/qvqqe6pv6e",
    "34": "New Orleans Pelicans (8-20, 15th in the Western Conference) vs. San Antonio Spurs (9-16, 12th in the Western Conference) https://t.co/nANILVi2Bq",
    "35": "New Orleans Pelicans (8-20, 15th in the Western Conference) vs. San Antonio Spurs (9-16, 12th in the Western Conference) https://t.co/U32xkubGYl",
    "36": "New listing! \n\nJJ Redick 2020-21 Prizm Pink Ice Prizm #184 New Orleans Pelicans MINT \n\nCheck it out: https://t.co/XctI4xNOdS\n\n#TradingCards #ForSale #eBay https://t.co/iv5bCqUfrR",
    "37": "New listing! \n\nDerrick Favors 2020-21 Prizm Pink Ice Prizm #133 New Orleans Pelicans MINT \n\nCheck it out: https://t.co/vzr3DmmVSp\n\n#TradingCards #ForSale #eBay https://t.co/oREw1dAO03",
    "38": "Game Preview: San Antonio Spurs vs. New Orleans Pelicans https://t.co/AiLcCRUPv7",
    "39": "I think the Pelicans should fire David Griffin and replace him with Donnie Nelson. Donnie will make the moves to keep Zion happy and ensure New Orleans is a respectable franchise again. We #MFFL miss Donnie!",
    "40": "Zach Randolph was the most Memphis basketball player that will ever exist &amp; it was a treat to watch him battle as a Memphis grizzlies player - a New Orleans kid &amp; a pelicans fan",
    "41": "@PelicansNBA speedy recovery Z, i still believe you can do more and more for the city of new orleans. fighting!!!!",
    "42": "@UnwrittenRul3s New Orleans pelicans blowing out the warriors.",
    "43": "New Orleans Pelicans’ Zion Williamson suffers setback in recovery from foot surgery https://t.co/EcHe7HzH9N",
    "44": "I’ll take all of the heat from Pelicans Twitter at times if it means people are passionate about basketball. You just don’t know how the game lives inside of me, and you can’t tell me New Orleans isn’t a basketball city.",
    "45": "@ProPelsTalk Jalen can push all he wants. The Pelicans are staying in New Orleans.🏀",
    "46": "$PSEI - New Orleans Pelicans’ Zion Williamson suffers setback in foot injury recovery https://t.co/2X16P5Cnhh\n\nhttps://t.co/OMQFQ4I243 #PSETODAY #PSEI #Philippines",
    "47": "It's intentional!! I hope Mrs. B sees it and continues her promise to keep the Pelicans and Saints in New Orleans... https://t.co/XYNwsXKFsR",
    "48": "Ugh. RT @_Andrew_Lopez: Statement from the New Orleans Pelicans on Zion Williamson: https://t.co/ca96h8xjzQ",
    "49": "@ATL_Jonesin @ScottDKushner The only thing i disagree with you is NBA doesn't have a place in New Orleans.If Pelicans would start winning they will pack the arena.They are scared to let Zion go because they know he will bring in the money for them.",
    "50": "Zion's setback + #Pelicans awful record = lots of negative media about New Orleans\n\nFICTION: Pelicans are moving or being sold \n\n***AS LONG AS GAYLE BENSON IS ALIVE, PELICANS WILL BE IN NOLA!!!\n\nFACT: Zion probably does want to move on from New Orleans and play somewhere else https://t.co/WvwNQH3UAK",
    "51": "@ScottDKushner It is like i have been saying.Zion doesn't want to be in New Orleans.He has been pouting since the Pelicans drafted https://t.co/Jk1NySMe4a noticed Zion has been quite for a few months.He hardly says anything.Time to cut our losses.",
    "52": "@Ballislife @nbagleague New Orleans Pelicans definitely need him he’s a walking bucket! Put this man in the League wtf is the hold up",
    "53": "New Orleans Pelicans’ Zion Williamson suffers setback in foot injury recovery https://t.co/jtr2POTbVl",
    "54": "New Orleans Pelicans’ Zion Williamson suffers setback in foot injury recovery https://t.co/6VHahX19aO",
    "55": "If the Pelicans fail as a franchise, it will not be because of the city of New Orleans. The city has lived through cheap owners, questionable to indefensible player decisions, injuries, and incompetent front offices, and yet fans still wild out about this team.",
    "56": "$PSEI - New Orleans Pelicans forward Zion Williamson has experienced another setback in his recovery from foot surgery, the team said Saturday.  \n  \nhttps://t.co/E10ZwIzCh3 https://t.co/2X16P5Cnhh\n\nhttps://t.co/ig4N3Kebhv #PSETODAY #PSEI #Philippines",
    "57": "Zion Williamson, the New Orleans Pelicans star whose NBA rise has been hampered by injury, has suffered another setback in his return from right foot surgery, the team said. https://t.co/QAfxWmaYLr",
    "58": "Sad thing is the Pelicans done in New Orleans when Zion gone. Failure on both sides with Griffin and that 4th pick and the 2020 pick but Zion failing them too",
    "59": "The media continues to position New Orleans sports fans as Saints vs Pelicans. That’s not the choice. It’s winning vs mediocrity or worse. Let the Saints string together a few 3-14 seasons and see how the attendance looks.",
    "60": "@NBA @NBAonTNT @PelicansNBA @FirstTake Sorry new orleans but Zion W is going to be a bust! I’m not trying to be the scrooge or wish him bad,i was a fan of what he could’ve been but hes gon be a bust…PERIOD!",
    "61": "New Orleans Pelicans forward Zion Williamson has experienced another setback in his recovery from foot surgery, the team said Saturday.\n\nhttps://t.co/eKcNFjUwik",
    "62": "New Orleans Pelicans’ Zion Williamson suffers setback in foot injury recovery https://t.co/AfBPEXGAAG"
}