{
    "0": "Disney On Ice? Nahhhh\n\nCavs in the ear. Let’s go!!\n\n#LetEmKnow @cavs @923TheFan https://t.co/rzykz38Bed",
    "1": "New Jersey Devils - Nashville Predators\nMinnesota Timberwolves - Cleveland Cavaliers\nHouston Rockets - Milwaukee Bucks\n\nBet slip link: https://t.co/GSejyjruBh https://t.co/GJzGMLaL9k",
    "2": "@clvanderbeek @Timberwolves @cavs @cavssean Of course not.  LOL",
    "3": "@BallySportsCLE I’m going to donate 10 toys and 20 canned goods for every @cavs game that you’ve broadcast live on @YouTubeTV so far this season…",
    "4": "CLEVELAND CAVALIERS",
    "5": "Cleveland Cavaliers vs Minnesota Timberwolves LIVE REACTION/Play-By-Play https://t.co/GwTgRmtwB0 via @YouTube",
    "6": "Ah yes, The Cleveland Cavaliers",
    "7": "Cleveland Cavaliers at Minnesota Timberwolves odds, picks, prediction | Analyzing Friday's Cleveland Cavaliers at Minnesota Timberwolves odds and lines, with NBA expert picks, pred #sports tips\nhttps://t.co/vIm9PfON2C",
    "8": "@cavs @kevinlove Watching the game because love and rubio torching their former team is 🥰",
    "9": "J.B. Bickerstaff accounts for the @cavs' road success and previews tonight's matchup in Minnesota.\n\n#LetEmKnow | @DreKnott https://t.co/2I0LdhnQS8",
    "10": "@ogkore3 @CavsRfrauds @cavs @kevinlove Lame af",
    "11": "@CavsRfrauds @cavs @kevinlove Jesus… “get a life, now they on sale”",
    "12": "@azwwanna @cavs @kevinlove I wish cedi would do more",
    "13": "@cavs @kevinlove Earning that check ….",
    "14": "If the Cavs get to 30+ wins this year is it ok if we trade sexton? @cavs",
    "15": "@MainEventVoice @Timberwolves @cavs @cavssean You're not going to announce their names with excitement, are you?",
    "16": "@EdGreenberger @mhkeener @cavs Oh now it’s my job to look for clarifications? At least you admit your original tweet sucked.",
    "17": "@ahhhhMahgeetah @mhkeener @cavs So your contention is I believe all or most Browns/Buckeye fans are Baker haters because of the flag plant? Hilarious. Maybe you should check out my clarification I sent yesterday after the first tweet. https://t.co/AkOxE28AMR",
    "18": "@EdGreenberger @mhkeener @cavs Yes, yes you were, or you should choose your wording more carefully. There is nothing in your OP that puts any type of qualification around this:\n\n“Buckeye/#Browns  fans not being able to enjoy it”",
    "19": "@CavsRfrauds @cavs @kevinlove Damn bruh ur sad😭😭😭",
    "20": "@MainEventVoice @Timberwolves @cavs Thank you brother 🏀🎤💪",
    "21": "Patrick Beverley (left adductor strain) will play and start in Friday’s matchup with the Cleveland Cavaliers, with Anthony Edwards, Taurean Prince, Jarred Vanderbilt and Karl-Anthony Towns rounding ... For Fantasy Analysis Click Here: https://t.co/adeRkKxRry",
    "22": "@TheCediFanClub @cavs @cediosman i still want mine",
    "23": "@EdGreenberger @cavs Hey Ed, try not to be so dumb in the future. Ok?",
    "24": "@stlaxstla @cavs @MarkkanenLauri @dariusgarland22 @JustOutlaw @rickyrubio9 @denzelvalentine Literal drip",
    "25": "Minnesota Timberwolves (+1.5) vs. Cleveland Cavaliers #LetEmKnow #RaisedByWolves #NBA #NBATwitter #NBA75",
    "26": "@King0fCleveland @cavs @kevinlove Got my Xmas Love jersey on for tonight, he needs the homecoming vibes",
    "27": "Friday Night in the Twin Cities!\n@Timberwolves vs @cavs \nSpecial shout out to my PA brother @cavssean.  I’ll take care of your boys tonight.\n#NBA75 #NBA #paannouncer #emcee #PABrotherhood https://t.co/rastkp863i",
    "28": "@EdGreenberger @cavs Yeah, that's not gonna happen Ed.",
    "29": "@CavsRfrauds @cavs @kevinlove lmao lemme just gone head and hand you this ratio my boy",
    "30": "@HsgvensSon @cavs Vouch, he personally ended racism",
    "31": "@cavs @evanmobley @firstenergycorp I love this team",
    "32": "@cavs @kevinlove I put money on the Timberwolves winning, and Mobley scoring under 16 points. The easiest money I have ever made in my life. Why would Vegas ever put this garbage cavs team as the favorite",
    "33": "@cavs @kevinlove Best Cavs player of all time!",
    "34": "Shooting 18-35 (.514) from deep over his last six 🔥 #LetEmKnow https://t.co/USfEkrATBF",
    "35": "Follow me pls im really respectful @cavs @cavs @cavs @cavs @cavs vouch pls vouch pls vouch pls vouch pls pls pls pls pls pls…i said PLEASE, respectfully",
    "36": "@EdGreenberger @cavs You’re really, and I mean really, weird.",
    "37": "@cavs @evanmobley @firstenergycorp Let’s get the W",
    "38": "@EdGreenberger @cavs Believe me, if Baker Mayfield wins the Super Bowl you'll be hard pressed to find a #Buckeye/#Browns fan who isn't ecstatic about it.",
    "39": "@cavs @evanmobley @firstenergycorp Bring home a win! Go Cavs!!!",
    "40": "@EdGreenberger @cavs I’m sure there some Ohio state fans that hate him still because of this",
    "41": "The @Cavs starting Garland, Okoro, Markkanen, Mobley, Allen on Friday. #DefendTheLand #NBA",
    "42": "@cavs @evanmobley @firstenergycorp Big W",
    "43": "Let’s Play Some @cavs Basketball! At @TargetCenterMN to face @Timberwolves. 7:30 pregame on CAVS RADIO NETWORK where we go “man to man” w @_bigjayy_ 8p tip.  @chones22 and I would love to have you join us! https://t.co/dTn7OdSkNA",
    "44": "@cavs @evanmobley @firstenergycorp Game time baby",
    "45": "@cavs @evanmobley @firstenergycorp as always cavs in fo",
    "46": "Tonight's starting lineup for the Cleveland Cavaliers: Garland, Okoro, Markkanen, Mobley, Allen https://t.co/bVWH4AMCA2",
    "47": "Starting squad. #LetEmKnow https://t.co/AyCiJYjNiA",
    "48": "Friday Night Flop out on @BettorEdge \n\nSacramento ML\nIndiana Pacers - 1.5 \nPenguins ML\nCleveland Cavaliers ML",
    "49": "@Cavs_House @nizcomix @cavs @keybank He's a top 3 PG (Young and LaMelo the other 2). He's also a firework to watch.",
    "50": "@nizcomix @Cavs_House @cavs @keybank I could see Young and LaMelo... but I'd definitely have DG tight with the latter. Maybe a hometown nod, too. There's nobody really close to their combination of scoring/assists/3s, and Garland's handle is insane. But also: Hello, Cole Anthony. I just didn't know.",
    "51": "Tacko Fall\n#Cavs \n#Cleveland \n#NBA @cavs \n#LetEmKnow https://t.co/kixWqYucsg",
    "52": "@nizcomix @JScottShep @cavs @keybank Every yr allstar worthy players sit because of fan like you voting",
    "53": "@monstershockey you guys shot almost as well as your sister franchise the @cavs against Syracuse.",
    "54": "Go baseline to baseline &amp; get ready for @cavs  at @Timberwolves 8p! Join me for CAVS NOW 7-7:30p!  @dmansworld474 joins me for CAVS CORNER &amp; get the 411 you need! All you need to know w/ CAVS NOW 1 hour out from every @CAVS tip off on the Mother Ship for @cavs @WTAM1100!",
    "55": "#Basketball,\n\n#NBA, #NBATwitter,\n\n#AllForOne, #BeTheFight, #ClevelandCavaliers, #Cavs, #CavsNation, vs. #Twolves, #AllEyesNorth, #Timberwolves, Get your best odds - fast at https://t.co/Ohl03KWAVe https://t.co/rvqgaWKNNC",
    "56": "@IBBShootah @cavs @MarkkanenLauri @dariusgarland22 @JustOutlaw @rickyrubio9 @denzelvalentine Bring back Delly Tray pls",
    "57": "#NBA preview updated w/ top #betting #picks: \n\nNotable line moves:\n\n@BrooklynNets-@ATLHawks: 223.5-&gt;228\n@Bucks (at @HoustonRockets): -8.5-&gt;-9.5\n@cavs (at @Timberwolves): +1.5-&gt;-1.5\n@DetroitPistons (at @PelicansNBA): 210-&gt;212\n@celtics (at @Suns): +5.5 to +4 https://t.co/RVl8CEERtr",
    "58": "@cavs @SociosHoops Water is not wet. That's like saying water is Tea. Water is not tea but tea is water. Water is a liquid. Made from H2O. Wet is Anything with a liquid on it.",
    "59": "@starshinewords @Antikimmichismo @OutofCtxAntismo @cavs can relate",
    "60": "@Antikimmichismo @starshinewords @cavs Bander",
    "61": "Check out Cleveland Cavaliers RC and Base Lot. 10-Cards https://t.co/utW21qg2n0 @eBay",
    "62": "@Cavs_Alexx @cavs @MarkkanenLauri @dariusgarland22 @JustOutlaw @rickyrubio9 @denzelvalentine Common W",
    "63": "@cavs go get Ben Simmons!",
    "64": "Cold like Minnesota ❄️ https://t.co/jYtzwaQwYR",
    "65": "NBA Basketball Game Betting Picks Simulator: 8:10 PM ET - Cleveland Cavaliers vs. Minnesota Timberwolves - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/SOsRCnyqaE #nba #sportsbetting #freepicks #cappertek",
    "66": "@cavs @Timberwolves @BallySportsCLE @betwayusa Sweet, have to try and stream it, cause you know…. @BallySportsCLE bullshit",
    "67": "@cavs @BallySportsCLE @wtam1100 @wmms @Power891 @RocketMortgage Let's Get It tonight https://t.co/aXxVyWWYsr",
    "68": "Cleveland Cavaliers\n(@cavs) \n\n#USA #SecciónBasket #49 https://t.co/8ZShqhYcfy",
    "69": "#Cavs playing good and #Wolves struggling. Lets see wat the cavs bring today. Opinions? Let's get it!!! @cavs go go go!!! #eyes #looking #whouwit #Datzit",
    "70": "@ianmirmelstein @AbelFCano @EdGreenberger @cavs Oh I fully hope baker leads us to a super bowl this season. I’m just not blindly committed to a mediocre at best QB just because he plays for my team.",
    "71": "Cleveland Cavaliers vs. Minnesota Timberwolves | USA: NBA\nWatch Live Here =&gt; https://t.co/SYZJrEczzr\nThis match will start at 08:00 PM, December 10, 2021\nVenue: Wells Fargo Center (Philadelphia)\nPlease LIKE and SHARE, thank you https://t.co/OC0f388AbN",
    "72": "@nizcomix @Cavs_House @cavs @keybank Welp, I learned today that Harrison Barnes is at 19/8 and hitting 40% from 3. He's having a really nice year. Can the Cavs please have him?",
    "73": "@FunnySongGlenn @cavs @Star102CLE Haha we tried, man. We tried. Have a good weekend and go Cavs.",
    "74": "@marissadesantis @cavs @Star102CLE Well why didn’t you win then?  Lol.  Appreciate you listening.  Have a great weekend 😀",
    "75": "@FunnySongGlenn @cavs @Star102CLE You had me staying late at work so I didn’t miss the cue on the way to my car. The Cavs love is that deep. 😅",
    "76": "@BallySportsCLE @_bigjayy_ @cavs Jarett Allen is a wrong guy to face in the RIM.",
    "77": "@cavs @Timberwolves @BallySportsCLE @betwayusa Win the game",
    "78": "@BIGFACTS16 @AbelFCano @EdGreenberger @cavs Must be miserable to root for your team to lose so you can be right.",
    "79": "@nizcomix @Cavs_House @cavs @keybank BTW, this did send me to ESPN, curious about EC PGs who stack up with Garland. Trae is the superstar... then it's Garland and LaMelo. Cole Anthony is having himself a year though.",
    "80": "Check out this listing I just added to my #Poshmark closet: BB Jeans Stone Washed Shorts Authentic Sportswear Cleveland Cavaliers King James. https://t.co/jK9zo6R4A4 #shopmycloset @poshmarkapp",
    "81": "@BIGFACTS16 @ianmirmelstein @EdGreenberger @cavs Yep. I’m tired of the nonstop excuses as well.",
    "82": "Cleveland Cavaliers",
    "83": "@nizcomix @Cavs_House @cavs @keybank Please send him to Cleveland, we need one of those.",
    "84": "@NBA @tackofall99 @cavs Happy Birthday my",
    "85": "@nizcomix @Cavs_House @cavs @keybank I'd stick to the position (PG). Not just flipping shit, I'm curious how many PGs in the East are scoring over 18, assisting over 7, and shooting over 40% from 3. Just numbers that hit me as a pretty formidable combo.",
    "86": "@nizcomix @Cavs_House @cavs @keybank Any thresholds are arbitrary but if you tell me a PG is scoring 18+, assisting 7+, and shooting 40+ from 3, I know he's at least in the all star discussion. Relative to other PGs in the East, DG's numbers slot him very high.",
    "87": "Because I like you, I have FREE @Cavs tix this hour on my show.  Tune in at 5:25 to find out how to win @Star102CLE https://t.co/p2TL3wI33e",
    "88": "@rodrigue700 @cavs @keybank I don't think so he isn't shown he deserves it thru the cavs rebuild he's been disappointed he was supposed to be the cavs main star but he didn't do enough but they should appreciate him for helping bring them a championship im a cavs fan and I don't think he deserves it",
    "89": "@nizcomix @Cavs_House @cavs @keybank Can you reword that somehow? We said he's one of just 3 guys with 19/8/45% or better. His PG numbers are rare, and it's fine if you wanna say 19/8 and 40%+ from 3. They're at the top. Those are the All Stars. You're just confusing me.",
    "90": "@cavs had a missed opportunity with the Cudi collab. woulda wished we added some trippy pinks and purples while also keeping the classic navy. kinda like the MOTM3. they couldve even incorporated the yellows and maroons in spots but idk im not a fashion designer",
    "91": "@cavs @keybank I hate when lame casual cavs fans bash sexton for no reason I'm glad garland is playing good he's showing us the reason why the cavs drafted him none of these lame casual cavs fans on youtube are giving sexton credit all their saying is \"trade him\"smh",
    "92": "4 Teamer Friday’s • +1400 Parlay 🏆\n#NBA #NHL \n\nTo bring home 7u💵\n• Sacramento Kings ML\n• Cleveland Cavaliers ML\n• Washington Capitals ML\n• OKC Thunder ML \n\nDefine the odds #GamblingTwitter",
    "93": "I have 2 free tickets for tomorrow’s @cavs vs @SacramentoKings game‼️ DM if ya want em #LetEmKnow https://t.co/OgoVjMnazK",
    "94": "Happy Birthday Tacko Fall #nba #celtics #cavs #TikTok @cavs @tackofall99 https://t.co/OzIks9U7Oo",
    "95": "@BrettMercuri @Mcdzzdachef @EdGreenberger @cavs I’m not all baker I’ve told you obj isn’t what he used to be and obviously no excuses for the drops. \n\nYou are here blaming everyone except baker for everything. Have a good one",
    "96": "This is what you do when you want to debunk trade rumors @cavs https://t.co/IgumefSiEC",
    "97": "@rickykellerwmu @BallySportsCLE @_bigjayy_ @cavs Allen is a good one shame he was packed in the deal for us to Harden but regardless y'all got a good one on your hands",
    "98": "@cavs @FcoJavier1974 @rickyrubio9 Grande Ricky",
    "99": "@cavs Please don’t trade Ben Simmons to Cleveland. https://t.co/H84AEiiyNc",
    "100": "Cleveland Cavaliers, Miami Heat and Portland Trailblazers are currently front runners on All-Star Ben Simmons ( via @MattBrooksNBA )",
    "101": "@BIGFACTS16 @Mcdzzdachef @EdGreenberger @cavs Again, Baker should’ve held onto it. You just said I’m an “all Baker” or “all OBJ” fault with no in between yet here you are “all Baker” You don’t care about the other players, QB only. (Hunt ran into OL and didn’t get out clean causing him late to spot)",
    "102": "Day 10 of asking the @cavs for a @cediosman City Edition Jersey, since you can’t buy them. @cavs https://t.co/EbWBayc8AH",
    "103": "@BrettMercuri @Mcdzzdachef @EdGreenberger @cavs I don’t care why he pumped. It’s not unreasonable to expect a number one overall pick to be able to pump fake w/o fumbling. \n\nI’m done here. You’re clearly all in on baker and that’s fine. He’s mediocre and ik it’s hard to accept- I’m clearly not going 2 change ur mind",
    "104": "@BIGFACTS16 @Mcdzzdachef @EdGreenberger @cavs No, he should’ve held onto it. I asked a simple question. Why’d he pump instead of throw right away? It’s evident the more I speak with people the mess they understand any nuance whatsoever in QB and pass catchers play",
    "105": "NBA teams that have been heavily impacted by players out with #COVID19 this season: Chicago Bulls, Milwaukee Bucks, Cleveland Cavaliers, Brooklyn Nets, Philadelphia 76ers, Toronto Raptors, Indiana Pacers, Memphis Grizzlies",
    "106": "@BrettMercuri @Mcdzzdachef @EdGreenberger @cavs Lmao I watch more football than you so you can drop the education bs. Congratulations your number one pick missed a wide open TD because of a miscommunication that changes a lot 👍",
    "107": "@BrettMercuri @Mcdzzdachef @EdGreenberger @cavs Okay? I would expect a first overall pick to communicate with his receivers?? I don’t really care why it’s in the dirt like I said same final result.",
    "108": "@cavs @Timberwolves @BallySportsCLE @betwayusa mf w tonight😈",
    "109": "@BrettMercuri @Mcdzzdachef @EdGreenberger @cavs Oh for Christ sake you’re STILL blaming someone else for baker fumbling the ball untouched??? You’re hopeless dude have fun I’m done here.",
    "110": "Friday night plans!\n\n🆚 @Timberwolves\n🕗 8:00PM ET\n📺 @BallySportsCLE \n\n@betwayusa | #GetItLocked https://t.co/SIPdGY1iev",
    "111": "@BIGFACTS16 @Mcdzzdachef @EdGreenberger @cavs On the COMMUNICATION aspect of what he wanted him to do.",
    "112": "@BrettMercuri @Mcdzzdachef @EdGreenberger @cavs Ummm baker literally takes blame in this article my man. I don’t really care if it was under thrown or bad communication by him, a ball in the dirt is a ball in the dirt. https://t.co/jCvA4plt0S",
    "113": "@BIGFACTS16 @Mcdzzdachef @EdGreenberger @cavs Tu further your education here’s a miscommunication from a WB on an 10-2(?) team. Same type of thing. https://t.co/bSTCK13MI1",
    "114": "@BIGFACTS16 @Mcdzzdachef @EdGreenberger @cavs Why’d Baker double clutch on that fumble? Funny how one fumble trumps 6 drops and a WR fumble isn’t it?",
    "115": "@MerkDip69 @cavs This is so cursed but I love it",
    "116": "@BrettMercuri @Mcdzzdachef @EdGreenberger @cavs Conveniently leaving out the baker fumble I see. So it’s objs fault and once he’s traded it’s still everyone else’s fault? Got it. This is embarrassing.",
    "117": "@BIGFACTS16 @Mcdzzdachef @EdGreenberger @cavs So now that I know your take, here’s your education. Baker wanted a stop route to end the game. OBJ kept running. It’s a communication issue. Stop route ends the game on kneel downs. https://t.co/NwRie3OgLN",
    "118": "What is the mid-season review of Cleveland Cavaliers? #NBA\n\nhttps://t.co/CnAv6qPoWR",
    "119": "@BIGFACTS16 @Mcdzzdachef @EdGreenberger @cavs 6 drops and a WR fumble. This has been discussed multiple times. Even by a HOF QB https://t.co/YxdqiB3tuF",
    "120": "@cavs @socios @_bigjayy_ @Starrelish I did not know I needed this and now I need it on my wall",
    "121": "@BrettMercuri @Mcdzzdachef @EdGreenberger @cavs The ball thrown badly behind obj?",
    "122": "@TheRealHuppOG @cavs Very true but he is a great offensive punch off the bench and probably our best 3 point shooter",
    "123": "@BrettMercuri @Mcdzzdachef @EdGreenberger @cavs Hint- we don’t score at all. Lamar throws 4 picks and we score 10 points the whole game. Maybe you’ll find a way to bring obj into this.",
    "124": "@BrettMercuri @Mcdzzdachef @EdGreenberger @cavs The amount of catches by obj is not why baker is good/bad or why stafford is good/bad. \n\nHere’s a stat for you. PPG over the last 3 games (post-obj trade)\n\nRams: 25 (11th in nfl)\nBrowns: 10 (32nd in the nfl 🤣)\n\nObj probably has very little to do with it. Mayfield isn’t good.",
    "125": "@BIGFACTS16 @Mcdzzdachef @EdGreenberger @cavs To make it easier it’s Vs Minnesota",
    "126": "@BIGFACTS16 @Mcdzzdachef @EdGreenberger @cavs Explain the first pass in that video.",
    "127": "@BIGFACTS16 @Mcdzzdachef @EdGreenberger @cavs You were the one that rambled on about TDs. Hint - we run them in rather than do 1 yard throws. My point stands overall a 50% catch rate is a 50% catch rate. Not good and it’s 2 teams now.",
    "128": "@BrettMercuri @Mcdzzdachef @EdGreenberger @cavs Okay so you’re allowed to pepper me with video links as your argument but I can’t mention a literal lowlight compilation of baker? Got it. Keep defending him it’ll be funnier when he’s gone in a year tops.",
    "129": "No. 5 in the NBA Math player power rankings:\n\nJarrett Allen, Cleveland Cavaliers: 20.87\n\nhttps://t.co/cMK94AC48A https://t.co/IDfSZ8FWqc",
    "130": "@BrettMercuri @Mcdzzdachef @EdGreenberger @cavs I’m only going to say it one more time. BOTH PLAYERS ARE AVERAGE AT BEST. Browns fans like yourself that place the entire blame on baker or obj don’t know football. It’s a mix",
    "131": "@BIGFACTS16 @Mcdzzdachef @EdGreenberger @cavs You missed the point completely by mentioning OBJs dad.",
    "132": "25. Malcolm Brogdon, Indiana Pacers: 16.05\n\n24. Russell Westbrook, Los Angeles Lakers: 16.29\n\n23. Zach LaVine, Chicago Bulls: 16.61\n\n22. Darius Garland, Cleveland Cavaliers: 16.63\n\nhttps://t.co/cMK94AC48A https://t.co/5ZDUt0Xl12",
    "133": "@BIGFACTS16 @Mcdzzdachef @EdGreenberger @cavs OBJ is a glutton for awful throws. The point is maybe just maybe - it wasn’t Mayfield. Because if it is Mayfield - then it’s also Stafford",
    "134": "@nizcomix @JScottShep @cavs @keybank Re read it slower this time",
    "135": "@BIGFACTS16 @Mcdzzdachef @EdGreenberger @cavs Seriously pay attention. OBJs daddy said Mayfield couldn’t get OBJ the ball and that’s why he was 17/34 catching it. Got him off the team.\n\nWith the Rams now he’s 9/18 catches. 50% catch rate. \n\nWho’s the constant? The QB or the WR?",
    "136": "@BrettMercuri @Mcdzzdachef @EdGreenberger @cavs You’re an idiot Brett. I’ve told you 5 times now that obj isn’t good. Neither is baker. I could bring up the tape of baker missing wide open receivers or not throwing to them at all (thanks to OBJs dad).",
    "137": "@BrettMercuri @Mcdzzdachef @EdGreenberger @cavs Yes obj isn’t very good I already told you that myself multiple times. But guess what- getting rid of him hasn’t helped baker at all. Baker is mediocre at best and we took him with the first overall pick. That’s it. Nothing more.",
    "138": "@BrettMercuri @Mcdzzdachef @EdGreenberger @cavs Okay what are you trying to prove with this one? Legitimately awful throw by stafford here 🤣",
    "139": "@BrettMercuri @Mcdzzdachef @EdGreenberger @cavs I can’t even see where the ball is placed in this video. I already told you it’s a mix of issues but I could pull up the crap baker throw for a wide open obj vs Vikings. Obj isn’t what he used to be, baker is not good. Both can be true",
    "140": "@EdGreenberger @cavs I mean eh he beat oh state so what has nothing to do with the pros",
    "141": "I've been searching all over the league to figure out who is and isn't available for the Cleveland Cavaliers when things open next week for trades.\n\nIt's gonna be a doozy of an article and you should subscribe so that you don't miss it when it drops!\n\nhttps://t.co/Y1tRy2T0nH",
    "142": "Did everyone else know there is an ESPN Cleveland? TY @CrainsCleveland. @ESPNCleveland @cavs @Browns @CleGuardians @CLESports \n\nhttps://t.co/ppTZkBroE6",
    "143": "🚨🚨FRIDAY NIGHT BETTING CARD🚨🚨🚨\n\nNBA🏀\nCleveland Cavaliers ML @ 1.90 ($100)\nTyrese Haliburton O5.5 Assists @ 1.70 ($100)\n\nNCAAB🏀\nMurray State +10.5 Pts @ 1.90 ($100)\nLoyola Chicago -4.5 Pts @ 1.90 ($100)\n\nLET'S SWEEP TO START THE WEEKEND RIGHT🤑🤑🤑\n\n#GamblingTwitter https://t.co/ZZAH251RiN",
    "144": "@BrettMercuri @Mcdzzdachef @EdGreenberger @cavs A touchdowns a touchdown. Baker sailed passes over his head (yes the Pittsburgh one was a bad throw and I’m not arguing about it). If you’re fine with mediocre play from a first overall pick then fine. He’s not living up to his draft position. Period.",
    "145": "@BIGFACTS16 @Mcdzzdachef @EdGreenberger @cavs And? One was 1 yard. Catch rate 50%. Baker catch rate 50%",
    "146": "@AbelFCano @ianmirmelstein @EdGreenberger @cavs Yeah I get the injuries at the beginning of the season but at a certain point the injury excuses have to stop. It’s week 14, nobody is 100% 🤷‍♂️",
    "147": "@nizcomix @cavs @keybank I'll admit to not really following that one. But I'm sorry if I was too pricky.",
    "148": "@nizcomix @cavs @keybank How many guys in the east are averaging 19/8 and 40% from 3? Those aren't cherrypicked at all, they're pretty standard.",
    "149": "@BIGFACTS16 @ianmirmelstein @EdGreenberger @cavs Especially with his GM and head coach saying he’s absolutely healthy enough to play and succeed.",
    "150": "@nizcomix @cavs @keybank There. Are. Three. People. At 19/8 and over 47% shooting. He's one of three. How are those numbers not what they used to be if only 3 guys in the league have them? Sorry if I'm going dicky but you're frustrating.",
    "151": "@cavs @tackofall99 Happy birthday, Tacko!",
    "152": "@nizcomix @cavs @keybank I was trying to be kind.",
    "153": "@nizcomix @cavs @keybank Honestly? Kinda.",
    "154": "@nizcomix @cavs @keybank I'm saying he has the numbers and passes every eyeball test. In a fair world, he's an all star. 19/8 and over 40% from 3 makes him an all star. The only reason he gets left off is it's a next-year thing because that is kind of how it works.",
    "155": "@tekmunnee @nbattack @cavs Let's cash this fellas!",
    "156": "@nizcomix @cavs @keybank No, you said I said you don't watch games. I just assumed you hadn't seen Garland. Quite a huge difference. And don't use \"bruh\" if you're over 15.",
    "157": "@nizcomix @cavs @keybank He's not perfect but he's pretty terrific. The handles, passing, and shot are elite, the numbers put him in rare territory, the Cavs are winning and he's their leader at 21. Add it up... and it equals all star.",
    "158": "@nizcomix @cavs @keybank Where? I said you haven't watched Garland. We've already established that he's one of 3 with those numbers, so he's an All Star on paper. As an act of kindness, I was assuming you hadn't seen him play because the only alternative is you dumb.",
    "159": "@nizcomix @Cavs_House @cavs @keybank I started with him being one of 3 players in the league with 19+, 8+, and 47%+. He's rare. Am I missing something, how is that not by definition and all star?",
    "160": "@nizcomix @cavs @keybank You haven't watched him then. He's a legit 20/8 guy with insane handles and a great 3-point shooter. Legit all star, no doubt, just a matter of whether he's done it for long enough.",
    "161": "Professional Spanish basketball player Ricky Rubio wore a t-shirt in support of those affected by the eruption in La Palma, for the Cleveland Cavaliers basketball team 😲\n\nPhoto: Cleveland Cavaliers Facebook page.\n\n#lanzarote #islascanarias #canaryislands https://t.co/4gzYPUOdZt",
    "162": "@Mcdzzdachef @EdGreenberger @BrettMercuri @cavs Idk man Josh Allen??",
    "163": "LaVar Ball hates Michael Jordan so much, you’d think he was a member of the 90s Cleveland Cavaliers https://t.co/b2V8OpGe65",
    "164": "@Mcdzzdachef @BrettMercuri @BIGFACTS16 @cavs So when did you start to sour on Baker?",
    "165": "@BrettMercuri @Mcdzzdachef @EdGreenberger @cavs 2 of those catches were touchdowns. Don’t get me wrong I don’t think obj is great but you can’t selectively pick stats like that",
    "166": "This would be a great honor for one of the rising stars on the Cleveland Cavaliers.  https://t.co/IwD1YS8KC6",
    "167": "@BrettMercuri @Mcdzzdachef @EdGreenberger @cavs Nobody cares about the flag plant I can’t make this anymore clear",
    "168": "@Mcdzzdachef @EdGreenberger @BIGFACTS16 @cavs That’s because you’re an OSU fan.",
    "169": "@NBA @tackofall99 @cavs Happy Birthday",
    "170": "@cavs @evanmobley NICE WORK EV!!!",
    "171": "@Mcdzzdachef @BIGFACTS16 @BrettMercuri @cavs ⬆️⬆️⬆️ This guy doesn’t appear to be a Browns fan. Still, he suffers from an an acute case of flagplantitis.",
    "172": "@cavs pay Beyonce $10 jillion back to cavaliers contact Beyonce",
    "173": "@NBA @tackofall99 @cavs Happy birthday TACKO 🥳🥳🥳",
    "174": "@gabbgoudy @CleGuardians \n@MrLapara \n@cavs \n@evanmobley \n@browns\n@bakermayfield @Switz \n\nLegends \n@joethomas73 \n@TheRealJRSmith",
    "175": "@Mcdzzdachef @BIGFACTS16 @EdGreenberger @cavs OBJ with Stafford. 9 catches on 18 attempts for 50% catch rate. Premier!!!! So premier he had 2 offers. 1 at league minimum",
    "176": "@923TheFan @BullandFox @cavs @ChargeCLE @RubeNembhard The movie is Uneccesarry Roughness",
    "177": "@_bigjayy_ Loved it! It's nice to be able to hear what's going on the floor. I can't hear that from the upper deck😂😂\nGlad you're here best trade in @cavs franchise history!\n#GoCavs",
    "178": "@hi_im_kahl @veryfamousman it’s crazy that the first game of the nba finals, between the minnesota timberwolves and the cleveland cavaliers, is tonight",
    "179": "Analyzing Friday’s Cleveland Cavaliers at Minnesota Timberwolves odds and lines, with NBA expert picks, predictions and best bets.  https://t.co/CnP0x9ZiEQ",
    "180": "@BrettMercuri @Mcdzzdachef @EdGreenberger @cavs That’s a cool fact thanks",
    "181": "@BrettMercuri @Mcdzzdachef @EdGreenberger @cavs You sound just as ridiculous blaming everything except baker as people who blame the whole thing on him. It’s a mix but baker definitely has a chunk of responsibility. I’m also done with the injury excuses",
    "182": "Cleveland Cavaliers at Minnesota Timberwolves odds, picks and prediction https://t.co/B4cNgGJ4aD",
    "183": "@BIGFACTS16 @Mcdzzdachef @EdGreenberger @cavs The vast majority of NFL QBs won’t win a Super Bowl",
    "184": "@BIGFACTS16 @Mcdzzdachef @EdGreenberger @cavs He’s been injured since week 2.  Key drops and fumbled at bad times. We could still be 8-4 if guys would catch. He should’ve been sat down Vs Detroit by Stefanski who I dislike. Wish he’d hand play calls over",
    "185": "Never thought id say this but @cavs looking solid and  have my support",
    "186": "The great hockey Jersey incident part 2! Listen @ https://t.co/NmZ6QoofQd\n#fiftyinfifty #guysbeersportspodcast #clevelandcavaliers #torontomapleleafs #torontocomedy #sports https://t.co/0TYlvKo1s1",
    "187": "@BrettMercuri @Mcdzzdachef @EdGreenberger @cavs I’m not saying he’s an awful qb. What I am saying is he wasn’t worth a first overall pick, he’s gotten worse month by month this year, and I don’t think he’ll ever win a super bowl.",
    "188": "@NBA @KnightfanNeal @tackofall99 @cavs Happy Birthday!",
    "189": "Happy birthday to Bryant stith of the Denver nuggets #bryantstith #bryantlamonicastith #denvernuggets #bostonceltics #clevelandcavaliers #clevelandcavs https://t.co/wiqKus9TCE",
    "190": "@BIGFACTS16 @Mcdzzdachef @EdGreenberger @cavs Where is Warner wrong here? https://t.co/YxdqiB3tuF",
    "191": "@Mcdzzdachef @BIGFACTS16 @EdGreenberger @cavs Hey look angry OSU fan!",
    "192": "@KendrickPerkins Switch them out for a good team like the @cavs",
    "193": "@DanielAGreen1 @nbatopshot Cleveland Cavaliers ✅✅\nNew Orleans Pelicans 👎👎\n@AntoGiannis\nTS: StelanOne",
    "194": "@Magicnation407 @OrlandoMagic This is awesome! Glad to hear. I went on the  Courtside seating as well @cavs and @OrlandoMagic game in November of this year. I had a blast.",
    "195": "@AbelFCano @ianmirmelstein @EdGreenberger @cavs Agreed. Discussions need to be had if he doesn’t though.",
    "196": "@BevierAdam @cavs We're so glad you all had an enjoyable time, looks like you all had great time (future family holiday pic?).  We're  thankful to our awesome donors for making memories like this.  🇺🇸#LetEmKnow #memorymaker",
    "197": "@DJMadMardigan @BallySportsNOR @Timberwolves The @Cavs bench lookin real familiar tonight -- got any tracks lined-up to welcome them back on the City Edition night??\n👀 https://t.co/JfNs89UI1u",
    "198": "@KendrickPerkins Put the @cavs in some national spotlight!!",
    "199": "Happy birthday to dion waiters of the Cleveland Cavaliers #dionwaiters #clevelandcavaliers #clevelandcavs #miamiheat #seattlesupersonics #okcthunder #oklahomacitythunder #losangeleslakers https://t.co/CTZCVOeHGv",
    "200": "@BallySportsCLE @_bigjayy_ @cavs Sure would love to watch 🤦‍♂️#youtubetv",
    "201": "The @Cavs EVAN MOBLEY…\n\nHas swatted 28 shots over his last 10 games…\n\nRanks 6th in the entire @NBA in Blocks Per Game with 1.95…\n\nAnd has blocked 43 total shots this season while committing ONLY 45 FOULS (!!!!!) (virtually unheard of, by the way…).\n\n#LetEmKnow  👇👇👇👇 https://t.co/Jmv1XJGLha",
    "202": "@BIGFACTS16 @ianmirmelstein @EdGreenberger @cavs Bye week, only ravens defensive back with a pulse is now out for the season in Humphrey. If there were ever a week he was going to get out of a funk and move this chains this is it.",
    "203": "Nothing but good vibes from @_bigjayy_\n\n@Cavs at Timberwolves TONIGHT. Coverage begins at 7:30 on Bally Sports Ohio &amp; the Bally Sports app https://t.co/C9DxESKL9x",
    "204": "@bball_ref Not bad huh? @cavs 👀",
    "205": "@KendrickPerkins Would be nice if the league showed the @cavs some love and flexed them into a few national games #LetEmKnow",
    "206": "@JohnTelich8 @cavs Went to Miami U same yrs as Ron Harper 82-86.",
    "207": "CLEVELAND CAVALIERS @ MINNESOTA TIMBERWOLVES\n\nCLE 8-13 on road\nMIN 0-4 \nMIN 5-2 last 7 after a loss\nCLE under 10-3 after a win\nMIN over 6-2 in last 8\nCLE 1-4 ATS in last 5\nExpPck: CLE 8 / MIN 1\n\nCLE -1.5",
    "208": "Lakers / Cavs comp:\nLBJ age 36    Mobley 20\nMelo age 37   Okoro 20\nAriza age 36  Marrkanen 24\nHoward age 36 Allen 23\nRondo age 35 Garland 21\n👶🏻 &gt; 👴🏻@cavs \nWell done Koby #cavs",
    "209": "Minnesota Timberwolves - Cleveland Cavaliers\n\nBet slip link: https://t.co/L8KxuufMiA https://t.co/nAk0THn7um",
    "210": "@ElalcaldeRafa @LamarStevens11 @cavs @CavsJoeG Alright, I’m gonna need to call this hotline sometime! Love the show, guys. Although now every time I look at Mobley I think of a fawn! 😂",
    "211": "@cavs @keybank Let’s go cavaliers",
    "212": "Yo @cavs if we win tonight can I get a follow back?👀",
    "213": "@NBA @tackofall99 @cavs Celtics Legend https://t.co/WYm96ODspH",
    "214": "@tekmunnee @nbattack @cavs Can’t go wrong siding with @nbattack. BOL tonight, boys 👊🏼👊🏼",
    "215": "@MobHoops @NBA @tackofall99 @cavs 2 goats",
    "216": "@NBA @tackofall99 @cavs Birthday buddy’s",
    "217": "@carsonzo3 @NBA @tackofall99 @cavs Wow me and Tacko have the same birthday",
    "218": "@CNation213 @NBA @cavs Are smoking crack? Garland and Dame plays the same position and Cavs have Sexton.\nAnd, Dame makes $44 million over paid.",
    "219": "Official #NBA #NBAPicks #FreePicks \n\nI bet this Live on the Show after the Trends favoring Cavs while against Twolves and of course with @nbattack breakdown, I must tail his favorite spot today\n\n@cavs +1.5 -120 BetMGM\n\n#NBATwitter #NBA75 https://t.co/BEtGY9g6zs https://t.co/e3JTVUUIUU",
    "220": "Per Basketball Reference, the Cleveland Cavaliers currently hold the best odds to win Eastern Conference https://t.co/e16ZtIqXs2",
    "221": "@cavs @keybank Cavs fans I’m curious do y’all think Love's jersey should be retired when it’s all said and done",
    "222": "@JohnTelich8 @cavs In the history of the many horrible trades the Cavs have made, the trade of Ron Harper is by far the worst.",
    "223": "@ShannonSharpe Adopt the 1st NON-LBJ, playoff bound @cavs...youth and play the game the right way...SHARING THE BALL! @evanmobley is the real deal too!",
    "224": "Since Nov. 1, the @cavs hold a 6-2 (.750) road record, tied for 3rd-best in the @NBA over that span.\n\nBest Road Record Since Nov. 1\n1. PHX: 8-1 (.889)\n2. BKN: 8-2 (.800)\n3t. CLEVELAND: 6-2 (.750)\n3t. UTA: 6-2 (.750)\n5. GSW: 4-2 (.667)\n\n#LetEmKnow",
    "225": "@nizcomix @Cavs_House @JScottShep @cavs @keybank Some of your tweets doesn’t seem like that but ok… whatever you say",
    "226": "@nizcomix @Cavs_House @JScottShep @cavs @keybank Ok so why mention it? He’s literally playing for you team..",
    "227": "NBA bets tonight:\n1. Brooklyn Nets +2 (Brooklyn gets Durant back tonight, Atlanta has two less wings to guard him with Hunter and Reddish out)\n2. Cleveland Cavaliers -1 (The Cavs have been great ATS this year and Minnesota has D'Angelo Russel as doubtful)",
    "228": "Todays Lock(s) of the day!\nNCAAB - Loyola (IL) -2.5\nNBA - NO -5.5\nNHL - DET/COL O 6\nWinners are GUARANTEED!!!!!\n\n✳ JD's ML Upset Special of the Night - Cleveland Cavaliers ✳",
    "229": "@nizcomix @Cavs_House @JScottShep @cavs @keybank also looking at your tweets, you don’t like to be hopeful…",
    "230": "@nizcomix @Cavs_House @JScottShep @cavs @keybank What the guy said before is still not a lie. He’s playing like an all star this year. Plus I read your other comment of this tweet. “Cherry picked stat” something like that…",
    "231": "The @cavs hit the road for a one-game battle in Minnesota. Cleveland is 5-2 in their last 7 outings going into tonight's contest.\n\nGame Notes 12/10/21 - #CavsWolves: Overall Game #27, Road Game #14\nhttps://t.co/QK28Jda8It",
    "232": "WGR Pod - Dog Day Afternoon with @LamarStevens11... Give us a listen and learn about the easiest way to win @cavs tickets this season.... (216) 420 - 2800 it's the Whine and Gloat Radio hotline..Leave the Wolf @CavsJoeG and I a message.  https://t.co/0UFGKu7ZFl via @cavs",
    "233": "@BoomerWang23 @cavs Nice bud",
    "234": "Thank you @cavs for being simply fun and drama free",
    "235": "@BrettMercuri @Mcdzzdachef @EdGreenberger @cavs Yawn. Dilfer had one of the best defenses of all time, Foles had a great defense and I would also argue baker hasn’t reached peak Foles level. Foles made the throws that needed to be made. Baker generally doesn’t. Next.",
    "236": "@Cavs_House @T_Rosen_TPP @cavs @keybank Why should we leave them alone? They should be better",
    "237": "@nizcomix @Cavs_House @JScottShep @cavs @keybank Why do you hate Garland?",
    "238": "@nizcomix @JScottShep @cavs @keybank Just because there are guards better doesn't mean he's not a allstar",
    "239": "@T_Rosen_TPP @cavs @keybank Leave the browns alone....last year you probably said vice versa",
    "240": "@BIGFACTS16 @Mcdzzdachef @EdGreenberger @cavs Nick Foles isn’t a super bowl winner and neither is Trent Dilfer right? You realize Aaron Rodgers has only 1 Super Bowl win right? You know how hard it is to win and more often than not defense is the key even though they always give MVP to QB? 12 drops is in a 2 game stretch 8-4",
    "241": "@nizcomix @JScottShep @cavs @keybank You obviously are not a good judge of allstar talent",
    "242": "@BigZo07 @cavs He’s still overpaid and getting old",
    "243": "@representus @StephenCurry30 @NBACoalition As a lifelong fan of the @cavs, @StephenCurry30 hasn't always been a favorite. But I would stand with him any day of the week on #TeamDemocracy to strengthen voting rights for all Americans.",
    "244": "Who did it better? #Steelers @cavs https://t.co/VkBvnX1FZA",
    "245": "@cavs @keybank He and Allen should 100% be on the all star roster this year",
    "246": "@cavs @keybank ALL STAR!",
    "247": "@cavposting @cavs @socios @_bigjayy_ Thank you so much!! I hope to do more soon!!",
    "248": "@cavs @keybank Garland 100% needs to be an All Star along with Allen. If not, Cleveland should cancel the game.",
    "249": "@MustachePaxton @cavs @tackofall99 Put La Mar instead of Kevs and I buy it.\n\nObviously, we play zone.",
    "250": "@cavs @keybank So proud to see the APG take another jump. https://t.co/TXn2oFKmxg",
    "251": "@cavs @keybank Should no doubt be an All Star this year",
    "252": "@cavs @keybank All star",
    "253": "@cavs @keybank Y’all are everything the #Browns are not.",
    "254": "One of only three players in the league with 19+ PPG, 7+ APG and a .450+ FG% 🔥\n\n@KeyBank | #LetEmKnow",
    "255": "Chris Finch on the Cleveland Cavaliers:\n\n\"Unique team. Really like this team. JB has done an amazing job with these guys and his staff. Like how they play. You can see the effect that Ricky's had on them there. They really move the ball. They play with a high IQ.\"",
    "256": "@ElalcaldeRafa @JohnTelich8 @tackofall99 @cavs Dios mio that’s quite a picture 🤣",
    "257": "@BrettMercuri @Mcdzzdachef @EdGreenberger @cavs Trust me I’ve watched and rewatched every game this year. 17 drops on the year is top half of the NFL. Baker just isn’t very good I’m sorry. I’m sure he could make another playoff appearance but he isn’t a SB winner",
    "258": "@BrettMercuri @Mcdzzdachef @EdGreenberger @cavs If there’s one thing Landry can do it’s run routes. Baker will still sail it cough cough lions game.",
    "259": "@BrettMercuri @Mcdzzdachef @EdGreenberger @cavs He definitely does count. Talented receiver who isn’t built for stefanskis system. Even if he’s washed now he wasn’t when we brought him in. He’s also caught a TD each of the last 2 weeks.",
    "260": "@cavs @SociosHoops Yes. It’s wet. Just like Oil is Oily.",
    "261": "@CavsTeamShop @KidCudi @cavs @BleacherReport Reminds me of these awful jerseys. https://t.co/y7R1RHgMRA",
    "262": "@BIGFACTS16 @Mcdzzdachef @EdGreenberger @cavs Sorry OBJ doesn’t count. He’s a washed up has been at the same catch rate with Stafford. Yes on Diggs:Thielen I’m fully aware",
    "263": "Forgot to mentioned the other day @cavs beat the @chicagobulls what a game what a performance",
    "264": "@BIGFACTS16 @Mcdzzdachef @EdGreenberger @cavs I’m not asking for prolific. I’m asking for route running and actually catching the ball.",
    "265": "@BrettMercuri @Mcdzzdachef @EdGreenberger @cavs That would require getting him the ball… Browns are a run first and throw to the TE team, period. We aren’t going to have a prolific receiver in stefanskis system. Ask Stefon Diggs or OBJ. https://t.co/8QHeFTxSVw",
    "266": "@DanielAGreen1 @nbatopshot Cleveland cavaliers surprised 😮 \nLakers disappointed ☹️ \nTs: Sokmaro \n@zafpinto @HarisXir",
    "267": "@BIGFACTS16 @Mcdzzdachef @EdGreenberger @cavs Catch up kitten. Unless you don’t actually watch the games - the Browns dropped 6 vs Steelers with a WR fumble and 6 vs Ravens with a WR fumble. Change that and we are 8-4. I’m literally referring to 2 games.",
    "268": "The @cavs have a 92.3% chance of making the playoffs is insane. We’re back!! #LetEmKnow https://t.co/wN0d9pdkFS",
    "269": "@BIGFACTS16 @Mcdzzdachef @EdGreenberger @cavs I know how it’s built. If you know who the TE are you’ll see I listed 2 of them (bc Bryant’s name escaped me at the time). It doesn’t mean WR shouldn’t catch the ball does it?",
    "270": "Hi @KidCudi @cavs @KingJames @BleacherReport The capsule jersey is sold out. But I have a request: my son, born in March in Cleveland, spend his 2 first month in intensive care. He was a real fighter, and is now a beautiful baby. HE’S MY CHOOSEN ONE. Can you be his Santa Claus?",
    "271": "@BrettMercuri @Mcdzzdachef @EdGreenberger @cavs How’s this for full detail? Browns have 13 drops ON THE SEASON. The defense has shown up more often than the offense and the only complete team effort I’ve seen was the cinci game. If we’re going to have this convo u can’t be making up stats.\n\nhttps://t.co/HglhMIXujm",
    "272": "@DanielAGreen1 @nbatopshot Suprising:Cleveland Cavaliers\nDisappointing:Portland blazers\n@feritjobs",
    "273": "@BrettMercuri @Mcdzzdachef @EdGreenberger @cavs You don’t understand football. Stefanskis offense is BUILT AROUJD THE TE’s. If you have an issue with the receivers around him than bring it up with stefanski. Baker has still gotten worse month by month.",
    "274": "@John_Sabol @AmicoHoops @cavs @CavsJoeG @CavsOnTheBreak @Cavsanada @thechasesmith This is common knowledge to Cavs fans. They had just recently had Daugherty and Nance retire early and had traded Hot Rod Williams.\nYou can also bet Kobe's agent told teams like Cleveland that he wouldn't play there (like he did with the Nets).",
    "275": "@ianmirmelstein @AbelFCano @EdGreenberger @cavs I’ll come back to this",
    "276": "@glovesoffboxing @cavs @FastBreakIESR Yeah they’re tough to bet against because they’ll either not cover or they blow their opponent out by 20. There’s no in between it seems like lol",
    "277": "@CaptainQuint @cavs @Starrelish @socios @_bigjayy_ @MarkkanenLauri @evanmobley Perfect.",
    "278": "Cleveland Cavaliers are a playoff team",
    "279": "@cavs @socios @_bigjayy_ @Starrelish @JustinHeroVerse @AdamYIssa @foolam1 Can I get a @_bigjayy_ skin in Ghosts of Tsushima?",
    "280": "@NBA @tackofall99 @cavs Tacko entering his prime!!!",
    "281": "@Rel_clutch @CP_1972 @acolby215 @EdGreenberger @cavs AGAIN, explain in detail how it’s on the QB for not anticipating his guy getting tackled with the ball in the air. On the 2nd last drive AND final throw of the game. Explain how he should anticipate it.",
    "282": "We’re expecting over 1,500 students and families at the @cavs STEM Day 2022! We want to make a lasting impact for these kids and we need your help! Visit our #GoFundMe to donate and learn about the difference we can make!\n#ScorewithSTEM #NeoSTEM #CLE\nhttps://t.co/dqRsOZP2jh",
    "283": "Today's NBA Consensus (So Far):\n\nPhoenix Suns 70%\nCharlotte Hornets 67%\nIndiana Pacers 60%\nBrooklyn Nets 60%\nNew Orleans Pelicans 60%\nLos Angeles Lakers 59%\nToronto Raptors 54%\nCleveland Cavaliers 53%\nMilwaukee Bucks 52%",
    "284": "@BrettMercuri @CP_1972 @acolby215 @EdGreenberger @cavs Despite all that Browns had the ball at the end with a chance to win",
    "285": "@John_Sabol @AmicoHoops @cavs @CavsJoeG @CavsOnTheBreak @Cavsanada @thechasesmith I thought it was a forgone conclusion that Kobe wanted to play in LA.",
    "286": "@NBA @tackofall99 @cavs Happy Birthday to the Goat 🐐",
    "287": "The cleveland cavaliers play basketball tonight",
    "288": "@NBAspain @GIGANTESbasket @rickyrubio9 @TRRFoundation @cavs @nbacares Hecho !!! ✅ https://t.co/GmW4BDOPd4",
    "289": "@Rel_clutch @CP_1972 @acolby215 @EdGreenberger @cavs Again: you just blamed Mayfield for not anticipating his receiver being tackled with the ball in the air and not getting a flag while praising Herbert for a bad throw on 4th down, offensive pass interference getting called on the D for a first. Explain in detail why",
    "290": "@Rel_clutch @CP_1972 @acolby215 @EdGreenberger @cavs So you’re saying a QB should anticipate that his guy will be tackled with the ball in the air and if he doesn’t then he failed? Explain in detail why. How is Herbert awesome for an incomplete 4th down pass where he gets this is DPI for a 1st? https://t.co/kX5yypyiIX",
    "291": "@cavs @socios @_bigjayy_ @Starrelish Jarrett Allen - God of Basketball. https://t.co/LeMNLkRVOD",
    "292": "Ben Mclamore from the blazers to the cavs for 2 Second round picks? @cavs @JordanIn98 @BenMcLemore @PDcavsinsider @CavsJoeG",
    "293": "@BrettMercuri @CP_1972 @acolby215 @EdGreenberger @cavs Lml Baker should definitely have you on the payroll man. You got every excuse in the world for em, that’s passion right there can’t wait to see who’s next to blame 😭",
    "294": "I get to watch Evan Mobley and the @cavs play tomorrow 😎 https://t.co/gBMM9DsCIZ",
    "295": "@ElalcaldeRafa @tackofall99 @cavs Happy birthday Taco Tuesday!!!",
    "296": "Evan Mobley &amp; The Cleveland Cavaliers play tonight🥴",
    "297": "@cavs @socios @_bigjayy_ @Starrelish SO GOOD!",
    "298": "HAPPY BIRTHDAY @tackofall99 @cavs https://t.co/UxK1TlhMEY",
    "299": "@Kc4Tw @theonlykdonn @guappavelli9100 @Nezzzooooo @lolimshi @NBA @tackofall99 @cavs finally a cultured person",
    "300": "@BallySportsCLE @cavs Modern day tim Duncan if he can develop his bank shot",
    "301": "@BallySportsCLE @cavs @_bigjayy_ top 5 video games you’ve played 🤔💭",
    "302": "Tommy Maroon wraps up the seasons and checks stats on our Cleveland Cavaliers https://t.co/dh0SRCSpEb",
    "303": "Get ready for another night of @cavs basketball with the best of Jarrett Allen mic'd up during Wednesday's win over the Bulls!\n\n#LetEmKnow https://t.co/9qJnZ9HI1i",
    "304": "When the #NBA All-Star Game comes to #Cleveland in February, expect celebs, economic impact, more for the city; here's a look at what's in store on, off court @clevelanddotcom @cavs @NBAAllStar https://t.co/24sAlU8IGA",
    "305": "@cavs @socios @_bigjayy_ @Starrelish Love this 🖤🖤",
    "306": "@BIGFACTS16 @AbelFCano @EdGreenberger @cavs He’s had a mediocre year.  2 actually.  And 2 very good ones, 1 where he won the rookie TD record and 1 where he took the team to a Playoff win vs the Steelers and nearly took down the Chiefs going 8-3 down the stretch 20TDs-3INTs.  Also had 4 HCs. He’s not going anywhere.",
    "307": "Absolutely my next @cavs jersey https://t.co/oV4OPCBs51",
    "308": "@cavs @socios Awe, of course!!! I’ll send it now!! Thank you!",
    "309": "@Rel_clutch @CP_1972 @acolby215 @EdGreenberger @cavs And as for the stupid comment about for losses. There are 32 NFL teams. Only 3 have less than 4 losses.",
    "310": "@cavs @socios @_bigjayy_ @Starrelish FTW GUYS!!!!💪",
    "311": "@Rel_clutch @CP_1972 @acolby215 @EdGreenberger @cavs “desperation pass on fourth and 10 to the end zone, Davis appears to trip and fall. While doing so, he takes out tight end David Njoku. No flag, again.” This ball would’ve hit him in stride. Incomplete passes to 2 guys tackled with ball in the air and no flag isn’t failing",
    "312": "@cavs @socios @_bigjayy_ @Starrelish That’s sick",
    "313": "🖼️ @Starrelish \n\nWant to be included in the next #FanArtFriday presented by @socios?\n\nSubmit your designs: https://t.co/q48C8A1MET https://t.co/r0wBpy3a2V",
    "314": "@cavs @hornets  SIGN THIS MAN https://t.co/uSmkneOXUb",
    "315": "@Rel_clutch @CP_1972 @acolby215 @EdGreenberger @cavs Did you even watch that game? Final 3 min no call\n“Davis gave Peoples-Jones a hard shove well beyond the five-yard zone…forcing Mayfield to move to his next read…He found receiver Rashard Higgins. Mayfield threw it to Higgins..:.James took Higgins down before the ball arrived.”",
    "316": "@NBA @tackofall99 @cavs Amazing",
    "317": "📅 On this day in 2005, the @cavs LeBron James scored 52 points in a loss to the Bucks.\n\nIt was the second career 50-point game for the 20-year-old James. He is the only player in NBA history to record multiple 50-point games before his 21st birthday. https://t.co/keJ1HQG3wr",
    "318": "Consensus Line Move:\n2021-12-10 Cleveland Cavaliers at Minnesota Timberwolves from 0.00 to 1.00\n#LetEmKnow sharps say\n#NBA #NBATwitter #datascientist #realestateagent",
    "319": "@Rel_clutch @CP_1972 @acolby215 @EdGreenberger @cavs The other 4 losses are losses. You’re now blaming him for getting hit throwing the ball away Vs KC. FYI,Chubb fumbled, Gillem dropped a punt. 10 pts off TO in a 4 point loss scoring 29. How’s that on the QB? Losses happen. Awful Vs NE, AZ lit up Chargers.",
    "320": "@cavs @CavsTeamShop terrible job handling hot item like the mix tape jerseys especially pre xmas. Store should be open also. No updates no youth sizes. Update via social media. Opportunity to do better.",
    "321": "@connorcan01 @NBA @cavs They’re both insanely good",
    "322": "@HsgvensSon @cavs Follow this goat 🙏",
    "323": "@cavs @tackofall99 Happy birthday young man",
    "324": "5 DAYS AWAY! The @cavs and TeamWork Online invite you to the Cleveland Cavaliers Teammate Networking Event! Hear from industry leaders and make connections! If you are interested in a career in sports, this is a must-attend event! #FridayFind\n\nSign-up here:https://t.co/ZBFgHo27d4 https://t.co/86tTdBACl6",
    "325": "🎂 Tacko Fall - Cleveland Cavaliers has a birthday today",
    "326": "@cavs @tackofall99 Happy birthday Tacko! 🎉🥳",
    "327": "@BrettMercuri @CP_1972 @acolby215 @EdGreenberger @cavs You keep talking about 102 drops lmao ok 12 drops in those 2 games you say. What about the other 4 loses its everything but mayfield even tho he threw the game sealing int against KC had the ball at the end against LA failed &amp; was bad against AZ",
    "328": "@cavs @BallySportsCLE @wtam1100 @wmms @Power891 @RocketMortgage can't watch them... thankful for @wmms they don't black out local fans like @BallySportsCLE #LetEmKnow",
    "329": "Day 32 of asking @cavs for a follow👏🏾🤙🏿✊🏾🤞🏿🤚🏾👇🏻👇🏻🤞🏿👉🏼🤌✋🏼🤙🏿🦾👦🏽🧑🏽‍🦱👩🏼👩🏿‍🦰🧑🏽‍🦰👩🏻‍🦱🧔🏿‍♂️👨🏾‍🦲👨🏻‍🦳🇻🇺🇹🇬🇺🇸🇹🇰🇺🇾🇹🇴🇺🇾🇹🇹🇺🇾🇵🇦🇲🇦🇱🇺🇯🇴🇪🇷🇬🇲🇵🇫🇧🇬",
    "330": "@NBA @tackofall99 @cavs My man 47",
    "331": "@NBA @tackofall99 @cavs CELTICS LEGEND",
    "332": "@kc3mvp @statmuse @cavs @kevinlove @MarkkanenLauri @evanmobley You should delete this bro. Jank.",
    "333": "@cavs @tackofall99 HAPPY BDAY GOAT",
    "334": "@Rel_clutch @CP_1972 @acolby215 @EdGreenberger @cavs Which part of “2 games” aren’t you understanding?  I’ve made it extremely clear that we’d be 8-4 via those 2 games which had 12 drops and 2 fumbles by pass catchers. You blame him flat out which logic dictates any QB that can’t overcome 6 drops a game is garbage.",
    "335": "@NBA @tackofall99 @cavs Wasn't he Celtics",
    "336": "@NBA @tackofall99 @cavs He’s already 26??",
    "337": "@BrettMercuri @CP_1972 @acolby215 @EdGreenberger @cavs By your logic the Browns have 72 drops on the season so far? When nbc has them at 13 and another site have them at 11 Baker did fumble in scoring territory tho",
    "338": "@EdGreenberger @cavs Ok 93% ...lol",
    "339": "@cavs @tackofall99 birthday twinnnn",
    "340": "@cavs @tackofall99 Congrats.\n\nI think the sleeves are someone else's.",
    "341": "\"I’ve had a lot of pressure since I was young – and it’s something that I manage well.\"\n\n📝 @CavsJoeG sits down with @rickyrubio9 to discuss his rookie days in the Twin Cities with @kevinlove\nhttps://t.co/8gb6EaBzfe",
    "342": "@Rel_clutch @CP_1972 @acolby215 @EdGreenberger @cavs 2 games, 12 drops. Focus son. That makes us 8-4. You’re blaming Mayfiled for not overcoming 6 drops a game which means you believe 102 drops in a season is normal for a QB to overcome.",
    "343": "Man I love this kid &amp; his game! Shout out to Koby Altman for not only bringing him to the the CAVS but getting him signed long term! @cavs @_bigjayy_  @MrCavalier34 https://t.co/qkfHWb7LkP",
    "344": "@Rel_clutch @lsn92620 @CP_1972 @acolby215 @EdGreenberger @cavs “Lost 2 games” in which there were 12 drops and 2 fumbles by pass catchers. “7-19 vs teams with winning records” see previous statement. See game 1 Chubb fumble punter dropping point = 10 points for opponents in a 4 point loss. See Ravens last year kick GW FG with 2 seconds left",
    "345": "@pwilli65 @cavs I know most Browns fans support him, but there’s no way it’s 95 percent. As far as LeBron goes… yes, they hated him for leaving. And a small percentage never forgave him.",
    "346": "THURSDAY AFTERNOON PICKUPS:\n@benross70 picked up Denver Nuggets PF JaMychal \"Green Bean\" Green (dropped New York Knicks SG Evan \"Don't look up his last name\" Fournier)\n@TeranceMann picked up Cleveland Cavaliers SF Cedi \"Cheddar\" Osman\n\nWho had the better pickup?",
    "347": "@cavs @evanmobley this man blocks shots before they even leave peoples hands. and doesnt foul.",
    "348": "@EdGreenberger @cavs Dude are you from Cleveland? Nobody hated Lebron homie.\nThey hated because he was a team jumper. Cleveland people respect loyalty. I live in Cleveland and that statement is totally false. As far as baker 95% of Cleveland fans support him. Just wish he wouldn't play hurt.",
    "349": "Although he is from Columbus bring him back home asap make the move @cavs https://t.co/BcA6gr9Mzn",
    "350": "@cavs @hari6on @tackofall99 Happy Birthday “T”",
    "351": "@DNGxHB @BrettMercuri @cavs Wrong. Watch the video. 25 passes downfield outside the numbers. Most of them from the pocket.",
    "352": "@SahilBloom @chamath @LiebermanAustin @ParikPatelCFA Also hit up @cavsdan Billionaire founded @RocketCompanies @Quicken owns @stockx @cavs",
    "353": "Out of all three surprising teams that are currently in the playoffs in the Eastern Conference, which one will actually make it? @chicagobulls @cavs @WashWizards #NBA #NBA75 #Bulls #Cavs #Wizards",
    "354": "@EdGreenberger @cavs HAHAHAHAHAHHAHAHAHHA - you said Baker winning a super bowl AHHAHAHAHAHAHHAHAHAHAHAHAHAHAHAHHAHAHAHAHAHAHAHAHHAH\n\nlooks again..... HAHAHHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHHAHAHAHAHAHAHAHAHAHAHAHHAHAHAHHAHAHHAHAHAHAHAHHAHAHAHAHHAHAHAH\n\ncocaine is helluva drug",
    "355": "@cavs @tackofall99 Happy bday Taco",
    "356": "@NBA @tackofall99 @cavs Just learned that Tacko is on the Cavs",
    "357": "@NBA @tackofall99 @cavs Wacko",
    "358": "I am really enjoying the @cavs success early on. Following the Wine and Gold makes it much more enjoyable with our media guys @MrCavalier34 @CampyRussell @chones22 . Was looking at some of my old 70’s basketball cards and found these gems. https://t.co/GCJBsok7m7",
    "359": "Consensus Line Move:\n2021-12-10 Cleveland Cavaliers at Minnesota Timberwolves from -1.00 to 0.00\n#LetEmKnow mousetrap\n#NBA #sportsbettingadvice #technology #cash",
    "360": "ITS GAMEDAY\n\nTHE WOLVES TAKE ON RICKY RUBIO IN HIS RETURN AND THE CLEVELAND CAVALIERS IN TARGET CENTER AT 7 PM CENTRAL https://t.co/AeVDxLBYjJ",
    "361": "@NBA @tackofall99 @cavs Happy birthday Tacko Fall",
    "362": "@GarageBeersChad @ChaseDownPod @Cavsanada @cavs @mbrownoh21 &amp; @13b_train : let's get the funds rolling for Grey Cup 2022!",
    "363": "@GarageBeersChad @ChaseDownPod @Cavsanada @cavs Been to two Grey Cups and they are every bit of a party as described. Belly Up needs some representation for the next one in Regina.",
    "364": "@Cavsanada @ChaseDownPod @cavs Pretty much!  I mean…I guess we could’ve talked the tragically hip for a min? 🤷🏻‍♂️😂",
    "365": "Happy Birthday, @tackofall99, of the @cavs! 🥳\n\n#tackofall #clevelandcavaliers #nba #birthdaypost https://t.co/s9YLdcN8wp",
    "366": "@GarageBeersChad @ChaseDownPod @cavs We really played all the hits",
    "367": "@NBA @tackofall99 @cavs Wish Mr.Fall a happy birthday @Tom_Leak",
    "368": "I’m an episode where guys are just being dudes, we talk with @ChaseDownPod co-host @Cavsanada about the @cavs the #GreyCup and it’s festivals, There’s even a #Letterkenny reference! Lol. Just guys being dudes. Listen in and enjoy! Maybe even leave a review or rating? #letemknow https://t.co/kwA4BhMWCc",
    "369": "@cavs @tackofall99 LET THE MAN PLAY TODAY",
    "370": "@cavs @tackofall99 Happy Birthday 🎁",
    "371": "@cavs @tackofall99 6’3” teammates walking up to @tackofall99 wishing him Happy BDay: https://t.co/PE7nliwgZz",
    "372": "@EdGreenberger @cavs Yea ok",
    "373": "@beardy_mc_beard @BallySportsCLE @_bigjayy_ @cavs @hulu @YouTube I don't think they care, @cavsdan must be getting a huge money grab from Bally",
    "374": "@rdr2374 @cavs Not nearly as asinine as you believing I was comparing Baker to “the greatest players in the world” and LeBron.",
    "375": "On this day in sports history December 10, Cleveland Cavaliers Small Forward LeBron James scored 52 Points against the Milwaukee Bucks in 2005.",
    "376": "To everyone taking this at face value. If you think the Cleveland Cavaliers have a Better chance at making the playoffs than the Milwaukee Bucks, please send me the link to your plug. \n\nPlease. https://t.co/YqkBsjVA3T",
    "377": "@guappavelli9100 @nliim23 @Nezzzooooo @lolimshi @NBA @tackofall99 @cavs lemickey jokes are great",
    "378": "Cleveland Cavaliers -110 🏀 https://t.co/2Lm24zNvA1",
    "379": "@cavs @tackofall99 Happ birthday goat",
    "380": "@PickDawgz #276\n\nNBA - Cleveland Cavaliers +1\nNBA - NY Knicks +1.5\nCBB - Murray State Racers +11",
    "381": "@cavs @tackofall99 Happy Birthday Taco.  Hope it's a great one for you.\n\n#GoCavs",
    "382": "@NBA @tackofall99 @cavs happy 26th birthday @tackofall99 of the @cavs",
    "383": "@NBA @tackofall99 @cavs Really sorry for him. Couldn’t find a coach that can utilize his size.",
    "384": "Feliz cumpleaños @tackofall99. Hey @cavs nation join me in wishing this gem of a human a happy birthday!!!!! #TackoFriday https://t.co/QrnQoQQlmS",
    "385": "@cavs @BallySportsCLE @wtam1100 @wmms @Power891 @RocketMortgage just don't get KATfished man",
    "386": "@cavs @tackofall99 Happy Birthday! 🎂🎁🎈🎉🌷",
    "387": "@cavs @BallySportsCLE @wtam1100 @wmms @Power891 @RocketMortgage Win the game pls",
    "388": "@Potatoblake21_ @NBA @tackofall99 @cavs What the hell I thought he was like 33",
    "389": "Weekend starts on the road!\n\n🕗 8:00PM ET\n📺 @BallySportsCLE\n📻 @wtam1100, @wmms, @Power891\n\n@RocketMortgage | #LetEmKnow",
    "390": "@PickDawgz John fabrizi capper #206\nPick#1 Cleveland cavaliers ml -102 vs timberwolves fan duel\nPick #2 OKC +6 vs lakers. Fan duel.",
    "391": "@JohnTelich8 @cavs Alright now",
    "392": "@tackofall99 happy birthday! Thanks for being an awesome @cavs hopefully all the best",
    "393": "@lolimshi @Nezzzooooo @NBA @tackofall99 @cavs You making this reply after he made that reply: https://t.co/VI4t2Iue3u",
    "394": "@mhkeener @cavs I agree with you. I’m not talking about most Browns fans, though. I’m talking about the small, incredibly vocal contingent on Twitter that falls into the category.",
    "395": "@EdGreenberger @cavs Who in the name of our Lord is still talking about this",
    "396": "@EdGreenberger @cavs I forgot about that the day the Browns drafted Baker Mayfield. I’m assuming most Browns fans did.",
    "397": "@BallySportsCLE @_bigjayy_ @cavs Are you guys even in talks with any internet TV providers?????",
    "398": "@cavs @tackofall99 Happy birthday my guy! I just celebrated my 33rd on the 3rd!",
    "399": "@lsn92620 @CP_1972 @BrettMercuri @acolby215 @EdGreenberger @cavs Had the ball at the end to win it. Failed miserably. Lost 2 games when the defense gave up 15 and 16 points was the 4th best qb in the NE game",
    "400": "@lsn92620 @CP_1972 @BrettMercuri @acolby215 @EdGreenberger @cavs I don’t think they get it",
    "401": "@cavs @tackofall99 Happy birthday!",
    "402": "Cool that I share a birthday with a @cavs legend https://t.co/aND09xZqlP",
    "403": "@cavs @tackofall99 Happy Birthday Mr. Tacko",
    "404": "@CP_1972 @lsn92620 @Rel_clutch @BrettMercuri @acolby215 @EdGreenberger @cavs Baker put them up 7 points with 3 minutes left.",
    "405": "@NBA @tackofall99 @cavs Happy birthday to the greatest center of all time not named Jarrett Allen",
    "406": "Looking forward to @NBA All-Star Game in 2022 especially the Rising Stars game which has to include @evanmobley. @cavs @TheCLE @CLESports   @DowntownCLE \n\nhttps://t.co/q78FJqAQmc",
    "407": "Only a matter of time till tacko fall replaces isaac okoro in the starting lineup @cavs",
    "408": "@Clintwithagirl @guappavelli9100 @NBA @tackofall99 @cavs Underrated tweet.",
    "409": "@Rel_clutch @CP_1972 @BrettMercuri @acolby215 @EdGreenberger @cavs It hasn’t been consistent. I think of Cincy,chargers,KC. They put up points at will.",
    "410": "@cavs @tackofall99 TACKO FRIDAY!",
    "411": "@CP_1972 @Rel_clutch @BrettMercuri @acolby215 @EdGreenberger @cavs When the Browns win it’s him. When the Browns lose it’s they. First it was offense system. Then coach. Then offensive line. Then injuries. Then wide receivers. To his stans its never Mayfield. He’s the only constant in all of those events.",
    "412": "@BallySportsCLE @_bigjayy_ @cavs Initially, I didn't know much about Jarrett Allen when he was first traded here. The dude plays his ass off and seems like a genuinely good person. This team just seems to have very good chemistry on and off the court. Hopefully the Cavs can maintain their current level of play.",
    "413": "@cavs @tackofall99 happy Birthday &amp; New Year @tackofall99",
    "414": "@NBA @tackofall99 @cavs happy birthday tacko fall",
    "415": "@bodieondacorner @CP_1972 @BrettMercuri @acolby215 @EdGreenberger @cavs Nah the offense was fantastic after the Bengals game lmao",
    "416": "ICYMI \n\nEpisode 94 - in which we have a GREAT time talking @Cavs with @Cavsanada from the incredible @ChaseDownPod - got posted last night! \n\nCheck it out now! Cheers and Happy Friday!! #LetEmKnow https://t.co/10l2hxqxDy",
    "417": "@CP_1972 @Rel_clutch @BrettMercuri @acolby215 @EdGreenberger @cavs The browns will draft a wr in the 1st round and another in the 3rd. Browns receivers blow. Offense hasn’ t been the same since baker blew up his shoulder against the Texans.",
    "418": "@Bitey2Bitey @hylander91 @cavs Excellent comeback. I can tell you majored in logic.",
    "419": "@NBA @tackofall99 @cavs we want tacko 👏👏👏👏👏",
    "420": "Join us in wishing @tackofall99 of the @cavs a HAPPY 26th BIRTHDAY! #NBABDAY https://t.co/t7gbuH5OrB",
    "421": "@cavs @tackofall99 HAPPY BIRTHDAY @tackofall9 🎊🎉🎈🎂🎁",
    "422": "@NBA @tackofall99 @cavs Happy Birthday 🎁🎉🎈",
    "423": "@cavs @tackofall99 Goat",
    "424": "@BrettMercuri @CP_1972 @acolby215 @EdGreenberger @cavs He is 7-19 against teams with winning records, I’m sorry he’s taking you nowhere fast",
    "425": "@BrettMercuri @CP_1972 @acolby215 @EdGreenberger @cavs Stop it there are 19 teams with the same amount of drops or more than the Browns and they find a way to win. Excuse after excuse. Ignore all the un catchable passes the qb throw lmao pointing the finger at everyone but the main problem the qb suck 11 TDS through 11 games 👏🏾👏🏾",
    "426": "@Mcdzzdachef @BIGFACTS16 @EdGreenberger @cavs Yeah. We should’ve drafted all OSU players!",
    "427": "@NBA @tackofall99 @cavs Happy birthday Yordenis Ugas 😊",
    "428": "Can y’all play him @cavs @NBA https://t.co/LtxcbjUdWd",
    "429": "@Rx4Pain @AbelFCano @cavs Blaming fans for what? Fans have absolutely zero impact on a team, outside of making noise at a game.",
    "430": "@NBA @tackofall99 @cavs this man would’ve been a first overrall pick 20 years ago.",
    "431": "@EdGreenberger @Rye_Rye_Rocco_ @cavs Wanna cry about it for however long until you feel better? Ffs people dislike others for a lot of things. You run to Twitter to fire people up period.",
    "432": "@cavs @tackofall99 More life Beast!🎉",
    "433": "@EdGreenberger @AbelFCano @cavs ...and this happened when? You bring it up for what reason? Did you stab Ceasar in the back also? Its in the past stop grasping and blaming fans.",
    "434": "@nliim23 @Nezzzooooo @lolimshi @NBA @tackofall99 @cavs if ur a school shooter maybe.",
    "435": "@NBA @tackofall99 @cavs Thon Maker better",
    "436": "@Mcdzzdachef @BIGFACTS16 @EdGreenberger @cavs As I thought. You believe that Higgins, Landry, Hooper, Njoku, Bradley, Natson, Schwartz and the rest of the pass catchers are all HOF players.",
    "437": "@NBA @tackofall99 @cavs Happy birthday! Hope it's a great one!",
    "438": "@cavs @tackofall99 HAPPY BIRTHDAY TACKO",
    "439": "@Rel_clutch @CP_1972 @acolby215 @EdGreenberger @cavs The fact you find it surprising that only 20 points were scored in a game with 12 drops and 2 WR fumbled says you don’t understand the game very much. Repeat after me. If a team had 6 drops per game that would equate to 102 for a season. Do you think that team will score a lot?",
    "440": "@Rel_clutch @CP_1972 @acolby215 @EdGreenberger @cavs So your excuse is that the offense took advantage of turnovers. Remember when you bitched last week about Baker and ignored drops and complained because we scored 3 off 4 takeaways? Any questions?",
    "441": "@LeVirginJames @Nezzzooooo @lolimshi @NBA @tackofall99 @cavs U still mad he left Cleveland 🤡 bozo",
    "442": "@cavs @tackofall99 Happy Birthday Tacko 🌮 Fall!",
    "443": "@NBA @tackofall99 @cavs Happy bday",
    "444": "@NBA @tackofall99 @cavs Future Allstar",
    "445": "@NBA @tackofall99 @cavs Happy birthday Tacko 🌮",
    "446": "@NBA @tackofall99 @cavs Happy Birthday!",
    "447": "@cavs @tackofall99 Hbd to the tackster",
    "448": "@cavs @tackofall99 Happy Birthday",
    "449": "@Nezzzooooo @lolimshi @NBA @tackofall99 @cavs lemickey jokes are funny deal with it https://t.co/y6n4YHOthY",
    "450": "@cavs @tackofall99 Goated",
    "451": "@cavs @tackofall99 Happy birthday Tacgoat Fall",
    "452": "@cavs @tackofall99 Happy birthday goat",
    "453": "@BrettMercuri @CP_1972 @acolby215 @EdGreenberger @cavs 10 pts in both those games. That’s mediocre, go back and count all the un catchable pass dude threw",
    "454": "@NBA @tackofall99 @cavs Dude has been 26 for years",
    "455": "@anslem00 @Frazzy241 @NBA @tackofall99 @cavs @David1Amelia ratio",
    "456": "@NBA @tackofall99 @cavs NBA legend Tacko Fall",
    "457": "@NBA @tackofall99 @cavs This guys is 26?",
    "458": "@Rel_clutch @EdGreenberger @acolby215 @cavs So what you’re saying is that his offense isn’t designed for the QB to win it. FYI Njoku dropped this throw and we punted.",
    "459": "@cavs @tackofall99 Happy Birthday Tacko!! https://t.co/17NFOKLwrc",
    "460": "@NBA @tackofall99 @cavs Happy birthday Tacko!!! https://t.co/I0UMZvcvdK",
    "461": "@Nezzzooooo @NBA @tackofall99 @cavs you making this reply: https://t.co/ucW6DPAl1X",
    "462": "@cavs @tackofall99 YESSIR HAPPY BIRTHDAY GOAT 🤝",
    "463": "@cavs @tackofall99 Happy bday!",
    "464": "@cavs @tackofall99 HAPPY BDAYYYYY",
    "465": "@NBA @tackofall99 @cavs Better than jormickey",
    "466": "@cavs @tackofall99 Happy birthday to the GOAT",
    "467": "@NBA @tackofall99 @cavs better than Lefraud",
    "468": "@Rel_clutch @EdGreenberger @acolby215 @cavs Again. I’m talking about 2 games where there were 6 each game. Give me back up of who has overcome that and n a game.",
    "469": "@NBA @tackofall99 @cavs Overrated",
    "470": "@cavs @tackofall99 Really disappointing that it didn’t Fall on a Tuesday but Happy Birthday nonetheless!",
    "471": "Join us in wishing @tackofall99 of the @cavs a HAPPY 26th BIRTHDAY! #NBABDAY https://t.co/MdC8F8KoBz",
    "472": "@Rel_clutch @EdGreenberger @acolby215 @cavs That’s what I said to the 12 between Steelers/Ravens. What QBs overcome 6 drops a game. List them with back up on your claim",
    "473": "Join us in wishing @tackofall99 a very happy birthday! 🎉 https://t.co/j4IMw7MdLU",
    "474": "@Rel_clutch @CP_1972 @acolby215 @EdGreenberger @cavs 11-5, playoff win with 3 TDs. Take away 12 drops 2 WR fumbles in 2 games we are 8-4. Is Lamar Jackson a franchise QB? Is Josh Allen?",
    "475": "@BrettMercuri @EdGreenberger @acolby215 @cavs Browns gotta lead the league in drops 🤣",
    "476": "@BrettMercuri @EdGreenberger @acolby215 @cavs Aw man drops again 😭",
    "477": "@BrettMercuri @EdGreenberger @acolby215 @cavs This is clearly a depth problem with the receivers &amp; let’s not forget stefanski’s offense saved Bakers career",
    "478": "@Mcdzzdachef @BIGFACTS16 @EdGreenberger @cavs Please back up where I said Mayfield is Montana. And if you refuse that means you think he’s throwing to Jerry Rice at every position.",
    "479": "@BrettMercuri @CP_1972 @acolby215 @EdGreenberger @cavs It’s the truth Baker’s best year was average and he was 30th in completion %",
    "480": "@acolby215 @EdGreenberger @cavs Curious can you or anyone who likes your post explain how drops and player fumbles that end drives are the fault of the QB ? How is a WR fumble a QBs fault? How are drops a QBs fault?",
    "481": "@TheRealHuppOG @cavs Not going to Lie KLove has played in such a way I think we need to keep him... And plus I've seen him get busy in the playoffs before",
    "482": "@Mcdzzdachef @BIGFACTS16 @EdGreenberger @cavs Hey look an OSU fan hating Mayfield for flag planting!",
    "483": "@BIGFACTS16 @Mcdzzdachef @EdGreenberger @cavs So you’re saying the 12 drops between Pitt/Balt means he played bad? Explain in full detail.",
    "484": "@Rel_clutch @CP_1972 @acolby215 @EdGreenberger @cavs Fantasy football logic.",
    "485": "@Rel_clutch @EdGreenberger @acolby215 @cavs Stefanski typically plays in a 15 yard box with routes. Here’s a 3rd down 5 wide route. Let me know what you notice. In detail. https://t.co/iuJpiuEcBg",
    "486": "@Rel_clutch @EdGreenberger @acolby215 @cavs So 3 3rd down drops in one game that hit guys square in the hands are the QBs fault. Thanks for correcting me that drops are on the QB and it’s the QBs job to throw and catch.",
    "487": "@EdGreenberger @BrettMercuri @acolby215 @cavs Ignore the fact that the qb has been figured out, everybody sends the house on 3rd down because he is one of the worst qbs against the blitz",
    "488": "@BallySportsCLE @_bigjayy_ @cavs Would love to watch but, like half the viewing area, I cannot because I stream my tv content. Losing a generation of fans.",
    "489": "@EdGreenberger @BrettMercuri @acolby215 @cavs I did lmao &amp; now its stefanski’s offense 😭😭 I can’t with y’all man 🤦🏾‍♂️",
    "490": "@CP_1972 @BrettMercuri @acolby215 @EdGreenberger @cavs He was in fact lmao. He finished top 10 in one category lmao",
    "491": "Let’s get it done @cavs https://t.co/5caacXZXJT",
    "492": "@Browns_Fan919 @eni_d8 @MarkCor28 @EdGreenberger @cavs So, what's that do for anyone?",
    "493": "@EdGreenberger @cavs Sorry, but most of us Buckeye/Browns fans understand that college kids are aloud to be excited after a big win. As a buckeye fan I also understand that beating the buckeyes can be the biggest win in many college kids lives.",
    "494": "Cleveland Cavaliers play basketball today 😁😁😁",
    "495": "@84baseballcards @HobbyConnector @sports_sell @CardboardEchoes @TheHobby247 @dwdsportscards @ConnectingHobby @CardHobbyRTs @connections_sc @RexRTs 2021 Cleveland Cavaliers &amp; Oklahoma City Thunder $10 Shipped BMWT\n2021 Dallas Mavericks Lot $40 OBO\n2021 Denver Nuggets Lot $10 Shipped BMWT\n2021 Detroit Pistons Lot $50 OBO https://t.co/mXuZYriVTN",
    "496": "@EdGreenberger @cavs He needs to cut out the noise and perfrom like the champion he can be.  He cannot be swayed by fans",
    "497": "@B0t_Central @KidCudi @cavs @BleacherReport yessirski me too bro bro",
    "498": "@EdGreenberger @cavs By the way, if The front office was100% on Mayfield why didn’t he get paid last year? He ain’t getting a new contract at the end of this season either. Chubb, Garrett got their money. Speakers volumes.",
    "499": "@EdGreenberger @cavs Tim couch had a good year I’m 02 led the browns to the playoffs. How’d that work out. You act like stefanski, berry, Chubb, Garrett, Landry had nothing gto do with that 28-28😂",
    "500": "@JohnTelich8 @cavs Oh how fun!!! Good for him and his team!!",
    "501": "@RickMalloyjr1 @cavs Tired of losing? So fans of a laughingstock team that went 0-16 in 2017 and 38-122 over the past decade get a QB who goes 28-28, including an 11-5 playoff year in 2020, and 6-6 this year still in the hunt, and now they somehow just HATE the guy? \n\nSorry… that makes no sense.",
    "502": "Cup of Cavs: Cleveland Cavaliers news and links for Friday, December 10 – NBA News https://t.co/4I9tbCZ5om",
    "503": "@EdGreenberger @cavs His delusional supporters still won’t address the fact that he isn’t winning games, hasn’t lived up to expectations and isn’t a good quarterback.",
    "504": "@SirYacht_ Reimagining @cavs history.\n\n  Cleveland has always managed to make every experience a negative one.\n\n  Winning the Title bought a couple of days of peace, before people started complaining again.\n\n  @KingJames was on 1 year contracts and fans were trying to run him off... again.",
    "505": "@EdGreenberger @cavs What’s the reason? Tired of all the talk and posturing while not putting up numbers? Maybe that portion of the fan base is tired of losing.",
    "506": "@EdGreenberger @cavs Bad take. Obviously don’t understand Browns fans.",
    "507": "Cup of Cavs: Cleveland Cavaliers news and links for Friday, December 10 https://t.co/hqIukF1M7p",
    "508": "@eni_d8 @MarkCor28 @EdGreenberger @cavs Naw, Baker ain't building any schools and I guarantee if he's no longer a Brown he will do zero for this area.  Only people like you think that small.",
    "509": "@EdGreenberger @cavs “Tell me you’re and asshat without telling me you’re an asshat for $400, Alex”.",
    "510": "@EdGreenberger @BrownsFutures @markburchett1 @Jaysipher @GSpitzig @woodrowsackman @Rye_Rye_Rocco_ @cavs You don’t need to ask them? Yet you’ve been proven dead ass wrong by two of your only examples. \n\nYeah I’d say your intuition is spot on!",
    "511": "@EdGreenberger @BrownsFutures @markburchett1 @Jaysipher @GSpitzig @woodrowsackman @Rye_Rye_Rocco_ @cavs Ed, take your big fat L.",
    "512": "@EdGreenberger @cavs Nobody cares about this!? 🤣",
    "513": "Maillot Authentic Kyrie Irving Cleveland Cavaliers 2012 https://t.co/4HRCj0fgkc",
    "514": "Cleveland Cavaliers vs. Minnesota Timberwolves - 12/10/2021 Free Pick &amp; NBA Betting Prediction https://t.co/DU3nSe0qLr\n.\n#Betting #FreePicks https://t.co/EDDUWu1K3h",
    "515": "@BallySportsCLE @_bigjayy_ @cavs He's growing his shooting",
    "516": "The @Cavs need to go get Caris LeVert. It makes sense for a LeVert to be in Cleveland you know",
    "517": "NBA Basketball Game Betting Picks Simulator: 8:10 PM ET - Cleveland Cavaliers vs. Minnesota Timberwolves - YOU CAN RUN THE GAME SIMULATION FOR FREE HERE: https://t.co/SOsRCnyqaE #nba #sportsbetting #freepicks #cappertek",
    "518": "@BIGFACTS16 @LaatschAttack @EdGreenberger @cavs Hell I forgot about it. 🤷🏽‍♂️ 🤷🏽‍♂️",
    "519": "@EdGreenberger @AbelFCano @cavs You obviously have no clue. Most people forgot all about that, but obviously you haven't. 🤣 🤣",
    "520": "@NBAspain @rickyrubio9 @cavs Ricky you are the best ¡¡¡¡¡ 👏👏👏",
    "521": "@cavs @SociosHoops I can tell you whats wet, 3 first rounders to the @PelicansNBA  for Brandon Ingram, get Klove some legally prescribed trt and  Cavs vs Warriors finals",
    "522": "@ianmirmelstein @AbelFCano @EdGreenberger @cavs Having complete crap at QB for years doesn’t justify starting a mediocre one that was drafted first overall. Of course we’ve had it worse but the goal (SB) has stayed the same. I for one can’t see is winning a sb with him. Sorry.",
    "523": "@LaatschAttack @EdGreenberger @cavs It’s really not tho. Fans want to win games and baker has gotten worse month by month. Fans cheer for DPJ (Michigan guy) I promise nobody cares about a flag plant especially all these years later.",
    "524": "@BrettMercuri @Mcdzzdachef @EdGreenberger @cavs Okay you successfully named the one game that the offense showed up and the defense didn’t. Should I list off the games the defense showed up and the offense didn’t?",
    "525": "@eni_d8 @MarkCor28 @EdGreenberger @cavs Biggest IF I’ve ever seen",
    "526": "@jimmylongojr @Cavsanada @dariusgarland22 @cavs @jimmylongojr PLEASE tell me you have the Darius - Isaac \"Wade celebration\" moment from last game against the Bulls ?",
    "527": "@EdGreenberger @cavs “I have to say”…You seem fun; Baker/Browns winning a Super Bowl? Yeah, ok! Sure…There’s such a thing as Cavs fans? Enjoy your happiness, Edward.",
    "528": "@PickDawgz #274 \nCBB High Point -9.5\nNBA Cleveland Cavaliers +1.5\nNHL Vegas Golden Knights -1.5 +110 \n#PickDawgzCapperContest",
    "529": "Zydrunas Ilgauskas has 38 points in Cleveland Cavaliers' last minute loss against Milwaukee Bucks #NBA #NBA9798",
    "530": "@frobleyxgarrett @KidCudi @cavs @mitchell_ness It does cost a bit more than the standard @mitchell_ness Swingman threads.",
    "531": "Check out this listing I just added to my #Poshmark closet: Cleveland cavaliers flex hat. https://t.co/TogPpjmCeG #shopmycloset @poshmarkapp",
    "532": "@EdGreenberger @cavs No Browns/OSU fan gives a crap about the flag plant anymore. Just fucking stop.",
    "533": "@statmuse @evanmobley @cavs evan \"wrong guy\" mobley",
    "534": "@YoungBullCLE @CavsTeamShop @cavs @KidCudi @BleacherReport Got me one. Best Collab ever",
    "535": "@cavs It's time for me to retire the LeBron jersey and get me a new Cleveland Cavaliers jersey. But who should I get? Too many choices 🤔",
    "536": "@EdGreenberger @cavs This is impossible for multiple reasons but enjoy the the idea I guess.",
    "537": "@cavs I love this team man I love y’all",
    "538": ".@evanmobley can do almost everything on the court, and his stellar play has translated to Ws for the @cavs! ⚔️\n\nWatch the ROY contender battle the @Timberwolves tomorrow at 9 AM on NBA League Pass 👉 https://t.co/BuSAn2YHYf \n\n#NBA75 https://t.co/ToexAHLsrE",
    "539": "@CavsTeamShop @KidCudi @cavs @BleacherReport Wear em in game",
    "540": "@Spas_tik_ @cavs That’s hardly what I’m doing. Any Browns fan who still hates Mayfield for the flag plant only has himself to blame.",
    "541": "@eni_d8 @MarkCor28 @EdGreenberger @cavs Baker isn't winning a S.B. for anyone.",
    "542": "@EdGreenberger @cavs You taking pleasure in other people's suffering says more about you than it does about those you're judging.",
    "543": "Check out this listing I just added to my #Poshmark closet: Cleveland Cavaliers New Era Two-Tone 9FIFTY Adjustable Hat -. https://t.co/VuDVVNpf4K #shopmycloset @poshmarkapp",
    "544": "@EdGreenberger @markburchett1 @Jaysipher @GSpitzig @BuckeyeRP @woodrowsackman @Rye_Rye_Rocco_ @cavs I think hate sounds extreme. There were significant expectations this season, then disappointment and a desire to point fingers at something, coach, QB, playcalling, injuries….. anything. And that frustration seems reasonable to me.",
    "545": "@EdGreenberger @cavs Congratulations on the most uninformed tweet in Twitter history! Absolutely not one single Browns or Cavs fan agrees with that nonsense",
    "546": "@EjLiddellSZN @cavssebastian2 Oh, you mean 2022 NBA Champions Cleveland Cavaliers lead by DG the PG and Frobley?",
    "547": "Tyler said unto the cleveland cavaliers i aint",
    "548": "Pretty nice hu @cavs https://t.co/a9fgZqV9Ip",
    "549": "@EdGreenberger @cavs Should have seen buckeye fans elation when that broke dick Nick Bosa did a celebration flag plant after he sacked Baker.",
    "550": "@cavs @SociosHoops It’s not wet. That being said, I would love to watch the Cavs make a splash on the home court against any of our upcoming opponents, so if this comment gets me closer to that goal, then… 💧💧💧",
    "551": "@CavsPIsWin @cavs @SociosHoops Wazz as usual",
    "552": "@EdGreenberger @cavs I am Buckeye Browns fan and that moment with Baker planting that flag is great.\n\nThe problem is that QB with attitude is gone and now he is Rocky in Rocky 3 before Clubber Lang kills Mickey and knocks him out in a flash",
    "553": "Come back to @cavs @KingJames #LakeShow doesn’t deserve your greatness. #LetEmKnow",
    "554": "What a beautiful sight to see @cavs https://t.co/fWWEMmZjzz",
    "555": "@SportsBoyTony Lima, don’t let anything distract you from the fact that the Cleveland Cavaliers have the highest % chance to win the finals out of the East.",
    "556": "@EdGreenberger @cavs Sorry Ed this is just wrong.",
    "557": "@BrownsFutures @markburchett1 @Jaysipher @GSpitzig @BuckeyeRP @woodrowsackman @Rye_Rye_Rocco_ @cavs Again, just give me an explanation. Just one. Can you think only one other good reason for hating this QB all season long?",
    "558": "@EdGreenberger @markburchett1 @Jaysipher @GSpitzig @BuckeyeRP @woodrowsackman @Rye_Rye_Rocco_ @cavs Thinking you know how someone else feels better than they do is hard to defend.",
    "559": "@RandyNBCLA @ShannonSharpe @cavs @Lakers Agreed Randy! Lakers did mortgage the youth for the one ship in 2020. Sadly. \nOur local CH kid is now coming to his own - ZO! \nMy desktop reminder on how great the MAMBA was.. https://t.co/5AmqXEIsRy",
    "560": "@EdGreenberger @cavs To see what dumb shit U say next ED",
    "561": "I’M SOOO EXCITED!!! GET TO GO SEE MY TWO FAVORITE NBA TEAMS ON JANUARY 4th!!! @cavs @memgrizz LFG!!! First Cavs game for me since 2012 😁😊😌 https://t.co/OCmBVTdnpX",
    "562": "@mcooney099 @cavs Jeez. I’m not saying all, half or even 10% of Buckeye/Browns fans still hate the guy. But those people are obviously out there. We see them on Twitter every day.",
    "563": "@BallySportsCLE @_bigjayy_ @cavs Imagine if non-cable subscribers could watch!  I bet more people would know who he is and then buy his jersey",
    "564": "@CavsTeamShop @KidCudi @cavs @BleacherReport What city is that?  Isn’t  NOT Cleveland?  The buildings are all mixed up!",
    "565": "@BrownsFutures @markburchett1 @Jaysipher @GSpitzig @BuckeyeRP @woodrowsackman @Rye_Rye_Rocco_ @cavs I don’t need to ask them. There’s only one possible reason for that kind of hatred right now — that they’ve hated Mayfield since the beginning. And there’s only one reason a Browns fan would’ve hated Mayfield from the beginning. This isn’t hard to understand.",
    "566": "@MentorCavFan @MunchCleveland @cavs My original post has nearly 600 likes and nearly 200 retweets.",
    "567": "@cavs @evanmobley I wanna ask the other teams how to get past Lauri, Mobley and Allen easily. 😂",
    "568": "@EdGreenberger @MunchCleveland @cavs There’s really not, as evidenced by the zero likes to this comment. 🤷🏻‍♂️",
    "569": "@EdGreenberger @markburchett1 @Jaysipher @GSpitzig @BuckeyeRP @woodrowsackman @Rye_Rye_Rocco_ @cavs Quit assuming and ask them? You’re  the reporter.",
    "570": "@EdGreenberger @cavs I'm surprised.  You don't understand the pulse of Cleveland fans at all.  You probably agreed with ESPN when they said that all Cleveland fans were burning LeBron jerseys when it was like 5 idiots.",
    "571": "@mcooney099 @cavs I’m the national media? Interesting. Bro, I’ve been a Browns, Cavs and Tribe fan since 1980.",
    "572": "@EdGreenberger @cavs What are you talking about?  No Browns fans care about this.  I'm a Browns and Buckeyes fan and liked it.  The Buckeyes deserved to be shown up for that embarrassing lack of effort.  You are just like the rest of the national media that just likes taking cheap shots at Cleveland.",
    "573": "@Catoishere @cavs @Slimdog @CamoAkaRambo @TLuvsBaseball @iamkrang @OspreysFB @DirtDawg80 @dripordie_ @Cmd_Guap1 @miggy_roman @Shakabrodie @ElShaungo_ @BRKCP_ @mexi38 Maybe… https://t.co/WgldT2iaG9",
    "574": "@ChiefWahoo22 @cavs @Slimdog @CamoAkaRambo @TLuvsBaseball @iamkrang @OspreysFB @DirtDawg80 @dripordie_ @Cmd_Guap1 @miggy_roman @Shakabrodie @ElShaungo_ @BRKCP_ @mexi38 Bro, nice jersey … I bet you have a nice fitted to go with it!",
    "575": "@BrownsFutures @markburchett1 @Jaysipher @GSpitzig @BuckeyeRP @woodrowsackman @Rye_Rye_Rocco_ @cavs Again… give me one good reason why a Browns/Buckeye fan would absolutely loathe a QB who 11 months ago led the team to their 1st playoff trip in forever and their 1st playoff win in 30 years? By the way, try tweeting at the other guy.",
    "576": "@JustinTbao @KidCudi @cavs @mitchell_ness I need this, but god $175 is just a lot",
    "577": "@BrownsFutures @EdGreenberger @Jaysipher @GSpitzig @BuckeyeRP @woodrowsackman @Rye_Rye_Rocco_ @cavs Until the day I die!",
    "578": "ALERT: New high roller bet posted!\nA bet has been placed for $6,002.49 on Minnesota Timberwolves - Cleveland Cavaliers to win $12,125.02.\nTo view this bet or copy it https://t.co/vE3jX5Vnmg https://t.co/bgkICrr7DG",
    "579": "@JohnTelich8 @cavs Good for him.  Wow what a shot.",
    "580": "@BrownsFutures @EdGreenberger @Jaysipher @GSpitzig @BuckeyeRP @woodrowsackman @Rye_Rye_Rocco_ @cavs I honestly don’t know who anyone is in this thread. Hahahaha. Do I hate that baker and OU beat OSU and planted the flag on my wedding night? Yes I do. But would I be pissed if baker and the browns won the SB?! Fuck no I wouldn’t be pissed.",
    "581": "@lanzarotelandia @cavs @SociosHoops I have had cold sweaters before bro",
    "582": "@EdGreenberger @Jaysipher @GSpitzig @BuckeyeRP @woodrowsackman @Rye_Rye_Rocco_ @cavs @markburchett1 Show me the significant number of people who are so bitter about the flag planting that they’ll hate if Baker wins a SB for the Browns and we’ll ask them too. I’d rather let them explain their position than argue about assumptions.",
    "583": "@zdubb7895 @cavs By the way, why are you following me?",
    "584": "@zdubb7895 @cavs What is that job exactly?",
    "585": "@FruitPunchMarlo @cavs @evanmobley I imagine Mobley looks like what Kevin Durant looked like at age 20. Smooth and graceful.",
    "586": "@EdGreenberger @cavs U seem very average at your job #dbag",
    "587": "@tmb237 @cavs Yawn. So many incredibly unfunny people on Twitter.",
    "588": "@EdGreenberger @cavs Keep grasping at straws my friend. No one cares about that.",
    "589": "@zdubb7895 @cavs You seem nice.",
    "590": "@BrownsFutures @Jaysipher @GSpitzig @BuckeyeRP @woodrowsackman @Rye_Rye_Rocco_ @cavs @markburchett1 Great. That’s one guy. Do you really think there aren’t others who still feel that way? Have you read some of the hate on Twitter? Not disappointment. Not frustration. Straight-up contempt for a QB who won a playoff game last year. Explain that contempt it to me if you can.",
    "591": "@HoopShots12 @ShannonSharpe @cavs @Lakers They just arent well constructed.  Seen this movie in Cleveland for half a season.  Remember the DWade, Drose, Jcrowder and friends experiment?   It was done by trade deadline.   This LA version may be too.",
    "592": "@EdGreenberger @cavs That’s all it is is an idea. More like a pipe dream. Regardless baker isn’t gonna sleep with you Ed",
    "593": "@RandyNBCLA @ShannonSharpe @cavs The more I watch this future HOFers with this @Lakers team, the more I miss KOBE BRYANT! #MambaMentality #MambaForever",
    "594": "@Jaysipher @EdGreenberger @GSpitzig @BuckeyeRP @woodrowsackman @Rye_Rye_Rocco_ @cavs @markburchett1 Makes perfect sense sir! Thanks for the clarification. Go Browns! \n\n@EdGreenberger 👀",
    "595": "@BrownsFutures @EdGreenberger @GSpitzig @BuckeyeRP @woodrowsackman @Rye_Rye_Rocco_ @cavs @markburchett1 nope i'd be miserable and distraught! LOL no I'd be hype as fuck that tweet old asf anyways, I'm almost positive I have a tweet forgiving Baker lmfao. like yeah I'm a big college guy right but if you bring CLE a ring imma love you",
    "596": "@ShannonSharpe Get that ol thang back with the @Cavs",
    "597": "Is this the mid 2000’s Cleveland Cavaliers?! https://t.co/rC72RvoKos",
    "598": "@EdGreenberger @cavs It makes you sit back and think if Cleveland fans truly did deserve that 52 year drought and all the shots we took from national media over the years. So many ungrateful fans in this city who will turn their back on you quickly, most of them are alcoholics, too. Lol. https://t.co/AFtURD03vW",
    "599": "@EdGreenberger @cavs I don’t think you have to worry about that anytime soon",
    "600": "Need one of those @mitchell_ness x @KidCudi @cavs jerseys!",
    "601": "@MrZZZ30 @NBA @cavs He’s very good defensively, I just have a hard time calling a rookie elite 20+ games into their NBA career.",
    "602": "@EdGreenberger @cavs The flag plant will ALWAYS irritate me. HOWEVER, he's our QB now and I enjoy every win. Winning the AFC title game will be the greatest day ever, only topped by a Superbowl win. I hate Xichigan more than the flag plant, yet I root for DPJ, Leroy Hoard, &amp; Steve Everett.",
    "603": "@brianresnik @cavs Yes… some Browns fans. And Karlis didn’t miss.",
    "604": "i live in a world where the Cleveland Cavaliers are the best sports team i root for.",
    "605": "@okudah_szn @cavs @evanmobley No.  There were some players who could have back in the day - Wilt Chamberlain and Wes Unseld in particular - but the dpoy didn't exist.",
    "606": "@sethry16 @AbelFCano @cavs So, some Browns/Buckeye fans hate him with a white hot passion because he’s… immature?",
    "607": "@BallySportsCLE @cavs @DreKnott THEMARKSMAN CAVS#24 https://t.co/sHwHtVv6nX",
    "608": "@UnfrozenVaughn @EdGreenberger @AbelFCano @cavs Like I said, immature.",
    "609": "@Cavsanada @cavs Starting line up looking at NBA small ball pace and space trend https://t.co/yHIVu0UYzS",
    "610": "@EdGreenberger @cavs 0 Browns fans would be unable to enjoy it lmao",
    "611": "@EdGreenberger @hylander91 @cavs Knucklehead.",
    "612": "@cavs @BallySportsCLE @DreKnott @evanmobley THE MARKSMAN  CAVS # 24 https://t.co/Bfqjpsmk9Q",
    "613": "@CavsTeamShop @KidCudi @cavs @BleacherReport Make youngboy jerseys",
    "614": "@Lakers have 3 superstars \nNot 1 ... not 2 ....\n3......\nAnd they still shit \nI wonder if @KingJames will join the @BrooklynNets or @Suns or go back to @cavs or @MiamiHEAT",
    "615": "@cavs can u guys teach the @Lakers how to play defense",
    "616": "@EdGreenberger @cavs Flag bounce maybe",
    "617": "@rayrat1747 @NBA @cavs Above average?! He's already Elite!",
    "618": "@AndreaCollins84 @cavs That is one HAPPY kid!",
    "619": "@ohiobourbon1 @cavs Because that’s what you get.",
    "620": "@EdGreenberger @cavs Who is this guy and why is he in my timeline now",
    "621": "@cavs do not be cowards. We know you got it. https://t.co/HYHyBxBMWo",
    "622": "This is former @cavs star Ron Harpers son, Ron Jr. Just beat Purdue at the buzzer !!   https://t.co/rRB2kMozk4",
    "623": "@KelTraut @JohnTelich8 @cavs @fox8news They have no idea why it’s called return.",
    "624": "@BigZo07 @cavs Draft picks. Cash in on K love",
    "625": "@TheRealHuppOG @cavs They have to make several moves but the bad part is who are you going to give up🤔",
    "626": "@AuthorHorror @Mcdzzdachef @EdGreenberger @cavs They won't. All you have to do is note the name is an OSU reference. Baker could go 20-25 with 10 TDs in a loss and they'd blame him. It's all about the flag for them. Your point was spot on.",
    "627": "@BigZo07 @cavs Exactly. Plus depth helps in case of injury or foul trouble. We definitely lack in three point shooting",
    "628": "@TheRealHuppOG @cavs Yeah man. And in the Playoffs they will just double Garland and take him out the game",
    "629": "@EdGreenberger @cavs You put superbowl and baker mayfield in the same sentence. \n\nit’s a terrible time to construct a tweet like that, with someone of your stature. \n\nUnless you were going for that of course.",
    "630": "@BigZo07 @cavs We definitely need more guards and depth. We literally have like 7 dudes who barely play",
    "631": "@RickMalloyjr1 @cavs We’re talking about the ones who loathe Baker and make it obvious in their tweets. There’s only one reason for that kind of hate. The guy led this team to the playoffs 11 months ago and won their 1st playoff game in 30 years — in Pittsburgh, no less.",
    "632": "It’s official, I am now a Cleveland Cavaliers fan",
    "633": "@TheRealHuppOG @cavs I really wish we could get Levert because then we might go further than the 2nd rd. But presently constructed I think we lose in the 1st rd in a seven game series",
    "634": "@MLxBknms @CavsTeamShop @cavs @KidCudi @BleacherReport Thanks man!",
    "635": "@dddaily5 @cavs Reading all the Baker vitriol on Twitter. This isn’t a new topic. It’s been discussed many times this season and last year as well.",
    "636": "@Mcdzzdachef @BrettMercuri @EdGreenberger @cavs Would you please take a minute and look at what I wrote. It was a commentating about the phallacy that good QB's consistently win games in the last 2 minutes- that is simply not true. I didn't say a word about Baker- obsessed much.",
    "637": "@EdGreenberger @cavs BrownsBuckeye fans don’t care about the flag plant. They don’t like mayfield because he isn’t winning games, hasn’t lived up to expectations and isn’t a good quarterback.",
    "638": "@EdGreenberger @cavs What prompted you to tweet this out of the blue? Seems like a desperate attempt at getting attention. Maybe there are two fans that feel that way but once out of college and on an nfl roster, most people can care less.",
    "639": "@FrankJJustice @cavs I’m telling you it’s possible to be both.",
    "640": "@ianmirmelstein @EdGreenberger @cavs My point was in reference to the browns having such a terrible past. This front office won’t take that into consideration when making decisions. I trust Andrew Berry to make the right decisions for this franchise. I think he’ll unsuccessfully swing for the fences this offseason",
    "641": "@IcemanMAT_E_J @cavs @RMFieldHouse You should ask @CavsMoondog.",
    "642": "@BallySportsCLE @_bigjayy_ @cavs Love your 3 pointers!!!",
    "643": "@AbelFCano @EdGreenberger @cavs When evaluating a QB, to say previous years don’t matter is crazy.  Who would you like to replace Mayfield with?",
    "644": "@BraydenBallin At this point the Cleveland Cavaliers are playing very well in all phases of the game. They enjoy each other‘s company &amp; are growing as a team. They are winning games vs playoff caliber teams. Don’t see a reason for them to make a trade. Let it play out for now. Chemistry is good",
    "645": "@ChuckGobrowns @cavs I believe that we have to make a few moves to get more depth but it’s definitely a possibility",
    "646": "🚨🍺EPISODE 94🍺🚨\n\nThe guys are joined by the host of the @ChaseDownPod - @Cavsanada to talk about the PHENOMENAL start to the season for the @Cavs!\n\nListen NOW on the @BellyUpPodcasts Network: https://t.co/wpCnKPm0E4\n\nThank you and CHEERS! \n\n#LetEmKnow #Cavs #NBA https://t.co/4dMyJk7Egr",
    "647": "@FrankJJustice @cavs Nope. They exist. I interacted with some on Twitter back then. Small group, but they’re around.",
    "648": "@TheRealHuppOG @cavs I would say it’s possible",
    "649": "@dddaily5 @cavs Yes. You honestly don’t think there’s a group of OSU fans who hated him so much for the flag thing that they can’t root for him no matter what? Football fans are completely irrational about QBs.",
    "650": "Y’all think the @cavs can win a playoff series?",
    "651": "Kid Cudi x Cleveland Cavaliers Merch is out now!!!! I NEED https://t.co/1WATC1q8Wq",
    "652": "@TedTraut @JohnTelich8 @cavs @fox8news Haha. You’re about to get a lot of millennial hate",
    "653": "@EdGreenberger @cavs Does anyone honestly think of this anymore. I am not a huge buckeyes fan but I completely forgot about this happening. Weak take from this Ed guy. Almost like Baker put you up to it.",
    "654": "@cavs @SociosHoops To be wet is to be saturated in a liquid. Water itself can not be saturated meaning it can not be wet.",
    "655": "Day 2 of asking the @Cavs for a follow back",
    "656": "@cavs @SociosHoops The ultimate debate! Here we go again!",
    "657": "@JohnTelich8 @cavs @fox8news I just appreciate the 2 spaces after each sentence.  Old school.",
    "658": "I see you @cavs ! https://t.co/pce9l1hjpj",
    "659": "@ClutchRipz He also beat the greatest team of all time with the CLEVELAND CAVALIERS",
    "660": "Let me just say, I know the @Browns have tended to suck this season, but they are still better than Pittsburgh. \n\nC'mon @Cavs!",
    "661": "@ianmirmelstein @EdGreenberger @cavs I was born a Browns fan and am 37 years old thank you very much.",
    "662": "@AbelFCano @EdGreenberger @cavs Lol indeed kiddo!   Talk to me after you’ve experienced something like 1999-2018!",
    "663": "@EdGreenberger @cavs Pretty sure nobody cares about that.",
    "664": "@EdGreenberger @cavs Let's not get ahead of ourselves. (Looks at Ravens, Bengals, Steelers, Browns)",
    "665": "Wait, what? @cavs have the 3rd best chance to make the playoffs? https://t.co/gbcszHPUYu",
    "666": "@BallySportsCLE @_bigjayy_ @cavs This man broke the 4th wall while mic’d up. Legend @_bigjayy_",
    "667": "@_bigjayy_ The official gif of the Cleveland cavaliers front court https://t.co/KDmQrmezxk",
    "668": "@cavs @SociosHoops water is basically H2O. When something is wet, it becomes covered by H2O molecules. It's like asking if a coat is warm. A coat is not warm in itself, but warm when it covers something or someone",
    "669": "@ChiefWahoo22 @cavs @Slimdog @CamoAkaRambo @TLuvsBaseball @iamkrang @DirtDawg80 @dripordie_ @Cmd_Guap1 @miggy_roman @Shakabrodie @ElShaungo_ @BRKCP_ @mexi38 @Catoishere Man I haven’t bought a jersey in way too long.  Got a $150 voucher for one too.  This one is WILD, but I like it",
    "670": "@ItsAllCLE @AkronRubberDuck @cavs They were auctioned off the players backs. Not sold in the team shop",
    "671": "@kidcudi designed @cavs Jersey 🔥 👀 🔥 @ Rocket Mortgage FieldHouse https://t.co/wQd6Y93Qr4",
    "672": "@1BE4IGO @AkronRubberDuck @cavs I love them. And hate that they are sold out😂",
    "673": "@ItsAllCLE @AkronRubberDuck @cavs Earlier this past season.",
    "674": "@martincizmar @ZTH4789 @EdGreenberger @cavs So all of the other years he was here don’t count?  Keep moving the goalposts to suit your narrative.",
    "675": "@Farcmolkman @cavs Interesting that’s what you take away from this conversation.",
    "676": "@NBAMemes He ain't been the same since @cavs but NOTHING will take away from The Shot",
    "677": "@EdGreenberger @cavs In what world do you or people still belive baker is going to win a Super Bowl for this team ?",
    "678": "@AbelFCano @EdGreenberger @cavs He didn’t say “only”",
    "679": "@Slimdog @cavs @CamoAkaRambo @TLuvsBaseball @iamkrang @OspreysFB @DirtDawg80 @dripordie_ @Cmd_Guap1 @miggy_roman @Shakabrodie @ElShaungo_ @BRKCP_ @mexi38 @Catoishere Can’t take the Kid outta The Land! 👊🏼💢",
    "680": "Trade for Levert pleaseee @cavs",
    "681": "@BallySportsCLE @_bigjayy_ @cavs Culture Changer.  Love this kid!",
    "682": "LeBron James, who many people say is the greatest basketball player of all time, playing for the Lakers makes America seem like it’s getting kinda sloppy @cavs.",
    "683": "@tjones_05 Not everyone knows. Half the fans can't watch thanks to RSNs. Can't stream the gms. #LetEmWATCH @NBA @cavs",
    "684": "@EdGreenberger @cavs You are referring to football fans. Mayfield could take a dump on their front lawn if he could convert third and long. The bigger problem is he was picked first overall instead of a mid to late round pick which was warranted",
    "685": "@EdGreenberger @cavs I'm a  buckeye fan and i don't care about the flag . I'm more concerned why the Buckeyes wasn't  ready to beat Michigan's ass 2 weeks ago https://t.co/1UbEHlKafX",
    "686": "@EdGreenberger @GSpitzig @BuckeyeRP @woodrowsackman @Rye_Rye_Rocco_ @cavs @markburchett1 Hey @Jaysipher can you help us out here, if the Browns win a Super Bowl with Baker will you enjoy it?",
    "687": "@cavs @evanmobley @fuboTV (That could actually block shots)",
    "688": "@EdGreenberger @cavs I don't think they have to worry about Baker winning a SB.",
    "689": "@cavs @SociosHoops Water is without a doubt wet. Just because anything it touches or gets on then becomes wet, so it has the wet property itself. #watergang",
    "690": "@cavs @evanmobley @fuboTV Please, share the rookies this team has had since lebron 🤭",
    "691": "@ChiefWahoo22 @cavs @Slimdog @TLuvsBaseball @iamkrang @OspreysFB @DirtDawg80 @dripordie_ @Cmd_Guap1 @miggy_roman @Shakabrodie @ElShaungo_ @BRKCP_ @mexi38 @Catoishere That’s was quick! 🙌🏽🤣🤣 https://t.co/G3p9kkfu77"
}